{"offset":0,"number":50,"available":455,"news":[{"id":360055552,"title":"Democrat Rep Tells CNN That Labeling GOP ‘Fascist’ Or ‘Hitler’ Doesn’t Incite People","text":"Democrat New York Rep. Pat Ryan said Friday on CNN’s “The Arena” that he does not believe labeling Republicans as “fascist,” “Nazi” or “Hitler” contributes to the “overall problem” between the two parties.\n\nConcerns over political violence heightened Wednesday after Turning Point USA founder Charlie Kirk was murdered in front of a crowd of students in Utah. While discussing the assassination, CNN’s Kasie Hunt asked Ryan if he thought phrases like “Nazi” or “Hitler” used by people on the left against Republicans “contributes to the problem overall.” (RELATED: How Charlie Kirk’s Alleged Assassin Was Caught)\n\n“I actually don’t think it does,” Ryan said. “I think people are trying to grapple with a really unprecedented time in our country where we’re seeing maybe history not fully repeat, but history rhyme at some of the darkest times in our world’s history and struggling in good faith to try to put some intellectual thought into that and find the right language to describe the fact that the constitution I risked my life for 27 months in combat is being tested and pushed.”\n\n“And, in many cases, I think not being honored by this president, that’s hard to figure out how to, how to put word to that in a way that is constructive. So those are words that are more academic. I think it is the call for violence to me,” Ryan added. “That is where the calls for violence linked to that, that are, that are the problem, the idea that we’ve heard from many leaders in both parties, unfortunately, that there’s some deeper evil if you feel a certain way.”\n\nOn Wednesday, Kirk had been speaking and debating with students at Utah Valley University in Orem, Utah, as he was known to do. About 20 minutes into the event, a fatal shot struck him, and security rushed him to the hospital. While Kirk was initially in stable condition, the TPUSA founder ultimately succumbed to his injuries.\n\nDuring breaking news of Kirk being shot, some Democrats suggested he was at fault for his death because of his political beliefs, while others blamed President Donald Trump’s rhetoric and Republicans for a surge in political violence.\n\nSince last year, tensions between Republicans and Democrats have risen during the 2024 presidential election cycle, as corporate media and former Vice President Kamala Harris’ campaign escalated their rhetoric against Trump. The then-GOP presidential candidate was called a fascist by Harris, with former President Joe Biden saying he should be locked up.\n\nOn July 13, 2024, the first assassination attempt against Trump occurred in Butler, Pa. During the campaign rally, Trump was speaking to a crowd when 20-year-old shooter Thomas Matthew Crooks fired multiple rounds, grazing Trump’s ear and killing volunteer fire chief Corey Comperatore. Just months later, on Sept. 15, 2024, a second attempt against Trump was uncovered when Secret Service agents found would-be assassin Ryan Routh hiding in the bushes at Trump International Golf Club in West Palm Beach, Fla., with an AK-47-style rifle.\n\nIn June, Democratic Minnesota state Sen. Melissa Hortman and her husband were fatally shot at their home. Additionally, a self-proclaimed socialist who supported the Black Lives Matter movement set fire to Democratic Pennsylvania Gov. Josh Shapiro’s official residence.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'People are trying to grapple'","url":"https://dailycaller.com/2025/09/12/democrat-rep-pat-ryan-cnn-kasie-hunt-gop-names-hitler-doesnt/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-12-at-3.08.17 PM-e1757715761527.png","video":null,"publish_date":"2025-09-13 00:41:15","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.293},{"id":360048480,"title":"Who is Tyler Robinson, the suspect in Charlie Kirk's murder?","text":"Robinson, now 22, was arrested for aggravated murder and other charges. He has no criminal history, according to state records reviewed by Reuters.\n\nHe was a registered voter but was not affiliated with a political party, according to voter records. He is listed as an \"inactive\" voter, which indicates he did not cast a ballot in last year's presidential election, when Republican Donald Trump defeated Democrat Kamala Harris.\n\nAt the time of the shooting, Robinson was living at his parents' house in Washington, a farming and residential community of approximately 28,000 near Zion National Park in southwestern Utah.\n\nRobinson's grey Dodge Challenger - the vehicle that authorities say he drove to the site of the shooting on Tuesday - was parked on Friday outside the two-story stucco home, in a relatively new housing development built among alfalfa fields.\n\nDozens of media members were gathered outside, along with half a dozen police cars parked along the street. Officers were stopping reporters from approaching the home.\n\nA neighbour, Steven Green, said he knew the family from attending the same Mormon church down the street.\n\n\"Great family, good kids,\" he said, though he added he did not know Tyler Robinson well.\n\nCanaan Timothy, 21, said he was in the year below Robinson at high school. Robinson, he said, was just a regular student with an interest in music, who hung out with members of the school band.","summary":"Robinson, 22, had no criminal history. A schoolmate described him as \"just a regular student with an interest in music\", while a family member told investigators he had become more political in recent years.","url":"https://www.channelnewsasia.com/world/charlie-kirk-killing-who-tyler-robinson-suspect-5347116","image":"https://dam.mediacorp.sg/image/upload/s--F0fUMUS8--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-09-12T155931Z_1_LYNXNPEL8B0QK_RTROPTP_3_USA-SHOOTING-KIRK.JPG?itok=","video":null,"publish_date":"2025-09-12 21:49:00","author":null,"language":"en","source_country":"SG","sentiment":0.129},{"id":360043046,"title":"Who is Tyler Robinson, the suspect in Charlie Kirk's murder?","text":"Robinson, now 22, was arrested for aggravated murder and other charges. He has no criminal history, according to state records reviewed by Reuters.\n\nHe was a registered voter but was not affiliated with a political party, according to voter records. He is listed as an \"inactive\" voter, which indicates he did not cast a ballot in last year's presidential election, when Republican Donald Trump defeated Democrat Kamala Harris.\n\nAt the time of the shooting, Robinson was living at his parents' house in Washington, a farming and residential community of approximately 28,000 near Zion National Park in southwestern Utah.\n\nRobinson's grey Dodge Challenger - the vehicle that authorities say he drove to the site of the shooting on Tuesday - was parked on Friday outside the two-story stucco home, in a relatively new housing development built among alfalfa fields.\n\nDozens of media members were gathered outside, along with half a dozen police cars parked along the street. Officers were stopping reporters from approaching the home.\n\nA neighbour, Steven Green, said he knew the family from attending the same Mormon church down the street.\n\n\"Great family, good kids,\" he said, though he added he did not know Tyler Robinson well.\n\nCanaan Timothy, 21, said he was in the year below Robinson at high school. Robinson, he said, was just a regular student with an interest in music, who hung out with members of the school band.","summary":"","url":"https://www.channelnewsasia.com/world/who-tyler-robinson-suspect-in-charlie-kirks-murder-5347116","image":"https://dam.mediacorp.sg/image/upload/s--F0fUMUS8--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-09-12T155931Z_1_LYNXNPEL8B0QK_RTROPTP_3_USA-SHOOTING-KIRK.JPG?itok=","video":null,"publish_date":"2025-09-12 21:49:00","author":null,"language":"en","source_country":"sg","sentiment":0.129},{"id":360044980,"title":"‘It Was Wrong’: David Axelrod Calls Out Dems Over Major Policy Mistakes","text":"President Barack Obama’s former chief campaign strategist, David Axelrod, on “Fast Politics w/ Molly Jong-Fast,” rebuked the Democratic Party for its border and COVID-19 policy.\n\nThe Democratic Party’s favorability is only 33.3%, while its unfavorability is 60.5%, according to the RealClearPolling average. Axelrod argued on the podcast that the party appeared more focused on “vulnerable populations” than the issues many Americans face. (RELATED: DC Mayor Orders Local Cooperation With Federal Crime Crackdown)\n\n“It was insane to spend three years before you did something serious about the border,” Axelrod said. “Insane! And it was wrong not to be much more active in trying to reopen schools!”\n\n“I have great solicitude for vulnerable populations, but Democrats allowed themselves to be portrayed as caring more about vulnerable populations than understanding the vulnerabilities of large numbers of Americans,” he added. “So I think that the party itself has work to do.”\n\nFormer President Joe Biden did not sign an executive order to clamp down on the border until the final year of his presidency, after 6 million southern border encounters. He also claimed for months before signing it that there was no action he could take to mitigate the crisis.\n\nThe executive action halted new asylum requests once the number of migrants crossing into the U.S. reached a daily average of 2,500 over the span of a week.\n\nDemocratic Florida Rep. Jared Moskowitz acknowledged on “The Chuck ToddCast” Sept. 2 that the teachers union and partisanship played a role in his party not pushing to reopen schools during the pandemic.\n\n“I said to my Democratic colleagues, I’m like, ‘When we open schools, it’s going to be very popular. When you guys come out and tell parents you want to keep their kids in the house for another year, I’m telling you this is where this is going.’ And none of my colleagues wanted to hear it, Chuck,” he told host Chuck Todd.\n\nTodd asked if their refusal was due to “the power of the teachers union.”\n\n“It’s part teachers union,” Moskowitz said.\n\n“Part also, we were at a point of polarization that if [Republican Florida Gov.] Ron DeSantis wanted to open schools then I had to be against it … things had become so toxic at that point,” he added.\n\nExtended school closures and remote education during the pandemic had deleterious effects on students’ aptitude in key subjects like math and English.\n\nMoreover, framing former Vice President Kamala Harris and the Democratic Party as excessively far left on transgender issues was one of the most effective advertising campaigns in increasing support for President Donald Trump and GOP candidates down the ballot during the 2024 election, according to multiple reports.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'It was wrong'","url":"https://dailycaller.com/2025/09/12/it-was-wrong-david-axelrod-calls-out-dems-over-major-policy-mistakes/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-12-4.53.40-PM-e1757710516368.png","video":null,"publish_date":"2025-09-12 21:07:48","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.411},{"id":360028722,"title":"Scott Jennings Erupts, Says Dems Have ‘No Idea How To Debate’ After Charlie Kirk’s Assassin Caught","text":"Salem Radio Network host Scott Jennings tore into Democrats Friday after the capture of the alleged assassin of Turning Point USA (TPUSA) founder Charlie Kirk.\n\nTyler Robinson is accused of assassinating Kirk during a TPUSA “Prove Me Wrong” event at UVU on Wednesday, during which he was debating attendees. After playing a montage of prominent left-wing politicians and media personalities calling President Donald Trump a “fascist” on Friday’s episode of “The Scott Jennings Podcast,” Jennings turned his attention to Democrats, including Democratic Reps. Alexandria Ocasio-Cortez and Dan Goldman of New York, Jamie Raskin of Maryland and Eric Swalwell of California. (RELATED: ‘In A Bad Place’: Scott Jennings Questions If It Is ‘Safe To Be An Outspoken Conservative’)\n\n“[Former Vice President] Kamala Harris, AOC, Dan Goldman, various people on MSNBC, [Democratic Gov.] Tim Walz [of Minnesota,” Jennings said. “You know these people. Whatever could have given Tyler Robinson the idea that Charlie Kirk and conservatives are fascists who want to destroy the country?”\n\n“We may never know folks, we may never know,” Jennings added sarcastically.\n\nHarris escalated attacks on Trump in the closing weeks of the 2024 presidential campaign, devoting a major speech to attacking the former president as a threat to democracy and portraying him as “unstable” days after calling him a “fascist” during an Oct. 23 town hall on CNN, which was the first clip of the montage Jennings played. Others in the montage included MSNBC hosts Joy Reid and Rachel Maddow and left-wing legal analyst Elie Mystal.\n\n“For the last ten years, the American left, Democrats and, yes, I’m sorry to say, many people in the media have dedicated themselves to branding Republicans and conservatives as fascists, Nazis,” Jenning said. “The left normalized this language and the media platformed and endorsed it. The brand was created, the talking points went out as they say, and it is now an article of faith on the American left that if you have voted for Donald Trump or espoused conservative views, you’re a fascist, someone who wants to destroy the Constitution and our country.”\n\n“Every conservative view is met with, well, that’s hateful. Every conservative view is met with, well, that view is killing people,” Jennings said.\n\nPresident Donald Trump survived two attempts on his life during the 2024 presidential campaign, one during a July 13 rally in Butler, Pennsylvania, the other on September 15 while Trump was playing a round of golf in Florida. Trump also survived an assassination attempt during his successful 2016 campaign for President when a 20-year-old man from the United Kingdom tried to take a police officer’s gun to shoot Trump during a June 2016 campaign event in Las Vegas.\n\n“The left hated Charlie Kirk because they did not know how to debate him beyond simply calling him or any of us who do this for a living fascists, Nazis and hateful people, whose views cause death and therefore cannot be platformed or allowed,” Jennings said.\n\n“They have no idea how to debate, so they use these labels and they did so with no thought whatsoever given to the implications,” Jennings continued. “The killer of Charlie Kirk took the arguments made by Democrats on your televisions every night and wrote them on the bullets.” (RELATED: Susie Wiles Reveals What She Told White House Staff After Charlie Kirk Assassination)\n\nTPUSA events have been targets of violent protests in the past. The Dartmouth College chapter of TPUSA planned to host journalist Andy Ngo and Gabriel Nadales to discuss Antifa at a January 2022 event before the college converted it to a virtual event due to security concerns.\n\nThe TPUSA chapter at Lee’s Summit West High School planned to hold its first tabling event in May 2022, but left-wing students derailed the meeting, according to a release by the student group.\n\nRiley Gaines, a vocal critic of allowing biological males to compete in women’s sports, was assaulted during an April 6, 2023, event at San Francisco State University hosted by TPUSA.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'The left normalized this language'","url":"https://dailycaller.com/2025/09/12/scott-jennings-erupts-says-dems-have-no-idea-how-to-debate-after-charlie-kirks-assassin-caught/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/DCNF-Jennings-Kirk-Assassination-Democrats-Featured.jpg","video":null,"publish_date":"2025-09-12 20:37:00","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","source_country":"US","sentiment":-0.338},{"id":360038292,"title":"The Gender Gap Among America’s Richest Is Widening. Plus: Outsmart AI Bots","text":"This is this week’s ForbesWomen newsletter, which every Thursday brings news about the world’s top female entrepreneurs, leaders and investors straight to your inbox. Click here to get on the newsletter list!\n\nJoy101 founder and CEO Hoda Kotb and ForbesWomen editor Maggie McGrath\nJAMEL TOPPIN\n\nBe careful, but don’t be afraid. Use AI tools that are available to you—don’t run from what you may not immediately understand. Be conscious of the trends and movements growing around you when you’re building a company. And above all, trust your intuition.\n\nThese were just some of the gems of wisdom that dropped during the 2025 Forbes Power Women Summit yesterday—from cultural icons like Hoda Kotb and Bethann Hardison, tech titans like Kara Swisher and May Habib, and self-made billionaires Sara Blakely and Lucy Guo. Videos of all of these conversations will be rolling out on Forbes.com in the coming days and weeks, but for now, if you missed yesterday’s festivities, I encourage you to catch up on it all with this comprehensive live blog written by Forbes reporters Zoya Hasan and Alex York.\n\nNews was broken throughout the day, too: Melinda French Gates announced a $100 million partnership between Pivotal Ventures, the company she founded to accelerate social progress and expand women’s power, and Wellcome Leap, the breakthrough health organization led by Regina Dugan. Moira Forbes previewed a brand new Forbes list of the Most Powerful Women In Sports, coming October 22. And if you follow us on social media, you’ll know that I enlisted Hoda Kotb to help us announce that nominations for the 50 Over 50 Global list are now open! Head to this link right here to tell us about a woman who lives and works anywhere in the world other than the U.S. and who is creating her greatest professional impact after the age of 50.\n\nI would normally leave this note there, but because today marks the 24th anniversary of September 11th, I want to also share this story from Forbes contributor Rachel Burchfield, who spoke with three female journalists about what it was like to cover the tragedy on that fateful day in 2001. Darlene Rodriguez, a native New Yorker who is now the co-anchor of Today in New York on NBC 4 New York, was working the night shift for WNBC at the time, but jumped in her car to start reporting when she got the call about the first plane crashing into the World Trade Center’s North Tower.\n\n“It’s never really gotten away from any of us, really,” Rodriguez says. “We all learned a lot that day. You learn about what’s important, you learn about how people should be treated and what really matters.”\n\nMaggie McGrath\n\nExclusive Forbes List: The 10 Richest Women In America 2025\n\nMacKenzie Scott, Melinda French Gates, Alice Walton\nILLUSTRATION BY NEIL JAMIESON FOR FORBES\n\nThe Forbes 400 list of the richest Americans continues to be dominated by men, and this year—unlike in recent years—the gap is widening. There are just 62 women among the nation’s 400 wealthiest people, good for just 15.5% of the ranking. That’s down from 67 women last year, or about 17%. It’s the first time that women have failed to increase their presence on the list since 2019. The silver lining? Nearly three-quarters of the women who remain among the top 400 are richer than a year ago. In aggregate, these 62 super-rich women are worth $872 billion, up from $839 billion in 2024.\n\nICYMI: News Of The Week\n\nA new NBC News poll reveals that the gender divide between Gen Z men and women extends far beyond politics: there is a fundamental disagreement in how each cohort views a “successful” life. Gen Z women—especially those who supported Vice President Kamala Harris in the last election—place the highest value on fulfilling careers, financial flexibility, and emotional stability, while Gen Z men—disproportionately aligned with Donald Trump—place greater importance on marriage, children, and traditional family life.\n\nFormer German Foreign Minister Annalena Baerbock became the 80th president of the United Nations General Assembly on Tuesday. She is the fifth woman to serve in the post since it was created in 1946. “I am fully aware that peace and development can only be sustained when half of the world’s population, when women have an equal seat at the table,” she has said.\n\nAccording to a new report from Redfin, the Black homeownership rate fell to 43.9% in the second quarter of 2025, a decline that coincides with a rise in unemployment among Black women—and this may be “putting a double burden on Black households,” writes Forbes contributor and Redfin Chief Economist Daryl Fairweather.\n\nUnrivaled, the 3-on-3 women’s basketball league founded by WNBA stars Breanna Stewart and Napheesa Collier, has closed an oversubscribed Series B investment round led by Bessemer Venture Partners, the league announced. The deal values Unrivaled at $340 million, a record figure for a new professional sports league. (Editorial note: Forbes EVP Moira Forbes invested in an earlier round of funding for Unrivaled.)\n\nNew Mexico will become the first state in the nation to guarantee universal free childcare. The announcement from Governor Michelle Lujan Grisham, scheduled to take effect November 1, 2025, landed with both excitement and skepticism: For families, the prospect of saving an estimated $12,000 per child per year can feel life-changing. For policymakers, it raises questions about funding and whether other states can follow a similar path.\n\nThe Checklist\n\n1. Have your kids pay for college. Or at least, some of their tuition. While most parents want to give their kids every advantage, including a debt-free college education, research tells us that having kids contribute to college tuition builds confidence and offers lessons in financial literacy, responsibility, and work ethic.\n\n2. Figure out if your company needs a “bot-optimized website.” Are AI bots tanking the traffic coming to your website? ForbesWomen editor Maggie McGrath recently sat down with Webflow CEO Linda Tong to talk about this crucial issue and what business leaders can do to combat it.\n\n3. Use the “Great Lock-In” to refine your own goals. The latest viral trend on TikTok is not a dance or a meme. The “Great Lock In” is about spending September through December in hyperfocus mode, using the final months of the year to commit to self-improvement and ambitious career goals.\n\nThere are 500 U.S. billionaires whose net worth was not high enough to make the Forbes 400 this year. Which of the following billionaire women did not make the list?\n\nTaylor Swift\n\nKim Kardashian\n\nOprah Winfrey\n\nAll of the above\n\nCheck your answer.\n\nLiked what you read? Click here to get on the newsletter list!\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Welcome to this week’s ForbesWomen newsletter, which every Thursday brings news about the world’s top female entrepreneurs, leaders and investors straight to your inbox.","url":"https://www.forbes.com/sites/maggiemcgrath/2025/09/12/the-gender-gap-among-americas-richest-is-widening-plus-outsmart-ai-bots/","image":"https://imageio.forbes.com/specials-images/imageserve/68c480f92b2c3f5cd6d44567/0x0.jpg?format=jpg&crop=2160,1215,x0,y156,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-09-12 20:23:09","author":"Forbes Staff,Maggie McGrath,Regina Dugan. Moira","authors":["Forbes Staff","Maggie McGrath","Regina Dugan. Moira"],"language":"en","category":"politics","source_country":"US","sentiment":0.245},{"id":360041896,"title":"Timeline of America's political violence dating back to 2011","text":"Public officials from both sides of the aisle and law enforcement have been raising the alarm about political violence being on the rise in America, with public officials being increasingly targeted by violent attacks.\n\nOne of the most recent examples was Wednesday's fatal shooting of Charlie Kirk, the founder of the conservative youth activist organization Turning Point USA, during an event at Utah Valley University,\n\nA suspect has been arrested in Kirk's shooting, officials announced Friday.\n\nHere is a timeline of political violence in recent years.\n\nJan. 8, 2011-- 6 killed, 13 others including then-Rep. Gabrielle Giffords wounded in Tucson shooting\n\nSix people were killed and 13 others wounded, including then-Rep. Gabrielle Giffords, during a constituent meeting outside a grocery store in Tucson, Arizona.\n\nGiffords, a Democrat, was shot in the head at point-blank range, critically injuring her, before the shooter unleashed a spray of bullets. Giffords survived the shooting.\n\nThe shooter, Jared Lee Loughner, was described by police as mentally unstable. Giffords was the focus of the gunman's assault, authorities said.\n\nJune 14, 2017 -- Rep. Steve Scalise shot during congressional baseball game practice\n\nFour people were shot -- including then-House majority whip and Louisiana Republican Rep. Steve Scalise -- when a gunman opened fire on Republicans practicing for a congressional baseball game at Eugene Simpson Stadium Park in Alexandria, Virginia.\n\nScalise was rushed to a trauma center with fractured bones and internal organ damage. A Capitol Police Officer was among the three others shot.\n\nThe gunman was shot and killed at the scene after police returned fire.\n\nScalise has since recovered.\n\nOct. 8, 2020 -- 13 men arrested for plotting to kidnap Michigan Gov. Gretchen Whitmer\n\nThirteen members of a militia group were arrested and charged for planning to storm the Michigan statehouse, kidnap Gov. Gretchen Whitmer and start a civil war.\n\nUltimately, the state attorney general charged 20 state felonies against eight people alleged to have engaged in planning and training for an attack on the statehouse and a plan to kidnap lawmakers, including Whitmer.\n\nFive of the eight were convicted of crimes in support of the plot, according to the Michigan attorney general. Four other people were convicted of federal charges in relation to the plot.\n\nTwo of the militia members have since been sentenced to 19 years and 16 years in prison.\n\nJan. 6, 2021 -- January 6 attack on the US Capitol, pipe bombs at RNC and DNC\n\nA mob of pro-Trump protestors stormed the U.S. Capitol as lawmakers met to ratify the results of the 2020 election on Jan. 6, 2021.\n\nThe protestors stormed the Capitol and threatened the lives of elected officials, violently assaulting law enforcement officers.\n\nTwo pipe bombs were also placed outside the Democratic and Republican national headquarters the day before the riots.\n\nNearly 1,600 individuals faced charges associated with the Capitol attack, including 608 people who faced charges for assaulting, resisting or interfering with law enforcement, according to the U.S. Attorney's Office.\n\nOn his first day back in office in January 2025, President Donald Trump pardoned more than 1,500 people charged in connection with Jan. 6.\n\nAt least five people died during the attack and around 140 officers were injured during the riot, the Department of Justice said.\n\nFeb. 14, 2022 -- Kentucky mayoral candidate targeted in attempted shooting\n\nWhile running for office, Louisville Mayor Craig Greenberg was the target of an attempted shooting at his campaign headquarters. No one was injured in the incident.\n\nQuintez Brown walked into Greenberg’s campaign office and fired multiple shots at Greenberg while he was meeting with four staffers, according to the U.S. Attorney's Office for the Western District of Kentucky.\n\nStaffers closed and barricaded the door, and Brown was captured several blocks from the shooting, authorities said.\n\nOn Jan. 24, 2025, Brown was sentenced to over 17 years in federal prison for attempting to assassinate Greenberg.\n\n\"As part of his guilty plea, Brown admitted that he acted because Greenberg was running for mayor,\" the U.S. attorney's office said.\n\nOct. 28, 2022 -- Paul Pelosi attacked with hammer in his home\n\nFormer Democratic Speaker of the House Nancy Pelosi's husband, Paul Pelosi, was attacked with a hammer in their San Francisco home.\n\nDavid DePape was sentenced to life in prison without the possibility of parole in a state trial over the attack. He had broken into the Pelosi home seeking to hold the then-speaker hostage.\n\nA jury found DePape guilty of false imprisonment of an elder by violence of menace, residential burglary, threatening a family member of a public official, dissuading a witness by force or threat and aggravated kidnapping.\n\nIn a separate federal case in which DePape was convicted of seeking to hold Nancy Pelosi hostage, he was also sentenced to 30 years in prison.\n\nIn an October 2024 letter to a judge, Paul Pelosi detailed that he has continued physical and mental impacts including trouble balancing and headaches early every day.\n\nDec. 4, 2023 to Jan. 3, 2024 -- New Mexico state legislature candidate orchestrates shootings, murder for hire\n\nA New Mexico man who ran for the state legislature as a Republican and lost his bid is serving an 80 year prison sentence for allegedly orchestrating attacks at the homes of four Democratic lawmakers. No one was injured in his attempts.\n\nSolomon Peña is accused of paying four men to shoot at the residences of local Democratic officials. He allegedly paid the men in cash and sent them text messages with addresses for his alleged targets, according to prosecutors.\n\nHe was then taken into custody as detectives served search warrants at his apartment and at the home of two of the men he allegedly paid.\n\nThis came after a Bernalillo County Sheriff’s deputy stopped a vehicle about 4 miles away from state Sen. Linda Lopez's home just 40 minutes after the shooting. The driver, identified as Jose Trujillo, was arrested on an outstanding warrant.\n\nIn the vehicle which was registered to Peña, police said they found more than 800 fentanyl-laced pills and two firearms. Trujillo pleaded guilty and was sentenced to three years in prison.\n\nPeña orchestrated a \"politically motivated shooting spree\" and plotted \"to murder witnesses to obstruct justice,\" according to the U.S. Attorney's Office for the District of New Mexico.\n\n\"After his electoral defeat, Peña falsely claimed the election was rigged and began pressuring members of the Bernalillo County Board of Commissioners not to certify the results. When they refused, Peña recruited Jose Trujillo and Demetrio Trujillo to carry out a series of shootings at the homes of several public officials,\" prosecutors said in a statement.\n\nJune 13, 2024 -- 1st attempted assassination of Donald Trump\n\nThen-Republican presidential candidate Donald Trump was shot in the ear during a rally in Butler, Pennsylvania, after a gunman opened fire from the roof of a nearby building.\n\nOne rally spectator was killed and two others were critically injured during the shooting.\n\nTrump dropped to the ground when he was shot and was surrounded by agents before being hustled off the stage. Countersnipers on-site killed shooter Thomas Matthew Crooks.\n\nInvestigators have determined that he acted alone, but a motive for the attack has not been publicly disclosed.\n\nSept. 15, 2024 -- 2nd attempted assassination of Donald Trump\n\nTrump faced a second assassination attempt at the Trump International Gold Club in West Palm Beach, Florida.\n\nProsecutors said suspect Ryan Wesley Routh allegedly put together a plan, including purchasing a military-grade weapon, researching Trump's movements and using a dozen burner phones in an alleged attempt to kill Trump based on political grievances.\n\nRouth allegedly came within a few hundred yards of Trump before a Secret Service agent spotted his rifle poking out of a tree line. Authorities say Routh fled the scene but was later apprehended. Routh is currently on trial.\n\nOct. 6, 2024 -- Kamala Harris campaign office in Arizona shot at 3 times in a month\n\nAn office shared by then-Vice President Kamala Harris' presidential campaign and the Democratic Party in Tempe, Arizona, was damaged by gunfire three times in less than a month, according to police.\n\nThe three shootings occurred late at night and no one was injured in any of the shootings.\n\nA suspect was arrested on Oct. 24 in connection with the three shootings, facing multiple charges including unlawful discharge, shooting at a non-residential structure, terrorism and criminal damage.\n\nPolice said Jeffrey Michael Kelly was seen posting anti-Democratic signs in Ahwatukee, attaching baggies labeled \"biohazard\" containing white powdery substance to the signs. Now on trial, he could face up to life in prison if convicted.\n\n\"Threats, intimidation or violence toward political officials -- no matter what party they are a part of -- are completely unacceptable,\" Maricopa County Attorney Rachel Mitchell said during the press briefing.\n\nDec. 4, 2024 -- Murder of United Healthcare CEO Brian Thompson\n\nUnitedHealthcare CEO Brian Thompson died after being shot multiple times at point-blank range by a gunman outside a Manhattan hotel, according to police.\n\nThe shooter appeared to have been lying in wait at the hotel where he shot Thompson, authorities said.\n\nAlleged shooter Luigi Mangione was captured after a manhunt that lasted several days. \n\nInvestigators suspect that Mangione was frustrated with the healthcare system in the U.S. when he targeted Thompson, who was the CEO of the country's biggest insurance company.\n\nProsecutors have alleged that Mangione wanted to send a message about corporate greed. Mangione was likely motivated by his belief that health insurance companies were \"parasitic\" and believed unilateral action could be symbolic to others.\n\nApril 13, 2025 -- Arson at Pennsylvania Gov. Josh Shapiro's residence\n\nA mechanic who has expressed disdain for Democrats on social media was arrested for starting a fire at Democratic Pennsylvania Gov. Josh Shapiro's residence.\n\nShapiro and his family were at the residence at the time of the fire, but they were not injured and safely evacuated, according to police.\n\nCody Balmer allegedly broke a window with a hammer and then threw two home-made Molotov cocktails into the governor's mansion. Moments after he allegedly firebombed the Pennsylvania governor’s mansion, Cody Balmer called 911 and confessed.\n\nBalmer waived his initial hearing and is expected in court in October.\n\nMay 21, 2025 -- Killing of two Israeli embassy staffers in Washington, D.C.\n\nTwo Israeli embassy staffers were shot and killed while exiting an event at the Capital Jewish Museum in Washington, D.C.\n\nThe suspect shouted \"free, free Palestine\" after shooting Yaron Lischinsky, 30, and Sarah Lynn Milgrim, 26, according to FBI Director Kash Patel, who called the shooting an \"act of terror.\"\n\nThe suspect fired 21 times as the couple exited the venue, authorities said. Suspect Elias Rodriguez has been charged with two counts of murder and has pleaded not guilty. If convicted, he could face the death penalty.\n\nJune 1, 2025 -- 13 people injured in Colorado firebombing attack, 1 later dies\n\nA man threw Molotov cocktails during a pro-Israel demonstration in Boulder, Colorado, injuring 13, authorities said. One person later died of their injuries.\n\nSuspect Mohamed Soliman told police he wanted to \"kill all zionist people and wished they were all dead,\" according to state court documents. He has pleaded not guilty to federal hate crime charges.\n\nJune 14, 2025\n-- Minnesota lawmaker shootings\n\nA masked gunman disguised as a police officer shot and killed Minnesota state Rep. Melissa Hortman and her husband Mark in their home, Gov. Tim Walz said.\n\nBefore Hortman was shot, the gunman shot State Sen. John Hoffman and his wife Yvette multiple times at their home. Both lawmakers were Democrats.\n\nSuspect Vance Boelter had a list of possible targets and went to the homes of public officials to conduct violent attacks, FBI Director Kash Patel said. Boelter has pleaded not guilty.\n\nAug. 8, 2025 -- Shooting at CDC headquarters\n\nA police officer was killed when a gunman opened fire near the Centers for Disease Control and Prevention (CDC) headquarters and the Emory University campus in Atlanta, authorities said.\n\nSuspect Patrick Joseph White had blamed the COVID-19 vaccine for making him sick and depressed, according to law enforcement. He had increasingly focused on the vaccine as a source of his grievances, they noted. He was found dead after the shooting, officials said.\n\nCDC Director Susan Monarez told employees that the promotion of misinformation played a role in the deadly shooting. Monarez has since been ousted as director.\n\n\"The dangers of misinformation and its promulgation has now led to deadly consequences. I will work to restore trust in public health to those who have lost it- through science, evidence, and clarity of purpose,\" Monarez wrote.\n\nThe suspect died of a self-inflicted gunshot wound.\n\nSept. 10, 2025 -- Shooting of Charlie Kirk\n\nCharlie Kirk, the founder of the conservative youth activist organization Turning Point USA, was fatally shot during an event at Utah Valley University on Wednesday. President Donald Trump confirmed Kirk’s death on social media.\n\nTyler Robinson allegedly shot and killed Kirk on Wednesday, Utah Gov. Spencer Cox said at a press conference in Utah on Friday.\n\nRobinson, 22, has been booked into the Utah County Jail. Charging documents against Robinson are expected to be filed early next week, Cox said.","summary":"Public officials and law enforcement have been raising the alarm that political violence is on the rise in America.","url":"https://abcnews.go.com/Politics/charlie-kirk-shooting-timeline-recent-political-violence-america/story?id=125473910","image":"https://i.abcnewsfe.com/a/d5620c1a-cab8-4255-8003-b2daaaef4ea1/charlie-kirk-1-rt-gmh-250911_1757598366925_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-09-12 20:16:00","author":"Brittany Shepherd,Nadine El-Bawab","authors":["Brittany Shepherd","Nadine El-Bawab"],"language":"en","category":"politics","source_country":"us","sentiment":-0.195},{"id":360028716,"title":"‘Want An $800,000 Refund’: Dem Donors Hard Pass On Giving Money To Biden Library Effort","text":"Former President Joe Biden is struggling to raise money to build a presidential library as some past Democratic donors are refusing to dole out funds for the project, NBC News reported Friday.\n\nDonors listed a slew of reasons they were withholding their donations such as “distasteful” personal experiences with Biden’s inner circle, and “residual anger” over him initially deciding to seek a second term despite his health issues, according to the outlet. The former president has been reportedly having trouble gathering funds since 2024 — even before President Donald Trump was reelected to succeed him.\n\n“I don’t believe a library will ever be built unless it’s a bookmobile from the old days,” said John Morgan, a Florida-based personal injury lawyer and longtime Biden supporter, according to NBC News. “Couple [Biden’s age and medical issues] with the perception that [the party’s] woes rest with his decision to seek a second term and we have the Hindenburg heading straight towards us.”\n\n“I want an $800,000 refund,” Morgan added, in reference to the large amount of money he gave to support Biden’s reelection bid — which was eventually channeled into failed 2024 Democratic nominee Kamala Harris‘ campaign following Biden’s withdrawal.\n\nOne donor who requested anonymity to speak freely, told the outlet, “Me? No way.”\n\n“I’d like him [Biden] to have some nice library,” another donor said per NBC News. “I just don’t see that’s where I’m going to spend my money.”\n\nSusie Buell, another Democratic donor, said, “No one has asked, but I am not inclined to give to libraries,” NBC News reported.\n\nThe project is estimated to cost between $200 million and $300 million, according to the outlet, which is significantly less than former President Barack Obama’s $850 million Presidential Library slated to open in Chicago in the spring.\n\nChris Korge, fundraising chair for the Democratic National Committee (DNC), said he pushed Biden’s team to table reelection ambitions and focus on funding a library instead, NBC News reported.\n\nEven if Biden had begun requesting donations sooner, it’s unclear if fundraising would have been successful. Donors have complained they lacked access to him while he was in office despite being asked frequently to make donations, per the outlet. They have blamed Biden’s inner circle for isolating him to hide his mental decline, and therefore hesitating to hold any kind of fundraising events at the White House.\n\nAnother prominent donor said Biden has kept his circle of donors small, as he “was not good at making his donors feel appreciated,” according to NBC News. The donor detailed how Biden’s approach to donors, along with obstacles like his age and mental ability, would cloud the path ahead.\n\n“I don’t think ‘hill’ is the proper term,” he said. “It’s going to be much steeper than that.”\n\nA donor who has been involved in Biden fundraising in the past highlighted recently published works exposing Biden’s mental decline and rehashing the Democrats’ failed 2024 presidential campaigns, claiming they are dragging the party down when they need to be moving forward.\n\n“Democrats need to pick themselves up and start doing and stop whining and complaining about what happened,” the person told the outlet. “Joe Biden has been a public servant to this country on the world stage for decades, we owe him a huge debt of gratitude.”\n\n“The ending was not pretty, we all know that,” the person added. “But the country and he deserves a foundation and library museum.”\n\nRufus Gifford, finance director for former President Barack Obama and fundraiser for Biden’s re-election campaign, was named chairman of the library board. He believes donors will eventually chip in to push the project forward.\n\n“Those of us who have been around for a while and love the guy but also understand the full picture want to see what we can do to protect and promote his legacy,” Gifford said. “This isn’t about the past. It’s about the future.”\n\nThe Bidens did not immediately respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"Former President Joe Biden is struggling to raise money to build a presidential library as some past Democratic donors are refusing to dole out funds for the project, NBC News reported Friday. Donors listed a slew of reasons they were withholding their donations such as &#8220;distasteful&#8221; personal experiences with Biden&#8217;s inner circle, and &#8220;residual anger&#8221; [&#8230;]","url":"https://dailycaller.com/2025/09/12/democratic-donors-biden-presidential-library/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2193654168-e1757695204100.jpg","video":null,"publish_date":"2025-09-12 20:06:16","author":"Andi Shae Napier","authors":["Andi Shae Napier"],"language":"en","category":"politics","source_country":"US","sentiment":-0.277},{"id":360030820,"title":"‘The View’ Tells Biden Team to ‘Say It With Your Full Chest’ After Releasing Nameless Kamala Harris Jabs | Video","text":"“The View” had a few words for the Joe Biden administration on Friday after they released a nameless clap back at former Vice President Kamala Harris, who critiqued the former president and his team in her new book, “107 Days.”\n\n“Say it with your full chest if you’re going to say it,” co-host Sunny Hostin said as Alyssa Farah Griffin called out Biden’s camp for responding to Harris without including names.\n\n“The one gripe that I had— I always am frustrated when people don’t put their names to quotes,” Farah Griffin said. “To Kamala Harris’ team’s credit, when they’re clapping back — everything I’ve seen — they’re saying it under their name. They’re saying it in their own words.”\n\nShe went on to list some of the “blind quotes” with no identity attached to them.\n\n“One today from a ‘Biden aide,’ but not with their name attached: ‘VP Harris was simply not good at the job. She had basically zero substantive role in any of the administration’s key work streams. She would just dive-bomb into photo ops and expose how out of depth she was.’”\n\n“That’s ugly,” Hostin chimed in. \n\n“To say that about the first female vice president, the sitting vice president that you served under. When you serve in the White House, you serve both the president and the vice president, is extraordinarily disrespectful as far as I’m concerned. And if you’re going to say it, put your name to it.”\n\nFarah Griffin went on to explain the areas in which Harris pulled her weight as Biden’s veep. “I have a feeling if you read the book and you hear more from her, that she actually did have quite a substantive role in the administration,” she said.\n\nAfter co-host Ana Navarro warned the Biden administration to watch their words, noting that the nasty remarks will only reflect him in a poor light given the fact that Biden “picked her twice” as his VP, Hostin jumped in to highlight one person who did name themselves in their comments about Harris.\n\n“Ron Klain, who was Biden’s chief of staff, did put his name to something and he said, ‘I thought she did a good job as vice president. I feel badly that she found the experience negative,’ and then he said, ‘I don’t think we — meaning the Biden administration — ‘did a good job enough job of selling her.’ He put his name to that.”","summary":"\"If you're going to say it, put your name to it,\" co-host Alyssa Farah Griffin asserts\n\n\nThe post &#8216;The View&#8217; Tells Biden Team to &#8216;Say It With Your Full Chest&#8217; After Releasing Nameless Kamala Harris Jabs | Video appeared first on TheWrap.","url":"https://www.thewrap.com/the-view-joe-biden-nameless-kamala-harris-jabs/","image":"https://www.thewrap.com/wp-content/uploads/2025/09/rump-1-4.jpg","video":null,"publish_date":"2025-09-12 19:52:21","author":"Raquel 'Rocky' Harris","authors":["Raquel 'Rocky' Harris"],"language":"en","source_country":"US","sentiment":-0.325},{"id":360024650,"title":"Who is Tyler Robinson, the suspect in Charlie Kirk’s murder?","text":"The suspect in Charlie Kirk‘s shooting, Tyler Robinson, is a 22-year-old Utah native who authorities say had allegedly criticized the conservative influencer in a recent conversation and was living with his family at the time of the shooting.\n\nRobinson was arrested late on Thursday after a family friend called authorities, officials said on Friday.\n\nInvestigators have not publicly identified a motive. Utah Governor Spencer Cox told reporters that a family member interviewed by law enforcement said Robinson had recently mentioned Kirk’s appearance at Utah Valley University, where he was shot on Tuesday.\n\n“They talked about why they didn’t like him and the viewpoints he had,” Cox said.\n\nRobinson had also become more political in recent years, the family member told investigators, and authorities said he had engraved what appeared to be anti-fascist messages on bullet casings they found with the suspected murder weapon.\n\nRobinson, who was arrested for aggravated murder and other charges, has no criminal history, according to state records reviewed by Reuters. He was a registered voter but was not affiliated with a political party, according to voter records. He is listed as an “inactive” voter, which indicates he did not cast a ballot in last year’s presidential election, when Republican Donald Trump defeated Democrat Kamala Harris.\n\nRobinson graduated in 2021 from Pine View High School in St. George, Utah. A video online of the commencement ceremony shows him carrying his diploma on stage as attendees cheer.\n\nHe briefly attended Utah State University in Logan for one semester that fall, the school confirmed to Reuters. It was not immediately clear why he left the college.\n\nIn a video posted by his mother on Facebook, Robinson can be seen reading aloud from a letter offering him a four-year scholarship from Utah State University, as she cheered. Another post said Robinson had earned a score of 34 on the ACT college entrance exam, which would put him in the top 1% of test takers, according to the Princeton Review test preparation company.\n\nAt the time of his arrest, he was living at his family’s home in Washington County, in the southwest corner of Utah near the Nevada border, Cox said.\n\nHe has two younger brothers, according to his parents’ Facebook posts. His mother is a social worker at a non-profit healthcare company, while his father’s occupation was not immediately clear.\n\nFACEBOOK POSTS SHOW DOTING MOTHER\n\nHis mother’s Facebook posts over the years – most of which were deleted on Friday – mostly doted on her family: documenting trips to Alaska, the Caribbean and Disneyland; celebrating school plays, Halloween costumes and adopted pet rabbits; expressing pride as the three boys moved up in school. None of the posts appeared political in any way.\n\nOther posts show Robinson and his brothers occasionally with guns, though that is not uncommon in a state with permissive firearms laws.\n\n“Driving away without him was one of the most difficult things I’ve had to do in a long time,” his mother wrote in one post about helping him move to college in 2021. “He’s so excited to start his journey and it’s going to be so amazing for him!”","summary":"Robinson was arrested late on Thursday after a family friend called authorities.","url":"https://www.sabcnews.com/sabcnews/who-is-tyler-robinson-the-suspect-in-charlie-kirks-murder/","image":"https://www.sabcnews.com/sabcnews/wp-content/uploads/2025/09/Untitled-24.png","video":null,"publish_date":"2025-09-12 19:25:07","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"za","sentiment":0.289},{"id":360007900,"title":"After Charlie Kirk Assassination, Jasmine Crockett Falsely Claims Both Attempted Trump Assassins Were Republicans","text":"Days after the assassination of Turning Point USA founder Charlie Kirk, Democratic Texas Rep. Jasmine Crockett inaccurately claimed on “The Breakfast Club” that both men who allegedly attempted to assassinate President Donald Trump were Republicans.\n\nAlleged attempted Trump assassin Ryan Routh, who is currently on trial, seems to be registered as an unaffiliated voter and reportedly voted in the Democratic primary in March 2024. Crockett claimed during a Friday appearance on the radio show that neither alleged assassin had voted for Democrats. (RELATED: Trump Shooter’s School Issues Statement To Correct Reporting)\n\n“[I]t looks like the two people that went after the president before he was the president had ties to the Republican Party. Like, they had not voted Democratic,” Crockett said. “They were registered as Republicans. Like, so let’s talk about it.”\n\nRouth also seems to have previously contributed to Democrats while living in Hawaii, according to federal campaign finance records.\n\nMoreover, one of Routh’s social media posts mirrored Vice President Kamala Harris and President Joe Biden’s repeated assertion that “democracy is on the ballot” during the 2024 election, according to reports.\n\nDeceased attempted Trump assassin Thomas Matthew Crooks donated $15 to the Progressive Turnout Project through the ActBlue donation platform in January 2021, when Biden was inaugurated, according to campaign finance records. However, he was a registered Republican, a voter-registration record reveals, according to The New York Times.\n\nLittle is still known about Crooks, who was killed after attempting to assassinate Trump during a Butler, Pennsylvania rally on July 13, 2024.\n\nCrockett in May also smeared Republicans as fundamentally “violent” on “American Fever Dream,” while dismissing left-wing extremism.\n\n“They try to act like, ‘Oh, political violence, it’s the Democrats and it’s the liberals,’ and it’s like, actually, actually, actually — I mean, I’m not gon’ say that like a left-leaning person cannot be violent, ’cause that would be like crazy to say that somebody can’t be,” Crockett said. “But baby, baby, y’all got the white supremacists galore, okay? Like all of ’em. You got the Proud Boys, you got the neo-Nazis, you have people that literally should be classified as domestic terrorists, because a lot of times that is what they are doing — they’re engaging in domestic terrorism.”\n\n“And guess what? They all align with your side, including the KKK. So like, I mean, this is who aligns with that. So like, inherently in like who you are, y’all are violent. And most of your violence has to do with people that’s got a little bit of melanin. But nevertheless, like, y’all are a violent group,” she continued. “Like, you attract violent actors. And like, I’m sorry, I know they tried to make Black Lives Matter out to be the most violent — ‘Oh, what about Black Lives Matter?’ No, no, no. So that’s the thing — like, they try to pretend like that.”\n\nKirk was assassinated on Wednesday while speaking to a large crowd of students at Utah Valley University (UVU). Authorities found anti-fascist messages inscribed on the ammunition from the rifle they recovered near the assassination, according to Republican Utah Gov. Spencer Cox at a Friday press conference.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Ties to the Republican party'","url":"https://dailycaller.com/2025/09/12/jasmine-crockett-trump-assassins-republicans-charlie-kirk/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-12-2.26.45-PM-e1757701854984.png","video":null,"publish_date":"2025-09-12 18:50:36","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.383},{"id":360004044,"title":"The martyrdom of Kamala Harris","text":"Some cynical pundits have pointed out that the book, like most political tomes, was likely written by a “slyly funny” ghostwriter. Well, whoever wrote it certainly captured the essence of Harris. Indeed, I don’t love her prose because I’m a reader or a writer, but despite those things.\n\nPOLITICAL VIOLENCE ON THE RISE IN THE US: A TIMELINE OF KEY INCIDENTS\n\nHere, for instance, Harris is relaying the reaction to a speech she delivered in Indianapolis to a group of black sorority women on restoring Roe v. Wade:\n\n“‘When I am president—'”\n\nA roar erupted that drowned out the rest of that sentence.\n\n“That roar told me they could see it. Clearly, for the first time. This could be, and it should be. It was not because of gender or because of race, but despite those things.”\n\nThis is beautiful, swirling, self-aggrandizing gibberish. At some point in her life, Harris convinced herself that earnestly and dramatically unfurling tautologies makes her sound like Martin Luther King Jr.\n\nDoes anyone believe that hundreds of educated black women had just realized that Harris, who had been installed as the presidential candidate by the ruling party, who had entire institutions like mass media mobilized for her cause, may end up in the White House? \n\nThe problem with the excerpt isn’t the writing; it’s the martyrdom complex. She portrays herself as a victim of her party and circumstance — and, of course, misogyny. But even the expert offers numerous clues that the candidate was unprincipled and in way over her head. \n\nHarris props herself up as a straight-shooting, righteous team player. Yet, she also admits to abdicating one of the basic duties she had to the nation. She maintains it would have been unseemly for her to tell a mentally incapacitated president that it was irresponsible to seek another term, arguing that “it would come off to him as incredibly self-serving if I advised him not to run. He would see it as naked ambition, perhaps as poisonous disloyalty, even if my only message was: Don’t let the other guy win.”\n\nEven in this version of the event, Harris is obviously self-serving. The only reason for her to speak, she says, was that she was the preferred presidential candidate, not that it was negligent to allow a man in obvious cognitive decline to continue to make decisions for 350 million Americans. This man’s condition, not incidentally, was being hidden from the people by his handlers, journalists, and the vice president. \n\nThere was little evidence, of course, that Harris would outperform former President Joe Biden. And if her “only message” was that beating President Donald Trump entailed the only means of preserving democracy, why, when she had the chance, did she not insist on an open primary to ensure the best candidate ran? \n\nPerhaps elsewhere in the book, Kamala will explain why she felt such deep loyalty to a group of people she accuses of undermining her personally. Harris notes that the White House rarely bothered defending or brandishing her impressive résumé to deflect from the slew of attacks she endured. Harris, for example, grouses over the Biden administration’s refusal to shield her from Fox News attacks, which picked on her “tone of voice,” laugh, her previous dating life, and accused her of being a “[diversity, equity, and inclusion] hire.” \n\nWell, her grievance about being tagged a DEI hire is a tacit admission that race- and sex-based hiring practices degrade a person’s accomplishments and career. But how could Biden defend her from a charge that was true? In 2019, candidate Biden promised he was looking to pick someone “of color and-or a different gender” as his running mate. During the 2024 campaign, he said “diversity, equality, inclusion are literally — and this is not kidding — the core strength of America,” adding that it starts at the “top” of his administration with the vice president. There is no record of Harris objecting to this framing — quite the opposite. \n\nAn anonymous former Biden official recently told Axios that Harris “had basically zero substantive role in any of the administration’s key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was.” \n\nIt reflects quite poorly on the president that he chose to install such an incompetent person only one heartbeat away from the most powerful job on the planet. But even when the White House did give her face time, Harris shirked her responsibilities.\n\n“When Republicans mischaracterized my role as ‘border czar,’ no one in the White House [communications] team helped me to effectively push back and explain what I had really been tasked to do, nor to highlight any of the progress I had achieved,” she says. Instead she “shouldered the blame for the porous border, an issue that had proved intractable for Democratic and Republican administrations alike.”\n\nHarris both understates and overstates reality. No one ever expected the vice president to achieve much of anything on the border, and Harris, as always, rose to the occasion. Conservative commentary mocked the notion that the then-vice president had either the power, aptitude, or desire to mitigate illegal immigration. They were right. Harris, after all, still calls the border problem “intractable,” despite the Trump administration’s significant cut of illegal crossings in only a few months. \n\nHarris is correct to note that Biden had only tasked her with the meaningless job of figuring out the “underlying causes” of the migrant crisis. Why would millions pick up and move from historically corrupt, poverty-stricken Banana Republics to the United States? You know, I have a few guesses! Harris’s answer was climate change. \n\nHard to believe she lost the election, right? \n\nIs it true that Harris could never find her voice working in the Biden administration? Perhaps. Then again, one could argue that the more voters were exposed to the vice president, the less popular she became. Indeed, when she was handed the nomination, Harris was notoriously cautious about giving interviews, unless they were tightly curated. The New York Times even felt compelled to caution its readers that, though Harris was very talented, extemporaneous speaking was not “one of her strengths.” \n\nWhich is why her handlers hid the candidate from any authentic interactions. Harris could have appeared on Joe Rogan’s podcast and spoken unfiltered for three hours. That would have been a perfect platform to debunk GOP talking points and make right the alleged injustices of the Biden era. She could even have separated herself on policy issues from the unpopular president. \n\nDAVID HARSANYI: CHARLIE KIRK EPITOMIZED THE BEST OF OUR CIVIC TRADITION\n\nFar from “blunt, knowing, fervent, occasionally profane, slyly funny,” Harris could barely make cogent policy arguments, often wandering off into platitudinous verbal dead ends, perhaps because she staked her claim on identity rather than ideas. In many ways, she embodies the vacuousness of an establishment Democratic Party that’s lost both direction and energy after losing to Trump again. A yawning emptiness is bound to be filled. Which is one reason the far Left is ascendant. Say what you will about socialism, at least it’s an ethos. \n\nOr as Harris might say, “You exist in the context of all in which you live and what came before you.”","summary":"In Focus delivers deeper coverage of the political, cultural, and ideological issues shaping America. Published daily by senior writers and experts, these in-depth pieces go beyond the headlines to give readers the full picture. You can find our full list of In Focus pieces&#160;here. Jeffrey Goldberg promises that former Vice President Kamala Harris&#8217;s forthcoming book [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3805442/martyrdom-kamala-harris/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/kamala-harris-lapd-protection-gone.jpg?w=696","video":null,"publish_date":"2025-09-12 18:00:00","author":"David Harsanyi","authors":["David Harsanyi"],"language":"en","category":"sports","source_country":"US","sentiment":-0.36},{"id":359995686,"title":"Biden aides blast Harris book excerpts, adding VP 'was simply not good at the job': report","text":"Former aides to former President Joe Biden reportedly fumed at excerpts from former Vice President Kamala Harris’ upcoming book Thursday after she claimed she rarely received support from the president. Axios national political correspondent Alex Thompson report that Biden aides \"reacted with rage\" after excerpts of Harris’ book \"107 Days,\" which documents her failed 2024 presidential bid, were released Wednesday. In the excerpts, Harris wrote that Biden’s team rarely, if ever, defended her from negative press. HARRIS ADMITS BIDEN 'GOT TIRED,' DENIES 'CONSPIRACY' TO HIDE MENTAL DECLINE \"They had a huge comms team; they had Karine Jean-Pierre briefing in the pressroom every day. But getting anything positive said about my work or any defense against untrue attacks was almost impossible,\" Harris wrote. Several Biden aides told Axios that Harris was trying to scapegoat Biden instead of reflecting on her own failures as vice president. \"Vice President Harris was simply not good at the job,\" a former Biden White House official said. \"She had basically zero substantive role in any of the administration's key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was.\" HARRIS ADMITS SILENCE ON BIDEN'S 2024 RE-ELECTION BID WAS 'RECKLESSNESS' Another aide expressed anger at Harris’ suggestion that she should have urged Biden to step down earlier. \"I'm not sure the very robust defense of not having the courage to speak up in the moment about Biden running is quite as persuasive as she thinks it is. If this is her attempt at political absolution: Lots of luck in your senior year,\" the aide said. The same aide also disputed Harris’ claim that Biden’s team tried to drag her down by assigning her to handle \"irregular immigration\" as a so-called \"border czar.\" \"On the border stuff in particular, I'd also say if she had spent a fraction of the time and energy doing the work that she did on complaining, about how she was perceived, she would have been perceived a whole lot better,\" the aide said. BIDEN TEAM IS READY TO DROP DIRT ON HARRIS IF SHE COMES AFTER HIM, MARK HALPERIN SAYS Some aides offered kinder words for the former vice president. Former Biden Chief of Staff Ron Klain told him that Harris did a \"good job\" as vice president. Another aide expressed relief that Harris could finally express herself. \"We all know that the Biden folks treated her and her team like s---. We never thought she would actually say anything,\" the former Biden aide said. \"The staffers across a range of ages and positions that I'm talking to are proud of her.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to representatives for Biden and Harris for comment but did not immediately receive a response.","summary":"Axios correspondent Alex Thompson reported members of former President Biden’s team were furious at the excerpts of former Vice President Kamala Harris’ new book.","url":"https://www.foxnews.com/media/biden-aides-blast-harris-book-excerpts-adding-vp-was-simply-not-good-job-report","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Biden-Harris.jpg","video":"https://www.foxnews.com/video/6379059410112","publish_date":"2025-09-12 17:48:14","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"us","sentiment":-0.11},{"id":359990858,"title":"Biden aides launch brutal counterattack on Kamala Harris book: 'We're not going back'","text":"Aides to former President Joe Biden are mocking former Vice President Kamala Harris after she revealed she had serious concerns about his decision to run for reelection.\n\nOne former Biden White House official told Axios that Harris was 'simply not good at the job.'\n\n'She had basically zero substantive role in any of the administration's key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was,' the official noted.\n\nOne ex-official said that Harris could not blame Biden for losing her 2024 campaign, despite her claim that 107 days was not enough time to run a successful campaign.\n\n'The independent variable there is the vice president, not Biden or his aides,' the aide said.\n\nHarris revealed in her book that she was 'in the worst position' to tell Biden that he should have dropped out of the race.\n\nShe delivered her thoughts in her new book 107 Days, which goes on sale on September 23. An extract from the book has appeared in the The Atlantic. \n\n'During all those months of growing panic, should I have told Joe to consider not running? Perhaps,' Harris admits. 'Of all the people in the White House, I was in the worst position to make the case that he should drop out. I knew it would come off to him as incredibly self-serving if I advised him not to run. He would see it as naked ambition, perhaps as poisonous disloyalty.' \n\nBut another Biden official ridiculed Harris for her assertion.\n\n'I'm not sure the very robust defense of not having the courage to speak up in the moment about Biden running is quite as persuasive as she thinks it is,' the official noted.\n\nAnother former Biden White House official disputed Harris' claim that his team did not sufficiently support her.\n\nThe official said there werre several officials who 'really tried to help her thrive.'\n\n'But she and her team did not seize that support and make the most of it. It is all a tragedy,' the official said.\n\n Perhaps the most slashing response came from a Biden aide who reprised Harris' 2024 campaign slogan to assess her chances in 2028: \n\n'We're not going back,' the former Biden official said.","summary":"Aides for former President Joe Biden are mocking former Vice President Kamala Harris after she revealed she had serious concerns about his decision to run for reelection.","url":"https://www.dailymail.co.uk/news/article-15092483/joe-biden-aides-kamala-harris.html","image":"https://i.dailymail.co.uk/1s/2025/09/12/15/102003625-0-image-a-7_1757685855636.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/08/4038152841369597255/1024x576_MP4_4038152841369597255.mp4","publish_date":"2025-09-12 17:44:28","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":-0.348},{"id":360009066,"title":"Nolte: New York Times’ Rush to Smear Charlie Kirk Results in Humiliating Correction","text":"The far-left New York Times rushed to smear the late Charlie Kirk as an anti-Semite, an act that has now resulted in a humiliating correction from the far-left hate-outlet.\n\nThe original smear job was published on September 11, 2025. Later, the Times was forced to admit it put antisemitic words in Kirk’s mouth that came from someone else, something he denounced…\n\nA correction was made on Sept. 11, 2025: An earlier version of this article described incorrectly an antisemitic statement that Charlie Kirk had made on an episode of his podcast. He was quoting a statement from a post on social media and went on to critique it. It was not his own statement. [bold and italics original]\n\nHere are the lies (in my bold) the Times published that are now deleted:\n\nMr. Kirk supported Mr. Trump’s campaign against immigration, endorsing the so-called Great Replacement Theory, which claims that immigrants will soon displace white Americans. The unsubstantiated theory also claims that Jews are orchestrating the dilution of white power by allegedly encouraging mass immigration.\n“Jewish communities have been pushing the exact kind of hatred against whites that they claim to want people to stop using against them,” he said on his podcast, “The Charlie Kirk Show,” in 2023.\n\nFor anyone still stupid enough to suggest this was some sort of mistake—no, it wasn’t.\n\nHonest mistakes are not partisan. One side of the political aisle is not the serial victim of “honest mistakes.”\n\nThese “honest mistakes” only ever afflict the right side of the political spectrum over at the Times, which tells us this: These are not honest mistakes. These are deliberate smears published by an extremist outlet hoping no one will notice, as it panders to the extremist customer base that is its only remaining life source.\n\nThe New York Times regularly and gleefully traffics in blood libels against its enemies on the political right. This is their business plan. This is who they are. They hate us, and no more will we give this behavior the benefit of the doubt. This is nothing more or less than the Times sending a dog whistle to the left’s demonic assassination culture.\n\nWhen the Times and other regime media outlets spend a decade engaging in this…\n\nPhoto of Starving Gaza Baby Hoax\nIsraeli Troops Murdered Food-Seeking Palestinians Hoax\nTrump Tariffs Will Explode Prices Hoax\nMaryland Man Hoax\nBlack Newborns Much More Likely to Die If Doc’s White Hoax\nElon Musk Nazi Salute Hoax\nMass Hysterectomies Performed on Immigrants Hoax\nThe All-White Trump Party Hoax\nSpringfield Bomb Threat Hoax\nTrump Called for Liz Cheney to Be Executed Hoax\nViolent Crime Down Under Biden/Harris Hoax\nArlington Cemetery Hoax\nKamala Was Never America’s Border Czar Hoax\nRussia Collusion Hoax\nHands Up, Don’t Shoot Hoax\nJussie Smollett Hoax\nCovington KKKids Hoax\nVery Fine People Hoax\nSeven-Hour Gap Hoax\nRussian Bounties Hoax\nTrump Trashes Troops Hoax\nPolicemen Killed at Mostly Peaceful January 6 Protest Hoax\nRittenhouse Hoax\nEating While Black Hoax\nBorder Agents Whipping Illegals Hoax\nNASCAR Noose Hoax\nGeorgia Jim Crow 2.0 Hoax\nTrump Assaulted Secret Service Agents and Grabbed Steering Wheel of Beast Hoax\nMAGA Assaulted Paul Pelosi Hoax\nCOVID Lab Leak Theory Is Racist Hoax\nHunter Biden’s Laptop Is Russian Disinformation Hoax\nJoe Biden Will Never Ban Gas Stoves Hoax\nCOVID Deaths are Overcounted Is a Conspiracy Theory Hoax\nMass Graves of Native Children in Canada Hoax\nTrump Killed Japanese Koi Fish Hoax\nTrump Told People to Drink Bleach Hoax\nHamas Hospital Hoax\nIf Reelected, Trump Will Execute People Hoax\nThe 900,000 Kids Hospitalized with Coronavirus Hoax\nDozens of Environmental Hoaxes\nThe Alfa Bank Hoax\nLibs of TikTok Murdered Non-Binary Teen Hoax\nAaron Rodgers Sandy Hook-Truther Hoax\n‘Bloodbath’ Hoax\nBiden ‘Sharp-as-a-Tack’ Hoax\nIowa Poll Hoax\n\n…only a crazy person would chalk that up to an honest mistake.\n\nThey want us dead.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"The far-left New York Times rushed to smear the late Charlie Kirk as an anti-Semite, an act that has now resulted in a humiliating correction from the far-left hate-outlet.\n\n\nThe post Nolte: New York Times’ Rush to Smear Charlie Kirk Results in Humiliating Correction appeared first on Breitbart.","url":"https://www.breitbart.com/the-media/2025/09/12/nolte-new-york-times-rush-smear-charlie-kirk-results-humiliating-correction/","image":"https://media.breitbart.com/media/2025/09/the-New-York-Times-640x335.jpg","video":null,"publish_date":"2025-09-12 17:26:15","author":"John Nolte","authors":["John Nolte"],"language":"en","category":"politics","source_country":"US","sentiment":-0.457},{"id":359986648,"title":"Jean-Pierre Faces House Panel’s Scrutiny on Biden Incapacity, Autopen","text":"After defending former President Joe Biden’s mental fitness for more than two years, former White House press secretary Karine Jean-Pierre went before a House committee to answer questions Friday morning. \n\nThe House Oversight and Government Reform Committee is investigating the use of Biden’s White House autopen, and whether Biden was aware of presidential actions staff took on his behalf, such as executive orders and clemencies. \n\nHouse Oversight Chairman Rep. James Comer, R-Ky., noted that Jean-Pierre has a forthcoming book, as does former Vice President Kamala Harris. Initial published excerpts of Harris’ book showed her to be critical of the Biden White House.\n\n“One reason we delayed Jean-Pierre is, we knew she had a book coming out. Kamala Harris had a book coming out. The books are going to tell the story, I think, of what we’ve been hearing in the depositions,” Comer told The Daily Signal. “It’s counter to what many people have been reporting over the last year or so.”\n\nThough Jean-Pierre was White House press secretary from May 2022 to the end of Biden’s single term in office in January, she ignored reporters’ questions as she went into the Thomas P. O’Neill House Office Building on Friday morning. \n\nAs chief White House spokeswoman, she repeatedly defended Biden’s mental acuity, claiming she couldn’t keep up with him and that videos critical of Biden were “cheap fakes.” \n\nJean-Pierre was not under oath, but lying to Congress is a crime under federal statute 18 U.S.C. Section 1001.\n\nJean-Pierre is the latest of more than a dozen senior Biden White House staffers who sat for transcribed interviews with the House Oversight Committee. Biden’s second chief of staff, Jeff Zients, will go before the committee on Sept. 18. \n\nThe committee had transcribed interviews with more than a dozen former White House officials in Biden’s inner circle about his mental fitness for office. Three others had to be subpoenaed and invoked their Fifth Amendment rights against self-incrimination. Most notable of those was Dr. Kevin O’Connor, the Biden White House physician. Anthony Bernal, former senior adviser to first lady Jill Biden, also pleaded the Fifth, as did Annie Tomasini, former deputy director of Oval Office operations. \n\n“What’s at stake are all of the legal documents that were signed by the autopen, especially the last nine months, which by all accounts, President Biden was checked out of office,” Comer told The Daily Signal. \n\nThe Kentucky Republican talked about the excerpt from Harris’ book, “107 Days,” published in The Atlantic about her abbreviated presidential campaign in 2024 that she lost to Donald Trump. Harris called Biden’s decision to run for reelection reckless and criticized Biden White House officials.\n\n“What you were seeing from Kamala yesterday, I thought, was an admission of a huge lack of respect for Joe Biden when she said, ‘We should have never let Joe and [then-first lady Jill Biden] make that decision,’” Comer said. “That’s a pretty bold admission of lack of respect. I think that’s the kind of trend we are seeing in terms of excessive use of the autopen.”","summary":"After defending former President Joe Biden’s mental fitness for more than two years, former White House press secretary Karine Jean-Pierre went before a House committee... Read More\n\n\nThe post Jean-Pierre Faces House Panel’s Scrutiny on Biden Incapacity, Autopen appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/12/karine-jean-pierre-faces-house-scrutiny-biden-capacity-autopen/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/KJP-Oversight-scaled.jpg","video":null,"publish_date":"2025-09-12 17:14:36","author":"Fred Lucas","authors":["Fred Lucas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.312},{"id":359959874,"title":"Barack Obama’s Diaper Joke on Donald Trump Leaves Internet in Stitches – Netizens Say, “I Wonder If Melania…”","text":"A resurfaced video of Barack Obama brutally trolling Donald Trump has the internet in stitches. The clip, which was posted on Instagram, has already garnered over 99,000 likes and 1,800 comments. As seen in the video, while talking about his Republican rival, the former POTUS made a diaper joke. However, before he could finish, the crowd beat him to it.\n\nIt was during a campaign rally for Kamala Harris during the 2024 pre-election, when Obama criticized Trump’s perceived lack of responsibility. However, rather than slamming him straightforwardly, the Democrat pursued a rather witty way. “I remember buying diapers. I remember the first time I went into the store right after Malia [his firstborn] was born.”\n\n“I was like, what…That’s how much diapers cost? I remember changing diapers. You think Donald Trump ever changed a diaper?” The crowd instantly burst into laughter and applause, with some even actually answering Obama’s question.\n\n“No,” one from the crowd yelled, while another added, “A jam.” However, it was the third comment that even impressed Obama. “His own,” one man is heard shouting, as the former Democrat POTUS himself cracks up.\n\nView this post on Instagram\n\nA post shared by AbluesforNina (@aabbluesffornnina) \n\n“I almost said that, but I decided I shouldn’t say it,” he added, and the crowd loudly cheered for him. You could even hear a few whistles here and there in the viral video. Even at that time, the video became international headlines, while many even claimed that Donald Trump truly wore an adult diaper.\n\nAfter the video resurfaced on the internet a few days ago, Trump critics once again indulged in brutally trolling him. “Funny that Trump never changed a diaper, but he wears one,” one Instagram user wrote. “Trump doesn’t even change his own diaper,” another echoed. A third wrote, “I wonder if Melania ever changed a diaper.”\n\nThere’s a lot of talk about boots today but we need to talk about the fact that Mr. Trump apparently wears adult diapers.\nCan we trust him with the nuclear codes if he can’t even trust his own bladder?#diapergate pic.twitter.com/KD7n4jwxAL\n— Free (@KaladinFree) October 31, 2023 \n\nThe other commentators felt nostalgic to see a video of Obama, with many commenting they “miss” the former POTUS. “I miss his intelligence, humanity, and his smiles,” one wrote. The other added, “This man knew how to read the room, which is why he resonated with so many of us. He felt the most human to me.”\n\n“You are my President forever and always! Come back. The country needs you!!!” a third wrote. “‘I almost did that but decided I shouldn’t say that” is a statement that speaks to who Obama is truly,” another Instagram user commented under the viral video. “When I had respect for the President of the United States…” one individual wrote.","summary":"Remember when Barack Obama made a diaper joke about Donald Trump? Well, it's back.","url":"https://www.inquisitr.com/barack-obamas-diaper-joke-on-donald-trump-leaves-internet-in-stitches-netizens-say-i-wonder-if-melania","image":"https://www.inquisitr.com/wp-content/uploads/2025/09/Untitled-design-2025-09-12T183522.988.jpg","video":null,"publish_date":"2025-09-12 14:22:32","author":"Moupriya","authors":["Moupriya"],"language":"en","category":"politics","source_country":"US","sentiment":0.019},{"id":359959036,"title":"What campus crusader Charlie Kirk meant to Trump","text":"APCharlie Kirk (File Pic)\n\nThe death of Charlie Kirk, fatally shot while speaking at Utah Valley University three days ago, has not only sent shockwaves through conservative circles but also left a significant void in the movement he helped shape. At just 31, Kirk had become one of the most influential conservative figures in America, particularly among young voters. More than just a Trump ally, Kirk was a cultural architect of modern right-wing youth politics, reshaping the landscape of campus activism, conservative media and electoral strategy.As founder of Turning Point USA (TPUSA), Kirk built a formidable organisation that energised a generation of students disillusioned with progressive orthodoxy and offered them a compelling, if controversial, ideological alternative - a mix of Christian conservatism, free-market economics and unapologetic nationalism. In doing so, he became instrumental in Trump’s appeal to younger voters and helped redefine the identity of modern conservatism.How Kirk helped the shift from woke to conservativeThen 18-year-old Kirk founded Turning Point USA just after Barack Obama’s re-election in suburban Chicago in 2012 with William Montgomery, a tea party activist, to proselytise on college campuses for low taxes and limited government. It was not an immediate success. But Kirk’s zeal for confronting liberals in academia eventually won over an influential set of conservative financiers.Kirk challenged what he saw as the ideological monopoly of liberalism on America’s college campuses. Armed with charisma, a sharp instinct for media and access to conservative donors, he quickly turned TPUSA from a grassroots organisation into a sprawling political enterprise with chapters at over 850 colleges and high schools. The mission was straightforward but ambitious: to promote the values of free markets, limited government and fiscal responsibility. Kirk’s real innovation wasn’t in economics but in culture. He understood that for many young people, political allegiance was increasingly shaped not by policy but by identity. So he didn’t just critique liberal ideas but framed conservative values as a lifestyle, a countercultural rebellion against what he called the woke industrial complex.Kirk’s messaging struck a chord with a subset of Gen Z and Millennial Americans who felt alienated by what they saw as the overreach of progressive politics. In a world where being woke was often seen as a social requirement, Kirk made it cool to question the status quo. He attacked the language of political correctness, took aim at college diversity policies and positioned himself as a defender of free speech and traditional values.Live EventsWhat made Kirk particularly effective was his mastery of media. Turning Point’s short videos, social media clips and viral campus confrontations didn’t just preach to the choir but also spread across platforms like wildfire, reaching young people who may never have set foot in a conservative lecture hall. For those disillusioned by left-wing activism or seeking an intellectual identity rooted in faith and individualism, Kirk offered a compelling narrative -- you can be young and defiant and still a conservative.Also Read | 'We have him': Trump says 'with a high degree of certainty' suspect in Charlie Kirk caughtHow Kirk prepared the ground for Trump's returnTrump’s rise to political dominance created fertile ground for Kirk’s brand of conservatism. While Trump himself struggled at times to resonate with younger voters, Kirk helped fill the gap. Despite early misgivings, Turning Point enthusiastically backed Trump after he clinched the GOP nomination in 2016. Kirk served as a personal aide to Donald Trump Jr. during the general election campaign. Soon, Kirk was a regular presence on cable TV, where he leaned into the culture wars and heaped praise on the then-president. Trump and his son were equally effusive and often spoke at Turning Point conferences. Kirk announced he was organising buses to travel to Washington to back Trump on Jan. 6, 2021, and later invoked the Fifth Amendment rather than answering questions from the Jan. 6 subcommittee.By 2020, he had become one of Trump’s most visible surrogates, regularly visiting the White House and speaking at major conservative events. Their relationship deepened over the years, culminating in joint appearances and personal outings, including a golf game just two days before Trump’s 2025 inauguration.For Trump, Kirk was not merely a supporter but a strategic asset. TPUSA played a critical role in voter registration efforts, especially in battleground states like Arizona, where the youth vote was instrumental in Trump's surprising 2024 win. Kirk's infrastructure was more agile and youth-savvy than the traditional GOP apparatus, offering both media reach and boots-on-the-ground activism.A key component of Kirk’s influence was his embrace of Christian identity politics. Rather than treating religion as a private matter, Kirk made it central to his message. He positioned Christianity not only as a moral framework but as a cultural identity under siege from secular liberalism. This religious framing created a strong bond with Trump’s evangelical base while appealing to young conservatives seeking moral clarity. By tying religious values to issues like abortion, gender identity and family, Kirk helped fuse Christian traditionalism with political activism, something that contributed to Trump's re-election last year.Also Read | Who is Skye Valadez and why 'Charlie Kirk dead at 31' song on Soundcloud has sparked buzz on social media?In the 2024 election, Trump lost the youth vote by a smaller margin than in 2020, and turnout among young conservatives surged in key states. Turning Point’s political wing helped run get-out-the-vote efforts for Trump’s 2024 campaign, trying to energise disaffected conservatives who rarely vote. Trump won Arizona, Turning Point’s home state, by five percentage points after narrowly losing it in 2020. During an appearance with Trump in Georgia last fall, he said Democrats “stand for everything God hates.” Kirk called the Trump vs. Kamala Harris choice “a spiritual battle.” “This is a Christian state. I’d like to see it stay that way,” Kirk told the 10,000 or so Georgians, who at one point joined Kirk in a deafening chant of “Christ is King! Christ is King!”While it’s impossible to measure the exact impact of TPUSA’s work, it’s clear that Kirk’s efforts helped the GOP make inroads into a demographic long dominated by Democrats. Kirk's real achievement may have been cultural rather than electoral. By giving young conservatives a sense of identity, community and mission, Kirk helped build a movement that gave an edge to Trump's political discourse which had not found resonance among the youth. Kirk reshaped the way American conservatism engages with the next generation. In an era where politics is increasingly driven by identity and culture, he recognised that the battle for hearts and minds begins long before the ballot box. Kirk's years of work with the youth was able to create a space for Trump's politics on campuses where it was nearly missing.Despite his successes, Kirk remained a deeply polarising figure, both outside and within the conservative movement. His confrontational style, marked by combative campus debates, inflammatory rhetoric and unfiltered commentary, invited frequent criticism. Detractors accused him of promoting misinformation, stoking division and using youth activism as a vehicle for theatrics rather than substantive engagement. (With agency inputs)Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onCharlie Kirk DeathCharlie Kirk MurderCharlie Kirkturning point usautah valley universitywilliam montgomeryskye valadezDonald Trumpconservative financiersTPUSA\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onCharlie Kirk DeathCharlie Kirk MurderCharlie Kirkturning point usautah valley universitywilliam montgomeryskye valadezDonald Trumpconservative financiersTPUSA(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Charlie Kirk's untimely death at 31 has reverberated through conservative circles. As the founder of Turning Point USA, he cultivated a powerful youth movement, blending Christian conservatism, free-market principles, and nationalism. Kirk's efforts significantly contributed to Donald Trump's appeal among younger voters, reshaping campus activism and electoral strategies, leaving a lasting impact on American conservatism.","url":"https://economictimes.indiatimes.com/news/international/global-trends/what-campus-crusader-charlie-kirk-meant-to-trump/articleshow/123853977.cms","image":"https://img.etimg.com/thumb/msid-123853992,width-1200,height-630,imgsize-123732,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-09-12 13:50:41","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":0.235},{"id":359926062,"title":"Ilhan Omar Claims Without Evidence Republicans Want Kamala Harris Dead","text":"Democratic Rep. Ilhan Omar of Minnesota accused Republicans of trying to get former Vice President Kamala Harris killed during a Thursday interview.\n\nOmar’s comments came the day after Turning Point USA (TPUSA) founder Charlie Kirk was fatally shot during a TPUSA “Prove Me Wrong” event at Utah Valley University, in which he would take questions from attendees. Omar cited the end of Harris’ Secret Service protection during an appearance on Zeteo News. (RELATED: ‘Look At The Record’: AOC Blames 2A Supporters For Charlie Kirk Assassination)\n\n“Michael Hernandez asked a good question on YouTube. He says, in this environment, why would you take away Secret Service protection from the former vice president?” Zeteo News founder Mehdi Hasan asked. “Trump happily pulled protection from Harris and I believe from people like John Bolton, who I’m not a fan of, but I don’t want to see John Bolton killed. He pulled protection from a lot of people he doesn’t like. Doesn’t sound like someone taking political violence that seriously when it’s people he doesn’t like.”\n\n“No. I mean, and that’s the thing, it’s — they are never willing or care to worry about when, you know, it’s those of us on the other side of the aisle that are getting death threats, that have had their houses shot at, that have had, you know, people show up to their homes,” Omar claimed. “They’re willing to actually take away the security and the safety of people like VP Harris, because they don’t mind, they don’t mind her getting killed. And that is the reality in which we are living in and we have to continue to talk about. Because unless we all collectively make a decision that this is not normal and that we are going to actually be civil, you know, this is going to continue.”\n\nDuring the same interview, Omar said people who remembered Kirk fondly were “full of shit” and that progressives should “call them out.”\n\nFormer vice presidents, their spouses, and children under the age of 16 can receive up to six months of Secret Service protection from the end of their time in office, according to 18 USC 2056(a)(8). Harris’ protection was not terminated until Aug. 28, 2025, well past the statutory limit, and the termination was not effective until Sept. 1.\n\nPresident Donald Trump survived two attempts on his life during the 2024 presidential campaign, one during a July 13 rally in Butler, Pennsylvania, the other on September 15 while Trump was playing a round of golf in Florida. Trump also survived an assassination attempt during his successful 2016 campaign for President when a 20-year-old man from the United Kingdom tried to take a police officer’s gun in order to shoot Trump during a June 2016 campaign event in Las Vegas.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'They’re willing to actually take away the security'","url":"https://dailycaller.com/2025/09/12/ilhan-omar-claims-without-evidence-republicans-want-kamala-harris-dead/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/DCNF-Omar-Hasan-Kamala-Republicans-Featured.jpg","video":null,"publish_date":"2025-09-12 13:16:52","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","category":"politics","source_country":"us","sentiment":-0.351},{"id":359927158,"title":"Social scientists have long found women tend to be more religious than men – but Gen Z may show a shift","text":"For decades, one of the most consistent findings in religion research has been that women tend to be more religious than men. This holds true across dozens of countries and on nearly every measure of religiosity, from how often someone prays to how important faith is in their lives.\n\nSocial scientists have struggled to pinpoint a universal cause for this pattern. Theories run the gamut – from the claim that it has something to do with women being more risk averse to the argument that religion offers women support for social responsibilities around birth, death and raising children.\n\nIn the past few years, however, survey data in the U.S. has started to tell a different story. Today, there is less empirical evidence that women are more religious than men – a debate I’ve tracked closely as a quantitative scholar of American religion. Looking at Generation Z, in particular, a number of results have raised some eyebrows, pointing toward other divides throughout the country.\n\nShrinking gap\n\nIn 2023, the American Enterprise Institute’s Survey Center on American Life found that 39% of Gen Z women say they do not have a religious affiliation, compared to 34% of men from the same generation. The past several waves of data from the Cooperative Election Study, a national survey, have found that men born after 1990 – a mix of younger millennials and Gen Z – are slightly more likely to attend religious services weekly than women of the same age.\n\nWhen I give a lecture or presentation, often the first question I’m asked is about this surprising result. \n\nI warn people to take it with a grain of salt. According to data from the 2022 General Social Survey, one of the most well-respected national polls, the opposite is true: among Americans ages 18-45, women are still more likely to attend a house of worship nearly every week. And the Pew Religious Landscape Study, which was released in February 2025, concludes, “While the gender gap in American religion appears to be narrowing, there are still no birth cohorts in which men are significantly more religious than women.”\n\nAll together, a growing body of survey evidence suggests that the overall religiosity of young American adults does not vary significantly by gender.\n\nAnecdotal reports about scores of young men flocking to church or joining religious communities like Eastern Orthodoxy seem to grab headlines. However, the idea of a reversal in the gender gap is not supported by evidence – only that it is narrowing.\n\nDrifting apart\n\nIf America’s gender gap around religion is changing, perhaps politics can help explain why.\n\nA growing body of survey data suggests that overall, young men are moving further to the right on political matters, while young women are becoming increasingly progressive.\n\nAn NBC News poll in April 2025 found that among people ages 30-44, men were about 9 percentage points more likely to approve of Donald Trump’s job performance than women of the same age. Among those ages 18-29, the gap widened to a staggering 21 points. \n\nA few months later, NBC polled nearly 3,000 young Americans about how they define success, asking them to select the top three factors from a list of 13. Overall, men between 18-29 rated “being married” and “having children” slightly higher than women their age. Among Gen Z men who voted for Trump, having children was the most important. Women who voted for Kamala Harris, meanwhile, ranked children near the bottom. \n\nThe largest religious traditions in America today are evangelical Protestant Christianity and the Catholic Church. Both groups’ teachings emphasize “traditional” gender roles, marriage and having children. For a growing wave of young progressive women, such teachings are at odds with their desire to make advances in the workplace and society. Some analysts argue that those tensions, as well as views on LGBTQ+ rights, are driving women away from institutional religion.\n\nOpposite directions\n\nAs a result, Generation Z may be the most visible manifestation of the growing “God gap” in American politics.\n\nIn short, the religious compositions of the two major political parties have gone in opposite directions. In the 1990s, 67% of Republicans said they believed in God without a doubt, and 63% of Democrats said the same, according to my analysis of General Social Survey data. By 2022, certain belief in God had dropped to 39% among Democrats, while holding fairly steady among Republicans, at 63%. Twenty-eight percent of Democrats regularly attend a house of worship, compared to 42% of Republicans; in the 1970s, the gap was only 4 percentage points.\n\nThis all points to a broader, potentially more polarized future for the American public. Already, there is evidence that a growing number of people choose their house of worship based on political tribe, not just theological beliefs, making congregations less diverse. Women’s and men’s competing interests and preferences may make it harder to find a suitable partner. Common ground may be harder to find when there are fewer chances for interaction and conversation.\n\nUltimately, these trends suggest a future where polarization extends beyond politics and into the very fabric of American life – shaping where people worship, who they marry, and how communities form.","summary":"The religion gap between American men and women may be narrowing, a scholar explains – reflecting a seeming ‘God gap’ in US politics.","url":"https://theconversation.com/social-scientists-have-long-found-women-tend-to-be-more-religious-than-men-but-gen-z-may-show-a-shift-263693","image":"https://images.theconversation.com/files/690507/original/file-20250911-64-z7lsix.jpg?ixlib=rb-4.1.0&rect=0%2C162%2C5318%2C2659&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-09-12 12:31:08","author":"Danforth Center on Religion and Politics,Professor of Practice,Ryan Burge,Washington University in St. Louis","authors":["Danforth Center on Religion and Politics","Professor of Practice","Ryan Burge","Washington University in St. Louis"],"language":"en","source_country":"AU","sentiment":-0.063},{"id":359910430,"title":"10 things to know about Charlie Kirk","text":"Charlie Kirk, the conservative activist and controversial figure, was confirmed dead on Wednesday, September 10, 2025, after being shot during a speaking event at Utah Valley University. \n\nHe emerged in American politics as a bold and influential conservative voice. From his teenage years, he was driven by the idea of shaping culture through politics and quickly rose from grassroots activism into the national spotlight, with his focus on influencing young people.\n\nAs founder of Turning Point USA, he built one of the largest conservative student organizations in the country, becoming a familiar name on college campuses and a regular figure in media debates. His unapologetic style won him loyal supporters and fierce critics.\n\nHis death stunned the nation and sparked tributes across the globe, leaving many to reflect on his legacy and influence.\n\nHere are 10 things to know about him:\n\n1. He was 31\n\nCharlie Kirk was just 31 years old when he died, a fact that underscored the shock and sense of a life cut short suddenly. At such a youthful age, he achieved great impact across the globe.\n\n2. He was married to Erika Kirk\n\nCharlie married Erika Frantzve in 2021. Erika, who later became Erika Kirk, is a businesswoman, podcaster, and former Miss Arizona USA.\n\n3. He had two kids\n\nHe was a devoted father of two children. He had a daughter born in 2022 and a son born in 2024, and their names are kept private.\n\nRead Also: Nathaniel Bassey, Victoria Orenze mourn Charlie Kirk\n\n4. He was Donald Trump’s ally\n\nCharlie was a close ally of Donald Trump, championing his policies and rallying young conservatives to the MAGA movement from the period of Trump’s campaign till he got into power.\n\n5. He was shot while speaking at a university\n\nOn September 10, 2025, Kirk was shot at his neck during a speaking event at Utah Valley University. His death has been widely described as a ‘political assassination.”\n\n6. He founded Turning Point USA\n\nAt just 18 years old, Kirk launched Turning Point USA out of his parent’s garage, an organization that grew into one of the most influential conservative groups on American campuses. He founded it with no money, no name recognition, only a dream.\n\n7. He was a controversial figure\n\nKnown for his unapologetic style, Kirk often stirred heated debates on issues such as Christianity, abortion, gender identity, race, and ‘woke’ culture. He defended and lived on the Truths and the Rights. With his commentary, a lot of youths still disagreed with him, yet they gathered to hear more from him.\n\n8. He built a powerful media presence\n\nBeyond activism, he hosted The Charlie Kirk Show in 2019 which got syndicated in 2020, authored books, and amassed a strong following online, making him one of the most recognisable voices in conservative media in America.\n\n9. He was honoured at home and across the globe\n\nAll U.S. flags, as ordered by President Donald Trump, was flown at half-mast in his honour till Sunday, September 14, by 6p.m. While tributes poured in from around the world, former USA leaders, including Kamala Harris, former President Barack Obama, and former President Joe Biden, mourned his death.\n\n10. Trump pledged to award him the Presidential Medal of Freedom\n\nDonald Trump has vowed to posthumously honour Kirk with the nation’s highest civilian award, the Presidential Medal of Freedom.","summary":"Charlie Kirk, the conservative activist and controversial figure, was confirmed dead on Wednesday, September 10, 2025, after being shot during a speaking event at Utah Valley University.&#160; He emerged in\n\n\nThe post 10 things to know about Charlie Kirk appeared first on The Nation Newspaper.","url":"https://thenationonlineng.net/10-things-to-know-about-charlie-kirk/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2025/09/12131806/Charlie-Kirk.png","video":null,"publish_date":"2025-09-12 12:18:24","author":"Precious Olugbodi,The Nation","authors":["Precious Olugbodi","The Nation"],"language":"en","source_country":"ng","sentiment":0.384},{"id":359942612,"title":"San Diego GOP faces possible historic shut out in Congress","text":"Not very long ago, the notion that San Diego County would have no Republican representation in Congress seemed unfathomable.\n\nYet that could be one of the many results of the Democratic push to redraw California’s congressional districts, a proposal that will go to voters in November as Proposition 50.\n\nThe region, once a Republican bastion, has had at least one GOP member in Congress for more than 75 years. Whether that streak is halted — by no means a given — in the 2026 elections depends on lots of variables.\n\nIn the past, Republicans regularly dominated the San Diego congressional delegation. The county’s changing political demographics whittled that down to one solid GOP district out of five — the East County-centric 48th district that stretches up into Riverside County held by Rep. Darrell Issa.\n\nAs late as 2001, San Diego had four Republicans in the House and only one Democrat.\n\nThe 48th is among five California Republican districts Democrats are seeking to flip, with the aid of favorably redrawn boundary lines. The maneuvering would shift Issa’s district to a slightly Democratic-leaning one — and potentially help Democrats regain the majority in the House of Representatives.\n\nThere’s considerable dispute, even among some Democrats, about the appropriateness of suspending the work of California’s independent citizen redistricting commission for a few election cycles.\n\nBut Gov. Gavin Newsom and Proposition 50 itself make clear the measure is a response to the opening gambit by Texas Republicans to redraw that state’s districts at the behest of President Donald Trump in an effort to gain five seats and retain the GOP’s tenuous control of the House.\n\nShould he run, Issa would face a much bigger challenge than in his current district. But no one should count him out.\n\nFor one thing, voters might reject the new maps in November.\n\nIf they approve, the new 48th would still include much of Issa’s current territory, where he has been elected three times (in addition to serving 18 years in a different district). However, the new boundaries would exclude some East County communities and pick up Democratic-leaning areas in the Coachella Valley, especially Palm Springs.\n\nAs one of the wealthiest members of Congress, Issa has the resources to largely self-finance a big campaign, but he’s also a proven fundraiser.\n\nFurther, there’s the potential for a costly and bruising primary battle among two high-profile Democrats, Ammar Campa-Najjar and Marni von Wilpert, that could leave the emerging candidate wounded while Issa likely will face negligible Republican opposition, if that.\n\n“It’s not a slam dunk,” Thad Kousser, political science professor at UC San Diego, said of the potential 48th district election.\n\n“This doesn’t mean five free seats for Democrats,” he added about Proposition 50. “This is five Democratic chances.”\n\nStill, Issa’s staunchly conservative record and loyalty to Trump won’t likely sit well with most voters in the proposed new 48th district.\n\nIn 2024, President Donald Trump won in the current district by more than 15 percentage points (Issa won by nearly 19 points). In the proposed new 48th, former Vice President Kamala Harris won by nearly 3 percentage points\n\nDemocrats have some difficult sorting out to do before they take on Issa. There’s angst among some party members over whether to support von Wilpert, a San Diego City Council member and former deputy city attorney, or Campa-Najjar, a three-time candidate, part-time university professor and an officer in the U.S. Navy Reserve.\n\nVon Wilpert has won in a suburban, north inland San Diego council district previously held by Republicans. Last year, von Wilpert ran for re-election unopposed.\n\nCampa-Najjar had worked in the Obama administration and ran for Congress twice. He lost by just over three points in 2018 to then-Rep. Duncan D. Hunter, who was embroiled in a scandal over the personal use of campaign funds that eventually forced him from office.\n\nCampa-Najjar then lost in the same East County Republican district to Issa in 2020 by more than seven points. Two years later, he lost an election for mayor in heavily Democratic Chula Vista to then-Councilmember John McCann, a Republican.\n\nDespite an advantage in name identification, Campa-Najjar’s losing record has weighed on Democrats’ minds and von Wilpert has made at least indirect references to that. Campa-Najjar has pointed out he did well in Republican areas and won tens of thousands of votes in parts of the new 48th, where von Wilpert has not run.\n\nAs much as anything, the politics of the Democratic match up could be affected by Campa-Najjar’s ties to the wealthy and influential Jacobs family. He has been yearslong partners with Rep. Sara Jacobs, granddaughter of Irwin Jacobs, co-founder of telecommunications giant Qualcomm. Irwin and the late Joan Jacobs are legendary for their philanthropic and political donations, locally and nationwide.\n\nThe pair had contributed tens of thousands of dollars to committees that have supported Campa-Najjar. Not only could such largess help Campa-Najjar in this race, it could influence whether and who the local Democratic Party and Democratic National Campaign Committee get behind in the primary.\n\nSan Diego’s current four Democratic districts also would experience substantial boundary changes if Proposition 50 passes, but not to the potential game-changing effect facing Issa. The incumbents — Mike Levin, Scott Peters, Juan Vargas and Jacobs — should be safe, though the Democratic advantage in Peters’ 50th district shrinks considerably.\n\nGiven the nationwide stakes in the redistricting derby, a Democratic sweep in San Diego would be a footnote at best, likely only of local interest.\n\nAnd judging from history, it likely won’t last forever.\n\nIn 1948, San Diego Democrat Clinton D. McKinnon defeated Republican Rep. Charles K. Fletcher, a battle between patriarchs of two eventual longtime influential San Diego families. McKinnon, described by Time magazine as “a jockey-sized little fireball with unruly black hair and bounding energy,” declined to run for re-election in 1952 after two terms.\n\nHe was the last representative to serve all San Diego County, which thereafter gained more districts due to population growth and an unbroken string of Republican members in Congress.\n\nWhat they said\n\nSen. Alex Padilla, D-Calif. (@AlexPadilla4CA).\n\n“A construction site is not probable cause. Speaking with an accent is not a crime. And racial profiling is un-American.”","summary":"&#160; sort things out Marni-Ammar, Jacobs/Sara-Irwin Peters district&#8230; not as &#8220;purple&#8221; as you&#8217;d think. Future races (if Peters&#8217; district is vacated, open seat? GOP chance? Nobody is saying that) Did both: Put dems in GOP districts, consolidated GOP into heavier red districts. Dominoes, musical chairs. Mara Elliott, Sabrina  Bazzo (Unified trustee) Dems running for state Senate. As is San Marcos Councilman Ed Musgrove (father of Joe), a Republican. Are Calvert and Issa in the same district? Levin swing district got slightly more blue Scott: Marni says she&#8217;s all in even if Prop. 50 doesn&#8217;t pass&#8230;. doubtful. Ammar. Lost to Duncan D. [&#8230;]","url":"https://www.sandiegouniontribune.com/2025/09/14/san-diego-gop-faces-historic-shut-out-in-congress/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/SUT-L-JOHNSON-ISSA.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-12 12:00:46","author":"Michael Smolens","authors":["Michael Smolens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.3},{"id":359896990,"title":"5 Facts About Assassination Of Trump’s Ally Charlie Kirk","text":"Charlie Kirk, a prominent right-wing activist and close ally of President Donald Trump, was fatally shot during a public event in Utah on Wednesday.\n\nHereunder are five facts about the killing, which has sent shockwaves through America’s political landscape.\n\n1. The Shooting at Utah Valley University:\nThe 31-year-old conservative figure was addressing a crowd at Utah Valley University when the fatal gunshot rang out around noon. Kirk, dressed in a white T-shirt emblazoned with the word “Freedom”, had been answering questions under a tent in the student courtyard.\n\nFormer Utah congressman Jason Chaffetz, who was at the scene, recounted the chilling moment, “As soon as that shot went out, he fell back. Everybody hit the deck… a lot of people started screaming, and then everybody started running.”\n\nVideo footage from a nearby location showed Kirk collapsing as blood spurted from his neck before he was rushed away on a stretcher by his security detail.\n\n2. A Targeted Attack:\nAuthorities described the shooting as a “targeted attack.” According to Utah’s Department of Public Safety, the shooter is believed to have fired from the roof of a nearby building down into the courtyard where the event was held.\n\nTwo men were briefly detained and questioned but later released, with officials stating that neither had “current ties to the shooting.” One of them, George Zinn, has been charged with obstruction.\n\n3. The Event Was Part of a National Tour:\nKirk was on the first stop of a 15-event speaking tour scheduled to run through the end of October. The activist, who co-founded the largest conservative youth movement in the United States in 2012 at just 18 years old, had built a reputation as one of Trump’s most vocal defenders on issues ranging from free speech to culture wars.\n\n4. Bipartisan Condemnation of Political Violence:\nNews of Kirk’s death drew swift reactions across the political spectrum. President Trump announced it on his Truth Social platform, writing, “The Great, and even Legendary, Charlie Kirk, is dead.”\n\nVice President Kamala Harris also condemned the shooting, stating that “political violence has no place in America.”\n\n5. Trump Blames the ‘Radical Left’:\nWhile authorities continue the manhunt, Trump directly linked Kirk’s killing to what he described as dangerous rhetoric from his political opponents.\n\nIn a somber video address from the Oval Office, Trump vowed to crack down on those he holds responsible, “This kind of rhetoric is directly responsible for the terrorism that we’re seeing in our country today. My administration will find each and every one of those who contributed to this atrocity and to other political violence, including the organizations that fund it and support it.”","summary":"Charlie Kirk, a prominent right-wing activist and close ally of President Donald Trump, was fatally shot during a public event in Utah on Wednesday. Hereunder are five facts about the killing, which has sent shockwaves through America’s political landscape. 1. The Shooting at Utah Valley University: The 31-year-old conservative figure was addressing a crowd at [&#8230;]","url":"https://leadership.ng/5-facts-about-assassination-of-trumps-ally-charlie-kirk/","image":"https://leadership.ng/wp-content/uploads/2025/09/Screenshot-2025-09-12-130234.jpg","video":null,"publish_date":"2025-09-12 11:58:59","author":"Nafisat Abdulrahman","authors":["Nafisat Abdulrahman"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.248},{"id":359880262,"title":"Donald Trump Is Not the Bitcoin President","text":"Donald Trump took the stage about an hour and a half behind schedule—the Secret Service needed time to secure the room—but the audience didn't seem to mind. The once and future president waited for Lee Greenwood's \"God Bless the U.S.A.\" to come to its rousing finish, mouthed the song's final lyric, walked to the podium, and smiled. \"Hello Bitcoiners!\"\n\nTrump had arrived at the 2024 Bitcoin Conference in Nashville, seeking the support of a movement that once had seemed like a radical fringe but now was entering the mainstream. \"I stand before you today filled with respect and admiration for what the bitcoin community has achieved,\" the candidate said.\n\nTrump had once sounded like a typical politician when opining on the topic. \"I am not a fan of Bitcoin and other Cryptocurrencies,\" he tweeted in 2019, adding that they're \"not money,\" \"highly volatile,\" \"based on thin air,\" and a tool for 'illegal activity.\"\n\nBut on the 2024 campaign trail, he changed his mind. David Bailey, the CTO of Bitcoin, Inc. and organizer of the Nashville conference, met privately with Trump, and his campaign started receiving significant backing from pro-crypto tech titans, including Elon Musk, David Sacks, and Chamath Palihapitiya. Marc Andreessen and Ben Horowitz, whose venture capital fund a16z has staked billions on cryptocurrency and \"Web3\" startups, endorsed Trump because the Biden administration's regulatory policies were crippling their companies. That night in Nashville, the Trump campaign hosted a fundraiser with an asking price of $844,600 a head.\n\n\"I pledge to the bitcoin community that the day I take the oath of office, Joe Biden and Kamala Harris' anti-crypto crusade will be over,\" Trump told the crowd. A month earlier, he had written on Truth Social that \"Biden's hatred of Bitcoin only helps China, Russia, and the Radical Communist Left. We want all the remaining Bitcoin to be MADE IN THE USA!!!\"\n\nIn his first year back in office, Trump did indeed reverse President Biden's \"anti-crypto crusade.\" This felt like \"a boot off the throat,\" according to Andreessen. Trump freed Silk Road founder and bitcoin pioneer Ross Ulbricht. He named Sacks as his AI and crypto czar. His new Securities and Exchange Commission chief, Paul Atkins, launched \"Project Crypto,\" an initiative to provide the industry with regulatory clarity. This summer, the president signed the GENIUS ACT, which established a legal framework for stablecoins, making them a tool of U.S. economic policy.\n\nBeyond freeing Ulbricht, none of these policies has much to do with bitcoin's potential to separate money from the state and to create \"a new territory of freedom,\" in the words of the technology's pseudonymous creator, Satoshi Nakamoto. Indeed, Trump's Justice Department has attacked developers who are working on cryptographic ways to improve bitcoin's privacy.\n\nThe president doesn't want to replace the U.S. dollar; he wants to strengthen it. He hopes the dollar \"dominates the future,\" as he told the crowd in Nashville. But bitcoin is designed to create an open global currency, where governments and individuals are on equal footing. It's a borderless, voluntary monetary network with no national affiliation. One of the most famous bitcoin memes shows two characters from The Matrix, with Neo asking Morpheus, \"What are you trying to tell me, that I can trade my bitcoin for millions someday?\" Morpheus responds: \"No, Neo, what I'm trying to tell you is that when you're ready…you won't have to.\"\n\nStablecoins, by contrast, are a way to expand the dollar's hegemony and network effect. Trump isn't the bitcoin president. He's the stablecoin president.\n\nThe Stablecoin President\n\nTrump's Nashville speech discussed bitcoin interchangeably with \"crypto,\" but bitcoin is fundamentally different from other cryptocurrencies. It runs on a decentralized, peer-to-peer software network and issuance schedule that, by design, can't be tampered with by centralized authorities. It provides a way to send value over the internet without trusting third-party intermediaries. Like the gold standard, it's a neutral monetary system; unlike gold, it has no physical properties, making it harder to seize or censor. If bitcoin fully succeeds, governments will no longer be able to steal from their citizens by printing money, and they'll no longer be able to cut people off from payment networks and banking services.\n\n\"Crypto,\" on the other hand, typically describes a set of centrally issued tokens, usually administered by foundations, neobanks, and tech companies. Most \"crypto\" projects are outright scams or pyramid schemes; most have failed to find (or never looked for) real-world adoption.\n\nThe major exception is \"stablecoins,\" which have emerged as the crypto industry's killer application. They work like casino chips: a stablecoin company issues $100 worth of digital dollar tokens and simultaneously backs them with $100 of \"high-quality\" assets, typically U.S. Treasuries. Stablecoins aren't routed through the conventional banking system, so they move easily across borders and are readily accessible in parts of the world where the dollar is in high demand.\n\nStablecoins' key innovation isn't technical; it's regulatory arbitrage. They mean dollars for anyone, with no rules. Like bitcoin, they're a quasi-permissionless, internet-native form of money; unlike bitcoin, they rely on the U.S. dollar for their value and are almost entirely administered by companies.\n\nStablecoins faced regulatory headwinds under the Biden administration. The GENIUS Act, which Trump signed into law on July 18, 2025, has provided the industry with a pathway to full compliance and broader use. For example, Tether Holdings Limited—which administers the top-ranked stablecoin in terms of daily activity (USDT), with approximately $100 billion of value moving on its network every day—was incorporated in the British Virgin Islands and had announced plans to relocate its headquarters to El Salvador. Its executives hadn't visited the U.S. in years. But, in a striking change, Tether CEO Paolo Ardoino joined Trump at the signing of the GENIUS Act, and he has announced that the company will release a U.S.-based, GENIUS Act–compliant stablecoin this year.\n\nWhen signing the law, Trump said that stablecoins are \"really strengthening the dollar, and giving the dollar great prominence.\" And he's right. Stablecoins expand Washington's monetary power and reach by expanding the dollar's network effect in dozens of countries and by helping to shore up demand for U.S. debt. Stablecoins, which initially emerged as a novel technology to facilitate bitcoin exchanges' access to dollar liquidity, have evolved into a tool of state power.\n\nFor some people in and around the administration, stablecoins don't just help the U.S. Treasury; they help their own portfolios. Secretary of Commerce Howard Lutnick is the former chairman and CEO of Cantor Fitzgerald, which \"holds most of Tether's $134 billion in assets,\" earning \"tens of millions in fees,\" according to a 2024 article in The Wall Street Journal. The Trump family recently amassed $5 billion in paper wealth through its crypto venture, which includes a stablecoin.\n\nIn March, Tether surpassed Canada and Taiwan to become the seventh-largest holder of U.S. Treasuries worldwide. \"A thriving stablecoin ecosystem will drive demand from the private sector for U.S. Treasuries, which back stablecoins,\" Treasury Secretary Scott Bessent proclaimed in June. Tether has regularly promoted its role as a dollar booster to U.S. policymakers on television and social media. In 2024, only J.P. Morgan and China bought more T-bills than stablecoin issuers.\n\nMajor financial and payment services companies are experimenting with stablecoins, including Visa, which announced in August that it would support the PYUSD stablecoin, which works with Venmo and Paypal. Mastercard has announced support for PYUSD, USDC, and a few others. These companies are pushing not for bitcoin payments but for payments in a new form of dollar.\n\nAs early as 2018, millions of people in Iran, Turkey, Nigeria, and Argentina began using Tether as an \"offshore\" dollar that local authorities couldn't easily confiscate. With stablecoins, a refugee in a war zone can access dollars just as easily as a London bank. A recent study from ARK Invest estimated that there are 200 million stablecoin holders, compared to a billion holders of paper dollars. As countries like Russia and Iran attempt to coerce their citizens into using collapsing local currencies, the people are increasingly turning to stablecoins, which are hard to ban.\n\nThere is significant bitcoin adoption in authoritarian countries and collapsing economies as well, but many prefer stablecoins to mitigate price volatility. Stablecoins track the dollar, while bitcoin floats. Like the dollar, stablecoins gradually lose value over time, but they don't experience wild price swings.\n\nThis has turned stablecoins into a humanitarian tool because they provide billions of people with a way to escape high inflation. Why should anyone be forced to use the Nigerian naira or Egyptian pound, which have collapsed by more than 75 percent in the past few years, when they can access a dollar stablecoin on their mobile phone instead? A former executive of Binance, which issues its own stablecoin, was detained, abused, and nearly killed in Nigeria. The government wanted to send a warning: Stop giving our people the means to circumvent our authoritarian policies.\n\nBut unlike bitcoin, stablecoins require users to trust the companies that issue them. The tokens can be frozen, inflated, or remotely confiscated—and if the company issuing them commits fraud, they can become worthless. They're a useful tool, but they aren't in the same category as bitcoin, which is essentially freedom money.\n\nHow Bitcoin Prevails\n\nStablecoins suffer from the same \"root problem with conventional currency,\" to quote Satoshi Nakamoto: \"all the trust that's required to make it work.\" Bitcoin is truly decentralized, meaning there's nobody regulators can lean on to censor transactions. Tether, by contrast, has frozen and confiscated USDT transactions as large as $225 million at the behest of U.S. officials, and the company is open about cooperating with the FBI and Secret Service. Circle, the second-largest stablecoin issuer, does the same.\n\nToday, stablecoin users don't need to provide ID. But you can expect the industry eventually to be folded into the financial surveillance state. The U.S. government doesn't currently require that stablecoin users comply with Know Your Customer (KYC) regulations, which mandate that financial institutions monitor suspicious activity. But a future Democratic administration might change that. Or what happens if there's a high-profile case of someone using stablecoins for nefarious purposes? Lawmakers could impose regulations that require stablecoin users to fill out identifying paperwork, excluding billions of people.\n\nWhat about bitcoin's volatility problem? As the economist Lyn Alden argues in her 2023 book, Broken Money, the bitcoin price will likely stabilize over time as more people acquire it. The \"more liquid [bitcoin] becomes,\" she writes, \"the less volatile it is likely to be, which would make it similar to gold in that regard.\" Meanwhile, stablecoins pegged to the dollar will likely become more volatile as the U.S. government heads for a debt crisis. Ultimately, the Federal Reserve will be compelled to monetize debt issued by the Treasury to cover trillions of dollars in upcoming expenses related to eldercare entitlements, military expenditures, and other obligations.\n\nIf bitcoin becomes a stable unit of account, merchants will demand it as payment, obviating the dollar as an intermediary currency. That will vindicate Morpheus' response to Neo's question about exchanging his bitcoins for millions: \"When you're ready, you won't have to.\"\n\nBut that transition might not occur in our lifetimes because of stablecoins, argues former Bitcoin Magazine Editor-in-Chief Mark Goodwin in The Bitcoin-Dollar: An Economic Monomyth. Bitcoin has increased in value in relation to the U.S. dollar by approximately 46,000 percent over the past decade, and this trend is likely to continue. But stablecoins are emerging as the primary rail for acquiring bitcoin, which may allow the dollar to maintain its market power for generations. Services like Tether are cementing the dollar's place as the primary \"infrastructural on-ramp to Satoshi's protocol,\" Goodwin argues, reminiscent of the petrodollar system of the 1970s, in which U.S. policymakers convinced OPEC members to mandate that oil be sold internationally only in dollars. As demand for bitcoin grows, the stablecoin industry will grow in tandem, creating additional demand for U.S. Treasury debt and enabling the U.S. to continue borrowing on a massive scale to fund its expenditures. \n\nEventually, through a turbulent process called \"hyperbitcoinization,\" Goodwin argues, fiat currency may be entirely replaced and humanity could finally arrive at a \"fair playing field.\" But Trump's embrace of stablecoins will slow that process. \n\nFor the president, showing up in Nashville was an opportunity to dump on Democrats, to raise money for his campaign, to launch his own lucrative crypto tokens, and to shore up the dollar by promoting an industry that buys a lot of Treasury debt. He's trying to ride the bitcoin wave while championing a form of money that keeps the dollar dominant. It's logical. But as long as politicians keep devaluing their currencies, deplatforming their citizens, and debanking their critics, bitcoin will continue growing inexorably.","summary":"He’s the stablecoin president, seeking to expand the monetary power and borrowing capacity of the U.S. government.","url":"https://reason.com/2025/09/12/donald-trump-is-not-the-bitcoin-president/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/09/9-10-25-V1-A.jpg","video":null,"publish_date":"2025-09-12 11:00:53","author":"Alex Gladstein","authors":["Alex Gladstein"],"language":"en","category":"politics","source_country":"us","sentiment":-0.234},{"id":359868550,"title":"David Ellison has wasted no time putting his stamp on Paramount","text":"Paramount finally merged with Skydance in early August, a union that was delayed for more than a year as the Federal Communications Commission launched an inquiry into alleged news distortion at Paramount's subsidiary CBS.\n\nThe union was approved less than a month after Paramount agreed to pay $16 million to President Donald Trump to settle a lawsuit he filed against the company over the editing of a \"60 Minutes\" interview with former Vice President Kamala Harris.\n\nIt also occurred the week after CBS announced it was canceling \"The Late Show with Stephen Colbert.\" At the time, Paramount and CBS executives released a statement saying the cancellation was \"purely a financial decision against the challenging backdrop in late night.\"\n\nEllison hit the ground running. Within just a few weeks of the merger closing, he announced a seven-year, $7.7 billion deal to make Paramount the exclusive U.S. home for TKO Group's UFC mixed martial arts organization starting in 2026. The agreement means UFC will stop its pay-per-view model and events will be available directly to Paramount+ subscribers and, in some cases on CBS. Notably, this deal was nearly as expensive as the $8 billion merger between Paramount and Skydance.\n\nSports rights will be scarce in the coming years, as companies have already struck deals for broadcast and streaming for many major leagues. Apple is already expected to be the home of Formula 1, and Major League Baseball is waiting until its deals expire after the 2028 season to reorganize its media packages. That means it's unlikely there will be many other top-shelf sports assets available in the marketplace for Paramount to acquire in the near-term.\n\n\"UFC is a unicorn asset that comes up about once a decade,\" Ellison said in a statement at the time. He described himself as a UFC fan.\n\nUFC is a desirable asset because events take place year-round, meaning fans will keep paying for monthly subscriptions and have less incentive to cancel seasonally than they do with other sports. There are 43 live events annually, consisting of 350 hours of live programming. Paramount is interested in buying UFC's international rights to pair with U.S. rights.\n\n\"They're looking to change the narrative, and the UFC deal alone is a big splash,\" said Robert Fishman, analyst at MoffettNathanson.\n\nAnd Paramount+ isn't the only division of Paramount getting new content from big franchises. Ellison secured the rights to develop, produce and distribute a live-action feature film based on Activision's Call of Duty videogame franchise.","summary":"As CEO and chairman, David Ellison has signed big deals for talent and content as part of his plan to invest in the entertainment company.","url":"https://www.cnbc.com/2025/09/12/david-ellison-ceo-paramount-skydance-merger.html","image":"https://image.cnbcfm.com/api/v1/image/107397352-1712319706304-gettyimages-1916126603-_w2_3502_c3haucbo.jpeg?v=1753394426","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2025/M09D02/7000387449/1756828560-41463039966-hd_L.mp4","publish_date":"2025-09-12 11:00:01","author":"Sarah Whitten","authors":["Sarah Whitten"],"language":"en","source_country":"US","sentiment":-0.005},{"id":359854786,"title":"Trump condemns political violence, but doesn't mention attacks on Democrats","text":"While President Donald Trump has called for an end to political violence following the assassination of Charlie Kirk, he did not recognize or acknowledge the recent threats, violent attacks and killings of Democrats.\n\nDuring his remarks Wednesday night, hours after Kirk, a conservative influencer who worked closely with Trump and his family, was killed, Trump posted a video condemning the shooting and other political violence and brought up some recent examples.\n\n\"From the attack on my life in Butler Pennsylvania last year, which killed a husband and father, to the attacks on ICE agents, to the vicious murder of a health care executive in the streets of New York, to the shooting of House Majority Leader Steve Scalise and three others, radical Left political violence has hurt too many innocent people and taken too many lives,\" he said.\n\nTrump's comments didn't recognize several acts of violence that affected Democratic individuals within the last year.\n\nRELATED: Fatal shooting of Charlie Kirk adds to America's roll call of public violence\n\nOn June 14, a masked gunman police say was disguised as a police officer allegedly shot two Minnesota state legislators and their spouses in their homes.\n\nDemocratic State Rep. Melissa Hortman and her husband Mark were killed along with their dog, and State Sen. John Hoffman, a Democrat, and his wife, Yvette, were shot and wounded.\n\nInvestigators arrested and charged Vance Luther Boelter with the shootings and alleged that he had a hit list with dozens of other targets, including other Democratic lawmakers, abortion providers and pro-choice activists.\n\nBoelter has been charged with state and federal crimes, including murder and animal cruelty, and has pleaded not guilty.\n\nFollowing the Minnesota shooting, Trump called the incident \"absolutely terrible,\" however, he slammed Gov. Tim Walz, a Democrat, and did not call him.\n\n\"I think he's a terrible governor. I think he's a grossly incompetent person. But I may, I may call him, I may call other people too,\" he told ABC News' Rachel Scott on June 15.\n\nVice President JD Vance, Walz's vice presidential opponent during the 2024 election, did contact the governor the day of the shooting, according to sources.\n\nHowever, Trump continued to lambast the governor to the press.\n\nRELATED: While Johnson calls to lower temperature, House Republicans finger-point in Charlie Kirk killing\n\n\"Why would I call him? I could call and say, 'Hi, how you doing?' Uh, the guy doesn't have a clue. He's a mess. I could be nice and call, but why waste time?\" Trump told reporters on June 17.\n\nTrump did call Walz following the Aug. 22 shooting at a Catholic church in Minneapolis, where two children were killed and 21 others were wounded.\n\nThe Minnesota state legislators' shooting took place two months after a Democratic governor and his family were said by police to have been targeted in their own home.\n\nOn April 13, the Pennsylvania governor's mansion was set on fire by a suspect while Gov. Josh Shapiro and his family were celebrating Passover, police said.\n\nNo one was seriously hurt and the suspect, Cody Allen Balmer, turned himself in, according to the police.\n\nBalmer allegedly told police he would have attacked Shapiro with the hammer if he happened upon the governor inside the residence, according to investigators.\n\nBalmer has pleaded not guilty to his charges, which include terrorism.\n\nTrump was asked about the attack a day after and said the suspect was \"just a whack job.\"\n\n\"The attacker was not a fan of Trump. I understand just from what I've read and from what I've been told,\" said Trump, adding that he was not informed of the motive in the incident.\n\n\"The attacker basically wasn't a fan of anybody. Probably just a whack job. And certainly a thing like that cannot be allowed to happen,\" he added.\n\nShapiro told reporters that Trump called him six days after the incident, and that he appreciated the call.\n\n\"He was very gracious,\" Shapiro said.\n\nDespite Trump's lack of acknowledgment of these incidents, other Republicans have mentioned the Democratic targeting in their responses to Kirk's shooting.\n\nUtah Gov. Spencer Cox noted Shapiro's alleged attempted assassination and the Hortmans' deaths during his news conference on Wednesday.\n\n\"When someone takes the life of a person because of their ideas or their ideals, then that very constitutional foundation is threatened,\" he said.\n\n\"Our nation is broken. We've had political assassinations recently in Minnesota. We had an attempted assassination of the governor of Pennsylvania. And we had an attempted assassination on a presidential candidate and former president of the United States, and now current president of the United States. Nothing I say can unite us as a country,\" Cox added.\n\nSeveral Democratic leaders, including former President Joe Biden and Vice President Kamala Harris, also put out statements condemning Kirk's assassination.\n\n\"There is no place in our country for this kind of violence. It must end now. Jill and I are praying for Charlie Kirk's family and loved ones,\" Biden said.","summary":"While President Donald Trump has called for an end to political violence following the assassination of Charlie Kirk, he did not recognize or acknowledge the recent threats, violent attacks and killings of Democrats.","url":"https://abc13.com/post/trump-condemns-political-violence-doesnt-mention-attacks-democrats/17799957/","image":"https://cdn.abcotvs.com/dip/images/17800011_AP25254751191485.jpg?w=1600","video":"https://vcl.abcotv.net/video/wpvi/091225-wpvi-charlie-kirk-political-violence-5a-pkg-video-vid.mp4","publish_date":"2025-09-12 10:25:53","author":"ABCNews,Ivan Pereira","authors":["ABCNews","Ivan Pereira"],"language":"en","category":"politics","source_country":"US","sentiment":-0.267},{"id":359867964,"title":"Walters: Newsom’s social media snark boosting his national standing —  for now","text":"Gov. Gavin Newsom has been waging a media war against President Donald Trump — particularly with uber-snarky social media posts — while promoting a ballot measure aimed at increasing Democrats’ congressional seats, portraying it as a way to blunt Trump’s lust for power.\n\nNewsom clearly seeks recognition as Trump’s most effective political foe, political pundits of all flavors believe, thus positioning himself as the Democratic Party’s leading presidential hopeful in 2028.\n\nIs it working? In purely political terms, yes. In polling and other tests of political sentiment, Newsom appears to have become the unofficial frontrunner, three years before voters will be electing the next president.\n\n“California Gov. Gavin Newsom has seized attention like no other Democrat in President Donald Trump’s second term as he works to position himself as a de facto head of the resistance in a leaderless party,” a recent Washington Post article declared.\n\n“Influencers on both the left and the right have discussed Newsom online more than any other potential 2028 presidential contender since Trump’s inauguration … The attention has been driven by his response to immigration raids in Los Angeles, his efforts to counter a Republican redistricting push and, most recently, his mocking impersonations of Trump’s social media style.”\n\nAlex Hoffman, a Democratic strategist and donor adviser, told the Post: “Democrats are so desperate for leadership right now that they’ll take anything they can get. Gavin is filling a void.”\n\nThis week, Republican pollster Patrick Ruffini published a simulated Democratic primary, placing Newsom in first place in a seven-candidate field with “a 29.7% chance of winning across 10,000 simulations.” He’s followed by progressive firebrand Rep. Alexandria Ocasio-Cortez with a 19.5% chance, former Transportation Secretary Pete Buttigieg at 13.4%, Pennsylvania Gov. Josh Shapiro at 12.2%, Michigan Gov. Gretchen Whitmer at 11.3%, New Jersey Sen. Cory Booker at 9.0%, and Kentucky Gov. Andy Beshear at 5.1%. Former Vice President Kamala Harris was not included in the list.\n\nRuffini cites Newsom’s “best polling at the moment, the second-best fundraising, and ideological positioning in the middle of the party” as his strongest attributes.\n\nIf, indeed, Newsom is laying the groundwork for a 2028 White House bid, he would have to maintain momentum while continuing to govern the state for the next 16 months and move beyond just portraying Trump as the devil incarnate.\n\nIn the meantime, his constituents will feel the impact of Newsom’s feud with Trump. For one thing, those who lost homes and loved ones in the deadly firestorms that swept through Los Angeles neighborhoods this year will probably never see a dime of the $40 billion in federal relief funds Newsom and other officials have sought.\n\nNewsom also faces blowback from the universe of right-leaning podcasts, YouTube channels and social media postings. Video clips from some less savory chapters of Newsom’s personal life and political career are already surfacing, such as his infamously unmasked appearance at a birthday party during the COVID-19 pandemic, his affair with the wife of a close friend while mayor of San Francisco and revelations about his drinking habits.\n\nOne clip shows Newsom in 2007 criticizing and walking away from a reporter who asked him about the drinking. It’s an example of Newsom’s thin skin, which could be a liability if and when he becomes a presidential candidate.\n\nFinally, Newsom’s record as governor will be an issue, with critics citing California’s many unresolved issues, such as homelessness, housing shortages, cost of living and poverty. Just this week, the Census Bureau revealed that when the state’s high living costs are factored in, California continues to have the nation’s highest poverty rate at 17.7%, tied with Louisiana.\n\nDan Walters is a CalMatters columnist.","summary":"\"Democrats are so desperate for leadership right now that they’ll take anything they can get. Gavin is filling a void.”","url":"https://www.mercurynews.com/2025/09/12/walters-newsoms-social-media-snark-boosting-his-national-standing-for-now/","image":"https://www.mercurynews.com/wp-content/uploads/2025/08/PAS-L-6MO-NEWSOM-0708-DC-13.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-12 10:15:13","author":"Dan Walters","authors":["Dan Walters"],"language":"en","source_country":"us","sentiment":0.065},{"id":359868518,"title":"Concealed carry is the way","text":"Unfortunately, Charlotte’s city council is dominated by Democrats 9-2, and former Vice President Kamala Harris won Mecklenburg County by 33 points in 2024. Sadly, the Left has a stranglehold on most major cities. It has spent decades installing pro-crime district attorneys to ensure that violent criminals get off easy. \n\nPolicy reform may be an arduous process, but there are simple steps that can be taken to protect yourself, your family, and your community from the predation of violent offenders, and it all starts with firearm ownership.\n\nTwenty-nine states have enacted constitutional carry, meaning over half of the American population no longer needs a permission slip from the government to exercise their God-given right to self-defense. Fifteen states, including North Carolina, are “shall-issue” states, meaning if an applicant meets certain criteria, the state will issue a concealed carry permit. Only Hawaii, Delaware, Maryland, Connecticut, New Jersey, Massachusetts, and Rhode Island fall into the “may issue” category, meaning the state can subjectively deny citizens their Second Amendment rights.\n\nArmed citizens save lives. Data from the Crime Prevention Research Center shows that armed citizens prevent or end more mass shooting events than the police. A study by Cramer & Burnett found that tens of thousands of crimes are prevented every year by armed citizens, and that in areas that allow concealed carry, defensive gun use increases while crime and crime attempts decrease. According to the National Rifle Association, there are around 2.5 million defensive uses of firearms per year, and in those cases, 15.7% of citizens say the use of their weapon “almost certainly” saved their lives. As firearm ownership increases, crime falls. Violent crime, including gun-related crime, fell in six of Ohio’s eight major cities after the adoption of constitutional carry in 2022. \n\nUnfortunately, a large percentage of violent crime, and almost all mass-shooting events, occur in gun-free zones. Most public transit, like the Charlotte train where Iryna Zarutska was murdered, does not allow citizens to carry guns. Mass boycotts could push politicians to change these policies. Criminals are far less likely to offend when they fear a decisive and lethal response from their would-be victims. \n\nCHARLIE KIRK SHOT DEAD: TURNING POINT USA FOUNDED FUELED TRUMP’S RISE THROUGH ‘COMMON SENSE’ MESSAGING\n\nIf an armed citizen had been on that train with Decarlos Brown Jr. and Iryna Zarutska, the latter might still be alive.\n\nThere are excellent firearms instructors and gun ranges all over the country. If you are worried about the rise of violent crime in your area, I strongly recommend you purchase a gun, train with it, learn the gun laws of your state and city, and carry daily. \n\nBrady Leonard (@bradyleonard) is a musician, political strategist, and host of The No Gimmicks Podcast.","summary":"Conservatives are justifiably furious following the brutal murder of Ukrainian refugee Iryna Zarutska by career criminal Decarlos Brown Jr. in Charlotte, North Carolina. We recognize that this tragedy was the result of a terrible policy choice. The perpetrator had over a dozen prior arrests for assault, breaking and entering, armed robbery, possession of a firearm by a felon, [&#8230;]","url":"https://www.washingtonexaminer.com/restoring-america/courage-strength-optimism/3803737/crime-concealed-carry-iryna-zarutska-murder/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP19255454139807-e1757607624309.jpg?w=650","video":null,"publish_date":"2025-09-12 10:00:00","author":"Brady Leonard","authors":["Brady Leonard"],"language":"en","source_country":"US","sentiment":-0.269},{"id":359853578,"title":"“Democratic Donors Reluctant to Fund Biden’s Presidential Library”","text":"Former President Joe Biden is running into a problem in his nascent effort to raise money for a presidential library: Donors are checked out.\n\n“I want an $800,000 refund,” claimed John Morgan, a personal injury lawyer from Florida. He was referencing the nearly $1 million he stated was raised for Biden, which eventually went to then-Vice President Kamala Harris the previous year after she took over Biden’s position as the Democratic presidential nominee.\n\n“I don’t believe a library will ever be built unless it’s a bookmobile from the old days,” added Morgan, who is a longtime Biden devotee.\n\nSusie Buell, a major donor in the Democratic Party, said, “No one has asked, but I am not inclined to give to libraries.”\n\n“I’d like him to have some nice library,” a third donor chimed in. “I just don’t see that’s where I’m going to spend my money.”\n\nAnd a fourth, who was a Biden bundler and onetime administration official, replied succinctly: “Me? No way.”\n\nMost of the more than six individuals who had previously been significant Biden donors or bundlers spoke with NBC News and expressed that they held no resentment towards Biden personally. However, they either planned not to donate to the library or would only contribute a nominal amount. Several of these individuals requested to remain anonymous to speak candidly.\n\nThe reasons they cited ranged from not wanting to become a target for the White House to reserving their financial influence for the party’s future. Some pointed to unpleasant personal interactions with Biden’s inner circle as a significant obstacle to raising substantial funds for the 46th president of the United States.\n\nBiden also faces lingering discontent from the party regarding his choice to run for a second term despite health concerns. His subsequent late exit from the nomination process, after displaying mental frailties during a televised debate in June 2024, further disrupted the party.\n\nRufus Gifford, who managed fundraising for Biden’s re-election campaign and served as finance director for President Barack Obama, was appointed as chairman of the library board. He expressed optimism that, regardless of some challenges, donors will be interested in supporting the project.\n\n“Those of us who have been involved for a long time and care deeply for him, while understanding the complete picture, are keen to explore what we can do to uphold and advance his legacy,” stated Gifford. “This is not about the past. It is focused on the future.”\n\nOne person familiar with the Biden team’s plans said the project would have a goal of bringing in between $200 million and $300 million. That’s far from the more than $850 million cost of the Obama Presidential Library, due to open in Chicago in the spring. While still in office, President Donald Trump has commanded millions of dollars for a future library — something Democrats have decried as fundraising without guardrails — not to mention a controversial decision that the U.S. Air Force acquire an opulent 747 megajet from the Qatari royal family that is later to be transferred to a Trump library foundation.\n\n“It is my opinion no significant building will be built,” Morgan went on, saying his suggestion of a bookmobile was a joke, “but not by much.” He cited Biden’s age — 82 — and medical issues as reasons the former president might not be much help raising money for the library. “Couple that with the perception that [the party’s] woes rest with his decision to seek a second term and we have the Hindenburg heading straight towards us.”\n\nThose who frequently interact with major Democratic donors say there are other obstacles.\n\n“This is a very difficult time to raise large checks for Democrats because of how vindictive Donald Trump is,” Democratic National Committee fundraising chair Chris Korge said, citing conversations with big-money donors.\n\nAnd donors long groaned about a lack of access to the former president when he was in office. They said they were tapped time and again to write checks but then couldn’t get a phone call returned, with some blaming a close-knit circle for isolating the president — only for contributors to later find out he was showing signs of mental decline.\n\nKorge said early on he had more than once personally urged Biden and his team to focus on raising money for a library and to perhaps put aside ambitions to seek a second term.\n\n“I did tell them that if Biden didn’t run [in 2024] he would go out as a hero, and he could focus the last two years of his term on setting himself up to raise a lot of money for the library,” Korge said.\n\nAs for Biden’s ability to tap major funds from donors today, Korge said presidents have unique opportunities to put themselves in front of some of the most influential people in the country and that “in retrospect he probably should have done more of that.”\n\nKorge cited a farewell dinner that Biden held at the White House last year as an example of a large-scale, pull-out-all-the-stops event that wooed political fundraisers. But by then, he said, it was too late.\n\n“It was one of the most spectacular dinners I had ever been invited to at the White House,” said Korge, who has spent decades raising money for Democratic presidential candidates. “[But] it was after the election. He should have done more of that in my opinion.”\n\nFor many Democrats, the future is about funding campaigns between now and next year’s midterm elections.\n\nNikki Fried, the chair of the Florida Democratic Party, said she had not heard about the Biden library effort and is skeptical about the appetite to give at a time when there are competing demands for cash.\n\n“They want a plan of how we’re going to save democracy and how we’re going to put this country back onto a better page and turn the page of the Trump administration and the destruction of our economy and international affairs,” Fried said. “I don’t know if the donors will be ready to give dollars to you to a library when we’ve got real issues to focus on today.”\n\nMore broadly, she said, fundraising has been a challenge across the board for Democrats because donors are still furious about flooding coffers with money in 2024 and losing anyway.\n\n“This ecosystem, the last cycle, raised more money than probably has ever been raised, and we don’t have Congress, we don’t have the White House, and we don’t have additional powers at the state level,” she said. “And so there’s a real conversation happening about where we go from here and how do we do things differently, and donors on the national level are holding back dollars until they have a game plan.”\n\nAnother prominent donor with close ties to Biden said he might make a “token” donation to the Biden library effort if asked, but he would not give a large amount of money.\n\n“With everything that’s going on in our country right now, there are so many important things that need to be funded,” the donor said.\n\nHe said he sees the library effort, which he has not yet been contacted about, as a difficult one for Biden because the former president’s base of committed donors is small. Biden started with a small set of fundraising heavyweights, did not hand out many plum posts to top givers and was not good at making his donors feel appreciated, this person said. Biden’s age figures to make the raising effort even harder.\n\nThe person characterized the obstacles ahead.\n\n“I don’t think ‘hill’ is the proper term,” he said. “It’s going to be much steeper than that.”\n\nA major donor who was part of the administration emphasized Biden’s decision not to use a greater number of ambassadorship appointments as a way to reward — and woo — tycoons.\n\n“There’s a reason why ambassadors are wealthy people — because you need them at some point,” this person said.\n\nA former bundler who was historically involved in Biden fundraising pointed to the publication of books reliving the Democrats’ 2024 travails and the drag they are having on a party that needs to finally move forward.\n\n“Democrats need to pick themselves up and start doing and stop whining and complaining about what happened,” the person said. “Joe Biden has been a public servant to this country on the world stage for decades, we owe him a huge debt of gratitude.”\n\n“The ending was not pretty, we all know that,” the person said. “But the country and he deserves a foundation and library museum.” \n\nWould this person ante up for it, then? “Nobody’s asked me,” the person said.\n\nWould they volunteer the money? “I don’t know.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer President Joe Biden is running into a problem in his nascent&#8230;\n\n\nThis Post: &#8220;Democratic Donors Reluctant to Fund Biden&#8217;s Presidential Library&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/democratic-donors-reluctant-to-fund-bidens-presidential-library/","image":"https://internewscast.com/wp-content/uploads/2025/09/039No-way039-Democratic-donors-balk-at-donating-to-Biden039s-presidential.jpg","video":null,"publish_date":"2025-09-12 09:49:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.072},{"id":359868036,"title":"Dems More Likely to Think Celebrating Public Figure's Death Acceptable—Poll","text":"A new poll shows a sharp partisan divide over reactions to political violence, with Democrats more likely than Republicans to say it is acceptable to celebrate the death of a public figure.A YouGov poll conducted on September 11 among 2,623 adults found that 11 percent of Democrats said it is \"always\" or \"usually\" acceptable to celebrate the death of a public figure they oppose, compared to six percent of Republicans.Meanwhile, 71 percent of Democrats and 89 percent of Republicans said it is \"usually\" or \"always\" unacceptable.Overall, nine percent of Americans say it is acceptable to celebrate such a death, while 78 percent said it is unacceptable.Why It MattersThe survey comes just after the founder of right-wing youth organization Turning Point USA and a longtime ally of President Donald Trump, Charlie Kirk, was fatally shot in Utah on Wednesday.Kirk's death has provoked strong reaction online, with some prominent MAGA figures blaming the \"radical left\" for his death and even calling for \"war\", while some critics of Kirk and his views have celebrated his death.His shooting, and the mockery from some social media users, demonstrates just how divided American politics has become. It follows a string of attacks on prominent political figures, including Trump, who narrowly survived an assassination attempt in June 2024, while in June of this year, a Democratic lawmaker was shot dead in Minnesota.What To KnowWhile the vast majority of reaction from Democrats and liberals has condemned Kirk's death, some accounts have celebrated it. On X, Brandy Bryant, a self-styled transgender comedian with 21,000 followers on the platform, posted: \"Breaking: Charlie Kirk loses gun debate.\"The post went viral, racking up over 45,000 reposts, 424,000 likes and 12 million views.Bryant later added: \"These people openly get off talking about eradicating trans people and y'all think I got any sympathy for them? Get the f*** out of here.\"Another X user shared a seven-second video of a man laughing while sitting next to a woman, with the caption: \"charlie kirk, an advocate for the approval of guns, got shot in the neck.\" This received over 940,000 views on the platform.The TikTok user angelasrightofficial, who has 88,000 followers, shared a video of herself commenting: \"Live by the sword, die by the sword. He did say that gun deaths were an acceptable side effect of gun rights.\"This clip was shared on X by the Wall Street Apes account, which added: \"Liberals are celebrating Charlie Kirk's death.\" The post received over 3.6 million X views.The original TikTok user appeared to be referencing comments Kirk made about gun deaths in April 2023, when he said: \"I think it's worth it. I think it's worth to have a cost of, unfortunately, some gun deaths every single year so that we can have the Second Amendment to protect our other God-given rights.\"YouGov polling from September 11 shows that 55 percent of Republicans agree with this point of view, compared to only 10 percent of Democrats.The president-elect of the Oxford Union debating society in the UK has also come under fire after he posted comments in a WhatsApp group saying: \"Charlie Kirk got shot, let's f***ing go\", while another thought to have been posted on Abaraonye's Instagram account read \"Charlie Kirk got shot loool,\" according to the Daily Telegraph.But some commentators have condemned such reactions. British broadcaster Piers Morgan on X commented: \"Seeing so many clips/posts of supposedly 'kind tolerant' liberals gleefully celebrating Charlie Kirk's murder. They're so utterly disgusting.\"New York Times columnist Ezra Klein wrote: \"It's ghoulish to mock or justify the shooting of Charlie Kirk. Rising political violence is a horror of our time. Unchecked it will lead to catastrophes none of us want to imagine. Deeply hoping he pulls through. We are all people, whatever we believe. That has to come first.\"Meanwhile, prominent MAGA-aligned figures have responded to the assassination of Kirk with combative and incendiary rhetoric, framing the killing as a politically motivated attack and casting it as a call to fight back against \"the left.\"The shooter's motive and political ideology remain unknown, and they are still being sought by the FBI.Elon Musk saw it as an attack tied to \"the left\" and free speech. \"If they won't leave us in peace, then our choice is fight or die,\" he said.Trump issued an Oval Office video tribute, calling Kirk's death a \"dark moment\" and blaming \"radical left\" rhetoric. Far-right activist Laura Loomer also blamed \"lunatic leftists.\"\"We must shut these lunatic leftists down. Once and for all. The Left is a national security threat,\" she wrote on X.Infowars host Alex Jones escalated the rhetoric further, framing the assassination as a call to \"war,\" while influencer and self-proclaimed misogynist Andrew Tate called for \"civil war.\"Amid the reaction, some have called for an end to political division and violence, including Utah's Republican Governor Spencer Cox. \"Our nation is broken,\" he said, pleading that \"all of us will try to find a way to stop hating our fellow Americans.\"But YouGov polling reveals a strongly polarized electorate. According to a September 11 survey, Democrats are more likely than Republicans to say it is justified for citizens to resort to violence in order to achieve political goals.The poll shows that 14 percent of Democrats hold that view, compared to six percent of Republicans. Meanwhile, 72 percent of Democrats and 81 percent of Republicans say it is never justified.Republicans also see political violence as a bigger problem than Democrats do. According to the poll, 58 percent of Republicans and 68 percent of Democrats said political violence is a \"big problem,\" while 32 percent of Republicans and 22 percent of Democrats described it as \"somewhat of a problem.\"The partisan divide deepens when asked about which side poses the greater threat. Sixty-six percent of Republicans said left-wing violence is the bigger problem for the U.S. today, while 62 percent of Democrats said right-wing violence is the bigger concern.Research has consistently shown that right-wing political violence is more common in the United States. A University of Maryland study from 2022 found that right-wing extremist attacks are at least as likely as Islamist extremist violence. A study by the Anti-Defamation League found that between 2013 and 2022, 75 percent of extremist-related deaths were linked to right-wing terrorism.What People Are SayingWriter and podcaster Stephen Knight wrote on X: \"Excuse-making and even open endorsement of violence in response to speech isn't confined to clueless students. It runs through the so-called 'liberal' left at every level. It's mainstream, and it's shameful.\"Witnessing the grotesque reaction to Charlie Kirk's murder will have changed decent people. Forever. The far-left has simply forced many reasonable people to wake up and pick a side. And it's not going to be theirs.\"Conservative commentator Blaire White posted: \"The people mocking Charlie Kirk's murder are the same people who would film someone dying on a train instead of help. They live amongst us and larp as human beings.\"Former president Barack Obama said on X: \"We don't yet know what motivated the person who shot and killed Charlie Kirk, but this kind of despicable violence has no place in our democracy. Michelle and I will be praying for Charlie's family tonight, especially his wife Erika and their two young children.\"Former vice president Kamala Harris wrote on X: \"Let me be clear: Political violence has no place in America. I condemn this act, and we all must work together to ensure this does not lead to more violence.\"What Happens NextPolice are continuing to search for the shooter behind Wednesday's attack on Kirk. The FBI will provide up to $100,000 for information that helps law enforcement identify and arrest the person or people responsible for the assassination.","summary":"Police are still searching for Charlie Kirk's killer, with the FBI offering up to $100,000 for information that helps in their identification.","url":"https://www.newsweek.com/charlie-kirk-shooting-poll-democrats-2128761","image":"https://d.newsweek.com/en/full/2721109/charlie-kirk.jpg?w=1600&h=900&q=88&f=59f5bbaa9084115273cc5438c1de5d40","video":null,"publish_date":"2025-09-12 09:42:18","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","source_country":"US","sentiment":-0.063},{"id":360004780,"title":"Letter to the editor- The atrocious irony of the unhinged left","text":"Thursday’s Washington Times front-page article “Conservative activist assassinated” reports that the petition signed by 944 people to bar Charlie Kirk from the campus of Utah Valley University reads, in part: “Charlie Kirk is known for his divisive rhetoric that often supports policies and laws which aren’t inclusive or marginalize various communities.”\n\nA view of the past several months (and even years) has shown that the political left is unhinged to the point of routinely killing or attempting to kill those who disagree with its political culture of death. Even Minnesota Gov. Tim Walz, the ailed running mate of Kamala Harris, is guilty of language — a poorly disguised joke — that, at the very least, suggests the untimely demise of President Trump. This came just hours after the horrific events at Annunciation School in Minneapolis last month.\n\nWhat kind of ideology drives this anger and hatred toward others while claiming to be inclusive of those of diverse opinion?\n\nWhat is truly “divisive,” exclusionary and marginalizing are not the words of civil discourse and rhetoric but rather the finality of taking of the life of another person. The killing of Charlie Kirk and the high-profile shootings at churches and Christian schools have been undertaken not by those who have chosen rhetoric as their means of opposition to leftist tyranny but rather by those who wish to stifle free speech and impose leftist tyranny without debate or dialogue. They choose premeditated murder to advance their agenda.\n\nIronically, the party that is against law-abiding citizens owning guns for self-protection is the same crowd whose followers have taken up guns to silence those with whom they disagree. This is indeed unrighteous and hypocritical behavior of the highest order. Kirk’s death is just another vivid indicator of this truth.\n\nDAVID P. LAMONT\n\nDunnellon, Florida","summary":"Letter to the editor- The atrocious irony of the unhinged left","url":"https://www.washingtontimes.com/news/2025/sep/11/letter-editor-atrocious-irony-unhinged-left/","image":"https://media.washtimes.com/media/image/2023/08/11/080823-twt-promo-editor-900x542.jpeg","video":null,"publish_date":"2025-09-12 09:34:00","author":null,"language":"en","source_country":"au","sentiment":0.103},{"id":359871748,"title":"The party of careerists","text":"NBC News asked nearly 3,000 Gen Zers for their top priorities in life. Specifically, it asked, “Which of the following is important to your personal definition of success?”\n\nRespondents chose up to three from a menu of 12. Among Gen Zers who voted for former Vice President Kamala Harris, a majority of both men and women picked “fulfilling job/career” as important. No other answer got a majority from any group.\n\nIn contrast, less than one-third of Donald Trump voters, both men and women, chose “fulfilling job/career” as important to success.\n\n“Having money to do the things you want” was the No. 2 pick for both Democratic men and women, chosen by more than 40%, while less than 30% of Republican men and women named that, putting it in fifth place.\n\nCareer and money — material, measurable, achievement. That’s what matters to young Democrats.\n\nWhat did Republicans pick? The most common choice among Republican men was having children. Combined, 30% of Republican men and women named children as important to a successful life, about four times the proportion of Democrats who named children.\n\nLikewise, about 25% of Trump voters named “being married” as important, compared to less than 10% of Harris voters.\n\nHow did the Democrats, formerly the home to hippies and derided as the party of welfare queens, become the party of materialist careerists?\n\nThere were a few steps to this transition.\n\nFirst, the Left’s feminism saw that men and women were different, men more career-focused and women more family-focused, and decided that equality required women becoming company men rather than men becoming family guys. Author and mother Ruth Whippman mocked the attitude: “Women! Be more like men. Men, as you were.”\n\nAlong the same lines, the “my body, my choice” mentality expanded into a broad worship of individual autonomy as the sole good. Add in the increasingly uniform secularism of Democrats, and autonomy became a God.\n\nAbsent religion — that is, with less hope, without the commandments to sacrificial love, without a nonmaterial idea of the good to aspire to — it was inevitable that the Democrats and the Left would become more materialistic.\n\nThen the college-educated upper-middle class steadily abandoned Republicans — and then quickly abandoned them when the gauche Trump entered the scene.\n\nPerhaps Generation Z Democrats will wisen up when they get older. Hopefully, they’ll settle down, get married, have children, and value little Emma’s softball game over that promotion and raise.\n\nIf not, America’s future could be one party with all the money and the other with all the children.","summary":"What do you get when the party of feminism joins up with the party of the upper-middle-class strivers? You get today’s Democratic Party, where career achievement and material success become all-consuming goals in life. NBC News asked nearly 3,000 Gen Zers for their top priorities in life. Specifically, it asked, “Which of the following is [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/3801347/democratic-party-of-careerists/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/YL.PartyCareerist.091725.jpg?w=696","video":null,"publish_date":"2025-09-12 09:10:00","author":"Timothy P. Carney","authors":["Timothy P. Carney"],"language":"en","source_country":"us","sentiment":0.248},{"id":359841420,"title":"'No way': Democratic donors balk at donating to Biden's presidential library","text":"Former President Joe Biden is running into a problem in his nascent effort to raise money for a presidential library: Donors are checked out. “I want an $800,000 refund,” said John Morgan, a Florida-based personal injury lawyer. He was referring to the nearly $1 million he said he raised for Biden that went to then-Vice President Kamala Harris last year, after she assumed Biden’s role as the Democratic presidential nominee. “I don’t believe a library will ever be built unless it’s a bookmobile from the old days,” added Morgan, who is a longtime Biden devotee. Susie Buell, a major donor in the Democratic Party, said, “No one has asked, but I am not inclined to give to libraries.” “I’d like him to have some nice library,” a third donor chimed in. “I just don’t see that’s where I’m going to spend my money.” And a fourth, who was a Biden bundler and onetime administration official, replied succinctly: “Me? No way.” Most of the more than half a dozen people who were once major Biden donors or bundlers who spoke with NBC News said they harbored no ill will toward Biden himself but either wouldn’t give to the library or would give only a token amount. A number of them requested anonymity to speak frankly. They cited a range of factors, from not wanting to make themselves a target of the White House to holding their financial firepower for the party’s future. Some cited personal interactions with Biden’s inner circle as being so distasteful they believed it would be a barrier to ever raising significant funds for the 46th president of the United States. Biden also faces residual anger from the party over his decision to seek a second term despite health issues. Biden then upended the party’s nomination process with a late exit after his mental frailties were in full view during a June 2024 televised debate. Rufus Gifford, who led fundraising for Biden’s re-election campaign and was finance director for President Barack Obama, was named chairman of the library board. He said he is optimistic that, despite some of the challenges, donors will want to sign on to the project. “Those of us who have been around for a while and love the guy but also understand the full picture want to see what we can do to protect and promote his legacy,” Gifford said. “This isn’t about the past. It’s about the future.” One person familiar with the Biden team’s plans said the project would have a goal of bringing in between $200 million and $300 million. That’s far from the more than $850 million cost of the Obama Presidential Library, due to open in Chicago in the spring. While still in office, President Donald Trump has commanded millions of dollars for a future library — something Democrats have decried as fundraising without guardrails — not to mention a controversial decision that the U.S. Air Force acquire an opulent 747 megajet from the Qatari royal family that is later to be transferred to a Trump library foundation. “It is my opinion no significant building will be built,” Morgan went on, saying his suggestion of a bookmobile was a joke, “but not by much.” He cited Biden’s age — 82 — and medical issues as reasons the former president might not be much help raising money for the library. “Couple that with the perception that [the party’s] woes rest with his decision to seek a second term and we have the Hindenburg heading straight towards us.” Those who frequently interact with major Democratic donors say there are other obstacles. “This is a very difficult time to raise large checks for Democrats because of how vindictive Donald Trump is,” Democratic National Committee fundraising chair Chris Korge said, citing conversations with big-money donors. And donors long groaned about a lack of access to the former president when he was in office. They said they were tapped time and again to write checks but then couldn’t get a phone call returned, with some blaming a close-knit circle for isolating the president — only for contributors to later find out he was showing signs of mental decline. Korge said early on he had more than once personally urged Biden and his team to focus on raising money for a library and to perhaps put aside ambitions to seek a second term. “I did tell them that if Biden didn’t run [in 2024] he would go out as a hero, and he could focus the last two years of his term on setting himself up to raise a lot of money for the library,” Korge said. As for Biden’s ability to tap major funds from donors today, Korge said presidents have unique opportunities to put themselves in front of some of the most influential people in the country and that “in retrospect he probably should have done more of that.” Korge cited a farewell dinner that Biden held at the White House last year as an example of a large-scale, pull-out-all-the-stops event that wooed political fundraisers. But by then, he said, it was too late. “It was one of the most spectacular dinners I had ever been invited to at the White House,” said Korge, who has spent decades raising money for Democratic presidential candidates. “[But] it was after the election. He should have done more of that in my opinion.” For many Democrats, the future is about funding campaigns between now and next year’s midterm elections. Nikki Fried, the chair of the Florida Democratic Party, said she had not heard about the Biden library effort and is skeptical about the appetite to give at a time when there are competing demands for cash. “They want a plan of how we’re going to save democracy and how we’re going to put this country back onto a better page and turn the page of the Trump administration and the destruction of our economy and international affairs,” Fried said. “I don’t know if the donors will be ready to give dollars to you to a library when we’ve got real issues to focus on today.” More broadly, she said, fundraising has been a challenge across the board for Democrats because donors are still furious about flooding coffers with money in 2024 and losing anyway. “This ecosystem, the last cycle, raised more money than probably has ever been raised, and we don’t have Congress, we don’t have the White House, and we don’t have additional powers at the state level,” she said. “And so there’s a real conversation happening about where we go from here and how do we do things differently, and donors on the national level are holding back dollars until they have a game plan.” Another prominent donor with close ties to Biden said he might make a “token” donation to the Biden library effort if asked, but he would not give a large amount of money. “With everything that’s going on in our country right now, there are so many important things that need to be funded,” the donor said. He said he sees the library effort, which he has not yet been contacted about, as a difficult one for Biden because the former president’s base of committed donors is small. Biden started with a small set of fundraising heavyweights, did not hand out many plum posts to top givers and was not good at making his donors feel appreciated, this person said. Biden’s age figures to make the raising effort even harder. The person characterized the obstacles ahead. “I don’t think ‘hill’ is the proper term,” he said. “It’s going to be much steeper than that.” A major donor who was part of the administration emphasized Biden’s decision not to use a greater number of ambassadorship appointments as a way to reward — and woo — tycoons. “There’s a reason why ambassadors are wealthy people — because you need them at some point,” this person said. A former bundler who was historically involved in Biden fundraising pointed to the publication of books reliving the Democrats’ 2024 travails and the drag they are having on a party that needs to finally move forward. “Democrats need to pick themselves up and start doing and stop whining and complaining about what happened,” the person said. “Joe Biden has been a public servant to this country on the world stage for decades, we owe him a huge debt of gratitude.” “The ending was not pretty, we all know that,” the person said. “But the country and he deserves a foundation and library museum.” Would this person ante up for it, then? “Nobody’s asked me,” the person said. Would they volunteer the money? “I don’t know.”","summary":"Former President Joe Biden is running into a problem in his nascent effort to raise money for a presidential library: Donors are checked out.“I want an $800,000 refund,” said John Morgan, a Florida-based personal injury lawyer.","url":"https://www.nbcnews.com/politics/joe-biden/democratic-donors-balk-donating-biden-presidential-library-rcna230452","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-09/250910-joe-biden-se-356p-f9545d.jpg","video":null,"publish_date":"2025-09-12 09:00:42","author":"Jonathan Allen,Natasha Korecki","authors":["Jonathan Allen","Natasha Korecki"],"language":"en","category":"politics","source_country":"us","sentiment":-0.093},{"id":359841416,"title":"CBS shifts to accommodate the right under new owner","text":"CBS's new corporate owner has taken a series of concrete steps to address the concerns of the news division's sharpest critics — particularly President Trump and his allies.\n\nIn recent days, the network selected a new ombudsman for CBS News with strong conservative credentials. It promised to run full, unedited interviews on a key public affairs show after receiving blowback from Homeland Security Secretary Kristi Noem. And it's in talks to bring on a top news executive who believes the mainstream press is reflexively biased.\n\nAll of these decisions have come from top officials at Paramount under the new ownership of Skydance Media. And they represent a grand accommodation to Trump by CBS, known for its rich legacy of journalistic touchstones spanning back to the dawn of television news, including Edward R. Murrow, Walter Cronkite and 60 Minutes.\n\nIts coverage of the assassination of John F. Kennedy, the Vietnam War, U.S. astronauts walking on the Moon, Watergate, and the Tiananmen Square massacre helped to define those events for Americans. In recent years, some of its most prominent correspondents have covered Trump aggressively. And Trump has attacked the network in his public statements.\n\nThese latest moves under Skydance follow a $16 million payment by CBS's previous owner to settle a lawsuit Trump brought against the network and regulatory pressure by Trump's chief broad cast regulator against the sale. Even since CBS changed hands, it has not escaped the wrath of the Trump administration. Recently, the White House and Homeland Security Secretary Kristi Noem lambasted the network over the handling of a recent interview.\n\nNow, the Wall Street Journal reports that the company wants to acquire Warner Bros. Discovery - the owner of Warner Bros. studios, HBO Max, and cable news giant CNN. Such grand ambitions would have to pass muster with Trump administration regulators once more. And also raise questions on CNN's direction under Skydance, were that to come to pass.\n\nParamount Global, CBS and CBS News have declined to comment. \n\nSkydance is run by its founder, David Ellison. He's the producer (along with Paramount Pictures) of Tom Cruise's Mission: Impossible movie franchise, among other properties. He is also the son of Oracle founder Larry Ellison, one of the richest people in the world and a vocal backer of President Trump.\n\nDiscussions to give Bari Weiss news leadership role\n\nAmong the moves being discussed is one to bring a contrarian journalist on board to steer CBS News. Skydance is in talks to pay $100 million or more to acquire the buzzy digital news and opinion startup The Free Press, which has drawn a lot of headlines, paying subscribers, and investors in its four-and-a-half years. Outside analysts tell NPR the valuation appears high - above what the market might price it as being worth — yet is also an indication of Ellison's desire to work with its founder, Bari Weiss.\n\nWeiss' launch of The Free Press in 2021 was nearly pitch-perfect. It played into the backlash against the social progress movement of the previous year that presaged Trump's return to office.\n\nWeiss delivered a blast at what she says is bias in the mainstream media, including at The New York Times, where she was an opinion editor. Among the examples of ensuing coverage: essays focusing on a perceived pro-Palestinian slant in the media's coverage of Israeli military's actions in the Israel-Hamas war and accusations that NPR's reporting has a liberal slant.\n\nShe appears unlikely to run CBS News on a day-to-day level or to oversee logistics. Should the deal be consummated, it seems likely she would operate as a senior news executive shaping the strategy and tone of its reporting, helping to ensure its overall coverage is headed in a desired direction.\n\nYet the very nature of her role has been one of the sticking points in negotiations, according to two people with knowledge; Weiss has eyed the top news post but has never worked in a broadcast news shop. (The two people spoke on condition of anonymity to characterize private negotiations.)\n\nChallenges of streaming age convinced previous owner to sell \n\nEllison bought Paramount from Shari Redstone, the former controlling owner. She was proud of her family's legacy for decades but had become convinced that her properties' value would decline as they struggled to compete with streaming giants with deeper pockets at Netflix, Amazon, Apple and Disney.\n\nRedstone also had bristled at some of CBS's coverage of the Israel-Hamas war. She appointed a veteran news executive with whom she was close, Susan Zirinsky, to oversee 60 Minutes and other top shows.\n\nRedstone also was eager to settle a lawsuit brought by President Trump last fall over a 60 Minutes interview with then-Vice President Kamala Harris. The network aired two different excerpts of her response to a question about Gaza – one on 60 Minutes and the other on Face the Nation. Though in sum the two shows presented nearly every word of her response, Trump argued that CBS had sought to obscure what he said was her incoherence on the subject.\n\nAs the company pushed closer to a settlement, the executive producer of 60 Minutes and CBS' news and stations president left (though they were replaced by veteran journalists who are well regarded within the network). CBS ultimately paid out to settle Trump's claims. \n\nUnder Redstone, CBS also decided to drop the late-night show of Stephen Colbert, who frequently mocks the president. The network cited financial challenges for the late night sector.\n\nA promise to a key regulator to appoint an ombudsman \n\nThe Federal Communications Commission, led by Trump appointee Brendan Carr, reviewed Redstone's sale of the controlling stake in Paramount Global to Ellison because it involved the transfer of the broadcast licenses of 22 local television stations. He approved the deal after the settlement of Trump's lawsuit — but with several conditions. One was the appointment of an ombudsman for CBS News to review complaints about news coverage. (While increasingly rare, several news organizations still have these roles. NPR has a public editor, Kelly McBride, who is a senior vice president at the Poynter Institute, the St. Petersburg, Fla., journalism center.)\n\nEllison tapped Kenneth Weinstein, the former president and chief executive of the Hudson Institute, a conservative think tank that focuses on military and national security matters. In 2020, Trump had nominated Weinstein to be U.S. ambassador to Japan. He received bipartisan support from the Senate Foreign Relations Committee but his nomination expired without a full vote by the Senate.\n\nWeinstein has no conventional journalistic background. He served several years on the board that oversaw the federal agency that includes the Voice of America, Radio Free Europe/Radio Liberty, and other international broadcasters funded by the federal government. Several journalists and public officials say he acted in a nonpartisan way.\n\nWeinstein is to report directly to Paramount President Jeff Shell, who served with him on that board. Weinstein will also report to George Cheeks, who oversees Paramount's TV business. Most news ombudsmen have public-facing elements to his job; it is not clear whether Weinstein will present his findings publicly.\n\nIn a statement accompanying the announcement of his appointment at CBS, Weinstein said it was an honor and called the network \"one of the most respected journalistic institutions in the world.\"\n\n\"I look forward to supporting the talented team behind its reporting and to stewarding public trust in this critical institution,\" Weinstein said.\n\nCarr said the ombudsman role would ensure \"a diversity of viewpoints from across the political and ideological spectrum.\"\n\nThe lone Democratic commissioner on the FCC, Anna Gomez, suggested Weinstein would be a check on the independence of CBS News chief Tom Cibrowski. \"The job of this FCC-imposed 'truth' monitor must not be to judge whether independent reporting conforms to this Administration's views and priorities,\" Gomez posted on social media. \"That's a clear violation of the First Amendment and the law.\"\n\nMore promises and more changes\n\nEllison also pledged in a meeting with Carr prior to the FCC's approval that the network would scrap its diversity, equity and inclusion initiatives if the sale went through.\n\nTrump has claimed there is still more — a side deal. He says he will receive $20 million worth of public service announcements for causes dear to him. Paramount and CBS have not confirmed that deal. \n\nThe network also unexpectedly announced that its Sunday public affairs show, Face the Nation, would only broadcast unedited interviews presented either live or as if they were broadcast live - no edits. Noem and the White House had complained after it had trimmed several minutes from an extended interview with her.\n\nThe full transcript shows, among other things, that CBS excised Noem's allegations that Kilmar Abrego Garcia was known to be an MS-13 gang member and had solicited nude photos from minors.\n\nThose allegations have not been adjudicated in court. Garcia has denied being an MS-13 gang member. He was charged with conspiracy to transport undocumented people and transporting undocumented people, and has denied those charges. Garcia has not been charged with allegedly soliciting nude photos from minors.\n\nThe Trump administration, which says it deported Garcia to be incarcerated in El Salvador in an administrative error despite a protective order, now says it intends to transport him to the South African nation of Eswatini. There is a hearing set for federal court next month.\n\nCBS' decision to edit out some of Noem's remarks set off sharp rebukes from Trump's allies. Yet interviews on news networks — including NPR — are often taped and then boiled down to their most relevant and compelling elements.\n\n\"Fact-checking in real time is damn hard,\" says Tom Bettag, a former top executive at CBS News and ABC News. \"The subject knows he can filibuster - that you have a limited amount of time and that they can run out the clock. If they do not want to answer the question they can just keep avoiding, avoiding, avoiding.\"\n\nIn 1988, when Bettag was executive producer of the CBS Evening News, he and anchor Dan Rather sought to do an interview with then-Vice President George H.W. Bush during the presidential campaign; they wanted the interview so much that they agreed Rather would question Bush live on the show.\n\nA top Bush campaign consultant, future Fox News Chairman Roger Ailes, had arranged the appearance. He was just off camera as Rather asked the vice president about the Iran-Contra scandal.\n\n\"We never got an answer,\" Bettag said. \"Bush got in all the punches [at Rather] he wanted, and Roger Ailes was sitting beside Bush just cackling.\" Rather ended up shouting at Bush; Bettag calls it one of the worst mistakes of his long television news career.\n\n\"To make editing a dirty word - the politicians win,\" Bettag said.","summary":"CBS's new owner, David Ellison, has taken concrete steps to address the concerns of the news division's sharpest critics — particularly President Trump and his allies.","url":"https://www.npr.org/2025/09/12/nx-s1-5537152/cbs-news-ellison-steps-appease-trump","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2954+0+0/resize/4000x2954!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F29%2F63%2F9f86f2494af8aa3a63c3bf35f6ff%2Fgettyimages-2228955992.jpg","video":null,"publish_date":"2025-09-12 09:00:00","author":"David Folkenflik","authors":["David Folkenflik"],"language":"en","source_country":"US","sentiment":0.036},{"id":359813004,"title":"What were Charlie Kirk's views that so angered some and energised others?","text":"Assassinated right-wing activist Charlie Kirk was an icon for young conservatives in the USA and Australia — a pro-Trump, pro-gun, anti-Islam, anti-abortion and anti-transgender Christian nationalist who also endorsed a range of conspiracy theories from the \"Great Replacement\", to America's '\"stolen\" 2020 election.\n\nBorn in 1993 in an affluent suburb of liberal-leaning Chicago, Illinois — a deep blue state — Kirk got involved in Republican politics at high school, writing early on for right-wing news and opinion website Breitbart and appearing on Fox Business, and was mentored by Tea Party activist Bill Montgomery.\n\nIn 2011, at the age of 18, Kirk tweeted \"Run, Trump Run! Your country needs you!\" and the following year — working out of his parents' garage — he founded Turning Point USA, which he described in his 2023 book The MAGA Doctrine as \"an educational organisation dedicated to protecting the values of free markets, the Constitution and American exceptionalism\".\n\nKirk never enrolled in college himself, but founded Professor Watchlist and School Board Watchlist — grassroots, youth-oriented organisations on campus which aimed to \"out\" and shame left-wing teachers and lecturers.\n\nTurning Point USA exploded in popularity during the 2016 Trump campaign for the presidency — when Kirk was secretary to Donald Trump Jr — and grew to an organisation with 1,800 chapters, 600,000 members and annual revenues of $US80 million ($123 million).\n\nAlthough a non-profit, TPUSA was extremely lucrative for Kirk, who, as chief executive, drew a good salary of $US407,000, according to The Independent newspaper.\n\nKirk lived in a $US5 million estate in a gated community in Arizona.\n\nIn 2020, he launched a 3-hour daily radio program, the Charlie Kirk Show, which rose to number 21 on the Apple podcast chart.\n\nHe had millions of followers on Instagram and YouTube and last year launched on TikTok, becoming a leading conservative influencer.\n\nKirk did poorly on US fact-checker PolitiFact's scorecard, with 90 per cent of checks rating his claims \"mostly false\", \"false\", or \"pants on fire\".\n\nThose in Kirk's sights often complained of being targeted by his followers.\n\nKirk maintained his focus on grassroots organising at educational institutions and drew audiences of thousands of students by touring campuses all over the US — conservative and liberal alike.\n\nDeliberately provocative, a part of his schtick was to confront and challenge left-wing students head-on in Prove Me Wrong sessions lampooned in a recent episode of South Park.\n\nIt was at one of these sessions where Kirk was shot dead at Utah Valley University on September 10.\n\nOn the latest episode of the Charlie Kirk show, prominent right-wing activists including Steve Bannon paid tribute to the man they described as \"America's greatest Christian martyr\".\n\nThe meaning of MAGA, according to Kirk\n\nKirk wrote in 2020, the \"role of government should be so small that it is barely noticeable\".\n\n\"Yet, over the past several decades it has ballooned into an enormous enterprise thanks to both political parties. Too many institutions created to counter the power of government, from the media to Wall Street, have practically joined forces with it.\n\n\"Fake news is out of control and defense contractors have taken unprecedented advantage of the American taxpayer.\n\n\"Protecting individual liberty from the tyrannical forces of government is the idea our nation was built upon. It is the only way to protect the individual's rights, the family, local churches and schools, and other groups who can't fight back themselves.\n\nKirk said Donald Trump was a \"giant middle finger to all the screeching hall monitors that attacked young men for just existing\".\n\n\"There's a lot you can call Donald Trump. No one has ever called him feminine,\" he posted on X in August.\n\n\"He's a giant F YOU to the feminist establishment that was never challenged before he came down the golden escalator.\n\n\"Most of the media missed this. Young men did not.\"\n\nOn the 2021 storming of the Capitol\n\nIn a later deleted tweet two days before the taking over of the Capitol building in Washington by Trump supporters, Kirk said \"this historic event will likely be one of the largest and most consequential in American history\".\n\n\"The team at @TrumpStudents and Turning Point Action are honored to help make this happen, sending 80+ buses full of patriots to DC to fight for this president.\"\n\nOn the 2024 election\n\nIn a 2024 interview on Fox News, Kirk said if the Republicans had lost, \"I don't know if civilisation would have continued as we grew up\".\n\n\"I know it sounds like a major statement, but you look at what Kamala Harris and the Democrats have been doing to this country, this was an existential election, and so I dedicated my entire life, over the last year-and-a-half, to getting Donald Trump back in the White House.\"\n\nKirk told Fox News viewers, \"the old joke is that young people get conservative as they get older\".\n\n\"Imagine how conservative this generation will be now that they are starting conservative, that they have rejected the lies of liberalism at ages 18, 19, and 20.\"\n\nHe said Turning Point would be the \"24/7, 365 standing army of the conservative movement doing the difficult, but necessary community organising work to be able to keep these majorities, to expand them, and also make sure that a pro-American, pro-liberty world view is dominant amongst all generations, especially the next generation.\"\n\nOn abortion\n\nKirk was of the belief that there is \"no such thing as an unwanted child\".\n\n\"It is never right to justify the mass elimination or termination of people under the guise of saying they're 'unwanted'. That's how we get Auschwitz,\" he said.\n\nWhen challenged over whether he was comparing abortion to the Holocaust, Kirk replied: \"It's worse. It's worse. It's 45 million babies. It's nearly eight times worse than the Holocaust.\n\nOn gender politics\n\nKirk told his audience he rejected the \"entire premise of transgenderism\".\n\n\"I refuse to lie. I will not call a man [a woman] or a woman a man, like, I refuse to do that.\"\n\n\"I think it's a mental disease, and we've allowed it to all of a sudden become an identity.\n\n\"I think that there are two sexes, zero genders and unlimited personalities, and what we used to call a personality disorder we now call a gender disorder that we treat with body treatment when it should be brain treatment.\"\n\nHe also said he believed there should be a \"Nuremberg-style trial for every gender-affirming clinic doctor\".\n\nOn Black Lives Matter\n\nKirk was scathing of Black Lives Matter, the anti-racism movement in the United States.\n\nIn one video, he said BLM stood for \"burn, loot and murder\" and wrote it should be \"legal to burn a BLM flag\".\n\nIn June 2025, Kirk told his audience he had been \"warning about the rise of Islam on the show, to great amount of backlash\".\n\n\"We don't care, that's what we do here. And we said that Islam is not compatible with Western civilisation.\"\n\nIn September, he posted on social media that \"Islam is the sword the left is using to slit the throat of America\".\n\nOn the 'great replacement' of whites\n\nKirk argued, \"the left literally needs endless, constantly increasing migration from the Third World\".\n\n\"Because among people born in America, the share who are alienated by how much the left obviously hates them, is constantly growing.\n\n\"The great replacement strategy, which is well underway every single day in our southern border, is a strategy to replace white rural America with something different,\" he said.\n\n\"They hate that they don't live in big cities. They hate those of you that live in rural and small America. They hate those of you that own land and have guns and believe in a better country, and they have a plan to try and get rid of you.\n\nOn the Epstein files\n\nIn July 2025, Kirk told interviewer Megyn Kelly the US Department of Justice \"should immediately move to unseal all the Epstein documents\".\n\nOn the COVID-19 pandemic\n\nKirk wrote that the \"China virus\" meant \"now, more than ever, we need the wall\".\n\n\"With China Virus spreading across the globe, the US stands a chance if we can control of our borders,\" he posted to X in March 2020.\n\n\"President Trump is making it happen.\"\n\nHe was also of the view that the \"COVID shot should be removed from the childhood vaccination schedule\".\n\nAt an event in 2023, Kirk told the audience, \"you will never live in a society when you have an armed citizenry and you won't have a single gun death\".\n\n\"That is a prudent deal. It is rational.\"","summary":"Assassinated right-wing activist Charlie Kirk was an icon for young conservatives in the USA and Australia — so what were some of his views that so enraged some people, but energised others?\n ","url":"https://www.abc.net.au/news/2025-09-12/assassinated-right-wing-influencer-charlie-kirk-views/105766340","image":"https://live-production.wcms.abc-cdn.net.au/ba8dd61d8a7b99dafdec72a17f3b31f7?impolicy=wcms_crop_resize&cropH=1489&cropW=2647&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-09-12 06:41:45","author":"Paddy Manning","authors":["Paddy Manning"],"language":"en","source_country":"AU","sentiment":0.106},{"id":360004734,"title":"Kamala Harris book rips open Democratic wounds, and does her no favors","text":"If Democrats hoped that their wounds from the 2024 election would soon begin healing, former Vice President Kamala Harris just ripped open the scab. \n\nHarris’ book, “107 Days,” is due to be released on September 23rd, but an excerpt was published by The Atlantic. In it, the former VP holds little back, risking renewed infighting among a Democratic party struggling to find its way.\n\nUnfortunately, based on the excerpt, Harris’ book will do nothing to help the larger party, nor herself. Despite ostensibly her best efforts, it is remarkably self-serving.\n\nIn just a few words, Harris criticized Biden’s decision to run for a second term, claimed that his administration undercut her from the start, and revealed significant frustrations towards the former President and those around him. \n\nIndeed, Harris slammed certain decisions Biden made, but none more than his most fateful: seeking a second term when so many Americans felt he was too old, a recognition that the issue will still be critical in 2028.\n\nAcknowledging that “At 81, Joe got tired,” Harris describes a reluctant acceptance of “Joe and Jill’s decision” to run again. \n\nAnd, despite recognizing that “this wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition,” Harris says that she and others were “hypnotized” into acquiescence, which she describes as “recklessness.”\n\nHarris’ harshest criticism, however, was reserved for Biden’s advisors. \n\nAs she describes it, Biden’s team either stuck her with unsolvable policy issues – the border – or totally sidelined her. \n\nShe went further, accusing the Biden White House of “showing little interest in defending her against attacks from Republicans.”\n\nOn the contrary, Harris believes that “the president’s staff was adding fuel to the negative narratives around me” and left her to “shoulder the blame for a porous border.”\n\nFor issues where Harris polled better than Biden, such as abortion, Harris writes that Biden’s advisors refused to give her credit out of what she said was their belief that “if she’s shining, he’s dimmed.” \n\nHarris’ anger at the Biden White House is clear. What is less evident is any sense of responsibility or agency on her part.\n\nNor, for a vice president who consistently touted her loyalty to Biden on the campaign trail, is there any evidence of that same loyalty now. \n\nHarris ran a campaign centered on, by her own admission, an inability to find anything on which she disagreed with Biden, yet now, has a book full of places where she found daylight between the two.\n\nIn fact, in this excerpt, there’s little on the myriad of Biden decisions which actually helped her. Specifically, tapping her for VP, giving her a platform bigger than most VPs get, or, most importantly, almost immediately backing her for president when he withdrew from the race.\n\nTaken together, while Harris’ frustration with – and attempt to distance herself from – the Biden White House is obvious, the timing is wrong, the degree of disloyalty is great, and her lack of political judgement is more than apparent.\n\nOf course, this is only one excerpt of a larger book. But still, the Harris camp chose this excerpt for a reason, indicating their belief that the information it contained is critical.\n\nTo that end, the excerpt has already begun ripping open old wounds, prompting rebuttals and personal attacks on Harris from Biden staffers. \n\nAccording to Politico, one former Biden White House official pushed back on Harris’ characterization of the administration, saying, “No one wants to hear your pity party.”\n\nA national Democratic strategist was even harsher, saying that Harris’ “criticisms weren’t on the substance…but it was on them not doing enough to promote her and have her back in the press…it speaks to why she lost.”\n\nWhen the full book is published, it’s possible that these wounds will deepen, infecting the entire Democratic Party at an incredibly vulnerable time.\n\nSince the 2024 election, Democrats have been embroiled in intra-party finger pointing, trying to figure out who is responsible for all of the things that went wrong. \n\nBy dint of her position in the administration, Harris’ book is certain to reignite that debate. Even more so as it comes at a time when Democrats have been virtually unable to mount any form of effective opposition to the Trump administration.\n\nIn that same vein, the popularity of Harris’ book will draw renewed attention to the Biden administration’s issues when Democrats should be looking towards the 2026 midterms and then to the 2028 primary.\n\nAnd yet, for Harris, the book will likely be the starting point for her own presidential campaign. \n\nIn taking pains to highlight her own successes in office while blaming any and all stumbles on Team Biden, Harris is clearly hoping that voters will not associate her with a Biden administration that was deeply unpopular.\n\nOr, in Harris’ own words, “When polls indicated that I was getting more popular, the people around him (Biden) didn’t like the contrast that was emerging.”\n\nMoreover, by stressing that there was never a cover up of Biden’s infirmities, and attributing Biden’s candidacy to “Joe and Jill” – as well as “an individual’s ego” – Harris appears to be trying to acknowledge the problem without taking full responsibility.\n\nThe issue over who in the administration knew what about Biden’s age will almost certainly be an issue in the 2028 primary, and attempting to get her side of the story out there is critical. \n\nAs such, laying the fault at Biden’s advisors – who she describes as freezing her out from the beginning – appears to be her “out.”\n\nNevertheless, Harris’ book threatens to drive a wedge among the Democratic base between those who backed Biden throughout 2024, and younger, progressives who did not.\n\nPut another way, Democrats may experience another fight like 2016, when the establishment and grassroots activists split over Hillary Clinton and Sen. Bernie Sanders, respectively. \n\nRipping off the scab, as Harris appears to be doing, may help her get out from the 2024 shadow. \n\nIt could also consume the Democratic Party and distract from their actual task – winning at least one chamber of Congress so they remain politically relevant.\n\nUltimately, the political impact of Harris no longer holding back remains to be seen, both on her and on the wider Democratic Party. \n\nAt this point, however, we can be reasonably certain that the ramifications will be significant for both. \n\nDouglas Schoen is a longtime Democratic political consultant.","summary":"Kamala Harris book rips open Democratic wounds, and does her no favors","url":"https://www.presstelegram.com/2025/09/11/kamala-harris-book-rips-open-democratic-wounds-and-does-her-no-favors/","image":"https://www.presstelegram.com/wp-content/uploads/2025/09/Election_2024_How_We_Got_Here_64999.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-12 05:33:44","author":"Gqlshare","authors":["Gqlshare"],"language":"en","category":"politics","source_country":"au","sentiment":-0.423},{"id":359757340,"title":"Tension lingers at Utah campus traumatized by Charlie Kirk killing","text":"A man pays his respects at the deserted university campus a day after Charlie Kirk was fatally shot. (EPA Images pic)”\nOREM (Utah): The campus of Utah Valley University was mostly deserted and silent on Thursday, a stark contrast with the scenes of panic and disbelief that erupted 24 hours earlier when a sniper killed conservative activist Charlie Kirk in front of 3,000 young people gathered to hear him speak.\n“It’s eerie, tense, quiet,” said McKinley Shinkle, a 25-year-old electrical engineering student when asked to describe how it felt on campus, which was ordered closed for the rest of the week.\nThe single shot that struck Kirk rang out soon after the charismatic ally of President Donald Trump began taking questions from the audience at one of his signature outreach events, where he challenges students to debate contentious issues on topics including gun control and race.\nWitnesses, many of them stuttering with emotion, have described hearing a loud bang that they did not at first recognize as a gunfire. Some were close enough to the canopy under which Kirk sat to see blood flowing from his neck and spreading down a white T-shirt he wore that was emblazoned with the word \"Freedom.\"\nJeff Long, chief of the university's police department, said he had six officers working at the fatal event. \"You know, we trained for these things and you think you have things covered,\" Long said at a press conference.\n\"You try to get your bases covered. Unfortunately, today, we didn't.\"\nVideos online showed some in the crowd screamed, wept and prayed, many of them pushing their way out of the open area where the gathering was held, desperately trying to reach cover. Others stood frozen as if in shock or ducked to the ground.\nMcKinley Shinkle and his cousin Anthony Shinkle, a biology student at Utah Valley, said they were walking toward the event when the shot was fired, and people began running towards them.\n“People shouldn’t have to be afraid just to speak their mind,” Anthony Shinkle said.\nThe Shinkle cousins put up signs in the window of their student apartment that read “FREEDOM” and “YOU CAN’T KILL THE TRUTH” in support of Kirk and what he stood for.\nWhat little activity there was on the campus - located about 40 miles (65 km) south of Salt Lake City in Orem, Utah - involved law enforcement investigators.\nYellow police tape restricted access to several locations, including a university building that the gunman was believed to have used as a perch to fire down at an amphitheater where Kirk was speaking, about 200 yards (180 meters) away. Investigators scoured the building for forensic evidence on Thursday.\nThe campus of Utah Valley - the largest public university in the state - is much like dozens of other large schools across the country, dotted with modern buildings where students can earn certificates in skills such as cabinet-making, as well master's degrees in education and law.\nAbout a third of the 46,000 enrolled there are older students, and 42 countries are represented in its student body.\nQuiet neighbourhood disrupted\nAfter the shooting, the suspect dropped down from the roof of the campus building and fled into an adjoining neighborhood, ditching the rifle he used in a wooded area across the road, officials said.\nOn Thursday, those woods were also hemmed by yellow tape, while American flags fluttered in the breeze in front of many of the ranch-style houses that lined a nearby street.\nThe display of flags was initially intended as a tribute to the Americans killed in the September 11, 2001, attacks. But after the shooting, residents said the flags took on a different meaning, representing a trauma closer to home.\nIn many ways, the affluent university town of Orem seems like an idealized American city. Children play on front lawns on its quiet residential streets and its 100,000 residents can see the Wasatch Mountains towering to the east over the high desert.\nMany residents are members of the Church of Jesus Christ of Latter-day Saints and describe themselves as conservative.\nSince the shooting, the peaceful vibe been disrupted by SWAT teams patrolling the streets and police helicopters hovering above.\n“It can happen anywhere but it’s strange that it happened here,” said homemaker Christy Luque, echoing the disbelief shared by many of her neighbors. “It’s just a quiet small town.”\nLuque, 51, a registered Republican, voted for Kamala Harris in the 2024 presidential election. She said she was appalled by President Donald Trump’s treatment of women.\nAcross the street, 16-year-old Colton Fitch, who took the day off from school to process what happened, said it was the scariest day of his life.\n“It started getting real when there was a SWAT team truck blocking the road,” said Fitch, who was playing basketball in his front yard with his cousin, Max Fitch, also 16. Both were fans of Kirk.","summary":"Campus shuts down after Kirk killing, shock, disbelief, and flags mark local grief.","url":"https://www.freemalaysiatoday.com/category/world/2025/09/12/tension-lingers-at-utah-campus-traumatized-by-charlie-kirk-killing","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/09/d536f3d9-kirk-university.webp","video":null,"publish_date":"2025-09-12 04:38:13","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"my","sentiment":-0.326},{"id":359755922,"title":"US in turmoil amid blame game over Charlie Kirk shooting","text":"Investigators said they had found the bolt-action rifle they believed was used to kill Kirk and released images of a person of interest as they searched for the shooter they described as college age.\n\nKirk, a 31-year-old author, podcast host and close ally of US President Donald Trump, died as he gave a talk at a university in Utah in what Trump called a “heinous assassination”.\n\nToday's News in 90 Seconds, Friday, September 12\n\nHis killing stirred outrage and denunciations of political violence from Democrats, Republicans and foreign governments. Mr Trump said he would award Kirk the Presidential Medal of Freedom, the nation’s highest civilian honour. Vice-President JD Vance cancelled his trip to New York to commemorate the September 11 attacks and instead travelled to Utah to see Kirk’s family.\n\nPresident Trump blamed his political opponents for stirring up hate. “For years, those on the radical left have compared wonderful Americans like Charlie to Nazis and the world’s worst mass murderers and criminals,” he said in a video address posted to social media.\n\n“This kind of rhetoric is directly responsible for the terrorism that we’re seeing in our country today, and it must stop right now.”\n\nElon Musk also laid responsibility for the attack on Democrats. “The left is the party of murder,” he wrote on social media.\n\nDemocratic former vice-president Kamala Harris said: “I am deeply disturbed by the shooting in Utah. Doug and I send our prayers to Charlie Kirk and his family. Let me be clear: Political violence has no place in America. I condemn this act, and we all must work together to ensure this does not lead to more violence.”\n\n“The murder of Charlie Kirk breaks my heart. My deepest sympathies are with his wife, two young children, and friends,” said Gabrielle Giffords, the former Democratic congresswoman who was wounded in a 2011 shooting in her Arizona district.\n\nThe shooting appeared poised to become part of a spike of political violence that has touched a range of ideologies and representatives of both major political parties.\n\nThe attacks include the assassination of a Minnesota state lawmaker and her husband at their house in June, the firebombing of a Colorado parade in June to demand Hamas release hostages and a fire set at the house of Pennsylvania’s governor, who is Jewish, in April.\n\nThe most notorious of these events is the shooting of Trump during a Pennsylvania campaign rally last year.\n\nIn the Kirk attack, the FBI said the killer arrived on the campus a few minutes before the event began outdoors in front of about 3,000 people at Utah Valley University in Orem, Utah, about 65 km south of Salt Lake City.\n\nSecurity-camera videos show a person going up stairwells to get onto a roof before firing at Kirk, officials said.\n\nKirk, a staunch defender of gun rights, was answering an audience question about mass shootings when the bullet struck his neck. Audience members fled in panic.\n\nThe shooter jumped off the roof and fled into an adjoining neighbourhood, FBI special agent Robert Bohls said.\n\nThe shooter has not been publicly identified, though lawmakers, commentators and online sleuths have already filled social media and messageboards with speculation and blame-casting about the killer’s ideology.\n\nThe FBI has offered a $100,000 reward for information leading to the killer’s arrest and circulated grainy images apparently taken from security cameras showing a “person of interest” wearing a black top, black sunglasses and a dark baseball cap. The top appears to have an image of a bald eagle flying across a US flag.\n\nAmmunition found so far appeared to have been engraved with messages, the Wall Street Journal reported, but people familiar with the investigation said the engravings and their meaning were still being analysed.","summary":"The blame game over the killing of MAGA ally Charlie Kirk intensified yesterday as the FBI closed in on the fugitive gunman who escaped the scene in Utah after firing the fatal shot on Wednesday.","url":"https://www.independent.ie/world-news/north-america/us-in-turmoil-amid-blame-game-over-charlie-kirk-shooting/a1048277684.html","image":"https://focus.independent.ie/thumbor/627HUtR78LaYm9ck6sEAh0CK0x0=/0x94:312x302/550x550/prod-mh-ireland/290f86c3-6b6d-4d4b-bba2-b2270f4af84c/e0d295e3-56af-4bbd-812b-a216fa1b7256/290f86c3-6b6d-4d4b-bba2-b2270f4af84c.jpg","video":null,"publish_date":"2025-09-12 04:30:00","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.343},{"id":359755874,"title":"Kamala Harris ‘simply not good at job’ – Biden aides snap back at former VP over ‘recklessness’ claims","text":"She made the claims – which include painting Mr Biden as “reckless” for running again – in her new memoir 107 Days, which will be published on September 23. The Atlantic published an excerpt from the book this week.\n\nA former Biden official brushed off her criticism and told Axios that she was not an impressive vice president.\n\n“Vice president Harris was simply not good at the job,” the official, speaking anonymously, said.\n\n“She had basically zero substantive role in any of the administration’s key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was.”\n\nThe official insisted that Mr Biden is “not the reason she struggled in office or tanked her 2019 [presidential] campaign”. “Or lost the 2024 campaign, for that matter,” the official said.\n\n“The independent variable there is the vice president, not Biden or his aides.”\n\nIn the excerpt, Ms Harris recounts her perception of some of the thought process among Mr Biden’s team and his allies ahead of the 2024 election, and accuses some of undermining her while she was vice president.\n\nToday's News in 90 Seconds, Friday, September 12\n\n“‘It’s Joe and Jill’s decision’. We all said that, like a mantra, as if we’d all been hypnotised. Was it grace, or was it recklessness? In retrospect, I think it was recklessness,” Ms Harris wrote.\n\nIn another section, Ms Harris writes that the stakes for the election were “simply too high” to let “an individual’s ego, an individual’s ambition” determine who should run against then-former president Donald Trump in 2024.\n\nI was in the worst position to make the case he should drop out\n\nShe did accept some responsibility, noting that she should have “perhaps” voiced her concerns then, but didn’t want to look like she was making a grab for power.\n\n“I was in the worst position to make the case that he should drop out,” she wrote.\n\nA former Biden aide told Axios Ms Harris’s mea culpa wasn’t exactly inspiring.\n\n“I’m not sure the very robust defence of not having the courage to speak up in the moment about [Mr] Biden running is quite as persuasive as she thinks it is. If this is her attempt at political absolution: Lots of luck in your senior year,” the aide said.\n\nMs Harris also accused Mr Biden’s camp of trying to undermine and minimise her while she served as vice president. “Their thinking was zero-sum: If she’s shining, he’s dimmed. None of them grasped that if I did well, he did well,” Ms Harris wrote. “His team didn’t get it.”\n\nShe further accused them of being silently accepting of negative news stories about her. “When the stories [about Harris] were unfair or inaccurate, the president’s inner circle seemed fine with it. Indeed, it seemed as if they decided I should be knocked down a little bit more,” she said.\n\nDespite some of the aides’ comments, Ms Harris had some sympathetic voices in the former president Biden’s camp.\n\nRon Klain, Mr Biden’s former chief of staff, said he thought that Ms Harris “did a good job” in her role as vice president and said he felt “badly that she found the experience negative”.\n\nAnother former aide told Axios that “we all know that Biden folks treated her and her team like shit”.\n\n“We never thought she would actually say anything,” the aide said. “The staffers across a range of ages and positions that I’m talking to are proud of her.”","summary":"Aides to former US president Joe Biden are on the warpath after former vice president Kamala Harris accused them of sabotaging her presidential campaign.","url":"https://www.independent.ie/world-news/north-america/kamala-harris-simply-not-good-at-job-biden-aides-snap-back-at-former-vp-over-recklessness-claims/a99820342.html","image":"https://focus.independent.ie/thumbor/SFyRmmu_Qku7WNG62RsYt3xRmDE=/0x0:3238x2158/550x550/prod-mh-ireland/57e1e0a7-e201-42e2-8d79-bebf77e724ee/f617a85d-71e5-48fc-b479-b63d2df4c392/21Kamala%20Harris...F.jpg","video":null,"publish_date":"2025-09-12 04:30:00","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","source_country":"ie","sentiment":-0.274},{"id":359759540,"title":"Charlie Kirk, 1993-2025","text":"College students, in particular, would line up to challenge Kirk’s views. He often asked them probing questions in return: Why did they think President Donald Trump was a racist? When does life begin? What is a woman? While there is a tradition of that on the Right from Bill Buckley to Ben Shapiro, Kirk took it to another level for the internet age.\n\nKirk had an even greater appeal to conservatives on college campuses. With the exception of a select few Christian or overtly conservative schools in the country, academia is a lonely place for anyone a millimeter to the right of Sen. Susan Collins (R-ME). Conservative students can feel equally, if more temporarily, beleaguered and often compelled to say things they don’t believe to receive passing grades from their professors or social acceptance from their peers.\n\nAs the founder and CEO of Turning Point USA, Kirk helped build a network to connect these students and make them feel less alone. A college campus is also where Kirk was murdered, while speaking at an event at Utah Valley University as part of his American Comeback Tour. He was shot in the neck as he was speaking and slumped over in his seat. Leaving behind his wife, Erika, and two young children, Kirk was just 31 years old.\n\n“I want to be very clear that this is a political assassination,” Gov. Spencer Cox (R-UT) told reporters at a press conference afterward. “When someone takes the life of someone because of their ideas or their ideals, then our constitutional foundation is threatened.”\n\nTragically, we live in an upside-down world where some view speech as violence and opinions as “erasure” of those who disagree. In their minds, this justifies violence in the form of a bullet to the carotid artery mid-speech and the literal erasure of a father from his children’s lives.\n\nKirk’s impact wasn’t limited to campus politics. During the nadir of then-President Joe Biden’s 2024 reelection campaign, the Democrats had one last hope, which some political operatives thought would be their ace in the hole: an experienced field operation that would get out the vote in the battleground states. Identifying and mobilizing voters is crucial for any campaign in a competitive race. Then-Vice President Kamala Harris inherited Biden’s machine when she replaced him at the top of the Democratic ticket.\n\nArrayed against this formidable turnout apparatus was the less orthodox Trump mobilization operation spearheaded by Kirk and Elon Musk. Never had they done something like this before, at least not on this scale. Their task was made even more difficult by the fact they were targeting low-propensity voters, younger people with less of a history of showing up at polling places on Election Day.\n\nMusk was a data expert and number cruncher who had built large organizations on the fly. Kirk was a grassroots organizer with an underappreciated cultural pull among young potential voters, especially men. Trump swept all seven battleground states on his way back to the White House.\n\nKirk was a key organizer for a winning presidential ticket despite having never really been part of a campaign staff before. He became a top Trump confidante despite never having worked for the government before. He put together perhaps the largest collegiate political organization in the country, not directly connected to one of the two major parties, as a college dropout. He was just 18 when he started Turning Point USA.\n\nBut Kirk wasn’t just in it for the tax cuts or the clicks. “My job every single day is actively trying to stop a revolution,” he told Deseret News earlier this year. “This is where you have to try to point them towards ultimate purposes and towards getting back to the church, getting back to faith, getting married, having children. That is the type of conservatism that I represent, and I’m trying to paint a picture of virtue of lifting people up, not just staying angry.”\n\nYes, Charlie Kirk loved to debate liberals. It’s the kind of thing that belongs on a tombstone. Sadly, this is one epitaph that had to be written way too soon.\n\nW. James Antle III is executive editor of the Washington Examiner magazine.","summary":"Charlie Kirk loved to argue with liberals. That was apparent to all as he sought them out in national college tours. And if you attended any of his events or followed his viral social media posts, many liberals loved arguing with Kirk. College students, in particular, would line up to challenge Kirk’s views. He often [&#8230;]","url":"https://www.washingtonexaminer.com/magazine-obituary/3802514/charlie-kirk-obituary/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/Obit.091725.jpg?w=696","video":null,"publish_date":"2025-09-12 04:10:00","author":"W. James Antle III","authors":["W. James Antle III"],"language":"en","source_country":"US","sentiment":-0.565},{"id":359761502,"title":"Warner Bros Discovery shares surge on buyout reports","text":"Shares in Warner Bros. Discovery and Paramount Skydance have surged following reports that Paramount Skydance is preparing an offer to buy the rival studio.\n\nThe reported bid would be for the entire Warner Brothers Discovery business, which includes news network CNN, HBO, and the film studio behind Barbie and Harry Potter.\n\nThe deal would mark further consolidation in the US media industry, which has been dramatically reshaped by the rise of streaming, and comes as media firms face scrutiny from President Donald Trump's administration.\n\nWarner Brothers Discovery declined to comment. Paramount Skydance did not respond to a request for comment.\n\nThe potential offer from Paramount Skydance was first reported in the Wall Street Journal.\n\nThe firm is led by David Ellison, whose father, Oracle co-founder Larry Ellison, briefly became the world's richest man this week.\n\nIt comes just weeks after the completion of Paramount Skydance's own $8bn (£5.89bn) merger, in which David Ellison's independent movie studio Skydance purchased Paramount, home of the CBS news network and hits such as Yellowstone.\n\nMr Ellison is also reportedly closing in on a plan to by The Free Press, a digital media outlet co-founded by Bari Weiss.\n\nWarner Brothers Discovery shares closed up 29% on Thursday while Paramount Skydance closed up 16%.\n\nThe Wall Street Journal reported that a bid had not been submitted and the plan could fall apart.\n\nDavid Ellison has been in the film business since dropping out of University of Southern California roughly two decades ago, eventually earning his own reputation in Hollywood as a producer on films such as Top Gun Maverick and World War Z.\n\nHis father, an ally of Trump, this week briefly overtook Elon Musk as the world's richest person, worth more than $380bn, according to the Bloomberg Billionaires index. Trump earlier this year floated his name as a potential TikTok buyer.\n\nThe Paramount takeover plunged his son into politics as well.\n\nThe deal faced a lengthy approval process due to a row over Trump's legal battle with CBS over a Kamala Harris interview he alleged had been edited to favour the Democratic Party.\n\nParamount eventually agreed to pay $16m to settle the dispute. The money will go to a future presidential library.\n\nThe settlement did not include a statement of apology or regret.\n\nDemocrats have called the payment a \"bribe\" - an accusation that Paramount has denied - and demanded documents about the negotiations from the firm.\n\nAnnouncing the approval of the deal, the government said Skydance had committed to ensure its programming would \"embody a diversity of viewpoints\", end Paramount's diversity programmes, and appoint an ombudsman to review complaints of bias.\n\nAhead of the approval, Paramount said the Late Show with Stephen Colbert would end its run in May 2026. The move drew questions from Democrats about whether the cancellation was due to political reasons, which the firm denied.\n\nParamount in July also announced a five-year deal to air the satirical adult cartoon series South Park on its streaming network, poaching the show from HBO.\n\nWarner Brothers Discovery is the product of a 2022 merger. Since the deal, it has struggled with debt and has made significant job cuts.\n\nThe company said earlier this year it planned to split the business, dividing its streaming brands from its more traditional cable television business.","summary":"Shares in Warner Bros. Discovery and Paramount Skydance have surged following reports that Paramount Skydance is preparing an offer to buy the rival studio.","url":"https://www.myjoyonline.com/warner-bros-discovery-shares-surge-on-buyout-reports/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/09/image-995.png","video":null,"publish_date":"2025-09-12 04:05:00","author":"Abubakar Ibrahim,David Ellison","authors":["Abubakar Ibrahim","David Ellison"],"language":"en","source_country":"gh","sentiment":-0.012},{"id":359734040,"title":"Charlie Kirk Assassination Deepens Crisis of US Political Violence","text":"This week, Emily Bazelon, John Dickerson, and David Plotz discuss the assassination of Charlie Kirk amid an extremely troubling climate of political violence in America, another Supreme Court order with no majority explanation allowing racial profiling by ICE in LA, and a score-settling excerpt from Kamala Harris’s upcoming memoir 107 Days.\n\nHere are some notes and references from this week’s show:\n\nAssociated Press: Charlie Kirk assassinated at university event in Utah\n\nJ. Oliver Conroy for The Guardian (Analysis): ‘Our era of violent populism’: the US has entered a new phase of political violence\n\nRobert Draper for The New York Times Magazine: How Charlie Kirk Became the Youth Whisperer of the American Right\n\nRoss Douthat for The New York Times (Opinion): Your Rivals Aren’t Responsible for Mass Shootings\n\nCharles Homans for The New York Times Magazine: How Americans Justify Political Violence\n\nJoyce Vance for Civil Discourse (Substack): On Political Violence\n\nPresident Donald Trump, The White House: President Trump Delivers Remarks on Charlie Kirk\n\nAmy Howe for SCOTUSBlog: Supreme Court allows federal officers to more freely make immigration stops in LA\n\nDavid G. Savage and Sonja Sharp for Los Angeles Times: Supreme Court upholds ‘roving patrols’ for immigration stops in Los Angeles\n\nTom Nichols for The Atlantic: The Government Wants to See Your Papers\n\nJaclyn Diaz for NPR: DHS launches immigration crackdowns in Chicago, Boston\n\nKim Bellware, María Luisa Paúl, and Daniel Wu for The Washington Post: What to know about ICE’s immigration operation in Chicago\n\nAaron Blake for CNN (Analysis): Is Trump backing down on troops in Chicago?\n\nMatthew Petti for Reason: Americans Don’t Actually Like Trump’s Bad Guy Posturing on Immigration and the Military\n\nLorraine Ali for Los Angeles Times: Commentary: Trump’s ‘Chipocalypse Now’ is no joke, though it absolutely sounds like one\n\nKamala Harris for The Atlantic: The Constant Battle: The first excerpt from 107 Days\n\nKaren Tumulty for The Washington Post (Analysis): With her new candor, Harris does further damage to Biden’s legacy\n\n107 Days, by Kamala Harris, to be published on 9/23/25 (Simon & Schuster)\n\nHere are this week’s chatters:\n\nEmily: HAIM – official website; haimtheband (Instagram); HAIM (Spotify)\n\nJohn: Katie Kavanagh for Nature: My blue is your blue: different people’s brains process colours in the same way; Sam Walters for Discover Magazine: We All See Color Differently, But Our Brains Process Color the Same\n\nDavid: Alex Horton for The Washington Post: National Guard documents show public ‘fear,’ veterans’ ‘shame’ over D.C. presence\n\nListener chatter from Emily Arturo in Rockville, Maryland: I Hate Politics Podcast: exploring a human activity we love to hate, with host Sunil Dasgupta.\n\nFor this week’s Slate Plus bonus episode, Emily, John, and David discuss the astonishing new details revealed by the release of a book of letters collected for Epstein’s 50th birthday from his friends, including Donald Trump.\n\nIn the latest Gabfest Reads, Emily talks with Jonathan Mahler about his new book, The Gods of New York. They discuss the unraveling of Mayor Ed Koch’s New York City; how the city’s current mayoral race is mirroring the past; and more.\n\nEmail your chatters, questions, and comments to gabfest@slate.com. (Messages may be referenced by name unless the writer stipulates otherwise.)\n\nPodcast production by Cheyna Roth\n\nResearch by Emily Ditto\n\nYou can find the full Political Gabfest show pages here.\n\nWant more Political Gabfest? Join Slate Plus to unlock weekly bonus episodes. Plus, you’ll access ad-free listening across all your favorite Slate podcasts. You can subscribe directly from the Political Gabfest show page on Apple Podcasts and Spotify. Or visit slate.com/gabfestplus to get access wherever you listen.","summary":"Inviting reciprocal escalation never leads anywhere good.","url":"https://slate.com/podcasts/political-gabfest/2025/09/politics-charlie-kirk-assassination-political-violence-escalates-supreme-court-crime-kamala-harris-memoir-ice?via=rss","image":"https://compote.slate.com/images/2a31ca69-2aa8-4d98-b3ab-6280d6c66bd6.jpeg?crop=6000%2C4000%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-09-12 00:24:25","author":"and John Dickerson,David Plotz,Emily Bazelon,Kamala Harris","authors":["and John Dickerson","David Plotz","Emily Bazelon","Kamala Harris"],"language":"en","category":"politics","source_country":"US","sentiment":0.286},{"id":359741308,"title":"Admiration for Charlie Kirk —  if not his beliefs —  cut across political lines","text":"Charlie Kirk, the conservative millennial influencer who galvanized young Americans to support the GOP and was assassinated this week in Utah, was the most influential modern-day catalyst of shifting voting trends among fledgling voters, according to Republican and Democratic strategists. Kirk founded the nonprofit Turning Point USA in 2012 at the age of 18, and it grew into a force that promoted conservative views on high school and college campuses across the nation. “He found something among young people that none of us identified,” said Shawn Steel, a member of the Republican National Committee from Orange County who knew Kirk for nearly a decade and invited him to speak before the RNC’s conservative steering committee. “He found an entire movement in America that conservatives were not even aware they could find. Not only that, he nurtured and created an entire new generation of conservative activists,” said Steel, the husband of former Rep. Michelle Steel. “His legacy will endure.” The admiration for Kirk’s political organizing skills and mental acuity cut across political lines. “Whether you agreed with him or not — and to be clear, I didn’t — he was one of the most brilliant political organizers of his generation, and probably generations before that,” said Stephanie Cutter, a veteran Democratic strategist who served as an advisor to Presidents Obama and Clinton, First Lady Michelle Obama and Vice President Kamala Harris. “He could be controversial, but he struck a nerve with people who were likely disengaged in politics prior to Turning Point and built a powerful movement.” In addition to appealing to young voters about the economic headwinds they faced as they sought to climb the career ladder and tried to buy a house, Kirk also espoused sharply conservative views. Beyond espousing traditional conservative views — being anti-abortion, pro-gun rights and dubious of climate change — Kirk was critical of gay and transgender rights, the Civil Rights Act of 1964 and diversity, equity and inclusion efforts, saying last year that if he saw a Black airplane pilot, he hoped he was qualified. He was accused of being an antisemite because of repeated comments about the power of Jewish donors in the United States, and of being Islamophobic because of comments such as describing “large dedicated Islamic areas\" as \"a threat to America.\" Kirk, 31 and a father of two, died Wednesday after being shot in the neck while speaking at Utah Valley University. Kirk’s assassination was the latest instance of political violence in an increasingly politically polarized country. In June, Democratic Minnesota Rep. Melissa Hortman and her husband were killed, while state Sen. John Hoffman and his wife survived a shooting at their home, roughly five miles away, the same day. In 2022, a home invader bludgeoned the husband of then-House Speaker Nancy Pelosi (D-San Francisco). In 2017, House Majority Whip Steve Scalise (R-La.) was shot during a practice session for an annual congressional baseball game. In 2011, Rep. Gabrielle Giffords (D-Ariz.) barely survived an assassination attempt as she met with constituents in a Tucson strip mall. President Trump survived two assassination attempts in 2024 as he successfully sought reelection to the White House. Kirk’s \"mission was to bring young people into the political process, which he did better than anybody ever, to share his love of country and to spread the simple words of common sense on campuses nationwide,\" Trump said Wednesday. On Thursday, Trump told reporters on the White House's South Lawn that Kirk was partly responsible for his victory in the 2024 presidential election and repeated that he would posthumously award Kirk the Presidential Medal of Freedom. Turning Point USA, created a month before Kirk graduated from high school, became the new face of conservatism on college campuses and had chapters at more than 800 schools. Prominent conservatives heavily funded the group; in the fiscal year that ended in June of 2024, Turning Point reported $85 million in revenue. Longtime GOP activist Jon Fleischman, the former executive director of the California Republican Party and the former chairman of the state’s chapter of Young Americans for Freedom in the early 1990s, said Kirk was pivotal to Trump’s election. \"Charlie Kirk was probably the single most prominent and successful youth organizer in the Trump movement,\" Fleischman said, adding that Kirk superseded any other GOP organizer he knew at increasing conservative prospects among young voters. “As somebody who cut their teeth as a youth organizer, I have nothing but awe for the level of sophistication he brought to that field of work,\" he said. Support for Trump among young voters exponentially increased in the 2024 presidential election, according to data compiled by Tufts University. While President Biden had a 25-point edge over Trump among voters ages 18 to 29 in the 2020 election, Harris had a four-point advantage among this cohort last year. “This last election was the best performance Republicans have had with the youth vote, particularly male voters, in 20 years, maybe even going back to the ’80s,” said Steve Deace, a conservative radio host in Iowa who had known Kirk for a decade. He gave credit for that success partly to work Kirk did on the ground at colleges across the country, notably being willing to amicably debate with people who disagreed with his beliefs. “Charlie was basically a Renaissance man who was comfortable in a lot of settings. He wasn’t hoity-toity,” he said. Deace and others added that this moment could be a turning point for the nation’s democracy and the split between the left and the right. “We’re going to have a real conversation about whether we can share a country or not. The answer may be we can’t,” Deace said. “We have to decide if we are capable of the fundamental differences between us being adjudicated at the ballot box…. We have to decide if we can share a country. If we truly want to, we’ll figure it out. If we don’t, we won’t. That’s the conversation that needs to happen.” Bombastic conservative commentator Roger Stone went further, arguing that modern-day Democrats are a greater threat to the nation than terrorists, drug cartels and foreign spies. \"The rot is too deep to reverse our course with mere rhetoric,\" Stone wrote to supporters. \"Sept. 10, 2025 was the day we crossed the Rubicon, lost our innocence and realized only one path remains to ensure humanity’s survival. The time for American renewal is at hand, and the tree of liberty shall germinate in warp speed with Charlie Kirk serving as the martyr of our glorious refounding.\"","summary":"Kirk founded the nonprofit Turning Point USA in 2012 at the age of 18, and it grew into a force that promoted conservative views on high school and college campuses across the nation.","url":"https://www.latimes.com/politics/story/2025-09-11/charlie-kirk-turning-point-usa-admiration-cut-across-political-lines","image":"https://ca-times.brightspotcdn.com/dims4/default/3da1e5f/2147483647/strip/false/crop/4021x2681+0+0/resize/1486x991!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5d%2F29%2F2006569d4ec1bee106095d5a6e43%2Fcharlie-kirk-shot-068","video":null,"publish_date":"2025-09-12 00:12:08","author":"Seema Mehta","authors":["Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.123},{"id":359724756,"title":"Paramount Skydance prepping bid to buy Warner Bros. Discovery: report","text":"Paramount Skydance is preparing a bid to buy Warner Bros. Discovery, according to The Wall Street Journal. A report published Thursday cited sources who told the Journal that Paramount Skydance, which went through its own merger last month and is now being led by David Ellison, is seeking to acquire the movie studio and cable networks run by one of the company&apos;s top rivals. If completed, the deal would mark the largest merger of two legacy Hollywood studios under one corporate umbrella. NEW PARAMOUNT CEO ISSUES ULTIMATUM TO WORKERS: RETURN TO OFFICE FULL-TIME OR LEAVE Warner Bros. Discovery announced in June that the company was splitting the studio from its cable networks. The spinoff company, dubbed Discovery Global Networks, included CNN, TBS and TNT. It is unclear whether the corporate split would be halted as a result of a Paramount Skydance bid. Paramount&apos;s potential acquisition of Warner Bros. Discovery would put HBO and CNN in the same corporate umbrella as CBS, Showtime, and several other cable networks, including Nickelodeon, MTV, BET and Comedy Central. PARAMOUNT, SKYDANCE COMPLETE $8 BILLION MERGER AS FCC CONTINUES CBS PROBE The Journal noted that \"a bid hasn’t yet been submitted and the plans could still fall apart.\" Warner Bros. Discovery declined to comment. Paramount did not immediately respond to a request for comment. Last month, Paramount merged with Skydance in an $8 billion transaction, which was ultimately approved by the FCC following Paramount&apos;s months-long legal battle with President Donald Trump. Trump had sued Paramount and CBS News over election interference in the network&apos;s handling of its \"60 Minutes\" interview with then-Vice President Kamala Harris that aired in the weeks leading up to the November election. Paramount settled Trump&apos;s lawsuit in July. PARAMOUNT, CBS FORCED TO PAY EIGHT FIGURES, CHANGE EDITORIAL POLICY IN SETTLEMENT WITH PRESIDENT TRUMP Warner Bros. Discovery isn&apos;t the only media asset Ellison reportedly has his eyes set on. Ellison is also seeking to buy The Free Press for $100-200 million and reportedly plans to give its founder, independent journalist Bari Weiss, a leading editorial role at CBS News. Fox News&apos; Brian Flood contributed to this report. GET FOX BUSINESS ON THE GO BY CLICKING HERE","summary":"The Wall Street Journal reported that Paramount Skydance is preparing a bid to buy Warner Bros. Discovery that could shake up Hollywood and the media landscape.","url":"https://www.foxbusiness.com/media/paramount-skydance-prepping-bid-buy-warner-bros-discovery-report","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/09/paramount-warner-bros.jpg","video":null,"publish_date":"2025-09-12 00:00:54","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.354},{"id":359713866,"title":"Kamala Harris is 'throwing Biden off the bus,' Republican quips","text":"Kamala Harris is 'throwing Biden off the bus,' Republican quips\n\n Rep. Jason Smith, R-Mo., joins 'The Evening Edit' to discuss Kamala Harris's new book and her claims that Joe Biden should not have run for re-election, and the growing radicalization between Democrats and Republicans.","summary":"Rep. Jason Smith, R-Mo., joins &apos;The Evening Edit&apos; to discuss Kamala Harris&apos;s new book and her claims that Joe Biden should not have run for re-election, and the growing radicalization between Democrats and Republicans.","url":"https://www.foxbusiness.com/video/6379183246112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/8beee666-cb44-420f-95be-80311ad72870/8fc3d364-0be8-47a2-9578-73bfe8397544/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-11 23:41:18","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.385},{"id":359739552,"title":"Govt plans mass  retrenchment  in public sector","text":"Government plans to give public sector workers the promised 10% salary increase but will retrench half of them.\n\nSo claimed former finance minister Colm Imbert on Wednesday night as he addressed a People’s National Movement (PNM) meeting at the Diego Martin North Community Centre.\n\nImbert said it was obvious the Government was struggling.\n\n“Every day we get a new story about somebody who didn’t get their salary, or who didn’t get their benefits,” he said. “Every day we have a new story about salaries being paid late, salaries not being paid at all, deductions not being made, standing orders not being processed, people not getting their allowances, and of course, thousands of people being retrenched, bills are not being paid, suppliers are not being paid, because the Government is struggling,” he said.\n\nHe said one of the reasons the Government was struggling was because they made too many foolish promises they could never keep.\n\nThe United National Congress (UNC) promised the Public Services Association a 10% increase in salary for public servants for the period 2014 to 2019, a six-year period.\n\nHe said while a number of public sector unions settled for the 4% offer from the last PNM government, once this UNC Government gives the PSA 10% for the same period, they will have to give all of those other workers—“police, prisons, fire, Defence Force, teachers—(the same) 10% increase. Otherwise they’ll take them to court and they will win.”\n\nHe said if the Government gives the PSA 10% for the period and has to give everybody else the same benefit, “the backpay would be, when you add the 5% for the next period, 2020 to 2022, $28 billion. You hear the number? $28 billion,” Imbert said.\n\n“And the Government’s wage bill will increase by three and a half billion dollars a year. Now, they just don’t have the money to do that. Oil production is going down, gas production is going down, they kill the Dragon deal, petrochemical prices are low...They are already struggling to meet existing commitments. How are they going to fund $28 billion in backpay and $3.5 billion in additional recurrent expenditure every year? They can’t. And that is why you saw that story in the papers recently about devaluation. It’s called floating a balloon,” he said.\n\n“But they didn’t expect the backlash (over any proposed devaluation) they would get. Everybody started to cuss them, including their own people,” he said.\n\nHe said this forced Finance Minister Davendranath Tancoo to state there would be no devaluation.\n\nImbert said with devaluation off the table, the Government’s “next plan is to send home a setta public servants”.\n\nNoting there would be “bacchanal” if the Government did not give the expected 10% wage increase, the Government, he said, would do what was done in another Caribbean country: “You give your public servants a big increase—and then you retrench half of them. So that is the next thing that is going to happen in this country,” he said.\n\nImbert said another problem the Government faces is that “novice ministers” are making demands on the Minister of Finance. “They want the sun, the moon and the stars. They want everything. And when you add up what they’re asking for, the expenditure for next year will be $15 billion more than the money the country expects to earn.\n\n“And that is without that $28 billion (in backpay) and without that $3 billion extra in public service salaries,” he said, adding that the only way to get that extra $15 billion would be to borrow.\n\nEmerging corruption\n\nImbert also said there was “emerging corruption” in this four-month-old Government.\n\nHe said a document from within the North Central Regional Health Authority (NCRHA) came into his mailbox.\n\nReading from the document, he said at a meeting held on August 25, 2025, an instruction was given by the chairman of the board to the manager of public procurement that any procurement activity over the value of $75,000—“that means all (procurement activity)”—must first pass through him for his approval of small-scale, simplified procurement.\n\nSaid Imbert: “I am unable to follow this instruction, as this is a direct violation of the proclaimed Procurement Act. And this person and other people go on to make the point that this is deduced by the Office of the Procurement Regulator as collusion, and make the point that in 2017, the Ministry of Finance stated the responsibility for procurement lies with the chief executive officer or other designated official of the organisation.”\n\nImbert said the official (2017) letter from the Ministry of Finance to all State enterprises and statutory authorities states that there should be no involvement of the board of directors in approving contracts, except for approving the policy on procurement.\n\nBut, Imbert said, the chairman of the NCRHA was saying in writing that all contracts of this type were to pass through him for his approval.\n\nWe made stupid mistakes\n\nImbert said the PNM lost elections because of a lack of communication with its base and with the general public.\n\nHe said the party made the mistake of calling three snap elections and lost every time; he said he hoped the “next prime minister” (Pennelope Beckles who was seated in the audience) was listening.\n\nReferencing former US vice-president Kamala Harris’s recent book, Imbert drew parallels between what happened in the last US election and the T&T election.\n\nHe said Harris made the point that the choice of whether Biden stayed on as the nominee or not was left to “individual ego and individual ambition” and that it should have been “more than a personal decision”.\n\n“Kamala Harris came in at the last minute; she couldn’t break away from Joe Biden. Joe Biden was already very unpopular...(The media) asked her, what would you do differently to what Joe Biden did? And she foolishly said: ‘I can’t think of anything’. Well, she’ll lose...And we have parallels like that in the PNM. And the parallel I am drawing is the absence of democratic decision making...If you properly analyse why we lost that election, we made stupid mistakes-—in 1995, in 2010, and in 2025. Stupid mistakes. We did not connect with the people and make decisions based on consensus coming from our base and from the general population. That’s our weakness as a party...We don’t listen. Stick break in our ears. I ain’t ashamed to say that.”\n\nHe said once Beckles listened to the people, the PNM “was bound to win” the next election.","summary":"Government plans to give public sector workers the promised 10% salary increase but will retrench half of them.So claimed former finance minister Colm Imbert on Wednesday night as he addressed a People’s National Movement (PNM) meeting at the Diego Martin…","url":"https://trinidadexpress.com/business/local/govt-plans-mass-retrenchment-in-public-sector/article_6f725aa6-f9f9-4fdc-8d63-89ccca17e88f.html","image":"https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/5/13/513b32b1-168c-49f8-83b4-68b58b125af7/68c35f549843f.image.jpg?crop=732%2C384%2C0%2C63","video":null,"publish_date":"2025-09-11 23:41:00","author":"Ria Taitt","authors":["Ria Taitt"],"language":"en","category":"politics","source_country":"tt","sentiment":-0.394},{"id":359709300,"title":"Warner Brothers Discovery and Paramount Skydance shares surge on buyout reports","text":"David Ellison has been in the film business since dropping out of University of Southern California roughly two decades ago, eventually earning his own reputation in Hollywood as a producer on films such as Top Gun Maverick and World War Z.\n\nHis father, an ally of Trump, this week briefly overtook Elon Musk as the world's richest person, worth more than $380bn, according to the Bloomberg Billionaires index. Trump earlier this year floated his name as a potential TikTok buyer.\n\nThe Paramount takeover plunged his son into politics as well. \n\nThe deal faced a lengthy approval process due to a row over Trump's legal battle with CBS over a Kamala Harris interview he alleged had been edited to favour the Democratic Party. \n\nParamount eventually agreed to pay $16m to settle the dispute. The money will go to a future presidential library. \n\nThe settlement did not include a statement of apology or regret.\n\nDemocrats have called the payment a \"bribe\" - an accusation that Paramount has denied - and demanded documents about the negotiations from the firm.","url":"https://www.bbc.com/news/articles/cz9jed2qpq1o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/2d96/live/6ae12780-8f58-11f0-bdc4-01db39507e95.jpg","video":null,"publish_date":"2025-09-11 23:06:53","author":"Natalie Sherman","authors":["Natalie Sherman"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.228},{"id":359730908,"title":"MAGA Rep. Anna Paulina Luna calls for Charlie Kirk statue in the Capitol after his assassination","text":"A group of conservatives, led by Florida Representative Anna Paulina Luna, has called on House Speaker Mike Johnson to commission a statue of Charlie Kirk in the U.S. Capitol following his assassination.\n\n“This is not a symbolic gesture, but a permanent testament to his life's work, his courage, and his sacrifice,” the letter, signed by 12 other members of Congress, read. “It will stand as a reminder that political disagreement must never be answered with violence, and that the fight for truth must carry on.” \n\nKirk, 31, was shot while debating students at a public event at Utah Valley University in Utah on Wednesday. He had been speaking about transgender mass shootings when he was hit in the neck with a bullet. A manhunt is still underway for his killer.\n\n“His death has left a family forever altered,” the letter continued. “His wife, Erika, and their two young children now wake each day without a husband and father because of an act of political violence.” \n\nIn their letter, the members highlighted Kirk’s strong faith, which “guided every word he spoke and every cause he embraced,” and the influence he had on younger generations of Americans through his right-wing advocacy group Turning Point USA. \n\n“His work inspired countless young people to pursue truth and to enter public life with conviction rather than fear.”\n\nPoliticians on both sides of the political aisle have spoken out condemning the act of “political violence” that caused Kirk’s death, including many prominent Democrats, including former president Joe Biden, former vice president Kamala Harris, Senators Nancy Pelosi, Elizabeth Warren and Barack Obama.\n\n“This kind of despicable violence has no place in our democracy. Michelle and I will be praying for Charlie’s family tonight, especially his wife Erika and their two young children,” Obama said in a post after news of the fatal shooting broke.\n\nDespite this, the letter from Luna and her GOP colleagues claimed a “broader cultural intolerance” that had enabled the tragedy of Kirk’s death, the blame for which was placed at the feet of the Democrats and the Left.\n\n“Hateful rhetoric from the Left has created a toxic environment where one side finds it acceptable to stoke fear and violence to silence civil dissent,” the letter read. “We must be clear: They are the hate they claim to fight. Their words caused this. Their hate caused this.”\n\nExperts have warned that Kirk’s assassination is the latest in a deeply concerning surge in political violence across the U.S. during the Trump era.\n\n“It’s clear that we’ve had some major political violence incidents in the last few years and that it is more than we had come to expect, certainly since say the 1960s,” Wendy Via, CEO of the Global Project Against Hate and Extremism, told The Independent. “Political violence has been around as long as there have been politics, but I do think that the last few years are different.”","summary":"‘This is not a symbolic gesture, but a permanent testament to his life's work, his courage, and his sacrifice,’ the letter, signed by 12 other members of Congress, read","url":"https://www.independent.co.uk/news/world/americas/us-politics/charlie-kirk-statue-anna-paulina-luna-maga-b2825040.html","image":"https://static.independent.co.uk/2025/09/11/10/05-448eddf465db463882f78483f12469af.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/1XX1qT2i-OhrQWqOm.mp4","publish_date":"2025-09-11 23:06:17","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":0.014},{"id":359797854,"title":"Kamala Harris: Biden team didn’t understand her success ‘was important for him’","text":"During The 2024 presidential race, the Democrats were in lockstep: Joe Biden was an amazing intellect capable of running the world’s most powerful country like no other. And Kamala Harris was right with him regarding work, duties, goals and accomplishments.\n\nThat was before the election.\n\nNow it’s after, a catastrophic landslide loss, and according to Harris, Biden’s team didn’t support her and didn’t even understand that her doing well reflected on him.\n\nAccording to the Biden entourage, Harris never was good at her job.\n\nA commentary at Twitchy said, “It appears the Biden folks aren’t very happy about Kamala’s new bombshell book. To be clear, Joe probably has no idea what is going on or what is being said or even what planet he is on. Jill and the rest her team are mad.\n\n“Basically, they are saying all she did was complain, did no work, and was incompetent. Sounds about right.”\n\nThe internal war is being documented on social media:\n\nFrom Kamala’s book. As many predicted. pic.twitter.com/nht5xdcMnr\n— Han (@_skywriting_) September 10, 2025\n\nFor example, Harris charges that, “None of them grasped that if I did well, he did well. That given the concerns about his age, my visible success as his vice president was vital. It would serve as a testament to his judgment in choosing me and reassurance that if something happened, the country was in good hands. My success was important for him. His team didn’t get it.”\n\nShe further blasted the Biden White House for failing to push back when she was criticized.\n\n“The White House rarely pushed back with my actual resume: two terms elected D.A., top cop in the second-largest department of justice in the United States, senator representing one in eight Americans.\n\nVERY interesting snippets from Kamala Harris’ book, 107 Days, released by The Atlantic, especially as it pertains to Joe Biden, his age and his team!! (1/3) pic.twitter.com/C3IOHn62TR\n— Sapphire ️‍ (@PritzGOATNo1) September 10, 2025\n\nShe also claimed she had to “shoulder” the burden for the porous border, even though the issue had been “intractable for Democrats, and Republican administrations alike.”\n\nShe was, after all, appointed by Biden to be the border czar.\n\nBut President Donald Trump, on taking office and eliminating Biden’s pro-illegal alien agenda, reduce the illegal trafficking across the southern board to almost zero within just weeks.\n\nThe gloves are off. Kamala Harris rips Biden and his team in her new book.\nBlames everyone but herself for her issues. pic.twitter.com/fBXqY1RpIm\n— Bonchie (@bonchieredstate) September 10, 2025\n\nThe backlash wasn’t hard to predict:\n\nSaid one report, “Bidenworld explodes at Harris over the book excerpt after years of simmering tensions. ‘Vice President Harris was simply not good at the job,’ said one former Biden White House official. ‘She had basically zero substantive role in any of the administration’s key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was.’ Biden is ‘not the reason she struggled in office or tanked her 2019 [presidential] campaign,’ the ex-official said. ‘Or lost the 2024 campaign, for that matter. The independent variable there is the vice president, not Biden or his aides.'”\n\nHarris, in fact, dropped out of the 2020 Democrat race without gaining a single delegate. She got no more in being crowned the Democrat candidate in 2024 because she was hand-picked by the party elites and party members never voted on her.\n\nTwitchy’s opinion, “Basically, they are saying all she did was complain, did not work, and was incompetent. Sounds about right.”\n\nOthers blamed Harris’ own team while VP: She was known as someone who was extremely hard to work for, and her staff proved that with high turnover rates.\n\nThe commentary concluded: “So, he had dementia and she was incompetent. Sounds about right.”\n\nA report at the Daily Mail documented how Biden insiders were spewing “venom” at Harris.\n\n“The gloves are off in Biden world after former Vice President Kamala Harris released an excerpt from her new memoir, calling it ‘recklessness’ to let the octogenarian decide for himself whether to run for re-election,” the report said.\n\n“This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition. It should have been more than a personal decision,” she said.\n\nThe report quoted a Biden “insider,” saying it was a “sloppy, sort of craven, relatively unsophisticated attempt at deflecting blame.”\n\nAnother accused her of “whining” about her failed presidential campaign.\n\nHarris also complained that when Biden did drop out, after a disastrously failed debate with President Donald Trump, he didn’t mention her until almost nine minutes into the 11-minute speech.\n\nNew: Bidenworld explodes at Harris over the book excerpt after years of simmering tensions.\n“Vice President Harris was simply not good at the job,” said one former Biden White House official. “She had basically zero substantive role in any of the administration’s key work…\n— Alex Thompson (@AlexThomp) September 11, 2025","summary":"And ex-president's clan responds with saying veep 'was simply not good at the job'","url":"https://www.wnd.com/2025/09/kamala-harris-biden-team-didnt-understand-her-success/","image":"https://www.wnd.com/wp-content/uploads/2023/09/joe-biden-kamala-harris-smiling-happy-laughing.jpg","video":null,"publish_date":"2025-09-11 22:35:41","author":"Bob Unruh","authors":["Bob Unruh"],"language":"en","source_country":"us","sentiment":-0.116},{"id":359709122,"title":"Kamala Harris stumbles onto the truth: She’s a whiny, blame-shifting liar","text":"The fragile peace between the not-so-dynamic duo of Joe Biden and Kamala Harris reached its inevitable, undignified end this week.\n\nIn a preview of her new presidential campaign memoir, “What Happen-” — er, “107 Days” — the former veep threw her onetime boss under the bus in no uncertain terms.\n\nRecalling the intra-party panic during the final months of Biden’s reelection campaign last year, Harris wrote, “‘It’s Joe and Jill’s decision.’ We all said that, like a mantra, as if we’d all been hypnotized.”\n\n“In retrospect, I think it was recklessness,” she concluded. “The stakes were simply too high. This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition.”\n\nHarris’ detached tone is something to behold.\n\nHer complicity in Joe Biden’s selfish — and indeed, reckless — decision to seek a second term in the Oval Office can’t be waved away.\n\nShe was not some liberal pundit or low-level staffer observing the president from afar, convinced that some vast, right-wing conspiracy could “cheapfake” its way to victory.\n\nNo, Kamala Harris was at Biden’s right hand throughout — and she did much more than repeat a brain-dead mantra, as she claims.\n\nWhen Special Counsel Robert Hur revealed that the sitting commander-in-chief could no longer remember when his son Beau had died, or even the timeframe in which he had served as vice president, Harris was the administration’s attack dog.\n\n“As a former prosecutor, the comments that were made by that prosecutor [were] gratuitous, inaccurate and inappropriate,” she railed.\n\n“The way that the president’s demeanor in that report was characterized could not be more wrong on the facts and clearly politically motivated, gratuitous,” she continued — then, of all things, called Hur’s “integrity” into question.\n\nMonths later, the audio of Hur’s interview proved his description accurate.\n\nNow, despite using her power and influence to smear Hur, she seeks credit for acknowledging the folly of Biden’s 2024 campaign.\n\nBut not her complicity in it, because doing so would sign her political death warrant.\n\nShe could perhaps be forgiven for backing the wrong horse in 2024, but not the unpatriotic moral error of putting her personal career ahead of the country’s well-being.\n\nAnd so she insists that, while “many people want to spin up a narrative of some big conspiracy at the White House to hide Joe Biden’s infirmity,” the “truth” is “Joe Biden was a smart guy with long experience and deep conviction, able to discharge the duties of president.”\n\nOf the “debate debacle” that drove Biden from the race, “I don’t believe it was incapacity,” Harris offers.\n\n“If I believed that, I would have said so. As loyal as I am to President Biden, I am more loyal to my country.”\n\nIf only saying it made it so.\n\nIt’s now not a matter of debate, but a matter of record that Biden was unable to discharge his duties during his last year in office.\n\nHis inner circle concealed his condition from other members of his staff, and the president didn’t recognize George Clooney at a fundraiser the Hollywood A-lister threw for him.\n\nWorst of all, the released excerpt from “107 Days” reveals Harris as a shameless whiner, blaming her electoral defeat on the White House for failing to boost and praise her.\n\n“Getting anything positive said about my work or any defense against untrue attacks was almost impossible,” moaned the failed candidate.\n\n“I often learned that the president’s staff was adding fuel to negative narratives that sprang up around me,” she complained.\n\n“Indeed, it seemed as if they decided I should be knocked down a little bit more.”\n\nHere’s yet another truth known to nearly everyone but her: Kamala Harris is a career mediocrity who fell backward into the vice presidency after an embarrassing 2020 presidential campaign.\n\nHer dismal performance in that office, and the Electoral College blowout she suffered at the hands of Donald Trump, came as no surprise to anyone with knowledge of her record — including the skeptical Biden team that had, if anything, overestimated her abilities.\n\nHarris seeks plaudits for her loyalty to Joe Biden, even as she blames him for her own shortcomings.\n\nShe touts her patriotism even as she continues to lie to the American people.\n\nAnd she remains, six decades into her life, hopelessly unaware of who she is.\n\nHarris is pitching “107 Days” as a book about a plucky underdog who embarked upon an admirable, if quixotic, quest to save her country.\n\nIn truth, it’s the story of a deluded liar whose country, now more than ever, sees right through her pitiful posturing.\n\nIsaac Schorr is a staff writer at Mediaite.","summary":"Kamala Harris in her new book seeks plaudits for her loyalty to Joe Biden, while blaming him for her own shortcomings — and remains hopelessly unaware of who she is.","url":"https://nypost.com/2025/09/11/opinion/kamala-harris-stumbles-onto-the-truth-shes-a-whiny-liar/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/2024-former-us-vice-president-111089030.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-09-11 22:18:43","author":"Isaac Schorr","authors":["Isaac Schorr"],"language":"en","source_country":"us","sentiment":-0.551}]}