{"offset":0,"number":50,"available":517,"news":[{"id":382552040,"title":"​GOP strategist says Trump's attacks on Democratic veterans are already backfiring","text":"Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump may be pouring gasoline on a fire that he should instead be extinguishing.\n\nPolitico reported Wednesday that Trump's attacks on six Democrats who recorded a video urging rank-and-file servicemen and women to remember their duty to disobey illegal orders may already be backfiring politically. Those Democrats – who are all veterans of either the U.S. military or the CIA — reminded active-duty service members of the Uniform Code of Military Justice (UCMJ) which stipulates that lawful orders must be obeyed, but that carrying out unlawful orders could result in a court-martial.\n\nSecretary of Defense Pete Hegseth has recently suggested that retired U.S. Navy Captain Sen. Mark Kelly (D-Ariz.), who appeared in the video, could be called back into active-duty service and be subjected to a court-martial for his remarks. But Arizona-based Republican strategist Barrett Marson told Politico that pursuing Kelly could end up being politically costly for Republicans in the next two elections.\n\n\"Pete Hegseth and Donald Trump are providing Mark Kelly with the kind of visibility that almost no amount of money could buy,\" Marson said. \"Every 2028 contender wishes they could be attacked like this by the Trump administration.\"\n\nAside from Kelly, other Democrats have been capitalizing from the heightened national attention resulting from Trump's attacks. Sen. Elissa Slotkin (D-Mich.), a retired CIA operative who appeared in the video, has lately been promoting her plan to \"contain and defeat Donald Trump.\" Both Kelly and Slotkin represent swing states and are rumored to run for the 2028 Democratic presidential nomination. Kelly was on former Vice President Kamala Harris' short-list for 2024 running mates.\n\n\"It’s classic Trump — he ratchets everything up to an 11 and it blows up in his face,\" former Slotkin spokesperson Austin Cook told Politico. \n\n\"Not only did it reinforce everything swing voters have always hated about him, but it’s also given this group the biggest megaphone they’ve ever had,\" he added.\n\nClick here to read Politico's report in full.","summary":"Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump may be pouring gasoline on a fire that he should instead be extinguishing.\n\nPolitico reported Wednesday that Trump's attacks on six Democrats who recorded a video urging rank-and-file servicemen and women to remember their duty to disobey illegal orders may already be backfiring politically. Those Democrats – who are all veterans of either the U.S. military or the CIA — reminded active-duty service members of the Uniform Code of Military Justice (UCMJ) which stipulates that lawful orders must be obeyed, but that carrying out unlawful orders could result in a court-martial.\n\nSecretary of Defense Pete Hegseth has recently suggested that retired U.S. Navy Captain Sen. Mark Kelly (D-Ariz.), who appeared in the video, could be called back into active-duty servi","url":"https://www.alternet.org/trump-backfiring/","image":"https://www.alternet.org/media-library/image.jpg?id=61534324&width=1200&height=600&coordinates=0%2C560%2C0%2C561","video":null,"publish_date":"2025-11-27 00:18:52","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.424},{"id":382558666,"title":"Poll: Half Say They Want to Avoid Discussing Politics at Thanksgiving","text":"Half of Americans say they want to avoid discussing politics at Thanksgiving, an Emerson College survey revealed.\n\nThe survey asked respondents, “If you are visiting with family or friends this Thanksgiving, are you looking forward to discussing politics, or are you hoping to avoid discussing politics?”\n\nJust over half, 50.7 percent, said they are hoping to avoid discussing politics this Thanksgiving with friends or family. However, one-third said they are looking forward to discussing politics, followed by 16.3 percent who simply said they are not spending Thanksgiving with friends or family anyway.\n\nThe survey also asked, “When it comes to Thanksgiving, are you happy eating turkey as the main course, or would you rather eat something else?” Three-quarters said they are “happy eating turkey as main course,” while about one-quarter said they would prefer something else.\n\nThe survey was taken November 3-4, 2025. It has a +/-3 percent margin of error.\n\nIt coincides with the results of a recent YouGov survey, which found that 31 percent of Americans believe it is “very or somewhat likely they’ll discuss politics” at Thanksgiving. This includes 31 percent of Republicans, 26 percent of independents, and 37 percent of Democrats. However, like the Emerson poll, this one found that half say it is not very likely or not at all likely that they will discuss politics during the holiday.\n\nMore via YouGov:\n\n19% of Democrats and 9% of Republicans think there will be arguments about politics at their Thanksgiving celebration this year. But most Americans with a preferred 2024 candidate also expect to be celebrating mostly with like-minded people.\nAmong Americans who voted for Kamala Harris in the 2024 presidential election, 45% think almost all of the people who will be attending their Thanksgiving celebration also supported her. 18% think more of their fellow Thanksgiving attendees supported Harris than supported Donald Trump, and 10% think equal shares supported both candidates.\n\nAhead of the Thanksgiving holiday, President Donald Trump participated in the annual turkey pardon and actually pardoned four turkeys, joking that former President Joe Biden used an autopen in the pardons last year.\n\n“So I have the official duty to determine, and I have determined, that last year’s turkey pardons are totally invalid, as are the pardons of about every other person that was pardoned,” Trump said.\n\n“The turkeys known as Peach and Blossom last year have been located, and they were on their way to be processed, in other words, to be killed,” he added. “But I have stopped that journey, and I am officially pardoning them, and they will not be served for Thanksgiving dinner.”","summary":"Half of Americans say they want to avoid discussing politics at Thanksgiving, an Emerson College survey revealed.\n\n\nThe post Poll: Half Say They Want to Avoid Discussing Politics at Thanksgiving appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/11/26/poll-half-say-they-want-to-avoid-discussing-politics-at-thanksgiving/","image":"https://media.breitbart.com/media/2025/11/pexels-rdne-5847983-640x335.png","video":null,"publish_date":"2025-11-26 22:07:18","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.193},{"id":382529782,"title":"Dick Cheney: Always unintimidated","text":"Cheney, who died early this month and was eulogized in a ceremony to which the current president and vice president were not invited, rose after being awarded an American Political Science Association fellowship in Washington. There, he favorably impressed two bosses who were elected to Congress at ages 28 and 30 — William Steiger, who, before his death at age 40, pushed a capital gains tax cut through a 2-1 Democratic House, and Donald Rumsfeld, who became former President Richard Nixon’s antipoverty program chief and former President Gerald Ford‘s chief of staff.\n\nStill in his 30s, Cheney remained unintimidated by the travails of his patrons and his country — the forced resignation of Nixon in August 1974, the evacuation of U.S. troops from the embassy in Saigon in April 1975, the unveiling of Ford’s WIN (whip inflation now) buttons in October 1974. He seemed no more impressed than intimidated by his West Wing office near the president’s, nor his duties dealing with eminences such as former Secretary of State Henry Kissinger.\n\nAlthough Ford trailed far behind in polls, he nearly won a full term in 1976: if he had gotten 11,117 more votes in Ohio and 14,464 in Mississippi, he would have had 272 electoral votes to former President Jimmy Carter’s 268. Cheney returned to his native Wyoming and, undaunted by voters who expected to meet and grill candidates for high office in person, won election to the state’s sole House seat in 1978.\n\nHe was undaunted as well by what many regarded as inevitable American decline. I remember a conversation shortly after Reagan‘s inauguration in 1981, in which he expressed worry about overcoming Soviet advances abroad and budget deficits and stagflation at home. As a Reagan backer, during the Iran-Contra affair, he defended the administration’s right to conduct foreign policy — a harbinger of future stands in future controversies — and he was elected House minority whip after former President George H. W. Bush was elected in 1988.\n\nBush’s unexpected failure to get John Tower, a fellow Texan, confirmed as defense secretary had two pivotal consequences. One was the naming of Cheney, at age 48, as defense secretary. The other was the election by an 87-85 margin of Newt Gingrich, 46, to succeed Cheney as whip, which put him in line to push aside former Minority Leader Robert Michel and lead Republicans to their first House majority in 40 years in 1994. Whether Cheney’s talents would have produced that result is uncertain; in any case, Republicans have won House majorities in three-quarters of the elections since.\n\nMore immediately consequential was Cheney’s appointment. Unintimidated, despite his lack of military service, he assembled Operation Desert Shield and coolly fired the Air Force chief of staff for an unauthorized interview on the eve of Operation Desert Force. His White House, congressional, and national security experience made him a natural choice as head of former President George W. Bush‘s vice presidential selection committee and, after due consultation, for the vice presidential nomination itself.\n\nOnly four men served eight years as vice president before 1950; three made well-known comments about the insignificance of the office, and the fourth was known for his alcoholism. But since 1950, there have been five vice presidents who served eight years; three of them (Nixon, H.W. Bush, and Joe Biden) were later elected president in their own right, and a fourth (Al Gore) won the popular vote for the office.\n\nCheney was the odd man out, yet he was arguably the most consequential vice president of the five. After the Sept. 11 attacks, he pressed hard for aggressive measures to protect America from terrorism, arguing that enhanced interrogations and military action to remove the Saddam Hussein regime in Iraq were justified if there was even a 1% chance of preventing a terrorist attack that, in a nuclear age, could have been orders of magnitude greater than 9/11. He acted on this conviction, unintimidated by the prospect of widespread opposition and of a decline that, in fact, occurred in his job approval. \n\nIn most ideological quarters, Cheney’s recommendations, implemented with W. Bush’s substantial but not total approval, were, if not a crime, then a blunder. But even if, as in all wars, mistakes were made, “regime change in Baghdad also brought blessings,” wrote the Wall Street Journal‘s Barton Swaim. \n\nBuilding on those blessings has been, ironically, President Donald Trump, who has routinely called the Iraq war a mistake and has been full of scorn for Cheney. Yet, it is impossible to imagine the success of Trump’s Abraham Accords and bombing of Iran’s nuclear facilities if the Hussein regime were still in place; history may record it was necessary to take out the terrorist regime in Iraq before taking out the terrorist regime in Iran. Trump’s successful foreign policies may owe more to Cheney than either would feel comfortable admitting.\n\nCheney was no orator, but performed ably in his two vice presidential debates, in 2000 against Joe Lieberman, whom he liked and admired, and in 2004 against John Edwards, whose smarmy phoniness he despised. In that contest, Cheney was the first major party nominee to support same-sex marriage — long before Biden, former President Barack Obama, or Hillary Clinton — and he gave unintimidated support to his daughter, Mary Cheney and her wife and their children.\n\nDICK CHENEY’S COMPLICATED LEGACY\n\nHe gave unintimidated support as well to his daughter Liz Cheney, who, as a former Wyoming representative and member of the Republican leadership, opposed Trump’s course of action on Jan. 6 and supported his impeachment, conduct that I wrote at the time “any reasonable person could find impeachable.” That led to the Cheneys’ otherwise surprising endorsement of former Vice President Kamala Harris last year.\n\nLet me close on a personal note. When I ran into Cheney, he often recalled playing high school football for Casper against Worland quarterback Grant Ujifusa, who later created The Almanac of American Politics and enlisted me as a co-author. With both now gone, I can’t help thinking that playing high school football on cold, maybe freezing, Wyoming fall Friday evenings may leave you unintimidated by anything you face later.","summary":"The word that best describes how former Vice President Dick Cheney, who wielded the responsibilities he undertook in public affairs over a long career, began improbably early in life and extended into years of repudiation by his fellow partisans, is unintimidated. He was unintimidated by his rise to become White House chief of staff at [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/columnists/3900415/dick-cheney-always-unintimidated/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2023/12/cb424d2cd767edab86651dfd8c12ea9c-scaled.jpg?w=696","video":null,"publish_date":"2025-11-26 22:02:06","author":"Michael Barone","authors":["Michael Barone"],"language":"en","source_country":"US","sentiment":-0.042},{"id":382521852,"title":"Cuckolded ex of writer who 'had affair' with RFK Jr rebounds with lookalike feminist... who hates men but fetches his coffee","text":"Olivia Nuzzi's scorned ex-fiancé has found love again with a radical feminist activist nearly half his age – who openly boasts of her hatred of men.\n\nPolitical reporter Ryan Lizza, 51, gushed about meeting an 'extraordinary' new woman in a recent blog post but stopped short of sharing her identity.\n\nBut the Daily Mail can exclusively reveal his youthful new squeeze is abortion rights advocate Caroline Motley, 28 who describes herself as a misandrist – someone who dislikes or despises males.\n\nBoarding school-educated Motley – a blonde Nuzzi lookalike – grew up in a $7million DC-area mansion and launched woke non-profit Movement for Choice, which promotes reproductive justice through fitness classes and 'trauma-informed yoga'.\n\nThe petite firebrand's social media espouses a laundry list of liberal causes – from gun control and LGBTQ+ rights, to saving the planet, taxing the rich and 'holding men accountable.'\n\nShe worked for the 2024 Harris for President campaign and was photographed weeping and biting her nails when Kamala Harris gave her concession speech at Howard University.\n\nInternational relations graduate Motley gave an interview days later, confessing she was 'very scared' a second Donald Trump presidency would embolden male supremacists.\n\nBut her plucky bid to smash the patriarchy was put on hold Tuesday when she slipped away from Lizza's northwest Washington DC apartment to fetch his iced coffee order.\n\nMotley was clutching a cup with Lizza's name on the side when the Daily Mail snapped exclusive photos of her waiting for him outside the lobby, wearing a plunging red top, blue jeans and gold hoop earrings.\n\nA relaxed-looking Lizza emerged moments later, carrying several items of luggage, before the lovestruck pair hopped into a chauffeur-driven limo and drove away.\n\nThe budding romance comes after former CNN analyst Lizza broke off his two-year engagement to Nuzzi after her apparent fling with Robert F. Kennedy Jr. hit the news in September 2024.\n\nVanity Fair reporter Nuzzi, 32, has spent the past few weeks teasing salacious new details of her alleged infidelity to promote an upcoming memoir, American Canto.\n\nBut it's arguably Lizza who has been dropping the biggest truth bombs on his Telos News Substack page.\n\nThe veteran politico claimed in one post that married RFK Jr., penned his journalist ex an outrageous, risqué poem reading: 'You are my canyon. I mean to flow through you.'\n\nHe also dished on Nuzzi's 'unusual' two-year relationship with Keith Olbermann - and accused her of having a tryst with former South Carolina Governor Mark Sanford when she was writing about him.\n\nBut one nugget of information glossed over in this month's headlines was Lizza's admission that for the past year, he's been dating someone new.\n\n'I've resisted writing about these events partly because the last year turned out to be one of the happiest of my life, both professionally and personally,' he wrote.\n\n'As the media industry crumbled, I went independent with this modest endeavor, Telos News, which has been the most gratifying experience of my career.\n\n'I also met the most extraordinary woman I've ever known, someone whose beauty, inside and out, takes my breath away.\n\n'Every day, I marvel at my impossible luck that she loves me back. We just celebrated our first year together.'\n\nThe object of his affections is leftwinger Motley – pronouns she/her – who recently completed a Master of Public Administration degree at George Washington University, according to her LinkedIn page.\n\nThe activist grew up in a 10,000 sq ft Virginia estate, which was hailed for its 'bucolic and expansive grounds' in a 2011 news article about a fundraiser hosted by her parents.\n\nTheir neighbors included former Vice President Dick Cheney and Robert Bork, who was solicitor general of the United States from 1973 to 1977.\n\nMotley's father, John Motley III, 75, made his fortune in office products and runs a sales company, while mom Debbie, 66, describes herself as a nutrition expert.\n\nThe wealthy couple have three more kids but none appear to be as radical as Motley, who wrote in a 2022 TikTok post: 'Unfortunately I do love… being a misandrist.'\n\nMotley went to an all-girls boarding school before majoring in international relations and taking part in the Model United Nations club at the College of Charleston.\n\nShe has vacationed in Martha's Vineyard, traveled widely in Portugal, Croatia and Jamaica, and gone backpacking in Bolivia and Ecuador.\n\nBut it was during her year studying abroad in France that Motley began to focus her energies on abortion rights, according to a profile posted by Movement for Choice, the non-profit she co-founded in 2022.\n\n'While in Paris, Caroline had the opportunity to visit an abortion clinic that provided community members with the reproductive care they needed, in addition to treating survivors of female genital mutilation.\n\n'Many of the patients that this clinic serves are asylum seekers from Sub-Saharan Africa who came to France in order to escape gender-based violence.\n\n'After this experience, Caroline felt called to dedicate her life not only to feminism at large, but specifically to reproductive healthcare.'\n\nMotley has volunteered with Hillary for America, Harris for President and Foggy Bottom Plan B, where she handed out free contraception.\n\n But her biggest achievement has been Movement for Choice, which promotes 'Reproductive Justice for ALL – especially black, brown, queer, and trans communities.'\n\nVisitors to the non-profit's website are confronted with a land acknowledgement decrying the 'settler colonialism' that robbed Native American tribes of what is now modern-day DC.\n\nIt's followed by a lengthy DEI (Diversity, Equity and Inclusion) mission statement promising that participants of all identities will feel 'safe, heard and appreciated' at Movement for Choice events, which include fitness classes and yoga sessions.\n\nMotley's feminist sympathies do not extend to conservative Supreme Court Justice Amy Coney Barrett, whom she savaged in a 2022 TikTok video, saying: 'She needs to be looked at by several psychologists.'\n\nBut she seems to be warming to the rumored 2028 Democrat pick for President Gavin Newsom thanks to his steadfast support for the abortion drug Mifepristone.\n\nMotley reposted a list of the California Governor's healthcare policies in September, set to the raunchy Usher hit Hey Daddy.\n\nThe Daily Mail has contacted both Lizza and Motley for comment.","summary":"Olivia Nuzzi's ex-fiancé, Ryan Lizza, has moved on with an abortion-rights activist following his widely publicized split from the Vanity Fair reporter following reports linking her to RFK Jr.","url":"https://www.dailymail.co.uk/media/article-15328411/olivia-nuzzi-ex-ryan-lizza-new-feminist-lover-Caroline-Motley.html","image":"https://i.dailymail.co.uk/1s/2025/11/26/20/104210395-0-image-m-3_1764188475346.jpg","video":null,"publish_date":"2025-11-26 21:15:44","author":"Ben Ashford,Editor","authors":["Ben Ashford","Editor"],"language":"en","source_country":"gb","sentiment":-0.036},{"id":382504192,"title":"Gisele Bündchen splashes $14.5M on fourth Miami dream home next door to her current pad shared with jiu-jitsu hunk","text":"She already owns three Florida homes, but the Daily Mail can reveal Gisele Bündchen has splashed the cash again – on a stunning six-bedroom house next door to the one she currently lives in.\n\nThe blonde model's swanky new pad is in Miami's ritzy Surfside neighborhood and is worth a cool $14.5million. \n\nPhotos exclusively obtained by the Daily Mail show the spacious property boasts manicured grounds dotted with palm trees, a large pool and its own boat dock that juts out into Biscayne Bay.\n\nAccording to a recent property listing, the palatial villa also has six bathrooms, 'top-of-the-line' appliances and a private spa – making it perfect for the 'ultimate coastal lifestyle'.\n\nBündchen, 45, has lived in the Surfside neighborhood for years while Brady lives just across Biscayne Bay on Indian Creek Island – nicknamed the 'Billionaire Bunker' thanks to its high-rolling residents like Amazon boss Jeff Bezos.\n\nAlong with Brady, 48, her other neighbors include Jared Kushner and Ivanka Trump, who were seen having lunch with the supermodel on a yacht in Miami in September.\n\nGisele and Ivanka also share a gym as well as a neighborhood, with both choosing to train with Gisele's Costa Rican ju-jitsu trainer boyfriend, Joaquim Valente.\n\nValente, 38, has been spotted repeatedly at the flash new pad in recent weeks, as well as at the couple's sprawling $9million ranch in Southwest Ranches, a rural town 15 miles south of Fort Lauderdale.\n\nThe handsome trainer and his model girlfriend have been together since November 2022, when they were first pictured holidaying in the Costa Rican coastal area of Provincia de Puntarenas.\n\nThey made their romance official in June 2023 and welcomed a baby son in February this year.\n\nThe baby is Gisele's third child, with the model already a mom to two children - Vivian Lake, 11, and Benjamin Rein, 15 - with NFL GOAT Brady, and was the stepmom of Brady's first son, John, 18, from a previous relationship with actress Bridget Moynahan\n\nBundchen divorced Brady in 2022 and told Vanity Fair the following year that they had grown apart.\n\nShe said: 'Sometimes you grow together; sometimes you grow apart. When I was 26 years old and he was 29 years old, we met, we wanted a family, we wanted things together.'\n\nBündchen said that as time passed, she and Brady realized they 'just wanted different things,' and in turn, were faced with a difficult 'choice to make.'\n\nShe added of Brady: 'That doesn't mean you don't love the person.'\n\nThe model has remained close to her famous ex since the split, but reportedly felt she had 'lived in his shadow' for a long time and is loving her 'new chapter' with Valente.\n\nThe source also told Page Six: 'Gisele and Joaquim were not planning to have a child together.\n\n'This was unexpected. Joaquim has always wanted a family, so she is happy to be able to give this to him.'\n\n'She knew that he would be a great father when her kids started taking classes with him. He is patient, playful and so understanding.\n\nAt the time of their divorce, Bundchen had starred in more than 550 ad campaigns, posed for 2,000 magazine covers, and walked in 800 fashion shows, while Brady had played 22 seasons in the NFL, helping his teams win seven Super Bowl titles and breaking numerous records along the way.\n\nTogether, the pair amassed a staggering fortune - even as Bundchen put her fashion career on the back burner in order to support her husband's quest for continued Super Bowl glory - they were estimated to have a combined fortune of $733million.\n\nPrior to Brady, the 45-year-old had a string of glamorous boyfriends, including a high-profile relationship with Leonardo DiCaprio, 50, pro-surfer Kelly Slater, 53, and actors Josh Hartnett, 47, and Chris Evans, 44.\n\nLike his ex, Brady is no stranger to a big bucks property purchase and owns a $17million mansion in the same Miami neighborhood as Gisele.\n\nOn top of that, he also owns a lavish custom-built home in Los Angeles' upscale Brentwood suburb, where his neighbors include failed presidential candidate Kamala Harris and basketball superstar LeBron James.\n\n⁠⁠The 14,000sqft property boasts a vast master bedroom with an ensuite bathroom, its own wine cellar and a gorgeous rectangular pool set in landscaped gardens.\n\nOther features include an outdoor 'bar-lounge' and a massive marble kitchen that comes with a huge white marble island for Brady to eat at.","summary":"Supermodel Gisele Bundchen, 45, has cashed in $14.5million on her fourth Florida home right next to the one she lives in with her Costa Rican jiu-jitsu boyfriend, Joaquim Valente.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15329027/gisele-bundchen-millions-miami-surfside-home-joaquim-valente.html","image":"https://i.dailymail.co.uk/1s/2025/11/26/19/104212231-0-image-m-13_1764185025611.jpg","video":null,"publish_date":"2025-11-26 20:25:36","author":"Ben Ashford,Editor,Ruth Styles","authors":["Ben Ashford","Editor","Ruth Styles"],"language":"en","source_country":"GB","sentiment":0.475},{"id":382516960,"title":"Fani Willis was the only prosecutor to seriously challenge Trump over Jan. 6 — and she completely botched it","text":"Fani Willis’ effort to prosecute then-former President Donald Trump, alleging a coordinated effort to change the results of the 2020 election and keep himself in power, ended on Wednesday, the day before his first of four Thanksgivings he’ll celebrate as commander-in-chief once again.\n\nThe case against Trump and 14 other co-defendants collapsed in a heap after a prosecutor assigned to take over the case from Fulton County District Attorney Fani Willis asked a judge to dismiss the charges, citing the unfeasible prospect of compelling a sitting president to appear in court and the small likelihood that the trial could still be mounted after he left office.\n\nIt marked the end of the last effort to hold Trump accountable, at least criminally, for the lawbreaking and corruption his enemies have long argued was a defining characteristic of the MAGA Republican president before his rise to power — and resulting from his efforts to cling to it after voters decided otherwise. \n\nThe book is now closed on any prosecution of Trump or any of his allies and supporters for the violent riot at the U.S. Capitol on Jan. 6, 2021, when a mob stormed the halls of Congress to seeking to halt the certification of the election. The statute of limitations will expire next year for any federal charges related to the violent attack.\n\nIn the end, it came down to timing — and an incredibly glaring error of personal and professional judgment by Willis. \n\nThe Georgia case, like the federal effort headed up by Jack Smith at the Department of Justice, was stymied by Trump’s return to the presidency in 2025. But Smith’s seemed predestined to fail as Merrick Garland, Joe Biden’s attorney general, did not begin the investigation against Trump in earnest until March of 2022, only a few months before it was clear that Trump would run again.\n\nThe Justice Department instead consumed an incredible amount of resources identifying and chasing down individual participants in the Jan. 6 attempted insurrection, a well-intentioned strategical error that was ultimately rendered a meaningless crusade given Trump’s decision to pardon each and every one of them upon returning to the White House.\n\nTrump has maintained his innocence all along but alos to this day speaks of the 2020 election as “rigged” and a “fraud.”\n\nWillis’ prosecution appeared serious from the onset, however, and scored early victories. Four of Trump’s 18 original co-defendants including Sidney Powell, a top member of his legal team, took plea deals and were convicted in 2023, agreeing to testify against their allies.\n\nIn February 2024, a Supreme Court ruling made clear that Smith’s case would almost certainly be delayed through the 2024 election, jeopardizing its future and tying its fate to the results of the matchup between Trump and Kamala Harris. But in January, a development in Willis’ case had already dealt a mortal wound to the prosecution of Trump and his remaining co-defendants.\n\nA motion made by one of those co-defendants revealed a shocking twist. Willis and a special prosecutor she’d hired to assist with the case, Nathan Wade, were in a romantic relationship. The defense attorneys argued that Willis, by allowing Wade to pay for a Royal Caribbean cruise vacation for the pair in 2022 and two other trips in 2023, had financially benefitted from her appointment of Wade to possibly the most important and heavily scrutinized case being undertaken by a district attorney in a decade. The revelation was first uncovered via Wade’s divorce proceedings.\n\nBy appointing Wade to the case, Willis doomed it. One Georgia-based legal expert told the New York Times that Willis had “stabbed the case right in the heart.”\n\n\"The history books will look back on what the country lost by not having a televised trial before November 2024 and historians will wonder what Fani Willis was thinking. And they'll just scratch their heads,\" Anthony Michael Kreis, a law professor at Georgia State, told The Guardian after the case was “indefinitely” delayed that following summer. \n\nWillis herself was formally removed from the case one month after the 2024 election.\n\nDemocrats had limited opportunities and avenues to seek prosecution of what they and many legal experts viewed as widespread criminal behavior by the Trump campaign in the wake of the 2020 election. Even in Georgia, the prosecutor who took the case over from Willis argued that the charges should have been pursued at the federal level, despite the guilty pleas of some co-defendants.\n\n\"The criminal conduct alleged in the Atlanta Judicial Circuit's prosecution was conceived in Washington, D.C., not the State of Georgia. The federal government is the appropriate venue for this prosecution, not the State of Georgia,\" wrote Pete Skandalakis in a court filing. He also cast doubt on the strength of the racketeering charge against Trump and others.\n\nBut Willis’ investigation of the president still stands out for one reason: Her office identified Trump as a target early on, and despite having significantly fewer resources than the federal DOJ, was able to return a grand jury indictment of the president and a host of others just two weeks after the Justice Department did. While by all accounts Willis’ team was on the ball early, a host of reporting supports the conclusion that Garland was largely pressured into bringing a delayed case against Trump at the federal level by the revelations of the House January 6 committee, which investigated both the attack itself and the broader “fake electors” efforts in Georgia, Arizona and other states.\n\nReporting from The New York Times in particular indicated that Garland focused on a bottom-up strategy, with little sense of urgency. His efforts to keep the Justice Department out of politics failed, with the case coming too late. \n\nThe reward: A Trumpified DOJ is now being singled out for its campaign against Donald Trump’s enemies that increasingly looks to be mired in failure with the dismissal of charges against James Comey and Letitia James, brought by a Trump loyalist whose appointment as prosecutor was ruled to be illegal.\n\nWillis, however, retains the singular glory of having blasted a hole in her own case through sheer bad judgement. \n\nHer relationship with Wade seems to have ended already: He testified in 2024 that their relationship ended and they were now just “good friends,” though an appearance together at an airport in early 2025 suggests the two remain very close to this day.\n\nThe convictions of Sidney Powell, Kenneth Chesebro and Jenna Ellis as part of plea deals secured by Willis’ office remain the only ones secured by any prosecutor, anywhere, still in effect stemming from the election subversion effort and the violent attack on the Capitol. \n\nThat’s merely a consolation prize, however, as Willis and others confront the reality that Trump, in their view, got away with it.","summary":"Willis had her eye on the ball early, but a stunning error of judgement ‘stabbed the case right in the heart’, John Bowden writes.","url":"https://www.independent.co.uk/news/world/americas/us-politics/fani-willis-georgia-trump-election-jan-6-b2873248.html","image":"https://static.independent.co.uk/2025/03/17/19/Fani_Willis_Open_Records_58508.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/AN7BeMvd-OhrQWqOm.mp4","publish_date":"2025-11-26 20:23:32","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.157},{"id":382438792,"title":"Democrats Investigating Flyers With Wrong Tennessee Special Election Date","text":"Tennessee Democrats are investigating postcards allegedly sent to voters with an incorrect date for the upcoming special election between Democrat Aftyn Behn and Republican Matt Van Epps.\n\nA spokesperson for the Tennessee secretary of state’s office told Newsweek on Wednesday that the office has seen the screenshots of the mailers allegedly sent to voters, but that voters have not contacted them about the matter.\n\nNewsweek reached out to the Tennessee Democratic Party via email and the Tennessee GOP via contact form for comment.\n\nWhy It Matters\n\nThe special election in Tennessee’s 7th Congressional District has drawn significant investment from both major parties. It is viewed as being potentially competitive, despite President Donald Trump carrying the district by more than 20 points against former Vice President Kamala Harris in the 2024 election. The district comprises parts of Nashville and its suburbs, as well as Clarksville and more rural areas.\n\nThe outcome of the special election could have key implications for control of the House of Representatives, where Republicans hold a 219-213 majority. The resignation of Representative Marjorie Taylor Greene, a Georgia Republican, in January will bring that to 218-213, and it could get more narrow in the coming months following special elections in more Democratic-leaning districts. If Behn pulls off a victory, it would further shrink the GOP’s majority.\n\nWhat to Know\n\nTurnout will be key to how close the special election becomes. If turnout is lower in the district’s rural areas but higher in Democratic-leaning Nashville, Democrats would have a better chance of flipping the seat next Tuesday. But if turnout is closer to typical election levels, Republicans would be favored.\n\nRachel Campbell, the chair of the Tennessee Democratic Party, said in a video posted on Facebook on Saturday that the party is investigating reports that some voters have received materials containing inaccurate information about the election date.\n\n“Just breaking into the game briefly to say that we have heard the reports of fraudulent dates being circulated,” she said in the video. “While we are looking at who may be distributing these, it’s important to remember that Election Day is December 2.”\n\nD. Patrick Rodgers, editor-in-chief of the newspaper Nashville Scene, posted photos on Bluesky of alleged mailers urging residents to vote for Behn on December 3, one day after the election will have already taken place. \n\nThe mailers have “no attribution or return address” and are being sent to voters in Nashville, he wrote.\n\n“Mark your calendars & make a plan to vote on December 3rd,” the mailer reads.\n\nThe origins of the flyers remained unclear.\n\nOn Wednesday, a poll from Emerson College showed Behn trailing Van Epps by only 2 points (49 percent to 47 percent). It surveyed 600 likely voters from November 22-24 and had a margin of error of plus or minus 3.9 percentage points.\n\nA sign reading “vote here” points toward a polling place in Minneapolis, Minnesota, on August 14, 2018.\n\nWhat People Are Saying\n\nThe Tennessee Holler wrote to X: “Wowwww… so dirty. Mailers with the wrong Election Date. @aftynfortn Behn making Republicans get desperate.”\n\nWilliam Lyons, professor at the Howard Baker School of Public Affairs at the University of Tennessee, previously told Newsweek: “With Congress so evenly divided every contest is critical. Parties will continue to commit significant resources to marginally competitive districts like the Tennessee 7th, hoping to either cause or prevent an upset that would have national consequences. Concerns about representation of district-specific issues are taking a back seat.”\n\nWhat Happens Next\n\nBehn and Van Epps will make their final efforts to get their supporters to the polls over the coming days before the election next Tuesday. The Cook Political Report classifies the race as “Likely Republican.”","summary":"Rachel Campbell, chair of the Tennessee Democratic Party, raised concerns about &quot;fraudulent dates being circulated.&quot;","url":"https://www.newsweek.com/democrats-investigating-flyers-wrong-tennessee-special-election-date-11115351","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-1016543352.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-26 18:02:28","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.202},{"id":382403958,"title":"Tennessee’s 7th District shifts from ‘safe Republican’ to ‘lean Republican’ in election tracker","text":"Not all election trackers are in agreement. The Cook Political Report stood by its “likely Republican” designation on Tuesday, arguing that the cumulative effect of increased national attention to the race would ultimately benefit Epps.\n\nRepublicans have been plagued by poor turnout in off-year elections, especially those in which Trump is not on the ballot. The 7th District’s special election is particularly dangerous for Republicans as it occurs shortly after Thanksgiving.\n\nFormer Vice President Kamala Harris threw her weight behind Behn, speaking at a rally on Tuesday. However, her active role may be counterproductive, given her poor performance in 2024.\n\nTrump countered with a spirited endorsement of Epps, urging voters to back him in the polls.\n\nHARRIS STUMPS FOR TENNESSEE DEMOCRAT IN COMPETITIVE SPECIAL ELECTION\n\n“I am asking all America First Patriots in Tennessee’s 7th Congressional District, who haven’t voted yet, to please GET OUT AND VOTE for MAGA Warrior Matt Van Epps, tomorrow, November 26th, the last day to vote early in person,” Trump wrote on Truth Social. “You can win this Election for Matt! PLEASE VOTE FOR MATT VAN EPPS, who has my Complete and Total Endorsement.”\n\nThe special election has been escalated to national proportions due to its potential to alter the Republicans’ slim House majority.","summary":"Inside Elections changed its rating for Tennessee‘s 7th Congressional District special election from “safe Republican” to “lean Republican,” as Democrats continue to pour money into the race. Democrat Aftyn Behn and Republican Matt Van Epps are facing off to fill the seat of former Republican Tennessee Rep. Mark Green, who left Congress in June. Despite [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3899771/tennessee-7th-district-shifts-safe-republican-lean-republican-election-tracker/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/11/AP25321688056451.jpg?w=696","video":null,"publish_date":"2025-11-26 17:16:59","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.276},{"id":382487134,"title":"Crucial swing voters 'no longer fooled' by Trump — and Republicans are worried","text":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency. And those reasons range from health care to the economy to foreign policy.\n\nPotts said of health insurance, \"We had the lowest uninsured rate in the history of the United States in 2023…. It was the point of the Affordable Care Act…. to get as many people in this country insured as possible to move us toward universal health care. And Republicans let those enhanced subsidies expire. And what's happened as a result of that is that insurers have increased their premium rates. So right now, as we speak, people who buy health care on the insurance marketplaces are looking at the costs for next year, and they're seeing premiums for the same plans go up.\"\n\nPotts added, \"Some people are seeing really dramatic increases…. For other people, it’s increases of thousands of dollars for their family coverage. And some people are deciding to opt out and not buy insurance.\"\n\nTrump, Potts noted, ran \"on affordability issues\" in 2024 — and now, \"affordability\" is a key source of anxiety for the independents and swing voters who favored him last year.\n\n\"Energy bills are expensive,\" Potts told Sargent. \"The labor market is not very good right now. People feel stuck in their jobs. They feel like they're not making enough. They feel like they can't move forward. And so, people aren't very optimistic right now. And I think that all the things that Trump is doing are really making it worse to a huge degree…. I think that one thing to keep in mind, which is something I always try to remember, is that most people just do not pay that much attention to the ins and outs of politics or every single thing that every president does. And so, you know, in a lot of people's minds, Trump was still a successful businessman — and they had a, maybe a false memory or they had a kind of a rosy memory of the economy before COVID and they thought, well, things were better then. And he's a businessman — maybe he can get us out of this mess because (Joe) Biden had the bad luck to serve for four years that included a really weird post-COVID-era and high inflation.\"\n\nPotts continued, \"And so, I think that some people just thought, 'Well, he's a businessman, he can bring us jobs, he can straighten out the economy. Without thinking too much more about it. And so, I think that there were some voters who voted for Trump for that reason, and they’re no longer fooled. They can see now what's happening.\"\n\n Listen to the full New Republic podcast at this link or read the transcript here.","summary":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency.","url":"https://www.rawstory.com/alternet-posts/2674345310/","image":"https://www.rawstory.com/media-library/image.jpg?id=62243434&width=1200&height=600&coordinates=0%2C417%2C0%2C418","video":null,"publish_date":"2025-11-26 16:45:26","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.269},{"id":382403468,"title":"Crucial swing voters 'no longer fooled' by Trump — and Republicans are worried","text":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency. And those reasons range from health care to the economy to foreign policy.\n\nPotts said of health insurance, \"We had the lowest uninsured rate in the history of the United States in 2023…. It was the point of the Affordable Care Act…. to get as many people in this country insured as possible to move us toward universal health care. And Republicans let those enhanced subsidies expire. And what's happened as a result of that is that insurers have increased their premium rates. So right now, as we speak, people who buy health care on the insurance marketplaces are looking at the costs for next year, and they're seeing premiums for the same plans go up.\"\n\nPotts added, \"Some people are seeing really dramatic increases…. For other people, it’s increases of thousands of dollars for their family coverage. And some people are deciding to opt out and not buy insurance.\"\n\nTrump, Potts noted, ran \"on affordability issues\" in 2024 — and now, \"affordability\" is a key source of anxiety for the independents and swing voters who favored him last year.\n\n\"Energy bills are expensive,\" Potts told Sargent. \"The labor market is not very good right now. People feel stuck in their jobs. They feel like they're not making enough. They feel like they can't move forward. And so, people aren't very optimistic right now. And I think that all the things that Trump is doing are really making it worse to a huge degree…. I think that one thing to keep in mind, which is something I always try to remember, is that most people just do not pay that much attention to the ins and outs of politics or every single thing that every president does. And so, you know, in a lot of people's minds, Trump was still a successful businessman — and they had a, maybe a false memory or they had a kind of a rosy memory of the economy before COVID and they thought, well, things were better then. And he's a businessman — maybe he can get us out of this mess because (Joe) Biden had the bad luck to serve for four years that included a really weird post-COVID-era and high inflation.\"\n\nPotts continued, \"And so, I think that some people just thought, 'Well, he's a businessman, he can bring us jobs, he can straighten out the economy. Without thinking too much more about it. And so, I think that there were some voters who voted for Trump for that reason, and they’re no longer fooled. They can see now what's happening.\"\n\n Listen to the full New Republic podcast at this link or read the transcript here.","summary":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency.","url":"https://www.alternet.org/2674345310/","image":"https://www.alternet.org/media-library/image.jpg?id=62243434&width=1200&height=600&coordinates=0%2C417%2C0%2C418","video":null,"publish_date":"2025-11-26 16:45:26","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.269},{"id":382403960,"title":"Joe Concha predicts Rush Hour 4 ‘will be profitable’ thanks to MAGA viewers","text":"“President Trump probably knows entertainment as well as any president since Ronald Reagan,” Concha said on Fox News’s Fox and Friends First on Wednesday. “This is awesome because you know Trump will promote this film when it comes out. If MAGA comes to see it, it will be quite profitable.”\n\n“Since we know the president watches this show — he’s an early riser — I would say, Mr. President, can we get a Caddyshack 3?” Concha added. “Because Caddyshack 1 is an all-time classic, Caddyshack 2 was the worst sequel of all time, so we need a do-over on that one and collaboration with John Wick and Jason Bourne.”\n\nRush Hour 4 does not have a known release date as of Wednesday. Chan’s latest release was The Karate Kid: Legends this year. Tucker’s last movie was Air in 2023.\n\nParamount announced earlier this year that it would pay Trump $16 million to settle his lawsuit over its 60 Minutes program. While Trump himself did not appear on the program before the 2024 election, he sued over his then-opponent Vice President Kamala Harris’s segment, which received heavy edits. Shortly after, the Federal Communications Commission approved Paramount’s merger with Skydance.","summary":"Washington Examiner senior writer Joe Concha predicted a big box-office hit for Rush Hour 4 due to President Donald Trump’s reported involvement. Paramount Skydance greenlit the long-awaited Rush Hour sequel on Tuesday after Trump reportedly pressured CEO Larry Ellison to revive one of Trump’s favorite movie franchises. The action series centered on the partnership between [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3899730/concha-rush-hour-4-profitable-maga-viewers/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/trump-iowa-speech.webp?w=696","video":null,"publish_date":"2025-11-26 15:59:30","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","source_country":"US","sentiment":0.269},{"id":382451032,"title":"Shocking new poll shows deep-red congressional district could be next stop for Democrats’ ‘blue tsunami’","text":"A new poll shows that Democrats have a legitimate shot at flipping a deep-red congressional district in the heart of the South — and Republicans have now begun pouring money into it. \n\nEmerson College and The Hill conducted a poll for the special election in Tennessee’s 7th district, which takes place on Tuesday.\n\nRepublican Matt Van Epps has a slight lead at 48 percent, only two points ahead of Democratic state legislator Aftyn Behn, whom 46 percent of voters support. \n\n“The special election in Tennessee’s 7th District will come down to what groups are motivated to turnout on election day, and who stays home,” Spencer Kimball of Emerson said in a statement. \n\nThe number is stunning considering that President Donald Trump won the district by 22 points in 2024. If Democrats flip the seat, it would lower the number of Republicans in the conference to just 218, the exact number needed for a majority in the House of Representatives.\n\nAnd that comes before Rep. Marjorie Taylor Greene exits the House on January 5, which would lower the number of Republicans to 217. And Democrats will pick up an additional seat in Texas when the 18th district holds a special election in January and will likely hold New Jersey’s 11th district during the special election in April to replace Gov.-elect Mikie Sherrill. \n\nDemocrats hope to pull off a stunner race in the district as they have won or significantly overperformed in races across the country. \n\nIn November, Sherrill outperformed polling expectations in her race for governor and won by double digits while Abigail Spanberger won the governorship in Virginia by 15 points and won a supermajority in the state legislature. In August, Democrats flipped a Republican-held seat in Iowa’s state legislature, breaking the GOP’s supermajority.\n\n Republicans are spending heavily in the Nashville-area district to keep it red. \n\nOn Tuesday, Trump offered an enthusiastic backing of Van Epps in a rare post on X. \n\n“I am asking all America First Patriots in Tennessee’s 7th Congressional District, who haven’t voted yet, to please GET OUT AND VOTE for MAGA Warrior Matt Van Epps, tomorrow, November 26th, the last day to vote early in person,” he said. “You can win this Election for Matt! PLEASE VOTE FOR MATT VAN EPPS, who has my Complete and Total Endorsement.” \n\nBut the same poll showed Trump slightly underwater in the 7th district, as 47 percent of voters there approve of him and 49 percent disapprove. \n\n“President Trump’s approval rating is a stark reversal from last November, when he carried the district by 22 points. The decline is driven by independents, among whom 59% disapprove and just 34% approve,” Kimball said in his statement.\n\nBoth Democrats and Republicans have dumped money into the district. House Majority PAC, the Democrats main spending outlet, has reserved $515,000 worth of ads this week while Behn’s campaign has reserved $214,000 worth of ads, according to AdImpact, which tracks campaign spending. By contrast, MAGA Inc. the pro-Trump super PAC, has reserved $40,000 worth of ads, according to AdImpact. \n\nVice President Kamala Harris recently visited Tennessee at Fisk University, a historically Black college, and met with volunteers. \n\nRepublicans have also sought to paint Behn as out of touch, specifically highlighting an old podcast where she said about Nashville, “I hate this city, I hate the bachelorettes, I hate the pedal taverns, I hate country music. I hate all the things that make Nashville apparently an ‘it city.’”\n\nBut Behn defended herself. \n\n“You’re talking to someone who has cried no less than 10 times in the Country Music Hall of Fame,” she said in a video on X.","summary":"A special election next month could give Democrats another unexpected boost","url":"https://www.independent.co.uk/news/world/americas/us-politics/poll-tennessee-special-election-congress-b2872963.html","image":"https://static.independent.co.uk/2025/11/26/14/03/BehnVan-Epps-split.jpeg?crop=2047.5,1365,x0.3,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/vPC9YlA8-kPrKkZNL.mp4","publish_date":"2025-11-26 15:50:05","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.248},{"id":382397794,"title":"GOP Senators Defend Mark Kelly As Pentagon Seeks To Punish Him","text":"WASHINGTON ― Two Republican senators spoke up in defense of their Democratic colleague, Sen. Mark Kelly of Arizona, as the Trump administration seeks to punish him in response to a video he recorded last week, noting the military can defy illegal orders.\n\n“Senator Kelly valiantly served our country as an aviator in the U.S. Navy before later completing four space shuttle missions as a NASA astronaut,” Sen. Lisa Murkowski (R-Alaska) wrote in a social media post on Tuesday. “To accuse him and other lawmakers of treason and sedition for rightfully pointing out that servicemembers can refuse illegal orders is reckless and flat-out wrong.”\n\nThe moderate GOP senator added, “The Department of Defense and FBI surely have more important priorities than this frivolous investigation.”\n\nSen. John Curtis (R-Utah), a conservative who replaced Mitt Romney in the Senate, wrote: “I respect Mark Kelly and value his friendship.”\n\nHe went on to add, “I know him as someone whose career has been defined by service. His record as a combat naval aviator and NASA astronaut reflects his example of the discipline and dedication that are important for success.”\n\nThe Department of Defense said earlier this week it is reviewing “serious allegations of misconduct” against the Arizona senator, who is a decorated U.S. Navy veteran, and suggested he could face a court-martial. On Tuesday, Defense Secretary Pete Hegseth asked the Navy secretary to review Kelly’s comments in the video for “potentially unlawful conduct.”\n\nKelly has faced a barrage of attacks from President Donald Trump, who said he and the other five Democratic lawmakers who participated in the video message to servicemembers were guilty of “SEDITIOUS BEHAVIOR, punishable by DEATH.” The president then shared a post online calling for their hanging.\n\nThe FBI has also gotten involved by seeking to interview Kelly and the other Democratic lawmakers with its own probe, another highly unusual move in this saga.\n\nIt’s unclear whether any of these efforts will succeed since lawmakers are protected by the speech and debate clause of the U.S. Constitution, which shields members of Congress from being questioned or arrested for their official legislative actions. \n\nAppearing on ABC’s “Jimmy Kimmel Live” on Tuesday, Kelly called Hegseth “totally unqualified” for the job of defense secretary. \n\n“And from what I can tell in talking to some of my Republican colleagues, I mean, he just wants to please the president,” Kelly said of Hegseth, who was narrowly confirmed by the Senate after allegations of alcohol abuse and misconduct.\n\n“I’m not backing down,” Kelly told the late night host. “We said something very simple: Members of the military need to follow the law. We wanted to say that we have their backs. His response? Kill them.”\n\nKelly was first elected to the Senate in 2020, winning a special election to fill the remainder of the late Sen. John McCain’s (R-Ariz.) term. He was considered a potential running mate for Kamala Harris in the 2024 presidential election and is widely viewed as a possible 2028 Democratic presidential contender.\n\nTrump’s threats have only served to elevate Kelly within the Democratic Party. He’s since appeared on CBS’ “Face the Nation” over the weekend, as well as several cable news programs that are popular with liberal viewers, including ABC’s Kimmel, and MSNOW’s Rachel Maddow, Chris Hayes, and Joe Scarborough.\n\nDespite his promises to end the “weaponization” of law enforcement during the 2024 presidential campaign, Trump has ordered the Department of Justice to pursue many of his perceived enemies. In recent months, the DOJ has brought criminal charges against three prominent critics of the president, though a judge this week dismissed two of those cases.","url":"https://www.huffpost.com/entry/mark-kelly-trump-military_n_69270c07e4b063285311daed?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/69270dfc19000063826a01ca.jpeg?cache=4cq5cu6RZy&ops=1778_1000","video":null,"publish_date":"2025-11-26 15:45:47","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"ca","sentiment":0.158},{"id":382450816,"title":"GOP Senators Defend Mark Kelly As Pentagon Seeks To Punish Him","text":"WASHINGTON ― Two Republican senators spoke up in defense of their Democratic colleague, Sen. Mark Kelly of Arizona, as the Trump administration seeks to punish him in response to a video he recorded last week, noting the military can defy illegal orders.\n\n“Senator Kelly valiantly served our country as an aviator in the U.S. Navy before later completing four space shuttle missions as a NASA astronaut,” Sen. Lisa Murkowski (R-Alaska) wrote in a social media post on Tuesday. “To accuse him and other lawmakers of treason and sedition for rightfully pointing out that servicemembers can refuse illegal orders is reckless and flat-out wrong.”\n\nThe moderate GOP senator added, “The Department of Defense and FBI surely have more important priorities than this frivolous investigation.”\n\nSen. John Curtis (R-Utah), a conservative who replaced Mitt Romney in the Senate, wrote: “I respect Mark Kelly and value his friendship.”\n\nHe went on to add, “I know him as someone whose career has been defined by service. His record as a combat naval aviator and NASA astronaut reflects his example of the discipline and dedication that are important for success.”\n\nThe Department of Defense said earlier this week it is reviewing “serious allegations of misconduct” against the Arizona senator, who is a decorated U.S. Navy veteran, and suggested he could face a court-martial. On Tuesday, Defense Secretary Pete Hegseth asked the Navy secretary to review Kelly’s comments in the video for “potentially unlawful conduct.”\n\nKelly has faced a barrage of attacks from President Donald Trump, who said he and the other five Democratic lawmakers who participated in the video message to servicemembers were guilty of “SEDITIOUS BEHAVIOR, punishable by DEATH.” The president then shared a post online calling for their hanging.\n\nThe FBI has also gotten involved by seeking to interview Kelly and the other Democratic lawmakers with its own probe, another highly unusual move in this saga.\n\nIt’s unclear whether any of these efforts will succeed since lawmakers are protected by the speech and debate clause of the U.S. Constitution, which shields members of Congress from being questioned or arrested for their official legislative actions. \n\nAppearing on ABC’s “Jimmy Kimmel Live” on Tuesday, Kelly called Hegseth “totally unqualified” for the job of defense secretary. \n\n“And from what I can tell in talking to some of my Republican colleagues, I mean, he just wants to please the president,” Kelly said of Hegseth, who was narrowly confirmed by the Senate after allegations of alcohol abuse and misconduct.\n\n“I’m not backing down,” Kelly told the late night host. “We said something very simple: Members of the military need to follow the law. We wanted to say that we have their backs. His response? Kill them.”\n\nKelly was first elected to the Senate in 2020, winning a special election to fill the remainder of the late Sen. John McCain’s (R-Ariz.) term. He was considered a potential running mate for Kamala Harris in the 2024 presidential election and is widely viewed as a possible 2028 Democratic presidential contender.\n\nTrump’s threats have only served to elevate Kelly within the Democratic Party. He’s since appeared on CBS’ “Face the Nation” over the weekend, as well as several cable news programs that are popular with liberal viewers, including ABC’s Kimmel, and MSNOW’s Rachel Maddow, Chris Hayes, and Joe Scarborough.\n\nDespite his promises to end the “weaponization” of law enforcement during the 2024 presidential campaign, Trump has ordered the Department of Justice to pursue many of his perceived enemies. In recent months, the DOJ has brought criminal charges against three prominent critics of the president, though a judge this week dismissed two of those cases.","url":"https://www.huffpost.com/entry/mark-kelly-trump-military_n_69270c07e4b063285311daed?origin=top-ad-recirc","image":"https://img.huffingtonpost.com/asset/69270dfc19000063826a01ca.jpeg?cache=4cq5cu6RZy&ops=1778_1000","video":null,"publish_date":"2025-11-26 15:45:47","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"au","sentiment":0.158},{"id":382394540,"title":"Showdown for the House: Democrats, Republicans brace for high-stakes midterm clash","text":"Democrats, energized by their convincing victories earlier this month in the 2025 elections, are betting those results foreshadow a House flip in next year's midterm showdowns. The party out of power needs a net gain of just three seats to grab back the majority from the Republicans, who've controlled the House for nearly three years. And the party in power, which nowadays is clearly the Republicans, traditionally faces political headwinds in the midterm elections. At stake: the success of President Donald Trump's second-term agenda. \"We'll take back the House in 2026,\" Democratic Congressional Campaign Committee chair Rep. Suzan DelBene of Washington state told Fox News Digital. DEMOCRATS, REPUBLICANS, GO ALL IN ON FINAL CONGRESSIONAL ELECTION SHOWDOWN OF THE YEAR But for Republicans, aiming to protect their fragile majority, the magic number is also three. \"The only number I'm concerned about is three. We have three Republicans in seats Kamala Harris carried,\" said Rep. Richard Hudson of North Carolina, chair of the National Republican Congressional Committee. He pointed to districts carried during the 2024 presidential election by then-Vice President Kamala Harris. HOUSE GOP CAMPAIGN CHAIR WANTS TRUMP 'OUT THERE ON THE TRAIL' IN MIDTERM BATTLE FOR MAJORITY And Hudson, in a Fox News Digital interview, highlighted that Democrats have \"13 sitting in seats Donald Trump won. They've got 21 more sitting in seats that Donald Trump barely lost. So there, there are only a few seats up for grabs this time, most of them are Democrat seats.\" The most recent national polls indicate Democrats with the upper hand in the 2026 battle for the House majority. But DelBene cautioned, \"We take nothing for granted.\" And Hudson was optimistic that Republicans would \"grow our House majority.\" High prices and out-of-control cost of living were key issues that boosted Trump and Republicans in the 2024 elections, as they won back the White House and Senate majority and kept control of the House. But what a difference a year makes. Democrats, with an across-the-board focus on affordability, overperformed at the polls as they enjoyed sweeping ballot box success earlier this month. Democrats scored double-digit gubernatorial wins in blue-leaning but competitive New Jersey and Virginia, and convincing victories in high-profile showdowns in battlegrounds Georgia and Pennsylvania and left-tilting New York City and California. \"It was clear that when folks are talking about the biggest issues affecting their communities, and right now, affordability, with the rising costs people have seen as a result of the policies put in place by this administration and Republicans in Congress, they rejected that,\" DelBene said as she pointed to the 2025 election results. DEMOCRATS DOUBLE-DOWN ON THIS KEY ISSUE \"Absolutely, we saw that in governor's races like Virginia and New Jersey, but [also] in races across the country,\" she added. The most recent Fox News national poll was another warning sign for Trump and the GOP. Three-quarters of voters questioned in the survey viewed the economy negatively, and large numbers of respondents, including Republicans, said their costs for groceries, utilities, healthcare and housing have gone up this year. The poll indicated that voters blame the president, with nearly twice as many pointing fingers at Trump than former President Joe Biden, when asked who is responsible for the current economy. Only 38% of those questioned gave the president a thumbs-up to how he's handling the economy. And Trump's overall approval rating, at 41%, was the lowest of his second term in office in Fox News polling. \"Affordability is still the number one issue for families. Housing, food, health care, child care, energy costs all going up directly as a result of policies put in place by Republicans in Congress and Donald Trump. And they promised to lower costs on day one,\" DelBene said. SETTING THE STAGE: WHAT THE 2025 ELECTIONS SIGNAL FOR NEXT YEAR'S MIDTERM SHOWDOWNS Pointing to last year's elections, she said, \"That was their big message. They were going to lower costs. It has been a big broken promise, and people are feeling that and and that's had a big impact and will continue. People want folks who are going to stand up to them for them, not just be blindly loyal to the president.\" Hudson, asked about the political impact of the cost of living, took aim at the former president. \"There are challenges out there with the economy, because Biden broke it, and House Republicans, working with President Trump, are going to fix it, and we're working very hard to do that,\" he said. \"Certainly, we could always improve the way we communicate with our voters about it,\" he added. \"But we are laser-focused on the issues that matter to them. You know, it's the cost of things, it's the security in their neighborhood, it's a secure border. We are very focused on that, and we've delivered a lot of things that are going to make their lives better.\" DEMOCRATS SEE MANDATE AFTER 2025 WINS — REPUBLICANS SAY IT'S A MIRAGE And looking ahead to next year, he added, \"Come tax season, a lot of families are going to be really happy to see they've got a lot more take-home pay, and that's because of Donald Trump and House Republicans.\" The DCCC, in its messaging, has tied vulnerable House Republicans to Trump. DelBene argued that it's \"Republican policies that are hurting American families, the tariffs that Donald Trump has put in place that have raised costs for families across the country, their ongoing work to gut healthcare across this country.\" And she charged that the \"policies that they have prioritized have been favoring the wealthy and the well-connected, tax breaks for the wealthy and the well-connected, but hurting working families across the country. People are feeling that, and we're going to continue to call that out.\" Hudson called the 2025 elections a \"wake-up call\" for GOP voters and that he wants Trump \"out there on the trail\" in next year's midterms. Plenty of Republicans have downplayed the Democrats' high-profile victories, noting they largely took place in blue-leaning states. Hudson noted the top elections took place in \"Democrat states,\" but added, \"I think our big takeaway as Republicans is the Democrats were energized. They turned out at record levels. Republicans turned out in normal levels.\" \"I think there's a wake-up call there to conservatives and Republicans who are happy with the direction of the country. They're glad President Trump's back in the White House. But if they want to keep this momentum going, they've got to show up and vote,\" he said. Many of Trump's MAGA supporters are considered low-propensity voters, who head to the polls only when Trump is on the ballot. But Trump won't be on the ballot in the 2026 midterms. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Hudson, who noted that \"House Republicans are very closely aligned with President Trump, and we're supporting his agenda,\" said that \"we want him out there on the trail, campaigning with our candidates. I think he brings a lot of energy.\" Pointing to \"a lot of folks who don't vote when he's not on the ballot,\" Hudson said, \"I don't need all of them to show up, but I need some of them. And so having President Trump out there will be a big benefit for us.\"","summary":"Democrats eye House majority flip in 2026 midterms after strong 2025 wins. With only 3 seats needed, both parties prepare for crucial Trump agenda battle.","url":"https://www.foxnews.com/politics/showdown-house-democrats-republicans-brace-high-stakes-midterm-clash","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/delbene-hudson.jpg","video":null,"publish_date":"2025-11-26 14:00:55","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.149},{"id":382404532,"title":"Brazilian Mother of Karoline Leavitt's Nephew Is Arrested by ICE — Despite Living in the US Since 1998","text":"A Brazilian immigrant, identified as the mother of Karoline Leavitt's nephew, was arrested on 12 November 2025, by US Immigration and Customs Enforcement (ICE) in Revere, Massachusetts.The woman, Bruna Caroline Ferreira, who has lived in the United States since 1998 and was once a DACA recipient, was detained while driving to pick up her son. She now faces removal proceedings to Brazil.The arrest — occurring close to the Thanksgiving holiday — has sparked public interest because of her link to the White House press secretary and has raised questions about the scope of ongoing immigration crackdowns.READ MORE: 'It Is ENTIRELY The Fault of the Democrat Party': Press Secretary Leavitt's Scathing Remarks about the Government ShutdownREAD MORE: Dick Cheney's Death: The 'Icy' White House Response After Voting Kamala Harris RevealMother of Karoline Leavitt's Nephew Arrested by ICEFerreira was taken into custody during what family members described as a routine trip to pick up her 11-year-old son in New Hampshire.ICE agents intercepted her in Revere, placed her under arrest, and later transferred her to a detention center in southern Louisiana. She is currently in immigration court proceedings where she faces potential deportation.Who is Bruna Caroline FerreiraFerreira, a Brazilian-born immigrant, is the mother of a child she shares with Michael Leavitt — the brother of White House Press Secretary Karoline Leavitt. She and Michael were previously engaged and share joint custody of their son.According to family sources, Ferreira and Karoline Leavitt have not been in contact for many years. According to CNN, the child has lived with his father full-time in New Hampshire since birth.Ferreira Has Lived in the US Since 1998Ferreira arrived in the US in December 1998 when she was just a child on a B-2 tourist visa, which required her departure by mid-1999. She remained in the country and grew up in the US, eventually receiving protection under the Deferred Action for Childhood Arrivals (DACA) program.Loved ones say she has spent nearly her entire life in the United States, raising her son, maintaining steady employment, and contributing to her community.DHS Explains Why ICE Arrested HerAccording to the Department of Homeland Security, Ferreira is classified as an 'unlawfully present' immigrant because she overstayed her tourist visa more than two decades ago. DHS also cited a prior arrest for battery as part of the justification for her detention.Her attorney disputes those claims, insisting that Ferreira has no criminal record and was already in the process of obtaining permanent residency when she was detained.Officials also emphasized that Karoline Leavitt had no involvement in the arrest and was not notified in advance.'Karoline had no involvement whatsoever in this matter', a DHS spokesperson clarified.Family Launches Fundraiser to Fight DeportationFollowing her detention, Ferreira's sister, Graziela Dos Santos Rodrigues, created a GoFundMe campaign to raise money for legal fees and travel expenses needed to support the family during the immigration case.The fundraiser has surpassed $15,000 (£11,404.20), with Rodrigues writing that her sister has lived in the US 'nearly her entire life', has followed the law, and deserves a chance to remain with her child.The family expressed deep concern that Ferreira's son now faces the holiday season without his mother.'Any amount, no matter how small, will make a difference. If you're unable to donate, sharing this page also helps more than you know', said Rodrigues.Ferreira's family still needs donations as their goal is to reach $30,000 (£22,810.80).","url":"https://www.ibtimes.co.uk/brazilian-mother-karoline-leavitts-nephew-arrested-ice-despite-living-us-since-1998-1758257","image":"https://d.ibtimes.co.uk/en/full/1771625/brazilian-mother-karoline-leavitts-nephew-arrested-ice.png?w=1600&h=900&q=88&f=996565a16e2cf88176c939553907db67","video":null,"publish_date":"2025-11-26 13:37:17","author":"Giuliano de Leon","authors":["Giuliano de Leon"],"language":"en","source_country":"gb","sentiment":-0.204},{"id":382392038,"title":"‘A revolving door’: Last-minute scramble to fill Gavin Newsom’s shoes in California","text":"The ballooning field of Democratic candidates to succeed the term-limited Gavin Newsom as governor of California has political operatives stunned.\n\n\"This is as wide open as I've ever seen anything in 25 years,\" said Steven Maviglio, a Sacramento-based Democratic strategist.\n\nThe challenge for those running will be proving to voters they can tackle California's cost-of-living crisis, as well as fill the high-profile void Newsom will leave behind as a national leader in Democrats' fight against President Donald Trump.\n\nLast week, Rep. Eric Swalwell, who made a name for himself as an anti-Trump firebrand in the House of Representatives and launched a short-lived bid for the White House in 2020, announced his campaign for governor on ABC’s \"Jimmy Kimmel Live!,\" telling Kimmel that California \"needs a fighter and a protector.\"\n\nBillionaire Tom Steyer, who also ran an unsuccessful campaign for president in 2020, announced his campaign the day before. Steyer, who is well-known in progressive circles for his environmental advocacy, spent millions backing Newsom's recent Proposition 50 redistricting push.\n\n\"Everyone in this race is going to talk about affordability, but what Californians care about is results, and who's going to be able to deliver when it comes to lowering costs. And Tom has a record of getting things done for California, even when the real politicians couldn't,\" a spokesperson for Steyer said.\n\nBoth Swalwell and Steyer join a crowded field of prominent Democrats, such as former Los Angeles Mayor Antonio Villaraigosa.\n\n\"I am a proven problem solver,\" Villaraigosa told ABC News in a statement.\n\n\"As the Speaker of the California Assembly, I extended affordable health care to millions of children and I passed the toughest assault weapons ban in America. As Mayor, I reduced crime by 50% and increased our school graduation rate by 60%. No other candidate for governor has delivered results like those,\" Villaraigosa added.\n\nVillaraigosa is jockeying for position among other California politicians, including former Rep. Katie Porter and former California Attorney General Xavier Becerra, who was also secretary of Health and Human Services in the Biden administration.\n\n\"Secretary Becerra is the only candidate in this race to take on the Trump Administration and win, suing 122 times to protect Californians as Attorney General. He delivered affordable care for millions and he negotiated lower drug prices to save California families thousands of dollars,\" a Becerra campaign spokesperson told ABC News in a statement.\n\nStrategists are surprised that no candidate has clearly established themselves as a front-runner, signaling some instability in the race to lead a state of nearly 40 million people. \n\n\"It's one of the most consequential races in the entire country that nobody's ever heard of yet,\" Democratic strategist Danielle Cendejas said. \"There is a lot on the line who the next governor is.\"\n\n\"A historically weak field\"\n\nDemocratic strategist Matt Rodriguez believes the reason the primary is so crowded is because no one candidate is very strong.\n\n\"I think it's a very weak field, a historically weak field,\" he said.\n\nCalifornia employs a \"jungle\" or \"top-two\" primary, in which there is one nonpartisan primary for all candidates, with the top two candidates in the primary moving on to a runoff in November, regardless of party.\n\nRodriguez said having so many Democratic candidates in a jungle primary \"definitely gives an advantage to a Republican getting into the top two. At some point, there's just only so many Democratic voters to split up here.\"\n\nMaviglio said two Republicans ending up in the general election is \"possible, not probable.\"\n\n\"We've only seen it in legislative races a couple of times, where the party that actually has the majority doesn't make it into the November election because of strangeness like that happening,\" he said.\n\nSlim chance for a Republican candidate\n\nGOP strategist and former executive director of the California Republican Party Jon Fleischman said that even if a Republican makes it to the general election, they would have a slim chance at winning the whole thing.\n\n\"Maybe the most important thing to remember in California is that if you have a general election between a Republican and a Democrat, unless some massive scandal of epic proportion were to strike the Democrat, we're a blue state,\" Felischman said.\n\n\"The only time it gets maybe more interesting is if two Democrats make the runoff,\" Felischman added.\n\nThere are currently two major Republican candidates in the race, one of whom is former Fox News host Steve Hilton.\n\n\"A crowded Democratic field means those candidates will spend months fighting each other and defending the status quo, while Steve Hilton is focused on changing it,\" Hilton campaign manager Matt Ciepielowski told ABC News in a statement.\n\n\"Californians are tired of the highest poverty in the nation, sky-high housing costs, failing schools, and a government that serves special interests instead of working families. Steve is running to make California affordable, safe, and full of opportunity again,\" the statement continued.\n\nThe other major Republican running is Riverside County Sheriff Chad Bianco, who is emphasizing his law enforcement background to define himself as someone who will be tough on crime.\n\n\"Each Democrat running is hoping to be a more liberal version of the narcissist that is currently the Governor and Californians simply cannot afford to have that happen. Sheriff Bianco offers a new way forward and the public polling proves that his campaign is resonating with voters,\" Rick Gorka, a spokesperson for the Bianco campaign, told ABC News in a statement.\n\nA still-unsettled race\n\nOthers might still jump in on the right, like tech entrepreneur Jon Slavet, who filed FEC paperwork Friday and told ABC News he plans to launch his campaign early next month.\n\nMaviglio characterized the race as \"unsettled\" and \"a revolving door.\"\n\nVice President Kamala Harris was mulling a bid following her defeat in last year’s presidential election, but she announced in July she was no longer considering running. And U.S. Sen. Alex Padilla -- who strategists say might have cleared the field had he launched a bid -- decided against a run earlier this month.\n\n\"We've had people say they're running and exit out of the race. We've had people that were lured into thinking about running, like Padilla and Harris, and then opting not to. So it's really hard to track,\" Maviglio said.\n\nTwo politicians -- California Lt. Gov. Eleni Kounalakis and former president pro tempore of the California state Senate Toni Atkins -- initially announced their candidacies, only to exit the race shortly thereafter. \n\nAnother rumored potential Democratic contender is billionaire Rick Caruso, who lost the 2022 Los Angeles mayoral race to Karen Bass. While Caruso has deep pockets and some name recognition, he was a Republican until 2019, which could alienate the progressive wing of his new party.\n\nAnd while both Steyer and Caruso have the cash, strategists say they would have to use it wisely to mount successful campaigns.\n\n\"Self-funders do not do well here. It doesn't mean they can't, but they typically don't,\" Rodriguez said, pointing to the failed bids of Michael Huffington in the 1994 Senate race, Al Checchi in the 1998 gubernatorial election and Caruso in 2022.\n\nTrouble for early front-runner\n\nPorter, the initial front-runner and only major female candidate in the field, seemed to have momentum after gaining backing from the progressive PAC EMILY’s List and several statewide labor unions. Cendejas acknowledged that Porter likely had an early advantage due to her name recognition and the fact that she is \"beloved in a lot of progressive circles.\"\n\n\"Katie is a fighter, a single mom of three, and a ruthless champion for working families who took on the Trump Administration and self-serving CEOs in Congress -- and won,\" Peter Opitz, a spokesperson for the Porter campaign, told ABC News in a statement. \n\nBut recent controversy surrounding Porter's conduct has tightened her initial lead, indicating she may not be as strong of a candidate as was originally thought.\n\nIn a video that went viral online last month, Porter had a contentious interaction with a journalist, going so far as threatening to end the interview. Another video surfaced shortly thereafter showing Porter yelling at a staffer.\n\n\"What goes up must come down,\" Cendejas said of Porter.\n\nIn her first appearance after the videos emerged, Porter apologized for the outbursts.\n\n\"I want people to know that I understand that what I did was not good,\" Porter told an audience at the UC Student and Policy Center in Sacramento in October. \"I'm not going to mince words about it, but I also want people to understand that I am in this fight because I am not going to back down and give one inch when people are hurting Californians. And both of those things can be true at the same time.\"\n\nRodriguez expects that the ability for a candidate to successfully define themselves as someone who can lead California in going toe-to-toe with Trump will be \"the whole thing.\"\n\n\"I think Trump is going to be gigantic here,\" Rodriguez added. \"Everything is going to be Trump.\"","summary":"Ballooning field of Democratic candidates in California to succeed term-limited Gov. Gavin Newsom has Democratic operatives stunned.","url":"https://abcnews.go.com/Politics/revolving-door-minute-scramble-fill-gavin-newsoms-shoes/story?id=127805112","image":"https://i.abcnewsfe.com/a/67ff882a-147d-424f-9275-ac3d50e6f89c/katie-porter-20251123-ap-jh_1763928810310_hpMain_16x9t.jpg?w=1600","video":null,"publish_date":"2025-11-26 10:19:00","author":"Brittany Shepherd,Halle Troadec","authors":["Brittany Shepherd","Halle Troadec"],"language":"en","source_country":"us","sentiment":0.135},{"id":382357426,"title":"Republican Lawmakers Criticize White House Treatment, Warn of Potential Party Revolt","text":"Marjorie Taylor Greene’s recent departure might not be an isolated event within the Republican ranks.\n\nConversations with unnamed lawmakers suggest emerging divisions in the Republican conference, as some members of Congress are reportedly considering an early exit before the midterm elections.\n\nSeveral Republican House representatives are allegedly contemplating retiring mid-term, following the path of the outspoken Georgian politician.\n\nGreene surprised many on Friday night by declaring her intention to retire in January, after a contentious and lengthy dispute with President Trump. Her decision seems to have caught the attention of others, who might be considering a similar move.\n\nThe catalyst for this potential exodus appears to be a growing sense of frustration and anger toward a White House that has sidelined their input, coupled with a challenging midterm outlook for the Republicans.\n\nFormer House Speaker Kevin McCarthy, speaking on Fox News, described Greene as “the canary in the coal mine,” warning, “Congress needs to wake up because they might see a wave of retirements.”\n\nOne reportedly highly placed lawmaker told news site Punchbowl that the White House team has treated members ‘like garbage,’ also noting that ‘morale has never been lower.’\n\nHowever, a House GOP aide told Daily Mail that he did not ‘view Punchbowl’s reports’ of ‘garbage’ treatment ‘as accurate, and in the case it is accurate, the more people who share the same mindset [with Greene] and leave, the better it is for the party.’\n\nWhite House spokeswoman Abigail Jackson told the Daily Mail after this article’s initial publication that ‘the president’s legislative agenda is a historic success.’\n\n‘From the largest and most consequential Republican domestic legislation ever, which fulfilled dozens of campaign promises and was signed on July 4, record speed and quantity of nominations, landmark cryptocurrency legislation, and fulfilling the multi-decade goal of defunding NPR and PBS, the President has gotten massive amounts of his agenda through Congress in the face of total Democratic obstruction,’ Jackson added.\n\nChristian Conservative broadcaster Erick Erickson noted on X that he has noticed a stream of dissatisfaction with the White House legislative team, writing that members will either assert their need to be a part of decisions, or they will quit early.’\n\nTop Trump ally Steve Bannon ‘likened Congress to the Duma,’ commenting on their ‘ceremonial’ nature per the Wall Street Journal. The characterization was not intended as a compliment.\n\nAs the political pendulum typically swings away from the party of the President in the midterm election, Republicans are poised to lose political power and most likely the speaker’s gavel in the House of Representatives come 2027. \n\nHowever, if Republicans resign and Democrats win special elections, Speaker Mike Johnson’s gavel may be in jeopardy sooner rather than later.\n\nEven if members do not resign, many may choose not to seek reelection during the expected midterm bloodbath.\n\nA prime example of this is Representative Don Bacon, a Nebraska Republican who would have had to fight an uphill battle in a district that was won by Kamala Harris during last year’s presidential election. Bacon has announced that he will not seek re-election.\n\nBacon told Axios he was so appalled by the Trump administration’s peace plan in Ukraine that he considered resigning in protest. \n\nOthers still have voiced their dissatisfaction with Washington in other ways, namely by seeking office in their home states.\n\nTexas Congressman Chip Roy announced in August that he plans to depart Capitol Hill after four terms and seek the role of state attorney general in the Lone Star state.\n\nHis decision came after he earned the wrath of Trump for getting in the way of his MAGA agenda.\n\nDuring his time in Congress, Roy has not been afraid to buck members of his own political party, causing headaches for Johnson and even the President.\n\nA large number of prominent Republican members of Congress in both chambers are also running for governor of their respective home states, at times against their Congressional colleagues.\n\nThe Republican primary for South Carolina governor includes both Representative Ralph Norman and Congresswoman Nancy Mace.\n\nFormer House Republican chairman Elise Stefanik is running for governor of New York, and Congressman Byron Donalds is running for governor in his home state of Florida.\n\nSenators have also announced their decisions to leave Washington for home-state bids. Marsha Blackburn is running for governor of Tennessee, and former Auburn University football coach Tommy Tuberville is running for governor of Alabama.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMarjorie Taylor Greene&#8217;s recent departure might not be an isolated event within&#8230;\n\n\nThis Post: Republican Lawmakers Criticize White House Treatment, Warn of Potential Party Revolt first appeared on Internewscast Journal","url":"https://internewscast.com/politics/republican-lawmakers-criticize-white-house-treatment-warn-of-potential-party-revolt/","image":"https://internewscast.com/wp-content/uploads/2025/11/Warnings-of-massive-GOP-mutiny-as-Republican-lawmakers-lash-out.jpg","video":null,"publish_date":"2025-11-26 09:53:05","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.057},{"id":382554000,"title":"The Root Unveils The Root 100 List","text":"The Root just revealed their 2025 honorees of The Root 100, an annual list celebrating the most influential Black icons in America who have made a significant impact in their fields and communities, across arts & entertainment, business, activism, media, science, technology, social justice, politics, culture, philanthropy, sports, and beyond. \n\nThe Root 100: 2025 list includes Vice President Kamala Harris, Denzel Washington, Pastor Jamal Bryant, Doechii, Teyana Taylor, Supreme Court Justice Ketanji Brown Jackson, Kai Cenat, Gayle King, New York Attorney General Letitia James, Samara Joy, Audra McDonald, Whoopi Goldberg, Taraji P. Henson, Tracee Ellis Ross, Pastor Sarah Jakes Roberts, Ryan Coogler, Beyoncé, Kendrick Lamar, A’ja Wilson, Robin Roberts, Misty Copeland, Whoopi Goldberg, Robert F. Smith, Joy Ann Reid, Michael B. Jordan, Tina Knowles, The Breakfast Club, and many others who have made an indelible mark on Black American culture and beyond.\n\nClick here for a full list of The Root 100: 2025’s Most Influential African Americans.\n\nSince its inception in 2011, The Root 100 has become a hallmark of Black achievement, recognizing celebrities, public figures, community leaders, and the behind-the-scenes change-makers whose influence impacts the culture. “Unlike in previous years, The Root 100 will present the best in Black achievement without rankings, celebrating each honoree equally for their contributions and impact,” shares Ashley Allison, publisher of The Root. “This shift reflects a renewed commitment to collective recognition, honoring the shared brilliance, innovation, and cultural influence that continues to define the Black experience. Each honoree on the 2025 list represents achievement in their own right, reinforcing that The Root 100 List is not a competition, but a celebration of collective power.”\n\nIn 2025, The Root came under new leadership, marking a fresh chapter for the iconic platform. Ashley Allison’s acquisition of The Root brings renewed focus on Black ownership and authentic storytelling, with a continued commitment to showcasing the voices and achievements of Black Americans who are reshaping industries, communities, and global culture. Under Allison’s leadership, the 2025 Root 100 continues the legacy of The Root 100 list while embracing the future with new perspectives, fresh content, and innovative partnerships.\n\nHonorees from The Root 100: 2025’s Most Influential African-Americans list will be celebrated at an exclusive invite-only event in New York City this December, presented in partnership with Martell. The evening will honor the power, influence, and cultural impact of this year’s trailblazers and toast those redefining excellence across every field. #TheRoot100","summary":"The Root just revealed their 2025 honorees of The Root 100, an annual list celebrating the most influential Black icons in America who have made a significant impact in their fields and communities, across arts &#38; entertainment, business, activism, media, science, technology, social justice, politics, culture, philanthropy, sports, and beyond.  The Root 100: 2025 list includes&#160;Vice President [&#8230;]","url":"https://www.bajanreporter.com/2025/11/the-root-unveils-the-root-100-list/","image":"https://www.bajanreporter.com/wp-content/uploads/2025/11/The-Root-Unveils-The-Root-100-List-1.jpg","video":null,"publish_date":"2025-11-26 09:48:00","author":"Bajan Reporter,Celia Aniskovich","authors":["Bajan Reporter","Celia Aniskovich"],"language":"en","category":"politics","source_country":"bb","sentiment":0.769},{"id":382397888,"title":"Stephen Miller's Thanksgiving Thanks Has Critics Scratching Their Heads","text":"Stephen Miller, the Trump White House deputy chief of staff for policy, drew ire on Tuesday for plucking a number seemingly out of thin air.\n\nMiller, the architect of President Donald Trump’s hardline immigration crackdown, was asked by Fox News’ Jesse Watters what he’s thankful for this Thanksgiving.\n\n“You asked me what I’m thankful for this Thanksgiving,” Miller said, raising his voice. “I praise God every day that Donald Trump is our president and we’ve gone from 30% inflation, 20 million illegals, unlimited refugees, violent crime in our cities to security in our cities, no more illegals, no more refugees and finally a country that puts American citizens first.”\n\nWatch here:\n\nCritics quickly questioned Miller’s rhetoric, especially the 30% inflation claim.\n\nInflation under Trump’s predecessor, former President Joe Biden, did soar and is widely credited with being one of the key factors in Trump winning back the White House in the 2024 election against then-Vice President Kamala Harris.\n\nBut year-on-year inflation peaked at just under 10% in mid-2022 and cumulative inflation across Biden’s entire presidency was 21%, with neither close to Miller’s figure. Inflation did then dip before Trump’s return to the Oval Office, and the affordability crisis is also currently one of the biggest issues facing the current president.\n\nWatters later asked Miller, who is married to MAGA podcaster Katie Miller and has three children, how he approaches the holiday in his own household.\n\n“I would be incapable of helping,” he admitted. “If I attempted to help, it would be interpreted widely as an act of sabotage.”\n\nMiller said it’s a great excuse for not doing anything.\n\n“It’s kind of like, they say when men fold a sweater wrong, you never have to fold a sweater again,” he told Watters. “The safest play is to just watch TV and stay out of the way as best you can. My service is saying how delicious the gravy is, how great the turkey is, how wonderful the cranberry sauce is. That’s how I give back, with compliments.”\n\nCritics were less than complimentary about his comments, though","url":"https://www.huffpost.com/entry/stephen-miller-thanksgiving_n_6926b8f9e4b043c0cb075487?origin=top-ad-recirc","image":"https://img.huffingtonpost.com/asset/6926bde6220000ba3460bcd1.jpeg?cache=8nCeq765Bo&ops=1778_1000","video":null,"publish_date":"2025-11-26 09:36:32","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"ca","sentiment":0.178},{"id":382397798,"title":"Stephen Miller's Thanksgiving Thanks Has Critics Scratching Their Heads","text":"Stephen Miller, the Trump White House deputy chief of staff for policy, drew ire on Tuesday for plucking a number seemingly out of thin air.\n\nMiller, the architect of President Donald Trump’s hardline immigration crackdown, was asked by Fox News’ Jesse Watters what he’s thankful for this Thanksgiving.\n\n“You asked me what I’m thankful for this Thanksgiving,” Miller said, raising his voice. “I praise God every day that Donald Trump is our president and we’ve gone from 30% inflation, 20 million illegals, unlimited refugees, violent crime in our cities to security in our cities, no more illegals, no more refugees and finally a country that puts American citizens first.”\n\nWatch here:\n\nCritics quickly questioned Miller’s rhetoric, especially the 30% inflation claim.\n\nInflation under Trump’s predecessor, former President Joe Biden, did soar and is widely credited with being one of the key factors in Trump winning back the White House in the 2024 election against then-Vice President Kamala Harris.\n\nBut year-on-year inflation peaked at just under 10% in mid-2022 and cumulative inflation across Biden’s entire presidency was 21%, with neither close to Miller’s figure. Inflation did then dip before Trump’s return to the Oval Office, and the affordability crisis is also currently one of the biggest issues facing the current president.\n\nWatters later asked Miller, who is married to MAGA podcaster Katie Miller and has three children, how he approaches the holiday in his own household.\n\n“I would be incapable of helping,” he admitted. “If I attempted to help, it would be interpreted widely as an act of sabotage.”\n\nMiller said it’s a great excuse for not doing anything.\n\n“It’s kind of like, they say when men fold a sweater wrong, you never have to fold a sweater again,” he told Watters. “The safest play is to just watch TV and stay out of the way as best you can. My service is saying how delicious the gravy is, how great the turkey is, how wonderful the cranberry sauce is. That’s how I give back, with compliments.”\n\nCritics were less than complimentary about his comments, though","url":"https://www.huffpost.com/entry/stephen-miller-thanksgiving_n_6926b8f9e4b043c0cb075487?origin=home-zone-b-unit","image":"https://img.huffingtonpost.com/asset/6926bde6220000ba3460bcd1.jpeg?cache=8nCeq765Bo&ops=1778_1000","video":null,"publish_date":"2025-11-26 09:36:32","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"ca","sentiment":0.178},{"id":382346428,"title":"Stephen Miller's Thanksgiving Thanks Has Critics Scratching Their Heads","text":"Stephen Miller, the Trump White House deputy chief of staff for policy, drew ire on Tuesday for plucking a number seemingly out of thin air.\n\nMiller, the architect of President Donald Trump’s hardline immigration crackdown, was asked by Fox News’ Jesse Watters what he’s thankful for this Thanksgiving.\n\n“You asked me what I’m thankful for this Thanksgiving,” Miller said, raising his voice. “I praise God every day that Donald Trump is our president and we’ve gone from 30% inflation, 20 million illegals, unlimited refugees, violent crime in our cities to security in our cities, no more illegals, no more refugees and finally a country that puts American citizens first.”\n\nWatch here:\n\nCritics quickly questioned Miller’s rhetoric, especially the 30% inflation claim.\n\nInflation under Trump’s predecessor, former President Joe Biden, did soar and is widely credited with being one of the key factors in Trump winning back the White House in the 2024 election against then-Vice President Kamala Harris.\n\nBut year on year inflation peaked at just under 10% in mid-2022 and cumulative inflation across Biden’s entire presidency was 21%, with neither close to Miller’s figure. Inflation did then dip before Trump’s return to the Oval Office and the affordability crisis is also currently one of the biggest issues facing the currebnt president.\n\nWatters later asked Miller, who is married to MAGA podcaster Katie Miller and has three children, how he approaches the holiday in his own household.\n\n“I would be incapable of helping,” he admitted. “If I attempted to help it would be interpreted widely as an act of sabotage.”\n\nMiller said it’s a great excuse for not doing anything.\n\n“It’s kind of like, they say when men fold a sweater wrong, you never have to fold a sweater again,” he told Watters. “The safest play is to just watch TV and stay out of the way as best you can. My service is saying how delicious the gravy is, how great the turkey is, how wonderful the cranberry sauce is. That’s how I give back, with compliments.”\n\nCritics were less than complementary about his comments, though","url":"https://www.huffpost.com/entry/stephen-miller-thanksgiving_n_6926b8f9e4b043c0cb075487?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/6926bde6220000ba3460bcd1.jpeg?cache=L1W08oMo7F&ops=1778_1000","video":null,"publish_date":"2025-11-26 09:36:32","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"au","sentiment":0.131},{"id":382346426,"title":"Stephen Miller's Thanksgiving Thanks Has Critics Scratching Their Heads","text":"Stephen Miller, the Trump White House deputy chief of staff for policy, drew ire on Tuesday for plucking a number seemingly out of thin air.\n\nMiller, the architect of President Donald Trump’s hardline immigration crackdown, was asked by Fox News’ Jesse Watters what he’s thankful for this Thanksgiving.\n\n“You asked me what I’m thankful for this Thanksgiving,” Miller said, raising his voice. “I praise God every day that Donald Trump is our president and we’ve gone from 30% inflation, 20 million illegals, unlimited refugees, violent crime in our cities to security in our cities, no more illegals, no more refugees and finally a country that puts American citizens first.”\n\nWatch here:\n\nCritics quickly questioned Miller’s rhetoric, especially the 30% inflation claim.\n\nInflation under Trump’s predecessor, former President Joe Biden, did soar and is widely credited with being one of the key factors in Trump winning back the White House in the 2024 election against then-Vice President Kamala Harris.\n\nBut year on year inflation peaked at just under 10% in mid-2022 and cumulative inflation across Biden’s entire presidency was 21%, with neither close to Miller’s figure. Inflation did then dip before Trump’s return to the Oval Office and the affordability crisis is also currently one of the biggest issues facing the currebnt president.\n\nWatters later asked Miller, who is married to MAGA podcaster Katie Miller and has three children, how he approaches the holiday in his own household.\n\n“I would be incapable of helping,” he admitted. “If I attempted to help it would be interpreted widely as an act of sabotage.”\n\nMiller said it’s a great excuse for not doing anything.\n\n“It’s kind of like, they say when men fold a sweater wrong, you never have to fold a sweater again,” he told Watters. “The safest play is to just watch TV and stay out of the way as best you can. My service is saying how delicious the gravy is, how great the turkey is, how wonderful the cranberry sauce is. That’s how I give back, with compliments.”\n\nCritics were less than complementary about his comments, though","url":"https://www.huffpost.com/entry/stephen-miller-thanksgiving_n_6926b8f9e4b043c0cb075487?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6926bde6220000ba3460bcd1.jpeg?cache=L1W08oMo7F&ops=1778_1000","video":null,"publish_date":"2025-11-26 09:36:32","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"au","sentiment":0.131},{"id":382363256,"title":"Howie Carr: Thankful for an end to Dem kleptocracy","text":"So much to be thankful for this year, starting with the most obvious one:\n\nI am very grateful that Donald J. Trump is once again the president of the United States.\n\nAnd I am equally thankful that Kamala Harris isn’t.\n\nFrom Joe Biden to Donald Trump in one year – what’s not to say hallelujah for, unless maybe you’re an illegal alien on welfare.\n\nCan you imagine what a basket case this country would be right now if the Democrats had been able to rig themselves another four years for the “fundamental transformation” of America — into even more of a Third World hellhole than they’d already made it in 2021-25.\n\nI have gratitude for gasoline that again costs less than $3 a gallon – still not as affordable as it was before Biden was installed as president.\n\nBut as we all saw firsthand during the Biden catastrophe, it’s a lot easier to destroy an economy than it is to repair one.\n\nEspecially when it comes to inflation. But as we try to wring out the rampant inflation created by the calamitous Biden regime, let us give thanks we are not mired in an even worse place – back in the Democrats’ kleptocracy.\n\nSo thankful that J.D. Vance is now the vice president instead of Kamala.\n\nAnd that Scott Bessent is the Treasury Secretary instead of Janet Yellen.\n\nThat KJP is gone as White House press secretary and is now replaced by Karoline Leavitt.\n\nThat Sean Duffy is the Transportation Secretary instead of Pete Buttigieg.\n\nThat Pete Hegseth is at the Pentagon instead of tubby Lloyd Austin.\n\nNo more cocaine in the White House.\n\nThat we have a president who at least tries to stop wars, rather than babbling to a thug like Putin in January 2022 that a “minor incursion” into Ukraine would be all right.\n\nI am so thankful that the southern border is finally shut down for foreign invasions.\n\nIt’s so secure that you practically never even hear about the border anymore – no news is good news.\n\nAnd thanks be to God that at least a couple million of the Democrats’ cholos and gang bangers who flopped into the country on 100% welfare under Joe Biden have now been deported or fled back to the bleepholes they slithered out of.\n\nI’d be even more thankful if another 10 or 20 million of these entitled freeloaders were ejected, ASAP, or should I say pronto.\n\nI’m grateful that the FBI and the Department of Justice are no longer weaponized against American parents attending school board meetings to protest “transgender” males assaulting their daughters in middle-school bathrooms.\n\nThanks too that FBI no longer considers it a primary mission to stalk Catholics who attend Latin Masses.\n\nThankful that the feds are no longer secretly grabbing the telephone records of GOP senators and Congressmen and anybody else who opposes the DC Deep State, and that those Democrat secret police who connived for four years to suppress free speech are now being hounded the way they harassed us.\n\nPersonally, I am thankful that this year, while exercising my First Amendment rights, I have not been banned from YouTube, censored by Twitter/X, demonetized by Google or served with a subpoena in a lawfare case designed to strip me of my God-given rights by making it prohibitively expensive to continue to exercise them.\n\nGood-bye, climate change. It was about time, right? It was all BS – that’s the real inconvenient truth.\n\nEven though I’m not totally satisfied with their performance, I’m thankful that the FBI got an ethical upgrade in Kash Patel and Dan Bongino from the appallingly corrupt Christopher Wray.\n\nI’m thankful that the pampered pukes of the Poison Ivy League are sweating at least a little bit, worrying about having to curb their blatantly DEI racist admissions and hiring practices.\n\nGrateful as well that maybe a day is coming when all these corrupt schools will finally be paying some real taxes, like all the rest of us that they despise so much because we weren’t born with silver spoons in our mouths.\n\nAnthony Fauci no longer terrorizes a free people – thanks be to God.\n\nYou can no longer be fired (in most places anyway) for refusing to take a COVID shot.\n\nI am thankful that NPR and all the rest of the Democrats’ agitprop networks may have to actually pay their own way, because they won’t be able to, not even close.\n\nI’m thankful for all the federal Green New Deal scams being defunded, and I just wish the same reforms could be instituted in Massachusetts as well.\n\nPraise be to God that the grifters of the Biden Crime Family are finally out of business.\n\nLet us give thanks that so many fake news fraudsters have been “retired” or become podcasters, i.e., unemployed.\n\nJoy Reid, Chuck Todd, Terry Moran, John Dickerson, Andrea Mitchell, Chris Wallace, Jorge Ramos, Mehdi Hasan, Norah O’Donnell, Alisyn Camerota….\n\nHow many times did we ask a Higher Power: How can we miss them when they won’t go away?\n\nAnd now they’re finally gone.\n\nSo very much to be thankful for now at the end of 2025.\n\nHappy Thanksgiving everyone.\n\n(Order Howie’s new book, “Mass Corruption: Vol. 1, The Cops,” at amazon or howiecarrshow.com/store.)","summary":"So much to be thankful for this year, starting with the most obvious one:","url":"https://www.bostonherald.com/2025/11/26/howie-carr-thankful-for-an-end-to-dem-kleptocracy/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/AP25329578152606_de7f3e.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-26 08:23:26","author":"Howie Carr","authors":["Howie Carr"],"language":"en","source_country":"us","sentiment":-0.119},{"id":382365742,"title":"Trump Revokes Myanmar Nationals’ Protection, Nearly 4,000 Immigrants To Be Impacted—What Is TPS?","text":"The United States has revoked the temporary protection for Myanmar nationals with the Trump administration on Monday announcing plans to end the Temporary Protected Status (TPS). It said immigrants could “safely” return to their homeland, the war-torn Southeast Asian nation.US officials cited the Myanmar military junta’s planned elections as a sign of improvement and concluded that the Temporary Protected Status (TPS) designation for Myanmar was no longer needed.“...Burma has made notable progress in governance and stability, including the end of its state of emergency, plans for free and fair elections, successful ceasefire agreements, and improved local governance contributing to enhanced public service delivery and national reconciliation,” the US Citizenship and Immigration Services (USCIS) said on its website.The TPS termination will come into effect from Jan. 26, 2026. The special TPS status to Myanmar was set to expire on Nov. 25. According to a Reuters report, the US government’s decision will impact about 4,000 Myanmar nationals. Earlier, the US government had issued similar directives for South Sudan and Venezuela.“Department of Homeland Security (DHS) estimates that there are 3,969 current approved beneficiaries under the designation of Burma for Temporary Protected Status. As of November 10, 2025, there are 236 total pending applications for the designation of Burma for Temporary Protected Status,” the USCIS notification said..F-1 Visa News: US May Scrap ‘Intent To Leave’ Rule — Here’s How It Could Impact Indian Students Seeking Visas.The US Secretary of Homeland Security designates a foreign country for TPS due to conditions under which its nationals are unable to return home safely. “The US may grant TPS to eligible nationals of certain countries (or parts of countries), who are already in the United States. Eligible individuals without nationality who last resided in the designated country may also be granted TPS,” the department explained on its website.TPS can be designated due to an ongoing armed conflict, such as a civil war. It may also be granted after environmental disasters like earthquakes or hurricanes.Under this system, individuals who are designated as TPS beneficiaries receive several protections. They cannot be removed from the United States and can also work legally in the country. Once granted TPS, the Department of Homeland Security (DHS) cannot detain them based on immigration status. However, TPS is a temporary benefit and does not provide a path to lawful permanent residency. .Kamala Harris Hints At Another US Presidential Run: 'I'm Not Done, It's In My Bones'.In contrast to the US government’s fresh claims, the State Department continues to warn US citizens against travelling to Myanmar. It has noted “civil unrest, armed conflict, and arbitrary enforcement of local laws” as the reasons for its warning.Moreover, the department’s latest human rights report, released in August, highlighted serious abuses in Myanmar, including arbitrary killings, disappearances, torture, persecution of journalists and restrictions on religious freedom, among other violations.","summary":"The US officials cited the Myanmar military junta’s planned elections as a sign of improvement and concluded that the Temporary Protected Status (TPS) designation for Myanmar was no longer needed.","url":"https://www.ndtvprofit.com/world/trump-revokes-myanmar-nationals-protection-nearly-4000-immigrants-to-be-impactedwhat-is-tps","image":"https://media.assettype.com/bloombergquint/2025-11-26/japk5ze4/pexels-maciej-prus-119109857-9841306.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-11-26 08:15:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.05},{"id":382336548,"title":"The Morning Briefing: Bill Maher Needs to Swallow the Red Pill, Already","text":"Top O' the Briefing\n\nHappy Wednesday, dear Kruiser Morning Briefing friends. Kellwyyndoor was quite surprised to find that the Tri-City Fred Grandy Appreciation Society was in need of a freelance confectioner. \n\nBill Maher has been giving conservative media a lot to talk and write about since President Trump returned to office for his second term. He has moments of clarity that provide some fantastic fodder for people who are worn out by leftist lunacy in the media. It's nothing entirely new for Maher. He's been running afoul of the Democrats' false narrative doctrine on Islam and terrorism for a long time. \n\nThis year, Maher has been getting a few other things right. His latest flirtation with sanity came when he was hosting Lara Trump on his Club Random podcast, which Michael wrote about:\n\nThe most notable segment of the podcast came when Maher took an opportunity to put liberals on blast for helping that interference, saying, “I don’t give any quarter to the leftists who just constantly downgrade America.” Neither do I, Bill. Neither do I.“It’s another reason why they hate me. I mean, this is what I said to him – your father-in-law in the text. It’s like, you know, if I’m so captured by the lunatic left, why do they hate me, too?” Maher said. He then noted that his take on many issues has created a fanbase for his program that sits “in the middle” and has “had enough of people in their bubble,” which he says includes those in “old” news media.“You know, I find it very frustrating that I cannot get the full story anywhere in the old media. It’s very – I mean, I love the new Free Press,” Maher explained. “My girl Bari Weiss who started that and now she runs CBS. You know, you’re seeing a change there that’s more fair.”\n\nMaher has always given a platform to Republicans and conservatives, going all the way back to his days hosting Politically Incorrect on Comedy Central, then ABC. A lot of people may not remember that Maher and Politically Incorrect made Ann Coulter famous. Another little known fact is that, for a lot of the years that he's had a television show, he's had at least one right-leaning writer on staff. \n\nThere's a lot to suggest that Maher is sincere when he says something that syncs up with conservative views. There is also, however, one glaring fact that makes one wonder if it's all a ratings act: he keeps voting for Democrats. He likes to pepper his sane epiphanies with reminders to the Democrats that he voted for Kamala Harris. \n\nMoments of clarity don't mean much if they don't clear your head enough to keep you from voting for the drunk commie lady. \n\nIt's very possible that Maher is simply more savvy than Stephen Colbert or Jimmy Kimmel and realizes that there is no point in consistently alienating a good chunk of his potential audience. There's ratings value in throwing the occasional bit of red meat to conservatives. He doesn't have to mean it, he just needs to seem like he means it. \n\nAnother possibility is that the conservative guests that Maher has had on his shows over the years have rubbed off on him a little bit. Obviously not enough, though. When Maher does spout the leftist line, it's often the worst of it, like a firm defense of COVID policies and the narratives surrounding them.\n\nAs long as Maher keeps touting his Democratic bona fides and reminding viewers that he votes for people who are actively bent on destroying this country, his bonding moments with conservatives are highly suspect. The guy is almost 70, if he doesn't know better by now, the odds on him ever completely getting it aren't great. \n\nWho knows, though? The Democrats are so bat-guano out there now that they might be able to alienate someone who has been with them for as many years as Maher has. \n\nMaybe President Trump can push him off that fence. He's done it for plenty of others. \n\nContributions to the Mailbag of Magnificence can be sent to [email protected]\n\nClick the button below to get the Morning Briefing emailed to you every weekday. Have your coffee with me, people. It's free and it supports conservative media! \n\nEverything Isn't Awful\n\nOtters living the best life.. 😊 pic.twitter.com/bO697haISk— Buitengebieden (@buitengebieden) November 24, 2025\n\nVodkaPundit. Newsom's War on Suburbia Enters the Tactical-Nuke Phase\n\nVodkaPundit, Part Deux. Crazy Tennessee Dem Has Meltdown, Runs for Congress, Won't Win, Will Blame Patriarchy\n\nShe nasty. Republicans Couldn't be Less Scared of Potential Senate Bid From Radical Dem Jasmine Crockett\n\nThe point is to lie. There Haven't Been Any Illegal Orders. So, What's the Point?\n\nTownhall Mothership\n\n+1. Trump: Indiana Republicans to Take Up Redistricting in the Coming Weeks\n\nOoh, pick me! Should We 'Protect First Amendment Like We Do the Second'?\n\nI'm 6'4\" and 220 lbs. How Much of What You Read Is Fake?\n\nMe. Strengthen Your Stream: 'Blue Lights' Is Back and Claire Danes Is Looking a Little Frantic\n\nAround the Interwebz\n\nThe Kruiser Kabana\n\nKabana Gallery\n\nFamily in the Orchard #artbots #vanrysselberghe pic.twitter.com/vXIr4OKv8Y— Théo Rysselberghe (@artrysselberghe) November 25, 2025\n\nKabana Comedy/Tunes\n\nPOTUS Press Today\n\nBecome part of the PJ Media VIP party by subscribing here. Use promo code KRUISERMB to receive a WHOPPING 60% discount. Trust me, we’re having fun over here.","url":"https://pjmedia.com/stephen-kruiser/2025/11/26/the-morning-briefing-bill-maher-needs-to-swallow-the-red-pill-already-n4946393","image":"https://media.townhall.com/cdn/hodl/2017/168/d4e9b988-fe49-4325-b52d-a90f90674262.jpg","video":null,"publish_date":"2025-11-26 07:06:00","author":"Stephen Kruiser","authors":["Stephen Kruiser"],"language":"en","source_country":"us","sentiment":0.236},{"id":382465746,"title":"Column: PBS Seems Neutral on Burning America to the Ground","text":"Since October 1, PBS isn’t taxpayer-funded, but the radical leftist spirit of PBS remains unchanged. When it comes to transgenderism, for example, the discussion cannot have two sides. In a 2023 study of seven months of the PBS News Hour, the libertine left drew 90 percent of the air time.\n\nIt was even worse for in-studio guests. It was 19 to one -- and the one unsolicited utterance that opposed the left-wing position came from gay tennis star Billie Jean King, who dared to suggest that men shouldn't compete in women's sports once it came to advanced competitions like the Olympics.\n\n On November 24, the News Hour guest was Alejandra Caraballo, a trans woman who works at Harvard’s Cyberlaw Clinic. Caraballo exemplifies the acidulous leftist vitriol on Bluesky, the leftist alternative to Twitter. Caraballo posted this on June 18, after the Supreme Court upheld Tennessee’s ban on gender-denying mutilations for children:\n\n“I honestly don’t care anymore if this country destroys itself and burns down to the ground. The current form of the United States is incompatible with democracy or human rights. It no longer has any legitimacy to govern and I’ll dance on its grave. Let something better rise from the ashes.”\n\nThis is the guest PBS picked -- the ones currently pretending to love America with Ken Burns bringing the DEI spirit to The American Revolution. Interviewer William Brangham waited until the last question to posit: “You have faced your own share of criticism for some of the things you have written on social media. Where do you see the boundaries in terms of how to have this debate, especially as it pertains to people who are near and dear to you?”\n\nThere were no quotes on screen of her many wild swings on Bluesky, like this new one on the Elissa Slotkin “illegal orders” video: “Hot take but the president openly calling for the murder of his political opposition should be grounds for immediate impeachment and removal for office [sic].”\n\nCaraballo claimed this is systemic: “I think about this a lot in terms of the incentives of social media and how it can incentivize a certain style of engagement. But I think, in general, one of the things I have always tried to say and repeat, the quote is, 'be brutal to systems, kind to people.'\" But when it comes to opponents in the trans debate, from Riley Gaines to Bari Weiss, there’s no kindness from Caraballo.\n\n Before that, Brangham’s most challenging question was this: “Back during the election, political analysts point to that notorious [notorious!?] set of ads that the president ran against Kamala Harris, she's for they/them, he's for you, as both being divisive and effective as an ad campaign. And, as you know, there are polls that show that somewhere around half of Americans approve of what the president is doing vis-a-vis trans people. How do you explain that? How does that sit with you?”\n\nCaraballo found that “incredibly troubling,” and underlined that Republicans running in off-year races pushed the trans/sports issues and lost, like in Virginia, where Winsome Earle-Sears spent a lot of money on “some extremely heinous anti-trans ads.” Heinous!?\n\nWhat Caraballo demonstrates is that radical trans activists don’t believe in democracy. They want an autocracy where no one can oppose their dictates. It’s not my way or the highway – it’s my way or “burn America down to the ground.” This is the kind of wacko that PBS is platforming. They also don’t believe in democracy, or they would allow someone on their show to oppose this hate-engulfed male.","summary":"Since October 1, PBS isn’t taxpayer-funded, but the radical leftist spirit of PBS remains unchanged. When it comes to transgenderism, for example, the discussion cannot have two sides. In a 2023 study of seven months of the PBS News Hour, the libertine left drew 90 percent of the air time.\n\nIt was even worse for in-studio guests. It was 19 to one -- and the one unsolicited utterance that opposed the left-wing position came from gay tennis star Billie Jean King, who dared to suggest that men shouldn't compete in women's sports once it came to advanced competitions like the Olympics.\n\n On November 24, the News Hour guest was Alejandra Caraballo, a trans woman who works at Harvard’s Cyberlaw Clinic. Caraballo exemplifies the acidulous leftist vitriol on Bluesky, the leftist alternative to Twitter. Caraballo posted this on June 18, after the Supreme Court upheld Tennessee’s ban on gender-denying mutilations for children:\n\n“I honestly don’t care anymore if this country destroys itself and burns down to the ground.","url":"https://www.newsbusters.org/blogs/nb/tim-graham/2025/11/26/column-pbs-seems-neutral-burning-america-ground","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-11/PBS%20News%20Hour-7_36_57%20pm-2025-11-24-0.jpg?itok=eu3H-JV_","video":null,"publish_date":"2025-11-26 05:21:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","source_country":"US","sentiment":-0.048},{"id":382299458,"title":"Norris R. McDonald | Zohran Mamdani and Gen-Z’s rebellion against US power brokers!","text":"ZOHRAN MAMDANI, a self-declared democratic socialist, has achieved what many thought was impossible: he defeated the Democratic party’s old guards, including Andrew Cuomo, to become New York’s mayor.\n\nMamdani’s victory is a political earthquake. It has shocked the city, and America’s political establishment. It has sent a strong message not just to the ‘do-little’ Democratic party, but also to the non-tax paying billionaires who campaigned against him.\n\n A PROGRESSIVE GEN-Z REBELLION \n\nMamdani’s victory represents a rejection of the policies of both major political parties that have long favoured corporate interests over the welfare of ordinary people. \n\nHis campaign was powered by grassroots organising and not corporate donations. It made history by uniting a diverse coalition of voters: young people, immigrants, and working-class families.\n\nAt just 34 years old, Mamdani’s rise to power marks a decisive shift in the political tides. As a Muslim with Ugandan and Indian heritage, he is a young outspoken progressive who disagrees with the status quo on both domestic and foreign policy issues. \n\nThe self-styled Democratic socialist’s platform included progressive stances on healthcare, climate change, social justice, and workers’ rights. These issues resonate deeply with America’s corrupt politics in which big campaign donors shape domestic and foreign policy.\n\nPoor people and the middle class are just pushed aside because their leaders appear to have been bought by the millionaire and billionaire class.\n\n THE REJECTION OF ZIONISM AND US IMPERIALISM \n\nMamdani’s historic victory carries significant political symbolism. Throughout the campaign, he strongly criticised US foreign policy, particularly regarding Israel’s genocidal actions in Gaza. \n\nThis dynamic upcoming politician did not shy away from calling Israel’s treatment of Palestinians “genocide”. This principled political position set him apart from many mainstream politicians, including those within his own Democratic party.\n\nIn a recent White House meeting with President Donald Trump, Mamdani condemned Israel actions in the Palestinian territories.\n\nThis bold position was praised by many New Yorkers who felt that America had failed to take a strong, moral stand against Israel’s excessive actions against the civilian population in Gaza.\n\nMamdani’s clearly stood out, and ultimately prevailed, because he refused to cower to the divisive, blackmailing political power of groups like AIPAC (American Israel Public Affairs Committee). Despite efforts by AIPAC and the political elites to paint him as antisemitic, Mamdani gained support from 43 per cent of New York’s Jewish voters.\n\n ANTI-ZIONIST SPLIT IN MAGA MOVEMENT \n\nMy friends, this broad coalition demonstrated that, contrary to the narrative pushed by his detractors, a political stance rooted in human rights is not inherently antisemitic.\n\nMamdani’s success in defying the influence of pro-Zionist groups is a clear indication that the political landscape in America is shifting. This means that traditional alliances between US politicians and Zionist lobbies are no longer as secure as they once were.\n\nThis is extremely significant since the MAGA movement is now in a deep schism with loud leadership voices such as Tucker Carlson, Candace Owens, Marjorie Taylor Green and others now condemning the irrational fealty to Zionism. \n\nThese loud MAGA voices are now condemning Israel’s genocide in Gaza. And yet, Democratic leaders, such as Hakeem Jefferies and Senator Chuck Schumer, still refuses to criticise Israel’s intolerable behaviour. They also refused to endorse Zohran Mamdani. \n\n A TURNING POINT FOR THE DEMOCRATIC PARTY \n\nDespite this, Mamdani capture voters’ imagination by his honesty and progressive vision. This is true courage for what some called a political neophyte. \n\nMamdani’s victory signals a fundamental shift in how Americans view politics. No longer is it enough to simply offer token reforms or incremental changes. It is also a sharp rebuke to the Democratic party establishment who never endorsed him.\n\nFigures like Kamala Harris, who failed to take a strong stance on Gaza and refused to challenge Israel’s actions, represent the party’s deep-rooted ties to corporate and Zionist interests. \n\nKamala Harris paid the price for this, in my opinion, with 15 million Gen-Z voters refusing to support her candidacy. \n\nPolls showed that Mamdani’s candidacy attracted a significant number of voters who were previously disillusioned with both major parties. According to CBS News, Mamdani pulled 60,000 voters who supported Donald Trump in the 2020 election and another 70,000 who had sat out the 2024 election altogether. \n\nThis highlights Mamdani’s unique ability to widen the political base and attract voters across party lines, particularly those who feel ignored or betrayed by the political elites.\n\n GEN-Z AND THE FUTURE OF PROGRESSIVE POLITICS \n\nMy dear friends, Mamdani’s rise signals a growing fracture within the American political establishment. Younger voters, especially from marginalised communities, are beginning to demand more from their leaders — particularly on issues of human justice and foreign policy.\n\nThe core of Mamdani’s support comes from younger generations, particularly Gen-Z, who are deeply disillusioned with the traditional Democratic and Republican parties. \n\nIn the 2024 New York mayoral race, a staggering 75 per cent of voters under the age of 35 voted for Mamdani, demonstrating how his message resonated with the city’s youth.\n\n A VICTORY CHANGE, SOCIAL AND ECONOMIC JUSTICE \n\nMamdani’s message of economic justice, affordable housing, free public transportation, and climate action captured the imagination of a generation that feels increasingly abandoned by both corporate-controlled parties. \n\nThis is a generation that refuses to accept the status quo — where wealth is hoarded by the elite and working people and the middle class are left to struggle to survive.\n\nBy presenting a bold alternative to the establishment, Mamdani is effectively pushing the Democratic party to the left. He is building on Bernie Sander’s platform of radical economic reform which is not only economically desirable but also politically viable.\n\nMamdani’s win offers a glimpse of what is possible when the working class, young people, and marginalised communities rise: to fight for and, demand social change.\n\nThe question now is: Can this political revolution spread beyond New York City and reshape the future of American politics? \n\nThe answer to that question, my friends, may very well define the next chapter in the struggle for justice, equality, and peace in the United States.\n\nThat’s just the bitta truth.\n\n Norris R. McDonald is an author, economic journalist, political analyst, and respiratory therapist. Feedback: columns@gleanerjm.com | miaminorris@yahoo.com","url":"https://jamaica-gleaner.com/article/commentary/20251126/norris-r-mcdonald-zohran-mamdani-and-gen-zs-rebellion-against-us-power","image":"https://jamaica-gleaner.com/sites/default/files/styles/250px/public/media/article_images/2025/11/26/3289889/8405231.jpg?itok=aS5-aUXA","video":null,"publish_date":"2025-11-26 05:06:45","author":"Evan Vucci","authors":["Evan Vucci"],"language":"en","category":"politics","source_country":"jm","sentiment":0.054},{"id":382279606,"title":"PBS Seems Neutral on Burning America to the Ground","text":"Since Oct. 1, PBS isn't taxpayer-funded, but the radical leftist spirit of PBS remains unchanged. When it comes to transgenderism, for example, the discussion cannot have two sides. In a 2023 study of seven months of the \"PBS News Hour,\" the libertine left drew 90% of the airtime.\n\nIt was even worse for in-studio guests. It was 19 to one -- and the one unsolicited utterance that opposed the left-wing position came from gay tennis star Billie Jean King, who dared to suggest that men shouldn't compete in women's sports once it came to advanced competitions like the Olympics.\n\nOn Nov. 24, the \"News Hour\" guest was Alejandra Caraballo, a trans woman who works at Harvard's Cyberlaw Clinic. Caraballo exemplifies the acidulous leftist vitriol on Bluesky, the leftist alternative to Twitter. Caraballo posted this on June 18, after the Supreme Court upheld Tennessee's ban on gender-denying mutilations for children:\n\n\"I honestly don't care anymore if this country destroys itself and burns down to the ground. The current form of the United States is incompatible with democracy or human rights. It no longer has any legitimacy to govern and I'll dance on its grave. Let something better rise from the ashes.\"\n\nThis is the guest PBS picked -- the ones currently pretending to love America with Ken Burns bringing the DEI spirit to \"The American Revolution.\" Interviewer William Brangham waited until the last question to posit: \"You have faced your own share of criticism for some of the things you have written on social media. Where do you see the boundaries in terms of how to have this debate, especially as it pertains to people who are near and dear to you?\"\n\nThere were no quotes on screen of her many wild swings on Bluesky, like this new one on the Elissa Slotkin \"illegal orders\" video: \"Hot take but the president openly calling for the murder of his political opposition should be grounds for immediate impeachment and removal for office (sic).\"\n\nCaraballo claimed this is systemic: \"I think about this a lot in terms of the incentives of social media and how it can incentivize a certain style of engagement. But I think, in general, one of the things I have always tried to say and repeat, the quote is, 'be brutal to systems, kind to people.'\"\n\nBut when it comes to opponents in the trans debate, from Riley Gaines to Bari Weiss, there's no kindness from Caraballo.\n\nBefore that, Brangham's most challenging question was this: \"Back during the election, political analysts point to that notorious (notorious?!) set of ads that the president ran against Kamala Harris, she's for they/them, he's for you, as both being divisive and effective as an ad campaign. And, as you know, there are polls that show that somewhere around half of Americans approve of what the president is doing vis-a-vis trans people. How do you explain that? How does that sit with you?\"\n\nCaraballo found that \"incredibly troubling,\" and underlined that Republicans running in off-year races pushed the trans/sports issues and lost, like in Virginia, where Winsome Earle-Sears spent a lot of money on \"some extremely heinous anti-trans ads.\" Heinous?!\n\nWhat Caraballo demonstrates is that radical trans activists don't believe in democracy. They want an autocracy where no one can oppose their dictates. It's not my way or the highway -- it's my way or \"burn America down to the ground.\" This is the kind of wacko that PBS is platforming. They also don't believe in democracy, or they would allow someone on their show to oppose this hate-engulfed male.\n\nTim Graham is director of media analysis at the Media Research Center and executive editor of the blog NewsBusters.org. To find out more about Tim Graham and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.\n\nEditor's Note: The mainstream media continues to deflect, gaslight, spin, and lie about President Trump, his administration, and conservatives.\n\nHelp us continue to expose their left-wing bias by reading news you can trust. Join Townhall VIP and use promo code FIGHT to get 60% off your membership.","url":"https://townhall.com/columnists/timgraham/2025/11/26/pbs-seems-neutral-on-burning-america-to-the-ground-n2667020","image":"https://media.townhall.com/cdn/hodl/2017/133/5dc26302-5976-435f-9988-4b5915d4975b.jpg","video":null,"publish_date":"2025-11-26 05:01:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","source_country":"us","sentiment":-0.073},{"id":382258286,"title":"Michael Goodwin: Trump needs to hit the reset button if the GOP wants to win the 2026 midterms","text":"As far as President Trump is concerned, T.S. Eliot got it all wrong. \n\nApril is not the cruelest month, November is. \n\nAs he barrels toward the end of his first year back in the White House, the president is beset by slumping poll numbers and a pileup of problems, some of which are self-inflicted. \n\nEven a gaggle of normally obedient Republicans in Congress are growing restless, and his call for gerrymandering House district lines in red states to pad the GOP advantage in the midterms is in danger of producing the opposite outcome. \n\nThe sheer volume of mounting trouble reflects Trump’s supreme self-confidence, grand vision and his “let’s do it now” management style. \n\nOn any given day, the combination results in too many balls in the air competing for his attention. \n\nTighten the focus \n\nThe big picture suggests he needs a reset, and maybe a rest. \n\nIn any event, it’s time to tighten the focus and follow a more methodical approach so the most important things get sufficient presidential attention. \n\nIt’s hard not to conclude that Trump’s scattered focus is the root cause of what ought to be triggering White House alarms: The president is underwater with voters on every major poll taken this month. \n\nAccording to Real Clear Politics, his average approval is a mere 43%, while his average disapproval is 54.8%, a spread of minus 11.8 points. \n\nMost troubling, the numbers are far worse on his handling of the economy, which was the issue at the heart of his resounding 2024 victory over Vice President Kamala Harris in all the swing states. \n\nYet now Trump’s average approval on the economy is a mere 39.5%, against an average disapproval of 57.8%, creating a huge spread of minus 18.3. \n\nHis recent talk of handing out tariff rebate checks of $2,000 smacks of desperation and echoes the deservedly maligned “Obama Phone.” \n\nThree situations that erupted into public view in recent days illustrate the scope of Trump’s morass. \n\nAlthough he touted a proposal his aides crafted to settle the Ukraine-Russia war as a sign that “something good may just be happening,” leaders in Europe and elsewhere blasted it as a shocking capitulation to Russian demands. \n\nThat was soon followed by another bombshell that revealed the helter-skelter nature of the process, namely that Secretary of State Marco Rubio was caught off guard by the proposed terms. \n\nRubio later pressed for pro-Ukraine’s changes even as he dutifully defended the initial effort as a “living, breathing document.” \n\nDeadly opposition \n\nReports Tuesday that changes were made that are acceptable to Ukraine were encouraging, but then came news that Russia had fired a barrage of missiles and drones on the Ukrainian capital of Kyiv, killing at least seven people and wounding a score of others. \n\nRussian officials marked the attack by saying they oppose the changes to the proposed deal made at the request of Ukraine, which would seem to send the plan back to square one. \n\nAt such moments, it’s worth remembering that Trump, while seeking his second term, said repeatedly that if elected again he would solve the war within 24 hours. \n\nThat’s not to deny that he has had great success as a peacemaker in other conflicts, including between Israel and Hamas, but this one has eluded his efforts because Russian leader Vladimir Putin has betrayed their supposedly good relationship at every turn. \n\nYet Trump returned to an old argument Sunday by posting on Truth Social that Ukraine’s leaders were guilty of “zero gratitude.” \n\nThe line recalled the Oval Office showdown last February, when Trump ejected Ukrainian President Volodymyr Zelensky from the White House, though their relationship was repaired, or at least it seemed to be. \n\nBut by demanding gratitude when Russia is attacking civilian targets in the Ukrainian capital in the midst of negotiations, Trump appears unduly spiteful. \n\nTrump haters were especially gleeful over two other black eyes he suffered. \n\nA federal judge’s decision to toss the indictments of former FBI Director James Comey and New York Attorney General Letitia James unleashed loud cheering in the media peanut -gallery. \n\nAs The New York Times put it, the ruling by Judge Cameron McGowan Currie in Virginia marked “the most significant setback yet to the president’s efforts to force the criminal justice system to punish his perceived foes. The dismissals also served as a rebuke to Attorney General Pam Bondi, who had rushed to carry out Mr. Trump’s orders.” \n\nYes, but the ruling had nothing to do with the merits of the charges, which the government promises to file again. \n\nThe ruling dealt primarily with the role of Lindsey Halligan, a former Trump lawyer whom he wanted Bondi to appoint as an interim US attorney for the Eastern District of Virginia. \n\nThe problem is that Trump had fired the first interim prosecutor, Erik Siebert, who reportedly said the cases against Comey and James lacked sufficient evidence. \n\nStill, Halligan, working largely alone and over the objections of other prosecutors in the office, won grand jury indictments against both, but the judge declared her appointment improper. \n\nThe problem is that Siebert was also an interim appointment, and the law forbids Bondi from appointing two different people in the same 120-day window, the judge ruled. \n\nThis is not Bondi’s first screwup, and she should have known about the timing limitation. \n\nStill, the judge dismissed the indictments “without prejudice,” meaning the government can -refile the accusations against both Comey and James. \n\nThe idea that Trump is hell-bent on punishing his political enemies is a handy one for the left, but it never concedes that Comey, James and others first investigated Trump largely because he was a Republican. \n\nThey targeted him for purely political reasons, yet that’s only a problem when he goes after those who abused their offices and arguably committed other crimes. \n\nJames stands accused of mortgage fraud and Comey allegedly lied to Congress in 2020. \n\nConfidential info \n\nThe charge centered on media leaks of confidential information about the Russia, Russia, Russia hoax — with most of those leaks going to the Times. \n\nSo the paper has dirty hands, and its cheering for Comey when it knows firsthand that he was guilty of leaking shows the depths of the Gray Lady’s deceit. \n\nThe paper hates Trump more than it loves the truth. \n\nIn that sense, I don’t blame Trump for filing lawsuits against such biased outlets. \n\nNor do I find it shocking that he would hit back at Comey and James, who shattered every norm in American history when they weaponized the legal system to go after him. \n\nStill, the stakes and the law demand that he and Bondi get their ducks in order before they go down that slippery road.","summary":"As far as President Trump is concerned, T.S. Eliot got it all wrong.","url":"https://nypost.com/2025/11/25/opinion/trump-needs-to-hit-the-reset-button-if-the-gop-wants-to-win-the-2026-midterms/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/OEOEEP.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-11-26 03:18:46","author":"Michael Goodwin","authors":["Michael Goodwin"],"language":"en","source_country":"us","sentiment":-0.082},{"id":382250948,"title":"“Rush Hour 4” in the Works After President Trump Intervened to Revive Franchise (Report)","text":"Rush Hour 4 is in the works, reportedly after President Donald Trump lobbied Paramount Skydance shareholder Larry Ellison on behalf of director Brett Ratner.\n\n Multiple outlets report that Paramount is reviving the Jackie Chan and Chris Tucker action-comedy franchise with Ratner, director of the original 1998 film, returning to helm it. \n\n The move comes “after prodding from Trump on behalf of” Ratner, Puck’s Matthew Belloni wrote on X.\n\n Per The Guardian, Trump, 79, lobbied for a Rush Hour 4 with Ellison, a billionaire and the father of Paramount Skydance CEO David Ellison. David's father, Larry, is the company's largest shareholder.\n\n PEOPLE has reached out to the White House for comment. \n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. \n\n After years of rumors about a fourth Rush Hour installment, Chan, 71, confirmed in 2022 that they were “talking about” ideas. He indicated at the time that he was in touch with an unnamed director. \n\n Ratner, 56, was accused by multiple women — including actresses Olivia Munn and Natasha Henstridge — of sexual misconduct or harassment in 2017 amid Hollywood’s #MeToo movement. After the explosive Los Angeles Times article detailing claims against him, Ratner denied all wrongdoing, filing and later dropping a defamation lawsuit against Melanie Kohler, who accused him of rape.\n\n The filmmaker, who directed 1998’s Rush Hour and its 2001 and 2007 sequels, also has ties to the president. In October it was announced that Ratner has in development a documentary at Amazon MGM Studios about First Lady Melania Trump. \n\n Ellison, 81, recently had talks with White House officials about Paramount Skydance making a deal to purchase Warner Bros. Discovery, according to a Nov. 20 report by The Guardian. Several insiders claimed that Ellison spoke with someone about potentially restructuring CNN, a network currently owned by Warner Bros. Discovery. Those conversations allegedly involved firing reporters such as Erin Burnett and Brianna Keilar, who are not favored by Trump.\n\n This is not the first time Trump has been involved in media leaders’ decisions. Earlier this year, Paramount Global made headlines for settling a lawsuit with Trump over a CBS News interview featuring him. The president had sued CBS News, accusing them of deceptively editing former Vice President Kamala Harris' 2024 campaign trail appearance on 60 Minutes, per reporting by Reuters. Paramount agreed to pay $16 million to Trump's future presidential library.\n\n In his 1987 book Trump: The Art of the Deal, the president wrote that after his 1964 graduation, he “briefly flirted with the idea of attending film school… I was attracted to the glamour of the movies, and I admired guys like Sam Goldwyn, Daryl Zanuck, and most of all Louis B. Mayer, whom I considered great showmen. But in the end I decided real estate was a much better business.\"\n\n Casting for Rush Hour 4 has not yet been finalized. After appearing in this year's The Shadow's Edge and Karate Kid: Legends, Chan next leads the movies Panda Plan 2 and Guo Jia Jia from his native China. Tucker, 54, last appeared on screen in 2023’s Air.","summary":"After years of rumors about a fourth installment in the action-comedy franchise, Brett Ratner is allegedly returning to direct","url":"https://people.com/rush-hour-4-in-the-works-president-trump-intervened-report-11857236","image":"https://people.com/thmb/30agHTMuH7NX2CDB_c_NnaDGmbU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/donald-trump-Rush-Hour-112525-42419409f65e4d7cab7633dcb6a2ed4c.jpg","video":null,"publish_date":"2025-11-26 00:31:43","author":"Jack Smart","authors":["Jack Smart"],"language":"en","category":"politics","source_country":"US","sentiment":-0.007},{"id":382227290,"title":"Melanie Lawson retiring after 43 years at ABC13","text":"HOUSTON (KTRK) -- Beloved ABC13 anchor Melanie Lawson will be retiring in January, after an extraordinary 43-year journey with ABC13.\n\nMelanie's career has been nothing short of inspiring. As the anchor of Live at 5 and Eyewitness News at 11 a.m., Melanie has been a trusted voice in our community and a guiding presence in our newsroom. Her passion for journalism, rooted in her Houston upbringing, has shaped the way we tell stories and connect with our audience.\n\nShe has covered virtually every city, state, and national election, and reported on pivotal moments in our history-from Houston's first Black and female mayors to natural disasters like Hurricane Harvey and the deadly Texas ice storm. She has brought global stories home, traveling to Cuba, Panama, Australia, Sudan, and South Africa, and has chronicled the rise of superstar performers like Beyoncé and Destiny's Child.\n\nMelanie's journalistic chops and thoughtful approach to her subject matter have landed her some of the most notable interviews in KTRK history, including with four U.S. presidents Gerald Ford, Jimmy Carter, George H. W. Bush, and Bill Clinton; Vice President Kamala Harris, prima ballerinas Lauren Anderson and Misty Copeland, the Dalai Lama, iconic journalists Barbara Walters, Diane Sawyer, Robin Roberts, and Ann Curry, the late poet Maya Angelou, gospel superstar Yolanda Adams, Aretha Franklin (\"Queen of Soul\"), R&B girl group Destiny's Child, former heavyweight champion George Foreman, film directors Tyler Perry and Spike Lee, evangelists Joel and Victoria Osteen, actress and comedian Betty White and former first lady Michelle Obama, to name just a few.\n\nYet, Melanie's favorite stories have always been those that celebrate Houston's rich, multi-ethnic community-especially stories about children and those quietly working to make a difference in their lives. She has worked with organizations such as Houston Ballet, SHAPE Community Center, Asia Society, the Rothko Chapel, the Houston Museum of African American Culture, National Multiple Sclerosis Society, the Children's Defense Fund, Volunteer Houston, the Ensemble Theatre, and the Houston Association of Black Journalists. She is a member of the Texas Lone Star Chapter of the Emmys, Women in Film and Television, the American Leadership Forum, the Houston Chapter of Links Incorporated, and Alpha Kappa Alpha sorority. Melanie also served on the Board of Trustees at Princeton University.\n\nHer achievements have been recognized with numerous honors, including three Emmys, the YWCA's \"Outstanding Women of the Year,\" lifetime achievement awards from the Houston Press Club, Houston Community College, Women in Film and Television, and the Houston Association of Black Journalists, as well as the \"Women of Distinction\" award from the Crohn's and Colitis Foundation and the Ben and Julie Rogers Ecumenism Award from the Anti-Defamation League.\n\nWe look forward to celebrating her throughout the month of January, sharing stories, tributes, and memories. In the meantime, please join us in congratulating Melanie on her well-deserved retirement and in celebrating her extraordinary legacy.","summary":"Beloved ABC13 anchor Melanie Lawson will be retiring in January, after an extraordinary 43-year journey with ABC13.","url":"https://abc13.com/post/melanie-lawson-retiring-43-years-abc13/18209604/","image":"https://cdn.abcotvs.com/dip/images/18209611_KTRK-Melanie-Lawson-Retire-Collage-IMG.jpg","video":null,"publish_date":"2025-11-25 22:53:15","author":"KTRK","authors":["KTRK"],"language":"en","category":"politics","source_country":"us","sentiment":0.901},{"id":382236120,"title":"Stunning clash in Florida GOP battle as ambitious upstart unleashes jaw-dropping racial slur at Trump ally Byron Donalds","text":"An insurgent candidate for Florida governor has come out swinging, launching a seemingly racially charged epithet against black Republican candidate Byron Donalds. \n\nJames Fishback, 30, a former Wall Street financier and college dropout, officially launched his campaign to become Florida's next governor on Monday. \n\nHis primary opponent in the race is Congressman Byron Donalds, the front-running Republican who currently represents Florida's 19th Congressional District, encompassing Naples and Cape Coral. \n\nShortly after filing his paperwork to hop in the race on Monday, Fishback used some unsavory word choices to criticize Donalds, who is black. \n\n'Byron Donalds is a slave. I'm sorry - he's a slave,' Fishback began. \n\n'He is a slave to his donors. He is a slave to the corporate interests, to the tech bros that want to turn our state into his own words, a financial capital.' \n\nHis remarks quickly caught attention online, where some critics slammed the 30-year-old for employing racially charged language.\n\n'Byron Donalds has spent his life as a strong, black, conservative voice defending President Trump and the America First Agenda, so he is used to and unfazed by racist Twitter trolls who attack him for that,' Ryan Smith, a spokesman for Donalds' campaign, told the Daily Mail in a statement. \n\nIn a statement given to the Daily Mail, Fishback tripled down on his attack: 'If Byron Donalds doesn't want to be called a slave, then he should stop being a slave to his corporate donors.'\n\n'He’s taken $30 million in corporate money, which has compromised his judgment,' he continued. \n\nFishback, who has posted over half a dozen times on social media calling Donalds a slave, is now drawing backlash from conservatives, including the conspiratorially minded who see him as a distraction.\n\n'Fishback is a chaos agent most likely in the race to peel votes from a serious challenge to Byron Donalds,' lamented Florida-based John Cardillo. \n\n'I’d advise against calling the Trump endorsed, black GOP Congressman running for Governor of Florida a “slave,\"' conservative pundit Laura Loomer wrote on X. \n\nFishback later responded to her, doubling down and once again referring to the congressman as a slave. \n\nDespite his provocative, seemingly veiled racial attacks, Donalds is currently seen as the frontrunner in the race. \n\nA new poll from American Promise shows that 43 percent of likely GOP voters back Donalds, while all other Republican candidates, including Fishback, failed to surpass even two percent support. \n\nThe congressman also has the much-coveted endorsement from President Donald Trump. \n\nThough that may not concern Fishback, who has positioned himself as the heir to Governor Ron DeSantis' dynasty. \n\nThe 30-year-old investment firm CEO wrote in his announcement video that he wants to carry on DeSantis' legacy and keep DEI out of the Sunshine State while clamping down on H1-B foreign worker visas. \n\nHe also wants to abolish property taxes, a major DeSantis priority, and cancel AI data centers. \n\n'I’ll fight to preserve Governor DeSantis’ wins by keeping Florida free from DEI, radical transgenderism, Soros-backed prosecutors, child predators, voter fraud and the millions of illegals that invaded our country on Kamala Harris’ watch,' the 30-year-old candidate said. \n\nDonalds, meanwhile, has been endorsed by President Donald Trump and is seen as the mainstream MAGA candidate in the competition.\n\nDeSantis has yet to endorse a candidate in the race, though it is an open question whether he would back Donalds, who endorsed Trump in the 2024 presidential contest over the Florida governor.","summary":"An insurgent candidate for Florida governor has come out swinging, launching a seemingly racially charged epithet against black Republican candidate Byron Donalds.","url":"https://www.dailymail.co.uk/news/article-15326095/florida-republicans-battle-racist-slur-byron-donalds.html","image":"https://i.dailymail.co.uk/1s/2025/11/25/22/104187295-0-image-m-54_1764108400006.jpg","video":null,"publish_date":"2025-11-25 22:46:26","author":"Editor,Jon Michael Raasch","authors":["Editor","Jon Michael Raasch"],"language":"en","category":"politics","source_country":"gb","sentiment":0.117},{"id":382219234,"title":"BBC chair admits broadcaster took too long to address Trump documentary editing scandal","text":"British Broadcasting Corporation (BBC) Chair Samir Shah on Monday admitted the broadcaster took too long to address the controversial documentary that President Donald Trump has called \"false, defamatory, disparaging and inflammatory.\" Shah was grilled by the United Kingdom’s Culture, Media & Sport Committee, which held a hearing questioning the BBC’s leadership as the news organization has come under intense scrutiny over a documentary about Trump’s Jan. 6, 2021, speech delivered before the attack on the U.S. Capitol. Critics claim the documentary was misleading because it omitted Trump's call for supporters to protest peacefully, and the president has suggested a multibillion-dollar lawsuit is looming. The BBC \"Panorama\" documentary \"Trump: A Second Chance?\" omitted Trump urging his supporters to protest \"peacefully\" and instead spliced two separate comments made nearly an hour apart, creating the impression that he was calling for violence. TRUMP PLANNING LAWSUIT OF UP TO $5 BILLION AGAINST BBC OVER EDITED JAN 6 SPEECH DOCUMENTARY \"I’d like to take this opportunity, first of all, to apologize, to all the people who believe in the BBC, care for it, and wish for it to survive and thrive,\" Shah said to begin his remarks before the committee. \"I regret the mistakes that have been made and the impact that it’s had,\" Shah said. Trump's legal team issued the BBC a legal threat, demanding a full retraction and an apology as well as financial compensation. The broadcaster did issue an apology and said it had \"no plans\" to re-air the documentary but stopped short of fulfilling Trump’s demands and insisted there was no basis for the defamation claim. Shah said that executives, including now-former BBC News CEO Deborah Turness, wanted to publicly apologize for the documentary sooner, but he didn’t think their plan was sufficient. \"I heard the news wanted to apologize for the splicing of the edit… I thought that a necessary thing to do but wasn’t sufficient,\" he said. BBC APOLOGIZES TO TRUMP AMID $1 BILLION LEGAL THREAT \"I think the real issue here was the impression left that President Trump, in the 6th of January speech, had encouraged, called for violent actions,\" Shah continued. \"What we had to apologize for was that, as well as the splicing of the edit.\" Shah said editing interviews is \"normal journalistic practice,\" and therefore a simple edit was not the problem. \"The problem was the impression that it led, an impression that President Trump had called for direct violent action and that wasn’t the case. That is what I thought needed to be apologized for,\" Shah said. He was then asked why it took so long to apologize, as the BBC board met about the debacle in May but didn’t apologize to Trump until November. \"Looking back, I think we should have made the decision earlier,\" Shah said. \"We should have pursued it to the end and got to the bottom of it,\" he continued. \"And not wait as we did until it became public discourse.\" BBC CHAIR TELLS STAFFERS IT'S DETERMINED TO FIGHT TRUMP LAWSUIT OFF, NO BASIS FOR DEFAMATION CLAIM Trump’s legal team has continued to say the documentary defamed President Trump. \"The BBC defamed President Trump by intentionally and deceitfully editing its documentary in order to try and interfere in the Presidential Election. President Trump will continue to hold accountable those who traffic in lies, deception, and fake news,\" a spokesperson for Trump’s legal team told Fox News Digital. The controversy began with a bombshell report from The Telegraph that featured excerpts from a whistleblower dossier compiled by Michael Prescott, a communications advisor hired by the BBC to review its editorial standards. The dossier led to the resignations of Turness and BBC Director-General Tim Davie. Prescott was also present for the hearing and insisted he sounded the alarm out of \"love\" for the British broadcaster. \"At the most fundamental level, I wrote that memo, and let me be clear, because I am a strong supporter of the BBC. The BBC employs talented professionals… and most people in this country, certainly myself included, might go as far to say that they love the BBC,\" Prescott said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"What troubled me was that during my three years on the BBC’s standards committee, we kept seeing insipient problems which I thought were not being tackled properly,\" he continued. \"I thought the problems were getting worse.\" Prescott said it was \"especially troubling\" that the BBC was botching its chance to separate itself from lesser outlets that publish misinformation and fake news. \"There's real work that needs to be done at the BBC,\" Prescott said, noting that he would have also spoken out if the BBC’s gaffe helped Trump’s opponent, former Vice President Kamala Harris. \"I just want it to be impartial, accurate and fair,\" Prescott said. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Fox News Digital's Joseph A. Wulfsohn contributed to this report.","summary":"BBC Chair Samir Shah admitted the broadcaster took too long to address the documentary that President Trump has called &quot;false, defamatory, disparaging and inflammatory.&quot;","url":"https://www.foxnews.com/media/bbc-chair-admits-broadcaster-took-too-long-address-trump-documentary-editing-scandal","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/trump-bbc-lawsuit-fox-news-2.jpg","video":null,"publish_date":"2025-11-25 22:30:35","author":"Brian Flood","authors":["Brian Flood"],"language":"en","source_country":"us","sentiment":-0.31},{"id":382555314,"title":"Why Isn’t The Late Show With Stephen Colbert’ Airing New Episodes This Week?","text":"This week’s episodes of The Late Show With Stephen Colbert may look familiar to fans.\n\nThe CBS late-night talk show is airing reruns of recent episodes all week, starting on Monday, November 24. There’s a simple explanation behind the show’s current hiatus, as the week’s episodes coincide with the Thanksgiving holiday on Thursday, November 27.\n\nMonday’s rerun originally aired on November 12 and featured interviews with Jonathan Karl and Pete Townshend, the latter of whom sat in with Louis Cato and the Late Show Band. Tuesday night’s rerun will air the November 10 episode, featuring guests Demi Moore and Ken Burns.\n\nThe show’s October 22 episode with Emma Stone and Alex Wagner will air again on Wednesday, November 26, followed by the series’ November 3 episode with Tom Hanks and a performance by Mavis Staples on Thursday. The week will conclude on Friday, November 28, with the show’s November 5 episode featuring Tiffany Haddish and Gary Cole.\n\nThe Late Show‘s current break comes four months after CBS canceled the series. The show will air its final episode in May 2026.\n\nThe cancellation occurred shortly after CBS’ parent company, Paramount, settled a $16 million lawsuit with President Donald Trump, as he accused the show 60 Minutes of editing a 2024 interview with then-Vice President Kamala Harris. CBS stated that the cancellation was purely a financial decision, while Trump denied being the reason for the show’s end via Truth Social in July.\n\nColbert has continued to criticize Trump’s presidential administration on and off the show. In an interview with GQ published earlier this month, Colbert addressed theories that the series was canceled over politics.\n\n“My reaction as a professional in show business is to go: That is the network’s decision. I can understand why people would have that reaction,” he said of the speculation, “because CBS or the parent corporation — I’m not going to say who made that decision, because I don’t know; no one’s ever going to tell us — decided to cut a check for $16 million to the president of the United States over a lawsuit that their own lawyers, Paramount’s own lawyers, said is completely without merit.”\n\nHe continued, “It is self-evident that that is damaging to the reputation of the network, the corporation, and the news division. So it is unclear to me why anyone would do that other than to curry favor with a single individual. If people have theories that associate me with that, it’s a reasonable thing to think because CBS or the corporation clearly did it once. But my side of the street is clean and I have no interest in picking up a broom or adding to refuse on the other side of the street. Not my problem. So people can have their theories.”\n\nWhile Colbert said he was “surprised” by the cancellation, he also told the outlet that “every show’s got to end at some time.” He stated, “I’ve been on a bunch of shows that have ended sometimes by our lights and sometimes by the decision of other people. And that’s just the nature of show business. You can’t worry about that. You got to be a big boy about that. But I think we’re the first number one show to ever get canceled.”\n\nThe Late Show With Stephen Colbert, Weeknights, 11:35/10:35c, CBS\n\nMore Headlines:\n\nWhy Isn’t The Late Show With Stephen Colbert’ Airing New Episodes This Week?‘AGT’ First-Ever Winner Bianca Ryan Opens Up About Her Life Now, Almost 20 Years LaterWho Is Elle Duncan? What to Know About Netflix’s New SportscasterWhen Is ‘Jimmy Kimmel Live’ Back After Thanksgiving?‘Star Search’ Talent Competition Returns With Host Anthony Anderson — What’s New","summary":"The CBS talk show will air reruns the week of Thanksgiving.","url":"https://www.guampdn.com/lifestyle/entertainment/why-isn-t-the-late-show-with-stephen-colbert-airing-new-episodes-this-week/article_36f1db0b-2654-56f9-98dc-11aaeac3da7b.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/custom/image/d1d0565a-bcb2-11eb-8535-ab06d41ce483.jpg?resize=600%2C315","video":null,"publish_date":"2025-11-25 22:00:35","author":"Mavis Staples,Paige Strout,TV Insider","authors":["Mavis Staples","Paige Strout","TV Insider"],"language":"en","source_country":"gu","sentiment":-0.044},{"id":382230718,"title":"People Are Underestimating America’s Groyper Problem","text":"Is anti-Semitism in American political discourse actually just a carefully cultivated deception? Over the weekend, Elon Musk’s X revealed the location of every account on the site, and the results were eye-opening. Viral MAGA influencers ranting about “my tax dollars” funding foreign wars were exposed as Pakistani or Russian. Thirst traps of attractive Israeli soldiers turned out to be run by Indians. Heartbreaking stories of Gazan suffering were found to be posted from Europe. And many overtly racist accounts championing Nick Fuentes, the young white supremacist and Hitler aficionado, were revealed to be foreign-run. This discovery led some to suggest that anti-Semitism on the app was in fact an inauthentic intrusion into the American debate with little organic appeal.\n\n“Groypers are in shambles right now,” crowed Eyal Yakoby, a student activist who once testified before Congress about anti-Semitism on college campuses, referring to the supporters of Fuentes. “It’s all a foreign psyop,” he added. “Liberals point to these accounts and say, ‘See, here’s the evidence that Trump’s base, the MAGA movement, is racist and anti-Semitic to its core,’” the libertarian journalist Robby Soave wrote. “Well, guess what? A substantial number of them are based in the Middle East—Pakistan in particular. They’re not MAGA or America First. They’re cosplaying as America First in order to discredit MAGA.”\n\nThe notion that American anti-Semitism is an outside influence operation rather than a homegrown menace is a comforting story. Unfortunately, it’s not true. Fuentes followers punch above their weight in American discourse because they are young and disproportionately online; some foreigners no doubt found this far-right niche useful for generating engagement and revenue. But the rise of American anti-Semitism is not a foreign phenomenon, and it is not an online illusion.\n\nLast year, David Shor, a data scientist who did polling for Kamala Harris’s presidential campaign, surveyed nearly 130,000 voters and found that a quarter of young people had an “unfavorable opinion” of Jews—not Israel, Jews—far more than their elders. Today, some of the top podcasts in the country regularly feature overtly anti-Semitic conspiracy content, whether it’s Tucker Carlson rehabilitating Hitler, Candace Owens claiming that Israel had a hand in the assassinations of President John F. Kennedy and Charlie Kirk, or Joe Rogan hosting a conspiracy theorist who fulminated about how a “giant group of Jewish billionaires is running a sex-trafficking operation targeting American politicians and business people.”\n\nAnd it’s not just words. When far-right activists, including a college student named Nick Fuentes, marched in Charlottesville, Virginia, in 2017 and chanted “Jews will not replace us,” that wasn’t a foreign psyop. When a white supremacist animated by that same fear—that conniving Jews were replacing the white race through mass migration—massacred worshippers at Pittsburgh’s Tree of Life synagogue in 2018, he wasn’t taking cues from abroad. Neither were the Black nationalists who shot up a Jersey City kosher supermarket in 2019, nor the anti-Israel assassins this past year who attempted to incinerate Pennsylvania Governor Josh Shapiro and murdered three people, including a young Jewish woman allegedly shot in the back in Washington, D.C., and an 82-year-old burned to death in Boulder, Colorado.\n\nThe reasons for this anti-Jewish eruption are manifold. Holocaust memory has attenuated with the passing of older generations. Outrage over Israel’s war in Gaza has led some self-styled Palestinian partisans to perpetrate or justify attacks on Jews thousands of miles away. Social-media platforms lowered the barriers to spreading anti-Semitic invective, allowing bigots to find and amplify one another more easily. Algorithms often privilege novel inflammatory content—including conspiracy theories—over careful, factual reporting. Sites such as X no longer pretend to moderate this material, not that they ever did much to impede it in the first place.\n\nThe upshot is this: Whether anti-Semitic content comes from America or abroad, the supply is simply rising to meet demand. Viral Groyper content only goes viral in the first place because it appeals to Americans who share the sentiment. Outside spending and propaganda cannot manufacture what isn’t already there.\n\nConsider an analogy: In 2022, the Democratic Party spent millions to boost pro–Donald Trump primary candidates who denied the outcome of the 2020 presidential election. The strategy succeeded—many of these extreme candidates won their primary, only to be defeated by Democrats in the general election. Some Republicans groused about Democrats interfering in their party’s processes to promote weaker contenders, but the complaints were copes—a way to avoid blaming their own voters. After all, the Democrats didn’t lie to Republican voters about the election deniers. They simply hyped up extreme candidates—and the GOP-primary electorate liked what it heard. Foreign Groyper accounts, like those election-denying candidates, are merely marketing lies that many people are already predisposed to accept.\n\nTo be clear, astroturfed campaigns can and do distort discourse and stoke conflict. For the online marketplace of ideas to function, users need to know what’s authentic and what’s inauthentic, what’s foreign and what’s domestic. X’s location update was a small but salutary step in that direction. But no one should fool themselves into thinking that American pathologies—including anti-Semitism—are primarily paid propaganda. Foreign actors may exploit our divisions, but they don’t create them. They can fan the flames, but they didn’t start the fire. We did that ourselves—and we will have to put it out.","summary":"Rising American anti-Semitism isn’t a foreign influence operation.","url":"https://www.theatlantic.com/politics/2025/11/online-antisemitism-groyper-problem-foreign-accounts/685064/","image":"https://cdn.theatlantic.com/thumbor/L7BE9_aP8raNvJ1g2xAoRVjxsMQ=/0x0:3859x2171/720x405/media/img/mt/2025/11/2025_11_25_Foreign_Groyper_Accounts_On_X_Are_An_American_Problem/original.jpg","video":null,"publish_date":"2025-11-25 21:50:16","author":"Yair Rosenberg","authors":["Yair Rosenberg"],"language":"en","category":"politics","source_country":"US","sentiment":0.249},{"id":382215928,"title":"Duggan won’t say if Trump’s execution threats go too far","text":"Detroit Mayor Mike Duggan had an opportunity this weekend to say whether he thinks President Donald Trump’s threats of jailing and executing political opponents has gone too far. \n\nAppearing on WXYZ’s Spotlight on the News over the weekend, Duggan, who is running for governor as an independent, was asked about Trump accusing Democratic lawmakers, including U.S. Sen. Elissa Slotkin of Michigan, of “seditious behavior.” Trump suggested their actions could be “punishable by DEATH” after they released a video reminding military members they can refuse illegal orders.\n\nInstead of answering, Duggan dodged the question, as he often has when asked about Trump’s dangerous behavior and policies. \n\n“I’ve stayed out of these national debates,” Duggan said. “I’m not going to get involved in the national debate.”\n\nHost Chuck Stokes quickly moved on, promising to come back with “some more positive things.” \n\nThe exchange has become all too common in the local media. Rather than press Duggan on his position, Stokes let the mayor dodge a question that is important for many voters as they continue to ask: Who is Mike Duggan now and where does he stand on many issues? The former Democrat is trying to appeal to independents and Trump supporters, and he has refused to touch controversial issues. \n\nAsked why Duggan wouldn’t respond to Stokes, campaign spokesperson Andrea Bitley tells Metro Times that the mayor “answered the question clearly.”\n\n“He is running for state office, not federal office, and has made it his practice in this campaign to stick to state issues,” Bitley says.\n\nBut Trump’s rhetoric and policies have become state issues. Trump has ordered federal immigration raids that rely on state cooperation, pushed to deploy U.S. troops into American cities, and threatened to withhold funding to some states. His administration’s policies deal with everything from health care access and public safety to immigration enforcement.\n\nLast week, Trump’s dangerous rhetoric drew widespread condemnation, even from members of his own party. Slotkin reportedly received a bomb threat last week. \n\nSo far, Duggan isn’t willing to talk about it. \n\nIn posts on his Truth Social platform, Trump called Slotkin and five other Democratic lawmakers “traitors” and wrote that their video urging troops to refuse unlawful orders amounted to “SEDITIOUS BEHAVIOR, punishable by DEATH!” He also reposted a supporter’s call to “HANG THEM,” prompting a wave of threats against the lawmakers and forcing some to adopt 24/7 security. \n\nOn Tuesday, Slotkin said the FBI has signaled it has opened what appears to be an investigation into her and others who released the video.\n\nSlotkin, appearing on ABC’s This Week, called Trump’s language “a tool of fear” and said the goal was to intimidate critics and distract from other damaging news.\n\nEven some Republicans denounced Trump. Sen. Rand Paul, a Kentucky Republican, said calling opponents “traitors” and threatening the death penalty was “reckless, inappropriate, irresponsible” and warned it could inspire unstable people to commit violence. Sen. Lindsey Graham, a longtime Trump ally and Republican from South Carolina, called the president’s comments “over the top.”\n\nRepublican Rep. Michael McCaul told ABC he didn’t “speak for the president in terms of hanging members of Congress” and urged everyone to “tone down the rhetoric.”\n\nWhile some Republicans who support Trump were willing to say his threats crossed a line, Duggan has chosen to remain silent.\n\nInstead, he touts his ability to “bring Democrats and Republicans together.”\n\nHere’s the exchange on WXYZ:\n\nStokes: “We now have a controversy with the president now about sedition and making charges against Democratic politicians, one of our own Senator Slotkin … that it could lead to sedition and could lead to hangings and shooting politicians.”\n\nDuggan: “Yeah, so the reason that we have been successful is, I’m the mayor of Detroit, and I am dealing with issues that relate to Detroiters. I’ve stayed out of these national debates, and I think Detroit has done extremely well by paying attention to what we’re doing in the city, and so I’m not going to get involved in the national debate.”\n\nStokes didn’t press him. There was no follow-up or questions about whether Duggan thought threatening lawmakers with death was wrong. \n\nThat has become a pattern in Duggan’s 2026 governor’s race. He casts himself as a post-partisan problem-solver while dodging questions about Trump’s most extreme actions and rhetoric, even when the target is a fellow Michigan officeholder.\n\nDuggan’s silence stands in stark contrast to the mayor that Detroiters have seen for most of the last decade.\n\nFor nearly 40 years in public life, Duggan said he was a proud Democrat. He campaigned for Barack Obama, Hillary Clinton, Joe Biden, and Kamala Harris. At the 2016 Democratic National Convention, he mocked Trump’s many bankruptcies and called him “the most phony party nominee” he’d ever seen. When Trump falsely claimed voter fraud in Detroit in 2020, Duggan called the allegations “utter nonsense” and “a real threat to everything we believe in … that everybody’s vote counts the same.”\n\nHe praised Biden and Harris as “real partners” who helped Detroit recover and said “the best thing that happened in Detroit was when Donald Trump left office.”\n\nNow, Duggan insists he hasn’t changed his views “on any issue,” just his party label.\n\n“I haven’t changed any positions, other than that I think the toxic relationship between the two parties is badly damaging the state and we need a different approach to get Republicans and Democrats to work together,” Duggan told conservative Detroit News columnist Nolan Finley this summer.\n\nBut his public posture has shifted. He’s far more likely these days to attack Democrats than Trump or Republicans, accusing his former party of caring only about hating the GOP and Trump and claiming “people are fed up with this Democratic Party in Michigan.” On social media and in TV interviews, he repeatedly says both parties are broken, and he is above partisan bickering.“I don’t answer to party bosses. I answer to you,” Duggan’s campaign page tweeted last week. \n\nDuggan’s statements come as his campaign relies heavily on a coalition of Republican donors and Trump supporters. As Metro Times previously reported, Duggan is raising millions of dollars from the Republican establishment and Trump megadonors, such as billionaire Roger Penske, former Michigan GOP chair Ron Weiser, charter school mogul J.C. Huizenga, and other heavyweights who have poured money into Trump, the GOP, and conservative causes for years. Many have given Duggan the maximum contribution, and family members and business associates have also donated. \n\nIn October, a Duggan fundraiser was co-hosted by controversial millionaire Anthony Soave, who donated $100,000 to a Donald Trump political action committee and has been linked to multiple corruption scandals involving city contracts.\n\nDuggan’s team openly boasts that he’s “pulling unprecedented support from Democrats and Republicans,” citing polling that shows him closing in on Democrat Jocelyn Benson and Republican John James in a three-way race. If the election were held today, a recent internal survey from Duggan’s campaign suggested he would garner 26%, while Benson would get 30%, and James 29%. \n\nDuggan’s refusal to condemn Trump for threatening the lives of Slotkin and others is a sharp departure from his past criticism of the president. Either Duggan has changed his position on Trump, or he’s willing to tolerate the threats and bigotry of the administration. \n\nOne of them is political theater. \n\nIn ordinary times, dodging a question on a popular TV news show might not be a big deal. But the sitting president is telling the country that a Michigan senator and her colleagues are “traitors” whose actions are “punishable by DEATH,” while they report an alarming increase in threats.\n\nDuggan says he wants to leave the “us vs. them” politics behind him, but many voters also want to know whether a would-be governor believes it’s acceptable for a president to suggest that his critics are “traitors” who deserve death.\n\nDuggan chose to duck on live TV when given the chance to condemn Trump’s dangerous rhetoric.\n\nThe real question in this campaign may not be whether he’s a Democrat, Republican, or independent. It’s whether Michigan voters will accept a governor who won’t say where he stands when it really matters.","summary":"Detroit Mayor Mike Duggan had an opportunity this weekend to say whether he thinks President Donald Trump’s threats of jailing and executing political opponents has gone too far. \n\n\nThe post Duggan won’t say if Trump’s execution threats go too far appeared first on Detroit Metro Times.","url":"https://www.metrotimes.com/news/duggan-wont-say-if-trumps-execution-threats-go-too-far/","image":"https://www.metrotimes.com/wp-content/uploads/2025/11/54946424433_4c91e5ba6e_c.jpg","video":null,"publish_date":"2025-11-25 21:30:59","author":"Steve Neavling","authors":["Steve Neavling"],"language":"en","category":"politics","source_country":"us","sentiment":-0.166},{"id":382255506,"title":"Scott Jennings Has a Few Choice Words for 'Never-Trump' Republicans","text":"Republican strategist and CNN contributor Scott Jennings is known for his loyal support of President Donald Trump, but if anyone still doubted where he stands, he cleared it up during an appearance on After Party with Emily Jashinsky. During the interview, Jennings tore into so-called “Never Trumpers” for abandoning the conservative values they claim to live by.\n\nDuring the 2024 presidential election, a number of people who call themselves conservative Republicans—but, for whatever reason, hate Trump—chose to vote for former Vice President Kamala Harris instead. You can dislike Trump’s bravado, his speaking style, or even aspects of his policies as a conservative, but thinking that justifies voting for a radical leftist who is incompetent and openly hostile to everything you stand for is beyond foolish.\n\nJennings slammed the Never Trump arguments for Harris as an effort to push conservatism leftward instead of preserving the values and principles our nation was founded on.\n\n“During the 2024 campaign, I kept hearing these Republicans say things like, ‘In order to save conservatism, we have to vote for Kamala Harris.’ And as someone who had to sit out there and debate these issues every night, I could never figure out why they were saying that, what they meant by that,” Jennings said during the podcast. “Then I started thinking about the underlying arguments they were making, the other statements they were making, and I realized they weren’t trying to save conservatism. They were trying to liberalize it.”\n\n“A lot of these people no longer vote for any Republican. A lot of these people are no longer pro-life. A lot of these people no longer really believe in any of the conservative stuff we supposedly fought for over the last 25 years,” he added. “They let their personality conflicts or problems with Donald Trump completely change what they claim to be fighting for. Heck, look around.”\n\nThey’re either trying to liberalize conservatism or protect their own grift. Many are media pundits who want to appeal to a broad base of viewers or readers and keep a job somewhere. Holding to conservative values in today’s political climate won’t make you popular with a mainstream audience, so talking heads who are in it for money and notoriety find it easier to sell out their convictions than stand for what’s right and true.\n\nJennings specifically called out Nicolle Wallace, a former official in the George W. Bush administration who now works as an anchor on MS NOW. Wallace referred to herself as a “self-loathing former Republican” during a 2021 appearance on The Late Show with Stephen Colbert.\n\n“We relied on her for communications advice in the Bush White House. Now, this is somebody who built her career supposedly communicating with the American people about George W. Bush’s conservative agenda,” Jennings said. “And now she is one of the most deranged looney tunes in American media… Did you ever believe any of it? … Bush was a conservative guy.”\n\nJennings didn’t stop there. He also blasted MS NOW analyst and Bulwark Podcast host Tim Miller. In a Substack piece written in 2020, Miller announced he was ditching the GOP after years as a party operative and serving on former Florida Gov. Jeb Bush’s 2016 presidential campaign.\n\n“Tim Miller, this other looney tunes. He was supposedly a Republican operative. Now he is one of the most liberal people in our political affairs ecosystem,” Jennings continued. “Did you ever believe any of it? And what is it about Donald Trump that made you change every single thing you supposedly ever believed in? I don’t understand how one person could break so many supposedly smart and experienced people.”\n\n“And to this day, I still do not understand people who claim to be Republicans, running around having voted for Democrats in each of the last three elections, having advocated for Democrats to win the Senate, having advocated for Democrats to win the House, having advocated for pro-abortion policies, having advocated for every liberal social crusade, and then look me in the eye and say, ‘You’re hurting conservatism by supporting Donald Trump.’ F all the way off,” he continued.\n\nJennings’ verbal beatdown of Miller made host Emily Jashinsky laugh, which prompted the CNN contributor to close with, “I don’t know if I’ve ever been around anybody who was less good at their job but more condescending. His talent-to-condescension ratio is so far off it’s ridiculous.”\n\nHelp PJ Media continue to tell the truth about left-wing bias in the mainstream media as we continue to usher in the Golden Era of America. Join PJ Media VIP and use promo code FIGHT to get 60% off your membership.","url":"https://pjmedia.com/michaelcantrell/2025/11/25/scott-jennings-has-a-few-choice-words-for-never-trump-republicans-n4946406","image":"https://media.townhall.com/cdn/hodl/2025/260/9b04c5b3-1036-4de0-a1ac-1ba0fcfb641a.png","video":null,"publish_date":"2025-11-25 21:22:31","author":"Michael Cantrell","authors":["Michael Cantrell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.382},{"id":382193694,"title":"Jennifer Lopez performs for Donald Trump Jr. and others at Indian billionaire’s wedding","text":"Jennifer Lopez has once again taken what must be a big paycheck to do a private concert for people with a lot of money. This time, it was an opulent three-day wedding in India, hosted by an Indian American billionaire on behalf of his daughter and her groom, a San Francisco-based tech entrepreneur.\n\nSeveral things have sparked controversy surrounding Lopez’s Friday concert for the wedding of Netra Mantena, daughter of pharmaceutical entrepreneur Rama Raju Mantena, and her groom, Vamsi Gadiraju, according to the Daily Mail.\n\nThe first is that one of the guests, for whom Lopez performed, was Donald Trump Jr. The socially and politically divisive son of President Donald Trump joined A-list Bollywood stars and other uber-wealthy people at the wedding spectacle, which showcased luxury and grandeur in iconic locations across the Taj Lake Palace in Udaipur in Western India, reports sid. The location, which was featured in the 1983 James Bond film “Octopussy,” incidentally gave the wedding its 007 theme, according to the Daily Mail. Trump Jr.’s date for the wedding was Bettina Anderson, the Palm Beach socialite he reportedly left fiancee Kimberly Guilfoyle to be with.\n\nLopez’s fans have taken issue with the gossip site TMZ blasting news about her performance at the wedding with a sub-headline that said she “performed for Trump Jr.” These fans seem to know it’s not a good look for Lopez to be seen socializing with a Trump family member, given that she endorsed the president’s three opponents, Hillary Clinton, Joe Biden and Kamala Harris, in their respective elections in 2016, 2020 and 2024. Lopez also performed “American the Beautiful” at Biden’s January 2021 inauguration — two weeks after Trump Jr. joined his father in denying the results of the 2020 election at a rally of supporters ahead of the Jan. 6 insurrection at the U.S. Capitol.\n\nMultiple people on X admonished TMZ for its sub-headline, with one saying, “You mean (to say) Jennifer Lopez performed as a paid performer at the billionaire couple’s wedding, where Trump’s son happened to be one of the many guests. The insinuation that J.Lo has anything to do with any Trump family member is misleading.”\n\nSeveral people also said, “Trump Jr. just happened to be there,” and “She is not responsible for who was invited.”\n\nBut others said people were offering “excuses” for Lopez, who suggested she said was doing the gig “for the money” she doesn’t said. One person said, “My question is, did she know he was going to be there ? If not, can’t blame her. If she did know, well (add) another name to my D.E.I. list ‘Don’t Engage Ignorance.'”\n\nThe Daily Mail’s report mentioned another potential controversy: Reports in the Indian media that the wedding spectacle, which reportedly cost $6.7 million, has come under fire for being “a sheer wastage of money.” In addition, the Daily Mail focused on Lopez performing some of her hit songs in a series of “skimpy” outfits, including a semi-sheer black bodysuit with a G-string backside.\n\nLopez previously faced backlash in 2013, after she traveled to Turkmenistan to perform for a private concert. Vanity Fair reported that Lopez was paid from $1 million to $1.5 million to sing three songs for guests who included Gurbanguly Berdimuhamedow, the former president of Turkmenistan, whom the Wall Street Journal dubbed a “dictator.”\n\nCritics accused Berdimuhamedow of human rights violations, prompting an outcry over Lopez’s decision to serenade him with “Happy Birthday” during the performance. Her representative later issued a statement, explaining that the event was not sponsored by Turkmenistan’s government and saying she would not have attended if she had known about the human rights issues, E! News said.\n\nWhatever backlash that Lopez might face for performing at the wedding in India — while Trump Jr. “happened to be there” — the president’s oldest son appeared to have a wonderful time with Anderson. Trump Jr. and Anderson “looked more in love than ever as they laughed and smiled during the festivities,” the Daily Mail reported. “They couldn’t keep their hands off each other throughout most of the nuptials, with Bettina throwing her arms around a grinning Don Jr at one point.”\n\nThe Daily Mail said that MAGA insiders recently said that Trump Jr. and Anderson are considering marriage, with one saying: “Don is in love with Bettina. He is telling friends ‘This is the woman I love.'”\n\nAs for this week’s bridal couple, it wasn’t immediately known how they met. Mantena, the bride, is the daughter of Padmaja and Raju Mantena, a prominent Orlando-based entrepreneur and the CEO of Ingenus Pharmaceuticals, a company with research and development hubs across the United States, Switzerland, and India, India Today reported. \n\nAs for the groom, Gadiraju grew up in the Bay Area, where he attended the San Jose-based Harker School, a top private K-12 school that was founded in 1893, according to his LinkedIn page. After attending Columbia University, Vamsi co-founded Superorder, where he serves as chief technology Officer. The platform focuses on helping restaurants with multiple locations manage and optimize their delivery and takeout services.","summary":"Lopez fans pushed back at the idea that the singer 'performed for' Trump's oldest son, saying he just 'happened to be there'","url":"https://www.mercurynews.com/2025/11/25/jennifer-lopez-performs-donald-trump-jr-indian-billionaires-wedding/","image":"https://www.mercurynews.com/wp-content/uploads/2024/12/LopezSuperbowl2020.jpeg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-25 21:01:53","author":"Martha Ross","authors":["Martha Ross"],"language":"en","category":"politics","source_country":"us","sentiment":0},{"id":382203978,"title":"‘Burn alive, b***h’: Offender with 72 prior arrests set free by DEI-obsessed judge — then allegedly sets woman on fire","text":"Democrats’ soft-on-crime policies have resulted in yet another attack on an innocent woman. On November 17, 26-year old Bethany MaGee was riding Chicago's Blue Line L train when 50-year-old Lawrence Reed — a serial offender with 72 prior arrests — allegedly doused her in gasoline and lit her on fire, reportedly shouting, “Burn alive, bitch.”\n\nAlthough MaGee escaped from the train, she now remains in critical condition, hospitalized in a burn unit with severe injuries covering approximately 60% of her body.\n\nReed was arrested the following day and charged with a federal terrorism offense.\n\n“So, he could be eligible for the death penalty if convicted, which, like, let’s do that, okay? Let’s just do that,” says BlazeTV host Sara Gonzales, who’s nauseated at the extensive leniency Reed was shown by Chicago’s justice system over decades, despite his staggering criminal record, which includes multiple felony convictions for violent crimes.\n\nBack in August this year, Reed was hit with an aggravated battery charge for assaulting a social worker in a hospital, but Cook County Judge Teresa Molina-Gonzalez overruled prosecutors’ pleas for detention and freed him on electronic monitoring, ignoring the fact that he had a history of felony aggravated arson convictions for setting occupied buildings on fire, plus scores of violent battery and assault cases.\n\nAccording to court transcripts, Molina-Gonzalez stated, “I can’t keep everybody in jail because the state’s attorney wants me to.”\n\nFurther, a resurfaced video clip from a Hispanic Heritage Month interview shows Molina-Gonzalez stating: “You know, being a Latina in the office, people would tell me, like, ‘Don’t you feel like you’re prosecuting your own people?’ But it’s true, there are a lot of defendants that look like me. However, I had a chance as a prosecutor to make a difference as to what cases come in. I had a chance as a prosecutor to decide what offers were appropriate.”\n\nIn the same video, Molina-Gonzalez also admits that she “always [offers] them the opportunity to do community service.”\n\nIn other words, Sara explains, Judge Molina-Gonzalez isn’t committed to justice; she’s committed to DEI. “The problem is that these law schools are producing people like Kamala Harris and Ketanji Brown Jackson and Fani Willis and this dumbass judge.”\n\n“The fact that [Molina-Gonzalez] was able to go through law school, was able to pass all the tests, was able to get to her position, and still think that it is her place to be offering up what she thinks the offender will like best is insane,” Sara adds.\n\nWhen blue-city judges prioritize perpetrators above victims, they think they’re exercising restorative justice, but all they’re doing is creating career criminals that wreak havoc on innocent civilians — people like Iryna Zarutska, Logan Federico, and now Bethany MaGee.\n\nJudge Molina-Gonzales, Sara says, is exactly “why President Trump is bringing in the National Guard into these s***hole cities.”\n\nTo hear more of Sara’s scathing commentary, watch the episode above.\n\nWant more from Sara Gonzales?\n\nTo enjoy more of Sara's no-holds-barred takes on news and culture, subscribe to BlazeTV — the largest multi-platform network of voices who love America, defend the Constitution, and live the American dream.","url":"https://www.theblaze.com/shows/sara-gonzales-unfiltered/burn-alive-offender-with-72-prior-arrests-set-free-by-dei-obsessed-judge-then-allegedly-sets-woman-on-fire","image":"https://www.theblaze.com/media-library/image.jpg?id=62238128&width=1200&height=600&coordinates=0%2C0%2C0%2C120","video":null,"publish_date":"2025-11-25 21:00:00","author":null,"language":"en","source_country":"us","sentiment":-0.277},{"id":382230716,"title":"Senator Mark Kelly Is in the Wrong Job","text":"Secretary of Defense Pete Hegseth apparently thinks that Senator Mark Kelly of Arizona is in the wrong job. Kelly was one of six Democratic legislators who released a video reminding the officers and enlisted people of the U.S. military that they are bound by their oaths to disobey illegal orders. Now Hegseth wants to recall Kelly, a decorated combat veteran and former astronaut, back to active duty in the Navy so that Kelly can be court-martialed for what Hegseth sees as riling up the troops against the commander in chief.\n\nHegseth has a point: Maybe Kelly shouldn’t be in Congress. But the secretary is wrong about putting the senator back in the naval service. In a more sensible and serious world (and, yes, I know this is not the one we live in right now), Hegseth would be fired—and Kelly would take Hegseth’s job as secretary of defense.\n\nKelly is at least as qualified to lead the Pentagon as other recent appointees, and would probably be an easy addition to any future Democratic administration’s shopping list for senior defense or national-security roles. (He was also shortlisted to be Kamala Harris’s running mate in 2024.) A Navy pilot, Kelly flew 39 combat missions in Operation Desert Storm. He has a uniform heavy with awards, including medals with the combat “V,” a special addition that denotes valor and heroism. After the senator posted a picture of those medals yesterday on social media, Hegseth, one of the most eager and petty trolls in an administration full of them, immediately took to social media and claimed that they were in the wrong order. He also warned “Captain” Kelly—putting Kelly’s rank in scare quotes—that he will have to submit to a uniform inspection once he’s recalled.\n\nAfter his combat service, Kelly joined the astronaut corps, and piloted or commanded multiple Space Shuttle missions. (His twin brother, Scott, also became an astronaut.) In 2011, he retired—not to kick back and get rich, but to help his wife, the former member of Congress Gabby Giffords, who had been nearly killed in a shooting earlier that year.\n\nKelly’s had some business ventures, but he’s a bit light on management experience. Still, he’d be a far better choice than Hegseth, who is now vying to snag the never-coveted title of Worst Secretary of Defense in Modern American History.\n\nHegseth, for the moment, is in no danger of taking the crown from Robert McNamara, a brilliant man who nonetheless kept sending American boys to Vietnam even when he knew the war was lost. The day is young, however, and Trump seems determined to start a war in Latin America that could offer Hegseth the opportunity to give McNamara a run for his money.\n\nBut unlike Hegseth, McNamara also did some good during the frostiest days of the Cold War, including modernizing Pentagon procedures and updating American nuclear strategy. So did other flawed secretaries: Melvin Laird created important new Defense Department institutions while privately (and ineffectively) opposing the expansion of the Vietnam War to Cambodia; Jim Schlesinger and Harold Brown did what they could to arrest the free fall of American power in the 1970s; Les Aspin tried, and failed, to kill national missile defenses; Donald Rumsfeld initiated post–Cold War reforms but stubbornly refused to think about the post–Gulf War administration of Iraq.\n\nEven James V. Forrestal, the first modern secretary of defense, was also better at his job—and he was fired in 1949 after a conflict with President Harry Truman and a nervous breakdown. (He killed himself later that year by jumping out of a window at Bethesda Naval Hospital.) Whatever his shortcomings, Forrestal was an honorable and hardworking public servant, which is why a building in Washington, D.C., and an aircraft carrier were both named in his honor.\n\nAll of these secretaries were competent men with records of achievement before coming to the Pentagon. They were professionals and patriots who cared about the security of the United States and the people who served in uniform. Hegseth, by comparison, is a dude-bro sporting some questionable tattoos, a creation of television who’s acting as if he won The Apprentice: The Nuclear-Weapons Season. He seems to believe that his job is hectoring young men about being fat and forcing Black men out of the military for having beards. He has no understanding of national strategy, and no real experience managing anything.\n\nNor is he a man who can serve as a model for his organization. Hegseth wants to recall Kelly so that he can level charges under the Uniform Code of Military Justice against him, but when Hegseth was a serving officer, he could have faced the UCMJ himself: By his own admission, he was an adulterer with an alcohol problem. (Apparently, military justice for thee and not for me is the new rule in Hegseth’s Pentagon.) His tenure so far has featured a series of appalling security lapses and janky public performances that call into question not only his character but his emotional stability.\n\nThe Trump White House knows that Hegseth is nothing like Forrestal, or Aspin, or even Rumsfeld, for that matter, and that he is unqualified to do anything but push-ups. This realization is probably why Secretary of the Army Daniel Driscoll, and not the actual head of the Pentagon, is the person meeting with the Russians in Geneva trying to stop the biggest war in Europe since 1945. Trump seems to like Hegseth, but the administration also seems to be taking care not to let Hegseth near anything breakable or dangerous.\n\nOf course, Hegseth is still the secretary of defense, and thus the person who, in theory, must advise the president of the United States on the most dire issues of war and peace. He is also the official likely to be in the room and who would verify the orders if the commander in chief calls for the use of nuclear weapons. The idea that Hegseth would have to advise Trump in a moment of crisis is genuinely terrifying: The president is already showing increasing signs of panic and irrationality, and Hegseth is hardly the kind of stable or prudent aide one hopes would be nearby in times of danger.\n\nFor now, the White House seems content to let Hegseth preen and strut and yell, but the United States still needs an actual secretary of defense, and Pete Hegseth is completely unqualified for any position of public trust, elected or appointed, in the government of the United States.\n\nTrump should look around and choose one. He has plenty of options—including Mark Kelly.","summary":"He should be secretary of defense.","url":"https://www.theatlantic.com/ideas/2025/11/mark-kelly-military-trump/685065/","image":"https://cdn.theatlantic.com/thumbor/guCn8mOPEl-RLiUnfqqimpi1JiE=/0x0:6000x3375/720x405/media/img/mt/2025/11/2025_11_25_Mark_Kelly-1/original.jpg","video":null,"publish_date":"2025-11-25 20:17:25","author":"Tom Nichols","authors":["Tom Nichols"],"language":"en","source_country":"US","sentiment":-0.137},{"id":382163450,"title":"The rise of resistance cinema in the era of Trump – Hartford Courant","text":"By Mark Leydorf, Bloomberg News\n\nA year ago, a passionate woman of color found her voice and took on an older, white carnival barker who was stoking bigotries to seize unchecked power.\n\nI’m not talking about Kamala Harris, but Elphaba Thropp from the box-office smash “Wicked.” The Democratic nominee for president was unable to defy gravity in the end, but over in Oz, the battle is still raging. When w ...","url":"https://www.courant.com/2025/11/25/resistance-cinema/","image":"https://www.courant.com/wp-content/uploads/2025/11/202511211313MCT_____PHOTO____ENTER-MOVIE-WICKED-RESISTANCE-FILMS-2-MCT-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-25 18:28:20","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.088},{"id":382181730,"title":"The rise of resistance cinema in the era of Trump","text":"By Mark Leydorf, Bloomberg News\n\nA year ago, a passionate woman of color found her voice and took on an older, white carnival barker who was stoking bigotries to seize unchecked power.\n\nI’m not talking about Kamala Harris, but Elphaba Thropp from the box-office smash “Wicked.” The Democratic nominee for president was unable to defy gravity in the end, but over in Oz, the battle is still raging. When we last saw Elphaba (Cynthia Erivo) at the cliffhanger ending of “Wicked,” she was preparing for war. The not-so-Wicked Witch of the West is back in theaters this weekend, and she’s ready to rumble.\n\nWhen “Wicked: For Good” starts, though, she’s pretty down and out. The Wizard (Jeff Goldblum) remains as Trumpy as ever, waging a vicious campaign to demonize and deport Oz’s animal citizens. Madame Morrible (Michelle Yeoh), his PR manager, has stirred up propaganda to discredit our heroine, branding her as, well, it’s in the title. Meanwhile, Elphaba’s boy toy, Fiyero (Jonathan Bailey), and her bestie, Glinda (Ariana Grande), have accepted shiny new jobs in Oz: He’s now Captain of the Wizard’s Guard, and she’s been promoted to Glinda the Good, which basically involves floating over to Munchkinland in a nifty bubble to give pep talks.\n\nHiding out in the woods, the best Elphaba can do is an occasional guerrilla action, freeing the enslaved animals building the Yellow Brick Road. But those who saw “Wicked” — and that’s a lot of us; the film made more than $750 million worldwide, according to BoxOfficeMojo — know better than to count her out.\n\n“Wicked: For Good” is not, alas, that good. As fans of the Broadway musical on which it’s based know, all the best bits are in the first installment. And yet this brassy, candy-colored “Battle of Algiers” takes one of the clearest stands against authoritarianism and white supremacy you’ll find in theaters. It couldn’t be more timely.\n\nAccording to Gallup, people worldwide have more worry, stress, sadness and anger than they did a decade ago. Its recent surveys in the U.S. find that only 29% of Americans are satisfied with the direction their country is going, and they strongly dislike their leader: The only president to have had a lower average approval rating than Trump 2.0 (42%) so far was Trump 1.0 (41%). There’s a reason Republicans were routed in the off-year elections and 7 million people marched against the administration in the latest No Kings protest, on Oct. 18.\n\nFilmmakers the world over are stepping into the breach. Probably the most notable political movie this year is Paul Thomas Anderson’s raucous, violent takedown of America’s immigration policy: the excellent and polarizing “One Battle After Another.” The auteur’s latest epic stars Leonardo DiCaprio and Teyana Taylor as scrappy activists facing off against a racist police state embodied by a villainous Sean Penn. The movie has made a tidy $200 million, and stands to rake in more if its director and stars take home Oscars as expected.\n\nThe taut if somewhat clichéd political thriller “A House of Dynamite” offers a more subtle critique of the government. (The movie’s box office was negligible; it barely paused in theaters before its producer, Netflix Inc., released it online.) By keeping her main actor — the president — off-camera until the conclusion of the film, director Kathryn Bigelow leaves his character, ethics and intellect a mystery. For most of the movie, we’re engaged in a thought experiment: What would happen if a rogue nuclear missile launched over the Pacific, and our president was, say, the current occupant of the White House?\n\n“The Mastermind” takes on the spread of shameless self-dealing. In this marvelously sly film from Kelly Reichardt, a clueless petty thief (Josh O’Connor from “Challengers”) gets tripped up in Vietnam War-era social unrest. You’d almost miss the connection to national politics, except that the director keeps deviously flashing Richard Nixon’s grim mug on the televisions in the background of many scenes. (The movie’s made only about $1.3 million, but that’s pretty good for the slow-cinema auteur.)\n\nWith headlines on Ukraine, Gaza, Sudan and the Venezuelan boat bombings serving up stories of brutal aggression almost daily, it’s a great time to revisit “Nuremberg.” James Vanderbilt’s polished movie about the precedent-setting trials at the end of World War II isn’t great — Russell Crowe is terrific as Hermann Göring, but Rami Malek is painfully hammy as the shrink tasked with figuring him out — but it did manage a respectable $9 million in its first week.\n\nThe list goes on: “Eddington,” “Bugonia,” “Sirāt” — there’s a reason directors are digging into stories of conflict, paranoia and cataclysm. Taken together, these films, most of which were conceived and went into production during Donald Trump’s interregnum, between the insurrection of Jan. 6, 2021, and MAGA’s triumphant return to power, have coalesced into a troop of cinematic resistance amid the conflicts and crises defining his political era and the rightward, nationalistic turns happening broadly around the globe.\n\nAnd lest you think this is a strictly art-house phenomenon, edgy political fare has made it to the megaplex too. In his blockbuster “Sinners,” a gorgeous revenge fantasy worthy of Quentin Tarantino, Ryan Coogler took a broader view of America’s problems. This big-budget horror film, which raked in $368 million, imagined a pair of Black brothers in 1932 facing off against the vampires (actual vampires, in this case) of white supremacy.\n\nJames Gunn took on the destructive influence of the world’s billionaires with his loopy, overstuffed “Superman,” which made $617 million this summer. Its villain, the erstwhile Lex Luthor (Nicholas Hoult), will sound familiar: He’s a megalomaniac inventor manipulating a corrupt federal government. Along the way, the movie also looks at xenophobia, foreign misadventures and online disinformation — no wonder our critic called it a pro-immigration, anti-Trump blockbuster.\n\n“Superman” is also mordantly funny in places, but then, contemporary politics have taken a darkly comic turn. Did you ever imagine a president would post an AI video showing him dumping excrement on protesters, say, or take a wrecking ball to the East Wing of the White House without warning? No film this year leaned harder into the almost cartoonish nihilism in Washington than the sci-fi satire “Mickey 17.” Its villains, an interstellar CEO (Mark Ruffalo) and his wife (Toni Collette), were so on-the-nose, the movie was hard to watch. That may explain why the March release, from “Parasite” director Bong Joon-ho, didn’t break even with its modest $133 million haul.\n\nHollywood, of course, has a famously liberal bias; and the best of the year’s resistance films will romp during awards season even if they weren’t box-office juggernauts. Certainly there have been other recent films about less charged topics: “Sentimental Value,” “Hamnet” and “Frankenstein” are three acclaimed movies that don’t get anywhere near contemporary politics (they describe more intimate family struggles) and ought to win their share of awards. But more and more filmmakers are responding to the urgency of world events with movies that have an urgent, starkly political point of view.\n\nFor my money, the two must-see political films this year are Kleber Mendonça Filho’s “The Secret Agent” (in theaters Nov. 26), about a man on the run from Brazil’s military regime in the 1970s, and “It Was Just an Accident,” shot in secret in Tehran by Jafar Panahi. They stand out partly because they don’t take on the corrupt regimes directly. No generals or mullahs appear in these films. They’re focused instead on how we ourselves change living under authoritarian systems.\n\n“Accident” is especially devastating. Vahid (Vahid Mobasseri), who spent time in jail, abducts Eghbal (Ebrahim Azizi), whom he suspects tortured him there. Vahid can’t be 100% sure he’s got the right guy — he was blindfolded in prison — so he searches for other victims to corroborate the man’s ID and help him decide how to repay him. What does justice look like in such a world? What do we ourselves begin to look like?\n\nFrom the Yellow Brick Road to a dusty highway outside Tehran, something is going on. As corporations, universities and news media are criticized for cowering in fear, filmmakers are getting more emboldened. Their movies share the same insistent message: Wake up, world.\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.","summary":"Filmmakers the world over are stepping into the breach.","url":"https://www.bostonherald.com/2025/11/25/resistance-cinema/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/202511211313MCT_____PHOTO____ENTER-MOVIE-WICKED-RESISTANCE-FILMS-2-MCT-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-25 18:28:20","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","category":"politics","source_country":"us","sentiment":0.231},{"id":382315654,"title":"Conservative warns of GOP 'shellacking' in midterms over Trump’s inflation lies","text":"National Review senior political correspondent Jim Geraghty says there are people in the White House crafting “a solid, fact-based message” on rising inflation concerns. But President Donald Trump isn’t one of them.\n\n“When Trump talks about the economy, he prefers to insist that the problems are already solved,” said Geraghty, citing Trump boasting of a “golden age of America” at a November summit and claiming to have “stopped inflation in its tracks” in the nine months since he took office.\n\nBut this is not the reality for many Americans, said Geraghty, adding that in November, Americans “metaphorically grabbed candidates by the lapels and shook them, screaming that the cost of living was still too high, and they felt squeezed in every direction, month after month.”\n\n“So, no, this is not a great time for the president to contend that gas prices are close to two dollars a gallon, or that we’re living in a golden age, or that ‘affordability’ is some new word, or that inflation has been stopped in its tracks, or that ‘prices are coming down and all of that stuff,’” Geraghty said. “It’s been a long time since President Trump pumped his own gas or shopped for his own groceries, if he ever has.”\n\nGeraghty admitted that there are Americans out there “who voted for Donald Trump because they really wanted to see Jim Comey and Tish James punished,” as well as Trump voters who want to see the Pentagon investigate and punish Sen. Mark Kelly (D-Ariz.) for advising members of the military to ignore unlawful orders.\n\n“But the number of Americans with those attitudes is dwarfed by the number of Americans who voted for Trump because they thought he would make the cost of living more manageable,” said Garaghty.\n\nAccording to 2024 exit polls, 22 percent of Americans said inflation had caused their family ‘severe hardship.’ This group split in favor of Trump, 76 percent to 23 percent, said Garaghty. Fifty-three percent said inflation had caused their family “moderate hardship,” and this group split in favor of Trump, 52 percent to 46 percent. Only 24 percent of respondents said inflation had caused their family no hardship, and this group split in favor of Kamala Harris, 78 percent to 21 percent.\n\n“If the Republicans head into the midterm elections with a president who keeps insisting the economy is doing terrific and the cost of living is manageable, when the American public strongly disagrees, the GOP is going to get absolutely shellacked,” Geraghty said\n\nRead the National Review report at this link.","summary":"National Review senior political correspondent Jim Geraghty says there are people in the White House crafting “a solid, fact-based message” on rising inflation concerns. But President Donald Trump isn’t one of them.\n\n“When Trump talks about the economy, he prefers to insist that the problems are already solved,” said Geraghty, citing Trump boasting of a “golden age of America” at a November summit and claiming to have “stopped inflation in its tracks” in the nine months since he took office.\n\nBut this is not the reality for many Americans, said Geraghty, adding that in November, Americans “metaphorically grabbed candidates by the lapels and shook them, screaming that the cost of living was still too high, and they felt squeezed in every direction, month after month.”\n\n“So, no, this is not a great time for the president to contend that gas prices are close to two dollars a gallon, or that we’re living in a golden age, or that ‘affordability’ is some new word, or that inflation has been stopped in its tracks, o","url":"https://www.alternet.org/trump-inflation-midterms/","image":"https://www.alternet.org/media-library/image.jpg?id=62237190&width=1200&height=600&coordinates=0%2C417%2C0%2C418","video":null,"publish_date":"2025-11-25 17:42:33","author":"Adam Lynch","authors":["Adam Lynch"],"language":"en","category":"politics","source_country":"US","sentiment":-0.417},{"id":382156838,"title":"Nota Behn-eh II: Welcome to the League of Extraordinary Birthing Gentlemen","text":"Tennessee voters have only seven days remaining to choose wisely in the TN-07 special election. May as well ride those out by shining a spotlight on the crank Democrats chose to run in the R+10 congressional district.\n\nSo far, Aftyn Behn has made quite a name for herself as the Democrat nominee. The state legislator has had to fend off a cornucopia of unearthed statements, tweets, and videos from the past few years that paint her, as David wrote earlier, as something of a sociopath. That might have been a bonus for a political career, had it been married to an intellect that could take advantage of an utter lack of conscience. However, Behn has come across as someone who acts less out of intellect and more from regurgitation of progressive clichés woven into word salads that would make Kamala Harris jealous enough to run through an entire box of wine.\n\nFrankly, this statement from 2020 about \"birthers\" and unionization needs all the alcohol it can get, emphasis mine:\n\n2020 video of Tennessee State Rep. Aftyn Behn resurfaces:\"I think we have as birthers... men and women who can give birth... we can maybe leverage that as collective bargaining.\"pic.twitter.com/9fpfPUsMib— Defiant L’s (@DefiantLs) November 25, 2025\n\nBEHN: I think, as an organizer and as an activist, like, we really have an opportunity here in this country to talk about what kind of policy – progressive policies we want to see as young women. And I think we have, as birthers, as women who can give birth, men and women who can give birth, we can maybe leverage that as collective bargaining. That is the basis of this book that I'm not – I've just started reading called Birthstrike, and how we can really leverage collective bargaining when it comes to having children in this country. And so, for example, like, I'm not going to give birth until the United States government concedes A, B, C, D. What do you think about that?Q: Hmmm. Seems a little much.BEHN: Really?\n\nHow much insanity can one politician pack into 45 seconds of conversation? Let us count the cray-crays. First off, does Behn understand that the term \"birthers\" means something else politically in the US? Does she really want to associate herself with that?\n\nSecond: men cannot give birth. Let me state that one more time, with feeling: men cannot give birth. Females give birth. It doesn't get much more basic in biology than this fact. It does not matter what feelings men and women have; biology dictates reproductive function. If Behn doesn't know that, she's too ignorant for public office. If she does know that, then she's too interested in pandering to progressive activists to represent the voters of TN-07, who are primarily social conservatives, except for a small portion of Nashville added to the district in the 2020 redistricting.\n\nAnd we all know how Behn feels about Nashville. \n\nNext: Who in their right mind would think that the collective fertility of a league of extraordinary birthing gentlemen would have leverage over \"the United States government\"? We have a Congress to set policy, as well as a president elected by the states. That's the position Behn wants now, in fact, and that is how constitutional republics work, not through social-justice extortion. Despite Behn's inflated sense of self – part of the sociopathy David notes – no one really cares whether hyperventilating radicals procreate. In fact, a strike on the fertility front by the hard Left might provide some benefits. \n\nSpeaking of hyperventilation, the 2019 book Birth Strike focuses on using fertility for leverage over \"the hidden fight over women's work.\" That certainly seems to be at odds with Behn's weird inclusion of men as \"birthers,\" given the blurb on Amazon. However, the broader \"birthstrike\" movement is actually a climate-change protest strategy, which emerged before the book got published:\n\nPepino believes that there will be an “ecological Armageddon” and founded BirthStrike at the end of 2018. BirthStrike is a group of people who are declaring their decision not to have kids because of “the severity of the ecological crisis.” ...The BirthStrikers have decided they can’t bring children into a world facing an ecological breakdown, and where scientists predict climate change will bring bigger wildfires, more droughts, and food shortages for millions of people.In 2018, the UN International Panel on Climate Change (IPCC) warned the planet only has 11 years to prevent catastrophic climate change.“You are gambling with someone else’s life,” said Cody Harrison, a 29-year-old who recently joined the group. “If things don’t go well, that human is not going to have a very good life.”“When climate change gets worse, it multiplies other things. It’s like dominoes that are falling,” said Lori Day, another member of BirthStrike. “It goes beyond sea level rise and storms. It affects food production, migration, resources and war.”BirthStrike is one of a number of groups around the world that are questioning the ethics of having children in a warming world. Conceivable Future, a network of women in America, was founded in 2015 to bring awareness to “the threat climate change poses to reproductive justice,” although that group’s members haven’t discounted having children.\n\nThis is the same Malthusian obsession that has gripped the Left since the publication of The Population Bomb in 1968. The Smithsonian's magazine revisited Paul Ehrlich's book fifty years later, just as the Birthstrike movement began. The review recalled the book's hyperbolic predictions, and worse yet, how it drove \"human rights abuses around the world\":\n\nDriving the criticism of The Population Bomb were its arresting, graphic descriptions of the potential consequences of overpopulation: famine, pollution, social and ecological collapse. Ehrlich says he saw these as “scenarios,” illustrations of possible outcomes, and he expresses frustration that they are instead “continually quoted as predictions”—as stark inevitabilities. If he had the ability to go back in time, he said, he would not put them in the book.It is true that in the book Ehrlich exhorted readers to remember that his scenarios “are just possibilities, not predictions.” But it is also true that he slipped into the language of prediction occasionally in the book, and more often in other settings. “Most of the people who are going to die in the greatest cataclysm in the history of man have already been born,” he promised in a 1969 magazine article. “Sometime in the next 15 years, the end will come,” Ehrlich told CBS News a year later. “And by ‘the end’ I mean an utter breakdown of the capacity of the planet to support humanity.”Such statements contributed to a wave of population alarm then sweeping the world. The International Planned Parenthood Federation, the Population Council, the World Bank, the United Nations Population Fund, the Hugh Moore-backed Association for Voluntary Sterilization and other organizations promoted and funded programs to reduce fertility in poor places. “The results were horrific,” says Betsy Hartmann, author of Reproductive Rights and Wrongs, a classic 1987 exposé of the anti-population crusade. Some population-control programs pressured women to use only certain officially mandated contraceptives. In Egypt, Tunisia, Pakistan, South Korea and Taiwan, health workers’ salaries were, in a system that invited abuse, dictated by the number of IUDs they inserted into women. In the Philippines, birth-control pills were literally pitched out of helicopters hovering over remote villages. Millions of people were sterilized, often coercively, sometimes illegally, frequently in unsafe conditions, in Mexico, Bolivia, Peru, Indonesia and Bangladesh. In the 1970s and ’80s, India, led by Prime Minister Indira Gandhi and her son Sanjay, embraced policies that in many states required sterilization for men and women to obtain water, electricity, ration cards, medical care and pay raises. Teachers could expel students from school if their parents weren’t sterilized. More than eight million men and women were sterilized in 1975 alone. (“At long last,” World Bank head Robert McNamara remarked, “India is moving to effectively address its population problem.”) For its part, China adopted a “one-child” policy that led to huge numbers—possibly 100 million—of coerced abortions, often in poor conditions contributing to infection, sterility and even death. Millions of forced sterilizations occurred.\n\nBehn's not just an idiot. She's not just a potential sociopath. She's a dangerous crank, if a mildly entertaining one. Republicans need to turn out in TN-07 hard to keep this seat out of the hands of a radical nut. We can find entertainment elsewhere after next Tuesday. \n\nEditor’s Note: Every single day, here at Hot Air, we will stand up and FIGHT, FIGHT, FIGHT against the radical left and deliver the conservative reporting our readers deserve. Sometimes, however, we just point and laugh, and let the radical Left embarrass itself. This is one of those times.\n\nHelp us continue to point, laugh, and expose the idiocy of progressive elites. Join Hot Air VIP and use promo code FIGHT to get 60% off your membership!","url":"https://hotair.com/ed-morrissey/2025/11/25/nota-behn-eh-ii-welcome-to-the-league-of-extraordinary-birthing-gentlemen-n3809270","image":"https://media.townhall.com/cdn/hodl/2025/328/4b10697a-ed63-4c8a-992a-9310c8687607.jpg","video":null,"publish_date":"2025-11-25 17:40:13","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","source_country":"us","sentiment":-0.182},{"id":382150300,"title":"Historian Accuses BBC of Deleting His Line Calling Trump ‘Most Openly Corrupt President’","text":"The BBC is being accused of cutting a line from a speech that called Donald Trump “the most openly corrupt” U.S. president ever as the organization faces a possible $5 billion lawsuit from Trump over a separate dispute.\n\nThe British state broadcaster is under intense pressure after it was forced to apologize and two of its senior executives resigned over an edition of a show that stitched together two parts of the president’s Jan. 6 speech.\n\nIn a video statement, Bregman said the sentence describing Trump, 79, as “the most openly corrupt president in American history” had been taken out despite the lecture being commissioned, fully edited, and recorded before a live audience of about 500 people. \n\nA BBC spokesperson told the Daily Beast: “All of our programs are required to comply with the BBC’s editorial guidelines, and we made the decision to remove one sentence from the lecture on legal advice.”\n\nBregman—who shot to prominence with a 2019 Davos tongue-lashing about tax avoidance—has warned of an “authoritarian breakthrough” in the U.S. and a wider resurgence of fascism, themes he revisits in his new series, “Moral Revolution,” recorded in multiple cities and premiering Tuesday.\n\nHe said he was “genuinely dismayed” by what he called “self-censorship driven by fear,” adding that his lecture explores “the ‘paralyzing cowardice’ of today’s elites” in academia, business, and media. \n\nBregman framed the dispute as a test of whether big institutions will “bend the knee to authoritarianism,” while stressing his respect for BBC journalists.\n\nThe new twist comes as the BBC resists a threatened defamation suit over a Panorama program that Trump’s team warns could reach $5 billion. \n\nTrump has also gone after U.S. broadcasters on multiple occasions, including suing ABC News and George Stephanopoulos over an erroneous on-air claim the president had been found liable for “rape.” The case survived an early dismissal bid and ended with ABC agreeing in December 2024 to pay $15 million to Trump’s presidential library, $1 million in legal fees, and issue a public apology. \n\nIn July, CBS News’ parent company, Paramount, agreed to pay Trump $16 million to settle a lawsuit over the editing of a 60 Minutes interview with then-Vice President Kamala Harris.\n\nPreviously, the president filed a $475 million “Big Lie” defamation suit against CNN over coverage likening his election falsehoods to authoritarian propaganda. A federal judge dismissed the case in 2023, and an 11th Circuit panel affirmed that decision two years later.","summary":"Getty ImagesThe BBC is being accused of cutting a line from a speech that called Donald Trump “the most openly corrupt” U.S. president ever as the organization faces a possible $5 billion lawsuit from Trump over a separate dispute.\n\nThe British state broadcaster is under intense pressure after it was forced to apologize and two of its senior executives resigned over an edition of a show that stitched together two parts of the president’s Jan. 6 speech.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/historian-accuses-bbc-of-deleting-his-line-calling-trump-most-openly-corrupt-president/","image":"https://www.thedailybeast.com/resizer/v2/YZK7ZQXIVFHIXBUR5YO6I6OTOU.jpg?smart=true&auth=b4839ffd4c2d2c9851832737d7d58910aa5f95f440d0666cc5f3452ff9eddaa8&width=1440&height=1080","video":null,"publish_date":"2025-11-25 17:31:07","author":"Tom Latchem","authors":["Tom Latchem"],"language":"en","category":"politics","source_country":"us","sentiment":-0.137},{"id":382135700,"title":"Scott Jennings Tells Never-Trump Republicans To ‘F All The Way Off’","text":"Republican strategist Scott Jennings rebuked never-Trump Republicans on “After Party with Emily Jashinsky” on Monday for abandoning their supposed conservative values.\n\nSome Republicans endorsed former Vice President Kamala Harris over President Donald Trump during the 2024 presidential campaign. Jennings asserted on the podcast that Republicans’ arguments for supporting Harris were an effort to “liberalize” conservatism rather than preserve it. (RELATED: Billionaires Bankrolling Kamala Harris’ Tough-On-Crime Campaign Wanted To Defund Police, Install Soros Prosecutors)\n\n“During the 2024 campaign, I kept hearing these Republicans say things like, ‘In order to save conservatism, we have to vote for Kamala Harris.’ And as someone who had to sit out there and debate these issues every night, I could never sort of figure out why they were saying that, what they meant by that,” Jennings said. “And then I started to think about the underlying arguments they were making, the other statements they were making, and I realized that they weren’t trying to save conservatism. They were trying to liberalize it.”\n\n“A lot of these people no longer vote for any Republican. A lot of these people no longer are pro-life. A lot of these people no longer really believe in any of the conservative stuff that we have all supposedly been fighting for for the last 25 years,” he continued. “They let their personality conflicts or problems with Donald Trump completely and totally change what they claim to be fighting for. Heck, look around.”\n\nJennings particularly called out former George W. Bush administration official Nicolle Wallace, who currently is an anchor on MS NOW. She called herself a “self-loathing former Republican” during a 2021 appearance on “The Late Show with Stephen Colbert.”\n\n“We relied upon her for communications advice in the Bush White House. Now, this is somebody who built their career supposedly communicating with the American people about George W. Bush’s conservative agenda,” he said. “And now she is one of the most deranged looney tunes in American media … Did you ever believe any of it? … Bush was a conservative guy.”\n\nJennings also turned his ire on “The Bulwark Podcast” host and MS NOW analyst Tim Miller. Miller announced his departure from the Republican Party in a 2020 Substack piece after being a GOP operative, including on former Republican Florida Gov. Jeb Bush’s 2016 presidential campaign.\n\n“Tim Miller, this other looney tunes. He was supposedly a Republican operative. Now, he is one of the most liberal people in our political affairs ecosystem,” he said. “Did you ever believe any of it? And what is it about Donald Trump that made you change every single thing that you supposedly ever believed in? And I just, I don’t understand how one person could break so many supposedly smart and experienced people.”\n\n“And to this day, I still do not understand people who claim to be Republicans running around having voted for Democrats in each of the last three elections, having advocated for Democrats to win the Senate, having advocated for Democrats to win the House, having advocated for pro-abortion policies, having advocated for every liberal social crusade, and then look me in the eye and say, ‘You’re hurting conservatism by supporting Donald Trump.’ F all the way off,” he added.\n\nWhen host Emily Jashinsky laughed about Jennings’ criticism of Miller, he added more.\n\n“I don’t know if I’ve ever been around anybody who was less good at their job, but more condescending,” Jennings said. “His talent to condescension ratio is so far off it’s ridiculous.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Deranged'","url":"https://dailycaller.com/2025/11/25/scott-jennings-never-trump-republicans-f-off/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F11%2FScreenshot-2025-11-25-10.42.41-AM-e1764085440920.png","video":null,"publish_date":"2025-11-25 16:12:52","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.508},{"id":382172790,"title":"What Sports Fans Should Be Thankful for This Thanksgiving","text":"Hello and welcome to another edition of Free Agent! Don't forget to cook your turkey low and slow this Thursday—and if you get into trouble, there's always the Butterball hotline.\n\nHappy Thanksgiving! I hope your weekend is full of as much football as is appropriate for your family. We've got a shorter newsletter today, but we'll start with several reasons sports fans should be thankful for this Thanksgiving, and close with a little Thanksgiving football history.\n\nLocker Room Links\n\nThe No-Fun League strikes again: Panthers wide receiver fined $14,491 for finger guns.\nWondering why the Eagles/Bears game is at 3 p.m. on Friday instead of evening primetime? Have I got an antiquated law for you!\n\"The 2028 Olympics goes MAGA\"\nRemember when Israeli fans were banned from attending a soccer game in England? The ban was apparently based on \"fake claims.\"\nHow to win four soccer games by scoring one goal, total.\nThis kind of milquetoast congratulatory word salad is why Kamala Harris lost.\nBill Belichick's girlfriend, Jordan Hudson, says she's suing journalist and podcaster Pablo Torre.\nElsewhere in Reason: \"Mamdani Understands Something About Trump That European Leaders Don't\"\nTempting, but I'm still a hard no.\n\nPeople don't know the upside of invading Venezuela and making it the 51st state. If done quickly, it would make the U.S. prohibitive favorites in the World Baseball Classic next March. https://t.co/xUPAAQoxES\n— Ben Jacobs (@Bencjacobs) November 23, 2025\n\nGive Thanks\n\nIt's tough to admit, but as a sports fan I sometimes get a little overwhelmed by all the action I'm trying to keep up with. This weekend it was the NFL, college football, Formula 1, F1 Academy, Premier League soccer, and the National Women's Soccer League title game—with a little bit of college hockey, NHL, and the PGA Tour on the side. But whenever I get overwhelmed, I also feel thankful: I think back a few short years ago to the beginning of the pandemic, when all we had to watch for two months was classic replays, online racing simulators, documentaries, and marble races.\n\nWe've come a long way in the last five years, and have even more to watch now than we used to. Live sports are the absolute hottest commodity in TV, and major events are cultural cornerstones. More and more leagues are starting up, confident they can turn a profit off our attention (just look at the ability of the United Football League, TGL (TMRW Golf League), and Unrivaled women's basketball to make it past their first seasons).\n\nCapitalism has blessed us with the ability to watch almost any game we want, whenever we want, and wherever we are. If you want to stream the second half of North Dakota against Hawaii in basketball at 1 a.m. while you ride the night bus to New York City, you can do that thanks to the ESPN app and a monthly subscription.\n\nWe even get to watch and play sports on holidays. Thanksgiving and football go hand in hand. Turkey trot 5Ks are on the rise. The NBA dominated Christmas until the NFL came along, while college football gets to dominate New Year's Day. And everyone in the family gathers around the TV after dinner on Christmas Eve to watch the Hawaii Bowl (OK, maybe that's just my brothers).\n\nEven if we can't be thankful for the current state of our favorite teams, we can be thankful for the memories we've created because of them, the connections to family and friends that they've fostered, and the hope they give us that glory is always around the corner.\n\nSpeaking of being thankful, everyone who likes watching football on Thanksgiving can express thanks to my Detroit Lions. \"The Lions weren't the first team to play on Thanksgiving, and football on Thanksgiving didn't even start with professionals,\" I wrote in 2020 for the Washington Examiner. \"But the Lions did bring Thanksgiving football to the masses.\"\n\nIt started in 1934, their first season in Detroit. Owner George Richards also owned a major radio station in Detroit. \"Knowing the publicity potential of radio, Richards along with NBC Radio, set up a 94-station network to broadcast the Lions-Bears showdown,\" the Pro Football Hall of Fame says. It was a huge game too, with the Lions coming in at 10-1 and the Bears undefeated.\n\nUnfortunately, like most of their Thanksgiving games, the Lions did not prevail. But a major tradition was born. (The Cowboys didn't join the feast until 1966, and they took a couple years off in the '70s.)\n\nWhen the Lions were bad (year after year, after year after year, after year after year), there was a lot of moaning from football fans about the hapless, mismanaged Lions getting such a great time slot. But as CBS' Jim Nantz once told Sports Illustrated, \"The ratings are probably going to be the same no matter what the matchup was in that window….The ratings will not plummet. It's just part of the Thanksgiving tradition.\" For example, as I noted in that Examiner piece, the 2019 game was one of the league's top-five most-viewed games that year, even though it had a bad Lions team playing a bad Bears team. Neither was a playoff hopeful.\n\nWhat's surprising is that the NFL put the Packers in the Thanksgiving game this year against the Lions, along with the Chiefs against the Cowboys. They could have put the Lions or Cowboys up against awful teams, and for TV purposes it wouldn't have mattered because the game gets great ratings no matter who's playing.\n\nFor that time-honored tradition, you can thank the Lions.\n\nReplay of the Week\n\nAs much as I would love to just post \"North London is red\" and leave it at that, you can all laugh at UCLA instead.\n\nUCLA tried a blind pitch fake FG and it worked about as well as you'd expect pic.twitter.com/YhpQXRzHij\n— CJ Fogler ???? (@cjzero) November 23, 2025\n\nThat's all for this week. Enjoy watching the real game of the weekend, Michigan State against Stanford in the NCAA Women's Soccer Tournament quarterfinals.","summary":"Capitalism has blessed us with the ability to watch almost any game we want, whenever we want, and wherever we are.","url":"https://reason.com/2025/11/25/what-sports-fans-should-be-thankful-for-this-thanksgiving/","image":"https://reason.com/wp-content/uploads/2025/11/11-24-25-v1-a-1-1200x675.jpg","video":null,"publish_date":"2025-11-25 16:00:06","author":"Christian Britschgi,Jason Russell","authors":["Christian Britschgi","Jason Russell"],"language":"en","source_country":"us","sentiment":0.131},{"id":382104778,"title":"Roger Marshall targets Netflix but not Paramount in Warner Bros. deal. Why? | Opinion","text":"What does Sen. Roger Marshall have against Netflix? And why does it matter?\n\nThe junior senator from Kansas last week wrote to the Justice Department, expressing “serious concern” that the streaming giant is bidding for Warner Bros. Discovery, the media conglomerate that includes both the legendary movie studio as well as famous brands such as HBO, Food Network and — this might be most important for our purposes — CNN, the cable news network. More about that later.\n\n“If a deal comes to fruition,” Marshall wrote to the government’s top lawyers, “I ask that you act decisively to prevent further anticompetitive consolidation in the entertainment industry.” (He published the letter in a press release.)\n\nNetflix is reportedly bidding only for WBD’s movie studio and streaming services. If that deal succeeds, Marshall wrote, Americans might get fewer movies to see at their local multiplex. That in turn would harm “thousands of workers whose jobs depend on a robust and diverse pipeline of film and television projects.”\n\nSo far, so good.\n\nMore media consolidation “threatens consumer welfare, market dynamism, and the diversity of creative expression that is essential to a healthy democratic society,” Marshall concluded. He asked the DOJ to “evaluate carefully” any Netflix-WBD deal “to act decisively to prevent anticompetitive consolidation in this vital sector.”\n\nHere’s the thing: Marshall is right. Too many major media properties are in too few hands.\n\nThe problem? You wouldn’t know it from Marshall’s letter, but Netflix isn’t the only company bidding for all or part of Warner Bros. Discovery. So are cable giant Comcast and — more important — Paramount. Both of those companies should also have antitrust problems if they take control of WBD. Media consolidation is media consolidation, after all.\n\nWhy isn’t Marshall asking the Justice Department to scrutinize those bids?\n\nIt is here we note that Paramount is largely owned by billionaire Larry Ellison. Who just happens to be President Donald Trump’s good buddy.\n\nCBS News, TikTok, CNN\n\nWouldn’t you know it: The Guardian reported last week that Ellison has already been in talks with the White House about his bid to take over WBD, reportedly musing about firing CNN anchors “whom Donald Trump is said to loathe, including Erin Burnett and Brianna Keilar.”\n\nWhich means the takeover fight is about more than a “diverse pipeline of film and television projects.” It is also — and perhaps mostly — about control of one of America’s most-watched news networks, and about making our thin-skinned president happy with the picture of himself he sees on cable TV.\n\nTrump-friendly Fox News, Newsmax and One America News Network aren’t enough, apparently.\n\nOf note: Ellison and his son David acquired control of Paramount earlier this year. And Paramount owns CBS, which in turn owns CBS News.\n\nYou might have heard about some of the pre-merger maneuvering. Ahead of the deal, Paramount’s previous owners settled a lawsuit Trump brought against CBS’ “60 Minutes” for its interview of then-Vice President Kamala Harris — a lawsuit most legal observers said was without merit — in an apparent attempt to ease the federal government’s regulatory scrutiny of the deal.\n\nAfter the takeover, the Ellisons installed Bari Weiss — an “anti-woke” journalist with no significant television experience — to run CBS News. She has reportedly looked at putting Fox News anchor Bret Baier in the chair once held by Walter Cronkite.\n\nOne more thing: Trump has also talked about handing control of the American version of TikTok (where a lot of young Americans get their news, believe it or not) to … Larry Ellison.\n\nMedia consolidation indeed.\n\nIf you think this all seems reminiscent of Hungary, where strongman Viktor Orbán helped put his country’s media in the hands of a few regime-friendly oligarchs to create what the Associated Press called a “sprawling pro-government media empire,” well, you’re not alone.\n\nSilence from Marshall’s office\n\nWhich brings us back to Roger Marshall and his crusade against Netflix.\n\nI had three questions for his office: Does the senator plan to also oppose a Paramount-Ellison purchase of WBD? If not, why not? And if not, what’s the difference?\n\nI emailed Marshall’s press shop. I also emailed a couple of officials in his office directly. And then I left a phone message — though I never talked to an actual human to do so.\n\nNobody responded.\n\nSo let’s acknowledge the possibility that Marshall has a very good reason for opposing Netflix’s bid for WBD while remaining silent on Paramount’s effort. Maybe he has a good explanation for how that stance serves his Kansas constituents. If so, I’d still love to hear it.\n\nOtherwise, it appears that — intentionally or not — Marshall’s letter has the effect of putting a thumb on the scale against Netflix’s bid and for Paramount’s. And that thumb — coincidentally or not — just happens to coincide with the president’s apparent inclinations about what Americans get to see and hear.\n\nDraw your own conclusions.","url":"https://www.kansascity.com/opinion/readers-opinion/guest-commentary/article313100793.html","image":"https://www.kansascity.com/public/latest-news/omtehg/picture313099239/alternates/LANDSCAPE_1140/roger%20marshall.jpg","video":null,"publish_date":"2025-11-25 15:13:56","author":"Joel Mathis","authors":["Joel Mathis"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.131},{"id":382105714,"title":"Media Goes on Offense as Trump Steps Up His War on Journalism","text":"When Elon Musk called the New York Times “government-funded media” in February after his Department of Government Efficiency identified government media subscriptions, the storied outlet didn’t take the criticism lying down.\n\nThe Times responded on X with a bulleted statement explaining the nature of those subscriptions. After Donald Trump attacked the paper in April for a line in a story that noted how legal experts have called his CBS lawsuit “baseless,” saying the Times should be held liable for its “likely unlawful behavior,” the paper said his comments were the latest in “a long list of legal threats aimed at discouraging or penalizing independent reporting about the administration.”\n\nThe Times’ proactive approach stands in contrast to journalists who traditionally let their work stand on its own, and it underscores the shifting environment of a media business under more scrutiny than ever. While mistakes in the past may have once been relegated to a corrections section, the stakes are now much higher, with the wrong words igniting a social media frenzy, or drawing legal threats from the president. \n\n“Letting the journalism speak for itself is an approach from a bygone era,” Patrick Healy, the Times’ assistant managing editor for trust and standards, told TheWrap. “Our audience is understandably asking really tough questions about why and how we publish what we publish — that’s fair, and I think we want to do a better job of opening up our process and how we work in that regard.”\n\nThat defense of proper journalism is critical at a time when mistakes can have devastating consequences. The BBC’s mangled editing of Trump’s Jan. 6 speech in a 2024 documentary prompted him to threaten a lawsuit for somewhere between “$1 billion to $5 billion.” The Times of London, meanwhile, was embarrassed last month after claiming to quote former New York City Mayor Bill de Blasio railing against mayoral candidate Zohran Mamdani — only to apologize for mistakenly quoting a different man with the same name. De Blasio later questioned whether the Rupert Murdoch-owned U.K. outlet had “abandoned meaningful journalistic standards and ethics.”\n\nAll news organizations have protocols for assessing the veracity of what they publish, though the administration of standards can range from handling grammatical and style matters to CNN’s “triad” approach, which includes a trio of newsroom editors, lawyers and standard-specific editors who drill into a story before it runs. Though integral to newsrooms, standards can be part of the business, with outlets having different practices and processes, and several declined to discuss their specific approaches.\n\nBut today’s perilous legal environment has forced news organizations to be extra-cautious in buttoning up copy and upholding already high standards, while also being willing to defend their journalism in new ways. Several outlets, including the Times, the Wall Street Journal and the Guardian U.S., opened up with TheWrap about operating in a second Trump era and in an era of declining trust in the mainstream media. \n\nAnd while accuracy is important, Healy said, it’s also about “making really public statements, comments on social media and elsewhere, defending our journalism, explaining our journalism, standing up for our reporters and other journalists when they come under attack.”\n\nThe new battleground\n\nIn September, Trump sued the Times and three of its reporters for $15 billion for libel over a series of stories the paper published about the president, his family and his businesses, mostly in the years before his second term.\n\nHealy reiterated the Times’ position that Trump’s lawsuit against the paper has “no merit,” characterizing it as “an attempt to stifle independent reporting and generate PR attention.” But he said such tactics informed the Times’ public approach to handling attacks on its journalism, recognizing that news organizations are facing greater scrutiny from a public inherently distrustful of the outlets that produce the news.\n\n“We’re just very aware of the pressure campaigns and activists from all sides who want the news media to referee and the Times to bend our standards and change our language in their favor, and President Trump and his administration are a big part of that,” Healy said. \n\nTrump’s camp, however, remains consistent in its attack on media.\n\n“President Trump is committed to continue holding those who traffic in lies, deception and fake news accountable for their reckless and politically motivated efforts to defame him and the MAGA movement,” a spokesperson for the president’s outside legal team told TheWrap.\n\nIn this litigious climate, how a news organization commits to its standards department is of new relevance. After a year of legal turmoil over its editorial policies, CBS News lost its head of standards, Claudia Milne, in October in the wake of Bari Weiss’ appointment as its editor-in-chief. \n\nWeiss has since considered dismantling the network’s standards department for “holding too much power,” according to the Independent, after CBS News axed its race and culture unit during layoffs last month. Both departments questioned CBS News anchor Tony Dokoupil’s handling of an interview with writer Ta-Nehisi Coates over the Israel-Gaza conflict, prompting Weiss to defend him in a Free Press editorial last year.\n\n“She also asked openly, ‘What’s the point of standards?’” a CBS News source told the Independent. (CBS News did not respond to a request for comment on its plans for its standards department.)\n\nHealy wouldn’t discuss Weiss’ management of CBS News’ standards department. But he said the Times has increased its standards desk by roughly 10 editors over the last several years. “The standards desk has grown just as the work has grown commensurate with the newsroom expanding,” Healy said.\n\n“Other news organizations are going to make their choices,” Healy added. “I really can’t pass judgment there, but I know for us, standards are core to what the Times does, and having an organized and robust standards desk of really excellent editors is essential to our journalism.”\n\nThe Guardian U.S. has also been “doubling down” on its commitment to its newsroom standards, deputy editor for news Paul Harris told TheWrap. Harris said the U.K.-based paper’s U.S. edition had already maintained a high bar for accuracy — ”We’re not a casual news organization at the best of times, and we’re super not a casual news organization now” — but the president’s hostility toward the press forces the Guardian to work to prevent those who see it as a “political enemy” from latching onto mistakes.\n\n“There’s obviously no doubt that Trump does see the press as the enemy of the people, and the Guardian, as a proudly progressive news organization, is probably not his favorite,” Harris said. “So we would have high newsroom standards anyway, for ethical reasons, but there is now a very solid, obviously practical reason to have them as well.”\n\nHarris said the paper has “definitely” been conducting more legal reviews of its stories than it did in the past, ensuring it was “more careful” in making sure its work stood up to scrutiny. It is also one of the few outlets that continues to employ a public editor, which it calls its “readers’ editor,” to serve as its internal conduit for its audience to scrutinize the newsroom’s reporting and hold it accountable for mistakes. \n\n“We deal with them all the time,” he said. “Sometimes in ways that, as a head editor, you’re on the wrong end of, but that’s just the way it is and it’s also the way it should be.”\n\nThe Journal’s stories aren’t generally receiving additional legal scrutiny, said Elena Cherney, the paper’s head of standards and ethics, but reporters continue to have access to legal advice in the course of their reporting. She said the paper’s ethos of reporting all sides of a story and getting as much information on the record was its north star, one that dated back to when she first started at the Journal in 2000.\n\n“Even then, many other news organizations didn’t expect the same level of reporting rigor from reporters as the Journal did and still does,” she wrote in an email. “Our standards put a big onus on our journalists to go the extra mile.”\n\nTrump continues to issue threats, suggesting in September that he might sue ABC for airing late night host Jimmy Kimmel, and last week called for the host to be fired. He has yet to file a lawsuit against the BBC, though he signaled it would be soon; a spokesperson for the legal team did not answer questions on the lawsuit’s timing. In its apology to Trump last week over the documentary’s editing, the BBC said it believed there was no basis for a defamation claim.\n\nHarris said his paper would remain undeterred in covering the Trump administration, though he noted that even if news organizations report accurately, they could still face legal action. “If the White House wants to come for you, it will anyway,” he said. “It doesn’t necessarily need you to have got your facts wrong to launch a multibillion-dollar lawsuit.”\n\n“The ultimate goal is to kill reporting”\n\nThere’s a reason Trump isn’t hesitating to file one lawsuit after another: He’s been successful at putting various media outlets on their heels.\n\nThe president in December extracted a $16 million settlement from Disney from his defamation suit last year against ABC and George Stephanopoulos, in which the president took issue with Stephanopoulos’ on-air claim that a jury found Trump liable for “rape” instead of its actual finding of “sexual abuse,” a legal distinction in New York. \n\nTrump likewise got a $16 million settlement in July from CBS-parent Paramount over a lawsuit related to how “60 Minutes” edited a Kamala Harris interview, a move critics saw as the company paving the way for regulatory approval of its merger with Skydance. \n\nThe two settlements, paid toward his impending presidential library, appear to have emboldened Trump in his quest to fight news organizations over unflattering stories, forcing companies to shell out millions and alarming media law experts in the process. \n\nThe ultimate goal is to kill reporting and to kill journalism that is less favorable to him.” – Katie Townsend, former Reporters Committee for Free of the Press deputy executive director\n\n“You’re inflicting pain by engaging in the lawfare, whether or not the outcome is ultimately in your favor,” said Katie Townsend, a Gibson Dunn partner and the former deputy executive director and legal director for the Reporters Committee for Freedom of the Press. “Donald Trump is very smart about that. He realizes it would ensure pressure, it’s a way to inflict pain, and the ultimate goal is to kill reporting and to kill journalism that is less favorable to him, that’s more critical to him and his administration and his administration’s policies, and that’s the end game.”\n\nAs The Wall Street Journal in July prepared to publish details of an alleged letter Trump sent to Jeffrey Epstein within a sketch of a woman’s nude body for the financier’s 50th birthday, Trump reportedly told the paper he would sue them “just like I sued everyone else.” A day after the story broke, Trump sued the paper and its owner, Rupert Murdoch, for $10 billion for defamation. (The House Oversight Committee in September released the letter allegedly penned by Trump.) \n\nWhile the Journal wouldn’t comment on the president’s lawsuit, Cherney said it remained undeterred in its coverage of the second Trump era, which has produced a string of scoops. (A Dow Jones spokesperson has previously said the paper has “full confidence in the rigor and accuracy of our reporting, and will vigorously defend against any lawsuit.”)\n\n“It’s less about having rigid standards and more about upholding our existing high standards, which have always been about maintaining reader trust in the fairness and accuracy of our newsgathering,” Cherney wrote in an email. \n\n“Practices like our commitment to ‘no surprises’ journalism, which means we seek to provide a chance for full and fair comment before we publish a story, stand us in good stead at a moment when journalistic practices are under a microscope.”","summary":"News outlets explain their work and seek legal backing while facing unprecedented pressures: \"The ultimate goal is to kill reporting and to kill journalism that is less favorable to him,” says one expert \n\n\nThe post Media Goes on Offense as Trump Steps Up His War on Journalism appeared first on TheWrap.","url":"https://www.thewrap.com/trump-nyt-wsj-guardian-lawsuit-threat/","image":"https://www.thewrap.com/wp-content/uploads/2025/11/112425-Trump-and-News-Outlets-v2.jpg","video":null,"publish_date":"2025-11-25 14:00:00","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","category":"politics","source_country":"US","sentiment":-0.215}]}