{"offset":0,"number":50,"available":479,"news":[{"id":308112116,"title":"Mark Cuban weighs in on transgender athletes in women's sports: 'People just aren't ready'","text":"Dallas Mavericks minority owner and \"Shark Tank\" host Mark Cuban gave his take on transgender athletes in women's sports this week. During an interview on \"The Stephen A. Smith Show\" Friday, Cuban suggested trans inclusion should not be \"pushed down people's throats.\" \"To make it a national issue so that if you weren’t supporting the fewer than 10 trans athletes in the NCAA, then you weren’t a good person. People just aren’t ready for that yet. You've got to meet people where they are,\" Cuban said. \"It takes time, you can’t just force it down people’s throats.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Cuban also suggested people affected by transgender inclusion policies in sports should not be used in political campaigns. \"Instead of trying to get where the people who are being disadvantaged and being discriminated against are helped, they wanted to make it a campaign issue,\" Cuban said. \"Focus on helping the people, not using them to campaign.\" A national exit poll conducted by the Concerned Women for America legislative action committee found that 70% of moderate voters saw the issue of \"Donald Trump’s opposition to transgender boys and men playing girls' and women’s sports and of transgender boys and men using girls' and women’s bathrooms\" as important to them. WHO IS STEPHANIE TURNER? WOMEN'S FENCER WHO KNELT TO PROTEST TRANS OPPONENT AND IGNITED GLOBAL AWARENESS Additionally, 6% said it was the most important issue of all, while 44% said it was \"very important.\" Cuban also suggested he supports women athletes who choose not to compete against transgender competitors, saying the decision of whether to compete against trans athletes should be left up to the athletes themselves. \"My attitude is if there’s a trans athlete, no matter what side, you let the opponent — whether it’s an individual sport or a team sport — you let them decide if they want to compete against them or not,\" Cuban said. CLICK HERE TO GET THE FOX NEWS APP Cuban, a staunch supporter of former President Joe Biden and former Vice President Kamala Harris and an impassioned critic of President Donald Trump, is one of the many prominent left-wing figures who have spoken out against the Democratic Party's stance on trans athlete inclusion. Smith has repeatedly called out the Democratic Party for its stance on trans athletes, suggesting it played heavily into its defeat in the November election. HBO host Bill Maher has also criticized Democratic support for trans inclusion in women's sports. Even Democratic lawmakers like Rep. Seth Moulton, D-Mass, and former Montana Sen. Jon Tester have spoken out against the party's current stance. A New York Times/Ipsos survey found the vast majority of Americans, including a majority of Democrats, don't think transgender athletes should be permitted to compete in women's sports. Of the 2,128 people who participated, 79% said biological males who identify as women should not be allowed to participate in women's sports. Of the 1,025 people who identified as Democrats or leaning Democrat, 67% said that transgender athletes should not be allowed to compete against women. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Dallas Mavericks minority owner Mark Cuban gave his take on the issue of trans athletes in women&apos;s sports in an interview on &quot;The Stephen A. Smith Show.&quot;","url":"https://www.foxnews.com/sports/mark-cuban-weighs-trans-athletes-womens-sports-people-just-arent-ready","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/mark-cuban-campaigning.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-06 00:23:07","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":-0.166},{"id":308104618,"title":"'Hands Off!' Protesters on Why They Are Rallying Against Trump and Musk","text":"Thousands of protesters packed Manhattan's Fifth Avenue on Saturday in a sweeping show of opposition to the Trump administration, joining the nationwide \"Hands Off!\" movement targeting President Donald Trump and billionaire Elon Musk.Why It MattersThe protests were among more than 1,200 coordinated across the United States on Saturday, organized by \"Hands Off!\" a grassroots movement supported by civil rights groups, labor unions, and advocacy organizations.Protesters primarily targeted the president and Musk for actions taken during the early months of the second Trump administration, criticizing mass federal layoffs, immigration crackdowns, and U.S. involvement in the conflicts in Ukraine and Gaza.In addition, hundreds of people in European cities—including Frankfurt, Berlin, London, Lisbon and Paris—took to the streets in solidarity with American protests.What To KnowFifth Avenue became a river of protest on Saturday, as thousands marched through Midtown Manhattan in one of the largest coordinated demonstrations of the year. Chanting, waving flags, and holding handmade signs, the crowd stretched nearly 20 blocks.Organizers said more than 600,000 people had signed up to participate in protests across the country. In New York City, the rally began at Bryant Park around noon, with demonstrators marching down Fifth Avenue through Madison Square Park.Protesters carried signs opposing cuts to Social Security and Medicare, demanding protections for immigrants and civil rights, and condemning federal downsizing efforts led by Musk's Department of Government Efficiency (DOGE).Some demonstrators waved American flags and held cardboard signs with clever slogans. One read, \"Billionaires are attacking fed workers for protecting you.\" Another declared, \"This is what democracy looks like.\"Early in the protest, many participants hesitated to speak on the record out of fear of retaliation. But as the afternoon continued, people began to open up.\"This is what we're standing out here in the cold for,\" Frank Hickey, a former police officer who lives in Manhattan, said. \"This is what we're getting fallen arches and stiff backs for—and I think it's important.\"Hickey, who previously volunteered in Ukraine teaching self-defense and leading a book club, called the protest \"an extension of the lawlessness of the Trump regime.\"Some protesters focused on single issues—such as defending Medicare or Social Security—while others voiced broader opposition to the Trump administration and the Make America Great Again (MAGA) movement. Musk was also a frequent target. Several signs demanded his \"deportation,\" while others denounced the influence he's had on the Trump administration since the campaign.Musk, who was born in South Africa, moved to the U.S. in 1992 to attend college. He initially entered the country on an Exchange Visitor Visa before transitioning to a work visa and eventually gaining citizenship.Kailani, a 26-year-old graduate student from the Bronx, said she feared the collapse of constitutional safeguards. \"The most concerning thing is the blatant disregard of the court orders that have been issued,\" she said. \"The checks and balances are not working and are being actively destroyed.\"Though largely peaceful, the protest saw a brief confrontation in Madison Square Park between an anti-Trump marcher and a Trump supporter. Police quickly stepped in. The pro-Trump counterdemonstration remained small.One of the Trump supporters involved in the altercation, Brian, said he attended the protest to push back against what he described as cultural confusion and societal decline.\"You've got people with cat litter boxes in schools. It's a bunch of brain syndrome,\" he said. \"Life isn't about grown men's feelings. If nobody ever gave a s*** about my part of life, why should I care about yours?\"He added: \"No politician is good, but there are politicians that are worse than the other ones. At some point you got to take a stand.\"The New York protest wound down by 6 p.m., with some groups staying behind to chant and speak out against what they described as \"the destruction of our government and our economy for the benefit of Trump and his billionaire allies,\" as one protester told Newsweek.Earlier this week, Trump announced global sweeping tariffs that have rattled global and domestic markets, with Wall Street tanking over the past few days, marking the worst days for the U.S. stock markets since 2020.What People Are SayingThe Hands Off! mission statement articulates specific grievances: \"They're dismantling Social Security and Medicare—forcing seniors and disabled Americans to jump through hoops to access the benefits they've already paid into. They're handing trillions to billionaires—while forcing the rest of us to pay higher prices for food, rent, and healthcare.\"President Donald Trump told Fox News in February: \"Social Security won't be touched, other than if there's fraud or something... It's going to be strengthened... Medicare, Medicaid, none of that stuff is going to be touched.\"Former Vice President Kamala Harris wrote on X, formerly Twitter, on Saturday: \"Today, in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed.\"Trump has distanced himself from Project 2025 and previously called parts of the 900-page guideline spearheaded by The Heritage Foundation \"ridiculous and abysmal.\" However, he has brought on some individuals associated with it into his administration.What Happens Next?Organizers hope the nationwide protests will sway lawmakers on issues such as voting rights, social services, and economic policy.","summary":"Protesters targeted Trump and Musk over federal layoffs, immigration crackdowns, and U.S. involvement in Ukraine and Gaza, among other issues.","url":"https://www.newsweek.com/hands-off-protesters-why-they-are-rallying-against-trump-musk-2055931","image":"https://d.newsweek.com/en/full/2621809/new-york-city-hands-off.jpg","video":null,"publish_date":"2025-04-05 23:25:42","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.054},{"id":308095798,"title":"Trump-Stronghold The Villages in Florida Holds Large 'Hands Off!' Rally","text":"Nearly 2,000 residents of the retirement community known as The Villages, 20 miles south of Ocala, Florida, joined thousands across the United States in a \"Hands Off!\" protest against President Donald Trump and one of his top advisers, billionaire Elon Musk, a spokesperson for the mobilizing coalition told Newsweek on Saturday.Why It Matters \"Hands Off!\" is a grassroots movement and coalition of hundreds of organizations and mobilizers who want the Trump administration, including Musk, who heads the Department of Government Efficiency (DOGE) to take their \"hands off\" of Social Security, federal jobs, Medicaid, and more. Trump said in a February Fox News interview that Social Security, Medicare, and Medicaid benefits, will not be \"touched\" unless \"there's fraud or something.\"The protests are taking place just days after Trump's global sweeping tariffs which have rattled global and domestic markets, with Wall Street tanking over the past few days, marking the worst days for the U.S. stock markets since 2020.The Villages, located in Central Florida, is a Republican stronghold, making it notable that demonstrations are taking place there against the GOP president, who has deep ties to Florida through real estate investments and political allies.The Villages is primarily represented by Republican Representative Daniel Webster of Florida's 11th Congressional District. Newsweek has reached out to Webster's press team for comment via email on Saturday.What To Know The Villages is a predominantly white retirement community for residents aged 55 and older that spans three Central Florida counties, Lake, Sumter, and Marion. All three counties voted comfortably for Trump in 2024: Marion at 65 percent, Lake at 62 percent, and Sumter at 68 percent.A spokesperson for \"Hands Off!\" estimated that approximately 2,000 people in The Villages participated in the nationwide protests on Saturday. Democratic congressional candidate Barbie Harden Hall, who is running to represent Florida's 11th congressional district, which includes The Villages posted video of protests, writing that \"more than 1,500 came out today,\" with clips showing dozens of residents in golf carts lined up with signs protesting the president and Musk.More than 1,200 \"Hands Off!\" demonstrations across all 50 states were planned for Saturday, with a handful taking place in Europe as well. Local protests are being organized by advocacy groups, civil rights groups, labor unions, and various election and democracy activists, among others. Large crowds of protesters filled the streets in major cities across the country, including Boston, New York, Chicago and Washington, D.C., with many demonstrating despite the rain.The organization calls upon local advocacy groups and organizers to mobilize people to speak up against the administration, writing: \"Donald Trump and Elon Musk think this country belongs to them. They're taking everything they can get their hands on and daring the world to stop them. On Saturday, April 5th, we're taking to the streets nationwide to fight back with a clear message: Hands off!\"The website notes that a \"core principle\" of the protests is \"nonviolent action,\" and urges protesters to \"act lawfully\" at the events.During the 2024 presidential campaign, then-Vice President Kamala Harris, the Democratic nominee, campaigned in The Villages, where videos showed dozens of golf carts displaying support for her campaign.A handful of Trump-supporting cities held \"Hands Off!\" protests on Saturday, including Rome, Georgia, where 70 percent of county voters backed Trump's 2024 presidential bid, Midland, Michigan, where 56 percent supported him at the polls last November, and Little Rock, Arkansas, located in a county where 70 percent voted for Trump.Protests also took place across Florida, where Trump is a resident and frequently visits his golf course and Mar-a-Lago estate.What People Are Saying A \"Hands Off!\" spokesperson told Newsweek in a phone interview on April 5: \"The goal is hands off. You don't see this kind of turn out from folks unless people are frustrated, upset about what their government is doing...Hands off all the things that they [the government] is trying to take away in order to give billionaires tax cuts.\"Roxey Nelson, 1199SEIU Florida Executive Vice President, told Newsweek in a Saturday email: \"When hundreds of thousands turn out in top GOP stronghold areas across the country, it's not just a rally—it's a reckoning. The base is shifting, and the Administration should take notice.\"President Donald Trump told Fox News in February: \"Social Security won't be touched, other than if there's fraud or something...It's going to be strengthened... Medicare, Medicaid, none of that stuff is going to be touched.\"What Happens Next A \"Hands Off!\" spokesperson told Newsweek that the coalition anticipates upwards of 1 million people to partake in events across the world.","summary":"The Villages, a Republican-leaning community in Florida, joined more than 1,200 protests against Trump and Musk on Saturday.","url":"https://www.newsweek.com/trump-stronghold-villages-florida-holds-large-hands-off-rally-2055912","image":"https://d.newsweek.com/en/full/2621783/florida-protests.jpg","video":null,"publish_date":"2025-04-05 22:08:32","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"US","sentiment":0.062},{"id":308099724,"title":"We went to the anti-Trump protests. Here's what surprised us the most.","text":"Last week, nationwide protests targeted Elon Musk for his role in dismantling government agencies and firing federal workers through the White House DOGE Office.This week, they are targeting the man who gave him that role: President Donald Trump.In coordinated demonstrations that organizers said took place across all 50 states, the \"Hands Off!\" protest accused Trump and his administration of championing policies that benefit the rich while making life harder for everyone else.Business Insider sent reporters to protests in different parts of the country to hear from them directly. Many said they were most worried about the economy and their retirement investments, which have dwindled in tandem with Trump's tariff announcements. The crowds also skewed older compared to protests during Trump's first term.Here's what they told us and what surprised us the most.As I rode the train from Brooklyn to Midtown Manhattan, the subway car filled with protesters, their cardboard signs bumping up against umbrellas on a rainy Saturday in New York.By 1 p.m., the 42nd Street station was even more crowded than usual. Older people clutched slippery canes, and young kids clutched their parents' hands. One man wore a once trendy Harris Walz camo hat. Another waved a small American flag, an unusual display of patriotism at anti-Trump rallies.The damp horde of protesters shuffled toward Bryant Park, and in some ways, it all felt familiar. There were chants about abortion, signs featuring the face of now-deceased Supreme Court Justice Ruth Bader Ginsburg, a progressive icon, and a steady cacophony of car horns.But some things were different this time.For one, the crowd looked older, with middle-aged Americans seeming to outnumber the 20-somethings that dominated rallies during the pandemic. It makes sense since many Americans are watching their retirement savings dwindle in the face of crashing markets and worry that staff cuts to the Social Security Administration could impact the crucial safety net.While the anti-government protests held during Trump's first term focused on social issues — like abortion and civil rights issues — many of the signs today targeted the economy.Most of the people I spoke to didn't want to share their last names because they worried about their privacy in the current political environment. Yet they weren't shy about their rage and despair.Dorothy Auer, 62, told me she wished people would get angrier.\"I've been working for over 40 years, and I looked at my investments yesterday — my retirement plan — and I literally don't think I'll ever be able to retire,\" she said, starting to choke up.Wiping her eyes with her free hand — the other held a black and white sign bashing Musk — Auer told me it's distressing to see a man of such wealth \"turn around and crap on us.\"Jian, 33, held a sign that read, \"Tariffs are killing my 401(k),\" but he told me he's most upset about what's happening to his retired father.\"My dad just lost about 25% of his savings in the last three days because of the tariffs,\" he said.It's not just the economy, of course, that brought thousands of people out to Midtown Manhattan.Penny, 54, said the Trump administration affected virtually every issue she cares about. Even so, we ended up talking about Musk.\"I'm horrified that a person who wasn't born here, wasn't elected, seems to be getting carte blanche to do whatever he wants in our government,\" she said. \"How did he get a security clearance?\"Most of those I talked to as they slowly trudged toward Madison Square Park didn't think the protest would change Trump's mind.A few said they hoped Congress would pay attention, but more than that, people said they felt they needed to do something.\"Even if it's sort of hopeless right now, at least it's showing people that we're here,\" Pyare, 49, told me. \"And that we don't like it.\"Another week, another protest.On Saturday, I attended the Hands Off! rally in Novi, Michigan, a suburb of Detroit where 55% of the vote went to Kamala Harris during the election. Thousands of people showed up.The crowd was emotionally charged and united by the spirit of collective action. Many attendees said they were first-time protesters. The Tesla Takedown protests I attended last weekend seemed somber by comparison. Protesters here got loud.\"Call me Old Lady Army Fighting for Democracy,\" one 66-year-old woman, who didn't want to give her real name, told me. She held up a sign she had made. It was a charcoal drawing of the Statue of Liberty, whose hands covered her eyes in shame.\"I just copied this off of Facebook,\" she said. But to her it symbolized that \"everything that our country stands for is being destroyed, and the world is looking at us.\"Liana Gettel, 58, said she was outraged for several reasons, including the administration's stance on abortion. She said she had an abortion 29 years ago.\"I had lost a child. The child would not come out on its own. So I had to have a procedure. Had I not had that procedure, I wouldn't be here,\" she said. \"And that's what they want to block, is things like that?\"Protesters targeted many different issues, including abortion, trans, and minority rights. One protester holding up a sign for trans rights said, \"Trans people are just the appetizer, but everyone will be on the menu now.\"The line echoed remarks made by human rights advocate Channyn Lynne Parker at the Rally for Trans Visibility in Chicago last weekend.Unlike protests during Trump's first term, which focused on social issues, however, many people today were also worried about the president's economic policies.Matt Watts said he was protesting Musk's takeover of Social Security and Trump's tariffs on \"countries that don't deserve it.\" After the stock market began to take a hit from all the talk of tariffs, Watts said he took his money out of his 401(k) and invested it into a more stable fund. \"I'm getting ready to retire pretty soon. I've got to count on that savings,\" he said.The majority of protesters were middle-aged or older, but they managed to capture some younger activists with their energy.Yajat Verma, 18, said he hadn't known about the protest but was driving by with a friend when he saw the crowd. He decided to join in and started handing out water bottles to protesters.\"Everyone should be protesting,\" he said.","summary":"Coordinated nationwide protests against the Trump administration drew large crowds. Business Insider was there.","url":"https://www.businessinsider.com/anti-trump-protests-hands-off-2025-4","image":"https://i.insider.com/67f18ae05d203112923e3351?width=1200&format=jpeg","video":null,"publish_date":"2025-04-05 21:50:13","author":"Alice Tecotzky,Lakshmi Varanasi","authors":["Alice Tecotzky","Lakshmi Varanasi"],"language":"en","category":"politics","source_country":"us","sentiment":0.388},{"id":308097078,"title":"Anti-Trump protests erupt in all 50 US states","text":"Crowds of demonstrators gathered across all 50 US states on Saturday in what was expected to be the largest nationwide protest of Donald Trump’s second term.\n\nTens of thousands of protesters marched through Washington DC, New York and Boston as part of the more than 1,200 “Hands Off!” demonstrations planned across the country to denounce Mr Trump and Elon Musk’s “hostile” attack on Americans’ rights.\n\nThe “mass mobilisation day” is a protest against Mr Trump’s economic agenda and the aggressive government cuts led by his billionaire “first buddy” Mr Musk.\n\nNearly 600,000 people signed up to attend the protests, which included demonstrations in Canada and Mexico, against the string of controversial executive orders Mr Trump signed on his first day in office.\n\nIt comes days after Mr Trump announced hundreds of billions of dollars of “reciprocal” tariffs on America’s trading partners on Wednesday, triggering a global stock market meltdown.\n\nAs an estimated 20,000 anti-Trump protesters spilled out beneath the Washington Monument, Mr Trump was in Florida playing golf at his club in Jupiter, before returning to his Mar-a-Lago estate in the afternoon.Protesters waved signs accusing Mr Musk of being a “fascist”, portrayed Mr Trump with a swastika on his forehead and vowed to “fight the oligarchy”.\n\nSome carried Ukrainian flags and others wore Palestinian keffiyeh scarves and carried “Free Palestine” signs, while Democrats from the US House of Representatives criticised Mr Trump’s policies on stage.\n\nThe protests follow a wave of demonstrations at Tesla facilities across the country in the wake of Mr Musk’s Department of Government Efficiency (DOGE) team slashing 200,000 federal jobs. Mr Trump denounced the protests, which at times descended into vandalism, as domestic terrorism.\n\nMuch of the president’s agenda has been restrained by lawsuits contending he has overstepped his authority with attempts to fire civil servants, deport immigrants and reverse transgender rights.\n\nHours before Saturday’s US protests were due to start, hundreds of anti-Trump Americans living in Europe gathered in Berlin, Frankfurt, Paris and London to voice their opposition to Mr Trump’s sweeping US foreign and domestic policies.\n\n“This is an enormous demonstration that is sending a very clear message to Musk and Trump and congressional Republicans and all the goose-stepping allies of MAGA that we don’t want their hands on our democracy, on our communities, on our schools and our friends and our neighbours,” said Ezra Levin, co-founder of Indivisible, one of the groups organising Saturday’s events.\n\nAt the start of Mr Trump’s first term in 2017, hundreds of thousands of protesters joined the Women’s March on Washington to demonstrate against his presidency.\n\nWhile stars including Madonna, Helen Mirren and Whoopi Goldberg joined grassroots protesters the day after Mr Trump’s first inauguration, celebrities were notably absent from Saturday’s protests.\n\nIt comes after critics claimed Kamala Harris’s campaign, which included a carousel of the world’s biggest stars, made her appear out of touch with voters.\n\nTerry Klein, a retired biomedical scientist from Princeton, New Jersey, was among those who gathered by the stage beneath the Washington Monument on Saturday.\n\nShe said she drove down to attend the rally to protest Mr Trump’s policies on “everything from immigration to the DOGE stuff to the tariffs this week, to education. I mean, our whole country is under attack, all of our institutions, all the things that make America what it is.”\n\nSpeaking at the Washington demonstration, Jamie Raskin, a Maryland congressman, accused Mr Trump of having “the politics of Mussolini and the economics of Herbert Hoover.”\n\nThe Democrat politician told the crowd:“Our founders wrote a Constitution that does not begin with ‘We the dictators,’ the preamble says ‘We the people,’... No moral person wants an economy-crashing dictator who knows the price of everything and the value of nothing.”\n\nAcross the country in Los Angeles one protester dressed up as Marie Antonette and held a sign reading: “Musk & Trump say: let them eat cake”.\n\nWhite House assistant press secretary Liz Huston said: “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries.\n\n“Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.”","url":"https://uk.news.yahoo.com/anti-trump-protests-erupt-50-212156112.html","image":"https://s.yimg.com/ny/api/res/1.2/8PDS2bPo8ZGMyY8g9JsMgQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_telegraph_818/0f4b38f3c4877c761410dcd0cb4210bd","video":null,"publish_date":"2025-04-05 21:21:56","author":"Susie Coen","authors":["Susie Coen"],"language":"en","category":"politics","source_country":"gb","sentiment":0.128},{"id":308107406,"title":"Kamala Harris Claims Vindication After Crushing Election Loss: 'I Told You So'","text":"Former Vice President Kamala Harris joked “I told you so” in a public appearance this week, suggesting that she prophetically warned President Donald Trump’s second term would bring disastrous consequences during her presidential campaign that ended in humiliating defeat.\n\nHarris claimed that what she allegedly warned about is coming to pass during a speaking engagement this Thursday at the Leading Women Defined Summit in Dana Point, California.\n\n“We are seeing organizations stay quiet. We are seeing those who are capitulating to clearly unconstitutional threats. And these are the things we are witnessing,” she said. “Each day in the last few months in our country. And it understandably creates a great sense of fear. Because you know there were many things we knew would happen.”\n\n“I’m not here to say I told you so … I swear, I wasn’t going to say that,” the former vice president continued, effectively saying it.\n\nIt remains unclear how Harris can take a victory lap, given that Trump has already started delivering on the agenda items that the American people tasked him with. On his first day in office alone, the president signed 118 executive orders, actions, and memoranda. These measures rescinded dozens of executive orders issued by former President Joe Biden. They further aim to tackle issues including the weaponization of the federal government against political opposition, addressing the southern border crisis by declaring it a national emergency, the need to re-establish the immutable biological reality of sex, and so much more.\n\nTrump has also committed a team — the Department of Government Efficiency (DOGE) — to weed out government waste. The organization says it has already saved taxpayers an estimated $140 billion despite leftists throwing a collective fit about its halts to USAID and more.\n\nEmployment statistics under Trump’s second administration have also exceeded expectations, according to data from the Labor Department. Further, the president did as he said he would do and announced reciprocal tariffs on “Liberation Day” earlier this week. The ground-breaking action is part of an effort to even the playing field for America by fighting against unfair trading practices and brining manufacturing back to U.S. soil.\n\n“So for 40 years, America has been the piggy bank of the world,” Vice President JD Vance told Breitbart News regarding Trump’s historic announcement on tariffs this week.\n\n“We absorb all of the ridiculous trade practices and economic practices of friend and foe alike. For the first time in probably 40 years, we have an American president who’s saying, ‘No more.’ That it’s not going to work. That he’s not going to allow America to be taken advantage of anymore. This decision is going to cause incredible benefits for American workers,” Vance said.\n\nMonths after her loss, Harris made it clear that she is not exiting politics and intends to stay “in this fight” — potentially with a run for the California governorship, according to reports.","summary":"Former Vice President Kamala Harris joked \"I told you so\" in a public appearance this week, suggesting that she prophetically warned President Donald Trump's second term would bring disastrous consequences during her presidential campaign that ended in humiliating defeat.\n\n\nThe post Kamala Harris Claims Vindication After Crushing Election Loss: &#8216;I Told You So&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/pre-viral/2025/04/05/kamala-harris-claims-vindication-after-crushing-election-loss-i-told-you-so/","image":"https://media.breitbart.com/media/2025/04/AP25054124799899-640x335.jpg","video":null,"publish_date":"2025-04-05 20:41:56","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","category":"politics","source_country":"US","sentiment":0.033},{"id":308084618,"title":"Lawmaker Discloses Congress to Question Biden’s White House Physician on ‘Cognitive Decline’","text":"A Republican lawmaker revealed Joe Biden’s White House doctor will be grilled by Congress over the former president’s cognitive health. \n\nRepublicans and some Democrats have long called for the truth behind what they claim is a cognitive decline in the 82-year-old during his presidency. \n\nNow, Texas Representative Ronny Jackson, who has a medical degree, said Dr. Kevin O’Connor will have to speak for the Democrat leader’s health. \n\n‘Dr. Kevin O’Connor will absolutely, positively be implicated in the cover-up of this,’ Jackson told the New York Post. ‘I guarantee you Kevin O’Connor has medical information that the American people don’t have. \n\n‘I’ve known him for a long time; he’s part of the Biden family. He would do or say anything to cover up and protect that family, regardless of what it meant professionally for him,’ the GOP representative accused. \n\n‘This could not have been covered up without him – and Jill Biden – in particular.’ \n\nO’Connor had previously said the then-president’s health was ‘excellent’ and there was nothing to worry about just days before Biden dropped out of the 2024 race. \n\nMany Americans and lawmakers, like Jackson, were also suspicious of Dr. Kevin Cannard eight visits to the White House between July 2023 and March 2024. Cannard specializes in Parkinson’s at Walter Reed National Military Medical Center. \n\nO’Connor, at the time, said only three of those visits had been for Biden’s yearly physical. \n\nBiden’s doctor – who the politician affectionally calls ‘doc’ – said the Delaware native didn’t need a cognitive test last year, despite many calling for one ahead of the big election. \n\nConcerns grew as Biden appeared confused on stage multiple times, was falling up the stairs of Air Force One and mixed up names and as his gait changed to a stiff walk. \n\n‘He was probably putting President Biden on lots of medications that we have no clue of – in efforts to try to treat his cognitive decline,’ Jackson speculated to The Post. \n\nJackson said a House panel will investigate if a ‘shadow presidency’ was happening during Biden’s term. \n\nThe House of Representatives have not officially announced a probe into Biden’s presidency. \n\nJackson also wants to bring in other doctors and experts who evaluated Biden during his re-election campaign. \n\nSeveral doctors – including Jackson – had outwardly speculated that Biden was suffering from cognitive decline through the Democrat’s campaign. \n\n‘I said that over and over and over and God knows how many times I was on TV,’ the Republican lawmaker told The Post. ‘I was saying that this man was not fit to be president when he was candidate Joe Biden in 2020.’ \n\nHe accuses O’Connor and others of knowing ‘two or three years ago’ that Biden’s health was declining, but ‘these people are cashing in on, you know, telling the truth now and writing these books and stuff that’s coming out of the woodwork.’ \n\nNeurologist Dr. Tim Pitts told NBC News in July that he ‘could’ve diagnosed [Biden] from across the Mall’ with a Parkinson’s diagnosis. \n\nThe Biden Administration has denied the politician was facing health issues. \n\nDailyMail.com has reached out to O’Connor for comment. \n\nIn fact, during his re-election campaign, his team released a 2.5-minute video showing moments Trump, who is 78, appeared to be confused. \n\n‘Here is a montage of Donald Trump getting confused, lost, wandering off, and waving to nobody,’ the Biden campaign countered.\n\nThe clips show Trump, during his presidency, departing events before he’s supposed to, or awkwardly standing in place when he’s supposed to be exiting.\n\nDespite the denial, Jackson said those who covered up Biden’s suspected health problems by ‘purposely lying to the American people’ will be held responsible. \n\nKamala Harris succeed him in the Democratic race for the top spot in the nation. She narrowly missed the popular vote by 2 million votes.\n\nBiden was blamed by senior Harris advisor David Plouffe for refusing to drop out earlier in the race after his June debate disaster.\n\nPlouffe claimed no Democratic candidate could have won without a proper primary process — what he called ‘the cardinal sin’ of this race.\n\nAnd he said he was shocked by the internal polling numbers when he finally joined the team after Joe Biden dropped out with less than four months to go, a situation he described as ‘catastrophic.’\n\n‘When I got in, it was the first time I saw the actual numbers under the hood. They were pretty gruesome,’ he told The Atlantic.\n\n‘The Sun Belt was worse than the Blue Wall, but the Blue Wall was bad. And, demographically, young voters across the board—Hispanic voters, Black voters, Asian voters—were in really terrible shape.\n\n‘When the switch happened, some of that stuff got a little bit better, but nowhere near where we ended up or where we needed to be. This was a rescue mission.\n\n‘It was catastrophic in terms of where it was.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nA Republican lawmaker revealed Joe Biden&#8217;s White House doctor will be grilled&#8230;\n\n\nThis Post: Lawmaker Discloses Congress to Question Biden&#8217;s White House Physician on &#8216;Cognitive Decline&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/lawmaker-discloses-congress-to-question-bidens-white-house-physician-on-cognitive-decline/","image":"https://i.dailymail.co.uk/1s/2025/04/05/20/96957667-14575329-image-m-18_1743879906758.jpg","video":null,"publish_date":"2025-04-05 20:18:52","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.493},{"id":308083212,"title":"Trump is shaking up the stock market — and can still prove naysayers wrong","text":"Wall Street’s Trump supporters — and they are legion — were riding high.\n\nThey cheered a completely sentient president who took office promising to enact a bold agenda of tax cuts, deregulation and un-woking college campuses, including Ivy League institutions many of them attended.\n\nThen came the trade war. Trump is not only blowing up the markets (aka their livelihoods), they fear, but the economy and probably his presidency along with GOP control of Congress when the midterms come next year.\n\nHe could even be paving the way for the word-salad queen, Kamala Harris to re-emerge in 2028.\n\nI’m not saying I subscribe to this doom and gloom. I hold out hope that The Donald will live up to his wheeler-dealer rep and make sure those very stiff tariffs on every trading partner in the world really are “reciprocal,” as he said they would be when announcing the move this past week.\n\nThe hope is they will be modified downward amid a flurry of negotiation with countries that should have as much to lose as we do. Markets will rebound as fast as they’ve been tanking. The economy will solidify around his tax cuts and deregulation.\n\nBut here’s what the naysayers keep reminding me: China could suck it up for a while. They’ve hit us with their own sanctions, hoping to crater our economy while it plays a long game. After all, their “president for life,” Xi Jinping, isn’t exactly -going anywhere.\n\nEurope might do the same, as could Canada and Mexico. They might think they can get more out of Trump if he has a severely compromised economy to work with.\n\nEven scarier, say these tariffs aren’t a “reciprocal” negotiating tool for Trump to take down our perpetually large trade deficits. He really believes they’re great for the economy.\n\nRigid adviser\n\nTheir nightmare scenario has Trump firmly in the camp of his ideologically rigid economic adviser Peter Navarro, a tariff evangelist, who for years has been predicting how the levies will magically restore all those lost factory jobs and remake the economy of 2025 into one that resembles the 1960s.\n\nHe’s totally aligned with Howard Lutnick, his voluble (and increasingly annoying) protectionist commerce secretary. Lutnick is an odd duck; he’s a former brokerage chief who wasn’t on the tariff soap box until he started vying for a job with Team Trump.\n\nNow he’s trying to convince markets how the federal government can somehow plug a $2 trillion budget deficit and grow an economy with tariffs.\n\nIt’s not a good look, or the markets wouldn’t be going haywire. How can you plug a budget deficit with tariffs if those tariffs even momentarily weaken economic growth and tax receipts decline? Note to Howie: Simple logic says you can’t.\n\nAnother layer added to their world of worries: They say Trump doesn’t appear to want to listen to Scott Bessent, his erudite treasury secretary. Bessent spent years gauging the intricacies of the global markets as a hedge fund trader. He certainly understands capital flows. He knows what happens when countries stop trading with each other and adjust violently to price shocks in the form of trade barriers: Less money flows into their economies, and you get inflation because foreign goods will immediately cost more.\n\nLast I checked, that’s called “stagflation,” and if you grew up in the 1970s like I did, you know it’s no fun.\n\nBessent is watching the bond market and how the yield on the 10-year bond is falling below 4%, a sure sign that some smart people think this trade stuff will crush growth. I hear he’s quietly trying to outflank -Navarro and Lutnick before the price shocks turn into inflation.\n\nWhatever he’s doing obviously isn’t working, the cynics remind me. Bessent is either in the doghouse, or has been reduced to Trump’s in-house lap dog.\n\nKeep in mind the Wall Street crowd misread Trump before so they might not be the best predictor here. They thought he was all bluster on trade; he would leave tariffs for last, maybe when the economy was humming.\n\nHe didn’t — as we’re now all so painfully aware.\n\nThat’s why I still think Trump will make a deal when he sees many more 1,000-plus-point declines in the Dow (or 2,000-plus drops like on Friday) and companies ramping up layoffs. Going cold turkey on trade will do that. The logical thing to do is negotiate and declare victory, and Trump loves to win.\n\nPragmatic dealmaker?\n\nA caveat to my optimism was provided by a friend of mine who knows Trump well. This mutual friend recently explained to me that yes, Trump is the ultimate pragmatist and dealmaker, except maybe when it comes to curing our trade deficits. He hates that countries screwed us for so long, and over the years he’s come to believe that tariffs can work economic miracles.\n\nThat’s why he didn’t negotiate and instead opted for the tariff sledgehammer last week. He doesn’t see tariffs as a tax on goods that will be passed on to the American people and cause inflation, but a way to make US goods cheaper over time as we produce more here.\n\nHe sees the American people being consumers of our own cooking. In other words, he might not be so keen on negotiating trade peace.\n\nGod help us if I’m wrong and my pal is right.","summary":"Wall Street’s Trump supporters — and they are legion — were riding high.","url":"https://nypost.com/2025/04/05/business/trump-is-shaking-up-the-stock-market-and-can-still-prove-naysayers-wrong/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/u-s-president-donald-trump-101686350.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/oesjOgCt-RyIcpnTz.mp4","publish_date":"2025-04-05 20:18:50","author":"Charles Gasparino","authors":["Charles Gasparino"],"language":"en","source_country":"us","sentiment":-0.168},{"id":308077300,"title":"Biden's White House doctor will be grilled by Congress over 'cognitive decline,' reveals lawmaker","text":"A Republican lawmaker revealed Joe Biden's White House doctor will be grilled by Congress over the former president's cognitive health. \n\nRepublicans and some Democrats have long called for the truth behind what they claim is a cognitive decline in the 82-year-old during his presidency. \n\nNow, Texas Representative Ronny Jackson, who has a medical degree, said Dr. Kevin O'Connor will have to speak for the Democrat leader's health. \n\n'Dr. Kevin O’Connor will absolutely, positively be implicated in the cover-up of this,' Jackson told the New York Post. 'I guarantee you Kevin O’Connor has medical information that the American people don’t have. \n\n'I’ve known him for a long time; he’s part of the Biden family. He would do or say anything to cover up and protect that family, regardless of what it meant professionally for him,' the GOP representative accused. \n\n'This could not have been covered up without him - and Jill Biden - in particular.' \n\nO'Connor had previously said the then-president's health was 'excellent' and there was nothing to worry about just days before Biden dropped out of the 2024 race. \n\nMany Americans and lawmakers, like Jackson, were also suspicious of Dr. Kevin Cannard eight visits to the White House between July 2023 and March 2024. Cannard specializes in Parkinson's at Walter Reed National Military Medical Center. \n\nO'Connor, at the time, said only three of those visits had been for Biden's yearly physical. \n\nBiden's doctor - who the politician affectionally calls 'doc' - said the Delaware native didn't need a cognitive test last year, despite many calling for one ahead of the big election. \n\nConcerns grew as Biden appeared confused on stage multiple times, was falling up the stairs of Air Force One and mixed up names and as his gait changed to a stiff walk. \n\n'He was probably putting President Biden on lots of medications that we have no clue of - in efforts to try to treat his cognitive decline,' Jackson speculated to The Post. \n\nJackson said a House panel will investigate if a 'shadow presidency' was happening during Biden's term. \n\nThe House of Representatives have not officially announced a probe into Biden's presidency. \n\nJackson also wants to bring in other doctors and experts who evaluated Biden during his re-election campaign. \n\nSeveral doctors - including Jackson - had outwardly speculated that Biden was suffering from cognitive decline through the Democrat's campaign. \n\n'I said that over and over and over and God knows how many times I was on TV,' the Republican lawmaker told The Post. 'I was saying that this man was not fit to be president when he was candidate Joe Biden in 2020.' \n\nHe accuses O'Connor and others of knowing 'two or three years ago' that Biden's health was declining, but 'these people are cashing in on, you know, telling the truth now and writing these books and stuff that's coming out of the woodwork.' \n\nNeurologist Dr. Tim Pitts told NBC News in July that he 'could've diagnosed [Biden] from across the Mall' with a Parkinson's diagnosis. \n\nThe Biden Administration has denied the politician was facing health issues. \n\nDailyMail.com has reached out to O'Connor for comment. \n\nIn fact, during his re-election campaign, his team released a 2.5-minute video showing moments Trump, who is 78, appeared to be confused. \n\n'Here is a montage of Donald Trump getting confused, lost, wandering off, and waving to nobody,' the Biden campaign countered.\n\nThe clips show Trump, during his presidency, departing events before he's supposed to, or awkwardly standing in place when he's supposed to be exiting.\n\nDespite the denial, Jackson said those who covered up Biden's suspected health problems by 'purposely lying to the American people' will be held responsible. \n\nKamala Harris succeed him in the Democratic race for the top spot in the nation. She narrowly missed the popular vote by 2 million votes.\n\nBiden was blamed by senior Harris advisor David Plouffe for refusing to drop out earlier in the race after his June debate disaster.\n\nPlouffe claimed no Democratic candidate could have won without a proper primary process — what he called 'the cardinal sin' of this race.\n\nAnd he said he was shocked by the internal polling numbers when he finally joined the team after Joe Biden dropped out with less than four months to go, a situation he described as 'catastrophic.'\n\n'When I got in, it was the first time I saw the actual numbers under the hood. They were pretty gruesome,' he told The Atlantic.\n\n'The Sun Belt was worse than the Blue Wall, but the Blue Wall was bad. And, demographically, young voters across the board—Hispanic voters, Black voters, Asian voters—were in really terrible shape.\n\n'When the switch happened, some of that stuff got a little bit better, but nowhere near where we ended up or where we needed to be. This was a rescue mission.\n\n'It was catastrophic in terms of where it was.","summary":"Republicans and some Democrats have long called for the truth behind what they claim is a cognitive decline in the 82-year-old during his presidency.","url":"https://www.dailymail.co.uk/news/article-14575329/biden-cognitive-decline-white-house-doctor-grilled-congress.html","image":"https://i.dailymail.co.uk/1s/2025/04/05/19/96957665-0-image-m-11_1743878257799.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/02/20/2906867431612170348/1024x576_MP4_2906867431612170348.mp4","publish_date":"2025-04-05 19:49:09","author":"Alyssa Guzman,Editor","authors":["Alyssa Guzman","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.493},{"id":308075104,"title":"Kamala Harris’s concession call to Donald Trump was awkward; here’s what they said to each other","text":"The day after the 2024 election was over, the then vice president Kamala Harris made the tough phone call to president-elect Donald Trump to concede the election. As expected, the call was tense and awkward, but new information from Chris Whipple's upcoming new book 'Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History', highlighted just how uncomfortable the conversation actually was, as per a report.The call was arranged from her Naval Observatory residence in Washington D.C., with her campaign Chief of Staff Sheila Nix and White House Chief of Staff Lorraine Voles, reported Daily Mail. According to Whipple's book, Nix called the president-elect on her cell phone - but for some reason couldn't merge the call with the vice president's phone. So Voles called Harris on hers - and she and Nix pressed the phones together, quoted Daily Mail. After Trump picked up the call, Voles told Trump that, The vice president is on the line, as quoted in the report. Kamala Harris Concedes with RespectDespite their competitive relationship during the campaign, Harris addressed the President-elect with respect, saying, I'm calling to concede. It was a fair election. The peaceful transfer of power is important. It's important to the country, quoted Daily Mail. She also added that, I hope you're a president for all Americans, according to Whipple.Donald Trump’s ResponseSurprisingly Trump's response to Harris was not how many expected it would be. Whipple mentioned, If Trump detected any edge to that remark he didn't show it. In fact, the president-elect was weirdly cordial and complimentary - bantering as though he were on the golf course, quoted Daily Mail.Whipple claimed that Trump complimented Harris and told her that she was great, as per the report. He went on to say that, You're a tough cookie. You were really great. And that Doug - what a character! I love that guy, quoted Daily Mail. Trump referred to Harris' husband Doug Emhoff. Harris Aide Calls Trump a Sociopath However, one of Harris' supporters found this odd and inappropriate, wrote Whipple. Harris' aide claimed, I was like, what? Honestly, I felt like, what is this? It's so manipulative. He's a sociopath, quoted Daily Mail. FAQsWho set up the concession call?The call was arranged by Harris’s campaign Chief of Staff Sheila Nix and White House Chief of Staff Lorraine Voles.What did Trump say about Doug Emhoff?Trump said, “What a character! I love that guy,” referring to Harris’s husband, Doug Emhoff.","summary":"Vice President Kamala Harris called President-elect Donald Trump to concede the 2024 election. Despite the tension, they had a cordial conversation. Trump congratulated Harris and complimented her husband. One of Harris’s aides found Trump's response manipulative and inappropriate, calling Trump a sociopath. The call was arranged by Harris’s staff using an unconventional method.","url":"https://economictimes.indiatimes.com/news/international/us/kamala-harriss-concession-call-to-donald-trump-was-awkward-heres-what-they-said-to-each-other/articleshow/120023035.cms","image":"https://img.etimg.com/thumb/msid-120023014,resizemode-4,width-1200,height-900,imgsize-212462,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 19:02:01","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.279},{"id":308067214,"title":"Jillian Michaels: The Alarming Reality Behind the High Number of Transgender Children Among Hollywood Celebrities That All Parents Should Be Aware Of","text":"Progressive leaders are quietly tiptoeing away from the radical reaches of the transgender movement, but don’t be fooled.\n\nThey haven’t yet reversed course on one of their most shameful positions.\n\nThe brutal political reality for Democrats is that more than 70 percent of Americans simply don’t support their extreme positions, like taxpayer-funded gender surgeries and the medicalization of gender dysphoria for minors with off-label cancer drugs (puberty blockers), cross-sex hormones and irreversible surgeries.\n\nBut the Left had to learn that the hard way in the 2024 elections, when liberal and moderate voters — many of them exasperated parents — handed Kamala Harris a devastating electoral defeat.\n\nNow the message is unmistakable: enough is enough.\n\nEven California Governor Gavin Newsom — once one of the loudest champions of ‘gender-affirming care’ — is beginning to course-correct.\n\nHe has pulled back from his full-throated support for the right of biological males to compete in women’s sports. And he’s softened his rhetoric around the state’s role in subsidizing gender transitions for minors.\n\nThese, however, are political concessions, not moral awakenings.\n\nDon’t mistake this for a full reckoning.\n\nFor Newsom and others like him still refuse to give way on the issue that drove so many parents, like me, to conclude that the Democratic Party had abandoned us: the issue of parental rights.\n\nOn Real Time with Bill Maher last weekend, Newsom doubled down on his support for California’s ‘Safety Act,’ which he signed into law in July.\n\nThe law prohibits schools from requiring their staff to inform parents if their child requests to socially transition at school.\n\nA social transition is the process by which a person – in this case a minor – requests to be addressed by a name or set of pronouns that they believe more accurately aligns with their ‘gender identity.’\n\nSocial transitions in school settings may also include a child asking to use bathroom facilities that are typically associated with the opposite sex.\n\nWhy does this matter?\n\nBecause social transition may be a step toward medical transition – and life-alerting consequences.\n\nPuberty blockers — originally developed to treat prostate and breast cancer — are used off-label to halt natural development in children, with long-term effects that are not fully understood.\n\nThe risks that we do know of are alarming: impaired brain and bone development and the inability to ever experience sexual function or orgasm.\n\nCross-sex hormones carry similar risks, including cardiovascular problems and sterility.\n\nThere are dangers of deep psychological pain should regret set in—something ‘detransitioners’ – those who feel remorseful over their transitions – are now speaking out about in growing numbers.\n\nAnd these aren’t fringe cases. These are often young women who carry scars from a medical system that – many claim – fast-tracked them into irreversible procedures without fully exploring the root causes of their distress.\n\nBut here’s what Newsom said Maher asked him if he still backs the ‘Safety Act.’\n\n‘I think teachers should teach. I don’t think they should be required to turn in kids.’\n\nI’m sorry, Governor? ‘Turn in Kids’\n\nTo be clear: California’s ‘Safety Act’ isn’t about protecting children from abusive homes, as many of its supporters claim. There are already mandatory reporting laws in public schools to help children trapped in those tragic situations.\n\nLet’s call this law what it is: progressive ideological overreach that undermines family unity, parental responsibility, and healthy child development. And it should be a dealbreaker for any parent, regardless of political affiliation.\n\nAs a mother, and as someone who believes the family is the bedrock of a stable society, I find the notion of cutting parents out of the equation not only mindboggling, but outrageous and completely unacceptable.\n\nIf a child is contemplating a gender transition, then I’d say that is the moment that a parent’s attention is most important. Secretly validating a child’s gender dysphoria isn’t giving them space — it’s potentially robbing them of the guidance that they may need to figure things out.\n\nAnd here’s where Newsom’s stance becomes particularly maddening.\n\nHe knows the tide is turning. He’s seen the lawsuits. He’s heard the story of ‘detransitioners.’ And he knows the majority of the country is no longer on board.\n\nBut when it comes to rethinking ‘transgenderism’ in schools, he’s immovable.\n\nLet’s be honest: transgenderism – especially among the most privileged is seemingly prized. It was made to be fashionable. And far too many kids, and frankly parents – enabled by politicians eager to cash in on the craze – treated the phenomenon with shocking naivety.\n\nThose are the people that Governor Newsom was catering to when he signed the ‘Safety Act’ into law.\n\nIt seems to me that transgender identity — especially among kids — was allowed to spread through social contagion in many progressive circles. And, indeed, transgenderism among children is concerningly prevalent in Hollywood.\n\nNow, I am not suggesting that every trans-identifying youth is faking it. But I do believe that parents should be deeply skeptical of the sudden surge in gender dysphoria among children, particularly among adolescent girls, who are more prone to social mimicry, identity struggles, and emotional distress than boys.\n\nThere have been similar waves of social contagion in the past involving eating disorders and self-harm. Like past waves, this one comes with severe medical consequences — and it also comes a built-in ideological defense: question it, and you’re labeled a bigot.\n\nConfronting this appears to be a bridge too far for suddenly moderate Gavin. So, don’t allow his strategic shift to fool you.\n\nIf he, or any politician like him, wants to be seen as a credible, principled leader rather than just a slippery opportunist, he needs to do far more than recalibrate his rhetoric.\n\nHe needs to confront a dangerous ideology that has taken hold on the left that many people now feel deeply committed to and one that involves our children.\n\nThere’s still time — for Newsom, for Democrats, for anyone complicit in this betrayal — to reverse course. But it will require more than optics and spin. It demands moral courage. It demands they face the parents they misled and admit: we were wrong. \n\nUntil then, the message to parents is loud and clear: your role is optional, your voice is disposable and your children are political pawns. And that is unforgivable.","summary":"Internewscast Journal\n\nInternewscast\n\n\nProgressive leaders are quietly tiptoeing away from the radical reaches of the&#8230;\n\n\nThis Post: Jillian Michaels: The Alarming Reality Behind the High Number of Transgender Children Among Hollywood Celebrities That All Parents Should Be Aware Of first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/jillian-michaels-the-alarming-reality-behind-the-high-number-of-transgender-children-among-hollywood-celebrities-that-all-parents-should-be-aware-of/","image":"https://internewscast.com/wp-content/uploads/2025/04/rewrite-this-title-JILLIAN-MICHAELS-Terrifying-truth-about-why-so.jpg","video":null,"publish_date":"2025-04-05 18:48:54","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.411},{"id":308071800,"title":"House GOP to Probe if Aides ‘Covered Up’ Biden’s Mental Decline","text":"Texas GOP Rep. Ronny Jackson said a House panel will probe whether former White House doctor Kevin O’Connor concealed former President Joe Biden’s mental decline.\n\nJackson, the chair of the House Intelligence Committee’s subcommittee on Oversight and Investigations, told the New York Post in a story published Friday that the GOP “will look into whether or not we actually had a shadow presidency for a large part of [Biden’s] term” and that O’Connor “will absolutely, positively be implicated in the cover-up of this. He is a massive, massive part.”\n\n“He was probably putting President Biden on lots of medications that we have no clue of—in efforts to try to treat his cognitive decline,” he alleged. The subcommittee has yet to formally announce any investigation.\n\nJackson is a physician and served in the White House Medical Unit under former Presidents George W. Bush, Barack Obama, and Donald Trump before he was elected to Congress in 2020. \n\nJackson alleged O’Connor, whom he said he’s known for a long time, “would do or say anything to cover up and protect [the Biden family], regardless of what it meant professionally.” \n\nBiden, the oldest president in U.S. history when he left office at 82, faced growing questions about his fitness for office as his term wore on. O’Connor wrote in a February 2024 memo that the president “continues to be fit for duty and fully executes all of his responsibilities without any exemptions or accommodations.”\n\nBy avoiding sit-down interviews and large press conferences, the president’s apparent mental decline only became fully obvious during his catastrophic performance in the televised debate with Trump last June. He relinquished the Democratic nomination to former Vice President Kamala Harris on July 21. \n\nThe move spurred Republicans to question whether his team had concealed signs of his supposed mental decline and were doing the president’s job for him.\n\nIn July, the Republican-led House Oversight Committee issued subpoenas for White House aides, including O’Connor, to discuss Biden’s cognitive state, but it is not clear if he responded to the voluntary request.","summary":"Anna Moneymaker / Anna Moneymaker/Getty ImagesTexas GOP Rep. Ronny Jackson said a House panel will probe whether former White House doctor Kevin O’Connor concealed former President Joe Biden’s mental decline.\n\nJackson, the chair of the House Intelligence Committee’s subcommittee on Oversight and Investigations, told the New York Post in a story published Friday that the GOP “will look into whether or not we actually had a shadow presidency for a large part of [Biden’s] term” and that O’Connor “will absolutely, positively be implicated in the cover-up of this. He is a massive, massive part.”\n\n“He was probably putting President Biden on lots of medications that we have no clue of—in efforts to try to treat his cognitive decline,” he alleged. The subcommittee has yet to formally announce any investigation.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/house-to-probe-if-aides-concealed-bidens-mental-decline/","image":"https://www.thedailybeast.com/resizer/v2/73ISGLEI6ZBKDMDEIA33PKYQWU.jpg?smart=true&auth=f0fb1ed94cf8a99a0a2f989588160ec558c9a624078ac7448e8b83c7cbc48bb5&width=1440&height=1080","video":null,"publish_date":"2025-04-05 18:40:43","author":"Erkki Forster","authors":["Erkki Forster"],"language":"en","category":"politics","source_country":"us","sentiment":0.046},{"id":308061288,"title":"JILLIAN MICHAELS: Terrifying truth about why so many children of Hollywood stars are trans that every parent must read","text":"Progressive leaders are quietly tiptoeing away from the radical reaches of the transgender movement, but don't be fooled.\n\nThey haven't yet reversed course on one of their most shameful positions.\n\nThe brutal political reality for Democrats is that more than 70 percent of Americans simply don't support their extreme positions, like taxpayer-funded gender surgeries and the medicalization of gender dysphoria for minors with off-label cancer drugs (puberty blockers), cross-sex hormones and irreversible surgeries.\n\nBut the Left had to learn that the hard way in the 2024 elections, when liberal and moderate voters — many of them exasperated parents — handed Kamala Harris a devastating electoral defeat.\n\nNow the message is unmistakable: enough is enough.\n\nEven California Governor Gavin Newsom — once one of the loudest champions of 'gender-affirming care' — is beginning to course-correct.\n\nHe has pulled back from his full-throated support for the right of biological males to compete in women's sports. And he's softened his rhetoric around the state's role in subsidizing gender transitions for minors.\n\nThese, however, are political concessions, not moral awakenings.\n\nDon't mistake this for a full reckoning.\n\nFor Newsom and others like him still refuse to give way on the issue that drove so many parents, like me, to conclude that the Democratic Party had abandoned us: the issue of parental rights.\n\nOn Real Time with Bill Maher last weekend, Newsom doubled down on his support for California's 'Safety Act,' which he signed into law in July.\n\nThe law prohibits schools from requiring their staff to inform parents if their child requests to socially transition at school.\n\nA social transition is the process by which a person – in this case a minor – requests to be addressed by a name or set of pronouns that they believe more accurately aligns with their 'gender identity.'\n\nSocial transitions in school settings may also include a child asking to use bathroom facilities that are typically associated with the opposite sex.\n\nWhy does this matter?\n\nBecause social transition may be a step toward medical transition – and life-alerting consequences.\n\nPuberty blockers — originally developed to treat prostate and breast cancer — are used off-label to halt natural development in children, with long-term effects that are not fully understood.\n\nThe risks that we do know of are alarming: impaired brain and bone development and the inability to ever experience sexual function or orgasm.\n\nCross-sex hormones carry similar risks, including cardiovascular problems and sterility.\n\nThere are dangers of deep psychological pain should regret set in—something 'detransitioners' – those who feel remorseful over their transitions - are now speaking out about in growing numbers.\n\nAnd these aren't fringe cases. These are often young women who carry scars from a medical system that – many claim – fast-tracked them into irreversible procedures without fully exploring the root causes of their distress.\n\nBut here's what Newsom said Maher asked him if he still backs the 'Safety Act.'\n\n'I think teachers should teach. I don't think they should be required to turn in kids.'\n\nI'm sorry, Governor? 'Turn in Kids'\n\nTo be clear: California's 'Safety Act' isn't about protecting children from abusive homes, as many of its supporters claim. There are already mandatory reporting laws in public schools to help children trapped in those tragic situations.\n\nLet's call this law what it is: progressive ideological overreach that undermines family unity, parental responsibility, and healthy child development. And it should be a dealbreaker for any parent, regardless of political affiliation.\n\nAs a mother, and as someone who believes the family is the bedrock of a stable society, I find the notion of cutting parents out of the equation not only mindboggling, but outrageous and completely unacceptable.\n\nIf a child is contemplating a gender transition, then I'd say that is the moment that a parent's attention is most important. Secretly validating a child's gender dysphoria isn't giving them space — it's potentially robbing them of the guidance that they may need to figure things out.\n\nAnd here's where Newsom's stance becomes particularly maddening.\n\nHe knows the tide is turning. He's seen the lawsuits. He's heard the story of 'detransitioners.' And he knows the majority of the country is no longer on board.\n\nBut when it comes to rethinking 'transgenderism' in schools, he's immovable.\n\nLet's be honest: transgenderism – especially among the most privileged is seemingly prized. It was made to be fashionable. And far too many kids, and frankly parents – enabled by politicians eager to cash in on the craze – treated the phenomenon with shocking naivety.\n\nThose are the people that Governor Newsom was catering to when he signed the 'Safety Act' into law.\n\nIt seems to me that transgender identity — especially among kids — was allowed to spread through social contagion in many progressive circles. And, indeed, transgenderism among children is concerningly prevalent in Hollywood.\n\nNow, I am not suggesting that every trans-identifying youth is faking it. But I do believe that parents should be deeply skeptical of the sudden surge in gender dysphoria among children, particularly among adolescent girls, who are more prone to social mimicry, identity struggles, and emotional distress than boys.\n\nThere have been similar waves of social contagion in the past involving eating disorders and self-harm. Like past waves, this one comes with severe medical consequences — and it also comes a built-in ideological defense: question it, and you're labeled a bigot.\n\nConfronting this appears to be a bridge too far for suddenly moderate Gavin. So, don't allow his strategic shift to fool you.\n\nIf he, or any politician like him, wants to be seen as a credible, principled leader rather than just a slippery opportunist, he needs to do far more than recalibrate his rhetoric.\n\nHe needs to confront a dangerous ideology that has taken hold on the left that many people now feel deeply committed to and one that involves our children.\n\nThere's still time — for Newsom, for Democrats, for anyone complicit in this betrayal — to reverse course. But it will require more than optics and spin. It demands moral courage. It demands they face the parents they misled and admit: we were wrong. \n\nUntil then, the message to parents is loud and clear: your role is optional, your voice is disposable and your children are political pawns. And that is unforgivable.","summary":"Progressive leaders are quietly tiptoeing away from the radical reaches of the transgender movement, but don't be fooled.","url":"https://www.dailymail.co.uk/news/article-14572945/transgender-hollywood-stars-children-JILLIAN-MICHAELS.html","image":"https://i.dailymail.co.uk/1s/2025/04/04/20/96932077-0-image-m-41_1743794073149.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/21/4555230140548792634/1024x576_MP4_4555230140548792634.mp4","publish_date":"2025-04-05 18:20:37","author":"Editor,Jillian Michaels","authors":["Editor","Jillian Michaels"],"language":"en","source_country":"gb","sentiment":-0.411},{"id":308058342,"title":"With \"Lazarus,\" the creative force behind \"Cowboy Bebop\" soothes our present vibe with his own","text":"“Cowboy Bebop” debuted on Adult Swim on an unsuspecting Sunday in September 2001, nine days before one Tuesday would shatter our sense of security forever: 9/11.\n\nThe rest of the shows on the mature animation block were comedies while “Cowboy Bebop” was anime, although unlike nearly anything else the genre’s American aficionados were accustomed to. Shinichirō Watanabe's vision marries futuristic visuals with realism, with the series' jazz score treated as something to be felt and then absorbed, like dry skin lathered in shea butter. Thus, the auteur shaped the Adult Swim brand’s lasting association with a vibe – that indescribable impression that made “Cowboy” character Spike Spiegel as much of a blue romantic as an ace bounty hunter.\n\nWatanabe's latest, “Lazarus,” calls on familiar hints while transporting us to a future near enough to feel like the present, anxieties included. In his version of 2052, the cause of the world’s problems is its presumed cure: a drug called Hapna designed by a celebrated neuroscientist named Dr. Skinner and promoted as a panacea for suffering — as in, all somatic and psychic ills.\n\nHapna’s affordability and touted lack of side effects led to its global usage, followed by Skinner’s sudden disappearance. Three years after its launch, however, he resurfaces to announce that the drug was designed to be fatal three years after its ingestion, even if someone only took it once. And, surprise, only he has the antidote, giving the public 30 days to find him before the first Hapna users start dropping.\n\n“Lazarus” is named for the underground team assembled to find Skinner, and “Cowboy Bebop” aficionados may not be able to ignore surface parallels between this and Watanabe’s late ‘90s jam session.\n\nThere’s a kid hacker, a former agent who shoots straight and loves starring in honey traps, and in the fore is Axel Gilberto, an acrobatic parkour nut and escape artist recruited straight out of the clink where he’s serving an 888-year sentence. (Which, he explains, isn’t due to a horrific crime but legal math; each failed escape doubles a person’s sentence.)\n\nAxel even resembles Spike, although he fights like John Wick, whose creator, Chad Stahelski,​ designs the action sequences. But those intersperse a plot that takes the team through wild cityscapes where we witness firsthand how people respond to knowing a countdown clock to their end is already in motion.\n\nSome keep living as they were. Others, including a hedonistic club owner fond of abusing women, receive their just desserts, late though the hour may be. As with “Cowboy Bebop,\" the action in \"Lazarus\" matches a sonic quilt connecting Kamasi Washington’s jazz sensibilities with electronic landscapes by Bonobo and Floating Point. Familiarity with these names or their musical styles isn't essential. What matters is that the whole melds into an undeniable vibe.\n\nVibes, as a concept, have been maligned recently in the popular imagination. Pundits use the term disparagingly as a catch-all to describe a mode of thinking that’s entirely detached from hard data. The doom and gloom about an economy that was, until recently, described by The Economist as “the envy of the world” was dubbed a “vibe-cession.”\n\nThe frenzied excitement generated by Vice President Kamala Harris’ 11th-hour entry into the 2024 presidential race was questioned, if not dismissed, as a “campaign powered by vibes” by a “vibes candidate.”\n\nMost of us consider vibes to be positive or neutral, a way of giving form to gut sensations or the buzz in your skin. Vibes, good ones, dominate Watanabe’s oeuvre via the curated playlists that bounce or glide behind his imagery. Whether the music adds extra flavor to his raging action scenes or amplifies an episode’s lazy backstroke through existential loneliness, you feel his work’s best moments in your bones.\n\nThat specialness makes “Cowboy Bebop” the prescription for sleepless nights, whether it’s because you can’t or don’t want to. The same is true of 2004's “Samurai Champloo” and its throbbing hip-hop heartbeat. The soundtrack to Watanabe’s 2014 fantasy “Space Dandy” is more upbeat compared to the music coloring “Lazarus.”\n\n\"Lazarus\" (Courtesy of Adult Swim )Out of all those cited shows, “Lazarus” most directly plugs into current anxieties, beginning with its voiceover narrations opening each episode. “I wonder why is it that life always requires us to overcome so much grief, suffering and all that other cr*p?” a woman’s voice asks.\n\nShe goes on to say she jumped at the chance to take Hapna because it cured the pain of heartbreak. “I thought, ‘That's weird. How can a broken heart ever be painless? Isn't this too good to be true? What if I'm just being duped?’ Those thoughts did cross my mind.”\n\nThe last five years have given us a fresh appreciation for calm, and Calm. But long before the pandemic moved us to take up meditation or practice our breathing techniques, there was Adult Swim’s late-night block, a loopy feast for the head merging absurdist comedy and art and mainstreaming anime.\n\nWhile celebrity-voiced ASMR videos trended during the pandemic, Adult Swim quietly added Ambient Swim to Max, the streaming service owned by its parent company, Warner Bros. Discovery. Nearly every episode of Ambient Swim is a continuous loop of animated images growing and dissolving into each other, separated by style and theme. (One episode features pixelated “Rick & Morty” scenescapes; another is a long, mostly live-action sequence montage of aquarium outdoor shots goofily narrated by the star of “Joe Pera Talks with You.”)\n\nThese are meant to be the anesthetizing accompaniment to playlists featuring purveyors of sonic wallpaper made to help your whole body chill out — a vibe-fest, on demand.\n\nWant a daily wrap-up of all the news and commentary Salon has to offer? Subscribe to our morning newsletter, Crash Course.\n\n“Lazarus” arrives in the wake of “Common Side Effects,” another series casting the pharmaceutical industry as its own plague on the human condition. At the heart of both stories are questions asking whether pain is a necessary part of being human and, more pointedly, whether our carelessly destructive species deserves to exist. “Some folks are happy to hear the world is ending,” a woman in “Lazarus” admits.\n\nShe says this in a tone lacking emotional spikiness, accepting that truth as it is. This evenly delivered sobriety amid massive uncertainty is its own kind of narcotic, much in the same way that the trippy sequences in “Common Side Effects” wouldn’t be out of place on a hash bar’s video screen.\n\nLike the space cowboys and ronin searching for purpose in his past series, the personalities populating “Lazarus” are anguished people navigating a broken world, refusing to resign themselves to the long dark but not beyond relaxing into the reality in front of it. Sometimes vibes are all we’ve got, and it's OK to be good with that feeling.\n\n\"Lazarus\" premieres at midnight on Saturday, April 5, on Adult Swim.","summary":"If this is the end of the world as we know it, Shinichirō Watanabe's may help you feel a bit closer to fine","url":"https://www.salon.com/2025/04/05/with-lazarus-the-creative-force-behind-cowboy-bebop-soothes-our-present-vibe-with-his-own/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2025/04/lazarus_1jpg.jpg ?>","video":null,"publish_date":"2025-04-05 17:30:06","author":"Melanie McFarland","authors":["Melanie McFarland"],"language":"en","source_country":"us","sentiment":0.222},{"id":308044010,"title":"What Trump shockingly told Kamala Harris when she called him to concede the 2024 election","text":"Donald Trump caught former Vice President Kamala Harris and her aides off guard when the typically abrasive president politely praised her as a “tough cookie” and congratulated her on running a “great” campaign when she called him to concede his victory in the 2024 election, according to a new book.\n\n“I’m calling to concede. It was a fair election. The peaceful transfer of power is important. It’s important to the country,” Harris reportedly told Trump on the phone the day after the election, according to author Chris Whipple’s new book “Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History.”\n\nHowever, she could not help but take a light jab at the divisive president-elect at the time, adding “I hope you’re president for all Americans.”\n\nInstead of taking that comment personally and snapping back, however, Trump was cordial and even praised Harris’ late-entry campaign as he basked in his historic win, according to Whipple.\n\n“You’re a tough cookie. You were really great. And that Doug — what a character! I love that guy,” the now-president said, referring to Harris’ husband, Doug Emhoff.\n\nOne of Harris’ aides, however, found the president’s tone — a complete change from his campaign rhetoric — “odd and inappropriate.”\n\n“I was like, what?” the unidentified aide barked. “Honestly, I felt like, what is this? It’s so manipulative. He’s a sociopath.”\n\nThe traditional concession call almost never happened, however, due to technical difficulties — adding to the awkwardness of the moment, Whipple said in the book, according to an excerpt obtained by the Daily Mail.\n\nHarris’ campaign Chief of Staff Sheila Nix and her White House Chief of Staff Lorraine Voles set up the call from Harris’ Naval Observatory home in Washington, DC — but when she phoned Trump, the calls wouldn’t merge with Harris’ phone.\n\nInstead, the Voles called Harris from her phone, and she and Nix “pressed the phones together,” Whipple wrote.\n\nAs Harris heard Trump’s voice come through, she “felt the weight of the crushing defeat,” according to Whipple.\n\nWhipple’s new book will hit the shelves Tuesday.","summary":"Trump was cordial and even praised Harris' late-entry campaign as he basked in his historic win, according to a new book.","url":"https://nypost.com/2025/04/05/us-news/what-trump-shockingly-told-kamala-harris-when-she-called-him-to-concede-the-2024-election/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/2024-washington-dc-americans-cast-101776131.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/U83Lqc1t-RyIcpnTz.mp4","publish_date":"2025-04-05 16:51:00","author":"Patrick Reilly","authors":["Patrick Reilly"],"language":"en","category":"politics","source_country":"us","sentiment":-0.139},{"id":308044064,"title":"I could have won: Kamala Harris blames Biden for 2024 loss, tells friends she could've beaten Donald Trump if Joe hadn't delayed his exit until July","text":"After former vice president Kamala Harris' defeat to US president Donald Trump in the 2024 election, she reportedly told her friends that she would have won the election if former US president Joe Biden had quit running for re-election earlier, as per the author of a new book on the 2024 presidential election, reported the New York Post.Kamala Harris Believes Joe Biden’s Delay Cost Her the 2024 Election In the biography titled 'FIGHT: Inside the Wildest Battle for the White House', written by The Hill reporter Amie Parnes and co-author Jonathan Allen, Harris believed Biden's delay in exiting the race until July of 2024 deprived her of valuable campaign time and an opportunity to win the Democratic nomination, according to the report.Harris, who had been confident of her prospects on the eve of Election Day, was said to be floored by the results, reported the New York Post. Both she and Minnesota Governor Tim Walz were said to be shocked when the results weren't favourable to them. Parnes narrated during the podcast 'Somebody’s Gotta Win with Tara Palmeri' that Walz, the evening he returned to his hotel room, was so stunned by the outcome that he could not even able to speak, as per the report.While Harris even asked staffers who were explaining the situation to her, Are you sure? Have we done a recount? Should we do a recount?”, Parnes shared in the podcast.Parnes also claimed that, “They thought that they were going to win. And so, you know, when they come back now and say, ‘Oh no, we didn’t really have a chance.’ No, that’s not what they were thinking. They thought they were going to win,” quoted the New York Post.Afterwards, Harris and some of her staff members were said to have felt duped by top campaign officials who believed that the campaign was going great, according to the report. Harris bought the hype and thought she was on a path to victory, as indicated by Parnes. The anger within Harris' team intensified as they felt they had been gaslit by insiders who had underplayed the problems facing them, as per New York Times. Parnes and Allen wrote in their book, “She could have won, she told friends, if only the election was later in the calendar — or she got in earlier. In other words, Joe Biden was to blame,” quoted Fox News.Barack Obama Did Not Support HarrisThe book also disclosed that some Democrats, including former president Barack Obama, doubted whether Harris would win the election, reported the New York Post. During an interview with MSNBC, Allen said that Obama didn’t think that she was the best choice for Democrats, and he worked really behind the scenes for a long time to try to have a mini-primary, or an open convention, or a mini-primary leading to an open convention, did not have faith in her ability to win the election,” quoted the New York Post.FAQsHow did Kamala Harris react to her defeat? Harris was floored by her loss and was in disbelief, even asking if a recount could be done as she was shocked with the results, as per the report.Did Kamala Harris blame Joe Biden for her loss? Yes, Harris reportedly blamed Biden for waiting too long to exit the race, which, in her view, gave her less time to prepare for the election.","summary":"Kamala Harris attributed her 2024 presidential election loss to Joe Biden's delayed exit from the race. A new book suggests Harris felt deprived of crucial campaign time. The book claims Harris and her team were confident of winning until the results were unexpected. It also reports that Barack Obama doubted her chances of securing victory.","url":"https://economictimes.indiatimes.com/news/international/us/i-could-have-won-kamala-harris-blames-biden-for-2024-loss-tells-friends-she-couldve-beaten-donald-trump-if-joe-hadnt-delayed-his-exit-until-july/articleshow/120019910.cms","image":"https://img.etimg.com/thumb/msid-120019962,resizemode-4,width-1200,height-900,imgsize-22446,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 15:58:55","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.465},{"id":308076108,"title":"The View’s Ana Navarro Goes Hardcore: 'I Would Prefer Joe Biden In a Coma Over Trump'","text":"ABC’s The View\n\nJOY BEHAR: The 2024 presidential campaign was even more of a mess for Democrats than we even saw. According to several new books about the last few months of the election, that’s- they're writing books about it now- In one book, Biden adviser Ron Klain claimed there was a lot of concern that Biden couldn't keep up with the debate prep, and he would fall asleep by the pool.\n\nSARA HAINES: Me, too.\n\nALYSSA FARAH GRIFFIN: The same.\n\nBEHAR: Me too. \n\nAnother book claims President Obama didn't want VP Harris to take Biden's place, his choice was Governor Gretchen Whitmer. \n\nNow, these are books that people are writing so we have to take a lot of this, I think, with a bit of a grain of salt. I mean, if any of this is true, what can Democrats do about it now? I mean, it seems to me this ship is sailed. What's the point?\n\nSUNNY HOSTIN: I'd rather- read a book- about what Trump did to us-- when he was president, and what he's doing to us now.\n\nBEHAR: Yeah.\n\nHOSTIN: I’m much more interested in that. I'm not interested in- in looking back. I mean, we’re in the- we’re in a constitutional crisis right now.\n\nBEHAR: And do we really believe that Trump is not falling asleep in the chair at Mar-a-Lago?\n\nFARAH GRIFFIN: Yeah, respectfully, there were more books about Trump than I feel like anyone ever needed to read.\n\nANA NAVARRO: I wish he did.\n\nHAINES: You wrote one.\n\nBEHAR: I did. I did.\n\nFARAH GRIFFIN: You did. We’re in a moment we’re in [sic.] where a lot of people are scared, they're nervous, they’re worried that we're seeing America fundamentally changed. \n\nAnd, a reason for that, not just the little asterisk, is that Joe Biden did not win, did not step aside in time to allow someone else to win-\n\nBEHAR: Right.\n\nFARAH GRIFFIN: And I do think it is a story that warrants some reflection because even beyond the electoral consequences of Trump winning and what we're going to experience the next four years, I think there is also- what I'm struck by- and I think highly of Biden- \n\nBEHAR: Yeah.\n\nFARAH GRIFFIN: People always think I'm, like, so critical just cause I think he needed to step aside and give someone else a chance- he does start to come off the more we're learning like ‘I alone can fix it.’ It almost comes off Trumpian.\n\nBEHAR: And it was late, also. He was late.\n\nFARAH GRIFFIN: Well, he should have done it sooner. \n\nBEHAR: Right. Right.\n\nFARAH GRIFFIN: If he had, after the debate, that would have given someone enough runway to actually run a winning campaign.\n\nHAINES: Well, I would say the learning lesson here is ‘listen to the voters,’ because one thing that really pissed me off, as an independent- and I was one of the people that sat here and said, after seeing President Biden, ‘I voted for Biden, I really liked Biden.’ \n\nFARAH GRIFFIN: Yeah.\n\nHAINES: I actually had been happy with him and I would have voted for him if he continued to run. \n\nBut I did look at him and think, ‘I think maybe you do need to step aside,’ and now the rumors that we're hearing- starting to make sense. And what happened is, everyone said, ‘You're disloyal if you say that, shut up and fall in line,’ and that's why people want to be independents these days. Because, partisan politics- they lie. \n\nIt was the Democratic Party that made that choice, that said, ‘To be- you're betraying him if you call it like you see it.’ And the point here was is [sic.], he wasn't necessarily fit to run for another four years.\n\nBEHAR: Okay, okay.\n\nNAVARRO: Look, I know Ron Klain. I was- texting with him yesterday. He's one of the longest advisers and very, very close to Biden, so this is probably very painful to them both.\n\nBEHAR: So why say it- or write it? What’s- It's kind of mean.\n\nHOSTIN: He’s saying that the framing’s wrong.\n\nNAVARRO: Because they- you know what? Folks get caught up talking about post mortems of campaigns-\n\nBEHAR: Oh, they want to sell books.\n\nNAVARRO: And talking to reporters who- are their friends. And usually I like these books, usually I like the- campaign gossip- of- Primary Colors after Clinton, or O after Obama, or Game Change after McCain. \n\nBut, these are not normal times, so I'm just not interested in palace gossip from a year and a half ago because I'm more- more interested about the children who are losing food, because this government is cutting off their program, and the federal workers who are losing their jobs, and I'm interested about the deportation people who have no due process and I'm- you know- interested in the fact that we are at war with -- a trade war with- the rest of the world, and threatening allies like Panama and- you know- and Greenland.\n\nFARAH GRIFFIN: Some of us warned that- some of us warned that all of this, specifically, was coming. You know, there were people beating the drum, explaining explicitly what a second Trump term would be. \n\nHOSTIN: Project 2025, everyone.\n\nNAVARRO: Right.\n\nFARAH GRIFFIN: They were saying it but the Democrats could not put up something formidable enough to beat it.\n\nHAINES: Well, and two things can be- two things can be true at once, you can despise Trump, and everything the Republicans stand for, and still be able to see straight about what happened here, and denying it and telling people you're not seeing what you're seeing is never going to win voters. Ever.\n\nHOSTIN: I bet you every single person that voted- for- for Kamala Harris wishes that Kamala Harris won right now.\n\nHAINES: I do.\n\nHOSTIN: I- I bet you that- and I bet you, there are a lot of people that voted for Trump, that wish that Kamala Harris was in the White house.\n\nNAVARRO: You know, there are probably a lot of people who didn't vote, who are probably regretting it now.\n\nHOSTIN: Yes.\n\nBEHAR: To me this is- to me this is-\n\nNAVARRO: You know, I always said I would prefer- you know- the- Joe Biden in a coma, over Trump, and I maintain that.\n\nBEHAR: We’ll be right back.","summary":"As the books tumble out exposing the Democrats hiding the mental decline of Biden -- and that includes the press -- some hardcore partisans are going to trash the trend. Who needs these books? \n\nOn ABC’s The View Friday, during the usual shrieking against President Trump, they mentioned former Biden chief of staff Ron Klain telling author Chris Whipple that by debate time in 2024, Biden was in no shape to run for president, but Ana Navarro still maintained that she would rather “have Joe Biden in a coma over Trump.”\n\nJoy Behar raised the subject, saying that Klain “claimed there was a lot of concern that Biden couldn’t keep up with the debate prep, and he would fall asleep by the pool.”\n\n \n\n\n\n\n\n \n\nThe idea of theoretically the most powerful man in the world being in that health would have alarmed many people. Sarah Haines quipped “me too,” while Alyssa Farah Griffin agreed. \n\nBehar tried to brush the allegations off with the comment, “If any of this is true, what can Democrats do now? I mean, it seems to me t","url":"https://www.newsbusters.org/blogs/nb/david-milliken/2025/04/05/views-ana-navarro-goes-hardcore-i-would-prefer-joe-biden-coma","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-04/The%20View-11_20_26%20am-2025-04-04-0.jpg?itok=LJjHu5ui","video":null,"publish_date":"2025-04-05 15:37:00","author":"David Milliken","authors":["David Milliken"],"language":"en","source_country":"US","sentiment":-0.708},{"id":308025724,"title":"Kamala Harris Was Left Speechless by Trump’s Shocking Victory","text":"Former Vice President Kamala Harris was so taken aback by President Donald Trump’s shocking win in November that she could barely speak.\n\nAs the reality of her defeat set in, Harris repeatedly asked her aides “if they’d actually lost” and whether “they were prepared to do a recount.”\n\nHarris’s running mate, Minnesota Gov. Tim Walz, “had the same exact reaction” as he watched from his room at D.C.’s Mayflower Hotel, Amie Parnes, a senior correspondent for The Hill, told TMZ on Friday. \n\n“They really thought they were going to win,” Parnes said.\n\nParnes—whose book on the matchup, Fight, was released this week—said Harris was left “without words” at her home in Washington, D.C., when the results came in November 5.\n\nCo-authored with NBC journalist Jonathan Allen, Parnes’s book reveals Harris was disappointed by a perceived lack of support from former President Barack Obama and ex-Speaker Nancy Pelosi.\n\n“She was really looking for [Obama’s] approval this time around, and was really kinda underwhelmed by his support in the very end,” Parnes said. “She was really upset by the fact he took several days to get behind her.” \n\n“There were some very hurt feelings on her part,” Parnes added, noting that both she and her co-author “greatly believe” the Harris-Walz campaign could have sailed to victory had there not been “so many missteps along the way.”","summary":"Big Event Media / Getty Images for HumanX ConferenFormer Vice President Kamala Harris was so taken aback by President Donald Trump’s shocking win in November that she could barely speak.\n\nAs the reality of her defeat set in, Harris repeatedly asked her aides “if they’d actually lost” and whether “they were prepared to do a recount.”\n\nHarris’s running mate, Minnesota Gov. Tim Walz, “had the same exact reaction” as he watched from his room at D.C.’s Mayflower Hotel, Amie Parnes, a senior correspondent for The Hill, told TMZ on Friday. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/kamala-harris-left-speechless-by-trumps-shocking-victory/","image":"https://www.thedailybeast.com/resizer/v2/2ML66ZSFZZG7VCN45DQGNKK2QI.jpg?smart=true&auth=ede7352736684e82339856780d309af5a8bad34410232b975ed6a95cbea8aac2&width=1440&height=1080","video":null,"publish_date":"2025-04-05 15:23:13","author":"Will Neal","authors":["Will Neal"],"language":"en","category":"politics","source_country":"us","sentiment":-0.561},{"id":308036954,"title":"Obama lashes out at Trump","text":"Former US President Barack Obama has said that he is “deeply concerned” by the policies that the country’s current leader, Donald Trump, has pursued since the start of his second term in office.\n\nDuring his speech at Hamilton College in New York State on Thursday, Obama criticized the Trump administration’s protectionist economic policies, attempts to tackle federal spending, clampdown on immigration, and treatment of the media.\n\nHe denounced the sweeping tariffs imposed by Trump earlier this week on the majority of US trading partners, saying: “I do not think what we just witnessed… is going to be good for America.”\n\nHowever, the 63-year-old Democrat stressed that the tariffs are just one policy, and that he is “more deeply concerned with a federal government that threatens universities if they don't give up students who are exercising their right to free speech,” referring to actions taken against pro-Palestinian demonstrators.\n\nThe Trump administration’s pressure on law firms and its decision to bar AP journalists from accessing the Oval Office reflect “a kind of behavior [that] is contrary to the basic compact we have as Americans,” the former president said.\n\n“Imagine if I had pulled Fox News’ credentials from the White House press corps. It is unimaginable that the same parties that are silent now would have tolerated behavior like that from me or a whole bunch of my predecessors,” he argued.\n\nThe former president concluded his message by saying that “history zigs and zags and there are times of conflict and there are times of stupidity and there are times of danger.”\n\nTrump slammed Obama at the height of the race for the White House last year, calling the former president “a jerk” and saying that he “divides this country” by campaigning for then-Democratic contender Kamala Harris.","summary":"Trump’s new tariffs on the majority of US trading partners will not be good for the country, Obama has warned \nRead Full Article at RT.com","url":"https://www.rt.com/news/615272-obama-trump-us-tariffs/","image":"https://mf.b37mrtl.ru/files/2025.04/article/67f13ac785f54076d811638c.jpg","video":null,"publish_date":"2025-04-05 15:06:32","author":null,"language":"en","source_country":"ru","sentiment":-0.452},{"id":308037072,"title":"Conservatives would rather vote Trump and lose everything","text":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\nWe were right. We warned the world about the dangers of President Donald Trump, and yet we were mocked, dismissed, and derided. Too many people thought we were being disingenuous, crying wolf, or just being unfairly partisan. And we weren’t even making an argument beyond, “LISTEN TO WHAT HE’S SAYING!” \n\nAs a result, we now get tweets like this, where we were called:\n\nOr this prominent libertarian, who claims that “nobody knew how bad” Trump was, and that the only people who were right were those with “clinical case(s) of Trump derangement syndrome.” \n\n“Nobody” is a funny way of saying “millions of people who tried to warn us.” \n\nAnd now that Trump has irrevocably destroyed the United States’ standing in the world and led us to calamitous economic disaster, they all shake their heads about how “nobody” could’ve known. \n\nBut I don’t want to pick on these two, because at least they’re admitting to their errors. That’s a good thing, truly. Trump was elected. The damage is done. The question now is how we salvage anything out of this mess. And if the message voters get out of this is that Republicans are bad for the economy, that will at least set the stage for a liberal revival down the road. \n\nInstead, I want to feature a different kind of MAGA member—the one that is willing to destroy their own life in order to hate the right people. \n\nThis was posted—and quickly deleted by moderators—on the r/Conservative subreddit, which requires members to prove their conservative bona fides before they are allowed to post:\n\nI voted for Pres Trump, and I'd vote for him again.\nNot only does he have a proven track record, but Kamala is blatantly incompetent, was a disaster of a candidate, and would have been worse as a President. Her picture should appear in the dictionary along with the entry for \"ignoramous\".\n\nEven so, l'm not one who blindly supports all that Pres Trump is doing. I'm very happy with his having virtually eliminated illegal immigration and am ecstatic that finally the rampant fraud waste and abusive is being stomped out. I love his outright support for Israel. I greatly appreciate his attempts to eliminate males being allowed to compete in female sports. And these are huge; that's for sure.\n\nHowever, there are several things he's doing that I am NOT happy with.\n\nThe things this person isn’t happy with? Trump’s decimation of their 401(k), love for Putin and the abandonment of Ukraine, belligerence against Canada, and imperialistic obsession with Greenland and Panama. \n\nDespite the forum’s refusal to let the post stand—and the anger of fellow MAGA commenters who lambasted them for “fake” conservatism—it’s reasonable to disagree with your own party and the president. On the left, we don’t have a problem disagreeing with our leaders. In fact, at times, it can even undermine us. \n\nRegardless, the issue here isn’t that this user disagreed with Trump. \n\nIt’s that they admit that their own financial situation has significantly suffered—and that was written on Thursday before the Dow dropped another 5% and the NASDAQ almost 6%—but that they would still vote for Trump because a tiny handful of trans women can no longer play sports.\n\nAs conservatives like this one inherently admit, if Trump is fucking up their finances, that means that President Joe Biden actually improved them. You don’t fuck up something that is already fucked up. But they would rather lose their shirts than have immigrants work the fields and slaughterhouses, or for trans women to be treated with dignity and respect. “Waste and fraud” is just what they call it so they can pretend that they’re not bigoted assholes. \n\nAnd that’s not even getting into the obvious sexism and racism directed at former Vice President Kamala Harris. \n\nShe would have been worse as president? How, exactly? Would she have destroyed the United States’ standing in the world while cratering the global economy? Of course not. There’s only one reason they could pretend she was an “ignoramus,” and we know what that is. \n\nBut it just goes to show that the conservative movement’s embrace of division, hate, and bigotry has overridden people’s instincts for self-preservation. \n\nThey would rather vote for Trump and lose everything than support a Black woman.","summary":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\n\n\n\nWe were right. We warned the world about the dangers of President Donald Trump, and yet we were mocked, dismissed, and derided. Too many people thought we were being disingenuous, crying wolf, or just being unfairly partisan. And we weren’t even making an argument beyond, “LISTEN TO WHAT HE’S SAYING!” \n\n\n\nAs a result, we now get tweets like this, where we were called:\n\n\n\n\n\n\n\n\n\n\n\nOr this prominent libertarian, who claims that “nobody knew how bad” Trump was, and that the only people who were right were those with “clinical case(s) of Trump derangement syndrome.” \n\n\n\n\n\n\n\n\n\n\n\n“Nobody” is a funny way of saying “millions of people who tried to warn us.” \n\n\n\nAnd now that Trump has irrevocably destroyed the United States’ standing i","url":"https://www.dailykos.com/story/2025/4/5/2314575/-Conservatives-would-rather-vote-Trump-and-lose-everything?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1406040/story_image/AP24307797529993.jpg?1741305990","video":null,"publish_date":"2025-04-05 15:00:11","author":"kos","authors":["kos"],"language":"en","category":"politics","source_country":"US","sentiment":-0.363},{"id":308086278,"title":"‘I’m not going anywhere’: Kamala Harris steps back into the fight","text":"Former Vice President Kamala Harris made a surprise appearance at Leading Women Defined, a leadership summit for Black women, in California Thursday, telling the audience that she plans to stay in the fight. \n\n“I’ll see you out there. I’m not going anywhere,” she said.\n\nIn her first public appearance since the November election, Harris urged the audience to have courage of their convictions. \n\n“Courage is contagious,” she said.\n\nContinuing, Harris said that “these are the things that we are witnessing each day in these last few months in our country. And it understandably creates a great sense of fear. Because, you know, there were many things that we knew would happen. Many things—I’m not gonna say ‘I told you so.’” \n\n“I swore I wasn’t going to say that,” she added.\n\nThe speech reaffirmed reports that Harris plans to remain active in politics. According to Politico, Harris privately told her allies that “I am staying in the fight.”\n\nSpeculation surrounding her potential bid to replace California Gov. Gavin Newsom has been a major topic of discussion. On Wednesday, former Secretary of Health and Human Services Xavier Becerra announced his plans to join the race, saying he did not take into account whether Harris plans to run.\n\nRegardless of what happens with California’s gubernatorial race, one thing is certain: Harris isn’t going anywhere.","summary":"Former Vice President Kamala Harris made a surprise appearance at Leading Women Defined, a leadership summit for Black women, in California Thursday, telling the audience that she plans to stay in the fight. \n\n\n\n“I’ll see you out there. I’m not going anywhere,” she said.\n\n\n\nIn her first public appearance since the November election, Harris urged the audience to have courage of their convictions. \n\n\n\n“Courage is contagious,” she said.\n\n\n\nContinuing, Harris said that “these are the things that we are witnessing each day in these last few months in our country. And it understandably creates a great sense of fear. Because, you know, there were many things that we knew would happen. Many things—I’m not gonna say ‘I told you so.’” \n\n\n\n“I swore I wasn’t going to say that,” she added.\n\n\n\n\n\n\n\n\n  \n\n\n  \nYouTube Video\n\n\nThe speech reaffirmed reports that Harris plans to remain active in politics. According to Politico, Harris privately told her allies that “I am staying in the fight.”\n\n\n\nSpeculation surrounding her poten","url":"https://www.dailykos.com/stories/2025/4/4/2314545/-I-m-not-going-anywhere-Kamala-Harris-steps-back-into-the-fight?pm_campaign=blog&pm_medium=rss&pm_source=EcoJustice","image":"https://cdn.prod.dailykos.com/images/1364396/story_image/AP24306835460719.jpg?1730737847","video":null,"publish_date":"2025-04-05 14:53:33","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"us","sentiment":-0.182},{"id":308094448,"title":"‘I’m not going anywhere’: Kamala Harris steps back into the fight","text":"Former Vice President Kamala Harris made a surprise appearance at Leading Women Defined, a leadership summit for Black women, in California Thursday, telling the audience that she plans to stay in the fight. \n\n“I’ll see you out there. I’m not going anywhere,” she said.\n\nIn her first public appearance since the November election, Harris urged the audience to have courage of their convictions. \n\n“Courage is contagious,” she said.\n\nContinuing, Harris said that “these are the things that we are witnessing each day in these last few months in our country. And it understandably creates a great sense of fear. Because, you know, there were many things that we knew would happen. Many things—I’m not gonna say ‘I told you so.’” \n\n“I swore I wasn’t going to say that,” she added.\n\nThe speech reaffirmed reports that Harris plans to remain active in politics. According to Politico, Harris privately told her allies that “I am staying in the fight.”\n\nSpeculation surrounding her potential bid to replace California Gov. Gavin Newsom has been a major topic of discussion. On Wednesday, former Secretary of Health and Human Services Xavier Becerra announced his plans to join the race, saying he did not take into account whether Harris plans to run.\n\nRegardless of what happens with California’s gubernatorial race, one thing is certain: Harris isn’t going anywhere.","summary":"Former Vice President Kamala Harris made a surprise appearance at Leading Women Defined, a leadership summit for Black women, in California Thursday, telling the audience that she plans to stay in the fight. \n\n\n\n“I’ll see you out there. I’m not going anywhere,” she said.\n\n\n\nIn her first public appearance since the November election, Harris urged the audience to have courage of their convictions. \n\n\n\n“Courage is contagious,” she said.\n\n\n\nContinuing, Harris said that “these are the things that we are witnessing each day in these last few months in our country. And it understandably creates a great sense of fear. Because, you know, there were many things that we knew would happen. Many things—I’m not gonna say ‘I told you so.’” \n\n\n\n“I swore I wasn’t going to say that,” she added.\n\n\n\n\n\n\n\n\n  \n\n\n  \nYouTube Video\n\n\nThe speech reaffirmed reports that Harris plans to remain active in politics. According to Politico, Harris privately told her allies that “I am staying in the fight.”\n\n\n\nSpeculation surrounding her poten","url":"https://www.dailykos.com/stories/2025/4/4/2314545/-I-m-not-going-anywhere-Kamala-Harris-steps-back-into-the-fight?pm_campaign=blog&pm_medium=rss&pm_source=Climate Hawks","image":"https://cdn.prod.dailykos.com/images/1364396/story_image/AP24306835460719.jpg?1730737847","video":null,"publish_date":"2025-04-05 14:52:52","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"us","sentiment":-0.182},{"id":308021722,"title":"Has ‘Saturday Night Live’ Become Overly Focused on Politics?","text":"“Saturday Night Live” first premiered on October 11, 1975. Since that time, it has seen its fair share of controversy.\n\nIn the “SNL” cold open, a Pete Hegseth impersonator shared war plans with high school girls, tackling the news that the Trump administration accidentally shared secret war plans with “The Atlantic” journalist Jeffrey Goldberg when they unknowingly added him to their group chat.\n\nArticle continues below advertisement\n\nIf the “Saturday Night Live” cold open wasn’t enough, Colin Jost also took aim at the Secretary of Defense during the “Weekend Update” segment. While holding up a photo of Hegseth holding up a zero, Jost quipped, “Secretary of Defense Pete Hegseth, seen here indicting how many days since his last drink.”\n\nHe also made a play on the iconic “Forrest Gump” line, “Life is like a box of chocolates,” adding, “Except for Hegseth, life is more like a box of wine.”\n\nArticle continues below advertisement\n\nSome irate users took to social media in order to claim that Jost committed slander by joking about Hegseth’s alleged alcohol use. “Must be some way to derail these c-cky b-stards who have such total disregard for the truth,” one viewer wrote. “Pete is clearly a target. Called him a drunk who gave away secrets. Slander much?”\n\n“You really need to go after the clowns at ‘SNL’ for their ‘hit job’ open on Pete Hegseth. Even by their standards, it was pure slander,” another agreed.\n\n“’SNL’ mocks Pete Hegseth, but real patriots know he’s a warrior cleaning up global messes,” a third user commented. “God bless our troops and strong leaders.”\n\nArticle continues below advertisement\n\nRecent jokes about Donald Trump, Vice President J.D. Vance, and the appearance of then-Vice President Kamala Harris right before the election has made many wonder if “SNL” is becoming too political for its own good.\n\nWhile “SNL” has always engaged in political satire, many users have claimed that they have noticed an uptick in political commentary, especially during the cold opens and “Weekend Update” segments.\n\nSome of these viewers also feel that these political jokes are no longer just satire, and are instead being delivered with a pointed agenda.\n\nArticle continues below advertisement\n\nWhether that’s true or not, some would argue that modern-day politics have become so bizarre that it is hard to create satire that is more outrageous than actual events. Many have criticized his new friendship with Elon Musk and the workings of DOGE, while others have questioned his desire to take over Greenland and make Canada the 51st state.\n\nArticle continues below advertisement\n\nUnfortunately, the political climate of the United States is more polarized than ever. The heightened sensitivity around political issues means that political satire, regardless of its intent, is likely to be met with criticism from either one side or the other. Even if “Saturday Night Live” is no more political than it has been in the past, it only seems that way during the current political climate.\n\nThe nature of social media has also been fueling the flames of derision. Algorithmic filtering means that people primarily see content that aligns with their existing beliefs, which means that people are more likely to see posts from those who agree with their perspective.\n\nIn other words, seeing posts from like-minded peers that claim that “SNL” is too political will only reinforce that belief, and, in an echo chamber, strong emotions like outrage are easier to be shared and amplified, thus contributing to the spread of polarizing content.\n\nSo, in a sense, no, “Saturday Night Live” is no more political than it has ever been, but depending on who you follow, social media sure might make it seem that way.","summary":"Internewscast Journal\n\nInternewscast\n\n\n“Saturday Night Live” first premiered on October 11, 1975. Since that time,&#8230;\n\n\nThis Post: Has &#8216;Saturday Night Live&#8217; Become Overly Focused on Politics? first appeared on Internewscast Journal","url":"https://internewscast.com/entertainment/has-saturday-night-live-become-overly-focused-on-politics/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-04-05 14:37:17","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.064},{"id":308014558,"title":"Kamala Harris was 'completely shocked' by election results as she speaks out for first time in months","text":"Kamala Harris was apparently left 'completely shocked' after losing to Donald Trump in the 2024 US presidential race last November.\n\nThe former vice president was confirmed as the Democratic presidential nominee just a few months before the election after then-president Joe Biden dropped out of the race.\n\nTrump ultimately beat Harris to the keys for the White House, and the Democrat politician has lingered in the shadows ever since.\n\nHowever, the former vice president spoke at the Leading Women Defined Summit in California this week (April 3), where she spoke on the importance of being courageous despite this fear and also warned of further issues along the road under Trump’s administration.\n\nHarris said: “When one person, when a few stand with the courage, that is the courage exhibited by the leaders in this room every day. \n\n\"To have the courage to say I feel fear, the courage to say what is happening is wrong, the courage to say that there is a way that we must chart to get through this.\n\n\"Understanding our power in the democracy that we still have if we hold on to it. Courage is contagious.\"\n\nThe Hill correspondent Amie Parnes, who is the co-author of FIGHT: Inside the Wildest Battle for the White House - a book about the 2024 election - has been speaking about Harris' camp being left 'shocked' as the results came in.\n\n\"She was completely shocked, and Tim Walz was shocked,\" Parnes told the Somebody’s Gotta Win with Tara Palmer podcast.\n\nParnes added: \"They thought that they were going to win. And so, you know, when they come back now and say, 'Oh no, we didn’t really have a chance'. No, that’s not what they were thinking. They thought they were going to win.\n\n\"Kamala Harris was looking at her crowd size, and they felt like the vibe was strong and people were saying, 'Oh, we have more boots on the ground. We’re doing better in fundraising'.\n\n\"And she bought all of that. She bought the hype, and so did a lot of people in the campaign.\"\n\nJonathan Allen, who wrote the book alongside Parnes, has said Barack Obama was initially reluctant to back Harris as the Democratic nominee as he didn't feel she had what it took to beat Trump.\n\n\"He didn’t think that she was the best choice for Democrats, and he worked really behind the scenes for a long time to try to have a mini-primary, or an open convention, or a mini-primary leading to an open convention, did not have faith in her ability to win the election,\" the author said on MSNBC recently.","summary":"![CDATA[Donald Trump beat Kamala Harris in the US presidential election last November]]","url":"https://www.unilad.com/news/us-news/kamala-harris-speaks-out-election-results-348465-20250405","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blta860bb378beb4560/67f12f178c0b6f0742e25f84/kamala-harris-shocked-by-results.png","video":null,"publish_date":"2025-04-05 14:08:47","author":"Callum Jones","authors":["Callum Jones"],"language":"en","source_country":"gb","sentiment":-0.506},{"id":308035326,"title":"Laura Loomer Is a Warning","text":"White House staffers, it seems, had better hope that they stay in Laura Loomer’s good graces. This week, Loomer—a far-right provocateur who has described herself as “pro–white nationalism” and Islam as a “cancer on humanity”—met with Donald Trump in the Oval Office. After she reportedly railed against National Security Council officials she believed were disloyal to the president, the White House fired six NSC staff members the next day. More firings could be on their way: Yesterday, a person close to the administration told my colleague Michael Scherer that “Loomer has been asked to put together a list of people at State who are not MAGA loyalists.”\n\nLoomer doesn’t have an official job in the Trump administration, and the president has denied that she had anything to do with the NSC firings. But she is one of the president’s confidantes, and she has come to exercise a significant amount of influence over the White House. Lots of people in Trump’s inner circle have unlikely backgrounds (defense secretaries are not usually hired straight from Fox News), but Loomer’s is probably the least likely of them all. Over the past decade, she has earned a reputation as an unapologetically racist troll. In 2018, after she was banned from Twitter for criticizing then-incoming Representative Ilhan Omar and her Muslim faith, she famously handcuffed herself to the door of Twitter’s New York City headquarters. She was reinstated after Elon Musk bought the platform, and has continued to post racist things on X: In September, she suggested that a Kamala Harris election win would mean that “the White House will smell like curry.” (Loomer did not respond to a request for comment.)\n\nLoomer’s power marks how little Trump now seems to care about being around people who have expressed racist and extremist ideas and kept racist and extremist company. She is a bit like the Forrest Gump of Trumpworld—an unlikely but persistent character who just keeps popping up during some of the right’s biggest moments. When Trump got off his private plane on his way to the presidential debate in September, Loomer appeared with him. The next day, when Trump traveled to New York for a 9/11-anniversary memorial, Loomer was again there with him. (She has called 9/11 an “inside job.”) As I wrote at the time, prominent Republicans did not like that their presidential candidate was associating himself with Loomer, and publicly challenged Trump over it. He seemingly has not listened.\n\nLoomer has also played a role in directing discourse on the right. She was integral to drumming up the hoax that Haitian immigrants in Springfield, Ohio, were eating people’s pets, which became one of the most prominent right-wing causes du jour during the presidential campaign. In December, she instigated a war on the right over high-skilled immigration after she criticized the administration’s hiring of Sriram Krishnan as an AI-policy adviser and called attention to his past comments advocating for expanding H-1B visas. Most workers on H-1B visas are from India, and Loomer posted that Indian immigrants are “third world invaders.”\n\nThere is perhaps no one with direct access to the president who has been as outwardly and vociferously racist and bigoted. For all of the arguments that critics of Musk make about how he has boosted white supremacy on X, he has maintained a level of plausible deniability by never disparaging minority groups in a manner as direct as Loomer has. Someone like Loomer likely would not have had access to Trump in his first term. Richard Spencer never made it into Trump’s administration, and the president went out of his way to disavow the white nationalist. In 2018, when CNN reported that Darren Beattie, then a White House speechwriter, had spoken at an event that also featured a white nationalist, he was fired. But now Beattie has been hired to a senior role in this administration.\n\nThe president has already clearly established that his second term will be more extreme. Instead of the limited Muslim travel ban, he is pushing for mass deportations and has effectively shut down USAID, an agency largely devoted to helping poorer countries. But by welcoming Loomer into his inner circle, Trump is offering an even starker glimpse into how this administration is different. She is a testament to how much further to the right Trump has moved since his first term, and how much further he may be open to going.","summary":"No one else with direct access to the president has been as outwardly bigoted.","url":"https://www.theatlantic.com/technology/archive/2025/04/laura-loomer-trump-warning/682314/","image":"https://cdn.theatlantic.com/thumbor/OnIBqQ2LenvZeWhvPmXOIskT1YE=/0x77:3594x1949/1200x625/media/img/mt/2025/04/2025_04_04_Laura_Loomer_Knows_What_Shes_Doing/original.jpg","video":null,"publish_date":"2025-04-05 13:44:00","author":"Ali Breland","authors":["Ali Breland"],"language":"en","source_country":"US","sentiment":-0.29},{"id":308004764,"title":"Biden's three-word demand for Kamala Harris after she took over doomed presidential run","text":"Access Denied\n\nYou don't have permission to access \"http://www.dailymail.co.uk/news/article-14574623/Biden-warning-Kamala-Harris-debate-Trump-daylight-kid.html\" on this server.\nReference #18.da02417.1743861336.eee326b\nhttps://errors.edgesuite.net/18.da02417.1743861336.eee326b","summary":"Joe Biden gave Kamala Harris a chilling warning on the day of her debate with Donald Trump not to undermine his legacy after she took over the Democratic nomination, a new book claims.","url":"https://www.dailymail.co.uk/news/article-14574623/Biden-warning-Kamala-Harris-debate-Trump-daylight-kid.html","image":"https://i.dailymail.co.uk/1s/2025/04/05/13/96950089-0-image-m-13_1743856379150.jpg","video":null,"publish_date":"2025-04-05 13:31:45","author":"Editor","authors":["Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-1},{"id":308002606,"title":"After White House stress, Barack Obama opens up about his marriage to Michelle; here’s what he said and how he spends his time now","text":"Barack and Michelle Obama’s personal lives often make headlines due to the marital struggle rumors. Now, Barack Obama is finally speaking openly about life after the White House, including the toll it took on his marriage. How did the White House affect Obama’s marriage?Speaking at a recent event, the former president admitted that he owed Michelle some quality time after eight demanding years in office. He's currently focused on reconnecting, writing, and reestablishing balance.Former President Barack Obama admitted to having a deep deficit with his wife, Michelle. Since then, he's spent time having fun with her while working on the second volume of his memoir and continuing his work with the Obama Foundation, as per a report by The Hill.What is Barack Obama doing post-presidency?When asked about his life after leaving the White House at a Thursday event, Obama responded, I was in a deep deficit with my wife, to Steven Tepper, president of Hamilton College.Obama joked, So I have been trying to dig myself out of that hole by doing occasionally fun things. He claimed that he's trying to have more fun with his wife, as quoted in a report by The Hill.ALSO READ: Was Kamala Harris's gaffe on one of America's most famous talk shows a pivotal moment in her failed campaign? Here's what her top campaign advisor said According to the former commander in chief, leaving the executive mansion in 2017 improved his marriage with his wife. In 2023, Obama remarked, It sure helps to be out of the White House and to have a little more time with her. Is he enjoying writing his memoir?The former president claimed that he dedicates his time to the Obama Foundation and completing the second half of his memoirs, besides trying to win back his wife's favour. 2020 saw the release of the first volume, A Promised Land. This is comparable to fifty term papers.” Regarding his literary endeavour, Obama remarked, I mean, it just goes on forever. Barack Obama acknowledged that he often gets asked if he likes writing. Obama remarked, I say, 'Absolutely not,' but I do enjoy having written when it's finished. A lot of writers feel this way.FAQsWhat exactly did Obama mean when he mentioned being in a deep deficit with Michelle?He meant that his time at the office kept him so busy that it interfered with their time together, and he's now making amends.What is Barack Obama currently working on?He's concentrating on the Obama Foundation and completing the second half of his memoir.","summary":"Barack Obama is working to reconnect with his wife Michelle after their time in the White House affected their relationship. He is currently writing the second volume of his memoir and is dedicated to the Obama Foundation. Obama mentions that being out of the White House has improved their marriage.","url":"https://economictimes.indiatimes.com/news/international/us/after-white-house-stress-barack-obama-opens-up-about-his-marriage-to-michelle-heres-what-he-said-and-how-he-spends-his-time-now/articleshow/120016788.cms","image":"https://img.etimg.com/thumb/msid-120016835,resizemode-4,width-1200,height-900,imgsize-35286,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 13:10:41","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":-0.077},{"id":307995880,"title":"Biden’s Three-Word Instruction to Kamala Harris After She Assumed Leadership of His Troubled Presidential Campaign","text":"Joe Biden gave Kamala Harris a chilling warning on the day of her debate with Donald Trump after she took over the Democratic nomination, according to an upcoming book. \n\nThe president publicly supported Harris’ bid for the White House and backed her campaign platform, but behind the scenes he was more concerned over how she was framing his presidency. \n\nThe moment was recounted in upcoming book FIGHT: Inside the Wildest Battle for the White House by Jonathan Allen and Amie Parnes, which details how Biden attempted to keep Harris on a leash. \n\n‘He would say publicly that Harris should do what she must to win. But privately, including in conversations with her, he repeated an admonition: let there be no daylight between us,’ the authors wrote. \n\nAfter he was forced out of the race following his disastrous debate performance against Trump and questions over his age, Biden reportedly ‘expected Harris to protect his legacy.’ \n\nOn the day that Harris was set to face Trump on the debate stage, ‘Biden called to give Harris an unusual kind of pep talk — and another reminder about the loyalty he demanded,’ the authors wrote. \n\nBiden reportedly gave Harris a three-word warning: ‘No daylight, kid.’ \n\nThe book continued that Biden was focused not on ‘whether she won or lost the election’ but on how he would be remembered. \n\n‘He thought, she would only harm him by publicly distancing herself from him — especially during a debate that would be watched by millions of Americans. \n\n‘To the extent that she wanted to forge her own path, Biden had no interest in giving her room to do so.’ \n\nThe book is one of several inside looks at the end of the Biden presidency that are set to come out over the summer, with another by journalist Chris Whipple, Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History, claiming Biden was so ‘out of it’ he needed fluorescent tape to guide him around. \n\nIn Fight, the authors claim Biden was seen by many as an albatross around Harris’ neck that wore her candidacy down during the election. \n\nDuring the bruising election campaign, Biden’s staffers remained with the Harris campaign, making it even more difficult to publicly refute the president.\n\nSean Clegg, a Harris advisor not trusted by the Biden staffers, was helping her prepare for a joint appearance with Tim Walz when she started listing things that she and Biden accomplished when he stopped her.\n\n‘Wait, wait, wait! Let’s not do this. Let’s not go down memory lane,’ Clegg said, according to an excerpt published by The Hill.\n\nClegg was reportedly disinvited from future media prep sessions by longtime Dem communications staffer Stephanie Cutter. \n\nPreviously, Biden was blamed by senior Harris advisor David Plouffe for refusing to drop out earlier in the race after his June debate disaster.\n\nPlouffe claimed no Democratic candidate could have won without a proper primary process — what he called ‘the cardinal sin’ of this race. \n\nAnd he said he was shocked by the internal polling numbers when he finally joined the team after Joe Biden dropped out with less than four months to go, a situation he described as ‘catastrophic.’\n\n‘When I got in, it was the first time I saw the actual numbers under the hood. They were pretty gruesome,’ he told The Atlantic.\n\n‘The Sun Belt was worse than the Blue Wall, but the Blue Wall was bad. And, demographically, young voters across the board—Hispanic voters, Black voters, Asian voters—were in really terrible shape.\n\n‘When the switch happened, some of that stuff got a little bit better, but nowhere near where we ended up or where we needed to be. This was a rescue mission.\n\n‘It was catastrophic in terms of where it was.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nJoe Biden gave Kamala Harris a chilling warning on the day of&#8230;\n\n\nThis Post: Biden&#8217;s Three-Word Instruction to Kamala Harris After She Assumed Leadership of His Troubled Presidential Campaign first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/bidens-three-word-instruction-to-kamala-harris-after-she-assumed-leadership-of-his-troubled-presidential-campaign/","image":"https://i.dailymail.co.uk/1s/2025/04/05/13/96950089-14574623-Joe_Biden_reportedly_told_Kamala_Harris_there_should_be_no_dayli-a-18_1743856883048.jpg","video":null,"publish_date":"2025-04-05 13:02:22","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.008},{"id":307992404,"title":"Socialist NYC mayoral candidate Mamdani’s plan for city-run food markets would clobber customers: critics","text":"Socialist mayoral wannabe Zohran Mamdani’s scheme to bring government-owned-and-operated grocery stores to the Big Apple is a “Soviet” style disaster-in-waiting, supermarket owners across NYC told The Post.\n\nMamdani, a Queens state assemblyman who is polling second among Democratic primary candidates, claims his “network” of municipal markets would slash skyrocketing grocery prices by eliminating overhead.\n\nBut the city already has “a poor track record” running public housing, hospitals, schools and other services – and would “likely fail miserably in the grocery business,” said Jason Ferraira, a board member of the National Supermarket Association, which represent over 700 NYC and East Coast stores.\n\n“New Yorkers enjoy having options,” he said. “Each grocer is catering to the needs of a neighborhood, carrying different products for different ethnicities, backgrounds and incomes.”\n\nBut Mamdani’s plan would create “Soviet” markets where customers could be stuck with just “one brand or generic brands” of items like bread and milk, insisted Ferraira, who runs three Foodtown supermarkets in Queens.\n\nOthers noted that fixed prices at city-run markets would force competing private businesses to shutter, leaving New Yorkers with less selection.\n\n“It’s a socialist move that goes against the American Dream,” said Nallely De Jesus, the vice president of a company that runs a Super Fresh and four other markets in the South Bronx.\n\n“It’s also not just about cheaper prices; it’s about making sure customers are getting the products they want.”\n\nBoth Ferraira and De Jesus insisted a vast majority of supermarket operators don’t price gouge, adding it pays to keep prices as low as possible to be able to compete.\n\nMamdani’s plan calls for five municipal grocery stores — one in each borough — and potentially expanding to a larger network of stores. He estimated the first five would cost $60 million combined to build.\n\nPlan specifics have been sparse, but a source briefed on it said Mamdami is “committed” to a “fully public program owned and operated” by NYC, adding it would create hundreds of jobs.\n\nThe scheme is modeled off Marxist Chicago Mayor Brandon Johnson’s 2023 proposal to open a municipal grocery store on that city’s poorer south or west side – a plan he’s since backed off.\n\nThere were only two municipalities in the U.S. operating a grocery store in 2023 when Chicago commissioned a feasibility study for Johnson’s plan — St. Paul, Kan., and Baldwin, Fla. The Baldwin site has been a perennial money loser and shuttered last year. The St. Paul site, which employs 15 people and is 600-person city’s main source of food, operates with a 3% profit, the study noted.\n\nAtlanta is planning to open two municipally subsidized grocery stores later this year, but they will be run by a local supermarket chain.\n\nMamdani’s plan appears to be ripped out the same socialist playbook used by Vice President Kamala Harris during her failed presidential campaign. She claimed price gouging was causing inflation and threatened to enforce government price controls on groceries during her first 100 days in office.\n\nMamdani cited a recent poll he said shows two-thirds of New Yorkers support the creation of publicly-owned grocery stores, adding they’re tired of “basic necessities like bread and eggs eating into their paycheck — and even more tired of politicians playing the blame-game instead of solving the problem.”\n\n“I am proud to be the only candidate in this race with any plan to lower grocery prices, and as mayor I look forward to bringing down the cost of food in our city,” Mamdani said.","summary":"Socialist mayoral wannabe Zohran Mamdani's Soviet-style pledge to bring government-owned-and-operated supermarkets to the Big Apple is getting plenty of pushback from grocery industry leaders, who contend the biggest losers would be customers.","url":"https://nypost.com/2025/04/05/us-news/socialist-nyc-mayoral-candidates-city-run-supermarket-plan-under-fire/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/101679721-1.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/NHLRHNvQ-RyIcpnTz.mp4","publish_date":"2025-04-05 12:50:50","author":"Rich Calder","authors":["Rich Calder"],"language":"en","category":"politics","source_country":"us","sentiment":-0.384},{"id":308002604,"title":"Was Kamala Harris's gaffe on one of America's most famous talk shows a pivotal moment in her failed campaign? Here's what her top campaign advisor said","text":"Just weeks before the election, Kamala Harris made an unexpected statement on The View that left her campaign team reeling. When asked what she would do differently than Joe Biden, her response, or lack thereof, sparked criticism and gave her opponents an easy victory. The gaffe became a defining moment in her failed campaign, as well as a gift to Donald Trump's team, as per reports.What did Kamala Harris say that sparked backlash?According to a new book by reporters Jonathan Allen and Amie Parnes, a former top advisor to Vice President Kamala Harris' unsuccessful presidential campaign was taken aback when Harris stated on The View that she wouldn't have done anything different from President Biden, as quoted in a report by Fox News.When the liberal hosts asked Harris to name one thing she would have done differently than Biden over the previous four years, she famously replied that nothing comes to mind with about a month until the November election. Allen and Parnes' new book, FIGHT: Inside the Wildest Battle for the White House, which was published this month, claims that Harris' response stunned senior campaign advisor Stephanie Cutter. How did her campaign react internally?“What on earth was that?” I remember thinking, Cutter remembered. That’s not what we practiced. Assistants prepared Harris with a list of things she could name that made her proud of her work with Biden before her first interview as the Democratic candidate, the book also stated, as per a report by Fox News.The blunder turned into a turning point in Harris' campaign and gave her opponent fodder. The moment the Trump campaign noticed the blunder, they began sending the video to voters that afternoon through text messages and social media.Did the moment help Donald Trump’s strategy?According to a Harris ally quoted in the book, It provided the money shot for Donald Trump's ad makers. And it was her own bad moment. The book quotes a Trump advisor as saying, We were trying to anchor her to the Biden administration in her own words when she gave us the gift of the View interview. According to the authors of the book, Harris' response had done little to erase the impression that her reason for running was one of circumstance, as per a report by Fox News.During her campaign, Biden put pressure on the vice president to stick by him and have no 'daylight' between them. FAQsWhy was Kamala Harris' response on The View such a big deal?It provided critics with an easy way to connect her directly to Biden, which she needed to navigate more carefully.Was her team expecting that response?Not at all. One senior advisor stated that it was not what they had expected, and it left them stunned.","summary":"Just weeks before the election, Kamala Harris said on The View that she wouldn't have done anything different from Biden, surprising her campaign team and disappointing supporters. This gaffe provided Donald Trump's team with an opportunity to criticize her by highlighting it in their campaign materials, causing a significant setback for Harris amid their competitive political battle.","url":"https://economictimes.indiatimes.com/news/international/us/was-kamala-harriss-gaffe-on-one-of-americas-most-famous-talk-shows-a-pivotal-moment-in-her-failed-campaign-heres-what-her-top-campaign-advisor-said/articleshow/120015794.cms","image":"https://img.etimg.com/thumb/msid-120015814,resizemode-4,width-1200,height-900,imgsize-1135803,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 12:39:03","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":-0.433},{"id":308089472,"title":"I was a British tourist trying to leave America. Then I was detained, shackled and sent to an immigration detention centre","text":"Just before the graphic artist Rebecca Burke left Seattle to travel to Vancouver, Canada, on 26 February, she posted an image of a rough comic to Instagram. “One part of travelling that I love is seeing glimpses of other lives,” read the bubble in the first panel, above sketches of cosy homes: crossword puzzle books, house plants, a lit candle, a steaming kettle on a gas stove. Burke had seen plenty of glimpses of other lives over the six weeks she had been backpacking in the US. She had been travelling on her own, staying on homestays free of charge in exchange for doing household chores, drawing as she went. For Burke, 28, it was absolute freedom.\n\nWithin hours of posting that drawing, Burke got to see a much darker side of life in America, and far more than a glimpse. When she tried to cross into Canada, Canadian border officials told her that her living arrangements meant she should be travelling on a work visa, not a tourist one. They sent her back to the US, where American officials classed her as an illegal alien. She was shackled and transported to an Immigration and Customs Enforcement (Ice) detention centre, where she was locked up for 19 days – even though she had money to pay for a flight home, and was desperate to leave the US.\n\nBurke had arrived in the US during the Biden administration, only to become one of 32,809 people to be arrested by Ice during the first 50 days of Donald Trump’s presidency. Since February, several young foreign nationals have been incarcerated in Ice detention centres for seemingly little reason and held for weeks, including Germans Lucas Sielaff, Fabian Schmidt and Jessica Brösche. (Brösche, 26, spent more than a month in detention, including eight days in solitary confinement.) Unlike these other cases, Burke had been trying to leave the US, rather than enter it, when she was detained for nearly three weeks.\n\nI had been following news of Burke’s trip since she arrived in the US on 7 January. To me and my family, Burke is Becky, our neighbour and, for two and a half years, the person who took care of my kids after school. Her London home was only five doors down from us, but we met online, through a website that matches families with people offering childcare. Becky spent her mornings as a graphic artist and comic-book editor, and her afternoons collecting my son and daughter from primary school and entertaining them back at my place, making them snacks and refereeing their squabbles. Best of all, she drew with them. When my daughter turned seven, she asked if she could have a comic-making party; all her friends went home with little zines Becky had helped them make. We felt so lucky to have her in our lives.\n\nTwo years ago, Becky went to San Francisco for two weeks on a Workaway placement, staying in a family home free of charge in exchange for sweeping floors and walking the dog. Last August, she used Workaway again, in Switzerland. The internet was opening up the possibility of another life for her – one where she could see the world on a shoestring. In September, Becky told me she was going to leave London in January to go travelling on her own. We were sad to see her go, but I was full of admiration for her; I wish I had been as bold and free in my 20s. We threw her a farewell party just before Christmas; everyone cried. I kept up with news of her travels on Instagram, and there were regular postcards and WhatsApps: pictures of the tattoo she had got in Portland; a video she filmed of herself on a forest walk. She told me she had seen bald eagles and woodpeckers, deer and seals. And then, on 26 February, everything went silent.\n\nBecky wasn’t someone who liked to be immersed in global news. But, even if she had been, she could never have foreseen what would happen to her. She booked her plane ticket six months ago, while pundits were still predicting a close race for the presidency, or a Kamala Harris victory. Her story gives a glimpse of what America has become since then.\n\nI meet up with Becky at her parents’ house, in Monmouthshire, six days after she arrived back in the UK. After so long in detention, she wants to spend as much as possible in the sunshine, so we sit in the garden while their dog – a cocker spaniel named Mr Bojangles – runs circles around us. Becky is much paler than the person my family knew so well. Her eyes are hollower.\n\nShe began her trip with a stopover in Iceland, taking in the northern lights, going on to spend three nights in a hostel in New York City. Having already stayed in San Francisco on a Workaway placement, she didn’t feel she had anything to hide when she landed in New York. She would have told the border official her plans in full had he asked about them, she tells me. But he didn’t.\n\nThe homestays were a big part of the appeal of her trip. “I really liked becoming part of these other families. You don’t get placed so firmly in the community if you’re going to a hotel that’s sterile and separate.” Her first placement was three weeks with a household just outside Portland. Becky would “destroy dandelions from their lawn” and cook meals; her hosts took her on day trips, including an overnight stay at the seaside. They drove her to her next homestay, which was in Portland itself. Becky’s second host took her on forest hikes. “She knew every single plant, every single bird call. It was like having a personal tour guide,” Becky beams. “It was incredible. I thought, this is going too well, I’m having too much fun here.”\n\nBoth her hosts had been worried about how the US was changing under Trump. “I’m hearing so many scary stories about Ice raids and passports being detained,” Becky WhatsApp’d me on 8 February. Her first host had a transgender friend whose passport had been seized after she tried to change the name on it. But Becky felt like a spectator to it all. “I was worried on their behalf – an abstract worry and concern for others – rather than for myself. Because, I thought, I’m getting out of here.”\n\nOn 26 February, Becky boarded a Greyhound coach for the three-hour ride from Seattle to Vancouver. She was due to spend two months in the home of a divorced father who wanted help with meal prep and laundry during the one week out of every two that his kids lived with him. Becky had never been to Canada before and was looking forward to this part of her trip. She sat at the back of the coach, listening to a comedy podcast, watching the world flash by.\n\nShe wasn’t thinking about the dismal state of US-Canada relations when she handed her passport to the Canadian border official. He asked what she was planning to do in Canada. Travel, she replied. He asked where she was staying. Living with a man and his family, she said. He asked how she knew him. Becky said they had met on Workaway, and that she would be helping out around the house. The official told her they needed to research what Workaway was. He told Becky’s coach driver to leave without her.\n\nWorkaway warns users that they “will need the correct visa for any country that you visit”, and that it is the user’s responsibility to get one, but it doesn’t stipulate what the correct visa is for the kind of arrangements it facilitates in any given country. Becky had always travelled with a tourist visa in the past – including to the US in 2022 – without any problems. She checked that work visas were only required for paid work in Canada. She had had months to plan her trip, and would have applied for a work visa if it was necessary, she says.\n\nBut the Canadian officials told Becky they’d determined she needed a work visa. She could apply for one from the US and come back, they said. Two officers escorted her to the American side of the border. They talked to the US officials. Becky doesn’t know what was said.\n\nAfter six hours of waiting – and watching dozens of people being refused entry to the US and made to return to Canada – Becky began to feel frightened. Then she was called into an interrogation room, and questioned about what she had been doing during her seven weeks in the US. Had she been paid? Was there a contract? Would she have lost her accommodation if she could no longer provide services? Becky answered no to everything. She was a tourist, she said.\n\nAn hour later, Becky was handed a transcript of her interview to sign. She was alone, with no legal advice. “It was really long, loads of pages.” As she flicked through it, she saw the officer had summarised everything she told him about what she had been doing in the US as just “work in exchange for accommodation”. “I remember thinking, I should ask him to edit that.” But the official was impatient and irritable, she says, and she was exhausted and dizzy – she hadn’t eaten all day. “I just thought, if I sign this, I’ll be free. And I didn’t want to stay there any longer.” So she signed.\n\nThen she was told she had violated her tourist visa by working in the US. They took her fingerprints, seized her phone and bags, cut the laces off her trainers, frisked her, and put her in a cell. “I heard the door lock, and I instantly threw up.”\n\nAt 11pm, Becky was allowed to call her family. Her father asked what was going to happen next. “I looked at the officer and he said, ‘We’re going to take you to a facility where you’ll wait for your flight. You’ll be there one or two days – just while we get you on the next flight home.’”\n\nBecky was shackled and put into the back of a van. “I had no idea where we were going. It was just bumping around in darkness with handcuffs on.” At 2.30am, she arrived at the Ice facility in Tacoma, Washington. She was made to change into standard-issue underwear, a yellow top and trousers. Officers took away all her personal belongings, measured her height and weight, made her pose for a mugshot, and assigned her an “A” number (short for “alien”). Whenever she asked the people processing her arrival how long she would be detained for, they told her they couldn’t help: they worked for GEO, the private company contracted to run the facility, and not Ice, the government body that would decide her fate.\n\nAt 5.30am, she was taken to the dorm that she was to share with 103 other women: a massive room filled with metal tables, benches and bunk beds, some cells around the perimeter, and a row of payphones, “like a hospital mixed with a canteen”. It was bathed in bright halogen light that Becky would come to learn would always be on, albeit slightly dimmed between 11.30pm and 5.30am. Becky’s bunk was on a mezzanine level.\n\nAll Becky wanted to do was sleep, but instead she headed to the payphones to make the one free call she had been told she was entitled to, to tell her family how to put money into her inmate account. “In my head, this was a thing I had to do immediately, otherwise I’d be stuck without a way to communicate with the outside world.” She gave her parents her A number, and they tried to reassure her. It’s just one or two days, they repeated to her. A horrible experience. But over soon.\n\nAs soon as the call ended, Becky went on one of the detention centre iPads, which had apps allowing inmates to send messages to Ice and check the balance on their inmate account. “I sent a message to Ice straight away saying: ‘I am a tourist. I was just backpacking. I have not outstayed my visa. I’ve only been in America one month and two weeks. I don’t know why I’m here. I want to go home. Please can you help?’” She frantically refreshed the app to see if her account had been credited. (It took longer than expected, because funds can only be transferred into accounts for “illegal aliens” from within the US. Becky’s father, Paul, discovered he could only do it through an American friend.) “I was seeing no money arrive, and I was getting really upset thinking I told them the wrong A number.”\n\nAs she sobbed holding the iPad, Becky found herself surrounded by other inmates who wanted to comfort her. A woman called Lucy offered to let Becky use her phone credit if money hadn’t appeared in the account within a few hours. Rosa, a Mexican woman who spoke barely any English and had already been detained for 11 months, offered Becky a Pot Noodle she had been able to buy from the commissary, the shop where they could purchase luxuries. At 8am, Becky finally curled up in her bed to sleep, with Rosa praying in Spanish in the bunk below.\n\nBecky quickly learned the monotonous rhythms of the detention centre. Wake-up time was 5.30am. Breakfast – which for Becky was cold potato and a sachet of peanut butter, the only vegan option – was at 6am. Lunch – black beans and more cold potato – was anytime between 11.30am and 2pm. Four times a day, inmates had to sit on their bunks for an hour so they could be counted by staff. Dinner frequently arrived after 8pm. They were often ravenous between meals, which was why the commissary was so vital. It was also the only place they could access shampoo, deodorant, nail clippers and anti-shank toothbrushes.\n\nOn her first day in the facility, Becky asked for a scrap of paper and a pen, and began to draw the inmates on the table next to her. She was immediately inundated with portrait requests. A Mexican woman called Lopez, who had a photo of her children stored on one of the iPads, told Becky she would buy her some paper and colouring pencils from the commissary if Becky drew her kids. She soon became the dorm’s unofficial artist-in-residence, with women huddling around the dirty mirrors to make themselves look presentable before they sat for her. They would decorate their cells with Becky’s drawings, or send them to their families. Lopez declared herself Becky’s manager. “She kept saying, ‘Becky, you need to ask for stuff in exchange. Ask for popcorn.’ And I’d be like, ‘Lopez, I don’t need anything.’ I thought, I’m here briefly, you’re stuck here a long time. I’m not going to take your food away from you.”\n\nThe majority of the women were from Latin American countries, but some were from India, China, Iran, Afghanistan and Gaza. “Most of them were asylum seekers, but there was this handful of new people who had come in recently who did not know why they were here.” Lewelyn joined the dorm a few days after Becky. She had just returned from visiting her family in the Philippines; she had been living in the US since 1976, working as a lab technician at the University of Washington hospital’s cancer centre. “She’d had a visa issue that had been resolved many years ago, but now it was flagging on the system again.” Kseniia, a Russian woman who had been working for two years in a California nail salon, had permission to work in the US but was handcuffed while waiting for her husband to come out of an Ice interview. “She was so confused. She kept saying to me, ‘I’ve got a work permit.’”\n\nThere were other tourists, too. Bana, from Romania, was on holiday in Canada and visited Peace Arch park, on the international boundary between the US and Canada. She told Becky she had been taking selfies with her husband when a US border official told her they had strayed into American territory without the right visa and took her into custody.\n\nBecky had arrived in the detention centre on a Thursday. She soon realised she would not be out of it before the end of the weekend. No one ever replied to the message she sent to Ice on the iPad; she found out the Ice officer assigned to her case had gone on annual leave. The following Monday, Paul contacted the Foreign Office in London, and the British consulate in San Francisco. “They were doing the diplomatic bit,” he tells me. “But, after seven days, I could see it wasn’t really working. My perception is the British consulate couldn’t get Ice people to respond to them. There was no end in sight.”\n\nAfter Becky had been incarcerated for more than 10 days, Paul decided to go to the media. A quiet, unassuming man, he found himself live on Newsnight, Sky News and Good Morning Britain. Becky made it to every national newspaper in the UK, and had coverage in US press, too. Hours after her story broke, she was visited by an Ice officer who told her she was now “at the top of the pile” to be processed. Four days later, on a Thursday, another Ice officer came to the facility to tell Becky her flight had been booked for the following Monday.\n\nBecky’s face began to appear in the newspapers they received at the facility. At one point, her face flashed up on one of the three TV screens they had in her dorm. “Everyone clapped. After that, a few people came up to me and said, ‘Can you put me on TV, too?’” She feels very guilty that she was able to leave. “I was aware that it was from a major position of privilege that the press listened to this story. I was a British tourist, I had these images of my trip on Instagram, and I had contacts with journalists, so I was very lucky. And I wanted the same thing that Ice wanted, which was for me to go home.”\n\nAt lunchtime on 17 March, officers came into the dorm, barked Becky’s name and told her to get ready to go. She had hidden some of her drawings among her official paperwork – her signed transcript and the document declaring her an illegal alien – in the hope she could smuggle them out. She wasn’t allowed to tell her family she was on her way home, but one of the women offered to ring her parents to notify them. Becky was shackled at the ankles, wrists and waist, and then made to shuffle out into a van.\n\n“When I got close to the airport, I felt really relieved and also overwhelmed, watching people with their suitcases, people going on holiday. It was a bit like whiplash – reality whiplash. Did that just happen?”\n\nBut her ordeal was not over. She was taken to the basement of Seattle-Tacoma international airport for a security check. While every item in her bag was swabbed and dismantled, she was subjected to a full body search. “I was in this very loud, weird, industrial space with pipes and conveyor belts and lights and sirens, being told to open my legs. I was silently crying, watching all my stuff being torn apart as someone else was searching every crevice of me.” She boarded the plane before any of the other passengers. “I found my seat, threw my bags on it, and went into the toilet and sobbed in the cubicle, with the British Airways classical music surrounding me.”\n\nSix days after she landed at Heathrow, Becky still sleeps with her lamp on. She is enjoying home-cooked food and long showers, but feels guilty for resting in comfort when she knows her friends are still incarcerated. “I’m thinking of them every day,” she tells me. She is working on a comic that will tell the story of what happened to her, and the women she shared 19 days with, based on the drawings, notes and official documents she managed to take out of the detention centre.\n\nBecky still doesn’t know why she was incarcerated for so long. She suspects it might be because Ice is simply overwhelmed. “Maybe border security have been pressured to prove they’re stepping up.” She shrugs. “It did feel like they wanted to get me from the moment I was walked to the American side.” On 4 March, the White House issued a statement celebrating how “Ice arrests of illegal immigrants have surged 627%” during Trump’s first month in office.\n\nJasmine Mooney, a Canadian woman who was detained by Ice for two weeks, says while the private companies who own the facilities are run for profit, there’s no incentive to get people out quickly. But in the era of Elon Musk’s department of government efficiency (Doge), it seems counterintuitive for public money to be deliberately wasted on detaining illegal aliens with the will and means to return home.\n\nTrump’s border tsar, Tom Homan, promised “shock and awe” from day one of his administration. Perhaps Becky’s incarceration was political theatre – or performative cruelty. Whatever the reason, in Trump’s America, a tourist who makes a mistake can be locked up, seemingly indefinitely.\n\nThe deportation paper Becky signed bans her from the US for the next 10 years. Paul tells me they are going to try to appeal it, but Becky says America isn’t the country she thought it was. Her advice to anyone planning to travel to the US is simply not to go. “First, because of the danger of what could happen to you. And, secondly, do you really want to give your money to this country right now?”\n\nShe has emerged from the experience with new eyes. “I was naive to think that what was going on in the world, or at the border, wouldn’t affect me,” she tells me, her arms folded across her chest. She had believed if she was honest and acted in good faith she would be insulated from harm, but now thinks that might have been naive, too. “If I’d lied, I’d be on holiday in Canada right now.”","summary":"Graphic artist Rebecca Burke was on the trip of a lifetime. But as she tried to leave the US she was stopped, interrogated and branded an illegal alien by ICE. Now back home, she tells others thinking of going to Trump’s America: don’t do it\n\nJust before the graphic artist Rebecca Burke left Seattle to travel to Vancouver, Canada, on 26 February, she posted an image of a rough comic to Instagram. “One part of travelling that I love is seeing glimpses of other lives,” read the bubble in the first panel, above sketches of cosy homes: crossword puzzle books, house plants, a lit candle, a steaming kettle on a gas stove. Burke had seen plenty of glimpses of other lives over the six weeks she had been backpacking in the US. She had been travelling on her own, staying on homestays free of charge in exchange for doing household chores, drawing as she went. For Burke, 28, it was absolute freedom.\n\nWithin hours of posting that drawing, Burke got to see a much darker side of life in America, and far more than a glimpse.","url":"https://www.theguardian.com/us-news/2025/apr/05/i-was-a-british-tourist-trying-to-leave-america-then-i-was-detained-shackled-and-sent-to-an-immigration-detention-centre","image":"https://i.guim.co.uk/img/media/88888f988556c5d5fd967198969b1659a1bd5902/0_1952_5504_3302/master/5504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZG","video":null,"publish_date":"2025-04-05 11:00:22","author":"Jenny Kleeman","authors":["Jenny Kleeman"],"language":"en","category":"politics","source_country":"us","sentiment":0.001},{"id":307997670,"title":"Jewish pro-Trump journalist offers GOP advice on how to court key religious voting bloc","text":"Author and journalist Batya Ungar-Sargon offered advice to Republicans on how to make substantial inroads with Jewish voters after the party witnessed underwhelming movement with the key voting bloc in the 2024 presidential election. Ungar-Sargon, an Orthodox Jewish columnist for The Free Press and a self-described \"MAGA leftist\" supporter of President Donald Trump, spoke with Fox News Digital about whether Republicans can earn the support of Jewish voters, who historically vote Democrat by high margins. \"First of all, I'm not sure it's possible,\" Ungar-Sargon began. \"The American Jewish community is very highly educated. So 30% of Americans have a college degree, a 4-year degree. 60% of American Jews do. It's very hard to get people who have been through the humanities in the United States in a university and a fancy university, to ever consider voting for a Republican, because the primary thing they're taught at their fancy universities is to have contempt for Republicans and contempt for the working class and contempt for conservative values. So that's going to be a hard sell.\" COLUMNIST WHO CALLS HERSELF A ‘MAGA LEFTIST’ SHARES WHY TRUMP'S SUPPORT GOES BEYOND CONSERVATIVES Fox News Voter Analysis from the 2024 presidential election showed Trump earning 33% of the Jewish vote, marking a slight 3% increase from 2020. Trump heavily leaned on his support for Israel hoping to flip Jewish voters away from Democrats, who remain heavily divided during the Israel-Hamas war following Oct. 7. Notably, Trump won a whopping 74% of the conservative-leaning Orthodox subsection of the Jewish vote, according to the Jewish Electorate Institute. Still, then-Vice President Kamala Harris trounced Trump among Jewish Americans broadly with 66% of the vote, per Fox News Voter Analysis. \"I think everything President Trump is doing with regards to Israel is big,\" Ungar-Sargon said while conceding, \"I mean, most Americans, Jews, I don't think vote on Israel. I think most people don't vote on foreign policy. They vote on domestic policy.\" That said, Ungar-Sargon insisted it is \"very important\" for Republicans to marginalize the growing \"anti-Israel wing of the far right\" but earning more support from Jewish voters has to go beyond Israel. \"The Democrats have cast themselves for 100 years, probably more, as the compassionate side. And the Republicans never really rebutted that,\" Ungar-Sargon said. \"It's clear to me now that the Republicans in the MAGA version is a much more compassionate movement because the Democrats' quote unquote ‘compassion’ leads to immense amounts of cruelty.\" PRO-TRUMP JOURNALIST SOUNDS ALARM ON ‘BIGGEST THREAT’ TO MAGA MOVEMENT She cited the \"open border\" during the Biden administration that led to the suffering of migrant women and children as well as Democrats' \"compassion\" for Ukraine and Palestinians she argued only prolonged deadly wars instead of seeking swift ends to them. Ungar-Sargon suggested Republicans pivot their messaging away from \"crime more libs\" that gets social media attention to expressing \"I get where you're coming from\" type of discourse. PRO-TRUMP WRITER NOT SOLD JD VANCE WILL SECURE MAGA MANTLE, SHARES ADVICE HOW VP CAN HOLD SUPPORT IN 2028 CLICK HERE TO GET THE FOX NEWS APP \"I understand that you feel sorry about the Palestinians. I do, but the way that you're talking about them, the way that you're enabling them, the way that you're defending their worst behaviors, is only going to lead to more suffering,\" she said as one example. \"Like, ‘Hey, I get that you feel sorry for these immigrants, but do you realize how much cruelty you are enabling to your own working-class neighbors who now, as a result of your open border, will never be able to afford a home in the neighborhood they live in and that you live in when they come to clean your house?’\" She continued, \"I think there's a way to make the conservative case that really stresses, you know, this kind of idea that we owe each other something as humans and as Americans, and I would really like to see us making that case to the left. And I think that there's something really purifying about that. There's this impulse to meet their cruelty towards us, and trust me, I've been on the receiving end of plenty of it, with cruelty. But I think if we can overcome that and meet it with love, I think that will go a long way.\"","summary":"In an interview with Fox News Digital, author and journalist Batya Ungar-Sargon spoke about how Republicans can make inroads with Jewish voters in future elections.","url":"https://www.foxnews.com/media/jewish-pro-trump-journalist-offers-gop-advice-how-court-key-religious-voting-bloc","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/ungarsargonvotingbooth.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-05 11:00:08","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.113},{"id":307961190,"title":"Top 5 revelations in 2024 campaign books, from Obama working against Harris to Biden's 'out of it' demeanor","text":"Revelations about the inner workings of former Vice President Kamala Harris and former President Joe Biden's respectively failed and aborted presidential campaigns continue to emerge in two new books released this month. \"FIGHT: Inside the Wildest Battle for the White House,\" by NBC reporter Jonathan Allen and The Hill correspondent Amie Parnes, gives a behind-the-scenes look at the chaotic 2024 race from interviews with dozens of people within the inner circles of Harris, Biden, and President Donald Trump. \"Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History,\" by Chris Whipple, also gives an inside look at the drama that unfolded inside the Harris and Trump campaigns. Here are five of the top revelations uncovered this week. KAMALA HARRIS WAS ‘VERY ANNOYED’ WITH OBAMA AS SHE SOUGHT HIS ENDORSEMENT, BOOK REVEALS Biden was ‘out of it’ ahead of disastrous debate, former chief of staff says In \"Uncharted,\" former Biden White House chief of staff Ron Klain recalled Biden being \"exhausted\" and \"out of it\" while prepping for his debate against Trump in June. \"The president was fatigued, befuddled, and disengaged,\" Whipple wrote, according to an excerpt released ahead of the book's April 8 release. \"Klain feared the debate with Trump would be a nationally televised disaster.\" Klain told Politico on Wednesday that he felt the framing of his remarks in the book was wrong. \"My point wasn’t that the president lacked mental acuity … He was out of it because he had been [sidelined], not because he lacked capacity,\" he told Politico. \"He had been isolated from domestic politics by a WH team unplugged from hill Dems.\" Democratic lawmakers and aides to Biden were also concerned about his aging, according to Allen and Parnes' \"Fight.\" Rep. Eric Swalwell, D-Calif., reportedly became worried about the president's decline in June 2023 after Biden did not recognize him at a White House event and Swalwell had to remind the president about who he was. Allen and Parnes also reported that the president met with a makeup artist every morning, prior to travel and before calls with his aides, to cover up visible signs of aging. BIDEN REPEATEDLY TOLD HARRIS THERE COULD BE ‘NO DAYLIGHT’ BETWEEN THEM ON POLICIES: REPORT Biden privately demanded ‘loyalty’ from Harris: ‘No daylight’ Biden reportedly urged Harris against breaking from him on policies she supported as his vice president during her presidential run, according to \"Fight.\" \"He would say publicly that Harris should do what she must to win. But privately, including in conversations with her, he repeated an admonition: let there be no daylight between us,\" the authors wrote. The president \"expected Harris to protect his legacy,\" they added. \"But the day of the debate Biden called to give Harris an unusual kind of pep talk — and another reminder about the loyalty he demanded. No longer able to defend his own record, he expected Harris to protect his legacy,\" they wrote. \"Whether she won or lost the election, he thought, she would only harm him by publicly distancing herself from him — especially during a debate that would be watched by millions of Americans. To the extent that she wanted to forge her own path, Biden had no interest in giving her room to do so,\" the book reported. TOP KAMALA HARRIS CAMPAIGN ADVISOR ADMITS SHE WAS FLOORED BY DEMOCRAT'S MAJOR FLUB ON ‘VIEW’ Obama was ‘working against’ Harris, didn’t think she could win \"Fight\" co-author Jonathan Allen said Tuesday on MSNBC that former President Obama hesitated for days to endorse Harris' presidential campaign because he didn't believe she could win. \"President Obama absolutely did not think that Joe Biden should continue, according to our sources close to President Obama,\" Allen told MSNBC. \"And he also didn’t want Kamala Harris to be the replacement for Biden. He didn’t think that she was the best choice for Democrats, and he worked really behind the scenes for a long time to try to have a mini-primary, or an open convention, or a mini-primary leading to an open convention, did not have faith in her ability to win the election.\" \"As it turned out, she didn’t win, but he was really working against her,\" Allen continued. Obama's decision to wait five days to endorse Harris after Biden dropped out of the race reportedly left Harris \"very annoyed,\" the book said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Harris was ‘completely shocked’ by defeat, believed she could've won with more time According to the \"Fight\" authors, Harris was stunned on election night by the results. Parnes reported that Harris was blindsided by the results and asked staffers if they were certain. \"And she's like, are you sure? Have we done a recount? Should we do a recount?\" Parnes said on the \"Somebody's Gotta Win with Tara Palmeri\" podcast released Thursday. Harris reportedly later came to believe that she could've won the election if she had more time and if Biden hadn't run for re-election. \"She could have won, she told friends, if only the election was later in the calendar — or she got in earlier. In other words, Joe Biden was to blame,\" the authors wrote. Friends of Harris said that she believed Biden's unpopularity and her late entry into the race tanked her campaign. However, not all of her friends agreed with this take, the authors wrote. \"That is f---ing bonkers,\" one Harris friend said in the book. \"If Election Day was October first, we might have actually somehow pulled it off. Shorter was actually better, not longer.\" Harris had to convince Biden to endorse her right away Harris pleaded with Biden to endorse her the same day he announced he was stepping down from the 2024 race, the \"Fight\" authors revealed. Biden reportedly did not want his historic announcement last July to be drowned out in the \"media frenzy\" surrounding a Harris endorsement. \"He deserved his due, he believed, and he told Harris that he would not include an endorsement in the statement announcing his exit,\" the authors wrote. Harris reportedly pleaded with Biden that he needed to back her right away. \"This is important for your legacy — to show that you have absolute faith in your VP,\" the book says. Biden went on to put out a statement endorsing Harris' run a half-hour later. CLICK HERE TO GET THE FOX NEWS APP Fox News' Hanna Panreck contributed to this report.","summary":"Two new books reveal chaos unfolding behind the scenes during the 2024 election presidential campaigns of former President Biden and former Vice President Harris.","url":"https://www.foxnews.com/media/top-5-revelations-2024-campaign-books-from-obama-working-against-harris-bidens-out-it-demeanor","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/biden-harris-walk.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-05 10:00:11","author":"Kristine Parks","authors":["Kristine Parks"],"language":"en","source_country":"us","sentiment":-0.322},{"id":307937128,"title":"'Imagine if I had done any of this': Barack Obama reacts to Trump administration after tariff shocker","text":"Former US president Barack Obama has said that he has been watching the new administration of President Donald Trump for a little bit and has not spoken publicly for quite a long time. In an on-stage interview at Hamilton College, Obama said he does not think Trump's new tariffs will be good for America, but he said he is more concerned with what he described as the White House's infringement of rights.“So, this is the first time I’ve been speaking publicly for a while,” Obama said. “I’ve been watching for a little bit.” “Imagine if I had done any of this,” Obama said, later adding: “It’s unimaginable that the same parties that are silent now would have tolerated behavior like that from me, or a whole bunch of my predecessors.”“I’m more deeply concerned with a federal government that threatens universities if they don’t give up students who are exercising their right to free speech,” Obama told the crowd of college students.“The idea that a White House can say to law firms, if you represent parties that we don’t like, we’re going to pull all our business or bar you from representing people effectively. Those kinds of – that kind of behavior is contrary to the basic compact we have as Americans.”Obama's comment on law firms referred to Trump's announcement of a deal with a law firm which agreed to provide at least $100 million in pro bono legal services throughout his second term. Interestingly, Kamala Harris's husband Doug Emhoff works at the firm -- Willkie Farr & Gallagher.Kamala Harris too spoke up against the administration after her long absence. “Fear has a way of being contagious. When one person has fear, it has a way of spreading to those around them and spreading. And we are witnessing that, no doubt,” Harris said.Prominent Democrat leaders mostly remained silent as they shifted their target to Elon Musk, who recently suffered an embarrassing defeat as Brad Schimel, the candidate he backed, lost to Susan Crawford.(With TOI inputs)","summary":"Barack Obama, breaking his silence, criticized Donald Trump’s administration for infringing on rights, targeting free speech, and threatening law firms. He expressed concern over Trump’s tariffs and questioned Republican double standards. Vice President Kamala Harris also voiced concern over growing fear in society. Meanwhile, Democrats shifted focus to Elon Musk after his backed candidate lost a key race.","url":"https://economictimes.indiatimes.com/news/international/global-trends/imagine-if-i-had-done-any-of-this-barack-obama-reacts-to-trump-administration-after-tariff-shocker/articleshow/120009044.cms","image":"https://img.etimg.com/thumb/msid-120009036,resizemode-4,width-1200,height-900,imgsize-152136,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 08:59:54","author":"Et Online","authors":["Et Online"],"language":"en","source_country":"in","sentiment":-0.2},{"id":308005836,"title":"Leftist Journos: Fascist Trump and Cruel Musk Have Put America in ‘Dangerous Times’","text":"Leftist news outlets have been inundated with journalists making crazy, apocalyptic pronouncements of “dangerous times” being ushered in by President Donald Trump and his supporters. \n\nIn the past month, viewers have been subjected to ultra-leftist Elie Mystal’s book tour where he’s crusaded for elimination of “all voter registration laws,” so that it’s “easier” to vote against Donald Trump’s “fascism.” \n\nWashington Post editor Bob Woodward warned that it’s “one of the most dangerous times this country has ever faced” due to Trump and his “sidekick” Elon Musk daring to pare back our massive federal government. \n\nOver on ABC’s The View, co-host Sunny Hostin screeched: “It is very clear that people will die!”\n\nThe following are just a few of the craziest outbursts from leftist journalists and celebrities over the last month: \n\n“Eliminate All Voter Registration Laws” So It’s Easier to Vote Against Trump’s “Fascism”\n\n“We could eliminate all voter registration laws. See, when Democrats get in charge, we try to protect voting rights….We have to expand voting rights so that the 90 million people that sat on the couch and sat out this last election between democracy and fascism, so that maybe they have a little bit of an easier time to get up off the couch and come participate in the democracy.”— The Nation justice correspondent Elie Mystal on MSNBC’s Morning Joe, March 24.\n\nWoodward: “One of the Most Dangerous Times” Ever, Trump Wants to “Destroy the Economy”\n\n“He [Donald Trump] and Elon Musk, the richest man in the world, his sidekick are cutting the government….I think it’s one of the most dangerous times this country has ever faced….His end goal – it looks like – he wants to destroy the economy and that is a very dangerous undertaking.” — Associate Editor Bob Woodward on the Washington Post podcast, March 28. \n\n“Apartheid-Era Elon” Is “Burning the Republic” for “Wannabe Autocrat” Trump\n\n“No one in America voted for apartheid-era Elon to be in charge of anything. No one in America….It is personalistic politics, where a wannabe autocrat in Donald Trump has outsourced the slashing and burning of the republic to apartheid-era Elon and no one wants this and they are gonna find out.”— Former New York Times columnist/MSNBC contributor Anand Giridharadas on MSNBC’s Morning Joe, March 20.\n\nThe “Naked” “Cruelty” of Elon Musk “Starving Children Around the World” and Cutting Government\n\n“You get the richest guy [Elon Musk] in the world cutting off food for the starving children around the world. Like, that’s the essence of what it is. The second thing it is, it’s cruelty and ruthlessness. I have had so many conversations over the last couple of weeks with people inside federal agencies when the DOGE boys comes to town. And they are naked in their cruelty.”— New York Times columnist David Brooks on PBS’s News Hour, March 21. \n\nGOP Cutting Department of Education Because “An Educated Citizenry Is Not in Their Interests”\n\n“They [Republicans] are revealing something to citizens, which is, they don’t want the most educated citizenry possible because it’s not helpful to them. People who can read and understand that climate change is happening are not favorable voters for them. People who can read and understand what they’re doing to Medicaid, to Social Security — what Elon Musk is doing — the better your reading comprehension is, the more you might not like what this administration is doing. And so an educated citizenry is not in their interests, and they’re coming for it.”— Former New York Times columnist/MSNBC contributor Anand Giridharadas on MSNBC’s Morning Joe, March 21.\n\nDon Lemon: You Cannot “Be Black” and Be “MAGA”\n\nFormer CNN anchor Don Lemon: “I see a black MAGA person who is carrying Donald Trump’s water and they know that he’s lying, it is the shortest line to the front….If you become a black MAGA person, it’s like, ‘Whoa, let’s book this person. Let’s put him on television. Let’s promote!’”Host Bill Maher: “So you don’t think you can be a sincere black MAGA person?”...Lemon: “I don’t think that you can be a rational MAGA — be black and be a rational MAGA person. I think you can be black and be a Republican.”Maher: “I think they would find that very insulting.” Lemon: “Well, I mean, the truth is often insulting.”— Club Random with Bill Maher podcast, March 16. \n\nNicolle Wallace: “Is a Constitutional Crisis Now Officially Upon Us?” \n\n“The question of the hour: Is a Constitutional crisis now officially upon us? From the invocation of an 18th century law that was the basis for some of the darkest chapters in America’s history — things like the internment of Japanese Americans during World War II now being used to deport hundreds of people, to the sudden removal of an immigrant doctor here legally….A series of developments over the last 48 hours point to a Trump administration acting as though it is now unencumbered by the law.”— Host Nicolle Wallace on MSNBC’s Deadline: White House, March 17.\n\nStahl to Hostage: Are You Sure Terrorists Were Starving You, Maybe Hamas Just Ran Out of Food? \n\nFormer hostage Keith Siegel: “The terrorists became very mean and very cruel and violent.”Correspondent Lesley Stahl: “More so?”Siegel: “Much more so. They were beating me and starving me.”Stahl: “Do you think they starved you or they just didn’t have food?”Siegel: “No, I think they starved me and they, they would often eat in front of me and not offer me food.” — CBS’s 60 Minutes, March 30. \n\nMaddow Disgusted By Trump’s Tribute to Pediatric Cancer Survivor D.J. Daniel\n\n“For the record, and this is disgusting, the President made a spectacle out of praising a young man who thus far survived pediatric cancer, as if the President had something to do with that. This was in the midst of him praising DOGE. The DOGE cuts, among other things, have cut off funding for ongoing research into pediatric cancer.”— Host Rachel Maddow on MSNBC’s live coverage of President Donald Trump’s address to Congress, March 4. \n\nWallace Ghoulishly Ties Cancer Survivor’s Story to January 6 \n\n“I’ve let myself feel joy about D.J. [Daniel] and I hope he’s alive for another, you know, 95 years. Right? And I hope he lives the life he wants to live. He wants to be a cop. He knows what he wants to do. And maybe when you have childhood cancer, that crystallizes for you, and I hope he has a long life as a law enforcement officer, but I hope he never has to defend the United States Capitol against Donald Trump’s supporters. And if he does, I hope he isn’t one of the six who loses his life to suicide. And I hope he isn’t one who has to testify against the people who carried out acts of seditious conspiracy and then live to see Donald Trump pardon those people.”— Host Nicolle Wallace on MSNBC’s live coverage of President Donald Trump’s address to Congress, March 4. \n\nWill a One-Term Trump Be Tempted to Be “Incredibly Reckless?”\n\n“Since he’s [Donald Trump] not running for re-election, do you think that’s a super power, or do you think that’s sort of a gateway to temptation to be incredibly reckless?”— NBC senior national correspondent Tom Llamas to former Trump White House press secretary J. Hogan Gidley on NBC News Now live coverage of Trump address to Congress, March 4.\n\nSunny Shames Schumer From the Left\n\n“It gives me no pleasure to say this to you because we are friends, but I think you caved. I think you and nine other Democrats caved. I don’t think you showed the fight that this party needs right now, because you’re playing by a rule book where the other party has thrown that rule book away….In supporting that GOP partisan bill that Democrats had no input in, you cleared the way for Donald Trump and Elon Musk to gut Social Security, to gut Medicare, to gut Medicaid.”— Co-host Sunny Hostin to Sen. Chuck Schumer on ABC’s The View, March 18.\n\nDemocrats Must Fight Trump Or “People Will Die!” \n\n“Representative [Al] Green [yelling at Trump during his address to Congress] gave them the example. The Democrats are not meeting the moment. It is very clear that Medicaid is on the table. It is very clear that Social Security is on the table. It is very clear that people will die! The baby boomers, the civil rights generation, they knew what they had to do! They were willing to fight and die for their rights! This generation of Congress, they are not meeting the moment! This is an existential crisis!”— Co-host Sunny Hostin on ABC’s The View, March 7.\n\nJoy Willing to Be “Friends” With a Trump Voter, Just Won’t Save Their Life\n\n“I could be friends with a Trump supporter. I won’t give them a kidney but I could be friends with them.”— Co-host Joy Behar on ABC’s The View, March 6.\n\nComedian Amber Ruffin: Trumpers Aren’t “Human Beings”\n\n“You’re [Trump administration] kind of a bunch of murderers….They [the White House Correspondents Association] were like: ‘You need to be, you know, equal, and make sure that the, that you give it to both sides, and blah blah blah.’ I was like, ‘there’s no way I’m gonna be freaking doing that, dude.’...They want that false equivalency that the media does. They want that. It feels great. It makes them feel like human beings, but they shouldn’t get to feel that way ‘cause they’re not.”— Comedian Amber Ruffin before she was disinvited from performing at the White House Correspondents Dinner, as aired on The Daily Beast podcast, March 27.\n\nTrump Is Running “Pogroms” Against Latinos \n\nCo-host Ana Navarro: “Forty-six percent voted in this country, Latinos in this country ended up voting for Trump despite the fact that he demonized Latinos, demonized immigrants every single day, and since becoming president, he’s targeted, hunted them down.”Actor John Leguizamo: “Yes, it’s like basically pogroms. They’re coming up to all these people that they said ‘they’re criminals.’”— ABC’s The View, March 21.\n\nRosie O’Donnell Wonders If Elon Rigged Election for Trump\n\n“I question why the first time in American history a president has won every swing state and is also best friends and his largest donor [Elon Musk] was a man who owns and runs the Internet. So I would hope that that would be investigated and that we would see whether or not it was an anomaly or something else that happened on election night in America when Kamala Harris was filling up stadiums with people who supported her and Donald Trump was not able to do that.”— Comedian/actress Rosie O’Donnell on Ireland network RTE’s The Late Late Show, March 21.\n\nJoan Baez Bashes “Incompetent Billionaires” Who Are Burning Down Democracy\n\n“First, I have to set the context that I’m here in. You said I could say anything I want out here. So, that we’re all here to be silly and have fun, and as long as we recognize the fact that our democracy’s going up in flames and we’re about to — we’re being run by a bunch of really incompetent billionaires.”— Singer Joan Baez on Netflix’s Everybody’s Live with John Mulaney, March 12.\n\nAwful Oliver: Best Thing About Reagan Is He’s “Dead” \n\n“She [Rep. Elissa Slotkin in Democratic response to Trump address] criticized Trump by praising Reagan. I will admit there are positive things you can say about Reagan, like ‘He was our only president to make a movie with a chimp,’ or ‘he’s dead,’ but his moral clarity might come as a surprise to any gay people who lived through the 1980s. I’m just saying, if you brought Reagan back from the dead and told him all the racist shit Trump’s managed to do in less than two months, he’d cum so hard he’d die again.”— Host John Oliver on HBO’s Last Week Tonight, March 9.","summary":"Leftist news outlets have been inundated with journalists making crazy, apocalyptic pronouncements of  “dangerous times” being ushered in by President Donald Trump and his supporters. \n\nIn the past month, viewers have been subjected to ultra-leftist Elie Mystal’s book tour where he’s crusaded for elimination of “all voter registration laws,” so that it’s “easier” to vote against Donald Trump’s “fascism.” \n\nWashington Post editor Bob Woodward warned that it’s “one of the most dangerous times this country has ever faced” due to Trump and his “sidekick” Elon Musk daring to pare back our massive federal government.  \n\nOver on ABC’s The View, co-host Sunny Hostin screeched: “It is very clear that people will die!”\n\nThe following are just a few of the craziest outbursts from leftist journalists and celebrities over the last month: \n\n \n\n“Eliminate All Voter Registration Laws” So It’s Easier to Vote Against Trump’s “Fascism”\n\n \n\n\n\n\n\n \n\n“We could eliminate all voter registration laws. See, when Democrats get in charge","url":"https://www.newsbusters.org/blogs/nb/geoffrey-dickens/2025/04/05/leftist-journos-fascist-trump-and-cruel-musk-have-put-america","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-04/ElieMystalMainNQ.jpg?itok=Tpa3kVs9","video":null,"publish_date":"2025-04-05 08:00:00","author":"Geoffrey Dickens,President Donald Trump","authors":["Geoffrey Dickens","President Donald Trump"],"language":"en","category":"politics","source_country":"US","sentiment":0.105},{"id":307922334,"title":"Did President Donald Trump Break His Social Security Promise? The Answer Isn't as Cut-and-Dried as You Think.","text":"For most Americans, Social Security is more than just a check that'll show up in their mailbox or be deposited in their bank account once they retire. It represents a financial foundation that keeps retirees afloat and out of poverty.\n\nIn each of the last 23 years, Gallup has surveyed retirees to gauge how important Social Security income is to their financial well-being. Consistently, 80% to 90% of respondents have relied on their monthly check, to some varied degree, to make ends meet.\n\nEnsuring the longevity of Social Security should be a top priority for our elected officials in Washington, D.C., which includes President Donald Trump. Yet for the last four decades, the financial outlook of America's leading social program has deteriorated.\n\nFor his part, Trump has repeatedly claimed that neither he nor his administration will touch Social Security. But did President Trump renege on this stance? Interestingly, the answer isn't as straightforward as you might think.\n\nWhat's wrong with Social Security?\n\nBefore digging into the details of Donald Trump's Social Security promise and addressing whether he skirted his pledge, it's important to have the proper background of how we got to this point.\n\nIn January 1940, the very first retired-worker benefit check was mailed out. Every year since then, the Social Security Board of Trustees has published a report that examines the financial health of the program. This report provides detailed information on how every dollar in income is collected, as well as allows anyone to see where those dollars are spent. Think of it as a way to look at Social Security's balance sheet each year.\n\nBut what's potentially more valuable within these annual Trustees Reports is their forward-looking forecasts. Specifically, the Trustees account for changes in fiscal and monetary policy, as well as an assortment of demographic shifts -- these demographic changes are primarily responsible for the program's issues -- to project how financially sound Social Security will be over the long term, defined as the 75 years following the release of a report.\n\nSince 1985, the Trustees have cautioned of a long-term funding obligation shortfall. In easy-to-understand terms, forecast income over the coming 75 years won't be sufficient to fully cover benefits, including cost-of-living adjustments (COLAs). As of the 2024 Trustees Report, this cash shortfall stood at a staggering $23.2 trillion.\n\nThe more unnerving scenario is the forecast depletion of the Old-Age and Survivors Trust Fund's (OASI) asset reserves by 2033. The OASI is responsible for making monthly payments to retired workers and survivor beneficiaries. Although an exhaustion of the OASI's asset reserves doesn't mean Social Security is bankrupt or insolvent, it does firmly imply the existing payout schedule, including COLAs, isn't sustainable. If the OASI's asset reserves are gone in eight years, as forecast, Social Security checks for retired workers and survivors could be slashed by 21%.\n\nThe OASI's asset reserves are expected to run dry by 2033. US Old-Age and Survivors Insurance Trust Fund Assets at End of Year data by YCharts.\n\nDid Donald Trump break his Social Security promise? Yes and no...\n\nWith a more thorough understanding of the challenges that lie ahead, let's circle back to the question at hand: Did President Donald Trump break his promise about Social Security?\n\nThe answer, which is based on context, is both yes and no.\n\nIn one respect, the president has, thus far, held up his end of the bargain to not touch Social Security, with respect to existing payouts.\n\nThe prevailing concern for some current and future beneficiaries is that a unified Republican government might enact sweeping benefit cuts that reduce Social Security outlays. GOP lawmakers have long favored gradually increasing the full retirement age, which would reduce lifetime benefits collected for future generations of retirees. Trump has been adamant that raising the full retirement age is off the table, which would mean no chance of any direct cuts to Social Security checks.\n\nAdditionally, there are currently no proposals to directly cut Social Security benefits from the president or members of his party that have advanced in either house of Congress. Plainly, Trump isn't coming for your Social Security check, and he's held firm to that commitment through his first two-plus months of his second term.\n\nHowever, President Trump has left the door wide open for efficiency-based cost reductions, which is a way of saying that he has reneged on his promise to not touch Social Security.\n\nFor example, Trump's Feb. 11 executive order, which is designed to support the Department of Government Efficiency (DOGE) in its workforce optimization initiatives, requires federal agencies to reduce their costs. The Social Security Administration (SSA) is responding by reducing its workforce by 7,000 jobs and shuttering some of its offices.\n\nFurthermore, all four annual budget proposals released by Trump during his first term in the White House called for efficiency-based reductions to Social Security. The cumulative cost savings of these proposals ranged from a low of $24 billion to a peak of $72 billion over 10-year periods.\n\nOne way the president attempted to make Social Security more efficient is by calling for a reduction in retroactive benefits for workers with disabilities to six months from the current 12 months.\n\nWhile Donald Trump hasn't broken his promise about Social Security in the sense that he's not directly reducing benefit checks, he has broken a line-in-the-sand pledge not to touch the program through his efforts to cut administrative costs and make it more efficient.\n\nTough choices will need to be made sooner than later\n\nMoving beyond the semantics of whether Trump hasn't been true to his own words about Social Security exposes a bigger problem. Even if DOGE oversees the optimization of the SSA's workforce and President Trump implements some modest efficiency-based changes, the cost reductions associated with these moves are a veritable drop in the bucket compared to the $23.2 trillion (and growing) long-term funding deficit. These changes also do next to nothing to avert the OASI's forthcoming asset reserve depletion.\n\nStrengthening Social Security for current and future generations will require some tough and potentially unpopular choices from our elected officials.\n\nFrequently, people on social media message boards call for high earners to pay more into the system. In 2025, earned income (wages and salary, but not investment income) between $0.01 and $176,100 is subject to the 12.4% payroll tax that's primarily responsible for funding Social Security. Approximately 6% of all workers earn above the maximum taxable cap ($176,100), meaning at least some of their income will be exempt from the payroll tax.\n\nMost Democrats have favored raising the payroll tax earnings cap, including former President Joe Biden, as well as recent presidential candidate Kamala Harris. While raising the tax cap would generate immediate income for the program and potentially kick the can on the OASI's asset reserve depletion date years or decades down the road, taxing the well-to-do, by itself, doesn't close the aforementioned $23.2 trillion long-term funding shortfall.\n\nConversely, Republicans' preference for raising the full retirement age would be successful in reducing outlays for future generations. However, going this route would take quite some time before cost savings are recognized. This means it does nothing to thwart the OASI's forecast asset reserve depletion by 2033.\n\nBut if the core proposals for Democrats and Republicans are combined into one plan, it would, collectively, do a much better job of strengthening Social Security than the unilateral proposals. Given that 60 votes are required to amend the Social Security Act in the Senate, bipartisan cooperation is going to be a necessity.\n\nWith well over three years left in Donald Trump's second term, it's simply a question of whether he or a successor leads the charge to meaningful reform.","summary":"Trump has promised neither he nor his administration will touch Social Security.","url":"https://www.fool.com/retirement/2025/04/05/donald-trump-break-social-security-promise/?source=askdougpancakes&utm_source=chromefollow&utm_medium=feed&utm_campaign=news&referring_guid=9e821f88-179c-49c3-95d7-c39b94e979c5","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F813036%2F49750148681_73e99680b4_k.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-04-05 07:44:00","author":"Sean Williams","authors":["Sean Williams"],"language":"en","category":"politics","source_country":"us","sentiment":-0.251},{"id":307916278,"title":"Joe Biden may be best to let sleeping dogs lie as new books lifts lid on his final days in office","text":"“Mr Biden ... what do you call him now? Do you still call him president?” wondered Denzel Washington. \n\nOne of Hollywood’s last titans was talking after his lead performance in Othello, the centre-point of Broadway right now with minimalist staging and maximal pricing ($900 for the beautiful-people seats). \n\nThe former first couple, Jill and Joe Biden, made what has been, since the return to the White House of Donald Trump, a rare public appearance by attending a performance last week. Being an ex-president has revivified him. Tuxedoed and relaxed, Biden had shaken off the haunted, vacant expressions that defined his final months in office.\n\nBut still, the secrets and the tattletale whispers will not stop. Two new books on last year’s unprecedented presidential election share one word in their respective titles: “wildest”. \n\nMuch of the drama of that story inevitably revolves around the mad and macabre three weeks starting with Biden’s jaw-dropping debate performance in Atlanta and his decision, after a soul-searching weekend of warm, spitting rain at his Rehoboth Beach summer home, to exit the race. \n\nThose events bracketed America’s latest brush with the nightmare of presidential assassination: the bullet that grazed Trump’s ear and a few seconds of violence that left both the would-be assassin and an innocent Republican supporter, Corey Comperatore, dead after a midsummer rally in Butler, Pennsylvania.\n\nThe details of the books revolve around the Democrats’ internal fragmenting of faith in Biden’s ability to win the race, and the uncomfortable sense that their president was cocooned from close outside scrutiny by his family and immediate staff. The hot gossip comes from inside sources rather than direct interviews with the key protagonists: that Nancy Pelosi tried to dissuade Biden from taking Trump on in a direct debate; that the president himself was champing at the bit, both because he believed he could best Trump and because, even then, the data was showing an alarming drop in his public support and that he needed to make a dramatic statement.\n\nHe did that in Atlanta, but in the most catastrophic way possible. One of the most damning passages in Chris Whipple’s book, Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History, chronicles the days leading to that CNN debate, as told by Ron Klain, the former adviser who returned last summer to help him prepare. Halfway through a session in the presidential cabin in Aspen Lodge, Biden took a break, went outside and lay on a pool lounger and instantly fell asleep through pure exhaustion.\n\n“We sat around the table,” Klain recalls in the book. ‘[Biden] had answers on cards, and he was just extremely exhausted. And I was struck by how out of touch with American politics he was. He was just very, very focused on his interactions with Nato leaders.‘”\n\nIt was always Biden’s contention that his on-screen vacuity was indeed attributable to exhaustion and a cold. He had been travelling intensively in Europe and then appeared in Los Angeles for the fundraiser during which George Clooney first became concerned that Biden no longer possessed the vitality required to continue, leading to his infamous New York Times opinion piece. Whipple told Politico he believes that many of those closest to Biden “were in a fog of delusion and denial. They believed what they wanted to believe”.\n\nTrump’s tireless prosecution of the idea that Biden was unfit for office continued before and after the election and still preoccupies the current administration. \n\nThe most recent aspersion related to Biden’s use of an auto-pen to sign the slew of presidential pardons as he left office. White House press secretary Karoline Leavitt mused in the briefing room about the subject. “I think journalists in this room should be asking about whether or not the former president of the United States, whom I think we can finally agree was cognitively impaired, as evidenced by his disastrous debate performance ... did the president even know about these pardons?” \n\nA year ago, her predecessor, Karine Jean-Pierre, faced almost weekly inquisitions about the state of her president’s mental acuity. By the end she sounded exhausted and saddened as she batted them away week after week.\n\nThe subsequent internal tensions caused by the reluctance of grandees such as Barack Obama to immediately row in behind Kamala Harris, and the split opinion on her suitability as a candidate, are the stuff of woulda-coulda-shoulda for the Democrats.\n\nBiden has, wisely, maintained a radio silence about it all. It is believed he is working on a memoir of his own. It might be more sensible for him to just let sleeping dogs lie and trust time and the future biographers to evaluate his 50-year legacy rather than his one-night nightmare. “A real man of integrity,” Washington said after the show.\n\nThere’s that line Biden, in the darkness of the theatre, would have heard Washington deliver as Othello: “Were it my cue to fight, I should have known it without a prompter.”\n\nHe didn’t, and he will never stop paying the price.","summary":"With the former president said to be working on a memoir, two new books offer damning details of the fragmentation of faith in him before last November’s US election","url":"https://www.irishtimes.com/world/us/2025/04/05/for-joe-biden-as-new-books-lift-the-lid-discretion-may-be-the-better-part-of-valour/","image":"https://www.irishtimes.com/resizer/v2/B4PEAUXDBKUSWPXAXLQFZKR5UI.jpg?auth=f683603b4565dd981a5da821bd436dfd3b820726cd2265078859583118c6ff43&smart=true&width=1600&height=900","video":null,"publish_date":"2025-04-05 04:00:00","author":"Keith Duggan","authors":["Keith Duggan"],"language":"en","source_country":"ie","sentiment":-0.136},{"id":307852980,"title":"Kamala Harris sought Obama’s ‘approval,’ was ‘really hurt’ by delayed 2024 endorsement, says co-author","text":"to top close Video This video is playing in picture-in-picture.\n\nJesse Watters Primetime April 04, 2025 11:00 \n\n Kamala Harris sought Obama’s ‘approval,’ was ‘really hurt’ by delayed 2024 endorsement, says co-author \n 'Fight’ co-author Amie Parnes details findings on the Democratic Party from her book on ‘Jesse Watters Primetime.’\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRJESSE WATTERS PRIMETIMEPOLITICSDEMOCRAT ELECTIONSBARACK OBAMAKAMALA HARRISJOE BIDEN","summary":"&apos;Fight’ co-author Amie Parnes details findings on the Democratic Party from her book on ‘Jesse Watters Primetime.’","url":"https://www.foxnews.com/video/6371074361112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8eecebe9-bfe2-490b-9b5f-d3377b8c8d0a/4b4c6d1e-f18e-419b-9f10-763171b89cf1/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-05 02:53:39","author":null,"language":"en","source_country":"us","sentiment":-0.535},{"id":307848608,"title":"Barack Obama ‘destroyed’ the Democratic Party by competing for ‘power and money’ with his own organization: new book","text":"Former President Barack Obama sought to distance himself from the Democratic Party after leaving it in shambles following his departure from the White House, according to a new book.\n\nThe book, “Fight: Inside the Wildest Battle for the White House,” published by William Morrow and Company, claims that Obama was never a Democratic Party loyalist. Instead, the authors allege, Obama curried favor from a group of “black professionals” for his campaigns, unlike former President Bill Clinton and former Secretary of State and presidential candidate Hillary Clinton, and former President Joe Biden.\n\nAdditionally, Obama’s creation of Organizing for Action — a nonprofit that launched in 2012 following Obama’s re-election to advance his legislative priorities — fractured the Democratic Party, according to the book, authored by political journalists Jonathan Allen of NBC News and Amie Parnes of The Hill.\n\n“Though Organizing for Action never realized his vision, it competed with the party for power and money,” the book said. “He left the Democratic Party far weaker than he found it. Or, as one party operative put it, ‘Obama destroyed that s—.’”\n\nThe book also detailed how the Clintons, along with Biden and former Democratic National Committee Chair Donna Brazile and a few other party operatives, sought to “rebuild the party infrastructure” following Obama’s 2016 departure from the White House. This meant preventing far-left Democrats from seizing control of the party and ensuring party loyalists ran the show, according to the book.\n\n“By helping install party loyalists at the national and state committees over the course of years, these establishment Democrats kept progressive outsiders at bay. ‘You know who did that?’ said one Biden ally familiar with the maneuvering. ‘Bill and Hillary motherf—ing Clinton,’” the book related.\n\n“Fight,” released Tuesday, also revealed how Obama remained hesitant to back former Vice President Kamala Harris in the 2024 election to replace Biden, amid concerns about his mental fitness. The book claimed that Obama didn’t believe Harris had the capacity to beat now-President Donald Trump in the November 2024 race, frustrating Harris.\n\nUltimately, Obama endorsed Harris five days after Biden announced he would not run for office again in the 2024 race — a delay that offended Harris and required some “mending” between the two Democrats, a source close to Obama said, Allen and Parnes wrote. \n\nA spokesperson for Obama’s press office did not immediately respond to a request for comment from Fox News Digital. \n\nEven so, Obama’s wife, former first lady Michelle Obama, appeared at the Democratic National Convention in August 2024 after Harris clinched the party’s nomination. \n\n“Kamala Harris is more than ready for this moment,” Michelle Obama said at the convention. “She is one of the most qualified people ever to seek the office of the presidency and she is one of the most dignified — a tribute to her mother, to my mother, and probably to your mother, too, the embodiment of the stories we tell ourselves about this country.” \n\nMeanwhile, Democrat strategists predict that Barack Obama’s influence over the Democratic Party is waning, and some have suggested he is out of touch with the appeal of Trump. \n\nFor example, political commentator and author Ben Burgess wrote an op-ed after Obama delivered a speech at the Obama Democracy Forum that part of the “problem” is Obama doesn’t understand why Trump won the 2024 election and that the American public should stop listening to the former president. \n\n“​​Obama’s characteristic rhetorical virtues were on full display,” Burgess wrote in December 2024 for MSNBC, following Obama’s speech. “He was a constitutional law professor before he was a politician, and he still sounds like one. At the same time, he was a once-in-a-generation talent as a political communicator. He knows how to convey a complex set of ideas in a digestible and appealing way.” \n\n“But there was a massive gaping hole at the center of his speech,” the op-ed stated. “He still doesn’t understand why his eight years in power culminated in the rise of Trump.” \n\n“Fight” details how Trump secured the White House for a second term and the fallout of his victory for the Democratic Party. It is based on interviews Allen and Parnes conducted with more than 150 political insiders, according to the book’s description.","summary":"A new book details fractures in the Democratic Party amid the 2024 election.","url":"https://nypost.com/2025/04/04/media/barack-obama-destroyed-the-democratic-party-by-competing-for-power-and-money-with-his-own-organization-new-book/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/101724509.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/MaMwprGw-RyIcpnTz.mp4","publish_date":"2025-04-05 01:56:03","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.261},{"id":307842648,"title":"Ex-Dem-turned-Republican donor is left speechless as she is ROASTED over her hypocrisy","text":"Democrat fundraiser turned Republican Lindy Li was attacked on Fox News over her political evolution from helping build up Kamala Harris' war chest to Donald Trump supporter. \n\nA consummate liberal who once referred to Trump as 'a serial rapist' and the woman's chair of the Democrat National Committee, after the election Li became so disgusted with the party that she fundraised for the president's inaugural. \n\nLi, 34, has since become a popular figure to critique the Democrats on Fox and other networks as Trump goes about his first 100 days in office.\n\nOn The Will Cain Show Friday, however, right-wing podcast host Wade Stotts took her to task for her changing position and called her 'delusional' for thinking she could go from Democrat fundraiser to Trump supporter. \n\nCain and Li discussed Democrats' hypocrisy on trade issues and tariffs in the past before Stotts attempted to rake her over the coals. \n\n'Yeah, I'm not surprised at this behavior. These are people with no core beliefs. They just say whatever's most advantageous to them personally at that moment,' he said of Democrats, before turning to Li. \n\n'You know, it's almost as bad as a person who raised tens of millions for Kamala trying to pass herself off as a right-wing influencer… the second her team loses. So I don't know what Lindy thinks about that, but just my opinion.\n\nLi immediately shot back: 'I've been on Fox News for years saying that I'm a conservative Democrat. This is not a sudden switch at all. It's been a years-long evolution, and I've been warring against the leftist faction of the Democratic Party for years.'\n\nStotts continued in, saying he was stunned that Li had the gall to say the Democrats were hypocritical. \n\n'It's hilarious to hear Lindy Li slamming Democrats for being duplicitous. She was a Democrat until five minutes ago. The only belief she's kept from six months ago is that she should be in charge of moving large sums of money. And that's it,' he said. \n\nHe added: 'If you think you're going to be able to avoid conversations about your loyalty, you're delusional.'\n\nStotts read out paraphrased versions of past opinions Li held - that Trump has a 'Christo-fascist' view of America, that Ruper Murdoch 'broke Democracy' and 'anti-woke is code for anti-Black' - and said 'now you're on Fox, talking about how fickle other people are.'\n\n'Which version of you was the real version and why should we listen to you now?'\n\nAfter Li briefly stood up for herself, Cain pivoted the show to discussing a separate topic but Stotts wasn't done.\n\nWhen Cain asked Stotts why previously anti-tariff conservatives were supporting Trump's 'Liberation Day' agenda, he took a very thinly veiled shot again.\n\n'Well, because Trump is the leader of the movement, and whatever you say about the pushback from the right, none of these people who are on the right tried to raise tens of millions of dollars for the people who tried to put Trump in jail,' he said.\n\nLi didn't respond to the charge but to Stotts' tactic of criticizing her.\n\n'You're just trying to ambush me this entire time. I'm not going to sink to your level. You can do whatever you want, but I'm not as malicious as you are.' \n\nLi has yet to publicly comment on the incident but afterward, Stoss posted some of her previous takes to X with the caption: 'Couple receipts, in case you need em.' \n\nShe was a high-energy fundraiser and failed Congressional candidate before making the shocking 180 after an extraordinary journey though a crazy year in Democratic politics culminating in Kamala Harris' historic loss to Donald Trump.\n\nDuring the 2024 election, Lindy was considered a consummate Democratic influencer combined with her ability to fundraise for the Democratic Party. \n\nShe was invited to join events with President Joe Biden, Harris, and First Lady Jill Biden and she championed all of them on her social media platform. \n\nBorn in China, she moved to America at the age of four and went to Princeton. She self-described herself as a ‘book worm’ and a ‘wallflower’ who majored in philosophy, championing issues of climate change and even ran and won and unlikely campaign for class president.\n\nAfter college, she took a job at Morgan Stanley, but continued pursuing a dream of running for political office. She worked enthusiastically to boost Democrats for decades, interning with former congressman Joe Sestak, and even unsuccessfully running for Congress herself at the age of 25.\n\nIn many ways Lindy Li could have been the next rising political star in the Democratic Party. A Chinese immigrant, whose great-grandfather was murdered by communists, ran as an inspirational figure who believed in the promise of America. But every attempt at running for office ended in the establishment figures in Pennsylvania crushing her political aspirations. \n\nShe continued on as a fundraiser and a media personality, trashing Trump and his MAGA movement at every opportunity.\n\nNamed by WIRED magazine as one of the top influencers of the 2024 election, Li was invited to the Democratic National Committee last August as an official credentialed influencer and given access to events. \n\nOn TV she celebrated Biden’s vitality, Kamala Harris’ political strengths and condemned Trump’s racism and the overall toxicity of the MAGA movement.\n\nAt the last Kamala Harris campaign rally in Philadelphia, Pennsylvania, Li was there in the front row with prominent figures and Biden’s daughter Ashley and others to cheer on Harris as the historic first female president on the United States.\n\nBut that all came crashing down on Election Day, when Harris lost badly and it was clear that Democrats had seriously oversold their chances at beating Donald Trump.\n\nThat infuriated Li, who had invested a great deal of personal time and energy in the campaign. \n\nShe was outraged that for months, Democrats had told her and others that Harris would easily sweep the election and encouraged them to raise more money and work harder. Crestfallen, she explained that she realized that top leaders in the Democratic Party were just 'lying' to her the entire time.\n\nThat inspired her to go public to criticize the campaign for their obvious failures and outrage at the way Democrats spent her and her fellow donors money. \n\nShe was angry, but still a Democrat who wanted to voice her criticism and frustration for the party. \n\n‘It was just startling how there was no sense of responsibility. They essentially set $2 billion on fire in 100 days,’ she said in an interview after the election with NewsNation.\n\nFor Li to criticize the party post-election was a massive shift in her life, but one she did not expect would change her political identity.\n\nHer criticism was not received well by the wounded Democratic influencer community who had sat with her in the same events with Joe Biden, Kamala Harris, and White House officials.\n\n“All I did is tell the truth I literally that’s all I did, all I did is tell it like it was,’ she reflected.\n\nLi estimated to DailyMail.com that she had raised funds within six-figure range for the Trump transition team in the short time she started soliciting donations. The Trump transition team did not respond to a request for comment.\n\nRepublicans, Li said, accepted her with open arms, even inviting her to Trump's club Mar-a-Lago for the year-end fundraisers and festivities. She did not go to Mar-a-Lago but was touched by the warm welcome that Trump supporters were willing to give her.\n\nWith Democrats, Li said she ‘fought tooth and nail’ just to get recognized. Republicans, she said, were far more welcoming.\n\n‘It’s like night and day,’ she said, citing daily communications from Republicans on the committee. \n\nMany Democrats are furious at her betrayal, but Li argued they made a mistake by failing to recognize their failures and accept criticism.\n\n‘They’d rather destroy the critics rather than than accept that the party might have done something wrong, it’s more convenient to blame me,’ she said.\n\nLi says her family and lose friends are accepting of her identity flip, but the influencers she spent time with during the election are now out to destroy her.","summary":"Lindy Li was attacked on Fox News over her political evolution from helping build up Kamala Harris' war chest to Donald Trump supporter.","url":"https://www.dailymail.co.uk/news/article-14573727/Ex-Dem-turned-Republican-donor-left-speechless-ROASTED-hypocrisy.html","image":"https://i.dailymail.co.uk/1s/2025/04/05/01/96941361-0-image-a-5_1743814533827.jpg","video":null,"publish_date":"2025-04-05 01:40:15","author":"Editor,Stephen Lepore","authors":["Editor","Stephen Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.514},{"id":307836798,"title":"New books shine light on alleged chaos behind Harris campaign, Biden presidency","text":"to top close Video This video is playing in picture-in-picture.\n\nSpecial Report April 04, 2025 02:12 \n\n New books shine light on alleged chaos behind Harris campaign, Biden presidency \n Fox News senior national correspondent Aishah Hasnie takes a look at reaction to claims made by two books about former President Joe Biden's mental acuity and angst surrounding Kamala Harris' sudden candidacy on 'Special Report.'\n Tags POLITICSSPECIAL REPORTJOE BIDENKAMALA HARRIS","summary":"Fox News senior national correspondent Aishah Hasnie takes a look at reaction to claims made by two books about former President Joe Biden&apos;s mental acuity and angst surrounding Kamala Harris&apos; sudden candidacy on &apos;Special Report.&apos;","url":"https://www.foxnews.com/video/6371066553112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b46349cb-fdeb-4795-897a-05b57e046235/d97c238f-2b01-4de3-bf03-dfe8fe9648bf/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-05 01:10:03","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.11},{"id":307836480,"title":"Kamala Harris says 'I told you so' while slamming President Trump's second term in latest public appearance","text":"Former Vice President Kamala Harris had her \"I told ya so\" moment at a speech in California Thursday. \"We're seeing people stay quiet. We are seeing organizations stay quiet. We are seeing those who are capitulating to clearly unconstitutional threats. And these are the things we are witnessing. Each day in the last few months in our country. And it understandably creates a great sense of fear. Because you know there were many things we knew would happen,\" Harris said at the Leading Women Defined Summit in Dana Point, California. \"I’m not here to say I told you so,\" Harris said, breaking into laughter with the audience. \"I swear, I wasn’t going to say that.\" KAMALA HARRIS WAS ‘VERY ANNOYED’ WITH OBAMA AS SHE SOUGHT HIS ENDORSEMENT, BOOK REVEALS Harris’ comments were the first time she took a victory lap of sorts after her crushing defeat in the presidential election. Several of Trump's initiatives are tied up in the courts and stocks plunged this week as his tariffs rocked global markets. A new book reports Harris was blindsided by her 2024 election loss to Trump because she \"bought the hype\" that she would win. \"She was completely shocked, and [Harris' running mate] Tim Walz was shocked,\" The Hill reporter Amie Parnes said on the podcast \"Somebody's Gotta Win with Tara Palmeri,\" released Thursday. Parnes discussed reporting in her new book, \"Fight: Inside the Wildest Battle for the White House,\" which she co-authored with NBC reporter Jonathan Allen. The book tackles the 2024 presidential campaign and the chaos that unfolded after former President Biden withdrew from the race and Harris took his place at the top of the Democratic ticket. TOP KAMALA HARRIS CAMPAIGN ADVISOR ADMITS SHE WAS FLOORED BY DEMOCRAT'S MAJOR FLUB ON 'VIEW' CLICK HERE TO GET THE FOX NEWS APP Harris in February delivered her first major speech since her election loss in November after several months out of the public spotlight. While accepting an award from the NAACP Image Awards, Harris took veiled jabs at Trump and Department of Government Efficiency chief Elon Musk.","summary":"VP Kamala Harris addresses silence and fear amid &apos;unconstitutional threats&apos; noting, &apos;I&apos;m not here to say I told you so,&apos; despite saying, &apos;We knew [this] would happen.&apos;","url":"https://www.foxnews.com/media/kamala-harris-says-i-told-you-so-while-slamming-president-trumps-second-term-latest-public-appearance","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/kamala-harris-laughing-image-draft.png?ve=1&tl=1","video":null,"publish_date":"2025-04-05 01:00:48","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.012},{"id":307836794,"title":"Friday Follies: Kamala Harris' word of the day is 'courage'","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle April 04, 2025 05:36 \n\n Friday Follies: Kamala Harris' word of the day is 'courage' \n Fox News contributor Raymond Arroyo talks movie remakes and the former vice president's latest speech on 'The Ingraham Angle.' \n Tags THE INGRAHAM ANGLESHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRPOLITICS","summary":"Fox News contributor Raymond Arroyo talks movie remakes and the former vice president&apos;s latest speech on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6371064743112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/df1fa54c-9d79-4ed5-a93f-d6fa355e7428/6c5d6609-4a68-4684-ac2c-7c3b7f183878/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-05 00:19:28","author":null,"language":"en","source_country":"us","sentiment":0.668},{"id":307833794,"title":"Schumer slams United Auto Workers union for praising the Trump tariffs he says 'hurt everybody'","text":"Senate Minority Leader Chuck Schumer, D-N.Y., called out the United Auto Workers (UAW) union on Friday for endorsing President Donald Trump’s automobile tariffs. In a CNN appearance, the lawmaker argued that UAW support for Trump’s tariffs is misguided, noting that even if some elements of Trump’s policy are good, overall, they will hurt American families. \"Look, I respect them [UAW]. But the tariffs – if they wanted to do something about auto – should have been much more pinpointed and isolated than this massive assault on American families, all to help the billionaires,\" Schumer told CNN host Dana Bash. WALL STREET FIRMS SEE RECESSION RISK RISING OVER TARIFFS, TRADE WAR UAW president Shawn Fain praised Trump for enacting major tariffs on foreign-made automobiles and parts earlier this month. As reported by the Detroit Free Press, Fain told an audience at Wayne State University in Detroit, \"Yes, I disagree with Donald Trump on virtually everything, but [tariffs are] one thing I don’t disagree on.\" Fain, who has been a fierce critic of Trump – expressing support for former Vice President Kamala Harris’s White House run during the Democratic National Convention last year – added that the Democratic Party hasn’t done the work to protect the American auto industry. \"We’ve begged Democrats, politicians for years, to do something to get these companies in line,\" he said, also noting that he’s not afraid to praise Trump on the issue, even if the president is a Republican. TRUMP IS 'ALWAYS UP FOR A GOOD NEGOTIATION,' WHITE HOUSE SAYS, AS APRIL 2 'LIBERATION DAY' TARIFFS LOOM \"I’m not going to sit here now and say that since he’s a Republican or because he’s Donald Trump, I’m going to say, ‘screw you.’ That’s not how we do things. It’s having integrity,\" Fain said. Trump instituted 25% tariffs on outsourced cars and auto parts last week, which is primed to hit domestic brands like Chevrolet – which now produces vehicles in Mexico like the popular Equinox, and shuttered its major Lordstown, Ohio, assembly plant in 2020. However, Schumer suggested that UAW is ignoring the negative effects of Trump’s tariff policies on the whole country while focusing on the good it affords them. \"Look, there are certain tariffs that – pinpointed, careful, aimed at things that other countries are doing badly at us – makes sense. This is not that. This is across the board, 10% on everything, in addition to what other tariffs he‘s put on,\" the Senate Minority Leader said. When Bash asked about whether the auto tariffs by themselves are good, he replied, \"Well, look, you have to look at it in the whole context of things. When there‘s such chaos in America, I think fewer Americans are going to buy cars - American cars or otherwise - because it‘s so chaotically done. So, I think it hurts everybody.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Bash also asked Schumer about how he has been responding to Democratic lawmakers questioning his leadership in recent weeks after he broke party ranks and voted for a GOP-approved continuing resolution to keep the government from shutting down. Schumer replied by stating that he and the Democratic Party are looking ahead and taking the fight to Trump with a united front. \"We are now focused on the future, and we are focused on showing how awful this administration is,\" he said. \"And you‘re going to find all of us [Sen. Cory Booker, D-N.J.], myself, and the whole Democratic Party united on what to do, and going forward, and going after Trump day in and day out, showing the American people that Trump has betrayed them, that he’s broken his promises, and that we’re on the side of working people, and he’s on the side of billionaires.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Senate Minority Leader Chuck Schumer, D-N.Y., called out the UAW union on Friday for praising President Donald Trump’s tariffs on foreign automobiles and parts.","url":"https://www.foxnews.com/media/schumer-slams-united-auto-workers-union-praising-trump-tariffs-hurt-everybody","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/schumer-cnn.png?ve=1&tl=1","video":null,"publish_date":"2025-04-05 00:09:48","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","category":"politics","source_country":"US","sentiment":-0.283},{"id":308019076,"title":"Obama expresses deep concern as Trump admin takes aim at students and law firms","text":"Former President Barack Obama said he is \"deeply concerned\" with some of the actions that President Donald Trump and his administration have taken and seemed to call out the Republican Party for not pushing back on them, NBC News reported.\n\nObama rebuked Trump without explicitly naming him over the federal government's threats against universities and students who exercise free speech, its targeting of law firms, and the new tariffs imposed on foreign countries.\n\n\"I don’t think what we just witnessed in terms of economic policy and tariffs is going to be good for America, but that’s a specific policy,\" Obama said in his remarks at Hamilton College in New York. \"I’m more deeply concerned with a federal government that threatens universities if they don’t give up students who are exercising their right to free speech,\" he said.\n\nObama said he's more troubled by a White House that takes aim at law firms that represent ideas or parties that its occupants disagree with, and that the administration has punished media outlets. Trump has signed executive orders penalizing major law firms and lawyers, prompting outrage within the legal community. The White House has also barred The Associated Press from coverage over its refusal to refer to the Gulf of Mexico as the Gulf of America.\n\n\"That kind of behavior is contrary to the basic compact we have as Americans,\" he said.\n\nObama suggested that Republicans would be outraged if he had done similar things as president.\n\n\"Imagine if I had pulled Fox News’ credentials from the White House press corps,\" he said, adding, “It’s unimaginable that the same parties that are silent now would have tolerated behavior like that from me or a whole bunch of my predecessors.\"\n\nHe added, \"I say this not on a partisan basis. This has to do with something more precious, which is who are we as a country and what values do we stand for?\"\n\nHis final message during his speech was that \"history zigs and zags and there are times of conflict and there are times of stupidity and there are times of danger,\" but he wants people to remain resilient.\n\n\"Don’t get discouraged,\" he said. \"I know it’s a little crazy right now, but we’re going to be OK.\"\n\nFormer Vice President Kamala Harris also spoke out against the Trump administration at the Leading Women Defined Summit in California on Thursday. She said that the country is witnessing \"progress being rolled back\" and a \"sense of fear\" taking hold nationwide.\n\n\"We are seeing those who are capitulating to clearly unconstitutional threats,\" she said. \"And these are the things that we are witnessing each day in these last few months in our country. And it understandably creates a great sense of fear.\"\n\nHarris, who has kept a low profile since losing to Trump in November's presidential election, said that \"fear has a way of being contagious\" but that \"courage is also contagious.\"\n\nThe White House didn't immediately respond to a request for comment about their remarks. \n\nMichele Norris contributed.\n\nThis article first appeared on NBCNews.com. Read more from NBC News here:\n\nTrans student’s arrest for violating Florida bathroom law is thought to be a first\n\nFormer California police officer awarded $10 million in harassment suit\n\nUSA Fencing disqualifies female fencer for refusing to fight trans opponent","summary":"Former President Barack Obama said he is &#8220;deeply concerned&#8221; with some of the actions that President Donald Trump and his administration have taken and seemed to call out the Republican Party for not pushing back on them, NBC News reported.\n\n\n\n\n\nObama rebuked Trump without explicitly naming him over the federal government&#8217;s threats against universities and students who exercise free speech, its targeting of law firms, and the new tariffs imposed on foreign countries.\n\n\n\n\n\n&#8220;I don’t think what we just witnessed in terms of economic policy and tariffs is going to be good for America, but that’s a specific policy,&#8221; Obama said in his remarks at Hamilton College in New York. &#8220;I’m more deeply concerned with a federal government that threatens universities if they don’t give up students who are exercising their right to free speech,&#8221; he said.\n\n\n\n\n\nObama said he&#8217;s more troubled by a White House that takes aim at law firms that represent ideas or parties that its occupants","url":"https://www.nbcwashington.com/news/national-international/obama-expresses-deep-concern-as-trump-admin-takes-aim-at-students-and-law-firms/3884494/","image":"https://media.nbcwashington.com/2025/04/GettyImages-2188444423.jpg?quality=85&strip=all&resize=1200%2C675","video":null,"publish_date":"2025-04-05 00:00:00","author":"Rebecca Shabad and Peter Alexander | NBC News","authors":["Rebecca Shabad and Peter Alexander | NBC News"],"language":"en","source_country":"us","sentiment":-0.122},{"id":307816460,"title":"Unfortunate update on WWE legend's Hall of Fame induction - Reports","text":"There has been an unfortunate update regarding a legend being inducted into the WWE Hall of Fame. The ceremony will take place during WrestleMania 41 weekend.According to a new report from WrestleVotes, wrestling legend Kamala (James Harris) will not be inducted into the Hall of Fame this year. The report noted that the company was in discussions with the Harris family, and they remain positive that he will be inducted down the line. The Ugandan Giant passed away in 2020 at 70 years old.\"Well, it appears Kamala will ultimately not be a part of this year's Hall of Fame class. I'm told discussions between WWE and James Harris' family have remained positive and that The Ugandan Giant will one day be honored with an induction in the future.\"Kamala was a very recognizable performer and had an impressive career as a professional wrestler. He competed for many different promotions over the years.Former WWE writer reacts to major Hall of Fame announcementWrestling legend Vince Russo recently commented on WWE announcing that Stone Cold and Bret Hart's WrestleMania 13 match would be inducted into the Hall of Fame this year as an iconic moment.Speaking on Sportskeeda Wrestling's BroDown show, Russo claimed that he didn't understand the logic behind inducting matches into the Hall of Fame. He wondered what other moments the company would decide to be worthy of being inducted and suggested that there was likely sponsorship money involved in the decision.\"And again, why is this, Mac? Why is this? Because they'll get somebody to sponsor it and they'll make another payday on? 'Hey, you want to sponsor the match of the year that's going into the Hall of Fame?' Boom.\" [From 31:26 to 31:56]You can check out Russo's comments in the video below:Triple H, Michelle McCool, Lex Luger, and The Natural Disasters have been announced as inductees for this year's Hall of Fame. It was recently reported that Kamala's family had signed a WWE Legends contract. Only time will tell when Kamala is honored by the company and inducted into the Hall of Fame sometime down the line.","summary":"There has been an unfortunate update regarding a legend being inducted into the WWE Hall of Fame. The ceremony will take place during WrestleMania 41 weekend.","url":"https://www.sportskeeda.com/wwe/rumor-unfortunate-update-wwe-legend-s-hall-fame-induction-reports","image":"https://statico.sportskeeda.com/editor/2025/04/c2366-17438032606686-1920.jpg","video":null,"publish_date":"2025-04-04 22:40:10","author":"Robert Lentini","authors":["Robert Lentini"],"language":"en","source_country":"in","sentiment":-0.384},{"id":307826334,"title":"Columnist Quits 'Washington Post' Over Jeff Bezos' 'Significant Shift' in 'Mission'","text":"Columnist Eugene Robinson has reportedly revealed to his colleagues at the Washington Post that he is quitting the newspaper due to its owner, Jeff Bezos, implementing a “significant shift” in the company’s “mission.”\n\n“Eugene Robinson is leaving The Washington Post, per an email he sent to the staff this morning,” New York Times reporter Ben Mullin said in an X post Thursday, sharing an email purportedly sent from Robinson to the newspaper’s employees.\n\n“Dear colleagues, I wanted to let you know that I’ve decided to leave The Post,” Robinson wrote, adding that Bezos’ plans for a “significant shift” is what “spurred” him to make this decision.\n\n“The announced ‘significant shift’ in our section’s mission has spurred me to decide that it’s time for my next chapter,” the Pulitzer Prize-winning columnist added.\n\n“I wish nothing but the very best for the paper and for all of you. I won’t be a stranger, and I’ll be reading your unparalleled work every single day,” Robinson, who has worked at the Washington Post for over four decades, concluded.\n\nThe columnist’s announcement comes after Bezos’ decision to overhaul the newspaper’s editorial pages.\n\nIn February, Robinson reacted to the changes, telling MSNBC’s Morning Joe, “This is not the way we have worked to produce what is, I believe, objectively the best opinion section in American journalism.”\n\n“I think it’s a mistake journalistically, I think it’s a mistake as a business proposition but, you know, it leaves us with choices and decisions to make about our futures,” he added.\n\nAs Breitbart News reported in late October, less than two weeks before the 2024 presidential election the Washington Post‘s editorial board announced it would not be endorsing any candidates in the upcoming presidential election.\n\nBezos had reportedly ordered the non-endorsement amid early vote trends appearing to favor Trump. The decision was the first time in 36 years the Post chose not to endorse a presidential candidate — a major blow to then-Vice President Kamala Harris.\n\nThe Amazon founder — who has several large contracts with the U.S. government — was later seen with his fiancée, Lauren Sanchez, attending President Donald Trump’s inauguration in January.\n\nRobinson is not the only Washington Post writer to exit the newspaper. Longtime columnist Ruth Marcus and editorial cartoonist Ann Telnaes have also said their goodbyes in recent months.\n\nAmusingly, Telnaes revealed she quit the newspaper after it axed a sketch she made featuring Bezos on bended knee for President Trump.\n\nAlana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.","summary":"Columnist Eugene Robinson has reportedly revealed to his colleagues at the Washington Post that he is quitting the newspaper due to its owner, Jeff Bezos, implementing a \"significant shift\" in the company's \"mission.\"\n\n\nThe post Columnist Quits &#8216;Washington Post&#8217; Over Jeff Bezos&#8217; &#8216;Significant Shift&#8217; in &#8216;Mission&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/pre-viral/2025/04/04/columnist-quits-washington-post-jeff-bezos-significant-shift-mission/","image":"https://media.breitbart.com/media/2025/04/Eugene-Robinson-640x335.jpg","video":null,"publish_date":"2025-04-04 22:06:40","author":"Alana Mastrangelo","authors":["Alana Mastrangelo"],"language":"en","category":"politics","source_country":"US","sentiment":0.12},{"id":307812140,"title":"Journalist Amie Parnes Reports Kamala Harris Stunned by Election Defeat","text":"Kamala Harris was so stunned by her election day loss to Donald Trump she couldn’t even put her defeat into words, and she felt like Barack Obama and Nancy Pelosi let her down … according to a revealing new book about her failed presidential bid.\n\nAuthor and journalist Amie Parnes joined us Friday on ” Live” for an inside look at the Harris campaign, from start to finish … telling us when Trump was declared the winner, Kamala was in absolute shock at her Naval Observatory residence.\n\nTim Walz was equally stunned as he got the bad news in his Washington D.C. hotel room … and Amie says Harris and Walz both believed they would beat Trump and J.D. Vance.\n\nAmie co-authored, “Fight: Inside The Wildest Battle For The White House” — with Jonathan Allen — and she also breaks down the dynamics between Harris and other top Democrats … namely, Obama and Pelosi.\n\nShe tells us Kamala wanted Obama and Pelosi to do more to rally the party around her after President Biden dropped out of the race and endorsed her … and was disappointed Barack and Nancy felt she couldn’t win in November.\n\nLots to learn from looking back, and Amie explains why her book can serve as a guidebook for Democrats in the 2026 and 2028 elections.","summary":"Internewscast Journal\n\nInternewscast\n\n\nKamala Harris Utterly Stunned at Losing Election &#8230; Upset With Obama Too,&#8230;\n\n\nThis Post: Journalist Amie Parnes Reports Kamala Harris Stunned by Election Defeat first appeared on Internewscast Journal","url":"https://internewscast.com/entertainment/journalist-amie-parnes-reports-kamala-harris-stunned-by-election-defeat/","image":"https://imagez.tmz.com/image/52/4by3/2025/04/04/5286a569015844daae0f2e8b94bf9157_md.jpg","video":null,"publish_date":"2025-04-04 21:47:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.529},{"id":307828302,"title":"Former Trump advisor slams Kamala Harris' 'world salad' in speech criticizing President Trump","text":"to top close Video This video is playing in picture-in-picture.\n\nAmerica Reports April 04, 2025 05:13 \n\n Former Trump advisor slams Kamala Harris' 'world salad' in speech criticizing President Trump \n Former Senior Trump advisor Jason Miller on 'America Reports' Friday reacted to former Vice President Kamala Harris taking a jab at President Donald Trump in her latest speech in California.\n Tags POLITICSSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRAMERICA REPORTSMEDIA","summary":"Former Senior Trump advisor Jason Miller on &apos;America Reports&apos; Friday reacted to former Vice President Kamala Harris taking a jab at President Donald Trump in her latest speech in California.","url":"https://www.foxnews.com/video/6371054919112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/4618079c-f0e7-455b-99ae-8e467e35a37f/5051e569-e770-40eb-9129-372f78e151d9/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-04 21:42:42","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.047}]}