{"offset":0,"number":50,"available":647,"news":[{"id":348499182,"title":"Healey meets with Texas Democrats who fled their state amid battle over redistricting","text":"Gov. Maura Healey is the latest state leader to welcome Democratic lawmakers who have fled Texas as they fight against a redrawn congressional map there that would likely add five Republican seats to Congress.\n\nHealey and Secretary of the Commonwealth Bill Galvin met with 10 of the absconded Texas Democrats in Boston Tuesday afternoon. The Texas lawmakers left the state to temporarily block a vote on a new congressional map sought by President Donald Trump.\n\n“This is an attempt to grab power, to change the rules, to determine a certain outcome,” Healey told reporters. “It is antithetical to American democracy and is antithetical to the functioning of American government – local, state and federal – that we have known since the very beginning.”\n\nSince leaving, the 150-seat Texas House, with 88 Republicans and 62 Democrats, has been unable to establish a 100-person quorum to hold session. The House reconvened but failed to reach a quorum for the second day in a row Tuesday.\n\nGov. Greg Abbott of Texas has threatened to arrest those absent, which Democrats called a “smoke and mirrors” tactic. Some House members will face $500 daily fines for staying out of the state.\n\n“We are literally holding the line on democracy, not just for Texas, but for our nation,” said Carol Alvarado, a Texas state senator. “Today, President Trump said that he was entitled to five more seats in Texas, five more Republican seats, and we’re here to say nobody is entitled.”\n\nAlvarado and other state senators and representatives flanked Healey in the Governor’s Ceremonial Office, where she said the redrawn map targets districts that are “majority-minority districts” represented by people of color. \n\n“This is a splintering of communities and neighborhoods,” Galvin said, also noting the map would affect the midterm elections early next year. “They’re not simply saying, ‘well, let’s just change a few towns.’ We’ve got some details from our guests about how they’re splintering communities of color. They are absolutely shattering them. They’re diminishing their ability to be effective in getting representation in Congress.”\n\nOther Texas Democrats traveled to Chicago to meet with Gov. J.B. Pritzker and to meet Gov. Kathy Hochul of New York . The Texans in Boston will likely attend the National Conference of State Legislatures’ annual legislative summit, which ends Tuesday, per the Texas Tribune.\n\nWhen speaking to reporters Tuesday, Healey emphasized that “what’s happening in Texas matters to the people of Massachusetts.” \n\n“And it matters to people all over this country,” Healey continued. “If we don’t have a fair election system in this country that impacts, that hurts all Americans.”\n\nWill Healey retaliate and gerrymander Massachusetts?\n\nIn New York, Hochul has threatened to gerrymander her state to favor Democrats to fight the proposed Texas map. When asked if she would do the same, Healey said that “isn’t it a sad state of affairs that that’s where we’re at? Donald Trump, Greg Abbott, Ken Paxton, have left us no choice. That’s the reality.”\n\nBut she ended by saying the state is “going to follow the rules.”\n\n“We just did that,” she said, referring to the congressional map redrawn in 2021. “We just went through a customary and orderly process just a few years ago.” \n\nGalvin and Healey both said that the Massachusetts congressional districts, signed by Gov. Charlie Baker, are fair and geographically balanced.\n\nWhen pressed about the Republicans in the southern part of the state, Galvin said that New Bedford and Fall River are in the same congressional district “so if that was an argument once upon a time, it no longer is.”\n\nIn 2021, the map was redrawn to unify Fall River, but the two South Coast cities are actually not in the same congressional district. At the time, some advocates and elected officials decried a missed “once-in-a-decade opportunity” to create a district anchored by the two cities that could build political power for lower-income residents in a region that advocates say often feels ignored by Beacon Hill power centers.\n\nClustered around Fall River is one of the state’s Republican strongholds, according to voting data from the 2024 presidential election. New Bedford, however, voted for former Vice President Kamala Harris.\n\nBut, Galvin went on to say that while “most states are pretty evenly balanced,” the redrawning of the Texas map to add five seats to favor Trump “is not a partisan consideration.”\n\n“They don’t want this spreading to other states. Neither do we do in this state of Massachusetts, but we have to call it out now,” Galvin said. “That’s the only way to stop it.”","summary":"“This is an attempt to grab power, to change the rules, to determine a certain outcome,” Healey, flanked by Texas lawmakers, told reporters Tuesday.\n\n\nThe post Healey meets with Texas Democrats who fled their state amid battle over redistricting appeared first on Boston.com.","url":"https://www.boston.com/news/local-news/2025/08/05/healey-meets-with-texas-democrats-who-fled-their-state-amid-battle-over-redistricting/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2025/08/L7Q52HJDR6HBGYHYQD2PBGSLG4-68928e9183ae0-768x432.jpg","video":null,"publish_date":"2025-08-05 23:42:20","author":"Molly Farrar,President Donald Trump","authors":["Molly Farrar","President Donald Trump"],"language":"en","category":"politics","source_country":"US","sentiment":-0.27},{"id":348492242,"title":"Top Dem was singing Michelle Obama's praises just an hour before dismissing her on Fox News","text":"Top Democrat Stephen A. Smith praised former First Lady Michelle Obama just one hour before he slammed her on Fox News.\n\nThe ESPN star sat down with NewsNation's Chris Cuomo on Monday night when he addressed the former first lady's recent comments comparing the sports network to reality television. \n\nSmith insisted there is 'no kerfuffle' between him and Obama, as he begun singing her praises.\n\n'She's my - she'll always be my first lady. She's the greatest first lady in American history as far as I'm concerned. I absolutely revere her,' the 57-year-old First Take star said.\n\nHe then went on to question 'how legitimate of a sports fan her husband [former President Barack Obama] is' and claimed that maybe it was 'all Barack Obama's fault because he's too smooth.'\n\n'...I mean, this brother is so smooth he's just sitting back all cool and everything while he's watching his Chicago Bulls win championships when [Michael] Jordan was there and lose every time he hasn't been there,' Smith continued.\n\nBut he did not that he was 'offended as a black man when [Michelle Obama] was campaigning for Kamala Harris' and 'said that a vote for ... Trump would be a vote against us as women.\n\n'I understand where she was coming from and obviously I voted for Kamala Harris. But my point is... everybody's got their one salient issue that they point to when it comes to voting.\n\n'I never forgot that she said that, nor did I forget, nor appreciated how Obama was talking to black individuals in Pittsburgh when he said that to the young black men there,' Smith noted.\n\nHe argued that black men 'believe that women are highly, highly capable, better than us, smarter than us, you know, more composed than us in a lot of different situations.\n\n'So I'm like, \"Where are you getting that from?\"'\n\nSmith then concluded his remarks by saying he thought it was 'important to bring that up' because even though he 'didn't like that coming out of their mouths,' it was 'the only thing that I have ever disliked about Michelle Obama, because I think she's wonderful.' \n\nBut just one hour later, in an interview with Fox's Sean Hannity on Monday night, Smith suggested that the former First Lady's comments comparing ESPN to the Real Housewives of Atlanta proves she leaves sports 'to her husband.'\n\nHe then said: 'You can say Stephen A. Smith is lot of things and will be a lot of things. The one thing you can never say about me is that I'm going to be a housewife.'\n\n'She was comparing reality TV to sports TV from the standpoint of watching us go at one another,' Smith began.\n\n'Well first of all, there's no relationship because these are some of the greatest athletes on the planet earth that play professional sports - that's who we're talking about as opposed to reality TV stars that can barely act. \n\n'Number two, when you look at what she's talking about, you also have to take into consideration that she doesn't really pay much attention to sports - evidently she leaves that to her husband.\n\n'And when she talked about First Take, she talked us arguing with one another, hating on one another. We have a lot of love for one another on \"First Take\". \n\n'We get along just fine, we have a blast - laughing, joking, having a ball, yelling at each other about sports sometimes. We're monotone in our delivery but we have a lot of fun on First Take. That's why we've been number one for 13 consecutive years - and counting.\n\n'Number three, let me say this to the other people that were on the table with her. You can say Stephen A. Smith is lot of things and will be a lot of things. The one thing you can never say about me is that I'm going to be a housewife. There's no confusion there. Zero.'\n\nThe former first lady had sparked the war of words in a recent episode of her IMO podcast.\n\n'If I listen to ESPN for an hour, it’s like watching the \"Real Housewives of Atlanta,\"' the former First Lady said. 'It’s the same drama, and they’re yelling at each other, and they don’t get along, you know? I mean, Stephen A. Smith, he’s just like every other talk show host.' \n\nIt was then jokingly put to Obama that Smith would be a 'great Real Housewife'. The popular reality franchise details the lives of well-off women from different regions.\n\nAfter her comments went viral, Obama was taken to task by Smith on his YouTube show. The ESPN star urged her to invite more 'dissenting opinions' on IMO and said he was still 'salty' over Obama's comments on Trump.","summary":"Top Democrat Stephen A. Smith praised former First Lady Michelle Obama just one hour before he slammed her on Fox News.","url":"https://www.dailymail.co.uk/news/article-14973889/Stephen-Smith-praise-Michelle-Obama-housewife.html","image":"https://i.dailymail.co.uk/1s/2025/08/05/23/100953191-0-image-m-22_1754431638847.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/03/5652975194483700697/1024x576_MP4_5652975194483700697.mp4","publish_date":"2025-08-05 22:57:04","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.152},{"id":348484480,"title":"Trump basher Shawn Fain could get booted as head of UAW as auto locals blast his leadership","text":"United Auto Workers President Shawn Fain, who has been critical of President Donald Trump, could get booted as auto locals blast his leadership.\n\nSeveral auto locals have brought administrative charges under the UAW constitution.\n\nFain has been accused of abusing his authority by taking away Secretary-Treasurer Margaret Mock's purchasing power, according to documents obtained by the Detroit Free Press from union members.\n\nNeil Barofsky, the UAW court-appointed federal monitor, saw the move as retaliatory after Mock claimed she was stripped of her responsibilities after refusing to authorize expenditures and exceptions to UAW spending polices, according to a previous Detroit Free Press report. \n\nFain also retaliated against Vice President Rich Boyer, taking away his assignment overseeing the UAW’s Stellantis department, the documents allege. Boyer has claimed he was retaliated against after refusing to take actions that would benefit Fain’s fiancée and her sister, according to the Detroit Free Press. \n\nOther allegations against Fain include his refusal to provide records requested by the monitor and improperly appointing people close to him to positions.\n\nTwo UAW locals in Michigan, Local 1700 in Warren and Local 763 in Dundee, approved charges against Fain at meetings held on August 3, the Detroit Free Press reported. \n\nLocals 1248 and 140 in Warren, Local 7 in Detroit and Local 94 in Dubuque, Iowa, previously approved the charges, the local outlet reported, citing union members. \n\nThe Independent has reached out to the UAW for comment. \n\nThe charges will now go to the Mock and Barofsky for review. Later on in the process, a 12-person trial committee will be formed. This committee will hear the case against Fain and his defense, and afterward, they will vote on whether he is guilty of the charges.\n\nDuring the 2024 presidential election, the UAW endorsed then-Vice President Kamala Harris, and Fain said it was the union’s “job” in the election to defeat Trump.\n\nAhead of the president’s victory, Fain said, “Trump doesn’t care about autoworkers. The only thing Donald Trump wants from autoworkers is a vote. Donald Trump is a scab!”","summary":"Fain has previously called President Donald Trump a ‘scab’","url":"https://www.independent.co.uk/news/world/americas/uaw-head-shawn-fain-trump-fired-b2802546.html","image":"https://static.independent.co.uk/2025/08/05/21/35/GettyImages-2167558088.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/Opn9BC80-OhrQWqOm.mp4","publish_date":"2025-08-05 22:17:52","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.422},{"id":348490786,"title":"Trump Says JD Vance 'Probably Favored' to Take Over MAGA","text":"President Donald Trump was asked if Vice President JD Vance is the heir apparent to his MAGA empire in a news conference on Tuesday and responded, \"most likely,\" while noting Vance's position.Why It MattersTrump, addressing ongoing speculation about his political legacy and the possibility of attempting a third term, reiterated during a CNBC interview that he would \"probably not\" run again, saying, \"I'd like to run. I have the best poll numbers I've ever had,\" adding that legal constraints made a third-term run highly unlikely.The Constitution's 22nd Amendment does not allow anyone to be elected to the presidency more than twice, even if the terms served in the Oval Office are nonconsecutive.What To KnowWhile answering questions from reporters during a news conference about the 2028 Olympics, Trump was directly asked if Vance is the successor to MAGA.\"Well, I think most likely in all fairness, he's the vice president,\" Trump responded. \"I think Marco [Rubio] is also somebody that maybe would get together with JD in some form. I also think we have incredible people, some of the people on the stage right here, so it's too early obviously to talk about it but certainly he's doing a great job, and he would be probably favored at this point.\"A survey by Emerson College Polling released last week shows Vance as the top 2028 Republican contender for voters in North Carolina, jumping 7 percentage points from a June poll from Emerson.Florida Governor Ron DeSantis received 7 percent and Secretary of State Marco Rubio received 5 percent, the poll shows.What People Are SayingRobert Y. Shapiro, a political science professor at Columbia University, told Newsweek via email on Tuesday:\"This is very plausible. Historically in the US, we have had Vice Presidents being the obvious candidate once incumbents presidents have served their terms, or sometime later.\"Shapiro added that they \"don't necessarily win as in the case of [Richard] Nixon in 1960, [Al] Gore in 2000 (though he won the popular vote), [Kamala] Harris in 2024, and [Walter] Mondale in 1984; compared to George H. Bush who won in 1988. Go back to the founding presidential elections starting with Washington, in the cases of Adams and Jefferson as vice presidents subsequently becoming presidents, though Jefferson defeated Adams.\"\"So Vance is not a [sic] surprising, especially because he has backed Trump at every turn and has taken the opportunities to appeal to his MAGA base--and it appears successfully. Rubio teaming up with [Vance] as his VP seems logical but surely Rubio would rather go after the presidency himself, though he could wait to take his turn later, whether Vance wins or loses,\" Shapiro said.What Happens NextMajor candidates are not expected to announce formal 2028 presidential campaigns until after the 2026 midterm elections, following past electoral traditions.However, as Vance continues a high-visibility role, he is positioned as the leading Republican prospect for 2028. Other early potential contenders include Vivek Ramaswamy, DeSantis, and Senator Tim Scott.Update 8/5/25 6:16 p.m. ET: This article has been updated with additional information.","summary":"Recent polling shows Vice President JD Vance leading the pack of potential 2028 Republican presidential contenders.","url":"https://www.newsweek.com/trump-says-jd-vance-probably-favored-take-over-maga-2109383","image":"https://d.newsweek.com/en/full/2697122/jd-vance-donald-trump.jpg?w=1600&h=900&q=88&f=85b75ed522b8904d2f5f898b0ba4fb89","video":null,"publish_date":"2025-08-05 21:47:11","author":"Anna Commander","authors":["Anna Commander"],"language":"en","source_country":"us","sentiment":-0.042},{"id":348475686,"title":"Howard Stern's Radio Show 'To Be Canceled' After $100M Contract Wraps Up — After Iconic Shock Jock Was Accused Of 'Making Fake Twitter Accounts' To Snag A-List Guests","text":"The Howard Stern Show on SiriusXM is on the way to getting axed, according to sources, RadarOnline.com can reveal. \n\nThe 71-year-old's $100million contract is set to end later this year, and it does not look as if the subscription satellite radio provider is eager to bring back the shock jock.\"Stern's contract is up in the fall, and while Sirius is planning to make him an offer, they don't intend for him to take it,\" one source said of the impending end to his latest five-year contract.\n\nThey added: \"Sirius and Stern are never going to meet on the money he is going to want. It's no longer worth the investment.\"\n\nAccording to the insider, while the star's loyal listeners are expecting Sirius to make a deal for Stern's library, they shouldn't expect him to return to the platform. \n\n\"A far as him coming back to doing the show, there's no way they can keep paying his salary,\" the source explained.\"After you saw what happened with Stephen Colbert, it's like they just can't afford to keep him going,\" the insider said, referring to the late-night host who saw his show canned after CBS was unable to pay his high salary.\n\nStern, just like Colbert, has been vocal about his dislike of President Trump, something that is believed to have been part of the decision.\n\nThe source claimed: \"If Sirius isn't going to give Stern a good offer, I don't think it would have anything to do with his ratings. It's more likely everything to do with the political climate.\"\n\nStern's interview with Kamala Harris, in the run-up to the 2024 election, led to plenty of ruffled feathers, as Republicans cried over the eventual failed presidential candidate's media appearance.Stern, who kicked off his radio career in the 1980s, was no stranger to controversy. Earlier this year, he was accused of doing all he could to reel in big time Hollywood stars to his radio show, including urging his staff members to create fake Twitter accounts.\n\nIn 2013, the former America's Got Talent judge is said to have ordered his employees to pretend they were fans of his show on the platform, simply to grab the attention of big-time stars like Lady Gaga and others.\n\n\"Set up a fake Twitter account, become 10 different people, I don't give a s---,\" Stern told his staff during a meeting referred to as Revolution 2013, according to previous reports. \n\nStern is rumored to have said: \"I'm telling you, every celebrity reads their Twitter,\" and did all he could to make sure he was back to being relevant in the radio industry.\"The alleged meeting occurred after Stern was \"pissed\" his audience was \"forgetting about us,\" after years of him dominating the airwaves. He also made it clear if his show did not find success soon and spread, employees would lose their jobs, as he also made an effort to clean up his ways after becoming known for his shocking material.\n\nThe host is also said to have encouraged his employees to reach out to certain celebrities including Brad Pitt and the late Rush Limbaugh, in hopes of increasing the same type of buzz he had in his peak.\n\nMore details to follow","summary":"Howard Stern may have to start looking for a new venture as his longtime radio show is said to be ready to be canceled after 20 years on the air.","url":"https://radaronline.com/p/howard-stern-radio-show-canceled-siriusxm-contract/","image":"https://media.radaronline.com/brand-img/tWkB6cznY/0x0/stern-1754427160278.jpg","video":null,"publish_date":"2025-08-05 20:54:11","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","category":"politics","source_country":"us","sentiment":-0.166},{"id":348480788,"title":"Trump admin eyes overturning Biden's green energy legacy to tune of $7B","text":"The Trump administration's Environmental Protection Agency is weighing a plan to slash a multibillion-dollar Biden-era green energy program focused on installing solar panels on residential properties, Fox News Digital has learned. The EPA is considering sending letters to dozens of nonprofits and state groups that received federal grants under the Biden administration's \"Solar for All\" program to inform them the grants have been canceled, the New York Times reported earlier Tuesday. The Solar for All program is a $7 billion initiative launched in 2024 to deliver residential solar to \"900,000 low-income and disadvantaged households\" across the country. Fox News Digital learned that the EPA has not made a final decision on the grants as of Tuesday afternoon. \"With the passage of the One Big Beautiful Bill, EPA is working to ensure congressional intent is fully implemented in accordance with the law,\" an EPA spokesperson told Fox Digital Tuesday when asked about the report to cancel the grants. The One Big Beautiful Bill Act includes provisions related to solar, including phasing out solar tax credits. GOP LAWMAKERS MOVE TO ROLL BACK BIDEN-ERA ENERGY PROGRAMS The Biden administration announced in April 2024 that 60 nonprofits and state groups nationwide would receive $7 billion in grant awards to install residential solar, which administration leaders predicted would lead to more than $350 million in annual savings on electric bills for middle- and low-income households. It is unclear how much of the $7 billion in funds already has been spent. The program was funded through the Inflation Reduction Act, and was touted by President Joe Biden's EPA Administrator Michael Regan and John Podesta, Biden's adviser for international climate policy, as a win for low-income homes in need of cheaper electric bills. \"Solar is the cheapest form of electricity – and one of the best ways to lower energy costs for American families,\" Podesta said in a press release at the time. \"Today’s announcement of EPA’s Solar for All awards will mean that low-income communities, and not just well-off communities, will feel the cost-saving benefits of solar thanks to this investment.\" Biden placed green energy initiatives as a top priority throughout his presidency. In the waning days of his administration, for example, he became the first sitting U.S. president to visit the Amazon rainforest to tout his green legacy before departing office, and also declared during a climate summit in September 2024 that he and then-Vice President Kamala Harris pursued \"an ambitious climate policy focused on growth\" despite being \"told it couldn’t get done.\" EPA HEAD LEE ZELDIN DEFENDS REPEALING OBAMA-ERA CLIMATE CHANGE REGULATION WHEN PRESSED BY CNN HOST The Inflation Reduction Act included a handful of green energy projects, such as $350 million in grants aimed at reducing \"embodied greenhouse gas emissions of construction materials and products,\" and Democrats pledged it would reduce carbon emissions by roughly 40% by 2030. TRUMP’S ENERGY DEPARTMENT IS TAKING BACK OUR HOME APPLIANCES FROM BERSERK BUREAUCRATS The EPA previously has taken a hatchet to Biden-era federal grants related to the environment, including canceling $20 billion in grants under the Inflation Reduction Act – which has led to an ongoing court battle. EPA Administrator Lee Zeldin said in March that the $20 billion in U.S. tax dollars were \"parked at an outside financial institution in a deliberate effort to limit government oversight, doling out your money through just eight pass-through, politically connected, unqualified, and in some cases brand-new NGOs.\" The EPA's consideration to terminate the solar grants comes after the Trump administration announced the Bureau of Ocean Energy Management was canceling new offshore wind development on 3.5 million acres nationwide at the end of July, and called wind and solar energy \"a blight on our country,\" while adding \"smart countries don’t use it.\"","summary":"Trump EPA plans to terminate Biden&apos;s $7 billion Solar for All program that aimed to install residential solar panels for low-income households nationwide.","url":"https://www.foxnews.com/politics/trump-admin-eyes-overturning-bidens-green-energy-legacy-tune-7b","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/12/biden-epa.jpg","video":"https://www.foxnews.com/video/6376514585112","publish_date":"2025-08-05 20:44:32","author":"Emma Colton","authors":["Emma Colton"],"language":"en","source_country":"us","sentiment":-0.28},{"id":348475048,"title":"Biden DHS Raised Red Flags Over Tim Walz’s China Ties, New Docs Show","text":"Newly-released documents reveal that Department of Homeland Security (DHS) officials raised concerns over Democrat Minnesota Gov. Tim Walz’s ties to China after he joined the Democratic presidential ticket last year, Just the News reported. \n\nThe documents, obtained by the watchdog group Judicial Watch through a Freedom of Information Act (FOIA) request, had been previously withheld by the Biden administration, according to Just the News. Scrutiny of Walz’s longstanding ties to the Chinese government and Chinese Communist Party (CCP)-affiliated organizations escalated after he was selected as former Vice President Kamala Harris’s running mate. \n\n“China is happy,” one DHS official wrote in a group chat called “NST NFT Bi-Weekly Sync” on Aug. 7, 2024, one day after Walz officially became part of the Democratic campaign. (RELATED: Walz Told Students Communism Is When ‘Everyone Is The Same And Everyone Shares’)\n\nRepublicans have criticized Walz for his close relationship with China, including his roughly 30 visits to the communist nation, some of which were partially funded by the Chinese government.\n\nThe Daily Caller News Foundation has reported extensively on Walz’s CCP ties, including details on how the governor, while teaching in Nebraska in the 1990s, welcomed CCP officials into his classroom. Walz also appointed a member of a political faction loyal to the CCP to a state board and attended numerous events organized by members of a nonprofit linked to the Chinese government.\n\n“Wal[z]’s got the Vp. You all have no idea how this feeds into what [the People’s Republic of China] has been doing here with him and local gov,” one unidentified DHS official wrote in the group chat. “It’s seriously a line of the intel. Target someone who is perceived they can get to DC.”\n\nAnother DHS employee proposed involving the FBI for its counterintelligence (CI) expertise. \n\n“[W]ith FBI mission in the CI field i believe they need to get included,” the employee wrote. The exact roles of the employees involved in the chat remain unclear. \n\nWalz did not respond to the Daily Caller News Foundation’s request for comment. \n\nWhistleblowers reportedly alerted the House Oversight Committee to the existence of the messages last year, after the committee launched an investigation into Walz’s connections to the CCP. Oversight Committee Chairman James Comer issued a subpoena to the DHS for the records but later accused the department of stonewalling the request. \n\n“This is every bit as important as the Russiagate disclosures. The Biden gang obviously covered this all up to try to help rig the election,” Tom Fitton, Judicial Watch president, told Just the News. \n\nEven after his failed campaign with Harris, the Minnesota governor has continued to raise eyebrows with his remarks on China. \n\n“Now, who is the voice in the world that can negotiate some type of agreement in this? Who holds the moral authority? Who holds the ability to do that? Because we are not seen as a neutral actor, and we maybe never were,” Walz said in June, questioning whether the U.S. could broker peace in the Middle East due to a perceived lack of neutrality. “Now I ask who that is. I mean, consistently over and over again, we’re going to have to face the reality, it might be the Chinese.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Biden gang obviously covered this up'","url":"https://dailycaller.com/2025/08/05/biden-dhs-red-flags-tim-walz-ccp-china-ties/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/GettyImages-2176030574-scaled-e1754405392121.jpg","video":null,"publish_date":"2025-08-05 20:43:11","author":"Melissa O'rourke","authors":["Melissa O'rourke"],"language":"en","source_country":"US","sentiment":0.101},{"id":348469680,"title":"Atkins to open San Diego campaign HQ with state, federal, local leaders in her corner","text":"Toni Atkins is coming home. \n\nShe is ramping up her campaign for California governor and setting up her San Diego headquarters – with the support of key regional leaders and public servants. \n\nThe gubernatorial primary is just under a year away – June 26, 2026, to be precise – and the race is already heating up following former Vice President Kamala Harris’ announcement that she would not be throwing her name into the ring. \n\nAtkins has announced key endorsements from state senators and assemblymembers, and now she’s establishing her San Diego campaign headquarters. Atkins will be joined by federal, state and local leaders Saturday morning to open her North Park office and take the next steps with her campaign. \n\nRep. Scott Peters, who serves California’s 50th district in San Diego County, will join Atkins on Saturday. Peters already has voiced his support for Atkins. He was first elected to Congress in 2012, but before that, he served on the San Diego City Council with Atkins; while he headed to Congress, she served in the state Assembly and state Senate. \n\nAssemblymember Chris Ward also will be present at the opening. Ward serves El Cajon and San Diego in the 78th Assembly District. He is the chair of the California Legislative LGBTQ Caucus.\n\nWard isn’t the only assemblymember to back Atkins. Cecilia Aguiar-Curry and LaShae Sharp-Collins officially endorsed Atkins last week.\n\nSupport by the city and county of San Diego officials, respectively, comes from Mayor Todd Gloria and county Supervisor Paloma Aguirre. Aguirre is also the Imperial Beach mayor. \n\nAlso joining her on Saturday is Erica Pinto, the chairwoman of the Jamul Indian Village Council. Pinto has leadership extending well beyond the Jamul Indian Village board; she is also on the SANDAG transportation committee and is chairwoman of the Native American Advisory Committee. \n\nTwo labor groups also are backing the campaign. \n\nThe Western States Regional Council of Carpenters represents almost 100,000 members throughout Southern California and other western states, working with elected officials to influence the standard of living for workers in the concrete, drywall, insulation and carpentry fields and more. \n\nAlso throwing its support to Atkins is the International Brotherhood of Electrical Workers 569, or IBEW, a labor union for workers in the electrical industry throughout the U.S. and Canada. \n\n“Toni is a leader’s leader. One of the qualities we appreciate about Toni is her proven and consistent ability to collaborate with diverse teams for best outcomes on complex issues,” IBEW wrote in its 2024 endorsement of Atkins. \n\nShe has also been endorsed by LPAC, which champions women and nonbinary candidates for office. \n\n“LPAC stands proudly with Pro tem Emirtus Atkins not only because of decades-long advocacy for women and the LGBTQ+ community, but also because she is without a doubt the most qualified candidate in this race, having worked her way up through the ranks of elected office to boldly and successfully lead both California legislative chambers over the course of her storied career in public service …” the statement on LPAC’s social media read.\n\nRoughly 93% of Atkins’ campaign funds have come from in-state donors, according to her campaign. She is backed by local, state and federal politicians and has secured labor union support in a race that is still wide open for prospective candidates, who so far include well-known political names such as former Los Angeles Mayor Tony Villaraigosa, current Superintendent of Public Instruction Tony Thurmond, and Riverside County Sheriff Chad Bianco.","summary":"Approximately 93% of Atkins' campaign funds have come from in-state donors, according to numbers from her campaign.","url":"https://timesofsandiego.com/politics/2025/08/05/atkins-opens-san-diego-campaign-headquarters/","image":"https://timesofsandiego.com/wp-content/uploads/2020/11/Toni-Atkins-1.jpg","video":null,"publish_date":"2025-08-05 20:27:33","author":"Chris Stone,Gabrielle Wallace • Times of San Diego","authors":["Chris Stone","Gabrielle Wallace • Times of San Diego"],"language":"en","category":"politics","source_country":"US","sentiment":0.366},{"id":348479996,"title":"¿Quién es el líder del Partido Demócrata?","text":"¿Quién es el líder del Partido Demócrata? | Fox News Video\n\nto top close\n\nThis video is playing in picture-in-picture.\n\nOn Air Fox Noticias Clips\n\nAugust 05, 2025\n\n¿Quién es el líder del Partido Demócrata?\n\nKamala Harris regresa al centro de atención para promocionar su nuevo libro junto al próximamente cancelado Stephen Colbert, pero se queda en blanco cuando le preguntan quién lidera el Partido Demócrata.\n\nFOX NOTICIAS\n\nNOW - 6:00 PM\n\nFox News Channel\n\n5:00 PM - 6:00 PM\n\nSpecial Report with Bret Baier\n\n6:00 PM - 7:00 PM\n\nThe Ingraham Angle\n\n7:00 PM - 8:00 PM\n\nJesse Watters Primetime\n\n8:00 PM - 8:30 PM\n\nFox Business Channel\n\nThe Evening Edit with Elizabeth Macdonald\n\n5:00 PM - 6:00 PM\n\nThe Bottom Line\n\n6:00 PM - 7:00 PM\n\n7:00 PM - 8:00 PM\n\n8:00 PM - 8:30 PM\n\nFox Weather Channel\n\nFox Weather\n\nLive Stream\n\nFox News Radio\n\nFOX News Radio Live Channel Coverage\n\nLive Stream\n\nFox News Channel Live\n\nWATCH LIVE: UN Security Council convenes emergency session in NYC over Israeli hostages in Gaza\n\nLive Stream","summary":"Kamala Harris regresa al centro de atención para promocionar su nuevo libro junto al próximamente cancelado Stephen Colbert, pero se queda en blanco cuando le preguntan quién lidera el Partido Demócrata.","url":"https://www.foxnews.com/video/6376589950112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/25099655-a4cc-4e93-be9a-3b8ef5048e32/1418de1e-abc7-4659-ad10-fe7979e6cca4/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-05 20:24:46","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.134},{"id":348469162,"title":"Dave Portnoy says reading Kamala Harris' new book is a worse punishment than death","text":"Dave Portnoy says reading Kamala Harris' new book is a worse punishment than death\n\nMORE: Shock quarterback tops DailyMail+ Power List of NFL's most popular QBs\n\nBy JAMES COHEN, SPORTS REPORTER\n\nPublished: 21:16 BST, 5 August 2025 | Updated: 21:18 BST, 5 August 2025\n\nBarstool Sports boss Dave Portnoy has become the latest celebrity to mock Kamala Harris' new book, as he claimed that reading it is 'a worse punishment than death'. \n\nLast Thursday, the former Vice President announced a book deal for her memoir about the 2024 election, titled '107 Days.'\n\nHarris reflected on her failing as 'the shortest presidential campaign in modern history' and promised the book offered a 'behind-the-scenes look' at her campaign. \n\nHowever, Harris' announcement drew immediate mockery online and now Barstool boss Portnoy has joined the pile-on. \n\nIn an interview on Fox Business, it was revealed that Barstool Sports will be using Harris' book as a punishment in their fantasy football league. Portnoy's colleague Jack Mac revealed the information in a TikTok - which was played in the interview.\n\nHe said: 'If you finish last place in your fantasy football league this year, you will be locked in a room with no phone until you finish reading every single page of Kamala Harris' new book'.\n\nBarstool boss Dave Portnoy took aim at Kamala Harris and her new book during an interview \n\nHarris announced a new book - reflecting on her failed presidential campaign - on Thursday\n\n“Some people say there’s no punishment worse than death, I think this one is.” - Dave Portnoy @stoolpresidente says there’s not much worse than being forced to read Kamala Harris’ new book. pic.twitter.com/pJn95eIyMW\n— Varney & Co. (@Varneyco) August 4, 2025\n\nFox host Stuart Varney then asked Portnoy about the idea, to which he said: 'Some people say there’s no punishment worse than death, I think this one is!'\n\nPortnoy went on to admit that the cruel punishment was not his idea and instead attributed it to the 'weird brains' inside the Barstool offices.\n\nIt serves as the latest blow to Harris regarding her new book after critics taunted her for wasting billions of dollars on her campaign, including payments to prominent celebrities. \n\n'Writing a memoir about being a loser is a choice,' White House Deputy Press Secretary Abigail Jackson wrote on X.\n\nIt is unclear exactly how much money Harris paid to Beyonce for her endorsement, although according to a Federal Election Commission (FEC) filing, the campaign payed the singer's production company, Parkwood Production Media, $165,000 for 'campaign event production.' \n\n'Trying to sell some books to pay down your $5 million debt to Beyoncé for that endorsement?' Nick Sortor wrote.\n\n'I can't wait to hear the inside story about how you burned $1.5B in 107 days and accomplished absolutely nothing,' wrote Jim Hanson.\n\nPortnoy suggested that reading Harris' new book is a 'punishment worse than death' \n\nThis cover image released by Simon & Schuster shows \"107 Days\" by Kamala Harris. \n\n'Does the book include how much you paid for endorsements and cringe performances at your astroturfed rallies?' wrote Eric Daugherty on social media. \n\nHarris announced Wednesday she would not run for governor of California to replace outgoing Gov. Gavin Newsom, triggering speculation that she would run for president again. \n\n'In recent months, I have given serious thought to asking the people of California for the privilege to serve as their governor,' she wrote in a statement. \n\n'I love this state, its people, and its promise. It is my home. But after deep reflection, I've decided that I will not run for governor in this election.'\n\nHarris' long-awaited decision takes place after several California Democrats announced their campaigns, not waiting for the former vice president to rule out a possible run. \n\nTikTokKamala HarrisCalifornia\n\nShare or comment on this article:\nDave Portnoy says reading Kamala Harris' new book is a worse punishment than death\n\nAdd comment","summary":"Last week, the former Vice President announced a book deal for her memoir about the 2024 election  titled '107 Days.'","url":"https://www.dailymail.co.uk/sport/othersports/article-14973613/Dave-Portnoy-reading-Kamala-Harris-new-book-worse-punishment-death.html","image":"https://i.dailymail.co.uk/1s/2025/08/05/21/100949971-0-image-a-32_1754424872364.jpg","video":null,"publish_date":"2025-08-05 20:18:01","author":"Editor,James Cohen","authors":["Editor","James Cohen"],"language":"en","source_country":"gb","sentiment":-0.311},{"id":348492806,"title":"Young adults are less likely to follow politics: AP-NORC poll","text":"Mairekk Griffiths, a 26-year-old cook in a Denver suburb, doesn’t think he’ll ever pay a lot of attention to U.S. politics unless radical change happens.“If another party was likely to win, I’d be interested in that,” said Griffiths, who voted for Democrat Kamala Harris in last year's presidential race but, like many his age, does not see voting as that valuable.“I can’t say either way that voting matters,” Griffiths said. “It’s just picking the least bad option. That’s what I remember my whole life — both sides are bad, but this side is less bad.”Young people such as Griffiths are less engaged with U.S. politics than older Americans and less likely to say voting is important, according to a new poll from The Associated Press-NORC Center for Public Affairs Research. Young people — even those who follow politics closely — are less likely to say issues such as the economy, government spending and health care are “extremely important” to them than comparable older adults.IN CASE YOU MISSED IT | The Justice Department seeks voter and election information from at least 19 statesThe findings point to a broad sense of disillusionment among younger people about the country's political system — even if, like Griffiths, they still end up casting a ballot. Alberto Medina, who leads the Center for Information and Research on Civic Engagement at Tufts University, which studies youth and politics, noted that turnout among young people hit record levels in the 2020 election and was high last year.“There’s a sense that democracy isn’t working for young people. There’s a lack of belief that democracy is even able to improve their lives,” Medina said. “At the same time, we have been living in an era of high youth voting.”Disengagement from political parties and politicsIn another sign of their general estrangement from politics, the poll shows young adults are more likely to reject political party labels. About one-third of adults under age 30 identify as political independents who don't lean toward either major political party, compared with 17% of Americans age 60 or older.The poll also finds young people are far less likely to follow politics closely than older adults are.Only about 2 in 10 of adults under age 30 say they follow U.S. politics “extremely” or “very\" closely, compared with about one-third of Americans overall. That's even higher among adults age 60 or older — 45% of this group says they follow U.S. politics at least very closely.IN CASE YOU MISSED IT | Trump signs executive order mandating proof of citizenship for votersDisengagement is higher among teenagers, with an AP-NORC poll from May finding 44% of teens ages 13 to 17 report following U.S. politics “not very closely” or “not closely at all.”Meanwhile, about two-thirds of adults under age 30 say it’s “extremely” or “very” important to vote, compared with almost 9 in 10 over age 45 who say it’s at least “very” important to vote.Some of these habits could shift as people grow older. Younger people traditionally are less likely to vote than older people, and voter participation tends to go up with age. It's possible that engagement with politics could follow a similar pattern.Brittany Diaz, 28, follows politics closely for an unusual reason: Her oldest son, who is 7, is obsessed with the news and watches it every night. Diaz, a Republican who lives in an Albuquerque, New Mexico, suburb, acknowledges that she’s unusual among her age group because she decided to start paying attention to politics when she had her first child at 20.“Now that I have kids, I’m like, ‘I need to care,’” she said.In closely following politics, Diaz is different from many other women under 30.Women in her age group are less likely than young men to say they follow U.S. politics, the poll finds. About one-quarter of men under 30 say they follow politics “extremely” or “very” closely, compared with 16% of women in the same age group. And about 4 in 10 young women say they follow U.S. politics “not very closely” or “not closely at all” compared with about a quarter of young men.Lower investment in key issuesOn a few issues, such as the economy and health care, the divide between the youngest and oldest Americans isn’t large. About 8 in 10 Americans under age 30 say the economy is “extremely” or “very” important to them personally, compared with about 9 in 10 Americans age 60 or older.But older adults are much likelier to say topics that have taken center stage during the first six months of President Donald Trump's second term — including immigration and government spending — are “extremely” or “very” important to them personally compared with Americans under 30.That's even true for topics such as the situation in the Middle East, which has become a rallying cry for young activists since the Israel-Hamas war broke out. Only about 4 in 10 adults under 30 say this is highly important to them personally, compared with about 6 in 10 Americans age 60 or older.For some, that lack of interest could be related to a sense that the political system doesn't respond to their needs.At 18, Blake Marlar is just starting to pay attention to politics. As Trump’s tax cut and spending bill moved through the Republican-controlled Congress, the aspiring geology major at the University of Nebraska emailed his state’s two senators, both Republicans, objecting to its Medicaid cuts and increases in immigration enforcement funding.“They didn’t seem to take me seriously,” Marlar said. “While I recognize they have to represent the whole state and the whole state doesn’t agree with me, it could have been a different experience.”But he's resolved not to give up on politics: “In the future,\" he said, \"I’ll do my part and vote.”","summary":"Young people are less engaged with U.S. politics than older Americans and less likely to say voting is important, according to a poll from The Associated Press-NORC Center for Public Affairs Research.","url":"https://www.scrippsnews.com/politics/young-adults-are-less-likely-to-follow-politics-ap-norc-poll","image":"https://ewscripps.brightspotcdn.com/dims4/default/71a7b1b/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ff1%2F23%2F3fa3b25f4dbc8d47410349e56d09%2Fap25217049060797.jpg","video":null,"publish_date":"2025-08-05 20:13:07","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","source_country":"us","sentiment":0.037},{"id":348470146,"title":"Spike Lee, Adam McKay and over 2,000 writers decry Trump’s ‘un-American’ actions in open letter","text":"More than 2,300 members of the Writers Guild of America, including Spike Lee and Adam McKay, have signed an open letter decrying the actions of Donald Trump’s administration that represent “an unprecedented, authoritarian assault” on free speech.\n\nThe letter, a combined effort from the WGA East and West branches, cites the US president’s “baseless lawsuits” against news organizations that have “published stories he does not like and leveraged them into payoffs”. It specifically references Paramount’s decision to pay Trump $16m to settle a “meritless lawsuit” about a 60 Minutes interview with Kamala Harris. The letter notes that Trump “retaliated against publications reporting factually on the White House and threatened broadcasters’ licenses”, and has repeatedly called for the cancellation of programs that criticize him.\n\nAdditionally, the letter blasts Republicans in Congress who “collaborated” with the Trump administration to defund the Corporation for Public Broadcasting “in order to silence PBS and NPR”. And it says the FCC, led by Trump-appointed chair Brendan Carr, “openly conditioned its approval of the Skydance-Paramount merger on assurances that CBS would make ‘significant changes’ to the purported ideological viewpoint of its journalism and entertainment programming.\n\n“These are un-American attempts to restrict the kinds of stories and jokes that may be told, to silence criticism and dissent,” the letter reads. “We don’t have a king, we have a president. And the president doesn’t get to pick what’s on television, in movie theaters, on stage, on our bookshelves, or in the news.”\n\nSignees include Tony Gilroy, David Simon, Mike Schur, Ilana Glazer, Lilly Wachowski, Celine Song, Justin Kuritzkes, Desus Nice, Gillian Flynn, John Waters, Liz Meriwether, Kenneth Lonergan, Alfonso Cuarón, Shawn Ryan and many other prominent names in film and television.\n\nThe letter, released on Tuesday, calls on elected representatives and industry leaders to “resist this overreach”, as well as their audiences to “fight for a free and democratic future” and “raise their voice”.\n\nThe Corporation for Public Broadcasting announced last Friday that it would shut down after 57 years in operation, following the decision by the Republican-controlled House last month to eliminate $1.1bn in CPB funding over two years, part of a $9bn reduction to public media and foreign aid programs.\n\nThe corporation, established by Congress in 1967 to ensure educational and cultural programming remained accessible to all Americans, distributed more than $500m annually to PBS, NPR and 1,500 local stations nationwide. Despite the federal grants, stations mostly relied on viewer donations, corporate sponsorships and local government funds to stay afloat.\n\nThe Trump administration has also filed a lawsuit against three CPB board members who refused to leave their positions after Trump attempted to remove them.\n\n“This is certainly not the first time that free speech has come under assault in this country, but free speech remains our right because generation after generation of Americans have dedicated themselves to its protection,” the letter concludes. “Now and always, when writers come under attack, our collective power as a union allows us to fight back. This period in American life will not last forever, and when it’s over the world will remember who had the courage to speak out.”","summary":"Screenwriters from Writers Guild of America, also including David Simon and Celine Song, call out president’s ‘authoritarian assault’ on free speech\n\nMore than 2,300 members of the Writers Guild of America, including Spike Lee and Adam McKay, have signed an open letter decrying the actions of Donald Trump’s administration that represent “an unprecedented, authoritarian assault” on free speech.\n\nThe letter, a combined effort from the WGA East and West branches, cites the US president’s “baseless lawsuits” against news organizations that have “published stories he does not like and leveraged them into payoffs”. It specifically references Paramount’s decision to pay Trump $16m to settle a “meritless lawsuit” about a 60 Minutes interview with Kamala Harris. The letter notes that Trump “retaliated against publications reporting factually on the White House and threatened broadcasters’ licenses”, and has repeatedly called for the cancellation of programs that criticize him.\n\n Continue reading...","url":"https://www.theguardian.com/film/2025/aug/05/spike-lee-adam-mckay-wga-trump-letter","image":"https://i.guim.co.uk/img/media/ce1ac167246e9577bb38642d54981214fe3781d0/442_307_2427_1940/master/2427.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base6","video":null,"publish_date":"2025-08-05 20:03:30","author":"Adrian Horton","authors":["Adrian Horton"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.003},{"id":348467486,"title":"Kamala Harris won't cure what ails the Democratic Party","text":"William Henry Harrison, the ninth president of the United States, was the last commander in chief born a British subject and the first member of the Whig Party to win the White House. He delivered the longest inaugural address in history, nearly two hours, and had the shortest presidency, being the first sitting president to die in office, just 31 days into his term. Oh, there is one more bit of trivia about the man who gave us the slogan “Tippecanoe and Tyler Too.” Harrison was the last politician to lose his first presidential election and then win the next one (Thomas Jefferson and Andrew Jackson managed that before him). Richard Nixon lost only to win way down the road. (Grover Cleveland and Trump are the only two to win, lose and then win again.) Everyone else since Harrison's era who lost on the first try and ran again in the next election lost again. Democrat Adlai Stevenson and Republican Thomas Dewey ran twice and lost twice. Henry Clay and William Jennings Bryan each ran three times in a row and lost (Clay ran on three different party tickets). Voters, it seems, don’t like losers. These are not encouraging results for Kamala Harris, who announced last week she will not be running for governor in California, sparking speculation that she wants another go at the White House. But history isn’t what she should worry about. It’s the here and now. The Democratic Party is wildly unpopular. It’s net favorability ( 30 points) is nearly triple the GOP’s (11 points). The Democratic Party is more unpopular than any time in the last 35 years. When Donald Trump’s unpopularity with Democrats should be having the opposite effect, 63% of Americans have an unfavorable view of the party. Why? Because Democrats are mad at their own party — both for losing to Trump and for failing to provide much of an obstacle to him now that he’s in office. As my Dispatch colleague Nick Cattogio puts it, “Even Democrats have learned to hate Democrats.” It’s not all Harris’ fault. Indeed, the lion’s share of the blame goes to Joe Biden and the coterie of enablers who encouraged him to run again. Harris’ dilemma is that she symbolizes Democratic discontent with the party. That discontent isn’t monolithic. For progressives, the objection is that Democrats aren’t fighting hard enough. For the more centrist wing of the party, the problem is the Democrats are fighting for the wrong things, having lurched too far left on culture war and identity politics. Uniting both factions is visceral desire to win. That’s awkward for a politician best known for losing. Almost the only reason Harris was positioned to be the nominee in 2024 was that she was a diversity pick. Biden was explicit that he would pick a woman and, later, an African American running mate. And the same dynamic made it impossible to sideline her when Biden withdrew. Of course, most Democrats don’t see her race and gender as a problem, and in the abstract they shouldn’t. Indeed, every VP pick is a diversity pick, including the white guys. Running mates are chosen to appeal to some part of a coalition. So Harris’ problem isn’t her race or sex; it’s her inability to appeal to voters in a way that expands the Democratic coalition. For Democrats to win, they need someone who can flip Trump voters. She didn’t lose because of low Democratic turnout, she lost because she’s uncompelling to a changing electorate. Her gauzy, often gaseous, rhetoric made her sound like a dean of students at a small liberal arts college. With the exception of reproductive rights, her convictions sounded like they were crafted by focus groups, at a time when voters craved authenticity. Worse, Harris acquiesced to Biden’s insistence she not distance herself from him. Such clubby deference to the establishment combined with boilerplate pandering to progressive constituencies — learned from years of San Francisco and California politics — makes her the perfect solution to a problem that doesn't exist. Her choice to appear on Stephen Colbert’s “The Late Show” for her first interview since leaving office was telling. CBS recently announced it was terminating both Colbert and the show, insisting it was purely a business decision. But the reason for the broadcast network’s decision stemmed in part from the fact that Colbert narrow-casts his expensive show to a very small, very anti-Trump slice of the electorate. “I don’t want to go back into the system. I think it’s broken,” Harris lamented to Colbert, decrying the “naïve” and “feckless” lack of “leadership” and the “capitulation” of those who “consider themselves to be guardians of our system and our democracy.” That’s all catnip to Colbert’s ideologically committed audience. But that’s not the audience Democrats need to win. And that’s why, if Democrats nominate her again, she’ll probably go down in history as an answer to a trivia question. And it won’t be “Who was the 48th president of the United States?” @JonahDispatch","summary":"History and the favorability ratings have a message for Kamala Harris: She won't be the next president.","url":"https://www.latimes.com/opinion/story/2025-08-05/kamala-harris-california-governor-presidency","image":"https://ca-times.brightspotcdn.com/dims4/default/6806562/2147483647/strip/false/crop/840x560+0+0/resize/840x560!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F94%2F29%2F49590eb745c89f50d392e1144653%2Fkamala-harris.jpg","video":null,"publish_date":"2025-08-05 20:02:00","author":"Jonah Goldberg","authors":["Jonah Goldberg"],"language":"en","category":"politics","source_country":"US","sentiment":-0.344},{"id":348475022,"title":"‘The View’ Co-Host Slams Kamala’s Interview With Stephen Colbert","text":"Co-host of “The View” Alyssa Farah Griffin took aim Saturday at former Vice President Kamala Harris’ interview with cancelled “The Late Show” host Stephen Colbert on CNN. She called the move “a microcosm of everything that’s wrong with Democrats” and compared it to staging a comeback on a “sinking deck” before other CNN pundits jumped in. The Daily Caller’s Natalie Sandoval breaks down the exchange for media Madness. SUBSCRIBE to the Media Madness YouTube channel and please support our work by becoming a Daily Caller Patriot subscriber today.","summary":"Alyssa Farah Griffin slammed Kamala Harris' recent interview with Stephen Colbert","url":"https://dailycaller.com/2025/08/05/cnn-alyssa-farah-griffin-kamala-harris-interview/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/Artboard-1-copy-7.jpg","video":null,"publish_date":"2025-08-05 19:51:07","author":"Media Madness","authors":["Media Madness"],"language":"en","source_country":"US","sentiment":0.028},{"id":348448378,"title":"New Jersey's Former Republican Governor Blasts 'Extreme' GOP Candidate","text":"Former two-term New Jersey Republican Governor Christine Todd Whitman has endorsed Democratic Representative Mikie Sherrill in the state's upcoming gubernatorial election, calling her Republican opponent Jack Ciattarelli too \"extreme\" for the position.Newsweek reached out to Whitman and the Sherrill and Ciattarelli campaigns via email for comment.Why It MattersThe New Jersey gubernatorial race could be a bellwether for how Democrats navigate Donald Trump's presidency and galvanize local voters ahead of pivotal elections that lead into the 2026 midterms. Trump lost to former Vice President Kamala Harris in New Jersey by about 6 percentage points in the 2024 election.Numerous polls in recent months have all favored Sherrill, who has represented New Jersey's 11th congressional district since 2019, by margins ranging from 5 to 20 percentage points. Ciattarelli, the former New Jersey state representative who is running for governor for the third time, has waffled on embracing Trump, with pundits saying he has moved much closer towards the president since his first gubernatorial foray in 2017.What To KnowWhitman, who served as President George W. Bush's administrator of the Environmental Protection Agency (EPA), said she endorsed Sherrill due to her appeal towards moderates, while Ciattarelli is too aligned with Trump.\"Jack Ciattarelli has changed so much from the person that I knew before,\" Whitman told CBS News New York. \"He would never be this all-in on Trump, and he has said there's nothing with which he would disagree with what the president has done.\"We're not a state of people who hate each other. We're built on diversity that I had as a motto when I was governor, 'Many faces, one family.' We should celebrate that and clearly the president does not.\"Whitman, co-founder and co-chair of the States United Democracy Center, also touted Sherrill's ability to get legislation passed by working with lawmakers across the aisle when necessary, adding that it's \"what we need\" in Washington and elsewhere.\"You gotta be tough in New Jersey, and she's tough,\" Whitman said. \"She's not an extreme and that's what I like about her. She has never taken those extreme stands.\"Trump and the Affordability QuestionsMatthew Hale, associate professor of political science at Seton Hall University, told Newsweek that most likely, New Jersey voters are \"at the beach\" and not currently entranced by this gubernatorial race. But he expects enthusiasm to increase, culminating in \"a really close race\" in what he describes as a politically centrist state.\"Mikie Sherrill tends to poll very well,\" Hale said. \"She's got a really sort of resume that people like. But I do think this is going to be a really close race coming down the stretch.\"He said the two biggest factors that likely loom over the contest are Trump and issues relating to economics/affordability.\"I think this is a referendum on Donald Trump and he's not very popular in New Jersey,\" Hale said. \"I think that's going to be a big factor. But the other factor is certainly things like affordability, particularly in terms of property taxes and housing. We've seen that nationally, but I think that's always a big issue in New Jersey, and it will certainly be one in this election.\"We're seeing rising energy costs and those quality of life issues, those affordability issues and those specifically New Jersey issues. I think those are going to be important. On one hand, nationalizing the race is good for Mikie Sherrill and localizing their race is good for Jack Ciattarelli. So, that's gonna be the tension.\"A poll of 1,108 probable New Jersey voters conducted in July by StimSight Research shows Sherrill leading Ciattarelli by 6 percentage points, 48-42 percent, in terms of respondents who would \"definitely\" or \"probably\" vote for either candidate.Another poll conducted by Kellyanne Conway for the pro-Ciattarelli Change NJ super PAC and published by the New Jersey Globe showed Sherrill ahead of Ciattarelli by 5 percentage points—47 percent to 42 percent, with 11 percent of voters undecided.A separate Rutgers-Eagleton poll released in early July found Sherrill leading Ciattarelli by 20 points—51 percent to 31 percent, with 13 percent undecided.What People Are SayingAshley Koning, an assistant research professor and director of the Eagleton Center for Public Interest Polling at Rutgers University-New Brunswick, previously told Newsweek: \"'Affordability' is definitely the buzzword of this election within New Jersey and I'd like to think that New Jersey has a unique brand of of politics that still has many issues at the state level that are unique to the Garden State. I think affordability is an umbrella term [for] many of these issues that New Jerseyans have perennially been concerned about, first and foremost, taxes and property taxes.\"We have the highest property taxes in the country, and New Jerseyans have been telling us in our 50-plus years of polling that that's typically their No. 1 problem. In our most recent poll, taxes were followed by cost of living and affordability.\"Representative Mikie Sherrill on X on August 1: \"@Jack4NJ just doesn't get it — he's 100% supporting Trump's tariffs as they raise prices for NJ families and destroy thousands of jobs in the Garden State. And then he has the nerve to say that New Jerseyans don't understand the implications?\"Former Representative Jack Ciattarelli on X on August 3: \"No more sanctuary cities. No more politics tying your hands. I'll have your back—protecting your pensions, restoring COLA, fixing broken systems, and making sure you can do your job without fear or interference.\"What Happens NextThe New Jersey gubernatorial election will be held on November 4. Both campaigns are expected to intensify voter outreach and messaging on key economic issues as Election Day approaches. A significant undecided voter bloc and the influence of national politics will continue to drive developments in the final months of the campaign.","summary":"Candidate Mikie Sherrill's \"got a really sort of resume that people like,\" a Seton Hall political scientist told Newsweek.","url":"https://www.newsweek.com/mikie-sherrill-jack-ciattarelli-whitman-new-jersey-governor-2109265","image":"https://d.newsweek.com/en/full/2697032/christine-todd-whitman-nyc.jpg?w=1600&h=900&q=88&f=5f3f01c3e07acd4ac7403deff307503b","video":null,"publish_date":"2025-08-05 19:05:25","author":"Nick Mordowanec","authors":["Nick Mordowanec"],"language":"en","category":"politics","source_country":"us","sentiment":-0.009},{"id":348448364,"title":"Democrats' Chances of Flipping Joni Ernst's GOP Senate Seat in Iowa—Polls","text":"Democrat Jackie Norris jumped into the Iowa Senate race to challenge GOP Senator Joni Ernst on Tuesday in a race Democrats are hoping they can make competitive next November.Bryan Kraber, Ernst's campaign manager, told Newsweek Iowans will \"reject this Obama-era bureaucrat\" in a statement responding to Norris' candidacy.Newsweek also reached out to Norris' campaign for comment via email.Why It MattersDemocrats are facing a challenging Senate map ahead of the midterms, despite hopes that President Donald Trump's diminishing approval rating could fuel a 2018-style \"blue wave\" across the country.The party has to turn to states like Iowa, a former battleground that has shifted rightward over the past decade, as potential flip opportunities if they have any hope of taking back control of the upper chamber.Iowa has not elected a Democratic senator since 2008 and backed Trump in each of his three presidential bids—including by 13 points last November, an indication of how Republican the state has become. Nonetheless, Democrats remain hopeful that a strong national environment, as well as backlash over Ernst's recent Medicaid comments, can make the race more competitive than expected.What To KnowNorris emphasized her experience as a teacher and school board member in a video announcing her candidacy released on Tuesday.\"As a teacher and a school board member, you see the invisible burdens families are carrying,\" she said. \"Take the Medicaid cuts. Who is it impacting? Middle class families right now, they can't afford to put food on the table. We have to find a way to make things more affordable for families.\"Early polls of the race suggest Ernst will have an advantage in Iowa.A Public Policy Polling survey found that Ernst would lead a generic Democrat by about two percentage points—45 percent to 43 percent, with 12 percent still unsure. However, the poll did not ask voters about specific Democratic candidates.The survey of 568 Iowa voters was taken from June 2 to June 3.A Data for Progress poll from May found that Ernst would have a lead over most Democratic candidates on an informed ballot. When asked about Norris, voters preferred Ernst by about six points (50 percent to 44 percent).Democrat Nathan Sage fared better, leading Ernst by about two points (47 percent to 45 percent). Ernst also led State Representative J.D. Scholten by six points (49 percent to 43 percent) and State Senator Zach Wahls by 10 points (52 percent to 42 percent).The poll surveyed 779 likely voters from May 7 to May 12.Republicans are favored to hold the Iowa Senate seat, according to Kalshi betting odds, which give the GOP a 74 percent chance and Democrats a 26 percent chance of winning next November.Outside of Iowa, Democrats view the Maine seat held by Senator Susan Collins and the open North Carolina seat as their best opportunities to pickup a win in a GOP-held seat next November. Maine backed former Vice President Kamala Harris by about seven points, while North Carolina backed Trump by about three points last November.Republicans currently have a 53-47 majority, so Democrats need to win multiple double-digit Trump states like Iowa, Ohio or Texas to win back control of the Senate. Democrats are also defending seats in Georgia and Michigan, both of which backed Trump last year.What People Are SayingBryan Kraber told Newsweek: \"Our state is ruby red because Iowans reject higher taxes, open borders, and woke ideology, just like they will reject this Obama-era bureaucrat\"Democratic hopeful Jackie Norris wrote in a press release: \"Red versus blue isn't fixing anything. Iowa needs a Senator who doesn't just talk tough but rolls up their sleeves, and has the grit and experience to actually get something done.\"Sabato Crystal Ball forecasters J. Miles Coleman and Kyle Kondik wrote in a June update: \"In 2014, [Ernst] won as part of a broader GOP wave—and she got help from a gaffe-prone opponent. Six years later, she won reelection as Trump was carrying Iowa by a strong margin (Ernst ran a little bit behind Trump). It's possible that 2026 could be like 2018: Iowa did not have a Senate election that year, but Democrats did end up winning three of the state's four U.S. House seats that year, and we suspect that if Iowa had had a Senate election, it likely at least would have been close.\"What Happens NextErnst has not confirmed her plans for the 2026 election. Both the Cook Political Report and Sabato's Crystal Ball consider the race to be Likely Republican.","summary":"Democrat Jackie Norris has jumped into the Iowa Senate race to challenge GOP Senator Joni Ernst.","url":"https://www.newsweek.com/jackie-norris-iowa-senate-chances-winning-2109268","image":"https://d.newsweek.com/en/full/2696939/joni-ernst-iowa-senate-update.jpg?w=1600&h=900&q=88&f=7707ea71e65306bca18015f07cad0e52","video":null,"publish_date":"2025-08-05 18:53:49","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":348437446,"title":"Woman once alleged Trump & Epstein s*xually assaulted her when she was 13, Perez Hilton reacts in shock","text":"Podcaster and blogger Perez Hilton, a critic of U.S. President Donald Trump, has drawn connections between the POTUS and Jeffrey Epstein, a convicted s*x offender. In one of his recent blog posts, Hilton referenced a woman who alleged that Trump and Epstein s*xually abused her when she was 13 years old.On August 4, 2025, Hilton shared this blog on X, in which he discussed in detail the allegations by Katie Johnson (pseudonym) against the president. The blogger also added his reaction to the same. He wrote on X:OMG! I just... wow.Perez Hilton alleged in his blog that the president did some \"horrible things\" along with Epstein and insinuated that this was the reason behind his reluctance to release records related to the late s*x offender.Hilton further noted that when Trump was selected as the presidential candidate in 2016, multiple women came forward with allegations of s*xual assault against him, and Katie Johnson was one of them. He gave an account of Johnson's \"r*pe\" accusations against the president and about the lawsuit she filed against him.What did Perez Hilton write about Katie Johnson's s*xual assault allegations against Trump and Epstein? View this post on Instagram Instagram PostPerez Hilton shed light on \"Katie's story\" in his blog, detailing how she met Jeffrey Epstein at parties while pursuing her dream of becoming a model. He alleged that Donald Trump attended \"four\" parties of Epstein, wherein underage girls were present.As per the podcaster's blog, Johnson met the president at one such party when she was 13 years old. He further wrote about the alleged s*xual abuse that took place later.\"On four different occasions, she claims, Donald Trump 'initiated s*xual contact' with her. We will remind you once again that Katie was just 13 years old at the time,\" Hilton wrote.Hilton examined the president's purported \"encounters\" with Johnson, detailing four instances in which the president allegedly abused her. Citing Johnson, Hilton remarked that during the fourth interaction, a \"r*pe\" took place.\"In the fourth encounter with Trump, she claims, he r*ped her... Obviously even if Katie had 'consented' to this as part of her modeling ambitions or whatever, it would still be rape. Remember, a 13-year-old cannot give consent to sex. In 1994, the age of consent in New York was 17,\" he wrote.Hilton reported that Epstein also allegedly \"r*ped\" her later, when she was giving him a \"massage.\" Johnson was \"threatened\" to not reveal anything about the alleged abuse, as per the blog post.The blogger further noted that the accuser came out in public many years later when Trump became a presidential candidate. He also discussed the lawsuit Johnson filed against the POTUS and Epstein. Hilton then inserted an excerpt, which he claimed to be from the original \"filing.\"“The Plaintiff, Katie Johnson, alleges she was subject to extreme s*xual and physical abuse by the Defendants, Donald J. Trump and Jeffrey E. Epstein, including forcible r*pe during a four month time span covering the months of June-September 1994 when Plaintiff Johnson was still only a minor of age 13,” the excerpt read.The pop culture commentator noted that she was about to reveal her true identity. However, she dropped the lawsuit before the 2016 presidential election, citing her \"safety.\"Also read: What is the age of consent in France? Candace Owens claims Emmanuel Macron’s administration worked towards lowering age of consent in the countryThis was not the first time Perez Hilton reported on the Epstein-linked allegations against the president. He had made some controversial comments against the POTUS in several other blogs and Instagram posts.Also read: Megyn Kelly mocks Kamala Harris’ recent Stephen Colbert interview, compares her to Elle Woods from ‘Legally Blonde’","summary":"Podcaster and blogger Perez Hilton, a critic of U.S. President Donald Trump, has drawn connections between the POTUS and Jeffrey Epstein, a convicted s*x offender.","url":"https://www.sportskeeda.com/us/podcasts/news-woman-alleged-trump-epstein-s-xually-assaulted-13-perez-hilton-reacts-shock","image":"https://staticg.sportskeeda.com/editor/2025/08/c5c56-17543937699088-1920.jpg","video":null,"publish_date":"2025-08-05 18:45:22","author":"Anuj Singh Kushwaha","authors":["Anuj Singh Kushwaha"],"language":"en","source_country":"in","sentiment":-0.348},{"id":348448212,"title":"Duggan’s political makeover raises questions about who he really is in gubernatorial bid","text":"Who is Detroit Mayor Mike Duggan really? \n\n For nearly four decades in public office, Duggan has aligned himself with the Democratic Party. As a three-term mayor, he campaigned for presidential candidates Barack Obama, Hillary Clinton, Joe Biden, and Kamala Harris. At the Democratic National Convention in July 2016, Duggan slammed then-presidential candidate Donald Trump. \n\n “Detroit is 18 months out of bankruptcy, something Donald Trump knows a little bit about. But unlike Donald Trump, Detroit is only going to do bankruptcy once,” Duggan said at the convention. Several months later, Duggan called Trump “the most phony party nominee that I have seen in my lifetime.” \n\n When Biden defeated Trump in Michigan by 145,000 votes in November 2020, Duggan called the claims of fraud by Trump and his supporters “utter nonsense” and said they’re “a real threat to everything we believe in … that everybody’s vote counts the same.” \n\n But now that Duggan is running as an independent for governor, he has dramatically changed his rhetoric, turning his ire on Democrats and taking big donations from GOP party leaders, megadonors of Trump, and conservative power brokers with vested interests in state policy.\n\n When Metro Times asked Duggan’s campaign on Monday about his seemingly fluid position on Trump and the president’s attacks on people of color and the LGBTQ+ movement, a spokesperson referred us to the mayor’s recent comments to none other than conservative Detroit News columnist Nolan Finley. The campaign also deflected questions about Trump’s “Big Beautiful Bill” that cost Michigan more than $1 billion, forcing steep cuts to safety net programs like Medicaid and food assistance that support millions of lower-income residents.\n\n “I haven't changed any positions, other than that I think the toxic relationship between the two parties is badly damaging the state and we need a different approach to get Republicans and Democrats to work together,” Duggan told Finley. “But I haven't changed my position on any issue.” \n\n But a review of recent interviews and social media posts show Duggan disproportionately attacking Democrats, raising questions about the sincerity of his past statements and the truth of his current ones. \n\n “The Democratic support is crumbling for them, and I know they’re a little upset, but people are fed up with this Democratic Party in Michigan,” Duggan said on CBS News recently, before repeating a criticism he wrote on social media. “They care about two things: They hate the Republicans in general, and they hate Trump in particular, and they don’t stand for anything else. And a lot of people are deciding they have had enough of it.” \n\n When the CBS reporter, Major Garrett, asked how his agenda would differ from Republicans, Duggan deflected: “The Republicans and Democrats both share the blame.” \n\n In the Duggan campaign’s latest post on X, the mayor wrote, “So this week, Democratic Party insiders are attacking us for taking donations from Republicans.” \n\n “They’re mad the independent campaign is getting support from both parties,” he added. “We shouldn’t be surprised. It’s the same old partisan playbook. Demonize anyone who tries to bring Democrats and Republicans together.”\n\n Whether Duggan’s shifting rhetoric signals a lurch to the right or is just campaign theatrics is anyone’s guess. He’s running as an independent at a time when the Democratic Party’s favorability nationwide has fallen to a record low. \n\n Duggan is clearly reaching out to the red swath of Michigan that is outside metro Detroit. A survey released in May by the Detroit Regional Chamber showed that Duggan’s support drops sharply outside the region, where his name recognition and favorability ratings lag behind his rivals.\n\n Regardless of his current rhetoric, Duggan can’t change what he’s said and done in the past. In July, less than six months before he began attacking Democrats, Duggan endorsed Harris and was in “deep campaign mode” for her. At the time, he slammed Trump. \n\n “I spent four years with Donald Trump as president,” Duggan said. “There was no good relationship then. Basically we tried to keep our head down during that time. I think our starting point is, we need to elect a president who cares about this city and cares about this state. I remember he did the visit to the church in the campaign in 2016 and says, ‘I will help Detroit’s rebuilding.’ He got elected and never visited once in the next four years.” \n\n In October 2024, when Duggan was campaigning for Harris, he criticized Trump for saying Detroit is more “developing” than “most places in China.” \n\n Calling Trump’s memory “a little fuzzy,” Duggan said, “Since Donald Trump left office, the unemployment rate in Detroit is way down, the homicide rate is way down, and our population is growing for the first time since the 1950s.” \n\n He added, “The best thing that happened in Detroit was when Donald Trump left office and Joe Biden and Kamala Harris came in and gave us real partners.” \n\n Speaking at a press conference organized by then-Democratic presidential nominee Hillary Clinton’s campaign in September 2016, Duggan once again scolded Trump. \n\n “Are you here just to use Detroiters as props in a re-imaging campaign, or are you here to have a real conversation where you’re finally going to give us the specifics on what you're going to do to make American cities better?” Duggan asked. \n\n Duggan hosted several Democratic presidential candidates since he was mayor, calling Biden “the best friend Detroit ever had in the White House” and saying Harris was “a good friend.” \n\n That doesn’t sound like someone tired of Democrats or what he alleges is their lack of principles beyond hating Republicans and Trump. \n\n As mayor, Duggan has changed his tone for political purposes in the past. When Police Chief James Craig announced he was retiring in May 2021, Duggan said at a news conference, “I tried to convince him to change his mind up until last night.” \n\n A year earlier, Duggan called Craig “maybe the best police chief in America.” \n\n But when Craig announced he was running for governor as a Republican in September 2021, Duggan changed his tune. During the State of the City address in March 2022, Duggan tore into Craig, saying crime rose mercilessly during his last five months as chief. Crime didn’t begin to fall until Duggan hired Craig’s replacement, Chief James White, the mayor said at the time. \n\n “The first five months of last year before we hired Chief White, it wasn’t good,” Duggan said, adding that Craig’s failure to develop and retain partnerships with law enforcement diminished the police department’s ability to fight violent crime. \n\n “Chief White doesn’t attack the prosecutor or the judges or the Feds, and everybody works together,” Duggan said. \n\n As Duggan runs as an independent, both Republicans and Democrats are calling bullshit. Republicans believe he’s still secretly a Democrat, while Democrats claim he’s selling out to Trump and his supporters. \n\n “The more Michiganders see through Mike Duggan’s fake shtick and hear how he’s being bankrolled by the same people who funded Donald Trump, the more they come to see that he cannot be trusted,” Michigan Democratic Party spokesperson Derrick Honeyman said in a statement Tuesday. “Duggan can lash out all he wants — but Michiganders will continue to see his self-serving and shady motives.”\n\n Scott Urbanowski, a Democrat from Kent County, said Duggan’s big donations from Republican powerbrokers and Trump megadonors sends a message that he has abandoned his base. \n\n “Whatever their motivation for backing him, these conservatives are inadvertently making it clear: Mike Duggan doesn’t give a flying flamingo about working-class Michiganders like me,” Urbanowski wrote on Facebook. \n\n In his column Saturday, Finley wrote, “I’ve lost count of the number of calls I’ve received from Republicans expressing their skepticism about Detroit Mayor Mike Duggan’s abandonment of the Democratic Party in making his 2026 run for Michigan governor.” \n\n He added, “Many are convinced Duggan is cloaking himself in independence for political expediency, rather than making a sincere break with the Democratic Party he served his entire career.” \n\n Anna Hoffman, a writer for the conservative site Michigan Enjoyer, contends Duggan is deceiving Republicans.\n\n “Detroit Democrat Mike Duggan sat down for an interview this weekend, said he’s still a Democrat, clarified none of his positions changed but he’s putting an ‘I’ after his name in the hopes some Republicans are dumb enough to vote for him,” Hoffman wrote on X. \n\n Duggan has adopted Republican talking points, including calling undocumented immigrants “illegal” in January while speaking to business leaders. When called out by pro-immigration groups, Duggan dismissed the criticism as “political correctness,” another term that conservatives have adopted. \n\n So who is Duggan as he runs for governor? So far, it’s anyone’s guess.","summary":"Who is Detroit Mayor Mike Duggan really? For nearly four decades in public office, Duggan has aligned himself with the Democratic Party. As a three-term mayor, he campaigned for presidential candidates Barack Obama, Hillary Clinton, Joe Biden, and Kamala Harris.","url":"https://www.metrotimes.com/news/duggans-political-makeover-raises-questions-about-who-he-really-is-in-gubernatorial-bid-40140304","image":"https://media2.metrotimes.com/metrotimes/imager/u/original/40140307/54641790326_722e5c2d40_c.webp","video":null,"publish_date":"2025-08-05 18:35:00","author":"Steve Neavling","authors":["Steve Neavling"],"language":"en","category":"politics","source_country":"US","sentiment":-0.314},{"id":348477364,"title":"South Park takes aim at Trump administration again as series moves to Paramount+","text":"South Park will continue to take aim at the Trump administration as ICE descend on the fictional Colorado town in an upcoming episode.\n\nA teaser for the next episode, due August 6, shows Trump seated next to Satan at a formal dinner when he reaches under the table and touches the character’s thigh. Satan then bats his hand away, telling the president to “stop!” while a presenter in the background is heard praising Trump, stating: “We want to honor the president’s courage….”\n\nThe clip also shows Immigration and Customs Enforcement (ICE) officers descending on South Park, with longtime guidance counsellor Mr. Mackey having apparently signed up to join them.\n\nThe second episode of the long-running animated show’s latest season comes as the series is heading to Paramount+ after the show’s creators struck a $1.5 billion streaming deal. South Park will leave its current home, HBO Max, and migrate to Paramount+ as of August 5. New episodes will continue to air on Comedy Central before being made available to stream.\n\nDespite the streaming move, co-creators Trey Parker and Matt Stone made it clear that they won’t be pulling any punches with the show’s explosive return to screens last month, its first episode in two years.\n\nThe episode launched a scathing critique of the president, referencing the recent cancellation of The Late Show with Stephen Colbert, Trump’s lawsuit against Paramount, and the prospect of government censorship.\n\nSeveral moments saw Trump in bed with Satan, who confronts the president over rumors that his name appears on the “Epstein list” in reference to documents from the investigation into deceased convicted pedophile Jeffrey Epstein.\n\nThe episode also took aim at Trump’s recent lawsuits, including his legal battle with Paramount over the editing of an interview with Kamala Harris, which saw the president receive $16 million in a controversial settlement.\n\nWhen the people of South Park turn on Trump after Jesus is introduced as a teacher in the local school, the president sues the town’s people for $5 billion. They eventually negotiate the settlement to $3.5 billion, but as part of the deal, the town must agree to produce “pro-Trump messaging” in their public service announcements.\n\nMeanwhile, Parker and Stone issued a sarcastic apology to Trump who was reportedly left “seething” over the first episode of the season.\n\n“We’re terribly sorry,” Parker said in a deadpan tone, during an appearance at the Comic-Con Comedy Central Animation panel on July 23.\n\nThe White House issued a strongly worded statement in response to the episode, with spokesperson Taylor Rogers criticizing the “hypocrisy of the Left.”\n\n“Just like the creators of South Park, the Left has no authentic or original content, which is why their popularity continues to hit record lows,” Rogers said.\n\nThe episode in fact drew a record audience.","summary":"Mr Mackey joins up with ICE in a forthcoming episode","url":"https://www.independent.co.uk/arts-entertainment/tv/news/south-park-trump-ice-episode-b2802441.html","image":"https://static.independent.co.uk/2025/07/25/7/02/trump-satan.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/nGVNNDsW-OhrQWqOm.mp4","publish_date":"2025-08-05 18:21:04","author":"Kevin E G Perry","authors":["Kevin E G Perry"],"language":"en","category":"politics","source_country":"gb","sentiment":0.116},{"id":348446198,"title":"Opinion: With Harris out, who leads California governor’s race?","text":"This column was originally published by CalMatters. Sign up for their newsletters.\n\nKamala Harris’ penchant for strings of abstruse verbiage — popularly known as word salads — was one of several reasons her presidential campaign failed last year.\n\nHer tendency was on display again last week when she announced she would not run for California governor after making other candidates, political media and voters wait for months for her decision. Harris bowed out of the 2026 race in a written statement, saying, “I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.\n\n“As we look ahead, we must be willing to pursue change through new methods and fresh thinking — committed to our same values and principles, but not bound by the same playbook,” she added.\n\nA day later, Harris continued her parade of vague statements during a softball interview with late night talk show host Steven Colbert, declaring that the American system of government was broken. Pressed mildly to explain, Harris responded, “Well, but it’s also evident, isn’t it? But it doesn’t mean we give up.”\n\nWhatever persuaded Harris not to seek the governorship, her announcement finally allows those who want the job to shift into a higher gear. Had she run, several of the hopefuls would probably have dropped out.\n\nWith her out of the picture, the field remains crowded without a clear frontrunner.\n\n“None of these candidates start out with statewide name recognition,” Garry South, a veteran Democratic strategist, told the Los Angeles Times.\n\nThat said, there does appear to be two fairly distinct levels of candidacy: Democrats with genuine shots at winning versus those who face an uphill struggle to be taken seriously.\n\nAt the moment, the higher tier includes Katie Porter, a former Orange County congresswoman who fell short in a U.S. Senate bid last year; Lt. Gov. Eleni Kounalakis, who has substantial private wealth and is backed by former House Speaker Nancy Pelosi; and Antonio Villaraigosa, the former mayor of Los Angeles.\n\nThe lower tier includes Xavier Becerra, a former state attorney general and Biden cabinet member; Toni Atkins, the former president pro tem of the state Senate; state schools Superintendent Tony Thurmond and former state Controller Betty Yee.\n\nWhat about Republicans?\n\nRiverside Sheriff Chad Bianco and former Fox News host Steve Hilton are running, but the chances of a GOP win next year are infinitesimal. However, were the Democratic field to remain large, fragmenting the Democratic vote, a Republican could finish second in the primary and win a spot on the general election ballot, essentially guaranteeing the Democratic nominee an easy win.\n\nThat’s what happened last year when Democrat Adam Schiff indirectly helped Republican Steve Garvey place second in the U.S. Senate primary, thereby foregoing a general election duel with Porter.\n\nWhen a clear Democratic frontrunner emerges in next year’s campaign for governor, the other Democrats will be competing for second place in the primary and a spot on the November ballot.\n\nMeanwhile, another potential candidate could change the post-Harris dynamics: Los Angeles businessman Rick Caruso, a Republican-turned-Democrat who lost the mayor’s race in 2022 and is reportedly weighing either another mayoralty bid next year, challenging incumbent Karen Bass, or a shot at the governorship.\n\nCaruso is very wealthy and could draw heavy support from California’s business community, particularly if he were to survive the primary and face a liberal Democrat such as Porter.\n\nWe waited for months to learn whether Harris would run. Now we’re waiting for Caruso.\n\nCalMatters is a nonpartisan and nonprofit news organization bringing Californians stories that probe, explain and explore solutions to quality of life issues while holding our leaders accountable.\n\nWant to submit a letter to the editor, guest column or opinion piece? Find our guidelines and submission form here.","summary":"Whatever persuaded Harris not to seek the governorship, her announcement finally allows those who want the job to shift into a higher gear.","url":"https://timesofsandiego.com/opinion/2025/08/05/opinion-with-harris-out-who-leads-california-governors-race/","image":"https://timesofsandiego.com/wp-content/uploads/2024/01/Toni-Atkins-Podium.jpg","video":null,"publish_date":"2025-08-05 18:16:29","author":"Chris Jennewein,Dan Walters • CalMatters Columnist","authors":["Chris Jennewein","Dan Walters • CalMatters Columnist"],"language":"en","category":"politics","source_country":"US","sentiment":-0.069},{"id":348450890,"title":"‘They Fell In Love With Their Captors’: Teamsters Boss Blasts Dems For Ignoring ‘Working People’","text":"Teamsters Union President Sean O’Brien explained on “Honestly with Bari Weiss” Tuesday that he believes the Democratic Party has abandoned working Americans by serving special interests and campaigning on “social justice issues.”\n\nThe International Brotherhood of Teamsters in September 2024 declined to endorse a 2024 presidential candidate after publishing internal polling data demonstrating that nearly 60% of the workers it represented favored President Donald Trump over former Vice President Kamala Harris. O’Brien criticized Democrats on The Free Press podcast for not spending time in person with their constituents. (RELATED: Powerful Union Suddenly Courting Republicans Spent Millions On Liberal Advocacy, New Report Reveals)\n\n“Where the Democrats lost … they fell in love with their captors. They fell in love with big money. They fell in love with big tech. And they forgot who they’re truly representing: working people. You know why? Because they’re not in their communities, not in their neighborhoods,” O’Brien said. “They’re not talking to the people that they’re paid to represent. And when you talk to people one-on-one — look, I can sit in my office all day, every day, and try and solve problems over the phone and I’m not going to get a true testimonial of what is actually going on.”\n\n“Look, this whole election for the Democrats was based on social justice issues, right? Our members … I can speak for the Teamsters — we solve a lot of those social justice issues by negotiating the strongest contracts, by fighting for rights, fighting for diversity, fighting for equality in the workplace,” he added. “And it seemed like this narrative of the social justice issues, it didn’t identify with our members. Our members identify with more money in their pockets, more job protection, better pensions.”\n\nTrump made gains with white men lacking college degrees, black men, Latinos and Asian-Americans and Pacific Islanders during the 2024 election, according to data from Democratic data firm Catalist. Portraying Harris and the Democratic Party as excessively far left on transgender issues was one of the most powerful advertising campaigns in increasing backing for Trump and GOP candidates down the ballot in 2024, according to multiple reports.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Fell in love with big money'","url":"https://dailycaller.com/2025/08/05/they-fell-in-love-with-their-captors-teamsters-boss-blasts-dems-for-ignoring-working-people/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/Screenshot-2025-08-05-1.30.51-PM-e1754415120665.png","video":null,"publish_date":"2025-08-05 17:52:44","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","source_country":"US","sentiment":-0.152},{"id":348443482,"title":"'Gayle King's Career Is Over!': Trump Bashes 'CBS Mornings' Host For Having 'No Talent' and 'No Strength' As Ratings For TV Program Tank","text":"President Trump is not done lashing out at CBS, or its liberal program hosts, RadarOnline.com can report.\n\nAfter boasting about the firing of Late Show host Stephen Colbert, the president has set his sights on another embattled presenter – CBS Mornings anchor Gayle King.As RadarOnline.com previously reported, Oprah Winfrey's bestie has come under intense fire for her \"woke\" guests and focus on DEI at the morning show, and could soon be out of a job.\n\nLate Monday night, Trump joined in on the bash bus, posting to his Truth Social platform: \"Gayle King’s career is over. She should have stayed with her belief in TRUMP. She never had the courage to do so. No talent, no ratings, no strength!!!\"\n\nKing, who reportedly makes $15million a year, recently ruffled conservative feathers when she interviewed RuPaul's Drag Race winner Bob the Drag Queen, who had been promoting his \"gender-bending\" novel Harriet Tubman: Live in Concert.\n\nAn insider went off: \"The audience doesn’t want woke. It doesn’t like progressive and provocative bookings.\"\n\nMeanwhile, ratings for the show have plummeted to fewer than two million viewers, plunging the show into last place. \n\nThe source added: \"The morning show audience wants optimism and cheer and joy, and what they were producing is at odds with audience expectations.\"Eye SpyPresident Trump has taken particular pride in the turmoil at CBS after parent company Paramount finally finalized its multi-billion-dollar merger with Skydance Media, a move that hinged perilously on the approval of the Federal Communications Commission.\n\nEarlier this year, 60 Minutes executive producer and leader Bill Owens suddenly quit his job in light of the network's financial settlement with the White House after Trump claimed the news program deceptively edited an interview with his election opponent Kamala Harris. Owens left after saying he is no longer able to produce the show he wants.\n\nAnd the president took a personal victory lap after the network announced the abrupt cancellation of The Late Show with Stephen Colbert, even as the program is the top-rated late-night show.Colbert RetortJust days before his show's cancellation, Colbert branded the CBS settlement \"a big fat bribe,\" suggesting that Paramount's choice to sever ties with the late-night talk show was not merely a business decision but rather a politically motivated action under outside pressure.\n\nTrump added fuel to that fire when he took to Truth Social to celebrate, writing: \"I absolutely love that Colbert got fired. His talent was even less than his ratings.\"Not Enjoying the ViewWhile King's future at CBS now hangs in the balance, other networks are hastily reevaluating their own liberal shows. With The View on a summer hiatus, ABC execs are scrambling to figure out how the wildly left-leaning show became a platform for more than 100 liberal guests in the first half of 2025, with zero conservatives appearing with opposing viewpoints.\n\nMedia Research Center's NewsBusters analyzed the numbers, revealing that 102 left-wingers appeared on the daytime chat show to help echo the cohosts' progressive viewpoints. At the same time, not a single guest presented a perspective that challenged Joy Behar, Whoopi Goldberg, Sara Haines, Sunny Hostin, and Ana Navarro. The panel's only conservative is Alyssa Farah Griffin.\n\n\"Top brass wants change, fast,\" an insider fished. \"They’re terrified this becomes an election-year scandal.\"","summary":"After boasting about the firing of 'Late Show' host Stephen Colbert, the president has set his sights on another embattled presenter","url":"https://radaronline.com/p/gayle-king-career-over-donald-trump-cbs-mornings-host/","image":"https://media.radaronline.com/brand-img/Mb7ijho0_/0x0/donald-trump-gayle-king-1754414157734.jpg","video":null,"publish_date":"2025-08-05 17:45:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":0.055},{"id":348443472,"title":"Travis Kelce Supports Taylor Swift Over 'Ridiculous' Donald Trump's Comments About Her Looks — But Won't Publicly Slam Prez Over Fears He’ll Upset Republican Teammates","text":"Travis Kelce is supporting girlfriend Taylor Swift over Donald Trump's unflattering comments on her looks — but refuses to publicly condemn the President.\n\nRadarOnline.com can reveal the NFL star, 35, fears slamming Trump may upset his Republican teammates and is at pains to spark disharmony within the Kansas City Chiefs' ranks.Fears Upsetting TeammatesChoosing to \"take the high road\" in regard to Trump's remarks, in which he declared Swift, 35, as \"no longer hot\" in a Truth Social rant, Kelce will be lending a supportive hand to the Bad Blood hitmaker behind the scenes as always.\n\nA source told the Daily Mail: \"Taylor knows exactly how Travis feels about this situation with Trump, and privately they are on the same page.\n\n\"He is supporting her with continued love and respect, but publicly Travis is going to let Trump be a sandbag and let it slip by — for now.\n\n\"Sure, it's frustrating, but he is looking to take the high road and only express his frustrations to Taylor and their family on how ridiculous the President is being.\"Taking Jibes At SwiftThe three-time Super Bowl winner has historically kept his political beliefs private, though he did raise eyebrows when he said playing in front of President Trump at the 2025 spectacle was a \"great honor.\"\n\nHis close pal and teammate Patrick Mahomes is also known to be a fan of the president, with his wife Brittany Mahomes liking multiple social media posts in support of Trump's 2024 re-election campaign.\n\nOn Monday, the president pitted the singer against actress Sydney Sweeney in the angry post shared to his Truth Social platform.\n\nSweeney has been under fire for days after appearing in an advert for denim brand American Eagle.'Sweeney Hotter Than Swift'Sweeney's pun on the words \"jeans\" and \"genes\" has been met with a woke backlash and even ugly claims of \"racism\", and has seen her political past raked over — with it emerging that she's been a registered Republican since last June.\n\nTrump welcomed the news. \n\n\"Sydney Sweeney, a registered Republican, has the 'HOTTEST' ad out there. It's for American Eagle, and the jeans are 'flying off the shelves.' Go get 'em Sydney!\" the president wrote.\n\nBut elsewhere in his lengthy post, Trump turned his attention to Swift.\n\n\"Or just look at Woke singer Taylor Swift. Ever since I alerted the world as to what she was by saying on TRUTH that I can't stand her (HATE!). She was booed out of the Super Bowl and became, NO LONGER HOT,\" Trump said.\n\n\"The tide has seriously turned — Being WOKE is for losers, being Republican is what you want to be,\" Trump added.He ended the post with his trademark: \"Thank you for your attention to this matter!\"\n\nSwift's apparent attractiveness has been something of a fixation for the president in recent months. \n\nIn May, he posted: \"Has anyone noticed that, since I said 'I hate Taylor Swift,' she's no longer 'HOT?'\"\n\nAfter Swift publicly endorsed Kamala Harris in the 2024 election back in September, Trump posted: \"I hate Taylor Swift.\"","summary":"Travis Kelce is supporting girlfriend Taylor Swift over Donald Trump's unflattering comments on her looks — but refuses to publicly condemn the President.","url":"https://radaronline.com/p/travis-kelce-supports-taylor-swift-donald-trump-comments-slam-president/","image":"https://media.radaronline.com/brand-img/3OQLwzW7O/0x0/5-1754410376996.jpg","video":null,"publish_date":"2025-08-05 17:37:07","author":"Mike Boyce","authors":["Mike Boyce"],"language":"en","source_country":"us","sentiment":0.302},{"id":348420580,"title":"Famous Democrats' blistering response to Kamala Harris' claim that 'the system is broken'","text":"Prominent media personalities Charlamagne tha God and Stephen A. Smith slammed Kamala Harris for saying that the system is 'broken' after she spent decades working in politics. \n\nThe pair of Democrats took aim at Harris' comments last week on The Late Show with Stephen Colbert, where the former vice president responded to the host's questions about a potential future for office. \n\n'I don't want to go back in the system, I think it's broken,' she said. \n\nCharlamagne and Smith seized on the remarks on Monday's episode of the Stephen A. Smith Show, accusing Harris of hypocrisy.\n\n'When they asked her the other day about her stepping away and she was like, \"I want to step back from it, the system is broken\" - you're a career politician, you've been there practically all your life,' Smith said. \n\n'You've been an attorney, a state attorney general. You've been a prosecutor. You've been a senator. You've been a vice president. My God, you've been a part of it. And now you're saying it's broken?'\n\n'That means you couldn't do but so much to fix it when you was in it.'\n\nCharlamagne agreed.\n\n'The system was broken long before Donald Trump, you know, got into office,' the radio host added. \n\n'Kamala is a friend, man. I've been supporting Kamala for a long time,' he continued.\n\n'But I can't sit here and say I disagree with you. I think that she should do whatever it is that she wants to do, but when I heard her say that, you know, \"The system is broken\" and she wants to take a step back from the system - her whole career has been the system.' \n\nSmith also claimed 'there's no way in hell she's going to win the presidency in 2028.' \n\n'I don't think that she's going to be the candidate,' he said. 'I think her time - she had a chance at that. It didn't get done and that's where I'm at with it.'\n\nThe conversation came just days after President Donald Trump attacked Charlamagne, calling the host a 'racist sleazebag' after he openly criticized the president in front of his daughter-in-law. \n\nThe Breakfast Club host sat down with Lara Trump, who is married to the president's son Eric Trump, on Saturday night and asked him to rate her father-in-law's performance in office over the past six months. \n\n'I wouldn't give it a good rating - simply because the least of us are still being impacted the worst,' Charlamagne, whose real name is Lenard Larry McKelvey, replied. \n\n'Like when you look at something like the 'Big, Beautiful Bill.' That's something that I'm going to benefit from because of the tax bracket that I'm in. But there's going to be so many people that's hurt by that bill,' he added. \n\nIn February, Smith threatened to run for president himself, saying the USA's 'joke' of a two-party system could motivate him. \n\nSmith, who spoke exclusively to the Daily Mail at the time about his potential entry into politics, has flip-flopped when it comes to a career in public office, previously saying he has 'no desire' to run for president.\n\nHowever, he has also said he would consider running if he had a 'legitimate, bonafide shot to win,' and outlined on his eponymous show what he'd want to change if given the chance.\n\n'Let me tell you why [I would consider running]. Because I think our system sucks,' he said, via Awful Announcing. \n\n'I think the binary system where we have to choose between the Democrats and the Republicans is a joke.","summary":"When asked recently about returning to public office, the former vice president responded: 'I don't want to go back in the system, I think it's broken.'","url":"https://www.dailymail.co.uk/news/article-14972783/stephen-smith-charlamagne-tha-god-kamala-harris-response-politics-donald-trump.html","image":"https://i.dailymail.co.uk/1s/2025/08/05/16/100942497-0-image-a-10_1754408675129.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/06/5617136308096644498/1024x576_MP4_5617136308096644498.mp4","publish_date":"2025-08-05 17:01:56","author":"Editor,Noa Halff","authors":["Editor","Noa Halff"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.364},{"id":348487288,"title":"Illinois Gov. Pritzker joins Texas Democrats in fight against redistricting plan","text":"On the eve of the 60th anniversary of the Voting Rights Act, Texas Democrats, along with Illinois Gov. JB Pritzker and the Democratic National Committee Chair Ken Martin, met Tuesday to continue the fight against a redistricting plan to add five seats favoring Republicans.The Texas Legislature attempted to meet Monday to consider a bill to redraw the state's congressional districts, but Democratic members who left the state over the weekend did not return, denying the quorum needed to convene the session. Gov. Greg Abbott has since vowed to take steps to remove those lawmakers from their seats, and Texas House Speaker Dustin Burrows said he had signed civil arrest warrants for the absent Democrats. Republican Sen. John Cornyn said he has called on the FBI to \"take any appropriate steps to aid in Texas state law enforcement efforts to locate or arrest potential lawbreakers who have fled the state.\"In a press release, DNC Chair Martin said, \"Instead of prioritizing disaster relief for flood victims, Texas Republicans are abusing their special legislative session to tilt the electoral map in their favor in a desperate attempt to cling to their razor-thin Congressional majority during midterms, after voting to cut health care and food benefits for millions of Texans.\" And in Tuesday's news conference, that was the message to all Americans: Texas Republicans, Gov. Abbott and President Donald Trump are working to \"cheat\" to gain more votes, disenfranchise Black and Latino voters and violate voting rights, instead of caring for those who were affected by the devastating floods. Gov. Pritzker, Martin and Lieutenant Governor of Illinois Juliana Stratton all shared how they were proud to stand shoulder to shoulder with Texas Democrats and called on all of America to stand up and get involved in the fight.\"Texas House Democrats are leading the way in choosing courage and country over politics and party,\" said Gov. Pritzker. Texas Representatives Ramon Romero Jr., of Fort Worth, Barbara Gervin-Hawkins, of San Antonio, Lizzie Fletcher, of Houston and Al Green, of Houston, all spoke on how they were defending all Americans in their fights against redistricting. Gervin-Hawkins in particular called out Texas Republicans, too, asking them to stand up, be brave, and to vote \"no\" on the redistricting plan. \"It is time for you to love America again,\" Gervin Hawkins said about her Republican constituents. And in reference to Gov. Abbott issuing arrest warrants for them, Romer Jr. said, \"I'll pay that price for America.\" The leaders of the state of Illinois vowed to continue to support Texas Democrats and protect them in their stand against Abbott and President Trump. A standoff in Texas after Democrats leave the stateAbbott has ordered state troopers to help find and arrest the Democrats who left the state, but lawmakers physically outside Texas are beyond the jurisdiction of state authorities.\"If you continue to go down this road, there will be consequences,\" House Speaker Rep. Dustin Burrows said from the chamber floor, later telling reporters that it includes fines.Democrats' revolt and Abbott's threats intensified the fight over congressional maps that began in Texas but now includes Democratic governors, like Pritzker, who have pitched redrawing their district maps in retaliation — even if their options are limited. The dispute also reflects President Trump's aggressive view of presidential power and his grip on the Republican Party nationally, while testing the long-standing balance of powers between the federal government and individual states.The impasse centers on Mr. Trump's effort to get five more GOP-leaning congressional seats in Texas, at Democrats' expense, before the midterms. That would bolster his party's chances of preserving its fragile U.S. House majority, something Republicans were unable to do in the 2018 midterms during Trump's first presidency. Republicans currently hold 25 of Texas' 38 seats. That's nearly a 2-to-1 advantage and already a wider partisan gap than the 2024 presidential results: Trump won 56.1% of Texas ballots, while Democrat Kamala Harris received 42.5%.Mr. Trump said Tuesday that Republicans are \"entitled to five more seats.\" Status of the voteTexas legislators who left the state have declined to say how long they'll hold out. \"We recognized when we got on the plane that we're in this for the long haul,\" said Rep. Trey Martinez Fischer while in Illinois.Texas House Democratic Caucus leader Gene Wu said members \"will do whatever it takes\" but added, \"What that looks like, we don't know.\"Legislative walkouts often only delay passage of a bill, like in 2021, when many Democrats left Texas for 38 days to protest proposed voting restrictions. Once they returned, Republicans passed that measure.Lawmakers cannot pass bills in the 150-member House without two-thirds of members present. Democrats hold 62 seats in the majority-Republican chamber, and at least 51 left the state, according to a Democratic aide.The Texas Supreme Court held in 2021 that House leaders could \"physically compel the attendance\" of missing members, but no Democrats were forcibly brought back to the state after warrants were served. Republicans answered by adopting $500 daily fines for lawmakers who don't show.Abbott, meanwhile, continues to make unsubstantiated claims that some lawmakers have committed felonies by soliciting money to pay for potential fines for leaving Texas during the session.","summary":"Gov. Greg Abbott has since vowed to take steps to remove Democratic lawmakers from their seats.","url":"https://www.cbsnews.com/news/illinois-jb-pritzker-dnc-ken-martin-texas-democrats-fight-redistricting-republican-maps/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/08/05/e01ddcc2-0806-4aa7-b491-4fb21d5320a0/thumbnail/1200x630/39305c2d51277ca126774c5a34d8bc67/ap25216120978693-1.jpg","video":null,"publish_date":"2025-08-05 16:50:01","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0},{"id":348420464,"title":"Young adults are less likely to follow politics or say voting is important, new AP poll shows","text":"WASHINGTON (AP) — Mairekk Griffiths, a 26-year-old cook in a Denver suburb, doesn’t think he’ll ever pay a lot of attention to U.S. politics unless radical change happens.\n\n“If another party was likely to win, I’d be interested in that,” said Griffiths, who voted for Democrat Kamala Harris in last year’s presidential race but, like many his age, does not see voting as that valuable.\n\n“I can’t say either way that voting matters,” Griffiths said. “It’s just picking the least bad option. That’s what I remember my whole life — both sides are bad, but this side is less bad.”\n\nYoung people such as Griffiths are less engaged with U.S. politics than older Americans and less likely to say voting is important, according to a new poll from The Associated Press-NORC Center for Public Affairs Research. Young people — even those who follow politics closely — are less likely to say issues such as the economy, government spending and health care are “extremely important” to them than comparable older adults.\n\nThe findings point to a broad sense of disillusionment among younger people about the country’s political system — even if, like Griffiths, they still end up casting a ballot. Alberto Medina, who leads the Center for Information and Research on Civic Engagement at Tufts University, which studies youth and politics, noted that turnout among young people hit record levels in the 2020 election and was high last year.\n\n“There’s a sense that democracy isn’t working for young people. There’s a lack of belief that democracy is even able to improve their lives,” Medina said. “At the same time, we have been living in an era of high youth voting.”\n\nDisengagement from political parties and politics\n\nIn another sign of their general estrangement from politics, the poll shows young adults are more likely to reject political party labels. About one-third of adults under age 30 identify as political independents who don’t lean toward either major political party, compared with 17% of Americans age 60 or older.\n\nThe poll also finds young people are far less likely to follow politics closely than older adults are.\n\nOnly about 2 in 10 of adults under age 30 say they follow U.S. politics “extremely” or “very” closely, compared with about one-third of Americans overall. That’s even higher among adults age 60 or older — 45% of this group says they follow U.S. politics at least very closely.\n\nDisengagement is higher among teenagers, with an AP-NORC poll from May finding 44% of teens ages 13 to 17 report following U.S. politics “not very closely” or “not closely at all.”\n\nMeanwhile, about two-thirds of adults under age 30 say it’s “extremely” or “very” important to vote, compared with almost 9 in 10 over age 45 who say it’s at least “very” important to vote.\n\nSome of these habits could shift as people grow older. Younger people traditionally are less likely to vote than older people, and voter participation tends to go up with age. It’s possible that engagement with politics could follow a similar pattern.\n\nBrittany Diaz, 28, follows politics closely for an unusual reason: Her oldest son, who is 7, is obsessed with the news and watches it every night. Diaz, a Republican who lives in an Albuquerque, New Mexico, suburb, acknowledges that she’s unusual among her age group because she decided to start paying attention to politics when she had her first child at 20.\n\n“Now that I have kids, I’m like, ‘I need to care,’” she said.\n\nIn closely following politics, Diaz is different from many other women under 30.\n\nWomen in her age group are less likely than young men to say they follow U.S. politics, the poll finds. About one-quarter of men under 30 say they follow politics “extremely” or “very” closely, compared with 16% of women in the same age group. And about 4 in 10 young women say they follow U.S. politics “not very closely” or “not closely at all” compared with about a quarter of young men.\n\nLower investment in key issues\n\nOn a few issues, such as the economy and health care, the divide between the youngest and oldest Americans isn’t large. About 8 in 10 Americans under age 30 say the economy is “extremely” or “very” important to them personally, compared with about 9 in 10 Americans age 60 or older.\n\nBut older adults are much likelier to say topics that have taken center stage during the first six months of President Donald Trump’s second term — including immigration and government spending — are “extremely” or “very” important to them personally compared with Americans under 30.\n\nThat’s even true for topics such as the situation in the Middle East, which has become a rallying cry for young activists since the Israel-Hamas war broke out. Only about 4 in 10 adults under 30 say this is highly important to them personally, compared with about 6 in 10 Americans age 60 or older.\n\nFor some, that lack of interest could be related to a sense that the political system doesn’t respond to their needs.\n\nAt 18, Blake Marlar is just starting to pay attention to politics. As Trump’s tax cut and spending bill moved through the Republican-controlled Congress, the aspiring geology major at the University of Nebraska emailed his state’s two senators, both Republicans, objecting to its Medicaid cuts and increases in immigration enforcement funding.\n\n“They didn’t seem to take me seriously,” Marlar said. “While I recognize they have to represent the whole state and the whole state doesn’t agree with me, it could have been a different experience.”\n\nBut he’s resolved not to give up on politics: “In the future,” he said, “I’ll do my part and vote.”","summary":"Young adults show less interest in politics and voting, new AP poll finds.","url":"https://nypost.com/2025/08/05/us-news/young-adults-are-less-likely-to-follow-politics-or-say-voting-is-important-new-ap-poll-shows/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-ptksox0c4-1754411182418.jpg?quality=75&strip=all&1754396872&w=1024","video":null,"publish_date":"2025-08-05 16:47:54","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.124},{"id":348420438,"title":"Tulsi Gabbard tells ‘Pod Force One’ about life on TSA watchlist: ‘Makes zero sense whatsoever’","text":"Director of National Intelligence Tulsi Gabbard opened up to The Post’s Miranda Devine about being harassed and followed by federal law enforcement after her name was added to a since-scrapped Transportation Security Administration watchlist.\n\n“I was certain … that it was politically motivated,” Gabbard, a former Democratic congresswoman from Hawaii and ex-Democratic National Committee vice chair, said on the latest episode of Devine’s “Pod Force One,” out Wednesday. “There was no other explanation for it, other than that.\n\n“When I spoke to TSA agents in multiple airports who were just doing their jobs, but who, as they went through this extreme and in-depth search of me — and oh, by the way, my husband was also placed on this domestic terror watch list — they were like, ‘Why are we doing this with you?'” the DNI recalled.\n\n“‘You are still serving as a lieutenant colonel in the US Army Reserve. You’re a former member of Congress. This makes zero sense whatsoever.'”\n\nGabbard and her husband, Abraham Williams, were flagged under the Quiet Skies program, in which federal air marshals would surveil individuals on domestic and international flights who were not already on existing watchlists.\n\nHomeland Security Secretary Kristi Noem ended the Quiet Skies program in June this year, claiming it failed to prevent a single terrorist attack.\n\nGabbard’s inclusion on the list was triggered by her attendance at a Vatican event in July 2024 that was organized by a European businessman who was on an FBI watch list, the New York Times reported in January. It is unclear why the businessman was of interest to federal authorities.\n\nEvery week, Post columnist Miranda Devine sits down for exclusive and candid conversations with the most influential disruptors in Washington. Subscribe here!\n\nAs a result, the DNI told Devine, she was subject to intense searches of her clothing and luggage — “sometimes 30-minute-long, 40-minute-long,” before getting on any flight.\n\n“[They would search] the lining of my luggage, after everything was removed; feeling down every jacket that I had, feeling down the seams of every single inch of my clothing,” Gabbard recalled. “Again, these guys were doing what they were told to do. I wouldn’t want them to be fired for not doing their job. But when you look at the consequences again of this politicization of intelligence, this is another example.”\n\nThe DNI also said air marshals were ordered to “surveil me and follow me and look at how many times did I pick up my phone while I’m in flight. Did I talk to any other people? Did I have any interesting conversations? Was there any movement that I made that seemed a little out of the ordinary? How many times do you get up and go and use the bathroom?”\n\n“I didn’t know until later the extent of how many air marshals they required to watch me and who had to type up reports … from drop-off, to move through the airport, to get on the plane, to landing at my destination and out to the curb.”\n\n“The real implication here is people will see me on TV criticizing Hillary Clinton’s foreign policies, criticizing Kamala Harris’ foreign policies,” Gabbard later added, “and then very publicly [see] how the government and the intelligence is being weaponized against me, it can have a very chilling effect.”\n\nGabbard, 44, also opened up about her drift from the Democratic Party.\n\n“I joined the Democratic Party back in my early 20s because I had to pick one, and what I saw and was attracted to was really the values that I saw Dr. Martin Luther King promoting, the values that President John F. Kennedy talked about … I saw a party that fought for the struggling, working man and woman in America, those who were just trying to take care of their families and put food on the table and provide a better future for their kids,” she recalled.\n\n“Fast forward to where we are now, where you have people talking about this guy, [Zohran] Mamdani in New York, as the future of the Democratic Party, and he’s a self-proclaimed socialist,” she went on. “You look at AOC, same thing.\n\n“If only the Democratic Party of today had the intellectual honesty to really question themselves about what party would President John F. Kennedy most align with in today’s world that we live in.”","summary":"Director of National Intelligence Tulsi Gabbard opened up about being surveilled by the feds at airports during an interview on Miranda Devine’s “Pod Force One” podcast.","url":"https://nypost.com/2025/08/05/us-news/tulsi-gabbard-tells-pod-force-one-about-life-on-tsa-watchlist-makes-zero-sense-whatsoever/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-gqimmwacz-1754409030954.jpg?quality=75&strip=all&1754394694&w=1200","video":"https://cdn.jwplayer.com/videos/URQwUEBo-RyIcpnTz.mp4","publish_date":"2025-08-05 16:37:47","author":"Ryan King","authors":["Ryan King"],"language":"en","source_country":"us","sentiment":-0.419},{"id":348432782,"title":"‘South Park’ Will Target Trump Administration Again In New Episode As Series Heads To Paramount+","text":"“South Park” will target President Donald Trump and his administration’s Immigration and Customs Enforcement raids on Wednesday night’s episode, according to teasers, weeks after the season 27 premiere sparked the White House’s wrath.\n\nThe previous \"South Park\" episode sparked the White House's anger. (Photo by Jon Kopaloff/Getty Images for Paramount+)\nGetty Images for Paramount+\n\n“South Park” teased the second episode of season 27 in a post on X on Tuesday morning, depicting character Mr. Mackey dressed as an ICE officer standing alongside another character who appears to be Department of Homeland Security Secretary Kristi Noem.\n\nIn the episode, titled “Got A Nut,” Mr. Mackey “loses his job” and “desperately tries to find a new way to make a living,” according to the post.\n\nA video preview for the episode teases the return of a satirized Trump alongside a cartoon Satan, who was depicted as Trump’s lover in the season premiere.\n\nIn the preview, character Eric Cartman appears to speak at a town hall, where he chastises another character, whom he tells to “shut up” because she “hates America and loves abortions.”\n\nThe episode will air Wednesday night at 10 p.m. EDT on Comedy Central and will stream on Paramount+ the following day.\n\nHow Did “south Park” Anger The Trump Administration?\n\nThe White House slammed “South Park” as a “fourth-rate” show that “hasn’t been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention” after it targeted Trump in its season 27 premiere last month. The episode satirized Trump’s tendency to sue his opponents, depicting the president suing the entire town of South Park after residents oppose the government’s push to teach Christianity in schools. Trump is portrayed throughout the episode as having small genitals for comedic effect, and in multiple scenes, he jumps in bed with Satan, who is depicted as his lover but rebuffs his sexual advances. The episode concludes on a lifelike portrayal of Trump wandering nude through a desert as a voiceover says his genitals are “teeny tiny, but his love for us is large.” The episode also knocks Paramount’s settlement after the Trump administration filed a lawsuit accusing the company of deceptively editing a “60 Minutes” interview of his former election opponent, former Vice President Kamala Harris. In the episode, Jesus Christ tells the South Park townspeople he had to visit them because of the “lawsuit and an agreement with Paramount,” and he asks: “Do you really want to end up like Colbert?” referencing the late-night show’s cancellation. The ending scene of a lifelike Trump is also presented as a faux public service announcement, referencing Trump’s claim that the Paramount settlement will provide him $20 million worth of advertising and PSAs.\n\nWhy Is “south Park” Heading To Paramount+?\n\nThe entire “South Park” catalog will depart HBO Max on Tuesday and head to Paramount+ after series creators Trey Parker and Matt Stone struck a $1.5 billion deal with Paramount, through which they will produce 50 new episodes over five years. The deal followed negotiations that were reportedly tense, as lawyers representing the “South Park” creators threatened to sue Jeff Shell, a former NBCUniversal executive who is set to become Paramount’s president following the Skydance merger, for allegedly interfering with negotiations with other potential buyers. In a statement on X last month, Parker and Stone said the “merger is a sh—tshow and it’s f—ing up ‘South Park.’ We are at the studio working on new episodes and we hope the fans get to see them somehow.”\n\nThe $1.5 billion deal with Paramount made Parker and Stone billionaires, according to Forbes estimates. Both creators are worth an estimated $1.2 billion each.\n\nFurther Reading\n\nWhite House Slams ‘South Park’ Episode That Skewers Trump And Paramount Amid $1.5 Billion Streaming Deal, Skydance Merger (Forbes)\n\nSouth Park’s Creators Are Now Billionaires (Forbes)\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"The White House called “South Park” a “fourth-rate” show “desperate” for attention after it skewered President Donald Trump in its season 27 premiere episode.","url":"https://www.forbes.com/sites/conormurray/2025/08/05/south-park-will-target-trump-administration-again-in-new-episode-as-series-heads-to-paramount/","image":"https://imageio.forbes.com/specials-images/imageserve/68923130d794c81b852c3307/0x0.jpg?format=jpg&crop=2858,1607,x64,y318,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-08-05 16:29:45","author":"Conor Murray,Forbes Staff,Jon Kopaloff","authors":["Conor Murray","Forbes Staff","Jon Kopaloff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.004},{"id":348403426,"title":"Moving Forward: International Tax After The OBBBA","text":"TAX letter on block cubes on wooden table over world map, modern office city tower and skyscraper, Business and finance concept, Elements of this image furnished by NASA\n\nIn this episode of Tax Notes Talk, Alan Cole of the Tax Foundation discusses the international tax provisions in the One Big Beautiful Bill Act and what may be next for negotiations on a global tax framework.\n\nTax Notes Talk is a podcast produced by Tax Notes. This transcript has been edited for clarity.\n\nDavid D. Stewart: Welcome to the podcast. I'm David Stewart, editor in chief of Tax Notes Today International. This week: rethinking revenge.\n\nWhen the House released their initial version of the One Big Beautiful Bill Act, the international business community was concerned by the proposed section 899, which came to be known as the revenge tax. We covered this provision in a previous episode, which we'll link to in the show notes.\n\nSince then, the bill has been through a number of changes at the behest of senators and one significant change requested by the administration, concluding in the final version signed into law by President Trump.\n\nSo where did Congress end up on international tax? And what does the bill mean for efforts to reach a consensus on international corporate tax?\n\nThis episode is part of an ongoing series on the One Big Beautiful Bill Act. As we continue to dive deep into the most important tax changes and provisions in the coming weeks or even months, we'd like to hear from you. If there's an aspect of the bill you'd like to hear more about, please email us at podcast@taxanalysts.org.\n\nMORE FOR YOU\n\nBut for now, here to talk more about this is Tax Notes senior reporter Jonathan Curry. Jonathan, welcome back to the podcast.\n\nJonathan Curry: Hello again, Dave.\n\nDavid D. Stewart: Now, I understand you recently talked to somebody about this. Who did you talk to?\n\nJonathan Curry: Yeah. I talked to Alan Cole of the Tax Foundation. He's a senior economist there, and he's full of great insights.\n\nDavid D. Stewart: And what things did you talk about?\n\nJonathan Curry: Well, we focused on the international tax provisions of the OBBBA, or the One Big Beautiful Bill Act. We covered quite a lot of ground, to be honest. Of course, this didn't happen in a vacuum. We went through the context, the history that led us to this point. We cover some of the major provisions in the bill, things that a lot of our listeners are, I'm sure, familiar with: the [global intangible low-taxed income, foreign-derived intangible income, and base erosion and antiabuse tax]\n\nand now the sad, new nicknames we all have to memorize in order to keep track with this evolving tax landscape that we're in. You'll hear things like the foreign tax credit haircut, the [controlled foreign corporation] look-through rule, things that might not necessarily jump off a page when you're scanning a bill.\n\nBut it's stuff that's important for a lot of multinational corporations, international tax practitioners in particular, and it's going to have a lot of impact for certain industries. There are going to be some winners, some losers, and things like that. And of course, we talked about one of my favorite topics — which I'm sad it's not going to be in law anymore — the revenge tax, section 899. You'll hear Alan's views on what impact it had on the tax debate and international negotiations. And on the topic [of] international negotiations, all these international tax changes took place in the context of the pillar 2 global minimum tax framework. And you'll hear how he thinks that this moves us in some ways closer to that and some other considerations there.\n\nDavid D. Stewart: All right. Let's go to that interview.\n\nJonathan Curry: Well, Alan, it's great to have you here on the Tax Notes podcast. I know you're excited to talk about your favorite topic in the world: international tax. Welcome.\n\nAlan Cole: Thank you. Absolutely great to be here.\n\nJonathan Curry: Yeah. So we're going to dive in and start off by talking from a 30,000-foot view, the big picture here. What was the international tax landscape prior to this new \"big beautiful bill\" coming into effect? I mean, why were lawmakers even wanting to make changes on the international tax end in the first place? Was this a major reform? Is this [Tax Cuts and Jobs Act] 2.0? What are we looking at here?\n\nAlan Cole: Mostly, we're looking at TCJA 2.0 on the international side. This is a very similar coalition to the one that wrote the international tax reform in 2017. Same party, same president. And that means that there's a limited desire to tinker with too much. And on top of that, the coalition had a pretty narrow majority in the House of Representatives, and that also lends itself to not making too many ultra controversial changes. That said, there were reasons to tweak TCJA even from the perspective of a party that had already passed it in recent memory.\n\nJonathan Curry: Yeah. Now, the House version of the bill, when we got the first draft of it, I remember seeing the draft document come out and thinking, \"Oh, boy, here's this whole new set of stuff to write about.\" And I looked at it, and there wasn't very much in there on the international tax space, except for section 899, which we'll get into later. But I mean, can you imagine the world in which international tax just got ignored altogether and the system we have currently in place was just left to continue running? Or was the Senate vision of making some changes here inevitable? Like this was going to have to happen one way or another?\n\nWashington DC, United States landmark. National Capitol building with US flag.\n\nAlan Cole: One way you could look at it would be from the House's perspective, it's hard to get unanimous approval for something among the Republican members, and you effectively need unanimous approval in order to get a majority in the House if you're relying only on Republican votes. And that lends itself to just doing what you did before because that's the baseline that everyone can at least start from.\n\nBut on the other hand, international corporate income tax is not usually an area that draws a lot of political controversy where you'll see a big dispersion in what different members believe. Especially if you're doing things carefully and relatively evenhandedly, and not trying to create big winners and losers. So there was room for a little more reform. I'm not surprised that ultimately the Senate did more to change international corporate income tax provisions than the House did, because the Senate definitely felt like they had room. They had effectively a larger majority than the House majority.\n\nBut ultimately the House just agreed to the Senate's changes because international corporate income tax is not that politically controversial among members in the sense that there aren't different beliefs among members. So if you're going to present a package and say, \"This is the best that our writers could do given the constraints,\" most of the members are probably going to go, \"OK.\" And that's kind of what happened. The House roughly accepted the Senate's changes, and that's how we ended up with a somewhat more interesting international package than the initial House bill looked like.\n\nJonathan Curry: Well, we've been talking about changes to the international tax portion of our laws here. Let's go over some of those changes. Let's start with the big three: GILTI, FDII, BEAT. Can you just run through us real briefly just a high-level view of what the changes that were made were?\n\nAlan Cole: GILTI and FDII both have new names now. Their acronyms are now NCTI [net CFC tested income] and FDDEI [foreign-derived deduction-eligible income]. Those names actually kind of existed before. They were intermediate steps in the calculations that got you to GILTI and FDII. But the reason for the name change is that one of the final steps is no longer there, and that is the subtraction of [qualified business asset investment] from the base of both of those tax bases. And the subtraction there is effectively a subtraction of the return on tangible investments.\n\nThe idea is if you start with all income and then you subtract the return on tangible investments, what you have left is your intangible income. And that's indeed where the I's in GILTI and FDII come from. Both have an I that stands for intangible, and then the other I stands for income. Now they are each down to one I, just the one that stands for income, and they no longer target intangibles. That change is a \"made in America\" Trump agenda type change, I think. It's one of the places where you can see a bit of a Trump ideological stamp.\n\nWEST PALM BEACH, FLORIDA - NOVEMBER 06: Republican presidential nominee, former U.S. President Donald Trump arrives to speak during an election night event at the Palm Beach Convention Center on November 06, 2024 in West Palm Beach, Florida. Americans cast their ballots today in the presidential race between Republican nominee former President Donald Trump and Vice President Kamala Harris, as well as multiple state elections that will determine the balance of power in Congress. (Photo by Chip Somodevilla/Getty Images)\nGetty Images\n\nAnd overall, I'm not a fan of this for reasons we can get into, but it's one of the few places where this is really something more than just an update to TCJA. It goes in a new direction, and it takes away the original purpose of GILTI and FDII, which was to target intangible income.\n\nJonathan Curry: And about those acronyms, they used to have these memorable acronyms: GILTI, FDII. We still have BEAT, of course. Have you settled on a way to refer to these new acronyms, the two new acronyms we have here? It's NCFCTI and FDDEI. Any good quick shorthand in your mind that you've settled on?\n\nAlan Cole: We're talking about NCTI versus NCFCTI? The C standing for CFC, which stands for controlled foreign corporation. That's the international income component of the new bill. Usually I'm hearing NCTI that can maybe be turned into \"necktie\" or \"nicktee,\" but I'm not sure which one of those two will win out. And some people have gone with \"fidday\" for the new FDII, F-D-D-E-I. But it's always been awkward to come up with good names for these things, and certainly the long acronyms are doing themselves no favors.\n\nJonathan Curry: Yeah. It will take a while for the dust to settle and for the tax community to settle on an agreed-upon way to refer to these, I think. Personally, I vote for \"necktie.\"\n\nSo GILTI and FDII had some pretty substantial changes. BEAT, as I understand, is fairly not that different, correct?\n\nAlan Cole: BEAT we can actually go through pretty simply. There was an idea for a whole bunch of changes to BEAT in the Senate draft, but they got rid of that set of changes and went with a much more simple rate hike to BEAT, not as big as the rate hike that it was scheduled for. It was scheduled to go from 10 [percent] to 12.5 [percent], and instead they made it go from 10 [percent] to 10.5 [percent]. So they kind of curved much of the rate increase in BEAT, and they preserved the current-policy treatment of credits and set it in law permanently. So mostly, they punted on BEAT.\n\nBut there was an effort to do something more interesting, which was a high-tax exemption. And that would have actually done a lot to put BEAT a little bit more towards its intended purpose, or at least its stated purpose. It says it's a base erosion tax. That's what the B-E stands for. And base erosion would be when you're trying to get to a lower-tax jurisdiction, you're taking deductions in the U.S. by making payments out to some lower-tax jurisdiction so that your income shows up there instead. And the U.S. doesn't like that; the U.S. calls that base erosion because they would rather the income be in the U.S. and taxed as U.S. income.\n\nAnd that would make sense if all instances of stuff taxed under BEAT were base erosion. But in many cases, it's effectively just going after normal large countries with high corporate income tax rates because it doesn't actually make any determinations based on what kind of country a company is making payments to, or what kind of presence they have there. It just looks at categories of accounting that are deemed suspicious.\n\nSo the Senate had an idea: \"Well, let's actually look what kind of country it is. And if it's a high-tax country, defined as having at least 90 percent of the U.S. tax rate, then we can exempt you from BEAT, because there, you're not base eroding, you're just paying tax to another country that has a similar tax rate to ours. Presumably because you honestly believe that the royalty payments actually do belong to your enterprises in that other country.\" And that makes sense if you're a Japanese company and you say that a lot of your work comes from engineers based in Japan. That's a very believable claim, and that's not really a tax evasion-like claim. Same with France, for example. That's not a country that you would try to increase your income tax liability in because it's a high-income tax country.\n\nSo that idea had a lot of promise, but I think the Joint Committee on Taxation scored it more expensively than perhaps writers thought it would be. I was surprised to see the number that high. I had been conditioned to think that the Joint Committee on Taxation thought that BEAT was a relatively smaller provision. And then we got this larger number, and then sure enough, it was gone in the next draft, and they did something simpler on BEAT. So I think it was just a matter of they didn't get the score they wanted and they pulled back from it.\n\nJonathan Curry: I see. So you don't think it's a policy decision that lawmakers are like, \"We don't think we should do this.\" It's more like, \"Well, maybe on the margin, it's just not really worth making the change because it will add to our numbers, our bad math here, the deficit numbers.\" OK, well, that's interesting.\n\nAlan Cole: Yes. I think they were working within a current-policy revenue-neutral framework on the international side. So they were looking at 2025. What are we collecting in 2025? Let's try to design a system that collects about the same amount but is a little bit better. And if the BEAT score stopped them from reaching that goal, then that would be a reason to reverse it.\n\nJonathan Curry: Yeah, yeah, interesting. Now there were a couple other changes in here too — CFC look-through rule, FTC haircut. Anything that surprised you? Or are these all pretty expected provisions to include in this package of proposals?\n\nAlan Cole: I think there are two categories here, and actually each of your examples comes from one of the categories. CFC look-through rule, and we could also go with the downward attribution glitch fix. There are some things that are so into the weeds that you can only really get coverage of them in a place like Tax Notes. These are really complex glitches in TCJA, or they are things that have been extended a long time, and it would be complicated if they ever went away. CFC look-through is like that. It would make the handling of U.S. multinationals much more complex without necessarily raising that much revenue. And so they made the CFC look-through rule permanent. That's a patch to the whole CFC look-through issue. And then they also included the patch to fix the problem in constructive ownership rules that was accidentally made in TCJA.\n\nIt's pretty clear that there was a section of U.S. tax law that was supposed to be amended and instead it got removed, and it creates exceptions to constructive ownership rules. And that exception disappeared entirely rather than being rewritten. And as a result, people were kind of credited with having much greater CFC reach than they actually should have, and it was a whole big mess. So those are the bug fix types. And those, I think, were not big surprises. A lot of them you could see that members like Rob Portman (R-Ohio) and Thom Tillis (R-N.C.) were talking about these things for a while, and they didn't cost much. So those were definitely going to make it in there.\n\nAnd then the other category has to do with kind of the way that the international situation has evolved since TCJA. It's not so much that TCJA was written in a flawed way in 2017 in these cases. It's more that the way the rest of the world does things has changed, although Republicans are not always singing the same tune as the rest of the world on international corporate income tax. Here, there were a few lateral changes that can just harmonize the U.S. with foreign tax cuts a little bit more. And basically, the situation was that the U.S. had what appeared to be lower rates, but actually its rules were less generous in unique ways that were anomalous to the United States. Those are things like expense allocation, the FTC haircut, as you mentioned. Those things make it a little bit worse to be a U.S. company. But in TCJA, you had lower nominal rates than the 15 percent target that the Europeans and OECD want a lot of people to settle on.\n\nUSA Politics News Badges: Pile of Tax Cuts And Jobs Act Buttons With US Flag, 3d illustration\n\nThe Senate took a look at that and said, \"Well, we can just remove some of these U.S. idiosyncrasies, and that gives us effectively tax cuts for corporations. And then we can raise the nominal rate, take some of that money back. That's a neutral trade, but it makes our tax code look a little bit more in line with the 15 percent target.\" But notably, they went only to 14 [percent], not to 15 [percent], as if almost to say, \"You're not the boss of us, we will do something slightly different than your target.\"\n\nBut effectively, the U.S. at 14 [percent] with its rules is still maybe a little bit worse, a little bit less taxpayer friendly, at least revenue-wise, than a 15 percent rate. So I don't think U.S. companies are getting away with a lot with the 14 [percent] instead of the 15 [percent].\n\nJonathan Curry: With this new suite of changes that we have, are there any obvious winners and losers here? I mean, you alluded to the Trump administration having a vision and putting its stamp on things. They've talked a lot about increasing domestic investment. Did these changes move the U.S. more towards that?\n\nAlan Cole: I think there are some changes that are intended to have a real impact that aren't just a little bit of lateral shuffling and creating a 14 percent rate rather than a lower 13 percent rate. There are some things that are a little bit more intended to be substantive. But even there, from an individual company's perspective, I think a lot of these things come out to be roughly a wash relative to the 2025 tax code. For example, the elimination of QBAI — the attempt to maneuver the system previously directed at intangibles towards a little bit more of a tangible and America First and export-focused tax system — that may not have that much of an impact on an overall taxpayer bottom line because, actually, the sort of company that has a lot of QBAI domestically also has a lot of it internationally. And one of those is a tax cut, and one of those is a tax hike, so they balance out for an individual taxpayer.\n\nBut overall, you want to be the sort of company that has a lot of capital expenses in the U.S. or research and development in the U.S. and then maybe exports a lot. Whether using your tangibles or intangibles, that probably comes out pretty well. The big thing that I see flagged as a likely downside from large corporate practitioners is a change to [section] 163(j) interest limitations. Effectively, international income doesn't count for that, and that means that those become much tougher on some firms.\n\nJonathan Curry: Yeah. I've certainly heard the same listening to a lot of webinars and hearing from different tax practitioners and what they're saying their eye is on and what's the big thing for their clients to look out for. [Section] 163(j), the foreign element of it definitely comes up quite a lot.\n\nSo you alluded to this earlier, the current-policy baseline. Republicans did get a little mischievous with their math this time around. They used the current policy as opposed to current law, which broke with a lot of precedent. Can you tell me: How did the math add up here on the international tax provisions? Did we come out roughly revenue neutral in terms of the changes that are the higher rates, but a broader base and so forth? Where did we land in terms of the numbers?\n\nAlan Cole: Well, the tax code that was enacted in 2017 under current-law baseline rules, there, in order to make the corporate income tax side of the TCJA permanent, they had to do a fair amount of surprise tax hikes at the very, very end of the budget window. And you can count from 2017 out to 2026. That's when those tax hikes showed up. In a few cases, they had them show up a little bit earlier so as to reduce the score of the TCJA within the budget window, but there was a suite of tax hikes.\n\nIn the international sphere, a lot of those tax hikes come directly in 2026, but they kind of went for current policy 2025. So what they managed to do as a result of the switch to current policy was effectively cancel out those last minute hikes on the international side and then make permanent the slightly lower, not quite revenue neutral, TCJA international side that wouldn't have passed Byrd rule muster in 2017 without those hikes. They canceled those hikes and made that permanent. So they did get some benefit if you're looking at it from the taxpayers' perspective, or they did create some revenue loss that probably would not have been possible under the current-law baseline.\n\nJonathan Curry: To talk about one of my favorite provisions that's actually no longer in law, section 899, the retaliatory tax, the revenge tax. I certainly had a lot of fun writing about this. It makes for a great headline, and it was such an interesting piece of policy that has kept evolving throughout the process.\n\nSection 899 had two elements, correct? There is one that was going to impose these higher, progressively higher withholding rates on corporations, individuals, countries that had what we deem the discriminatory or unfair tax, undertaxed profit rules, UTPRs, and income inclusion rules. And there was also an element that was going to target digital services taxes, which later in the Senate was only going to be happening through the so-called super BEAT that was going to supercharge the base erosion and antiabuse tax.\n\nWe did get a G7 deal at the end of this where they agreed that they were going to scrap their UTPRs and IRRs. They left aside, shelved for now, the question of DSTs. But in your view, how big of an impact does section 899 have on the international discussion? Do you think that was key to the U.S. getting this agreement with the G7? Or was that just a little sideline, sideshow?\n\nG7 summit or meeting concept. Row from flags of members of G7 group of seven and list of countries, 3d illustration\n\nAlan Cole: I think [section] 899 was a very dangerous gamble, and I think it paid off. I had concerns about it while it was still in the bill. It didn't make it into the final law, and that was actually the outcome that [section] 899's architects kind of were hoping for, I think. It would have been pretty ugly if it had happened, but it was a threat they didn't want to have to go through on. So yeah, one of the biggest aspects of the OBBB international is effectively the thing that wasn't in the bill.\n\nWe talked about, I'd say three categories of things that are in the bill. There's the Trump priority type stuff with the QBAI; there's the bug fixes; and there's the moving towards the 15 percent target by doing some lateral trades. But the OBBB also had [section] 899, the retaliatory provision, kind of our doomsday device, our mutually assured destruction thing. And it was supposed to target two foreign taxes, and the G7 agreed to get rid of one. And we said, \"OK, good enough.\" And we put it down. And I think one reason that it worked well was there's broad support for combating UTPR and DST much beyond the Trump administration.\n\nOne characterization you could make of the Trump administration is it starts a lot of arguments with foreign countries. And in some cases, those arguments are idiosyncratic to the Trump administration specifically. For example, arguing that Canada is not doing enough to combat fentanyl crossing the northern border of the U.S., that was not on most people's radar. That seems like a fight idiosyncratic to the Trump administration. And maybe even fighting over bilateral trade deficits, that's pretty idiosyncratic to the Trump administration.\n\nBut within the U.S. business community, within the U.S. Congress, there's actually quite a lot of opposition to UTPR and to DST. The former because it usurps Congress's authority. It's a little bit like, \"Oh, the Treasury went out and talked to a bunch of people over the Atlantic. Now Congress has to rewrite the U.S. tax code in a bunch of ways. Some of them kind of arbitrary, but don't seem to have much rationale.\" That wasn't going to fly, if only because it was a usurpation of Congress's authority. And practitioners also didn't like it because it would be a lot more work and it would turn out to not actually have much of an impact on U.S. companies' taxes.\n\nDSTs, meanwhile, are basically just tariffs in disguise. They're a way for foreign countries to effectively tariff the large number of U.S. tech companies that have done really well globally. Foreign governments have seen those as big bags of money, like pinatas that they can whack at and the money will fall out and they get a treat. And there's no support in the U.S. for letting these things stand.\n\nAnd so in some cases, when the Trump administration is saying something, there's a little bit of a feeling, \"Well, can we wait this out? Might they get distracted?\" For example, they don't seem to be talking much about buying Greenland anymore. That was a big thing for a few months, and then they just moved on. And also, there's the reality that there will be a new president and maybe that president is not going to have the same idiosyncratic Trump priorities.\n\nBut I think [section] 899 being there in legislative text made a lot of people realize that not only is Congress behind the president on DSTs and UTPR, but maybe even most of the rest of the United States is as well. And so there's no way of waiting out the president and maybe making inroads with opposition or with people within his party who don't agree with all of his stuff. No, this was unanimous among Republicans, and I think probably even some Democrats really would actively want these things to go away, and few would make a big priority of arguing for them.\n\nSo I think [section] 899 showed Congress's stacking order of priorities, and showed the American business community's stacking order of priorities. It even went so far as to say, \"These are the specific offenses that we want [section] 899 to apply to. We're going to call out them by name, and we're also going to come up with a list of things that aren't offenses and [section] 899 can't be used for.\" They narrowly cabin the retaliation to be just these two things.\n\nSo I think if you're a foreign government and you're not sure what to do with the more hostile or bellicose U.S. trade posture — well, the things that have broad opposition in the U.S., you probably are more likely to make a concession on those than on things that are less workable. And especially with respect to the UTPR, that's something that isn't even in effect yet. So it's easier to not do something that you haven't even started doing yet. It's easier to flake out on a plan that you haven't yet brought to completion than to stop doing things the way you were already doing them for a long time. So all of those reasons, I think, meant that the UTPR was the easiest domino to fall.\n\nI don't think that the Trump administration is going to get all of its priorities. For example, the stuff about value added taxes being an unfair barrier to trade. Well, I don't think that Europe is going to reorder its entire tax system. Value added taxes in Europe probably raise something on the order of €4 [trillion] or 5 trillion per year, if you add all of the countries together.\n\nJonathan Curry: Sounds significant.\n\nAlan Cole: Yeah, something like that.\n\nJonathan Curry: That's not a small chip in a poker game here. No.\n\nAlan Cole: Yeah, yeah. They're not going to just come up with something new within the next three years in order to appease one U.S. president who has idiosyncratically said that VATs are an unfair barrier to trade.\n\nJonathan Curry: Well, Alan, so looking ahead, is there any unfinished business on the international tax front? Or do you think that this round of changes will satisfy lawmakers, policymakers for the next, I don't know, couple of years, three, five years, 10 years before they decide to give things another look?\n\nAlan Cole: The biggest unfinished business is in the area of how the U.S. international income tax system will coexist with pillar 2. The G7 deal didn't say that pillar 2 is fully going away, although that's still an outside possibility. More likely, Europe continues to implement its version of CFC rules, its effective equivalent of GILTI or now NCTI. That's all likely to still happen.\n\nThe U.S. wants to be independent of pillar 2, not have pillar 2 go over and touch things that have previously been touched by the U.S. tax code. In many cases, that's relatively simple. You can think of companies that are American and companies that are German, and obviously at the very top level, you'll have one or the other of the two systems.\n\nBut it starts to get more complicated when you have nested acquisitions. That's something you see in, for example, the pharmaceutical industry a lot because there are both tax and operations reasons that pharmaceutical companies have long chains of acquisitions. Often there's one type of company that does research, and then another one says, \"This is good research. We're going to buy your company and figure out how to distribute the drug everywhere.\" Once you get those nested things, it's much, much harder to figure out exactly how the income inclusion rule, like the European international rules, would coexist or sit side by side with NCTI without colliding with it. So that's an area of unfinished business. Digital service taxes, also unfinished business. That's effectively kind of the European hidden tariff inside of corporate income tax policy.\n\nOn our side, BEAT I think is actually unfair in some of the same ways that digital services taxes are. And then the big elephant in the room is all of the other trade policy stuff often done under the economic emergency rationale, which is actually being challenged in U.S. courts, and potentially just normal section 301 retaliatory tariffs too. All of those things create a chaotic international negotiation environment.\n\nBut overall, the U.S. international tax system would hold up pretty well. My one question is, in the change to make it less targeted at intangible investment, does that end up having an effect on how, say, intangible-heavy firms look at the U.S. tax system?\n\nJonathan Curry: Yeah, that'll be something to watch. All right. Well, Alan, thank you so much for taking time to chat with us today. I appreciate it.\n\nAlan Cole: Absolutely. Thank you for having me.\n\nEditorial StandardsReprints & Permissions","summary":"In this episode of Tax Notes Talk, Alan Cole of the Tax Foundation discusses the international tax provisions in the One Big Beautiful Bill Act and what may be next for negotiations on a global tax framework.","url":"https://www.forbes.com/sites/taxnotes/2025/08/05/moving-forward-international-tax-after-the-obbba/","image":"https://imageio.forbes.com/specials-images/imageserve/68922d60b6f519cfecd2a9d9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-08-05 16:19:19","author":"Contributor,Tax Notes Staff,Tax Notes. This","authors":["Contributor","Tax Notes Staff","Tax Notes. This"],"language":"en","category":"politics","source_country":"US","sentiment":0.13},{"id":348443982,"title":"Trump's spin on economy spirals during unhinged interview","text":"Faced with recent economic data showing that his tariff policies are hurting American jobs, President Donald Trump has been in a full-court press, trying to promote a conspiracy theory to explain away his failure. Trump took the conspiracy to another level on Tuesday, appearing on CNBC to share nonsense with a business-oriented audience.\n\nAsked by conservative CNBC anchor Joe Kernen to justify his claim that the most recent jobs report had been “rigged,” Trump falsely claimed the system used to count jobs is “highly political.”\n\nTrump incorrectly argued that revisions to unemployment reports that were released under former President Joe Biden proved that the last administration had rigged jobs numbers, and that a similar manipulation had occurred in the recent report. This is false. Jobs numbers have always been revised, and even William Beach, Trump’s former commissioner of the Bureau of Labor Statistics, has spoken out against his promotion of this conspiracy.\n\nAs Kernen mildly attempted to debunk his theorizing, Trump stuck to his guns.\n\n“It's a highly political situation. It's totally rigged. Smart people know it. People with common sense know it. And a lot of people like to keep their head under the covers and just not believe it,” Trump said.\n\nTrump’s CNBC appearance comes a day after he ranted online about Democratic Sen. Elizabeth Warren of Massachusetts appearing on the network. In her appearance, Warren called out Trump for his weak economic performance, noting his tariffs have hiked the costs of many household staples, despite his promise during last year’s campaign cycle to cut costs if elected.\n\nTrump’s decision to call in to the same network was a clear attempt to rebut Warren, whose claims are backed by reality—unlike Trump’s.\n\nWhen he hasn’t been pushing conspiracies about the jobs report, Trump has been promising to increase tariffs on prescription drug imports, described Swiss Confederation President Karin Keller-Sutter as “the woman,” whined that she wouldn’t do as he told her, and made a racist argument about immigrants.\n\nReferring to undocumented farm workers, Trump said, “People that live in the inner city are not doing that work. … They've tried, we've tried, everybody tries. They don't do it.”\n\n“These people do it naturally. Naturally. I said, ‘What happens if they get it?’ to a farmer the other day—‘What happens if they get a bad back?’ He said, ‘They don't get a bad back, sir, because if they get a bad back, they die,’” he added.\n\nTrump, of course, has a long history of racism. And on top of that, his economic policies are failing, in the same pattern that both experts and leaders like former Vice President Kamala Harris said they would. Instead of changing course, Trump is promoting yet another conspiracy theory and pushing it to every media venue willing to listen.","summary":"Faced with recent economic data showing that his tariff policies are hurting American jobs, President Donald Trump has been in a full-court press, trying to promote a conspiracy theory to explain away his failure. Trump took the conspiracy to another level on Tuesday, appearing on CNBC to share nonsense with a business-oriented audience.\n\n\n\nAsked by conservative CNBC anchor Joe Kernen to justify his claim that the most recent jobs report had been “rigged,” Trump falsely claimed the system used to count jobs is “highly political.”\n\n\n\nTrump incorrectly argued that revisions to unemployment reports that were released under former President Joe Biden proved that the last administration had rigged jobs numbers, and that a similar manipulation had occurred in the recent report. This is false. Jobs numbers have always been revised, and even William Beach, Trump’s former commissioner of the Bureau of Labor Statistics, has spoken out against his promotion of this conspiracy.\n\n\n\n\nx\n\n\nx\nYouTube Video\n\n\nAs Kernen mildly ","url":"https://www.dailykos.com/story/2025/8/5/2336894/-Trump-s-spin-on-economy-spirals-during-unhinged-interview?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1464144/story_image/AP25216075567636.jpg?1754344318","video":null,"publish_date":"2025-08-05 16:00:17","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","source_country":"US","sentiment":-0.721},{"id":348453844,"title":"Texas Republicans: It’s About Power, Yes—but Also Their Radical Agenda","text":"The Texas gerrymandering scheme combines two elements of the modern Republican Party that are eroding American democracy: personalist, autocratic leadership and a pattern of gaining and wielding power with little regard for the views of the broader public. \n\nTexas Republicans, already holding 25 of the state’s 38 U.S. House seats, weren’t really looking to further gerrymander the state. (Kamala Harris won about 42 percent of the vote in Texas, suggesting truly fair maps would have Democrats at around 16 seats, not 13.) But then came orders from the boss. Aides to Donald Trump demanded Texas redraw its districts, believing that was the surest way to prevent Republicans from losing control of the U.S. House in next year’s midterm elections. And this message was not just delivered privately. An unnamed Trump aide told The New York Times in June that “the president would pay close attention to those in his party who help or hurt” this effort to win the midterms by any means necessary. \n\nA special session of the legislature was quickly called by Abbott. Many Texas Democratic legislators have fled the state, robbing Republicans of the quorum they need to pass this provision. But I suspect it will eventually be approved. Republicans would be favored to win an additional five seats (30 in total) under the new maps. Those five could really matter when you remember that Republicans won 220 seats and Democrats 215 in last year’s elections.","summary":"Even if Republicans are driving gerrymandering today, Democrats certainly did it in the past. Redistricting in the middle of a decade, as opposed to waiting for the next U.S. census, isn’t totally unprecedented either. It turns out a precedent for today’s Texas Republicans was, well, Texas Republicans, who rigged maps in their favor in 2003 to win more U.S. House seats the next year. \n\nBut it is still alarming that Governor Greg Abbott and the state’s GOP-controlled legislature are attempting to redraw congressional districts ahead of next year’s midterms and threatening to expel from the legislature Democratic lawmakers who have fled the state to stall this redistricting. \n\nThe Texas gerrymandering scheme combines two elements of the modern Republican Party that are eroding American democracy: personalist, autocratic leadership and a pattern of gaining and wielding power with little regard for the views of the broader public. \n\nTexas Republicans, already holding 25 of the state’s 38 U.S. House seats, weren’t","url":"https://newrepublic.com/article/198821/texas-republicans-gerrymandering-radical-agenda","image":"https://images.newrepublic.com/fcf266b90384e0f4f8ff6146c2c339c8e04a9fdc.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-08-05 15:36:01","author":"Perry Bacon","authors":["Perry Bacon"],"language":"en","category":"politics","source_country":"lr","sentiment":-0.242},{"id":348391026,"title":"Stephen A. Smith hurls pointed 'housewife' insult at Michelle Obama after she mocked ESPN and Trump voters","text":"MORE: NBA icon tops DailyMail+ Power List of America's sports analysts \n\nBy DANIEL MATTHEWS, US ASSISTANT SPORTS EDITOR\n\nPublished: 15:17 BST, 5 August 2025 | Updated: 16:24 BST, 5 August 2025\n\nStephen A. Smith has pointedly told Michelle Obama that he will 'never be a housewife' after the former First Lady compared ESPN and its host to the 'Real Housewives of Atlanta.' \n\nSmith is the star of 'First Take' and recently signed a $100million contract with ESPN. He has even teased a possible run for president. But Smith found himself in the firing line last week, when Obama compared him to a reality TV star.\n\nThe ESPN star has since blasted Obama over 'offensive' comments she made about Donald Trump voters, telling her: 'When you were campaigning on behalf of the former Vice President Kamala Harris, you said a vote for Trump was a vote against you and a vote against y’all as women. \n\n'I want to say for the record - I took major offense to that.'\n\nNow, during an interview with Fox's Sean Hannity on Monday night, Smith suggested that the former First Lady's 'housewife' remarks prove that she leaves sports 'to her husband', Barack Obama.\n\nHe also added: 'You can say Stephen A. Smith is lot of things and will be a lot of things. The one thing you can never say about me is that I'm going to be a housewife.'\n\nStephen A. Smith hit back at Michelle Obama after she said ESPN is no different to reality TV\n\n'If I listen to ESPN for an hour, it’s like watching the \"Real Housewives of Atlanta,\"' she said \n\n'She was comparing reality TV to sports TV from the standpoint of watching us go at one another,' Smith began.\n\n'Well first of all, there's no relationship because these are some of the greatest athletes on the planet earth that play professional sports - that's who we're talking about as opposed to reality TV stars that can barely act. \n\n'No 2, when you look at what she's talking about, you also have to take into consideration that she doesn't really pay much attention to sports - evidently she leaves that to her husband.\n\n'And when she talked about 'First Take' she talked us arguing with one another, hating on one another. We have a lot of love for one another on \"First Take\". \n\n'We get along just fine, we have a blast - laughing, joking, having a ball, yelling at each other about sports sometimes. We're monotone in our delivery but we have a lot of fun on \"First Take\". That's why we've been No 1 for 13 consecutive years - and counting.\n\n'No 3, let me say this to the other people that were on the table with her. You can say Stephen A. Smith is lot of things and will be a lot of things. The one thing you can never say about me is that I'm going to be a housewife. There's no confusion there. Zero.'\n\nObama sparked the war of words with comments she made on a recent episode of her 'IMO' podcast.\n\n'If I listen to ESPN for an hour, it’s like watching the \"Real Housewives of Atlanta,\"' the former First Lady said. 'It’s the same drama, and they’re yelling at each other, and they don’t get along, you know? I mean, Stephen A. Smith, he’s just like every other talk show host.' \n\nObama sparked the backlash from Smith with comments she made on her 'IMO' podcast\n\nSmith slammed the former First Lady for her rhetoric about those who vote for Donald Trump \n\nIt was then jokingly put to Obama that Smith would be a 'great Real Housewife'. The popular reality franchise details the lives of well-off women from different regions.\n\nAfter her comments went viral, Obama was taken to task by Smith on his YouTube show. The ESPN star urged her to invite more 'dissenting opinions' on 'IMO' and said he was still 'salty' over Obama's comments on Trump.\n\n'Michelle Obama, I want to take this opportunity to remind you that while you are revered by me personally, and I truly, truly mean that with the greatest sincerity, I'm still a bit salty at you,' Smith said. \n\n'I think to this day that is the only thing that I didn’t like that you said, I didn’t appreciate it. Because there’s so many things that go into deciding where your vote is going to go.\n\n'For some people, it’s all about the economy. For others, it’s all about national security. For some people, it is immigration. For some people, it’s safety in the streets of America. Long before they think about pro-choice or pro-life.'\n\nDailyMail+ Power List of TV sports stars reveals two pundits paid $500M aren't worth the paychecks\n\nSmith told Hannity that he also took 'umbrage' with previous comments from Barack Obama, when he 'spoke to young Black men in Pittsburgh and basically alluded to misogyny if folks didn't vote for Kamala Harris. I was highly offended by that.\n\n'For a long time I think it's been a complete misnomer that Black men don't revere Black women... we have no problem supporting a woman if we agree with them, I'm talking about politically.' \n\nHe added: 'If Kamala Harris is somebody that most people thought could handle the job of being the president of the United States, she would have been the one to get 77-plus million votes, instead of Donald Trump.'\n\nObamaMichelle ObamaSteve Smith\n\nShare or comment on this article:\nStephen A. Smith hurls pointed 'housewife' insult at Michelle Obama after she mocked ESPN and Trump voters\n\nAdd comment","summary":"Smith is the star of 'First Take' and recently signed a $100million contract with ESPN. But Smith found himself in the firing line last week, when Obama compared him to a reality TV star.","url":"https://www.dailymail.co.uk/sport/othersports/article-14972559/Stephen-Smith-housewife-insult-Michelle-Obama-Donald-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/08/05/15/100939977-0-image-m-12_1754403128830.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/03/5652975194483700697/1024x576_MP4_5652975194483700697.mp4","publish_date":"2025-08-05 15:24:57","author":"Daniel Matthews,Editor","authors":["Daniel Matthews","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.092},{"id":348399056,"title":"Aug. 5 editorial cartoons","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\nPolitical Cartoons\n\nAug. 5 editorial cartoons\n\nTuesday's political cartoons include an unflattering jobs report for Donald Trump, Democratic party problems, and the redistricting race\n\nNewsletter sign up\n\nThe Week US \n\n5 August 2025\n\n(Image credit: Dana Summers / Copyright 2025 Tribune Content Agency)\n\n(Image credit: Dave Whamond / Copyright 2025 Cagle Cartoons, Inc.)\n\n(Image credit: Guy Parsons / Copyright 2025 Cagle Cartoons, Inc.)\n\n(Image credit: Joe Heller / Copyright 2025 Hellertoon.com)\n\n(Image credit: Michael Ramirez / Copyright 2025 Creators Syndicate)\n\n(Image credit: Nick Anderson / Copyright 2025 Tribune Content Agency)\n\n(Image credit: Clay Jones / Copyright 2025 Claytoonz)\n\n(Image credit: Bill Bramhall / Copyright 2025 Tribune Content Agency)\n\n(Image credit: John Darkow / Copyright 2025 Cagle Cartoons, Inc.)\n\n(Image credit: Drew Sheneman / Copyright 2025 Tribune Content Agency)\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nExplore More\n\nDonald Trump\n\nKamala Harris\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nThe Week US\n\nSocial Links Navigation\n\nWhy is the world so divided over plastics?\n\nToday's Big Question\nUN negotiations on first global plastic treaty are at stake, as fossil fuel companies, petrostates and plastic industry work to resist a legal cap on production\n\nTemple Mount: the politics of Judaism's holiest site\n\nThe Explainer\nLatest provocation at religious site with a history of 'perpetual friction' risks violence erupting again\n\nSsh! Secret gardens to visit this summer\n\nThe Week Recommends \nThese leafy havens are the perfect place to escape the crowds\n\nYou might also like\n\nAug. 4 editorial cartoons\n\nMonday's political cartoons include Bigfoot spotted near a rural hospital, and Donald Trump's failure to escape the Jeffrey Epstein scandal\n\nHot-tempered | July 27 editorial cartoons\n\nToday's political cartoons include tough stains, heatwaves, and vote-losing behaviour\n\n5 attention-grabbing cartoons about Trump's distraction tactics\n\nArtists take on a musical diversion, an NFL team by any other name, and more\n\nThe audacity to grope | July 26 editorial cartoons\n\nSaturday's political cartoons include Joe Biden's memoir, PBS funding, and an Obama-Trump comparison\n\nLipstick on a $4 trillion dollar pig | July 25 editorial cartoons\n\nFriday's political cartoons include MAGA talk show hosts, a Japanese trade deal, and military medals\n\nPresident Trump stops by Area 51 | July 24 editorial cartoons\n\nThursday's political cartoons include an abrupt summer recess, the return of Hillary's emails, and an ominous climate announcement\n\nDonald Trump doubles down on distraction | July 23 editorial cartoons\n\nWednesday's political cartoons include trade war on the high seas, the Russian enigma, and Congress chickening out over Epstein\n\nJuly 22 editorial cartoons\n\nTuesday's political cartoons include Donald Trump's birthday wishes for Jeffrey Epstein, Tulsi Gabbard, and renaming the Washington Commanders\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"Tuesday's political cartoons include an unflattering jobs report, Democrat weakness, and the minimum wage","url":"https://theweek.com/cartoons/aug-5-2025-editorial-cartoons","image":"https://cdn.mos.cms.futurecdn.net/PLRuYsTqD36e7pXo7bgtJC.jpg","video":null,"publish_date":"2025-08-05 15:00:00","author":"The Week US","authors":["The Week US"],"language":"en","source_country":"US","sentiment":0.297},{"id":348373270,"title":"Megyn Kelly mocks Kamala Harris’ recent Stephen Colbert interview, compares her to Elle Woods from ‘Legally Blonde’ ","text":"Conservative commentator Megyn Kelly recently criticized former Vice President Kamala Harris’ recent appearance on The Late Show with Stephen Colbert, even making an unexpected comparison to Legally Blonde’s Elle Woods. On August 1, 2025, Kamala Harris sat down with Stephen Colbert to discuss her upcoming book 107 Days, which details her brief 2024 presidential campaign. During the August 5 episode of The Megyn Kelly Show, Kelly and Michael Knowles analyzed Harris’ interview, criticizing her \"weirdness.\" Megyn focused on Harris's general temperament during the interview, pointing out her \"weird, drunk-sounding giggling.\"\"It's all classic Kamala. The weird drunk-sounding giggling at absolutely nothing...This is what I find interesting about her is how empty she is,\" Kelly said. \"The only time she really gets animated is when she talks about race, abortion, or herself.\"Kelly then played a clip from Legally Blonde featuring Reese Witherspoon's character, Elle Woods, exclaiming, \"Me!\" Kelly compared Kamala Harris to Elle Woods, saying,\"Reminds me of this gal from Legally Blonde. That's Kamala.\"Megyn Kelly and Michael Knowles' broader critique of Kamala Harris' appearance on Stephen Colbert's showDuring her interview on The Late Show with Stephen Colbert, Kamala Harris shared a snippet from her book 107 Days, where her husband Doug Emhoff apparently forgot her birthday. She then urged Colbert and the audience to read the book to find out what happens.Megyn Kelly criticized this segment, saying,\"Her weirdness is somewhat amusing, but she and her substantive comments are not...'Oh, we've got to read the book to find out if he didn't get her a present,' who gives a flying fig? She's off socially in like a very weird way.Megyn Kelly's guest, Michael Knowles, also agreed with Kelly's criticism, calling Kamala Harris' upcoming book a \"cheap cash grab.\"\"This was a cheap cash grab, and she got whatever the advance was, and now she's got to go through the charade of selling the books,\" Knowles said. \"Going on the Colbert show is just as good as going on any show. She could go on the top-rated show in the country. No one's going to buy this book.\"Kelly also took issue with Harris’s anecdote about her choice of AirPods, where the former VP claimed her experience on the Senate Intelligence Committee taught her to use wired earbuds for security. View this post on Instagram Instagram PostKelly’s critique wasn’t limited to Harris; she also criticized Stephen Colbert, who announced on July 17, 2025, that his show would end in May 2026. During a conversation with Maureen Callahan on July 19, Kelly called Colbert a \"crybaby\" for his reactions to his show ending, saying,\"Is this how it’s going to be for the next year? Watching this crybaby try to play the victim that his show got cancelled? Grow up. It’s called television, you toddler.”Kamala Harris's memoir, 107 Days, will be released on September 23, 2025.","summary":"Conservative commentator Megyn Kelly recently criticized former Vice President Kamala Harris’ recent appearance on The Late Show with Stephen Colbert, even making an unexpected comparison to Legally B","url":"https://www.sportskeeda.com/us/podcasts/news-megyn-kelly-mocks-kamala-harris-recent-stephen-colbert-interview-compares-elle-woods-legally-blonde","image":"https://staticg.sportskeeda.com/editor/2025/08/7460a-17544022717910-1920.jpg","video":null,"publish_date":"2025-08-05 14:50:41","author":"Diana George","authors":["Diana George"],"language":"en","source_country":"in","sentiment":0.03},{"id":348381980,"title":"Rupert Murdoch is unleashing his racist brand of sleaze on California","text":"News Corp, which is owned by right-wing media mogul Rupert Murdoch, announced on Monday it plans to launch a California tabloid similar to its New York Post. With the announcement, it is highly likely that the Post and Murdoch intend to bring the racism, misinformation, and just overall shoddy journalism that have been a highlight of the New York paper for decades to the West Coast.\n\nThe Post’s California launch is an attempt to bring right-wing media influence to a solidly Democratic state which has been a stalwart power base for the Democratic Party. Murdoch has owned the Post since 1976, but despite a steady stream of right-wing propaganda and advocacy, both the state and city of New York have remained solidly blue, consistently backing Democratic candidates including former Vice President Kamala Harris in 2024.\n\nIn fact, the Post’s attempts to smear Democratic mayoral candidate Zohran Mamdani with racist attacks have been unsuccessful so far, as he cruised to victory in the June primary and seems well positioned to win the general election in the fall.\n\nIn addition to the Post, Murdoch is most notable for owning Fox News Channel, which has for 28 years been a leading source of right-wing propaganda, racism, misogyny, fake news, and attacks on liberals and Democrats. In 2023, Fox was forced to pay out nearly $800 million in a settlement with Dominion Voting Systems for promoting pro-Trump lies in its coverage of Donald Trump’s 2020 election loss to former President Joe Biden.\n\nRelated | Vance secretly meets with Fox News owners amid network's LA protest lies\n\nMurdoch owns a network of influential right-wing newspapers throughout the world, including in his native Australia and in the United Kingdom. His U.K. papers were involved in an embarrassing scandal where journalists in Murdoch’s employ at the News of the World hacked into a murdered teenager’s voicemails, which they then used for salacious tabloid stories that interfered in the police investigation into the case.\n\nMurdoch’s papers have paid out settlements to the teenager’s parents as well as to Prince Harry for hacking into his phone.\n\nDomestically, the New York Post works in concert with Fox News to push conspiratorial and made-up right-wing stories meant to attack and undermine the Democratic Party, liberals, and the left in general. The Post has published disgustingly racist attacks, like the 2009 cartoon that portrayed then-President Barack Obama as a chimpanzee shot by police.\n\nWhen the Post isn’t operating as an arm of the Republican Party or as a mouthpiece for the conservative movement, it publishes categorically false reports masquerading as journalism. After the 2013 terrorist attack on the Boston Marathon, the Post printed a picture of two men who it identified as “Bag Men” and suspects in the attack. The men had nothing to do with the incident and later settled a defamation lawsuit they brought against the paper.\n\nCalifornia already has a major news outlet in the grip of right-wing opinion. Patrick Soon-Shiong, owner of the Los Angeles Times, is pushing the paper to the right. It began with his decision in 2024 to pull an editorial endorsing Vice President Kamala Harris, and earlier this year he hired MAGA operatives to pack the editorial pages with pro-Trump opinions.\n\nMurdoch has an international reputation for unethical, bigoted media. Now he wants to bring his brand of business into the California sunshine.","summary":"News Corp, which is owned by right-wing media mogul Rupert Murdoch, announced on Monday it plans to launch a California tabloid similar to its New York Post. With the announcement, it is highly likely that the Post and Murdoch intend to bring the racism, misinformation, and just overall shoddy journalism that have been a highlight of the New York paper for decades to the West Coast.\n\n\n\nThe Post’s California launch is an attempt to bring right-wing media influence to a solidly Democratic state which has been a stalwart power base for the Democratic Party. Murdoch has owned the Post since 1976, but despite a steady stream of right-wing propaganda and advocacy, both the state and city of New York have remained solidly blue, consistently backing Democratic candidates including former Vice President Kamala Harris in 2024.\n\n\n\nIn fact, the Post’s attempts to smear Democratic mayoral candidate Zohran Mamdani with racist attacks have been unsuccessful so far, as he cruised to victory in the June primary and seems well","url":"https://www.dailykos.com/story/2025/8/5/2336806/-Rupert-Murdoch-is-unleashing-his-racist-brand-of-sleaze-on-California?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1464170/story_image/AP18017766482140.jpg?1754348076","video":null,"publish_date":"2025-08-05 14:30:26","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","source_country":"US","sentiment":-0.213},{"id":348370996,"title":"The Most Powerful People in Business list doesn’t include female founders—yet","text":"Of 105 people on the Most Powerful People list (there are some ties), 19 are women. They’re woven into the ranking in the same order they appear on our 2025 Most Powerful Women list, published in May. The top woman on the MPW list, GM chief Mary Barra, comes in at No. 10 on the Most Powerful People list. She’s preceded by today’s business titans—Jamie Dimon, Sam Altman, Elon Musk, Mark Zuckerberg, Satya Nadella, and, at No. 1 this year, Nvidia’s Jensen Huang. \n\nWhile Silicon Valley founders like Zuckerberg and Altman appear high on the ranking, the top women in business are mostly career executives. (After Barra, there’s Accenture’s Julie Sweet, Citi’s Jane Fraser, and AMD’s Lisa Su.) The only female founder who makes the MPP list is Anthropic’s Daniela Amodei, who appears alongside her brother and co-founder Dario Amodei. \n\nThe female founders like Mira Murati, Fei-Fei Li, and Canva’s Melanie Perkins who have become mainstays on the MPW list are poised to build generational companies like OpenAI and Meta—but are still on the way there. A few years from now, perhaps they’ll dominate the top of the ranking, too.\n\nEmma Hinchliffeemma.hinchliffe@fortune.com\n\nThe Most Powerful Women Daily newsletter is Fortune’s daily briefing for and about the women leading the business world. Subscribe here.\n\nALSO IN THE HEADLINES\n\n- Side effect. The turmoil at the Bureau of Labor Statistics could threaten the ability to close the gender pay gap in the U.S., experts from Equal Rights Advocates point out. Without reliable data collection, it's difficult to address the issue. \n\n- Money moves. After my colleagues broke the news earlier this year of the Gates Foundation's plans to spend $200 billion and then shut its doors, we're learning more about how that money will be spent. The foundation is committing $2.5 billion through 2030 to women's health. That includes everything from efforts to decrease maternal mortality globally to developing new vaccines for infections that disproportionately affect women. Plus, the foundation's Dr. Anita Zaidi wrote an op-ed about the move for Fortune. STAT News\n\n- Martha's latest. Martha Stewart has launched many, many brands over her career. For the first time, at 84, the U.S.'s first female self-made billionaire now has a skincare brand. Elm Biosciences will launch in September. Wall Street Journal\n\n- Never-ending. Well, Trump has waded into the Sydney Sweeney discourse. After the actress's ad for American Eagle was criticized for a eugenics vibe with a play on \"jeans/genes\" the president said she has \"the HOTTEST ad out there.\" He also took the opportunity for a dig at Taylor Swift (who endorsed Kamala Harris in the 2024 election). \"She was booed out of the Super Bowl and became, NO LONGER HOT,\" he wrote on Truth Social. Politico\n\nMOVERS AND SHAKERS\n\nWondery CEO Jen Sargent will leave the Amazon-owned podcast studio as the company reorganizes its audio business. \n\nON MY RADAR\n\nThe mental load trap Fast Company\n\nChappell Roan on The Subway, writing through heartbreak, and loving her job again Vogue\n\nNancy Mace launches campaign for South Carolina governor CBS News\n\nPARTING WORDS\n\n\"I feel like I understand myself more every single day.\"\n\n— Actress Margaret Qualley, on the cover of Cosmopolitan","summary":"Men have built the world's most dominant companies. Women are still on the way there.","url":"https://fortune.com/2025/08/05/fortune-most-powerful-people-in-business-2025-women-female-founders/","image":"https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2223572609.jpg","video":null,"publish_date":"2025-08-05 14:04:31","author":"Emma Hinchliffe","authors":["Emma Hinchliffe"],"language":"en","source_country":"US","sentiment":0.456},{"id":348372306,"title":"Texas and California joust for political advantage, with Trump's agenda and House majority in play (World)","text":"The nation's two most populous states — California and Texas — grappled for political advantage in advance of 2026 elections that could reorder the balance of power in Washington and threaten President Donald Trump's agenda at the midpoint of his second term.\n\nIn Texas, Democrats on Monday prevented their state’s House of Representatives from moving forward, at least for now, with a redrawn congressional map sought by Trump to shore up Republicans’ 2026 midterm prospects as his political standing falters.\n\nIn California, Democrats encouraged by Gov. Gavin Newsom are considering new political maps that could slash five Republican-held House seats in the liberal-leaning state while bolstering Democratic incumbents in other battleground districts. The move is intended to undercut any GOP gains in Texas, potentially swinging House control and giving Democrats a counterweight to Trump on Capitol Hill.\n\nA draft plan aims to boost the Democratic margin in California to 48 of 52 congressional seats, according to a source familiar with the plan who was not authorized to discuss it publicly. That’s up from the 43 seats the party now holds. It would need approval from lawmakers and voters, who may be skeptical to give it after handing redistricting power to an independent commission years ago.\n\nThe rivalry puts a spotlight on two states that for years have dueled over jobs, innovation, prestige — even sports — with the backdrop of clashing political visions — one progressive, one conservative.\n\nA standoff in Texas after Democrats leave the state\n\nAfter dozens of Democrats left Texas, the Republican-dominated House was unable to establish the quorum of lawmakers required to do business. Republican Gov. Greg Abbott has made threats about removing members who are absent from their seats. Democrats counter that Abbott is using “smoke and mirrors” to assert legal authority he does not have.\n\nThe House quickly issued civil arrest warrants for absent Democrats and Abbott ordered state troopers to help find and arrest them, but lawmakers physically outside Texas are beyond the jurisdiction of state authorities.\n\n“If you continue to go down this road, there will be consequences,\" House Speaker Rep. Dustin Burrows said from the chamber floor, later telling reporters that includes fines.\n\nDemocrats' revolt and Abbott's threats intensified a fight over congressional maps that began in Texas but now includes Democratic governors who have pitched redrawing their district maps in retaliation — even if their options are limited. The dispute also reflects Trump’s aggressive view of presidential power and his grip on the Republican Party nationally, while testing the long-standing balance of powers between the federal government and individual states.\n\nThe impasse centers on Trump’s effort to get five more GOP-leaning congressional seats in Texas, at Democrats' expense, before the midterms. That would bolster his party's chances of preserving its fragile U.S. House majority, something Republicans were unable to do in the 2018 midterms during Trump's first presidency. Republicans currently hold 25 of Texas' 38 seats. That's nearly a 2-to-1 advantage and already a wider partisan gap than the 2024 presidential results: Trump won 56.1% of Texas ballots, while Democrat Kamala Harris received 42.5%.\n\nThe California pushback: A move to undercut GOP House members\n\nAccording to the tentative California proposal, districts now held by Republican Reps. Ken Calvert, Darrell Issa, Kevin Kiley, David Valadao and Doug LaMalfa would see right-leaning voters shaved and Democratic voters boosted in a shift that would make it likely a left-leaning candidate would prevail in each race.\n\nIn battleground districts held by Democratic Reps. Dave Min, Mike Levin and Derek Tran, the party’s edge would be boosted to strengthen their hold on the seats, the source said.\n\nDemocratic members of California’s congressional delegation were briefed on the new map on Monday, according to a person familiar with the meeting who requested anonymity to discuss private conversations.\n\nThe proposal is being circulated at the same time that Democratic Gov. Gavin Newsom has said he wants to advance partisan redistricting. He says he won’t move ahead if Texas pauses its efforts.\n\nNewsom said he’d call a special election for the first week of November. Voters would weigh a new congressional map drawn by the Democratic-controlled Legislature.\n\n“California will not sit by idly and watch this democracy waste away,” Newsom said Monday.\n\nMore than 1,800 miles (2,900 kilometers) from Austin, New York Gov. Kathy Hochul appeared with Texas Democrats and argued their cause is national.\n\n“We’re not going to tolerate our democracy being stolen in a modern-day stagecoach heist by a bunch of law-breaking cowboys,” Hochul said Monday. “If Republicans are willing to rewrite rules to give themselves an advantage, then they’re leaving us with no choice: We must do the same. You have to fight fire with fire.”\n\nStatus of the vote\n\nIn Texas, legislators who left the state declined to say how long they'll hold out.\n\n“We recognized when we got on the plane that we’re in this for the long haul,” said Rep. Trey Martinez Fischer while in Illinois.\n\nTexas House Democratic Caucus leader Gene Wu said members “will do whatever it takes” but added, “What that looks like, we don’t know.”\n\nLegislative walkouts often only delay passage of a bill, like in 2021, when many Democrats left Texas for 38 days to protest proposed voting restrictions. Once they returned, Republicans passed that measure.\n\nLawmakers cannot pass bills in the 150-member House without two-thirds of members present. Democrats hold 62 seats in the majority-Republican chamber, and at least 51 left the state, according to a Democratic aide.\n\nThe Texas Supreme Court held in 2021 that House leaders could “physically compel the attendance” of missing members, but no Democrats were forcibly brought back to the state after warrants were served. Republicans answered by adopting $500 daily fines for lawmakers who don't show.\n\nAbbott, meanwhile, continues to make unsubstantiated claims that some lawmakers have committed felonies by soliciting money to pay for potential fines for leaving Texas during the session.","summary":"The nation&#39;s two most populous states &mdash; California and Texas &mdash; grappled for political advantage in advance of 2026 elections that could reorder the balance of power in Washington and threaten President Donald Trump&#39;s agenda at the midpoint of his second term.\n\nIn Texas, Democra...","url":"https://www.castanet.net/news/World/565003/Texas-and-California-joust-for-political-advantage-with-Trump-s-agenda-and-House-majority-in-play","image":"https://www.castanet.net/content/cp/2025/8/32787290fbacb3133272caf029e3efa72c5c7762db3418565f8c711ad4eb11be.jpg","video":null,"publish_date":"2025-08-05 13:50:00","author":"Democratic Reps. Dave","authors":["Democratic Reps. Dave"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.314},{"id":348467496,"title":"A Black, queer Jesus 'sings her face off,' and L.A. cheers","text":"They called her revelatory, even legendary. They marveled at her voice and her power. The harshest critics were gentle, only wondering if the star of “Jesus Christ Superstar” could have hit an even higher high note in the show’s most gripping moment. It felt like Cynthia Erivo owned Los Angeles last weekend, her groundbreaking Jesus jousting with Adam Lambert’s Judas and an all-star cast to sell out the 17,500-seat Hollywood Bowl for three straight nights. It felt like they could have sold out another 30. I went to Friday’s opening night with my wife, who sang along with the show’s soaring anthems, just as she has since she got the album in the 1970s. When they weren’t whooping and shouting “brava,” many in the euphoric crowd swayed along, hands held high in praise. The show was also so-L.A. for what it wasn’t: a scene of controversy or hard feelings. While there had been a few recriminations from the political right when the producers named Erivo as their Jesus earlier this year, the naysayers seemed to take the weekend off. So there was Erivo — just like any other 5-foot-1, queer Black woman portraying the son of God — wrapped in the City of Angels' warmest embrace. Her most riveting moment came during “Gethsemane (I Only Want to Say)” the song that explores Jesus’ ambivalence at having to give up his life for God and the greater good. Virtually doubled over by the force of her rendition, the audience rewarded the diminutive Jesus with a two-minute standing ovation. Erivo remained composed, until she wasn’t. As the audience's adulation continued to swell, she touched her hand to her heart, new tears dripping onto the stage. Her gesture felt like a sign of gratitude, “having just conquered a beloved number that was previously unavailable to her as a female actor,” Playbill’s critic said. Like Erivo, Lambert reveled in the moment, meeting his pre-performance prediction that the cast would “sing the house down.” When it debuted on Broadway in 1971, traditionalists found many reasons to loathe “JCS.\" They rejected its infusion of slang into a holy setting, the suggestion of a romantic connection between Jesus and Mary Magdalene, the lack of a resurrection, and more. Lambert noted that the world has changed enough that a rock opera about Jesus no longer feels provocative. “Working with the identity of the casting is sort of the new edge,” Lambert, a former “American Idol” star, who is gay, told an interviewer from USA Today. Last weekend, more than 50,000 people showed their love for that edge. “Why not?” Erivo said in an interview before the performance. “You can’t please everyone. It is legitimately a three-day performance at the Hollywood Bowl where I get to sing my face off. So hopefully they will come and realize, ‘Oh, it’s a musical, the gayest place on Earth.'\" Read the review from our theater critic: ‘Jesus Christ Superstar’ transcends in starry Hollywood Bowl celebration led by divine Cynthia Erivo. UCLA will negotiate with the Trump administration in hopes of reinstating $339 million in federal grants.Leaders are also considering legal options.Hundreds of faculty signed a petition demanding UCLA take aggressive action to defend against cuts.Gov. Gavin Newsom said Monday that Democrats are moving forward with a plan to put a rare mid-decade redistricting plan before voters on Nov. 4. State lawmakers will craft a “trigger,” he said: California voters would only vote on the measure if Texas moved forward with its own plans to redraw Congressional boundaries to add five more Republican seats.Two people were killed and six others were wounded at an after-party for the Hard Summer music festival in downtown Los Angeles early Monday.No suspects have been identified, and an investigation is ongoing.Parties and other illegal activities have been a recurring problem in warehouses in downtown Los Angeles.The Gifford fire has scorched more than 65,000 acres in San Bernardino County so far.The blaze was 3% contained and continuing to burn through tall, dry grass and chaparral as of Sunday evening.The weekend blaze is the latest challenge for firefighters in California, which is currently on pace to see significantly more acreage burned than last year.Despite a dicey L.A. restaurant scene — driven by escalating costs and a weakening economy — enrollment at L.A. Trade-Tech’s culinary program has been climbing in recent years.Recent graduates said they are not surprised by the school’s success, explaining that the program has appeal because it teaches useful, real-world skills.Texas' redistricting move would ‘trigger’ new California congressional maps, Newsom says.Tourism is dropping in Las Vegas. Are Californians to blame?Experts warn that Orange could face bankruptcy without a sales tax hike.Teens are turning to AI for friendship, advice and emotional support.Skydance Media is shaking up its leadership structure for Paramount.As Kamala Harris stirs things up, Phil Willon and Taryn Luna offer a look at the money raised by California gubernatorial candidates.The separation of church and state is at risk as never before, writes contributor Randall Balmer.Contributor Jody Freeman warns that Trump’s EPA proposes to radically end the U.S. fight against climate change.Here's what a DNA test revealed about a writer's long-lost abuela — and her secret life. Researchers have figured out what’s causing a devastating sea star epidemic. The TV Academy is getting into the festival biz. Here's what to expect from Televerse. Theater: Dressing like a woman is not a gag in “Some Like It Hot” at the Pantages, which runs through mid-August. Theme parks: For theme parks, every day can be Halloween. Here's why they're going big on year-round horror experiences. Exploring L.A.: Sawtelle reflects the legacy of Japanese immigrants — their resilience, resourcefulness and ability to reinvent. Here's a guide to exploring the neighborhood. Exploring S.F.: 12 things you probably haven't done in San Francisco — but should ASAP Television: Let’s break down “The Pitt” premiere’s many “Easter eggs,” character by character. Books: A Graceland discovery inspired Peter Guralnick’s myth-busting biography of Colonel Tom Parker. Reality TV: From “Too Hot to Handle” to “Let’s Marry Harry,” here's how Netflix created its own world of reality TV stars. 🥗 Here's a recipe for Taiwanese-style eggplant. ✏️ Get our free daily crossword puzzle, sudoku, word search and arcade games. Email us at essentialcalifornia@latimes.com, and your response might appear in the newsletter this week. Today's great photo is from Times photographer Jason Armond, who captured a small L.A. apartment filled with color and whimsy. Jim Rainey, staff writer Diamy Wang, homepage intern Izzy Nunes, audience intern Kevinisha Walker, multiplatform editor Andrew Campa, Sunday writer Karim Doumar, head of newsletters How can we make this newsletter more useful? Send comments to essentialcalifornia@latimes.com. Check our top stories, topics and the latest articles on latimes.com.","summary":"Your morning catch up: Queer Black Jesus, UCLA will negotiate with Trump and more big stories","url":"https://www.latimes.com/california/newsletter/2025-08-05/a-black-queer-jesus-sings-her-face-off-and-l-a-cheers","image":"https://ca-times.brightspotcdn.com/dims4/default/0a2bdf0/2147483647/strip/false/crop/3024x2275+0+0/resize/1486x1118!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F44%2F6c%2Fd66ee3d240d1a4dac5b9c3e16a80%2Fcynthia-erivo.jpg","video":null,"publish_date":"2025-08-05 13:30:00","author":"James Rainey","authors":["James Rainey"],"language":"en","source_country":"US","sentiment":0.239},{"id":348379480,"title":"Trump says he doesn’t trust the jobs data, but Wall Street and economists do","text":"WASHINGTON (AP) — The monthly jobs report is already closely-watched on Wall Street and in Washington but has taken on a new importance after President Donald Trump on Friday fired the official who oversees it.\n\nTrump claimed that June’s employment figures were “RIGGED” to make him and other Republicans “look bad.” Yet he provided no evidence and even the official Trump had appointed in his first term to oversee the report, William Beach, condemned the firing of Erika McEntarfer, the director of the Bureau of Labor Statistics appointed by former President Joe Biden. The firing followed Friday’s jobs report that showed hiring was weak in July and had come to nearly a standstill in May and June, right after Trump rolled out sweeping tariffs.\n\nEconomists and Wall Street investors have long considered the job figures reliable, with share prices and bond yields often reacting sharply when they are released. Yet Friday’s revisions were unusually large — the largest, outside of a recession, in five decades. And the surveys used to compile the report are facing challenges from declining response rates, particularly since COVID, as fewer companies complete the surveys.\n\nNonetheless, that hasn’t led most economists to doubt them.\n\n“The bottom line for me is, I wouldn’t take the low collection rate as any evidence that the numbers are less reliable,” Omair Sharif, founder and chief economist at Inflation Insights, a consulting firm, said.\n\nMany academics, statisticians and economists have warned for some time that declining budgets were straining the government’s ability to gather economic data. There were several government commissions studying ways to improve things like survey response rates, but the Trump administration disbanded them earlier this year.\n\nHeather Boushey, a top economic adviser in the Biden White House, noted that without Trump’s firing of McEntarfer, there would be more focus on last week’s data, which points to a slowing economy.\n\n“We’re having this conversation about made-up issues to distract us from what the data is showing,” Boushey said. “Revisions of this magnitude in a negative direction may indicate bad things to come for the labor market.”\n\nHere are some things to know about the jobs report:\n\nEconomists and Wall Street trust the data\n\nMost economists say that the Bureau of Labor Statistics is a nonpolitical agency staffed by people obsessed with getting the numbers right. The only political appointee is the commissioner, who doesn’t see the data until it’s finalized, two days before it is issued to the public.\n\nErica Groshen, the BLS commissioner from 2013 to 2017, said she suggested different language in the report to “liven it up”, but was shot down. She was told that if asked to describe a cup as half-empty or half-full, BLS says “it is an eight ounce cup with four ounces of liquid.”\n\nThe revised jobs data that has attracted Trump’s ire is actually more in line with other figures than before the revision. For example, payroll processor ADP uses data from its millions of clients to calculate its own jobs report, and it showed a sharp hiring slowdown in May and June that is closer to the revised BLS data.\n\nTrump and his White House have a long track record of celebrating the jobs numbers — when they are good.\n\nThese are the figures Trump is attacking\n\nTrump has focused on the revisions to the May and June data, which on Friday were revised lower, with job gains in May reduced to 19,000 from 144,000, and for June to just 14,000 from 147,000. Every month’s jobs data is revised in the following two months.\n\nTrump also repeated a largely inaccurate attack from the campaign about an annual revision last August, which reduced total employment in the United States by 818,000, or about 0.5%. The government also revises employment figures every year.\n\nTrump charged the annual revision was released before the 2024 presidential election to “boost” Vice President Kamala Harris’s “chances of Victory,” yet it was two months before the election and widely reported at the time that the revision lowered hiring during the Biden-Harris administration and pointed to a weaker economy.\n\nHere’s why the government revises the data\n\nThe monthly revisions occur because many companies that respond to the government’s surveys send their data in late, or correct the figures they’ve already submitted. The proportion of companies sending in their data later has risen in the past decade.\n\nEvery year, the BLS does an additional revision based on actual job counts that are derived from state unemployment insurance records. Those figures cover 95% of U.S. businesses and aren’t derived from a survey but are not available in real time.\n\nThese are the factors that cause revisions\n\nFiguring out how many new jobs have been added or lost each month is more complicated than it may sound. For example, if one person takes a second job, should you focus on the number of jobs, which has increased, or the number of employed people, which hasn’t? (The government measures both: The unemployment rate is based on how many people either have or don’t have jobs, while the number of jobs added or lost is counted separately).\n\nEach month, the government surveys about 121,000 businesses and government agencies at over 630,000 locations — including multiple locations for the same business — covering about one-third of all workers.\n\nStill, the government also has to make estimates: What if a company goes out of business? It likely won’t fill out any forms showing the jobs lost. And what about new businesses? They can take a while to get on the government’s radar.\n\nThe BLS seeks to capture these trends by estimating their impact on employment. Those estimates can be wrong, of course, until they are fixed by the annual revisions.\n\nThe revisions are often larger around turning points in the economy. For example, when the economy is growing, there may be more startups than the government expects, so revisions will be higher. If the economy is slowing or slipping into a recession, the revisions may be larger on the downside.\n\nHere’s why the May and June revisions may have been so large\n\nErnie Tedeschi, an economic adviser to the Biden administration, points to the current dynamics of the labor market: Both hiring and firing have sharply declined, and fewer Americans are quitting their jobs to take other work. As a result, most of the job gains or losses each month are probably occurring at new companies, or those going out of business.\n\nAnd those are the ones the government uses models to estimate, which can make them more volatile.\n\nGroshen also points out that since the pandemic there has been a surge of new start-up companies, after many Americans lost their jobs or sought more independence. Yet they may not have created as many jobs as startups did pre-COVID, which throws off the government’s models.\n\nRevisions seem to be getting bigger\n\nThe revisions to May and June’s job totals, which reduced hiring by a total of 258,000, were the largest — outside recessions — since 1967, according to economists at Goldman Sachs.\n\nKevin Hassett, Trump’s top economic adviser, went on NBC’s “Meet the Press” on Sunday and said, “What we’ve seen over the last few years is massive revisions to the jobs numbers.”\n\nHassett blamed a sharp drop in response rates to the government’s surveys during and after the pandemic: “When COVID happened, because response rates went down a lot, then revision rates skyrocketed.”\n\nYet calculations by Tedeschi show that while revisions spiked after the pandemic, they have since declined and are much smaller than in the 1960s and 1970s.\n\nOther concerns about the government’s data\n\nMany economists and statisticians have sounded the alarm about things like declining response rates for years. A decade ago, about 60% of companies surveyed by BLS responded. Now, only about 40% do.\n\nThe decline has been an international phenomenon, particularly since COVID. The United Kingdom has even suspended publication of an official unemployment rate because of falling responses.\n\nAnd earlier this year the BLS said that it was cutting back on its collection of inflation data because of the Trump administration’s hiring freeze, raising concerns about the robustness of price data just as economists are trying to gauge the impact of tariffs on inflation.\n\nU.S. government statistical agencies have seen an inflation-adjusted 16% drop in funding since 2009, according to a July report from the American Statistical Association.\n\n“We are at an inflection point,” the report said. “To meet current and future challenges requires thoughtful, well-planned investment … In contrast, what we have observed is uncoordinated and unplanned reductions with no visible plan for the future.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — The monthly jobs report is already closely-watched on Wall Street and in Washington but has taken on a new importance after President...","url":"https://whdh.com/news/trump-says-he-doesnt-trust-the-jobs-data-but-wall-street-and-economists-do/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/06/Trump-angry-e1751637314638.jpg?quality=60&strip=color","video":null,"publish_date":"2025-08-05 13:25:06","author":"Associated Press,James Kukstis","authors":["Associated Press","James Kukstis"],"language":"en","source_country":"us","sentiment":-0.437},{"id":348372304,"title":"Young adults are less likely to follow politics or say voting is important: AP-NORC poll (World)","text":"Mairekk Griffiths, a 26-year-old cook in a Denver suburb, doesn’t think he’ll ever pay a lot of attention to U.S. politics unless radical change happens.\n\n“If another party was likely to win, I’d be interested in that,” said Griffiths, who voted for Democrat Kamala Harris in last year's presidential race but, like many his age, does not see voting as that valuable.\n\n“I can’t say either way that voting matters,” Griffiths said. “It’s just picking the least bad option. That’s what I remember my whole life — both sides are bad, but this side is less bad.”\n\nYoung people such as Griffiths are less engaged with U.S. politics than older Americans and less likely to say voting is important, according to a new poll from The Associated Press-NORC Center for Public Affairs Research. Young people — even those who follow politics closely — are less likely to say issues such as the economy, government spending and health care are “extremely important” to them than comparable older adults.\n\nThe findings point to a broad sense of disillusionment among younger people about the country's political system — even if, like Griffiths, they still end up casting a ballot. Alberto Medina, who leads the Center for Information and Research on Civic Engagement at Tufts University, which studies youth and politics, noted that turnout among young people hit record levels in the 2020 election and was high last year.\n\n“There’s a sense that democracy isn’t working for young people. There’s a lack of belief that democracy is even able to improve their lives,” Medina said. “At the same time, we have been living in an era of high youth voting.”\n\nDisengagement from political parties and politics\n\nIn another sign of their general estrangement from politics, the poll shows young adults are more likely to reject political party labels. About one-third of adults under age 30 identify as political independents who don't lean toward either major political party, compared with 17% of Americans age 60 or older.\n\nThe poll also finds young people are far less likely to follow politics closely than older adults are.\n\nOnly about 2 in 10 of adults under age 30 say they follow U.S. politics “extremely” or “very\" closely, compared with about one-third of Americans overall. That's even higher among adults age 60 or older — 45% of this group says they follow U.S. politics at least very closely.\n\nDisengagement is higher among teenagers, with an AP-NORC poll from May finding 44% of teens ages 13 to 17 report following U.S. politics “not very closely” or “not closely at all.”\n\nMeanwhile, about two-thirds of adults under age 30 say it’s “extremely” or “very” important to vote, compared with almost 9 in 10 over age 45 who say it’s at least “very” important to vote.\n\nSome of these habits could shift as people grow older. Younger people traditionally are less likely to vote than older people, and voter participation tends to go up with age. It's possible that engagement with politics could follow a similar pattern.\n\nBrittany Diaz, 28, follows politics closely for an unusual reason: Her oldest son, who is 7, is obsessed with the news and watches it every night. Diaz, a Republican who lives in an Albuquerque, New Mexico, suburb, acknowledges that she’s unusual among her age group because she decided to start paying attention to politics when she had her first child at 20.\n\n“Now that I have kids, I’m like, ‘I need to care,’” she said.\n\nIn closely following politics, Diaz is different from many other women under 30.\n\nWomen in her age group are less likely than young men to say they follow U.S. politics, the poll finds. About one-quarter of men under 30 say they follow politics “extremely” or “very” closely, compared with 16% of women in the same age group. And about 4 in 10 young women say they follow U.S. politics “not very closely” or “not closely at all” compared with about a quarter of young men.\n\nLower investment in key issues\n\nOn a few issues, such as the economy and health care, the divide between the youngest and oldest Americans isn’t large. About 8 in 10 Americans under age 30 say the economy is “extremely” or “very” important to them personally, compared with about 9 in 10 Americans age 60 or older.\n\nBut older adults are much likelier to say topics that have taken center stage during the first six months of President Donald Trump's second term — including immigration and government spending — are “extremely” or “very” important to them personally compared with Americans under 30.\n\nThat's even true for topics such as the situation in the Middle East, which has become a rallying cry for young activists since the Israel-Hamas war broke out. Only about 4 in 10 adults under 30 say this is highly important to them personally, compared with about 6 in 10 Americans age 60 or older.\n\nFor some, that lack of interest could be related to a sense that the political system doesn't respond to their needs.\n\nAt 18, Blake Marlar is just starting to pay attention to politics. As Trump’s tax cut and spending bill moved through the Republican-controlled Congress, the aspiring geology major at the University of Nebraska emailed his state’s two senators, both Republicans, objecting to its Medicaid cuts and increases in immigration enforcement funding.\n\n“They didn’t seem to take me seriously,” Marlar said. “While I recognize they have to represent the whole state and the whole state doesn’t agree with me, it could have been a different experience.”\n\nBut he's resolved not to give up on politics: “In the future,\" he said, \"I’ll do my part and vote.”","summary":"Mairekk Griffiths, a 26-year-old cook in a Denver suburb, doesn&rsquo;t think he&rsquo;ll ever pay a lot of attention to U.S. politics unless radical change happens.\n\n&ldquo;If another party was likely to win, I&rsquo;d be interested in that,&rdquo; said Griffiths, who voted for Democrat Kamala Ha...","url":"https://www.castanet.net/news/World/564998/Young-adults-are-less-likely-to-follow-politics-or-say-voting-is-important-AP-NORC-poll","image":"https://www.castanet.net/content/cp/2025/8/ab35e0eb39a16d4984652570d9d9d265a9edb77c34d9edcebd8633d52e9bdac1.jpg","video":null,"publish_date":"2025-08-05 13:12:00","author":"Nicholas Riccardi","authors":["Nicholas Riccardi"],"language":"en","source_country":"ca","sentiment":0.111},{"id":348462514,"title":"MSNBC Dems Urge Party to 'Turn the Page' After 2024 Election","text":"MSNBC’s Ana Cabrera Reports\n\n11:47 am Eastern\n\nREP. HAKEEM JEFFRIES (D-NY): We have to continue to build upon that and earn the trust of the American people, including Democrats, who are understandably disappointed at the results of the November 2024 election and the situation that the country finds itself in. But our view is do not be discouraged. Do not be disheartened. Do not be dismayed. We’re going to continue to show up and stand up and speak up. We’re going to end this national nightmare in America, and we’re going to continue our country’s march toward a more perfect union. \n\n(CUTS TO LIVE)\n\nANA CABRERA: That was House Democratic Leader Hakeem Jeffries' last hour on this program, taking on his party's messaging approach amid President Trump's second term. This as new polling from the Associated Press reveals 35 percent of Democrats describe their own party negatively, with words like tepid, ineffective, and weak. \n\nJoining us now is Mark Leibovich, staff writer for The Atlantic, and former Democratic Senator Heidi Heitkamp of North Dakota. And Mark, you heard what leader Jeffries just had to say there. What's your reaction?\n\n11:50 am Eastern\n\nCABRERA: Senator Heikamp, Democrats do seem to be struggling to find their footing as they aim to rebrand their party’s image. When you take that new AP poll into account, what is the party getting so wrong?\n\nHEIDI HEITKAMP: Well, I think that they’re using old tactics for a new environment. The Republicans are way ahead in terms of flooding the zone with messages and so even if you start gaining momentum, on things like Epstein, all of a sudden you see changing the subject actually works for the Republicans.\n\nAnd so, I think this idea that you stand on the floor and talk for 20 minutes and somehow that miraculously translates into a message that's just no smart thinking. And they need to find more surrogates out there. They need to find a stronger kind of ground game so that people actually see people in, you know in states where like mine, they actually see Democrats fighting back. And when you don’t see that, that’s why you get the numbers you get. So it's not I mean, there's way too much focus on the message and not enough focus on the tactics. \n\nAnd so what I think the Democrats are getting wrong is the tactics. And I think they are still in the old school thinking of, “Oh, everybody's listening to what I got to say” instead of, you know, how do I make this message, and amplify this message, and continue this message? And it's like they have, they like get momentum and it's like, “Oh, look what we've done.” As opposed to just keep pushing through. And I think that's one of the lessons that we need to learn as Democrats.\n\nCABRERA: Marcus, I see you nodding along there. What are the tactics-\n\nMARCUS LEIBOVICH: Well-\n\nCABRERA: that the Democrats need to change?\n\nLEIBOVICH: Well, I can tell you what they shouldn’t do. First of all, you know, I agree 100 percent with Senator Heikamp here. I mean, yeah, I mean, there is just a reflexive eye roll that people get when they hear the same old Democratic talking points that, you know, frankly, Congressman Jeffries was just sort of using. \n\nI mean a classic example is last week, I mean, Trump is in all kinds of trouble around Epstein. Around some of his numbers, the job numbers firing the BLS. I mean, just like firing statisticians and so forth. All of a sudden, Kamala Harris decides this is going to be the week that she resurfaces and tries to become a national figure. Biden gives a couple of interviews, which is exactly what a lot of Democrats told me they do not want to be seeing right now. \n\nI mean, you know, look, Kamala Harris, she is who she is. She has a career to worry about. She had, you know, she’s the most recent nominee. But this is not the tactic that Democrats want to be seeing going forward. They want something new, whether it’s a new face or a new tactic.\n\nCABRERA: Senator Heikamp, Democrats aren't even united on the message right now. We saw Democratic Senator Cory Booker this week being very vocal about strategy and even kind of arguing with his own party on the Senate floor. Here's what he's saying more recently about how Democrats should take on the President.\n\n(CUTS TO VIDEO)\n\nSEN. COREY BOOKER (D-NJ): What I want to see more people doing, is not doing what some law firms have done- bend the knee to Donald Trump. Not doing what some universities have done- bend the knee to Donald Trump. We see major corporations who want some merger approval, not standing up on principle, but bending the knee to Donald Trump. That to me, is outrageous. \n\n(CUTS BACK TO LIVE)\n\nCABRERA: And he was in that public feud I mentioned earlier this week on the Senate floor when he was criticizing Democratic Senator Cortez Masto (D-NV) and Klobuchar (D-MN) because of messaging around finding common ground with Republicans. How do you see it?\n\nHEITKAMP: Well, I mean, I think they're going to have to work through all of the issues and the frustrations that they have. I don't think that there's a lot of difference between how those three Senators see the world. I just think there's a lot of difference in terms of what do you do about it. \n\nAnd this is the one caution that I would have, which is we have run three elections now by saying “We're not Donald Trump.” We lost two and we almost lost the third. Maybe it's time to turn the page and start talking about what Democrats stand for, what they're going to promote, how they're going to bring, you know, a better opportunity to middle class voters.\n\nYes, you need to be very aggressive against this President, but you can't fight something with nothing. And I think that's one of the challenges that the Democrats have, which is, “Oh, everybody sees this the same way we do” No they don't. And you need to get out into the real world. You need to talk to people and you need to be thinking about how do I persuade those Biden, Trump voters, the people who voted for Biden in 2020, who then turned around and voted for Trump. How do I convince them that we're better able to run the country?\n\nAnd so this is a real challenging time for Democrats. But the more people out there talking about what Democrats stand for, the better it is.\n\nCABRERA: Former Senator Heidi Heitkamp and Mark Leibovich, thank you both for the conversation.","summary":"The Democratic Party had found itself in a position scrambling for answers on how to improve its strategies after taking a loss in the 2024 election. On Monday, MSNBC’s Ana Cabrera Reports was converted into something resembling a Democratic Party planning session, like MS-DNC. Former Democratic Senator Heidi Heitkamp of North Dakota -- who lost in 2018 after one term -- claimed “Maybe it’s time to turn the page and start talking about what Democrats stand for,” as if that should have been what they campaigned on in the first place.  \n\nCabrera noted the problem: \"new polling from the Associated Press reveals 35 percent of Democrats describe their own party negatively, with words like tepid, ineffective, and weak.\"  The question after seeing that number was, how did the Democratic Party get there?  \n\n\n\n\n\nThey began with a soundbite of House Democratic Leader Hakeem Jeffries: “We’re going to end this national nightmare in America, and we’re going to continue our country’s march toward a more perfect union.” \n\nH","url":"https://www.newsbusters.org/blogs/nb/shannon-sauders/2025/08/05/msnbc-dems-urge-party-turn-page-after-2024-election","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-08/Ana%20Cabrera%20Reports-11_53_00%20am-2025-08-04.jpg?itok=bq2-JjpK","video":null,"publish_date":"2025-08-05 13:04:00","author":"Shannon Sauders","authors":["Shannon Sauders"],"language":"en","category":"politics","source_country":"US","sentiment":-0.295},{"id":348345428,"title":"Wired or wireless: What’s behind the Kamala Harris-based fear regarding wireless earphones?","text":"Wired or wireless?We know where Kamala Harris stands when it comes to earbuds - and her take seems to have spooked the internet.Appearing on Stephen Colbert's late night talk show The Late Show with Stephen Colbert for her first interview since losing to Donald Trump – and to promote her upcoming memoir “107 Days” - the former US vice president revealed the reason why she does not use wireless earphones.Harris was shown some photos, including some of her taking calls after Joe Biden announced he was quitting the presidential race on 21 July 2024.She admitted to taking more than 100 calls that day, and could be seen using wired earphones - as opposed to Bluetooth.\"I know I've been teased about this,\" she said. \"But I like these kinds of earpods that have [a cable] because I served on the Senate Intelligence Committee.\"She continued to explain: \"I have been in classified briefings and I'm telling you, don't be on the train using your earpods thinking someone can't listen to your conversation. I'm telling you, the [wired earphones] are a bit more secure.”The clip has gone viral, with social media users questioning some of their lifestyle choices and getting worried about who’s listening in when it comes to wireless earpods...\"A politician warning you about how \"they\" are listening to you is all you need to know!\" said one user, while another joked: “Imagine the government being able to listen in through AirPods for them to find out I'm just listening to the same song on repeat for over a week.\" Some were slightly more concerned. \"I hate the idea of people's privacy being violated\", one wrote, while another commented: \"If you're just listening to music or taking casual calls, wireless is fine. But for important/sensitive calls or data, wired is the smartest choice ... & @KamalaHarris isn't wrong for sticking to it.\" So, can conversations be intercepted via wireless earpods?According to techradar, German IT security analysts recently found flaws in the Airoha system on a chip (SoC), apparently “widely used” in True Wireless Stereo (TWS) earbuds. These vulnerabilities were found in headphones from big names including Sony, Bose, JBL and Marshall – meaning that the security flaw could hypothetically let hackers eavesdrop on calls.Furthermore, the UK’s Ministry of Justice notes on their security guidance page that Bluetooth devices may not be safe enough for \"Official-Sensitive or higher material\", and can be used to track someone's location.For people like Harris, who are high-risk individuals when it comes to spying, then wired earbuds are definitely the way to go. However, for the average user, the security risk is low.That said, if the NSA or the FBI fancy hearing us chat about our favourite movies of the year so far, they’re welcome. Some must-sees in there.Elsewhere, regarding Stephen Colbert and the controversial cancellation of his long-running late-night talk show, Donald Trump has insisted that he is not the reason behind CBS and the network’s parent company Paramount pulling the plug.Taking to his social media platform Truth Social, Trump addressed the rumours he had something to do with the axing of the 33-year-old show: \"Everybody is saying that I was solely responsible for the firing of Stephen Colbert from CBS, Late Night. That is not true!\"The president then started contemplating which one \"will go first\".\"Next up will be an even less talented Jimmy Kimmel, and then, a weak, and very insecure, Jimmy Fallon. The only real question is, who will go first?\" wrote Trump. \"Show Biz and Television is a very simple business. If you get Ratings, you can say or do anything. If you don’t, you always become a victim. Colbert became a victim to himself, the other two will follow.\" The final series of The Late Show with Stephen Colbert will sadly end in May 2026.","summary":"In a now-viral clip, Kamala Harris said she only used wired earphones to take calls. Her rationale behind not using wireless tech for conversations is rooted in her experience serving on the Senate Intelligence Committee. Now, social media users are questioning some of their lifestyle choices...","url":"https://www.euronews.com/culture/2025/08/05/wired-or-wireless-whats-behind-the-kamala-harris-based-fear-regarding-wireless-earphones","image":"https://static.euronews.com/articles/stories/09/40/51/71/1440x810_cmsv2_f07b4a76-b4e0-5c3e-93b6-ecfb76d7070b-9405171.jpg","video":null,"publish_date":"2025-08-05 12:54:10","author":"David Mouriquand","authors":["David Mouriquand"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.022},{"id":348405404,"title":"Sydney Sweeney’s 2019 Shooting Range Video Resurfaces Amid GOP Registration Reports","text":"Quick Summary\n\nSydney Sweeney’s expert shooting range video resurfaced and went viral in 2025 after her Republican registration and an American Eagle jeans ad controversy. The incident triggered heated debate online, with support from political figures and critics calling out the ad’s messaging. The episode shines a spotlight on how celebrity politics and brand partnerships intersect, challenging how stars navigate public identity in an era of rapid social media judgment.\n\nWhy Is Sydney Sweeney in the Spotlight?\n\nSydney Sweeney, best known for “Euphoria” and recently “Americana,” became the center of a cultural firestorm after:\n\nA 2019 clip showing her skillfully firing at a shooting range went viral.Her registration as a Florida Republican was publicized amid controversy over her July 2025 American Eagle commercial.The ad, lauded by President Donald Trump, faced backlash over perceived eugenics undertones and focus on Sweeney’s appearance.\n\nWhat Sparked the Latest Sydney Sweeney Debate?\n\nKey Moments\n\nShooting Clip Resurfaces: The Instagram video from 2019, originally practice for a Hollywood role, showcased Sweeney’s impressive marksmanship as she swiftly hit dummy targets without flinching—spotlighting her versatility as an actress but also fueling polarization online.Republican Registration Revealed: Monroe County, FL voter records showed Sweeney has been registered as a Republican since June 2024. The revelation came as discourse over her political leanings grew amid the ad controversy.American Eagle Ad Fallout: The commercial, built around the tagline “Sydney Sweeney Has Great Jeans,” was attacked on social media for its supposed eugenics reference (“good jeans”) and its focus on Sweeney’s figure. Some called the campaign “racist,” triggering significant online uproar.\n\nWhy Did the Shooting Range Clip Go Viral?\n\n1. Cultural Flashpoint\n\nThe video’s resurfacing was interpreted through the lens of the current political and social climate. For some, it was empowerment and authenticity; for others, it invoked debates about guns, politics, and Hollywood’s image management.\n\n2. Political Context\n\nSweeney’s Republican registration added fuel. Supporters rallied, seeing the shooting video as a symbol of traditional values, while critics used it as ammunition to question her suitability as a brand ambassador.\n\nHow Did Sweeney, Brands, and Politicians React?\n\nSweeney’s Response\n\nSweeney chose not to address the controversies directly, maintaining public silence through online upheaval.At the premiere for “Americana,” she was heckled by a fan for the ad—she did not respond and left the event without comment.\n\nBrand Response\n\nAmerican Eagle defended its commercial, insisting the “great jeans” line was only about denim, but later removed the ad from social media. Their message: the ad celebrates how “everyone wears their AE jeans with confidence, their way.”\n\nPolitical Response\n\nDonald Trump publicly praised Sweeney and the ad, calling it “fantastic” and using it as an opportunity to reiterate critiques of “woke” culture, highlighting her Republican status.He contrasted Sweeney’s “hotness” and success with Taylor Swift, whom he condemned after her support for Kamala Harris—a dig referencing Swift’s less-warm 2025 Super Bowl reception.\n\nWhat Does This Say About Modern Celebrity and Political Branding?\n\nCelebrity Endorsements Are Now Political Statements\n\nBrands partnering with high-profile figures must anticipate:\n\nDeep-dive scrutiny of the star’s history, affiliations, and even unrelated personal hobbies (gun range training, for example).Real-time social media backlash—positive or negative—often fueled by political subgroups not originally targeted by the campaign.\n\nSocial Media Amplifies Every Detail\n\nA five-year-old gun range video can resurface overnight and become central to a debate about a brand’s values and an individual’s beliefs.\n\nConsider an infographic here showing the “Lifecycle of a Viral Celebrity Controversy,” charting the timeline from ad release to viral video, political response, and resulting brand actions.\n\nBrand Safety and Political Affiliations\n\nCompanies crave authenticity but risk alienating segments of the audience if a star’s politics surface unexpectedly.\n\nKey takeaways for brands:\n\nAudit talent and campaign messaging for unintended double meanings.Prepare crisis communication plans before campaign launches.Foster genuine partnerships rather than relying solely on star power.\n\nWhat Are the Lasting Impacts on Sweeney’s Career and Public Image?\n\nSweeney saw a wave of support from online influencers, politicians, and the president, underscoring how controversies can also fortify a fanbase.Despite the heat, she has not lost significant traction—her films, endorsements, and online engagement remain strong.American Eagle’s stock spiked nearly 25% upon Trump’s public praise—highlighting the unpredictable commercial effects polarizing events can have.\n\nThe Bigger Picture: Why This Story Matters\n\nThe Sweeney episode is emblematic of a larger trend: every facet of a celebrity’s public life can become politicized.Audiences, brands, and stars must navigate a world where three elements—media, politics, and commerce—are increasingly intertwined.Ultimately, the incident is less about a single ad or a celebrity’s hobby and more about how America views fame, authenticity, and the constant feedback loop of pop culture and politics.","summary":"Sydney Sweeney’s shooting range clip and viral ad controversy reveal the new reality of celebrity politics and branding","url":"https://www.breezyscroll.com/world/the-us/sydney-sweeney-shooting-clip-american-eagle-controversy/","image":"https://www.breezyscroll.com/wp-content/uploads/2025/08/image-59.png","video":null,"publish_date":"2025-08-05 12:50:14","author":"Siddhi Vinayak Misra","authors":["Siddhi Vinayak Misra"],"language":"en","source_country":"in","sentiment":0.349},{"id":348361802,"title":"Trump says Treasury Secretary Bessent 'does not want' to be Fed chair, but 4 others in running","text":"President Donald Trump told CNBC on Tuesday that he has narrowed the field of potential future Federal Reserve chairs to four candidates, a list that does not include Treasury Secretary Scott Bessent.\n\nWhile the president did not disclose who is in contention, he revealed that Bessent, previously considered a leading candidate, has taken himself out of contention.\n\n\"Well, I love Scott, but he wants to stay where he is,\" Trump said during a \"Squawk Box\" interview. \"I asked him just last night, 'Is this something you want?' [Bessent said], 'Nope, I want to stay where I am. He actually said, 'I want to work with you.' It's such an honor. I said, 'That's very nice. I appreciate that.'\"\n\nThe news follows Fed Governor Adriana Kugler's surprise announcement Friday that she is resigning effective this Friday. The move allows Trump to install another of his appointees to the Fed Board of Governors at a time when the White House is aggressively pushing the central bank to lower interest rates.\n\nAmong the likely candidates remaining are former Governor Kevin Warsh and Kevin Hassett, the National Economic Council director and a key Trump advisor. Both have advocated for lower rates. Fed Governor Christopher Waller also is thought to be in the running.\n\n\"Both Kevins are very good, and there are other people that are very good, too,\" Trump said, adding that Kugler's resignation \"was a pleasant surprise.\"\n\nCurrent Chair Jerome Powell's term ends in May 2026. He has been a frequent target of Trump's criticism, and there has been speculation that the president would name a \"shadow chair\" who could help undermine Powell until his term expires. Trump did not commit to taking that approach but conceded that it is \"a possibility.\"\n\nTrump nominated Powell for the Fed job in 2017, during his first term as president. The Senate then confirmed Powell the following February. Trump alleged Tuesday that Powell told him, \"Sir, I'll keep interest rates so low. I'm a low interest rate person.\"\n\nThe Fed last week voted to hold its benchmark interest rate steady in a range between 4.25%-4.5%. Markets expect the Fed to approve its next cut in September. The central bank lowered its policy rate a full percentage point from September through December 2024, moves that Trump has said were politically motivated to help Democratic presidential nominee Kamala Harris.","summary":"U.S. President Donald Trump spoke Tuesday morning on CNBC's \"Squawk Box.\"","url":"https://www.cnbc.com/2025/08/05/trump-says-treasury-secretary-bessent-does-not-want-to-be-fed-chair-but-4-others-in-running.html","image":"https://image.cnbcfm.com/api/v1/image/108181018-1754307194455-gettyimages-2227748454-AFP_68NE8UU.jpeg?v=1754307220","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2025/M08D05/7000384586/1754396318-41045095661-hd_L.mp4","publish_date":"2025-08-05 12:41:36","author":"Jeff Cox","authors":["Jeff Cox"],"language":"en","category":"politics","source_country":"US","sentiment":0.12},{"id":348349716,"title":"Texas and California joust for political advantage, with Trump’s agenda and House majority in play","text":"By BILL BARROW, NADIA LATHAN and MICHAEL R. BLOOD, Associated Press\n\nAUSTIN, Texas (AP) — The nation’s two most populous states — California and Texas — grappled for political advantage in advance of 2026 elections that could reorder the balance of power in Washington and threaten President Donald Trump’s agenda at the midpoint of his second term.\n\nIn Texas, Democrats on Monday prevented their state’s House of Representatives from moving forward, at least for now, with a redrawn congressional map sought by Trump to shore up Republicans’ 2026 midterm prospects as his political standing falters.\n\nIn California, Democrats encouraged by Gov. Gavin Newsom are considering new political maps that could slash five Republican-held House seats in the liberal-leaning state while bolstering Democratic incumbents in other battleground districts. The move is intended to undercut any GOP gains in Texas, potentially swinging House control and giving Democrats a counterweight to Trump on Capitol Hill.\n\nA draft plan aims to boost the Democratic margin in California to 48 of 52 congressional seats, according to a source familiar with the plan who was not authorized to discuss it publicly. That’s up from the 43 seats the party now holds. It would need approval from lawmakers and voters, who may be skeptical to give it after handing redistricting power to an independent commission years ago.\n\nThe rivalry puts a spotlight on two states that for years have dueled over jobs, innovation, prestige — even sports — with the backdrop of clashing political visions — one progressive, one conservative.\n\nA standoff in Texas after Democrats leave the state\n\nAfter dozens of Democrats left Texas, the Republican-dominated House was unable to establish the quorum of lawmakers required to do business. Republican Gov. Greg Abbott has made threats about removing members who are absent from their seats. Democrats counter that Abbott is using “smoke and mirrors” to assert legal authority he does not have.\n\nThe House quickly issued civil arrest warrants for absent Democrats and Abbott ordered state troopers to help find and arrest them, but lawmakers physically outside Texas are beyond the jurisdiction of state authorities.\n\n“If you continue to go down this road, there will be consequences,” House Speaker Rep. Dustin Burrows said from the chamber floor, later telling reporters that includes fines.\n\nDemocrats’ revolt and Abbott’s threats intensified a fight over congressional maps that began in Texas but now includes Democratic governors who have pitched redrawing their district maps in retaliation — even if their options are limited. The dispute also reflects Trump’s aggressive view of presidential power and his grip on the Republican Party nationally, while testing the long-standing balance of powers between the federal government and individual states.\n\nThe impasse centers on Trump’s effort to get five more GOP-leaning congressional seats in Texas, at Democrats’ expense, before the midterms. That would bolster his party’s chances of preserving its fragile U.S. House majority, something Republicans were unable to do in the 2018 midterms during Trump’s first presidency. Republicans currently hold 25 of Texas’ 38 seats. That’s nearly a 2-to-1 advantage and already a wider partisan gap than the 2024 presidential results: Trump won 56.1% of Texas ballots, while Democrat Kamala Harris received 42.5%.\n\nThe California pushback: A move to undercut GOP House members\n\nAccording to the tentative California proposal, districts now held by Republican Reps. Ken Calvert, Darrell Issa, Kevin Kiley, David Valadao and Doug LaMalfa would see right-leaning voters shaved and Democratic voters boosted in a shift that would make it likely a left-leaning candidate would prevail in each race.\n\nIn battleground districts held by Democratic Reps. Dave Min, Mike Levin and Derek Tran, the party’s edge would be boosted to strengthen their hold on the seats, the source said.\n\nDemocratic members of California’s congressional delegation were briefed on the new map on Monday, according to a person familiar with the meeting who requested anonymity to discuss private conversations.\n\nThe proposal is being circulated at the same time that Democratic Gov. Gavin Newsom has said he wants to advance partisan redistricting. He says he won’t move ahead if Texas pauses its efforts.\n\nNewsom said he’d call a special election for the first week of November. Voters would weigh a new congressional map drawn by the Democratic-controlled Legislature.\n\n“California will not sit by idly and watch this democracy waste away,” Newsom said Monday.\n\nMore than 1,800 miles (2,900 kilometers) from Austin, New York Gov. Kathy Hochul appeared with Texas Democrats and argued their cause is national.\n\n“We’re not going to tolerate our democracy being stolen in a modern-day stagecoach heist by a bunch of law-breaking cowboys,” Hochul said Monday. “If Republicans are willing to rewrite rules to give themselves an advantage, then they’re leaving us with no choice: We must do the same. You have to fight fire with fire.”\n\nStatus of the vote\n\nIn Texas, legislators who left the state declined to say how long they’ll hold out.\n\n“We recognized when we got on the plane that we’re in this for the long haul,” said Rep. Trey Martinez Fischer while in Illinois.\n\nTexas House Democratic Caucus leader Gene Wu said members “will do whatever it takes” but added, “What that looks like, we don’t know.”\n\nLegislative walkouts often only delay passage of a bill, like in 2021, when many Democrats left Texas for 38 days to protest proposed voting restrictions. Once they returned, Republicans passed that measure.\n\nLawmakers cannot pass bills in the 150-member House without two-thirds of members present. Democrats hold 62 seats in the majority-Republican chamber, and at least 51 left the state, according to a Democratic aide.\n\nThe Texas Supreme Court held in 2021 that House leaders could “physically compel the attendance” of missing members, but no Democrats were forcibly brought back to the state after warrants were served. Republicans answered by adopting $500 daily fines for lawmakers who don’t show.\n\nAbbott, meanwhile, continues to make unsubstantiated claims that some lawmakers have committed felonies by soliciting money to pay for potential fines for leaving Texas during the session.\n\nBarrow reported from Atlanta. Blood reported from Los Angeles. Associated Press writers Joey Cappelletti in Washington, John Hanna in Topeka, Kansas, and Andrew DeMillo in Little Rock, Arkansas, also contributed to this report.","summary":"The rivalry tugging at the nation's political balance is playing out in advance of the 2026 midterm elections.","url":"https://www.sandiegouniontribune.com/2025/08/05/texas-california-election-2026-redistricting/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/US_Election_2026_Texas_Redistricting_15636-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-05 12:38:12","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.317},{"id":348333920,"title":"Donald Trump Can’t Contain His Joy as Gayle King’s Career Is Allegedly ‘Over’ — His Social Media Rant Proves It","text":"King reportedly gets paid $15 million per year as part of her contract with CBS that doesn’t end until May 2026. However, whether her association of over a decade with the network will continue next year is a big question at the moment. Her show, which was regarded as a cash cow for the network, is now struggling to retain viewers.\n\nThe Post has revealed that its rating plummeted to below 2 million in the last few months. WCIV reports that it has lost 20-30% of its viewers in the 25 to 54-year-old age group compared to the same time last year. \n\nDonald Trump, who hates anything woke, is obviously happy with the news. He took to his Truth Social and wrote, “Gayle King’s career is over. She should have stayed with her belief in TRUMP. She never had the courage to do so. No talent, no ratings, no strength!!!”\n\nThe Post reported that CBS lost $40 million to $50 million last year. However, despite the drop in ratings, the network is still profitable. Keeping in mind the plummeting viewership, the network might not consider extending Gayle King’s contract next May, which is the same month when CBS will terminate the contract of ‘The Late Show’ host Stephen Colbert.\n\nParamount co-CEO George Cheeks, who oversees CBS, said it was “purely a financial decision” to pull the plug on Colbert, who was paid $15-$20 million per year. \n\nCBS’s canceling the Stephen Colbert show, when his program was the highest-rated evening talk show on the air, signals that they have gone full-blown MAGA! Let’s trash their ratings, too! If you agree, drop a like and pass it on! Bye, CBS! 👋 pic.twitter.com/pvLhrkw1Ja\n— Damaan, AKA “Philly’s Finest”! (@Damaan4u33) July 20, 2025 \n\nThe network is undergoing major changes after it sealed an $8.4 billion merger with Skydance Media. As part of the deal, Skydance has vowed to eliminate the existing DEI (diversity, equity, inclusion) mandates within the network. An insider told The Post that viewers feel alienated because none of the show’s anchors, except Dokoupil, are white. Even most of the show’s substitute anchors are African American, it is reported. \n\nThe insider also said that “CBS Mornings lost its curveball” after Kamala Harris lost the election. As Trump returned to office, the staff were unable to hide their shock and displeasure. \n\nMore changes to boost the rating and revenue are expected to follow after the merger deal is closed by August 7. This would also mean making cultural changes, including steps to get rid of the alleged political bias. \n\nAmid all this, Trump would be happy to watch a ‘woke’ anchor lose her position and be replaced by someone who sings the same MAGA tune Trump wants on every news network.","summary":"Donald Trump launched a rant against Gayle King as her position in CBS appears shaky.","url":"https://www.inquisitr.com/donald-trump-cant-contain-his-joy-as-gayle-kings-career-is-allegedly-over-his-social-media-rant-proves-it","image":"https://www.inquisitr.com/wp-content/uploads/2025/08/Untitled-design-38.jpg","video":null,"publish_date":"2025-08-05 12:21:22","author":"Kanika Saini,Wikimedia Commons/ali Shaker/voa, Gage Skidmore","authors":["Kanika Saini","Wikimedia Commons/ali Shaker/voa, Gage Skidmore"],"language":"en","category":"politics","source_country":"us","sentiment":-0.711},{"id":348347262,"title":"AOC could take the White House, networks go nuts about Sydney Sweeney, and more from Fox News Opinion","text":"Welcome to the Fox News Opinion Newsletter. HANNITY – Fox News host traces the ‘long-term’ smear campaign against President Donald Trump. Continue watching… HUGH HEWITT – Memo for President Trump, Secretary Burgum and Director Nesvik. Continue reading… MADAM PRESIDENT? – Why AOC could take the White House in 2028 and Kamala Harris won't. Continue reading… FED UP – Foolish interest rate policy is stopping America’s economy from booming. Continue reading… GREECE'S LESSON FOR NYC – Beware leaders who promise the world. Continue reading… RAYMOND ARROYO – Fox News contributor reviews former Vice President Kamala Harris' 'Late Show with Stephen Colbert' appearance and Kim Kardashian's latest product. Continue watching… SEN. TIM SCOTT – The secret behind Apollo 8's broadcast is a favorite story of Christian courage. Continue reading… BROADCAST BIAS – ABC compares Sydney Sweeney ad to Nazis as networks go nuts about her ‘genes’. Continue reading… MESSAGE ABOUT MOTHERHOOD – The media desperately wants you to miss this. Continue reading… CARTOON OF THE DAY – Check out all of our political cartoons…","summary":"Read the latest from Fox News Opinion &amp; watch videos from Sean Hannity, Raymond Arroyo &amp; more.","url":"https://www.foxnews.com/opinion/aoc-could-take-white-house-networks-go-nuts-about-sydney-sweeney-more-from-fox-news-opinion","image":"https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/405c7d34-10cc-4e63-94ff-bf0b573e117f/00efaa9f-0952-4868-8903-e8c6b495167d/1280x720/match/image.jpg","video":"https://www.foxnews.com/video/6376475824112","publish_date":"2025-08-05 11:56:32","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.484},{"id":348327406,"title":"Young adults are less likely to follow politics or say voting is important: AP-NORC poll","text":"By NICHOLAS RICCARDI, LINLEY SANDERS and AMELIA THOMSON-DEVEAUX\n\nWASHINGTON (AP) — Mairekk Griffiths, a 26-year-old cook in a Denver suburb, doesn’t think he’ll ever pay a lot of attention to U.S. politics unless radical change happens.\n\n“If another party was likely to win, I’d be interested in that,” said Griffiths, who voted for Democrat Kamala Harris in last year’s presidential race but, like many his age, does not see voting as that valuable.\n\n“I can’t say either way that voting matters,” Griffiths said. “It’s just picking the least bad option. That’s what I remember my whole life — both sides are bad, but this side is less bad.”\n\nYoung people such as Griffiths are less engaged with U.S. politics than older Americans and less likely to say voting is important, according to a new poll from The Associated Press-NORC Center for Public Affairs Research. Young people — even those who follow politics closely — are less likely to say issues such as the economy, government spending and health care are “extremely important” to them than comparable older adults.\n\nThe findings point to a broad sense of disillusionment among younger people about the country’s political system — even if, like Griffiths, they still end up casting a ballot. Alberto Medina, who leads the Center for Information and Research on Civic Engagement at Tufts University, which studies youth and politics, noted that turnout among young people hit record levels in the 2020 election and was high last year.\n\n“There’s a sense that democracy isn’t working for young people. There’s a lack of belief that democracy is even able to improve their lives,” Medina said. “At the same time, we have been living in an era of high youth voting.”\n\nDisengagement from political parties and politics\n\nIn another sign of their general estrangement from politics, the poll shows young adults are more likely to reject political party labels. About one-third of adults under age 30 identify as political independents who don’t lean toward either major political party, compared with 17% of Americans age 60 or older.\n\nThe poll also finds young people are far less likely to follow politics closely than older adults are.\n\nOnly about 2 in 10 of adults under age 30 say they follow U.S. politics “extremely” or “very” closely, compared with about one-third of Americans overall. That’s even higher among adults age 60 or older — 45% of this group says they follow U.S. politics at least very closely.\n\nDisengagement is higher among teenagers, with an AP-NORC poll from May finding 44% of teens ages 13 to 17 report following U.S. politics “not very closely” or “not closely at all.”\n\nMeanwhile, about two-thirds of adults under age 30 say it’s “extremely” or “very” important to vote, compared with almost 9 in 10 over age 45 who say it’s at least “very” important to vote.\n\nSome of these habits could shift as people grow older. Younger people traditionally are less likely to vote than older people, and voter participation tends to go up with age. It’s possible that engagement with politics could follow a similar pattern.\n\nBrittany Diaz, 28, follows politics closely for an unusual reason: Her oldest son, who is 7, is obsessed with the news and watches it every night. Diaz, a Republican who lives in an Albuquerque, New Mexico, suburb, acknowledges that she’s unusual among her age group because she decided to start paying attention to politics when she had her first child at 20.\n\n“Now that I have kids, I’m like, ‘I need to care,’” she said.\n\nIn closely following politics, Diaz is different from many other women under 30.\n\nWomen in her age group are less likely than young men to say they follow U.S. politics, the poll finds. About one-quarter of men under 30 say they follow politics “extremely” or “very” closely, compared with 16% of women in the same age group. And about 4 in 10 young women say they follow U.S. politics “not very closely” or “not closely at all” compared with about a quarter of young men.\n\nLower investment in key issues\n\nOn a few issues, such as the economy and health care, the divide between the youngest and oldest Americans isn’t large. About 8 in 10 Americans under age 30 say the economy is “extremely” or “very” important to them personally, compared with about 9 in 10 Americans age 60 or older.\n\nBut older adults are much likelier to say topics that have taken center stage during the first six months of President Donald Trump’s second term — including immigration and government spending — are “extremely” or “very” important to them personally compared with Americans under 30.\n\nThat’s even true for topics such as the situation in the Middle East, which has become a rallying cry for young activists since the Israel-Hamas war broke out. Only about 4 in 10 adults under 30 say this is highly important to them personally, compared with about 6 in 10 Americans age 60 or older.\n\nFor some, that lack of interest could be related to a sense that the political system doesn’t respond to their needs.\n\nAt 18, Blake Marlar is just starting to pay attention to politics. As Trump’s tax cut and spending bill moved through the Republican-controlled Congress, the aspiring geology major at the University of Nebraska emailed his state’s two senators, both Republicans, objecting to its Medicaid cuts and increases in immigration enforcement funding.\n\n“They didn’t seem to take me seriously,” Marlar said. “While I recognize they have to represent the whole state and the whole state doesn’t agree with me, it could have been a different experience.”\n\nBut he’s resolved not to give up on politics: “In the future,” he said, “I’ll do my part and vote.”\n\nThe AP-NORC poll of 1,437 adults was conducted July 10-14, using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for adults overall is plus or minus 3.6 percentage points.\n\nRiccardi reported from Denver.","summary":"New poll shows many young adults feel disillusioned with the political system and question the importance of voting.","url":"https://www.sandiegouniontribune.com/2025/08/05/us-young-adults-politics-poll/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/AP_Poll_Young_Adults_47836-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-05 11:32:37","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":0.153},{"id":348327796,"title":"Is California’s congressional map a Democratic gerrymander as Vance claims?","text":"Texas Republicans, at President Donald Trump’s urging, are preparing to redraw the state’s congressional map in a way that could flip up to five seats to the GOP in 2026. Trump hopes to boost Republicans’ chances of maintaining a narrow House majority amid the headwinds of the midterm election.\n\nThe manoeuvre in Texas would be legal and not unprecedented for the state, which also undertook a Republican-driven redistricting in 2003. But Democrats have called the move a partisan power grab and an affront to the traditional practice of drawing new congressional districts every 10 years, after a new Census.\n\nBut the debate over Texas’s electoral map has also prompted broader questions over the fairness of the way in which voting districts are outlined. And the one state bigger than Texas – California – has caught the attention of Vice President JD Vance.\n\n“The gerrymander in California is outrageous,” Vance posted July 30 on X. “Of their 52 congressional districts, 9 of them are Republican. That means 17 percent of their delegation is Republican when Republicans regularly win 40 percent of the vote in that state. How can this possibly be allowed?”\n\nSo, does California have an unfair map, as Vance said?\n\nBy the numbers, California is not a dramatic outlier when it comes to the difference between its congressional and presidential vote. However, because this difference is multiplied by a large number of districts – since California is the United States’ most populous state – it produces a bounty of House seats beyond what the state’s presidential vote alone would predict.\n\nVance’s description of California’s map as a “gerrymander” is also doubtful – it was drawn by a bipartisan commission, not Democratic legislators. Gerrymandering is done by politicians and political parties.\n\nVance’s office did not respond to an inquiry for this article.\n\nWhat the numbers show\n\nOur first step was to measure the difference between each state’s House-seat breakdown by party and its presidential-vote breakdown by party, which is what Vance cited. (Our analysis builds off of a 2023 Sabato’s Crystal Ball story written by this author. Sabato’s Crystal Ball is a publication of the University of Virginia Center for Politics.) We removed from consideration any state with one, two or three House members in its delegation, because these small states have wide differentials that skew the comparison.\n\nFor red states won by Trump, we took the percentage of Republican seats in the House delegation and subtracted the percentage of the vote Trump won in that state. Conversely, for blue states won by Kamala Harris, we took the percentage of Democratic seats in the House delegation and subtracted the percentage of the vote Harris won in the state.\n\nOur analysis found that California did elect more Democrats to the House than its presidential vote share would have predicted, but the state was not an outlier. With 83% of its House seats held by Democrats and 58% of its 2024 presidential votes going to Democrats, California ranked 13th nationally among 35 states that have at least four seats in their delegation.\n\nCalifornia has the nation’s 13th widest difference between House and presidential results\n\nThe top 13 differentials were split roughly evenly between blue and red states.\n\nIn six states that have at least four House seats – red Iowa, Utah, Arkansas and Oklahoma, and blue Connecticut and Massachusetts – a single party controls every House seat, even though the winning presidential candidate won between 56% and 66% of the vote in those states.\n\nAnother six states had a differential equal to or wider than California’s: Red South Carolina and Tennessee, and blue Oregon, Illinois and Maryland, plus purple Wisconsin.\n\nCalifornia does stand out by another measure, because of its size.\n\nIf you multiply the House-to-presidential differential by the number of House seats in the delegation, you get a figure for “excess House seats”, the term used in the 2023 Sabato’s Crystal Ball article – essentially, a majority party’s bonus in House seats beyond what presidential performance would predict.\n\nBecause California has a large population represented by many House districts, even its modest differential produces a lot of extra Democratic House seats – 12, to be exact. That’s the largest of any state; the closest competitors are blue Illinois and New York, and red Florida, each of which has more than four excess seats for the majority party.\n\nTexas’s current congressional map has 3.7 excess seats for the Republicans. That would increase to an 8.7-seat GOP bonus if the GOP can flip the five seats they’re hoping for in 2026.\n\nIs California a “gerrymander”?\n\nVance described California’s map as a gerrymander, but political experts doubted that this term applies. A gerrymander typically refers to a map drawn by partisan lawmakers, and California’s is drawn by a commission approved by voters specifically to remove the partisanship from congressional map drawing.\n\n“California’s congressional map is no gerrymander,” said Nathaniel Rakich, a contributing analyst to Inside Elections, a political analytics publication. “It was drawn by an independent commission consisting of five Republicans, five Democrats, and four independents that is generally upheld as one of the fairest map-drawing entities in any state.”\n\nKyle Kondik, the managing editor of Sabato’s Crystal Ball, said commissions tend to produce a more competitive House battleground than a fully partisan system. Of the 19 House seats his outlet currently rates as toss-ups going into 2026, only two come from states where one party had a free hand to gerrymander the current district lines.\n\n“I think it’s fair to say that commission and court-drawn maps can inject some competitiveness into the process,” Kondik said.\n\nBecause the seats were drawn by a commission, California has a lot of competitive seats. This helps California Republicans despite the state’s Democratic tilt.\n\nAccording to the 2024 pre-election ratings by Sabato’s Crystal Ball, California had three Democratic-held seats in the “lean Democratic” category, and two more that were rated “likely Democratic”.\n\nSo, going into the election, five of California’s 40 Democratic-held seats are at least somewhat vulnerable to a Republican takeover. Texas Democrats aren’t so lucky, under its existing map: They are able to realistically target only one “likely Republican” seat out of 25 held by the GOP.\n\nSometimes, geography is the enemy of a “fair” map\n\nDespite map makers’ efforts, it is sometimes impossible to produce a map that jibes perfectly with a state’s overall partisan balance. The cold facts of geography can prevent this.\n\nOne oft-cited example is Massachusetts, which hasn’t elected a Republican to the US House since 1994. There are few Republican hotbeds in Massachusetts, and experts say they can’t be easily connected into coherent congressional districts.\n\n“Especially in deep-red or deep-blue states, parties tend to get a higher share of seats than they do of votes,” Rakich said. “Imagine a state where Republicans get two-thirds of the vote in every district; obviously, they would get 100 percent of their seats.”\n\nRakich said Democrats are geographically distributed more favourably in California. But in other states, Republicans benefit from better geographic distribution.\n\n“I haven’t heard Vance complain about the fact that Democrats only get 25 percent of Wisconsin’s congressional seats despite regularly getting 50 percent of the vote there,” Rakich added.","summary":"Texas GOP plans new map; Vance references CA, but its bipartisan map is not skewed, contrary to his claims, say experts.","url":"https://www.aljazeera.com/news/2025/8/5/is-californias-congressional-map-a-democratic-gerrymander-as-vance-claims?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2024/03/AP23255479301923-1709673244.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-08-05 11:19:42","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.213},{"id":348320248,"title":"“The View Co-Host Critiques Kamala Harris Over Perceived Disconnect in Interview”","text":"‘Donald Trump did talk about abolishing the Department of Education. He was open about what he was going to do. And the fact that Democrats couldn’t listen to the American public and think, “Okay, something he’s saying is resonating. What can we do to beat him?” – that’s where I kind of, they lose it for me.’ Harris’ new book, 107 Days, set for release in September , is expected to detail her short-lived presidential run and offer lessons learned. In a video posted to social media, Harris framed the memoir as a path forward. “I believe there’s value in sharing what I saw, what I learned, and what I know it will take to move forward,” she said. But with polling showing her approval ratings near historic lows and Democrats still reeling from their 2024 defeat, critics argue Harris may be the wrong messenger at the wrong time.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA co-host of The View and former supporter of Kamala Harris explained&#8230;\n\n\nThis Post: &#8220;The View Co-Host Critiques Kamala Harris Over Perceived Disconnect in Interview&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/the-view-co-host-critiques-kamala-harris-over-perceived-disconnect-in-interview/","image":"https://internewscast.com/wp-content/uploads/2025/08/rewrite-this-title-The-Views-co-host-slams-Kamala-Harris-citing.jpg","video":null,"publish_date":"2025-08-05 10:50:02","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.071}]}