{"offset":0,"number":50,"available":547,"news":[{"id":347104502,"title":"Kevin McCarthy Has Three Questions He Wants Kamala To Answer In Her New Book","text":"Former Republican House Speaker Kevin McCarthy raised some pointed questions on Fox News Thursday regarding former Vice President Kamala Harris and her forthcoming book.\n\nHarris said Thursday that her upcoming book, “107 Days,” will offer a behind-the-scenes look at her brief presidential campaign. The book is scheduled for release Sept. 23. During an appearance on “The Ingraham Angle,” McCarthy said he has three questions he wants Harris to answer in the book.\n\n“Will she be honest and say never did she have a poll where she was leading? Would she be honest and say that she knew she wasn’t going to win this entire time? Or what about how Joe Biden was as president that he mentally wasn’t there? ‘107 days,’ I’m just wondering, how much did some publisher pay for this book?” McCarthy asked.\n\nMcCarthy drew comparisons between Harris’ book and her previous media stunts, criticizing her for relying on what he called manufactured authenticity.\n\n“Remember when she did this in the campaign, like dramatic, like she was going to answer the phone, it was Barack Obama endorsing her, then we found that was all staged? Or when she actually did the podcast, ‘Who’s Your Daddy,’ right? They built an entire stage. Or that she had all these stars come out. We found out she paid them. Even when she paid Beyonce or Oprah, they didn’t perform,” McCarthy added.\n\nMcCarthy then raised concerns over Harris’ authenticity, suggesting it is more about political positioning than personal reflection. (RELATED: Juan Williams Suggests Real Reason Kamala Isn’t Running For Governor)\n\n“There’s no authenticity behind her. You know, she talked about maybe running for governor, [but] then she got second thoughts because she knew she couldn’t win. I think this book is her idea to try to set the stage to be the Democrat nominee again,” McCarthy said. “This is the difference. She would have to go earn it, and she would never win the primary.”\n\nHarris said Wednesday that she will not run for California governor but stopped short of ruling out a 2028 presidential bid.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'There's no authenticity behind her'","url":"https://dailycaller.com/2025/07/31/kevin-mccarthy-kamala-harris-107-days-book/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/Former-Republican-House-Speaker-Kevin-McCarthy-raised-some-pointed-questions-on-Fox-News-Thursday-regarding-fo","video":null,"publish_date":"2025-08-01 01:03:31","author":"Mariane Angela","authors":["Mariane Angela"],"language":"en","source_country":"US","sentiment":-0.128},{"id":347092516,"title":"\"The irony of two people being cancelled\" - Internet reacts to Kamala Harris appearing on Stephen Colbert's \"The Late Show\"","text":"Former US Vice President Kamala Harris will be seen in a conversation with Stephen Colbert on The Late Show on Thursday, July 31, 2025. This would be Harris' first TV interview since the 2024 presidential elections, which she lost against President Donald Trump. This news surfaced a day after Harris announced she wouldn't run for the office of Governor of California in 2026.In an Instagram post, Kamala Harris also recently announced that she will be promoting her new book, 107 Days. The book includes details about her experience of being a presidential candidate for a brief period after the withdrawal of the 46th President of the United States, Joe Biden, from the race.Meanwhile, netizens flooded social media platforms with their reactions to the news of Harris' upcoming interview on The Late Show with Stephen Colbert. Many seemed to draw parallels between Harris and Colbert.\"The irony of two people being cancelled on a late show is hilarious,\" one user tweeted.Zach Hayes @znhayes24LINKThe irony of two people being cancelled on a late show is hilarious. Several others also made similar kind of comments.\"Perfect, two comedians, one stage. Let's see if she finally answers a question without giggling or dodging. At least the laugh track won’t have to work too hard tonight!\" a netizen wrote.\"Both were canceled,\" wrote another one.\"I'm kind of okay with this show going away actually,\" added another.While many netizens seemed to mock the duo, this upcoming appearance received support as well. Many expressed interest and stated that they would want to watch the episode.\"Kamala's gonna slay that late night stage,\" one user commented.\"She will announce she's running again I hope,\" another user tweet.\"oh we will be tuning in,\" wrote another netizen.Many netizens made mentions of Stephen Colbert's show ending next year. The cancellation of The Late Show came days after CBS' parent company, Paramount, entered into a settlement, after President Trump sued them over an interview with then-VP Kamala Harris on 60 Minutes, claiming that it was edited to \"tip the scales in favor of the Democratic party,\" as per the BBC.During his opening monologue on July 14, Stephen Colbert addressed the $16 million settlement, calling it \"a big fat bribe.\" The coincidence of the timings of the talk show's cancellation and Colbert's comments led to speculation that The Late Night was being taken off the air because of those comments, despite the network citing financial reasons.President Trump chimed in on the cancellation of Stephen Colbert's show, while many celebrities criticized the moveMany celebrities and well-known personalities have reacted to the cancellation of the CBS Network show hosted by Stephen Colbert. This included stars like Ben Stiller, John Cusack, Rachel Zegler, Judd Apatow, and Adam Scott.However, amid these supporters, President Donald Trump uploaded a post on Truth Social on July 30, addressing the cancellation. In his post, he denied the accusations that he was the reason why the show was cancelled.He wrote in his post:\"The reason he was fired was a pure lack of TALENT, and the fact that this deficiency was costing CBS $50 Million Dollars a year in losses - And it was only going to get WORSE!\"President Trump addresses rumors speculating he was the reason behind The Late Show's cancellation (Image via Truth Social/@realDonaldTrump)The support for Stephen Colbert did not stay limited to social media posts and tweets. Last week, actress Molly Gordon was a guest on an episode of The Late Show. According to Harper's Bazaar, Gordon was wearing a t-shirt that read: \"I ❤️ THE LATE SHOW WITH STEPHEN COLBERT.\"Other late-night TV show hosts like Jimmy Fallon, Seth Meyers, Jon Stewart, and John Oliver attended one of the episodes of the show to extend their support to Colbert. The outlet also reported that a petition criticizing the cancellation of the show was submitted to Paramount, and it had more than 250,000 signatures.Many fans also reportedly gathered outside the Ed Sullivan Theater to criticize the decision taken by Paramount. However, as of now, there have been no updates about any retraction of the decision to cancel the show.Stephen Colbert joked about an alternative career optionThe Late Show with Stephen Colbert will air for the last time in May 2026. During the July 28 episode, Colbert jokingly opened up about what his next venture could be, consulting the guests of the episode, podcasters Bowen Yang and Matt Rogers.\"I'm going to need a gig soon. So, sell me on podcasting. Is it fun?\" Stephen Colbert asked.Yang and Rogers went along with the joke and said that if Colbert were to start a podcast, he would push them out of the 100 Best Podcasts of All Time list published by Time Magazine. However, on a serious note, Rogers suggested the comedian just be true to himself if he ever wanted to start a podcast. At one point, Stephen Colbert even asked the duo if they would produce his hypothetical podcast, to which they responded positively.As of now, no official announcement about an audio series has been made. Many fans and netizens are currently eagerly waiting to watch Kamala Harris' interview with Stephen Colbert.","summary":"Former US Vice President Kamala Harris will be seen in a conversation with Stephen Colbert on The Late Show on Thursday, July 31, 2025.","url":"https://www.sportskeeda.com/us/shows/news-the-irony-two-people-cancelled-internet-reacts-kamala-harris-appearing-stephen-colbert-the-late-show","image":"https://staticg.sportskeeda.com/editor/2025/08/ca253-17539991644022-1920.jpg","video":null,"publish_date":"2025-07-31 23:39:55","author":"Aaratrika Bal","authors":["Aaratrika Bal"],"language":"en","source_country":"in","sentiment":-0.208},{"id":347092030,"title":"Kamala Harris’ new book is sure to be another self-congratulatory look at how she lost — please unburden us","text":"They say history is written by the victors.\n\nBut, following Hillary Clinton’s template, presidential loser Kamala Harris is giving the world her take – whether it’s wanted or not.\n\nOn Wednesday, Harris announced that she wasn’t running for California Governor in 2026.\n\nAnd a day later, she told disappointed “KHive” dwellers – all remaining five of them – they needn’t fret.\n\nThe politician formerly know for being “Brat,” said she has written a memoir of the “shortest presidential campaign in modern history.”\n\nA diary of defeat.\n\nIt’s called “107 Days.”\n\nAppropriately, she’ll be promoting it on CBS’s recently canceled “The Late Show with Stephen Colbert.”\n\nSo. Much. Winning.\n\n“With candor and reflection, I’ve written a behind the scenes account of that journey. I believe there’s value in sharing what I saw, what I learned and what I know it will take to move forward,” she said in a video shared on X.\n\nAnything written on her ill-fated attempt to win the White House should be a grim autopsy on a spectacularly bad campaign with a historically terrible candidate.\n\nA manual on what not to do.\n\nBut, judging by the tone of her messaging, she’s clearly giving her disastrous presidential run a postmortem glow up.\n\nHarris is pumping it up to be a profound work that unlocks some long-held secrets about the wants and needs of Americans – as if we don’t already know they are affordability, freedom, safety and Sydney Sweeney in a denim ad.\n\nI’ll bet it’s filled with vignettes about people she met along the way, the pages padded with selections from her word salad bar. In it, she’ll write about being “unburdened,” “eating ‘no’ for breakfast” and all about the “dreams and aspirations” of Americans.\n\n“In writing this book, one truth kept coming back to me. Sometimes the fight takes a while, but I remain full of hope and I remain clear-eyed. I will never stop to make our country reflect the very best of its ideals,” she added.\n\nHow comforting for us.\n\nThe truth is that this will be just like her campaign: filled with empty platitudes and absent of substance.\n\nI expect other selections to focus on her running mate Tim Walz becoming her Doritos gimp, tossing her bags of her favorite snack during a campaign stop at a Sheetz.\n\nOr maybe how she was able to marshal the entire entertainment establishment to play concerts for her rallies in cities across the nation. And how cool it was to have Oprah throw a star-studded special for her.\n\nHers was a campaign that really connected with everyday folks.\n\nLet’s remember that Harris was made the Dem candidate because after Joe Biden’s catastrophic debate against Donald Trump, the party could no longer hide the fact that they were running a confused old man grappling with disqualifying cognitive issues.\n\nHer very placement in that role circumvented the democratic process. She didn’t win a primary. She arrived on the scene and was instantly bubble wrapped by the party and most of the institutional media, who threw her pep rallies in their pages and on their airwaves.\n\nAnd still, she was ill-prepared, out of her depth, unable and unwilling to articulate her shift from her extremely woke political positions of 2020, which had become toxic.\n\nThe stories that would truly be of interest will be avoided like she avoided Joe Rogan. Big mistake.\n\nFor instance, how did it feel to fumble the layup from “The View” co-host Sunny Hostin, who asked Harris what she’d do differently than Biden.\n\nShe replied, “there is not a thing that comes to mind.”\n\nOr what she actually knew about Biden’s mental decline?\n\nAt what point did she realize that Tampon Tim [Walz] was the undisputed lying champion of the world?\n\nDid she regret telling a tale about working the fryer at McDonalds?\n\nAnd even better, we’d love the real behind-the-scenes play-by-play after her husband Doug Emhoff was accused by an ex-girlfriend of slapping her at the Cannes film festival in 2012.\n\nNo one dared ask Harris or Emhoff, who had been held up as some sexy male feminist, about the disturbing allegations.\n\nThere are so many lingering questions.\n\nBut she will offer no personal insights, no authentic look at the woman behind the cackle or raw assessment of what really happened.\n\nThe book is only meant to serve as more propaganda – a useless attempt to revive her dead political career.","summary":"Following Hillary Clinton's template, presidential loser Kamala Harris is giving the world her take – whether it's wanted or not.","url":"https://nypost.com/2025/07/31/opinion/kamala-harris-new-book-is-a-sure-to-be-another-self-congratulatory-look-at-how-she-lost-please-unburden-us/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-rww9rzb8e-1753997614492_2d7d44.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/vQg7or6L-RyIcpnTz.mp4","publish_date":"2025-07-31 23:22:45","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","source_country":"us","sentiment":-0.017},{"id":347094370,"title":"Kamala Harris will not run for California governor, but will instead publish a book about her presidential run","text":"to top close Video This video is playing in picture-in-picture.\n\nOn Air July 31, 2025 07:38 \n\n Kamala Harris will not run for California governor, but will instead publish a book about her presidential run \n 'Stacy on the Right' on SiriusXM Patriot Stacy Washington discusses former Vice President Kamala Harris' book announcement and her political future on 'The Bottom Line.'\n\nTags WHAT TO WATCHSHOWSTHE BOTTOM LINE | LATEST EPISODESPOLITICSELECTIONV-VIDEOS","summary":"&apos;Stacy on the Right&apos; on SiriusXM Patriot Stacy Washington discusses former Vice President Kamala Harris&apos; book announcement and her political future on &apos;The Bottom Line.&apos;","url":"https://www.foxbusiness.com/video/6376411358112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/0f22e2e0-2ac7-4c1c-a8c0-b4635d1233d3/7a9b5ec4-0242-4df7-8ecd-b5e8b95e8fb1/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 23:22:16","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.164},{"id":347087990,"title":"Justice department throws cold water on calls for witnesses to get paid leave throughout trials","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nWitnesses in a trial are currently only entitled to paid leave for the day they are testifyingAlamy Stock Photo\n\nThe Morning Lead\n\nJustice department throws cold water on calls for witnesses to get paid leave throughout trials\n\nPaula Fay was not entitled to paid leave to attend the trial of her brother, who raped her when she was a child.\n\n12.06am, 1 Aug 2025\n\nShare options\n\nOPPOSITION POLITICIANS HAVE backed calls for court witnesses to be entitled to paid leave for the duration of a trial, rather than the current system which only extends leave for the day a witness is giving evidence.\n\nPaula Fay, a woman who has spoken out about reforms needed in the legal system after testifying about being sexually abused by her older brothers, Richard and Bernard Brennan, had to take annual leave or unpaid leave to attend her abusers’ trials this month.\n\nGary Gannon, Dublin Central TD and Social Democrats spokesperson on justice, has said it is “sickening” that Paula did not have an entitlement to paid leave to take part in the “traumatic” process.\n\nBut the Department of Justice has indicated that it does not have any plans to amend the system to bring leave entitlements for witnesses in line with what is available for jurors.\n\nSpeaking with Oliver Callan on RTÉ Radio One yesterday, Paula and her sister, Catherine Wrightstone, said witnesses should be entitled to the same paid leave jurors receive.\n\nEarlier this month, their brother, Richard Brennan, a former priest, was sentenced to eight years in jail for the rape and sexual assault of his sisters. Their older brother Bernard was also jailed for four-and-a-half years for sexual abuse of his sisters.\n\nThe three sisters involved in the case, Paula, Catherine and Yvonne, gave evidence to the court.\n\nPaula said that as the trial involved herself and her siblings, she wanted to attend all of it, rather than only attending when she herself was giving evidence.\n\n“I know that jury members are entitled to be paid through their employment when they’re on a jury, for the entire trial, and I feel that something needs to change that a witness is also doing their civic duty. I feel it is exactly the same,” she said.\n\nSpeaking to The Journal today, Gannon said he supports the “urgent reform” of witness entitlements to paid leave.\n\nHe said: “It’s sickening to hear Paula say she had to use annual or unpaid leave just to attend her brother’s trial and take part in something as important and traumatic as this process.”\n\nAdvertisement\n\n“I fully support Paula, Catherine, and Yvonne in their call for urgent reform of witness leave entitlements – especially for those involved in cases as horrendous as this one,” he added.\n\nHe said witnesses are performing a “civic duty”, just like jurors, and deserve the same protections and support for the full duration of a trial.\n\n“It’s the very least we owe people who show such courage in seeking justice,” he added.\n\nSinn Féin spokesperson for justice Matt Carthy told The Journal that the entitlement to court leave should be examined.\n\nHe said: “There is clearly a need for greater support for victims and survivors for whom the court process can be very traumatic. While supports have improved much more can be done.”\n\n“We have to listen to people like Paula Fay and Catherine Wrightstone when they tell us about their experience of the judicial process and what they feel are the deficiencies in the system at present,” he said.\n\nHe added that other states have court leave entitlements for witnesses, and the government should look at how a similar entitlement could be introduced here.\n\nHowever, in a statement to The Journal, the Department of Justice, said that although they acknowledge the “immense courage” it takes for survivors of sexual violence to report abuse and participate in the justice process, there is an “important distinction” between jury service and being a witness.\n\nIt said: “Jury duty is a mandatory civic obligation while witnesses including survivors of sexual offences are generally required to attend court only for the time needed to give their evidence.”\n\nIt added that witnesses may also be entitled to witness expenses for travel to court and for days they miss out on wages due to testifying.\n\nTo receive these expenses, garda must apply to the judge to have the witnesses’ expenses paid, the judge must agree and make an order.\n\nIt said: “Witnesses, including survivors of sexual offences, are typically only required to attend court to give their evidence, and as full attendance is not expected, extended expenses do not usually apply.”\n\nIt added that witnesses can access supports such as court accompaniment and counselling are available through organisations which are funded by the department of justice.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nSophie Finn\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Justice department throws cold water on calls for witnesses to get paid leave throughout trials”.\n\nRecipient's Email\n\nFeedback on “Justice department throws cold water on calls for witnesses to get paid leave throughout trials”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nCatherine Wrightstone\nOliver Callan\n\nSocial Democrats\nThe Morning Lead\nWitness leave\n\nNews in 60 seconds\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\nmisrepresented\nClimate scientists accuse US energy department of twisting their work in new report\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\nVanessa O'Callaghan\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Paula Fay was not entitled to paid leave to attend the trial of her brother, who raped her when she was a child.","url":"https://www.thejournal.ie/politicians-support-reform-of-witness-paid-leave-entitlements-6778900-Aug2025/","image":"https://img2.thejournal.ie/article/6778900/river/?height=400&version=6779264","video":null,"publish_date":"2025-07-31 23:05:44","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":0.083},{"id":347087694,"title":"Charlamagne suggests Kamala Harris should start a podcast instead of seeking elected office again","text":"Radio host Charlamagne tha God argued on Thursday that former Vice President Kamala Harris’ time in electoral politics is over, but there could still be a role for her in the Democratic Party. Harris made headlines this week with her announcement that she will not be running in 2026 to be the governor of her home state of California. In her statement explaining her decision, Harris said, \"For now, my leadership — and public service — will not be in elected office.\" She added, \"I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.\" \"Breakfast Club\" co-host Morgyn Wood noted that the announcement \"comes as speculation remains regarding the former presidential candidate possibly running for the White House again in 2028.\" Wood turned to Charlamagne to ask whether Democrats need \"new blood\" instead. CHARLAMAGNE CRITICIZES OBAMA'S 'MIND-BOGGLING' ADVICE TO DEMOCRATS AS TOO LITTLE, TOO LATE \"Yeah,\" Charlamagne agreed on her not running again in 2028, but added, \"I think Kamala can definitely be a leader in the Democratic Party.\" Charlamagne laid out a plan for how Harris could ingratiate herself with Americans as a cultural figurehead rather than a candidate lobbying for their support. He argued that over the past five years, much of Harris’ strategy with public engagement has been \"transactional;\" interacting with the American people only to solicit their support via votes. With a new shift to being a purely cultural leader for the Democratic Party, the American people could get to know Harris as a person, something he says they were never adequately able to do before. After another co-host speculated that ingratiating herself with the public could have changed the course of the 2024 election, Charlamagne argued that the electoral prospects of Harris and the current crop of Democrats look decisively grim going forward. \"I don't know if she should run again, but I definitely would like to see her write a book. I definitely would like to, you know, see her start a podcast and just build a real connection with people, you know, and she is - I mean relatively young,\" Charlamagne said. \"I just don't know what's going to happen in 2028, man. I just think Democrats suck so bad. I don't - I don't know.\" Harris announced Thursday she will be releasing a book about the 107 days of her failed presidential campaign. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP FOX News Channel’s Lara Trump will present an exclusive interview with Charlamagne on Saturday, August 2 during \"My View with Lara Trump\" (9-10 PM/ET). During the interview, Lara Trump and Charlamagne will discuss the NYC mayoral race, the state of the Democratic Party and President Trump’s second term so far. Charlamagne will also share his own struggles with addiction, his mental health journey and other news of the day.","summary":"Charlamagne tha God mourned how the current crop of Democrats &quot;suck so bad&quot; suggesting Kamala Harris is better as a Democratic figurehead rather than a contender for office.","url":"https://www.foxnews.com/media/charlamagne-suggests-kamala-harris-should-start-podcast-instead-seeking-elected-office-again","image":"https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Kamala-Harris.jpg","video":"https://www.foxnews.com/video/6376400074112","publish_date":"2025-07-31 23:00:23","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":0.044},{"id":347086570,"title":"The Shortest Campaign Ever","text":"After months of speculation, it was announced former Vice President Kamala Harris is NOT running for governor of California. However, she is writing a memoir about her short-lived presidential campaign. Kennedy thinks not running is the end of Harris’ political career and she should go out with a bang. Unfortunately, that’s not the case here. \n\nFollow Kennedy on Twitter: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠@KennedyNation⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ \n\nKennedy Now Available on YouTube: ⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://link.chtbl.com/kennedyytp⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠\n\nFollow on TikTok: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.tiktok.com/@kennedy_foxnews⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠\n\nJoin Kennedy for Happy Hour on Fridays! ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://youtube.com/playlist?list=PLWlNiiSXX4BNUbXM5X8KkYbDepFgUIVZj⁠⁠\n\nLearn more about your ad choices. Visit podcastchoices.com/adchoices","summary":"After months of speculation, it was announced former Vice President Kamala Harris is NOT running for governor of California. However, she is writing a memoir about her short-lived presidential campaign. Kennedy thinks not running is the end of Harris&#8217; political career and she should go out with a bang. Unfortunately, that&#8217;s not the case here.  Follow Kennedy on Twitter: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠@KennedyNation⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠   Kennedy Now Available on YouTube: ⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://link.chtbl.com/kennedyytp⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Follow on TikTok: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.tiktok.com/@kennedy_foxnews⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Join Kennedy for Happy Hour on Fridays! ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://youtube.com/playlist?list=PLWlNiiSXX4BNUbXM5X8KkYbDepFgUIVZj⁠⁠ Learn more about your ad choices. Visit podcastchoices.com/adchoices","url":"https://radio.foxnews.com/2025/07/31/the-shortest-campaign-ever/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2023/03/FEATURED_IMAGE_Kennedy_Saves_The_World312023.png","video":null,"publish_date":"2025-07-31 23:00:12","author":"Marah Jette","authors":["Marah Jette"],"language":"en","category":"politics","source_country":"us","sentiment":0.293},{"id":347094862,"title":"Skydance Tells Dem Senators Paramount Deal Didn’t Break Anti-Bribery Laws and It Was ‘Not Involved’ in Colbert Cancellation","text":"In a letter to Senate Democrats, the general counsel for Skydance says it has “fully complied” with all laws, including anti-bribery laws, while completing its merger with Paramount, TheWrap has learned. \n\nStephanie Kyoko McKinnon also noted that the studio was not involved in the decision to cancel “The Late Show With Stephen Colbert.”\n\nThe letter was sent in response to one written by Sen. Elizabeth Warren (D-MA), Bernie Sanders (D-VT) and Ron Wyden (D-OR) amidst President Donald Trump’s claim that Paramount Global’s $16 million settlement of his lawsuit against CBS also came with an additional commitment of $16 million in public service ads.\n\n“Throughout its history and during the review of the proposed acquisition of Paramount, Skydance has fully complied with all applicable laws, including our nation’s anti-bribery laws,” Skydance’s McKinnon wrote.\n\nWith regards to Trump’s lawsuit over a “60 Minutes” interview with former Vice President Kamala Harris, Skydance says it “was neither a party to the lawsuit nor to Paramount’s settlement of its litigation with the president.” McKinnon noted that under the terms of the merger deal, “Paramount had full discretion to settle any outstanding litigation unrelated to the transaction for up to $50 million without Skydance’s consent.”\n\nAs for the “Late Show” cancellation, McKinnon wrote that Paramount did notify Skydance that it would be ending the three-decade-old late night talk show, “but only after Paramount reached its own independent decision, and shortly before Paramount publicly acknowledged the cancellation.”\n\nColbert announced the end of “The Late Show” on July 18, with the show coming to an end when its current season with CBS ends in May 2026. The announcement was immediately met with criticism from Democrats who saw the cancellation as politically motivated, pointing to the announcement coming four days after Colbert called Paramount’s settlement of Trump’s lawsuit a “big fat bribe” to get the Federal Communications Commission, led by Trump appointee Brendan Carr, to approve Skydance and Paramount’s $8 billion merger. \n\nIn response, Paramount co-CEO George Cheeks wrote in a letter to Democratic Sen. Ed Markey that the cancellation was a “purely financial” decision due to the ongoing decline of late-night television alongside that of linear TV, even as “The Late Show” remained the highest-rated network late-night program. Cheeks also said that the decision was made “well before” Colbert’s on-air jabs at his network’s parent company. \n\nOn the news media front, McKinnon insisted to the Democrats that its promise to hire an ombudsman for CBS News as part of a deal for FCC approval of the merger will not lead to influence from the Trump Administration over editorial decisions. \n\n“Skydance believes in unbiased journalism and embraces a broad range of viewpoints. Upon closing of the acquisition, these guiding principles will ensure that editorial decision-making at CBS News reflects the varied ideological perspectives of American viewers,” she wrote. “Skydance likewise believes all content should reflect independent editorial judgment and be free from government intrusion and politicization.”\n\nSkydance is expected to close its merger with Paramount Aug. 7.","summary":"General counsel Stephanie Kyoko McKinnon responds to corruption concerns raised by Elizabeth Warren, Bernie Sanders and Ron Wyden in a new letter\n\n\nThe post Skydance Tells Dem Senators Paramount Deal Didn&#8217;t Break Anti-Bribery Laws and It Was &#8216;Not Involved&#8217; in Colbert Cancellation appeared first on TheWrap.","url":"https://www.thewrap.com/skydance-responses-elizabeth-warren-bernie-sanders-paramount-deal-anti-bribery/","image":"https://www.thewrap.com/wp-content/uploads/2025/06/Paramount-Annual-Meeting.jpg","video":null,"publish_date":"2025-07-31 22:56:45","author":"Jeremy Fuster","authors":["Jeremy Fuster"],"language":"en","source_country":"US","sentiment":-0.194},{"id":347084524,"title":"'We have to bring back Joe McCarthy': Fox host rages at 'communist' NYC mayoral candidate","text":"Fox News intensified its ongoing attacks on Zohran Mamdani on Thursday, as host Jesse Watters delivered a sweeping monologue accusing the popular but controversial Democratic mayoral nominee of being a communist, portraying his supporters as “radicals,” and calling for the return of an anti-communist crusader.\n\n“These are the same dumb Marxist ideas that we’ve been hearing for decades,” Watters declared, “and it’s just destruction. At a certain point, you have to think, democracy is not a suicide pact, right?”\n\n“We’re just not gonna allow a faction of radicals in a great city like this to come in, elect the guy, and have it destroyed,” he said, appearing to suggest some form of action against Mamdani, who is not a communist but a self-described Democratic socialist.\n\n“What kind of democracy is that?” Watters asked, suggesting electoral outcomes he opposes are not true democracy. “It’s not tolerable to do that.”\n\nREAD MORE: White House Pushes for Trump to Be Awarded Nobel Peace Prize—and One for Economics\n\nDescribing Mamdani as “Kamala Harris with a beard,” he went on to declare that while America “won the Cold War … Marxism survived, and these teachers at universities got bolder.”\n\n“So you have unchecked immigration, and you have unchecked indoctrination, and you spit them all out into Manhattan, and they vote for a communist who wants to destroy the city, and we’re supposed to sit back and let it happen? I don’t think that’s a very good idea,” Watters declared, appearing to suggest, falsely, that undocumented immigrants and non-citizens are voting.\n\n“I think we have to bring back Joe McCarthy.”\n\nWatch the video below or at this link.\n\nREAD MORE: GOP Senator Calls for Ban on ‘All These Chinese’ Entering US to Study","summary":"Fox News intensified its ongoing attacks on Zohran Mamdani on Thursday, as host Jesse Watters delivered a sweeping monologue accusing the popular but controversial Democratic mayoral nominee of being a communist, portraying his supporters as “radicals,” and calling for the return of an anti-communist crusader.\n\n“These are the same dumb Marxist ideas that we’ve been hearing for decades,” Watters declared, “and it’s just destruction. At a certain point, you have to think, democracy is not a suicide pact, right?”\n\n“We’re just not gonna allow a faction of radicals in a great city like this to come in, elect the guy, and have it destroyed,” he said, appearing to suggest some form of action against Mamdani, who is not a communist but a self-described Democratic socialist.\n\n“What kind of democracy is that?” Watters asked, suggesting electoral outcomes he opposes are not true democracy. “It’s not tolerable to do that.”\n\nREAD MORE: White House Pushes for Trump to Be Awarded Nobel Peace Prize—and One for Economics\n\nDes","url":"https://www.alternet.org/fox-host-communist/","image":"https://www.alternet.org/media-library/image.jpg?id=51412162&width=1200&height=600&coordinates=0%2C85%2C0%2C86","video":null,"publish_date":"2025-07-31 22:48:21","author":"David Badash","authors":["David Badash"],"language":"en","category":"politics","source_country":"us","sentiment":0.059},{"id":347105318,"title":"Gwinn: LeBron's 2020 'Bubble Championship' Should Get an Asterisk","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBART\n\nTariff Deals\nTrump Interview\nNYC Shooting\nRussia Hoax Exposed\n\nIsrael vs Hamas\n\nGwinn: LeBron’s 2020 ‘Bubble Championship’ Should Get an Asterisk\n\n Adam Pantozzi/NBAE via Getty Images\n\nDylan Gwinn31 Jul 2025 \n\nDaryl Morey\nLeBron James\nLos Angeles Lakers\n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nDemocrat Claims Cincinnati Fight Victims 'Begged for That Beat Down'\nTrump Threatens Canada: No Trade Deal if Hamas Rewarded with State\nTrump Announces $350 Billion South Korea Trade Deal\nActivists Delete Fundraiser for Arrested Migrant Wanted for Murder\nExclusive-Bessent Warns of ‘Caracas on the Hudson’ as Young Voters Turn to\nTrump Slaps Sanctions on Palestinian Authority for Seeking Unilateral State\nBerlin Demands Start of Process to Recognize Palestinian State\nCincinnati Police Chief Claims Violent Mob Footage Missing 'Context'\nWhistleblower Reveals How They Were Threatened to Go Along with Russia Hoax\nBreitbart Business Digest: The Day Bessent Glitched the Democrats\n\nFROM THE HOMEPAGE\n\nBreitbart Business Digest: The Day Bessent Glitched the Democrats\nThe Hidden Logic to Trump’s Trade Deals Revolves Around China\nChina Gives Up on Stimulus for Ailing Economy as Trump’s Tariffs Take Toll\nWhite House: Trump to Set Tariffs Before Midnight Deadline\nTrump Tariff Threat Triggers Political Firestorm in India\nTrump Strikes 90-Day Tariff Deal with Mexico: ‘25 Percent Fentanyl Tariff, 50 Percent on Steel, Copper, Aluminum’\nTom Tiffany Calls For Cutting Off Funding to Wisconsin Sanctuary County Where Hallie Helgeson and Brady Heiling Were Killed\nLaboratory for Lawfare: How the Left Is Test-Running Censorship Tactics in Brazil\nWhistleblower Reveals How They Were Threatened to Go Along with Obama-Directed Russia Hoax\nExclusive — Marsha Blackburn on Trade Victories: Americans Voted for What Trump Is Doing\nKamala Harris to Join Stephen Colbert for First Interview After Historic Election Loss\nGwinn: LeBron’s 2020 ‘Bubble Championship’ Should Get an Asterisk \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"Wednesday passed by as a typical day ending in \"y\" for most people. But there's one person for whom Wednesday of this week was especially tough: former Rockets General Manager Daryl Morey.\n\n\nThe post Gwinn: LeBron&#8217;s 2020 &#8216;Bubble Championship&#8217; Should Get an Asterisk appeared first on Breitbart.","url":"https://www.breitbart.com/sports/2025/07/31/gwinn-lebrons-2020-bubble-championship-should-get-an-asterisk/","image":"https://media.breitbart.com/media/2025/07/Adam-Pantozzi_NBAE-via-Getty-Images-2-640x335.jpg","video":null,"publish_date":"2025-07-31 22:42:07","author":"Dylan Gwinn","authors":["Dylan Gwinn"],"language":"en","source_country":"US","sentiment":-0.06},{"id":347089518,"title":"Economy is getting worse under Trump’s leadership, Americans say in new poll on eve of his tariff D-Day","text":"A new poll shows Donald Trump underwater on the issue of his tariff agenda as Friday’s enforcement deadline looms for the “Liberation Day” measures he announced in April.\n\nIn 2024, Trump won election to a nonconsecutive second term, boosted by the same issues that propelled him to victory the first time around. Concerns over immigration and the economy were at the forefront of voters' minds, though he received a key boost from the implosion of Joe Biden’s campaign.\n\nBut in a Times of London/YouGov poll out Thursday, the president’s tariff agenda is one of the biggest anchors driving down his approval numbers. \n\nSome 48% of Americans graded Trump’s job performance over the first six months of his administration as poor, compared to just 21% who rated it excellent, 16% who rated it good and 11% who rated it as fair.\n\nOn the core issue of tariffs, Trump is clearly tanking — despite months of pronouncements from the White House of America’s impending “Golden Age.”\n\nFour in ten Americans say that Trump’s tariffs will make the country poorer and stifle economic growth. Just 26% believe the White House’s line about economic prosperity coming down the pike.\n\nAnd most alarmingly for the White House, inflation still ranks as the No. 1 issue for voters. That could prove to be dangerous ground for the president as the summer concludes with potentially sharp increases to consumer prices stemming from the president’s reciprocal tariffs, which are currently set as high as 50% with at least one trading partner, Brazil.\n\nA CBS News poll further dove into the president’s declining numbers on the economy.\n\nSix in 10 of voters under 30 now say that Trump’s policies are harming the economy, and making them worse off financially. Seven in 10 voters in the same category say that they didn’t believe the president is focused enough on lowering prices for consumers.\n\nIf Donald Trump is losing ground with the younger voters he peeled off from Democrats in 2024, Republicans are set for trouble in the midterm elections next year. Polling isn’t yet registering significant voter support for the GOP budget reconciliation package, the “big, beautiful bill”, as it’s been overshadowed by the president’s tariffs and mass deportation agenda, among other issues.\n\nAnother factor driving down Trump’s numbers with younger voters is Jeffrey Epstein.\n\nThe Justice Department blew up the investigation into Epstein, a convicted pedophile and sex criminal who died in 2019, when in early July the agency declared that the billionaire financier died by suicide, as had previously been found, and that no evidence linking him to accomplices, other than Ghislaine Maxwell, was uncovered.\n\nThe sudden declaration that the “Epstein Client List”, which Vice President JD Vance and others in the administration pledged to release, supposedly did not exist at all erupted into a wildfire on the MAGA right, particularly among Trump’s younger supporters.\n\nTrump then spent the month of July embracing a series of increasingly obvious attempts at distraction, infuriating many and driving speculation even higher.\n\nThe Times/YouGov poll found that a much larger share of voters, more than four in ten, think that Trump and his team have partially or completely lied in their public statements regarding the case. Less than 20% of Americans believe them.\n\nImmigration has been another issue where the president has lost ground as the White House and Department of Homeland Security have accelerated mass deportation programs under his second term. Images of immigration enforcement raids have caused massive protests in Los Angeles and alarmed many Americans including Trump-supporting independents around the country.\n\nNearly every poll on the Decision Desk HQ Average, with the exception of two surveys conducted by Republican outfits, now shows Trump with popularity ratings in the negative, some by double digits.\n\nSome pollsters have speculated that Trump began at a deficit other presidents escaped in their first six months due in large part to the circumstances of his 2024 victory and the rank unpopularity that the Democratic Party encouraged with its jumbled mess of a re-election campaign for Biden and later Kamala Harris. \n\nComing into 2025, the president was already burdened by some of the highest disapproval ratings of any incoming president in history.","summary":"A new poll shows Donald Trump underwater on the issue of his tariff agenda as Friday’s enforcement deadline looms for the “Liberation Day” measures he announced in April.","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-tariffs-august-deadline-poll-b2799990.html","image":"https://static.independent.co.uk/2025/07/30/18/52/U-S--President-Trump-signs-the-VA-Home-Loan-Program-Reform-Act-at-the-White-House-in-Washington-D-C.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/9sB8zRqr-4VHSaSK0.mp4","publish_date":"2025-07-31 22:41:11","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.204},{"id":347105314,"title":"China Gives Up on Stimulus for Ailing Economy as Trump's Tariffs Take Toll","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBART\n\nTariff Deals\nTrump Interview\nNYC Shooting\nRussia Hoax Exposed\n\nIsrael vs Hamas\n\nChina Gives Up on Stimulus for Ailing Economy as Trump’s Tariffs Take Toll\n\n WH Photo / Joyce N. Boghosian via Flickr\n\nJohn Hayward31 Jul 2025 \n\nNational Security\n\nXi Jinping \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nDemocrat Claims Cincinnati Fight Victims 'Begged for That Beat Down'\nTrump Threatens Canada: No Trade Deal if Hamas Rewarded with State\nTrump Announces $350 Billion South Korea Trade Deal\nActivists Delete Fundraiser for Arrested Migrant Wanted for Murder\nExclusive-Bessent Warns of ‘Caracas on the Hudson’ as Young Voters Turn to\nTrump Slaps Sanctions on Palestinian Authority for Seeking Unilateral State\nBerlin Demands Start of Process to Recognize Palestinian State\nCincinnati Police Chief Claims Violent Mob Footage Missing 'Context'\nWhistleblower Reveals How They Were Threatened to Go Along with Russia Hoax\nBreitbart Business Digest: The Day Bessent Glitched the Democrats\n\nFROM THE HOMEPAGE\n\nBreitbart Business Digest: The Day Bessent Glitched the Democrats\nThe Hidden Logic to Trump’s Trade Deals Revolves Around China\nChina Gives Up on Stimulus for Ailing Economy as Trump’s Tariffs Take Toll\nWhite House: Trump to Set Tariffs Before Midnight Deadline\nTrump Tariff Threat Triggers Political Firestorm in India\nTrump Strikes 90-Day Tariff Deal with Mexico: ‘25 Percent Fentanyl Tariff, 50 Percent on Steel, Copper, Aluminum’\nTom Tiffany Calls For Cutting Off Funding to Wisconsin Sanctuary County Where Hallie Helgeson and Brady Heiling Were Killed\nLaboratory for Lawfare: How the Left Is Test-Running Censorship Tactics in Brazil\nWhistleblower Reveals How They Were Threatened to Go Along with Obama-Directed Russia Hoax\nExclusive — Marsha Blackburn on Trade Victories: Americans Voted for What Trump Is Doing\nKamala Harris to Join Stephen Colbert for First Interview After Historic Election Loss\nGwinn: LeBron’s 2020 ‘Bubble Championship’ Should Get an Asterisk \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"The Chinese Communist Party’s Politburo signaled this week that it would make no further efforts to stimulate consumer demand in the flagging economy.\n\n\nThe post China Gives Up on Stimulus for Ailing Economy as Trump&#8217;s Tariffs Take Toll appeared first on Breitbart.","url":"https://www.breitbart.com/asia/2025/07/31/china-gives-up-on-stimulus-for-ailing-economy-as-trumps-tariffs-take-toll/","image":"https://media.breitbart.com/media/2025/07/54675980512_9f7724e447_k-640x335.jpg","video":null,"publish_date":"2025-07-31 22:35:34","author":"John Hayward","authors":["John Hayward"],"language":"en","source_country":"US","sentiment":-0.122},{"id":347082706,"title":"Trump rakes in $1.4B as president to boost GOP in 2026 midterms","text":"WASHINGTON — President Trump has secured $1.4 billion in financial commitments since winning the 2024 election — filling his war chest to help Republicans keep the House and Senate in next year’s midterms, a source close to the commander in chief told The Post Thursday.\n\nTrump started raising the funds “the day after” he defeated then-Vice President Kamala Harris to become the 47th president, this person said.\n\nThe pledges come from several initiatives, including the Republican National Committee and Trump’s super PAC, Make America Great Again, Inc.\n\nTrump has hinted at having a large reserve of political cash in recent months and vowed to help out his allies however he can in their races against Democrats come 2026.\n\n“You know, in presidential races, they say when you win the presidency, usually the midterms don’t go well?” Trump, 79, asked Republican governors in the nation’s capital this past February before predicting: “I think we’re going to do great.”\n\nThe president’s party has lost seats in the House of Representatives in all but two midterm elections since 1938 — with 1998 and 2002 the lone exceptions. \n\nThe party that holds the White House has had better luck in the Senate during midterms, gaining seats on six occasions over the same period — including in 2018 and 2022. \n\n“I think we’re going to really increase our margins by a lot,” Trump predicted in February, saying the GOP had raised $608 million in the first three weeks of his second term and claiming that he was going to “keep bugging” donors up until the midterms to provide more cash.\n\n“So we’ve got that money, and I got to spend it somewhere … if I can’t spend it on me, I guess that means I’m going to be spending it on some of my friends, right?” the president told the governors. “A lot of my friends.”\n\nThe person close to Trump called the $1.4 billion intake “unprecedented” and predicted it will give Republicans “leverage” in their fight to expand their congressional margins.\n\n“The funds streaming in show how much support is behind President Trump. Having the financials to support candidates in the midterms will be a huge advantage,” they said. \n\nRepublicans currently hold a 219-212 majority in the House, with four vacancies to be filled later this year. The GOP also holds a 53-47 majority in the Senate, and will be defending 22 of the 35 seats up for grabs in 2026.\n\nVice President JD Vance was tapped to be the Republican National Committee’s finance chair in March. The post is an unusual one for a VP to hold, but will make him a focus of GOP fundraising efforts leading into the midterms and ahead of a likely presidential run in 2028.\n\nVance headlined a fundraising dinner in Nantucket last week, raking in $3 million in donations, The Post previously reported.","summary":"Trump started raising the funds \"the day after\" he defeated then-Vice President Kamala Harris to become the 47th president,","url":"https://nypost.com/2025/07/31/us-news/trump-rakes-in-1-4b-post-2024-win-to-boost-gop-in-2026-midterms/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/109038724.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/jpGUCYFo-RyIcpnTz.mp4","publish_date":"2025-07-31 22:21:48","author":"Diana Nerozzi","authors":["Diana Nerozzi"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.098},{"id":347082704,"title":"Zohran Mamdani’s public safety hypocrisy: Letters to the Editor — Aug. 1, 2025","text":"The Issue: After the Park Avenue shooting, Zohran Mamdani backtracks from calls to defund the NYPD.\n\nWith Zohran Mamdani arriving at slain NYPD Officer Didarul Islam’s home after his prior calls to “defund the police” and his assertion that “the NYPD is racist, anti-queer & a major threat to public safety,” Islam’s family should have spit in his face (“Zohran Thin Blue lyin’?,” July 31).\n\nWhat will sleazeball Mamdani not say to get elected? \n\nCan anyone believe anything he says?\n\nWilliam T. Fidurski\n\nMamdani went to the funeral of the hero Muslim cop and praised the police. \n\nDid he go to the funeral of the Jewish victim, Julia Hyman? \n\nOf course not.\n\nHe’s a total bigot, and his praise of the police rings so hollow. \n\nBut anything to get votes — right, Zo?\n\nSaul J. Mishaan\n\nI hope New Yorkers are smart enough to see through Mamdani’s lies about defunding the police.\n\nWe just went through this before with all of former Vice President Kamala Harris’ flip-flops, and now we see it happening again.\n\nEven Rep. Alexandria Ocasio-Cortez has gotten into the act. \n\nShe changed and voted in support of funding for Israel’s Iron Dome, which she never did before.\n\nDon’t politicians know we would respect them more if they stuck to what they truly believed in and stopped changing their views just to win an election?\n\nLet’s all pray somehow Mamdani doesn’t win.\n\nStephen Colasacco\n\nWhile situated in a heavily-secured Uganda compound, “defund the police” advocate Mamdani responded to the Park Avenue shooting with support for the NYPD.\n\nHopefully New York City voters will not be fooled by his fleeting backing for the NYPD, as he has made his viewpoints clear. \n\nMamdani does not advocate for law and order.\n\nEileen Corr\n\nBrewster, Mass.\n\nThanks for your excellent editorial (“Zohran’s ‘Defund’ Flip,” July 31). Maya Angelou said it best: “When someone shows you who they are, believe them the first time.”\n\nCharles T. Compton\n\nMamdani’s sudden change of heart on defunding the police should come as no surprise.\n\nOf all the radical changes he promises, his position on crime is what New Yorkers, including some loyal Democrats, find troubling. \n\nIt was the critical issue that allowed Mayor Adams to overcome a field of socialists in the last mayoral election.\n\nThe 345 Park Ave. murders provide a timely opportunity for Mamdani to bury his numerous anti-cop posts. \n\nHis democratic socialist base will be undeterred by his flip-flop, as he still represents a path to progressive policies.\n\nWith this platform change, he will have removed an obstacle in the minds of more moderate voters — if they or anyone else are naive enough to trust him.\n\nRichard J. Carhidi\n\nBorrowing from my experience in advertising, I have an appropriate nickname for Mamdani: The Smiling Cobra. \n\nHe’s always smiling through his lies!\n\nDermod Sullivan\n\nGreenwich, Conn.\n\nZohran Mamdani and others who have advocated for defunding the police have no place in public service.\n\nHad there been more police officers in the area around Park Avenue and 52nd Street, the horrific murders of four innocent people could have been prevented. \n\nWe need more police on the streets of New York, not less.\n\nWe need a greater police presence in our schools, houses of worship, office buildings, theaters, public parks and on our streets. \n\nWe need to save our cities and protect our citizens.\n\nBetty Schwartz\n\nLivingston, NJ\n\nAs if on cue, a lunatic murdered and injured innocents in Midtown Manhattan on a busy weekday.\n\nFortunately, the NYPD quickly responded and proceeded with securing the area and evacuating those sheltering in offices.\n\nWe all must really pause and consider how this event would have played out with socialist Mamdani as mayor.\n\nWould we really be safe in a city headed by him? \n\nI think the answer is clear.\n\nMichael Tannenbaum\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss Zohran Mamdani's backtracking from calls to defund the NYPD after the Park Avenue shooting.","url":"https://nypost.com/2025/07/31/opinion/zohran-mamdanis-public-safety-hypocrisy/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/shutterstock_editorial_Zohran_Mamdani_Holds_Press_Con_15421342t-e1753997836925.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-07-31 22:14:24","author":"Post Readers","authors":["Post Readers"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.082},{"id":347086186,"title":"Democrats Are Addicted to Losing","text":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see more of his videos.\n\nAfter the defeat of Kamala Harris in November 2024, the Democrats recently decided to run an autopsy, a discovery, so to speak, of why they lost that election. These autopsies are not uncommon for the losing political party, but they only tend to work if you’re honest and you try to analyze every considerable factor or criterion without censorship or without fear.\n\nIn the case of the Democrats, though, there are certain elements of that campaign that were obviously wrong and contributed to their defeat.\n\nSo, we would expect the following: Why was Joe Biden nominated in the first place? He seemed to—after the South Carolina primary of 2020—be suddenly coronated. He had lost New Hampshire, he had lost Iowa.\n\nAnd then the party bosses came in and said, “Pete Buttigieg, Elizabeth Warren, Bernie Sanders? These people are too radical. We’ll get old Joe Biden from Scranton, even though he’s not alert.”\n\nAnd then when he was president, they kind of created a cabal that hid his dementia. And then when he was no longer useful and could not serve as a waxen effigy for a radical agenda under his name or his autopen, then they dumped him.\n\nAnd yet, at that point, they should have had an open convention. But they didn’t. They anointed Kamala Harris, who had been a candidate in 2020—a dismal candidate—and had not won one delegate. Her campaign, truncated though it was, was a dismal failure. I mean, she went through a billion dollars.\n\nShe really didn’t have a message. She avoided the press. When she did try to speak extemporaneously, it was a word salad. And she was just an unimpressive candidate.\n\nMore importantly, though, they didn’t have issues and policies that reflected their core values but would also appeal to the middle class.\n\nBill Clinton was a liberal, but he ran in ’92 and ’96 on a hundred new police officers; abortion should be legal, safe, but rare; school uniforms; juveniles who commit violent crimes should be punished accordingly; there should be a secure border; illegal immigration is wrong. And then he made a populist appeal to the middle class.\n\nThe Democrats are not going there. They don’t want to talk about the middle class because their policies—open borders, the Green New Deal, critical race theory, critical legal theory, defund the police—all that has to be rejected because they’re anathema to the middle class. They won’t do it.\n\nLook what happened in 2008 when John McCain lost to Barack Obama. He didn’t do very well at all. He was a moderate Republican.\n\nAbout 10,000 Republicans were unimpressed and stayed home, or 10,000—10 million independents, or whatever we want to call them.\n\nBut the point is, there were millions of voters who would’ve voted for a Republican candidate had he just appealed to the middle class. Instead, there wasn’t much difference—if you look at their respective campaigns—between John McCain and Barack Obama.\n\nAnd when John McCain lost, there was a Republican autopsy. And what did they find? Well, they picked Michael Steele for Republican National Committee chairman because he was black and he was a McCainite. But he wasn’t the medicine for the cause of John McCain’s defeat.\n\nRemember what they also did? They started idolizing Barack Obama. David Frum, a Republican strategist, had a very infamous essay where he compared Barack Obama to what he said was a new head of the Republican Party, Rush Limbaugh. And he said, Rush is white, he’s fat, he’s had multiple marriages. He’s not a good example.\n\nThat wasn’t the point. The point was that Rush Limbaugh had some ideas—not all of them—that could be incorporated into a new Republican message. Close the border. Protect American citizens. Try to create a new policy that favors the middle class on matters of trade and tariffs. Avoid optional wars in the Middle East—on the ground, at least—that rely on the middle class that you have neglected during globalization to fight for you. Try to be fiscally responsible.\n\nAll those were core Republican values, and yet when you looked at that Republican autopsy of 2009, it was essentially: Try to out-identity politics the other side, or let in people from south of the border illegally. It was not a corrective.\n\nBottom line is, until the Democrats look in the mirror and say, “We have a message that nobody wants in the middle class. It’s antithetical to the middle class on crime, on immigration, on energy, on foreign policy, on the economy,” they’ll never change.\n\nThey’re like addicts. They can’t live with DEI, with the Green New Deal, with this utopian globalization, and they can’t live without it.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\n\n\nThe post Democrats Are Addicted to Losing appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/31/democrats-are-addicted-losing/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/kamala.jpg","video":null,"publish_date":"2025-07-31 22:07:39","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.493},{"id":347087698,"title":"Former blue state GOP lawmaker reveals why she's not seeking re-election: 'I have other goals'","text":"Former California Republican Congresswoman Michelle Steel will not be seeking another term in Congress. The Republican, who lost by just over 600 votes in November to Rep. Derek Tran after serving two terms in the House, said she’s pursuing other political goals. \"I have other goals that, you know what, I’m having so much fun, and I work on President Trump's agenda right now. And I was appointed by Speaker Mike Johnson to that Asian-American coalition, so I want to help Asian-Americans in this country and then plus other Asian countries,\" the Republican, who sits on the board of directors of the Lincoln Club, said. ‘NO ONE’ EXCITED ABOUT KAMALA HARRIS’ POTENTIAL GUBERNATORIAL RUN, SAY CALIFORNIA DONORS Her decision not to run will likely open the door to a competitive Republican primary and a multimillion-dollar general election race in 2026. \"I can serve much better [with] what I'm doing right now,\" she said, turning down the possibility of seeking another elected office. Steel, along with Reps. Young Kim and Marilyn Strickland, were the first Korean-American women in Congress, and Steel is a first-generation American. Steel said fundraising and connecting with the different ethnic communities in the district is key to a Republican seeking to win the seat back, noting that a large portion are \"first generations\" like her. DEM GOVERNOR HOPEFULS VOW TO RESIST TRUMP AS CALIFORNIA CHAOS BECOMES NJ CAMPAIGN ISSUE \"I totally understand what they have to go through as a first generation, so that's really important. Go through community by community, and you have to listen exactly what they are asking for to settle in America. This is a great country. You know what, as long as you work really hard, your dream comes true,\" she said. CLICK HERE FOR MORE IMMIGRATION COVERAGE Steel also called out anti-ICE sentiment in California and by Democrats around the country as people misunderstanding the underlying issues that come with illegal immigration. \"People were accusing me that, 'You are the first-generation immigrant, and then you are actually trying to abuse and trying to arrest first-generations.' I said, 'No, this is the illegal criminals we're talking about.' And, you know, when they get arrested and if they are not going to get deported, guess what happened? They are actually committing another crime. So very dangerous people,\" Steel said. \"And I know President Trump is doing a great job in deporting these criminals, and that's what has to be done for American safety. ASSAULTS ON ICE OFFICERS SURGE 830% AS DEMOCRATS CAUGHT 'DOXING AND PHYSICALLY ASSAULTING' AGENTS: DHS \"We really have to do the better message because, especially first generations, and you know what I heard few calling from outside of this country. They said, 'Oh my God, they're arresting all these immigrants, even their citizens.' I said, 'That's not really true. When they commit serious crimes, yes, we kick them out because that's for the safety, and, you know, safety for the Americans.' That's the reason that we are doing.\" Her decision comes as California Gov. Gavin Newsom is floating the possibility of redistricting in the Golden State to thwart any potential Republican seat gains in Texas. \"Two can play this game,\" he posted to X July 15. \"I just read this morning that all the Democrats are coming into California, and all the Republicans are leaving. You know, they have to really see this trade that exactly what's going to be helpful for Californians. California is such a beautiful state. And I live in California. I still want to save California,\" Steel said. CLICK HERE TO GET THE FOX NEWS APP \"She doesn't understand. He doesn't understand exactly what they have to do to make California better,\" she said of Los Angeles Mayor Karen Bass and Newsom. \"So, I really want to stop those people that they are hurting. Not just California, but Californian people, that they are very much against these politicians. I hope they already hit the bottom, so in next year’s election, hopefully, a Republican is going to win.\"","summary":"Michelle Steel&apos;s decision not to run for Congress in 2026 opens a door to a competitive Republican primary in a California district she narrowly lost in November.","url":"https://www.foxnews.com/politics/former-blue-state-gop-lawmaker-reveals-why-not-seeking-re-election-other-goals","image":"https://static.foxnews.com/foxnews.com/content/uploads/2022/10/GettyImages-1428112907.jpg","video":"https://www.foxnews.com/video/6376375211112","publish_date":"2025-07-31 22:04:38","author":"Cameron Arcand","authors":["Cameron Arcand"],"language":"en","category":"politics","source_country":"us","sentiment":-0.139},{"id":347083850,"title":"2026 race for California governor goes into new gear and directions with Kamala Harris out - AP News","text":"LOS ANGELES (AP) — After months of uncertainty, the race to become California’s next governor started Thursday.\n\nFormer Vice President Kamala Harris’ decision Wednesday to bypass the 2026 contest pushed the campaign into a new phase, lacking its biggest potential star and the presumptive early favorite. Harris’ formal exit opens the door for additional candidates to venture in, while scrambling a crowded field with no dominant candidate.\n\nDemocrats remain favored to hold the seat now occupied by term-limited Democratic Gov. Gavin Newsom, in a state where Republicans have not won a statewide election in nearly two decades. Democrats hold a nearly 2-to-1 advantage over registered Republicans statewide.\n\n“The starting gun just popped,” said Democratic consultant Andrew Acosta, calling it the first truly wide-open governor’s race in over a quarter-century. “The race is on.”\n\nOther Democrats work to position themselves \n\nFormer U.S. Rep. Katie Porter moved quickly to establish herself as a leading contender, as her campaign pleaded for donations to “solidify Katie as the Democratic front-runner.” Former Biden administration health secretary Xavier Becerra sought to position himself as an heir to the Harris legacy: They both previously served as California attorneys general.\n\n“The vice president and I have been together in this fight to restore the American Dream for a long time,” Becerra said in a statement. ““I’m proud of our shared record — expanding health care for millions of Americans, bringing down the cost of prescription drugs, tackling our country’s mental health crisis and defending reproductive freedom.”\n\nHarris’ decision “reshapes this race for governor, but not the stakes,” he added. \n\nBecause of Harris’ potential candidacy, the contest had been in a slow-walk for months. Now, following her decision, campaigns will be chasing her supporters while reevaluating a field in which Harris will not be taking part. Fundraising emails jammed inboxes.\n\nDemocratic consultant Michael Trujillo, a former aide to Democratic candidate and former Los Angeles Mayor Antonio Villaraigosa, said voters loyal to Harris are going to have to rethink their choices while looking at candidates they might not know much about in a large and growing field.\n\n“I think everyone is picking up points from Kamala’s voters now that she is not an option,” Trujillo said. “There now is more oxygen for everyone else.”\n\nCalifornia is known as the epicenter of the so-called Trump resistance. The race will unfold with President Donald Trump dominating daily headlines as his administration battles the liberal-leaning state over health care funding for lower-income residents, immigration and environmental protection.\n\nMore than half of voters think the state is headed in the wrong direction, with many households vexed by inflation, notorious taxes and some of the nation’s highest utility bills. Soaring rents and housing prices are driving residents to other, more affordable states. The state budget is expected to be in the red in coming years. And billions in spending on homelessness has done little to check the crisis. \n\nBut the primary election is not until June 2, so it is impossible to know what will be motivating voters in 10 months.\n\nRepublicans see glimmers of hope\n\nLong-suffering Republicans in the state have been heartened by last year’s elections, in which the heavily Democratic state displayed a slight rightward shift. While Harris — a former San Francisco prosecutor, state attorney general and U.S. senator — won the state in a landslide, she fell well short of former President Joe Biden’s vote totals in 2020 while Trump picked off a string of counties that eluded him four years earlier.\n\nAmong the candidates, Riverside County Sheriff Chad Bianco said in a statement that Harris realized “the status quo is impossible to defend.” And conservative commentator Steve Hilton welcomed Harris’ decision and said “after 15 years of one-party Democrat rule, everyone can see it’s time for change in California.”\n\nAs is the case in high-profile races for governor, a long list of candidates — some known, others not — fills out the ballot. California has what is known as a top-two primary system, in which all candidates appear on the same primary ballot regardless of political party, but only the top two vote-getters advance to the November general election, regardless of party.\n\nOther Democrats in the mix include Lt. Gov. Eleni Kounalakis; former state controller Betty Yee; former state Senate leader Toni Atkins; state schools superintendent Tony Thurmond; and real estate developer Stephen Cloobeck.\n\nRich outsider could shake up race\n\nIn California, home to some of the nation’s richest Americans, it is always possible a wealthy outsider could shake up the race. That was the case in 2010, when billionaire Republican Meg Whitman spent nearly $180 million, much of it her own money, but lost to Democrat Jerry Brown, a former governor.\n\nNewsom — who has not endorsed a successor — was asked Thursday what he thought of the possibility that he and Harris, old friends from the San Francisco Bay Area, might meet again in the 2028 presidential race. Harris has not ruled out another run for the presidency after falling short in 2020 and 2024. Newsom is widely seen as positioning himself for a run in 2028 though he has veered away from speculating about his political future.\n\n“We’ll see where fate brings all of us,” Newsom told reporters. “I’m looking forward to what she does next.”\n\nAssociated Press writer Tran Nguyen in Sacramento contributed.","summary":"2026 race for California governor goes into new gear and directions with Kamala Harris out  AP News","url":"https://apnews.com/article/california-governor-kamala-harris-gavin-newsom-democrats-aec62ece092b994ca1a546095683c2e6","image":"https://dims.apnews.com/dims4/default/40bfc84/2147483647/strip/false/crop/3000x2000+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa6%2F92%2F3b7f7d5584ed1bf9a2eed61f2a01%2Fdb621a1a4b3c4ce8914de1ee112134ce","video":null,"publish_date":"2025-07-31 22:02:00","author":"Michael R. Blood","authors":["Michael R. Blood"],"language":"en","source_country":"us","sentiment":-0.035},{"id":347086572,"title":"UNBURDENED? Bret Baier Weighs in on Kamala Opting Out of Running For Office… For Now","text":"Bret Baier, Chief Political Anchor for Fox News, anchor of Special Report with Bret Baier, and author of the upcoming book To Rescue The American Spirit (out this October and available for preorder now), joined The Guy Benson Show today to discuss Fox News’ dominant ratings performance, which now surpasses the major broadcast networks in primetime, including on Bret’s own show. Guy and Bret also analyzed Kamala Harris’ strategic decision to forgo a California gubernatorial bid, fueling speculation about a potential third run for the presidency in 2028 after her failure in 2024. Plus, Baier discussed his new personal TikTok account and shared why he believes an American deal for the app is likely coming soon. Listen to the full interview below!\n\nListen to the full interview below:\n\nListen to the full podcast below","summary":"Bret Baier, Chief Political Anchor for Fox News, anchor of Special Report with Bret Baier, and author of the upcoming book To Rescue The American Spirit (out this October and available for preorder now), joined The Guy Benson Show today to discuss Fox News&#8217; dominant ratings performance, which now surpasses the major broadcast networks in primetime, including on Bret&#8217;s own show. Guy and Bret also analyzed Kamala Harris&#8217; strategic decision to forgo a California gubernatorial bid, fueling speculation about a potential third run for the presidency in 2028 after her failure in 2024. Plus, Baier discussed his new personal TikTok account and shared why he believes an American deal for the app is likely coming soon. Listen to the full interview below! Listen to the full interview below: Listen to the full podcast below:","url":"https://radio.foxnews.com/2025/07/31/bret-baier-kamala-gov-race/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2025/02/BENSON-WEB-TEMPLATE-1-12.png","video":null,"publish_date":"2025-07-31 22:00:57","author":"Dylan Rolfsen","authors":["Dylan Rolfsen"],"language":"en","source_country":"us","sentiment":0.259},{"id":347079430,"title":"St Patrick's Athletic overcome scare in Estonia to keep European dream alive","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nSt Pat's players celebrate in Estonia.Postimees/Madis Veltman/INPHO\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\nStephen Kenny’s side levelled through Joe Redmond in 91st minute before Jake Mulraney goal secured progress in extra-time.\n\n8.23pm, 31 Jul 2025\n\nShare options\n\nUefa Conference League second qualifying round, second leg\n\nNomme Kalju 2\n\nSt Patrick’s Athletic 2\n\nSt Patrick’s Athletic win 3-2 on aggregate\n\nST PATRICK’S ATHLETIC’S European dream had been on life support before it was resuscitated in dramatic fashion in the pouring rain of Estonia.\n\nFrom the depths of despair came a thrilling joy courtesy of captain Joe Redmond’s equaliser in the 91st minute and Jake Mulraney’s winner early into extra time.\n\nIt was either a flukey overhit cross or sublime piece of initiative by spotting the goalkeeper off his line – either way it was the decisive moment that ensured Stephen Kenny’s men avoided a sobering defeat filled with regret.\n\nJust like how Nomme Kalju seized the initiative – and the lead – with goals in the moments either side of half-time of normal time, the Saints left the Estonians heartbroken with their response late in the day.\n\nAs the rain lashed down throughout extra-time surface water began to appear to make it that bit harder to simply control possession and see out the tie.\n\nAllied with tired limbs entering the 120th minute it was only when the referee’s whistle blew that Pat’s fans could turn attention to a third-round qualifier against the loser of Beskitas and Shakhtar Donetsk next week.\n\nIt currently looks like the Turkish giants, managed by Ole Gunnar Solskjaer, will be coming to Dublin as their tie is ongoing and they trail 6-2.\n\nMaybe pushing for the third goal was the only way Kenny’s men could retain focus given the way in which they switched off to allow Kalje find a way back into contention.\n\nThe first half was following a similar pattern to the game in Dublin.\n\nPat’s had the ball, Kalju were happy to sit deep and close down when required, with Kenny’s side unable to penetrate.\n\nAs it wore on Pat’s took their foot off the gas and some of the earlier zip about their passing faded.\n\nAdvertisement\n\nThey didn’t need to go and chase another goal at that stage but with the hosts labouring and unable to seize the initiative the opportunity was there to punish them.\n\nBut Pat’s allowed Kalju grow in confidence and they were the ones to make things happen for themselves.\n\nFirstly, they drew level two minutes before half-time with a simple move down the left that caught Pat’s out. Kristjan Kask beat Redmond for pace and with the centre back out of position the pull back for Ivans Patrikejevs bursting ahead of Barry Baggley into the box was perfect for him to strike first time and beat Joseph Anang low to his right.\n\nKenny didn’t hesitate to make a change at the break with Aidan Keena replacing Melia, but more lethargy in defence saw the Estonians go ahead in the tie four minutes into the second half.\n\nThis time it was a second ball that kept an attack alive after an overhit cross from the right. Ivanov picked it up and with Pat’s not set to defend the threat his inswinging cross was met with a powerful header by Mattias Mannilaan.\n\nChris Forrester was brought on for Baggley in response but by the 65th minute goalkeeper Maksim Pavlov only had to make a save from a fierce Keena effort from distance.\n\nThe striker then had to be replaced by Conor Carty with what looked like a thigh injury just moments later as the night got worse for St Pat’s.\n\nThey were staring defeat in the face until Redmond reacted quickest in the 91st minute to guide a brilliant side-foot shot into the roof of the net through a sea of bodies after Mulraney’s free-kick had been parried back towards the penalty spot.\n\nPat’s sensed blood in the rain water of Tallinn and three minutes into extra-time the home side’s resolve was finally broken when Mulraney was given time and space on the right. He was allowed cut in on his left and he flighted a ball over the head of goalkeeper Maksim Pavlov.\n\nAll of a sudden there was sweet relief, and a release of emotion for the Saints as they now become the underdogs in the third round.\n\nNomme Kalju: Maksim Pavlov; Daniil Tarassenkov, Uku Korre, Modou Tambedou (captain), Aleksandr Nikolajev; Oleksandr Musolitin (Mihhail Orlov 112), Ivans Patrikejevs, Nikita Ivanov (Pavel Marin 80), Kristjan Kask; Mattias Mannilaan, Guilhereme Smith.\n\nSt Patrick’s Athletic: Joey Anang; Ryan McLaughlin, Joe Redmond (captain), Tom Grivosti, Jason McClelland (Anto Breslin 96); Jake Mulraney (Al-Amin Kazeem 105), Barry Baggley (Chris Forrester 51), Jamie Lennon, Kian Leavy (Brandon Kavanagh 72), Simon Power; Mason Melia (Aidan Keena HT) (Conor Carty 72).\n\nReferee: Menelaos Antoniou (Cyprus).\n\nWritten by David Sneyd and originally published on The 42 whose award-winning team produces original content that you won’t find anywhere else: on GAA, League of Ireland, women’s sport and boxing, as well as our game-changing rugby coverage, all with an Irish eye. Subscribe here.\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “St Patrick's Athletic overcome scare in Estonia to keep European dream alive”.\n\nRecipient's Email\n\nFeedback on “St Patrick's Athletic overcome scare in Estonia to keep European dream alive”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nLeague of Ireland\n\nSt. Patrick's Athletic\nUefa conference league\n\nNews in 60 seconds\n\nrace to the aras\nLabour Party throws support behind Catherine Connolly as Left unity candidate for president\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\n14 mins ago\n\nmisrepresented\nClimate scientists accuse US energy department of twisting their work in new report\n\n32 mins ago\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\n47 mins ago\n\nVanessa O'Callaghan\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nAmerican actor jailed for five years for choking woman out and raping her in Dublin AirBnB\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Stephen Kenny’s side levelled through Joe Redmond in 91st minute before Jake Mulraney goal secured progress in extra-time.","url":"https://www.thejournal.ie/st-pats-kalju-conference-league-2-6779907-Jul2025/","image":"https://img2.thejournal.ie/article/6779907/river/?height=400&version=6779794","video":null,"publish_date":"2025-07-31 21:54:07","author":null,"language":"en","source_country":"ie","sentiment":0.114},{"id":347096226,"title":"Kamala Harris' New Memoir '107 Days' Met With Brutal Insults as Failed Presidential Candidate Sounds Off On Her Embarrassing Defeat to Donald Trump","text":"Kamala Harris has been hit with backlash over her new book on the 2024 presidential election, RadarOnline.com can reveal. \n\nThe former vice president and Democratic nominee shared a video on social media announcing her forthcoming memoir, 107 Days, which promises to deliver a \"behind-the-scenes account\" on the \"high-stakes\" campaign she led after Joe Biden suspended his re-election bid three months before the election.'107 Days'Harris' official X account shared the video along with the caption: \"What the world saw on the campaign trail was only part of the story. \"My new book is a behind-the-scenes look at my experience leading the shortest presidential campaign in modern history. \"107 Days is out on September 23. I can't wait for you to read it.\"\n\nIn the clip, Harris described her campaign as being \"intense, high-stakes, and deeply personal.\"The former vice president added: \"Since leaving office, I've spent a lot of time reflecting on those days. Talking with my team, my family, my friends and pulling my thoughts together. In essence, writing a journal that is this book.\n\n\"With candor and reflection, I've written a behind-the-scenes account of that journey. I believe there's value in sharing what I saw, what I learned, and what I know it will take to move forward. \n\n\"In writing this book, one truth kept coming back to me: Sometimes the fight takes a while.\" \n\nHarris teased she wasn't done with politics yet as she concluded her message: \"But I remain full of hope. And I remain clear-eyed. I will never stop fighting to make our country reflect the very best of its ideals. Always on behalf of the people.\"Outspoken CriticsDespite Harris' glowing description, social media users were quick to bash the memoir, and wasted no time in reminding her of Donald Trump's victory. \n\nOne user wrote: \"Why would you lose an election and then try to sell everyone a book about how horribly you lost,\" as a second added, \"Who wants to read about absolute failure?\" \n\nAnother mocked: \"A book full of word salad. A must-read, I'm sure.\" \n\nA third piled on: \"Should have titled it 'Luckily Voters Didn’t See More Of Me Or I Would Have Lost By Even More.'\"Other critics called out Harris' campaign finances, with one writing: \"I just want to read the part about how you burned through almost 2billion dollars and still lost every swing state.\" \n\nHarris' memoir announcement comes after she revealed she has no plans to run for Governor of California in 2026.Round Two?She said in a statement: \"In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor. I love this state, its people, and its promise. It is my home. But after deep reflection, I've decided that I will not run for Governor in this election.\"\n\nHer decision not to run for governor meant the door is still open for another presidential run – and Harris said she would share \"more details in the months ahead.\"'Not Bound By the Same Playbook'Harris' statement continued: \"I have extraordinary admiration and respect for those who dedicate their lives to public service – service to their communities and to our nation. \n\n\"At the same time, we must recognize that our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis. \n\n\"As we look ahead, we must be willing to pursue change through new methods and fresh thinking – committed to our same values and principles, but not bound by the same playbook.\"","summary":"The ex-VP promised the book gives a 'behind-the-scenes' look at her unsuccessful presidential bid.","url":"https://radaronline.com/p/kamala-harris-107-days-memoir-backlash-presidential-campaign/","image":"https://media.radaronline.com/brand-img/zR77EoAxJ/0x0/kamala-harris-slammed-over-campaign-memoir-detailing-absolute-failure-1753994758428.png","video":null,"publish_date":"2025-07-31 21:45:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","source_country":"us","sentiment":-0.128},{"id":347079434,"title":"Climate scientists accuse US energy department of twisting their work in new report","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nFlooding after torrential rain in Texas that led to the deaths of more than 100 peopleAlamy Stock Photo\n\nmisrepresented\n\nClimate scientists accuse US energy department of twisting their work in new report\n\nThe report contains inaccurate citations, flawed analysis and editorial errors throughout.\n\n10.38pm, 31 Jul 2025\n\nShare options\n\nCLIMATE SCIENTISTS WHOSE research has been cited in a report by the US Department of Energy have said their work was misused by the report in its efforts to try to downplay the role of human activity in global warming.\n\nThe document outlines the Trump administration’s rationale for revoking a foundational scientific ruling had underpinned the government’s authority to combat climate change.\n\nThe report contains inaccurate citations, flawed analysis and editorial errors throughout.\n\nIt was written by a working group including John Christy and Judith Curry, who have both in the past been linked to The Heartland Institute, an advocacy group that frequently refutes the scientific consensus on climate change.\n\nIt “completely misrepresents my work,” said Benjamin Santer, atmospheric scientist and honorary professor in the School of Environmental Sciences at the University of East Anglia in the UK.\n\nAdvertisement\n\nSanter said a section of the report on “stratospheric cooling” contradicted his findings while citing his research on climate “fingerprinting,” a scientific method that seeks to separate human and natural climate change, as evidence for its analysis.\n\n“I am concerned that a government agency has published a report, which is intended to inform the public and guide policy, without undergoing a rigorous peer‑review process, while misinterpreting many studies that have been peer‑reviewed,” Bor-Ting Jong, an assistant professor at the Vrije Universiteit Amsterdam in the Netherlands, told AFP.\n\nJong said the paper made false statements about the climate model her team examined and used different terminology that led to a flawed analysis of her findings.\n\nOn Bluesky, the budding social media platform favored by academics, other researchers in atmospheric and extreme weather fields also deplored that the DoE document cherry-picked data and omitted or plainly distorted their academic findings.\n\nJames Rae, a climate researcher at the University of St Andrews in Scotland, who said his work is also misrepresented in the report, told AFP the shift in how the department uses scientific research “is really chilling.”\n\n“DoE was at the forefront of science for decades. Whereas this report reads like an undergraduate exercise in misrepresenting climate science,” he said.\n\nThis is not the first time since Donald Trump took office in January that scientists have said a government agency has misrepresented academic work to defend its policies.\n\nRelated Reads\n\nFracked gas could enter Ireland's energy supplies in new deal\n\nCountries causing climate crisis could be ordered to pay reparations to victims\n\nPrevious instances included made up citations in the government’s “Make America Healthy Again” report, which the administration then rushed to edit. \n\nA department spokesperson said the new report was reviewed internally by a group of scientific researchers and policy experts from the Office of Science and National Labs.\n\nThe public in the US will now have the opportunity to comment on the document before it is finalized for the Federal Register.\n\n“The Climate Working Group and the Energy Department look forward to engaging with substantive comments following the conclusion of the 30-day comment period,” the department said.\n\nThe Journal's climate change newsletter\nFollow the biggest news story of our times. Sign up for our monthly climate newsletter\n\nYou are now signed up\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Climate scientists accuse US energy department of twisting their work in new report”.\n\nRecipient's Email\n\nFeedback on “Climate scientists accuse US energy department of twisting their work in new report”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nClimate Change\nCLIMATE CRISIS\nclimate science\nmisrepresented\n\nNews in 60 seconds\n\nrace to the aras\nLabour Party throws support behind Catherine Connolly as Left unity candidate for president\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\n14 mins ago\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\n16 mins ago\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\n47 mins ago\n\nVanessa O'Callaghan\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nAmerican actor jailed for five years for choking woman out and raping her in Dublin AirBnB\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"The report contains inaccurate citations, flawed analysis and editorial errors throughout.","url":"https://www.thejournal.ie/climate-scientists-accuse-us-energy-department-of-twisting-their-work-in-new-report-6779869-Jul2025/","image":"https://img2.thejournal.ie/article/6779869/river/?height=400&version=6779897","video":null,"publish_date":"2025-07-31 21:38:18","author":null,"language":"en","source_country":"ie","sentiment":0.24},{"id":347079424,"title":"Rhasidat Adeleke out of National Championships in Santry due to 'lingering' injury","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nRhasidat Adeleke.Alamy Stock Photo\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\nThe 22-year-old said an injury from earlier in the year has led to ‘additional lingering setbacks’. \n\n5.53pm, 31 Jul 2025\n\nShare options\n\nRHASIDAT ADELEKE HAS said a recurrence of an old injury has ruled her out of the National Track and Field Championships in Santry this weekend.\n\nThe 22-year-old is seeking to be fully fit for the World Athletics Championship which begin in Tokyo on 13 September. She withdrew from a Diamond League event in Monaco earlier this month. \n\nUnfortunately, I won’t be competing at the National championships this weekend. \nI’ve attended nationals every year since 2021 & there’s nothing like competing in-front of a home crowd. (1/2)— Rhasidat Adeleke (@rhasidatadeleke) July 31, 2025 \n\nAdvertisement\n\n“Unfortunately, I won’t be competing at the National championships this weekend,” Adeleke posted on social media.\n\n“I’ve attended nationals every year since 2021 & there’s nothing like competing in front of a home crowd.\n\n“An injury I had earlier this season has transcended into additional lingering setbacks so I’ll be supporting from afar.\n\n“I’ll hopefully be back to get some Morton magic next year. I’m forever grateful for all the support. Best of luck to everyone racing.”\n\nWritten by Ronan Early and originally published on The 42 whose award-winning team produces original content that you won’t find anywhere else: on GAA, League of Ireland, women’s sport and boxing, as well as our game-changing rugby coverage, all with an Irish eye. Subscribe here.\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Rhasidat Adeleke out of National Championships in Santry due to 'lingering' injury”.\n\nRecipient's Email\n\nFeedback on “Rhasidat Adeleke out of National Championships in Santry due to 'lingering' injury”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nRhasidat Adeleke\n\nNews in 60 seconds\n\nrace to the aras\nLabour Party throws support behind Catherine Connolly as Left unity candidate for president\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\n14 mins ago\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\n16 mins ago\n\nmisrepresented\nClimate scientists accuse US energy department of twisting their work in new report\n\n32 mins ago\n\nVanessa O'Callaghan\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nAmerican actor jailed for five years for choking woman out and raping her in Dublin AirBnB\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"The 22-year-old said an injury from earlier in the year has led to ‘additional lingering setbacks’.","url":"https://www.thejournal.ie/rhasidat-adeleke-injury-2-6779881-Jul2025/","image":"https://img2.thejournal.ie/article/6779881/river/?height=400&version=6779639","video":null,"publish_date":"2025-07-31 21:23:09","author":null,"language":"en","source_country":"ie","sentiment":0.161},{"id":347096156,"title":"Run for president? Start a podcast? Tackle AI? Kamala Harris' options are wide open","text":"Former Vice President Kamala Harris closed a big door when she announced Wednesday that she would not run for California governor. But she left open a heap of others. Departing presidents, vice presidents, first ladies and failed presidential candidates have pursued a wide variety of paths in the past. Empowered with name recognition and influence but with no official role to fill, they possess the freedom to choose their next adventure. Al Gore took up a cause in global warming, while George W. Bush took up painting. John Kerry and Hillary Clinton went on to become secretary of State, while Donald Trump fought off prosecutors, launched new business ventures and plotted his return to power. Barack and Michelle Obama grew their foundation, wrote books and started a production company — and both have done podcasts, too — while remaining prominent voices within the Democratic Party. Of course, Harris could focus all her energy on another run for president in 2028. But how would she do that, and what would she do to remain politically relevant in the meantime? Which other paths might she choose instead? \"She just finished writing a book. She's finally decided she's not running for governor. But to be prescriptive about what role she's going to play next and how it's going to look would be premature,\" said Harris senior advisor Kirsten Allen. Experts in power and political leadership expect Harris' next move to be something in the public eye, given she is relatively young at 60 and no doubt wants her last chapter in the spotlight to be something other than her humbling loss to Trump in the 2024 presidential election. \"Even if it isn't the governorship of California, the idea of wanting something else other than the 2024 election to be the last thing Kamala Harris ever did would be very appealing,\" said Gregory H. Winger, an assistant professor of public and international affairs at the University of Cincinnati who has studied former presidents' lingering influence. Winger said his research showed those \"most active in trying to be influential\" in their post-White House years were those whose time in office ended on a sour note, such as failing to win reelection. \"It's kind of a frustrated ambition that then leads into higher activity,\" Winger said — and Harris has that. In her announcement about not running for governor, Harris was careful to leave her options open — framing her hopes for the future around ideals such as \"fighting for the American people.\" She said she is a \"devout public servant\" who has long believed the best way to make a difference was to \"improve the system from within.\" But she also said \"our politics, our government, and our institutions have too often failed the American people,\" and that \"we must be willing to pursue change through new methods and fresh thinking — committed to our same values and principles, but not bound by the same playbook.\" Harris said she looked forward to talking to more Americans while helping to elect other Democrats. Within 24 hours, she had announced a book deal for her forthcoming memoir, \"107 Days,\" which will chronicle her whirlwind 2024 presidential campaign, and her first interview since the election on \"The Late Show with Stephen Colbert\" on Thursday night. Nathanael Fast, director of the Neely Center for Ethical Leadership and Decision Making at the USC Marshall School of Business, said Harris' talk of \"getting back out and listening\" is consistent with her wanting to reclaim a prominent national role. That could mean another presidential run, he said, but it could also mean something else — particularly in the short term, where she has work to do recasting people's perceptions of her. \"If she can create a compelling narrative about who she is, what she's done, what happened in the last election and where she's headed next,\" Fast said, \"she'll be more likely to succeed.\" Fast said his bet is that she runs for president, but he could also see her going the route of Gore — who, after losing the presidential election, decided to move in a different direction to have worldwide impact by addressing climate change. \"I can imagine someone like Harris taking on artificial intelligence and saying, 'My whole thing is trying to influence the national conversation around what's going to happen with AI,'\" Fast said. Artificial intelligence was part of her portfolio as vice president and is a topic Harris cares deeply about, said a source familiar with her thinking who asked for anonymity to speak candidly about her next steps. Harris also will have to tread carefully as she works to reassert her influence in the Democratic Party, which is still reeling from a second loss to Trump, experts said. Democrats have struggled to unify the disparate elements of their party and settle on kitchen-table messaging that appeals to voters about the everyday challenges they face, said Sara Sadhwani, a politics professor at Pomona College. After she lost to Trump, a convicted felon targeted with several other criminal investigations, \"Harris exemplifies the inability to thread that needle.\" Whatever Harris does to break through, it won't be easy in today's saturated media and political marketplace, which is so vastly different from what other former White House occupants faced. After he declined to run for reelection in 1928, former President Coolidge wrote a nationally syndicated newspaper column. Today, Harris would be more likely to launch a podcast — but whether it will catch on nationally is anyone's guess. Winger said Harris does have massive name recognition, and Fast said she has many of the important forms of \"capital\" for a leader to continue being successful and influential — including financial and social. Still, \"it's tough,\" Winger said. \"It's a very different media ecosystem just because of how crowded and how fractured it has become.\" Kyle Lierman, who worked for more than six years in the Obama White House, is now chief executive of Civic Nation, a nonpartisan nonprofit that houses several education, gender equity and voter initiatives — including When We All Vote, the voter initiative Michelle Obama launched in 2018. Lierman said he is excited to see what Harris does next, as it's likely to show her \"best side.\" \"When you're at the White House, you are working on a dozen different topics every day, and you are trying to make as big an impact as possible before the clock runs out,\" Lierman said. \"And when you leave, you have an opportunity to step back, think longer term, and go deeper on a few issues that you're particularly passionate about. And I think that's liberating in some ways.\" Former Sen. Laphonza Butler, a longtime friend of Harris’, said the former vice president might draw from the blueprints laid out by her recent predecessors. \"Whether you're talking about the Clinton Global Initiative or When We All Vote ... or the work that's happening at the Obama Foundation, I think there's plenty of examples,\" Butler said. Many former presidents have leveraged their experience in foreign affairs — and existing relationships with foreign leaders — to continue holding sway in international relations, particularly when members of their own party return to power. President Clinton, for instance, used President Carter in that way. Andra Gillespie, a political scientist at Emory University, said Harris could be \"really effective\" in bolstering organizations that work for racial justice and to elect women, but said \"that's not what she was organizing her political career around\" before the 2024 election and it may not be the path she chooses now. Gillespie said she read Harris' statement as indicating that she was most interested in finding a way to force change outside of government. She said she could see Harris — who is already in California, and whose husband Doug Emhoff is an entertainment lawyer — moving into production and podcasts like the Obamas. Gillespie said she also could see Harris working closely with Howard University, her alma mater in Washington, D.C., on fundraising or building out a new center of study, as Joe Biden did at the University of Delaware. \"She's still relatively young, and still could have a good 15 to 20 years of active engagement ahead of her,\" Gillespie said, \"in whatever form she wants that to take.\"","summary":"At 60, Kamala Harris has a lot of opportunities ahead of her. Which will she pursue?","url":"https://www.latimes.com/california/story/2025-07-31/run-for-president-start-a-podcast-take-up-painting-kamala-harris-options-are-wide-open","image":"https://ca-times.brightspotcdn.com/dims4/default/aa710d4/2147483647/strip/false/crop/4200x2835+0+0/resize/1486x1003!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe5%2F6a%2F80c03ba644b7a8a00ea3562fcfb4%2Fhttps-delivery-getty","video":null,"publish_date":"2025-07-31 21:13:54","author":"Julia Wick,Kevin Rector","authors":["Julia Wick","Kevin Rector"],"language":"en","category":"politics","source_country":"us","sentiment":-0.27},{"id":347103710,"title":"What the Labubu Obsession Says About Us","text":"If you can’t track down a Labubu, you might need to settle for a Lafufu. The grinning toy monsters have become the stuff of our collective consumerist nightmares. Plus:\n\nReconsidering the racial wealth gap\nWhat Marc Maron is reading\nWeike Wang on a brain at war with itself\n\nJia Tolentino \nA staff writer covering news and culture since 2016.\nThe tiny grinning monsters called Labubus were created in 2015 by a Hong Kong-born, Netherlands-raised artist named Kasing Lung for a book series called “The Monsters.” Lung licensed Labubus to a Chinese toy company called Pop Mart in 2019; Lisa from Blackpink hung a Labubu from her purse in 2024, sparking runaway Labubu madness; Pop Mart shot to $1.8 billion in revenue by the end of the year. Recently, at a bar, I encountered a Labubu dressed in knockoff Prada hanging from the work bag of a stylish homosexual. At a Liberty game at the Barclays Center a few days later, the team’s heroic mascot, Ellie the Elephant, carried a miniature purse with a Labubu attached. The Labubu fell off as Ellie strutted. “Sh-h-h, don’t tell her!” her minder whispered as he passed.\nLabubus come in mystery boxes. Knockoff Labubus are called Lafufus. Labubus are said to resemble an ancient Mesopotamian demon called Pazuzu, but that is probably a coincidence. They are popular because they look funny, because Labubu is fun to say in the same way that a typo in the group chat is fun to repeat back to the typo-committer for years, and also because consumer culture is currently a series of dramatic swan dives into a sort of giddy meaninglessness that functions as tacit admission that we’ve all more or less lost the plot.\n“The brevity of the interlude,” the art critic and essayist Jonathan Crary writes, in his book “24/7,” between when a product is made and when it “literally becomes garbage” requires two contradictory yet coexisting attitudes: “on one hand, the initial need and/or desire for the product, but, on the other, an affirmative identification with the process of inexorable cancellation and replacement.” He’s referring to tech here—the planned obsolescence of the iPhone you’re likely reading this on, etc.—but the argument is also, in many ways, about Labubus. We are no longer in the comparatively Edenic age of the Furby, the Beanie Baby, the Tamagotchi. Now, within the span of thirty seconds on TikTok, you can see Megan Thee Stallion getting a Labubu on the red carpet and a seven-year-old sobbing with joy while unboxing one and laborers assembling the dolls at a factory in China, where the heads get stamped out of rubber and elderly gig workers split them open to be stuffed while making (in the case of the Lafufus, at least) approximately $5.57 per day. In the world of Labubus, it’s not just toys that were made for the trash heap—it’s us, our obsessions, our collective trajectory, the very teleology of our existence, our stupidest loves, our minds.\n\nAfter six decades of civil-rights efforts, the prosperity disparity remains unchanged. Programs meant to close the gap haven’t made a dent, and there’s reason to doubt that even reparations would deliver a lasting fix. Idrees Kahloon on what’s really driving this stubborn divide—and what might actually alleviate it. Read or listen to the story »\n\nSearching for the Children of the Disappeared\n“Split Brain,” by Weike Wang\nDate Ideas for Couples in Long-Term Relationships\n\nEarlier this month, Paramount, which owns CBS, announced it would pay sixteen million dollars to settle a lawsuit with President Donald Trump, who claimed, among other accusations, that the network’s interview with Kamala Harris had been unfairly edited. Weeks later, CBS cancelled Stephen Colbert’s late-night show, citing financial reasons.\nWill the President’s lawsuits against media companies have a chilling effect on comedy? If a recent episode of “South Park” is any guide, probably not. On the latest episode of the Political Scene podcast, the staff writer Andrew Marantz and senior editor Tyler Foggatt are joined by Roy Wood, Jr., the host of CNN’S satirical program “Have I Got News for You.” “There’s always going to be these petty, ticky-tack battles that the Administration fights,” Wood told the hosts. “But I don’t think that’s gonna stop the comedians from doing what Trump hopes this would do, which is silence them.” Listen to the full episode »\n\nRead: The comedian and podcaster Marc Maron recommends Sam Lipsyte’s “No One Left to Come Looking for You,” a pulpy detective story about a punk rocker named Jack Shit.\n\nWatch: “The Rules of the Game,” from 1939, is a tragic farce that scathingly denounces French society’s frivolity amid threats of war and fascism. Richard Brody compares it to Mozart.\n\nListen: Jeremy Irons’s “soothingly smooth” voice reading “Brideshead Revisited,” by Evelyn Waugh, will get you through any long road trip this summer. Check out our other audiobook suggestions.\n\nToday’s Crossword Puzzle: Sleepy, tree-dwelling wombat relatives—six letters.\n\nLaugh Lines: Test your knowledge of classic New Yorker cartoons.\n\nName Drop: Guess the identity of a notable person in six clues.\n\nP.S. Robert Wilson, the co-writer of the visionary five-hour opera “Einstein on the Beach,” has died. He once explained to an audience, “If you slow things down, you notice things you hadn’t seen before.” Read Hilton Als on Wilson’s genius.\nIan Crouch contributed to this edition.","summary":"From the daily newsletter: why the tiny, grinning monsters became the latest cultural craze.","url":"https://www.newyorker.com/newsletter/the-daily/what-the-labubu-obsession-says-about-us","image":"https://media.newyorker.com/photos/688a7defc39b343d28dd6212/16:9/w_2372,h_1334,c_limit/NL-TOLENTINO-LABUBU-2025-07-21T121041Z_1221331553_MT1SOPA000ZX55RB_RTRMADP_3_SOPA.jpg","video":null,"publish_date":"2025-07-31 21:13:25","author":"Jia Tolentino","authors":["Jia Tolentino"],"language":"en","source_country":"us","sentiment":0.014},{"id":347079422,"title":"Two people released after questioning about fatal assault of woman in Cork last December","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nVanessa O’Callaghan was assaulted while she was availing of the services of a soup kitchen on St Patrick's Street in Cork city.Owner\n\nVanessa O'Callaghan\n\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nGardaí at Anglesea Street station are still investigating the fatal assault.\n\n9.52pm, 31 Jul 2025\n\nShare options\n\nGARDAÍ HAVE RELEASED two people without charge after arresting them yesterday as part of an investigation into a fatal assault of a woman in Cork city last year.\n\nVanessa O’Callaghan, who was 36 years old, was assaulted while she was availing of the services of a soup kitchen on St Patrick’s Street in Cork city. \n\nShe was attacked by up to three people outside the former Savoy Cinema.\n\nAdvertisement\n\nShe received CPR from a volunteer at the scene but later passed away in Cork University Hospital.\n\nGardaí at Anglesea Street station are still investigating the fatal assault.\n\nA man and a woman, both aged in their 30s, were arrested yesterday in connection with the investigation.\n\nThey were detained under Section 4 of the Criminal Justice Act 1984 at a garda station in Cork.\n\nThey have since been released without charge and a gardaí are preparing a file to be sent to the Office of the Director of Public Prosecutions.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nLauren Boland\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Two people released after questioning about fatal assault of woman in Cork last December ”.\n\nRecipient's Email\n\nFeedback on “Two people released after questioning about fatal assault of woman in Cork last December ”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nVanessa O'Callaghan\n\nNews in 60 seconds\n\nrace to the aras\nLabour Party throws support behind Catherine Connolly as Left unity candidate for president\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\n14 mins ago\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\n16 mins ago\n\nmisrepresented\nClimate scientists accuse US energy department of twisting their work in new report\n\n32 mins ago\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\n47 mins ago\n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nAmerican actor jailed for five years for choking woman out and raping her in Dublin AirBnB\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Gardaí at Anglesea Street station are still investigating the fatal assault.","url":"https://www.thejournal.ie/two-people-released-after-questioning-about-fatal-assault-of-woman-in-cork-last-december-6779844-Jul2025/","image":"https://img2.thejournal.ie/article/6779844/river/?height=400&version=6779855","video":null,"publish_date":"2025-07-31 20:52:29","author":null,"language":"en","source_country":"ie","sentiment":0.074},{"id":347079432,"title":"Wiffen withdraws from World Aquatics Championships on medical grounds","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nDaniel Wiffen competing in the men's 800-meter freestyle heats at the World Aquatics Championships in Singapore on TuesdayAlamy\n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nEllen Walshe finished eighth in 200 metres Butterfly Final.\n\n3.03pm, 31 Jul 2025\n\nShare options\n\nLAST UPDATE\n\nOLYMPIC GOLD MEDALLIST Daniel Wiffen has had to withdraw on medical grounds from the World Aquatics Championships in Singapore. \n\nWiffen is suffering from with ongoing effects of appendicitis he dealt with in June, according to a statement from Swim Ireland and the 24-year-old.\n\n“Just to let everyone know I have medically withdrawn from the World Championships in Singapore due to the appendicitis that I suffered from in June,” said Wiffen. \n\n“Thank you for all the support in last night’s final. I wasn’t physically at my best, but I will be working towards getting back to full fitness and winning shape soon.”\n\nWiffen placed eighth in the 800m Freestyle Final on night four of the World Aquatics Championships.\n\nWiffen, who was crowned Olympic champion in the event a year ago, was looking to defend his 2024 World Championship title but was clearly off-colour, leading for the first 350 metres before falling off.\n\nMeanwhile, today, Fermanagh’s Ellie McCartney has qualified for the 200m Breaststroke Final, on the fifth day of racing at the World Aquatics Championships in Singapore.\n\nMcCartney had the swim of her life as she stormed into the 200m Breaststroke Final, her first World Final on her debut World Championships (50m).\n\nThe National Centre Limerick swimmer came home in a lifetime best 2:23.79 for third place in her heat and progresses as the sixth seed for Friday’s 13.08 (IRL) Final.\n\nThe 20-year-old, who started the year with a best time of 2:26.76, knocked .25 of a second off her best time of 2:24.04 from the European U23 Championships in Slovakia in June, where she won a silver medal, and was over a second faster than her heat swim of 2:25.22.\n\nA delighted McCartney said after the race, “I’m ecstatic. You know, this is what we train for, we train to perform in the heats, make it through the semis and progress through the rounds. And I think that’s really been a strength this year that I’ve been able to progress through each of the rounds.\n\nAdvertisement\n\n“So, to make it to a World Championship Final in my first worlds, it’s really exciting. I think here it’s just been so unpredictable, you know, you get top two, top three in a semi-final and you’re not guaranteed a final, so it’s important that you just put your best foot down and whether or not I made the final, I would be able to walk away satisfied just because, you know, I put my best foot forward and PB’d. I know I’ve left everything in the pool.”\n\n On Friday’s final, she added, “Oh, it’s going to be such an eye-opening experience. You know, I’ve never been at this level, never mind in a final at this level.\n\n“I have to thank my coaching staff for getting me this far and the support they’ve had and I’m very thankful to have my coach alongside me here, which always does help things.”\n\nNeutral athlete Evgenlia Chikunova will be the top seed for the Final in 2:20.65.\n\nEllen Walshe has finished eighth in Thursday’s 200m Butterfly Final, her second final of the week, following an eighth place in the 200m Individual Medley on Monday.\n\nThe Templeogue swimmer clocked her second fastest time ever in the event in 2:08.34, just outside of the 2:07.48 Irish Record that she swam in Wednesday night’s semi-final.\n\nSpeaking after the race Walshe said, “I think even if I was to go back and think I’d be in that final, I would have been like, absolutely not, but I guess expectations build as you are a competitor, but yeah, it’s just a poor performance tonight.”\n\nIn the 200m Backstroke Semi-Final, John Shortt swam his third fastest ever time clocking 1:57.30, just outside the 1:56.98 from the heats, to place fifteenth overall.\n\nShortt is back in action on Friday with Evan Bailey, Cormac Rynn and Jack Cassin in the 4x200m Freestyle Relay.\n\nThe quartet are all members at National Centre Limerick.\n\nAs well at the relay, Cassin will also be in action in the 100m Butterfly on Friday, while Tom Fannon, Paris Olympic Semi-Finalist, makes his long-awaited Singapore debut in the 50m Freestyle.\n\nWritten by Declan Bogue and originally published on The 42 whose award-winning team produces original content that you won’t find anywhere else: on GAA, League of Ireland, women’s sport and boxing, as well as our game-changing rugby coverage, all with an Irish eye. Subscribe here.\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Wiffen withdraws from World Aquatics Championships on medical grounds”.\n\nRecipient's Email\n\nFeedback on “Wiffen withdraws from World Aquatics Championships on medical grounds”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nDaniel wiffen\nellen walshe\nEllie McCartney\n\nNews in 60 seconds\n\nrace to the aras\nLabour Party throws support behind Catherine Connolly as Left unity candidate for president\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\n14 mins ago\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\n16 mins ago\n\nmisrepresented\nClimate scientists accuse US energy department of twisting their work in new report\n\n32 mins ago\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\n47 mins ago\n\nVanessa O'Callaghan\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nAmerican actor jailed for five years for choking woman out and raping her in Dublin AirBnB\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Ellen Walshe finished eighth in 200 metres Butterfly Final.","url":"https://www.thejournal.ie/ellie-mccartney-qualifies-for-final-2-6779860-Jul2025/","image":"https://img2.thejournal.ie/article/6779860/river/?height=400&version=6779916","video":null,"publish_date":"2025-07-31 20:45:00","author":null,"language":"en","source_country":"ie","sentiment":0.067},{"id":347069932,"title":"Fox News anchor caught off guard when confronted with Fox’s bad poll numbers for Trump on inflation","text":"Fox News anchor Harris Faulkner was seemingly caught flatfooted Thursday when a Democratic guest referenced her own network’s polling to show that the vast majority of Americans disapprove of the way Donald Trump is handling inflation.\n\nInstead, Faulkner heaped praise on the president over his handling of the economy while parroting Trump’s own false boasts about inflation plummeting, prompting her guest to point out that recent data shows that prices have been on the rise in recent months.\n\nDuring Thursday’s broadcast of The Faulkner Focus, the veteran anchor welcomed former Kamala Harris adviser Mike Nellis to her program to discuss Harris’ decision to forego a California gubernatorial run next year, which has sparked speculation that the former vice president may try for another White House run in 2028.\n\nToward the end of the discussion, which also included National Review writer Caroline Downey, Faulkner pointed out that the Democratic presidential field in the next election would be “crowded” before asking Nellis who he thought would become the frontrunner.\n\n“Who do you think this really does come down to having to impress the American people right now? Because your party, Mike, you guys aren’t all moving in concert with one another,” she declared.\n\nAcknowledging that the Democrats are “having tough conversations” after losing the 2024 election, Nellis went on to say “both political parties are out of touch with the day-to-day lives of most Americans” before bringing up poor approval numbers for the president on economic issues.\n\n“There’s a lot of polling out in the last couple of weeks talking about how frustrated people are with inflation and pricing and housing and things like that,” Nellis continued, prompting Faulkner to cut him off to insist that the economy is booming.\n\n“Inflation’s at 2 percent! The GDP just popped,” she exclaimed. Nellis, meanwhile, retorted that inflation is actually “at 2.9 percent,” referencing the “core” inflation index that was released earlier this month. The Consumer Price Index, meanwhile, rose 2.7 percent year-over-year, and prices were up 0.3 percent over the course of the month.\n\n“The GDP just popped to three percent! I mean, we haven’t seen that in a very long time,” a flustered Faulkner proclaimed, apparently unaware that the United States had two straight quarters of at least three percent growth last year – and had exceeded that mark in four of five quarters heading into the 2024 election.\n\n“If I could point you to Fox’s own polling, Trump is negative 30 percent on pricing and inflation and is as unpopular as Joe Biden ever was,” Nellis shot back. “So the American people are frustrated with where their lives are right now.”\n\nWith the Democratic strategist also highlighting other surveys that Americans feel they are worse off than they were six months ago, Faulkner interjected to let Downey get the final word and to bring the segment to an end.\n\n“President Trump is rapidly delivering on his economic promises,” Downey said before Faulkner wrapped things up.\n\nNellis, meanwhile, did appear to slightly exaggerate how poorly Trump fared in the latest Fox News survey – a survey that recently led the president to once again rage about the network’s polling division. \n\nThough he claimed that the president is negative 30 points on his handling of inflation, the network’s most recent poll finds that Trump is actually only down 26 points, as 36 percent of Americans approve of the way he’s dealing with the issue, compared to 62 percent who do not.","summary":"‘If I could point you to Fox’s own polling, Trump is negative 30 percent on pricing and inflation and is as unpopular as Joe Biden ever was,’ former Kamala Harris adviser Mike Nellis said on Thursday.","url":"https://www.independent.co.uk/news/world/americas/us-politics/fox-news-harris-faulkner-trump-poll-inflation-b2799907.html","image":"https://static.independent.co.uk/2025/07/31/19/58/the-faulkner-focus-(31).jpg?width=1200","video":"https://cdn.jwplayer.com/videos/QA2CLhGR-OhrQWqOm.mp4","publish_date":"2025-07-31 20:42:43","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.044},{"id":347069580,"title":"Trump’s onetime pal Geraldo Rivera turns on President over ‘lowbrow, disgusting’ policy","text":"Former Fox News anchor Geraldo Rivera has slammed his former friend, Donald Trump, over his administration’s immigration policies.\n\nMSNBC’s Ari Melber asked Rivera for his reaction Wednesday after top podcaster Joe Rogan criticized the administration’s crackdown on international students on college campuses. Rogan’s comments come after some pro-Palestine student activists have been detained by ICE.\n\n“They’re kicking students out that, like, write articles they don’t like,” Rogan had said Tuesday. “F****** crazy. Isn’t a university supposed to be a place where someone’s allowed to express themselves and have opinions?”\n\nHe added: “Deporting people because you don’t like who they’re criticizing? Like, that gets kind of shifty.”\n\nRivera echoed the sentiment, giving a fiery critique of the Trump administration.\n\n“Of all the things the President has done, I believe that if what appears to be happening in the Mideast does happen, and brings about the expulsion of Hamas from Gaza, I think that he'll get the Nobel Peace Prize,” Rivera said. “But I also think this is the most humiliating, harmful, racist government policy I've ever seen executed. “\n\nHe added: “The targeting of Latinos is something that is absolutely appalling. They walk around now - the laborers of Long Island, worried that because they’re Mexican, they’re going to get scooped up, their lives are going to be ruined.”\n\n“It’s really disgusting, it’s lowbrow, it’s something that I believe is shameful in every regard,” he continued.\n\nWhite House spokesperson Abigail Jackson called Rivera an “idiot” in response to his comments.\n\n“Geraldo Rivera is an idiot and he should apologize to Latino Americans for conflating them with illegal aliens who are lawfully being detained and deported,” Jackson said.\n\nIn March, Tufts University doctoral student Rümeysa Öztürk was arrested and detained for more than six weeks. Öztürk had written a pro-Palestine op-ed last year. Mahmoud Khalil, a prominent pro-Palestine activist and Columbia University graduate, was arrested that same month and detained for more than 100 days.\n\nSeveral university associations sued the Trump administration over its crackdown on students following the arrest of Khalil, Öztürk and others, the Associated Press reports. In court, the associations argued the students’ First Amendment right to free speech has been violated. Government attorneys have argued the administration is not targeting protesters.\n\nPresident Trump has vowed to carry out the “largest deportation operation in American history.” This has included an increase in immigration raids across the U.S., which sparked mass protests in Los Angeles earlier this year.\n\nRivera, once close with Trump, turned on him in 2024 and endorsed his challenger, former Vice President Kamala Harris, for president.\n\n“Former President Trump is a sore loser who cannot be trusted to honor the Constitution,” Rivera posted on X last October. “That is why I am voting for Kamala Harris to be our 47th President.”\n\nIn that same post, Rivera said Trump was a “loyal friend” during his first term in office, which lasted from 2017 to 2021. Rivera said the president gave him “regular access.” In return, Rivera said he gave Trump “the benefit of most doubts.”\n\nBut Rivera said his opinions changed as Trump and his allies claimed, without evidence, that former President Joe Biden did not win the 2020 election and that the results were fraudulent.\n\n“If you are a Republican, Donald Trump has made a liar of you,” Rivera wrote last year. “He has coaxed and intimidated tens of millions into pretending he was reelected in 2020, and that the election was stolen.”","url":"https://uk.news.yahoo.com/trump-onetime-pal-geraldo-rivera-203353324.html","image":"https://s.yimg.com/ny/api/res/1.2/gU2h6Wpg2Jp1sw60P1Cu8g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/e3ab5b80bd28facf0c5f808c195ac595","video":null,"publish_date":"2025-07-31 20:37:13","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.266},{"id":347069908,"title":"Trump’s onetime pal Geraldo Rivera turns on President over ‘lowbrow, disgusting’ policy","text":"Former Fox News anchor Geraldo Rivera has slammed his former friend, Donald Trump, over his administration’s immigration policies.\n\nMSNBC’s Ari Melber asked Rivera for his reaction Wednesday after top podcaster Joe Rogan criticized the administration’s crackdown on international students on college campuses. Rogan’s comments come after some pro-Palestine student activists have been detained by ICE.\n\n“They’re kicking students out that, like, write articles they don’t like,” Rogan had said Tuesday. “F****** crazy. Isn’t a university supposed to be a place where someone’s allowed to express themselves and have opinions?” \n\n He added: “Deporting people because you don’t like who they’re criticizing? Like, that gets kind of shifty.”\n\nRivera echoed the sentiment, giving a fiery critique of the Trump administration.\n\n“Of all the things the President has done, I believe that if what appears to be happening in the Mideast does happen, and brings about the expulsion of Hamas from Gaza, I think that he'll get the Nobel Peace Prize,” Rivera said. “But I also think this is the most humiliating, harmful, racist government policy I've ever seen executed. “\n\nHe added: “The targeting of Latinos is something that is absolutely appalling. They walk around now - the laborers of Long Island, worried that because they’re Mexican, they’re going to get scooped up, their lives are going to be ruined.”\n\n“It’s really disgusting, it’s lowbrow, it’s something that I believe is shameful in every regard,” he continued.\n\nWhite House spokesperson Abigail Jackson called Rivera an “idiot” in response to his comments.\n\n“Geraldo Rivera is an idiot and he should apologize to Latino Americans for conflating them with illegal aliens who are lawfully being detained and deported,” Jackson said.\n\nIn March, Tufts University doctoral student Rümeysa Öztürk was arrested and detained for more than six weeks. Öztürk had written a pro-Palestine op-ed last year. Mahmoud Khalil, a prominent pro-Palestine activist and Columbia University graduate, was arrested that same month and detained for more than 100 days. \n\nSeveral university associations sued the Trump administration over its crackdown on students following the arrest of Khalil, Öztürk and others, the Associated Press reports. In court, the associations argued the students’ First Amendment right to free speech has been violated. Government attorneys have argued the administration is not targeting protesters.\n\nPresident Trump has vowed to carry out the “largest deportation operation in American history.” This has included an increase in immigration raids across the U.S., which sparked mass protests in Los Angeles earlier this year.\n\nRivera, once close with Trump, turned on him in 2024 and endorsed his challenger, former Vice President Kamala Harris, for president.\n\n“Former President Trump is a sore loser who cannot be trusted to honor the Constitution,” Rivera posted on X last October. “That is why I am voting for Kamala Harris to be our 47th President.”\n\nIn that same post, Rivera said Trump was a “loyal friend” during his first term in office, which lasted from 2017 to 2021. Rivera said the president gave him “regular access.” In return, Rivera said he gave Trump “the benefit of most doubts.”\n\nBut Rivera said his opinions changed as Trump and his allies claimed, without evidence, that former President Joe Biden did not win the 2020 election and that the results were fraudulent. \n\n“If you are a Republican, Donald Trump has made a liar of you,” Rivera wrote last year. “He has coaxed and intimidated tens of millions into pretending he was reelected in 2020, and that the election was stolen.”","summary":"Former Fox News anchor Geraldo Rivera endorsed Kamala Harris over Donald Trump in the 2024 election","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-geraldo-rivera-immigration-policy-b2799887.html","image":"https://static.independent.co.uk/2025/07/31/18/06/Screenshot-2025-07-31-at-2-38-26-PM.png?width=1200","video":"https://cdn.jwplayer.com/videos/yyVEcqY2-OhrQWqOm.mp4","publish_date":"2025-07-31 20:37:13","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.266},{"id":347079420,"title":"Kamala Harris is releasing a book about her sudden and short campaign for the White House","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nAlamy Stock Photo\n\nKamala Harris is releasing a book about her sudden and short campaign for the White House\n\nIt’s due to be released in September.\n\n9.26pm, 31 Jul 2025\n\nShare options\n\nFORMER US VICE President Kamala Harris has announced that she’s releasing a book about her experience of running a last-minute campaign for the White House against Donald Trump last year.\n\nThe memoir is titled 107 Days – the length of time between launching her campaign after former President Joe Biden withdrew from the race and the election itself.\n\nIn a country where presidential hopefuls generally start campaigning at least one year, if not two, before an election, her 15 week sprint was highly unusual.\n\nHer memoir is being published by Simon & Schuster and is due to be released on 23 September. \n\nAdvertisement\n\nIn a video today on social media, Harris said: “Just over a year ago, I launched my campaign for president of the United States, 107 days — traveling the country, fighting for our future — the shortest presidential campaign in modern history.”\n\nWhat the world saw on the campaign trail was only part of the story.\n\nMy new book is a behind-the-scenes look at my experience leading the shortest presidential campaign in modern history.\n\n107 Days is out on September 23. I can't wait for you to read it: https://t.co/G4bkeZB4NZ pic.twitter.com/taUof0L4hs— Kamala Harris (@KamalaHarris) July 31, 2025 \n\nShe said that she wrote the book with “candor and reflection” and promised a “behind-the-scenes account” of the campaign.\n\nSpeculation has circulated in US media over whether Harris may run again for the Democratic nomination in 2028, which will be further fuelled by Harris remarking in today’s video that “sometimes, the fight takes a while”.\n\nHarris is due to appear tonight as a guest on The Late Show With Stephen Colbert, one of her few media engagements since losing the election last November.\n\nAdditional reporting by AFP\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nLauren Boland\n\nView 19 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Kamala Harris is releasing a book about her sudden and short campaign for the White House”.\n\nRecipient's Email\n\nFeedback on “Kamala Harris is releasing a book about her sudden and short campaign for the White House”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nKamala Harris\n\nNews in 60 seconds\n\nrace to the aras\nLabour Party throws support behind Catherine Connolly as Left unity candidate for president\n\nfiona sinnott\nGardaí conclude Wexford searches in investigation into disappearance of Fiona Sinnott\n\n14 mins ago\n\nSt Patrick's Athletic overcome scare in Estonia to keep European dream alive\n\n16 mins ago\n\nmisrepresented\nClimate scientists accuse US energy department of twisting their work in new report\n\n32 mins ago\n\nRhasidat Adeleke out of National Championships in Santry due to 'lingering' injury\n\n47 mins ago\n\nVanessa O'Callaghan\nTwo people released after questioning about fatal assault of woman in Cork last December \n\nWiffen withdraws from World Aquatics Championships on medical grounds\n\nCourt of Appeal\nConor McGregor loses appeal over civil jury finding that he raped Nikita Hand\n\nRTÉ radio presenter Seán Rocks dies aged 64\n\nCapel Street\nMan (23) charged with stabbing a garda in Dublin city centre\n\nAmerican actor jailed for five years for choking woman out and raping her in Dublin AirBnB\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"It’s due to be released in September.","url":"https://www.thejournal.ie/kamala-harris-new-book-about-campaign-6779836-Jul2025/","image":"https://img2.thejournal.ie/article/6779836/river/?height=400&version=6779838","video":null,"publish_date":"2025-07-31 20:26:41","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":0.182},{"id":347108124,"title":"Why a ‘Confused’ Trump Lashed Out at a MAGA Senator","text":"Skip to main content\n\nAsawin Suebsaeng, Nikki McCann Ramirez\n\nJuly 31, 2025\n\nPresident Donald Trump and Senator Josh Hawley\n\nChristopher Furlong/Getty Images; Tom Williams/CQ-Roll Call, Inc/Getty Images\n\nDonald Trump lashed out at his longtime ally and prominent MAGA Senator Josh Hawley (R-Mo.) in a bizarre Truth Social post on Wednesday. The president pilloried the senator as a “second-tier” lawmaker who had been used as a “pawn” by Democrats, after Hawley broke with Republicans to vote in favor of a congressional stock trading ban that will also apply to future presidents.\n\nTrump reacted with unchecked rage after Hawley voted to advance the legislation out of committee.“The Democrats, because of our tremendous ACHIEVEMENTS and SUCCESS, have been trying to ‘Target’ me for a long period of time, and they’re using Josh Hawley, who I got elected TWICE, as a pawn to help them,” Trump wrote. “I don’t think real Republicans want to see their President, who has had unprecedented success, TARGETED, because of the ‘whims’ of a second-tier Senator named Josh Hawley!”\n\nHawley defended himself later on Wednesday. The president is “not covered by the PELOSI Act, but Nancy Pelosi is,” Hawley told reporters after Trump’s post bashing him. “Listen, I want the president to sign the bill, so I’m happy to do whatever it would take to get him to say, ‘Yes, this is good.’” \n\nThe legislation was initially dubbed the Preventing Elected Leaders from Owning Securities and Investments (PELOSI) Act, after former House Speaker Nancy Pelosi (D-Calif.), whose husband’s lucrative stock portfolio has practically become its own trading index. Pelosi has said she supports the trading ban, which has been renamed the HONEST Act. An amendment proposed by Sen. Rick Scott (R-Fla.), which would have authorized a review of the Pelosi family’s past trading activity, was voted down. \n\nThe version of the legislation that passed out of committee on Wednesday was amended to apply its trading ban to the president and vice president — rather than only members of Congress — as a compromise to win support from Democrats. However, that prohibition would only cover the president and VP starting in 2029. In other words, the legislation still exempts Trump and Vice President J.D. Vance.\n\nEditor’s picks\n\nThe 250 Greatest Albums of the 21st Century So Far\n\nThe 100 Best TV Episodes of All Time\n\nThe 500 Greatest Albums of All Time\n\n100 Best Movies of the 21st Century\n\nHawley claimed on Thursday that the president’s meltdown had been prompted by a misunderstanding: that Trump had been told the version of the bill Hawley supported would have forced Trump to sell Mar-a-Lago. Two sources familiar with the situation tell Rolling Stone that Trump indeed lashed out at Hawley because he was “confused” or “misunderstood” the details of what Hawley was proposing.\n\nHawley had already signed on to a version of the ban that had a carve-out in place for Trump and Vance. The president was convinced that the Hawley-endorsed version didn’t have the carve-out and would negatively affect him and his business empire before he left office. Hence, Trump thought it was, in the words of one of the sources, “an attack on him” favored by the Democrats, so he took it out on Hawley, a Trump ally and MAGA devotee. The two sources blamed Hawley and his office, in part at least, suggesting the legislative details weren’t made clear to the White House during this process.\n\nIn the end, though, some close to the president are saying that Trump was just yelling at the wrong Republican senator. “The guy he should have been shouting at is Rand Paul,” a White House official says.\n\nPaul — whom Trump’s team is already annoyed with given the Kentucky Republican’s opposition to the president’s tariff agenda — attempted to drive Democratic support away from the bill by highlighting the fact that, while the legislation will cover the president, it will exempt Trump. \n\nTrending Stories\n\n‘He Was Rock Royalty’: Ozzy Osbourne Fans Gather for Emotional Farewell at Funeral\n\nTrump’s Sloppy Effort to Distract From Epstein Mess Creates a ‘Ticking Time Bomb’\n\nMary J. Blige Fighting Back After ‘Meritless’ Lawsuit From Sean Combs’ Ex Misa Hylton\n\nWhy a 'Confused' Trump Lashed Out at a MAGA Senator\n\n“I would oppose the substitute change because I think it should apply to everybody or nobody,” Paul said, according to The New York Times.\n\nHawley assured reporters on Thursday that he and Trump were back on good terms after he explained that he favored a version of the bill that would exempt Trump from the ban. “He said at the end, ‘Oh OK, great. This is good,’” the senator reportedly said of his call with Trump.\n\nSenators Could Vote Imminently to Remove Their Homes, Travel Info From Internet\n\nPrivacy for Me\n\nAndrew Perez and Ryan Bort\n\nTrump’s Sloppy Effort to Distract From Epstein Mess Creates a ‘Ticking Time Bomb’\n\nAsawin Suebsaeng\n\nEpstein Victim’s Family Slams Trump for Saying She Was ‘Stolen’ From Mar-a-Lago\n\nFalling Out\n\nNikki McCann Ramirez and Ryan Bort\n\nKamala Harris Announces New Book Covering ‘107 Days’ Of Her Presidential Campaign\n\nAmericans Wanted a Cost of Living Warrior. Trump Is the Opposite\n\nJulie Margetta Morgan\n\nGo to PMC.com\n\nMost Popular\n\nGwyneth Paltrow Is Astronomer's 'Temporary Spokesperson' After CEO, HR Chief Resign Following Coldplay Kiss Cam Scandal\n\n'The Naked Gun': First Reactions From the Premiere\n\nUS Government to Auction Works by Jean-Michel Basquiat, Pablo Picasso, and Diane Arbus Purchased with Funds from 1MDB Scandal\n\nAll About Ozzy Osbourne’s Oldest Kids Louis, Jessica & Elliot\n\nYou might also like\n\n‘She Rides Shotgun’ Review: Taron Egerton and Screen Daughter Ana Sophia Heger Drive a Well-Oiled Genre Outing\n\n4 hours ago\n\nGwyneth Paltrow Allegedly Sent Goop Employees a Harsh Message About Toilet Etiquette in the Office\n\n44 minutes ago\n\nBarneys New York’s Founding Family Feud in New Lawsuit\n\n35 minutes ago\n\nIf You Know Where to Look, a Tim Robinson Comedy Has Just as Many Layers as a Period Drama\n\n2 hours ago\n\nYankees, Mets, Padres Add in Busy MLB Trade Deadline \n\n2 hours ago\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.\n\nPowered by WordPress.com VIP","summary":"The president's public raging against Josh Hawley was the result of a \"misunderstanding\"","url":"https://www.rollingstone.com/politics/politics-features/trump-blew-up-josh-hawley-confused-1235397885/","image":"https://www.rollingstone.com/wp-content/uploads/2025/07/trump-blows-up-at-hawley.jpg","video":null,"publish_date":"2025-07-31 19:57:29","author":"Asawin Suebsaeng,Nikkimccannramirez","authors":["Asawin Suebsaeng","Nikkimccannramirez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":347055300,"title":"‘The Past Haunts Democrats’: Chris Cillizza Warns Kamala Harris Comeback Is ‘Problem’ For Her Party","text":"NewsNation political contributor Chris Cillizza warned on his YouTube channel Thursday that former Vice President Kamala Harris’ return to the spotlight will be damaging to the Democratic Party.\n\nWhile Harris announced on Wednesday that she would not seek the governorship in California, she did not rule out a 2028 presidential run and revealed on Thursday that she had written a book on her 2024 campaign, which she has already begun promoting. Cillizza said on his channel that Harris would serve as a reminder “of a bad period” at a time when Democrats are already extremely unpopular. (RELATED: ‘She Comes With Baggage’: California House Dems Split On Possible Kamala Harris Comeback)\n\n“The problem for Democrats is that Harris, as a public figure, as a potential 2028 candidate, keeps a conversation alive that they really don’t want to have,” Cillizza said. “Which is: how much did she know about [former President] Joe Biden while she was in the White House? Why didn’t she speak out more? Why did the party wind up becoming defined as weak and woke and just anti-[President Donald] Trump?”\n\n“She reminds people of a bad period. People do not like Democrats right now. And I think a lot of that has to do with Biden. It has to do with the handoff to Harris without anyone voting for her,” he continued. “And it has to do with the campaign she ran in those 107 days. I think Democrats — but the country more broadly — want to move on from that period of time.”\n\nHarris secured the 2024 Democratic presidential nomination in August despite virtually no primary voter approval after Biden dropped out and endorsed her on July 21, 2024.\n\nCillizza argued, “Democrats desperately need to get away from what happened” during the 2024 election. He suggested that Harris’ book was a lose-lose situation regarding the cover-up of Biden’s cognitive decline.\n\n“It is hard for me to believe that Kamala Harris knew nothing about it. Now, what does she say in the book? I don’t know. I don’t know what she says in the memoir,” he said. “But I guarantee you that if she says nothing, she’s going to face a lot of questions about saying nothing. If she hints anything about his potential decline, that’s going to raise more questions. And if she goes full tell-all — which I don’t think she will do — that will raise even more questions.”\n\n“Point is, that book comes out September 23rd. We’re probably talking about that book and what went wrong for Democrats, and what they knew and when did they know it, through the fall — probably through right up until the November elections, when Virginia and New Jersey vote and we’ll have new governor’s races and new governors to talk about,” he added. “But that is a bad conversation for Democrats.”\n\nCillizza said Harris not ruling out a 2028 run will lead to continued discussion about past issues rather than conversations about how the Democratic Party can improve for the future.\n\n“So I don’t think that the Harris decision is just a mistake for her. I do. I think it’s a mistake for her political career. Because now I think she’s not going to get elected governor,” he said. “And … she’s not going to win the Democratic presidential nomination in 2028. I think it’s a problem for the broader Democratic Party because it latches them to the past.”\n\n“I think the more the past haunts Democrats, the more problematic it is for them to move forward into the future,” he concluded.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Past haunts Democrats'","url":"https://dailycaller.com/2025/07/31/the-past-haunts-democrats-chris-cillizza-warns-kamala-harris-comeback-is-problem-for-her-party/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/Screenshot-2025-07-31-3.18.29-PM-e1753989621450.png","video":null,"publish_date":"2025-07-31 19:37:31","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.569},{"id":347055298,"title":"Texas GOP Hopes That Latinos Flocking To Trump Could Get Them 5 Seats In Redistricting","text":"Texas Republicans are banking on the GOP’s gains among Hispanic and Latino voters in recent elections, seeking to create four Republican-leaning, majority-Hispanic districts in the state in their mid-decade redistricting proposal.\n\nState Republicans on Wednesday unveiled plans for a new congressional map that, if enacted, would likely flip five Democratic seats in the 2026 midterm elections — four of them being majority-Hispanic congressional districts. President Donald Trump has been urging Texas Republicans to redraw the state’s congressional maps ahead of the 2026 midterms in an attempt to widen the GOP’s narrow majority in the House of Representatives.\n\n“Republicans have been steadily increasing their support with Hispanic voters in Texas, so they no doubt are confident that redistricting could help them gain seats,” Hans A. von Spakovsky, manager of the Election Law Reform Initiative and a senior legal fellow at the Heritage Foundation’s Edwin Meese III Center for Legal and Judicial Studies, told the Daily Caller News Foundation. “President Trump’s share of their vote in Texas rose from 34% in 2016 to 41% in 2020 to 55% in 2024. He went from getting a minority of the Hispanic vote to [getting] a majority of the vote in just eight years.”\n\nTrump’s 2024 performance among Hispanic voters in Texas, according to exit polls, was several percentage points better than his performance among Hispanic and Latino voters nationwide. Additionally, Trump’s vote share among Texas Hispanics was only one point lower than his vote share among all 2024 voters in the Lone Star State.\n\nIn the 2024 election, 48% of Hispanics nationwide voted for Trump — the highest ever recorded percentage for a Republican presidential nominee — up from 36% in the 2020 presidential election, according to a Pew Research report released in June. Trump notched 56.3% of the overall 2024 vote in Texas to former Vice President Kamala Harris’ 42.4%. (RELATED: CNN’s Harry Enten Says Texas Redistricting Could Make ‘Huge Difference’ For GOP In Midterms)\n\n“Everything we know about Latino voters tells us that they are highly persuadable and have in the last few election cycles made decisions based on who they believe will address their economic concerns and priorities,” Melissa Morales, president of Somos Votantes, a Democratic-aligned group that focuses on Latino voters, told Politico on Thursday.\n\nRepublicans currently hold 25 of Texas’ 38 House seats, with Trump notably carrying 27 of those districts in the 2024 presidential election, the Texas Tribune reported on Wednesday. \n\nTwo Democrats — both of them Hispanic moderates representing border districts — won their 2024 reelection bids in seats Trump carried that cycle. Democratic Texas Rep. Henry Cuellar won reelection by six points despite Trump carrying his district by seven and Democratic Texas Rep. Vicente Gonzalez won by under three points despite Trump winning his district by five.\n\n“Republican gains with Hispanic voters in Texas are not just a single-cycle phenomenon,” Kyle Kondik, managing editor of Sabato’s Crystal Ball, the University of Virginia Center for Politics’ nonpartisan newsletter on American campaigns and elections, told the DCNF. “Back in 2020, Trump made significant gains, for instance, in heavily Latino South Texas even while losing overall to [former President] Joe Biden. Four years later, those gains continued. I think there is definitely the possibility of a swing back to Democrats to some extent in the context of the 2026 midterm — the non-presidential party often does well in such elections — but in the longer term there probably are reasonable signs of optimism for Republicans with these voters.”\n\n“In terms of the new map draft, I don’t really think Republicans even need further gains with Latinos to realize their maximal gain — it has 30 seats that voted for Trump by 10 points or more, so it’s designed to elect 5 more Republicans than the current map,” Kondik added. “Now, the 2024 presidential result in these districts is probably more of a high water mark than a durable, every-election phenomenon, and Democrats do better, for instance, in the South Texas seats than Harris did in the presidential race. But I don’t think there’s much risk that Republicans spread themselves too thin on this map — maybe they don’t win all 30 seats in 2026, but I also don’t see them doing worse than the 25 seats they already hold.”\n\nNational Republican Congressional Committee (NRCC) Spokesman Christian Martinez said Thursday in a statement provided to the DCNF that “Hispanic communities are sick and tired of radical Democrats turning their backs on them time and again.”\n\n “They are forcefully rejecting the far-left agenda that resulted in years of open borders, skyrocketing prices, and woke insanity like men in girls’ sports,” Martinez added. “Republicans are the party of common sense, and Hispanic voters know it.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Hispanic communities are sick and tired of radical Democrats'","url":"https://dailycaller.com/2025/07/31/texas-redistricting-hispanic-latino-voters-republican/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/GettyImages-525837778-scaled-e1753983594510.jpg","video":null,"publish_date":"2025-07-31 19:07:09","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.013},{"id":347066250,"title":"WATCH -- Kamala Harris Drops Cringe TikTok: 'Everyone Thinks You've Been Kicking Back, Drinking Margaritas on the Beach'","text":"Former Vice President and failed President Donald Trump challenger Kamala Harris dropped what many are describing as a cringe TikTok, as she makes headlines previewing her upcoming book on her failed presidential campaign.\n\nThe video features Harris pretending to whisper to someone else about herself.\n\n“Everyone thinks you’ve been kicking back, drinking margaritas on the beach, but really, you’ve been hard at work, writing a book, meeting with leaders, thinking about the future of our country,” she said before looking at the camera and asking, “Who said that?”\n\n“This is probably one of the most unlikeable women ever created,” one X user remarked, as many were very unforgiving.\n\n“So damn cringe. It’s hard to watch,” another said.\n\n“They haven’t learned a thing. Truly remarkable,” another surmised. “Ridicule and mock every one of these Democrat political strategists & consultants into oblivion.”\n\nThe cringe TikTok comes as Harris teases her upcoming book, which gives a “behind-the-scenes look” at her short and failed campaign against President Trump, calling it “deeply personal.”\n\n“Just over a year ago, I launched my campaign for President of the United States — 107 days traveling the country, fighting for our future, the shortest presidential campaign in modern history,” she said in a video statement holding her book.\n\n“It was intense, high stakes, and deeply personal for me and for so many of you. Since leaving office, I’ve spent a lot of time reflecting on those days, talking with my team, my family, my friends, and pulling my thoughts together — in essence, writing a journal that is this book, 107 days with candor and reflection,” she said, previewing the book as a “behind the scenes account of that journey.”\n\nShe added that “one truth” kept returning to her as she penned the book: That “sometimes the fight takes a while.”\n\n“I will never stop fighting to make our country reflect the very best of its ideals, always on behalf of the people,” she said.\n\nHer book reveal follows Harris confirming that she will not run for governor of California, despite months of speculation.\n\n“In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor,” Harris said in a statement. “I love this state, its people, and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election.”\n\n“For now, my leadership — and public service — will not be in elected office,” Harris added later in the statement. “I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.”\n\nPresident Donald Trump won the 2024 presidential election against former Vice President Kamala Harris with 312 electoral votes to Harris’s 226. He also secured the popular vote by over 2 million votes.","summary":"Former vice president and failed President Donald Trump challenger Kamala Harris dropped what many are describing as a cringe TikTok, as she makes headlines previewing her upcoming book on her failed presidential campaign.\n\n\nThe post WATCH &#8212; Kamala Harris Drops Cringe TikTok: &#8216;Everyone Thinks You&#8217;ve Been Kicking Back, Drinking Margaritas on the Beach&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/07/31/video-kamala-harris-drops-cringe-tiktok-everyone-thinks-youve-been-kicking-back-drinking-margaritas-on-the-beach/","image":"https://media.breitbart.com/media/2025/07/GettyImages2207749987-640x335.jpg","video":null,"publish_date":"2025-07-31 19:06:55","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","source_country":"US","sentiment":0.488},{"id":347073318,"title":"Restaurant owner roasts Kamala Harris' 'complete failure' of a California platform","text":"to top close Video This video is playing in picture-in-picture.\n\nVarney Co July 31, 2025 02:48 \n\n Restaurant owner roasts Kamala Harris' 'complete failure' of a California platform \n Celebrity chef Andrew Gruel weighs in on whether former Vice President Kamala Harris can win another election and debunks pushback against tariffs on 'Varney & Co.'\n\nTags POLITICSWHAT TO WATCHSHOWSVARNEY| LATEST EPISODESVARNEY AND COV-VIDEOSTRADE WARCHINA TARIFFS","summary":"Celebrity chef Andrew Gruel weighs in on whether former Vice President Kamala Harris can win another election and debunks pushback against tariffs on &apos;Varney &amp; Co.&apos;","url":"https://www.foxbusiness.com/video/6376396189112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/9e3484dc-176b-42df-8519-a97d28ce8ef9/583fb7f0-8551-40fb-8a0b-4b9eab6637e1/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 19:02:52","author":null,"language":"en","source_country":"us","sentiment":0.7},{"id":347105286,"title":"Kamala Harris to Join Stephen Colbert for First Interview After Historic Election Loss","text":"Former Vice President Kamala Harris has chosen Stephen Colbert and The Late Show to conduct her first interview after her decisive loss to Donald Trump in the 2024 presidential election.\n\nHarris has kept a relatively low media profile since her huge election loss, but she is set to flog her new book, 107 Days,” being released at the end of September, in which she describes the late presidential campaign from her perspective.\n\n“What the world saw on the campaign trail was only part of the story. My new book is a behind-the-scenes look at my experience leading the shortest presidential campaign in modern history,” a blurb describing her upcoming book exclaims.\n\nHarris going on Colbert, a safe venue, for her first high-profile media outing after the election means she won’t likely be confronted by any though questions. Her last appearance on Colbert’s now cancelled show was about a month before Election Day last year.\n\nHarris is also in the news for other reasons. This week she announced that she will not be running for the Democrat nomination for Governor of California.\n\nIndeed, Harris seemed to hint that she doesn’t plan to run for any office any time soon and insisted that her leadership going forward will “not be in elected office.”\n\n“In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor,” Harris said in a published statement. “I love this state, its people, and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election.”\n\n“For now, my leadership—and public service—will not be in elected office,” the former Veep added. “I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.”\n\nFollow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, X at WTHuston, or Truth Social at @WarnerToddHuston.","summary":"Former Vice President Kamala Harris has chosen Stephen Colbert and \"The Late Show\" to conduct her first interview after her decisive loss to Donald Trump in the 2024 presidential election.\n\n\nThe post Kamala Harris to Join Stephen Colbert for First Interview After Historic Election Loss appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/07/31/kamala-harris-to-join-stephen-colbert-for-first-interview-after-historic-election-loss/","image":"https://media.breitbart.com/media/2024/10/GettyImages-2176960005-640x335.jpg","video":null,"publish_date":"2025-07-31 18:38:06","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","source_country":"US","sentiment":0.224},{"id":347038912,"title":"Michael Whatley's Chances of Beating Roy Cooper in North Carolina—New Poll","text":"A new poll of the North Carolina Senate election points to a close race between former Governor Roy Cooper and Republican National Committee chair Michael Whatley in what is likely to be one of the most competitive of the 2026 midterms.Matt Mercer, a North Carolina GOP spokesperson, told Newsweek that the poll should be \"alarming for Democrats.\"Newsweek also reached out to the Cooper campaign for comment via email.Why It MattersCooper, a Democrat, announced his campaign earlier this week, and Whatley is expected to jump into the race after receiving support from President Donald Trump. A new poll from Victory Insights gives the first look at what a head-to-head matchup could look like next year, when Democrats are hoping to flip the seat being vacated by Republican Thom Tillis.North Carolina is viewed as one of Democrats' best opportunities to flip a seat as they believe Trump's approval rating could fuel a 2018-style blue wave. Cooper is viewed as a strong candidate, but they still have not won a Senate race in the Tar Heel State since 2008, despite its battleground status.What To KnowCooper and Whatley may be in for a tight race, according to the Victory Insights.The poll gave Cooper a narrow advantage, with 43.4 percent of respondents saying they would be inclined to support him next November, while 40.2 percent said they planned to cast their ballot for Whatley if he wins the GOP nomination.However, when those who were undecided were pushed to say who they were leaning toward, Cooper's advantage narrowed.In that scenario, 44.4 percent of respondents said they planned to back Cooper, while 43.5 percent said they would back Whatley, according to the poll, which surveyed 600 likely voters from July 28-30.Other polls have similarly pointed to a tight race, though this is the first to ask about Whatley specifically.A poll released last week by co/efficient found that Cooper would be tied with a generic Republican candidate—each receiving 48 percent support.In November, Trump carried North Carolina with 51 percent of the vote to former Vice President Kamala Harris' 47.8 percent.North Carolina voters have generally preferred Republicans in federal races since 2008, when former President Barack Obama and former Senator Kay Hagan defeated Republicans in their races. But Democrats have fared well in state elections. Democrat Josh Stein won November's gubernatorial race by nearly 15 points after Republican Mark Robinson faced a series of scandals on the campaign trail.What People Are SayingMatt Mercer, a North Carolina GOP spokesperson, told Newsweek: \"It should be alarming for Democrats to see Roy Cooper, with 93 percent name ID, not just tied but well below 50 percent in this poll. North Carolinians appear to know who Roy Cooper is: a 40-year career politician, radical liberal, and he cannot run away from his party's hard-left policies. A rough launch, indeed.\"Ben Galbraith, a senior pollster for Victor Insights, in the polling memo: \"In summary, despite a generally favorable electorate for Republicans, Cooper is starting out with a lead, which corroborates the conventional wisdom that Cooper was a strong choice for the Democratic nomination. However, Whatley has plenty of room to grow, and all signs indicate he'll have the funding and campaign infrastructure to do so.\"Roy Cooper, in a video announcing his candidacy: \"I never really wanted to go to Washington. I just wanted to serve the people of North Carolina right here, where I've lived all my life. But these are not ordinary times.\"What Happens NextSeveral other Republicans have been floated as potential candidates, but it's unclear whether Trump's endorsement will affect their plans.The Cook Political Report and Sabato's Crystal Ball both classify the North Carolina Senate race as a pure toss-up.","summary":"Whatley and Cooper are locked in a tight Senate race ahead of the 2026 midterms, according to a new poll.","url":"https://www.newsweek.com/michael-whatley-chances-beating-roy-cooper-north-carolina-senate-2107194","image":"https://d.newsweek.com/en/full/2694323/michael-whatley-north-carolina-senate-poll.jpg?w=1600&h=900&q=88&f=aeb61fb53b356b247de00fb74736f0ba","video":null,"publish_date":"2025-07-31 18:34:57","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.272},{"id":347055282,"title":"Biden’s Post-Presidential Fall From Grace Even Sadder Than You Think","text":"Former President Joe Biden, along with former Vice President Kamala Harris, managed impressively poor presidential campaigns in 2024. The pair has largely spurned the spotlight since Donald Trump again secured the presidency. New details about Biden and Harris’ lives suggest they’re already fading from political memory. \n\nBiden is “very in the wild,” said a person familiar with Biden’s habits, according to Politico. “His footprint is significantly smaller, and it’s sort of shocking.”","summary":"Duped by a flawless cover-up","url":"https://dailycaller.com/2025/07/31/joe-biden-kamala-harris-democratic-party-administration-cognition-public-private-life-politico/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/GettyImages-2166803165-scaled-e1753985110107.jpg","video":null,"publish_date":"2025-07-31 18:34:18","author":"Natalie Sandoval","authors":["Natalie Sandoval"],"language":"en","category":"politics","source_country":"US","sentiment":0.238},{"id":347034772,"title":"'Full decade of minority rule': Analyst reveals how GOP aims to 'erase Democratic power'","text":"Six years after Trump demanded Geogia Secretary of State Brad Raffensperger “find” him enough votes to win in 2020, Republicans are still trying to find him votes.\n\n“Now, he’s calling on Texas Republicans to find five congressional seats — before a single vote is cast in the 2026 midterms. And the GOP is answering that call,” said MSNBC co-host Symone Sanders Townsend.\n\nTownsend referenced Texas Republicans proposing a heavily gerrymandered congressional map this week that gives Republicans control of 30 out of 38 House seats, despite 42 percent of the state voting for Democratic presidential candidate Kamala Harris in 2024.\n\nREAD MORE: 'Buyouts': Trump’s mass layoffs are costing taxpayers a fortune — here’s why\n\nIf enacted, Townsend said the Republican map would “erase Democratic power in one of the most diverse states in the nation.”\n\n“We’ve seen this kind of maneuver before,” said Townsend. “After the 2010 tea party wave election, Republicans launched a nationwide campaign called the Redistricting Majority Project (REDMAP) to win control of state legislatures ahead of the 2011 redistricting cycle. That effort paid off. Republicans gerrymandered themselves into durable congressional majorities in states like North Carolina, Ohio and Wisconsin. A decade later, we’re still living with the consequences.”\n\nThe map, she said, “slices up Black and Latino communities,” particularly in urban centers like Dallas and Houston and gives an advantage to a white population that only comprises about 40 percent of the state’s population. The Texas Tribune reports at least 54 percent of lawmakers were white in 2023, and half are white men.\n\n“Now, Trump is attempting a mid-decade REDMAP 2.0 in Texas, a state that already had one of the most gerrymandered congressional maps in the country and has a long history of using racial gerrymandering to suppress voters of color,” Townsend said.\n\nREAD MORE: 'You guys made this happen': Dems find a way to stick it to a furious GOP\n\nThis is part of a broader Republican Party strategy, said Townsend, which targets not only congressional maps but also state legislative lines.\n\n“And that matters, because America’s policy doesn’t begin in Washington,” she said. “It starts in state capitols. Bathroom bills. Book bans. Voter roll purgers. Attacks on trans children. These policies are born in Republican-controlled legislatures and then bubble up to the national level.”\n\nShe added that Republicans know this, and \"have been playing the long game,\" unlike Democrats\n\nThe public is already fighting back with hundreds of protestors showing up at redistricting hearings in Texas this week, but Townsend said Democrats need to get serious about investing in and flipping state seats or they could “lose a fair shot at the House not just in 2026, but until 2032. A full decade of minority rule.”\n\nREAD MORE: Behind the real reason Americans voted for Trump\n\nRead the full MSNBC report at this link.","summary":"Six years after Trump demanded Geogia Secretary of State Brad Raffensperger “find” him enough votes to win in 2020, Republicans are still trying to find him votes.\n\n“Now, he’s calling on Texas Republicans to find five congressional seats — before a single vote is cast in the 2026 midterms. And the GOP is answering that call,” said MSNBC co-host Symone Sanders Townsend.\n\nTownsend referenced Texas Republicans proposing a heavily gerrymandered congressional map this week that gives Republicans control of 30 out of 38 House seats, despite 42 percent of the state voting for Democratic presidential candidate Kamala Harris in 2024.\n\nREAD MORE: 'Buyouts': Trump’s mass layoffs are costing taxpayers a fortune — here’s why\n\nIf enacted, Townsend said the Republican map would “erase Democratic power in one of the most diverse states in the nation.”\n\n“We’ve seen this kind of maneuver before,” said Townsend. “After the 2010 tea party wave election, Republicans launched a nationwide campaign called the Redistricting Majority","url":"https://www.alternet.org/gerrymander-texas-republicans/","image":"https://www.alternet.org/media-library/image.jpg?id=59811776&width=1200&height=600&coordinates=0%2C116%2C0%2C117","video":null,"publish_date":"2025-07-31 18:21:51","author":"Adam Lynch","authors":["Adam Lynch"],"language":"en","category":"politics","source_country":"us","sentiment":0.012},{"id":347055290,"title":"Kamala Harris Posts Cringe TikTok Stating She Has Not Been ‘Drinking Margaritas On The Beach’","text":"Former Vice President Kamala Harris posted a TikTok video on Thursday asserting that she has not been relaxing and boozing since largely vanishing from public view after losing the presidential election in November.\n\nHarris’ TikTok post appears to be an attempt at the “Who Said That” trend in which users turn their faces away from the camera to obscure their mouths while making bold statements. However, Harris’ mouth can be seen moving as she failed to cover it with her hand throughout the video — which she used to promote her upcoming book and claimed she has been working hard rather than lounging. (RELATED: ‘She Comes With Baggage’: California House Dems Split On Possible Kamala Harris Comeback)\n\n“Everyone thinks you’ve been kicking back, drinking margaritas on the beach, but really you’ve been hard at work writing a book, meeting with leaders, thinking about the future of our country,” Harris said, facing away from the camera.\n\n“Who said that?” she jokingly asked, turning back toward the camera.\n\nHarris also announced in a Wednesday statement on X that she would not seek the governorship in California after reports she was considering whether to enter the governor’s race or pursue the presidency in 2028. She wrote that she was excited about working on “helping elect Democrats” nationwide and “sharing more details in the months ahead” about her future aspirations.\n\nHarris launched her brief 2024 presidential campaign after former President Joe Biden dropped out and endorsed her on July 21, 2024. She went on to lose the popular vote and all seven swing states to President Donald Trump.\n\nThe former vice president announced on X Thursday that she had written a book on her campaign titled “107 Days” that is set for publication in September.\n\nComedian Kareem Rahma, in a resurfaced March appearance on “Forbes Top Creators Show,” detailed a strange interview on his “Subway Takes” show with Harris during the campaign that went so badly that it did not get released.\n\n“Her take was really confusing and weird and not good. And so we mutually agreed that we shouldn’t publish it,” Rahma said. “And I got lucky because I didn’t want to be blamed for her losing.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Kicking back'","url":"https://dailycaller.com/2025/07/31/kamala-harris-cringe-tiktok-stating-drinking-margaritas-beach/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/Screenshot-2025-07-31-1.55.15-PM-e1753984569754.png","video":null,"publish_date":"2025-07-31 18:11:38","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","source_country":"US","sentiment":-0.198},{"id":347066252,"title":"Kamala Harris Mocked for Writing 'Word Salad' Book About Failed 2024 Presidential Campaign","text":"Former Vice President Kamala Harris announced on Thursday her memoir about her time on the campaign trail after former President Joe Biden dropped out of the 2024 race.\n\nHarris said her forthcoming book will give readers a behind-the-scenes look at her experience “leading the shortest presidential campaign in modern history.”\n\nThe book, titled “107 Days,” is set for release on September 23.\n\nHarris said she wrote it “with candor and reflection” and believes, “There is value in sharing what I saw, what I learned, and what I know it will take to move forward.”\n\nHer video announcement drew widespread criticism from social media users. One person replied, “How are you not embarrassed to have run one of the worst presidential campaigns in history? You literally had rappers twerking at your events.”\n\n“You wrote a book? You couldn’t make it through a speech without the teleprompter but you want people to believe you wrote a book?” someone else commented, while another person said, “A book full of word salad. A must read, I’m sure.”\n\nIn late July 2024, the Associated Press (AP) reported that Biden announced he was dropping out of the race after a disastrous debate with Donald Trump, who went on to win the presidency a second time in a historic comeback.\n\nThe AP article said Biden “did not immediately throw his support behind Vice President Kamala Harris, the party’s instant favorite for the nomination at its August convention in Chicago.”\n\nIn October, Harris suggested during a 60 Minutes interview that she was “elected” the Democrat Party nominee, but a Breitbart News fact check found her statement to be misleading.\n\n“Harris, though she won the majority of delegates to become the party’s nominee, won zero votes in Democrat primary process,” the outlet said.\n\nTrump recently accused Harris’s campaign of breaking the law over alleged payments to celebrities including Beyoncé and Oprah Winfrey for their endorsements, Breitbart News reported on Saturday.\n\nIn a post on his Truth Social, the president said, “YOU ARE NOT ALLOWED TO PAY FOR AN ENDORSEMENT,” Trump continued. “IT IS TOTALLY ILLEGAL TO DO SO. Can you imagine what would happen if politicians started paying for people to endorse them. All hell would break out! Kamala, and all of those that received Endorsement money, BROKE THE LAW. They should all be prosecuted! Thank you for your attention to this matter.”\n\nMeanwhile, Harris recently ruled out a run for California governor in 2026, and Biden reportedly sold his presidential memoir for $10 million.","summary":"Former Vice President Kamala Harris announced on Thursday her memoir about her time on the campaign trail after former President Joe Biden dropped out of the 2024 race.\n\n\nThe post Kamala Harris Mocked for Writing &#8216;Word Salad&#8217; Book About Failed 2024 Presidential Campaign appeared first on Breitbart.","url":"https://www.breitbart.com/2024-election/2025/07/31/kamala-harris-mocked-for-writing-word-salad-book-about-failed-2024-presidential-campaign/","image":"https://media.breitbart.com/media/2025/07/GettyImages-2201385157-640x335.png","video":null,"publish_date":"2025-07-31 17:48:15","author":"Amy Furr","authors":["Amy Furr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.237},{"id":347025962,"title":"Kamala Harris To Give First Post-Election Interview To Soon-To-Be Canceled Late Night Host Stephen Colbert","text":"Former Vice President Kamala Harris on Thursday is set to appear for her first interview since the 2024 election with Stephen Colbert, whose late night program is about to be taken off the air.\n\nHarris’ interview comes just one day after she announced that she will not run to become governor of California and that she is releasing a new book about her short-lived presidential campaign titled, “107 Days.” She is making her first post-election appearance on “Late Night with Stephen Colbert,” which is currently in its final season due to the economic pressures facing CBS.\n\nCBS executives said that the cancellation of Colbert’s program in May 2026 is solely a “financial decision against a challenging backdrop in late night,” according to Variety. Colbert’s program caused the network to lose between $40 and $50 million in 2024, and executives believed they were on track to lose even more money throughout the upcoming year.\n\n“We consider Stephen Colbert irreplaceable and will retire ‘The Late Show’ franchise’ in May of 2026,” CBS executives said in a statement. ““We are proud that Stephen called CBS home. He and the broadcast will be remembered in the pantheon of greats that graced late night television. This is purely a financial decision against a challenging backdrop in late night. It is not related in any way to the show’s performance, content or other matters happening at Paramount.” (RELATED: MSNBC Panelist Says Kamala Harris Backed Away From Governor Run Because Democrat Base Doesn’t Want Her)\n\n She’s back! CBS announces that Kamala Harris will appear on the Colbert show tonight for her first post-election interview pic.twitter.com/aZznAgutXY — Charlie Spiering (@charliespiering) July 31, 2025 \n\nThe cancellation also came as speculation emerged that Colbert and Jon Stewart, who hosts a weekly broadcast of Comedy Central’s “The Daily Show,” may face scrutiny from executives at SkyDance Media for their repeated jabs against President Donald Trump, Variety reported. David Ellison, the leader of SkyDance, received praise from Trump as his company is set to acquire and merge with Paramount Global, the parent company of both CBS and Comedy Central.\n\nCBS continues to face financial troubles since they settled a lawsuit with Trump over the editing of a “60 Minutes” interview with Harris in October 2024. Paramount agreed to pay $16 million toward the president’s future presidential library on July 2, and later agreed to pay another $20 million on July 22.\n\nHarris’ political future still remains up in the air since her loss to Trump in the 2024 election. Democratic donors appeared unenthused by the prospect of Harris entering the California gubernatorial race.\n\nPolitical strategists have also opposed Harris running for governor or in the 2028 Democratic presidential primary, particularly pointing to her campaign spending $1.5 billion that included celebrity appearances and interviews.\n\nFormer Democratic National Committee fundraiser Lindy Li told NewsNation during a Nov. 26, 2024, interview that she was “stunned” by Harris and her campaign’s lack of accountability for the massive spending, while Democratic donor John Morgan argued that the campaign spending should end Harris’ political career.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"Harris is making her appearance on a doomed late night program","url":"https://dailycaller.com/2025/07/31/kamala-harris-stephen-colbert-cbs-late-night/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/MixCollage-31-Jul-2025-01-16-PM-9768-e1753982259381.jpg","video":null,"publish_date":"2025-07-31 17:38:49","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","category":"politics","source_country":"US","sentiment":-0.077},{"id":347024584,"title":"Kamala Harris to publish behind-the-scenes account of failed 2024 campaign","text":"Former Vice President Kamala Harris is teasing a \"behind-the-scenes\" look at her abbreviated and ultimately unsuccessful 2024 White House bid. Harris, in a video posted to social media on Thursday, announced that her new book, titled \"107 Days,\" releases in September and will provide details on what she calls \"the shortest presidential campaign in modern history.\" \"I believe there’s value in sharing what I saw, what I learned, and what I know it will take to move forward,\" Harris said. Harris replaced then-President Joe Biden last July as the Democratic Party's 2024 presidential nominee after he dropped out of the race amid mounting questions over his physical and mental stamina following a disastrous debate performance a month earlier against now-President Donald Trump. KAMALA HARRIS RULES OUT 2026 RUN IN HER HOME STATE OF CALIFORNIA \"What the world saw on the campaign trail was only part of the story,\" Harris teases. The news from Harris came one day after she announced that she wouldn't run in 2026 for governor of her home state of California. But her decision to keep her name off the ballot next year left the door open for a possible second presidential bid in 2028. In her statement on Wednesday explaining her decision, Harris said, \"For now, my leadership — and public service — will not be in elected office.\" \"I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,\" she said. After losing last year's election to Trump and then serving out the remainder of her term as vice president, Harris returned to California and kept close counsel with an inner circle of confidants. And some in her inner circle, as well as political analysts, suggested that running and winning the election in 2026 for governor of California, the nation's most populous state and home to the world's fifth-largest economy, would likely take a 2028 White House run off the table. But with a gubernatorial run off the table, that's no longer a concern. 21 DEMOCRATS WHO MAY RUN FOR THE WHITE HOUSE IN 2028 If Harris eventually does launch a 2028 presidential campaign, she would start her ride on the road to the White House as the most recognizable Democrat in what's expected to be a large field of contenders. And she would also come equipped with a broad fundraising network that she built up last cycle. \"She would certainly be a very serious candidate in the primary in 2028, if she runs,\" a Democratic strategist and veteran of multiple White House campaigns told Fox News Digital. The strategist, who asked to remain anonymous to speak more freely, said that \"a lot of Democrats think she was put in a tough spot in 2024 and deserves to have a chance to run a race on her own…she was limited in doing some of the things that politically she might have needed to do to make a cleaner break with Biden.\" But Harris could also potentially be weighed down with plenty of political baggage from the 2024 campaign, when the Democrats lost not only the White House but also their Senate majority, and failed to win back control of the House. SUCCEEDING TRUMP IN 2028: SIX REPUBLICANS TO KEEP YOUR EYES ON As the party looks to escape the political wilderness, many Democrats are aiming to make a clear break with the past as they strive for a reset. \"If you're trying to take a different path for the party, it's hard to go backwards and pick the person who lost to Trump,\" a Democratic consultant told Fox News. \"There needs to be a fresh start, a new generation.\" If Harris does run, she'd have to deal with her unwavering support for Biden as his physical and mental abilities appeared to waver in front of Americans. Republican Rep. James Comer, who as House Oversight chair is investigating the former president’s use of the autopen and mental fitness while in the White House, said in an interview on Fox News' \"The Ingraham Angle\" that \"the odds of Kamala Harris getting a subpoena are very high.\" CLICK HERE TO GET THE FOX NEWS APP While Harris has been spending recent months mulling her decision on a gubernatorial run, other potential 2028 Democratic presidential contenders have already been making early moves as they try to move past the Biden administration and last year's election setbacks. Among them are Govs. Gavin Newsom of California, JB Pritzker of Illinois, Josh Shapiro of Pennsylvania, Wes Moore of Maryland, Andy Beshear of Kentucky, Gretchen Whitmer of Michigan, as well as Sen. Cory Booker of New Jersey and former Biden Transportation Secretary Pete Buttigieg.","summary":"Former Vice President Kamala Harris reveals upcoming book on her unsuccessful 2024 White House bid while ruling out 2026 California gubernatorial run.","url":"https://www.foxnews.com/politics/kamala-harris-publish-behind-the-scenes-account-failed-2024-campaign","image":"https://static.foxnews.com/foxnews.com/content/uploads/2022/10/KamalaHarris.jpg","video":"https://www.foxnews.com/video/6376345857112","publish_date":"2025-07-31 17:36:28","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.024},{"id":347024574,"title":"Minnesota ax murderer who killed own family in 1988 gets early release under law supported by Gov Tim Walz","text":"A Minnesota man convicted of killing his parents and younger siblings with an ax when he was a teen in 1988 has been released early under a law that Gov. Tim Walz backed. David Brom, now 53, had been assigned to work release as of July 29, according to online records from the Minnesota Department of Corrections. Brom was 16 years old when he killed his mother Paulette, his father Bernard, his younger sister Diane and younger brother Richard at their home in Rochester, Minnesota. Investigators found all four victims suffered multiple gash wounds to their heads and upper bodies from an ax. Brom pleaded not guilty due to mental illness, but a jury found him guilty of the murders. He was sentenced to three consecutive life sentences and one concurrent life sentence. He would have been eligible for parole after 52 years in 2037. PROSECUTORS WANT IDAHO KILLER BARRED FROM CONTACTING VICTIMS' FAMILIES FOR NEARLY A CENTURY Brom, however, became eligible for parole after a new Minnesota law went into effect, ending life sentences for offenders convicted as children. Walz, who failed in his bid for the White House as former Vice President Kamala Harris’ running mate, signed the legislation into law in 2023. The legislation applies retroactively, allowing most individuals already serving sentences to appear before a Supervised Release Board after serving 15, 20, or 30 years, depending on the severity and nature of the original sentence. CA BILL WOULD ALLOW INMATES SENTENCED TO LIFE WITHOUT PAROLE TO SEEK EARLY RELEASE IF CRIME WAS BEFORE AGE 26 Brom became retroactively eligible for release as of 2018. In January, Supervised Release Board members voted 5-1 on a plan that would allow Brom a work release, FOX9 Minneapolis reported. Brom will be transferred to a Twin Cities halfway house and remain under supervision and GPS monitoring, a department of corrections spokesperson told the outlet. CLICK HERE TO GET THE FOX NEWS APP The Supervised Release Board will review Brom’s case again in January.","summary":"A Minnesota man who murdered four family members, including his parents and younger siblings in Rochester in 1988, was granted early work release after serving 36 years in prison.","url":"https://www.foxnews.com/us/minnesota-ax-murderer-who-killed-own-family-1988-gets-early-release-under-law-supported-gov-tim-walz","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/david-brom-display.jpg","video":"https://www.foxnews.com/video/6360664094112","publish_date":"2025-07-31 17:23:13","author":"Stephen Sorace","authors":["Stephen Sorace"],"language":"en","source_country":"us","sentiment":-0.386},{"id":347041088,"title":"IMMIGRATION HOLD-OVER: Biden Political Appointee Still Holds Prominent DHS Position Under Trump","text":"President Donald Trump has cracked down on illegal immigration and reversed President Joe Biden’s immigration policies, but at least one of Biden’s political appointees in the Department of Homeland Security has kept his prominent DHS job under Trump.\n\nJeff Rezmovic, who currently serves as deputy assistant commissioner at the Board of Trade in Customs and Border Protection, has worked at DHS as an ostensibly nonpolitical career employee since 2011. Yet Biden appointed him to a top leadership role at DHS in July 2023. When Rezmovic failed to gain confirmation in the Senate, Biden withdrew the nomination—but not before Homeland Security Secretary Alejandro Mayorkas had weighed in.\n\nWhile presidents appoint more than 3,000 people for political positions, the federal government directly employs roughly 2.3 million people, most of whom serve in purportedly nonpolitical, career positions. While the Office of Management and Budget tracks when political appointees transition to career positions—a process often referred to as “burrowing in” to the bureaucracy—Rezmovic never left his career position because Biden withdrew the nomination.\n\nEven so, Rezmovic fits the broader trend of Biden appointees remaining in the bureaucracy under Trump. \n\nKen Cuccinelli, former acting deputy secretary of Homeland Security in Trump’s first term, raised concerns about Rezmovic.\n\n“Jeff Rezmovic’s history is extraordinarily political for a career employee in DHS,” Cuccinelli told The Daily Signal in a statement Thursday. “He would not have been continuously moved to and through the extremely sensitive policy implementation positions of the last four years if he wasn’t doing the political work of Biden/Mayorkas, ultimately being formally nominated for a political appointment.”\n\n“It is one thing for him to stay as a federal employee, but it is another matter entirely to employ him in any policy position or position of discretion or advice in a Trump administration,” Cuccinelli added (emphasis original). “The history of of deep state career employees working to undermine President Trump is simply too clear to walk into such a problem when it is avoidable.”\n\nWho Is Jeff Rezmovic?\n\nAs recently as June 27, CBP’s Office of Trade announced that Rezmovic, deputy executive assistant commissioner, spoke at an annual trade conference that week. \n\nAccording to his DHS profile, Rezmovic graduated from the University of Michigan and received his law degree from the University of Colorado. He served as a speechwriter at the Federal Emergency Management Agency in 2010 and first joined DHS in 2011, working in the office of the deputy secretary. \n\nRezmovic also served as chief of staff of the DHS Blue Campaign, “where he shaped and implemented the department’s anti-human trafficking priorities” through a public awareness campaign and policy solutions to support survivors. He served as branch chief at U.S. Citizenship and Immigration Services from 2018 to 2020. \n\nIn the Biden administration, he served as deputy chief of staff for policy, supporting Mayorkas in “overseeing the daily operations of the department’s 260,000 personnel and $98 billion budget.” He rose to the role of associate deputy under secretary for management, overseeing “the department’s mission support functions, including human capital, security, procurement, information technology, and more.”\n\nDuring his Nov. 2, 2023, confirmation hearing, Rezmovic mentioned that his mother worked for the Government Accountability Office and that his wife worked at the U.S. Agency for International Development, an agency Trump has effectively dissolved.\n\nIf confirmed, Rezmovic said he would focus on modernizing DHS’s financial systems, which he described as only 40% modernized. He said he would work to make the $8 billion information technology budget more efficient.\n\nMayorkas, who faced heavy criticism for reportedly failing to enforce immigration law in detaining and deporting illegal aliens, praised Rezmovic’s nomination in a lengthy statement.\n\nHe described Rezmovic as “a brilliant, selfless, and tireless advocate for our department and its mission, and for the people who carry it forward.”\n\nAmong other things, Mayorkas praised Rezmovic for leading the Surge Capacity Force, which mobilizes volunteers to help after natural disasters; for expanding the Nonprofit Security Grant Program from $180 million to $305 million; and for helping to create the Family Reunification Task Force, which Mayorkas credited with reunifying more than 700 separated children from their parents.\n\nThe House of Representatives voted to impeach Mayorkas in February 2024 on a largely party-line vote. The Senate rejected the articles of impeachment two months later. Republicans accused Mayorkas of “willful and systemic refusal to comply with the law” by allowing millions of illegal aliens to enter the country and settle in it. \n\nCritics also attacked many of the programs Rezmovic helped lead.\n\nSen. Ted Cruz, R-Texas, raised concerns that DHS was using its “temporary parole authority” through the Family Reunification Task Force to allow family members to enter and remain in the U.S. illegally in order to reunite with separated minors. This may have violated U.S. law, since those who enter the U.S. illegally are generally “barred from re-entry to the U.S. for a period ranging anywhere from 5 up to 20 years,” Cruz said.\n\nA Middle East Forum study found that from 2013 to 2024 DHS awarded $25 million in grants, part of them through the Nonprofit Security Grant Program, to groups tied to terrorists. FEMA has paused the program, triggering an outcry from Democrats and some Republicans.\n\nDeep State Opposition\n\nAn April poll found that 75% of Washington, D.C.-based federal employees making $75,000 or more per year who voted for Democrat presidential nominee Kamala Harris in November said they would not follow a lawful Trump order if they considered it bad policy.\n\nWhile some political appointees who took “career” positions may faithfully work for the U.S. government under any president, this poll suggests that some staff inside the federal government may work against the goals of the current president, in this case Trump.\n\nFurthermore, a February Foundation for Government Accountability study found that Democrat employees outnumber Republican employees by a 2-to-1 margin across federal agencies. In the 2024 presidential election, 84% of the money federal employees gave in political contributions went to Harris.\n\nFederal workers enjoy workplace protections that make them very difficult to fire. The new administration is seeking to reform these rules to enable the president to fulfill his duties as head of the executive branch without facing opposition from hostile bureaucrats.\n\nThe Daily Signal reached out to the Department of Homeland Security, Customs and Border Patrol, and FEMA for comment.\n\nThis is the latest in a series on bureaucrats burrowing in. Part one covers eight appointees. Part two focuses on a former Russiagate adviser who works at the Federal Aviation Administration. Parts three and five expose a former lawyer for then-Sen. Kamala Harris who advised Harris during the confirmation hearings for Supreme Court nominee Brett Kavanaugh and who now works at the Defense Department. \n\nPart four focuses on a former Biden campaign lawyer who now works at the Justice Department. Part six highlights a former member of the Nuclear Regulatory Commission who failed to get reconfirmed, “burrowed in” at the Department of Energy, and took the buyout. Part seven draws attention to a lawyer who worked with former Attorney General Eric Holder and who now works in the Trump DOJ.","summary":"President Donald Trump has cracked down on illegal immigration and reversed President Joe Biden&#8217;s immigration policies, but at least one of Biden&#8217;s political appointees in... Read More\n\n\nThe post IMMIGRATION HOLD-OVER: Biden Political Appointee Still Holds Prominent DHS Position Under Trump appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/31/jeff-rezmovic-immigration-hold-over-biden-political-appointee-still-holds-prominent-dhs-position-under-trump/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/Alejandro-Mayorkas.jpg","video":null,"publish_date":"2025-07-31 17:20:00","author":"Tyler O,Tyler O'Neil","authors":["Tyler O","Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":-0.133},{"id":347025964,"title":"VICTOR DAVIS HANSON: The Cincinnati Cop-Outs","text":"Recently, a large group of black youths began pummeling several white adults in downtown Cincinnati.\n\nThe original altercation apparently broke out between a black and white male in he-said/he-said fashion. But that dispute soon turned into a virtual free-for-all.\n\nNumerous male and female black youths sucker-punched a middle-aged woman and a man. Others continued to kick or body slam the victims, who were sprawled on their backs and seemingly unconscious.\n\nThere were many disturbing aspects to the beat-downs. (RELATED: Unruly Cincinnati Mob Mercilessly Beats Man Bloody, Knocks Woman Out) \n\nOne, the violence broke out along racial and age fault lines. After the initial one-on-one dispute, groups of black youths swarmed solitary older white bystanders to pound them.\n\nTwo, the surrounding assembled group of black youths not only failed to intervene to restrain the bullies. They also recorded the beatings for social media and were heard cheering on the one-sided violence.\n\nThree, there was neither a police presence nor any timely Good Samaritan interventions.\n\nInstead, what ended the attacks was simply the fact that at least two of the targets appeared nearly comatose. So their assailants apparently concluded that their agenda of beating whites into unconsciousness was mostly complete.\n\nFour, oddly few of the usual black spokespeople who habitually comment on interracial violence were to be seen.\n\nDuring the fake Jussie Smollett attack, self-appointed leaders from Al Sharpton to Kamala Harris immediately issued warnings about so-called systemic white racism that had reared its ugly head to victimize Smollett.\n\nYet when it was revealed Smollett had concocted the entire charade — and even hired his own assaulters — there were few if any retractions from those once so eager to shout “racist!”\n\nSuch demagoguery is a well-known pattern dating back to the days of the Tawana Brawley rape hoax, the Duke Lacrosse charade, the Covington kids ruse, the Michael Brown “Hands-up-Don’t Shoot” fabrication, the “pseudo-transformation of George Zimmerman into a ‘white Hispanic,'” or the NASCAR noose fable.\n\nRacialists too often concoct white racist attackers and go silent when the evidence proves fabricated — only to be primed to manipulate the next hoax.\n\nFive, the media and authorities did their best to either hide or play down the violence.\n\nCity leaders, the chief of police, and the media variously blamed the mass black-on-white violence on 1) social media, 2) the original one-on-one dispute, 3) alcohol, 4) the lack of civilian intervention to stop the violence, and 5) a festival atmosphere — anything except endemic racial hatred shown toward whites from the crowd of black youths.\n\nSix, had a gang of white toughs beat middle-aged African Americans senseless, recorded it, and cheered on the violence, there would have been immediate national outrage. (RELATED: Five Charged In Connection To Savage Cincinnati Streetfight) \n\nNor did anyone wish to raise the taboo topic of inordinate black crime rates, disproportionate to respective demographic realities. In rare interracial violent crimes, the asymmetrical ratio of black-on-white versus white-on-black assaults ranges from three to five times greater.\n\nSeven, the quiet of the left-wing media to the reprehensible violence stands in marked contrast with their usual rush-to-judgment racialism in two near-simultaneous incidents.\n\nWhen a shooter of mixed African-American heritage recently entered a New York City corporate headquarters and executed four innocents, CNN falsely raised the speculation that a “white male” was perhaps responsible — despite the photograph of the suspect, who was as clearly male as he was not white.\n\nMedia and municipal officials jumped to explain the violence as due to the killer’s alleged past traumatic brain injury or because of his access to a semi-automatic weapon — or anything other than his hate-filled plan to murder an NFL executive.\n\nActress and model Sydney Sweeney just cut a jeans commercial in front of a poster that said, “Sydney Sweeney has great genes” — with “genes” crossed out and replaced with “jeans.” The left then exploded, alleging the ad was a supposed Hitlerian reference to white eugenics.\n\nYet the eugenics movement in America was mostly a product of left-wing progressives, from Planned Parenthood founder Margaret Sanger to Democrat president Woodrow Wilson.\n\nAnd the ad’s sponsor, American Eagle, had previously used all sorts of models from all racial backgrounds. All might agree that the ad simply shows both tight, sexy jeans and a naturally attractive wearer — period.\n\nThe country is descending into a tribal morass of double standards and racial fixations.\n\nThe diversity/equity/inclusion industry, the defund-the-police madness, and the perpetual left-wing hunt for “white racism/white privilege/white rage” — from the prior Pentagon hierarchy to the lunatic fringe of Jasmine Crockett, Joy Reid, and Zohran Mamdani — have all legitimized double standards while lowering the bar of the once unacceptable.\n\nWhen our careerist left-wing elites seek to divide us by race and make it essential, not incidental, to our identities, that tribalist message filters throughout communities.\n\nThe ensuing signal is that “payback” violence is OK — on the expectation that there are no consequences for interracial violence — as long as the victim is white and the assaulter is not.\n\nVictor Davis Hanson is a distinguished fellow of the Center for American Greatness. He is a classicist and historian at the Hoover Institution, Stanford University, and the author of “The Second World Wars: How the First Global Conflict Was Fought and Won,” from Basic Books. You can reach him by e-mailing authorvdh@gmail.com.","summary":"'There were many disturbing aspects to the beat-downs'","url":"https://dailycaller.com/2025/07/31/cincinnati-mob-violence-white-victims-black-assailants-cops-victor-davis-hanson/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/GettyImages-2208919108-scaled-e1753981970323.jpg","video":null,"publish_date":"2025-07-31 17:19:59","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"US","sentiment":-0.257},{"id":347026438,"title":"Kamala Harris announces new memoir 107 Days that details ‘drama’ of White House run","text":"Harris, who ended speculation Wednesday about a possible 2026 California gubernatorial bid, announced the book in a video posted on social media.\n\n“Just over a year ago, I launched my campaign for president of the United States,” Harris said. “One hundred seven days traveling the country, fighting for our future — the shortest presidential campaign in modern history. Since leaving office, I’ve spent a lot of time reflecting on those days, and with candor and reflection, I’ve written a behind-the-scenes account of that journey. I believe there’s value in sharing what I saw, what I learned, and what it will take to move forward.”\n\nPublisher Simon & Schuster declined to offer any specifics to the Washington Examiner on what is in Harris’s 320-page book or the advance she received for writing it. Instead, CEO Jonathan Karp said the book “captures the drama of running for president better than just about anything I’ve read.”\n\nKarp added in a statement that it was “one of the best works of political nonfiction” Simon & Schuster has ever published.\n\n“It’s an eyewitness contribution to history and an extraordinary story,” he said.\n\nHarris became the Democratic Party’s presidential nominee after Biden dropped out following a disastrous debate performance against President Donald Trump and a pressure campaign from senior Democrats to step aside.\n\nAlthough Harris’s campaign debuted to a wave of enthusiasm, she lost to Trump after blowing through $1.5 billion in 15 weeks. The campaign dished out large sums of money on advertising, social media influencers, staff, celebrity concerts, drone shows, and a town hall featuring Oprah Winfrey.\n\nFor all the time, money, and effort, Harris had very little to show for it. \n\nShe became the first Democratic presidential candidate to lose the national popular vote in two decades. She also lost to Trump in every battleground state.\n\nAfter her loss, there have been questions about how her messaging fell so short and about her campaign’s spending spree. Democrats have continued to defend her campaign, citing the difficulties that come with such a short run.\n\nSince the election, Harris has mostly stayed out of the public eye, skipping out on large political gatherings such as the California Democratic Party convention but emerging to attend the Met Gala in New York and a high school graduation in Compton, California. She also spoke at an Australian real estate conference.\n\nPublishing insiders told the Washington Examiner that Harris’s memoir could have netted her up to a $20 million advance. Former President Barack Obama and Michelle Obama inked a deal with Penguin Random House that was worth a reported $65 million advance in 2017. Former President Bill Clinton got a $15 million advance in 2001. One insider said the “real money” was in podcasts and movie rights tied to books.\n\nBiden announced a book of his own this month. He secured an advance of $10 million from Hachette Book Group for his presidential memoir.\n\nSimon & Schuster announced it had preemptively acquired world, audio, and first serial rights to Harris’s memoir. She has been working on the manuscript for “several months,” according to the company, and Karp edited it along with Dawn David, the publisher of 37 Ink.\n\nLONGTIME BIDEN AIDE MIKE DONILON APPEARS FOR HOUSE OVERSIGHT COMMITTEE AUTOPEN INQUIRY\n\nSimon & Schuster and its international companies in the United Kingdom, Canada, Australia, and India will simultaneously publish 107 Days in hardcover, ebook, and audio. Harris will narrate the audiobook.\n\nSeparately, Harris will be on The Late Show with Stephen Colbert on Thursday for her first post-election interview, and she is likely to promote her new book.","summary":"Former Vice President Kamala Harris announced Thursday that she will publish a memoir about her 2024 presidential bid, giving an inside look at the 3 1/2-month sprint for the White House after President Joe Biden dropped out of the race. The book, titled 107 Days, will be released on Sept. 23. Harris, who ended speculation Wednesday [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3487515/kamala-harris-memoir-107-days-white-house-run/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/kamala-harris-democrats-photo.webp","video":null,"publish_date":"2025-07-31 17:06:23","author":"Barnini Chakraborty","authors":["Barnini Chakraborty"],"language":"en","source_country":"US","sentiment":0.148},{"id":347025968,"title":"Scott Jennings Trolls Dems Over Kamala Harris","text":"Political commentator Scott Jennings jokingly called for Democrats to put former Vice President Kamala Harris forward as their party’s 2028 presidential candidate Wednesday on CNN. Jennings said it would be “the best for America” as other pundits laughed or shook their heads. The Daily Caller’s Natalie Sandoval breaks down the exchange and Harris’ book announcement for Media Madness. SUBSCRIBE to the Media Madness YouTube channel and please support our work by becoming a Daily Caller Patriot subscriber today.","summary":"Other pundits laughed or shook their heads","url":"https://dailycaller.com/2025/07/31/kamala-harris-scott-jennings-cnn-democrats-2028/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/07/Artboard-1-copy-2-2.jpg","video":null,"publish_date":"2025-07-31 16:56:01","author":"Media Madness","authors":["Media Madness"],"language":"en","source_country":"US","sentiment":0.312},{"id":347030506,"title":"Harris rules out run for California governor","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\nHarris rules out run for California governor\n\nThe 2024 Democratic presidential nominee ended months of speculation about her plans for the contest\n\nNewsletter sign up\n\nThis is the 'clearest sign yet' that Harris may 'still be considering a third run for president'\n\n(Image credit: Justin Sullivan / Getty Images)\n\nRafi Schwartz, The Week US \n\n31 July 2025\n\nWhat happened\nFormer Vice President Kamala Harris said Wednesday she will not enter the 2026 race to become California's next governor. The announcement ended months of speculation about the 2024 Democratic presidential nominee's plans for the contest while reigniting questions about her political future. \"I love this state, its people and its promise,\" Harris said in a statement, but \"for now, my leadership — and public service — will not be in elected office.\"\n\nWho said what\nHarris would have \"begun the race\" to succeed term-limited Gov. Gavin Newsom (D) as an \"imposing frontrunner,\" Politico said, and her announcement \"upends\" what had been a \"largely static\" contest. This is the \"clearest sign yet\" that Harris may \"still be considering a third run for president,\" said the Los Angeles Times.\n\nHarris had been \"exploring a run for the state's top office\" since returning to Los Angeles in January but \"had done little to express enthusiasm for the job,\" The New York Times said. And she only \"weighed in selectively\" as President Donald Trump's immigration raids and military deployments ushered in a \"summer of political turmoil in California.\"\n\nHarris is now \"exploring the prospects of forming new groups\" designed to \"keep her involved in politics and positioned to advocate for the ideas she championed during her 2024 campaign,\" according to The Washington Post.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nExplore More\n\nKamala Harris\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nRafi Schwartz, The Week US\n\nSocial Links Navigation\n\nRafi Schwartz has worked as a politics writer at The Week since 2022, where he covers elections, Congress and the White House. He was previously a contributing writer with Mic focusing largely on politics, a senior writer with Splinter News, a staff writer for Fusion's news lab, and the managing editor of Heeb Magazine, a Jewish life and culture publication. Rafi's work has appeared in Rolling Stone, GOOD and The Forward, among others. \n\n'Fossil-fired grids have provided a cautionary tale'\n\nInstant Opinion\nOpinion, comment and editorials of the day\n\nTrump sets new tariff rates as deadline nears\n\nNew tariff rates for South Korea, Brazil and India announced\n\nJuly 31 editorial cartoons\n\nThursday’s political cartoons include the truth that's out there, and a comedy special about billionaires\n\nYou might also like\n\nTrump sets new tariff rates as deadline nears\n\nNew tariff rates for South Korea, Brazil and India announced\n\nSenate confirms Trump loyalist Bove to top court\n\nThe president's former criminal defense lawyer was narrowly approved to earn a lifetime seat\n\nGhislaine Maxwell offers testimony for immunity\n\nThe convicted sex trafficker offered to testify to Congress about her relationship with late boyfriend Jeffrey Epstein\n\nJudge halts GOP defunding of Planned Parenthood\n\nThe Trump administration can't withhold Medicaid funds from Planned Parenthood, said the ruling\n\nTrump contradicts Israel, says 'starvation' in Gaza\n\nThe president suggests Israel could be doing more to alleviate the suffering of Palestinians\n\nTrump executive order targets homeless\n\nIt will now be easier for states and cities to remove homeless people from the streets\n\nColumbia pays $200M to settle with White House\n\nThe Trump administration accused the school of failing to protect its Jewish students amid pro-Palestinian protests\n\nFlorida judge and DOJ make Epstein trouble for Trump\n\nThe Trump administration's request to release grand jury transcripts from the Epstein investigation was denied\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"The 2024 Democratic presidential nominee ended months of speculation about her plans for the contest","url":"https://theweek.com/politics/kamala-harris-wont-run-for-california-governor","image":"https://cdn.mos.cms.futurecdn.net/nbKyhesQCbGCXZMVenzRjf.jpg","video":null,"publish_date":"2025-07-31 16:44:06","author":"Rafi Schwartz","authors":["Rafi Schwartz"],"language":"en","category":"politics","source_country":"US","sentiment":0.427},{"id":347085010,"title":"Exclusive -- James Braid: Thirteen House Democrats in Trump Districts Give Republicans 'Great Opportunity to Defy History' in Midterms","text":"White House Legislative Affairs Director James Braid revealed why Republicans can hold Congress in the midterm elections, defying historical trends in which the party holding the White House suffers electoral losses.\n\nBraid, in a discussion Wednesday with Sen. Jim Banks (R-IN), Breitbart News’s Washington Bureau Chief Matt Boyle, and Finance and Economics Editor John Carney, explained that Republicans can hold or even expand their slim House majority due to “a fairly favorable map with an unprecedented series of legislative achievements” along with President Donald Trump’s leadership.\n\nThe biggest opportunity for Republicans is in the 13 Democrat-held House districts won by Trump in 2024.\n\n“One point I’d make to that is the map is very favorable,” Braid explained to the panel. “So, you know, there are only three Republicans in the House in Kamala-won districts. There are 13 Democrats in Trump-won districts. You know, I don’t want to get too far into this. But obviously we’re seeing reporting that a number of different states have decided to pursue changes. And so, yeah, I mean, I think there’s a great opportunity to defy history.”\n\nThose 13 Democrats in Trump districts are Reps. Adam Gray (CA), Josh Harder (CA), Jared Golden (ME), Kristen McDonald Rivet (MI), Don Davis (NC), Nellie Pou (NJ), Gabe Vasquez (NM), Susie Lee (NV), Tom Suozzi (NY), Marcy Kaptur (OH), Henry Cuellar (TX), Vicente Gonzalez (TX), and Marie Gluesenkamp Perez (WA).\n\nThe only Republicans in the district won by Kamala Harris are Reps. Don Bacon (NE), who is retiring, Mike Lawler (NY), and Brian Fitzpatrick (PA).\n\nTrump’s successful unification of the Republican Party adds to those chances, Braid said.\n\n“I think that one of the things that the Republicans haven’t done [in the past], and the President has preached very, very directly, is unify,” he added. “Unity is sort of a constant message, of unity without the type of infighting that we saw in the first term between the leadership and the president. I think we have an even better chance. So, yeah, I do think that the party is well set up to defy history, both because of its achievements, because of the map and because of the leadership it has in President Trump.”\n\nThe One, Big Beautiful Bill Act is the legislative vehicle for Republicans to run upon. Voters will see the benefits long before they go to the polls in November 2026.\n\n“The bill is retroactive [to] January 1, 2025, so not only was it passed by July 4, which was six months earlier than the tax cuts in 2017, it goes retroactive,” Braid explained. “So everyone who has tips, overtime, Social Security, obviously the rates, obviously the business provisions, they will feel it immediately when they’re filing their taxes in April, before the midterms. So, you’re looking at, and I mean, even in some of these blue states, where, candidly, the majority runs through, you’re going to see a huge reduction in their [state and local tax] SALT expenses.”\n\n“You look at that and say, people are going to receive thousands and thousands of dollars in their pocketbooks in April before they’re going to the polls,” Braid added. “That’s going to have a transformative impact on, I think, how the midterms go, because the Republican Party will have delivered material increases in prosperity for Americans, and that typically is rewarded at the polls.”\n\nThe panel followed a discussion between Secretary of the Treasury Scott Bessent and Boyle.\n\nBradley Jaye is Deputy Political Editor for Breitbart News. Follow him on X/Twitter and Instagram @BradleyAJaye.","summary":"White House Legislative Affairs Director James Braid revealed why Republicans can hold Congress in the midterm elections, defying historical trends in which the party holding the White House suffers electoral losses.\n\n\nThe post Exclusive &#8212; James Braid: Thirteen House Democrats in Trump Districts Give Republicans &#8216;Great Opportunity to Defy History&#8217; in Midterms appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/07/31/exclusive-white-houses-james-braid-thirteen-house-democrats-in-trump-districts-give-republicans-great-opportunity-to-defy-history-in-midterms/","image":"https://media.breitbart.com/media/2025/07/james-braid-bessent-event-640x335.jpg","video":null,"publish_date":"2025-07-31 16:36:51","author":"Bradley Jaye","authors":["Bradley Jaye"],"language":"en","category":"politics","source_country":"US","sentiment":0.164}]}