{"offset":0,"number":50,"available":388,"news":[{"id":366003788,"title":"Taylor Swift fans are convinced that singer's song 'CANCELLED!' is about Chiefs WAG bestie Brittany Mahomes","text":"Taylor Swift fans are convinced her new song 'CANCELLED!' is about Chiefs bestie Brittany Mahomes following the latter's Donald Trump controversy over the summer.\n\nThe wife of Kansas City quarterback Patrick has struck up a close friendship with Swift since she began dating (and ultimately got engaged to) fellow Chiefs star Travis Kelce.\n\nAnd listeners of the pop star's new album, 'The Life of a Showgirl', believe one track in particular is about Brittany.\n\nIn the song 'CANCELLED!', Swift sings: 'Good thing I like my friends cancelled // I like them cloaked in Gucci and scandal.'\n\nSwift also says in the song: But one single drop, you're off the roster // Tone-deaf and hot, let's f***in' off her'\n\nThe lyrics come months after her friend Brittany came under fire for liking a social media post from Trump, who was then running for his second presidential term.\n\nWhile it was unclear what Brittany was specifically agreeing with, as Trump's Instagram post outlined a slew of different GOP platforms, she faced tons of backlash afterwards.\n\nBrittany later doubled down on her approval of Trump's Instagram post by retweeting another post from preacher and author Shane Pruitt.\n\n'Contrary to the tone of the world today…' the post began. 'You can disagree with someone, and still love them. You can have differing views, and still be kind.'\n\nShe later hit back at her critics on her Instagram story, writing: 'I mean honestly, to be a hater as an adult you have to have some deep rooted issues you refuse to heal from childhood,'\n\nAs for the Gucci part of Swift's lyrics, Mahomes was spotted wearing Gucci dresses at both the US Open and Wimbledon last year.\n\nAnd she was with Swift, Kelce and her husband Patrick at the New York-based tournament as the tight end also appeared to wear Gucci as well. \n\nIn the Track by Track version of the album on Amazon Music, Swift explains what 'CANCELLED!' is about - without mentioning any of her friends by name. \n\n'The song 'CANCELLED!' is sort of about, you know, having had my own experiences with mass judgment and being at the center of many, you know, dramatic kind of scandalous moments in my career where people were all weighing in at once, or at least it felt like that,' she said.\n\n'Having had those experiences, it makes me move through the world a little bit differently. And when other people go through it, you kind of find yourself thinking about how they're probably going to get smarter because of this. If they can get through it, if they can be tough enough, they can actually learn some things through this process.' \n\n'And how I don't naturally just cast people aside just because other people decide they don't like them. I make my own decisions about people based on how they treat me within my life and their actions. And so this is a song about all those themes.'\n\nOther fans, meanwhile believe the song is about Blake Lively amid her legal battle with Justin Baldoni.\n\nRegardless, Brittany and Swift have seemingly remained friends despite their apparent political differences.\n\nSwift, who endorsed Kamala Harris ahead of the last presidential election, was seen with Brittany during her 30th birthday last month in Nashville.\n\nThe 14-time Grammy Award winner was front and center as Brittany celebrated another year around the sun with a girls trip to Tennessee.\n\nIn one photo, Swift and Brittany posed together as they enjoyed some celebratory cocktails.\n\nSwift could be leaning her head on Brittany's shoulder in the sweet moment as they wore matching black outfits.\n\nThey will cheer on the Chiefs partners this weekend as they seek their third win of the season against the Jaguars.","summary":"Taylor Swift fans are convinced her new song 'CANCELLED!' is about Chiefs bestie Brittany Mahomes following the latter's Donald Trump controversy over the summer.","url":"https://www.dailymail.co.uk/sport/nfl/article-15161033/taylor-swift-brittany-mahomes-cancelled.html","image":"https://i.dailymail.co.uk/1s/2025/10/04/00/101262407-0-image-m-16_1759535923701.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/10/03/7778625724997780638/1024x576_MP4_7778625724997780638.mp4","publish_date":"2025-10-04 00:08:53","author":"Editor,Jake Nisse","authors":["Editor","Jake Nisse"],"language":"en","source_country":"gb","sentiment":0.258},{"id":365983968,"title":"Donald Trump&#039;s Approval Surges to New High With Black Voters—Poll","text":"President Donald Trump’s approval rating among Black voters surged to a new high in a new survey—but the poll appears to be an outlier, as other polls show his approval with the historically Democratic group remains low.\n\nWhy It Matters\n\nTrump made notable gains among Latino and Asian voters—two groups that have backed Democrats by large margins in the past—but former Vice President Kamala Harris mostly held onto support from Black voters, the most Democratic-leaning demographic in the country.\n\nA new poll touted by Trump shows him with a positive approval rating among Black voters, though other recent surveys suggest that may be an outlier. Trump’s approval rating will have key implications for the New Jersey and Virginia gubernatorial races this year, where Democrats have sought to tie Republican candidates to Trump as his approval has dwindled, as well as the 2026 midterms.\n\nWhat to Know\n\nThe latest poll from AtlasIntel found that 54 percent of Black voters approve of Trump, while 46 percent disapprove of the president’s job performance thus far. Across all racial groups, 52 percent of voters disapproved of his performance, while 47 percent approved of him, according to the poll.\n\nThe poll surveyed 1,066 Americans from September 12 to September 16, 2025, and had a margin of error of plus or minus 3 percentage points. Of those respondents, about 10.6 percent identified as Black.\n\nPresident Donald Trump attends an executive order signing event in the White House in Washington, D.C. on September 5, 2025.\n\nPolling crosstabs often have relatively small sample sizes, in this case, about 113 respondents, which can at times produce results that are not replicated in other surveys.\n\nThe poll would mark a significant shift in Trump’s support among Black voters from past AtlasIntel surveys. The pollster found in July that just 14 percent of Black voters approved of Trump, and in May reported that 28 percent of Black voters approved of his job performance.\n\nNewsweek reached out to AtlasIntel for comment via its contact form.\n\nOther independent pollsters have similarly shown his support among Black voters remains low.\n\nA YouGov poll, which surveyed 1,656 adults from September 26 to September 29, found that 12 percent of Black Americans approve of his job performance while 86 percent disapprove. Meanwhile, a New York Times/Siena College poll, which surveyed 1,313 registered voters from September 22 to September 27, 2025, found that 10 percent of Black voters approve of Trump.\n\nA survey from NPR, PBS and Marist Poll showed similar results—it found that 19 percent of Black voters approve of Trump. It surveyed 1,477 adults from September 22 to September 26.\n\nIn 2024, Black voters backed Harris by a 73-point margin (86 percent to 13 percent), a slightly smaller margin than that of former President Joe Biden in 2020, when he won Black voters by 75 points (87 percent to 12 percent), according to CNN’s exit polling.\n\nWhat People Are Saying\n\nPresident Trump wrote on Truth Social: “WOW!!! Such an! honor. Record ‘stuff’ for a Republican. President DJT.”\n\nJournalist Corey Walker wrote to X: “So his approval is dropping nationally and rising with black voters? Seems deeply unlikely.”\n\nX user Armand Domalewski wrote to X: “i am skeptical.”\n\nSteve Bannon wrote on Gettr: “Record Approval from Black Voters.”\n\nWhat Happens Next\n\nTrump’s approval rating will continue to be monitored as a key metric of his popularity ahead of critical elections later this year. If his approval remains low, it could present a challenge for Republican candidates. However, if it increases, that would be viewed as a boon for the GOP.","summary":"A new poll from AtlasIntel found Trump&#039;s approval with Black voters rise, but other recent polls suggest that may be an outlier.","url":"https://www.newsweek.com/donald-trumps-approval-surges-to-new-high-with-black-voters-poll-10827685","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/GettyImages-2233918556-1.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-03 21:21:12","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.392},{"id":365994610,"title":"Charlie Kirk Did the Unimaginable. He Turned the Youth Against the Liberal Establishment.","text":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see more of his videos.\n\nHello, this is Victor Davis Hanson for The Daily Signal. After that quite amazing and moving memorial for Charlie Kirk, there’s been a lot written about him, his legacy, his achievements\n\n We all were quite enthralled by his efforts as probably the most successful political organizer of any party under the age of 40 with Turning Point USA. It’s now up to, I think, requests for 75,000 new chapters. He was a columnist. He was a successful podcaster. He did it all.\n\nBut one thing, I think, that hasn’t been remarked about—what was the essence of his appeal to young voters? Why was he able to reverse the turnout in 2020 of young voters? Getting more of them out and getting somewhere from 6% to 20% more of the youth vote in particular states.\n\nAnd he may have got as many votes for President Donald Trump of those in the more narrow category, 18 to 29, than voted for former Vice President Kamala Harris. Even the 18 to 39 was almost 50/50 in Michigan. So, in some ways, he might have won the election for Donald Trump.\n\nSo, what was the secret to his success? I think what he did was quite brilliant. He understood that young people are, by nature, rebellious. You’re full of energy. They’re full of hormones. They’re full of ideas. They haven’t lived a long time. And they question authority. That’s innate to all of us at that age.\n\nBut what he was trying to tell them was: Use that natural inquisitiveness, skepticism, maybe even rebelliousness, at the establishment. But you’re mistaken. The establishment is not conservative. The establishment, as defined by the network news, PBS, NPR; as defined by higher education, Harvard, Yale, Princeton, Berkeley, Stanford; as defined by the corporate boardroom at Budweiser or Target, or Disney; as defined by the popular culture, if you look—I could just direct you to the halftime show at the typical Super Bowl extravaganza. We could go on, but you get the message.\n\nSo what Charlie Kirk was telling young people is, you are living in a society in which the baby boomers of the 1960s and ’70s, are now the establishment. And they are ossified. They are calcified. They have no new ideas. They still are trapped in amber of a sort of revolutionary idea of the ’60s and ’70s—DEI, critical race theory, critical legal theory, radical green environmentalism, open borders.\n\nThe result of all this is that you, the youth of America, are told not to do what history says will make you happy: to get married, to have more than two children, or at least two children, to buy a home, to be active in your community, to be patriotic, to be traditionalist. These are things that are not establishment, Kirk was telling young people on campus. These are counterrevolutionaries. You are revolutionaries.\n\nSo, what he asked young people to do is to, say, rebel. But remember what you’re rebelling against. It’s not some conservative, 1950s stereotype of an uptight America. America is not uptight. It has no rules. It’s completely without order. It’s in utter chaos. Whether we look at transgenderism or DEI, or an open border, or our legal system, it is a mess. And you’ve suffered.\n\nSo, you are going to be revolutionaries. But the trick is you’re not going to try to destroy the old order. You’re gonna try to restore it. The old order is what was normality and common sense. What you grew up under is an aberration. So, as good counterrevolutionaries, tie your youthful zeal to formal efforts to overthrow this dominant paradigm that has made your life, in some ways, miserable.\n\nSo, we look back at his career, Charlie Kirk came up with the idea that he was going to go throughout higher education, indeed, youthful America in general, and encourage that natural skepticism. And not to say, “Please don’t question authority. Please be stayed. Please be true.” He was trying to say, “Be a counterrevolutionary because the establishment is not you or me. It’s radical. And it needs to be changed.”\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\n\n\nThe post Charlie Kirk Did the Unimaginable. He Turned the Youth Against the Liberal Establishment. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/10/03/charlie-kirk-did-the-unimaginable-he-turned-the-youth-against-the-liberal-establishment/","image":"https://www.dailysignal.com/wp-content/uploads/2025/10/GettyImages-2167287986.jpg","video":null,"publish_date":"2025-10-03 21:12:30","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":0.231},{"id":365990154,"title":"Diddy Is Sentenced To 50 Months. Can He Still Make A Commercial Comeback? History Says Yes. Here’s How.","text":"LONDON, ENGLAND - NOVEMBER 07: Diddy performs at O2 Shepherd's Bush Empire in a special one night only event at O2 Shepherd's Bush Empire on November 07, 2023 in London, England. (Photo by Samir Hussein/Getty Images for Sean Diddy Combs)\nGetty Images for Sean Diddy Combs\n\nNow that Sean “P. Diddy” Combs’ sentencing has come in at 50 months (4 years and 2 months) in prison after his conviction on Mann Act-related charges, the next question is: can one of the world's most well-known personalities stage a comeback after his time is served? The short answer is yes — but it won’t be easy. If recent history is any barometer, high-profile figures who’ve faced legal peril have been able to come back and be reborn, albeit with a rebuilt or reshaped reputation.\n\nLet's take a look at how others in the spotlight have managed to bounce back, what strategies they used, and how a path to redemption may look in Diddy’s case.\n\n4 Obstacles To Comeback\n\nBefore plotting a comeback, it’s essential to understand the four key challenges of recapturing the public's ear, attention span, and sentiment:\n\nStigma & brand risk. A criminal conviction involving sexual misconduct and coercion carries heavy reputational damage. Off the top, this will eliminate some partners, sponsors, and media platforms from turning away from association with Diddy.\n\nLegal constraints. Based on Diddy's sentence, beyond his time behind bars, he also has parole limitations on where he can travel and be present for public engagement.\n\nFan and industry trust. Trust from allies is critical to rebuilding confidence with fans, and business partners. Sustained positive signals will be required to overcome.\n\nFinancial strain. Mo money, mo problems. Legal bills, court-ordered fines, and the lack of active income during incarceration can stress cash flow and access to capital.\n\nPARIS, FRANCE - JULY 21: Snoop Dogg tries on clothes during Team USA Welcome Experience ahead of Paris 2024 Summer Olympics at Polo Ralph Lauren on July 21, 2024 in Paris, France. (Photo by Joe Scarnici/Getty Images for USOPC)\nGetty Images for USOPC\n\nCase Studies: How Others Rebounded\n\nDiddy is not alone. There is a long history of notable people who have overcome the past only to catapluted into their second act. On the other hand, some haven't been so fortunate. Let’s take a look at a few individuals who have been able to rise to the top.\n\nSnoop Dogg: Steady & persistence through legal storms\n\nSnoop may be the comeback king of the music industry. Over decades, he has had multiple brushes with the law — drug possession, arrests, and even a murder trial. His recovery was slow, steady, and multifaceted. Where did it end up? How did he do it?\n\nMORE FOR YOU\n\nDiversifying public roles. Snoop didn't stay still or get pigeonholed into one area. He expanded his interests beyond music into media more broadly. Covering events on NBC as a broadcaster, coaching musicians on The Voice, and even serving as a commentator at major sporting events. Besides covering the 2024 Summer Olympic gameshe will be returning as a roving correspondent for the 2026 Milan–Cortina Winter Olympics coverage.\n\nLeveraging celebrity goodwill. Leaning into cultural relevance through social media is key. From first-person camera shots and storytelling to holding up products to sell endorsements, philanthropy, and a humanized public persona, he was able to define his career narrative.\n\nKeep creating prolific art. Having a music release calendar to stay in the public eye was crucial for reminding people of your talent and brand values. It also helps visualize your growth rather than disappearing.\n\nWEST PALM BEACH, FLORIDA - NOVEMBER 06: Republican presidential nominee, former U.S. President Donald Trump arrives to speak during an election night event at the Palm Beach Convention Center on November 06, 2024 in West Palm Beach, Florida. Americans cast their ballots today in the presidential race between Republican nominee former President Donald Trump and Vice President Kamala Harris, as well as multiple state elections that will determine the balance of power in Congress. (Photo by Chip Somodevilla/Getty Images)\nGetty Images\n\nDonald J. Trump: Turn legal fights into narrative fuel\n\nPresident Trump used a different model to overcome his past, and it earned him a second shot at the White House. How’d he do it? He uses legal fights as badges of honor and as a central part of his brand.\n\nAggressive media framing. President Trump was clear - frame the legal system as politicized or “rigged,” turning prosecutions into rallying cries. This helps keep a base invested in his personal narrative.\n\nDelay, appeal, and leverage publicity. Trump often leans into lengthy, drawn-out legal proceedings, appeals, and litigation, bringing the audience along with him as he fights publicly in the news and prolongs public attention.\n\nOvercoming legal battles is his brand DNA. His legal challenges become part of his political story, serving as proof of dissent that mobilized supporters rather than alienating them.\n\nAsset and corporate strategies. By shifting assets, using corporate structures, and negotiating financial remedies, President Trump was able to overturn or evade paying civil penalties.\n\nOther notable comebacks include Martha Stewart after her insider trading conviction and prison term; she made an intentionally restrained comeback, focusing on content, licensing, lifestyle branding, and building an audience through new opportunities after her legal troubles (even working with Snoop!) Also, Robert Downey Jr, who had issues with substance abuse and arrests, eventually reinvented himself through consistent and high-quality performances, most notably the Iron Man franchise, and regained his Hollywood support system.\n\nNEW YORK, NY - SEPTEMBER 20: Sean \"Diddy\" Combs attends TimesTalks Presents: An Evening with Sean \"Diddy\" Combs at The New School on September 20, 2017 in New York City. (Photo by Dia Dipasupil/Getty Images)\nGetty Images\n\nWhat Diddy’s Comeback Could Look Like\n\nThe through-line: comeback stories often blend accountability, continuous output, narrative control, and a pivot toward new domains or reinvention. Based on those templates here’s how Diddy could plot a path forward:\n\nA phased reemergence. Begin behind the scenes, then slowly step back into the spotlight.\n\nCollaborative choices may matter more than solo plays. Strategic alliances — with artists, platforms, institutions — may receive more immediate trust.\n\nUnderstand the shadow of conviction. As Diddy rebuilds, media narratives will reference the conviction, making full reintegration hard.\n\nA single misstep can derail recovery. In the era of social media and heightened scrutiny, any new controversy could reignite backlash far stronger than before.\n\nYes — Diddy can come back. However, unlike purely entrepreneurial or performance-based figures, his challenge is steeper: the nature of the wrongdoing carries moral weight, not just legal implications. His comeback, if it’s to succeed, will demand more than talent or influence — it will require a profound redefinition of public identity, sustained integrity, and a convincing narrative of transformation.\n\nSean \"P. Diddy\" Combs and Cassie Ventura attend the Metropolitan Museum Costume Institute Benefit celebrating the exhibition of \"Rei Kawakubo/Comme des Garcons-Art of the In Between\" at the Metropolitan Museum of Art in New York City. (Photo by Sonia Moskowitz/Getty Images)\nGetty Images\n\nEditorial StandardsReprints & Permissions","summary":"Sean “P. Diddy” Combs' sentencing has come in at 50 moths With that, can one of the world's most well-known personalities stage a comeback? Yes — but it won’t be easy.","url":"https://www.forbes.com/sites/dougmelville/2025/10/03/diddy-is-sentenced-to-50-months-can-he-still-make-a-commercial-comeback-history-says-yes-heres-how/","image":"https://imageio.forbes.com/specials-images/imageserve/68e02fd711938bbedf67326a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-10-03 20:54:38","author":"Contributor,Doug Melville,Samir Hussein","authors":["Contributor","Doug Melville","Samir Hussein"],"language":"en","source_country":"US","sentiment":0.098},{"id":365978178,"title":"Expect 'SNL' To Only Target Conservatives This Season | Bobby Burack","text":"The 51st season of Saturday Night Live premieres this Saturday with Bad Bunny as host. The show will almost certainly cold-open with a spoof of a top political story of the week. There are plenty of options, be it the government shutdown, the \"armed conflict\" with drug cartels, the ongoing Jimmy Kimmel saga, or Taylor Swift’s new album. Based on the past few years, the cold open will likely only mock one side of the aisle. A recent NewsBusters study found that 82 percent of Weekend Update jokes last season were aimed at conservatives, while 60 percent of cold-open characters were Republicans or conservatives. Other reviews showed SNL went after Trump seven times more often than Biden during his first term. Like most late-night comedy, SNL has become increasingly partisan and predictable. It is hesitant to mock liberals even when the material is obvious, which is a shame because both sides provide plenty of fodder. Imagine a bit mocking the media voices who defended the Biden administration for pressuring tech companies to censor ordinary Americans, while declaring Kimmel's suspension the act of a fascist government. That happened in real life. Imagine another spoof mocking the Democrats who cheered Roseanne Barr’s cancellation as \"accountability culture,\" suddenly railing against \"cancel culture\" during Kimmel’s absence. That also happened in real life. After all, sketch comedy works best when the reenactment resembles the real event. Of course, none of those suggestions are likely to make the rundown. Instead, expect spoofed appearances from the usual targets like Trump, JD Vance, and maybe Defense Secretary Pete Hegseth. What you won’t see are parodies of Jasmine Crockett or Ilhan Omar, both of whom are living caricatures of the bitter leftist ladies we have all come to regret knowing. A sketch about Kamala Harris admitting she passed on Pete Buttigieg as a running mate because he’s gay would write itself. Put simply, Harris is the only politician to openly admit she didn’t hire someone because of their sexual preferences. Then there’s Don Lemon, who recently declared white men the most dangerous creatures in America, despite black men accounting for 55 percent of murders in the U.S. while just 6 percent of the population. What about Keith Olbermann? OutKick recently investigated whether he is channeling a deranged, eccentric online persona for podcast downloads or if he is genuinely unwell. The conclusion: he is genuinely unwell. Still, a sketch of him ranting in his New York apartment, threatening strangers online while surrounded by rescue pets, could be amusing. The biggest question is whether the show touches on the assassination of Charlie Kirk. In principle, no story should be off-limits to sketch comedy. Comedy is supposed to be cringe, uncomfortable, and blunt. That’s why Dave Chappelle is recognized as the best of his generation. However, making light of a political assassination is difficult. The one rule of comedy is that it has to be funny, and it’s hard to imagine SNL’s progressive writers pulling that off. Jimmy Kimmel already failed when he falsely claimed Kirk’s suspected assassin was part of the \"MAGA gang,\" a lie he still hasn’t corrected. The right way to do it would be to mock the people who celebrated Kirk’s death, or the hosts who sympathized with the alleged killer because he had a trans partner. For the record, ABC’s Matt Gutman even described the alleged killer’s text exchanges with his lover—where he admitted to the murder—as \"touching.\" That alone is worthy of parody. What a ghoul. This all shows that there remains an opening for an alternative to SNL, a sketch comedy show that isn’t afraid to make fun of the protected classes that SNL avoids. The model already exists. Fox News’ Gutfeld! regularly beats the legacy late-night shows in ratings for exactly that reason. SNL made the decision to ignore half the country. It’s time for someone to capitalize on that. As Stacy Washington from SiriusXM says, some network should just hire me to write the thing. Just saying. Tomorrow’s cold open is going to be cringe, isn’t it?","summary":"Saturday Night Live returns for Season 51 with Bad Bunny hosting. Based on past seasons, expect the cold open to mock conservatives while ignoring obvious liberal targets.","url":"https://www.outkick.com/analysis/expect-snl-only-target-conservatives-season-bobby-burack","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/10/gettyimages-2209610052.jpg","video":null,"publish_date":"2025-10-03 20:45:34","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.126},{"id":365981140,"title":"Trump Is No Longer Denying Support for Project 2025: What to Know","text":"“I can’t believe the Radical Left Democrats gave me this unprecedented opportunity,” Trump wrote on Truth Social. “They are not stupid people, so maybe this is their way of wanting to, quietly and quickly, MAKE AMERICA GREAT AGAIN!”\n\nThe post marks a significant shift from the President’s past disavowals of the unpopular right-wing policy blueprint, which was created by conservative think tank the Heritage Foundation ahead of the 2024 election. “I have nothing to do with Project 2025. I haven’t read it. I don’t want to read it, purposely. I’m not going to read it,” Trump said in a debate last year with former Vice President Kamala Harris. \n\nDespite Trump’s repeated insistence that he didn’t know anything about Project 2025, however, he had close ties with a number of its authors, several of whom have served in his Administrations—including Vought. And since he returned to the White House in January his second Administration has taken steps to implement a number of the proposals detailed in the over 900-page document.","summary":"President Donald Trump has changed his tune on the conservative policy plan after actively distancing himself from it in the past.","url":"https://time.com/7323278/trump-project-2025-government-shutdown/","image":"https://api.time.com/wp-content/uploads/2025/10/GettyImages-1228828887_fdabf1.jpg?w=1200&h=675","video":null,"publish_date":"2025-10-03 20:44:00","author":"Connor Greene","authors":["Connor Greene"],"language":"en","category":"politics","source_country":"us","sentiment":-0.717},{"id":366009796,"title":"Federal energy funding cancellations hits two projects in New Hampshire","text":"A New Hampshire energy project is among more than 200 that were canceled across the country after an announcement by the U.S. Department of Energy late Wednesday.\n\nFederal officials said they determined the projects would not advance the nation’s energy needs and were not economically viable. The cancellations, originally announced in a tweet from a top White House official, amount to about $7.5 billion.\n\nBrayton Energy lost funding for a New Hampshire-based project as part of the cancellations, according to a spreadsheet provided by the Department of Energy to Sen. Jeanne Shaheen’s office and shared with NHPR.\n\nThe company was set to get nearly $5 million, according to a spreadsheet shared by Democrats on the House Appropriations Committee.\n\nBrayton Energy, based in Hampton, is a research and development firm focused on sustainable energy. They have received several federal awards, including for the development of nuclear power technology, fuel cells, and compressed air energy storage.\n\nBrayton Energy did not immediately respond to requests for comment.\n\nThe document shared with NHPR said that a second project in New Hampshire, run by New York-based company Ubiquity Solar, had also lost funding. Ubiquity Solar said in a statement on Friday that the listing of their project as based in New Hampshire was an error on the part of federal officials. The project is based in New York and Missouri.\n\nWhen asked for clarification, the U.S. Department of Energy shared a spreadsheet of canceled projects that included Ubiquity Solar but did not specify the states where projects were based.\n\nIn a statement, Sen. Shaheen said the cancellations were part of “destructive partisan tactics” by Trump and his budget director, Russell Vought.\n\n“Let’s not mince words: Russ Vought is now politically targeting states in an effort to pressure Congress without regard for the collateral damage to the American people,” she said. “Instead of more destructive partisan tactics, the White House needs to rein in Russ Vought and sit down with Democrats in Congress who are ready to work in good faith to re-open our government and protect health care for tens of millions of Americans.”\n\nEvery state with projects that lost funding voted for Democrat Kamala Harris in the 2024 election. New Hampshire and Vermont were the only states included in the cancellations with Republican governors.","summary":"A New Hampshire energy project is among more than 200 that were canceled across the country after an announcement by the U.S. Department of Energy late Wednesday.","url":"https://www.keenesentinel.com/state_news/federal-energy-funding-cancellations-hits-two-projects-in-new-hampshire/article_f1beb969-8f40-42bf-a139-a444bb8189fb.html","image":"https://bloximages.chicago2.vip.townnews.com/keenesentinel.com/content/tncms/custom/image/6260defe-c779-11ef-bd8a-c733c01e3345.jpg?resize=600%2C315","video":null,"publish_date":"2025-10-03 20:30:00","author":"By Mara Hoplamazian N.H. Public Radio,Mara Hoplamazian N.h. Public Radio","authors":["By Mara Hoplamazian N.H. Public Radio","Mara Hoplamazian N.h. Public Radio"],"language":"en","source_country":"us","sentiment":-0.479},{"id":365996830,"title":"Trump's '60 Minutes' Return? The Don 'in Talks to Sit Down With Correspondent Bill Whitaker' Months After Settling $16Million CBS Lawsuit Over Kamala Harris' 'Edited' Interview","text":"Donald Trump is in talks with 60 Minutes, the show he sued over their sit-down with Kamala Harris, for an interview.\n\nWhile the president recently sued CBS News and its parent company, Paramount, and won $16million, talks to have him appear in an interview have begun, according to a news site.Trump May Return for an Unedited Interview on '60 Minutes'The report details the White House initially considered having Trump interview with Bill Whitaker last Friday while he was in New York for his United Nations Speech. While CBS staff began prepping for the meeting, Trump’s schedule postponed the interview. \n\nDiscussions for Trump to appear on 60 Minutes are still ongoing, but the White House has made one thing clear: if it occurs, they want CBS to air the entire conversation unedited. \n\nIn July, Paramount settled its lawsuit with Trump after he accused the network of misleading editing on their interview with Harris, something he felt was election interference.CBS Settled a Lawsuit With TrumpWhile CBS disputed the allegations, and legal experts thought they had a good chance of winning, amid a pending merger of its parent company, the owner of Paramount told the board she wanted to go for a settlement. \n\nAs part of the settlement, CBS agreed to release full transcripts for future interviews with presidents. \n\n60 Minutes isn’t the only show Trump has taken issue with as of late.Trump Is Working to Get 'South Park' Off the AirAs RadarOnline.com reported, the president is working behind the scenes to get South Park taken off the air. \n\nIn the current season of South Park, Trump has been ridiculed with depictions of him naked and with a talking penis, something he’s said to have taken personal offense to. \n\n\"Trump has been fuming about the way South Park portrayed him,” an insider claimed. \"He's convinced the writers are obsessed with humiliating him and is now trying to use back-channel pressure to make sure the show doesn't survive.\"\n\n\"People on the team think it’s no coincidence that Jimmy Kimmel Live! was abruptly canceled after years of mocking Trump – and they fear South Park could be next,” they added.Trump Thinks South Park Is 'Crossing a Line'After Trump was first mocked on the show, the White House slammed the series as being \"irrelevant for 20 years.\" Rather than hurt the show, though, viewership only increased, with the second episode garnering double the number of viewers as the first. \n\n\"The president hates being made fun of, especially about his body. He sees the 'tiny penis' gag as crossing a line and is determined to punish the creators,\" another source shared. \n\n\"The delay of episode three has sent shockwaves through the writers' room. Everyone is braced for the possibility the plug could be pulled altogether,” they added.\n\nWhile J.D. Vance was also satirized on the show, he seemed to take it more in stride, posting on X, \"Well, I’ve finally made it.\"","summary":"Donald Trump is in talks to return to '60 Minutes' for a sit-down interview with Bill Whitaker.... even after their legal drama.","url":"https://radaronline.com/p/donald-trump-60-minutes-return-in-talks-unedited-cbs-interview/","image":"https://media.radaronline.com/brand-img/Xy8hNHnOv/0x0/donald-trump-60-minutes-return-in-talks-1759519052343.jpg","video":null,"publish_date":"2025-10-03 20:30:00","author":"Matt Richards","authors":["Matt Richards"],"language":"en","category":"politics","source_country":"us","sentiment":-0.224},{"id":365988126,"title":"Now that half of it has been implemented, Trump has no problems admitting that Project 2025 was his blueprint the whole time [Obvious]","text":"Skip to content\n\nTry Ads-Free Fark\n\nIt's Not News, It's Fark\n\nHow To FarkLog In | Sign Up »\n\nForgot password?\n\n Turn on javascript (or enable it for Fark) for a better user experience.\n\nIf you can read this, either the style sheet didn't load or you have an older browser that doesn't support\nstyle sheets. Try clearing your browser cache and refreshing the page.\n\n Discussion\n\n Entertainment\n\n Now that half of it has been implemented, Trump has no problems admitting that Project 2025 was his blueprint the whole time (msnbc.com)\n\n More: Obvious, Government, Law, White House, Donald Trump, Associated Press, Politics, Power (social and political), Americans\n\n1343 clicks;posted toMain »and Politics »on 03 Oct 2025 at4:20 PM(1 hour ago) | Favorite | Watch | share: Copy Link\n\n 89 Comments \n\nEnable JavaScript for Fark in order to vote for entries.\n\nLog in (at the top of the page) to enable voting.\n\nView Voting Results:SmartestandFunniest\n\n | Show all\n\nJake Havechek \n\n(33) Funniest\n\n2 hours ago\n\n(27) Funniest\n\nTrump is a serial liar.\nFilm at 11, and 12, and 1...\n\n(19) Funniest\n\nHe is a liar.\n\nAlways has been.\n\nHabitual liar, in fact. Lies to liars.\n\ntembaarmswide \n\n(6) Funniest\n\nDone in 2. get the lights.\n\n(9) Funniest\n\nWow how unshocking\n\nfearmongert \n\n(12) Funniest\n\nSo, at what point is this a criminal conspiracy to take over/hijack the Government?\n\n(13) Funniest\n\n(39) Funniest\n\n\"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nemersonbiggins \n\n(31) Funniest\n\nThis one we can lay at the feet of journalists. His VP wrote the foreword to it, for godsakes.\n\n(48) Funniest\n\nPercipient \n\n(0) Funniest\n\nJake Havechek: [Fark user image 425x515]\n\n\"the fact that I do\"\n\n(21) Funniest\n\nI am Tom Joad's Complete Lack of Surprise \n\n(7) Funniest\n\nRasIanI: \"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nExcept their assumption that Americans weren't virtuently racist AND misogynist.\n\nKarma Chameleon \n\n(0) Funniest\n\nWE GOT HIM!\n\nSplittingAces \n\n(2) Funniest\n\n(1) Funniest\n\nI blame Trump for odd widespread use of all caps. I hate that.\n\nOn the other hand, I blame Obama for every time someone who wouldn't ordinarily say, \"Folks\" says, \"Folks.\" That one is his fault. Of course, I also blame Obama for the ACA - although I recently met two people whose financial picture improved because of the ACA. It only took 15 years, but I will admit that I did meet two.\n\nNature Spirals \n\n(3) Funniest\n\nDinjiin: [Fark user image image 594x154]\n[Fark user image image 590x548]\n\nThis was as much bullshiat THEN as it is now.\n\n(2) Funniest\n\nCoconice: I blame Trump for odd widespread use of all caps. I hate that.\n\nOn the other hand, I blame Obama for every time someone who wouldn't ordinarily say, \"Folks\" says, \"Folks.\" That one is his fault. Of course, I also blame Obama for the ACA - although I recently met two people whose financial picture improved because of the ACA. It only took 15 years, but I will admit that I did meet two.\n\nLet me be clear... ... tf?\n\nbighairyguy \n\n(0) Funniest\n\nCan't wait for the sequel, 2029.\n\n(45) Funniest\n\nThe New York times, the Washington Post, CBS News, USA today, and a number of other media outlets kept saying the Democrats and Harris were lying about Trump's association and interest in project 2025. The Washington post Even gave her a Pinocchio on it.\n\nThe legacy media didn't fail, they deliberately lied, and no one's calling them out on it either\n\nhoustondragon \n\n(3) Funniest\n\nRasIanI: \"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nAnd sadly, these assholes will loudly deny it while they still vote for Stinky\n\nemersonbiggins \n\n(8) Funniest\n\njohnny queso \n\n(1) Funniest\n\ngotta say, i'm now questioning if he knows anything about 25\n\nSoCalChris \n\n(16) Funniest\n\nThe Party told you to ignore the evidence of your eyes and ears. It was their final, most essential command. \n\ndodecahedron \n\n(0) Funniest\n\nI don't think he wrote that Truth Social post. I think Stephen Miller did.\n\nAppleOptionEsc \n\n(2) Funniest\n\nfearmongert: So, at what point is this a criminal conspiracy to take over/hijack the Government?\n\n2 years ago. Since it already happened, I think it ceases to be a conspiracy. It's just S.O.P. now.\n\ngordocroissant \n\n(0) Funniest\n\nIm wondering. How far can all this really go? Permanent? If we get another election what makes any of this permanent? What stops the next non gop president that has control of congress from expanding the Supreme Court and abolishing and spending their term fixing all this horrible crap?\n\nLumbar Puncture \n\n(6) Funniest\n\nIf only Kamala had said something\n\nfallingcow \n\n(5) Funniest\n\ncocozilla: [Fark user image image 425x542]\n\nThe New York times, the Washington Post, CBS News, USA today, and a number of other media outlets kept saying the Democrats and Harris were lying about Trump's association and interest in project 2025. The Washington post Even gave her a Pinocchio on it.\n\nThe legacy media didn't fail, they deliberately lied, and no one's calling them out on it either\n\nI'm convinced that if you could somehow put them in \"fact-checking something about Republicans\" mode while you were doing it, you could scam any reporter out of their own socks with ease. For some reason that activity makes them brain-falling-out-ears credulous. \"Oh you need them for your one-legged orphan dog? The doctors say my socks are the only thing that can restore its missing legs? Yeah that checks out, here you go. What's that? You also want direct-deposit access to my bank account so you can withdraw a small amount for expenses, which will unlock several million dollars that I've inherited from an uncle I didn't know I had? Well gee, that sure sounds swell, have at it and thank you!\"\n\n(0) Funniest\n\nSeems like he would rather get behind a Project 14, 15.\n\ngeekbikerskum \n\n(0) Funniest\n\nphamwaa: Trump is a serial liar.\nFilm at 11, and 12, and 1...\n\nIn fact I believe he is constitutionally unable to be truthful.\n\nUncle Pooky \n\n(17) Funniest\n\nRasIanI: \"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nHillary was right about every goddamn thing she said about him, and that was almost 10 years ago.\n\nSpartapuss \n\n(0) Funniest\n\nRasIanI: \"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nSomeone should put that on a hat.\n\njohnny queso \n\n(8) Funniest\n\nUncle Pooky: RasIanI: \"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nHillary was right about every goddamn thing she said about him, and that was almost 10 years ago.\n\nhe's not exactly hard to get a read on.\n\n(14) Funniest\n\nIt is almost like the Republican party has been taken over by a cabal of Christian Nationalists, Billionare Tech Bros, and one great big fat orange facist clown.\n\ngunga galunga \n\n(11) Funniest\n\nJake Havechek: [Fark user image 425x515]\n\nOur so-called liberal mainstream media: \"Well, you just heard him say it. He has nothing to do with Project 2025. So let's all take him at his word and not challenge the statement in any way, shape, form.\"\n\n(3) Funniest\n\nEwoksSuck: It is almost like the Republican party has been taken over by a cabal of Christian Nationalists, Billionare Tech Bros, and one great big fat orange facist clown.\n\nThey folded so damn quickly. Even Reagan couldn't get Bork on the Supreme Court.\n\n(0) Funniest\n\nTrocadero: EwoksSuck: It is almost like the Republican party has been taken over by a cabal of Christian Nationalists, Billionare Tech Bros, and one great big fat orange facist clown.\n\nThey folded so damn quickly. Even Reagan couldn't get Bork on the Supreme Court.\n\nIt's bizarre that this is the time everything fell apart\n\n(12) Funniest\n\nDinjiin: [Fark user image 594x154]\n[Fark user image 590x548]\n\nWho in the living fark did any of these morons think that Project 2025 was written for?!? Was there some other 2024 Republican candidate we didn't know about?? Did any of them look at exactly who was involved in its creation and how insane it was to accept Trump's denial based on that alone? If there was a video of Trump shooting someone in the head these same dimbulb chucklefarks would sit around writing, \"Well, Trump denied his involvement, so it's really unfair to say he did it.\" Then Trump blurts out that he did it and the same \"reporters\" would say, \"Well, this sure is a surprise! We certainly could never have known before this moment. How are Democrats responsible for this?\"\n\n(0) Funniest\n\nIt's all for you, Donnie!\n\nUncle Pooky \n\n(5) Funniest\n\njohnny queso: Uncle Pooky: RasIanI: \"A year later, we now have confirmation that Democrats were right\"\n\n....about everything.\n\nHillary was right about every goddamn thing she said about him, and that was almost 10 years ago.\n\nhe's not exactly hard to get a read on.\n\nPoint being, at the time there were a lot of people saying she wasn't.\n\nLumbar Puncture: If only Kamala had said something\n\nAnd then you have her, another woman who was completely right the entire time, but was scolded because she should have done more than telling us exactly how things would go.\n\n(0) Funniest\n\nFantastic. Let's talk shiat on the Democrats.\n\nSHOOOMER SHOOOOOOOOOO MURRR\n\nbluorangefyre \n\n(0) Funniest\n\nTelemonianAjax \n\n(9) Funniest\n\nCoconice: I blame Trump for odd widespread use of all caps. I hate that.\n\nOn the other hand, I blame Obama for every time someone who wouldn't ordinarily say, \"Folks\" says, \"Folks.\" That one is his fault. Of course, I also blame Obama for the ACA - although I recently met two people whose financial picture improved because of the ACA. It only took 15 years, but I will admit that I did meet two.\n\nFwiw the ACA doing away with 'pre-existing conditions' means you know a LOT of people who have benefitted from it already.\n\nLots of folks seem to forget that it used to be if you had a condition and lost your job you lost healthcare for life.\n\n(7) Funniest\n\nWe don't yet know what transpired at that meeting, but Trump's weird phrasing was itself notable. For example, there are no federal departments or offices that should be called \"Democrat Agencies.\" There are only American agencies, which do work on behalf of the American people and which are currently led, at least in part, by Trump's own appointees. \n\nIt's not notable at all. He's a farking moron.\n\nAnyone who doesn't like what he's doing is a Democrat. He's told what to think (sorry, he's \"influenced\") by the sycophants surrounding him, and whatever they don't like is a Democrat Agency, because Democrats = Bad in his mind, that's the entire calculus for this guy. I've wiped sh*t that was smarter than Donald Trump (psst: it's ALL my sh*t).\n\n(2) Funniest\n\nwhidbey: Fantastic. Let's talk shiat on the Democrats.\n\nSHOOOMER SHOOOOOOOOOO MURRR\n\n(5) Funniest\n\nTypical Trump, always taking credit for other peoples' work.\n\nLord Putin \n\n(2) Funniest\n\nwhidbey: Fantastic. Let's talk shiat on the Democrats.\n\nSHOOOMER SHOOOOOOOOOO MURRR\n\nYou're so very precious, you know that?\n\n(0) Funniest\n\nfredbox: whidbey: Fantastic. Let's talk shiat on the Democrats.\n\nSHOOOMER SHOOOOOOOOOO MURRR\n\nThat's what you do, though. Oh wait, you're not serious. You're serious. You're not serious.\n\nNah, you talk a lot of shiat on the people who would make this garbage go away.\n\n(0) Funniest\n\nLord Putin: whidbey: Fantastic. Let's talk shiat on the Democrats.\n\nSHOOOMER SHOOOOOOOOOO MURRR\n\nYou're so very precious, you know that?\n\nUser name...checks out!\n\nDisplayed 50 of 89 comments\n\n | Show all\n\nEnable JavaScript for Fark in order to vote for entries.\n\nLog in (at the top of the page) to enable voting.\n\nView Voting Results:SmartestandFunniest\n\nRedisplay/refresh comments\n\nIf you're having problems voting, quoting, or posting comments, try disabling any browser add-ons that might disable Javascript (NoScript, AdBlock, etc).See our FAQ.\n\n Forgot password?\n\nCreate an account to make comments\n\nRemember me\n\nIf you can see this, something's wrong with your browser's CSS support. (Or you're a spambot.)\n\nIf you are using the NoScript browser extension, you may have problems posting comments,\nespecially if they contain images.For a fix, see\nthis FAQ entry.If you still have problems, contact Farkback.\n\nBefore adding a comment, please take a minute to review our posting rules and our legal/privacy policy.\nBy commenting, you agree to these terms.\nYou might also want to take a look at our FAQ.\n\nIf you like these links, you'll love\n\nMore Fark for your buck\n\nlearn more | sign up\n\nSupport Fark\n\nSign up for the Fark NotNewsletter!\n\nHeadlines of the Month\n\nFark NotNewsletter\n\nTotalFark signup\nBareFark signup\nPurchase FarkUnits\n\nPurchase Badges\n\nTop Comments\n\nTop Submitters\n\nTop Smart Comments\n\nTop Sources/Topics\n\nTop Funny Comments\n\nPress/Publicity\n\nLink Voting\n\nSports Forum\n\nFandom Forum\n\nEntertainment Forum\n\nPolitics Forum\n\nFark Parties\n\nFark Party Forum\n\nPS/Photo Browser\n\nPhotoshop Forum\n\nFarktography Forum\n\nDiscussion/TF Live Forum\n\nTop Commented\n\nTop Commented ▼\n\nTop Commented\n\nTop Clicked\n\nMy Recent Commented\n\nRecent Mentions\n\nJavascript is required to view headlines in widget.\n\nLinks are submitted by members of the Fark community.\n\nWhen community members submit a link, they also write a custom headline for the story.\n\nOther Farkers comment on the links. This is the number of comments. Click here to read them.\n\nYou need to create an account to submit links or post comments.\n\nClick here to submit a link.\n\nAlso on Fark\n\nThe sea is a cruel mistress and that mistress will take your vacation home ( usatoday.com ) » (2 comments)\n\n\"Our friends have chosen camping over us, and we're hurt. Also, we hate camping. What do?\" ( oregonlive.com ) » (4 comments)\n\nWanna bet why this is? ( msn.com ) » (13 comments)\n\nGoldman Sachs CEO: Sh*t is whack, yo. Errybody goin' crazy on this AI thing, right? Markets run in cycles, dog. Diversify your bonds because the crash is coming within 24 months\" ( cnbc.com ) » (23 comments)\n\nThe people that use SPF 4 tanning oil may not be any worse off than you ( sciencealert.com ) » (0 comments)\n\nEntertainment\n\nHollywood actress Anna Kendrick has gone batty, she's now claiming she saw the Loch Ness Monster while on a trip there - and says Nessie winked at her (possible nsfw content on page) ( dailystar.co.uk ) » (29 comments)\n\nFlyin' Friday news - Law passed ordering the last complete space shuttle be moved from the Smithsonian to Texas 'because reasons'. Smithsonian: 'Step one will be cutting it up.' ( theregister.com ) » (6 comments)\n\nMaintenance workers with the Rhode Island Department of Transportation (RIDOT) rescued four kittens with the help of the North Kingstown Animal Control. (w/photos) ( wpri.com ) » (2 comments)\n\nA planetary diet will help us all, so eat the Earth? ( cnn.com ) » (10 comments)\n\nUNC professor has been reinstated after investigators found there's no such thing as an ANTIFA organization ( wral.com ) » (2 comments)\n\nFark :: Main | Discussion | Sports | Business | STEM | Entertainment | Fandom | D'awww | Food | Politics\n\nTotal Fark :: TotalFark | TF Live | TF Advice | TF Discussion | Commented | Top Voted | Greenlit\n\nFArQ :: About Us | Quick Answers | Posting Rules | Farkisms\n\nContests :: Photoshop | Farktography | Caption\n\nBuy Fark :: Fark Book | Fark Store\n\nSubmit a Link »\n\nCopyright © 1999 - 2025 Fark, Inc | Last updated: Oct 03 2025 18:05:50\n\nContact Us via Farkback | Report a bug/error msg | Terms of service/legal/privacy policy | Do Not Sell or Share My Personal Information\n\nRuntime: 0.287 sec (286 ms)","summary":"[link] [88 comments]","url":"https://www.fark.com/comments/13833458","image":"https://usrimg-full.fark.net/U/Ug/fark_Ugc18FNwH08ZHMwDGe2gOSDpUF0.jpg?AWSAccessKeyId=JO3ELGV4BGLFW7Y3EZXN&Expires=1759723200&Signature=BwW0WyDKy6eDW01ZN8t7no%2BLkYs%3D","video":null,"publish_date":"2025-10-03 20:20:06","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.317},{"id":365974392,"title":"‘It’s not a good place right now’: CBS News staffers are ‘literally freaking out’ about Bari Weiss taking over newsroom","text":"The imminent arrival of anti-woke and stridently pro-Israel “heterodox” pundit Bari Weiss as the editor-in-chief of CBS News has left the newsroom’s staff “literally freaking out,” with sources telling The Independent that the Tiffany Network is “not a good place right now.”\n\nThe rising frustration among the network’s journalists has also been compounded by the fact that David Ellison, the chief executive of the newly merged Paramount Skydance, is preparing to implement brutal layoffs and slash up to 10 percent of CBS News’ staff – all while paying Weiss up to $150 million to acquire her digital media outlet The Free Press.\n\nMeanwhile, Weiss seizing the reins of the network’s vaunted news division – which has been months in the making – comes as staff have grown increasingly disgruntled with Ellison’s transformation of CBS News, with many feeling that the new owner “lied” to them when he insisted he didn’t want to “politicize” the network.\n\nThe Independent has reached out to representatives for Paramount, Ellison and Weiss for comment.\n\nFollowing a politically tainted $8.4 billion merger between Ellison’s Skydance Media and Paramount Global, which saw Paramount agree to pay Donald Trump $16 million to settle a “meritless” lawsuit over a 60 Minutes interview with Kamala Harris, the new leadership team has made several moves to seemingly appease the right and the president.\n\nDays before the Federal Communications Commission approved the merger, Skydance promised Trump’s handpicked FCC chairman Brendan Carr that the new Paramount would not only eliminate all diversity hiring policies but would also install an ombudsman who would review “complaints of bias” at CBS News. Last month, Kenneth Weinstein – a former Trump appointee and leader of a conservative think tank – was appointed by Paramount to serve as the ombudsman of the news network.\n\nParamount’s leaders also effectively sided with the White House last month when it implemented new editing rules for the Sunday show Face the Nation, announcing that all interviews on the show will either be broadcast live or live to tape, following complaints from Homeland Security Secretary Kristi Noem about her answers being “shamefully edited” during a taping.\n\nIn recent weeks, Democratic lawmakers have opened an investigation into whether the 60 Minutes settlement – and Trump’s claims that he reached a “side deal” with Ellison to air pro-Trump ads on CBS after the merger was complete - constituted a “bribe.” The probe is also looking into Paramount’s pre-merger decision to cancel prominent Trump critic Stephen Colbert’s top-rated late-night CBS show. \n\nEllison, the son of Oracle founder and top Trump ally Larry Ellison, has been in talks to purchase The Free Press and bring Weiss aboard to set the editorial direction of CBS News for months now. \n\nWeiss, a former New York Times opinion columnist who famously quit The Grey Lady in 2020 over what she cited as the paper’s left-leaning editorial policies and “illiberal environment,” is expected to report to Ellison directly. Tom Cibrowski will remain as president of CBS News and work alongside Weiss, according to The New York Times.\n\nThe Free Press, which Weiss launched in 2021 alongside her wife and sister, will be purchased for a price tag of roughly $150 million, paid out in a combination of cash and stock. The site, which is hosted on Substack, has 1.5 million subscribers – with roughly 10 percent of those paid. According to Puck, the “heterodox” site’s valuation sits at around $100 million.\n\n“Her stunning comeback is a tribute to her hustle, her oft-acknowledged personal charisma, and above all her unapologetic support for Israel and attacks on progressive social justice dogmas, often disparaged as ‘wokeness’ – both of which align her with some of the most powerful people alive even as they alienate her from many of her generational peers in journalism,” The Guardian noted about Weiss in a profile last month.\n\nWhile it appears that The Free Press will remain a standalone property and it isn’t clear yet if it will be integrated into CBS News’ digital site, Weiss’ presence as a newsroom leader will almost certainly fuel even more tension at the network, which has been in turmoil since Paramount began negotiating a settlement over the 60 Minutes lawsuit.\n\nThe 41-year-old commentator will step into a news organization that has already seen the executive producer of 60 Minutes and the network’s news president resign over what they saw as corporate interference with editorial and journalistic independence, noting that they would not apologize for the Harris interview.\n\nAdditionally, the belief among network insiders and staffers is that Weiss is being hired to tamp down on pro-Palestinian coverage of the Gaza War, which was already a central sticking point with former Paramount chair Shari Redstone. \n\n“A major reason why this deal is happening is The Free Press’ unflinching pro-Israeli stance and Larry Ellison and his son David Ellison’s close ties to Israeli Prime Minister Benjamin Netanyahu,” Breaker reported this week.\n\nWhile CBS News staffers who spoke with The Independent noted that the majority of the newsroom wouldn’t welcome Weiss because of both her lack of experience and editorial sensibilities, they also said some reporters “would love” the hire specifically over her pro-Israel position.\n\n“I think there are some people there that are like, yes, get her in here because they care about one issue, and that's Israel,” one reporter said.\n\nHowever, for the most part, sources stated that morale is extremely low and there is no real appetite among most of the staff to see Weiss take charge of the network and potentially squander its credibility, as well as that of 60 Minutes, its legendary and long-running newsmagazine. \n\n“People are using words like depressing and doomsday – feels like some sort of doomsday,” the same reporter declared.\n\n“I think the ombudsman, Bari Weiss, and the impending massive layoffs that are coming in a couple of weeks have everyone just kind of freaking out, like, literally freaking out,” another CBS journalist noted. “It's not a good place right now. There was a proper way to do this and a not proper way, and they're doing it in the non-proper way, and maybe that's by design.”\n\nIndeed, with Ellison already making it clear that the new Paramount plans to slash $2 billion from its ledger sheet, painful layoffs are just around the bend – with hundreds of reporters and news staffers on the chopping block. Therefore, the windfall of cash to Weiss is not exactly sitting well with employees who are currently fearful of impending pink slips.\n\n“The fact that we don't have money to pay journalists, but we have money to pay Bari Weiss between $100 and 200 million is indicative of what the Ellisons' true goal here is,” a network correspondent said. “And it's not journalism.”\n\nNetwork staffers also told The Independent that Weiss would have a tough time gaining the respect of the newsroom because they see her as something of a “political operative,” adding that CBS News is already “not a welcoming place for outsiders.”\n\n“There are so many people who've come in here and been chewed up and spit out that the idea that somebody that we don't want is going to come in here and somehow manage to survive this is, I think, laughable,” the CBS reporter declared. “So she's in for, I would venture to guess, a rough ride.”\n\nWhile Ellison insisted right after the close of the merger that he was “committed to accuracy, integrity, and public trust” and wanted to maintain CBS News’ “storied” legacy, all while steering clear of politicizing the network, sources said that the installation of Weiss as top editor of the news division flies in the face of all of that.\n\n“He's essentially going to hand the keys to the kingdom to Bari Weiss and to anyone and everyone who is an ideologue that supports his and his father's world,” the CBS reporter told The Independent.\n\nThe network journalist added that Weiss lacks experience dealing with a broadcast organization of CBS News' size, wondering if she’ll be able to “determine if we cover weather in Mississippi” or send reporting crews to various American and international cities. \n\n“There's such a gulf between your own online publication and broadcast television,” they stated, adding: “Does she know how to do this stuff? … Forget what her political views are, does she know how to do this?!”\n\nFurthermore, in response to a “source close to Ellison” telling The Financial Times that the news “became extreme, elitist, and performative” and that Ellison plans to “bring back a performance-based culture” at CBS in the tradition of Walter Cronkite and Edward Murrow, a network insider scoffed while invoking the Weiss move.\n\n“Also, is Weiss’ Free Press not extreme, elite, and performative? It’s both those things, which is why it’s considered fringe media and CBS News is not,” the insider said. “Is Bari Weiss considered objective or a journalist? Cronkite and Murrow would absolutely not think she is and would have tossed her out of the newsroom inside an hour.”\n\nUltimately, at least one source pointed out that it was what they saw as a relative lack of qualifications for the senior editorial position that could really hinder Weiss in the eyes of those she hopes to supervise and lead.\n\n“It's just like anybody that you think isn't qualified for the job that comes in, there's going to be trepidation, right?” the network correspondent wondered. “Whether it's Bari Weiss or, you know, Michael Scott from The Office.”","summary":"EXCLUSIVE: ‘People are using words like depressing and doomsday – feels like some sort of doomsday,’ one source told The Independent about the mood inside CBS News right now.","url":"https://www.independent.co.uk/news/world/americas/us-politics/cbs-news-bari-weiss-editor-reaction-b2839064.html","image":"https://static.independent.co.uk/2025/10/03/18/45/GettyImages-2194604196.jpeg?crop=2047.5,1365,x0.3,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/i6ky8Z1q-OhrQWqOm.mp4","publish_date":"2025-10-03 19:48:15","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.095},{"id":365976072,"title":"The Right Has a New Culture War Target. You’ve Probably Used It Recently.","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nYears after taking heat from viewers and employees for backing Dave Chappelle’s transphobic specials, Netflix is now facing down a stream of online rage for being too pro-trans, apparently. This week, a boycott campaign took off on X, spearheaded by far-right transphobe Chaya “Libs of TikTok” Raichik, over the presence of children’s series and movies that feature such horrific scenes as a boy wearing a dress (gasp!), a transgender character talking to reporters (egad!), and a kid telling a robot about the term nonbinary (gadzooks!!). This has escalated to accusations of Netflix “grooming children,” which have been boosted by X owner Elon Musk and by elected Republican lawmakers. (One of them is now threatening to drag Netflix executives in front of Congress, while Georgia Rep. Marjorie Taylor Greene has referred to a cartoon series as “abuse” and promoted her law to ban gender-affirming care.) As of Friday, various X accounts are continuing to air out what they find so objectionable on Netflix, from its production deal with the Obamas to its employees, while promoting alternative streaming services and programming to their rage-baited followers. The corporation itself has not commented on the matter.\n\nNetflix boycott threats are a common tactic on the right, as ironically evidenced by Raichik herself, who’s been sharing screenshots of old Charlie Kirk tweets calling the company “a pedophile streaming platform.” (One user who claimed to be canceling their subscription was revealed to have said they’d previously canceled their Netflix account last year, and the year before that.) The online anti-trans fury does feel a touch more powerful this round, with sympathetic leaders in government who will gladly join something as stupid as the brigade against Cracker Barrel’s logo change. But, considering Netflix’s own right-wing bona fides, will this actually lead to an ideological protest on par with the Disney+/Hulu cancellations that spurred the reinstatement of Jimmy Kimmel’s show? Here’s an explainer for how this campaign against Netflix kicked off, what it really means for the streaming business, and why this may not have the oft-noted “Bud Light” impact.\n\nMan, how did we get here?\n\nThis all began Monday, when Raichik shared a clip from the Netflix Original animated series Dead End: Paranormal Park, which ran for only two seasons and was canceled in 2023—but which, Raichik incorrectly posited, was being actively “promoted” on Netflix Kids. The 40-second segment involves a character finding affirmation in their trans identity, in a monologue that ends with another character making an unrelated joke. Raichik, whose posts have long inspired vigilante threats against schools and hospitals with trans-inclusive policies, then targeted show creator Hamish Steele, an award-winning trans cartoonist in London who’d referred to Charlie Kirk as a “random nazi” in a post-assassination tweet. (Steele, who has locked their X account, posted about receiving “extremely nasty weird homophobic and antisemitic emails” in the aftermath and is now taking a social media break.)\n\nElon Musk hopped on to say that the perfectly anodyne Dead End clip was “not ok,” and Raichik claimed soon after that the Tesla CEO had ended his Netflix subscription. By Tuesday, Libs of TikTok had posted a screenshot of her cancel-confirmation email and encouraged others to do the same. The voice actor behind the Dead End character responded directly to Raichik, speaking to his own trans identity and writing on X, “you can fear monger all you want, but kids & parents have told me [the show] saved their lives!!”\n\n… That was it? A clip from an already-ended show that wasn’t even being promoted got Libs of TikTok all hopping mad?\n\nWell, after the Musk boost, she felt empowered to attack other movies and shows, however flimsily. On Wednesday, she highlighted Transformer: Earthspark, an animated kids’ sitcom that was commissioned for Paramount+ in 2022. A Strawberry Shortcake TV movie from 2023 (which was also not a Netflix Original) earned her anger for featuring a male character who wears a dress. Another long-canceled Netflix show, the 2020–21 Baby-Sitters Club revival, came to her attention for a scene where a girl corrects hospital staff on her bedridden friend’s gender identity. And then Raichik went after another Paramount+ original, 2022’s Monster High: The Movie, which is reportedly streaming on Netflix U.K. and had committed the sin of having two characters introduce each other with their preferred pronouns.\n\nReally, these are harmless and brief segments weaponized on behalf of a conservative movement that’s been seeking to erase transgender identity altogether, from pseudoscientific efforts to outlaw gender-affirming care for minors to scrubbing trans Americans from historical monuments. To these cruel people, the very depiction of a transgender person is tantamount to indoctrination, as is the (to them) inconvenient reality that young people do experience gender dysphoria and can understand the concept of gender fluidity. If you’ve imbibed enough far-right propaganda to become a J.K. Rowling type who believes that top surgery is “mutilation,” then anything about trans people will make you feel upset.\n\nI seem to recall that Elon Musk is estranged from his trans daughter.\n\nIndeed, and that’s spurred his mission to defeat the “woke mind virus.” He’s made nice with quite a few other transphobes lately, including Graham Linehan, the Father Ted and IT Crowd creator who was briefly arrested in London last month for tweets that invited readers to “punch” trans women “in the balls” if they’re situated in women-oriented spaces. (Linehan later wrote on Substack that this was “a serious point made with a joke” and “not a call to violence.”) Linehan, who has a lengthy record of transphobic rhetoric, announced his own Netflix cancellation on X in a Wednesday tweet that was celebrated by Musk. More paid-blue-check accounts who lied that Netflix is losing “millions” of customers joined in the fun throughout Wednesday, while God’s Not Dead actor Kevin Sorbo and his wife posted videos praising Raichik and Musk, with the former using the opportunity to also promote the “Christian publishing company” Brave Books—which happens to have a paid streaming service for kids.\n\nAh yes, it’s grifting time.\n\nBetter believe it! The Christian production company Angel Studios (best known for Sound of Freedom) soon began trending on X, as paid-check accounts recommended its streaming platform as a Netflix alternative. More enterprising users dug in and found that the Texan venture capital firm Gigafund, known for employing many Musk lackeys who’ve invested in his enterprises (SpaceX, the Boring Company, Neuralink), had helmed a multimillion-dollar fundraising round for Angel Studios back in 2022. Some of the more Christian nationalist types on X have objected to Angel’s history with Mormon founders, however. (Notably, no one seems to be recommending Truth Social’s homegrown streaming service. Sad!)\n\nEeesh, what a weird social network.\n\nRight? You could see more evidence of this throughout the week, as other activists dug into every Netflix corner they could to “expose” the company as an indoctrination factory. One tweeted out a trans-character-centered article from Netflix’s in-house publication, Tudum, posted earlier this year in honor of International Trans Day of Visibility. This user also shared a May 2024 Netflix press release that touted its Fund for Creative Equity’s support of the Transgender Film Center’s Career Development Lab. Raichik, meanwhile, extended her purview to target other Netflix titles like the popular 2023 movie Leave the World Behind, an Obama-produced feature that she accused of “hating white people” despite including many prominent white people in its cast. From there, individual Netflix investors who’d worked in diversity, equity, and inclusion initiatives were singled out as part and parcel of a “child grooming epidemic.” Anti-DEI crusader and Meta employee Robby Starbuck was mortified by the fact that various Netflix executives attended a corporate workshop in 2019 that centered on privilege and allyship.\n\nI don’t get it, though. Hasn’t Netflix taken a right-wing tack recently?\n\nCorrect! CEO Ted Sarandos has dined at Mar-a-Lago with Donald Trump. Netflix signed a deal with reactionary comic Tony Hinchcliffe not long after the Kill Tony founder made that racist joke about Puerto Ricans at Trump’s Madison Square Garden rally. The streamer also partnered last year with Shane Gillis, the stand-up comedian who was infamously fired from Saturday Night Live in 2019 after his racist anti-Asian podcast segments were unearthed. (Gillis continues to hang out with outright racists on his podcasts, and Netflix has produced other stand-up specials with open anti-Asian racism.)\n\nChairman Reed Hastings may have inadvertently fueled another conservative cancellation cycle last year when he donated to Kamala Harris’ campaign, but he’s consistently defended Dave Chappelle’s transphobia, and his company has frequently backed “anti-woke” entertainment like the reality show Snowflake Mountain and a whole host of stand-up specials whose titles riff on the onetime buzzword triggered. In 2022, after Elon Musk accused Netflix of harboring the “woke mind virus,” company leadership dropped certain deals with Black producers like Ava DuVernay and Ibram X. Kendi.\n\nThese guys get mad about Netflix pretty often, don’t they?\n\nThey do, which is why I’m not convinced that this round will leave any lasting damage on the service. The right-wing outrage over the 2020 film Cuties revved up many of the same talking points we see now, and multiple surveys demonstrate that Netflix’s customer base remains overwhelmingly liberal. (Notably, Tesla stock also took a little dive on Friday, perhaps because Musk’s crusade is reawakening shareholder fears that he’s engaging in politics again.)\n\nAll of which is to say: Conservatives only have so many accounts they can cancel, and the Streisand effect may just spur liberal viewers to check out the shows and movies that the far-right is binge-watching for content.","summary":"We’ve seen this movie already—and it always flops.","url":"https://slate.com/technology/2025/10/netflix-boycott-trans-elon-musk-marjorie-taylor-greene.html?via=rss","image":"https://compote.slate.com/images/9e1f2445-9dcb-49af-9bb7-b8090861e899.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-10-03 19:42:37","author":"Nitish Pahwa","authors":["Nitish Pahwa"],"language":"en","source_country":"US","sentiment":-0.166},{"id":365963962,"title":"A by the numbers look at the current Hispanic population in the United States","text":"By FERNANDA FIGUEROA, Associated Press\n\nHispanic Heritage Month, celebrated from Sept. 15 through October 15, offers the opportunity to recognize and celebrate the contributions of Hispanic cultures in the United States. Hispanic people in the U.S. are becoming one of the nation’s fastest growing racial and ethnic groups.\n\nBut this growing community is far from being a monolith. From shifting identities, increasing educational attainment and growing political influence, Hispanic Americans continue to be a major part of the nation’s tapestry.\n\nHere’s a look at the Hispanic population in the U.S., by the numbers:\n\nMore than 68 million\n\nThat’s how many people in the U.S. identify as ethnically Hispanic, according to the latest census estimates.\n\nHispanic was a term coined by the federal government for people descended from Spanish-speaking cultures. But, being ethnically Hispanic can reflect a diverse array of histories, cultures and national origins.\n\nThere are several other identifiers for Hispanic people, depending largely on personal preference. Mexican Americans, the largest Hispanic subgroup, who grew up during the 1960s Civil Rights era may identify as Chicano. Others may go by their family’s nation of origin, such as Colombian American or Salvadorian American.\n\nThat’s the median age of the Hispanic population in the U.S., according to the Census. It’s the youngest of all U.S. populations.\n\nIn comparison, the median age for the overall U.S. population is 39.1.\n\nThe increase in the number of Hispanic women earning advanced degrees from 2000 to 2021. The number of Hispanic men accomplishing the same increased by 199% during the same period, according to U.S. Census Bureau data analyzed by the Pew Research Center.\n\nAlthough the number of Latinos earning college degrees has increased in the last two decades, they remain underpaid and underrepresented in the workforce compared to their non-Hispanic counterparts, a reality that advocates say can change only when there are more Latinos in positions of power.\n\nThe percentage of the U.S. Hispanic population age 5 and older who speak a language other than English at home, according to 2024 census estimates. About 28.7% of them also report speaking English “less than very well.”\n\nUntil recently, the United States had no official language. Today, it is English.\n\nCurrently, there are more than 350 languages spoken in the United States, according to U.S. Census Bureau data. The most widely spoken languages other than English are Spanish, Chinese, Tagalog, Vietnamese and Arabic.\n\nAccording to AP VoteCast, Hispanics made up about 10% of voters in the 2024 presidential election. Support among Hispanic voters, especially in swing states like Arizona, was an important factor to who would win the election.\n\nAbout half of Hispanic voters in the 2024 election identified as Democrats. About 4 in 10 were Republicans and roughly 1 in 10 were independents.\n\nOverall, Hispanic voters were about equally likely to say they have a favorable view of Republican candidate Donald Trump and Democratic candidate Kamala Harris. But there is a gender divide among Hispanic voters on Harris: About 6 in 10 Hispanic women have a somewhat or very favorable opinion of Harris, compared to 45% of Hispanic men.\n\nThe number of Hispanic or Latino members serving in the 119th Congress. That shakes out to 10.35% of total membership, according to the official Congress profile.\n\nFor comparison, 40 years ago in the 99th Congress there were only 14 Hispanic or Latino members, and all were male.\n\nSix serve in the Senate and 50 in the House of Representatives, including two delegates and the Resident Commissioner. Of the members of the House, 38 identify as Democrats and 12 as Republican, with 19 women serving.\n\nAt the start of January, there were seven Hispanic US senators. That number decreased to six when then Sen. Marco Rubio resigned to become the Secretary of State. Of the six Hispanic senators, two are Republican and four are Democrats; one is a woman:\n\n1. Sen. Ted Cruz\n\n2. Sen. Catherine Cortez Masto\n\n3. Sen. Alex Padilla\n\n4. Sen. Ben Ray Lujan\n\n5. Sen. Ruben Gallego\n\n6. Sen. Bernie Moreno\n\nThis year also marked a new record for Latinas in state legislatures. In total, 214 Latinas or 2.9% hold a seat in a state legislature, according to the Center for American Women and Politics. Of the 214 Latinas serving in a state house, 182 are Democrats, 31 are Republican, and one identifies as nonpartisan.\n\nAs of September 2025, Gov. Michelle Lujan Grisham is the only active Latina governor in the U.S. Only two Latinas have been elected governor in U.S. history, and both were in New Mexico.","summary":"More than 68 million people in the U.S. identify as ethnically Hispanic.","url":"https://www.sandiegouniontribune.com/2025/10/03/latino-population-us/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Latino-Population-Profile_92381-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-03 19:36:10","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":0.265},{"id":365974912,"title":"A by the numbers look at the current Hispanic population in the United States","text":"By FERNANDA FIGUEROA, Associated Press\n\nHispanic Heritage Month, celebrated from Sept. 15 through October 15, offers the opportunity to recognize and celebrate the contributions of Hispanic cultures in the United States. Hispanic people in the U.S. are becoming one of the nation’s fastest growing racial and ethnic groups.\n\nBut this growing community is far from being a monolith. From shifting identities, increasing educational attainment and growing political influence, Hispanic Americans continue to be a major part of the nation’s tapestry.\n\nHere’s a look at the Hispanic population in the U.S., by the numbers:\n\nMore than 68 million\n\nThat’s how many people in the U.S. identify as ethnically Hispanic, according to the latest census estimates.\n\nHispanic was a term coined by the federal government for people descended from Spanish-speaking cultures. But, being ethnically Hispanic can reflect a diverse array of histories, cultures and national origins.\n\nThere are several other identifiers for Hispanic people, depending largely on personal preference. Mexican Americans, the largest Hispanic subgroup, who grew up during the 1960s Civil Rights era may identify as Chicano. Others may go by their family’s nation of origin, such as Colombian American or Salvadorian American.\n\nThat’s the median age of the Hispanic population in the U.S., according to the Census. It’s the youngest of all U.S. populations.\n\nIn comparison, the median age for the overall U.S. population is 39.1.\n\nThe increase in the number of Hispanic women earning advanced degrees from 2000 to 2021. The number of Hispanic men accomplishing the same increased by 199% during the same period, according to U.S. Census Bureau data analyzed by the Pew Research Center.\n\nAlthough the number of Latinos earning college degrees has increased in the last two decades, they remain underpaid and underrepresented in the workforce compared to their non-Hispanic counterparts, a reality that advocates say can change only when there are more Latinos in positions of power.\n\nThe percentage of the U.S. Hispanic population age 5 and older who speak a language other than English at home, according to 2024 census estimates. About 28.7% of them also report speaking English “less than very well.”\n\nUntil recently, the United States had no official language. Today, it is English.\n\nCurrently, there are more than 350 languages spoken in the United States, according to U.S. Census Bureau data. The most widely spoken languages other than English are Spanish, Chinese, Tagalog, Vietnamese and Arabic.\n\nAccording to AP VoteCast, Hispanics made up about 10% of voters in the 2024 presidential election. Support among Hispanic voters, especially in swing states like Arizona, was an important factor to who would win the election.\n\nAbout half of Hispanic voters in the 2024 election identified as Democrats. About 4 in 10 were Republicans and roughly 1 in 10 were independents.\n\nOverall, Hispanic voters were about equally likely to say they have a favorable view of Republican candidate Donald Trump and Democratic candidate Kamala Harris. But there is a gender divide among Hispanic voters on Harris: About 6 in 10 Hispanic women have a somewhat or very favorable opinion of Harris, compared to 45% of Hispanic men.\n\nThe number of Hispanic or Latino members serving in the 119th Congress. That shakes out to 10.35% of total membership, according to the official Congress profile.\n\nFor comparison, 40 years ago in the 99th Congress there were only 14 Hispanic or Latino members, and all were male.\n\nSix serve in the Senate and 50 in the House of Representatives, including two delegates and the Resident Commissioner. Of the members of the House, 38 identify as Democrats and 12 as Republican, with 19 women serving.\n\nAt the start of January, there were seven Hispanic US senators. That number decreased to six when then Sen. Marco Rubio resigned to become the Secretary of State. Of the six Hispanic senators, two are Republican and four are Democrats; one is a woman:\n\n1. Sen. Ted Cruz\n\n2. Sen. Catherine Cortez Masto\n\n3. Sen. Alex Padilla\n\n4. Sen. Ben Ray Lujan\n\n5. Sen. Ruben Gallego\n\n6. Sen. Bernie Moreno\n\nThis year also marked a new record for Latinas in state legislatures. In total, 214 Latinas or 2.9% hold a seat in a state legislature, according to the Center for American Women and Politics. Of the 214 Latinas serving in a state house, 182 are Democrats, 31 are Republican, and one identifies as nonpartisan.\n\nAs of September 2025, Gov. Michelle Lujan Grisham is the only active Latina governor in the U.S. Only two Latinas have been elected governor in U.S. history, and both were in New Mexico.","summary":"More than 68 million people in the U.S. identify as ethnically Hispanic.","url":"https://www.twincities.com/2025/10/03/latino-population-us/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Latino-Population-Profile_92381-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-10-03 19:36:10","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.265},{"id":365971558,"title":"A by the numbers look at the current Hispanic population in the United States","text":"By FERNANDA FIGUEROA, Associated Press\n\nHispanic Heritage Month, celebrated from Sept. 15 through October 15, offers the opportunity to recognize and celebrate the contributions of Hispanic cultures in the United States. Hispanic people in the U.S. are becoming one of the nation’s fastest growing racial and ethnic groups.\n\nBut this growing community is far from being a monolith. From shifting identities, increasing educational attainment and growing political influence, Hispanic Americans continue to be a major part of the nation’s tapestry.\n\nHere’s a look at the Hispanic population in the U.S., by the numbers:\n\nMore than 68 million\n\nThat’s how many people in the U.S. identify as ethnically Hispanic, according to the latest census estimates.\n\nHispanic was a term coined by the federal government for people descended from Spanish-speaking cultures. But, being ethnically Hispanic can reflect a diverse array of histories, cultures and national origins.\n\nThere are several other identifiers for Hispanic people, depending largely on personal preference. Mexican Americans, the largest Hispanic subgroup, who grew up during the 1960s Civil Rights era may identify as Chicano. Others may go by their family’s nation of origin, such as Colombian American or Salvadorian American.\n\nThat’s the median age of the Hispanic population in the U.S., according to the Census. It’s the youngest of all U.S. populations.\n\nIn comparison, the median age for the overall U.S. population is 39.1.\n\nThe increase in the number of Hispanic women earning advanced degrees from 2000 to 2021. The number of Hispanic men accomplishing the same increased by 199% during the same period, according to U.S. Census Bureau data analyzed by the Pew Research Center.\n\nAlthough the number of Latinos earning college degrees has increased in the last two decades, they remain underpaid and underrepresented in the workforce compared to their non-Hispanic counterparts, a reality that advocates say can change only when there are more Latinos in positions of power.\n\nThe percentage of the U.S. Hispanic population age 5 and older who speak a language other than English at home, according to 2024 census estimates. About 28.7% of them also report speaking English “less than very well.”\n\nUntil recently, the United States had no official language. Today, it is English.\n\nCurrently, there are more than 350 languages spoken in the United States, according to U.S. Census Bureau data. The most widely spoken languages other than English are Spanish, Chinese, Tagalog, Vietnamese and Arabic.\n\nAccording to AP VoteCast, Hispanics made up about 10% of voters in the 2024 presidential election. Support among Hispanic voters, especially in swing states like Arizona, was an important factor to who would win the election.\n\nAbout half of Hispanic voters in the 2024 election identified as Democrats. About 4 in 10 were Republicans and roughly 1 in 10 were independents.\n\nOverall, Hispanic voters were about equally likely to say they have a favorable view of Republican candidate Donald Trump and Democratic candidate Kamala Harris. But there is a gender divide among Hispanic voters on Harris: About 6 in 10 Hispanic women have a somewhat or very favorable opinion of Harris, compared to 45% of Hispanic men.\n\nThe number of Hispanic or Latino members serving in the 119th Congress. That shakes out to 10.35% of total membership, according to the official Congress profile.\n\nFor comparison, 40 years ago in the 99th Congress there were only 14 Hispanic or Latino members, and all were male.\n\nSix serve in the Senate and 50 in the House of Representatives, including two delegates and the Resident Commissioner. Of the members of the House, 38 identify as Democrats and 12 as Republican, with 19 women serving.\n\nAt the start of January, there were seven Hispanic US senators. That number decreased to six when then Sen. Marco Rubio resigned to become the Secretary of State. Of the six Hispanic senators, two are Republican and four are Democrats; one is a woman:\n\n1. Sen. Ted Cruz\n\n2. Sen. Catherine Cortez Masto\n\n3. Sen. Alex Padilla\n\n4. Sen. Ben Ray Lujan\n\n5. Sen. Ruben Gallego\n\n6. Sen. Bernie Moreno\n\nThis year also marked a new record for Latinas in state legislatures. In total, 214 Latinas or 2.9% hold a seat in a state legislature, according to the Center for American Women and Politics. Of the 214 Latinas serving in a state house, 182 are Democrats, 31 are Republican, and one identifies as nonpartisan.\n\nAs of September 2025, Gov. Michelle Lujan Grisham is the only active Latina governor in the U.S. Only two Latinas have been elected governor in U.S. history, and both were in New Mexico.","summary":"More than 68 million people in the U.S. identify as ethnically Hispanic.","url":"https://www.bostonherald.com/2025/10/03/latino-population-us/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Latino-Population-Profile_92381-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-03 19:36:10","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.265},{"id":365979810,"title":"A by the numbers look at the current Hispanic population in the United States","text":"By FERNANDA FIGUEROA, Associated Press\n\nHispanic Heritage Month, celebrated from Sept. 15 through October 15, offers the opportunity to recognize and celebrate the contributions of Hispanic cultures in the United States. Hispanic people in the U.S. are becoming one of the nation’s fastest growing racial and ethnic groups.\n\nBut this growing community is far from being a monolith. From shifting identities, increasing educational attainment and growing political influence, Hispanic Americans continue to be a major part of the nation’s tapestry.\n\nHere’s a look at the Hispanic population in the U.S., by the numbers:\n\nMore than 68 million\n\nThat’s how many people in the U.S. identify as ethnically Hispanic, according to the latest census estimates.\n\nHispanic was a term coined by the federal government for people descended from Spanish-speaking cultures. But, being ethnically Hispanic can reflect a diverse array of histories, cultures and national origins.\n\nThere are several other identifiers for Hispanic people, depending largely on personal preference. Mexican Americans, the largest Hispanic subgroup, who grew up during the 1960s Civil Rights era may identify as Chicano. Others may go by their family’s nation of origin, such as Colombian American or Salvadorian American.\n\nThat’s the median age of the Hispanic population in the U.S., according to the Census. It’s the youngest of all U.S. populations.\n\nIn comparison, the median age for the overall U.S. population is 39.1.\n\nThe increase in the number of Hispanic women earning advanced degrees from 2000 to 2021. The number of Hispanic men accomplishing the same increased by 199% during the same period, according to U.S. Census Bureau data analyzed by the Pew Research Center.\n\nAlthough the number of Latinos earning college degrees has increased in the last two decades, they remain underpaid and underrepresented in the workforce compared to their non-Hispanic counterparts, a reality that advocates say can change only when there are more Latinos in positions of power.\n\nThe percentage of the U.S. Hispanic population age 5 and older who speak a language other than English at home, according to 2024 census estimates. About 28.7% of them also report speaking English “less than very well.”\n\nUntil recently, the United States had no official language. Today, it is English.\n\nCurrently, there are more than 350 languages spoken in the United States, according to U.S. Census Bureau data. The most widely spoken languages other than English are Spanish, Chinese, Tagalog, Vietnamese and Arabic.\n\nAccording to AP VoteCast, Hispanics made up about 10% of voters in the 2024 presidential election. Support among Hispanic voters, especially in swing states like Arizona, was an important factor to who would win the election.\n\nAbout half of Hispanic voters in the 2024 election identified as Democrats. About 4 in 10 were Republicans and roughly 1 in 10 were independents.\n\nOverall, Hispanic voters were about equally likely to say they have a favorable view of Republican candidate Donald Trump and Democratic candidate Kamala Harris. But there is a gender divide among Hispanic voters on Harris: About 6 in 10 Hispanic women have a somewhat or very favorable opinion of Harris, compared to 45% of Hispanic men.\n\nThe number of Hispanic or Latino members serving in the 119th Congress. That shakes out to 10.35% of total membership, according to the official Congress profile.\n\nFor comparison, 40 years ago in the 99th Congress there were only 14 Hispanic or Latino members, and all were male.\n\nSix serve in the Senate and 50 in the House of Representatives, including two delegates and the Resident Commissioner. Of the members of the House, 38 identify as Democrats and 12 as Republican, with 19 women serving.\n\nAt the start of January, there were seven Hispanic US senators. That number decreased to six when then Sen. Marco Rubio resigned to become the Secretary of State. Of the six Hispanic senators, two are Republican and four are Democrats; one is a woman:\n\n1. Sen. Ted Cruz\n\n2. Sen. Catherine Cortez Masto\n\n3. Sen. Alex Padilla\n\n4. Sen. Ben Ray Lujan\n\n5. Sen. Ruben Gallego\n\n6. Sen. Bernie Moreno\n\nThis year also marked a new record for Latinas in state legislatures. In total, 214 Latinas or 2.9% hold a seat in a state legislature, according to the Center for American Women and Politics. Of the 214 Latinas serving in a state house, 182 are Democrats, 31 are Republican, and one identifies as nonpartisan.\n\nAs of September 2025, Gov. Michelle Lujan Grisham is the only active Latina governor in the U.S. Only two Latinas have been elected governor in U.S. history, and both were in New Mexico.","summary":"More than 68 million people in the U.S. identify as ethnically Hispanic.","url":"https://www.ocregister.com/2025/10/03/latino-population-us/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Latino-Population-Profile_92381-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-03 19:36:10","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"US","sentiment":0.265},{"id":365963520,"title":"Spanberger defends abortion ad criticizing Sears after Bernie warns against highlighting issue","text":"Virginia Democratic gubernatorial nominee Abigail Spanberger on Friday defended her new ad targeting Lt. Gov. Winsome Earle-Sears’ opposition to abortion, despite Sen. Bernie Sanders recently warning former Vice President Kamala Harris that focusing on the issue could hurt her chances. In Harris’ new book, \"107 Days,\" she wrote that Sanders warned her: \"please focus on the working class, not just on abortion,\" and that he told her he supported then-President Joe Biden because he focused on economic issues. Harris went on to lose all seven swing states and return the White House to President Donald Trump. Spanberger’s ad begins with a clip from an Earle-Sears rally while a narrator calls her a \"MAGA Republican,\" and said: she wants a \"near-total ban\" on abortion. TRUMP VOICES SUPPORT FOR GOP GUBERNATORIAL CANDIDATE, ADMITS SHE HAS 'TOUGH RACE' \"So far right, she’s wrong for Virginia,\" the narrator later concludes. A spokesperson for Spanberger – a former Democratic congresswoman representing the Rappahannock Valley – told Fox News Digital it is still important that Virginians know where Earle-Sears stands on abortion, when asked about Sanders’ warning to Harris. VIRGINIA LT. GOVERNOR ON WHY HER STATE IS AT RISK OF LOSING FEDERAL FUNDING OVER TRANSGENDER BATHROOMS \"As we approach the first Virginia gubernatorial election since the fall of Roe v. Wade … Winsome Earle-Sears supports an abortion ban with no exceptions for rape or incest,\" Spanberger’s spokesperson said. \"The Republican nominee in this race has called abortion \"wicked\" and just this year handwrote a note on Virginia’s proposed constitutional amendment protecting reproductive rights in Virginia making clear that she is ‘morally opposed’.\" As lieutenant governor, Earle-Sears presides over the Virginia Senate and is required to sign bills passed by the chamber. WINSOME EARLE-SEARS REBUKES SPANBERGER PLAN TO UNDO VIRGINIA’S ICE PACT: ‘THIS IS NOT HARD’ When the Senate successfully passed a resolution from state Sen. Jennifer Boysko, D-McLean, that would amend the Virginia Constitution to provide a \"fundamental right to reproductive freedom\" if the 2026 chamber passes identical legislation, Earle-Sears inscribed her own objection: \"I am morally opposed to this bill. No protection for the child,\" she hand-wrote, which is allowed under Senate policy. Earle-Sears did not respond to a request for comment, but told the Winchester Star during her 2021 run for lieutenant governor that abortion should be illegal in most cases, excluding life-of-the-mother concerns. EARLE-SEARS: SPANBERGER'S PRE-SHUTDOWN 'SILENCE SPEAKS VOLUMES’ AFTER MONTHS OF DOGE SLAMS Spanberger said her stance constitutes \"doubling down on her long record of opposing reproductive rights.\" In that same Winchester Star interview, Earle-Sears pivoted to the economy as Sanders had advised Harris -- lambasting \"unnecessarily aggressive shutdowns that have been sanctioned by this hypocritical [Northam] administration\" at the time. The GOP nominee, a Frederick County business owner, said her company and others like it have endured economic \"assaults on hardworking Virginians.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP Earle-Sears has instead focused on a different social issue than abortion – the continuing prevalence of transgender ideology in some Virginia school districts and counties, including the once-deep-red Prince William plus Fairfax and Loudoun counties. The issue was front-and-center in 2021, and Gov. Glenn Youngkin was credited with successfully harnessing public outrage in otherwise Democratic areas to narrow the margins enough – combined with running up the score in rural, conservative Southside Virginia – to upset Clinton confidant Terry McAuliffe.","summary":"Sen. Bernie Sanders warned Vice President Harris to focus on working class issues over abortion, but Virginia&apos;s Spanberger continues targeting Earle-Sears on reproductive rights.","url":"https://www.foxnews.com/politics/spanberger-defends-abortion-ad-criticizing-sears-after-bernie-warns-against-highlighting-issue","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/abigail-spanberger-falg.jpg","video":"https://www.foxnews.com/video/6380638893112","publish_date":"2025-10-03 19:02:06","author":"Charles Creitz,Emma Colton","authors":["Charles Creitz","Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.158},{"id":365956026,"title":"A by the numbers look at the current Hispanic population in the United States","text":"Hispanic Heritage Month, celebrated from Sept. 15 through October 15, offers the opportunity to recognize and celebrate the contributions of Hispanic cultures in the United States. Hispanic people in the U.S. are becoming one of the nation's fastest growing racial and ethnic groups.\n\nBut this growing community is far from being a monolith. From shifting identities, increasing educational attainment and growing political influence, Hispanic Americans continue to be a major part of the nation's tapestry.\n\nHere's a look at the Hispanic population in the U.S., by the numbers:\n\n More than 68 million \n\nThat's how many people in the U.S. identify as ethnically Hispanic, according to the latest census estimates.\n\n1. Population changes since 2010: https://www.datawrapper.de/_/QnUI1/?v=5\n\n2. Hispanic population across the U.S.: https://www.datawrapper.de/_/gi4Mp/?v=6\n\nHispanic was a term coined by the federal government for people descended from Spanish-speaking cultures. But, being ethnically Hispanic can reflect a diverse array of histories, cultures and national origins.\n\nThere are several other identifiers for Hispanic people, depending largely on personal preference. Mexican Americans, the largest Hispanic subgroup, who grew up during the 1960s Civil Rights era may identify as Chicano. Others may go by their family’s nation of origin, such as Colombian American or Salvadorian American.\n\n3. Top Hispanic subgroups in the US: https://www.datawrapper.de/_/zEVoc/\n\n 31.2 years \n\nThat's the median age of the Hispanic population in the U.S., according to the Census. It's the youngest of all U.S. populations.\n\nIn comparison, the median age for the overall U.S. population is 39.1.\n\n4. Median age by race/ethnicity: https://www.datawrapper.de/_/UUSKs/?v=7\n\nThe increase in the number of Hispanic women earning advanced degrees from 2000 to 2021. The number of Hispanic men accomplishing the same increased by 199% during the same period, according to U.S. Census Bureau data analyzed by the Pew Research Center.\n\n5. Highest level of educational attainment: https://www.datawrapper.de/_/DYw4u/?v=6\n\nAlthough the number of Latinos earning college degrees has increased in the last two decades, they remain underpaid and underrepresented in the workforce compared to their non-Hispanic counterparts, a reality that advocates say can change only when there are more Latinos in positions of power.\n\n6. Median earnings by race and gender: https://www.datawrapper.de/_/HU4K0/?v=6\n\nThe percentage of the U.S. Hispanic population age 5 and older who speak a language other than English at home, according to 2024 census estimates. About 28.7% of them also report speaking English “less than very well.”\n\nUntil recently, the United States had no official language. Today, it is English.\n\nCurrently, there are more than 350 languages spoken in the United States, according to U.S. Census Bureau data. The most widely spoken languages other than English are Spanish, Chinese, Tagalog, Vietnamese and Arabic.\n\n7. Languages spoken in the home: https://www.datawrapper.de/_/wfhRi/?v=3\n\nAccording to AP VoteCast, Hispanics made up about 10% of voters in the 2024 presidential election. Support among Hispanic voters, especially in swing states like Arizona, was an important factor to who would win the election.\n\nGRAPHIC FROM THIS STORY: https://apnews.com/article/young-black-latino-men-trump-economy-jobs-9184ca85b1651f06fd555ab2df7982b5\n\nAbout half of Hispanic voters in the 2024 election identified as Democrats. About 4 in 10 were Republicans and roughly 1 in 10 were independents.\n\nOverall, Hispanic voters were about equally likely to say they have a favorable view of Republican candidate Donald Trump and Democratic candidate Kamala Harris. But there is a gender divide among Hispanic voters on Harris: About 6 in 10 Hispanic women have a somewhat or very favorable opinion of Harris, compared to 45% of Hispanic men.\n\n8. Donald Trump vote share in 2024: https://www.datawrapper.de/_/m5GJd/?v=3\n\n9. Kalama Harris vote share in 2024: https://www.datawrapper.de/_/cGa2k/?v=2\n\nThe number of Hispanic or Latino members serving in the 119th Congress. That shakes out to 10.35% of total membership, according to the official Congress profile.\n\nFor comparison, 40 years ago in the 99th Congress there were only 14 Hispanic or Latino members, and all were male.\n\nSix serve in the Senate and 50 in the House of Representatives, including two delegates and the Resident Commissioner. Of the members of the House, 38 identify as Democrats and 12 as Republican, with 19 women serving.\n\nAt the start of January, there were seven Hispanic US senators. That number decreased to six when then Sen. Marco Rubio resigned to become the Secretary of State. Of the six Hispanic senators, two are Republican and four are Democrats; one is a woman:\n\n1. Sen. Ted Cruz\n\n2. Sen. Catherine Cortez Masto\n\n3. Sen. Alex Padilla\n\n4. Sen. Ben Ray Lujan\n\n5. Sen. Ruben Gallego\n\n6. Sen. Bernie Moreno\n\n10. Non-white representation in Congress: https://www.datawrapper.de/_/cGyQv/\n\nThis year also marked a new record for Latinas in state legislatures. In total, 214 Latinas or 2.9% hold a seat in a state legislature, according to the Center for American Women and Politics. Of the 214 Latinas serving in a state house, 182 are Democrats, 31 are Republican, and one identifies as nonpartisan.\n\nAs of September 2025, Gov. Michelle Lujan Grisham is the only active Latina governor in the U.S. Only two Latinas have been elected governor in U.S. history, and both were in New Mexico.","summary":"More than 68 million people in the United States identify as ethnically Hispanic, making it one the nation’s fastest growing racial or ethnic groups","url":"https://www.independent.co.uk/news/united-states-hispanic-support-democrats-michelle-lujan-grisham-b2839040.html","image":"https://static.independent.co.uk/2025/10/03/19/Latino-Population-Profile_92381.jpg?width=1200","video":null,"publish_date":"2025-10-03 18:37:19","author":"Fernanda Figueroa","authors":["Fernanda Figueroa"],"language":"en","source_country":"gb","sentiment":0.301},{"id":365959436,"title":"Senate to try another funding vote to reopen the government","text":"Oct. 3 (UPI) -- The Senate will vote Friday afternoon on temporary funding measures to end the federal government shutdown on its third day or see it extended into Monday.\n\nSenate Majority Leader John Thune, R-S.D., said the government could reopen as soon as a funding bill is passed.\n\n\"This shutdown needs to end sooner rather than later, and there's only one way out of it,\" Thune said on the Senate floor on Friday, as reported by ABC News.\n\nDemocrats need to vote for the clean, non-partisan continuing resolution sitting right there,\" Thune said. \"All it takes is one roll call vote, [and] the government's back open.\"\n\nThune referenced the continuing resolution that passed the House of Representatives but has not mustered enough support for Senate Democrats to overcome the 60 votes needed to prevent a filibuster.\n\nSenate Democrats John Fetterman of Pennsylvania, Catherine Cortez Masto of Nevada and independent Sen. Angus King Jr., who caucuses with Senate Democrats, have voted to support the House-approved resolution.\n\nSen. Rand Paul, R-Ky., is the lone Republican to vote against the GOP's continuing resolution, which failed, 55-45, on Monday.\n\nWith the GOP controlling 53 Senate seats, it would need all Republican Senators and four more from the Democratic Caucus to join with Fetterman, Masto and King to support the continuing resolution that extends the same funding that was in place a week ago with no changes.\n\nIf approved, the GOP resolution would fund the government for another seven weeks while Congress negotiates a budget for the 2026 fiscal year that began on Wednesday.\n\nSenate Democrats have proposed an alternative bill that would fund the government through Oct. 31 and add $1.5 trillion in spending, including extending Affordable Care Act tax credits and $1 trillion in spending on Medicare.\n\nThat measure failed twice by votes of 47-53 on Monday and Tuesday.\n\nThe Senate has scheduled votes on funding resolutions by the GOP and Senate Democrats on Friday afternoon and will recess afterward, Thune said.\n\nIf both votes fail, Thune said the Senate will adjourn until Monday, which would extend the federal government through the weekend.\n\nMeanwhile, the Trump administration has halted $2.1 billion in federal funding for public transportation infrastructure in Chicago and $18 billion for projects in New York City.\n\nThe Trump administration also canceled $7.5 billion in funding for energy projects in states carried by former Vice President Kamala Harris in the Nov. 5 election.\n\nPresident Donald Trump said his administration also will determine which federal agencies will be defunded and possibly eliminated.","summary":"The Senate will vote Friday afternoon on temporary funding measures to end the federal government shutdown on its third day or see it extended into Monday.","url":"https://www.upi.com/Top_News/US/2025/10/03/government-shutdown/4821759514531/","image":"https://cdnph.upi.com/sv/ph/og/upi/4821759514531/2025/1/d11e55dee9e9a80ee8508e22387710cc/v1.5/Senate-to-try-another-funding-vote-to-reopen-the-government.jpg","video":null,"publish_date":"2025-10-03 18:33:58","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.208},{"id":365955238,"title":"Paramount to buy the Free Press, name Bari Weiss CBS News head","text":"By Hannah Miller, Bloomberg\n\nParamount Skydance Corp. is poised to buy the startup news outlet the Free Press and name its founder, journalist Bari Weiss, as the editor-in-chief of CBS News, according to people familiar with the matter.\n\nThe role will allow Weiss to guide the editorial direction of a news organization whose programs include 60 Minutes and CBS News Sunday Morning. Founded in 1927, CBS News has been home to industry legends such as Walter Cronkite and Edward R. Murrow.\n\nRELATED: Jon Stewart says he could be next after Stephen Colbert’s show is canceled\n\nWeiss will report directly to Paramount Chief Executive Officer David Ellison, according to the people familiar, who asked not to be identified discussing sensitive information. Terms of the sale weren’t immediately known. The New York Times reported that the acquisition would value the Free Press at around $150 million. Paramount and the Free Press didn’t respond to requests for comment.\n\nEllison, the founder of Skydance Media and son of Oracle Corp. billionaire Larry Ellison, oversees a media empire that also includes MTV and Nickelodeon, as well as the company’s namesake Hollywood movie studio, following his takeover of Paramount in August.\n\nCBS has come under criticism from the Trump administration, including a now-settled suit by the president accusing the news division of favoring Kamala Harris in the last election.\n\nFederal regulators approved Ellison’s takeover of Paramount after the new management agreed to ensure programming would embody a diversity of viewpoints from across the political and ideological spectrum. The company named an ombudsman to monitor complaints of news bias.\n\nWeiss has worked at both the Wall Street Journal and New York Times. She left the Times in July 2020, criticizing management for not defending her against alleged bullying by colleagues. She accused her former employer of “unlawful discrimination, hostile work environment, and constructive discharge“ and “caving to the whims of critics on Twitter.\n\nIn an interview with podcaster Joe Rogan she described herself as a “left-leaning centrist.” Publications including Business Insider and the Times of Israel have described her as a conservative.\n\nMore stories like this are available on bloomberg.com\n\n©2025 Bloomberg L.P.","summary":"Weiss will report directly to Paramount Chief Executive Officer David Ellison, according to the people familiar, who asked not to be identified discussing sensitive information.","url":"https://www.mercurynews.com/2025/10/03/paramount-to-buy-the-free-press-name-bari-weiss-cbs-news-head/","image":"https://www.mercurynews.com/wp-content/uploads/2023/06/Media_CBS_Solutions_42427.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-03 18:30:06","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"us","sentiment":0.158},{"id":365949144,"title":"Michelle Obama cites 'quite the journey' with Barack Obama in anniversary message","text":"Former President Barack Obama and Michelle Obama both shared anniversary messages Friday to celebrate 33 years of wedded bliss. Both shared the same image of the couple together on X within a minute of each other. \"The best decision I ever made was marrying you, @MichelleObama,\" the former commander in chief wrote. \"For 33 years, I’ve admired your strength, grace, and determination — and the fact that you look so good doing it all. Happy anniversary!\" KAMALA HARRIS BOOK REVEALS MARITAL RIFT WITH DOUG EMHOFF DURING CAMPAIGN \"We've been on quite the journey over the last 33 years—and yet, I love you even more today than the day we said ‘I do.’ Happy anniversary, @BarackObama! I'm so lucky to go through life with you,\" Michelle Obama wrote. The former first couple has shared several milestones online over the years. In 2023, on the pair's 31st anniversary, the former president, 64, posted a tribute calling his wife \"brilliant, kind, funny and beautiful.\" Michelle Obama, 61, wrote, \"I love going through life with you by my side.\" ASHLEY BIDEN FILES FOR DIVORCE FROM HUSBAND, HOWARD KREIN, AFTER 13 YEARS OF MARRIAGE: REPORTS The pair met in 1989 while they worked together at a Chicago-based law firm. Michelle was assigned to be his mentor to help him adjust as a summer intern. Michelle Obama explained what attracted her to her husband during an August episode of the podcast she shares with her brother, Craig Robinson, IMO. \"The first kind of sparky kind of feeling I felt actually was when I talked to him on the phone, and he had his Barack Obama voice,\" she explained. \"The voice was sexier than the image I had of him. So, I was sort of like, ‘Oh, I didn’t expect this.’ CLICK HERE TO GET THE FOX NEWS APP \"And he was older, so he was self-assured,\" she added. \"So, we had a great conversation, but all I had was a picture, and it wasn't a great picture of him.\" The pair share two daughters, Malia, 27, and Sasha, 24.","summary":"Former President Barack Obama and Michelle Obama celebrated their anniversary with matching social media posts praising each other&apos;s strength and love.","url":"https://www.foxnews.com/politics/united-front-michelle-obama-cites-quite-journey-barack-obama-anniversary-message","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/michelle-obama-barack-anniversary.jpg","video":"https://www.foxnews.com/video/6374907180112","publish_date":"2025-10-03 18:09:02","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","source_country":"US","sentiment":0.39},{"id":365929852,"title":"Taylor Swift eyes new London home as she tires of Trump battles: report","text":"As Taylor Swift has been in the United Kingdom to promote her new album, “The Life of a Showgirl,” she also has reportedly been searching for a new London home to add to her extensive property portfolio, and not just because she’s always had a soft spot for the British capital but because she’s tired of the divisive political landscape in the United States under President Donald Trump.\n\nWhile a source told the Daily Mail that Swift plans to do more tour dates in the U.K., “the battle with President Trump (also) has her exploring her options and looking at different places she’d potentially like to settle down in.” Swift started to become a target of Trump’s ire after she began to speak out in favor of Democratic causes and especially after she endorsed his Democratic opponent, Kamala Harris, in the 2024 election. He notoriously pronounced in an all-caps Truth Social post: “I HATE TAYLOR SWIFT!”\n\nRight-wing trolls followed with their attacks, according to the Daily Mail, which is one reason the “Cancelled” singer chose the U.K. for her 12th album release. “The energy (in the U.K) has been better for her after a year of being attacked by far-right trolls in the U.S.,” the Daily Mail source said.\n\nSwift, like many people, was said to have been left in shock over the Sept. 10 assassination of right-wing activist Charlie Kirk. For her personally, the killing heightened concerns for her own safety, as she has dealt with ongoing issues with hate mail and stalkers, the Daily Mail said.\n\nThose heightened concerns have led to recent incidents of Swift being snuck into NFL stadiums, behind bullet-proof screens, to privately cheer on her fiancé Travis Kelce and his team, the Kansas City Chiefs, the Daily Mail said. Security also was tight during Swift’s recent trip to Santa Barbara to attend the wedding of her good friend Selena Gomez. A source previously told the Daily Mail, “She was targeted by far-right extremist groups after going against Trump and there are legitimate concerns about some of the threats that have been made. They aren’t taking any chances.”\n\nSwift was moreover filled with “a new sense of fear” last summer when her Eras Tour concert dates in Austria had to be canceled after authorities learned they were being targeted for a terrorist attack.\n\nIf Swift sees the U.K. as a refuge and opts to spend more time there, she wouldn’t be the first American celebrity to do so since Trump returned to power in January. The country has become the new home for Ellen DeGeneres, while Ryan Gosling and Eva Mendes are said to be currently living in London’s Notting Hill neighborhood with their children, the Daily Mail said. America Ferrera also has been spotted checking out schools in London after saying she wanted to leave the United States after Trump was elected.\n\nAs with many, the cosmopolitan Notting Hill neighborhood is reportedly a draw for Swift. The Daily Mail reported that her recent search for new London property centered on the neighborhood, which was made famous in the 1999 Julia Roberts-Hugh Grant rom-com.\n\nOf course, Swift is no stranger to the charms of London. She previously lived there from around 2016 until 2023, while she was dating actor Joe Alwyn. During that time, she is believed to have lived in a rented townhouse in posh Primrose Hill, also in north London. Swift and Alwyn also rode out the COVID-19 lockdowns together in the U.K.\n\nSwift paid tribute to London in her 2019 love song, “London Boy,” which name checks many locations and popular cultural activities around the city: Camden Market, Highgate, high tea, the West End and “nights in Brixton.” “I enjoy walking Soho, drinking in the afternoon,” the lyrics go. “You know I love a London boy.”\n\nSwift’s 2023 breakup from Alwyn meant she had to give up on certain “London boy” dreams. Now that she’s engaged to NFL star Kelce, she can’t settle in the U.K., at least not until his season is done or until after he retires. Right now, some of his extracurricular activities outside the NFL are U.S.-focused: He recently opened a steakhouse in Kansas City and he continues to host his popular “New Heights” podcast with his brother, Jason Kelce, who lives in Pennsylvania. Swift also has her U.S. properties: a townhouse and adjacent penthouse units in New York City’s Tribeca neighborhood, her mansion in Beverly Hills, her oceanside estate in Rhode Island and her Greek Revival house in Nashville.\n\n“She’ll always be based in the states, but the U.K. is exciting to her,” the Daily Mail source said. “Europe gave her so much joy when she was recording the album and her friends have noticed that she’s happy when she’s here.”","summary":"Swift has long had a soft spot for London, and she is sick of being attacked by MAGA-backing far-right trolls, a report says.","url":"https://www.mercurynews.com/2025/10/03/taylor-swift-eyes-new-london-home-as-she-tires-of-trump-battles-report/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/SwiftLondon5.jpeg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-03 16:44:45","author":"Martha Ross","authors":["Martha Ross"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.388},{"id":365939722,"title":"'She ain't Mother Mary': Charlie Kirk's shocking Taylor Swift remark resurfaces after his assassination","text":"A day before Charlie Kirk was shot dead in Utah, Taylor Swift and Travis Kelce took the internet by storm by announcing their much-awaited engagement.\n\nCharlie Kirk's assassination stunned the United States but his comments regarding Taylor Swift's life and career did not go down well with the fans. Charlie Kirk's controversial statement on Taylor Swift and Travis Kelce's engagement sparked chaos after his death. and fans are furious. Taylor Swift has however not commented on Charlie's death or his controversial comments about her life. Known for his sharp right-wing commentary, Charlie Kirk's controversial remarks, including pointed criticism of Taylor Swift and her relationship with Kansas City Chiefs star Travis Kelce, is once again under spotlight. The Trump ally once accused Swift of wielding political influence that could sway elections.ALSO READ: Elon Musk's 'cancel Netflix' campaign: From Charlie Kirk’s death to LGBTQ shows, why has Hamish Steele triggered controversyWhat Charlie Kirk said about Taylor SwiftA day before Charlie Kirk was shot dead in Utah, Taylor Swift and Travis Kelce took the internet by storm by announcing their much-awaited engagement. Following this, Charlie made controversial comments about Taylor Swift. The political activist had said, \"This is something I hope will make Taylor Swift more conservative… Submit to your husband, Taylor. You're not in charge.\"Moreover, during a past segment on his radio show, Charlie Kirk even dismissed Swift's cultural power with biting remarks. “Taylor Swift is going to come out in the presidential election and she is going to mobilize her fans. I’ll be nice. And we’re going to be like, oh wow, where did all these young, female voters come from? We better have a plan for that,” he said.Live EventsHe escalated his criticism with a biting jab: “Newsflash, she ain’t Mother Mary.” Kirk went further, arguing that Swift’s following was less about music and more about progressive activism, quipping, “All the Swifties want is swift abortion.”ALSO READ: US-Canada border closure rumours spark confusion: How to track wait time amid government shutdownHis remarks targeted not just Swift’s political stance but also the influence of her fanbase, which has repeatedly shown its ability to mobilize around causes like voter registration. It is pertinent to note that Taylor Swift was vocal about her support to former Vice President Kamala Harris during the 2024 election campaign. She has been outspoken about her support for Democratic candidates and LGBTQ+ rights. She famously endorsed Joe Biden in 2020 and has continued to use her platform to speak on issues such as reproductive rights and voting access.Fans furious at Charlie Kirk for Taylor Swift remarksWhile Taylor Swift remained silent about it, fans are furious at it. A fan by the username @PoliticsxPop wrote, “This is what conservatism has boiled down to: begging women to shrink themselves so fragile men can feel big. Sorry Charlie, Taylor runs stadiums, you can’t even run a good hairline.” Another fan by the username @jojonamers wrote, “Go to college buddy…you’ll feel better about yourself and less likely to feel the need to subjugate women to assuage your fragile ego.”ALSO READ: Elon Musk cancels Netflix: Hamish Steele’s remarks on Charlie Kirk spark outrage. What angered Tesla CEO?A third fan by the username @RichardAngwin posted, “Charlie Kirk's archaic demand for Taylor Swift to 'submit' to her husband exposes his desperate fear of strong women who won't bow to fragile conservative egos.”Another fan by the username @lil_nitelite wrote, “Charlie Kirk brings nothing to the table but his audacity, that is why he wants women to be less than... because he knows he isn't enough.” A fifth fan by the username @debsidoo222 wrote, “As funny as this is..it's still starting to scare me. They are coming after the women. Our rights have already been taken away but there's more they can do. There's always more.”Amid the ongoing controversies, Kansas City Chiefs star Travis Kelce has refrained from weighing in on either Charlie Kirk’s death or his repeated remarks about Taylor Swift. In the meantime, Kirk’s wife, Erika Kirk, has stepped in to lead their organization, Turning Point USA.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontaylor swiftCharlie Kirk assassinationTaylor Swift controversyTravis Kelce engagementTaylor Swift political influenceTurning Point USAcharlie kirkcharlie kirk on taylor swiftcharlie kirk remark taylor swiftcharlie kirk controversy\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontaylor swiftCharlie Kirk assassinationTaylor Swift controversyTravis Kelce engagementTaylor Swift political influenceTurning Point USAcharlie kirkcharlie kirk on taylor swiftcharlie kirk remark taylor swiftcharlie kirk controversy(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Charlie Kirk's assassination has stunned the US, yet his controversial remarks about Taylor Swift and Travis Kelce's engagement are now fueling widespread outrage. A day before his death, Kirk publicly told Swift to \"submit to your husband,\" also dismissing her influence and linking her fanbase to \"swift abortion.\" Fans are furious at his misogynistic comments, though Swift remains silent.","url":"https://economictimes.indiatimes.com/news/international/global-trends/us-news-she-aint-mother-mary-charlie-kirks-shocking-taylor-swift-remark-resurfaces-after-his-assassination/articleshow/124294768.cms","image":"https://img.etimg.com/thumb/msid-124294877,width-1200,height-630,imgsize-1341686,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-03 16:16:33","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"entertainment","source_country":"in","sentiment":0.176},{"id":365916496,"title":"West Wing ‘weenie-wokers’ controlled Biden: Book","text":"According to Sen. John Kennedy (R-LA), it was Biden’s long-serving B-team.\n\n“In Washington, you’re only as good as the people around you. And Joe Biden’s staff, filled as it was with tofu-eating woke-arati, who were convinced of their superior intellect and values, did plenty,” Kennedy wrote in the forthcoming book, How to Test Negative for Stupid: And Why Washington Never Will.\n\nIn his book, out Tuesday, the influential senator known for his comical analysis of key political figures offered a damning takedown of Biden’s staff as liberal “weenie-wokers” out of touch with everyday Americans.\n\nWith phrases that live up to his reputation as Washington’s most quotable senator since the late Sen. Alan Simpson (R-WY), Kennedy indicated that Biden was doomed from the start because of those around him.\n\n“Inside them were neosocialists just begging to get out. They were bizarre. They were one-dimensional. They said the word existential a lot. They were moral snobs. Their attitude seemed to be that everything in America is poisoned and everything in America needs to change. And they, with their infallible instincts, believed they were just the ones to change it,” he wrote in the book published by Broadside Books, part of HarperCollins Publishers.\n\nKennedy saw many of those aides up close, having spent time with Biden in the White House despite his criticism of the president.\n\nWhat he witnessed were stereotypical Washington liberals, according to excerpts provided to Washington Secrets.\n\n“I’ve always preferred the term weenie-wokers. I believe this more precisely captures just how aggressive and prissy many of them were,” he wrote.\n\n“Many lived in Georgetown condos with high ceilings and important art on the walls. They have summer homes with long driveways. In their NPR totebags, they carried around Ziploc bags of kale to give them energy. (To me, kale tastes like I’d rather be fat. I think the best way to prepare it is with olive oil; that way, it slides more easily off the plate and into the garbage can),” he wrote.\n\nTwo of Biden’s top national security aides got special attention from Kennedy as he hit the Democrats’ wimpy foreign policy.\n\n“A telling example,” he wrote, “is Jake Sullivan, Biden’s national security advisor. He and Secretary of State Antony Blinken strained not to offend anyone, including our enemies. They believed exclusively in diplomacy — that a hug and a cup of hot cocoa could solve any problem in, say, the Middle East. ‘Love is the answer at any cost’ was their mantra, even with hard men like Putin, Xi Jinping, and Iran’s ayatollah, who want to kill us and hurt us the entire time we’re dying.”\n\nJust as they captured Biden’s autopen, Kennedy said White House staff controlled Biden’s words. “One should not underestimate their influence on the president,” he wrote, adding, “the American people saw what you and I saw. Many times, constituents in Louisiana asked me who the real president was. ‘Whoever is in charge of the teleprompter,’ I would reply.”\n\nA strong supporter of President Donald Trump, Kennedy said that he had faith that the public would eventually grow tired of Biden and his team for pushing woke politics, including approving men competing as women in college sports.\n\n“I was always pretty sure during these years that the American people would eventually reject this baloney blizzard,” he wrote in the chapter titled “Holding the line.”\n\nHe wrote, “I was pretty sure they would get tired of being told they had to hate George Washington, Thomas Jefferson, Abraham Lincoln, Dr. Seuss, and Mr. Potato Head because they were racist. This stuff might have been acceptable in Washington, D.C., but it was not normal to the majority of Americans.”\n\nSEE THE LATEST POLITICAL NEWS AND BUZZ FROM WASHINGTON SECRETS\n\nAnd, he added, fighting Biden and his staff became one of his jobs in the Senate until the 2024 election, though hope the public would reject Biden and his hand-picked successor, then-Vice President Kamala Harris, wasn’t enough. “That didn’t mean I could just sit around, work on my bills, and do nothing until we got either a Republican in the White House or a Republican Congress. That’s just not me. So I raised every variety of hell I could think of,” he explained.","summary":"Forget the theories that former first lady Jill Biden was the iron fist behind her husband, former President Joe Biden. Ditto for the controlling hand of bumbling first son Hunter. And throw in former President Barack Obama, too. That’s because we have a new book from a Washington insider who thinks he’s nailed who steered [&#8230;]","url":"https://www.washingtonexaminer.com/news/washington-secrets/3835848/john-kennedy-book-biden-presidency/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP23138354347867.jpg?w=696","video":null,"publish_date":"2025-10-03 15:08:17","author":"Paul Bedard","authors":["Paul Bedard"],"language":"en","source_country":"US","sentiment":-0.263},{"id":365893962,"title":"Leaked doc reveals the chaotic politics behind Trump Energy Department cuts","text":"This week, the Department of Energy canceled nearly $8 billion worth of awards — a move touted by the Trump administration as an effort to protect fossil fuels at the expense of renewables. But documents obtained by TechCrunch show that the reality is more complex than that simple message.\n\nThe agency has not released a list of the cancelled awards, but TechCrunch has obtained a copy and has analyzed the 321 contracts that the DOE is seeking to undo.\n\nNot all projects focused on renewable energy, though. \n\nTwo listed in the document, one for $300 million to Colorado State University and another for $210 million to the Gas Technology Institute, would have helped oil and gas producers large and small reduce methane emissions from their wells.\n\nThe Gas Technology Institute is a research and development organization that mostly caters to the natural gas industry. The group had a dozen awards canceled, according to the document, totaling $417 million.\n\nCarbon capture and removal also took a hit, with 10 of the 21 projects canceled totaling around $200 million. Many are in Harris-voting states, though that rubric doesn’t explain the entire picture. \n\n“Three categories are popping up,” Erin Burns, executive director at Carbon180, told TechCrunch. “Where are they located? Who are the partners in it? Were these projects going to move forward?”\n\nIt’s true that states which voted for Kamala Harris in the last presidential election were hit hardest by the move. California lost the most, with at least $2.2 billion worth of contracts cancelled. Colorado, Illinois, Massachusetts, Minnesota, and Oregon each have around half a billion dollars worth of awards that were killed, with New York State losing at least $309 million.\n\nThose that voted for Trump tended to have contracts canceled worth single-digit millions of dollars.\n\nOne of the largest awards canceled was granted to the state of Minnesota for $467 million. Awarded as part of the Bipartisan Infrastructure Law in 2021, the money was intended to revamp electrical grid interconnections throughout seven states in the Midwest. When complete, it would have unlocked around 28 gigawatts of new generating capacity, mostly solar and wind. For context, the world’s data center fleet draws 58 gigawatts, according to Goldman Sachs.\n\nAnother worth $630 million would have likewise revamped California’s electrical grid, testing advanced conductors and dynamic line rating devices to increase transmission capacity. The project effectively would have been a showcase for grid modernization that could be applied throughout the country.\n\nYet another grid modernization project would have installed a transmission line to the Confederated Tribes of Warm Springs in Oregon. The tribes have roughly half a dozen renewable projects waiting on a better grid connection, which the now-canceled $250 million award would have enabled. The project would also have strung fiber-optic lines along the transmission line’s path, bringing high-speed data to a rural part of the state.\n\n“The recipients who have survived in blue states are perhaps more aligned with the administration and participating in industries that are more of a priority for this administration,” said Courtni Holness, managing policy advisor at Carbon180.\n\nSome of the smaller awards might have been nixed anyway. “That’s just how the US approaches energy innovation in general,” Burns said. “Take a lot of shots on goal because you’re not sure what’s going to move forward regionally, technologically, economically. And so you take a bunch of shots on goal at a lower cost.”\n\nStill others appear to be pulling up stakes to move where government support and policies are going to be more predictable, like Canada. “You’re going to see more of that, and it’s having impact on private sector investments,” Burns said.\n\n“I think it’s a bigger question,” Holness added, “about the stability of our Department of Energy and their ability to be a partner to U.S. businesses and have some form of predictability.”","summary":"Harris-voting states were hit hardest by Department of Energy award cancellations, but not every blue-state project was cut. Politics might play a role.","url":"https://techcrunch.com/2025/10/03/leaked-doc-reveals-the-chaotic-politics-behind-trump-energy-department-cuts/","image":"https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2205749899.jpeg?resize=1200,800","video":null,"publish_date":"2025-10-03 15:04:58","author":"Tim De Chant","authors":["Tim De Chant"],"language":"en","category":"politics","source_country":"us","sentiment":-0.106},{"id":365905732,"title":"Trump freezes billions in infrastructure funding to Chicago, New York","text":"Oct. 3 (UPI) -- The President Donald Trump administration is withholding billions of dollars in funding from Chicago and New York transportation infrastructure funding.\n\nOffice of Management and Budget Director Russell Vought announced on X that $2.1 billion was being frozen that had been allocated to Chicago for its Red and Purple (train lines) Modernization Project \"to ensure funding is not flowing via race-based contracting.\"\n\nThe U.S. Department of Transportation Friday morning said, \"This week, USDOT issued an interim final rule barring race- and sex-based contracting requirements from federal grants.\"\n\n\"To continue implementation of this rule, USDOT today sent letters to the Chicago Transit Authority (CTA) to inform them that two projects - the CTA Red Line Extension and the CTA Red and Purple Modernization Program - are also under administrative review to determine whether any unconstitutional practices are occurring,\" the DOT said. \"The remaining federal funding for both projects total $2.1 billion.\"\n\nVought also announced Wednesday that the administration is freezing about $18 billion for infrastructure in New York City. The Hudson Tunnel Project is the main project suffering a funding freeze. The project helps connect New Jersey and New York, and the Second Avenue subway.\n\nLater, the administration announced it was canceling $7.5 billion in funding for energy projects in states that voted for Vice President Kamala Harris in the 2024 election.\n\nOn Thursday, Trump said on Truth Social that he would meet with Vought to determine which \"Democrat agencies\" to cut.\n\n\"I have a meeting today with Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent,\" Trump wrote.","summary":"The President Donald Trump administration is withholding billions of dollars in funding from Chicago and New York transportation infrastructure funding.","url":"https://www.upi.com/Top_News/US/2025/10/03/trump-freeze-billions-chicago-new-york-infrastructure/8171759502646/","image":"https://cdnph.upi.com/sv/ph/og/upi/8171759502646/2025/1/79e364a8220d7b4fcbccf915b1360d2c/v1.5/Trump-freezes-billions-in-infrastructure-funding-to-Chicago-New-York.jpg","video":null,"publish_date":"2025-10-03 14:57:57","author":"Lisa Hornung","authors":["Lisa Hornung"],"language":"en","source_country":"US","sentiment":-0.348},{"id":365896096,"title":"Trump cancels billions in clean energy grants as $2,200,000,000 solar farm in California announces closure","text":"The Trump administration is canceling almost $8 billion in grants that supported hundreds of clean energy projects in 16 states.\n\nThe affected states just so happen to have voted for Democrat Kamala Harris in last year’s presidential election.\n\nThe move comes as Donald Trump threatens deep cuts in his fight with congressional Democrats over the government shutdown.\n\nThe shutdown is down to Republicans and Democrats not being able to agree on passing a bill funding government services into October and onwards. As a result, non-essential functions of government have been frozen as these agencies are dependent on funding being approved in Congress. The shutdown came into force on Wednesday (October 1) and, as of October 3, it remains closed.\n\nOne government agency that is still running is The Energy Department, and in a new statement in issued in recent days, it was announced that 223 clean energy projects were terminated after a review determined they did not adequately advance the nation’s energy needs or were not economically viable.\n\nOfficials did not provide details about which projects are being cut, but they said funding came from the Office of Clean Energy Demonstrations, Office of Energy Efficiency and Renewable Energy, and other Energy Department bureaux.\n\nThe cuts are likely to affect battery plants, hydrogen technology projects, upgrades to the electric grid and carbon-capture efforts, among many others, according to the environmental nonprofit Natural Resources Defence Council.\n\nThe news of the government cutting back on clean energy projects comes as it was recently revealed that Ivanpah Solar Power Facility in California will be shut down in the not-so-distant future.\n\nThe solar farm cost an eye-watering $2.2 billion to build but it will be switched off for good next year after failing to meet its energy targets.\n\n$1.6 billion of the money came from then-President Barack Obama's Department of Energy.\n\nIn light of the solar farm closing its doors years earlier than planned, many people have branded the project as a waste of taxpayer money.\n\n\"It another left-wing taxpayer-funded boondoggle turns out to be a useless waste of money,\" somebody fumed online.\n\nA second added: \"Both a waste of money and an environmental disaster that will take decades to clean up.\"\n\nAway from the money, other critics said the farm was doing more harm than good for the environment, noting that birds would fly into the direct sunlight and 'burst into flames', said Science Alert in 2016. Reportedly, as many as 6,000 birds died each year.","summary":"![CDATA[The Trump administration is canceling $7,600,000,000 in grants]]","url":"https://www.unilad.com/news/us-news/trump-cancels-clean-energy-grants-040304-20251003","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blt5b1ec11e7eb8f01a/68dfdf0db86e17478cb01e13/trump-cancels-billions-clean-energy-grants.png","video":null,"publish_date":"2025-10-03 14:54:54","author":"Niamh Shackleton","authors":["Niamh Shackleton"],"language":"en","source_country":"gb","sentiment":-0.678},{"id":365939030,"title":"Watch MSNBC Anchor Cut Off Mike Johnson With A Bruising Fact-Check","text":"MSNBC’s Ana Cabrera cut into Speaker Mike Johnson’s press conference on Thursday to correct his claim that Democrats seek free health insurance for undocumented immigrants. (Watch the video below.)\n\nParroting the GOP’s wildly misleading assertion about the Democrats’ intent while negotiating an end to the government shutdown, Johnson said:\n\nPolitics: Melania Trump Shares Bafflingly Strange ‘Into The Future’ Video\n\n“They say that we’re making this up — this illegal aliens receiving taxpayer benefits. It’s a talking point, they said. I want to remind you of a couple of key facts. Everybody can remember, I think, back to 2020, in the presidential debate for all the candidates on the Democrat side. You might remember, famously, they were asked the question — raise your hand, they said on the stage — if you believe that illegal aliens should receive health care paid for by American taxpayers.”\n\nThe Louisiana Republican continued by saying, “Every single one of them raised their hand to great applause in the audience from the Democrats who were there.” He then added, “Those hands includedJoe Bidenand Kamala Harris. Now, what did they do? Did they follow through on that promise? Yeah, they absolutely did. Joe Biden used executive orders, and he expanded benefits ― health care to illegal aliens ― in his four-year term. That was an outrageous violation of the existing federal law.”\n\nThen Cabrera chimed in with a swift fact check.\n\n“OK, I want to pull out just to make sure we don’t offer misleading information when it comes to what the facts are and what the laws are,” she said. “I can tell you that U.S. law prohibits undocumented immigrants from gaining federally subsidized health care, whether that’s Medicaid, Affordable Care Act, Children’s Health Insurance Program, or otherwise. It’s actually a 1996 law that establishes that, and the Democrats aren’t looking to change that law.”\n\nShe went on to say, “And as far as the Affordable Care Act subsidies, there is no access for undocumented immigrants to get Obamacare. That’s just the fact right now.”\n\nRepublicans keep falsely asserting that Democrats voted against a measure to keep government services going because they want free health care for “illegal aliens.”\n\nDemocratic negotiations call for undoing GOP Medicaid cuts and extending subsidies for Americans who buy Obamacare insurance.\n\nThe video Johnson referred to was a 2019 debate and has nothing to do with the stalemate. That clip is also misleading. The moderator, Savannah Guthrie, did not ask if the coverage for undocumented immigrants would be free. The two who answered the question, eventual nominee Joe Biden and Pete Buttigieg, did not say the health coverage would be free either. According to the Poynter Institute’s PolitiFact, they both mentioned how immigrants would pay into the system through taxes.\n\nRead the original on HuffPost","url":"https://www.yahoo.com/news/articles/watch-msnbc-anchor-cut-off-140825225.html","image":"https://media.zenfs.com/en/the_huffington_post_584/51062fc8efc32802eb3d74bff47a673a","video":null,"publish_date":"2025-10-03 14:08:25","author":"Ron Dicker","authors":["Ron Dicker"],"language":"en","source_country":"us","sentiment":-0.23},{"id":365894678,"title":"Joy Reid Has Explosive Two-Word Retort For Trump VP Vance Seconds After Hearing His Attack On Her","text":"TOMMY CHRISTOPHER: “You’d be a much happier person if you showed a little gratitude.”\n\nThat’s him talking right to you.\n\nJOY-ANN REID: So I will start by saying, JD Vance, since you’re paying attention to me: F–k you!\n\nTOMMY CHRISTOPHER: Whoa!\n\nJOY-ANN REID: And I say that on behalf of every Black woman who heard you call Kamala Devi Harris “the trash.”\n\nYou calling a woman whose mother came to this country to do cancer research and to try to cure cancer. Who lost her mother not that many years ago, whose mother is the same exact racial identity as your wife.\n\nThe fact that you would stand in front of a crowd of mainly White MAGAs and call that woman who was the vice president of the United States, the highest elected female politician, political official in our nation’s history, call her “the trash” four days before the election?\n\nLike, f–k you, forever!\n\nThere’s nothing you could ever say that I would take as advice, friendly or otherwise. I don’t need advice from you. You need to learn how to be a decent human being and you need to apologize to Kamala Harris for what you said. So let’s start with that.\n\nThe second thing is: JD Vance, I did not say that my mother said this country was not a land of opportunity for people like us. You need go back and listen to the interview.\n\nWhat I probably said, I would have to pull up the interview, but what I will say again is that my mother came to this country as an immigrant. And believed in the sales pitch of what America says that it is, that it calls itself this sort of land of opportunity.\n\nBut what happens is if you are Black, you immediately come here and it isn’t long before you are treated the same way that America treats all of its Black citizens, as second class citizens, as people who need to, quote unquote, be grateful for White people apparently giving them opportunity.\n\nSee, in your statement, you forget the part that you believe for yourself, that White people earn their opportunities, that they create opportunity, that when they get a good job or get a big house or get a good salary, it’s because they earned it.\n\nYou, because you are a racist a–hole, believe that Black people are given opportunity by White people.\n\nSo you can’t accept that my mother, who became a PhD holding college professor, earned her opportunity to be a professor.\n\nYou think that someone White gave her that opportunity or that she stole it from, or, you know, Charlie Kirk’s version is she stole from somebody White.","url":"https://www.yahoo.com/news/articles/joy-reid-explosive-two-word-135750160.html","image":"https://s.yimg.com/ny/api/res/1.2/Qij_yt0zDFD.Szo7n9A7og--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xMjU2O2NmPXdlYnA-/https://media.zenfs.com/en/mediaite_845/74a342d7677ab1e5056543341f4f2b59","video":null,"publish_date":"2025-10-03 13:57:50","author":"Mediaite","authors":["Mediaite"],"language":"en","category":"politics","source_country":"us","sentiment":-0.145},{"id":365929594,"title":"Who Is Taylor Swift's \"Cancelled!\" About? 2 Theories","text":"The Life of a Showgirl is here, and fans are already putting its lyrics under the microscope. The album’s 10th track —“CANCELLED!” — has sparked a lot of debate about fans, in particular. In the song, Swift sings about sticking close to her group of disgraced friends — listeners just aren’t sure *which* cancelled bestie she’s discussing.\n\nThe song leaves the cancelled figure unnamed — plus, her so-called crimes are very vague. “Did you girlboss too close to the sun? / Did they catch you having far too much fun?” Swift questions. Later, she sings, “ Good thing I like my friends cancelled (Cancelled) / I like 'em cloaked in Gucci and in scandal ... At least you know exactly who your friends are / They're the ones with matching scars.”\n\nSwift has some experience getting cancelled — back in 2016, the phrase, “Taylor Swift is over party,” trended on Twitter in the aftermath of Kim Kardashian leaking an edited portion of Swift’s conversation with Kanye West about his song, “Famous.” Nearly a decade later, it seems like Swift is still feeling that wound — and she likes friends who can relate.\n\nBut who, specifically, is she singing about in the Life of a Showgirl song? Fans have two prevailing theories about the mysterious figure — they think it’s either about Blake Lively and Brittany Mahomes.\n\nThe Blake Lively Theory\n\nLively and Swift have been friends for years (and Swift is even godmother to Lively’s children), but the current status of their friendship is in question. In January, Swift was brought into Lively’s legal battle with her It Ends With Us co-star and director Justin Baldoni, and they haven’t been spotted together since.\n\nMany Swifties think that Swift ended the friendship over this controversy, but if “CANCELLED!” is about Lively, the lyrics seem to contradict rumors of a bestie breakup. In the song, Swift is sticking by her people — regardless of reputations.\n\nFans think that Swift is addressing those who assume she distanced herself from Lively because the actor got “cancelled” — and essentially saying that there’s nothing like a villain arc to bring two famous women together.\n\nThe Brittany Mahomes Theory\n\nMahomes and Swift became friends in 2023, when Swift started dating Travis Kelce. Since then, the duo has spent a lot of time together — whether it’s sitting together at a Chiefs game or celebrating Mahomes’ 30th birthday in Nashville.\n\nMahomes has encountered her fair share of cancellations. In January 2022, she sprayed fans with champagne to celebrate a Chiefs win — but people online criticized her for dousing unknowing fans in the middle of the cold winter. Mahomes also seems to have different political views than Swift, who publicly endorsed Kamala Harris for president.\n\nDespite some backlash from fans about the friendship, however, Swift and Mahomes still seem close. Fans think “CANCELLED!” could be a direct response to those criticizing that connection — and a sign that Swift has no intention of leaving her friend behind.","summary":"Fans have two prevailing theories about who Taylor Swift is singing about in &quot;CANCELLED!&quot; on 'Life of a Showgirl.' Here's how they narrowed it down.","url":"https://www.elitedaily.com/entertainment/taylor-swift-cancelled-fan-theories","image":"https://imgix.bustle.com/uploads/image/2025/10/3/4250cd42/las-vegas-nevada-february.jpeg?w=1200&h=675&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4667&fp-y=0.4291","video":null,"publish_date":"2025-10-03 13:37:44","author":"Hannah Kerns","authors":["Hannah Kerns"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.142},{"id":365896092,"title":"'Project 2025' explained as Trump reveals bombshell 'meeting' despite claiming to not be involved","text":"Donald Trump has announced a meeting with a Project 2025 'architect' despite spending much of 2024 attempting to distance himself from the document.\n\nAs of this week, the 79-year-old is seemingly embracing the controversial conservative blueprint that both his 2024 presidential campaign opponent Kamala Harris and his predecessor, former President Joe Biden, have previously condemned.\n\nPreviously, Trump has denounced Project 2025 in the past, going as far as to say its contents were ‘ridiculous and abysmal’. However, it appears the tide has changed as he prepares for a meeting with one of its writers.\n\nBelow, we’ve outlined everything you need to know about the political legislation, as well as what Democrats think of it.\n\nWhat is Project 2025?\n\nProject 2025 is a right-wing wish list; a product of the Heritage Foundation, a research and educational institution based in Washington.\n\nThe 900-page document, which has been described as a conservative blueprint, is essentially a proposal to restructure the federal government and punish Democratic states, as per the Associated Press.\n\nIt was drafted by many of President Trump's longtime allies, as well as current and former administration officials, including CIA Director John Ratcliffe and Brendan Carr, Chairman of the Federal Communications Commission.\n\nSome of the polices outlined in its pages tackle immigration, dismantling certain federal agencies, banning pornography, and withdrawing approval for abortion medication.\n\nWhat did Trump previously say about Project 2025?\n\nTrump spent a chunk of last year condemning and distancing himself from Project 2025. In July 2024, he insisted that he knew ‘nothing’ about the document's contents and that he had ‘no idea’ who was behind it.\n\n“I disagree with some of the things they’re saying, and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them,” he said. \n\nThe former businessman’s campaign chiefs were equally as critical, with Susie Wiles and Chris LaCivita claiming reports of Project 2025’s demise ‘would be greatly welcomed’.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” they wrote in a campaign memo, as per ABC News.\n\n“Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nWhat is Trump saying now about Project 2025?\n\nDespite previous misgivings, the 47th POTUS has apparently embraced plans laid out in Project 2025. \n\nThese include efforts such as the Department of Government Efficiency (DOGE), which Elon Musk previously headed, as well as budget recession packages.\n\nOn Thursday (October 2), the father-of-five officially aligned himself with Project 2025, revealing that a meeting with his budget chief, Russ Vought, was going ahead.\n\nThe Director of the United States Office of Management and Budget is described as the ‘architect’ of the right-wing paper.\n\n\"Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent,” Trump wrote via Truth Social.\n\n“I can’t believe the Radical Left Democrats gave me this unprecedented opportunity. They are not stupid people, so maybe this is their way of wanting to, quietly and quickly, MAKE AMERICA GREAT AGAIN!”\n\nWhen asked about Trump’s reversal, White House spokesperson","summary":"![CDATA[Former Vice President Kamala Harris has since responded to the news with a scathing remark]]","url":"https://www.unilad.com/news/politics/donald-trump-project-2025-meeting-explained-377457-20251003","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blt27e2691fb217fec1/68dfb6d81764e9217665b0c6/project-2025-explained-trump-meeting.png","video":null,"publish_date":"2025-10-03 12:59:53","author":"Ella Scott","authors":["Ella Scott"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.069},{"id":365896094,"title":"White House adds Jane Fonda to expanding list of celebrity targets with scathing message","text":"Jane Fonda has revived an activist group from the Cold War era that was backed by her father and fellow Oscar winner Henry Fonda.\n\nFree speech has been a huge topic of debate in America of late in the wake of ABC briefly suspending Jimmy Kimmel for remarks he made on his show about Donald Trump and the late Charlie Kirk.\n\nDozens of celebrities condemned the network's decision and the likes of Stephen Colbert expressed concerns about censorship.\n\nWhile Kimmel has since been reinstated, the fears about Americans' free speech remains a hot topic.\n\nWith this in mind, Grace and Frankie actress Fonda has launched a 21st century incarnation of the Committee for the First Amendment.\n\nIt was originally formed in 1947 in response to Congressional hearings aimed against screenwriters and directors and their alleged Communist ties.\n\n\"The federal government is once again engaged in a coordinated campaign to silence critics in the government, the media, the judiciary, academia, and the entertainment industry,\" the committee’s mission statement reads in part, as per PA.\n\n\"We refuse to stand by and let that happen. Free speech and free expression are the inalienable rights of every American of all backgrounds and political beliefs – no matter how liberal or conservative you may be.\n\n\"The ability to criticize, question, protest, and even mock those in power is foundational to what America has always aspired to be.\"\n\nSigners of the new organisation’s mission statement include Florence Pugh, Sean Penn, Billie Eilish, Pedro Pascal and hundreds of others.\n\nElsewhere Fonda, 87, said we're living 'in a very chilling time'.\n\n\"This is a very chilling time. You know, we’ve faced attempts at autocracy before in the ’20s and ’30s, and you’ve cited the example of McCarthyism,\" she said on CNN.\n\nFonda went on: \"There was Jim Crow. This is different, and we should all be very scared, and the key is solidarity.\"\n\nThe White House has since responded to the committee's revival and Fonda's comments.\n\n\"Hanoi Jane is free to share whatever bad opinions she wants,\" a White House spokesperson said per MSNBC.\n\n\"As someone who actually knows what it’s like to be censored, President Trump is a strong supporter of free speech and Democrat allegations to the contrary are so false, they’re laughable.\"\n\nFonda joins the likes of Beyoncé and Oprah Winfrey in being in Trump's bad books. The president alleges the celebrities were payed by the Democrats to endorse Kamala Harris during her 2024 campaign — something the political party has denied.","summary":"![CDATA[The actress has ruffled Republicans' feathers of late]]","url":"https://www.unilad.com/celebrity/news/jane-fonda-white-house-first-amendment-committee-298509-20251003","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blt2c0bbe31836ccb11/68dfc1c7ec8e8ee82dd34c92/jane-fonda-white-house.png","video":null,"publish_date":"2025-10-03 12:55:36","author":"Niamh Shackleton","authors":["Niamh Shackleton"],"language":"en","source_country":"gb","sentiment":0.467},{"id":365863118,"title":"Trump administration puts on hold $2.1 billion in Chicago infrastructure projects, Vought says","text":"The Trump administration has put on hold $2.1 billion in Chicago infrastructure projects, primarily two efforts to improve the city's transit system, Office of Management and Budget Director Russell Vought said Friday.\n\nVought's announcement on the third day of the U.S. government shutdown comes on the heels of two other moves by the Trump administration targeting funding in cities and states led by Democrats.\n\nPresident Donald Trump and Republican lawmakers have blamed Democrats in Congress for the shutdown, and Trump said Thursday that the shutdown had given him an \"unprecedented opportunity\" to cut what he called \"Democrat Agencies.\"\n\nVought on Wednesday first revealed that the Department of Transportation was freezing $18 billion in federal funding for two major infrastructure projects in New York City. Like the Chicago funding freeze, Vought and the DOT claim that the reason for the freeze in New York funds is to ensure the the money is not being used to pay for race-based contracting.\n\nLater that same day, Vought said that the Department of Energy had cancelled nearly $8 billion in funding for climate-related projects and other efforts in 16 states, all of which were won by Democratic presidential nominee Kamala Harris in the 2024 election.\n\nOn Friday, Vought in a post on X wrote, \"$2.1 billion in Chicago infrastructure projects--specifically the Red Line Extension and the Red and Purple Modernization Project--have been put on hold to ensure funding is not flowing via race-based contracting.\"\n\n\"More info to come soon from @USDOT,\" Vought added, referring to the Department of Transportation.","summary":"The move came on the third day of the federal government shutdown, which President Donald Trump has blamed on Democrats in Congress.","url":"https://www.cnbc.com/2025/10/03/trump-chicago-infrastructure-shutdown-vought.html","image":"https://image.cnbcfm.com/api/v1/image/108206658-1759344508737-gettyimages-2232913864-MEI-USA-DG-NCCWS-20250903-005.jpeg?v=1759344532","video":null,"publish_date":"2025-10-03 12:35:16","author":"Dan Mangan","authors":["Dan Mangan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.766},{"id":365857590,"title":"Harris admits campaign planned champagne, cupcakes, chief of staff for 2024 victory that never came","text":"Former Vice President Kamala Harris revealed in her new book, \"107 Days,\" that she had quietly tapped Denis McDonough as her choice for chief of staff in the event she won the 2024 presidential election. While Harris admitted that 107 days \"were not, in the end, long enough to accomplish the task of winning the presidency,\" her memoir revealed that White House transition plans were already in motion for her to assume the presidency. \"We'd planned for everything, it seemed, except the actual result,\" Harris wrote. Harris said she decided in early October 2024 that McDonough would be her chief of staff and disclosed in the book that he had already accepted the offer more than a month before Election Day. KAMALA HARRIS BOOK REVEALS MARITAL RIFT WITH DOUG EMHOFF DURING CAMPAIGN The former vice president described McDonough as a \"deeply caring man who doesn't mince words,\" and said she knew he would \"run a productive and disciplined West Wing.\" KAMALA HARRIS PLAYS UP COZY RELATIONSHIP WITH HILLARY CLINTON AS WEDGE WITH BIDEN WIDENS \"Denis McDonough had been Barack Obama’s chief of staff in his second term, chief of staff at the National Security Council before that, and had served as secretary of Veterans Affairs in our administration,\" Harris wrote in the book. McDonough had most recently served as Secretary of Veteran Affairs for President Joe Biden's administration. He was chief of staff to former President Barack Obama from Feb. 2013 to Jan. 2017. McDonough also served as Principal Deputy National Security Advisor from Oct. 2010 to Jan. 2013. \"One of the first public events I did as VP was with Denis. It was the height of COVID. He and his wife, Karin, and Doug and I took heart-shaped cookies to the nurses at the VA hospital on Valentine's Day. The son of Irish immigrants, one of eleven children, he taught school in Belize before coming to work in government,\" Harris wrote of McDonough. The final chapters of Harris' memoir detailed her disbelief as the election results rolled in. Harris said her team had planned for \"all kinds of contingencies,\" including that \"Trump might win Pennsylvania and claim premature victory, that we might win narrowly and Trump’s supporters would react with violent rejection of the result, that the count might drag on for days.\" But Harris said they didn't expect to lose. Harris described in the book how her social secretary, Storm Horncastle, had ordered champagne and specially decorated cupcakes. CLICK HERE TO GET THE FOX NEWS APP \"She quietly went to the kitchen and hid all signs of celebratory preparation. She painstakingly peeled icing that read ‘Madame President’ off the top of each cupcake. Having converted them to innocuous comfort food, she sent them out, along with more wine, in case people needed it,\" Harris recalled in the book. President Donald Trump ultimately defeated Harris in the 2024 presidential election, securing 312 electoral votes to Harris’ 226. Her 107-day campaign was the shortest presidential campaign in modern history after Biden dropped out of the race on July 21, 2024. McDonough did not immediately respond to Fox News Digital's request for comment.","summary":"Former Vice President Kamala Harris&apos; new book, &quot;107 Days,&quot; revealed she chose Denis McDonough to lead her White House team had she won the 2024 presidential election.","url":"https://www.foxnews.com/politics/harris-admits-campaign-planned-champagne-cupcakes-chief-staff-2024-victory-never-came","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/01/harris-speech.jpg","video":"https://www.foxnews.com/video/6380063841112","publish_date":"2025-10-03 12:30:23","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","category":"politics","source_country":"US","sentiment":0.023},{"id":365847402,"title":"Trump cancels billions in clean energy grants","text":"The Trump administration is cancelling 7.6 billion dollars (£5.6 billion) in grants that supported hundreds of clean energy projects in 16 states, all of which voted for Democrat Kamala Harris in last year’s presidential election.\n\nThe move comes as Mr Trump threatens deep cuts in his fight with congressional Democrats over the government shutdown.\n\nThe Energy Department said in a statement on Thursday that 223 projects were terminated after a review determined they did not adequately advance the nation’s energy needs or were not economically viable.\n\nOfficials did not provide details about which projects are being cut, but said funding came from the Office of Clean Energy Demonstrations, Office of Energy Efficiency and Renewable Energy, and other Energy Department bureaux.\n\nThe cuts are likely to affect battery plants, hydrogen technology projects, upgrades to the electric grid and carbon-capture efforts, among many others, according to the environmental nonprofit Natural Resources Defence Council.\n\nWhite House budget director Russ Vought said the Trump administration will also withhold 2.1 billion dollars (£1.5 billion) for Chicago infrastructure projects, expanding the funding fights that have targeted Democratic areas during the government shutdown.\n\nThe pause affects a long-awaited plan to extend the city’s Red Line train. Mr Vought wrote on social media on Friday that the money was “put on hold to ensure funding is not flowing via race-based contracting”.\n\nHe made a similar announcement earlier this week involving New York, where Vought said 18 million dollars (£13.4 million) for infrastructure would be paused, including funding for a new rail tunnel under the Hudson River.\n\nMr Trump is openly embracing the conservative blueprint he tried to distance himself from during the 2024 presidential campaign.\n\nIn a post on his Truth Social site Mr Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent”.\n\nThe comments, posted on Thursday, represented an about-face for Mr Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his long-time allies and current and former administration officials.","summary":"The move comes as Mr Trump threatens deep cuts in his fight with congressional Democrats over the US government shutdown.","url":"https://www.breakingnews.ie/world/trump-cancels-billions-in-clean-energy-grants-1814569.html","image":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMTBcXFwvMDMxMzA5MjJcXFwvODAwYzQ4OWE1NmI1NDc0YTg0MDczNTAzNDEyODNkYjEuanBnXCIsXCJ3aWR0aFwiOjcwMCxcImhlaW","video":null,"publish_date":"2025-10-03 12:27:12","author":"BreakingNews.ie,Press Association","authors":["BreakingNews.ie","Press Association"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.267},{"id":365867876,"title":"Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals","text":"By JILL COLVIN, Associated Press\n\nNEW YORK (AP) — President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the federal workforce and punishing Democratic states.\n\nIn a post on his Truth Social site Thursday morning, Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.”\n\nThe comments represented a dramatic about-face for Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his longtime allies and current and former administration officials.\n\nBoth of Trump’s Democratic rivals, Joe Biden and Kamala Harris, made the far-right wish list a centerpiece of their campaigns, and a giant replica of the book featured prominently onstage at the Democratic National Convention.\n\n“Donald Trump and his stooges lied through their teeth about Project 2025, and now he’s running the country straight into it,” said Ammar Moussa, a former spokesperson for both campaigns. “There’s no comfort in being right — just anger that we’re stuck with the consequences of his lies.”\n\nShalanda Young, director of the Office of Management and Budget under Biden, said the administration had clearly been following the project’s blueprint all along.\n\n“I guess Democrats were right, but that doesn’t make me feel better,” she said. “I’m angry that this is happening after being told that this document was not going to be the centerpiece of this administration.”\n\nAsked about Trump’s reversal, White House spokesperson Abigail Jackson said, “Democrats are desperate to talk about anything aside from their decision to hurt the American people by shutting down the government.”\n\nProject what?\n\nTop Trump campaign leaders spent much of 2024 livid at The Heritage Foundation for publishing a book full of unpopular proposals that Democrats tried to pin on the campaign to warn a second Trump term would be too extreme.\n\nWhile many of the policies outlined in its 900-plus pages aligned closely with the agenda that Trump was proposing — particularly on curbing immigration and dismantling certain federal agencies — others called for action Trump had never discussed, like banning pornography, or Trump’s team was actively trying to avoid, like withdrawing approval for abortion medication.\n\nTrump repeatedly insisted he knew nothing about the group or who was behind it, despite his close ties with many of its authors. They included John McEntee, his former director of the White House Presidential Personnel Office, and Paul Dans, former chief of staff at the U.S. Office of Personnel Management.\n\n“I know nothing about Project 2025,” Trump insisted in July 2024. “I have no idea who is behind it. I disagree with some of the things they’re saying and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them.”\n\nTrump’s campaign chiefs were equally critical.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” wrote Susie Wiles and Chris LaCivita in a campaign memo. They added, “Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nTrump has since gone on to stock his second administration with its authors, including Vought, “border czar” Tom Homan, CIA Director John Ratcliffe, immigration hard-liner Stephen Miller and Brendan Carr, who wrote Project 2025’s chapter on the Federal Communications Commission and now chairs the panel.\n\nHeritage did not respond to a request for comment Thursday. But Dans, the project’s former director, said it’s been “exciting” to see so much of what was laid out in the book put into action.\n\n“It’s gratifying. We’re very proud of the work that was done for this express purpose: to have a doer like President Trump ready to roll on Day One,” said Dans, who is currently running for Senate against Lindsey Graham in South Carolina.\n\nTrump administration uses the shutdown to further its goals\n\nSince his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce. They include efforts like the Department of Government Efficiency and budget rescission packages, which have led to billions of dollars being stalled, scrapped or withheld by the administration so far this year.\n\nThey are now using the shutdown to accelerate their progress.\n\nAhead of the funding deadline, OMB directed agencies to prepare for additional mass firings of federal workers, rather than simply furloughing those who are not deemed essential, as has been the usual practice during past shutdowns. Vought told House GOP lawmakers in a private conference call Wednesday that layoffs would begin in the next day or two.\n\nThey have also used the shutdown to target projects championed by Democrats, including canceling $8 billion in green energy projects in states with Democratic senators and withholding $18 billion for transportation projects in New York City that have been championed by Senate Democratic Leader Chuck Schumer and House Democratic leader Hakeem Jeffries in their home state.\n\nDreaming of this moment\n\nThe moves are part of a broader effort to concentrate federal authority in the presidency, which permeated Project 2025.\n\nIn his chapter in the blueprint, Vought made clear he wanted the president and OMB to wield more direct power.\n\n“The Director must view his job as the best, most comprehensive approximation of the President’s mind,” he wrote. Vought described OMB as “a President’s air-traffic control system,” which should be “involved in all aspects of the White House policy process,” becoming “powerful enough to override implementing agencies’ bureaucracies.”\n\nSen. Mike Lee, R-Utah, said on Fox News Channel that Vought “has a plan, and that plan is going to succeed in further empowering Trump. This is going to be the Democrats’ worst nightmare.”\n\nHouse Speaker Mike Johnson echoed that message, insisting the government shutdown gives Trump and his budget director vast power over the federal government and the unilateral power to determine which personnel and policies are essential and which are not.\n\nSchumer has handed “the keys of the kingdom to the president,” Johnson said Thursday. “Because they have decided to vote to shut the government down, they have now effectively turned off the legislative branch … and they’ve turned it over to the executive.”\n\nYoung said the Constitution gives the White House no such power and chastised Republicans in Congress for abandoning their duty to serve as a check on the president.\n\n“I don’t want to hear a lecture about handing the keys over,” she said. “The keys are gone. They’re lost. They’re down a drain. This shutdown is not what lost the keys.”","summary":"Trump’s comments represent a dramatic about-face after he and his campaign spent much of last year denouncing Project 2025.","url":"https://www.twincities.com/2025/10/03/trump-shutdown-project-2025/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Trump_Pentagon_Commanders_Meeting_76546-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-03 12:22:03","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.214},{"id":365866066,"title":"Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals","text":"By JILL COLVIN, Associated Press\n\nNEW YORK (AP) — President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the federal workforce and punishing Democratic states.\n\nIn a post on his Truth Social site Thursday morning, Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.”\n\nThe comments represented a dramatic about-face for Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his longtime allies and current and former administration officials.\n\nBoth of Trump’s Democratic rivals, Joe Biden and Kamala Harris, made the far-right wish list a centerpiece of their campaigns, and a giant replica of the book featured prominently onstage at the Democratic National Convention.\n\n“Donald Trump and his stooges lied through their teeth about Project 2025, and now he’s running the country straight into it,” said Ammar Moussa, a former spokesperson for both campaigns. “There’s no comfort in being right — just anger that we’re stuck with the consequences of his lies.”\n\nShalanda Young, director of the Office of Management and Budget under Biden, said the administration had clearly been following the project’s blueprint all along.\n\n“I guess Democrats were right, but that doesn’t make me feel better,” she said. “I’m angry that this is happening after being told that this document was not going to be the centerpiece of this administration.”\n\nAsked about Trump’s reversal, White House spokesperson Abigail Jackson said, “Democrats are desperate to talk about anything aside from their decision to hurt the American people by shutting down the government.”\n\nProject what?\n\nTop Trump campaign leaders spent much of 2024 livid at The Heritage Foundation for publishing a book full of unpopular proposals that Democrats tried to pin on the campaign to warn a second Trump term would be too extreme.\n\nWhile many of the policies outlined in its 900-plus pages aligned closely with the agenda that Trump was proposing — particularly on curbing immigration and dismantling certain federal agencies — others called for action Trump had never discussed, like banning pornography, or Trump’s team was actively trying to avoid, like withdrawing approval for abortion medication.\n\nTrump repeatedly insisted he knew nothing about the group or who was behind it, despite his close ties with many of its authors. They included John McEntee, his former director of the White House Presidential Personnel Office, and Paul Dans, former chief of staff at the U.S. Office of Personnel Management.\n\n“I know nothing about Project 2025,” Trump insisted in July 2024. “I have no idea who is behind it. I disagree with some of the things they’re saying and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them.”\n\nTrump’s campaign chiefs were equally critical.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” wrote Susie Wiles and Chris LaCivita in a campaign memo. They added, “Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nTrump has since gone on to stock his second administration with its authors, including Vought, “border czar” Tom Homan, CIA Director John Ratcliffe, immigration hard-liner Stephen Miller and Brendan Carr, who wrote Project 2025’s chapter on the Federal Communications Commission and now chairs the panel.\n\nHeritage did not respond to a request for comment Thursday. But Dans, the project’s former director, said it’s been “exciting” to see so much of what was laid out in the book put into action.\n\n“It’s gratifying. We’re very proud of the work that was done for this express purpose: to have a doer like President Trump ready to roll on Day One,” said Dans, who is currently running for Senate against Lindsey Graham in South Carolina.\n\nTrump administration uses the shutdown to further its goals\n\nSince his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce. They include efforts like the Department of Government Efficiency and budget rescission packages, which have led to billions of dollars being stalled, scrapped or withheld by the administration so far this year.\n\nThey are now using the shutdown to accelerate their progress.\n\nAhead of the funding deadline, OMB directed agencies to prepare for additional mass firings of federal workers, rather than simply furloughing those who are not deemed essential, as has been the usual practice during past shutdowns. Vought told House GOP lawmakers in a private conference call Wednesday that layoffs would begin in the next day or two.\n\nThey have also used the shutdown to target projects championed by Democrats, including canceling $8 billion in green energy projects in states with Democratic senators and withholding $18 billion for transportation projects in New York City that have been championed by Senate Democratic Leader Chuck Schumer and House Democratic leader Hakeem Jeffries in their home state.\n\nDreaming of this moment\n\nThe moves are part of a broader effort to concentrate federal authority in the presidency, which permeated Project 2025.\n\nIn his chapter in the blueprint, Vought made clear he wanted the president and OMB to wield more direct power.\n\n“The Director must view his job as the best, most comprehensive approximation of the President’s mind,” he wrote. Vought described OMB as “a President’s air-traffic control system,” which should be “involved in all aspects of the White House policy process,” becoming “powerful enough to override implementing agencies’ bureaucracies.”\n\nSen. Mike Lee, R-Utah, said on Fox News Channel that Vought “has a plan, and that plan is going to succeed in further empowering Trump. This is going to be the Democrats’ worst nightmare.”\n\nHouse Speaker Mike Johnson echoed that message, insisting the government shutdown gives Trump and his budget director vast power over the federal government and the unilateral power to determine which personnel and policies are essential and which are not.\n\nSchumer has handed “the keys of the kingdom to the president,” Johnson said Thursday. “Because they have decided to vote to shut the government down, they have now effectively turned off the legislative branch … and they’ve turned it over to the executive.”\n\nYoung said the Constitution gives the White House no such power and chastised Republicans in Congress for abandoning their duty to serve as a check on the president.\n\n“I don’t want to hear a lecture about handing the keys over,” she said. “The keys are gone. They’re lost. They’re down a drain. This shutdown is not what lost the keys.”","summary":"Trump’s comments represent a dramatic about-face after he and his campaign spent much of last year denouncing Project 2025.","url":"https://www.denverpost.com/2025/10/03/trump-shutdown-project-2025/","image":"https://www.denverpost.com/wp-content/uploads/2025/10/Trump_Pentagon_Commanders_Meeting_76546-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-03 12:22:03","author":"Gqlshare,The Associated Press","authors":["Gqlshare","The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.214},{"id":365869686,"title":"Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals","text":"By JILL COLVIN, Associated Press\n\nNEW YORK (AP) — President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the federal workforce and punishing Democratic states.\n\nIn a post on his Truth Social site Thursday morning, Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.”\n\nThe comments represented a dramatic about-face for Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his longtime allies and current and former administration officials.\n\nBoth of Trump’s Democratic rivals, Joe Biden and Kamala Harris, made the far-right wish list a centerpiece of their campaigns, and a giant replica of the book featured prominently onstage at the Democratic National Convention.\n\n“Donald Trump and his stooges lied through their teeth about Project 2025, and now he’s running the country straight into it,” said Ammar Moussa, a former spokesperson for both campaigns. “There’s no comfort in being right — just anger that we’re stuck with the consequences of his lies.”\n\nShalanda Young, director of the Office of Management and Budget under Biden, said the administration had clearly been following the project’s blueprint all along.\n\n“I guess Democrats were right, but that doesn’t make me feel better,” she said. “I’m angry that this is happening after being told that this document was not going to be the centerpiece of this administration.”\n\nAsked about Trump’s reversal, White House spokesperson Abigail Jackson said, “Democrats are desperate to talk about anything aside from their decision to hurt the American people by shutting down the government.”\n\nProject what?\n\nTop Trump campaign leaders spent much of 2024 livid at The Heritage Foundation for publishing a book full of unpopular proposals that Democrats tried to pin on the campaign to warn a second Trump term would be too extreme.\n\nWhile many of the policies outlined in its 900-plus pages aligned closely with the agenda that Trump was proposing — particularly on curbing immigration and dismantling certain federal agencies — others called for action Trump had never discussed, like banning pornography, or Trump’s team was actively trying to avoid, like withdrawing approval for abortion medication.\n\nTrump repeatedly insisted he knew nothing about the group or who was behind it, despite his close ties with many of its authors. They included John McEntee, his former director of the White House Presidential Personnel Office, and Paul Dans, former chief of staff at the U.S. Office of Personnel Management.\n\n“I know nothing about Project 2025,” Trump insisted in July 2024. “I have no idea who is behind it. I disagree with some of the things they’re saying and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them.”\n\nTrump’s campaign chiefs were equally critical.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” wrote Susie Wiles and Chris LaCivita in a campaign memo. They added, “Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nTrump has since gone on to stock his second administration with its authors, including Vought, “border czar” Tom Homan, CIA Director John Ratcliffe, immigration hard-liner Stephen Miller and Brendan Carr, who wrote Project 2025’s chapter on the Federal Communications Commission and now chairs the panel.\n\nHeritage did not respond to a request for comment Thursday. But Dans, the project’s former director, said it’s been “exciting” to see so much of what was laid out in the book put into action.\n\n“It’s gratifying. We’re very proud of the work that was done for this express purpose: to have a doer like President Trump ready to roll on Day One,” said Dans, who is currently running for Senate against Lindsey Graham in South Carolina.\n\nTrump administration uses the shutdown to further its goals\n\nSince his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce. They include efforts like the Department of Government Efficiency and budget rescission packages, which have led to billions of dollars being stalled, scrapped or withheld by the administration so far this year.\n\nThey are now using the shutdown to accelerate their progress.\n\nAhead of the funding deadline, OMB directed agencies to prepare for additional mass firings of federal workers, rather than simply furloughing those who are not deemed essential, as has been the usual practice during past shutdowns. Vought told House GOP lawmakers in a private conference call Wednesday that layoffs would begin in the next day or two.\n\nThey have also used the shutdown to target projects championed by Democrats, including canceling $8 billion in green energy projects in states with Democratic senators and withholding $18 billion for transportation projects in New York City that have been championed by Senate Democratic Leader Chuck Schumer and House Democratic leader Hakeem Jeffries in their home state.\n\nDreaming of this moment\n\nThe moves are part of a broader effort to concentrate federal authority in the presidency, which permeated Project 2025.\n\nIn his chapter in the blueprint, Vought made clear he wanted the president and OMB to wield more direct power.\n\n“The Director must view his job as the best, most comprehensive approximation of the President’s mind,” he wrote. Vought described OMB as “a President’s air-traffic control system,” which should be “involved in all aspects of the White House policy process,” becoming “powerful enough to override implementing agencies’ bureaucracies.”\n\nSen. Mike Lee, R-Utah, said on Fox News Channel that Vought “has a plan, and that plan is going to succeed in further empowering Trump. This is going to be the Democrats’ worst nightmare.”\n\nHouse Speaker Mike Johnson echoed that message, insisting the government shutdown gives Trump and his budget director vast power over the federal government and the unilateral power to determine which personnel and policies are essential and which are not.\n\nSchumer has handed “the keys of the kingdom to the president,” Johnson said Thursday. “Because they have decided to vote to shut the government down, they have now effectively turned off the legislative branch … and they’ve turned it over to the executive.”\n\nYoung said the Constitution gives the White House no such power and chastised Republicans in Congress for abandoning their duty to serve as a check on the president.\n\n“I don’t want to hear a lecture about handing the keys over,” she said. “The keys are gone. They’re lost. They’re down a drain. This shutdown is not what lost the keys.”","summary":"Trump’s comments represent a dramatic about-face after he and his campaign spent much of last year denouncing Project 2025.","url":"https://www.ocregister.com/2025/10/03/trump-shutdown-project-2025/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Trump_Pentagon_Commanders_Meeting_76546-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-03 12:22:03","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.214},{"id":365870918,"title":"Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals","text":"By JILL COLVIN, Associated Press\n\nNEW YORK (AP) — President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the federal workforce and punishing Democratic states.\n\nIn a post on his Truth Social site Thursday morning, Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.”\n\nThe comments represented a dramatic about-face for Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his longtime allies and current and former administration officials.\n\nBoth of Trump’s Democratic rivals, Joe Biden and Kamala Harris, made the far-right wish list a centerpiece of their campaigns, and a giant replica of the book featured prominently onstage at the Democratic National Convention.\n\n“Donald Trump and his stooges lied through their teeth about Project 2025, and now he’s running the country straight into it,” said Ammar Moussa, a former spokesperson for both campaigns. “There’s no comfort in being right — just anger that we’re stuck with the consequences of his lies.”\n\nShalanda Young, director of the Office of Management and Budget under Biden, said the administration had clearly been following the project’s blueprint all along.\n\n“I guess Democrats were right, but that doesn’t make me feel better,” she said. “I’m angry that this is happening after being told that this document was not going to be the centerpiece of this administration.”\n\nAsked about Trump’s reversal, White House spokesperson Abigail Jackson said, “Democrats are desperate to talk about anything aside from their decision to hurt the American people by shutting down the government.”\n\nProject what?\n\nTop Trump campaign leaders spent much of 2024 livid at The Heritage Foundation for publishing a book full of unpopular proposals that Democrats tried to pin on the campaign to warn a second Trump term would be too extreme.\n\nWhile many of the policies outlined in its 900-plus pages aligned closely with the agenda that Trump was proposing — particularly on curbing immigration and dismantling certain federal agencies — others called for action Trump had never discussed, like banning pornography, or Trump’s team was actively trying to avoid, like withdrawing approval for abortion medication.\n\nTrump repeatedly insisted he knew nothing about the group or who was behind it, despite his close ties with many of its authors. They included John McEntee, his former director of the White House Presidential Personnel Office, and Paul Dans, former chief of staff at the U.S. Office of Personnel Management.\n\n“I know nothing about Project 2025,” Trump insisted in July 2024. “I have no idea who is behind it. I disagree with some of the things they’re saying and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them.”\n\nTrump’s campaign chiefs were equally critical.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” wrote Susie Wiles and Chris LaCivita in a campaign memo. They added, “Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nTrump has since gone on to stock his second administration with its authors, including Vought, “border czar” Tom Homan, CIA Director John Ratcliffe, immigration hard-liner Stephen Miller and Brendan Carr, who wrote Project 2025’s chapter on the Federal Communications Commission and now chairs the panel.\n\nHeritage did not respond to a request for comment Thursday. But Dans, the project’s former director, said it’s been “exciting” to see so much of what was laid out in the book put into action.\n\n“It’s gratifying. We’re very proud of the work that was done for this express purpose: to have a doer like President Trump ready to roll on Day One,” said Dans, who is currently running for Senate against Lindsey Graham in South Carolina.\n\nTrump administration uses the shutdown to further its goals\n\nSince his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce. They include efforts like the Department of Government Efficiency and budget rescission packages, which have led to billions of dollars being stalled, scrapped or withheld by the administration so far this year.\n\nThey are now using the shutdown to accelerate their progress.\n\nAhead of the funding deadline, OMB directed agencies to prepare for additional mass firings of federal workers, rather than simply furloughing those who are not deemed essential, as has been the usual practice during past shutdowns. Vought told House GOP lawmakers in a private conference call Wednesday that layoffs would begin in the next day or two.\n\nThey have also used the shutdown to target projects championed by Democrats, including canceling $8 billion in green energy projects in states with Democratic senators and withholding $18 billion for transportation projects in New York City that have been championed by Senate Democratic Leader Chuck Schumer and House Democratic leader Hakeem Jeffries in their home state.\n\nDreaming of this moment\n\nThe moves are part of a broader effort to concentrate federal authority in the presidency, which permeated Project 2025.\n\nIn his chapter in the blueprint, Vought made clear he wanted the president and OMB to wield more direct power.\n\n“The Director must view his job as the best, most comprehensive approximation of the President’s mind,” he wrote. Vought described OMB as “a President’s air-traffic control system,” which should be “involved in all aspects of the White House policy process,” becoming “powerful enough to override implementing agencies’ bureaucracies.”\n\nSen. Mike Lee, R-Utah, said on Fox News Channel that Vought “has a plan, and that plan is going to succeed in further empowering Trump. This is going to be the Democrats’ worst nightmare.”\n\nHouse Speaker Mike Johnson echoed that message, insisting the government shutdown gives Trump and his budget director vast power over the federal government and the unilateral power to determine which personnel and policies are essential and which are not.\n\nSchumer has handed “the keys of the kingdom to the president,” Johnson said Thursday. “Because they have decided to vote to shut the government down, they have now effectively turned off the legislative branch … and they’ve turned it over to the executive.”\n\nYoung said the Constitution gives the White House no such power and chastised Republicans in Congress for abandoning their duty to serve as a check on the president.\n\n“I don’t want to hear a lecture about handing the keys over,” she said. “The keys are gone. They’re lost. They’re down a drain. This shutdown is not what lost the keys.”","summary":"Trump’s comments represent a dramatic about-face after he and his campaign spent much of last year denouncing Project 2025.","url":"https://www.sandiegouniontribune.com/2025/10/03/trump-shutdown-project-2025/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Trump_Pentagon_Commanders_Meeting_76546-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-03 12:22:03","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.214},{"id":365856466,"title":"Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals","text":"By JILL COLVIN, Associated Press\n\nNEW YORK (AP) — President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the federal workforce and punishing Democratic states.\n\nIn a post on his Truth Social site Thursday morning, Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.”\n\nThe comments represented a dramatic about-face for Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his longtime allies and current and former administration officials.\n\nBoth of Trump’s Democratic rivals, Joe Biden and Kamala Harris, made the far-right wish list a centerpiece of their campaigns, and a giant replica of the book featured prominently onstage at the Democratic National Convention.\n\n“Donald Trump and his stooges lied through their teeth about Project 2025, and now he’s running the country straight into it,” said Ammar Moussa, a former spokesperson for both campaigns. “There’s no comfort in being right — just anger that we’re stuck with the consequences of his lies.”\n\nShalanda Young, director of the Office of Management and Budget under Biden, said the administration had clearly been following the project’s blueprint all along.\n\n“I guess Democrats were right, but that doesn’t make me feel better,” she said. “I’m angry that this is happening after being told that this document was not going to be the centerpiece of this administration.”\n\nAsked about Trump’s reversal, White House spokesperson Abigail Jackson said, “Democrats are desperate to talk about anything aside from their decision to hurt the American people by shutting down the government.”\n\nProject what?\n\nTop Trump campaign leaders spent much of 2024 livid at The Heritage Foundation for publishing a book full of unpopular proposals that Democrats tried to pin on the campaign to warn a second Trump term would be too extreme.\n\nWhile many of the policies outlined in its 900-plus pages aligned closely with the agenda that Trump was proposing — particularly on curbing immigration and dismantling certain federal agencies — others called for action Trump had never discussed, like banning pornography, or Trump’s team was actively trying to avoid, like withdrawing approval for abortion medication.\n\nTrump repeatedly insisted he knew nothing about the group or who was behind it, despite his close ties with many of its authors. They included John McEntee, his former director of the White House Presidential Personnel Office, and Paul Dans, former chief of staff at the U.S. Office of Personnel Management.\n\n“I know nothing about Project 2025,” Trump insisted in July 2024. “I have no idea who is behind it. I disagree with some of the things they’re saying and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them.”\n\nTrump’s campaign chiefs were equally critical.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” wrote Susie Wiles and Chris LaCivita in a campaign memo. They added, “Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nTrump has since gone on to stock his second administration with its authors, including Vought, “border czar” Tom Homan, CIA Director John Ratcliffe, immigration hard-liner Stephen Miller and Brendan Carr, who wrote Project 2025’s chapter on the Federal Communications Commission and now chairs the panel.\n\nHeritage did not respond to a request for comment Thursday. But Dans, the project’s former director, said it’s been “exciting” to see so much of what was laid out in the book put into action.\n\n“It’s gratifying. We’re very proud of the work that was done for this express purpose: to have a doer like President Trump ready to roll on Day One,” said Dans, who is currently running for Senate against Lindsey Graham in South Carolina.\n\nTrump administration uses the shutdown to further its goals\n\nSince his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce. They include efforts like the Department of Government Efficiency and budget rescission packages, which have led to billions of dollars being stalled, scrapped or withheld by the administration so far this year.\n\nThey are now using the shutdown to accelerate their progress.\n\nAhead of the funding deadline, OMB directed agencies to prepare for additional mass firings of federal workers, rather than simply furloughing those who are not deemed essential, as has been the usual practice during past shutdowns. Vought told House GOP lawmakers in a private conference call Wednesday that layoffs would begin in the next day or two.\n\nThey have also used the shutdown to target projects championed by Democrats, including canceling $8 billion in green energy projects in states with Democratic senators and withholding $18 billion for transportation projects in New York City that have been championed by Senate Democratic Leader Chuck Schumer and House Democratic leader Hakeem Jeffries in their home state.\n\nDreaming of this moment\n\nThe moves are part of a broader effort to concentrate federal authority in the presidency, which permeated Project 2025.\n\nIn his chapter in the blueprint, Vought made clear he wanted the president and OMB to wield more direct power.\n\n“The Director must view his job as the best, most comprehensive approximation of the President’s mind,” he wrote. Vought described OMB as “a President’s air-traffic control system,” which should be “involved in all aspects of the White House policy process,” becoming “powerful enough to override implementing agencies’ bureaucracies.”\n\nSen. Mike Lee, R-Utah, said on Fox News Channel that Vought “has a plan, and that plan is going to succeed in further empowering Trump. This is going to be the Democrats’ worst nightmare.”\n\nHouse Speaker Mike Johnson echoed that message, insisting the government shutdown gives Trump and his budget director vast power over the federal government and the unilateral power to determine which personnel and policies are essential and which are not.\n\nSchumer has handed “the keys of the kingdom to the president,” Johnson said Thursday. “Because they have decided to vote to shut the government down, they have now effectively turned off the legislative branch … and they’ve turned it over to the executive.”\n\nYoung said the Constitution gives the White House no such power and chastised Republicans in Congress for abandoning their duty to serve as a check on the president.\n\n“I don’t want to hear a lecture about handing the keys over,” she said. “The keys are gone. They’re lost. They’re down a drain. This shutdown is not what lost the keys.”","summary":"Trump’s comments represent a dramatic about-face after he and his campaign spent much of last year denouncing Project 2025.","url":"https://www.bostonherald.com/2025/10/03/trump-shutdown-project-2025/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Trump_Pentagon_Commanders_Meeting_76546-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-10-03 12:22:03","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.214},{"id":365874828,"title":"Behind the scenes of the long-standing Taylor Swift and Charli xcx 'feud'","text":"Taylor Swift and Charli xcx are two musicians who exist at polar opposite ends of the pop music scale, generally coexisting peacefully in their respective arenas. \n\nBut on some occasions, when the tectonic plates of the pop landscape shift and Charli and Taylor are thrown together, it seems to leave them less fond of each other — or so the internet thinks. \n\nThe first rumours of a feud emerged following Swift’s 2018 Reputation tour, where Charli xcx was one of Taylor’s support acts. Charli later expressed discomfort around the tour and the demographic, saying she felt as though it involved “waving at five-year-olds.”\n\nThe stars were thrown together again in 2023, when Swift struck up a brief relationship with Matty Healy, the best friend and bandmate of Charli’s husband, George Daniel. \n\nThis period is generally considered to be the inspiration behind Charli xcx’s track Sympathy is a Knife, from her hit 2024 album Brat. \n\nThe song’s lyrics include: “Don't wanna see her backstage at my boyfriend's show / Fingers crossed behind my back, I hope they break up quick,” and “This one girl taps my insecurities / Don't know if it's real or if I'm spiralling.”\n\nAfter some initial discussion on social media following the release of Brat, chatter around the Charli xcx and Taylor Swift ‘feud’ has lain dormant for over a year. \n\nUntil today, when Taylor Swift was rumoured to have penned a ‘diss track’ about Charli xcx on her new album, The Life of a Showgirl.\n\n“I heard you call me ‘Boring Barbie’,” Swift sings in the opening lyrics. “High-fived my ex and then you said you're glad he ghosted me,” she continues, adding: “Wrote me a song saying it makes you sick to see my face.”\n\nSo, how much of this ‘feud’ is legitimate, and how did it all start? Let’s break down the history and the lyrical references. \n\nCharli xcx and Taylor Swift first met in December 2014 at the iHeartRadio Jingle Ball while both riding fresh waves of career success. Taylor was in the midst of her 1989 era, while Charli was breaking into the mainstream with her hit Boom Clap. \n\nThe pair appeared to hit it off and stayed friendly throughout 2015. In February of that year, Charli covered Swift’s song Shake It Off for a BBC Live Lounge performance, and in October, Swift invited her onstage to perform Boom Clap during her 1989 tour date in Toronto. “Charli XCX is officially a Swiftie,” Teen Vogue declared in an article about the performance. \n\nBut it wasn’t until 2018 that things appeared to hit a snag. Taylor embarked on her Reputation stadium tour, inviting Charli xcx and Camila Cabello along as her support acts. As well as opening for Taylor, Charli and Camila would join her on stage each night for her performance of Shake It Off. \n\nThis time period happened to coincide with Charli xcx pivoting from her commercially appealing Sucker album (some aspects of which she has since said “feel fake” to her now) to her more alternative, club-leaning music. \n\nDuring the 1989 tour, she debuted her new track 5 in the Morning, which includes the lyrics: “We on a roll, we don't stop 'til the bottles all popped / And the pills got me wasted” and “I can see you talk, got a big mouth (blah blah blah blah) / Would you stick around for the come down?” Not exactly Shake It Off adjacent.\n\nWhen asked about the tour during her 2019 cover interview for Pitchfork, Charli said: “I’m really grateful that [Taylor] asked me on that tour. But as an artist, it kind of felt like I was getting up on stage and waving to five-year-olds.”\n\nHer comments attracted a lot of criticism from Swifties, who found them disparaging. Many believe this to be the moment that publicly confirmed a “feud”. \n\nHowever, Charli later addressed her comments on X (formerly Twitter), explaining: “In the printed version of this much wider conversation my answers about this tour were boiled down into one kind of weird sentence [...] Leading up to that tour I’d been playing a tonne of 18+ club shows and so to be on a stage in front of all ages was new to me and made me approach my performances with a whole new kind of energy [...] There is absolutely no shade and only love here!”\n\nAfter Charli released this statement, she and Taylor appeared to keep their distance, with no public interactions taking place for years. Then, in 2023, a bombshell was dropped: Taylor had broken up from her longtime boyfriend Joe Alwyn and begun dating Matt (Matty) Healy, the divisive, floppy-haired frontman of The 1975. \n\nDuring their brief relationship in May 2023, Taylor was embarking on the first leg of her Eras tour, where Healy would occasionally accompany her and watch on from the crowd. “She and Matty are madly in love,” a source told The Sun. “It’s super-early days, but it feels right.” \n\nTheir relationship burned bright and fast, coming to an end in little over a month. “Taylor and Matty broke up. They are both extremely busy and realised they’re not really compatible with each other,” one source told Entertainment Tonight at the time. “Taylor's friends want what’s best for her and aren’t shocked that their relationship fizzled out, since she recently got out of a long-term relationship.”\n\nIn April 2024, Taylor released The Tortured Poet’s Department, which was widely reported to have been inspired by her relationship with Matt Healy. Lyrical references to Healy appear to include: “You smokеd, then ate seven bars of chocolate / We declared Charlie Puth should be a bigger artist” and “I scratch your head, you fall asleep / Like a tattooed golden retriever.”\n\nTwo months later, Charli xcx released Brat, transforming her from a fan-favourite artist into a pop sensation. Fans were quick to link the lyrics on one of Brat’s tracks, Sympathy is a Knife, to Taylor Swift. \n\n“I don't wanna share this space / I don't wanna force a smile / This one girl taps my insecurities / Don't know if it's real or if I'm spiraling,” she sings. “One voice tells me that they laugh / George says, ‘I'm just paranoid.’”\n\nOther lyrics include: “Cause I couldn't even be her if I tried / I'm opposite, I'm on the other side,” and “Don't wanna see her backstage at my boyfriend's show / Fingers crossed behind my back, I hope they break up quick.” \n\nSwifties offered criticism at the time of release but it was largely overshadowed by the mammoth impact of Brat and its sudden link to Kamala Harris’s presidential campaign.\n\nThe feud was all but dead until Thursday, October 2, when a leaked lyrics sheet from Taylor Swift’s new album The Life of a Showgirl revealed a new song, Actually Romantic. \n\nFans were quick to notice the link between the song title and Charli xcx, whose remixed song Everything is Romantic is currently the number one sound on TikTok. \n\n“I heard you call me ‘Boring Barbie’, [...] High-fived my ex and then you said you're glad he ghosted me,” Swift sings in the opening lyrics. \n\nThe lyrics also make parallels to Sympathy is a Knife, with Swift saying: “Wrote me a song saying it makes you sick to see my face.” \n\nIn the chorus, Swift claims that the unnamed antagonist’s actions are “actually romantic”, singing: “But it's actually sweet/ All the time you've spent on me / It's honestly wild / All the effort you've put in.”\n\nThe response to the track has been mixed. Some fans have praised Taylor for “clapping back”, while others are conflicted. Critics have been more clear on the situation, with Laura Snapes claiming the song underscores Taylor’s “tedious obsession with conflict.” And thus, the ‘feud’ continues.","summary":"Taylor Swift has reignited rumours of a potential feud with Charli xcx thanks to her new ‘diss track’, Actually Romantic. Maddy Mussen excavates the origins of the drama","url":"https://www.standard.co.uk/lifestyle/celebrity/taylor-swift-charli-xcx-song-lyrics-feud-beef-b1251022.html","image":"https://static.standard.co.uk/2025/10/03/10/07/Taylor-Charli-Split.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/GqhRgZSV-MzYL9J7h.mp4","publish_date":"2025-10-03 12:06:48","author":"Maddy Mussen","authors":["Maddy Mussen"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.165},{"id":365852098,"title":"AP Decision Insights: Anticipations for Tennessee’s Special Congressional Election","text":"WASHINGTON – Over twelve candidates are vying for their parties’ nominations on Tuesday to succeed in taking an open Tennessee congressional seat in the highly competitive U.S. House.\n\nThe winners of these primaries will compete in a special election on December 2, aimed at replacing the former Republican U.S. Rep. Mark Green, who stepped down in July for a career in the private sector. This election, in Tennessee’s predominantly Republican 7th Congressional District, is likely to momentarily enhance the GOP’s slight majority in the House. Meanwhile, a seat in a heavily Democratic district near Houston, Texas, will be filled in November.\n\nThe Republican primary involves 11 contenders, including state Reps. Jody Barrett, Gino Bulso, and Lee Reeves. Other notable candidates are Matt Van Epps, a former Tennessee Department of General Services Commissioner with Green’s endorsement, and Montgomery County Commissioner Jason Knight. The lineup is rounded out by Mason Foley from the healthcare business, real estate entrepreneur Stewart Parks, who gained a pardon from President Trump for his role in the January 6, 2021 U.S. Capitol events, and Tres Wittum, a former state Senate policy analyst previously unsuccessful in GOP primaries against U.S. Sen. Marsha Blackburn in 2024 and U.S. Rep. Andy Ogles in 2022.\n\nState Reps. Aftyn Behn, Vincent Dixie and Bo Mitchell and businessman Darden Copeland seek the Democratic nomination.\n\nVan Epps emerged as the top fundraiser among Republicans, gathering about $359,000 by mid-September. Reeves and Parks each raised approximately $270,000, and Barrett amassed nearly $242,000. Nevertheless, Van Epps was outspent by other candidates who contributed significant loans to their campaigns. Bulso loaned nearly $494,000, Foley provided $325,000, Reeves gave $300,000, and Parks allocated $67,000 to their respective campaigns.\n\nIn the Democratic field, Copeland led fundraising with about $335,000 in contributions and added $100,000 of his own funds. He retained most funds as of September 17. In contrast, Mitchell collected roughly $203,000 but had under half left to utilize as the campaign approached the final stages.\n\nThe 7th District, which has predominantly supported Republican candidates for over twelve years, also encompasses parts of Democratic-heavy Davidson County, home to Nashville. Nashville previously anchored a Democrat-leaning district, but in 2022, state Republicans reshaped the district boundaries, dividing Davidson County among the 7th and two nearby Republican-favoring districts.\n\nTrump carried the 7th District in 2024 with about 60% of the vote, compared with about 38% for then-Vice President Kamala Harris, the Democratic nominee. Harris received nearly 68% of the vote in the 7th District’s portion of Davidson County, which comprised about 22% of the total district vote. Trump carried each of the remaining 13 counties with at least 59% of the vote.\n\nMontgomery County made up about 24% of the district vote in the 2024 presidential race, the largest share of any county in the district.\n\nGreen was elected twice each under the old and new district boundaries. Under the old lines, he received between 67% and 70% of the vote. He won with 60% of the vote under the current lines in 2022 and 2024. He never ran in a competitive primary under the current boundaries.\n\nThe Associated Press does not make projections and will declare a winner only when it’s determined there is no scenario that would allow the trailing candidates to close the gap. If a race has not been called, the AP will continue to cover any newsworthy developments, such as candidate concessions or declarations of victory. In doing so, the AP will make clear that it has not yet declared a winner and explain why.\n\nIn Tennessee, recounts are held only as part of a legal challenge in the courts. There are no automatic recounts, and losing candidates may not request recounts. The AP may declare a winner in a race that is subject to a recount if it can determine the lead is too large for a recount or legal challenge to change the outcome.\n\nHere’s a look at what to expect Tuesday:\n\nSpecial primary day\n\nThe special primary in Tennessee’s 7th Congressional District will be held Tuesday. Polls in the district close at 7 p.m. local time, which is 8 p.m. ET. Although Tennessee is located in two time zones, the 7th District falls entirely within the Central time zone.\n\nWhat’s on the ballot?\n\nThe AP will provide vote results and declare a winner in the special congressional primary.\n\nWho gets to vote?\n\nTennessee does not register voters by party, which in other states usually means that any registered voter may choose to vote in any party’s primary. A rarely enforced 1972 law says primary voters must be “affiliated with” or a “bona fide” member of a party to vote in that party’s primary, and a 2023 law requires local elections officials to post signs at polling places saying so. But those terms aren’t clearly defined. The law faced multiple legal challenges, but a federal court dismissed the complaint in 2024.\n\nWhat do turnout and advance vote look like?\n\nThere were more than 469,000 registered voters in the 7th Congressional District in the August 2024 state primary. Turnout was about 7% of registered voters in the Republican U.S. House primary and about 5% in the Democratic primary. Both primaries were uncontested.\n\nAmong the 14 counties located either entirely or partly within the 7th District, about 58% of 2024 primary ballots were cast early by in-person or absentee voters.\n\nAs of Wednesday, nearly 15,000 Democratic primary ballots and nearly 16,000 Republican primary ballots had been cast before the special primary.\n\nHow long does vote-counting usually take?\n\nIn the 2024 general election, the AP first reported 7th District results at 8:03 p.m. ET from Perry County, three minutes after polls closed. The election night tabulation ended at 12:36 a.m. ET with more than 99% of total votes counted.\n\nAre we there yet?\n\nAs of Tuesday, there will be 56 days until the Dec. 2 special election in the 7th District and 392 days until the 2026 midterm elections.\n\nFollow the AP’s coverage of the 2025 election at https://apnews.com/projects/election-results-2025/.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – Over twelve candidates are vying for their parties’ nominations on&#8230;\n\n\nThis Post: AP Decision Insights: Anticipations for Tennessee&#8217;s Special Congressional Election first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/ap-decision-insights-anticipations-for-tennessees-special-congressional-election/","image":"https://internewscast.com/wp-content/uploads/2025/10/AP-Decision-Notes-What-to-expect-in-Tennessee039s-special-congressional.jpg","video":null,"publish_date":"2025-10-03 11:56:08","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.213},{"id":365831948,"title":"Joe and Jill's secret war. Mean Girls 'Burn Book'. And one excruciating mistake. Insiders reveal every drip of poison aimed at Kamala","text":"In the depths of Kamala Harris's floundering 2024 presidential campaign, top advisors for Joe Biden told her the president would understand if she chose to break from him. \n\nSources familiar with the conversations between the two political campaigns told the Daily Mail Team Biden knew she would have to separate herself from some of his more unpopular policies and stake out new territory if she was going to win the White House. \n\nBut she never did, they revealed, either out of loyalty or because she worried it would create backlash against her role in the administration.\n\nThat mentality led to the famous moment on The View, when she said that 'there is not a thing that comes to mind,' that she would do differently than Biden.\n\nHarris revealed in the book that she was prepared to say that 'great ideas come from all places' and that she would appoint a Republican to her cabinet - but failed.\n\nThat was quintessential Harris.\n\n'Some of the decisions that were made on that side of the building were so tone deaf that there was not much we could do to fix it,' a former Biden aide told the Daily Mail.\n\nThese damaging insider anecdotes are now seeping out of Biden White House loyalists, as the former staffers and advisors to the then president reel from the release of Harris new tell-all book '107 Days,' a diary of her failed campaign.\n\n'It's like the political memoir's equivalent of a Regina George burn book, settling scores and, with personal animus,' a former senior Biden-Harris campaign official told the Daily Mail, referencing the movie 'Mean Girls'.\n\n'It just struck me as very small,' the insider added. Well now, these aggravated parties appear to be out for revenge.\n\nOther former Biden advisors revealed Harris was very cautious about crossing Rep. Alexandria Ocasio-Cortez, frequently grilling Biden's staff why their administration's policies were at odds from hers.\n\nStaffers found it strange she seemed more preoccupied with a left-wing radical from New York than the lead from the president of the United States, people familiar with the behind the scenes details told the Daily Mail.\n\nHarris's difficulties preparing for high-profile meetings and high-stakes media appearances are well-known, but Biden insiders say she took longer to get up to speed than even the aging president.\n\n'You'd think a candidate 20+ years younger would be able to prep faster and engage more with members of the media,' the ex-campaign official said. 'But we quickly found out that was indeed not the case.'\n\nHarris famously botched her interview with NBC's Lester Holt when she pointed out she 'hadn't been to Europe' when he asked her why she hadn't visited the border.\n\nThe blowup over her answer bothered her so much, she ultimately chose to visit the border herself, despite warnings from Biden staff not to engage Republicans on the issue.\n\nWhat was worse, anytime Harris was asked a question she was not prepared for, she took it out on her staff according to people familiar with her campaign.\n\nThat, too, is one her known modus operandi. But there was only so much they could do.\n\nStaff watched in horror, the Daily Mail was told, when interviewers asked her questions that she had been prepared for in advance with pre-rehearsed lines but then flubbed nevertheless.\n\nOther former Biden aides were not pleased when Harris blamed the president's staff for not defending her.\n\nThey recalled former press secretary Jen Psaki, who served in the Obama and the early Biden administration, frequently defended Harris, especially when she was under attack from Republicans.\n\nDemocratic insiders expect Biden to remain above the fray - for now.\n\nBoth the Bidens are currently crafting their own books, in which they expect to address not just the party-wide betrayal of the president, but also his vice president.\n\nJill Biden, in particular, tends to hold grudges, and had a frosty relationship with Harris from the beginning.\n\n'I remember every slight committed against the people I love,' Jill famously said in her 2019 memoir. 'I can forgive, sure, but I don't believe in rewarding bad behavior.'\n\nBut some former advisors caution that allowing Harris to continue her political 'reset' unchallenged could damage their legacy.\n\n'Acting with speed was a major blind spot for them when it came to the public relations strategies they follow,' former advisor to First Lady Michael LaRosa told the Daily Mail.\n\n'It always feels rather tone deaf because they always leave it to others to tell their story instead of themselves.'\n\nLaRosa cautioned that Harris' new narrative about the Bidens, left unchallenged by the Biden's directly, could further damage the family reputation.\n\n'It's tragically misguided to believe that their books can help shape or save his legacy by giving them the last word,' he said.\n\nBiden world is confident that details in the book will fade over time, just like former First Lady Hillary Clinton's memoir detailing how she lost to Trump.\n\nJust two political candidates lost to President Trump in presidential campaign, and Harris is now one of them.","summary":"In the depths of Kamala Harris 's floundering 2024 presidential campaign, top advisors for President Joe Biden told her the president would understand.","url":"https://www.dailymail.co.uk/news/article-15152537/Joe-Jills-secret-war-Mean-Girls-kamala-harris.html","image":"https://i.dailymail.co.uk/1s/2025/10/02/15/102610395-0-image-a-12_1759416046765.jpg","video":null,"publish_date":"2025-10-03 11:35:07","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":0.368},{"id":365999014,"title":"Rebranded Channel 5 returns to profit despite advertising hit","text":"Broadcaster 5 returned to profit despite its turnover falling by almost £80m during its latest financial year, it has been revealed.\n\nThe business, which is owned by Paramount, has posted a pre-tax profit of £30.6m for 2024, new accounts filed with Companies House show.\n\nThe total is up from the £159.5m pre-tax loss it reported for 2023.\n\nHowever, its operating profit fell in the year from £112.4m to £21m while its turnover also declined from £399m to £318m.\n\nThe broadcaster rebranded to 5 in March this year and has been owned by Paramount since 2014.\n\nParamount itself hit the headlines in July when a £5.9bn merger between itself and Skydance Media was approved by the US Federal Communications Commission (FCC).\n\nThe deal, which was first announced last year, came just weeks after Paramount Global agreed to pay £13.5m to settle a legal dispute with US President Donald Trump over an interview it broadcast on subsidiary CBS with former Vice-President Kamala Harris.\n\nSkydance is owned by David Ellison, the son of Larry Ellison, who founded US technology giant Oracle.\n\nCompetitive advertising market for 5\n\nA statement signed off by the board said: “As with the previous year, the numbers reflect a payment and interest from Channel 5’s sales partner, due to a correction in the partner’s internal reporting relating to the period from 2017 to 2023.”\n\n5 added that an additional payment of £4.5m relating to 2024 was recognised during the year, down from £80.9m in 2023, plus £3.6m in interest, down rom £9.1m.\n\nThe broadcaster said the reduction in its turnover reflected “a combination of a challenging linear advertising market and adjustments in programme expenditure to safeguard Channel 5’s position in a competitive environment”.\n\nIt added: “2024 marks Channel 5’s fourth consecutive year in operating profit since 2020 when the market was materially impacted by the Covid-19 pandemic.\n\n“Overall, since Paramount Global took over ship of the broadcaster in 2014, Channel 5 has remained in profit for nine out of 10 years.”\n\nOn its future, 5 said: “Looking ahead, Channel 5 is positioning itself to fully service audiences wherever they are watching, across streaming or linear TV.\n\n:Securing a new 10-year broadcast licence from the industry regulator Ofcom was a heartening endorsement of the channel’s evolution and Paramount’s investment in UK public service broadcasting over the past decade.”","summary":"Broadcaster 5 returned to profit despite its turnover falling by almost £80m during its latest financial year, it has been revealed. The business, which is owned by Paramount, has posted a pre-tax profit of £30.6m for 2024, new accounts filed with Companies House show. The total is up from the £159.5m pre-tax loss it reported [...]","url":"https://www.cityam.com/rebranded-channel-5-returns-to-profit-despite-advertising-hit/","image":"https://www.cityam.com/wp-content/uploads/2025/10/39IYsxx4vacN-2.png","video":null,"publish_date":"2025-10-03 11:06:26","author":"Jon Robinson","authors":["Jon Robinson"],"language":"en","source_country":"gb","sentiment":-0.079},{"id":365846328,"title":"NRCC pushes Republicans to clobber Democrats over healthcare for illegal immigrants","text":"But the National Republican Congressional Committee said in a memo, shared first with the Washington Examiner, that the GOP can remain on offense with messaging that “Democrats are for illegal immigrants, Republicans are for Americans.”\n\n“Every Democrat who voted to shut down the government just delivered a ransom noteto their districts: pay for handouts to criminal illegal immigrants, or we will hold yourbenefits hostage,” the memo states. “Rather than supporting commonsense policies, vulnerable Democrats put their radical ideas ahead of working families.”\n\nThe memo also includes a chart of 26 districts considered “in play” for House Republicans in the 2026 midterm elections, and a breakdown of how many people in said districts will be affected by a shutdown. Statistics included are Women Infants and Children nutrition program participants, active duty members, and veterans per district.\n\nThe government shutdown is entering its third day after Congress failed to pass a spending deal proposed by the GOP-led House to punt the funding deadline until Nov. 21, to give appropriators more time to negotiate the 12 bills required to fund the government. \n\nDemocrats have insisted they will not vote for a bill that does not address the healthcare “crisis” occurring in the United States. But Republicans are pushing a take-it-or-leave-it approach on the Democrats, arguing that they cannot hold the government “hostage” to get their demands met.\n\nSpeaker Mike Johnson (R-LA), as well as other members of GOP leadership, have made the argument that Democrats’ continuing resolution proposal will provide healthcare to illegal immigrants as the focal point of their messaging campaign. The NRCC put out an ad on Wednesday that said, “Democrats shut down the government…all because Democrats choose handouts for illegal immigrants over Americans!”\n\nThe Democrats’ proposal, which has failed on the Senate floor numerous times, rolls back Medicaid cuts from the “big, beautiful bill” passed in July and permanently extends expiring Obamacare subsidies, among other priorities. The GOP bill also prohibited the 1.4 million “lawfully present” immigrants in the U.S. — such as those under the Deferred Action for Childhood Arrivals program, people under Temporary Protected Status, and refugees/those seeking asylum — from accessing the healthcare programs.\n\nDemocrats have argued that illegal immigrants cannot receive federally subsidized healthcare, pointing to a U.S. law from 1996. In their CR proposal, they want to restore access for the lawfully present immigrants.\n\n“Republicans want to rip health care away from Americans,” said Democratic Congressional Campaign Committee spokesperson Viet Shelton. “Democrats are fighting to make it affordable. It’s that simple. House Republicans know they’ve already lost the argument and the American people — so they lie. But no one is buying their bullsh*t.”\n\nBut Republicans have argued that the Biden administration abused the immigration parole system, as well as granted asylum and refugee status to immigrants who should not have received it. They’ve also pointed to a section of the “big, beautiful bill,” called “Alien Medicaid eligibility,” that the Democrats are seeking to repeal, which sets the new limitations on healthcare access for lawfully present immigrants.\n\nJOHNSON WON’T NEGOTIATE ON CR AND BLAMES SCHUMER FOR IMPENDING LAYOFFS\n\n“President Biden intentionally opened the border — and Kamala Harris — for four straight years,” Johnson said during a press conference on Thursday. “And you know what, they granted them all asylum, they gave them all this parole status, so they could get rolled onto taxpayer benefits.”\n\n“We’ve all been funding that. Republicans said, no, that does not comport with common sense,” Johnson added. “We’re gonna do right by Americans and not everybody else. We’re not going to incentivize illegal immigration.","summary":"EXCLUSIVE — House Republicans&#8216; campaign arm is encouraging members to keep pushing messaging that Democrats want to secure healthcare funding for illegal immigrants, a talking point the GOP has circled around since the start of the government shutdown. Historically, the party in power has received the most blame for a shutdown, putting the GOP trifecta [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3835348/exclusive-nrcc-memo-messaging-democrats-healthcare-illegal-immigrants/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/Trump-Tariff-speech.webp?w=696","video":null,"publish_date":"2025-10-03 11:00:00","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.32},{"id":365844038,"title":"AI's getting better at faking crowds. Here's why that's cause for concern","text":"A Will Smith concert video tore through the internet recently — not for his performance, but for the crowd. Eagle-eyed viewers noticed odd fingers and faces, in the audience, among other visual glitches, and suspected AI manipulation.\n\nCrowd scenes present a particular technological challenge for AI image creation tools – especially video. (Smith's team hasn't publicly commented on – or responded to a request from NPR about – how the video was made.) \"You're managing so many intricate details,\" said San Francisco-based visual artist and researcher kyt janae, an expert on AI image creation. \"You have each individual human being in the crowd. They're all moving independently and have unique features – their hair, their face, their hat, their phone, their shirt.\"\n\nBut the latest AI video generation models such as Google's Veo 3 and OpenAI's Sora 2 are getting pretty good. \"We're moving into a world where in a generous time estimate of a year, the lines of reality are going to get really blurry,\" janae said. \"And verifying what is real and what isn't real is going to almost have to become like a practice.\"\n\nWhy crowd images matter\n\nThis observation could potentially have serious consequences in a society where images of big, engaged crowds at public events like rock concerts, protests and political rallies have major currency. \"We want a visual metric, a way to determine whether somebody is succeeding or not,\" said Thomas Smith, CEO of Gado Images, a company that uses AI to help manage visual archives. \"And crowd size is often a good indicator of that.\"\n\nA report from the global consulting firm Capgemini shows nearly three-quarters of images shared on social media in 2023 were generated using AI. With the technology becoming increasingly adept at creating convincing crowd scenes, manipulating visuals has never been easier. With this comes both a creative opportunity – and a societal hazard. \"AI is a good way to cheat and kind of inflate the size of your crowd,\" Smith said.\n\nHe added there's also a flip side to this phenomenon. \"If there's a real image that surfaces and it shows something that's politically inconvenient or damaging, there's also going to be a tendency to say, 'no, that's an AI fake.'\"\n\nOne example of this occurred in August 2024, when then-Republican Party nominee Donald Trump spread false claims that Democratic rival Kamala Harris's team used AI to create an image of a big crowd of supporters.\n\nChapman University lecturer Charlie Fink, who writes about AI and other emerging technologies for Forbes, said it's especially easy to dupe people into believing a fake crowd scene is real or a real crowd scene is fake because of how the images are delivered. \"The challenge is that most people are watching content on a small screen, and most people are not terribly critical of what they see and hear. \" Fink said. \"If it looks real, it is real.\"\n\nBalancing creativity with public safety\n\nFor the technology companies behind the AI image generators and social media platforms where AI-generated stills and videos land, there's a delicate balance to be struck between enabling users to create ever-more realistic and believable content – including detailed crowd scenes – and mitigating potential harms.\n\n\"The more realistic and believable we can create the results, the more options it gives people for creative expression,\" said Oliver Wang, a principal scientist at Google DeepMind who co-leads the company's image-generation efforts. \"But misinformation is something that we do take very seriously. So we are stamping all the images that we generate with a visible watermark and an invisible watermark.\"\n\nHowever, the visible – that is, public-facing – watermark currently displayed on videos created using Google's Veo3 is tiny and easy to miss, tucked away in the corner of the screen. (Invisible watermarks, like Google's SynthID, are not visible to regular users' eyes; they help tech companies monitor AI content behind the scenes.)\n\nAnd AI labeling systems are still being applied rather unevenly across platforms. There are as yet no industry-wide standards, though companies NPR spoke with for this story said they are motivated to develop them.\n\nMeta, Instagram's parent company, currently labels uploaded AI-generated content when users disclose it or when their systems detect it. Google videos created using its own generative AI tools on YouTube automatically have a label in the description. It asks those who create media using other tools to self-disclose when AI is used. TikTok requires creators to label AI-generated or significantly edited content that shows realistic-looking scenes or people. Unlabeled content may be removed, restricted, or labeled by our team, depending on the harm it could cause.\n\nMeanwhile, Will Smith has been having more fun with AI since that controversial concert video came out. He posted a playful followup in which the camera pans from footage of the singer performing energetically on stage to reveal an audience packed with fist-pumping cats. Smith included a comment: \"Crowd was poppin' tonite!!\"","summary":"Odd fingers and faces in the crowd of a recent Will Smith concert video led to suspicions of AI. But AI is improving fast, and there are serious implications for how \"fake\" crowds might be coopted.","url":"https://www.npr.org/2025/10/03/nx-s1-5528974/will-smith-crowd-ai","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2700+0+0/resize/3600x2700!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F62%2F19%2F77617e0043bdb9ce68263d554756%2Fai-generated-4x3standard.jpg","video":null,"publish_date":"2025-10-03 11:00:00","author":"Chloe Veltman","authors":["Chloe Veltman"],"language":"en","source_country":"US","sentiment":0.331},{"id":365818206,"title":"What JD Vance could learn from Kamala’s memoir","text":"We saw vice presidential nominee Mike Pence play the good soldier by defending an idealized version of Donald Trump against Hillary Clinton‘s running mate, Sen. Tim Kaine (D-VA), in their 2016 debate. Then-Vice President Joe Biden soldiered in when Rep. Paul Ryan made several factual criticisms of President Barack Obama’s foreign policy moves in 2012, declaring the Wisconsin Republican’s assertions “a bunch of malarkey.”\n\nWhen Dan Quayle, or Al Gore, or Dick Cheney defended their president’s agenda and brushed off the latest scandals and criticisms, and didn’t let interlocutors drive a wedge between them and the presidents that they served, they were good soldiers.\n\nYet Harris discovered that being a good soldier doesn’t necessarily help when the vice president is contending for the highest elective office in the land. After Biden stumbled badly in a nationally televised debate with Trump last June, Harris went on several shows to make the issue anything other than the horror show Americans who watched had seen unfold before their eyes.\n\nIn the best-case scenario, the debate was a cold-driven, not-good, very-bad night for President Biden. In the worst-case scenario, it seemed more like elder abuse of an old man who was losing cognitive function, by those in the White House who wanted to retain their positions of power.\n\nBiden would shortly drop out and endorse Harris. The Democrats rubber-stamped that decision in a “virtual roll call” before they even filled the convention hall. As her party’s nominee, she was asked on a sympathetic program, The View, what she might have done differently as president over the past four years.\n\n“I had prepped for that question; I had notes on it,” Harris writes. For instance, “I had a note that I was a new and different generation. And I had this: But to specifically answer your question, throughout my career, I have worked with Democrats, independents, and Republicans, and I know that great ideas come from all places. If I’m president, I would appoint a Republican to my Cabinet.”\n\nYet in the moment, she “didn’t say any of that.” Instead, Harris, the good soldier, said there was “not a thing that comes to mind” that she would have done differently.\n\nHarris writes that she continued to talk on, blithely unaware that she’d “just pulled the pin on a hand grenade” that would help to destroy her chances of retaining the White House for her party.\n\nFrom soldiers to orphans\n\n“Victory has 1,000 fathers, but defeat is an orphan.” The saying from antiquity, dusted off and popularized by President John F. Kennedy, aptly summarizes the fate of failed presidential campaigns.\n\nNobody wants to take the blame for such a large failure. This typically includes the candidate, who will often grasp at other explanations. The distancing often leads to a falling out between former presidents and their former understudies who didn’t quite land the big role.\n\nGore and President Bill Clinton had what has been characterized as a “shouting match” following the then-vice president’s narrow defeat by then-Texas Gov. George W. Bush, the 2000 GOP nominee. Bush relied on Cheney as a trusted adviser until the war in Iraq went badly and cost the GOP its congressional majority, whereupon the vice president was largely frozen out of the Oval Office.\n\nObama reportedly helped shoulder Biden aside twice — first to make way for Hillary Clinton and then to make room for Harris. People close to Biden have suggested that he didn’t drop out earlier because he didn’t feel like Harris was up to the job of beating Trump.\n\nOf course, all of that pales in comparison to Trump’s epic falling out with his first vice president, Pence. Facing defeat in the Electoral College in early 2021, Trump claimed the election had been stolen. He also tried all kinds of stratagems to get around that defeat. Trump’s team solicited alternative electors to muddy the waters and encouraged protests around the country and in Washington, D.C.\n\nOne of those protests, at the Capitol Building on Jan. 6, 2021, got out of hand, to say the least. The events of that day led to several injuries; one protester being shot fatally; one police officer dying later from a heart attack that certainly wasn’t helped by the day’s stress; the iconic image of a man with a bare upper torso, face paint, and horned bison hat invading the Senate chamber; over 1,000 criminal federal charges; and Trump’s second impeachment.\n\nTrump expected Pence to go along with his post-election efforts to retain the White House, which endangered Pence and many members of Congress in the process. Pence ultimately refused. Trump thus condemned him and treated him as an enemy. Four years later, Pence would run against Trump in the Republican primaries.\n\nHarris saw that divide as a rhetorical slam dunk, proving Trump needed to be stopped.\n\n“There’s one person on that stage who has the endorsement of their vice president, and that’s Joe Biden,” she said after Biden stumbled.\n\nBut in many smaller ways, Harris peppers her narrative with places where the Biden White House undercut her or failed to support her. For instance, she complains that “When Republicans mischaracterized my role as ‘border czar,’ no one in the White House comms team helped me to effectively push back and explain what I had really been tasked to do, nor to highlight any of the progress I had achieved.”\n\nTrump’s second vice president, JD Vance, is young (40) and has apparent ambitions for the White House. On the campaign trail and in office, he has played the good soldier well. Vance is the official whom Trump could count on to go to Europe to quite literally make the leaders cry. But Trump demands a lot from his supporters and doesn’t always reciprocate. If Vance stumbles in his pursuit of the Oval Office, we shouldn’t be surprised to see a future falling out.\n\nJeremy Lott is the author of several books, including The Warm Bucket Brigade: The Story of the American Vice Presidency.","summary":"“I was the only person who would preserve [Joe Biden’s] legacy,” former Vice President Kamala Harris writes in her new campaign memoir,&#160;107 Days. “At this point, anyone else was bound to throw him — and all the good he had achieved — right under the bus.” The pose Harris struck and held through her unsuccessful [&#8230;]","url":"https://www.washingtonexaminer.com/premium/3830633/kamala-harris-memoir-jd-vance-vice-president-role/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/WB.WhiteHouse.100825.jpg?w=696","video":null,"publish_date":"2025-10-03 09:50:00","author":"Jeremy Lott","authors":["Jeremy Lott"],"language":"en","source_country":"US","sentiment":-0.109},{"id":365818212,"title":"Generational fight in budding Massachusetts Democratic Senate primary","text":"Moulton is openly talking up a potential challenge to Markey in the Sept. 1, 2026, primary by invoking a reviled figure among Massachusetts and most other Democrats: President Donald Trump.\n\n“Democrats are not satisfied with the status quo,” Moulton said in a Sept. 28 appearance on CNN’s Inside Politics Sunday, suggesting not so subtly that Markey’s time has passed. Markey entered the House in November 1976 and moved across the Capitol to the Senate nearly 37 years later, after winning a July 2013 special election.\n\n“Everyone knows we are opposed to Trump, but what are we going to do differently?” Moulton said in a test run of campaign themes if he does enter the Democratic primary fray.\n\nMarkey-Moulton differences more attitudinal than policy-based\n\nWhether Markey wins reelection or Moulton ousts him in the Democratic Senate primary, Massachusettsans wouldn’t see much difference in their voting records. Each routinely backs the Democratic Party line in their respective chambers of Congress.\n\nThat’s not particularly surprising, given that Massachusetts is one of the nation’s bluest states. In 2024, Democratic presidential nominee Kamala Harris, the sitting vice president, beat now-President Donald Trump 61%-36%.\n\nDemocrats so dominate the Massachusetts electoral landscape that it’s become a social media parlor game of sorts among political junkies to see if it’s even demographically possible for a Republican-leaning House district to be drawn in Massachusetts. The consensus, such as it is, focuses on a putative district in the state’s lower tier, stretching from the working-class city of Wrentham, near the Rhode Island state line, to fishing-heavy communities in and around the city of New Bedford.\n\nStill, differences between Moulton and Markey are clear, though more attitudinal than policy-based.\n\nMoulton, first elected to the House in 2014 by ousting a scandal-tarred incumbent in the Democratic primary, has recently become an outspoken critic of his party’s “woke” tendencies. Representing a North Shore House district, Moulton expressed opposition to transgender athletes in girls’ sports.\n\n“Democrats spend way too much time trying not to offend anyone rather than being brutally honest about the challenges many Americans face,” Moulton said in November 2024, immediately after Trump won a second, nonconsecutive term over Harris.\n\n“I have two little girls; I don’t want them getting run over on a playing field by a male or formerly male athlete,” Moulton said. “But as a Democrat, I’m supposed to be afraid to say that.”\n\nThe angry reaction among some Democrats seemed to prove his point. Moulton’s campaign manager resigned in protest. And criticism came in hot and heavy from local elected officials in his northeastern Massachusetts district.\n\nStill, that approach could play well in a statewide Democratic primary that would force candidates to appeal beyond the Cambridge-liberal set. Moulton might still have some appeal there, having earned a bachelor’s and two master’s degrees from Harvard University, sandwiched around Marine Corps service in Iraq, where he earned two Bronze Stars and other military commendations.\n\nMarkey’s nearly 50 years in office\n\nMarkey, though, is no slouch when it comes to navigating the often rocky and factional political shoals of Bay State Democratic politics. He’s been a progressive leader for decades on healthcare, foreign policy, telecommunications, climate change, and a range of other issues from his early congressional days representing a House district taking in most of Boston’s northern suburbs, through his current Senate role.\n\nWhile associated with left-wing causes such as the Green New Deal, Markey can also talk up his working-class roots. The product of Catholic schools, Markey, as a young man, was the driver and salesperson for an ice cream truck in Lexington, Massachusetts. He used the proceeds to pay his Boston College tuition for undergraduate and law school, and a long political career followed, starting with a four-year Beacon Hill stint as a state legislator and then a congressional run approaching 50 years.\n\nHow vulnerable Markey might be to charges that he’s too old and politically past his peak is an open question. Moulton would have to go directly at the issue, in challenging a long-tenured lawmaker who could be his father. Moreover, Markey would likely paint the primary challenge against him as motivated only by raw political ambition, not public policy and legislative acumen. Moulton, after all, briefly sought the 2020 Democratic presidential nomination. He quit the race in August 2019 after four months, having failed to qualify for televised Democratic primary debates.\n\nMoulton’s Senate primary rationale, stated or otherwise, rests on the enduring public image of former President Joe Biden, who withdrew from his 2024 reelection bid after a disastrous debate against Trump revealed limitations of being in office at age 82 and beyond. Subsequent congressional investigations, post-campaign books, and news stories have only hardened public opinion that, with his mental acuity faltering and physical stamina limited, Biden should have stepped aside after a single term.\n\nThe issue, though, may play differently in a Senate race. No matter how prominent senators are, they’re not in the public eye like a president. The late Sen. Dianne Feinstein, a California Democrat, spent her final years in a state of mental and physical decline. Feinstein did face enough public scrutiny that fellow Senate Democrats pushed her out of key committee positions, but she largely did her job quietly before her Sept. 29, 2023, death at age 90. Sen. Chuck Grassley (R-IA) is the oldest member of the chamber at 92, followed by Sen. Bernie Sanders (I-VT) at age 84.\n\nAnd Markey has defeated whippersnapper-type political foes before. In 2020, Markey easily won reelection over Joe Kennedy, who was finishing up eight years in the House and sports one of the two most famous names in American politics, along with the Bushes, in the Democratic primary. Kennedy, a grandson of Attorney General and New York Sen. Robert F. Kennedy and a grandnephew of President John F. Kennedy, had trouble articulating any real policy differences with the Senate incumbent. Markey won easily, 55.4%-45.6%.\n\nAt least one other possible Markey 2026 Democratic Senate primary rival stood down from challenging him. Rep. Jake Auchincloss (D-MA) has been raising his public profile beyond his congressional district, covering western Boston suburbs and Bristol County.\n\nPOLITICAL VIOLENCE ON THE RISE IN THE US: A TIMELINE OF KEY INCIDENTS\n\nAuchincloss, 37, was widely viewed as a possible Markey Democratic Senate rival, even younger than Moulton and similarly hypercredentialed: a bachelor’s degree from Harvard, master’s degree from the Massachusetts Institute of Technology, plus service in the Marines in Afghanistan, commanding infantry in Helmand Province and leading combat patrols through villages contested by the Taliban. Back stateside, Auchincloss did a stint on the Newton City Council, in an immediate Boston suburb brimming with professional types in law, the sciences, academia, business, and other realms. In 2020, Auchincloss won a crowded Democratic primary race to replace Kennedy in Massachusetts’s 4th Congressional District and cruised to victory in the general election.\n\nAuchincloss, though, demurred from challenging Markey in the 2026 election cycle. Moulton would be making a different political bet if he ran in the Massachusetts Senate Democratic primary — one with a big payoff but still likely long odds.","summary":"Fortune favors the bold. Conversely, most high-risk bets don’t pay off. Rep. Seth Moulton (D-MA) will meet one of those contrasting political fates if, as expected, he launches a 2026 primary challenge against Sen. Ed Markey (D-MA). A Moulton Senate Democratic primary bid in Massachusetts, tantamount to victory in the deep blue state, would come [&#8230;]","url":"https://www.washingtonexaminer.com/premium/3829176/generational-fight-massachusetts-democratic-senate-primary-seth-moulton-ed-markey/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/WB.Congress.100825.jpg?w=696","video":null,"publish_date":"2025-10-03 09:45:00","author":"David Mark","authors":["David Mark"],"language":"en","category":"politics","source_country":"US","sentiment":0.17},{"id":365797870,"title":"Intersex professor fears she will be forced to lie by teaching ‘only male and female’","text":"An associate professor at The University of New Mexico says that she is concerned she will be forced to lie and teach that there are only two genders, male and female. Georgiann Davis, an associate professor at The University of New Mexico, wrote in an op-ed Thursday in the Los Angeles Times that she is concerned about being forced to lie when speaking about sexuality. The piece was headlined, \"I’m an intersex professor. Am I supposed to lie by teaching ‘only male and female’?\" She noted a viral video on Reddit of a Texas A&M student questioning Professor Melissa McCoul over rhetoric on \"gender and sexuality\" and \"gender ideology.\" McCoul shared a graphic of a purple \"gender unicorn\" that's used to teach on differences on gender identity and sexuality, according to The Texas Tribune. TEXAS TECH TELLS FACULTY TO REVISE INSTRUCTION, RECOGNIZE ONLY 2 SEXES IN CLASSROOMS \"Um, I just have a question because I’m not entirely sure this is legal to be teaching,\" the female asked in the video referred to by Davis. \"Because according to our president, there’s only two genders…. And this also very much goes against not only myself, but a lot of people’s religious beliefs.\" McCoul was eventually fired over what the university claimed was teaching content inconsistent with her own course's description. A statement from former Texas A&M President Mark A. Welsh III, who recently stepped down from his role, addressed the controversy in a post last month on Texas A&M’s X account. \"I learned this afternoon that key leaders in the College of Arts and Sciences approved plans to continue teaching course content that was not consistent with the course’s published description,\" Welsh said. \"As a result, I directed the provost to remove the dean and department head from their administrative positions, effective immediately.\" Davis said she is worried about \"consequences\" if she teaches \"honestly.\" \"As someone who also teaches in the Southwest, I find myself scared — scared of what consequences might follow if I teach well and honestly,\" Davis wrote. \"Especially now, as misinformation about bodies spreads, with President [Donald] Trump and others insisting people are exclusively male or female — a narrow, politically charged ‘gender ideology’ of their own invention,\" she added. KAMALA HARRIS REVEALS RESERVATIONS ABOUT TRANSGENDER ATHLETES IN WOMEN'S SPORTS IN NEW BOOK Davis, who was born with \"a vagina but no ovaries, uterus or fallopian tubes\" as well as \"XY chromosomes and internal, undescended testes,\" said she is concerned about having to lie to her students about sexuality. \"So I ask myself: Should I lie to my students,\" Davis wrote. \"Should I deny that intersex people exist as a biological reality? Should I pretend, as the Texas A&M student wishes and Trump supports, that sex is a simple binary that perfectly aligns with gender and a simplistic view of sexuality?\" The professor, who is the author of \"Contesting Intersex: The Dubious Diagnosis,\" and \"Five Star White Trash,\" said that intersex people are a \"biological fact,\" and that Trump’s rhetoric on there only being two genders is \"scientifically wrong.\" The Cleveland Clinic estimates that 1 in 100 Americans are intersex, and about 2% of people around the world have intersex characteristics. \"This is why I’m scared to do my job,\" Davis wrote. \"Should I stand before my students and lie to them about biological reality? That would be the only way to comply with an order to acknowledge only males and females; informed and honest teachers cannot go along with that fiction.\" ETHICS PROFESSOR SUES UNIVERSITY, SAYS HE WAS FIRED OVER CRITICISM OF GENDER POLICIES In a statement to Fox News Digital, Davis said that she feels it is a lie to teach there are two genders, \"because sex isn't as simple as male or female, which any honest biologist, endocrinologist, gynecologist, geneticist... the list is endless... will tell you.\" \"And I refuse to lie to my students about the existence of intersex people because of some political ideological war,\" Davis added. \"I prefer facts. I was born with a vagina and internal testes. That's not an ideology. That's reality.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Intersex associate professor Georgiann Davis worries about lying to students about biological reality amid political pressure to teach only male and female genders.","url":"https://www.foxnews.com/media/intersex-professor-fears-she-forced-lie-teaching-only-male-female","image":"https://static.foxnews.com/foxnews.com/content/uploads/2022/01/CRT-classroom.jpg","video":"https://www.foxnews.com/video/6377532916112","publish_date":"2025-10-03 09:30:03","author":"Rachel Del Guidice","authors":["Rachel Del Guidice"],"language":"en","source_country":"us","sentiment":0.213},{"id":365786718,"title":"Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals","text":"NEW YORK (AP) — President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the federal workforce and punishing Democratic states.\n\nIn a post on his Truth Social site Thursday morning, Trump announced he would be meeting with his budget chief, “Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.”\n\nThe comments represented a dramatic about-face for Trump, who spent much of last year denouncing Project 2025, The Heritage Foundation’s massive proposed overhaul of the federal government, which was drafted by many of his longtime allies and current and former administration officials.\n\nBoth of Trump’s Democratic rivals, Joe Biden and Kamala Harris, made the far-right wish list a centerpiece of their campaigns, and a giant replica of the book featured prominently onstage at the Democratic National Convention.\n\n“Donald Trump and his stooges lied through their teeth about Project 2025, and now he’s running the country straight into it,” said Ammar Moussa, a former spokesperson for both campaigns. “There’s no comfort in being right — just anger that we’re stuck with the consequences of his lies.”\n\nShalanda Young, director of the Office of Management and Budget under Biden, said the administration had clearly been following the project’s blueprint all along.\n\n“I guess Democrats were right, but that doesn’t make me feel better,” she said. “I’m angry that this is happening after being told that this document was not going to be the centerpiece of this administration.”\n\nAsked about Trump’s reversal, White House spokesperson Abigail Jackson said, “Democrats are desperate to talk about anything aside from their decision to hurt the American people by shutting down the government.”\n\nProject what?\n\nTop Trump campaign leaders spent much of 2024 livid at The Heritage Foundation for publishing a book full of unpopular proposals that Democrats tried to pin on the campaign to warn a second Trump term would be too extreme.\n\nWhile many of the policies outlined in its 900-plus pages aligned closely with the agenda that Trump was proposing — particularly on curbing immigration and dismantling certain federal agencies — others called for action Trump had never discussed, like banning pornography, or Trump’s team was actively trying to avoid, like withdrawing approval for abortion medication.\n\nTrump repeatedly insisted he knew nothing about the group or who was behind it, despite his close ties with many of its authors. They included John McEntee, his former director of the White House Presidential Personnel Office, and Paul Dans, former chief of staff at the U.S. Office of Personnel Management.\n\n“I know nothing about Project 2025,” Trump insisted in July 2024. “I have no idea who is behind it. I disagree with some of the things they’re saying and some of the things they’re saying are absolutely ridiculous and abysmal. Anything they do, I wish them luck, but I have nothing to do with them.”\n\nTrump’s campaign chiefs were equally critical.\n\n“President Trump’s campaign has been very clear for over a year that Project 2025 had nothing to do with the campaign, did not speak for the campaign, and should not be associated with the campaign or the President in any way,” wrote Susie Wiles and Chris LaCivita in a campaign memo. They added, “Reports of Project 2025’s demise would be greatly welcomed and should serve as notice to anyone or any group trying to misrepresent their influence with President Trump and his campaign — it will not end well for you.”\n\nTrump has since gone on to stock his second administration with its authors, including Vought, “border czar” Tom Homan, CIA Director John Ratcliffe, immigration hard-liner Stephen Miller and Brendan Carr, who wrote Project 2025’s chapter on the Federal Communications Commission and now chairs the panel.\n\nHeritage did not respond to a request for comment Thursday. But Dans, the project’s former director, said it’s been “exciting” to see so much of what was laid out in the book put into action.\n\n“It’s gratifying. We’re very proud of the work that was done for this express purpose: to have a doer like President Trump ready to roll on Day One,” said Dans, who is currently running for Senate against Lindsey Graham in South Carolina.\n\nTrump administration uses the shutdown to further its goals\n\nSince his swearing in, Trump has been pursuing plans laid out in Project 2025 to dramatically expand presidential power and reduce the size of the federal workforce. They include efforts like the Department of Government Efficiency and budget rescission packages, which have led to billions of dollars being stalled, scrapped or withheld by the administration so far this year.\n\nThey are now using the shutdown to accelerate their progress.\n\nAhead of the funding deadline, OMB directed agencies to prepare for additional mass firings of federal workers, rather than simply furloughing those who are not deemed essential, as has been the usual practice during past shutdowns. Vought told House GOP lawmakers in a private conference call Wednesday that layoffs would begin in the next day or two.\n\nThey have also used the shutdown to target projects championed by Democrats, including canceling $8 billion in green energy projects in states with Democratic senators and withholding $18 billion for transportation projects in New York City that have been championed by Senate Democratic Leader Chuck Schumer and House Democratic leader Hakeem Jeffries in their home state.\n\nDreaming of this moment\n\nThe moves are part of a broader effort to concentrate federal authority in the presidency, which permeated Project 2025.\n\nIn his chapter in the blueprint, Vought made clear he wanted the president and OMB to wield more direct power.\n\n“The Director must view his job as the best, most comprehensive approximation of the President’s mind,” he wrote. Vought described OMB as “a President’s air-traffic control system,” which should be “involved in all aspects of the White House policy process,” becoming “powerful enough to override implementing agencies’ bureaucracies.”\n\nSen. Mike Lee, R-Utah, said on Fox News Channel that Vought “has a plan, and that plan is going to succeed in further empowering Trump. This is going to be the Democrats’ worst nightmare.”\n\nHouse Speaker Mike Johnson echoed that message, insisting the government shutdown gives Trump and his budget director vast power over the federal government and the unilateral power to determine which personnel and policies are essential and which are not.\n\nSchumer has handed “the keys of the kingdom to the president,” Johnson said Thursday. “Because they have decided to vote to shut the government down, they have now effectively turned off the legislative branch … and they’ve turned it over to the executive.”\n\nYoung said the Constitution gives the White House no such power and chastised Republicans in Congress for abandoning their duty to serve as a check on the president.\n\n“I don’t want to hear a lecture about handing the keys over,” she said. “The keys are gone. They’re lost. They’re down a drain. This shutdown is not what lost the keys.”\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"NEW YORK (AP) —&#160;President Donald Trump&#160;is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of...","url":"https://whdh.com/news/trump-no-longer-distancing-himself-from-project-2025-as-he-uses-shutdown-to-further-pursue-its-goals/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/06/Trump-angry-e1751637314638.jpg?quality=60&strip=color","video":null,"publish_date":"2025-10-03 09:06:05","author":"Associated Press,James Kukstis","authors":["Associated Press","James Kukstis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.186},{"id":365869256,"title":"America’s Greatest Mistake","text":"This article appears in the October 2025 issue of The American Prospect magazine. Subscribe here.\n\nBy David J. Lynch\n\nPublicAffairs\n\nFor a time, globalization was synonymous with utopia: the untrammeled flow of capital across borders, new markets waiting to be opened, the growth of developing nations flaunting their comparative advantage in manufacturing jobs. If you covered the chaotic end of Suharto’s rule in Indonesia, the ruble crisis in Russia, China’s integration into global markets, and the plight of abandoned American workers, however, you may be convinced globalization is the single-best explanation for the economic upheaval and political polarization of our current age.\n\nThis is where David J. Lynch, a longtime global economics reporter for The Washington Post, has landed. For years, he has covered every major trade agreement and its impact on workers around the world. In The World’s Worst Bet: How the Globalization Gamble Went Wrong (And What Would Make It Right), he delivers a new history of the euphoric rise and eventual backlash of this era of the connected world.\n\nLiving through the past decades, you may feel like you know the story all too well. But by focusing on the tension between capital and labor, he brings fresh insight to the weighty decisions and missteps that brought us from the heady days of neoliberalism to the full-on return of a nationalist world order.\n\nLynch structures the book as a narrative autopsy of each presidential administration’s respective failures to shield the American worker from globalization’s most backbreaking consequences. Anchored in exhaustive reporting and dozens of interviews with those who built or challenged the system, it is a Greek tragedy of messianic, world-shaking hubris, starring an elite class of politicians whose betrayal of working-class Americans helped trigger a populist surge that has engulfed the world.\n\nIN THE 1990s, PRESIDENT BILL CLINTON viewed globalization as an unparalleled force for spurring prosperity at home and spreading political liberalization abroad. He lifted barriers to trade, signing the North American Free Trade Agreement (NAFTA) and bringing China into the World Trade Organization (WTO), which was founded in 1995 to establish the rules of global commerce.\n\nWhile most Americans supported China’s accession to the WTO, nearly three-fifths believed that workers at home would suffer. In the academy, economist Dani Rodrik argued that gains for investors and high-skilled labor would come at the expense of low-skilled and less-educated workers, whose jobs would be taken by Chinese labor. Over time, Rodrik added, this gap would foment social and political tensions, while increased mobility of capital would make it easier for corporations and the rich to dodge taxation.\n\nClinton wasn’t ignorant of such concerns, Lynch notes. Yet he saw himself as a realist. Companies had been shifting blue-collar jobs overseas anyway; better that the U.S. get some benefits in the exchange. To offset the pain for workers, he turned to his party’s favored solution since the Kennedy years: “trade adjustment assistance” (TAA), or investments in job training, infrastructure, and technology to ease workers into more productive industries.\n\nTAA had long underperformed, thanks in part to cumbersome application processes that sharply limited enrollment, Lynch writes. Only 10 percent of eligible workers received benefits. Yet Clinton still saw TAA as the cure for what he was about to unleash on workers, including a version of it in NAFTA. Whether due to deficit hawks in Clinton’s own party or House Republicans who took over after the 1994 midterm elections, TAA once again failed to deliver much more than meager charity for workers undercut by offshoring.\n\nAfter NAFTA’s signing, factory employment remained stable. But workers most exposed to competition from Mexico were hit hard, spurring working people to believe the Democratic Party had abandoned them and fueling a wave of anti-globalization protests that crested at the WTO’s meeting in Seattle in 1999. Led by trade expert Lori Wallach, activists succeeded in blocking new trade talks, but only after a violent crackdown by authorities.\n\nChina started slashing tariffs and courting investors in the early 1990s. After joining the WTO, it revised thousands of regulations in accordance with the body’s rules. In the first six years of its membership, U.S. investment in China more than doubled, and firms devised globe-spanning, super-lean supply chains, slashing inventories by almost a third between 1992 and 2005. “Just-in-time” logistics exacerbated the risks of supply chain disruption, but executives saw them as a boon for their stock prices, Lynch writes. And with China committing to market liberalization, political reform would soon follow. Or so the end-of-history thinking went.\n\nThen unexpected things began to happen. Imports from China spiked by 50 percent in the first three years of its membership in the WTO; wasn’t it supposed to go the other way around? Beijing also began flouting its trade commitments, particularly around subsidy phaseouts.\n\nPerhaps the most alarming development was the hollowing out of blue-collar America. In 2016, economists David Autor, David Dorn, and Gordon Hanson published a paper on the “China shock,” estimating that low-wage Chinese competition had taken some 2.4 million American jobs from 1999 to 2011. While companies benefited from cheaper Chinese products, slightly increasing U.S. employment, the job losses that did occur were concentrated among less-educated and less-skilled Americans, just as Rodrik predicted.\n\nWITH A FEW INEFFECTUAL EXCEPTIONS, the Republican Party under George W. Bush showed little interest in either trade enforcement against China or trade adjustment assistance for impacted workers. By the mid-2000s, Washington was spending a smaller share on education and training than it did at the end of the Cold War. Even the halting efforts toward protectionism were ill-fitting. Bush, heeding the lessons of the Democrats’ fallout with West Virginia steelworkers, tried to use tariffs to protect their industry, only to have the WTO rule them illegal.\n\nThe massive trade surplus with America meant China was flush with dollars that it plowed into low-risk U.S. Treasurys. Eventually, Beijing became the single-biggest holder of U.S. government debt, giving it immense power over Washington. For Americans, it also helped keep borrowing costs low. This would prove toxic. Bush argued that construction jobs created by the ill-fated housing boom could help fill the gap left by the vanishing manufacturing sector. When the bubble popped, so did the remnants of that strategy.\n\nAs a senator, Barack Obama observed that globalization had “changed the rules of the game,” leading to the loss of jobs, health care, and retirement security. As president, Obama’s Affordable Care Act and stimulus would attempt to stanch some of the bleeding. But few of his insights about globalization carried over to his presidency, even as Beijing’s litany of misbehaviors expanded.\n\nUndervaluing the yuan made China’s exports ultra-cheap. Its state-backed corporate espionage operation was responsible for an estimated 50 to 80 percent of global intellectual property theft. Stories emerged of Chinese regulators coercing U.S. companies into reincorporating in their country or even selling to state-backed private equity funds for a fraction of their value.\n\nYet Obama would continue to regard globalization as the righteous path, while continuing to inadequately compensate the policy’s losers. In 2011, Goodyear closed a plant in Union City, Tennessee, laying off 1,900 employees. Of those who finished TAA-funded training, only a little over one-third found work in their new fields, Lynch writes. Those who did saw their earnings shrink, in some cases by half.\n\nTo sway China’s neighbors into the U.S. sphere of influence, Obama pushed for the Trans-Pacific Partnership, a 12-nation free-trade pact with Asian and South American countries. Wallach, Republican attorney Robert Lighthizer, and a cadre of anti-globalization activists viewed the TPP’s pro-business protections, including a provision allowing companies to sue governments for passing laws that weaken future profits, as evidence that corporations would continue to take precedence over labor and the environment. White House polling showed that while college-educated Democrats and left-leaning independents generally supported the TPP, Republicans no longer supported trade deals, with particularly fierce opposition from non-college-educated whites.\n\nObama ultimately secured a “fast-track” process allowing a yes-or-no vote on the TPP’s passage, but only after 151 House Democrats voted against his initial attempt. In the end, both candidates in the 2016 presidential election turned against the TPP, and the winner rejected it on his first day in office.\n\nIN DONALD TRUMP’S OPINION, free trade had allowed a cabal of global elites to destroy American workers, either replacing them with faceless hordes of immigrants or shipping their jobs overseas. On the campaign trail, he warned that Hillary Clinton, who had backed the TPP before later rejecting it, would extend her husband’s trade legacy—a potent, effective attack.\n\nAfter plowing through the GOP primary field and defeating Clinton, Trump declared war on trade, setting about renegotiating NAFTA, engaging China in contentious trade talks, and tasking Lighthizer, his top trade official, to use targeted tariffs in a blunt attempt to force reshoring.\n\nYet his nationalist agenda, assembled without any input from labor groups, fell short, Lynch writes. The United States-Mexico-Canada Agreement, NAFTA’s successor, largely resembled its predecessor. With China, Trump suspended a threatened second round of tariffs in exchange for a promise from President Xi to buy more U.S. goods. Structural concerns that Lighthizer had raised around things like intellectual property went unaddressed.\n\nCOVID-19 initially ground the world economy to a halt, but quarantining consumers, boosted by federal aid, started shelling out for furniture and fitness gear. Panic buying exacerbated shortages of everything from medical equipment to computer chips. The world had absorbed the risks from hyper-lean global supply chains before, notably after the 2011 tsunami that hit Fukushima, Japan. But businesses were completely unprepared for rapid consumer shifts and haphazard lockdowns at Chinese factories.\n\nAs a result, inflation jumped to levels not seen in nearly half a century. By the end of January 2021, ocean-shipping costs had skyrocketed by 80 percent. Executives around the world were forced to accept that just-in-time may have gone just a bit too far.\n\nJoe Biden had backed NAFTA and Beijing’s integration into the global economy as a senator. But the China shock changed his mind, convincing him to vote against trade agreements and support punishing China for devaluing its currency. As vice president in the age of Occupy and the Tea Party, he questioned whether free trade could deliver for working Americans.\n\nAs president, Biden pledged to break with globalization and re-center U.S. workers, with hundreds of billions in fresh spending for American-made computer chips and clean energy, leading to record-high spending on factory construction. Defying environmentalists, he slapped a 100 percent tariff on China’s electric-vehicle sector and other clean-energy components, while keeping in place the bulk of Trump’s tariffs. Yet there was little hope of reversing a 70-year slide in manufacturing employment, one fueled largely by automation, and, later, by NAFTA and the China shock.\n\nIn the 2024 election, the Democrats would be doomed in part by Biden’s pursuit of a second term despite his evident infirmity. But Vice President Kamala Harris’s failure to articulate a working-class economic agenda and speak to voter concerns about runaway inflation once she replaced him on the ticket showed, yet again, how little the party had learned.\n\nSince reclaiming the presidency, Trump has decimated large parts of the federal bureaucracy, delivered a massive tax cut for the rich, launched a deportation army, and unleashed a flurry of new trade wars. Without Lighthizer’s steadying hand, the tariff regime has been chaotic, and unpopular amid inflation fears. It has not delivered promised benefits for workers; manufacturing employment has fallen for six straight months as of August, and the spike in factory construction is over.\n\nEven amid the tariff wars, nearly $600 billion worth of merchandise passes between the two nations each year. And China remains an irreplaceable supplier for American manufacturing. Those salivating for a true break may be disappointed, Lynch suggests.\n\nNEAR THE END OF THE BOOK, Lynch presents a statistic sure to haunt even the most die-hard globalization evangelist: In places hit hardest by China’s rise, Washington has spent more than 30 times as much per person on lifetime disability benefits than on TAA.\n\nFor the true believers, Lynch recommends some soul-searching. Writing off defenses of the manufacturing work central to the fabric of countless small towns as “ignorant protectionism” appears to have done little good. “Treating the livelihoods of individuals and communities as just another variable in an equation might be the right way to run a regression, but it was the wrong way to win and hold political power,” he writes.\n\nYet these individuals and communities are largely absent from his book. So too is any extended discussion of trade’s disparate impact on different ethnic groups, much less between genders. Lynch’s policy prescriptions also feel unsatisfying: He recommends rebuilding our tattered social safety net via higher corporate tax rates and a renewed commitment to ending tax avoidance. For Lynch, proposing policies seems less important than forcing a reckoning with a world of borderless capital, an all-powerful China, and populist tumult.\n\nInevitably, Lynch’s book leads him back to Bill Clinton, the man who started it all. While he accepts that globalization hasn’t worked out the way he’d hoped, he regards the backlash as a combination of economic, social, and cultural factors. In his mind, there’s still time to find a new script for globalization, and this time, to do right by the American worker. “The obligation of the government is to minimize loss and find people something else to do so we can keep growing.”","summary":"Globalization left millions behind as a policy and transformed the world politically, a new book argues.","url":"https://prospect.org/culture/books/2025-10-03-americas-greatest-mistake-globalization-lynch-review/","image":"https://prospect.org/downloads/23624/download/OCT25%20Mahanta.jpg?cb=f5b6fcc2d9f81ce0d256e7b9977280a7&w=1024","video":null,"publish_date":"2025-10-03 09:00:00","author":"Siddhartha Mahanta","authors":["Siddhartha Mahanta"],"language":"en","source_country":"us","sentiment":0.453}]}