{"offset":0,"number":50,"available":3883,"news":[{"id":255662724,"title":"How ABC's Presidential Debate Will Work as Harris Campaign Accepts Rules","text":"The rules have been set for next week's presidential debate between Vice President Kamala Harris and former President Donald Trump.ABC News on Wednesday released guidelines for the September 10 debate, which will be moderated by the network's David Muir and Linsey Davis and feature 90 minutes of debate time, marking the 2024 candidates' first faceoff.The guidelines were released a few minutes after Reuters reported that Harris had accepted the network's debate rules, according to a source familiar with the matter. The vice president's team had pushed for the microphones to be left on throughout the debate, contrary to moderators' plans to mute a candidate's microphone when it isn't their turn to speak. Trump's team had pushed back on Harris' request, arguing that the candidates already agreed to have the same rules as the June 27 debate between Trump and President Joe Biden.ABC said that a virtual coin toss was held on Tuesday to determine the candidates' podium placement and the order of closing statements. Trump won the toss and chose to offer the final closing statement, while Harris chose to stand at the podium positioned on the right side of viewers' screens.There will be no live audience at the event, which will take place at the National Constitution Center in Philadelphia. Both candidates will stand throughout the duration of the debate and no props or pre-written notes are allowed, per ABC.Each candidate will have two minutes to answer moderators' questions, and will be given a two-minute rebuttal to respond to their opponents' answers. There will be no opening statements, and closing statements will also be given a two-minute slot.The debate will air at 9 p.m. EST September 10 on ABC News' live 24/7 streaming network, as well as Disney+ and Hulu. ABC station WPVI will also show the event.This is a developing story and will be updated as further information becomes available.","summary":"The network released its guidelines for next week's debate between Harris and Trump.","url":"https://www.newsweek.com/how-abcs-presidential-debate-will-work-harris-campaign-accepts-rules-1949026","image":"https://d.newsweek.com/en/full/2464183/trump-harris.png","video":null,"publish_date":"2024-09-05 00:20:05","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.228},{"id":255662482,"title":"Tulsi Gabbard Tried To Clean Up Trump’s Arlington Scandal And It Didn’t Go Great","text":"Last updated on September 2nd, 2024 at 02:27 pm Trump put Tulsi Gabbard on CNN to clean up the aftermath of his Arlington National Cemetery scandal, and there were some problems. Video: Dana Bash presses Tulsi Gabbard on Trump’s illegal campaign event at Arlington National Cemetery, and Gabbard doesn’t offer any proof that Trump didn’t break the law. pic.twitter.com/oK0OGIVL5S â Sarah Reese Jones (@PoliticusSarah) September 1, 2024 Transcript via CNN:BASH: Yes, three years ago. The question is about the federal law and Arlington’s rules that prohibit partisan or political activities at national cemeteries. And the military and also other members of other families who are buried right near there are upset about the campaign filming it and posting the video online. Do you believe that was appropriate? GABBARD: I checked with the campaign on this question, and they have exchanges with the officials at Arlington Cemetery. They were approved to bring a camera there to document this historic and momentous day that should not be forgotten by any American. And to have a former president there and joining these Gold Star families, I know President Trump wanted to share that with others, especially given the fact that President Biden and Harris, I heard, were invited by some of these family members. They not only didn’t come. They didn’t even respond to that invitation. And now to have Kamala Harris put this statement out yesterday saying that she stands with these families, she stands with the military and with veterans, you only have to look at the response that came from the Gold Star families of these 13 service members of how offended they were by that statement, given she has not made any effort, not on that third anniversary or any other time, to call them directly to offer her condolences and even apologies for their decisions that led to the loss of their loved ones. BASH: Do you think that the campaign will release that communication that you’re talking about? Because the Army is saying… GABBARD: I thought they already had. But… BASH: … very clearly, very clearly that was — that they broke the rules, because it was clearly put out online pictures, video meant as a part of his campaign. GABBARD: I thought they already had. I was informed that they had come to an agreement, they could bring a camera there. And as far as I know, in the public statements I have seen from the Army is that the matter is closed. BASH: I think the matter is closed about the altercation, alleged altercation, which you didn’t see, but I’m not sure it’s closed with the idea that they seem to have broken the rules and perhaps even federal law by putting out the campaign video. Tulsi Gabbard wasn’t helping, although she did repeat the Trump lie that Biden and Harris wouldn’t show up at the event. The reason why Biden and Harris didn’t attend was because it was a Trump campaign event. Gabbard couldn’t defend what Trump did. She offered no proof that Trump had permission to film a campaign ad at Arlington. Trump thought that he was resetting the election narrative and boosting his campaign, but what he did was create a new scandal for himself. The whole stunt which was designed to make Trump look like a troops supporting patriot has backfired and demonstrated Trump’s disrespect for the troops, the fallen, and the law.","summary":"Last updated on September 2nd, 2024 at 02:27 pm Trump put Tulsi Gabbard on CNN to clean up the aftermath of his Arlington National Cemetery scandal, and there were some problems. Video: Dana Bash presses Tulsi Gabbard on Trump’s illegal campaign event at Arlington National Cemetery, and Gabbard doesn’t offer any proof that Trump didn’t &#8230;\n\n\nThe post Tulsi Gabbard Tried To Clean Up Trump&#8217;s Arlington Scandal And It Didn&#8217;t Go Great appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/tulsi-gabbard-tried-to-clean-up-trumps-arlington-scandal-and-it-didnt-go-great/","image":"https://www.politicususa.com/wp-content/uploads/2024/09/Gabbard-sotu-scaled.jpg","video":null,"publish_date":"2024-09-05 00:13:18","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.3},{"id":255662536,"title":"DirecTV Says Disney Is Trying to ‘Corner the Market for Themselves’ Amid Carriage Dispute","text":"The war of words between Disney and DirecTV continues as the two parties’ carriage dispute stretches into its fourth day. In a joint statement from Disney Entertainment co-chairs Dana Walden and Alan Bergman and ESPN chairman Jimmy Pitaro on Wednesday, the House of Mouse accused the satellite and pay TV giant of “misrepresenting the facts” around its ongoing negotiations. The media company maintains that it has proposed a variety of packages that would allow DirecTV to offer more flexibility, choice and control to its 11 million subscribers, such as a sports-centric bundle option featuring ESPN networks and ABC, an entertainment-based option featuring Disney’s entertainment networks and linear offerings paired with Disney’s direct-to-consumer subscription services like its deal with Charter Communications from last year. It also said that it has asked for rates that are in line with other distribution providers and that reflect the value of its content portfolio. “Our priority is to reach a marketplace deal that serves the needs of DirecTV and their customers while also recognizing the value of our top-quality content and the significant investment required to create and acquire it,” the executives said. “We believe there is a path to a fair and flexible agreement that strikes this critical balance and works for all sides, especially the consumer.” However, DirecTV chief content officer Rob Thun pushed back against Disney’s letter on Wednesday, calling the package proposal a “half truth” and that they are actually engaging in behavior focused on “cornering the market for themselves.” He pointed out that the two parties have agreed to rates, but remain apart on the flexibility and number of genre-based packages they’re trying to offer. “In the skinnier bundles, they were going to afford only themselves really any runway on the sports and broadcast package,” Thun told CNBC. “And they gave us a flavor of entertainment that is laced with these minimum penetration requirements, which ironically, is not what they gave to Charter, which they told us firsthand. And they’re not letting us participate in the kids and family package that we put on the table to them because they want to keep that for themselves.” DirecTV has also argued that Disney has asked them to waive all claims that its behavior is anticompetitive and move adjudication for any future lawsuits from New York to California. “I think where we agree is that there’s a vast market in between what’s available to customers today with a direct consumer subscription package construct and the fat pay TV construct that we live with today,” Thun added. “We think there’s a big market for us to participate in, but we need the rights and the rights to not be encumbered by these minimum penetration requirements, so that we can make this available to more customers than what Disney’s prescribing today. They just have to give us more flexibility in the rights they’ve given us, and they don’t reflect what they were planning to give themselves and that’s what we’re calling them out on.” The dispute comes amid a busy month for ABC and ESPN, which includes the U.S. Open, the start of the college football and NFL seasons and the telecasts of the first presidential debate between Vice President Kamala Harris and former President Donald Trump, as well as the 2024 Emmys. In addition to local ABC affiliates, Disney-owned networks normally available on DirecTV include ESPN, ESPN2, ESPN Deportes, ESPNU, ESPN News, SEC Network, ACC Network, FX, FX Movie Channel, FXX, Freeform, National Geographic, Nat Geo Wild, Nat Geo Mundo, Disney Channel, Disney Junior, Disney XD and BabyTV. In the meantime, DirecTV’s more than 11 million subscribers impacted by the programming blackout can request a $20 credit. In addition to DirecTV, Disney’s networks are available on other satellite providers like Dish Network, cable providers like Charter Communication’s Spectrum or Comcast, or virtual MVPDs like YouTube TV or Hulu + Live TV.","summary":"The pay TV giant argues that the House of Mouse's package proposals are \"laced\" with minimum penetration requirements that limit the scope and reach of what it's looking to offer\n\n\nThe post DirecTV Says Disney Is Trying to &#8216;Corner the Market for Themselves&#8217; Amid Carriage Dispute appeared first on TheWrap.","url":"https://www.thewrap.com/directv-disney-carriage-dispute-rob-thun-cnbc/","image":"https://www.thewrap.com/wp-content/uploads/2022/03/Directv.jpg","video":null,"publish_date":"2024-09-05 00:01:29","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","source_country":"US","sentiment":0.202},{"id":255662336,"title":"Disarray in Trump’s campaign as internal conflict among untrustworthy individuals jeopardizes his run for president","text":"Senior officials directing Donald Trump’s election campaign were brimming with confidence when incumbent Joe Biden announced his withdrawal as the Democratic nominee last month. But the former president’s camp are now quaking in their collective boots after realizing Kamala Harris is not quite the pushover they expected she would be, DailyMail.com can reveal. Chief target of the complaints are ‘grifters,’ ‘hucksters,’ ‘profiteers’ and ‘cranks’ – to use a few of the colorful terms dropped by GOP officials and operatives during interviews with DailyMail.com last week. They are accused of damaging his campaign with their incompetence and crude efforts to exploit their close ties to him, whether real or imaginary, for personal profit. Eight years ago, when Trump defeated Hillary Clinton in the 2016 presidential election, a lot of talented campaign professionals helped get him elected, one grizzled Republican campaign veteran told DailyMail.com. ‘He’s still got a lot of talented people around him in 2024,’ the operative said. ‘But their main talent is getting rich.’ Trump’s teams of political advisors and associates have always consisted of controversial characters, including Roger Stone, an unofficial advisor during his run against Clinton eight years ago who’s been known as a notorious black bag operator since he worked for President Richard Nixon’s reelection campaign in 1972. Stone only managed to avoid a 40-month prison stretch for witness tampering, making false statements, and otherwise impeding Special Counsel Robert Mueller’s Russiagate investigation because Trump commuted his sentence days before he was scheduled to report to prison. Then there was Steve Bannon, the CEO of Trump’s 2016 campaign and first White House chief strategist, who is currently federal inmate number 05635-509 in FCI Danbury in Connecticut where he been since July. He is scheduled for release a week before election day. He is serving a four-month stretch behind bars for defying a subpoena issued by a Congressional committee that investigated the January 6, 2021 riots at the US Capitol. Bannon still faces charges for scheming to defraud donors to a private project to build a wall along the southern border. One well-connected Washington operator who had good connections to Trump’s administration during its early days said the former president inevitably attracted a disproportionate share of ‘oddballs’ into his orbit due to his own eccentric personality and unconventional style. ‘There were always a lot of people hanging around who would tell you they knew a guy who knew another guy who could get you a meeting with Trump,’ he recalled. ‘Some of them really had connections and could get you that meeting, but a lot of them were hustlers looking to make a buck.’ The biggest change from 2016, according to GOP insiders interviewed by DailyMail.com, is that back then the dodgier figures in Trump’s entourage were counterbalanced by a large contingent of experienced campaign professionals. Since then, the share of corner-cutting, scandal-prone, profit-hungry confederates in Trump’s camp steadily grew as many of his more conventional associates departed after growing disenchanted with him. The problem has been compounded by the former’s president’s deep loyalty to his closest associates, which is typically a positive quality in friendships but less often the case with political relationships. Several sources referred by way of example to Trump’s recent decision to bring his first 2016 campaign manager Corey Lewandowski back into the fold in as a top advisor as a sign of the urgency he’s feeling about the need to reverse Harris’s campaign momentum, and as the type of hires he makes that could make matters worse. While Lewandowski is known to be extremely dedicated to Trump and relentlessly hardworking, he’s equally notorious for driving away important staffers because he’s rude and overbearing, and for his long track record of public buffoonery. Trump has already fired Lewandowski twice, first as his campaign manager after he was accused of assaulting a female reporter. He was let go again in 2021 when he was directing a Super PAC raising money for the former president when he got drunk at a charity event for a group that combats alcohol and drug abuse, and crudely hit on the wife of a prominent donor who he bragged to about his penis size. Peter Navarro, a trade advisor during the Trump administration, was invited to address the Republican National Convention on July 17, the day he was released from a Miami prison after serving four months for refusing to cooperate with a congressional investigation into the riot at the US Capitol in 2021 and pledged eternal loyalty to the ex-president. When he worked at the White House, Navarro regularly put his foot in his mouth, which came as no surprise to his former political colleagues in California. In a 2020 story in Politico, Rob Stutzman, a former advisor to Governor Arnold Schwarzenegger, called him a prominent inhabitant of the ‘island of misfits that make up the Trump White House.’ Larry Remer, who ran two of Navarro’s five failed campaigns for public office in San Diego, labeled him ‘the biggest a**hole I’ve ever known.’ Sergio Gor, a conservative operative and Trump fundraiser, is widely known in campaign circles for his chronic efforts to monetize his connection to the former president and his family. A longtime aide to Republican Senator Rand Paul, Gor took a top job with a major Trump campaign fundraising outfit in 2020. Following Trump’s defeat in that year’s election, Gor and Donald Trump Jr. became partners in Winning Team Publishing, whose first release was ‘Our Journey Together,’ a coffee table book of photos of Trump Sr, in 2022. A special edition autographed by the former president went for $999 and came with the classic red ‘Make America Great Again’ cap and other MAGA memorabilia. Over the past four years, Republican political campaigns and committees have paid $1.5million to two companies controlled by Gor, The Daily Beast reported earlier this year. In January, Gor took the helm as CEO of a new Trump Super PAC called ‘Right for America,’ which multiple sources who spoke to DailyMail.com mocked as a crude money play. ‘Any time I see Sergio’s involved in a project, I assume there’s a good chance it’s a scam,’ said one, a Republican campaign veteran. Gor did not initially return requests for comment. After publication, he said the Daily Beast ‘attributed companies to me which I have no control or interest in’. ‘Our super PAC expenses are public. You’ll see I’ve not taken a salary. ‘Publicly available details will show I have taken zero cents. Trash magnate Anthony Lomangino and Conair Corporation heir Lee Rizzuto Jr., who are both close to Trump and regulars at Mar-a-Lago, sit on the Super PAC’s board. The pair provided a combined $4.25million to Right for America as of June 30, Federal Election Commission (FEC) records show. Right for America’s total receipts as of that day came to $38.6million. Of that amount, the Super PAC, which once pledged to spend ‘tens of millions of dollars’ to support Trump’s 2024 run, only dispensed $169,919. Much of that went to politically wired consulting firms. Roughly $15,000 went to cover travel by Gor and a similar amount was paid to Mar-a-Lago for use as an event space and catering services. How much money Right for America eventually raises this year and where it goes won’t be fully known until next year when it files its final disclosure report for 2024 to the FEC. ‘What is Right for America going to do that’s different or better or smarter than all the other Super PACs already raising money for Trump?’ asked an experienced Republican campaign consultant. ‘Benefiting the people who created and run it is its only discernible purpose.’ Another Trump-controlled PAC, Save America, raises money to pay legal defense bills for the former president and his close allies. It recently shelled out some $60million to the law firm of Russian-American Boris Epshteyn, who Bannon once labeled Trump’s ‘wartime consigliere’. Epshteyn is facing charges himself for allegedly helping orchestrate a scheme in Arizona as part of Trump’s broader effort to reverse his defeat to Biden in the 2020 election. Though ‘lacking any track record as a political strategist,’ Epshteyn ‘made more than $1.1million in the past two years for providing advice to the campaigns of Republican candidates, many of whom believed he could be a conduit to Mr. Trump,’ said a 2023 New York Times article. ‘Epshteyn is a crackpot, I can’t believe he’s still around,’ said a dyed-in-the-wool right-wing Republican operator who speaks regularly to top campaign officials. A main focus of complaints is Charlie Kirk, the 30-year-old director of the conservative youth group Turning Point USA, which has raked in hundreds of millions of dollars in recent years to promote Trump, his political allies, and a variety of MAGA-friendly causes. This year Kirk – who has become immensely wealthy in the process and lives in an Arizona estate worth millions on the grounds of a private country club – announced his group was looking to raise the astronomic sum of $108million to run field campaigns and get-out-the-vote drives for Trump in swing states, despite having little to show for its past lavishly-funded efforts in those areas. ‘Turning Point spends a lot of money to host events and he travels around the country getting into fights at colleges, so he gets attention, but nothing he does is of long-term value.’ Kirk’s spokesman told DailyMail.com: ‘Charlie has busted his ass this election cycle to help win Arizona, Wisconsin and beyond and hasn’t been paid a penny for the extra effort. ‘All money raised has been immediately spent hiring hundreds of full-time ballot chasers. The operation is lean and frankly underfunded. We produce actual results. ‘Charlie’s personal money comes from his nationally syndicated radio show and top rated podcast.’ WinRed, a GOP fundraising platform launched in 2019 by the Trump campaign, the Republican National Committee (RNC), and the party’s Senate and House campaign committees, is also singled out as a particularly brazen example of political profiteering. Josh Kushner – the younger brother of Trump’s son-in-law and former presidential senior advisor Jared Kushner who reportedly was personally involved in the decision to establish WinRed – owns a stake in WinRed through his firm Thrive Capital. ‘WinRed prints money but that’s not because it’s a great fundraising platform,’ said the GOP consultant. ‘In fact, it’s a terrible platform that charges ridiculously high fees and the only reason anyone uses it is because they were ordered to by the Trump campaign, the RNC and its other founders.’ ‘During the Republican presidential primary debates this year, you couldn’t get on the stage unless you used WinRed,’ he added. With time running short between now and Election Day, and ideas about how to reverse Harris’s momentum in short supply, the detrimental collective impact caused by the growing flock of hangers-on and camp followers in Trump’s orbit has become much more evident, said the GOP campaign veteran. ‘Trump is a superstar and when things are going well, his side wins whether his teammates are playing well or not,’ he explained. ‘That’s hard to know because he’s so good, he hides their deficiencies,’ said the source. ‘You only find out if the people around him are talented when he gets hurt, which is the situation we’re in now, and what we’re finding out now is that most of them aren’t.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nSenior officials directing Donald Trump&#8217;s election campaign were brimming with confidence when&#8230;\n\n\nThis Post: Disarray in Trump&#8217;s campaign as internal conflict among untrustworthy individuals jeopardizes his run for president first appeared on Internewscast Journal","url":"https://internewscast.com/news/disarray-in-trumps-campaign-as-internal-conflict-among-untrustworthy-individuals-jeopardizes-his-run-for-president/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-Trump039s-campaign-in-chaos-as-infighting-among.jpg","video":null,"publish_date":"2024-09-05 00:00:54","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.003},{"id":255662398,"title":"2024 Showdown: Anti-Trump Republican Liz Cheney says she's backing Kamala Harris","text":"Former Rep. Liz Cheney of Wyoming, a one-time rising Republican Party star who became a top GOP critic of former President Trump, says she'll vote for Democratic nominee Vice President Kamala Harris in the 2024 election. \"I don’t believe we have the luxury of writing in candidates’ names, particularly in swing states,\" Cheney said Wednesday at a speaking event at Duke University in North Carolina. And she emphasized that \"as a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this, and because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.\" TRUMP HEADS TO CRUCIAL BATTLEGROUND STATE FOR FOX NEWS TOWN HALL MODERATED BY HANNITY Minutes after the Cheney news broke, the Trump campaign posted on social media an interview of Cheney on the Fox News Channel from four years ago taking aim at Harris. \"Her voting record in the Senate is to the left of Bernie Sanders and Elizabeth Warren,\" Cheney argued at the time. \"It's very clear, she is a radical liberal.\" HARRIS STOPS IN KEY SWING STATE THAT TRUMP CHARGES VP AND BIDEN ‘DISRESPECTED’ The Fox News interview took place soon after then-2020 Democratic presidential nominee Biden named then-Sen. Harris as his running mate. Cheney, the daughter of former Vice President Dick Cheney, was once a conservative star in the GOP who was rising in the ranks of House Republican leadership. MARGIN OF ERROR RACE BETWEEN HARRIS, TRUMP, AS CAMPAIGN ENTERS FINAL STRETCH But she was the most high-profile of the 10 House Republicans who voted to impeach then-president Trump in early 2021 on a charge of inciting the deadly attack Jan. 6 on the Capitol, which was waged by right-wing extremists and other Trump supporters who aimed to disrupt congressional certification of Biden’s Electoral College victory in the 2020 election. The conservative lawmaker and defense hawk immediately came under verbal attack from Trump and his allies, and was eventually ousted from her number-three House GOP leadership position. Cheney, who has been vocal in emphasizing the importance of defending the nation's democratic process and of putting country before party, was one of only two Republicans who served on a special select committee organized by House Democrats that investigated the riot at the Capitol. CLICK HERE TO GET THE FOX NEWS APP In 2022, she was ousted in the GOP congressional primary in Wyoming to a candidate that was backed by Trump. Cheney — who has argued that the former president is a \"liar,\" a \"con man\" and a potential \"tyrant\" who, if elected again, would \"torch the Constitution\" — vowed after leaving Congress that \"I will do everything I can to make sure [Trump] is never anywhere near the Oval Office again.\" But despite outreach from the Biden campaign, which transformed into the Harris campaign in July after the vice president replaced her boss at the top of the Democrats' 2024 ticket, Cheney had remained silent until now. Cheney decided against joining other high-profile anti-Trump Republicans — such as former Rep. Adam Kinzinger of Illinois and former Georgia Lt. Gov. Geoff Duncan, who had speaking roles at last month's Democratic National Convention in support of Harris. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Former Rep. Liz Cheney of Wyoming, a one-time rising GOP star who became a top Republican critic of former President Trump, says she&apos;ll vote for Democratic nominee Vice President Kamala Harris.","url":"https://www.foxnews.com/politics/2024-showdown-anti-trump-republican-liz-cheney-says-shes-backing-kamala-harris","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/931/523/liz-cheney-getty.jpg?ve=1&tl=1","video":null,"publish_date":"2024-09-05 00:00:52","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.208},{"id":255662030,"title":"Nate Silver's Election Model Shows Donald Trump Surging","text":"Former President Donald Trump's chances of victory in November are the highest they've been in over a month, according to Nate Silver's latest election forecast.Despite Vice President Kamala Harris' consistent string of polling victories since entering the 2024 race, Silver's forecast shows Trump having a higher chance of securing the 270 electoral votes needed to win his reelection bid, putting Trump's chances of victory at 58.2 percent as of Wednesday. Harris, in comparison, has a 41.6 percent chance of winning in November, according to the latest Silver Bulletin.Silver, an American statistician and founder of election analysis site FiveThirtyEight, said that his election forecast \"is still in toss-up range,\" but noted that many polls released earlier this week \"are coming in below our current polling averages\" for Harris. As of Wednesday, the Silver Bulletin polling average found Harris beating Trump by 3.4 percentage points across national polling. But as Silver wrote, \"stranger things have happened than a candidate who was behind in the polls winning.\"\"And in America's polarized political climate, most elections are close and a candidate is rarely out of the running,\" he added.Silver's model showed Harris having a better chance of winning the election between August 4 and August 27, although Trump's chances have been on the rise for a week. Last Wednesday, Harris and Trump's forecasts were relatively tied at 50.5 percent to 49.2 percent, respectively.This week's forecast gives Trump his greatest chance of winning reelection since Silver's model was launched on July 30, when he was given a 61.3 percent chance. At that time, Harris had a 38.1 percent chance of victory.Harris was given a higher probability of winning the popular vote in November, according to this week's forecast (58.9 percent chance compared to Trump's 41.1 percent chance). Trump lost the popular vote by nearly 3 million votes in 2016 but beat then-Democratic nominee Hillary Clinton by 74 electoral votes. The last Republican to win the popular vote in a presidential election was former President George W. Bush, who beat his Democratic opponent, John Kerry, by over 3 million votes.Silver's forecast shows Trump securing several key battleground states to reach the 270 electoral votes necessary to win in November, including Arizona, Georgia, Pennsylvania, Nevada and North Carolina. Michigan was left in a toss-up, with Trump given a 50.3 percent chance of winning compared to Harris' 49.7 percent chance. Wisconsin leaned slightly toward Harris, although the margins were tight (52.9 percent to 47.1 percent).Newsweek reached out to Harris and Trump's campaigns via email for comment.Polling experts have warned that Harris' momentum may be a bit deceiving. Trump's chances were underestimated during polling in both 2016 and 2020, issues that one expert attributed to pollsters' issues with reaching the former president's voting base.\"One of the main issues is that Trump's base is harder to reach through traditional polling methods,\" Pew Research Center senior fellow Scott Keeter previously told Newsweek. \"Trump supporters tend to have lower levels of trust in institutions, including those conducting polls, which can skew results.\"Trump's former communications director, Anthony Scaramucci, said last month that he would caution Harris from being too confident in current polling numbers, noting that the former president tends to \"under poll.\"\"Now, she could have a breakout moment with more interviews. She could have a breakout moment in the September 10 debate,\" Scaramucci added during an appearance on Fox News. \"But if I'm her, if I'm on her campaign, I'm recommending she pushes very, very hard in [battleground states], because she could put him on the run.\"","summary":"Silver's latest election forecast shows Trump having a higher chance of securing the electoral college vote in November.","url":"https://www.newsweek.com/nate-silver-election-model-shows-donald-trump-surging-1949000","image":"https://d.newsweek.com/en/full/2464636/nate-silvers-election-model-trump-surges.jpg","video":null,"publish_date":"2024-09-04 23:57:44","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.126},{"id":255661876,"title":"Trump rakes in $130M for campaign in August ","text":"Former President Donald Trump raised $130 million last month, a haul built almost entirely by small-dollar donations, his campaign announced Wednesday. The August fundraising totals leave Trump, 78, with $295 million in cash on hand two months out from Election Day. “With Republicans united and a growing number of Independents and disaffected Democrats crossing partisan lines, the Trump-Vance campaign has momentum for the final stretch of the race,” Trump campaign Senior Advisor Brian Hughes said in a statement. “These fundraising numbers from August are a reflection of that movement and will propel President Trump’s America First movement back to the White House so we can undo the terrible failures of Harris and Biden,” he added. The campaign noted that 98% of August donations were under $200, resulting in an average contribution of $56 “from everyday Americans.” Trump’s August haul was slightly less than the $138.7 million the campaign raised in July. The Republican nominee’s war chest is also smaller than the $327 million reported at the end of July, as campaigning has intensified in the final months of the 2024 race. The Trump campaign, as well as outside groups backing the former president, outspent Vice President Kamala Harris in four key swing states — Pennsylvania, Georgia, Arizona and North Carolina — between July 22 and Aug. 25, according to ad-tracking firm Ad Impact and NPR. The Harris campaign has not yet released its August fundraising numbers. Harris campaign Chair Jen O’Malley Dillon announced last week that Harris had raised $540 million since she replaced President Biden, 81, at the top Democratic ticket in July, including $82 million earlier this month during the Democratic National Convention in Chicago. “This is the most ever for any presidential campaign in this time span,” she said in a memo. Harris raised a stunning $310 million for her campaign an authorized committees in July, more than double Trump’s total for that month.","summary":"The August fundraising totals leave Trump, 78, with $295 million in cash on hand two months out from Election Day. ","url":"https://nypost.com/2024/09/04/us-news/trump-rakes-in-130m-for-campaign-in-august/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/88945738.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Wtc5q3ck-RyIcpnTz.mp4","publish_date":"2024-09-04 23:51:36","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.283},{"id":255661874,"title":"Top pollster finds Trump gains momentum against Harris – 58% chance of winning 2024 race","text":"Former President Donald Trump’s chances of winning the 2024 election have surged in the last month while Vice President Kamala Harris has struggled to find “a 2nd gear,” according to polling guru Nate Silver. The data analyst and founder of FiveThirtyEight revealed Wednesday that his presidential race model now indicates that Trump has a 58.2% chance at winning the Electoral College in November compared to Harris’ 41.6% chance. “Trump’s chances of winning are his highest since July 30,” Silver wrote in his latest election forecast bulletin. “And the chance of an Electoral College-popular vote split working against Harris has risen to almost 18 percent.” Silver’s model predicts that Harris has a 58.9% chance at winning the national popular vote – which has no bearing on the winner of the race – but that Trump will rack up 274 Electoral College votes, topping the vice president’s 263 estimated Electoral College total. Two-hundred seventy Electoral College votes are needed to win the presidency. “There was a surge of enthusiasm for Harris post-Biden dropout, but that might have happened no matter what,” Silver noted on X. The pollster also argued that Harris tapping Minnesota Gov. Tim Walz as her running mate over swing state Pennsylvania Gov. Josh Shaprio, as well as keeping most of President Biden’s campaign team in place, may have been missteps. “Thought convention speech was good, but bypassing Shapiro beginning to look bad and they haven’t really found a 2nd gear after Hot Brat Summer,” he continued. In a separate tweet, Silver said, “I think I’d buy the bull case for Harris a bit more if she hadn’t rehired so many of the Biden people.” Overall Silver’s model still pegs the race as a “toss-up” between the two candidates. His analysis follows an ABC News/Ipsos poll released on Labor Day which showed Harris failed to get an anticipated bump in support following last month’s Democratic National Convention, leaving the 2024 horse race essentially unchanged. Trump and Harris are also virtually tied In two of the battleground states that could decide the election, with a CNN/SSRS survey released Wednesday showing Trump and Harris each receiving 47% support in Pennsylvania and the vice president leading the former president 48%-47% in Georgia.","summary":"Kamala Harris hasn't \"really found a 2nd gear after Hot Brat Summer,” pollster Nate Silver said Wednesday.","url":"https://nypost.com/2024/09/04/us-news/top-pollster-finds-trump-has-58-chance-of-winning-2024-race/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/88948934.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/D2T21HzT-RyIcpnTz.mp4","publish_date":"2024-09-04 23:49:43","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.323},{"id":255662174,"title":"Harris Breaks From Biden in Plan to Impose Lower Capital Gains Tax Hike","text":"WASHINGTON—Vice President Kamala Harris on Sept. 4 proposed a new tax rate on capital gains at 28 percent, which is higher than the existing level but lower than President Joe Biden’s 2025 budget proposal that she previously endorsed. Harris’s plan represents a departure from Biden’s budget proposal, which would raise the capital gains tax on individuals earning more than $1 million to 44.6 percent. The announcement was made days before Harris’s Sept. 10 debate with former President Donald Trump, who has cast his Democrat opponent’s economic plans as being bad for businesses. Currently, long-term capital gains are taxed at a maximum of 20 percent, and high earners may be subject to an additional 3.8 percent net investment income tax, potentially raising the maximum tax rate on long-term capital gains to 23.8 percent. “If you earn a million dollars a year or more, the tax rate on your long-term capital gains will be 28 percent under my plan,” Harris said, speaking at a campaign event in New Hampshire. “We will tax capital gains at a rate that rewards investment in America’s innovators, founders, and small businesses.” It’s unclear whether the 28 percent figure that Harris has referenced constitutes the maximum tax rate, inclusive of other provisions, such as the net investment income tax. Under Biden’s budget proposal, a separate plan to increase the net investment income tax (NIIT) rate to 5 percent contributed to the overall 44.6 percent capital gains rate. If the same NIIT increase were applied to Harris’s proposal, the capital gains tax would jump to 33 percent. Harris’s remarks were delivered at Throwback Brewery in North Hampton, New Hampshire, where she also unveiled other economic policy proposals, including an increase in the tax deduction for startup costs from $5,000 to $50,000. Trump, has targeted the Democratic nominee’s economic policies as too left-wing. “The Harris–Walz tax plan calls for the largest tax hike in history, including a higher income tax, higher business taxes, higher investment taxes, an unrealized gains tax, and an expanded death tax—among others—all of which will hurt small businesses and their customers,” Trump’s campaign wrote in a statement to The Epoch Times. In the 2020 election, Trump promised to lower the top capital gains tax rate to 15 percent. In 2024, he has not announced any capital gains tax proposal. The Epoch Times has reached out to the campaign for further comment. Some tax watchdogs have criticized Harris’s capital gains tax proposals, saying they will reduce investments that small businesses rely upon to create jobs. “Under the Harris plan, the combined federal-state capital gains tax exceeds 50 percent in many states. California will face a combined federal-state rate of 57.8 percent, New Jersey 55.3 percent, Oregon at 54.5 percent, Minnesota at 54.4 percent, and New York state at 53.4 percent.” These types of changes also pose risks to capital markets, according to some experts. “U.S. benefits from having some of the most robust and deep capital markets in the world,” wrote Garrett Watson, a senior policy analyst at The Tax Foundation. “We need to be careful about unprecedented, untested policy changes that could compromise that or weaken that source of capital,” Watson noted, referring to Harris’s remarks and other proposals, such as the taxing of unrealized capital gains, advocated by Harris and Biden.","summary":"The suggested 28 percent rate is a reduction from the 44.6 percent proposed by Biden, although it still amounts to a tax increase for high income taxpayers.","url":"https://www.theepochtimes.com/us/harris-breaks-from-biden-in-plan-to-impose-lower-capital-gains-tax-hike-5718097","image":"https://img.theepochtimes.com/assets/uploads/2024/09/03/id5717310-GettyImages-2169371478-OP-300x180.jpg","video":null,"publish_date":"2024-09-04 23:49:07","author":"Arjun Singh,Emel Akan","authors":["Arjun Singh","Emel Akan"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.055},{"id":255661828,"title":"Harris proposes tax incentives for small businesses","text":"Harris proposes tax incentives for small businesses While campaigning in New Hampshire on Wednesday, Vice President Kamala Harris served up an idea that would allow new small businesses a chance to write off up to $50,000 in startup costs, up from the current maximum of $5,000. Ed O'Keefe reports.","summary":"While campaigning in New Hampshire on Wednesday, Vice President Kamala Harris served up an idea that would allow new small businesses a chance to write off up to $50,000 in startup costs, up from the current maximum of $5,000. Ed O'Keefe reports.","url":"https://www.cbsnews.com/video/harris-proposes-tax-incentives-for-small-businesses/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/04/a6d6007e-e86e-4657-9136-b757e2ee9a32/thumbnail/1200x630/6fefad38da07fb94e1f805e4a624e45c/0904-en-okeefe.jpg?v=631cf5f2b4e8db7f9bc428589402864d","video":null,"publish_date":"2024-09-04 23:48:22","author":null,"language":"en","source_country":"US","sentiment":-0.978},{"id":255661632,"title":"Ex-GOP Rep. Liz Cheney will vote for Kamala Harris ‘because of danger Trump poses’","text":"WASHINGTON — Former Republican Rep. Liz Cheney on Wednesday said she would support Kamala Harris for president, ending weeks of speculation about how fully the member of a GOP dynasty-turned-Trump critic would embrace the Democratic ticket. Cheney, who co-chaired the House investigation into the Jan. 6, 2021, attack, became a fierce Trump critic and was ousted in her 2022 Republican primary in Wyoming as a result, made her announcement at an event at Duke University. In a video posted on the social media network X, she finished by talking about the “danger” she believed Trump still poses to the country. “I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she said. “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this. Because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.” The daughter of former vice president Dick Cheney, Liz Cheney has been perhaps Trump’s highest-profile Republican critic. She joins other Republicans like her former Jan. 6 committee member, former Rep. Adam Kinzinger and former Rep. Denver Riggleman, as backers of Harris. More than 200 alumni of the Bush administration and former Republican presidential campaigns of the late Sen. John McCain and Sen. Mitt Romney also announced their endorsement of Harris last week. Cheney was in House Republican leadership at the time of the Jan. 6 attack but broke with most of her caucus over Trump’s responsibility. She lost her leadership post and was one of the few Republicans willing to serve on the Jan. 6 committee, which was appointed by Democrats who controlled the House at the time.","summary":"She joins other Republicans like her former Jan. 6 committee member, former Rep. Adam Kinzinger and former Rep. Denver Riggleman, as backers of Harris. ","url":"https://nypost.com/2024/09/04/us-news/ex-gop-rep-liz-cheney-will-vote-for-kamala-harris-because-of-danger-trump-poses/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/newspress-collage-nj84po60p-1725493217187.jpg?quality=75&strip=all&1725479085&w=1200","video":"https://cdn.jwplayer.com/videos/D2T21HzT-RyIcpnTz.mp4","publish_date":"2024-09-04 23:45:23","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.378},{"id":255662348,"title":"Former Republican Rep. Liz Cheney says she will vote for Vice President Harris","text":"Former Rep. Liz Cheney, a Wyoming Republican whose fierce criticism of former President Donald Trump cost her her congressional seat, said she will be voting for Vice President Kamala Harris in November. \"I don't believe that we have the luxury of writing in candidates' names, particularly in swing states,\" Cheney said Wednesday during an event at Duke University. \"And because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.\" Cheney's remarks, which were shared by an attendee on social media, and retweeted by Harris spokesman Ian Sams, come as the Harris campaign is taking steps to court disenchanted Republican voters. The campaign launched \"Republicans for Harris\" last month, and several Republicans were featured at the Democratic National Convention. Cheney, who was first elected to Congress in 2016, voted for Trump in 2016 and 2020, but she became one of his most vocal opponents after the Jan. 6 attack on the Capitol. She was one of 10 Republicans to vote to impeach Trump in 2021 and was one of two Republican members who served on the House committee investigating the Jan. 6 attack. She referred to Trump’s actions on Jan. 6 as the “greatest betrayal” of a U.S. president. Her vocal opposition to Trump ultimately cost her a leadership role in the GOP conference. In 2022, she was ousted during her primary election by a Trump-backed opponent. Cheney is the latest high-profile Republican to publicly say she would vote for Harris. Last month's Democratic National Convention in Chicago featured a host of Republicans, including Rep. Adam Kinzinger of Illinois who served alongside Cheney on the Jan. 6 committee, and Olivia Troye, a Trump administration official who broke with the former president over Jan. 6, saying they backed, in their words, country over party.","summary":"Cheney's remarks, which were shared by an attendee on social media, come as the Harris campaign is taking steps to court disenchanted Republican voters.","url":"https://www.npr.org/2024/09/04/nx-s1-5100968/liz-cheney-kamala-harris","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5768x3845+0+0/resize/5768x3845!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc8%2Fbf%2Fd30e82504790909830bff34ed2f2%2Fgettyimages-1853733964.jpg","video":null,"publish_date":"2024-09-04 23:44:29","author":"Barbara Sprunt","authors":["Barbara Sprunt"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.27},{"id":255661732,"title":"Tim Walz aims donut jibe at JD Vance on visit to Pennsylvania farmers’ market","text":"Tim Walz mocked rival JD Vance with a donut joke as he visited a farmers’ market in the battleground state of Pennsylvania. Kamala Harris’s running mate poked fun at his Republican counterpart’s awkward attempt to make small talk at a donut store in Valdosta, Georgia last month. Awkward video of the event included one worker telling Vance that she did not want to appear on camera as he picked out sweet treats. On Wednesday, Walz visited Cherry Hill Orchards and Farm in Lancaster, Pennsylvania, in a state that will be crucial for Harris’s victory in November. “What am I looking at in a Whoopie Pie?” Walz asked the manager before getting in a crack at Vance. “I have no problem picking out doughnuts,” the Minnesota governor joked. Vance’s own donut experience has been used by Democrats to reinforce their “weird” characterization of the senator from Ohio. “I’m JD Vance, and I’m running for vice president,” the Republican candidate said to a member of staff after he walked into Holt’s Sweet Shop in Valdosta. “OK,” she responded uncomfortably before Vance’s team was asked to stop filming. Walz and Vance will go head to head in the vice presidential debate on October 1 on CBS. It will be moderated by CBS Evening News anchor Norah O’Donnell and chief foreign affairs correspondent Margaret Brennan. The first debate between Kamala Harris and Donald Trump will take place on September 10 in Philadelphia. It will be hosted by ABC Network anchors, David Muir and Linsey Davis. A second debate is expected to take place in October although a date and venue has not been set.","summary":"Donald Trump’s running mate had awkward experience ordering sweet treats on the campaign trail","url":"https://www.independent.co.uk/news/world/americas/us-politics/walz-vance-donut-joke-pennsylvania-b2607266.html","image":"https://static.independent.co.uk/2024/09/04/23/GettyImages-2169100546.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/QIgdR8wQ-4VHSaSK0.mp4","publish_date":"2024-09-04 23:44:01","author":"Graeme Massie","authors":["Graeme Massie"],"language":"en","source_country":"gb","sentiment":-0.144},{"id":255661802,"title":"Republican Liz Cheney endorses Kamala Harris","text":"WASHINGTON — Former Republican Rep. Liz Cheney on Wednesday said she would support Kamala Harris for president, ending weeks of speculation about how fully the member of a GOP dynasty-turned-Trump critic would embrace the Democratic ticket. Cheney – who co-chaired the House investigation into the Jan. 6, 2021, attack, became a fierce Trump critic and was ousted in her 2022 Republican primary in Wyoming as a result – made her announcement at an event at Duke University. In a video that was posted on the social media network X, she finished by talking about the “danger” she believed Trump still poses to the country. Liz Cheney endorsing Vice President Kamala Harris at Duke University@newsobserver pic.twitter.com/taoMYNQ6d1 — Emma Cline (@emmacline_) September 4, 2024 “I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she said. “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this. Because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.” The daughter of former Vice President Dick Cheney, Liz Cheney has been perhaps Trump’s highest-profile Republican critic. Other former Republican representatives who have announced their backing for Harris include Adam Kinzinger, who served on the Jan. 6 committee with Cheney, and Denver Riggleman. More than 200 alumni of the George W. Bush administration and the former Republican presidential campaigns of the late Sen. John McCain and Sen. Mitt Romney also announced their endorsement of Harris last week. Cheney was in House Republican leadership at the time of the Jan. 6 attack but broke with most of her caucus over Trump’s responsibility. She lost her leadership post and was one of the few Republicans willing to serve on the Jan. 6 committee, which was appointed by Democrats who controlled the House at the time.","summary":"The former Wyoming congresswoman was ousted in a 2022 primary over Republican voters' anger at her criticism of Donald Trump.","url":"https://www.centralmaine.com/2024/09/04/republican-liz-cheney-endorses-kamala-harris/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/09/Election_2024_Cheney_21024_e9f36c.jpg?w=1000","video":null,"publish_date":"2024-09-04 23:39:34","author":"Nicholas Riccardi,NICHOLAS RICCARDI - Associated Press","authors":["Nicholas Riccardi","NICHOLAS RICCARDI - Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.4},{"id":255661594,"title":"RFK Jr. Sues to Remove Himself From Wisconsin Presidential Ballot","text":"Robert F. Kennedy Jr. is suing to remove himself from the Wisconsin presidential ballot after the battleground state’s election commission voted to keep him on it. In the lawsuit, filed Sept. 3 in Dane County Circuit Court, attorneys for Kennedy accused the elections commission of discriminating against him over the ballot withdrawal request. Specifically, Kennedy claimed that independent candidates like himself are subjected to different withdrawal deadlines than major party candidates such as President Joe Biden, who on July 21 ended his reelection bid and endorsed Vice President Kamala Harris. Since then, Kennedy has sent requests to get his name off the ballots in seven closely contested states and three others that he considers competitive. “Our polling consistently showed that by staying on the ballot in the battleground states, I would likely hand the election over to the Democrats, with whom I disagree on the most existential issues,” Kennedy said in a speech. He also encouraged supporters to still vote for him in states where they are unlikely to affect the outcome. Kennedy’s attorneys disagreed that candidates must be kept on the ballot unless they die, arguing that the state has no compelling interest to enforce such a requirement. “Kennedy simply wants off the ballot, there is no rigorous testing of a candidates bona fides when they want off the ballot—you simply do not include his name,” they told the court. “We’re simply asking to not be put on the ballot, as opposed to getting on it.” The Wisconsin Elections Commission declined to comment on the lawsuit. For now, Kennedy remains a presidential candidate on the ballot in Wisconsin, alongside the Green Party’s Jill Stein and fellow independents Cornel West and Shiva Ayyadurai. His lawsuit could have complications, since the county clerks have already been authorized to print ballots to meet upcoming state deadlines for mailing absentee ballots to military and overseas voters. Wisconsin is considered one of the most pivotal states in this year’s race for the White House. Recent elections have shown that even a modestly successful third-party bid can significantly influence who secures the state’s 10 electoral votes. Stein was last on the Wisconsin ballot in 2016, when she secured more than 31,000 votes, more than Trump’s winning margin of just under 23,000 votes. Biden defeated Trump in Wisconsin in 2020 by an even thinner margin of fewer than 21,000 votes.","summary":"The lawsuit alleges that the state's withdrawal deadlines unfairly favor major party candidates.","url":"https://www.theepochtimes.com/us/rfk-jr-sues-to-remove-himself-from-wisconsin-presidential-ballot-5718039","image":"https://img.theepochtimes.com/assets/uploads/2024/07/15/id5686944-GettyImages-1440067395-LSedit-300x180.jpg","video":null,"publish_date":"2024-09-04 23:38:24","author":"Bill Pan","authors":["Bill Pan"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.226},{"id":255662718,"title":"The View’s Sunny Hostin praises Justice Ketanji Brown Jackson for having a ‘black job’","text":"“Let me ask you this, for all the talk about black jobs lately,” co-host Sunny Hostin said to Jackson on Wednesday, pausing as the crowd chuckled. Brown smiled at the camera, appearing nervous as she awaited the host to continue her thought. “We are so proud to call you our first black female justice,” Hostin continued. “Thank you,” Brown said smiling as the crowd applauded. Hostin added, “That’s a black job now.” “Black women know and I think women in general know what it’s like to be ‘the only’ in the room over and over and over again,” she said to the justice. “You write about your experience at Harvard, then you write about rising through the legal ranks in spaces filled mostly with white men, of course. You write this thing that really shocked me. Having to earn respect, prove your mettle, of course, but being mistaken for a secretary on more than one occasion. How do you navigate that? It’s happened to me. I’m sure it’s happened to all of us. What are your tips?” Hostin asked. “Oh my goodness. Well, you know, I mean, it’s a challenge. It’s a challenge. You have to really just be grounded in who you are. You have to know why you’re there and you have to do the best job you can regardless of the circumstances. Those are the kinds of lessons that my parents taught me growing up, that my mentors taught me. You don’t let other people, you know, their views of you be how you proceed in the world,” the justice responded. The justice was asked by co-host Sara Haines about the “historic candidacy” of Vice President Kamala Harris. “I know a little bit about being a first, you know. I think a lot of people were very happy about my appointment in part because they saw it as progress for the country,” Jackson said. “I’m not only so honored, but whenever we see someone moving into a position where no one has ever been, it gives a lot of people hope,” she added.","summary":"Supreme Court Justice Ketanji Brown Jackson joined The View on Wednesday and was praised for having &#8220;a black job.&#8221; &#8220;Let me ask you this, for all the talk about black jobs lately,&#8221; co-host Sunny Hostin said to Jackson on Wednesday, pausing as the crowd chuckled. Brown smiled at the camera, appearing nervous as she awaited [&#8230;]","url":"https://www.washingtonexaminer.com/news/supreme-court/3143766/sunny-hostin-praises-ketanji-brown-jackson-supreme-court-black-job/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Sunny-Hostin-and-Ketanji-Brown-Jackson.webp","video":null,"publish_date":"2024-09-04 23:37:49","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","source_country":"US","sentiment":0.412},{"id":255661644,"title":"High-profile US Republican Liz Cheney says she will vote for Kamala Harris","text":"Former US congresswoman Liz Cheney on Wednesday said she would support Kamala Harris for president, ending weeks of speculation about how fully the member of a Republican dynasty-turned-Trump critic would embrace the Democratic ticket. Cheney, who co-chaired the US House investigation into the January 6, 2021, attack, became a fierce Trump critic and was ousted in her 2022 Republican primary in Wyoming as a result, made her announcement at an event at Duke University. In a video posted on the social media network X, she finished by talking about the “danger” she believed Trump still poses to the country. “I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she said. “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this. Because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.” BREAKING: Here is the exact moment where Liz Cheney just endorsed Kamala Harris. Retweet to make sure every freedom loving American sees it. pic.twitter.com/7mW35YYhV9 — Kamala’s Wins (@harris_wins) September 4, 2024 The daughter of former US vice-president Dick Cheney, Liz Cheney has been perhaps Trump’s highest-profile Republican critic. She joins other Republicans like her former January 6 committee member, former congressman Adam Kinzinger, and former congressman Denver Riggleman, as backers of Harris. More than 200 alumni of the Bush administration and former Republican presidential campaigns of the late Senator John McCain and Senator Mitt Romney also announced their endorsement of Harris last week. Cheney was in House Republican leadership at the time of the January 6 attack but broke with most of her caucus over Trump’s responsibility. She lost her leadership post and was one of the few Republicans willing to serve on the January 6 committee, which was appointed by Democrats who controlled the House at the time.","summary":"The former US congresswoman and daughter of ex-VP Dick Cheney is a fierce Trump critic and chaired the House January 6 investigation","url":"https://www.scmp.com/news/world/united-states-canada/article/3277244/high-profile-us-republican-liz-cheney-says-she-will-vote-kamala-harris","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/09/05/4089acbb-0290-4485-baa6-8afae0459338_d1169b14.jpg","video":null,"publish_date":"2024-09-04 23:33:31","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.327},{"id":255661804,"title":"That photo of people wearing ‘Nebraska Walz’s for Trump’ shirts? They’re distant cousins","text":"MINNEAPOLIS — The sister of Democratic vice presidential nominee Tim Walz says she doesn’t recognize the people wearing “Nebraska Walz’s for Trump” T-shirts in a photo that is making the rounds on social media. It turns out they are distant cousins. The photo shows eight smiling people wearing navy pro-Trump shirts, underneath a “Trump 2024 – Take America Back” sign. The photo was eventually reposted by former President Donald Trump, who wrote on his Truth Social platform: “It is a Great Honor to have your Endorsement. I look forward to meeting you soon!” The photo was first posted on X by Charles Herbster, a former candidate for governor in Nebraska who had Trump’s endorsement in the 2022 campaign. Herbster’s spokesperson, Rod Edwards, said the people in the photo are cousins to the Minnesota governor, who is now Kamala Harris’ running mate. Tim Walz’s family back in Nebraska wants you to know something…@realDonaldTrump @JDVance #SaveAmerica?? pic.twitter.com/zp08nuKAun — Charles W. Herbster (@CWHerbster) September 4, 2024 “The family in the picture are the descendants of Francis Walz, who was brother to Tim Walz’s grandfather,” Edwards said. “They’re all Walzes and spouses.” The descendants of Francis Walz confirmed their relationship to Tim Walz in a text message to The Associated Press. “Shortly after Governor Tim Walz was named the Democrat Party Vice Presidential nominee, our family had a get-together. We had t-shirts made to show support for President Trump and J.D. Vance and took a group picture. That photo was shared with friends, and when we were asked for permission to post the picture, we agreed,” the statement said. “The picture is real. The shirts are real. We are the Nebraska Walz family and we are related to Gov. Tim Walz, our grandfathers were brothers. The message on the shirts speaks for itself, ‘Nebraska Walzs for Trump.’ ” Walz’s sister, Sandy Dietrich, of Alliance, Nebraska, said she suspected it might be people from that branch of the family. Dietrich and Walz’s father, James Walz, died of lung cancer in 1984 when the future congressman and Minnesota governor was just a teenager. His father had been the school superintendent in Valentine, Nebraska. “We weren’t close with them. We didn’t know them,” she said. Dietrich declined to comment on their distant cousins’ opposition to her brother and referred to herself and her family as “Democrats for Tim.” “I know who I’m voting for. That’s all I can control,” she said. But Tim Walz’s other surviving sibling is not behind his candidacy. In recent days, the New York Post has reported on Facebook comments from the governor’s older brother, Jeff Walz, of Freeport, Florida, in which he said of his younger sibling: “The stories I could tell. Not the type of character you want making decisions about your future.” The 67-year-old also wrote that he was “100% opposed to all his ideology” and had thought about endorsing Trump, the Post reported. In comments published Wednesday by NewsNation, Jeff Walz said that he was still irked he learned on the radio that his brother would be Harris’ running mate but that he didn’t intend to influence the political debate and doesn’t want to be involved with anybody’s campaign. Jeff Walz told NewsNation that he and the 60-year-old governor have not spoken since the funeral of their younger brother, Craig Walz, in 2016, aside from a brief phone call last month through their mother. He told NewsNation that what he was referring to in his post by “stories” were from their childhood. “Nobody wanted to sit with him, because he had car sickness and would always throw up on us, that sort of thing,” Jeff Walz said. “There’s really nothing else hidden behind there. People are assuming something else. There’s other stories like that, but I think that probably gives you the gist of it.” He also told NewsNation that he would make no further statements on the subject, and he did not return messages left Wednesday by the AP. Associated Press writers Randy Herschaft and Jennifer Farrar in New York contributed to this report.","summary":"The vice presidential nominee's sister says she doesn't recognize the subjects of the viral photo, which caught the attention of former President Donald Trump.","url":"https://www.centralmaine.com/2024/09/04/that-photo-of-people-wearing-nebraska-walzs-for-trump-shirts-theyre-distant-cousins/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/09/Election_2024_Walz_34503.jpg?w=1000","video":null,"publish_date":"2024-09-04 23:31:08","author":"Steve Karnowski,STEVE KARNOWSKI - Associated Press","authors":["Steve Karnowski","STEVE KARNOWSKI - Associated Press"],"language":"en","source_country":"US","sentiment":-0.047},{"id":255661168,"title":"Analysis of 150 Political Advertisements: Key Takeaways","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill. In today’s edition, national political reporter Bridget Bowman breaks down what the post-Labor Day flood of House ads tell us about the broader political environment. Plus, chief political analyst Chuck Todd examines how Kamala Harris and Donald Trump are trying to portray each other as the incumbent in the 2024 race. Sign up to receive this newsletter in your inbox every weekday here. 3 key 2024 trends, as told by the battle for the House By Bridget Bowman The presidential race has been raging for months, but many House campaigns save their resources for the final stretch before unloading their money on the issues that they most want to highlight. That’s happening right now, with a wave of new TV ads hitting battleground districts around Labor Day. And what’s happening in the House speaks volumes about the political environment that will also decide the presidential election. Here are three big takeaways: 1. Harris and Trump are largely absent from the House campaigns right now. An NBC News analysis of nearly 150 broadcast TV ads that aired over the last week in the 44 most competitive House districts identified by the Cook Political Report with Amy Walter found no Democratic ads name-checked Donald Trump and just four GOP ads directly referenced or showed Kamala Harris. It’s hard to imagine that would be the case if Joe Biden hadn’t dropped out of the race. 2. Cost of living is paramount, especially among Republicans. The high cost of living remains top of mind for voters, and the issue has been dominating House races, with nearly a quarter of ads referencing the issue. Around 40% of recent GOP ads have focused on cost of living, compared with around 16% of Democratic spots. Republicans view this issue as a salient one for the party up and down the ballot, with voters in recent polling giving Trump higher marks on the economy than Harris. 3. Democratic attacks on abortion are largely going unanswered, while GOP attacks on the border are prompting a response. Democrats are going on offense on abortion access, echoing a key argument from the Harris campaign. Abortion was the top issue across Democratic spots, referenced in 30% of the party’s ads in the last week. Just two Republicans launched ads over the last week on those issues. While Republicans have launched attacks on border security, more Democrats have responded to those missives, with about 20% of Democratic ads mentioning the issue. It echoes Harris’ decision to go up with a border ad within weeks of becoming the Democratic presidential candidate, after Biden didn’t run a single TV ad on the border during his 2024 campaign. How Gen Z voters are viewing the Harris-Trump matchup By Stephanie Perry and Marc Trussler A new NBC News Stay Tuned Gen Z Poll, powered by SurveyMonkey, shows that Harris has opened up a lead over Trump with young voters, but is lagging behind Biden’s 2020 margins with the critical bloc. Half of registered voters under 30 said they supported Harris, compared with 34% for Trump. One in 10 respondents said they will not vote in the presidential election, while 6% said they backed another candidate. Harris is backed by 60% of young voters who say they’re almost certain that they will cast a ballot this fall. That figure pulls in line with the 60% of 18- to 29-year-olds won by Biden four years ago, according to NBC News exit poll results. Gender gap: Young women said they’re going to vote for Harris by 30 points. Young men also said they favor Harris, but by only 4 points over Trump. Education gap: Harris led Trump among college graduates (56% to 30%) and currently enrolled college students (54% to 29%). Support between the two candidates is tied at 41% among young voters without a college degree who are not currently enrolled in school. On the issues: Three in 10 voters under 30 said inflation and cost of living is the most important problem facing the country, followed by threats to democracy (11%) and abortion (9%). Harris and Trump try to paint each other as the incumbent By Chuck Todd How do you hold a change election — when the two candidates are a sitting vice president and the most recent former president? That question may mask itself as a riddle, but who voters decide is “the incumbent” is easily the single most important question if you are trying to figure out who is going to win the 2024 election. In short, the candidate who loses will likely be the one that a majority of swing voters view as more “incumbent-like” in their minds. And the debate next week will go a long way in establishing that, depending on how well the candidates do at painting the other as part of the current problem. There’s an obvious reason why both campaigns are furiously trying to cast the other as the incumbent: The electorate is grumpy and has been for just about the entire 21st century. When you step back and examine the U.S. voters’ take on whether the country is headed in the right direction or off on the wrong track, the country has basically been on the side of “wrong track” for nearly two decades — call it a massive and generation-long political recession. And our presidential and midterm election outcomes in that time have indicated that a majority of said electorate was looking for change. Only two national elections in this century — 2004 and 2012 — did not see a flip of one of the following three Washington power centers: the White House, which has changed partisan hands three times (2008, 2016 and 2020); the Senate four times (2002, 2006, 2014 and 2020); and the House four times (2006, 2010, 2018 and 2022). Both candidates are and should be having a hard time making the case for change simply due to their current and former jobs. That’s all from the Politics Desk for now. If you have feedback — likes or dislikes — email us at [email protected]","summary":"Internewscast Journal\n\nInternewscast\n\n\nWelcome to the online version of From the Politics Desk, an evening newsletter&#8230;\n\n\nThis Post: Analysis of 150 Political Advertisements: Key Takeaways first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/analysis-of-150-political-advertisements-key-takeaways/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-06/240621-nevada-vote-ballot-election-voters-2022-ac-425p-4d94fd.jpg","video":null,"publish_date":"2024-09-04 23:30:38","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.071},{"id":255662060,"title":"Letters: Inclusive and fair | Justice reform | Right-wing columns | Ignoring affronts | Bad to worse","text":"Ethnic studies program must be inclusive, fair Re: “Ethnic studies bill opposition delays its implementation” (Page A1, Aug. 28). AB 2918 is designed to address valid concerns about some aspects of mandated high school ethnic studies courses. It has been delayed to next year’s legislative session to allow more time to work with opponents. According to Assemblyman Zbur, “We don’t have the same level of review and guardrails (for ethnic studies) that are generally put in place for other kinds of curriculum that we bring into the classroom in the state of California.” He also noted that “There are cases that are popping up around the state where we’re seeing curriculum that is just clearly inappropriate.” AB 2918 would require schools to submit a detailed explanation if they choose to develop a course differing from the state model curriculum to ensure that the school’s curriculum meets state requirements for students. There is no “apparent pro-Israel bias” in ensuring that ethnic studies curriculum is fair and inclusive for all students. Julia Lutch Davis Legislature sets back justice reform effort Justice reform took a small loss when our California Legislature decided against moving SB 94, a Senate bill that was going to help inmates sentenced to life without parole in California get a chance at parole board hearings. Once again we who are sentenced to life without parole suffer the injustice of serving a death sentence that doesn’t get recognized as such. Death by prison is a real thing. To give a man no incentive, yet ask him to be a model inmate is an oxymoron. Everyone deserves a second chance at life. I’ve been in prison for nearly three decades for crimes that occurred when I was 18 years old. Don’t I as a youth offender deserve a second chance? I have completely changed my life. Yet I do not get the same opportunity as other youth offenders, due to my sentence to life without parole. John Crosthwaite Corcoran state prison Thiessen’s right-wing columns aren’t useful Re: “Harris unlikely to break curse on sitting VPs” (Page A12, Sept. 1). It is long past time for the East Bay Times to stop spewing the right-wing bleating of Marc Thiessen. Thiessen, a former partner of convicted criminals Paul Manafort and Roger Stone and former mouthpiece of racist Jessie Helms. Now, here he is spewing complete falsehoods about inflation while ignoring the thousands of American deaths directly attributable to Donald Trump’s narcissistic (“slow the testing down“) and buffoonish (injecting bleach) handling of the COVID pandemic. But, with regard to his dire historical warning to VP Kamala Harris, Thiessen would do well to remember the American “history” leading up to the election of our nation’s first Black president. And now we are poised to make new history with the first Black woman president, something causing his former boss Jesse Helms to roll over in his grave. Steve Reynolds Danville Trump supporters used to ignoring affronts Re: “Trump, Gold Star families clash with Harris over Arlington Cemetery visit” (Page A4, Sept. 2). Whether Donald Trump is defiling the most sacred section of Arlington National Cemetery, committing felonies, attempting to overthrow the government or stealing confidential documents, the message is clear: Rules shouldn’t apply to Trump. Equal justice is just such a basic tenant of the United States, I don’t understand how his supporters can ignore it. When Kamala Harris is elected, I wonder how long it will be before the Supreme Court changes its mind on presidential immunity. Cliff Gold Fremont Harris’ indifference worsens bad situation To make matters worse, Harris has not contacted any of the Gold Star families despite pleas to hear from her. A tragedy that should have never happened has now been made worse. Douglas Abbott Union City","summary":"East Bay Times Letters to the Editor for Sept. 5, 2024","url":"https://www.mercurynews.com/2024/09/04/letters-1856/","image":"https://www.mercurynews.com/wp-content/uploads/2024/03/OCR-L-SENATEPARITY-0320.jpg?w=1024","video":null,"publish_date":"2024-09-04 23:30:22","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.234},{"id":255661534,"title":"Liz Cheney Spurns Her Party With Kamala Harris Endorsement","text":"Former Republican Congresswoman Liz Cheney has thrown her support behind Kamala Harris in the upcoming election. Cheney, who represented Wyoming, made the endorsement while speaking at Duke University on Wednesday. An X video posted by an attendee captured what she said. “It is crucially important for people to recognize, not only is what I said about the danger Trump poses something that should prevent people from voting for him, but I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she told the audience.","summary":"Anna Moneymaker/GettyFormer Republican Congresswoman Liz Cheney has thrown her support behind Kamala Harris in the upcoming election.Cheney, who represented Wyoming, made the endorsement while speaking at Duke University on Wednesday. An X video posted by an attendee captured what...","url":"https://nation.lk/online/liz-cheney-spurns-her-party-with-kamala-harris-endorsement-275876.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-09-04 23:30:03","author":null,"language":"en","source_country":"lk","sentiment":-0.099},{"id":255661536,"title":"White House Press Sec Turns the Tables on Fox Reporter Who Questioned Harris’ Voice","text":"White House Press Sec. Karine Jean-Pierre poked fun at a Fox News reporter who questioned Vice President Kamala Harris’ accent—just one day after she shut his question down as “insane.” Peter Doocy, Fox News’ White House correspondent, provoked the press secretary’s ire on Tuesday when he asked if the Democratic nominee was putting on a southern accent during her speeches. But his question on Wednesday went over much better with Jean-Pierre. “President Biden’s approval rating is soaring, it’s up 13% all the way to 48%—does it bother the president that people are so pleased that he’s retiring?”","summary":"Alex Wong/Getty ImagesWhite House Press Sec. Karine Jean-Pierre poked fun at a Fox News reporter who questioned Vice President Kamala Harris’ accent—just one day after she shut his question down as “insane.”Peter Doocy, Fox News’ White House correspondent, provoked...","url":"https://nation.lk/online/white-house-press-sec-turns-the-tables-on-fox-reporter-who-questioned-harris-voice-275875.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-09-04 23:30:03","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":0.285},{"id":255662248,"title":"Republican Liz Cheney says she will vote for Kamala Harris","text":"Republican former congresswoman Liz Cheney said today she will vote for Democratic presidential nominee Kamala Harris, calling Donald Trump a “danger.” “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this and because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I am voting for Kamala Harris,” Cheney said at an event at Duke University in Durham, North Carolina, according to a video posted on social media platform X. Cheney supported Trump’s second impeachment for his role in the Jan. 6, 2021, storming of the U.S. Capitol by Trump supporters and she served as vice chair of the House of Representatives committee that investigated the attack. Cheney lost her seat in Congress after Trump backed her opponent in the 2022 Republican primary.","summary":"Republican former congresswoman Liz Cheney said today she will vote for Democratic presidential nominee Kamala Harris, calling Donald Trump a &#8220;danger.&#8221;","url":"https://www.staradvertiser.com/2024/09/04/breaking-news/republican-liz-cheney-says-she-will-vote-for-kamala-harris/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/09/web1_20240904_brk_lch01.jpg","video":null,"publish_date":"2024-09-04 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.39},{"id":255662050,"title":"Tim Walz family members pose in t-shirts declaring their presidential preference: 'Walz's for Trump'","text":"An image circulating online shows family members of vice presidential candidate Gov. Tim Walz openly supporting former President Trump. The photo was shared online by former Nebraska Republican gubernatorial candidate Charles Herbster. It shows eight people wearing \"Nebraska Walz's (sic) for Trump\" t-shirts. \"Tim Walz's family back in Nebraska wants you to know something…\" Herbster wrote on X. HARRIS SLAMS TRUMP OVER ARLINGTON NATIONAL CEMETERY ALTERCATION, PROMPTING FIERY RESPONSE FROM JD VANCE A representative for Herbster told Fox News Digital that the people in the photo are related to Walz through his grandfather's brother, Francis Walz. Fox News Digital has reached out to the Trump and Harris campaigns. Family members told Fox News they consider themselves \"distant\" from Walz and have never met or spoken with him. One person in the photo who wished to remain anonymous said they are supporting Trump because \"he supports our values.\" Trump replied on Truth Social to the image, implying that he plans to \"meet\" with Jeff Walz, the older brother of the Minnesota governor. The older Walz posted a series of statements last week about the Democratic vice presidential nominee on social media. \"I'm 100% opposed to all his ideology,\" Jeff Walz posted in one Facebook message Friday evening, referring to his brother. TRUMP IMPERSONATES ELON MUSK TALKING ABOUT ROCKETS: ‘I’M DOING A NEW STAINLESS STEEL HUB’ \"My family wasn't given any notice thst [sic] he was selected and denied security the days after,\" he added. \"Help MAGA… Get on stage with President Trump and endorse him…; Help save this country….,\" a Trump supporter wrote on Jeff's post. \"I've thought hard about doing something like that!\" Jeff responded. \"I'm torn between that and just keeping my family out of it.\" Gov. Walz has three siblings: Jeff Walz, Craig Walz and Sandy Dietrich. Jeff moved to the East Coast after growing up in rural Nebraska; he now lives in Florida. He also posted about how he found out his brother was chosen as Vice President Kamala Harris's running mate. CLICK HERE TO GET THE FOX NEWS APP \"The only thing I took exception to, and I will stand behind this 100%, was that we felt bad that we found out about his being picked as the vice presidential candidate from radio,\" Jeff said. \"And we felt like we probably should have been given a heads-up and some type of security, at least for a short time, because I guess that is a big thing.\" Fox News Digital's Andrea Vacchiano and Emma Colton contributed to this report.","summary":"Relatives of Minnesota Gov. Tim Walz are showing support for former President Trump, as evidenced by a photo circulating online.","url":"https://www.foxnews.com/politics/tim-walz-family-members-pose-tshirts-declaring-presidential-preference-walzs-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/Walzfamily.jpg?ve=1&tl=1","video":null,"publish_date":"2024-09-04 23:29:21","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.257},{"id":255661490,"title":"White House Press Sec Turns the Tables on Fox Reporter Who Questioned Harris’ Voice","text":"White House Press Sec. Karine Jean-Pierre poked fun at a Fox News reporter who questioned Vice President Kamala Harris’ accent—just one day after she shut his question down as “insane.” Peter Doocy, Fox News’ White House correspondent, provoked the press secretary’s ire on Tuesday when he asked if the Democratic nominee was putting on a southern accent during her speeches. But his question on Wednesday went over much better with Jean-Pierre. “President Biden’s approval rating is soaring, it’s up 13% all the way to 48%—does it bother the president that people are so pleased that he’s retiring?” Not missing a beat, Jean-Pierre asked him “Am I hearing a little twang in your voice, Peter?” “I know better, I know better” Doocy replied. Jean-Pierre did not directly answer Doocy’s question about Biden’s feelings, but used the opportunity to brag about the higher approval ratings At Tuesday’s daily briefing, the Fox reporter was passed over after he asked “since when does the vice president have what sounds like a Southern accent?” Jean-Pierre was nearly at a loss for words. “I’m not even going to entertain some question about… it’s just, hearing it sounds so ridiculous.” The Trump campaign’s accounts on social media have tried to play up the difference in Harris’ voice and accent, pointing to perceived differences in her speeches in Detroit and Pittsburgh on Monday and in Atlanta in July. Although Doocy tried to follow up with another question about the vice president’s voice, Jean-Pierre immediately moved on to another reporter.","summary":"Alex Wong/Getty ImagesWhite House Press Sec. Karine Jean-Pierre poked fun at a Fox News reporter who questioned Vice President Kamala Harris’ accent—just one day after she shut his question down as “insane.”\n\nPeter Doocy, Fox News’ White House correspondent, provoked the press secretary’s ire on Tuesday when he asked if the Democratic nominee was putting on a southern accent during her speeches.\n\nBut his question on Wednesday went over much better with Jean-Pierre. “President Biden’s approval rating is soaring, it’s up 13% all the way to 48%—does it bother the president that people are so pleased that he’s retiring?”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/white-house-press-sec-turns-the-tables-on-fox-reporter-who-questioned-harris-voice","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2993,w_5320,x_0,y_251/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1725489075/kjp_2_xhc041","video":null,"publish_date":"2024-09-04 23:27:44","author":"Zachary Folk","authors":["Zachary Folk"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.099},{"id":255661166,"title":"Sheriff from Georgia delivers heartfelt speech following tragic shooting at Apalachee High School, resulting in four fatalities","text":"Sheriff Jud Smith of Barrow County has reacted with horror to the shooting at Apalachee High School in Georgia, calling the event an act of ‘pure evil.’ Authorities identified Colt Gray, a 14-year-old student at the school, as the shooter who killed two students and two teachers. Nine victims were taken to hospitals with gunshot injuries, according to the Georgia Bureau of Investigation. ‘My heart hurts for these kids, my heart hurts for this community, but I want to make it very clear that hate will not prevail in this county,’ Sheriff Smith during a press conference on Wednesday. ‘Love will prevail over what happened today, I assure you of that.’ Smith said he was born and raised in the county and was once a student in the Barrow County School System, which includes Apalachee High School. ‘My kids go to this school system. I’m proud of this school system,’ he said. The high school, which is home to around 1,900 students, is in the town of Winder, about 25 miles west of Athens. Smith didn’t speculate on the motive of the shooter, nor did he mention him by name in his short address to the media. It’s been revealed that Gray will be charged with murder and will be tried as an adult. ‘I don’t know why it happened. I may not ever know. We may not ever know, but I ask that you and our community lift up our schools, lift up our public safety and that again we do not let this hateful event prevail.’ He thanked Georgia Governor Brian Kemp for offering support, as well as the myriad of state, local and federal agencies that helped in the response to the shooting. ‘They prevented a lot more tragic events from happening,’ he said. Smith also confirmed that the school resource officer engaged with the shooter, who eventually surrendered to police. ‘The shooter quickly realized that if he did not give up that it would end with an OIS, or an officer-involved-shooting. He gave up, got on the ground and the deputy took him into custody,’ he said. Smith repeatedly said the investigation was in its early stages, and wasn’t able to answer a question about how the shooter obtained his gun, nor did he identify the type of weapon he used. He added that authorities don’t know that Gray had any specific targets. He also didn’t confirm whether Gray had a connection to any of the victims. More information should come to light soon though, as Smith revealed that the shooter has been interviewed by police and the Georgia Bureau of Investigation. So far, the only victim that has been identified is special education math teacher David Phenix, who survived but was rushed to hospital after being shot in the hip and foot. Phenix’s daughter, Katie, revealed on Wednesday that he ‘arrived to the hospital alert and awake’ and was rushed straight into surgery. ‘He just got out of surgery and is stable,’ she said. Phenix, who has been a teacher for 22 years, had intended to retire in 2023 but decided to stay when offered the chance to coach golf. Before the sheriff’s office received the first reports of a shooting at around 10:20am ET, the high school received a threat via phone, CNN reported. The caller reportedly claimed there would be shootings at five schools and that Apalachee would be first. Authorities said there were no other shootings besides the one at Apalachee and will investigate the source of this call. Governor Kemp said he was ‘heartbroken’ by the shooting, adding that his office will ‘continue to work closely with local, state and federal partners to make any and all resources available to help this community on this incredibly difficult day and the days to come.’ The candidates for president have also addressed the heinous crime, with Vice President Kamala Harris calling it a ‘senseless tragedy.’ ‘We have to end this epidemic of gun violence in our country once and for all. It doesn’t have to be this way,’ she added. Former President Donald Trump called the shooter a ‘deranged monster.’ ‘Our hearts are with the victims and loved ones of those affected by the tragic event in Winder, GA. These cherished children were taken from us far too soon by a sick and deranged monster,’ he wrote on Truth Social.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSheriff Jud Smith of Barrow County has reacted with horror to the&#8230;\n\n\nThis Post: Sheriff from Georgia delivers heartfelt speech following tragic shooting at Apalachee High School, resulting in four fatalities first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/sheriff-from-georgia-delivers-heartfelt-speech-following-tragic-shooting-at-apalachee-high-school-resulting-in-four-fatalities/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-Georgia-sheriff-gives-emotional-speech-after-Apalachee.jpg","video":null,"publish_date":"2024-09-04 23:26:25","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.497},{"id":255661272,"title":"Harris campaign agrees to muted mics in debate against Trump","text":"Washington — Vice President Kamala Harris' campaign was unable to sway ABC News, the host of next week's presidential debate, to keep the microphones unmuted for the 90-minute debate against former President Donald Trump. Her campaign agreed to let the microphones remain muted when a candidate isn't speaking, according to a letter it sent to ABC News, ending the back-and-forth over the rules for the Sept. 10 debate. \"Vice President Harris, a former prosecutor, will be fundamentally disadvantaged by this format, which will serve to shield Donald Trump from direct exchanges with the Vice President. We suspect this is the primary reason for his campaign's insistence on muted microphones,\" said the letter, which was obtained by CBS News. The Harris campaign also told CBS News it was offered assurances as to how any crosstalk may be handled. The microphones may be unmuted if there is significant crosstalk between the candidates. A candidate who constantly interrupts their opponent will be warned by the moderator and their comments may be relayed to the audience. And, if the microphones don't pick up the exchanges, a group of reporters who will be in the room would report anything noteworthy. \"Notwithstanding our concerns, we understand that Donald Trump is a risk to skip the debate altogether, as he has threatened to do previously, if we do not accede to his preferred format,\" the letter read. \"We do not want to jeopardize the debate. For this reason, we accepted the full set of rules proposed by ABC, including muted microphones.\" The Biden campaign had requested that the candidates' microphones be muted when their opponent was speaking during the match-up between President Biden and Trump in June, which was hosted by CNN. Trump's campaign opposed changing the rules for the September debate. \"We agreed to the same rules. I don't know, doesn't matter to me,\" Trump said Aug. 26 while campaigning in Virginia. \"I'd rather have it probably on, but the agreement was that it would be the same as it was last time. In that case, it was muted. I didn't like it the last time but it worked out fine.\"","summary":"A candidate's microphone will be muted when it's their opponent's turn to answer a question.","url":"https://www.cbsnews.com/news/harris-trump-debate-muted-mics-rules/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/04/31746cb7-b8ed-428f-9a99-be06513b1bb5/thumbnail/1200x630g2/03fabd5fbfce1112ed163c78dccc2e6f/screenshot-2024-08-03-at-9-57-05-pm.png?v=631cf5f2b4e8db7f9bc428589402864d","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3167476_hls/master.m3u8","publish_date":"2024-09-04 23:20:53","author":"Caitlin Yilek,Ed O'keefe","authors":["Caitlin Yilek","Ed O'keefe"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.363},{"id":255660954,"title":"Harris, Trump Hit Campaign Trail As Debate Looms","text":"Kamala Harris and Donald Trump returned to the US campaign trail Wednesday, with new polls showing the White House race remains on a knife-edge less than a week before their crucial first debate.As they buckled down for the final two-month sprint to Election Day, the latest spasm of gun violence rippled through the United States, with four people killed by a 14-year-old student at a high school in the southern state of Georgia.Vice President Harris, condemning the \"senseless tragedy\" of the shooting, urged a halt to the \"epidemic of gun violence\" plaguing the United States.She also reiterated her call for a ban on assault weapons -- a position widely opposed by Republicans -- as she addressed a rally in New Hampshire.Trump, himself the target of an assassination attempt by a gunman in July, said the victims \"were taken from us far too soon by a sick and deranged monster.\"Security has been beefed up on the trail. Harris spoke Wednesday at a brewery south of Portsmouth on a stage protected on three sides by bullet-proof glass, an apparent first for her, while Trump too used such reinforced protection during a recent outdoor event.Harris, who has revived Democratic hopes with just 61 days until the November 5 vote, unveiled proposed tax breaks for small businesses as she fleshed out her economic policy.In a rare break with Biden, she proposed a 28 percent tax rate on capital gains, lower than the 39.6 percent planned by the president, in her latest attempt to appeal to centrist voters. \"We know when the government encourages investment, it leads to broad-based economic growth, and it creates jobs, which makes our economy stronger,\" Harris said.Team Trump meanwhile blasted the plans, saying in a statement that Harris's various proposals would lead to tax hikes \"on almost 26 million small businesspeople in America.\"Trump himself participated in a pre-recorded town hall event that airs at 9:00 pm (0100 GMT Thursday) on conservative-leaning Fox News in Pennsylvania.The appearance came after the Republican's notable campaign trail absence over the US Labor Day weekend, traditionally the start of the final sprint.Then on Tuesday, millions of American voters will finally see Harris and Trump do battle in-person during their debate on primetime television.\"She's had her honeymoon period. People are learning who she is,\" Trump told a local New Hampshire radio station Wednesday. \"We can't go another four years with a dumb president.\"Harris, 59, has upended the race since Biden dramatically quit as the Democratic candidate after the 81-year-old's disastrous performance in a debate against Trump exacerbated fears about his age and mental acuity.America's first female, Black and South Asian vice president has swiftly erased Trump's poll lead and forced the ex-president and convicted felon to rethink his campaign.Despite his unprecedented attempt to overturn the 2020 election -- culminating in a mob of supporters storming the US Capitol -- 78-year-old Trump retains passionate support on the right.He faces a new challenge with Harris. A CNN poll released Wednesday showed the race remains nail-bitingly close in six key battleground states likely decide the presidency.Harris holds the edge against Trump over likely voters in the \"Rust Belt\" states of Wisconsin and Michigan, by 50 percent to 44 percent, and 48 percent to 43 percent respectively. Trump meanwhile has the edge in Arizona by 49 percent to 44 percent.But the race is essentially tied in three other states -- most critically in Pennsylvania, the biggest swing state prize in terms of votes in the US electoral college system.Biden won all six states when he defeated Trump in 2020.The findings come a day after a USA Today/Suffolk University poll found Harris leading Trump 48 percent to 43 percent -- with double-digit gains with crucial groups including Hispanic and Black voters and younger people.Harris got a boost of sorts Wednesday from Republican quarters when former congresswoman Liz Cheney, an arch conservative and never-Trumper, endorsed the Democrat for president.\"Because of the danger that Donald Trump poses, not only am I not voting for Donald Trump but I will be voting for Kamala Harris,\" Cheney told a gathering at Duke University, in videos posted to social media.On the economic front, the American steel industry was rocked by a report that President Joe Biden plans to block a deal selling US Steel to Japan's Nippon Steel.The American firm warned it could shut factories in Pennsylvania.Harris travels to Pittsburgh, Pennsylvania on Thursday, while Trump is slated to hold a rally Saturday in swing state Wisconsin.","summary":"Kamala Harris and Donald Trump returned to the US campaign trail Wednesday, with new polls showing the White House race remains on a knife-edge less than a week before their crucial first debate.","url":"https://www.ibtimes.com.au/harris-trump-hit-campaign-trail-debate-looms-1851240","image":"https://d.ibtimes.com.au/en/full/1858746/kamala-harris-donald-trump-are-both-hitting-campaign-trail.jpg","video":null,"publish_date":"2024-09-04 23:18:12","author":"Joseph Prezioso, With Danny Kemp In Washington","authors":["Joseph Prezioso, With Danny Kemp In Washington"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.179},{"id":255661928,"title":"Fellow Muslims keep asking me why I support Kamala Harris. Here’s what I say.","text":"The first Muslims to arrive in what became the United States of America were Black like me. They were brought here via the trans-Atlantic slave trade. These enslaved Africans were faithful Muslims praying in the U.S. colonies before Thomas Jefferson was even born. And they suffered, as all enslaved Africans suffered, through genocide and brutal and deadly oppression. Although there’s a mistaken belief that Muslims first arrived en masse in the United States with an influx of Arab and Pakistani immigrants in the 1960s, the history of Black Muslims, who were here before there was a country, is a reminder that while we may share the same faith as Muslims from the Middle East and South Asia, we have a different experience of America. These Black Muslim ancestors left rich histories and a legacy of fighting for what’s right. I am proud to have carried on this legacy throughout my career, most recently by founding the Black Muslim Leadership Council — a first-of-its-kind nonprofit dedicated to advancing justice and equity for Black American Muslims through policy advocacy, civic education, voter mobilization and leadership development. Our advocacy wing, the Black Muslim Leadership Council Fund, has endorsed Vice President Kamala Harris’ presidential campaign, and I, in my personal capacity, am doing the same. Despite my consistent calls for a cease-fire in Gaza, and despite my history of working with the Palestinian community in my native Philadelphia, my support of the vice president’s candidacy has led to accusations that I am ignoring the human rights catastrophe in Gaza and undermining the Palestinian cause. Despite my leadership in the Uncommitted Pennsylvania campaign, which led to more than 60,000 voters using the write-in vote to protest President Joe Biden’s leadership; and despite my directly telling President Biden about the history of solidarity between Black Americans and Palestinians and the moral dilemma his candidacy presented, I have been repeatedly asked by other Muslims to defend my vote for Harris. My parents converted to Islam in the early 1970s, finding a safe haven and a home alongside other Black American Muslims in a country that so often tried to reject them. This community is now my haven. My Pennsylvanian Muslim family is my foundation, and serving them is my way of life. Every day, I see the struggles facing my people, and I see the courage and resolve it takes to overcome and thrive. Despite so many advancements, my community still suffers significant oppression. I have been harassed, targeted and doxxed by people throughout the country — including by other Muslims. My support of Vice President Harris has been attacked, as many have chosen not to support Harris, seeing her as an extension of President Biden, who has been widely criticized for his handling of the humanitarian catastrophe in Gaza. My goal in my career is to advance policy for the American Muslim community at large, but with a focus on Black American Muslims. I will continue to focus on the nuanced needs of my specific community because, in large part, no one else is focusing on us. This is how I honor the legacy of my father, a prominent imam who devoted his life to serving this same community. While I share many of the same goals and concerns as other American Muslims, I also am specifically dedicated to uplifting the needs of the Black American Muslim community. My community cares deeply about the crisis in Gaza, as well as the suffering of Muslims in Sudan and its Darfur region, Congo, Yemen, Syria, Kashmir and China. We care about reproductive rights, particularly for people who have experienced sexual abuse, and for women who have died during childbirth — especially Black women, who die at much higher rates than other women in the United States. We care about economic opportunity, including the paths to establish generational wealth, which have for so long been denied to Black people, including Black Muslims. We care about public safety and ending the rampant gun violence that has led to the deaths of so many people, especially Black men. Harris is the candidate who has most effectively supported the causes that are important to my community. Her opponent, former President Donald Trump, has shown in his track record and on the campaign trail that he will not support these causes. I have heard from many who say they’ll vote third-party to demonstrate their dissatisfaction with the major party candidates, or who say they will not vote at all. As tantalizing as some of these third-party candidates may be, they are not a viable option. Other third-party candidates have deeply problematic and even dangerous stances on international relations, health care and immigration. Not voting is not an option either. The threat that faces our country, and our world, is too great not to use the greatest gift of democracy: our vote. In its purest essence, politics is about strategy. This sometimes means having to make tough choices to achieve the best possible outcome for ourselves and our community. It would be nice to agree with each and every one of our chosen candidate’s decisions and platforms. But we do not have to do this to keep our democracy alive. We have, on one hand, a candidate who fights for voter rights, reproductive rights and public safety. On the other, we have a candidate who seeks to consolidate power, threaten our constitutional freedoms and implement policies reminiscent of the Jim Crow era. We have a candidate who, as a Black and South Asian woman, understands personally the oppression faced by the most neglected of us and has overcome adversity to rise to a position of power, and we have a candidate who moved to ban Muslims from entering the country, has called majority Black nations, many of them with large Muslim populations, “s---hole countries,” and who bases his campaign on sowing division and hatred. As I have already done, I will continue to advocate for the innocent people who are being killed in Gaza, as well as advocate for the other domestic needs of my community. I will also continue to tell Muslims asking me to defend my vote for Harris that I see her as not only the best chance for a cease-fire, but also the best chance we have to protect fundamental freedoms — for every one of us. In this decision, and in my personal and professional career, I stand on the shoulders of the great Black American Muslim women and men who came before me — who fought through unspeakable traumas to build a better life for their descendants. I am proud to be part of this legacy. The fight continues now, as it has for centuries — and it will take each one of us committing to defending our freedoms to ensure that we will not go back. The views represented in this article are the author’s own, given in her individual capacity and do not represent the positions of her associated institutions.","summary":"As a Black Muslim woman who helped lead the Uncommitted movement, I've been asked by other Muslims to explain my support for Vice President Kamala Harris.","url":"https://www.msnbc.com/opinion/msnbc-opinion/kamala-harris-gaza-ceasefire-muslim-vote-rcna169643","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-09/240904-kamala-Harris-benjamin-Netanyahu-bibi-ac-710p-da43f3.jpg","video":null,"publish_date":"2024-09-04 23:17:02","author":"Salima Suswell","authors":["Salima Suswell"],"language":"en","source_country":"US","sentiment":0.035},{"id":255662310,"title":"Republican Liz Cheney crosses party lines to endorse Kamala Harris","text":"CTVNews.ca Top Stories Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power. The Liberal-NDP deal is dead. What did it accomplish? NDP Leader Jagmeet Singh revealed Wednesday that he's 'ripped up' the supply and confidence agreement with the Liberals. Here's a look at everything the deal accomplished — and what's been left unfinished. Liberal House Leader 'quite surprised' by NDP pulling out of two-party deal Government House Leader Karina Gould says she was 'quite surprised' when she found out “at the same time as other Canadians today” that NDP Leader Jagmeet Singh was pulling out of the supply-and-confidence deal with the Liberal government. 'Unprovoked' attacks in Vancouver leave man dead, another with severed hand A pair of stranger attacks in downtown Vancouver left one man dead and another with a severed hand on Wednesday morning. Officials identify 14-year-old student as suspect in Georgia school shooting that left 4 dead The gunman who opened fire inside Apalachee High School in Winder, Ga., is a 14-year-old male, Georgia officials confirmed Wednesday. Bank of Canada cuts key interest rate for third consecutive time The Bank of Canada has cut its policy interest rate for a third consecutive time. Governor Tiff Macklem says if the economy continues to improve, Canadians can expect more rate cuts later this year. 'Terrifying': Suspect tries to drive over cruiser to escape after police surround stolen Bronco at Mississauga drive-thru A call about a suspicious vehicle ended with a Ford Bronco sitting atop a Peel police cruiser at a Tim Hortons drive-thru in Mississauga Tuesday. Six bear cubs, mom, spotted exploring tree on Manitoba property Betty Matchizen was left counting black bears as she drove by her farm yard in Thalberg, Man. She said she pulled over on the side of the road on the weekend after seeing six black bear cubs and their mom hanging around an oak tree on the property. Bear cub from northern Ont. survives 10-hour drive to Windsor in back of van, being fed Taco Bell A black bear cub survived a 10-hour drive to Windsor while being fed Taco Bell after being found in the middle of a road near Cochrane, Ont. Canada 2 Canadians face 36 charges following months-long human trafficking investigation A Brampton resident is one of the two people facing dozens of human trafficking charges following a 10-month-long investigation that started in eastern Ontario. Six bear cubs, mom, spotted exploring tree on Manitoba property Betty Matchizen was left counting black bears as she drove by her farm yard in Thalberg, Man. She said she pulled over on the side of the road on the weekend after seeing six black bear cubs and their mom hanging around an oak tree on the property. Lawsuit over management of The Stronach Group's wealth settled out of court: company The Stronach Group says a lawsuit filed by Frank Stronach's son and granddaughter over management of the family business's wealth has been settled out of court. 'She was kind, she was brilliant': Family, friends remember Ingleside, Ont. teen struck and killed while cycling Charlotte Light was supposed to start high school this week. Instead her family and friends are gathering to mourn the loss of the 14-year-old, remembered for her love of family, faith and a passion for soccer, theatre and dance. 'Unprovoked' attacks in Vancouver leave man dead, another with severed hand A pair of stranger attacks in downtown Vancouver left one man dead and another with a severed hand on Wednesday morning. 'Terrifying': Suspect tries to drive over cruiser to escape after police surround stolen Bronco at Mississauga drive-thru A call about a suspicious vehicle ended with a Ford Bronco sitting atop a Peel police cruiser at a Tim Hortons drive-thru in Mississauga Tuesday. World Republican Liz Cheney crosses party lines to endorse Kamala Harris Former Republican Rep. Liz Cheney on Wednesday said she would support Kamala Harris for president, ending weeks of speculation about how fully the member of a GOP dynasty-turned-Trump critic would embrace the Democratic ticket. Footage of motorcade racing JFK to the hospital after he was shot is set to go to auction Newly emerged film footage of former U.S. president John F. Kennedy's motorcade speeding down a Dallas freeway toward a hospital after he was fatally wounded will go up for auction later this month. Federal agents seize US$33 million worth of cocaine on Puerto Rican island popular with tourists Federal agents on Wednesday seized US$33 million worth of cocaine aboard a boat that was trying to smuggle the drug into the tiny Puerto Rican island of Vieques, according to officials. Harris breaks with Biden on capital gains tax, proposing a smaller increase U.S. Vice-President Kamala Harris proposed increasing the long-term capital gains tax rate to 28 per cent for wealthy Americans during an economic speech in New Hampshire on Wednesday, breaking with the policy laid out by President Joe Biden in his 2025 budget by suggesting a lower rate. White House signalling it will likely stop Nippon Steel's plans to buy U.S. Steel The White House is signalling an openness to blocking the acquisition of U.S. Steel by Nippon Steel, as a government review of the proposed takeover by the Japanese company is on the cusp of ending. Officials identify 14-year-old student as suspect in Georgia school shooting that left 4 dead The gunman who opened fire inside Apalachee High School in Winder, Ga., is a 14-year-old male, Georgia officials confirmed Wednesday. Politics Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power. Liberal House Leader 'quite surprised' by NDP pulling out of two-party deal Government House Leader Karina Gould says she was 'quite surprised' when she found out “at the same time as other Canadians today” that NDP Leader Jagmeet Singh was pulling out of the supply-and-confidence deal with the Liberal government. The Liberal-NDP deal is dead. What did it accomplish? NDP Leader Jagmeet Singh revealed Wednesday that he's 'ripped up' the supply and confidence agreement with the Liberals. Here's a look at everything the deal accomplished — and what's been left unfinished. Health Health Canada orders provinces to destroy old COVID-19 vaccines amid wait for new batch Ontario has been directed to withdraw and destroy all remaining supplies of last year's COVID-19 vaccines while it awaits delivery of an updated shot, which is only expected to arrive in October, the health ministry confirms. Canadian researchers find signs of awareness in comatose patient, study says Researchers in London, Ont., say they were able to detect awareness in a comatose patient with a brain injury -- a finding they say 'opens the door' to providing better care with the hope of more accurately predicting critically injured patients' prognosis for recovery. 'I wouldn't be here': Ontario supervised consumption site users speak out on closures Reggie Garrett weeps as he speaks about the Parkdale Queen West Community Health Centre, which houses the supervised consumption site he uses. It is one of 10 such sites slated for closure after the province announced new rules. Sci-Tech Small asteroid burns up in Earth's atmosphere over the Philippines A small asteroid discovered on Wednesday harmlessly burned up in Earth's atmosphere the same day, NASA said. 'Enthusiastic amateur' finds 'remarkable' Pictish ring buried for more than 1,000 years A 'remarkable' Pictish ring with 'an intricate setting' was discovered in Scotland by an amateur archeologist after being buried for more than 1,000 years. 'It's pretty unique to see them': Salamander migration in full swing in Manitoba Herds of salamanders are crossing the road in western Manitoba by the dozens. Entertainment k.d. lang & The Reclines reunite at CCMA for first time in 35 years The 2024 Canadian Country Music Association (CCMA) Awards being held in Edmonton later this month will feature a special reunion. Giller Prize releases long list, drops Scotiabank from name The group of authors in contention for this year’s $100,000 Giller Prize has been whittled down to 12, but one name is notably absent from the list: Scotiabank. Cummings, Bachman reach settlement over the Guess Who name with former bandmates A long-running battle over the Guess Who name has come to an end. Business Some banks rethinking strategy on home mortgage competition Some Canadian banks say they're starting to question how aggressively they go after mortgage customers amid intense competition. Four natural disasters across Canada led to record number of insurance claims: bureau The Insurance Bureau of Canada says this summer saw a record number of insurance claims driven by four major weather events and natural disasters over the span of four weeks. Farmers caught in crossfire as China targets Canadian canola for investigation Prairie farmers are bracing for a financial hit in the wake of China saying it will launch an anti-dumping investigation into Canadian canola imports. Lifestyle OPINION OPINION | Opinion: I'm 36 — when do I have to give up crop tops? Having recently turned 36, CNN Style producer Jacqui Palumbo asks readers if she is too old to still be wearing a crop top. The US$10-million cocktail everyone is drinking at the U.S. Open At the U.S. Open currently underway in New York, a single cocktail will surpass US$10 million in sales before the tennis grand slam event ends Sept. 8. Swimmer known as the The Shark is trying again to cross Lake Michigan An ultra swimmer is trying again to cross Lake Michigan, from Michigan to Wisconsin, just a few weeks after trouble with a GPS device forced him to give up after 60 miles (96 kilometers). Sports Ballon d'Or: Lionel Messi is left off list of contenders for soccer's biggest individual prize Lionel Messi may be considered by many as the greatest soccer player of all time, but the Argentina star was omitted from the list of nominations to win this year's Ballon d'Or award — the sport's most prized individual honor. Clemens leads Phillies past Blue Jays 4-2; Schwarber hits fourth homer in two games Kody Clemens's two-run homer lifted the Philadelphia Phillies to a 4-2 win over the Toronto Blue Jays on Wednesday for a two-game sweep. 'You're crazy!': Sprinter fails to qualify for 100m final, but proposes to girlfriend in front of 40,000 people Paralympic sprinter Alessandro Ossola may have failed to qualify for the final of the T63 100 metres, but the Italian secured a 'yes' from his ecstatic girlfriend after proposing to her in the stands of the Stade de France after the race. Autos Volvo Cars revamps SUV hybrid as it shifts plans away from pure electric Volvo Cars said on Wednesday that plug-in hybrids would continue to be a critical part of its profit growth plans over the next few years and that it would revamp its XC90 hybrid sports utility vehicle. Ontario man told his EV needs $33K battery. Software update fixes the problem An Ontario man said he couldn't believe an electric car he bought three years ago for $20,000 would need a new battery at a cost of more than $33,000. U.S. reports 28th death caused by exploding Takata air bag inflators Another death has been linked to dangerous Takata air bag inflators by U.S. regulators, the 28th in the United States. Local Spotlight 'It's pretty unique to see them': Salamander migration in full swing in Manitoba Herds of salamanders are crossing the road in western Manitoba by the dozens. Bear cub from northern Ont. survives 10-hour drive to Windsor in back of van, being fed Taco Bell A black bear cub survived a 10-hour drive to Windsor while being fed Taco Bell after being found in the middle of a road near Cochrane, Ont. B.C. woman who sought $5K from neighbour over noise ordered to pay $50 for nuisance A British Columbia woman who unsuccessfully sued her downstairs neighbour last fall for making too much noise has now failed in a bid to sue her upstairs neighbour for being too loud. Windsor musician receives rare honour of taking the stage at Detroit Jazz Festival A trumpeter from Windsor is performing at the Detroit Jazz Festival this weekend — a rare honour for a musician from the Rose City. Humpback whale calf struck by BC Ferries vessel 'likely to survive,' research society says A humpback whale calf that was struck by a BC Ferries vessel off of northern Vancouver Island last Thursday is expected to recover, a local marine research society says. Meet the man living in the middle of a Kitchener, Ont. roundabout Drivers going by a Kitchener roundabout may have noticed something unusual – a tent set up on the centre island. This wilderness resort designed and built by the Timber Kings just hit the market in B.C. A family-owned B.C. wilderness resort designed and built by HGTV's Timber Kings – who said it was one of the \"coolest and most challenging\" projects they have undertaken – has hit the market for $21.5 million. 'I don't know what we're going to do': Historic Saskatchewan theatre floods, owners fear closure Alan Dougherty, co-owner of Estevan's Orpheum Theatre believes the historic theatre’s future is up in the air following recent flooding. 'Mini Thni': Alta. First Nations community reclaims traditional Stoney Nakoda name A First Nations community west of Calgary has officially reclaimed its traditional Stoney Nakoda name. The Stoney Nakoda Nations held an event on Thursday to officially rename Morley to Mînî Thnî. Vancouver 'Unprovoked' attacks in Vancouver leave man dead, another with severed hand A pair of stranger attacks in downtown Vancouver left one man dead and another with a severed hand on Wednesday morning. 'It's going to happen,' but not yet: Premier explains pause of Richmond supportive housing project A planned six-storey, 90-unit supportive housing complex at Cambie and Sexsmith roads in Richmond is no longer going forward. Unless it does. Which it definitely will, but maybe at a different site. 'Best of a worst-case scenario': Parents adjust to new normal in Surrey schools In B.C.'s fastest-growing city, back to school – for many students – means a return to portables or crowded classrooms. Toronto 'Terrifying': Suspect tries to drive over cruiser to escape after police surround stolen Bronco at Mississauga drive-thru A call about a suspicious vehicle ended with a Ford Bronco sitting atop a Peel police cruiser at a Tim Hortons drive-thru in Mississauga Tuesday. Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power. 2 Canadians face 36 charges following months-long human trafficking investigation A Brampton resident is one of the two people facing dozens of human trafficking charges following a 10-month-long investigation that started in eastern Ontario. Calgary LIVE @ 8 P.M. MT LIVE @ 8 P.M. MT | Calgary Flames host vigil to mourn Johnny and Matthew Gaudreau The Calgary Flames are preparing to mourn the loss of Johnny and Matthew Gaudreau at a vigil on Wednesday night. Calgary no longer able to afford Green Line project following provincial scope change: mayor The City of Calgary is no longer able to afford the cost of the CTrain Green Line project, following a “significant scope change” by the provincial government. Alberta ordered by Health Canada to destroy COVID-19 vaccines A spokesperson for Alberta Health says that as of Aug. 31, all old-strain COVID-19 vaccines are no longer available, but neither is the new formula. Ottawa 'She was kind, she was brilliant': Family, friends remember Ingleside, Ont. teen struck and killed while cycling Charlotte Light was supposed to start high school this week. Instead her family and friends are gathering to mourn the loss of the 14-year-old, remembered for her love of family, faith and a passion for soccer, theatre and dance. Ottawa Senators unveil new menu items and goodies at Canadian Tire Centre this season The timeline for a downtown arena for the Ottawa Senators remains uncertain so, for now, the club is taking steps to enhance the fan experience at the Canadian Tire Centre in Kanata, introducing several new features and foods for the upcoming season. Jackpot in Maniwaki, Que. radio station 'Catch the Ace' contest tops $3M In Maniwaki, Que., local radio station CHGA 97.3 has been playing their version of 'Catch the Ace' for nearly a year without a winner. There's only one card left in the deck, so on Thursday, the winning ticketholder is guaranteed to take home a huge cash prize. Montreal Whooping cough cases surging in Quebec: public health Cases of whooping cough are surging in Quebec, and the number of cases during the current outbreak is much higher than the few hundred seen in the average year. Student may need to repeat class due to controversial Quebec Education Ministry grading system The parents of Olivier Boulerice are calling the Quebec Education Ministry's grading system that may cause him to need to repeat a class. Urban farmers bring the Montreal melon back on old horse race track site With the exception of two huge U2 concerts on the site, the Hippodrome Blue Bonnets has been dormant since 2009, and while Montreal and Quebec plant to build the green space is being used to grow food, including the once thought lost Montreal melon. Edmonton Several businesses, public areas in Jasper National Park and townsite now open, slated to open soon Several Jasper businesses, trails and areas are now open or soon-to-be accessible. City councillor decries elimination of road safety 'tools' in wake of Alberta move to limit photo radar An Edmonton city councillor says the provincial government's decision to eliminate the use of photo radar on the bulk of roadways crews currently patrol will mean denying residents safer roads. Police release image of van suspected in St. Albert shooting Mounties have released a photo of the van believed to be involved in a shooting in St. Albert over the long weekend. Atlantic Halifax police find human remains near Long Lake Halifax Regional Police found human remains near Long Lake on Tuesday. Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power. Five things to know heading into the fall season for the Maritimes The Maritime provinces prepare to transition from summer to fall. Winnipeg Cyclist struck by car during Winnipeg protest A car struck a cyclist during a demonstration at Portage and Main Wednesday afternoon. 'It's pretty unique to see them': Salamander migration in full swing in Manitoba Herds of salamanders are crossing the road in western Manitoba by the dozens. Winnipeg guitarist searching for two prized instruments stolen from home A Winnipeg guitarist who's worked with artists like Corb Lund, Del Barber and Romi Mayes is asking for his two favourite guitars to be returned. Regina 'Frustrated': Riders return to practice following Labour Day Classic loss The Saskatchewan Roughrider’s 35-33 loss in the annual Labour Day Classic against the Winnipeg Blue Bombers marked the team’s sixth straight game without a win. Sask. RCMP arrest driver travelling at 'extremely high rates of speed' near resort community Saskatchewan RCMP say a 19-year-old is facing a lengthy list of charges after he was seen driving at 'extremely high rates of speed' between Kenosee Lake and Carlyle Saturday night. Saskatchewan's trade, agriculture ministers pen letter, calling for swift resolution of canola dispute with China Both Saskatchewan's trade and agriculture ministers have sent their concerns to Ottawa regarding an ongoing dispute involving Canadian canola shipped to China. Kitchener Abdullah Haredo sentenced for fatal 2019 shooting of Kitchener man A Kitchener man has been sentenced to eight years in prison for the fatal shooting of Irshad Sabriye. But he'll only spend two more years behind bars. 43 reported overdoses, two drug deaths over six-day period in Waterloo Region Another community alert has been issued in Waterloo Region after dangerous substances were found in the local drug supply. We also get the region's reaction to the CTS shutdown. Waterloo garage fire causes heavy smoke and $150K in damages No injuries were reported after a garage fire in Waterloo Wednesday morning. Saskatoon Saskatchewan judge orders Vern's Pizza location to stop using the name after franchise feud A judge has ordered the Vern's Pizza in Saskatoon’s Sutherland neighbourhood to stop using the Vern's name after finding its franchise agreement expired in 2016. 'Send your water': Sask. village loses hotel, Canada Post and town office in fire A small Saskatchewan village has lost several important landmarks following a fire earlier this week. 'Frustrated': Riders return to practice following Labour Day Classic loss The Saskatchewan Roughrider’s 35-33 loss in the annual Labour Day Classic against the Winnipeg Blue Bombers marked the team’s sixth straight game without a win. Northern Ontario So long, Superstack – Vale to dismantle Sudbury's famous landmark Vale is moving ahead with dismantling the Superstack in Greater Sudbury, the mining giant announced Wednesday. The Superstack, along with the less famous Copperstack, are being taken down at the Copper Cliff Smelter Complex. Jagmeet Singh pulls NDP out of deal with Trudeau Liberals, takes aim at Poilievre Conservatives NDP Leader Jagmeet Singh has pulled his party out of the supply-and-confidence agreement that had been helping keep Prime Minister Justin Trudeau's minority Liberals in power. Bear cub from northern Ont. survives 10-hour drive to Windsor in back of van, being fed Taco Bell A black bear cub survived a 10-hour drive to Windsor while being fed Taco Bell after being found in the middle of a road near Cochrane, Ont. London Increased police presence in Newbury following an investigation Currently there are no concerns for public safety, however the public is being advised to avoid the area of Broadway Street between Henry Street, James Street, and Emmot Street for the time being. Some signs of progress, but frustration still grows over former McCormick’s site There are signs of progress at the site of the former McCormick’s cookie factory in London’s Old East Village, but the condition of the historic building continues to be a concern for both the ward councillor and neighbours. Back to school for London kids as new provincial cellphone ban takes effect The new school year got underway for most London area students today – and this year new province-wide rules for cell phones will be impacting classrooms. Barrie City to dismantle homeless encampment at Barrie Park Roughly two dozen people living in Berczy Park in Barrie will have to vacate after the city issued an eviction notice. Dump truck driver with 19 beer cans charged after allegedly blowing 2.5x over limit A dump truck driver is facing charges for allegedly being behind the wheel intoxicated after police said he failed to stop for a stop sign in Oro-Medonte. Road extension in Barrie's south end to open ahead of schedule The opening of a much-anticipated new road in Barrie that is expected to relieve traffic congestion in the city's south end is ahead of schedule. Windsor Child drowns in Harrow swimming pool over Labour Day weekend Essex County OPP say that a child was located unresponsive in a swimming pool at an address on Huffman Road on Saturday. Windsor police welcome new paws to the squad The Windsor Police Service (WPS) has welcomed two new pups to the K9 Unit. Final phase of Wheatley gas investigation underway; ‘we're prepping for what's going to happen next’ \"There's something really special about the people that live in this town and there's something really special about going through hard times and how everybody comes together and supports each other.\" stated West Kent Councillor Lauren Anderson. Vancouver Island 'Unprovoked' attacks in Vancouver leave man dead, another with severed hand A pair of stranger attacks in downtown Vancouver left one man dead and another with a severed hand on Wednesday morning. Elephant seals used deep sea sonar equipment as 'dinner bell': B.C. researchers Scientists say new research shows how northern elephant seals used sonar from a deep sea research facility off the British Columbia coast like a \"dinner bell\" as they hunted for prey. Veteran BC United legislator Mike Bernier to run as independent in fall election Veteran British Columbia legislator Mike Bernier will run in the fall provincial election as an independent instead of joining several former BC United candidates in running under the B.C. Conservatives banner. Kelowna Have you seen Lulu? Kelowna RCMP searching for stolen puppy Mounties in Kelowna are appealing to the public for help reuniting a stolen puppy named Lulu with its owner. RCMP issue 'strong warning' against unsanctioned pre-grad parties in B.C.'s Okanagan Authorities are urging parents in B.C.'s Okanagan to speak with their teenagers about the dangers of attending \"unsanctioned\" pre-graduation parties. Commercial truck plunges off bridge in B.C. Interior, driver unaccounted for, RCMP say The driver of a semi truck and trailer that plunged off of a bridge in the B.C. Interior Saturday morning has not been located, according to police. Lethbridge Southern Alberta farmers caught in the middle of Canada, China dispute Southern Alberta farmers appear to be caught in the middle of a trade war, as the Canadian and Chinese governments face off on the international stage. Lethbridge post-secondary students return to class with more financial support options Students at the University of Lethbridge and Lethbridge Polytechnic were out in full force Wednesday as a new semester got underway. Alleged Lethbridge drug house shut down by Alberta sheriffs Alberta sheriffs have closed a problem property in Lethbridge, saying they were called to the home over alleged drug activity more than a dozen times since 2022. Sault Ste. Marie Sault addictions worker calls for emotional management education for young people The head of a Sault Ste. Marie recovery centre is calling for changes from both upper levels of government. Algoma OPP say impaired driver struck tree, beer cans were strewn around vehicle Ontario Provincial Police say they found beer cans strewn on the road after hearing reports that a pickup truck hit a tree in Hilton Beach on St. Joseph Island. $106K prize attracting international teams to Sault Ste. Marie, Ont., curling tournament It is only the second annual fall classic curling tournament in Sault Ste. Marie, but the number of teams and amount of the prize purse has grown exponentially. N.L. Dispute over unrecognized Inuit group halts major conference for Canadian North A 16-year-old biennial event aimed at fostering business in the country's eastern Arctic and northern regions has been cancelled indefinitely as a dispute unfolds between Inuit in Canada and a Labrador group claiming to share their heritage. Cow cuddling: Why a Newfoundland farm is offering quality time with these 'gentle creatures' Jim Lester’s farm hopped on the cow-cuddling trend in early August, and his time slots have been pretty well sold out ever since. Newly reinstated Newfoundland cod fishery temporarily paused as landings hit limit The federal government has temporarily paused parts of the newly reinstated commercial northern cod fishery off the east coast of Newfoundland as landings approach the seasonal limit. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks I'm Fairly Certain You’ll Never Leave Home Without This Portable Charger (And It's On Sale Right Now) If You Pack Your Lunches (Or Your Kids' Lunches), You Probably Need At Least A Few Of These Products Here Are All The Back-To-School Supplies An Elementary School Student Needs Home 22 Amazon Canada Products That Are Just Plain Helpful The 5 Best Pressure Cookers In Canada In 2024 19 Useful Amazon Canada Finds You Won't Regret Ordering Gifts 15 Of The Best Gifts To Give A One-Year-Old For Their First Birthday 20 Of The Best Gifts For People Who Travel A Lot 21 Brilliant Gifts For Those Impossible-To-Shop-For People On Your List Beauty If You're Looking For The Best Clarifying Shampoo, Here Are A Few That Reviewers Swear By Thousands of Reviewers Swear by This Product for Fresh, Stink-Free Breath 10 Of The Best Teeth-Whitening Products You Can Find Online Right Now Deals Beauty Week Has Officially Begun On Amazon Canada — Here Are The Best Deals You Can Find Here Are All The Best Labour Day Weekend Sales To Shop In Canada 22 Amazon Canada Deals And Discounts On Back-To-School Supplies Stay Connected","summary":"Former Republican Rep. Liz Cheney on Wednesday said she would support Kamala Harris for president, ending weeks of speculation about how fully the member of a GOP dynasty-turned-Trump critic would embrace the Democratic ticket.","url":"https://www.ctvnews.ca/world/republican-liz-cheney-crosses-party-lines-to-endorse-kamala-harris-1.7025672","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/9/4/liz-cheney-attends-capitol-hearing-1-7025681-1725491495675.jpg","video":null,"publish_date":"2024-09-04 23:14:00","author":"Nicholas Riccardi,The Associated Press","authors":["Nicholas Riccardi","The Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.058},{"id":255661488,"title":"Liz Cheney Spurns Her Party With Kamala Harris Endorsement","text":"Former Republican Congresswoman Liz Cheney has thrown her support behind Kamala Harris in the upcoming election. Cheney, who represented Wyoming, made the endorsement while speaking at Duke University on Wednesday. An X video posted by an attendee captured what she said. “It is crucially important for people to recognize, not only is what I said about the danger Trump poses something that should prevent people from voting for him, but I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she told the audience. “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this, and because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris,” she continued. The crowd burst into applause after her endorsement. While this is the first time the politician has given Harris her support, it isn’t the first time she’s spoken out about Donald Trump. In January, while speaking to Dartmouth students, Cheney warned the audience about what a Trump election could look like. “He won’t leave office,” Cheney told the audience. “He already tried not to leave office once. So I think there’s a lot of living in a fantasy world that’s going on with Republicans telling themselves, ‘Look, we’ll vote for him, it won’t be so bad.’ It may well be the last real vote you ever get to cast. It will be that bad.”","summary":"Anna Moneymaker/GettyFormer Republican Congresswoman Liz Cheney has thrown her support behind Kamala Harris in the upcoming election.\n\nCheney, who represented Wyoming, made the endorsement while speaking at Duke University on Wednesday. An X video posted by an attendee captured what she said.\n\n“It is crucially important for people to recognize, not only is what I said about the danger Trump poses something that should prevent people from voting for him, but I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she told the audience.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/liz-cheney-spurns-republican-party-with-kamala-harris-endorsement","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3245,w_5768,x_0,y_224/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1725489871/GettyImages-1853733964_raxbls","video":null,"publish_date":"2024-09-04 23:11:48","author":"Clay Walker","authors":["Clay Walker"],"language":"en","source_country":"US","sentiment":-0.263},{"id":255660722,"title":"Guidelines for 2024 Presidential Debate with Kamala Harris and Donald Trump Unveiled by ABC News in Philadelphia","text":"PHILADELPHIA — In less than one week, Vice President Kamala Harris and former President Donald Trump will be at the National Constitution Center in Philadelphia for their first debate. The 2024 presidential debate is set for September 10 and will be hosted by ABC News. On Wednesday, ABC News released rules for the highly anticipated event. Officials say Harris and Trump both accepted the guidelines. Debate Rules: The debate will last 90 minutes with two commercial breaks The two seated moderators, David Muir and Linsey Davis, will be the only people asking questions A coin flip was held virtually on September 3 to determine podium placements and order of closing arguments; Trump won the coin toss and chose to select the order of statements. He will offer the last closing statement, and Harris selected the right podium on screen (stage left) Candidates will be introduced by moderators Candidates will enter upon introduction from opposite sides of the stage; the incumbent party will be introduced first There will be no opening statements; closing statements will be two minutes per candidate Candidates will stand behind the podiums for the duration of the debate Props or prewritten notes are not allowed onstage No topics or questions will be shared in advance Candidates will be given a pen, a pad of paper, and a bottle of water Candidates will have two minutes to answer questions, two minutes for rebuttals, and one extra minute for follow-ups, clarifications, or responses Candidates’ microphones will be live only for the candidate whose turn it is to speak and muted when the time belongs to another candidate Candidates will not be permitted to ask questions of each other Campaign staff may not interact with candidates during commercial breaks Moderators will seek to enforce timing agreements and ensure a civilized discussion There will be no audience in the room As the debate approaches, Harris and Trump are making their paths to the presidency clearer as their campaigns begin a two-month sprint to Election Day. The candidates are largely focusing on swaying the undecided voters out there. Their campaigns will try to focus their messages on three familiar issues — the economy, immigration, and abortion — even in the midst of heated debates over character, culture, and democracy. ‘The ABC News Presidential Debate | Race for the White House’ will air September 10 at 9 p.m. It will air on ABC and stream on 24/7 streaming network ABC News Live, Disney+, and Hulu. The Associated Press Contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPHILADELPHIA &#8212; In less than one week, Vice President Kamala Harris and&#8230;\n\n\nThis Post: Guidelines for 2024 Presidential Debate with Kamala Harris and Donald Trump Unveiled by ABC News in Philadelphia first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/guidelines-for-2024-presidential-debate-with-kamala-harris-and-donald-trump-unveiled-by-abc-news-in-philadelphia/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-ABC-News-releases-rules-for-2024-presidential.jpg","video":null,"publish_date":"2024-09-04 23:09:26","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.048},{"id":255660580,"title":"Kamala Harris hits New Hampshire to unveil ‘ambitious’ small business plan","text":"NORTH HAMPTON, N.H. — Vice President Kamala Harris made a surprise campaign stop in New Hampshire to announce a new policy proposal on Wednesday, when she laid out an “ambitious” plan to get millions of small businesses started. Harris, who noted there are only 62 days until the November 5th general election, was in North Hampton at Throwback Brewery when she made the announcement. According to the vice president, her plan would open entrepreneurship to those currently excluded by the high cost of starting a new business. “Now, I’m setting what I think some are going to call a very ambitious goal. But, you know what? I think we should admire ambition in each other,” she said. “So I want to see 25 million new small businesses applications by the end of my first term.” Harris would accomplish this, she said, by lowering the cost of building a new enterprise. Right now, the vice president said, it costs about $40,000 to get the average small business off the ground, but that cost is only offset by a $5,000 tax deduction. “That is a great financial barrier for a lot of folks, and it can hold entrepreneurs back,” she said. “Not everyone has access to that kind of wealth.” Harris’ plan, she said, would increase that tax deduction tenfold. “We will expand the tax deduction for start ups to $50,000,” she said. “It’s essentially a tax cut for starting a small business.” Under a Harris-Walz administration, the government would also provide “low and no interest loans” to small businesses “that want to expand” and “cut the red tape that can make starting and growing a small business more difficult than it needs to be.” “We will make it cheaper and easier for small businesses to file their taxes, similar to how individuals can take a standard deduction,” she said. “Let’s just take away some of the bureaucracy.” According to Harris, the change would open opportunities to a new pool of American talent currently kept on the sidelines by their lack of wealth. “It’s not that they don’t have the skills, it’s not that they don’t have the work ethic, it’s access to these resources,” she said. Harris’ plan would require the support of Congress, which is responsible for adjusting the tax code. According to former President Donald Trump’s campaign, New Hampshire voters should not be fooled by Harris’ turn toward the small business community. “If Kamala wanted to help small businesses, why hasn’t she done it during her four years as vice president? Why has Kamala proudly supported Bidenomics, which has caused historic inflation and record-high energy costs for small businesses, minimizing their profit margins and threatening their livelihood?” Trump’s team said in a release.","summary":"Vice President Kamala Harris made a surprise campaign stop in New Hampshire to announce a new policy proposal on Wednesday, when she laid out an “ambitious\" plan to get millions of small businesses started.","url":"https://www.bostonherald.com/2024/09/04/kamala-harris-hits-new-hampshire-to-unveil-ambitious-small-business-plan/","image":"https://www.bostonherald.com/wp-content/uploads/2024/09/malanl010.jpg?w=1024","video":null,"publish_date":"2024-09-04 23:08:58","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","source_country":"US","sentiment":-0.354},{"id":255661420,"title":"Harris accepts rules for Sept. 10 debate with Trump on ABC, including microphone muting","text":"Vice President Kamala Harris has accepted the rules set forth for next week’s debate with former President Donald Trump, although the Democratic nominee says the decision not to keep both candidates’ microphones live throughout the matchup will be to her disadvantage. The development, which came Wednesday by way of a letter from Harris’ campaign to host network ABC News, seemed to mark a conclusion to the debate over microphone muting, which had for a time threatened to derail the Sept. 10 presidential debate at the National Constitution Center in Philadelphia. President Joe Biden’s campaign had made the muting of microphones, except for the candidate whose turn it is to speak, a condition of his decision to accept any debates this year. Some aides have said they now regret that decision, saying voters were shielded from hearing Trump’s outbursts during the June debate. A disastrous performance for the incumbent Democrat fueled his exit from the campaign. Once Harris rose in Biden’s stead and became their party’s pick for president, her campaign had advocated for live microphones for the whole debate, saying previously that the practice would “fully allow for substantive exchanges between the candidates.” But on Wednesday, in a letter obtained by The Associated Press, Harris’ advisers wrote that the former prosecutor will be “fundamentally disadvantaged by this format, which will serve to shield Donald Trump from direct exchanges with the Vice President.” “We suspect this is the primary reason for his campaign’s insistence on muted microphones,” her campaign added. Despite those concerns, Harris’ campaign wrote, “we understand that Donald Trump is a risk to skip the debate altogether, as he has threatened to do previously, if we do not accede to his preferred format.” So as not to “jeopardize the debate,” Harris’ campaign wrote, “we accepted the full set of rules proposed by ABC, including muted microphones.” According to an official with Harris’ campaign, a pool of journalists will be on hand to hear what the muted candidate may be trying to say when his or her microphone is turned off. That detail was not in the full debate rules, also released Wednesday by ABC, which are essentially the same as they were for the June debate between Trump and Biden. The network laid out parameters from the basic format — 90 minutes, with two commercial breaks — to specifications that moderators David Muir and Linsey Davis “will be the only people asking questions,” perhaps hoping to avert a free-for-all between the candidates. “Moderators will seek to enforce timing agreements and ensure a civilized discussion,” the network noted. The Harris campaign official, who spoke on the condition of anonymity to discuss planning around the debate, said a candidate who repeatedly interrupts will receive a warning from a moderator, and both candidates’ microphones may be unmuted if there is significant crosstalk so the audience can understand what’s happening. After a virtual coin flip held Tuesday and won by Trump, the GOP nominee opted to offer the final closing statement, while Harris chose the podium on the right side of viewers’ screens. There will be no audience, written notes or any topics or questions shared with campaigns or candidates in advance, the network said. ___ AP White House Correspondent Zeke Miller contributed to this report.","summary":"Vice President Kamala Harris has accepted the rules set forth for next week&#8217;s debate with former President Donald Trump, although the Democratic nominee says the decision not to keep both candidates&#8217; microphones live throughout the matchup will be to her disadvantage. The development, which came Wednesday by way of a letter from Harris&#8217; campaign to [&#8230;]","url":"https://toronto.citynews.ca/2024/09/04/harris-accepts-rules-for-sept-10-debate-with-trump-on-abc-including-microphone-muting/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/09/a8c2eb55327780ffab8bd56c193a62b4437e3e94b075177cd2e3e4b23c5a6f42.jpg","video":null,"publish_date":"2024-09-04 23:04:01","author":"Meg Kinnard,News Staff","authors":["Meg Kinnard","News Staff"],"language":"en","source_country":"ca","sentiment":-0.133},{"id":255660360,"title":"Biden set to block Nippon Steel's acquisition of U.S. Steel: reports","text":"U.S. President Joe Biden is set to block Nippon Steel Corp.'s plan to acquire United States Steel Corp. on national security grounds, media reports said Wednesday. The decision would be a rare rejection of a proposal from a major company in Japan, a key U.S. ally. Biden and Vice President Kamala Harris have both voiced opposition to the takeover plan without providing a detailed rationale, as votes from blue-collar workers have become critical for the U.S. presidential election in November. Citing people familiar with the matter, the Financial Times said the Committee on Foreign Investment in the United States told Nippon Steel recently that the planned acquisition posed national security concerns that could not be mitigated by the two producers. The Washington Post reported Biden is planning to announce that he will formally block the Japanese steelmaker's proposed buyout. Without confirming those reports, White House spokeswoman Karine Jean-Pierre said the committee's ongoing review of the case is \"incredibly independent\" and it \"hasn't transmitted a recommendation yet to the president and that's the next step in this process.\" She also told a press briefing that Biden and Harris are \"committed to ensuring steel is made in America.\" The committee, chaired by Treasury Secretary Janet Yellen, is in charge of examining certain foreign investment transactions in U.S. firms and determining whether they pose national security threats. Nippon Steel, the world's fourth-largest producer, and U.S. Steel, the 24th-largest, announced the $14.1 billion acquisition deal in December. U.S. Steel and its shareholders are in favor of the takeover, which would make it more competitive globally and create the world's third-largest steelmaker by volume. But the powerful United Steelworkers union -- which has endorsed Harris for president after Biden's withdrawal from the race against Republican nominee Donald Trump -- is strongly opposed to the deal, dragging the two private companies into political controversy. Harris, the Democratic Party's presidential nominee, said at a Labor Day campaign rally in Pittsburgh on Monday that U.S. Steel should remain domestically owned and operated. Her first reference to the planned acquisition since launching her presidential campaign was in sync with Biden, who has said multiple times this year that the company should remain in American hands. \"It is vital for our nation to maintain strong American steel companies,\" Harris told the crowd at the rally. \"I couldn't agree more with President Biden...and I will always have the back of America's steelworkers and all of America's workers.\" U.S. Steel, founded in 1901, and the labor union are both headquartered in Pittsburgh, Pennsylvania, a key battleground state in the Nov. 5 election. In response to Harris' remarks, Nippon Steel said it is confident that the envisaged acquisition will \"revitalize the American steel rust belt\" and \"benefit American workers, local communities and national security in a way no other alternative can.\" On Wednesday, the Japanese company made an additional announcement, saying that U.S. citizens will still make up the majority of board members and core senior management of U.S. Steel following the close of the pending acquisition. \"We want elected leaders and other key decision makers to recognize the benefits of the deal as well as the unavoidable consequences if the deal fails,\" a U.S. Steel statement released separately quoted its president and CEO, David Burritt, as saying. Without realizing the tie-up, it said, \"U.S. Steel will largely pivot away from its blast furnace facilities, putting thousands of good-paying union jobs at risk, negatively impacting numerous communities across the locations where its facilities exist, and depriving the American steel industry of an opportunity to better compete on the global stage.\" It added that losing the deal with the Japanese company would also raise serious doubts about the iconic company remaining headquartered in Pittsburgh. Related coverage","summary":"WASHINGTON - U.S. President Joe Biden is set to block Nippon Steel Corp.'s plan to acquire United States Steel Co...","url":"https://english.kyodonews.net/news/2024/09/7cf69dc4fb06-update1-biden-set-to-block-nippon-steels-acquisition-of-us-steel-reports.html","image":"https://img.kyodonews.net/english/public/images/posts/288833936702c684d5e99191ed0d92ab/cropped_image_l.jpg","video":null,"publish_date":"2024-09-04 23:03:06","author":null,"language":"en","catgory":"politics","source_country":"jp","sentiment":-0.08},{"id":255660686,"title":"Local Pennsylvania reporters were told by Harris campaign to 'not disrupt' Tim Walz event","text":"A local Pennsylvania journalist revealed how reporters were not allowed to ask Minnesota Gov. Tim Walz questions during a campaign event in Lancaster County Wednesday. The Democratic vice presidential candidate stopped by the Lancaster County Democratic Committee field office with his daughter that morning as part of ongoing campaign efforts in the state. While Walz spoke with volunteers at the office, WPMT FOX43 reporter Alyssa Kratz wrote in a Facebook post how the campaign would not let the press speak with him. \"Gov. Tim Walz speaking to people calling into Lancaster County Democratic Committee field office. His daughter Hope is with him. Spoke to supporters here for about 6 or 7 minutes. Walz is not taking questions from the media while here. We were also not allowed to put microphones up by Gov. Walz while he was speaking,\" Kratz wrote. VP NOMINEE TIM WALZ SITS FOR RARE INTERVIEW TO DISCUSS GUTTER MAINTENANCE WITH TIKTOKER She added, \"One reporter tried shouting a question and we were told to ‘not disrupt the program.’\" FOX43 later confirmed to Fox News Digital with further comments from Kratz that reporters were denied access to Walz. \"We asked as a group (the press) multiple times if Gov. Walz could speak by the podium and we could put our microphones on the podium and we were denied,\" Kratz told Fox News Digital. She continued, \"A reporter from the local NBC affiliate (WGAL) shouted out a question after Gov. Walz was finished speaking to volunteers and we were told by the campaign to not disturb the interactions between Gov. Walz and the volunteers.\" Fox News Digital reached out to the Harris campaign for a comment. HARRIS AND WALZ INTERVIEW EACH OTHER WHILE DODGING MEDIA, GET TRASHED ONLINE: ‘COMPLETELY SCRIPTED AND FAKE’ Both Walz and Vice President Kamala Harris have largely avoided the press since Harris’ presidential campaign began in July. After more than six weeks, Harris and Walz gave their first official interview in a pre-taped segment with CNN’s Dana Bash Thursday. Harris was widely criticized for the interview, with commentators questioning why the vice president couldn’t do her first major interview without Walz. She has also yet to give a formal press conference. CLICK HERE TO GET THE FOX NEWS APP","summary":"Local Pennsylvania reporters were told they were not allowed to put microphones near Minnesota Gov. Tim Walz while he was speaking to supporters Wednesday.","url":"https://www.foxnews.com/media/local-pennsylvania-reporters-were-told-harris-campaign-not-disrupt-tim-walz-event","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/403ad5f5-tim-walz.jpg?ve=1&tl=1","video":null,"publish_date":"2024-09-04 23:00:10","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"us","sentiment":-0.547},{"id":255660516,"title":"Letters: A good example | PBM probe | Steep cost | Not so smart","text":"Arenas sets a good example for leaders Re: “Supervisor chastises child welfare leaders” (Page A1, Aug. 29). Santa Clara County Supervisor Sylvia Arenas deserves an epic vote of gratitude for her takedown of the “leaders” of the county child welfare department. Her anger was justified and appropriate, given the tragic death of Baby Phoenix and the failure of the agency’s policies and procedures, which they tried to conceal. Arenas set an example for elected officials at all levels when she said, “I’m asking you to be accountable.” Residents are fed up with public meetings where disagreements are “wrapped in polite platitudes” instead of getting problems out in the open and demanding resolution. I hope more will follow her lead. Meanwhile, get those people — and any others who are not living up to their responsibilities — off the bus. Pat Marriott Los Altos Government should probe PBMs’ practices Re: “Middlemen squeezing independent pharmacies” (Page A1, Sept. 1). I am a retired pharmacist who practiced pharmacy from 1955 to 1998. I remember the pharmacy benefit managers that started in the 1960s. They negotiated with drug companies in such a manner as to increase their fees at the expense of the independent pharmacies. Because of their negotiating, I would be forced to fill prescriptions at a loss. For example, 100 Zantac cost me $100, and I was reimbursed only $93 if I filled it. Also, CVS Health was part of a PBM that steered customers to CVS Pharmacies. This was so wrong and counterproductive. I think that our government should investigate PBMs for their very bad practices against all of the independent pharmacies. Chet Campanella San Jose Freedom too steep a cost for equity Kamala Harris talks about “equity” and “freedom.” But, equity and freedom are mutually exclusive. You gain more of one at the expense of the other. To establish equity, the government would need to level things off. They would need to take something from one person and give it to another. Why should a person who works longer hours and sacrifices more than the average person be required to give up that which they sacrificed to build and earn? How is that “freedom”? Does the government have the right to compel people to share? The Harris campaign has adopted “joy” as its theme. But how can there be any joy if individual freedom is threatened and compromised? Less freedom can never bring joy. Pete Campbell San Jose Vance not as smart as supporters say A word frequently used to describe JD Vance is smart. But he is doing his best to put the lie to that notion. Perhaps his panic over childless elites ruining this country has muddied his thinking. If he’d just shut up about it, the childless elites, in their ignorance, would abstain themselves out of existence, while the procreation-minded right birthed themselves into electoral dominance. Eugene Ely San Jose","summary":"Mercury News Letters to the Editor for Aug. 5, 2024","url":"https://www.mercurynews.com/2024/09/04/letters-1855/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/SJM-L-SCCHEALTH-0822-1.jpg?w=1024","video":null,"publish_date":"2024-09-04 23:00:01","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.156},{"id":255661458,"title":"Trump campaign says it raised $130 million in August","text":"WASHINGTON >> Republican presidential candidate Donald Trump’s campaign and his party raised $130 million in August, ending that month with $295 million cash on hand, the campaign said in a statement today. The fundraising was slightly lower than the level in July, when the Trump campaign raised $138.7 million. That was the month in which the former president survived an assassination attempt. At the end of July, the Trump campaign had $327 million of cash on hand. The Democratic presidential campaign of U.S. Vice President Kamala Harris outraised the Trump campaign in July. The Democrats’ official August figures are yet to be released by the Harris campaign. Both sides are bombarding battleground states with television ads. The Harris campaign had said last month that the campaign and the Democratic Party’s main fundraising group had raised a combined $310 million in July. President Joe Biden ended his reelection bid on July 21 and endorsed Harris in the Nov. 5 election. Biden’s withdrawal from the race came amid questions about his age and health after a halting debate performance against Trump in late June. The ascension of Harris has re-energized a Democratic campaign that harbored doubts about Biden’s chances. Polls showed that Trump had built a lead over Biden, including in battleground states, but Harris’ entry has tightened the polls.","summary":"WASHINGTON >> Republican presidential candidate Donald Trump&#8217;s campaign and his party raised $130 million in August, ending that month with $295 million cash on hand, the campaign said in a statement today.","url":"https://www.staradvertiser.com/2024/09/04/breaking-news/trump-campaign-says-it-raised-130-million-in-august/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/09/web1_20240904_brk_tru01.jpg","video":null,"publish_date":"2024-09-04 23:00:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.613},{"id":255661508,"title":"Ex-Rep. Liz Cheney endorses Kamala Harris citing 'danger that Trump poses'","text":"Understand the importance of honest news ? So do we. The past year has been the most arduous of our lives. The Covid-19 pandemic continues to be catastrophic not only to our health - mental and physical - but also to the stability of millions of people. For all of us independent news organizations, it’s no exception. We’ve covered everything thrown at us this past year and will continue to do so with your support. We’ve always understood the importance of calling out corruption, regardless of political affiliation. We need your support in this difficult time. Every reader contribution, no matter the amount, makes a difference in allowing our newsroom to bring you the stories that matter, at a time when being informed is more important than ever. Invest with us. Make a one-time contribution to Alternet All Access , or click here to become a subscriber . Thank you. Click to donate by check .","summary":"New audio shows former Wyoming Rep. Liz Cheney endorsing Kamala Harris for president, citing the \"danger\" posed by former President Donald Trump and saying the country doesn't have the \"luxury\" to write in a third candidate.\n\nCheney, who is the daughter of former Republican Vice President Dick Cheney, made the endorsement at a Duke University public policy event, audio posted Wednesday evening on X.\n\n\"Because we are in North Carolina I think it is crucially important for people to recognize not only is what I just said about the danger that Trump poses, something that should prevent people from voting for him, but I don't believe that we have the luxury of writing in candidates names, particularly in swing states,\" Cheney told an auditorium. \"As a conservative and someone who believes and cares about the Constitution, I have thought deeply about this, and because of the danger that Donald Trump poses, not only am I not voting for Donald Trump but I will be voting for Kamala Harris.\"\n\nThe crowd erupted into ap","url":"https://www.alternet.org/iz-cheney-kamala-harris/","image":"https://www.alternet.org/media-library/image.png?id=53590478&width=1200&height=600&coordinates=0%2C104%2C0%2C105","video":null,"publish_date":"2024-09-04 22:58:39","author":"Daniel Hampton,Raw Story","authors":["Daniel Hampton","Raw Story"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.263},{"id":255661112,"title":"Jill Stein slams ‘attack dog’ AOC after ‘predatory’ comments: ‘Democrats are running scared’","text":"Ocasio-Cortez has become a staunch ally of Vice President Kamala Harris’s battle to win the presidency in November. She told her Instagram audience of over 8 million this week that Stein’s long-shot campaign against Harris was “not serious” and “not authentic.” The Green Party party’s candidate’s presidential race “reads as predatory,” Cortez claimed. Stein issued a scathing clapback to the congresswoman Tuesday. “Hey y’all, this is a little spicy but I had thoughts about @AOC calling me and the Green Party ‘not authentic’ and ‘predatory,” she wrote in a post to X that mocked Cortez’s “very authentic concern about growing green power.” Hey y’all, this is a little spicy but I had thoughts about @AOC calling me and the Green Party “not authentic” and “predatory.” pic.twitter.com/F1jniwO77X— Dr. Jill Stein🌻 (@DrJillStein) September 3, 2024 “Clearly, AOC is the attack dog du jour, and the Democrats are running scared, and they should be, because who wants to support a genocide? Who wants to vote for a genocide?” Stein questioned, referencing the war in Gaza. “If there’s anything that’s predatory here, it’s saying that your candidate is working tirelessly for a ceasefire when actually they are actively funding and arming genocide and actually refusing to even consider an arms embargo, which would bring the genocide to a screeching halt.” Stein made two failed runs for the presidency as a Green Party candidate in 2012 and 2016. She has positioned herself to the left of Harris throughout her 2024 presidential bid and said she will halt U.S. aid to Israel and seek an immediate ceasefire in Gaza should she win the election. Harris has attached herself to the Biden administration’s more centrist positions on the Middle Eastern conflict during her campaign and declared she supports Israel’s right to self-defense and wants to see an end to the “suffering” in Gaza. Harris has not used the word “genocide” to refer to Israel’s military campaign. The vice president’s rhetoric has alienated her from some members of her own party, such as Rep. Rashida Tlaib (D-MI), in addition to Stein. Pro-Palestinian protesters staged a walk-in during the Democratic National Convention in Chicago earlier this month. They sparked a firestorm after complaining that party leadership refused to allow a Palestinian-American speaker to address the high-profile event. Ocasio-Cortez spoke on the first night of the DNC and highlighted her position as a rising star within the party. “AOC, who’s supposed to be in the leadership of the Democratic Party — it’s amazing she doesn’t know about the anti-democratic tactics and strategies that the Democratic Party uses to crush and silence political opposition,” Stein complained Tuesday. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Democrats have attempted to block Stein from the presidential ballot in battleground states such as Wisconsin, where losing a small number of votes to a third-party candidate could cost Harris the election. “They’ve been hiring an army of lawyers to throw competitors like me off the ballot,” Stein grumbled. “How is that not fraud and election interference?”","summary":"Green Party presidential candidate Jill Stein blasted Rep. Alexandria Ocasio-Cortez (D-NY) after the New York Democrat criticized her third-party bid for the White House.  Ocasio-Cortez has become a staunch ally of Vice President Kamala Harris’s battle to win the presidency in November. She told her Instagram audience of over 8 million this week that Stein’s [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3143730/jill-stein-slams-attack-dog-aoc-predatory-comments-democrats-running-scared/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Stein.webp","video":null,"publish_date":"2024-09-04 22:58:26","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.38},{"id":255660670,"title":"Liz Cheney Says She Will Vote for Harris in Presidential Election","text":"Former Rep. Liz Cheney (R-Wyo.) is the latest high-profile Republican to endorse Vice President Kamala Harris‘ for president. The former congresswoman, a vocal critic of former president Donald Trump, announced her decision during an event at Duke University. “Because we are here in North Carolina, I think it is crucially important for people to recognize, not only is what I’ve just said about the danger that Trump poses something that should prevent people from voting for him, but I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” Cheney said in a video posted to social media on Wednesday. She continued that “as a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this, and because of the danger that Donald Trump poses, not only am I not voting for Donald Trump but I will be voting for Kamala Harris.” Cheney, who was a member of the House select committee that investigated the Jan. 6, 2021, attack on the U.S. Capitol, has previously warned that another Trump presidency could be the death knell for democracy. “He cannot be the next president because if he is, all of the things he attempted to do but was stopped from doing by responsible people around him — at the Department of Justice, at the White House counsel’s office — all of those things he will do. There will be no guardrails,” said former congresswoman during CNN’s State of the Union in 2023. On Tuesday, the late Sen. John McCain’s youngest son, Army 1st Lt. Jimmy McCain, announced that he had changed his voter registration to Democrat and would be voting for Harris. His endorsement of the vice president arrived after Trump received widespread backlash following reports that one of his campaign aides pushed a staffer at Arlington National Cemetery during a visit to the burial ground last week.","summary":"\"Not only am I not voting for Donald Trump, but I will be voting for Kamala Harris,\" said the former Wyoming congresswoman","url":"https://www.rollingstone.com/politics/politics-news/liz-cheney-endorses-kamala-harris-president-1235095280/","image":"https://www.rollingstone.com/wp-content/uploads/2024/09/liz-cheney-endorses-votes-harris.jpg","video":null,"publish_date":"2024-09-04 22:57:12","author":"Charisma Madarang","authors":["Charisma Madarang"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.389},{"id":255660366,"title":"US charges employees of Russia's state media network in crackdown on election influence efforts","text":"The criminal indictment charged the two RT employees, Konstantin Kalashnikov and Elena Afanasyeva, with conspiracy to violate US money laundering and foreign agent laws. Both are based in Russia and remain at large. The Tennessee company produced nearly 2,000 videos on topics like immigration and inflation that have been viewed 16 million times on YouTube since last November, according to the Justice Department. In one instance, Afanasyeva told the company to provide a video that blamed Ukraine and the United States for a terrorist attack on a Moscow music venue, the Justice Department said. The indictment does not name the Tennessee company or charge any of its executives with wrongdoing. However, it alleges that the company failed to disclose that it was funded by RT and its executives never registered with the Justice Department that they were acting as agents of a foreign government. The Justice Department has previously warned that Russia remains a threat in the election and appears to be favouring Republican Donald Trump over Democrat Kamala Harris. US intelligence assessments found that Moscow tried to help Trump in 2016 when he defeated Democrat Hillary Clinton, and in 2020 when he lost to Democrat Joe Biden. Moscow has denied the allegations. On social media, Trump repeated his accusation that the Justice Department is working to defeat him in the election. Justice Department officials say Russian President Vladimir Putin and his proxies have adopted increasingly sophisticated techniques, targeting specific groups of voters and those in battleground states, and are now using bot farms and artificial intelligence. The FBI last month searched the homes of two Americans with ties to Russian state media, including former United Nations weapons inspector Scott Ritter and Dimitri Simes, an adviser to Trump's 2016 campaign. The US government has also accused Iran of attempting to influence the upcoming election through cyber operations against both the Trump and Harris campaigns. The Trump campaign has said Iran was behind the leak of internal campaign documents to US media outlets.","summary":"","url":"https://www.channelnewsasia.com/world/us-charges-employees-russia-rt-network-crackdown-election-influence-efforts-4586301","image":"https://onecms-res.cloudinary.com/image/upload/s---FR7mjP9--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2024-09-04t194008z_5_lynxmpek830ob_rtroptp_3_usa-election-biden","video":null,"publish_date":"2024-09-04 22:54:15","author":null,"language":"en","catgory":"politics","source_country":"sg","sentiment":-0.406},{"id":255662532,"title":"ABC Sets Rules for Harris-Trump Debate: Muted Microphones, Strict Time Limits and No Audience","text":"ABC News released rules for the Sept. 10 debate between Kamala Harris and Donald Trump: They include muted microphones when the candidate isn’t speaking, strict time limits and no audience. Harris’ team was originally pushing to not have their mics muted. “We believe both candidates’ mics should be live throughout the full broadcast,” Brian Fallon, the Harris campaign’s senior adviser for communications, said in a statement on Aug. 26. He added that Trump’s handlers preferred the muting approach since, as he put it, they “don’t think their candidate can act presidential for 90 minutes on his own.” Jason Miller, senior adviser for Trump, told Politico at the time that the Vice President was “looking for a way to get out of any debate with President Trump.” Next week’s debate will be 90 minutes long with two commercial breaks and will be moderated by ABC News anchors David Muir and Linsey Davis. Other notable points include: • Trump won the virtual coin toss on Tuesday and chose to offer the last closing statement. Meanwhile, Harris selected the right podium position on screen (stage left). • Candidates will be introduced by the moderators and, as the incumbent party, Harris will be introduced first. • There will be opening statements and closing statements will be limited to two minutes per candidate. • The moderators will be the only people asking questions and candidates are not permitted to ask each other questions. • Candidates will stand behind podiums for the duration of the debate, ostensibly to avoid a “he’s right behind her” situation that occurred during the podium-free 2016 event with Trump and then-rival Hillary Clinton or the wandering that took place in a 2000 debate between George W. Bush and Al Gore. • Props or prewritten notes are not allowed onstage, but candidates will be given a pen, a pad of paper and a bottle of water. • No topics or questions will be shared in advance with campaigns or candidates. • Candidates will have two-minute answers to questions, two-minute rebuttals, and one extra minute for follow-ups, clarifications or responses. • Candidates’ microphones will be live only for the candidate whose turn it is to speak and muted when the time belongs to another candidate. • Campaign staff may not interact with candidates during commercial breaks. • Moderators will seek to enforce timing agreements and ensure a “civilized” discussion. • There will be no audience in the room. Trump initially refused to debate Harris when she replaced sitting President Joe Biden as the Democratic candidate, but later acquiesced. The debate will take place at the National Constitution Center in Philadelphia and air live on ABC on Tuesday, Sept. 10, at 9:00 p.m. EDT, and stream live on the 24/7 streaming network ABC News Live, Disney+ and Hulu, and will also be available for simulcast. Meanwhile, Vice Presidential candidates JD Vance and Tim Walz have agreed to debate on Oct. 1, which will be hosted by CBS.","summary":"\"Kamala Harris and Donald Trump – ABC News Presidential Debate\" airs live Tuesday\n\n\nThe post ABC Sets Rules for Harris-Trump Debate: Muted Microphones, Strict Time Limits and No Audience appeared first on TheWrap.","url":"https://www.thewrap.com/abc-sets-rules-for-harris-trump-debate-muted-microphones/","image":"https://www.thewrap.com/wp-content/uploads/2024/04/kamala-harris-donald-trump.jpg","video":null,"publish_date":"2024-09-04 22:52:58","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","source_country":"US","sentiment":-0.405},{"id":255660022,"title":"Liz Cheney Says She’ll Vote For Kamala Harris—Citing ‘Danger’ Posed By Trump","text":"Share to Facebook Share to Twitter Share to Linkedin Topline Former Rep. Liz Cheney, R-Wyo., said during a Duke University event Wednesday she will vote for Vice President Kamala Harris in the upcoming presidential election, doubling down on her public opposition of former President Donald Trump, which had yet to include an endorsement of one of his competitors. Cheney made the remarks during an event at Duke. (Photo by Anna Rose Layden/Getty Images) Getty Images Key Facts Cheney made the remarks during an event at Duke’s Page Auditorium and said she will be voting for Harris “because of the danger that Donald Trump poses.” Cheney said she “thought deeply” about her vote, noting her identity as a conservative and saying voters “do not have the luxury of writing in candidates' names, particularly in swing states.” This is a developing story. Check back for updates. Follow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IV Following Editorial Standards Print Reprints & Permissions","summary":"Cheney was the top Republican on the Jan. 6 committee and has openly opposed another term for the former president.","url":"https://www.forbes.com/sites/antoniopequenoiv/2024/09/04/liz-cheney-says-shell-vote-for-kamala-harris-citing-danger-posed-by-trump/","image":"https://imageio.forbes.com/specials-images/imageserve/66d8e3d1d1bc1e5ebd935a71/0x0.jpg?format=jpg&crop=1515,1010,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-09-04 22:49:40","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.331},{"id":255659770,"title":"Justice Ketanji Brown Jackson says Harris’ nomination for president ‘gives a lot of people hope’","text":"Supreme Court Justice Ketanji Brown Jackson said Wednesday that Kamala Harris becoming the first black and South Asian woman to lock down the Democratic nod for president gives people “hope.” Jackson, who became the first black female Supreme Court justice in 2022, explained that Harris’ ascension to vice president and now a White House candidate has made many Americans feel that there are more opportunities for minorities in the US. “I know a little bit about being a first,” Jackson said on ABC News’ “The View” Wednesday. “I think a lot of people were very happy about my appointment, in part, because they saw it as progress for the country.” “Whenever we see someone moving into a position where no one has ever been, it gives a lot of people hope.” Then-presidential candidate Joe Biden had promised during the 2020 campaign that he’d tap a black woman to serve on the Supreme Court. He also pledged to name a woman as his VP. Harris officially became the Democratic nominee for president during a virtual roll call last month and then formally accepted the candidacy during the party’s convention in Chicago. She is the first black and South Asian female vice president in US history. Supreme Court justices are generally expected to steer clear of politics, but Jackson kept her focus trained on Harris hitting the milestone as the Democratic nominee. “I’m a first, not because I’m the first person who could ever do this job, right? But because our times have changed. Our society has changed,” Jackson went on. The 53-year-old liberal justice has been on a media tour to promote her memoir “Lovely One,” which tells the story of her upbringing and how she ascended to the highest court in the land. During her media itinerary, Jackson has carefully navigated politically charged questions about the Supreme Court. “I am confident that the courts will faithfully uphold the law, because that is our duty,” she replied when asked if she had confidence in the Supreme Court’s ability to navigate potential 2024 election cases. Jackson also waded in on controversy surrounding whether or not the Supreme Court should have a stricter ethical code. Last year, the high court rolled out a non-binding ethics code, but critics have argued it should adopt something with more teeth to it. “The question is, [how] is that going to play out? We’re still pretty early in the process,” Jackson maintained. “I guess I think about all of this as democracy at work, public engagement, these ideas of reforms, are the kinds of things that have been around since the beginning of our Republic.” Last term, the Supreme Court’s most high profile case was its decision on former President Donald Trump’s request for absolute presidential immunity. Ultimately, the high court concluded that presidents enjoy “absolute” immunity for official acts, but left key questions unanswered about the division between official and personal acts. It also remanded the challenge against Trump’s 2020 election supervision indictment back to the lower courts. Jackson dissented in the immunity decision, which was handed down by the high court’s conservative majority. “The majority instead decided that, no, we’re going to essentially create a new system for presidents, former presidents that is such that they are not subject to the law under certain circumstances,” she said. “They are immune from even being asked about or prosecuted for certain criminal activity, and I just thought that seemed like it was inconsistent, at least, with my view of our constitutional norms.” The Supreme Court’s next term is slated to commence in October.","summary":"Supreme Court Justice Ketanji Brown Jackson claimed Wednesday that Vice President Kamala Harris becoming the first black and South Asian female to lock down the Democratic nod gives people \"hope.\"","url":"https://nypost.com/2024/09/04/us-news/justice-ketanji-brown-jackson-says-harris-nomination-gives-a-lot-of-people-hope/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/88945676-1.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/4XA1EP7Z-RyIcpnTz.mp4","publish_date":"2024-09-04 22:46:52","author":"Ryan King","authors":["Ryan King"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.089},{"id":255659704,"title":"Georgia HS Students Texted Parents Last Words As Shooter Colt Gray Killed 4","text":"Julie Sandoval described hearing five gunshots next to her. She hid in a corner with several other classmates until police burst through the door.\"I started shaking a lot and that's when I started crying as well. I was trying to text a lot of my friends but unfortunately, everything was down,\" Sandoval told CNN.She said she texted her parents to tell them she loves them. She was also worried about her sister, who is also a student at the school.Sandoval is one of the many students at Apalachee High School in Georgia sharing their harrowing experiences as a 14-year-old student opened fire in the building, killing two students and two teachers on Wednesday.The shooter Colt Gray is in police custody, where he has been interviewed by officials. He is expected to be charged with murder and tried as an adult.Lyela Sayarath, a student who was in Algebra class, was sitting right next to Gray when he asked to leave the classroom. He returned with a gun.\"I just remember the moment that it happened. He was at the door and they almost let him in,\" Sayarath told CNN.She said Gray was quiet and shy, typically only speaking in one-word responses.Laila Fohrman said she thought she \"was going to die.\"\"I prayed and I closed my eyes and tried to stay calm,\" Fohrman said.Janice Martinez initially thought someone was \"playing around\" in the hallways.\"When this happened, I entered the class and then we were there for like, second period. So it was like during the middle of it, and I heard screaming and everything,\" Martinez said.She said she realized something was wrong as the noise kept getting louder.\"I was like, 'No, no, guys.' Like, I told everybody to get down. Get down, because, like, you don't joke around with that,\" Martinez said.Timeline of Mass ShootingThe shooting was first reported at 9:30 a.m. The sheriff's office received an alert of reports of an active shooter at 10:20 a.m.Barrow County Sheriff Jud Smith said law enforcement and school officials are working on reuniting students with their parents.GBI director Chris Hosey said law enforcement was at the scene \"within minutes.\" Two school resource officers assigned to the high school responded as well.\"Law enforcement had a very, very swift response to this incident,\" Hosey said.Officers located the suspect \"immediately,\" Hosey said. The suspect then surrendered to law enforcement.\"Law enforcement had a very, very swift response to this incident,\" Hosey said.Smith called the shooting an \"evil thing\" and said the investigation is \"active and ever-developing.\"Gray was interviewed by investigators after being taken into custody, Smith said.Elected Officials Share Heartfelt MessagesPresident Joe Biden was briefed on the situation by Homeland Security Advisor, Liz Sherwood-Randall. He later released a statement on the incident.\"Jill and I are mourning the deaths of those whose lives were cut short due to more senseless gun violence and thinking of all of the survivors whose lives are forever changed,\" Biden said. \"What should have been a joyous back-to-school season in Winder, Georgia, has now turned into another horrific reminder of how gun violence continues to tear our communities apart. Students across the country are learning how to duck and cover instead of how to read and write. We cannot continue to accept this as normal.\"The administration said it is coordinating with federal, state and local officials.Before delivering her planned speech at a rally in Portsmouth, where the Democratic presidential nominee intended to outline her small business proposals, Kamala Harris took a moment to reflect on the shooting that left four dead and nine injured.\"It is just outrageous that every day in the United States of America, parents have to send their children to school worried about whether or not their child will come home alive,\" Harris said.She then recounted a personal experience from earlier this year, when she toured a school and spoke with students. Harris recalled asking how many of them had participated in active shooter drills. To her dismay, nearly every student raised their hand.\"They are sitting in a classroom where they should be fulfilling their God-given potential, yet some part of their big, beautiful minds is worried about a shooter breaking through the door,\" Harris said. \"It doesn't have to be this way.\"In a post on his Truth Social platform, former President Trump wrote, \"Our hearts are with the victims and loved ones of those affected by the tragic event in Winder, GA. These cherished children were taken from us far too soon by a sick and deranged monster.\"Do you have a story Newsweek should be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com","summary":"Students recalled texting their parents during the Apalachee High School shooting in Georgia as classmate Colt Gray killed four people on Wednesday.","url":"https://www.newsweek.com/students-text-parents-during-georgia-apalachee-school-shooting-1948970","image":"https://d.newsweek.com/en/full/2464647/school-shooting.jpg","video":null,"publish_date":"2024-09-04 22:45:19","author":"Jenna Sundel","authors":["Jenna Sundel"],"language":"en","source_country":"us","sentiment":-0.658},{"id":255659210,"title":"ABC News releases rules for presidential debate between Harris, Trump in Philadelphia","text":"PHILADELPHIA -- In less than one week, Vice President Kamala Harris and former President Donald Trump will be at the National Constitution Center in Philadelphia for their first debate. The 2024 presidential debate is set for September 10 and will be hosted by ABC News. On Wednesday, ABC News released rules for the highly anticipated event. Officials say Harris and Trump both accepted the guidelines. Debate Rules: The debate will last 90 minutes with two commercial breaks The two seated moderators, David Muir and Linsey Davis, will be the only people asking questions A coin flip was held virtually on September 3 to determine podium placements and order of closing arguments; Trump won the coin toss and chose to select the order of statements. He will offer the last closing statement, and Harris selected the right podium on screen (stage left) Candidates will be introduced by moderators Candidates will enter upon introduction from opposite sides of the stage; the incumbent party will be introduced first There will be no opening statements; closing statements will be two minutes per candidate Candidates will stand behind the podiums for the duration of the debate Props or prewritten notes are not allowed onstage No topics or questions will be shared in advance Candidates will be given a pen, a pad of paper, and a bottle of water Candidates will have two minutes to answer questions, two minutes for rebuttals, and one extra minute for follow-ups, clarifications, or responses Candidates' microphones will be live only for the candidate whose turn it is to speak and muted when the time belongs to another candidate Candidates will not be permitted to ask questions of each other Campaign staff may not interact with candidates during commercial breaks Moderators will seek to enforce timing agreements and ensure a civilized discussion There will be no audience in the room SEE ALSO | ABC News Presidential Debate to be held at the National Constitution Center in Philadelphia As the debate approaches, Harris and Trump are making their paths to the presidency clearer as their campaigns begin a two-month sprint to Election Day. The candidates are largely focusing on swaying the undecided voters out there. Their campaigns will try to focus their messages on three familiar issues -- the economy, immigration, and abortion -- even in the midst of heated debates over character, culture, and democracy. 'The ABC News Presidential Debate | Race for the White House' will air September 10 at 9 p.m. It will air on ABC and stream on 24/7 streaming network ABC News Live, Disney+, and Hulu. The Associated Press Contributed to this report.","summary":"The 2024 presidential debate is set for September 10 and will be hosted by ABC News.","url":"https://abc13.com/post/abc-news-releases-rules-2024-presidential-debate-between-kamala-harris-donald-trump-philadelphia/15268377/","image":"https://cdn.abcotvs.com/dip/images/15268344_090424-wpvi-abc-news-presidential-debate-promo-with-pics-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wpvi/090324-wpvi-ABC-debate-5pm-video-vid.mp4","publish_date":"2024-09-04 22:42:10","author":"WPVI","authors":["WPVI"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.04},{"id":255659218,"title":"ABC News releases rules for presidential debate between Harris, Trump in Philadelphia","text":"PHILADELPHIA -- In less than one week, Vice President Kamala Harris and former President Donald Trump will be at the National Constitution Center in Philadelphia for their first debate. The 2024 presidential debate is set for September 10 and will be hosted by ABC News. On Wednesday, ABC News released rules for the highly anticipated event. Officials say Harris and Trump both accepted the guidelines. Debate Rules: The debate will last 90 minutes with two commercial breaks The two seated moderators, David Muir and Linsey Davis, will be the only people asking questions A coin flip was held virtually on September 3 to determine podium placements and order of closing arguments; Trump won the coin toss and chose to select the order of statements. He will offer the last closing statement, and Harris selected the right podium on screen (stage left) Candidates will be introduced by moderators Candidates will enter upon introduction from opposite sides of the stage; the incumbent party will be introduced first There will be no opening statements; closing statements will be two minutes per candidate Candidates will stand behind the podiums for the duration of the debate Props or prewritten notes are not allowed onstage No topics or questions will be shared in advance Candidates will be given a pen, a pad of paper, and a bottle of water Candidates will have two minutes to answer questions, two minutes for rebuttals, and one extra minute for follow-ups, clarifications, or responses Candidates' microphones will be live only for the candidate whose turn it is to speak and muted when the time belongs to another candidate Candidates will not be permitted to ask questions of each other Campaign staff may not interact with candidates during commercial breaks Moderators will seek to enforce timing agreements and ensure a civilized discussion There will be no audience in the room SEE ALSO | ABC News Presidential Debate to be held at the National Constitution Center in Philadelphia As the debate approaches, Harris and Trump are making their paths to the presidency clearer as their campaigns begin a two-month sprint to Election Day. The candidates are largely focusing on swaying the undecided voters out there. Their campaigns will try to focus their messages on three familiar issues -- the economy, immigration, and abortion -- even in the midst of heated debates over character, culture, and democracy. 'The ABC News Presidential Debate | Race for the White House' will air September 10 at 9 p.m. It will air on ABC and stream on 24/7 streaming network ABC News Live, Disney+, and Hulu. The Associated Press Contributed to this report.","summary":"The 2024 presidential debate is set for September 10 and will be hosted by ABC News.","url":"https://abc7news.com/post/abc-news-releases-rules-2024-presidential-debate-between-kamala-harris-donald-trump-philadelphia/15268377/","image":"https://cdn.abcotvs.com/dip/images/15268344_090424-wpvi-abc-news-presidential-debate-promo-with-pics-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wpvi/090324-wpvi-ABC-debate-5pm-video-vid.mp4","publish_date":"2024-09-04 22:42:10","author":"WPVI","authors":["WPVI"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.04},{"id":255659406,"title":"Former GOP Rep. Liz Cheney says she'll vote for Democrat Kamala Harris for president","text":"Former Republican Rep. Liz Cheney on Wednesday said she would support Kamala Harris for president, ending weeks of speculation about how fully the member of a GOP dynasty-turned-Trump critic would embrace the Democratic ticket. Cheney, who co-chaired the House investigation into the Jan. 6, 2021, attack, became a fierce Trump critic and was ousted in her 2022 Republican primary in Wyoming as a result, made her announcement at an event at Duke University. In a video posted on the social media network X, she finished by talking about the “danger” she believed Trump still poses to the country. “I don’t believe that we have the luxury of writing in candidates’ names, particularly in swing states,” she said. “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this. Because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.” The daughter of former vice president Dick Cheney, Liz Cheney has been perhaps Trump's highest-profile Republican critic. She joins other Republicans like her former Jan. 6 committee member, former Rep. Adam Kinzinger and former Rep. Denver Riggleman, as backers of Harris. More than 200 alumni of the Bush administration and former Republican presidential campaigns of the late Sen. John McCain and Sen. Mitt Romney also announced their endorsement of Harris last week. Cheney was in House Republican leadership at the time of the Jan. 6 attack but broke with most of her caucus over Trump's responsibility. She lost her leadership post and was one of the few Republicans willing to serve on the Jan. 6 committee, which was appointed by Democrats who controlled the House at the time.","summary":"Former Republican Rep. Liz Cheney says she'll be voting for Democrat Kamala Harris for president","url":"https://www.independent.co.uk/news/liz-cheney-ap-dick-cheney-gop-washington-b2607277.html","image":"https://static.independent.co.uk/2024/09/04/23/Election_2024_Cheney_21024.jpg?width=1200","video":null,"publish_date":"2024-09-04 22:41:27","author":"Nicholas Riccardi","authors":["Nicholas Riccardi"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.382},{"id":255659418,"title":"Liz Cheney endorses Kamala Harris and warns of ‘danger’ Trump poses to Constitution","text":"Former Wyoming congressmember Liz Cheney endorsed Kamala Harris for president on Wednesday, breaking with her fellow conservatives who are supporting Donald Trump. Cheney, one of Trump’s most vocal Republican critics while she was in Congress, said during an event at Duke University on Wednesday that fellow conservatives don’t have “the luxury” of sitting out or writing in other candidates if they’re uneasy about Trump, especially in a swing state like the university’s home of North Carolina. “As a conservative, as someone who believes in and cares about the Constitution, I have thought deeply about this,” she told the crowd. “Because of the danger that Donald Trump poses, not only am I not voting for Donald Trump, but I will be voting for Kamala Harris.” The announcement was met with cheers from the audience. This is a breaking news story and will be updated with new information.","summary":"Cheney was one of Trump’s most prominent critics in Congress","url":"https://www.independent.co.uk/news/world/americas/us-politics/liz-cheney-harris-endorsement-trump-b2607273.html","image":"https://static.independent.co.uk/2024/02/18/19/GettyImages-1853733432.jpg?width=1200","video":null,"publish_date":"2024-09-04 22:39:36","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":0.072}]}