{"offset":0,"number":50,"available":613,"news":[{"id":297893546,"title":"In Reversal of Renaming, Base Is Again Fort Bragg","text":"FORT BRAGG, N.C. -- The sprawling Army base in North Carolina had long been named for Braxton Bragg, an incompetent Confederate general who owned enslaved people.\n\nThen in 2020, Congress moved to strip the base of its name, mandating a new one. The base was renamed Fort Liberty as part of the U.S. military's examination of its history with race. But Donald Trump and other conservatives raged against the changes, arguing that \"wokeness\" was softening the military and wiping away important elements of American tradition and heritage.\n\nTrump campaigned on a promise to restore the old name, and his pledge was brought to fruition Friday, but with a twist that seemed both a rewriting of history and an internet troll: Fort Liberty again became Fort Bragg, not in honor of the Confederate general but in memory of Pvt. Roland L. Bragg, a previously obscure infantryman who had served at Fort Bragg and fought in the Battle of the Bulge during World War II.\n\nThe official ceremony at the military base Friday cemented a political victory for Trump, who suffered a legislative defeat in 2020 when Congress pushed past his veto of a bill with a provision to rename nine Army bases that had honored treasonous Confederate generals who fought against the United States to preserve slavery and white supremacy.\n\nThose bases were renamed for candidates that \"embody the best of the United States Army,\" according to the naming commission that recommended the initial changes. They included decorated officers, enlisted troops who survived harrowing trials in battle, President Dwight D. Eisenhower and one civilian: Dr. Mary Edwards Walker, a Civil War surgeon and the only woman ever awarded a Medal of Honor.\n\nVeterans, politicians, Roland Bragg's relatives and current service members attended the renaming event, which featured a ceremonial unfurling of the new Fort Bragg colors.\n\nThe reversion of Fort Liberty to Fort Bragg is part of a larger effort by Trump -- through Defense Secretary Pete Hegseth -- to purge the military of top officers, diversity initiatives, transgender service members and other policies and personnel that he said had made the armed forces \"woke.\"\n\nArmy officials stressed during the official ceremony that their intention was to honor Roland Bragg, not the Confederate general. They hosted members of Bragg's extended family at the event, and spoke of his valor and courage while fighting the Nazis in Europe. They described one episode in which the soldier escaped capture and regrouped with his comrades by knocking out an enemy soldier and driving a German ambulance through enemy lines.\n\n\"Fort Bragg is named after Roland L. Bragg,\" Lt. Gen. Gregory Anderson, the mission commander at Fort Bragg, replied when asked about the base name's ties to the Confederacy.\n\n\"He's one of us,\" he added of Bragg. \"He's cut from the same, you know, cloth we are. That's what I think about.\"\n\nDiane Watts, Bragg's daughter, said she was unaware of Hegseth's order to change the name of the base to honor her father until a local reporter in Maine called her to ask about it. She had assumed it was a prank call.\n\nWhen a reporter asked whether she thought her father's name might be being used for political purposes, Watts replied: \"I don't think that's the case. I really don't. I think that they looked for a man of good character, and they found my dad.\"\n\nDaniel Driscoll, the Army secretary, attended the renaming ceremony but declined to answer questions.\n\nThe cost of renaming the Army bases named for Confederates was estimated at about $39 million, covering expenses like replacing the signage and removing old references to the bases' outdated names.\n\nCol. K. Mixon, the garrison commander for Fort Bragg, estimated that the costs to reverse the changes there would be less than $1 million. Businesses and street signs near Fort Bragg in nearby Fayetteville, North Carolina, still referred to Fort Liberty on Friday. The nearby Army Airborne & Special Operations Museum on Friday featured merchandise with the name of Fort Liberty as well as shirts with the words \"Bragg is back!\"\n\nThe original naming of the nine Army bases was part of a movement to glorify the Confederacy and advance the Lost Cause myth that the Civil War was fought over \"states' rights\" and not slavery.\n\nThese Confederate generals were at first pariahs after the Civil War. But by the height of the Jim Crow era, they were idolized by many Americans, especially in the South.\n\nIn 2020, amid racial justice protests in many American cities after the murder of George Floyd, an overwhelming majority of Congress pushed past Trump's veto of a military policy bill to strip the names of Army bases named for Confederates, starting the process to give the installations new names.\n\nIn 2023, Fort Bragg was officially renamed, along with eight other Army bases originally named for Confederates.\n\nBut Trump, who has repeatedly defended monuments honoring Confederates, had vowed during the 2024 campaign to revert the name of Fort Bragg to honor Braxton Bragg, the Confederate general, who was widely considered by his fellow Confederates and many historians to have been a poor commander.\n\nVice President JD Vance had also falsely claimed while campaigning near the base last year that Vice President Kamala Harris had directed the changing of the name of the base during the Biden administration, rather than a bipartisan, veto-proof majority of Congress in the final days of Trump's first term.\n\n\"It's Fort Bragg, and we're proud,\" Vance said in Raeford, North Carolina, in October.\n\nOn Monday, Hegseth said that Fort Moore -- renamed in 2023 for Lt. Gen. Harold G. Moore and his wife, Julia -- would again be called Fort Benning. The base was originally named for Henry L. Benning, a Confederate and white supremacist. Hegseth again selected an honoree who had the same name, saying that the base was being renamed to honor Cpl. Fred G. Benning, who served during World War I.\n\nThis article originally appeared in The New York Times.","summary":"FORT BRAGG, N.C. -- The sprawling Army base in North Carolina had long been named for Braxton Bragg, an incompetent Confederate general who owned enslaved people.","url":"https://www.berkshireeagle.com/nyt/in-reversal-of-renaming-base-is-again-fort-bragg/article_f2dd43b4-60e2-5c1c-ba67-60d2df4876b5.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 23:04:53","author":"Chris Cameron,North Adams Pride","authors":["Chris Cameron","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":0.113},{"id":297892484,"title":"Trump pledges to make America the ‘Bitcoin superpower’ at first crypto summit","text":"“Last year, I promised to make America the Bitcoin superpower of the world and crypto capital of the planet, and taking historic action to deliver on that promise,” Trump said.\n\nTRUMP THREATENS NEW SANCTIONS AND TARIFFS ON RUSSIA TO FORCE PEACE TALKS \n\nSeveral industry leaders, including Coinbase CEO Brian Armstrong and Chainlink co-founder Sergey Nazarov, attended the summit, which was led by White House artificial intelligence and crypto czar David Sacks.\n\nThe crypto industry enthusiastically embraced Trump’s 2024 campaign as Trump vowed to turn the United States into the crypto capital. Trump sought to appeal to young male voters through his embrace of crypto in his battle against former Vice President Kamala Harris, who failed to propel enough women voters to back her campaign.\n\nIn January, after male and young voters propelled him to victory, Trump launched a cryptocurrency meme coin known as $TRUMP, and first lady Melania Trump launched her own coin, $MELANIA.\n\nMore than 1 in 5 Americans somehow own crypto, according to the report “Global State of Crypto 2024.” The report said the U.S. had the biggest gender gap among the nations surveyed with only 28% of female cryptocurrency holders compared to 72% of male holders.\n\nAn October 2024 Pew Research Survey revealed that 42% of men ages 18 to 29 said they had invested in, traded, or used cryptocurrency, compared to 17% of women in the same age range. Among men ages 30 to 49, 36% of men had invested, traded, or used crypto, compared to 15% of women in this age group.\n\nDuring Friday’s gathering, Trump didn’t shy from politics. \n\nTrump attacked former President Joe Biden’s administration for selling off bitcoin and for its alleged “war on crypto.”\n\n“Unfortunately, in recent years, the U.S. government has foolishly sold tens of thousands of additional Bitcoin that were worth billions and billions of dollars had they not sold them,” Trump said. \n\n“They strong-armed banks into closing the accounts of crypto businesses and entrepreneurs, effectively blocking some money transfers to and from exchanges, and they weaponized government against the entire industry,” Trump said. “But I know that feeling also maybe better than you do. All of that will soon be over and we are ending Operation Chokepoint 2.0.”\n\nIn a light-hearted moment, Trump appeared to quell some fears the American public may have about crypto.\n\n“From this day on, America will follow the rule that every Bitcoin knows very well: never sell your Bitcoin. That’s a little phrase that they have,” Trump said. “I don’t know if that’s right or not. Who the hell knows?”\n\n“I also want to express my strong support for the efforts of lawmakers in Congress as they work on bills to provide regulatory certainty for dollar-backed stablecoins and the digital assets market,” he said. “I hope lawmakers will send that legislation to my desk before August recess if they can.”\n\nThe president elaborated that the Treasury and Commerce departments would explore new pathways to accumulate additional bitcoin holdings for the reserve, with the caveat that taxpayers would not foot the bill.\n\nSacks, the crypto czar, was among a handful of administration leaders at the summit, including Commerce Secretary Howard Lutnick, Treasury Secretary Scott Bessent, and Small Business Administration Administrator Kelly Loeffler, one of the only women at the event among a sea of men.\n\n“We’re going to position the United States as a leader among nations in the digital asset strategy. It’s important for the United States to recognize this fact and get ahead of the other nations in the digital age,” said Bessent. \n\n“This is truly a historic day. And as a crypto founder, I couldn’t be more proud to be part of your administration,” Loeffler added. “And under your administration, we are truly going to enter into the golden age. And I’ll just say, as the administrator of the SBA, small business is a tremendous network that crypto can be deployed against, and so the SBA is open to crypto.”\n\nBefore the summit, Sacks told reporters, “The objective of the summit today is taking feedback and advice from the industry. We promised to do that during the campaign.”","summary":"At the first-ever White House crypto summit, President Donald Trump reassured cryptocurrency industry leaders that his administration would work to help legitimize the burgeoning financial system after reluctance under the previous administration. The day before the summit, Trump signed an executive order establishing a Strategic Bitcoin Reserve and a U.S. Digital Asset Stockpile through the [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3341251/trump-make-america-bitcoin-superpower-first-crypto-summit/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/Trump-iran.webp","video":null,"publish_date":"2025-03-07 23:03:13","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","source_country":"US","sentiment":0.019},{"id":297887648,"title":"David Schwimmer Criticizes Hollywood Friends for Remaining Silent on Important Issues","text":"Friends icon David Schwimmer has slammed Hollywood stars refusing to speak out against antisemitism.\n\nSchwimmer, 58, who notably portrayed Ross Geller on the beloved sitcom – took to the stage at the Anti-Defamation League’s Never is Now conference in New York City on Tuesday to plead for his ‘heroes’ to publicly condemn racist abuse.\n\nThe actor noted that some of the stars he was referring to had ‘made’ their careers either by ‘leaning into their Jewish identity’ or playing Jewish people onscreen. \n\nThe speech also comes weeks after Schwimmer demanded that Elon Musk ban Kanye West from X following his latest anti-Semitic rants and labeling himself as ‘a Nazi.’ \n\nSchwimmer said: ‘Plenty of people I respect, even some of my heroes in entertainment, music and sports, have chosen to keep a low profile and sit this one out, including some whose careers have been made by leaning into their Jewish identity, and others who have won acclaim for playing Jews onscreen.\n\n‘Some of them are doing a lot behind the scenes, privately and in their own way, but so many have chosen not to say anything publicly at all. \n\n‘And if I can say something directly to them: I really wish you would.’\n\n‘I wish you would stand up. I wish you would speak out, because your voice would be so meaningful to your fans who love you, to your community members who need you, to folks who can use just a little solidarity right now.’\n\n‘No one’s asking you to solve the conflict of the Middle East. Just say that you stand with your Jewish friends, colleagues, and neighbors against hatred and what’s happening on our college campuses and in our schools and to Jewish-owned businesses is totally unacceptable.’\n\nGal Gadot also took to the stage to receive the Anti-Defamation League’s International Leadership Award.\n\nGadot, 39, repeatedly declared her pride being an eighth-generation Jewish Israeli during her 12-minute acceptance speech where she called for the release of the dozens of hostages still held in Gaza.\n\n‘With every hostage release we hear new testimonies of the horrors they’ve been through. Every minute for them is hell. Their lives are in danger and we need them home,’ Gal said to uproarious applause.\n\n‘None of us can ignore the explosion of Jew hatred around the world anymore. We have had enough of Jew hatred we will confront anti-Semitism. We will call it out, but but we will never let it, not only, defeat us but define us because our love is stronger than their hate.’\n\nHours later, Gadot wrote that this moment is about everyone ‘refusing to be silent in the face of anti-Semitism.’\n\n‘October 7 was a wake-up call, but it also reminded us of our resilience and unbreakable bond,’ the Israel Defense Forces veteran – who boasts 133.6M social media followers – wrote on Instagram.\n\n‘We must continue to educate, share our stories, and stand up against hate — because love will always be stronger.’\n\nOn Monday, Gadot shut down outrageous claims from a viral post alleging she pulled out of presenting the best documentary Oscar, which went to Palestinian director Yuval Abraham’s film No Other Land.\n\nThe Wonder Woman alum’s representative told DailyMail.com that the rumors were completely untrue as she was always supposed to present the Oscar for best visual effects on Sunday alongside her Snow White co-star Rachel Zegler.\n\nGal portrays the Evil Queen in Disney’s Snow White, which hits US/UK theaters March 21.\n\nLast month Schwimmer – who has been among the most outspoken Jewish celebrities \n\n took to social media to urge the Tesla CEO to ‘stop giving West a megaphone’ on the platform. \n\nThe actor – whose account on X is currently suspended – uploaded screenshots of the rapper’s recent unhinged rants on what is formerly known as Twitter. \n\n‘This is so 2022,’ he began in the caption. ‘We can’t stop a deranged bigot from spewing hate filled, ignorant bile… but we CAN stop giving him a megaphone, Mr. Musk.’\n\n‘Kanye West has 32.7 million followers on your platform, X. That’s twice as many people than the number of Jews in existence.’\n\nSchwimmer continued, ‘His sick hate speech results in REAL LIFE violence against Jews.’ \n\n‘I don’t know what’s worse, the fact that he identifies as a Nazi (which implies he wants to exterminate ALL marginalized communities including his own).’ \n\n‘Or the fact that there is not sufficient OUTRAGE to remove and ban him from all social media at this point. Silence is complicity,’ David concluded in his message to Elon. \n\nA day later West’s account was deactivated following his vile tirade – however it has since been reinstated.\n\nMusk began his acquisition of Twitter back in April 2022, which was then concluded that same year in October. \n\nThe SpaceX founder has been vocal about censorship and an advocate for free speech. \n\nSchwimmer’s account on X is currently ‘suspended’ although it is not exactly known when that took place. \n\nLast month West – also known as Ye – took to X where he labeled himself as a Nazi and also asked President Donald Trump to free Sean ‘Diddy’ Combs. \n\nThe music artist further sparked outrage when he mocked Cassie’s assault by Diddy – who is currently in prison while awaiting trial for sex trafficking charges. \n\nKanye has also since taken to the social media platform to say he has ‘dominion’ over his wife Bianca Censori and branded her controversial naked Grammys dress the ‘best look of all time.’ \n\nWest was first accused of anti-Semitism in 2022 after making a series of racist remarks. However, he later apologized, insisting it was not his ‘intention to hurt or demean’ the Jewish community.\n\nYet in a rambling U-turn, Kanye penned a series of tweets on X on Thursday, claiming that he will never ‘trust or work with Jewish people’ again and insisting he ‘will not apologize’ for his views. \n\nAmong his most shocking tweets in the hours-long tirade, Kanye proudly declared: ‘I AM A NAZI’, later adding: ‘I LOVE HITLER NOW WHAT B*****S.’ \n\nThe troubled rapper also addressed concerns that his wife Bianca Censori is a victim of coercive control after her naked outing at the Grammys, claiming he has ‘dominion’ over her.\n\nKanye, who took aim at several minority groups in his foul-mouthed tirade, went on to state that ‘IF I LOST EVERYTHING ‘AGAIN TONIGHT WAS WORTH IT I CAN DIE AFTER THIS’, while also insisting he was ‘sober’ while tweeting.\n\nHaving voiced his support for incarcerated rapper Diddy, Kanye doubled down by saying he would ‘never speak again’ to anyone who disagreed with him, while also using homophobic slurs to lash out at those who supported Kamala Harris.\n\nKanye also went on to lash out at the ‘woke’ decision to use female plus-size models in fashion shows. \n\nHe then unleashed a vile anti-Semitic diatribe after claiming hours earlier that the Jewish community control the narrative.\n\nRetracting his 2023 apology, he tweeted: ‘IM NEVER APOLOGIZING FOR MY JEWISH COMMENTS I CAN SAY WHATEVER THE F**K I WANNA SAY FOREVER WHERES MY F***ING APOLOGY FOR FREEZING MY ACCOUNTS SUCK MY D**K HOWS THAT FOR AN APOLOGY.’\n\nHe went to make unfounded claims that the Jewish community are responsible for aborting black children. \n\n‘BE CLEAR YOU JEWISH N****S DONT RUN ME NO MORE THIS IS A FREE COUNTRY AND THIS IS MY FREE OPINION YOU ABORT BLACK CHILDREN FOR STEM CELLS ABORTION IS MURDER AND ITS PUSHED ONTO THE BLACK AND LATINO COMMUNITIES.’\n\nCalling on anyone who works for him but disagrees with his views to ‘quit’, he went on to claim he wouldn’t work with any Jewish people again.\n\nInsisting he was sober while making these remarks, he tweeted: ‘AINT NOBODY RAMPED UP EITHER IM CALM AS ICE THIS HOW I REALLY FEEL HOW I REALLY FELT AND HOW I WILL ALWAYS FEEL F**K ALL OF YOUR F**K A** UNFAIR BUSINESS DEALS.’\n\n‘AMY JEWISH PERSON THAT DOES BUSINESS WITH ME NEEDS TO KNOW I DONT LIKE OR TRUST ANY JEWISH PERSON AMD THIS IS COMPLETELY SOBER WITH NO HENNESY [sic].’\n\nHours earlier, he began his rant by addressing incarcerated rapper Diddy who has been locked up at the notorious Metropolitan Detention Center since he was arrested last year on sex trafficking, racketeering and prostitution charges.\n\nDiddy has vehemently denied all of the allegations and charges against him. He has been denied bail multiple times.\n\nAnd in a seemingly unrelated tweet, he repeated the shocking claims he made in 2018, writing: ‘SLAVERY IS A CHOICE.’\n\nAppearing to go back to defending Diddy, he went on: ‘THEY TRYNA PROVE A POINT AND YALL KNOW THAT YALL F***ING KNOW THAT AND SITTING LAUGHING AT THE F***ING INTERNET ON INSTAGRAM THIS MAN GAVE HIS LIFE TO US THIS MY IDOL THIS MY HERO.’ \n\nThis week, West further sparked fury when he appeared to mock Cassie’s assault by disgraced rapper Diddy in a series of posts on X. \n\nAlongside a screenshot of security footage of Combs assaulting Cassie in a hotel, West wrote, ‘When I [sic] man truly loves a woman he may express it in rage I empathize with both sides.’\n\nUnderneath the same screenshot, he also typed, ‘You have to truly be in love to get to the point of risking everything.’ \n\nHe then added, ‘Hey question if someone were to beat up their girlfriend in public, would that be considered domestic violence, or is that outdoor violence, or is it just public indecency? ….Im just asking for a friend.’ \n\nIn one of his last nonsensical posts, Kanye claimed he had banned from Instagram again – at the time of posting his Instagram account was still active.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFriends icon David Schwimmer has slammed Hollywood stars refusing to speak out&#8230;\n\n\nThis Post: David Schwimmer Criticizes Hollywood Friends for Remaining Silent on Important Issues first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/david-schwimmer-criticizes-hollywood-friends-for-remaining-silent-on-important-issues/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Friends-legend-David-Schwimmer-turns-on-two.jpg","video":null,"publish_date":"2025-03-07 23:00:54","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.219},{"id":297884804,"title":"Kamala Harris Gives Update on Her Political Future: Report","text":"Former Vice President Kamala Harris is reportedly weighing a potential run for California governor against a possible third bid for the White House in 2028, according to a Politico report published Friday morning.Why It MattersHarris lost to President Donald Trump in the 2024 presidential election after rising to the top of the Democratic ticket following former President Joe Biden's last-minute withdrawal from the race in July.The political future of the former vice president and the Democratic Party itself, which lost both the presidency and the Senate last year, is currently unclear. Harris has not publicly announced her plans since moving back to her California home after the executive branch changed hands on January 20.What To KnowDuring a pre-Oscars party in Los Angeles last weekend, Harris said she was planning to make a decision on running in the 2026 California gubernatorial election by \"the end of the summer,\" according to a Politico report based on two anonymous \"people with knowledge of the conversation.\"Harris is also reportedly still \"mulling\" another run for president, although becoming California governor would \"almost certainly\" eliminate the possibility. Current California Governor Gavin Newsom, who many suspect is preparing to launch his own 2028 presidential bid, cannot run for reelection due to term limits.The former vice president would likely become the frontrunner if she decides to enter the race for California governor but might face stiffer competition if she again seeks the Democratic nomination for president, which she also attempted in the 2020 election before becoming Biden's running mate.This is a developing story and will be updated when more information becomes available.","summary":"The former vice president is reportedly weighing multiple options concerning potential future runs for office.","url":"https://www.newsweek.com/kamala-harris-gives-update-her-political-future-report-2041524","image":"https://d.newsweek.com/en/full/2602958/kamala-harris-updates-political-future-report.jpg","video":null,"publish_date":"2025-03-07 22:25:39","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"US","sentiment":-0.063},{"id":297886438,"title":"Trump did not win a majority of the 2024 vote, only a plurality. He has no mandate: Letter to the Editor","text":"In the March 7 commentary by Audrey Cielinski Kessler (“Are the purges, appointment of loyalists foundation for a coup?”), she writes that “the majority (albeit a small one) of the voters said they wanted” Donald Trump. However, Trump did not receive a majority of the presidential vote. According to official results from the Federal Election Commission, a majority did not vote for him. \n\nTrump won 77,302,580 votes, or 49.8% of the total, per the official tally. Democrat Kamala Harris, other candidates, write-ins and “none” took the other 50.2%, or 77,935,722 votes -- more than half a million more votes than Trump. \n\nTrump does not have a mandate. I stand with U.S. Rep. Al Green.\n\nMichelle Mulanax,\n\nSagamore Hills","summary":"Donald Trump does not have a mandate. I stand with U.S. Rep. Al Green, writes Michelle Mulanax of Sagamore Hills in a letter to the editor.","url":"https://www.cleveland.com/letters/2025/03/trump-did-not-win-a-majority-of-the-2024-vote-only-a-plurality-he-has-no-mandate.html","image":"https://www.cleveland.com/resizer/v2/DQEAIVFZRRAW5AJQWFE246B4I4.jpg?auth=6589b32195e8e9f682f86742b6417f2a8ad61e70f1a753e7207817872173cf79&width=1280&quality=90","video":null,"publish_date":"2025-03-07 21:42:09","author":"Other Voices","authors":["Other Voices"],"language":"en","category":"politics","source_country":"US","sentiment":-0.586},{"id":297878884,"title":"Fox News Politics Newsletter: 'Final Moments' With Iran","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -New report reveals illegal immigrant population hit new high during Biden-era crisis -House education chair backs Trump move to abolish federal agency -Kamala Harris reveals timetable for making major political decision in deep Blue state Something's going to happen President Donald Trump signaled that a nuclear deal with Iran could emerge in the near future, just over a month after his administration reinstated a \"maximum pressure\" campaign against Tehran. Trump on Friday told reporters that the U.S. is \"down to the final moments\" negotiating with Iran, and that he hoped military intervention would prove unnecessary. \"It’s an interesting time in the history of the world. But we have a situation with Iran that something is going to happen very soon, very, very soon,\" Trump told reporters in the Oval Office. \"You’ll be talking about that pretty soon, I guess. Hopefully, we can have a peace deal. I’m not speaking out of strength or weakness, I’m just saying I’d rather see a peace deal than the other. But the other will solve the problem.\"…Read more White House STEELE THE SHOW: Trump cuts off federal resources for law firm that helped fuel 2016 Russia hoax COULD FOREIGN AID FREEZE SEE A THAW?: U.S. judge orders Trump admin to pay portion of $2B in foreign aid by Monday GRANTS CUT: Trump cuts more than $400 million in grants to Columbia over antisemitism concerns, more to potentially come World Stage 'BEFORE IT'S TOO LATE': Trump threatens sanctions on Russia, demands peace after major hits in Ukraine 'MOST INTERESTED': Zelenskyy confirms Ukraine will attend U.S. peace talks in Saudi Arabia, 1 week after Oval Office clash MONEY TROUBLES?: UN prepping for spending cuts as DOGE roots out waste in US, internal docs show HEALTH BATTLE: Pope Francis still getting oxygen therapy, will not read Sunday prayers Capitol Hill 'MADE US LOOK HEARTLESS': Rep. Ro Khanna describes interaction with flight attendant following Trump speech THIS LAND IS OUR LAND: Congress exposes China's potential loophole for Trump tariffs: 'Drawing a line in the sand' Across America 'INVESTIGATE AND ENFORCE': HHS expands Title IX probe in Maine to include state association governing athletics, embattled high school BRAGG IS BACK: Fort Bragg is back: Army renames N.C. base to honor World War II hero 'JUST THE BEGINNING': Trump Organization, Eric Trump sue Capital One for 'unjustifiable' 2021 debanking based on 'woke' beliefs BREAKING NEWS: Bryan Kohberger case: Idaho court releases surviving housemates' text messages from night of student murders 'FALSE AND MISLEADING': Noem team demands end to 'fake news' reports she spent $650K as governor on credit card — it was $2K WASTING MONEY: DOGE says government paying for 11,020 Adobe Acrobat licenses with zero users, plus more 'idle' accounts 'ABSOLUTELY FACTUAL': Stranded astronaut says he believes Musk’s claims Biden refused to conduct rescue mission COME NORTH: Top Dem governor issues order aiming to help fill ‘critical’ state jobs as DOGE cuts federal bureaucracy 'DEEPLY UNFAIR': Newsom calls biological men in women's sports 'deeply unfair' in podcast with conservative activist Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics conten","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-final-moments-iran","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/khamenei-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 21:36:50","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.323},{"id":297879262,"title":"You can stream the first episode of Pixar's Win or Lose on YouTube","text":"You can stream the first episode of Win or Lose, Pixar's first original TV series, for free on YouTube. It follows a co-ed middle school softball team (the Pickles), with each episode focusing on a different character's perspective — including animated personifications of their insecurities and defense mechanisms.\n\nThe first episode hones in on the \"coach's kid,\" Laurie, the Pickles' right fielder. She's rubbish at softball, thanks in no small part to her insecurities, illustrated as a sentient perspiration blob (the aptly named Sweaty).\n\nIf Win or Lose floats your boat, you'll need to hop over to Disney+ — subscription in tow — to watch the remaining seven episodes (the last two of which premiere on March 12). Should you go that route, you can currently save some money on the ad-supported tier of a Disney+ and Hulu bundle.\n\nPre-release controversy\n\nWin or Lose stood at the center of a controversy months before its February 19 debut. The show was initially slated to include an openly transgender character, Kai. While the part, played by trans actress Chanel Stewart, is still included in the series, Disney cut several lines of dialog referencing her gender identity.\n\nA pair of overshadowing circumstances compounded the online backlash over the decision: The news came on the heels of Donald Trump's election victory, and the show has an openly Christian character (Laurie) who prays aloud to \"Heavenly Father\" before heading to the plate. The combination led many to assume the moves were an appeasement to the president-elect, right as business leaders were routinely seen visiting Mar-a-Lago and currying favor by cutting DEI programs and trans-inclusive features.\n\nHowever, Disney framed its decision as being about parental freedom regarding LGBTQ+ storylines. \"When it comes to animated content for a younger audience, we recognize that many parents would prefer to discuss certain subjects with their children on their own terms and timeline,\" a company spokesperson told The Hollywood Reporter in December. An off-record source \"close to\" the project told the publication that the studio chose to cut the lines several months before, which (if true) would have placed it at a point when political forecasters saw the election's outcome as either a coin flip or slightly favoring former Vice President Kamala Harris.\n\nRegardless, you can check out the first episode below if it sounds like your cup of tea.","summary":"You can stream the first episode of Win or Lose, Pixar's first original TV series, for free on YouTube. It follows a co-ed middle school softball team (the Pickles), with each episode focusing on a different character's perspective — including animated personifications of their insecurities and defense mechanisms.\n\n\nThe first episode hones in on the \"coach's kid,\" Laurie, the Pickles' right fielder. She's rubbish at softball, thanks in no small part to her insecurities, illustrated as a sentient perspiration blob (the aptly named Sweaty).\n\n\nIf Win or Lose floats your boat, you'll need to hop over to Disney+ — subscription in tow — to watch the remaining seven episodes (the last two of which premiere on March 12). Should you go that route, you can currently save some money on the ad-supported tier of a Disney+ and Hulu bundle.\n\n\nPre-release controversy\nDisney+\nWin or Lose stood at the center of a controversy months before its February 19 debut. The show was initially slated to include an openly transgender cha","url":"https://www.engadget.com/entertainment/streaming/you-can-stream-the-first-episode-of-pixars-win-or-lose-on-youtube-211938945.html?src=rss","image":"https://s.yimg.com/ny/api/res/1.2/8dd6xAj1HZUe6NfbgEovRA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MjA-/https://s.yimg.com/os/creatr-uploaded-images/2025-03/5d8f18e0-fb96-11ef-9ffe-bcc9dba7e321","video":null,"publish_date":"2025-03-07 21:19:38","author":"Will Shanklin","authors":["Will Shanklin"],"language":"en","source_country":"US","sentiment":0.25},{"id":297868914,"title":"Stephen A. Smith's agent gives major update on ESPN star's presidential bid","text":"Stephen A. Smith's agent gives major update on ESPN star's presidential bid \n\nREAD MORE: Stephen A. Smith breaks silence on exchange with LeBron James \n\nBy LEOCCIANO CALLAO\n\nPublished: 21:04 GMT, 7 March 2025 | Updated: 21:04 GMT, 7 March 2025\n\nStephen A. Smith will not run for US President despite rumors linking the First Take host to the 2028 presidential elections.\n\nThe ESPN personality has been teasing the idea of sitting in the Oval Office in recent weeks after slamming the Democratic party's poor performance in 2024.\n\nAlthough the claims and rumors have been delivered in a playful tone, Smith's agent Mark Shapiro wants the conversations to die down.\n\nIn a panel appearance at the Sloan Sports Analytics Conference in Boston on Friday, the Endeavor president ruled out Smith's bid for 2028.\n\n'He will not run for president,' Shapiro said. 'He's going to continue to entertain those conversations, but he will not run for president.'\n\nThe rumors sprung after Smith hammered former Vice President Kamala Harris and her losing campaign over the fall and winter. In January, the unapologetic analyst showed the results from a poll asking voters who they would want to be the Democratic nominee in the next elections.\n\nStephen A. Smith's agent confirmed that the ESPN star will not be running for US President \n\nSmith's agent and Endeavor chief Mark Shapiro addressed the rumors on Friday morning \n\nDave Portnoy lashes out at 'sensitive baby' LeBron James as in rant on Stephen A. Smith and Bronny\n\nSince then, Smith teased a run while trolling the Democratic party on his television appearances. He noted that it is an embarrassment to the US political system that a sports debate host is considered a legitimate candidate.\n\nHowever, Smith has not completely dismissed the possibility of running, stating that he would consider it if he is still a top option by the 2027 primaries.\n\nOn Thursday, Smith inked a five-year extension worth $100m to remain with ESPN. The network officially announced the deal on Friday after nearly a year of negotiations.\n\nAs part of his new deal, Smith will be granted continued leeway to discuss politics on The Stephen A. Smith Show and as a guest on other platforms.\n\nShapiro said, 'He'll appear across ESPN's programming year-round, specifically the NBA and hopefully more of the NFL, but this deal will also allow him the opportunity to continue to fan out, if you will, across politics and news.'\n\nSteve SmithKamala Harris\n\nShare or comment on this article:\nStephen A. Smith's agent gives major update on ESPN star's presidential bid\n\nAdd comment","summary":"The ESPN personality has been teasing the idea of sitting in the Oval Office in recent weeks after slamming the Democratic party's poor performance in 2024.","url":"https://www.dailymail.co.uk/sport/othersports/article-14474817/stephen-smith-president-espn-agent.html","image":"https://i.dailymail.co.uk/1s/2025/03/07/21/95966543-0-image-m-129_1741381445530.jpg","video":null,"publish_date":"2025-03-07 21:04:36","author":"Editor,Leocciano Callao","authors":["Editor","Leocciano Callao"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.063},{"id":297867938,"title":"Jacksonville man taken into custody for making threats towards Vice President Kamala Harris, Rep. Ilhan Omar, and Secret Service agents, according to police sources","text":"The agent told Jarrell that free speech didn’t apply to “terroristic threats” toward a former vice president. The report states Jarrell became more “verbally aggressive” and threatened to kick the agent’s teeth in. Jarrell told the agent he had a house full of weapons and the agent “would never leave the property” if he showed up. Then, Jarrell hung up.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe arrest report states the man left 19 voicemails on the Secret&#8230;\n\n\nThis Post: Jacksonville man taken into custody for making threats towards Vice President Kamala Harris, Rep. Ilhan Omar, and Secret Service agents, according to police sources first appeared on Internewscast Journal","url":"https://internewscast.com/news/jacksonville-man-taken-into-custody-for-making-threats-towards-vice-president-kamala-harris-rep-ilhan-omar-and-secret-service-agents-according-to-police-sources/","image":"https://media.tegna-media.com/assets/WTLV/images/fd16050b-aae5-4245-8328-7ab668950d1d/20250307T181409/fd16050b-aae5-4245-8328-7ab668950d1d_750x422.jpg","video":null,"publish_date":"2025-03-07 20:47:46","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.152},{"id":297874976,"title":"Fort Liberty Renamed Fort Bragg, Fulfilling a Trump Campaign Promise","text":"FORT BRAGG, N.C. -- The sprawling Army base in North Carolina had long been named for Braxton Bragg, an incompetent Confederate general who owned enslaved people.\n\nThen in 2020, Congress moved to strip the base of its name, mandating a new one. The base was renamed Fort Liberty as part of the U.S. military's examination of its history with race. But Donald Trump and other conservatives raged against the changes, arguing that \"wokeness\" was softening the military and wiping away important elements of American tradition and heritage.\n\nTrump campaigned on a promise to restore the old name, and his pledge was brought to fruition Friday, but with a twist that seemed both a rewriting of history and an internet troll: Fort Liberty again became Fort Bragg, not in honor of the Confederate general but in memory of Pvt. Roland L. Bragg, a previously obscure infantryman who had served at Fort Bragg and fought in the Battle of the Bulge during World War II.\n\nThe official ceremony at the military base Friday cemented a political victory for Trump, who suffered a legislative defeat in 2020 when Congress pushed past his veto of a bill with a provision to rename nine Army bases that had honored treasonous Confederate generals who fought against the United States to preserve slavery and white supremacy.\n\nThose bases were renamed for candidates that \"embody the best of the United States Army,\" according to the naming commission that recommended the initial changes. They included decorated officers, enlisted troops who survived harrowing trials in battle, President Dwight D. Eisenhower and one civilian: Dr. Mary Edwards Walker, a Civil War surgeon and the only woman ever awarded a Medal of Honor.\n\nVeterans, politicians, Roland Bragg's relatives and current service members attended the renaming event, which featured a ceremonial unfurling of the new Fort Bragg colors.\n\nThe reversion of Fort Liberty to Fort Bragg is part of a larger effort by Trump -- through Defense Secretary Pete Hegseth -- to purge the military of top officers, diversity initiatives, transgender service members and other policies and personnel that he said had made the armed forces \"woke.\"\n\nArmy officials stressed during the official ceremony that their intention was to honor Roland Bragg, not the Confederate general. They hosted members of Bragg's extended family at the event, and spoke of his valor and courage while fighting the Nazis in Europe. They described one episode in which the soldier escaped capture and regrouped with his comrades by knocking out an enemy soldier and driving a German ambulance through enemy lines.\n\n\"Fort Bragg is named after Roland L. Bragg,\" Lt. Gen. Gregory Anderson, the mission commander at Fort Bragg, replied when asked about the base name's ties to the Confederacy.\n\n\"He's one of us,\" he added of Bragg. \"He's cut from the same, you know, cloth we are. That's what I think about.\"\n\nDiane Watts, Bragg's daughter, said she was unaware of Hegseth's order to change the name of the base to honor her father until a local reporter in Maine called her to ask about it. She had assumed it was a prank call.\n\nWhen a reporter asked whether she thought her father's name might be being used for political purposes, Watts replied: \"I don't think that's the case. I really don't. I think that they looked for a man of good character, and they found my dad.\"\n\nDaniel Driscoll, the Army secretary, attended the renaming ceremony but declined to answer questions.\n\nThe cost of renaming the Army bases named for Confederates was estimated at about $39 million, covering expenses like replacing the signage and removing old references to the bases' outdated names.\n\nCol. K. Mixon, the garrison commander for Fort Bragg, estimated that the costs to reverse the changes there would be less than $1 million. Businesses and street signs near Fort Bragg in nearby Fayetteville, North Carolina, still referred to Fort Liberty on Friday. The nearby Army Airborne & Special Operations Museum on Friday featured merchandise with the name of Fort Liberty as well as shirts with the words \"Bragg is back!\"\n\nThe original naming of the nine Army bases was part of a movement to glorify the Confederacy and advance the Lost Cause myth that the Civil War was fought over \"states' rights\" and not slavery.\n\nThese Confederate generals were at first pariahs after the Civil War. But by the height of the Jim Crow era, they were idolized by many Americans, especially in the South.\n\nIn 2020, amid racial justice protests in many American cities after the murder of George Floyd, an overwhelming majority of Congress pushed past Trump's veto of a military policy bill to strip the names of Army bases named for Confederates, starting the process to give the installations new names.\n\nIn 2023, Fort Bragg was officially renamed, along with eight other Army bases originally named for Confederates.\n\nBut Trump, who has repeatedly defended monuments honoring Confederates, had vowed during the 2024 campaign to revert the name of Fort Bragg to honor Braxton Bragg, the Confederate general, who was widely considered by his fellow Confederates and many historians to have been a poor commander.\n\nVice President JD Vance had also falsely claimed while campaigning near the base last year that Vice President Kamala Harris had directed the changing of the name of the base during the Biden administration, rather than a bipartisan, veto-proof majority of Congress in the final days of Trump's first term.\n\n\"It's Fort Bragg, and we're proud,\" Vance said in Raeford, North Carolina, in October.\n\nOn Monday, Hegseth said that Fort Moore -- renamed in 2023 for Lt. Gen. Harold G. Moore and his wife, Julia -- would again be called Fort Benning. The base was originally named for Henry L. Benning, a Confederate and white supremacist. Hegseth again selected an honoree who had the same name, saying that the base was being renamed to honor Cpl. Fred G. Benning, who served during World War I.\n\nThis article originally appeared in The New York Times.","summary":"FORT BRAGG, N.C. -- The sprawling Army base in North Carolina had long been named for Braxton Bragg, an incompetent Confederate general who owned enslaved people.","url":"https://www.berkshireeagle.com/nyt/fort-liberty-renamed-fort-bragg-fulfilling-a-trump-campaign-promise/article_0cec3e0b-2d8d-5664-aeec-eabd427e7231.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-03-07 20:31:26","author":"Chris Cameron,North Adams Pride","authors":["Chris Cameron","North Adams Pride"],"language":"en","category":"politics","source_country":"us","sentiment":0.113},{"id":297854842,"title":"Stephen A Smith signs new $100 million ESPN deal: Report","text":"Stephen A Smith, a former newspaper reporter, has signed a new five-year contract with ESPN that is worth $100 million, according to a report. As per the agreement, Smith will continue to star on “First Take”, the ESPN's popular morning program, while scaling back some of his other required appearances on the network. Sources told The Athletic.Reports suggest that ESPN will pay Stephen A Smith $20 million annually under his new contract, compared to the $12 million per year he received under his previous deal.Under his new contract, Stephen A Smith will earn more annually than prominent NBA players such as Klay Thompson, D'Angelo Russell, and Chris Paul.Stephen A Smith will continue with First Take“I’m happy and honoured to remain a member of the Disney/ESPN family for, at least, the next five years,” Smith said in a statement on Friday.Smith, 57, is one of the network’s most prominent and frequently featured personalities. He has significant influence and is given the freedom to express his opinions on various subjects, particularly topics like the NBA, as part of ESPN’s pregame show. ESPN Chairman Jimmy Pitaro praised Smith for his relentless efforts to elevate sports conversations every day, expressing gratitude that he will continue with ESPN. He noted that Smith is a game-changer, with fans captivated by his extensive sports knowledge, strong opinions, and unique style.Also Read: With Love, Meghan: Meghan Markle's show renewed for second season by NetflixWill Stephen A Smith remain a part of other programs?As per The Athletic report, Smith will no longer serve as the main figure on the NBA pregame show next season. He will also have the option to reduce the number of times he appears on other ESPN shows or programs. He may still make occasional appearances on major basketball studio programs, as well as during the Monday Night Football pregame or at other significant events.ESPN stated that Smith will appear on additional programs beyond First Take , but they did not provide specific information about which programs those will be.Stephen A Smith explores politicsStephen A Smith has broadened the topics he discusses, often including politics on his own show, The Stephen A Smith Show . He has also featured on Fox News.Smith has mentioned the idea of running for president but has played down the notion of actually pursuing a campaign. He has stated that he enjoys his current life and isn't seriously considering running for office.Smith has been outspoken about figures like President Donald Trump, former Vice President Kamala Harris, and current issues, to the extent that he is now being discussed as a possible presidential candidate.Also Read : Transcripts for calls between survivors, 911 in 2022 mass killing of Idaho students unsealedFAQs:Who is Stephen A. Smith?Stephen A. Smith is a prominent American sports commentator, television personality, and journalist. He is best known for his role as a host on ESPN's popular sports debate show, First Take, where he often shares his strong opinions on various sports topics, especially basketball.What are some of Stephen A. Smith’s most notable contributions to sports media?Stephen A. Smith is known for his unfiltered opinions on athletes and sports events. He is particularly known for his commentary on NBA basketball, as well as his ability to drive conversations on sports shows like First Take. He has also been involved in sports talk radio and written columns for various outlets.","summary":"Stephen A Smith has been with ESPN for two decades, and became a permanent fixture on First Take in 2012. The new contract will now pay him more than his other contemporaries. He will now be a member of ESPN for the next 10 years.","url":"https://economictimes.indiatimes.com/news/international/us/stephen-a-smith-signs-new-100-million-espn-deal-report/articleshow/118793924.cms","image":"https://img.etimg.com/thumb/msid-118793923,resizemode-4,width-1200,height-900,imgsize-64956,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-07 19:52:54","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":0.194},{"id":297862234,"title":"The Five Fables Surrounding Trump","text":"Fable one: Trump is appeasing Russia?\n\nWho wiped out the Wagner group in Syria? Who sold offensive weapons to Ukraine first? Who warned Germany not to become dependent on the Russian Nord Stream II deal?\n\nWho withdrew from an unfair missile deal with the Russians? Who cajoled and berated NATO members to meet their military investment promises made following the 2014 invasion of Ukraine?\n\nIn contrast, who originally conceived a Russian “reset” in 2009? Who publicly virtue-signaled pushing the red “reset” button in Geneva with the current Russian Minister Sergey Lavrov?\n\nWhich ex-European leader got a million euros a year working for Russian energy companies?\n\nOf the last four presidents, under whose watch did Putin not invade another country?\n\nWhich American president, in hot-mic style, offered to (and did) dismantle U.S.-Eastern Europe missile defense plans in exchange for temporary Putin quietude (“space”) to aid his 2012 reelection?\n\nFable two: A trade war?\n\nPresident Donald Trump is not wildly slapping tariffs on Europeans.\n\nHe is simply saying that 1945 is now 80 years past and that the asymmetrical tariffs that Europe imposes on U.S. imports should be corrected. The massive trade surpluses Europe accumulates each year should give way to fairer, more balanced trade.\n\nIf Europe does not want tariffs, then simply calibrate its own tariffs on what America places on European imported goods, and work down jointly to zero tariffs on both sides.\n\nFable three: America is bullying Europe?\n\nThe U.S. does not actively interfere in European elections and politics.\n\nIn 2024, Europeans, especially the British Laborites, bragged about sending over campaign “volunteers” to work against Trump and, earlier, his conservative predecessors.\n\nBritish subject Christopher Steele sought to sabotage an entire American 2016 election with a falsified “dossier.”\n\nThe Ukrainian ambassador in 2016 wrote an op-ed all but endorsing Hillary Clinton and trashing her opponent.\n\nIn September 2024, Ukrainian President Volodymyr Zelenskyy was flown in on a Biden-provided U.S. military jet to Scranton, Pennsylvania–at a pivotal time in the most pivotal swing state–to surround himself with Democrat politicos.\n\nHis media-frenzied presence signaled a partisan campaign theme that a Kamala Harris win and the continuance of massive Democrat aid to Ukraine would ensure manufacturing jobs, such as the artillery shell factory he selected to visit.\n\nAs to NATO, Trump’s pressure from 2017 to 2021 finally pushed more NATO nations to rearm. But even 11 years after promising to invest a mere 2% of gross domestic product in defense, nine of the 32 members still have not complied.\n\nFable four: Negotiating with Putin is selling out?\n\nIn the long history of Western diplomacy with mass-murdering tyrants, Putin doesn’t even rank among the worst. Just ask his former reset partners Barack Obama and Hillary Clinton.\n\nFranklin Delano Roosevelt fueled mass-murdering “Uncle Joe” Stalin’s Red Army as a way to defeat Nazi Germany.\n\nRichard Nixon flattered and cajoled the greatest mass murderer in history, Mao Zedong, to triangulate China against the Soviet Union.\n\nRonald Reagan offered to share missile defense expertise with Soviet Russia.\n\nEuropeans have hosted almost every Palestinian murderous terrorist leader, as a way either of deflecting terrorism from their own shores or emphasizing their general loathing of Israel.\n\nFable five: Europe is going to save Ukraine?\n\nEurope rushed to congratulate and celebrate with Zelenskyy after his pre-planned White House blow-up. They are loudly announcing that a supposedly isolationist and appeasing U.S.–which has sent more aid to Ukraine than all nearby European nations combined–will now be supplanted by a “new” muscular and rearmed Europe.\n\nWe sincerely hope so.\n\nBut on every recent international moral question–ganging up on a lone Israel to appease terrorist forces in the Middle East, standing up to China’s mercantilism, neo-imperialism, and domestic oppression of minorities, or Russia’s prior 2008 and 2014 invasions–European outrage has been muted, real consequences nonexistent.\n\nWe are now witnessing European heads of state sending the same old virtue signaling support for the brave Zelenskyy, who supposedly spoke truth to power to the mean U.S. Orange Man.\n\nBut where does such performance art lead after the cult hero Zelenskyy had gnawed the hand that gorged him?\n\nTo multitudes of European tanks, skies full of European jets, and division after division of crack European infantry now heading east to “back up” Ukraine–led on horseback by its new Joan of Arc, Ursula von der Leyen?\n\nAside from all the present posturing and mock-heroics, the only way to save Ukraine is for the U.S. president, Donald Trump, to reflect joint Ukrainian, American, and European interests in stopping the war, forcing Putin as far back eastward as possible where he started in 2022, and creating a credible deterrent along with a DMZ/industrial corridor tripwire to stop another 2008, 2014, and 2022 invasion.\n\nAnything else is empty carnival barking.\n\n(C)2025 Tribune Content Agency, LLC.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Fable one: Trump is appeasing Russia? Who wiped out the Wagner group in Syria? Who sold offensive weapons to Ukraine first? Who warned Germany not... Read More\n\n\nThe post The Five Fables Surrounding Trump appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/03/07/the-five-fables-surrounding-trump/","image":"https://www.dailysignal.com/wp-content/uploads/2025/03/TrumpPose.jpg","video":null,"publish_date":"2025-03-07 19:52:33","author":"Age Over Support,Victor Davis Hanson","authors":["Age Over Support","Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.259},{"id":297856934,"title":"'I'm excited': Liberal Hollywood star rallies around new national landmark with support from both parties","text":"FIRST ON FOX: It's not easy in today's political climate to get Democrats and Republicans into a friendly, collaborative space together. But that's exactly what happened this week when Lynda Carter, star of the 1970s ABC hit \"Wonder Woman,\" joined a bipartisan reception on Capitol Hill aimed at getting the Smithsonian American Women's History Museum built. \"It's often said that certain kinds of men built America. And that is not exactly the truth, because we were there,\" Carter told Fox News Digital in an interview during the event. \"Most people don't know about our stories, about the women of America that helped to build our great nation. Those are the stories that I'm excited to have you hear about.\" Despite a bustling day of events Monday, a day before President Donald Trump's speech to a joint session of Congress, more than two dozen lawmakers found time to stop by a modest room on the first floor of the U.S. Capitol, where Carter was engaging with others in a bid to get the museum built. GOP REBELS HEAD TO WHITE HOUSE FOR MEETING TO AVOID GOVERNMENT SHUTDOWN Funding for the women's museum was appropriated in 2020 and signed into law during Trump's first term. Now, Rep. Nicole Malliotakis, R-N.Y., is leading a bill to actually give the museum a spot along the National Mall so it can finally be built. \"We're very fortunate to be here with a bipartisan effort. And we have 80 co-sponsors of our legislation, both Democrats and Republicans,\" Malliotakis told Fox News Digital. \"It's very important, so we can share the stories of the women who have come before us,\" she added before listing famous females like Rosie the Riveter, a group of Black nurses who worked with tuberculosis patients in the 1900s, known as the Black Angels, and former Supreme Court Justice Sandra Day O'Connor. And their effort is getting recognized by the very top levels of Congress. Speaker Mike Johnson, R-La., briefly stopped by the event and spoke with attendees, at one point appearing cheerful during a conversation with Carter. Former Speaker Nancy Pelosi, D-Calif., was also at the event, as were both male and female members of Congress on both sides of the aisle. \"This is the second and final step of the process,\" Rep. Brian Fitzpatrick, R-Pa., who is co-leading the effort, told Fox News Digital. \"Obviously, it's an important one, because this is the site selection. The hard part was getting it authorized, that's already done.\" Former Rep. Carolyn Maloney, D-N.Y., who has championed women's rights for decades, said she had spoken with Johnson during the event and \"it seemed like he was gonna look for the votes.\" \"I know how effective he is,\" Maloney praised. \"We're gonna get it done this time.\" Rep. Debbie Dingell, D-Mich., another Democrat leading the effort in Congress right now, affirmed: \"We are going to get it done.\" VANCE TAKES VICTORY IN BORDER VISIT AS ILLEGAL IMMIGRANT NUMBERS PLUMMET Dingell did not hesitate when asked whether she was confident about whether the project could be completed despite the current political environment. \"It has to,\" she said. CLICK HERE TO GET THE FOX NEWS APP It was an evening of bipartisanship for Carter as well, a noted Democrat who campaigned for former Vice President Kamala Harris' 2024 campaign. She credited both Republicans and Democrats, however, for coming together on the issue of the museum. The event culminated with the co-chairs of the bipartisan Women's caucus – Malliotakis, along with Reps. Monica De La Cruz, R-Texas, Emilia Sykes, D-Ohio, and Janelle Bynum, D-Ore. – presenting Carter with a frame memorializing her contributions to women in the Congressional Record.","summary":"Republicans and Democrats are teaming up with Lynda Carter to get a new women&apos;s history museum in DC.","url":"https://www.foxnews.com/politics/liberal-hollywood-star-rallies-around-new-national-landmark-support-support-from-both-parties","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/carter-capitol-bill.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 19:32:11","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","source_country":"US","sentiment":-0.016},{"id":297868070,"title":"'I'm excited': Hollywood star rallies around new national landmark with support from both parties","text":"FIRST ON FOX: It's not easy in today's political climate to get Democrats and Republicans into a friendly, collaborative space together. But that's exactly what happened this week when Lynda Carter, star of the 1970s ABC hit \"Wonder Woman,\" joined a bipartisan reception on Capitol Hill aimed at getting the Smithsonian American Women's History Museum built. \"It's often said that certain kinds of men built America. And that is not exactly the truth, because we were there,\" Carter told Fox News Digital in an interview during the event. \"Most people don't know about our stories, about the women of America that helped to build our great nation. Those are the stories that I'm excited to have you hear about.\" Despite a bustling day of events Monday, a day before President Donald Trump's speech to a joint session of Congress, more than two dozen lawmakers found time to stop by a modest room on the first floor of the U.S. Capitol, where Carter was engaging with others in a bid to get the museum built. GOP REBELS HEAD TO WHITE HOUSE FOR MEETING TO AVOID GOVERNMENT SHUTDOWN Funding for the women's museum was appropriated in 2020 and signed into law during Trump's first term. Now, Rep. Nicole Malliotakis, R-N.Y., is leading a bill to actually give the museum a spot along the National Mall so it can finally be built. \"We're very fortunate to be here with a bipartisan effort. And we have 80 co-sponsors of our legislation, both Democrats and Republicans,\" Malliotakis told Fox News Digital. \"It's very important, so we can share the stories of the women who have come before us,\" she added before listing famous females like Rosie the Riveter, a group of Black nurses who worked with tuberculosis patients in the 1900s, known as the Black Angels, and former Supreme Court Justice Sandra Day O'Connor. And their effort is getting recognized by the very top levels of Congress. Speaker Mike Johnson, R-La., briefly stopped by the event and spoke with attendees, at one point appearing cheerful during a conversation with Carter. Former Speaker Nancy Pelosi, D-Calif., was also at the event, as were both male and female members of Congress on both sides of the aisle. \"This is the second and final step of the process,\" Rep. Brian Fitzpatrick, R-Pa., who is co-leading the effort, told Fox News Digital. \"Obviously, it's an important one, because this is the site selection. The hard part was getting it authorized, that's already done.\" Former Rep. Carolyn Maloney, D-N.Y., who has championed women's rights for decades, said she had spoken with Johnson during the event and \"it seemed like he was gonna look for the votes.\" \"I know how effective he is,\" Maloney praised. \"We're gonna get it done this time.\" Rep. Debbie Dingell, D-Mich., another Democrat leading the effort in Congress right now, affirmed: \"We are going to get it done.\" VANCE TAKES VICTORY IN BORDER VISIT AS ILLEGAL IMMIGRANT NUMBERS PLUMMET Dingell did not hesitate when asked whether she was confident about whether the project could be completed despite the current political environment. \"It has to,\" she said. CLICK HERE TO GET THE FOX NEWS APP It was an evening of bipartisanship for Carter as well, a noted Democrat who campaigned for former Vice President Kamala Harris' 2024 campaign. She credited both Republicans and Democrats, however, for coming together on the issue of the museum. The event culminated with the co-chairs of the bipartisan Women's caucus – Malliotakis, along with Reps. Monica De La Cruz, R-Texas, Emilia Sykes, D-Ohio, and Janelle Bynum, D-Ore. – presenting Carter with a frame memorializing her contributions to women in the Congressional Record.","summary":"Republicans and Democrats are teaming up with Lynda Carter to get a new women&apos;s history museum in DC.","url":"https://www.foxnews.com/politics/hollywood-star-rallies-around-new-national-landmark-support-support-from-both-parties","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/carter-capitol-bill.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 19:32:11","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","source_country":"US","sentiment":-0.016},{"id":297843834,"title":"Kamala Harris mulling run for CA governor, will make decision by end of summer, sources say","text":"Former Vice President Kamala Harris is mulling a run in California's gubernatorial race and will make a decision by the end of summer, two sources familiar with her plans tell ABC News.\n\nThose sources share that Harris is aiming to keep her options open as she plans her future.\n\nCalifornia's current governor, Gavin Newsom, is term limited and will leave office in early 2027. The state's non-partisan gubernatorial primary election for the race is scheduled for June 2, 2026. The top two candidates with the most votes will move onto the general election.\n\nRELATED: Kamala Harris' journey from Berkeley to be 1st Black, Asian woman running for president\n\nCalifornia Lt. Gov. Eleni Kounalakis, a Democrat, has already announced her candidacy. Republican Riverside County Sheriff Chad Bianco has also announced a primary bid, among others.\n\nBeyond accepting an award at the NAACP Awards last month where she took a veiled swipe at President Trump and Elon Musk, Harris has kept a low profile since her November election loss.\n\n\"While we have no illusions about what we are up against in this chapter in our American story, this chapter will be written not simply by whoever occupies the oval office nor by the wealthiest among us. The American story will be written by you. Written by us. By we the people,\" Harris said during those remarks.","summary":"Former Vice President Kamala Harris is mulling a run in California's gubernatorial race and will make a decision by the end of summer, per two sources familiar with her plans.","url":"https://abc7.com/post/kamala-harris-mulling-run-california-governor-will-make-decision-end-summer-abc-news-sources-say/15988746/","image":"https://cdn.abcotvs.com/dip/images/15988765_kamala-harris-ap.png?w=1600","video":null,"publish_date":"2025-03-07 19:16:32","author":"Gabriella Abdul-Hakim, Gabriella Abdul-Hakim,KGO","authors":["Gabriella Abdul-Hakim, Gabriella Abdul-Hakim","KGO"],"language":"en","category":"politics","source_country":"US","sentiment":0.262},{"id":297844414,"title":"Trump Is Weaponizing the DOJ Just Like He Accused Democrats of Doing","text":"Throughout the 2024 presidential campaign season, Donald Trump accused his Democratic opponents—President Joe Biden and Vice President Kamala Harris—of using the levers of power against him.\n\n\"The Biden regime's weaponization of our system of justice is straight out of the Stalinist Russia horror show,\" he told rallygoers in March 2023 after being indicted in Manhattan for violating election law. In a September 2024 debate against Harris, Trump even blamed Democrats' rhetoric for the assassination attempt he survived weeks earlier, saying \"I probably took a bullet to the head because of the things that they say about me.\"\n\nBut now that Trump is firmly ensconced back in office, his administration seems to have no interest in stopping government weaponization. Rather, it seems keen to wield that power for itself. Looking back now on Trump's complaints, it appears less that he was upset than that he was jealous.\n\nOn February 10, acting Deputy Attorney General Emil Bove issued a memo to Danielle Sassoon, the acting U.S. Attorney for the Southern District of New York. Citing the authorization of Attorney General Pam Bondi, Bove directed Sassoon to dismiss the charges in the Department of Justice's (DOJ) ongoing case against New York City Mayor Eric Adams for bribery and wire fraud.\n\nTwo weeks before Trump took office, the DOJ adamantly maintained Adams' guilt. \"Law enforcement has continued to identify additional individuals involved in Adams's conduct, and to uncover additional criminal conduct by Adams,\" acting U.S. Attorney Walter Kim wrote in a motion to the court.\n\nBut just weeks later, Bove instructed Sassoon to drop the case—partly because \"the pending prosecution has unduly restricted Mayor Adams' ability to devote full attention and resources\" to enforcing Trump's immigration policies.\n\nSassoon refused, telling Bondi in a letter that dropping the charges against Adams for the reasons Bove specified would be wholly inappropriate and unethical. \"​​If a criminal prosecution cannot be used to punish political activity, it likewise cannot be used to induce or coerce such activity,\" Sassoon wrote. \"Threatening criminal prosecution even to gain an advantage in civil litigation is considered misconduct for an attorney.\"\n\nShe further claimed in a footnote that during a January meeting at which she and Bove were present, Adams' attorneys offered a quid pro quo in which Adams would \"assist with the Department's enforcement priorities only if the indictment were dismissed.\" She also alleged that Bove \"admonished\" a member of her staff for taking notes and \"directed the collection of those notes at the meeting's conclusion.\"\n\nSassoon concluded the letter by offering to resign if Bondi did not \"reconsider the directive.\"\n\n\"I have not spoken to [Sassoon],\" Bondi later told a reporter, \"but that case should be dropped.\" The following day, Bove accepted Sassoon's resignation and said she and the other prosecutors in her office would be investigated by the DOJ for \"disobeying direct orders implementing the policy of a duly elected President.\"\n\nThe entire affair reeks of the political favoritism that Trump inveighed against on the campaign trail. Sassoon, a Federalist Society member who clerked for Supreme Court Justice Antonin Scalia and was appointed to her position by Trump just days earlier, is clearly no leftist radical.\n\nBove's position, meanwhile, is nakedly political: He charges that Sassoon refused to dismiss a \"politically motivated prosecution\" despite admitting in his original memo that the DOJ had not \"assess[ed] the strength of the evidence or the legal theories on which the case is based\" and that \"this directive in no way calls into question the integrity and efforts of the line prosecutors responsible for the case, or your efforts in leading those prosecutors in connection with a matter you inherited.\"\n\nAt least six other federal prosecutors resigned before Bove found one willing to dismiss the charges against Adams. \"I expect you will eventually find someone who is enough of a fool, or enough of a coward, to file your motion,\" Hagan Scotten, an assistant U.S. attorney in Sassoon's office, wrote in his resignation letter to Bove. \"But it was never going to be me.\"\n\nBove also claimed in his second letter that Sassoon's accusation of a quid pro quo was \"false.\" But that very same week, Adams appeared on Fox & Friends with Tom Homan, Trump's border czar, who said the mayor had agreed to cooperate with federal immigration enforcement measures. \"If he doesn't come through,\" Homan said, \"I'll be in his office, up his butt saying, 'Where the hell is the agreement we came to?'\"\n\nNot only did Homan describe a literal quid pro quo, he even defined the \"quid\" and the \"quo\" on national television.\n\nMeanwhile, Edward Martin Jr., Trump's pick to head the U.S. Attorney's Office in the District of Columbia, has spent his first few weeks in office threatening investigations of his boss' political enemies.\n\nWhen media outlets reported on the identities of engineers working with Elon Musk's Department of Government Efficiency, Martin offered his office's services to Musk in letters posted on X. In one letter, Martin told Musk that his office would investigate anyone \"discovered to have broken the law or even acted simply unethically.\"\n\nMartin also sent letters to Democratic lawmakers, threatening to investigate fiery comments they made about political opponents. The letters were a farce: Each lawmaker's comments were well within the bounds of political speech protected by the First Amendment. In one case, the letter came nearly five years after the remarks in question, when Sen. Chuck Schumer (D–N.Y.) said two conservative U.S. Supreme Court justices had \"released the whirlwind\" and would \"pay the price.\"\n\nThis week, Martin dropped his investigation into Schumer, but only after the DOJ reportedly refused his request to present the case to a federal grand jury.\n\nIn the meantime, Martin has busied himself with other abuses of his considerable power. As Reason has written, the Biden administration spent much of its final days in office approving as many grants and loans as possible from the Environmental Protection Agency (EPA) before Trump was sworn in. An EPA staffer admitted as much after the election, telling an undercover operative with the right-wing group Project Veritas, \"We're just trying to get the money out as fast as possible before they come in and stop it all.\"\n\nAn unseemly task, certainly, and ripe for abuse as administrators are likely to impose less scrutiny than usual on a shorter timeline. But ultimately, the agency was funded by an act of Congress and imbued with the authority to disburse the money.\n\nEPA Administrator Lee Zeldin announced in February that $20 billion of EPA money was \"parked at an outside financial institution by the Biden EPA\"—later identified as the Greenhouse Gas Reduction Fund, a grant program for clean energy projects; the grants in question were designated to particular recipients but held and distributed by Citibank. Zeldin said this money was part of a \"scheme\" to conduct \"a rush job with reduced oversight,\" and he pledged to claw back the funds and \"get them back inside of control of government.\"\n\nThe Washington Post reported last week that FBI agents had questioned EPA employees about the distribution of the grant money. Denise Cheung, a 24-year veteran of the D.C. U.S. Attorney's Office and head of its criminal division, resigned when Martin apparently directed her to draft an order compelling Citibank to freeze the funds.\n\nCheung had discussed the order with the FBI's Washington field office, which \"issued a letter to the bank recommending a thirty-day administrative freeze on certain assets,\" Cheung explained in a resignation letter to Martin. She then received a call from Martin, in which he \"criticized that the language merely 'recommended' that a freeze of the accounts take place\" and \"directed that a second letter be immediately issued to the bank under your and my name ordering the bank not to release any funds in the subject accounts pursuant to a criminal investigation.\"\n\n\"When I explained that the quantum of evidence did not support that action, you stated that you believed that there was sufficient evidence,\" Cheung added. \"Because I believed that I lacked the legal authority to issue such [an order], I told you that I would not do so. You then asked for my resignation.\"\n\nMartin \"then personally submitted a seizure warrant application without any other prosecutors in his office that was rejected by a U.S. magistrate judge in D.C., who found that the request and accompanying FBI agent affidavit failed to establish a reasonable belief that a crime occurred,\" according to The Washington Post.\n\n\"That happens basically… never,\" writes Harry Litman, who served as a U.S. attorney under President Bill Clinton. \"I can't recall a single instance when it happened in a US Attorney's office where I was serving.\"\n\nMartin currently serves as the interim U.S. attorney, but Trump also nominated him to the post permanently, which will require Senate confirmation. He faces considerable headwinds from the opposition party: This week, Democrats on the Senate Judiciary Committee asked the D.C. Bar to investigate Martin's conduct since taking office.\n\nIn a letter last month, Rep. Gerry Connolly (D–Va.), the ranking member of the House Committee on Oversight and Government Reform, charged that Martin's public actions \"raise serious concerns that your new initiative is a pretext for misusing your office for political ends, threatening and intimidating critics of the Administration, and chilling constitutionally protected speech.\"\n\nMeanwhile, Rep. James Comer (R–Ky.)—who chairs that committee—praised Martin's nomination, saying it signaled that Trump \"wasted no time delivering on his promise to restore law and order in our capital city.\"\n\nIf Trump had come into office on a pledge to rid the DOJ of political persecution and ideologically motivated indictments, it would be a cause worth celebrating. But less than two months back in office, Trump's appointees have used the levers of federal power for his benefit in a manner that seems every bit as corrupt as the process Trump criticized on the campaign trail.","summary":"Trump's appointees are wielding federal power in a manner that appears every bit as corrupt as what he complained about on the campaign trail.","url":"https://reason.com/2025/03/07/trump-is-weaponizing-the-doj-just-like-he-accused-democrats-of-doing/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/03/trump-adams-doj-1024x576.jpg","video":null,"publish_date":"2025-03-07 19:15:59","author":"Joe Lancaster","authors":["Joe Lancaster"],"language":"en","category":"politics","source_country":"US","sentiment":-0.321},{"id":297838414,"title":"Newsom breaks with party on transgender athletes in women's sports, sparking backlash","text":"In this first episode of a new podcast published Thursday, California's Democratic Gov. Gavin Newsom, an LGBTQ ally, broke with his party, saying that transgender athletes playing in female sports is \"deeply unfair.\"\n\n\"I think it's an issue of fairness. I completely agree with you on that. It is an issue of fairness. It's deeply unfair,\" Newsom said on his podcast, \"This is Gavin Newsom.\"\n\nNewsom's comments came during a conversation with conservative activist Charlie Kirk, who leads conservative group Turning Point USA and played a critical role in garnering youth support for President Donald Trump in the 2024 election.\n\nNewsom, sometimes viewed as a 2028 presidential hopeful, also agreed that the political ad that hurt former Vice President Kamala Harris the most in her presidential campaign was her previous support for providing taxpayer-funded gender transition-related medical care for detained immigrants and federal prisoners. Trump's campaign had played back her remarks in a widely-circulated ad.\n\n\"She didn't even react to it, which was even more devastating,\" Newsom said.\n\nNewsom also pointed to his own work in expanding LGBTQ rights, while referencing current law in the state of California that allows transgender athletes to participate in school sports that reflect the gender they identify with.\n\nNewsom himself was a trailblazer in expanding LGBTQ rights: in 2004, as mayor of San Francisco, he allowed same-sex marriages to proceed even though they were not yet allowed nationwide.\n\nHe referenced that moment while discussing his alignment with Kirk's views on transgender athletes in women's sports.\n\n\"I've been a leader in the LGBTQ places, as, you know, back in 2004 [I] was marrying same sex couples. And I know we have [a] difference [of] opinion on marriage equality, and so I've been at this for years and years, I take a backseat to no one,\" Newsom said, before discussing how he heard people talking about transgender athletes.\n\nOn the podcast, Newsom also called for compassion toward transgender individuals, even while discussing the sports issue: \"There's also humility and grace. You know, that, these poor people are more likely to commit suicide, have anxiety and depression, and the way that people talk down to vulnerable communities is an issue that I have a hard time with as well.\"\n\nLGBTQ rights groups criticized Newsom's remarks, saying that they came amid national backlash to transgender individuals and their rights.\n\nThe Human Rights Campaign, a major national LGBTQ rights advocacy and lobbying group, said in a statement shared on social media that with discussions nationwide in legislatures about restricting same-sex marriage or transgender rights, \"this is not a moment to sit politely in the face of authoritarian bullies or throw people under the bus for political posturing.\"\n\n\"Singling out trans kids to score political points is never going to help someone pay their rent, keep Medicaid or get a job, but it will make it seem like Gov. Newsom believes our civil rights are up for grabs,\" the organization wrote. \"Californians - and ALL Americans - need leaders who have courage in their convictions, and who will show up for them, in the faces of people who want to see us all back in the closet.\"\n\nThe organization also pointed to a 2013 law in California that allowed students to be part of sport teams matching their own gender identity. The American Civil Liberties Union praised the law in 2013 as \"ensuring transgender youth have the opportunity to fully participate and succeed in schools across the state.\"\n\nNewsom briefly referenced the law in his discussion with Kirk, highlighting that it was passed before he became governor.\n\nTwo members of the California state legislature, Assemblymember Chris Ward and state Sen. Caroline Menjivar, released a statement through the California Legislative LGBTQ Caucus criticizing Newsom's remarks as well, saying they were \"profoundly sickened and frustrated\" by what he said.\n\n\"Sometimes Gavin Newsom goes for the Profile in Courage, sometimes not,\" they wrote. \"We woke up profoundly sickened and frustrated by these remarks. All students deserve the academic and health benefits of sports activity, and until Donald Trump began obsessing about it, playing on a team consistent with one's gender has not been a problem since the standard was passed in 2013.\"\n\nNewsom's remarks came just a month after Trump signed an executive order intending on banning transgender athletes from participating in women's sports. The White House has said the action is meant to protect women in sports from harm and from facing opponents who they say have an unfair advantage.\n\nLGBTQ advocacy groups have criticized the administration's action and general rhetoric as discriminatory and as having razor-sharp focus on issues of transgender rights to the exclusion of economic and other issues.","summary":"California's Democratic Gov. Gavin Newsom, an LGBTQ ally, broke with his party, saying that transgender athletes playing in female sports is \"deeply unfair.\"","url":"https://abcnews.go.com/Politics/california-gov-gavin-newsom-breaks-party-transgender-athletes/story?id=119559011","image":"https://i.abcnewsfe.com/a/cc507b68-474a-4711-b290-7b1b30cab91a/gavin-newsom-gty-jt-250307_1741369701819_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-03-07 18:34:02","author":"Hannah Demissie,Oren Oppenheim","authors":["Hannah Demissie","Oren Oppenheim"],"language":"en","source_country":"US","sentiment":-0.216},{"id":297826408,"title":"NEWT GINGRICH: How House Democrats became zombies","text":"As I wrote earlier this week, after attending President Donald J. Trump’s address to the Joint Session of Congress, it occurred to me that the House Democrats have become like zombies. Their members sat mute and motionless no matter what the president said or who he honored – including a young cancer survivor, a newly accepted West Point cadet, and an American who had been held hostage in Russia. Not one House Democrat exhibited any trace of human compassion or interest. It was a bit eerie. As I thought more about this, a lot of other things began to make sense. DEMOCRATS PRIVATELY REBUKE PARTY MEMBERS WHO JEERED TRUMP DURING SPEECH TO CONGRESS: REPORT The House Democrats have evolved from being a relatively rough and tumble, argumentative, and rebellious bunch in the 1960s and 1970s into a tame, passive, robotic group today. Of course, historically, the Democratic Party has had a deep tradition of machine politics going back to the founding of Tammany Hall in New York City in 1786. Virtually every major city run by Democrats today operates this way. Over the long-term, the Democratic system simply tends to breed conformity. But this zombie-ism is a new, more extreme phenomenon. You can start to track it with Speaker Nancy Pelosi. Recall when Pelosi held up the nearly 1,000-page Affordable Care Act (Obamacare) and said, \"we have to pass the bill so you can find out what is in it.\" At the time, I thought it was a foolish slip of the tongue. In hindsight, the Pelosi Speakership often involved Democratic members voting blindly as instructed by their elected leadership. As Speaker in the first two years of Joe Biden’s presidency, Pelosi took full advantage of this blind loyalty to pass a slew of massive bills with no elected officials really knowing the details. 13-YEAR-OLD CANCER SURVIVOR EARNS STANDING OVATION AS HE BECOMES SECRET SERVICE AGENT DURING TRUMP SPEECH Democrat after Democrat voted for deeply unpopular policies which barred parents from knowing what their children were doing and learning in school, allowed men to play women’s sports, opposed tax cuts, left the southern border open, etc. For a long time, I could not figure out how House Democrats could so brazenly ignore the will of the American people. Now I get it. They were turning into zombies. For a long time, I could not figure out how House Democrats could so brazenly ignore the will of the American people. Now I get it. They were turning into zombies. Of course, Pelosi didn’t do it alone. The teachers’ and public employee unions kept people in line by threatening to fund primary opponents. The left-wing billionaires and activist groups also policed House Democratic members. The propaganda media also gladly reminded Democrats of the party-movement line. From \"The View,\" to MSNBC, to the New York Times, and the Washington Post, the signals went out. This is who we are. This is what we believe. Those who broke rank became ostracized and isolated. Just ask Sen. Joe Manchin, Health and Human Services Secretary Robert F. Kennedy Jr., or Director of National Intelligence Tulsi Gabbard. CLICK HERE FOR MORE FOX NEWS OPINION Finally, there was sheer social pressure from other Democrats. Walking to vote and getting on an elevator with five or six hard-left-wing members could have a significant influence on whether someone voted against Democratic leadership. At a practical level, losing committee assignments and watching more obedient members get the better committees is a real lever of power. I encountered this in the 1980s when several southern Democrats voted with President Ronald Reagan. They suddenly found their committee assignments and proposed legislation in jeopardy. The ultimate example of zombie behavior in the Democratic Party was the replacement of President Biden by Vice President Kamala Harris. President Biden had won every primary. He had a virtually unanimous delegation which would have dominated the Democratic National Convention. Vice President Harris had received zero votes. Yet within a few hours, the zombies took down Biden and elevated Harris. CLICK HERE TO GET THE FOX NEWS APP In a party which had spent four years lecturing about democracy, this instant switch would only have been possible in a party of zombies. They did as they were told. Applauded when they were told. And lied to themselves when they were told. It will be interesting to see how House Democrats deal with the challenges of a dynamic, creative, and aggressive Republican Party. I expect President Trump will cheerfully run circles around the House Democrat zombies just as he did Tuesday night. CLICK HERE TO READ MORE FROM NEWT GINGRICH","summary":"It will be interesting to see how House Democrats deal with the challenges of a dynamic, creative, and aggressive Republican Party under the Trump administration.","url":"https://www.foxnews.com/opinion/newt-gingrich-how-house-democrats-became-zombies","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/2025-03-05t024716z_2097824581_rc2q6davc6u2_rtrmadp_3_usa-trump-congress.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 17:51:57","author":"Newt Gingrich","authors":["Newt Gingrich"],"language":"en","category":"politics","source_country":"US","sentiment":-0.169},{"id":297824842,"title":"Is there a new Gavin Newsom?","text":"Politically, the California Governor who proudly led the opposition to President Trump in his first term, debated leading Republicans on Fox News, and purchased advertisements opposing Republican policy in red states, suddenly is sounding a lot different.\n\nThe latest example exploded this week when Newsom hosted his new podcast, “This is Gavin Newsom” in which he argued that transgender men competing in women sports was “deeply unfair.”\n\nThis is the same Gavin Newsom who, as mayor of San Francisco, launched his national political profile twenty years ago by ordering same-sex marriages and more recently demonstrated support for the transgender community throughout his governorship. In the same podcast that Newsom agreed that transgender men did not belong in women sports he added that the transgender community had to be treated with “humility and grace” while dealing with the sports issue.\n\nThis latest seeming reversal of opinion comes a little more than a month after the governor cozied up to President Trump. After Trump won election, Newsom called a special session of the legislature to authorize funds to oppose Trump’s actions as president. Positions can change in politics. Trump’s rhetoric often changes on major issues day to day.\n\nBut why is Newsom seemingly creating a new persona in 2025?\n\nCritics will argue that Newsom is interested in running for president in 2028 and is moving toward the center where more elections are won.\n\nNewsom defenders see him as being a realist. His softening tone to the president was needed, they argue, because of federal assistance required to help fund the fixes for the devasting Southern California wildfires. Newsom, who rallied the legislature to sue the president, now says he can work with him.\n\nSupporters also point out that Newsom recognizes the volatile issue of transgenders helped sink the presidential ambitions of former Vice President Kamala Harris, especially the effective and legendary political television ad that ended, “Kamala is for they/them. President Trump is for you.” Trump continues to pound the issue signing an executive order banning transgender men from competing in college sports.\n\nSo, are we witnessing a Gavin Newsom 2.0, or a clever political shape-shifter?\n\nNewsom faced immediate backlash from LBGTQ+ advocates and Democratic elected officials. One problem with the news headlines that claim Newsom broke with Democrats on this issue is that he didn’t—not rank and file Democrats, anyway. While Democratic leaders may have different views than Newsom on transgender athletes, Democratic voters agree with him according to polls. Nearly 7 in 10 Democrats say transgender male athletes should stay clear of women sports.\n\nNewsom is proud of his record of jumping ahead of political movements such as on the same-sex marriage issue. Is he doing that again, albeit in a different direction?\n\nAre his latest moves made in the spirit of a guide trying to lead his fellow Democrats out of the forest of disapproval?\n\nOr is it a throwback to the triangulation policies associated with President Bill Clinton when a politician adopts an idea of political opponents to shield against attacks from the other side?\n\nNewsom may simply be practicing smart politics.\n\nThere is plenty of time between now and the presidential primaries. Watching Newsom’s actions and words will be clear markers to his motives. The true test will come if in the presidential campaign of 2028 some of Newsom’s positions depend on which way the political winds are blowing at that time.\n\nJoel Fox is a senior fellow at Pepperdine University’s Graduate School of Public Policy","summary":"The latest example exploded this week when Newsom hosted his new podcast, “This is Gavin Newsom” in which he argued that transgender men competing in women sports was “deeply unfair.”","url":"https://www.ocregister.com/2025/03/07/is-there-a-new-gavin-newsom/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/LDN-L-FIRE-TRUMP-VISIT-0125-10.jpg?w=1024&h=684","video":null,"publish_date":"2025-03-07 17:41:56","author":"Joel Fox","authors":["Joel Fox"],"language":"en","source_country":"US","sentiment":0.134},{"id":297828264,"title":"‘Non-partisan’ crypto company attending White House event is run by Democratic donors","text":"“It’s discouraging that the current administration would seek a last-ditch effort to go after companies they deem to be associated with political opponents,” Coplan said in a statement issued after the raid. “We are deeply committed to being non-partisan, and today is no different, but the incumbents should do some self-reflecting and recognize that taking a more pro-business, pro-startup approach may be what would have changed their fate this election.”\n\nFollowing the FBI investigation, a friend of Coplan named Bryan Goldberg wrote a piece for the New York Post, calling the raid a “scandal.” Goldberg described Copeland as having an “apolitical nature” and claimed that “to initiate any conversation about politics is a surefire way to drive Coplan back into his iPhone to email with his small and scrappy engineering team.”\n\nIn recent weeks, Polymarket’s X account has interacted with multiple right-wing influencers, including Kyle Rittenhouse, Zerohedge, Tucker Carlson, and Andrew Tate. Additionally, the company has touted the purported $105 billion Elon Musk’s Department of Government Efficiency has saved taxpayers, likely a considerable overestimate, and posted a joke chart suggesting that Democratic lawyer Norm Eisen is “corrupt.” \n\nThere’s more than meets the eye for Polymarket and Coplan’s neutral or right-of-center public posturing, however.\n\nIn October 2024, a Politico reporter spotted Coplan with Minnesota Gov. Tim Walz (D) at a campaign fundraiser for former Vice President Kamala Harris in New York City. Walz was then Harris’s running mate.\n\nFederal Election Commission records show that Coplan donated roughly $100,000, split between Harris’s campaign and the Democratic National Committee during the latter months of the 2024 election. Coplan was joined in his donations by his firm’s chief marketing officer, Matthew Modabber, who also pushed about $100,000 to Harris and the DNC. The crypto executive duo sprinkled a couple thousand more dollars across various state Democratic parties and Equality PAC, a pro-LGBT committee. \n\nCoplan did make one contribution to a Republican — $5,000 to Florida Gov. Ron DeSantis’s effort to primary Trump.\n\nModabber and Coplan also attended the Democratic National Convention in Chicago and were photographed alongside liberal celebrities such as youth influencer Harry Sisson.\n\nWith a new party in charge of Washington, however, Coplan’s days of hobnobbing with Democrats may be on hold for now.\n\n“This admin’s commitment to collaboration with American innovators is revitalizing the American dream,” Coplan said of the Trump administration on Thursday. “The future is bright.”\n\nCoplan did not respond to a request for comment.","summary":"Polymarket CEO Shayne Coplan, who is expected to attend Friday’s White House Digital Asset Roundtable at the invitation of President Donald Trump, donated roughly $100,000 to Democrats during the 2024 election cycle despite friends claiming Coplan is “apolitical” and his own insistence that Polymarket is “deeply committed to being non-partisan.&#8221; Coplan’s popularity with the online [&#8230;]","url":"https://www.washingtonexaminer.com/news/investigations/3340736/polymarket-white-house-event-democratic-donors/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/trump-crypto.webp","video":null,"publish_date":"2025-03-07 17:20:09","author":"Robert Schmad","authors":["Robert Schmad"],"language":"en","category":"politics","source_country":"US","sentiment":-0.039},{"id":297821058,"title":"Medicaid Map Shows Federal Funding Received By Each US State","text":"Mississippi and West Virginia are the states that receive the most federal assistance for Medicaid, as shown by data from the health policy research center Kaiser Family Foundation (KFF).Newsweek has contacted the Centers for Medicare and Medicaid via email for comment.Why It MattersConcerns for potential cuts to Medicaid ramped up when the GOP budget passed through the House, as now the House Energy and Commerce Committee, which oversees Medicaid, is looking to cut $880 billion in spending over the next decade.Critics of the budget warned it would result in the \"gutting\" of Medicaid, a program used by some 80 million Americans, many of whom are President Donald Trump's supporters.What To KnowThe majority of Medicaid spending comes from the federal government—as much as 67 percent of the program is federal government funded, according to the National Association of State Budget Officers.Many states are therefore worrying about the impact the federal government spending cuts will have on Medicaid, especially for those that rely heavily on government funding to run the program.Mississippi is the state that receives the most support from the federal government to run Medicaid, as the federal medical assistance percentage (FMAP) in the state is 77 percent.FMAP is calculated by taking into account the average per capita income for each state relative to the national average. No state currently receives a FMAP lower than 50 percent.West Virginia also received a significant amount of assistance from the government, having a FMAP of 74 percent.Kentucky, Alabama, South Carolina, Arkansas, and New Mexico are other states receiving a higher proportion of federal government support in running Medicaid services, with percentages of 71, 73, 70, 69 and 72 respectively.Out of these seven states that receive the most government support for Medicaid, six of them voted for Trump in the 2024 Presidential Election.New Mexico was the only state that voted for his Democratic opponent, former Vice President Kamala Harris.The states which received the minimum amount of support from the government, with a FMAP of 50 percent, were Washington, California, Colorado, Connecticut, Wyoming, New Jersey, Maryland, Massachusetts, New Hampshire, and New York.Of the states receiving the smallest proportion of support from the government for Medicaid, the only state that voted for Trump in the November election was Wyoming— the others were all supporters of Harris.While it does not receive as much federal support as other states, KFF data also shows that Oregon is expected to see the largest decline in Medicaid enrollment.What People Are Saying@TheDemocrats, an account on X with more than 2.3 million followers on the platform, wrote in a post on X on Wednesday: \"41% of all births in the United States are covered by Medicaid—which House Republicans voted to cut.\"Texas Representative Al Green said when explaining why he interrupted Trump during his address in Congress: \"I wanted him to know that he didn't have a mandate to cut Medicaid. I did this because Medicaid is the only insurance many people have in this country. I am blessed as I stand here now, there's a physician waiting if something should happen.\"\"I have the best health care in the world. There are other people who have less than I have. I would have them have what I have. But I surely would not stand by and see them lose what little they do have,\" he added.What's NextIt is still not clear where the House Energy and Commerce Committee will find its savings; however, analysis by the nonpartisan Congressional Budget Office released this week showed that the GOP's budget goals could not be reached without reducing spending on Medicaid.","summary":"Analysis by the Congressional Budget Office released this week showed the GOP's budget goals could not be reached without reducing Medicaid spending.","url":"https://www.newsweek.com/medicaid-map-federal-funding-each-us-state-2041109","image":"https://d.newsweek.com/en/full/2602453/medicaid-fmap-map.jpg","video":null,"publish_date":"2025-03-07 17:18:24","author":"Jasmine Laws","authors":["Jasmine Laws"],"language":"en","category":"politics","source_country":"US","sentiment":-0.186},{"id":297809508,"title":"‘Climate change is sexist’: We need more women leading the crisis response, experts say","text":"The climate crisis doesn’t affect everyone equally - women and girls bear the brunt of the suffering, largely because they make up the majority of the world’s poor. In rural areas, it is women and girls often responsible for securing water, food, and firewood for their families. During drought and floods, women are forced to work harder and walk further. As climate change exacerbates conflicts, inequalities and vulnerabilities, women also face increased risks of gender-based violence. When extreme weather hits, women and children are 14 times more likely to die than men, and an estimated four out of five people displaced by the impacts of climate change are women and girls. “Put simply: climate change is sexist,” Helen Pankhurst, senior advisor on gender equality at CARE International UK tells Euronews Green. “It’s a feminist issue which threatens the fundamental rights of women and girls.”Despite the labour burden climate changes places on women, they are on the ground “leading the charge when it comes to grassroots campaigning and inspiring change,” according to Pankhurst. “They’re pulling together their communities and showing leadership in coming up with solutions, demonstrating resilience and delivering hope for a better future,” she says. “They are also leading in civil society, fighting back against policies which are doing irreparable harm. There is a groundswell of women standing up and saying things must change; they’re just not in seats of political power.”Only eight out of 78 world leaders at the last climate summit were women “It is deeply frustrating that the women and girls whose lives are so disproportionately affected are not being heard on the global stage,” says Pankhurst. “Climate and gender justice go hand in hand; you can’t have one without the other.”Only eight out of 78 world leaders who participated in the most recent COP29 were women. Although delegations at the UN climate conference are consistently increasing in numbers, women’s representation has stagnated and even decreased.Bianca Pitt, co-founder of SHE Changes Climate, a campaign to get women equally represented at international climate negotiations and beyond, tells Euronews why it is vital women be included in climate talks and negotiations. “When women suffer, everyone suffers,” she says. “It has a knock-on effect.”If women - ideally from economically marginalised backgrounds - aren’t included in decision making about climate change, then women’s lived experiences and perspectives aren’t being heard.“If we only have a select group of people making decisions, the decisions will be incomplete - they won’t have the desired outcome,” she adds. “The majority of decisions are made by men for men and women. That creates a blind spot because we can only make decisions based on our own lived experience in the peer group we are in.”Women in power leads to stronger climate policies, studies showPitt said it isn’t “fair” that women aren’t included in the most important discussions being had about our planet, but it isn’t just about fairness – it’s about what is going to produce the best outcomes. When decision-making processes incorporate the perspectives of men and women, solutions are more comprehensive and robust. One study on gender and climate change found that female representation in national parliaments across 91 countries correlated with more stringent climate change policies and lower carbon emissions. Another Italian study found that women leaders prioritise proper waste management, decreasing the misuse of water, energy and resources. In the private sector, research shows that companies with a bigger share of women on their boards are more likely to improve energy efficiency, reduce firms’ overall environmental impact and invest in renewable energy. Women-led firms make more efforts to curb emissions and have better results for environmental, social and governance indicators. “Research shows the economies in which women participate are more resilient – they’re stronger, more productive, and have better outcomes for everyone,” Pitt says.It’s the same for nations and businesses for whom women lead on climate change, she says. When women are involved in making decisions on climate change, policies are more likely to succeed. Why aren’t more women leading on climate change?“We know that women are leading on climate change at a grassroots level and within civil society; we see it at CARE International through our programmes all over the world,” Pankhurst says.“Women are leading the climate response in their homes and communities, coming up with innovative and sustainable solutions like leading agriculture cooperatives, encouraging their communities to plant drought-resistant crops, and creating early warning systems that save the lives and livelihoods of women who don’t have access to traditional media.”If the evidence so starkly shows the need for women leading on climate change, then why are women still underrepresented as climate change leaders in politics?“There’s definitely a gender bias,” says Pitt. “It’s real and strong.”Perhaps there is a lurking, unconscious gender bias that distrusts women leaders or thinks they don’t display the authority or assertiveness of men, as explored by the BBC when Kamala Harris became the first woman vice president of the United States. And according to Pitt, lack of female representation about climate on the national level is in part due to lack of representation. “If you don’t have women leading, you don’t set the example for younger women to take that career,” she says. “If you don’t see women leading these conferences, young girls won’t be inspired - they’ll think it is just men in grey suits.”How can more women reach climate leadership positions? Public bodies, businesses, and governments are starting to realise the unconscious biases toward women in the climate change sector, but there isn’t time to wait around for a slow, organic change, the experts argue. “Organic growth [of women leading on climate change] is not delivering the results,” Pitt says. “50 per cent of delegations of climate negotiations have to be women as per the UNFCCC Gender Action Plan.”Pitt also urges that women be “skilled up” to join negotiations, and be given ample amount of speaking time.“If a woman chairs something, the remaining women in the room are more likely to speak up,” she says. By “shining a light” on the women already leading in this space, younger girls will be inspired to follow - they will see it’s possible to lead.”Likewise, Pankhurst - who, yes, is the great-granddaughter of British suffragette leader Emmeline Pankhurst - wants to see “more room made at the table for women and girls to speak into this crisis.” “We need to fund women-led organisations working in this space; supporting them to thrive and make a real difference at a political level locally, nationally and globally,” she says. And, this International Women’s Day (8 March), there’s no time to maintain the status quo.“We don’t have time to waste - climate change is here, now. It’s not some far off threat,” she adds. “We don’t have the luxury of time.”","summary":"Only eight out of 78 world leaders at the last climate summit were women. How can we fix that?","url":"https://www.euronews.com/green/2025/03/07/climate-change-is-sexist-we-need-more-women-leading-the-crisis-response-experts-say","image":"https://static.euronews.com/articles/stories/09/10/07/50/1440x810_cmsv2_c5a14039-3114-5dd3-9a23-75a6f931ff49-9100750.jpg","video":null,"publish_date":"2025-03-07 16:58:18","author":null,"language":"en","category":"politics","source_country":"fr","sentiment":0.094},{"id":297807348,"title":"Kamala Harris reveals timetable for making major political decision in deep blue state","text":"Former Vice President Kamala Harris is setting a timetable to make a major decision about her political future. Harris, who lost last November's White House election to now-President Donald Trump, is seriously considering a 2026 bid to succeed term-limited Democrat Gov. Gavin Newsom of California. Additionally, a source in the former vice president's political orbit confirmed to Fox News Digital that Harris has told allies she will decide by the end of summer on whether to launch a gubernatorial campaign. The news was first reported by Politico. There has been plenty of speculation since last year's election regarding Harris, who replaced then-President Joe Biden as the Democratic Party's 2024 presidential nominee last summer after he dropped out of the race amid mounting questions over his physical and mental stamina. CLICK HERE FOR THE LATEST FOX NEWS REPORTING AND OPINION ON FORMER VICE PRESIDENT KAMALA HARRIS The two potential options for Harris are launching a gubernatorial run next year in her home state or seeking the presidency again in 2028. Extremely early polls in the next Democratic Party presidential nomination race - which are heavily reliant on name recognition at this point - indicate that the former vice president holds a significant lead over other potential White House contenders. It is very unlikely she could do both. Running and winning election in 2026 as governor of heavily blue California, the nation's most populous state and home to the world's fifth-largest economy, would likely take a 2028 White House run off the table, allies and political analysts have indicated. Harris served as San Francisco district attorney, California attorney general and represented the Golden State in the U.S. Senate before joining Biden's 2020 ticket and winning election as vice president. TOP TRUMP ALLY TEASES BID FOR CALIFORNIA GOVERNOR IF HARRIS RUNS While no decisions have been made, the former vice president has vowed to remain politically involved. Harris, in a video message to the Democratic National Committee, as it huddled for its winter meeting a month ago, pledged to be with the party \"every step of the way.\" She recently spoke at the NAACP Image Awards, as she accepted the organization's Chairman's Award. This weekend, she is headed to Las Vegas - Nevada is an early-voting state in the presidential primary calendar and a key general election battleground - to speak at Human X, which is an AI-themed conference. If Harris decides this summer to launch a gubernatorial campaign, she would likely clear much of the field of Democrats. California Attorney General Rob Bonta said last month he would support Harris if she decides to run and that \"she would be field-clearing\" if she launched a campaign. Bonta, a former state lawmaker who has served as California attorney general since 2021, said he would run for re-election next year rather than launch a gubernatorial campaign, putting to rest speculation about his next political moves. LEADING CALIFORNIA DEMOCRAT'S PREDICTION ABOUT KAMALA HARRIS \"Kamala Harris would be a great governor,\" Bonta said in an interview with Politico. Among the more than half-dozen Democratic Party candidates already running for governor are Lt. Gov. Eleni Kounalakis - a Harris ally - and former Los Angeles Mayor Antonio Villaraigosa. Former Rep. Katie Porter, who unsuccessfully ran for the Democratic Senate nomination last year, has expressed interest in launching a campaign. Additionally, former Health and Human Services Secretary Xavier Becerra, who served in Congress and as California attorney general before joining the Biden administration, is also seen as a potential contender. Many of the current or potential candidates would likely stand aside if Harris entered the race. TRUMP SUPPORTING CALIFORNIA SHERIFF LAUNCHES 2026 CAMPAIGN FOR GOVERNOR Among the Republicans, longtime Trump loyalist Richard Grenell, who is serving as U.S. envoy for special missions in the president's second administration, last month floated a potential bid for California governor if Harris also runs. \"If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it's a new day in California and that the Republican actually has a shot,\" Grenell said. Meanwhile, Riverside County Sheriff Chad Bianco last month announced his Republican candidacy for governor. Additionally, former Fox News Channel host and conservative commentator Steve Hilton is considering a GOP gubernatorial bid. CLICK HERE TO GET THE FOX NEWS APP In California, unlike most other states, the top two finishers in a primary, regardless of party affiliation, advance to the general election. It has been nearly two decades since a Republican won statewide office in California, back to former Gov. Arnold Schwarzenegger's 2006 re-election victory.","summary":"Former Vice President Kamala Harris is setting a timetable to make a major decision about her political future, but will she run in 2026 to succeed California Gov. Gavin Newsom or seek the White House again in 2028?","url":"https://www.foxnews.com/politics/kamala-harris-reveals-timetable-making-major-political-decision-deep-blue-state","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/harris-rally-atlanta-civic-center1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 16:54:20","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":-0.035},{"id":297833210,"title":"Major network responds defiantly to Trump’s lawsuit: Bring it on!","text":"CBS News’s parent company is turning up the heat on the lawsuit President Donald Trump filed over its “60 Minutes” interview with then-Vice President Kamala Harris. \n\nTrump alleged that the “60 Minutes” interview—which he declined to participate in—was doctored and deceitful to give an advantage to his Democratic opponent. Editing and cutting down interviews is common practice for broadcasters, but Trump claims that CBS News wanted to favor Harris. \n\nParamount, CBS’s parent company, filed two motions on Thursday asking a federal judge in the U.S. District Court in the Northern District of Texas to dismiss an amended complaint brought by Trump in October. Lawyers for Paramount are asking the judge to dismiss the lawsuit over a lack of jurisdiction and a failure to state a claim. \n\n“This lawsuit is an affront to the First Amendment and is without basis in law or fact. Plaintiffs President Donald J. Trump and Representative Ronny Jackson, public officials at the highest ranks of our government, seek to punish a news organization for constitutionally protected editorial judgments they do not like,” the attorneys wrote.\n\n“They not only ask for $20 billion in damages but also seek an order directing how a news organization may exercise its editorial judgment in the future. The First Amendment stands resolutely against these demands,” they added. \n\nIn the motion to dismiss the case over a lack of jurisdiction and an improper venue, the attorneys asked the judge to transfer the case to the Southern District of New York. \n\nEd Paltzik, an attorney for Trump, told Axios that they will not be backing down. \n\n“President Trump is committed to holding those who traffic in fake news, hoaxes and lies to account. CBS and Paramount committed the worst kind of election interference and fraud in the closing days of the most important presidential election in history. President Trump will pursue this vital matter to its just and rightful conclusion,” he said in the statement. \n\nTrump has repeatedly railed against CBS and called on the broadcaster last month to lose its license. \n\n“CBS and 60 Minutes defrauded the public by doing something which has never, to this extent, been seen before. They 100% removed Kamala’s horrible election changing answers to questions, and replaced them with completely different, and far better, answers, taken from another part of the interview,” he wrote in a February Truth Social post. \n\n“This was Election changing ‘stuff,’ Election Interference and, quite simply, Election Fraud at a level never seen before. CBS should lose its license, and the cheaters at 60 Minutes should all be thrown out, and this disreputable “NEWS” show should be immediately terminated,” he added.\n\nCBS News has continued to deny Trump’s allegations, calling them “false” in a statement last fall. \n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"“This lawsuit is an affront to the First Amendment and is without basis in law or fact.\"","url":"https://www.nj.com/politics/2025/03/major-network-responds-defiantly-to-trumps-lawsuit-bring-it-on.html","image":"https://www.nj.com/resizer/v2/PSQQXZPG5BABNO56LD6TWXJOJ4.jpg?auth=16aedfc56ba894797f526b7b8e59e43bc81e62c5bb90789abcdcf34e708d2726&width=1280&quality=90","video":null,"publish_date":"2025-03-07 16:33:09","author":"Lauren Sforza","authors":["Lauren Sforza"],"language":"en","category":"politics","source_country":"us","sentiment":-0.484},{"id":297806682,"title":"Reagan National Airport implements changes to ATC staffing after Potomac plane crash","text":"The National Transportation Safety Board considered irregular staffing on the night of the accident to be a factor, and since then, staffing rules at the airport have been tightened.\n\nThe Federal Aviation Administration will now have a stand-alone official more consistently monitoring only helicopter traffic in the area, a policy change that will require higher-level approval. Using a stand-alone controller for helicopter traffic has been in place for about a decade and allows air traffic control officials to focus solely on helicopter traffic rather than split their attention between planes and helicopters.\n\nOn the night of the Potomac plane crash, one air traffic controller was responsible for plane and helicopter traffic. The responsibilities were combined an hour earlier in a practice called an “early shove,” which is used when air traffic is light.\n\nThe practice was used during a near-miss of former Vice President Kamala Harris’s helicopter and an American Airlines plane mistakenly cleared for takeoff in 2021.\n\n“Certainly, it’s an extra set of eyes, but for this one, we have to see: Would it have made a difference?” NTSB Chairwoman Jennifer Homendy said in an interview. “That’s something we will be looking at as part of our investigation.”\n\nRetired pilot and aviation expert Richard Levy told Fox 5 that he approved of the change.\n\n“The decision to separate helicopter traffic from the control of the take-off and landing at DCA is a good, safe decision, in my opinion,” Levy said. “I think that when there is any kind of heavy traffic, that’s basically common sense from early morning hours from 6 to 7 a.m. to about 10 p.m. local, you should have two controllers, one working helicopter traffic if there is any, and one controller of course working the take-off and landings.”\n\nOther changes have been enacted at the airport, including a possible permanent flight ban for helicopters near DCA to prevent such a tragedy from happening again. Rep. Don Beyer (D-VA), who represents the district that DCA is inside of, has suggested that helicopter flights should be distanced from the airport.\n\n“Why do the training flights have to be that close to the airport? We know sadly they might one day have to get the president out of town, but let’s go train up the river or down the river when the planes are much higher,” Beyer said.\n\nTransportation Secretary Sean Duffy questioned the air traffic control practices at DCA around the time of the crash and said he’s focusing his efforts on making flying safer in the area.\n\n“How did they get the authority? And we’re going to pull back that authority to make sure that we have the right policies in place inside our towers to make sure that when you fly, you’re safe,” he said at a Feb. 5 event.\n\nThe NTSB is expected to issue a preliminary report on the accident this month.","summary":"A fatal crash between an American Airlines flight and a military helicopter in late January prompted leadership to change staffing protocols at the Ronald Reagan Washington National Airport. The collision, which killed 67 people and is one of the worst air crashes in recent U.S. history, rocked Washington, D.C., and resulted in concrete changes to [&#8230;]","url":"https://www.washingtonexaminer.com/travel/3340600/reagan-airport-changes-air-traffic-control-staffing-potomac-plane-crash/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2023/12/istock-942477232-scaled.jpg","video":null,"publish_date":"2025-03-07 16:32:20","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.172},{"id":297807346,"title":"Paramount files motion to dismiss Trump's CBS lawsuit, calls it 'an affront to the First Amendment'","text":"Paramount Global filed a motion to dismiss President Trump's $20 billion lawsuit on Thursday, hoping to end his high-stakes legal battle against CBS News. Trump has alleged election interference over CBS' handling of a \"60 Minutes\" interview, and feels the network aided his Democrat rival, then-Vice President Kamala Harris, through deceptive editing one month before they faced off in the presidential election. According to court documents reviewed by Fox News Digital, Paramount argued the lawsuit was wrongly filed by Trump's legal team in the U.S. District Court in the Northern District of Texas, despite the fact that neither Paramount nor CBS News are located in the Lone Star state nor did any production of the \"60 Minutes\" interview at the center of the lawsuit have any affiliation with the state. \"First, none of the Defendants is subject to personal jurisdiction in Texas on these claims. CBS Broadcasting Inc. is a New York corporation, CBS Interactive Inc. and Paramount Global are Delaware corporations, and all three have their principal place of business in New York,\" the filing states. \"Accordingly, general jurisdiction does not lie. Specific jurisdiction also does not lie. Defendants did not purposefully direct their suit-related conduct at Texas more than other states: The interview of Vice President Kamala Harris, excerpts of which aired on Face the Nation and 60 Minutes, was not filmed, edited, or produced in Texas, nor was Texas in any way the subject of the interview. If this district has personal jurisdiction merely because CBS programs are broadcast nationwide, so too does every district court in the country. That is not the law,\" it continues. TRUMP AND PARAMOUNT SEEKING MEDIATOR, FUELING SETTLEMENT CHATTER IN CBS NEWS LAWSUIT \"Second, the Northern District of Texas is not a proper venue under 28 U.S.C. § 1391(b). There can be no dispute that this case could have been brought in the Southern District of New York. And Plaintiffs do not allege nor could they that a substantial part of the events or omissions giving rise to this claim occurred in Texas,\" the filing continued. \"Third, even if the Court were to find that the exercise of jurisdiction is appropriate and that this district is a proper venue, the private interest and public interest factors overwhelmingly support transfer to the Southern District of New York under 28 U.S.C. § 1404(a). Among other relevant considerations, the evidence and witnesses are in New York, such that litigating there would be far more convenient for the parties, and New York has strong policy interests in regulating the conduct of its citizens and media,\" it stated. In a separate filing, Paramount argued Trump's lawsuit is \"an affront to the First Amendment and is without basis in law or fact,\" seeking to \"punish a news organization for constitutionally protected editorial judgments they do not like.\" \"They not only ask for $20 billion in damages but also seek an order directing how a news organization may exercise its editorial judgment in the future,\" the filing states. \"If the First Amendment means anything, it means that public officials like Plaintiffs cannot hold news organizations like CBS liable for the simple exercise of editorial judgment… Whether Plaintiffs believe the entire unedited Interview should have aired or only edited in a way they approve, they are not entitled under the First Amendment to demand only news that fits their wishes.\" However, Trump's legal team remains confident. \"President Trump is committed to holding those who traffic in fake news, hoaxes, and lies to account,\" Trump attorney Ed Paltzik told Fox News Digital in a statement. \"CBS and Paramount committed the worst kind of election interference and fraud in the closing days of the most important presidential election in history,\" Paltzik added. \"President Trump will pursue this vital matter to its just and rightful conclusion.\" CBS NEWS REMAINS ‘ADRIFT' AS NETWORK MARRED IN CONTROVERSY, RATINGS WOES The filing comes just days after Fox News Digital confirmed that both President Trump and Paramount were seeking a mediator, further fueling speculation that both parties would settle his $20 billion lawsuit. The lawsuit stems from a \"60 Minutes\" interview with then-Vice President Kamala Harris, when she appeared to answer the same question with two different answers in a preview clip that aired on \"Face the Nation\" and in the exchange that aired during the primetime special. In the preview clip, Harris was asked by \"60 Minutes\" correspondent Bill Whitaker why it seemed like Israeli Prime Minister Benjamin Netanyahu wasn’t listening to the U.S. \"Well, Bill, the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by, or a result of, many things, including our advocacy for what needs to happen in the region,\" Harris responded in the \"Face the Nation\" clip. Harris was mocked by conservatives for offering a lengthy \"word salad\" to Whitaker. But when that same question aired the following night in the primetime election special, a shorter, more focused answer from the vice president followed. \"We are not going to stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end,\" Harris said in the special. TRUMP AMPS UP THE PRESSURE ON CBS WITH MASSIVE DISCOVERY DEMAND AS '60 MINUTES' LAWSUIT MOVES FORWARD Critics accused CBS News of editing Harris' \"word salad\" answer to shield her from further backlash. Trump's lawsuit accuses the network of election interference. FCC Chair Brendan Carr ordered CBS News to hand over the unedited transcript and footage as part of its investigation into whether the network violated the FCC's \"news distortion\" policy after a complaint was filed. The FCC released the transcript, which showed CBS News had aired only the first half of Harris' response to Whitaker's question on \"Face the Nation\" and aired only the second half of her response during the primetime special. \"Well, Bill, the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by, or a result of many things, including our advocacy for what needs to happen in the region. And we're not going to stop doing that. We are not going to stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end,\" Harris responded, according to the unedited transcript. CLICK HERE TO GET THE FOX NEWS APP CBS parent company Paramount Global is reportedly considering settling the suit ahead of a planned merger with Skydance Media in hopes of preventing potential retribution by Trump's FCC, which has the authority to halt the multibillion-dollar transaction. Shari Redstone, Paramount’s controlling shareholder, is reportedly in favor of settling with the president. A settlement from Paramount would be the latest in Trump's string of legal victories as he reached multimillion-dollar settlements with ABC News, Meta and X.","summary":"CBS News and its parent company Paramount Global filed a motion to dismiss President Trump&apos;s lawsuit, hoping to end his high-stakes legal battle that could cost the company big money.","url":"https://www.foxnews.com/media/paramount-files-motion-dismiss-trumps-cbs-lawsuit-affront-first-amendment","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/trump-harris-cbs.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-07 16:31:54","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.579},{"id":297802840,"title":"Electoral College Change Proposed by Republicans","text":"Nebraska Republican state Senator Loren Lippincott has introduced legislation that would switch the state to a winner-takes-all system for its Electoral College votes during presidential elections, as in almost all other states in the union.Newsweek reached out to Lippincott via Facebook for comment on Friday outside of regular office hours.Why It MattersCurrently, Nebraska is divided for presidential elections between its three congressional districts. One Electoral College vote goes to whichever candidate wins each district, with another two going to the overall state winner, for a total of five.Changing to a winner-takes-all system would likely benefit the GOP, which consistently wins presidential elections in Nebraska statewide but has lost one of the three districts in the last two contests.What To KnowLippincott introduced his proposal, Legislative Bill 3, at the beginning of this year. It would award all five of Nebraska's Electoral College votes to the overall state winner if passed.In both the 2020 and 2024 presidential elections, the Democratic candidates, Joe Biden and Kamala Harris, respectively, won Nebraska's second congressional district, which includes the Omaha-Council Bluffs metropolitan area.This gave them both one of Nebraska's five Electoral College votes, despite their overall losses to Donald Trump of 39 percent to 58 percent and 38 percent to 59 percent, respectively.According to the most recent voter registration statistics, registered Republicans outnumbered registered Democrats in Nebraska by nearly two to one on January 1.Lippincott's legislation will be discussed next week during an executive session of the Senate Government, Military and Veterans Affairs Committee, according to the Omaha World-Herald.The proposal has been endorsed by President Trump, who backed a bid to transition Nebraska to a winner-takes-all Electoral College system for presidential elections before the 2024 contest. However, this failed due to opposition from Democrats and Republican state Senator Mike McDonnell.Maine is the only other state to divide itself up for Electoral College votes, and consequently, in 2024, Trump was able to win one out of four of its votes despite losing overall. Maine Public Radio reports that Democrats in the state are threatening that if Nebraska moves to a winner-takes-all system, so will they, in a move that could benefit the party.What People Are SayingNebraska state Senator Loren Lippincott, in an email sent to supporters on Thursday: \"The President's Number One priority here in Nebraska is passing LB3, which would restore Winner Take All and unify and strengthen Nebraska's voice in presidential elections.\"Lippincott told the Nebraska Examiner in January that his proposal would give farmers a \"voice.\" Over 90 percent of the state's land is occupied by farms and ranches. He commented: \"We do not want to be drowned out by population centers. This is America. America for the most part is an agricultural country.\"State Senator Dunixi Guereca, a Democrat representing Omaha, argued that Lippincott's proposal would be \"silencing a set of voices,\" adding that the state does \"things our way.\"What Happens NextIf Lippincott's bill is passed into law it would give Republicans a good chance of picking up all five of Nebraska's Electoral College votes in 2028. However if Democratic dominated Maine makes a similar move the two could cancel each other out.","summary":"The move could cost the Democratic presidential candidate one Electoral College vote in 2028.","url":"https://www.newsweek.com/nebraska-electoral-college-change-republicans-2041200","image":"https://d.newsweek.com/en/full/2602516/white-house.jpg","video":null,"publish_date":"2025-03-07 16:21:48","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.216},{"id":297791614,"title":"Kamala Harris sets deadline for decision on her political future: report","text":"Unemployed former Vice President Kamala Harris has apparently given herself a deadline to decide whether she’ll relaunch yet another political campaign — this time for the governor of California. \n\nThe failed 2024 presidential candidate has reportedly been mulling whether to launch a 2026 California gubernatorial run in a bid to succeed a termed-out Gov. Gavin Newsom.\n\nShe is slated to make a final decision on her next move by the end of the summer, Politico reported Friday, citing two people familiar with her plans.\n\nHarris, 60, has laid out the apparent timeline on a potential gubernatorial bid in calls to supporters, allies and aides over the last few weeks, the sources said. \n\n“I hope she does. I have already raised my hand to endorse her, if she does,” State Attorney General Rob Bonta said of the ex-veep’s potential gubernatorial campaign. \n\n“But I think only Kamala Harris knows the answer.”\n\nIt follows reports that Harris has been instructing allies to keep her options open for a potential political comeback, spurring speculation of a repeat bid for the presidency in 2028 — despite her recent crushing defeat against President Trump.\n\nShe told confidants late last year that she is “staying in the fight,” multiple sources told Politico at the time. \n\nIf Harris were to win the race to be the Golden State’s next governor, allies have indicated it would likely eradicate any looming plans for yet another presidential bid. \n\nNewsom, for his part, is term-limited at the end of 2025 and won’t be able to run again for the Golden State governorship. \n\nHe hasn’t yet indicated whether he will throw his hat in the ring for the 2028 presidential race.\n\nMeanwhile, the speculation about Harris’ future comes just weeks after she inked a deal with Creative Artists Agency — the same Hollywood powerhouse that reps ex-President Joe Biden and Barack and Michelle Obama’s film and TV production company.\n\nThe agency, known in the entertainment world as CAA, will help her score book deals, speaking gigs and possible film projects.","summary":"Harris, 60, has laid out the apparent timeline on a potential gubernatorial bid in calls to supporters, allies and aides over the last few weeks, the sources said.","url":"https://nypost.com/2025/03/07/us-news/kamala-harris-to-decide-whether-shell-run-for-cali-gov/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/99946403.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/6ROepU3R-RyIcpnTz.mp4","publish_date":"2025-03-07 16:17:08","author":"Emily Crane","authors":["Emily Crane"],"language":"en","category":"politics","source_country":"us","sentiment":0.034},{"id":297809934,"title":"‘This is a complete betrayal of the middle class’: Democrats rail against Trump’s plans for Medicaid","text":"Although Donald Trump’s address to a turbulent and bitterly divided Congress on Tuesday night lasted as long a Premier League soccer match plus stoppage time, he scarcely touched on the issue of his administration’s plans for Medicaid. \n\nThe Democrats were quick to remind him of its presence, so much so that one veteran representative, Al Green, made history after he was removed from the chamber by the sergeant-at-arms for continually heckling the US president about the issue. “You don’t have a mandate to cut Medicaid,” Green shouted repeatedly at Trump, his voice drowned out by boos from the Republican side of house.\n\nGreen left the room, but the issue he raised will not go away quietly. On the eve of Trump’s address, a request for information was issued to the Congressional Budget Office (CBO) director Phillip Swagel by Pennsylvania Democrat congressman Brendan Boyle, a ranking member of the House budget committee, and Frank Pallone, his New Jersey party colleague who sits on the energy and commerce committee.\n\nThey sought clarity on the implications of cutting a planned $880 billion (€811 billion) over the next decade in the Republican budget resolution. \n\nTheir analysis of the response led to their conclusion that if Medicare, Medicaid and the Children’s Health Insurance Programme are, as promised, left untouched, then $381 billion becomes available and from that, only $135 billion can be targeted for potential cuts – far short of the $880 billion sought. \n\n“This analysis from the non-partisan CBO confirms what we’ve been saying all along: Republicans are lying about their budget,” congressman Boyle said in a statement. \n\n“Their plan would force the largest Medicaid cuts in American history – all to pay for more tax giveaways to billionaires. This is a complete betrayal of the middle class, and Democrats will keep fighting to stop them. \n\n“The American people deserve to know just how much pain Republicans are willing to inflict on their own constituents to reward their billionaire donors.”\n\nThe issue gets to the heart of Trump’s spoken desire for “one big, beautiful bill” designed to achieve the ambition of chopping a total figure of $1.5 trillion in spending over the next decade. \n\nLate last month, the framework for the budget bill narrowly passed through the House on a vote of 217-213. Every Democrat representative voted against it. Thomas Massie of Kentucky was the lone Republican to join them in voting it down, arguing that “even under the rosiest of scenarios” the framework will end up increasing the national federal debt by hundreds of billions a year.\n\n“The only way they get to this magic thing where it’s not going to kill our country is that five years from now they imagine 2.5 per cent growth accumulates,” Massie said immediately after that vote.\n\nBut Trump is adamant that the spending cuts can be achieved through the elimination of fraud and wasted spending, which has led to Elon Musk’s startling arrival on the Washington political scene. \n\nAsked about the issue at his first cabinet meeting last month, the day after the budget resolution was passed, Trump replied: “I have said it so many times you shouldn’t be asking me that question ... We’re not gonna touch it. Now we are going to look for fraud. I’m sure you are okay with that – people who shouldn’t be on; people that are illegal aliens and others, and that’s with social security. When you see people that are 200 years old that are being sent cheques for social security – we are chasing that down and I’ve a feeling that Pam [Bondi, the attorney general] is going to do a very good job with that. But you’ve a lot of fraud. But, no, we’re not doing anything.”\n\nMedicaid, has, since its inception during Lyndon Johnson’s administration, come to provide healthcare for 82 million Americans categorised as low-income. Within two decades, all states had joined the programme – Arizona was the last, in 1982.\n\nDuring his last state of the union address a year ago, Joe Biden, then president, had one of his more memorable moments by taking the Republican side of the House to task over the budget blueprint they had set out in the election year.\n\n“If anyone here tries to cut social security, Medicare or raise the retirement age, I will stop you. The working people who built this country paid more into social security than millionaires and billionaires do. It’s not fair.”\n\nThe Republican budget plan allows for $4.5 trillion in tax cuts as well as increasing defence spending. And the basic maths and rationale as to how they will lower taxes while preserving public welfare programmes are coming under harsher scrutiny from the Democratic opposition. \n\nLast month the Musk-created Department of Government Efficiency (DOGE) accessed the data systems for the Centers for Medicare and Medicaid Services, the beginning of its effort to identify the errant spending that has become central to the Trump administration’s fiscal policy. The Democrats are adamant it marks the beginning of the end for aid that tens of millions of Americans rely upon.\n\nOn Thursday, Tim Walz, Minnesota governor and Kamala Harris’s running mate in last year’s presidential election, said: “Donald Trump’s cuts to Medicaid will blow a massive hole in our state budget and leave thousands without care. \n\n“There’s a storm coming from Washington.”\n\nRepublicans are adamant that all of this is just fearmongering from a Democratic movement that has lost its bearings and its message. Democrats are insistent that the Republican budget marks the beginning of the end of a crucial welfare health programme – and the beginning of a privatised replacement. Time will tell and the argument will grow louder.","summary":"Republican budget marks the beginning of the end of a crucial welfare health programme, say Democrats","url":"https://www.irishtimes.com/world/us/2025/03/07/they-would-force-the-largest-medicaid-cuts-in-us-history-to-pay-for-tax-cuts-for-billionaires/","image":"https://www.irishtimes.com/resizer/v2/6DMFT5W4AZVMZGXSR7KHRFTZDI.jpg?auth=620340b6a4750f8279ff8340d47e8df6aac0a13607b9c630cf7c8469ad2d97aa&smart=true&width=1600&height=900","video":null,"publish_date":"2025-03-07 16:06:47","author":"Keith Duggan","authors":["Keith Duggan"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.485},{"id":297791590,"title":"Tim Walz stumped when questioned on who leads the Democratic party","text":"Failed vice presidential nominee Tim Walz was left visibly stumped when asked who is in charge of the Democrats.\n\nThe Minnesota governor appeared to struggle when CNN’s Kasie Hunt asked bluntly: “Who do you think the leader of the Democratic Party is right now?” \n\nWalz, 60, went silent and stared blankly ahead for several seconds before bumbling with a small laugh: “I think the voting public, right now, is what I would say.”\n\n“We’re not going to have a charismatic leader ride in and save us from this,” he conceded of his struggling party.\n\nLater, Walz was asked if he believed his former running mate, Kamala Harris, could be a future leader.\n\n“I certainly think she could be,” he responded. \n\nHis awkward interview came just days after he signaled he would “certainly consider” running for president in 2028 — despite his crushing defeat this past November.\n\n“Look, I never had an ambition to be president or vice president. I was honored to be asked,” he told “the New Yorker Radio Hour” on Sunday. \n\n“If I feel I can serve, I will. And if nationally, people are like, ‘Dude we tried you, and look how that worked out,’ I’m good with that.” \n\n“If I think I could offer something … I would certainly consider that,” he added.","summary":"The Minnesota governor appeared to struggle when he was asked the pointed question during a CNN interview this week.","url":"https://nypost.com/2025/03/07/us-news/tim-walz-stumped-when-questioned-on-who-leads-the-democratic-party/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/99939887.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/CbwRSDoe-RyIcpnTz.mp4","publish_date":"2025-03-07 16:02:43","author":"Emily Crane","authors":["Emily Crane"],"language":"en","category":"politics","source_country":"us","sentiment":-0.531},{"id":297796548,"title":"Why Queer People Are in the Midst of a Painful Social Media Migration","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nDespite worrying about the Trump administration’s flurry of anti-LGBTQ+ executive orders in recent weeks, Alan Gentry won’t be marching on Washington anytime soon. He’s been there and done that and, these days, generally prefers to save his IRL activism for local issues in his current hometown of Denver.\n\nBut that doesn’t mean he doesn’t care. Gentry is a gay man in his early 50s who gave all his donation money to Kamala Harris’ presidential campaign last year, and in the past month, he took another action in line with his values: He said goodbye to Facebook and Instagram. Gentry knows that one fewer account on the massive social media platforms won’t change the world. “[But] I can change how I work in the world,” he said, “and Mark Zuckerberg and Meta don’t deserve my time.”\n\nIt might feel like light-years, but in fact it was only two months ago that Meta’s CEO Mark Zuckerberg announced major changes to the company’s Hateful Conduct policy, “lifting restrictions on some topics that are part of mainstream discourse,” including “immigration, gender identity and gender.” These changes were presented by Meta as a return to a commitment to free expression and as allowing more speech on the platform.\n\nBut what that looks like in practice is that users on any Meta platform—which includes Facebook, Instagram, Threads, and WhatsApp—now have the “freedom” to describe anyone who identifies as transgender or gay as mentally ill and call for the exclusion of the LGBTQ+ community from the military, law enforcement, and teaching jobs. Users can even post content arguing for gender-based bans in significant areas of public life—often relating to the rights of trans women—including bathrooms, sports and sport leagues, health and support groups, and specific schools, as long as any of these views are based in religious beliefs.\n\nEven before the rules changed, anti-trans content in particular was pervasive across Meta’s platforms. Posts promoting so-called conversion therapy and “genocidal calls for the ‘eradication’ of trans people” were left untouched after being reported for violating Meta’s community standards, according to research by GLAAD. But, prior to Jan. 7, this type of content was at least defined as hate speech—which, according to Meta’s definition, meant “dehumanizing speech; statements of inferiority, expressions of contempt or disgust; cursing; and calls for exclusions”—and, as such, could be reported to moderators. Now users have a pass from Meta to say those things openly because that’s what’s in fashion right now.\n\nGentry put it bluntly: “Zuckerberg gave a road map to people on how to be hateful—you know, ‘You can call gay and trans people mentally ill, we’re going to allow that,’ ” he said. “ ‘Have at it.’ ”\n\nLosing protection from hate speech is a really big deal for LGBTQ+ users, who are already likely to experience more negative interactions online in general. As a result, many queer and trans people, as either a safeguard for their mental health or a small way of fighting back, are deleting their accounts. Since January, posts like “Delete all your Meta profiles,” “If you can stop using Meta, I highly recommend it,” and “Think I’m going to leave Facebook soon” have been active in LGBTQ+ subreddits, with people weighing the pros and cons of leaving and sharing their plans to move elsewhere.\n\n“This is the final straw for me … ~10-ish years of active social media and ~15 years of existence and my [F]acebook account is dead and gone,” wrote one user who identifies as trans. “Good f’ing riddance, but it’s a shame that the parting is on such sour terms.”\n\nAnother user, with the flair Ace-ly Genderqueer, wrote: “It’s a nightmare the grip Facebook/Meta has on the population. We need an alternative with the similar ability for groups and events. Open to any suggestions that I could try [to] convince family to connect on.”\n\nIt might be tempting to dismiss these changes as the free market at work, but for queer and trans people, this kind of forced digital migration has very real consequences. In a world that is increasingly hostile to us, social media platforms like Facebook have become a vital resource. Whether you’re seeking out queer-friendly medical care, information about local queer events, or just a place to be in community with other isolated queers, Facebook has been and still is the place to go. And not just for older people. “There’s a stereotype that young people don’t use Facebook, like it’s only for old people, but it’s just not really true,” said Megan Lim, an associate professor at the Burnet Institute who studies how LGBTQ+ youth use social media. “Facebook is still one of the most common social media sites that young people have.”\n\nIn particular, the Messenger app and Facebook Groups function as semiprivate safer spaces, digital retreats where we can shape our identities and learn about ourselves and what it means to be queer. It’s a source of real pain, grief even, that Meta has chosen to throw us under the bus by legitimizing discrimination against some of its most vulnerable users. But if queer folks are good at anything, it’s seeking out new places to make a home.\n\nBefore leaving Facebook and Instagram for good, Gentry joined Bluesky—which first gained popularity with queer and trans users when Twitter was bought by Elon Musk, became X, and was transformed into what many see as an “echo chamber amplifying right-leaning causes.” In a post about his decision to quit Meta, Gentry wrote that “these changes, during a time when LGBTQ+ rights are under attack … are a direct threat to marginalized communities and a failure of responsibility.”\n\nHe’s not the only one who feels that way.\n\n“As [a bisexual woman and a] partner of a trans man, I cannot for the life of me support a company whose hate speech policy allows people to insult someone’s gender identity and sexual orientation,” said Emma, another user who has decided to escape Zuck’s products and is encouraging others to do the same on Reddit. “Anyone could bully or make fun of my boyfriend on Facebook or Instagram just because he’s a trans man … I’m gonna permanently delete my Meta accounts and not look back.” Since calling it quits, she’s felt “relief, as well as joy, in finding safer digital spaces.”\n\nFor others, like Ari, who is from Poland, dumping Meta isn’t as easy. She uses Facebook, Messenger, and WhatsApp for her career in the media industry. “I couldn’t work without it,” she said. In her personal life, though, Ari has managed to scale back how much she uses Facebook. “It’s a shame because I think I lost some connection with the LGBTQ+ community [there].”\n\nSince she’s been using Facebook less, Ari has also been turning to Reddit and Bluesky, but she’s found those to be pretty U.S.–centric. “It’s a bit of an issue for me because I am European, and I have my European problems,” she said, referring to a lack of local content on other social media. Ari uses Facebook for information she can’t find elsewhere, including local knowledge about safe health care providers, which was fundamental for her transition.\n\n“Facebook gave me a lot of queer spaces; it was very important. In Poland, queer spaces are mainly still on Facebook. There are three main groups.” She still uses the platform to keep up to date with these groups and other LGBTQ+ organizations like Stonewall, even though she’s found “it’s nearly impossible to use Facebook right now” due to a rise in “weird, shitty content [and] a lot of hateful things.”\n\n“It was [about] safety for me,” Ari said. “I got a lot of info from [Facebook groups] because there were pinned posts and a lot of people just talking about their experiences, about their transition, their struggles. I could just truly feel that and not be alone in this.”\n\nTrying to replace an existing platform can be far more stressful than just setting up a new profile, especially when that platform has served a very specific purpose in your life. “There’s a lot of labor involved in actually looking for where those safe spaces are and where you can feel safe and comfortable, and are not necessarily being outed to everyone across your networks through participating there,” said Lim. “So there’s a lot of careful strategic work that has to happen.”\n\nFor Gentry, this is an opportunity to shrink his social media use more broadly. When TikTok was banned, he deleted the app and has since removed all Meta apps. “I’ve read three books since I got rid of TikTok,” he said. “I’ve gained so much more time.” But anyone who has tried a digital detox, even for just a few days, knows that it’s no picnic. “There are bars here in Denver that, you know, their only way of marketing is on Facebook,” he said. “I’m not going to be as connected to the LGBTQ+ community because that would be something that would show up on my feed. Now I have to go out and search for that information.\n\n“The other side of that coin, though, is that I find myself going to local gay-friendly media a lot more,” Gentry added.\n\nLooking on the bright side, Jennifer Marino, a senior research fellow at the University of Sydney, sees these changes as an opportunity for us to look for connection outside social media. “I don’t think fighting Facebook and trying to force them to change is necessarily as constructive as considering where else we can put community and where else we can do outreach,” they said.\n\nMoving our networks beyond social media may offer less anonymity and ease, but at least it doesn’t rely on tech billionaires deigning to grant us protection. For community leaders, this might look like founding an in-person queer support group; if you, like Ari, are searching for information about being queer, you might find it at your local LGBTQ+ center (if there is one), library, or even queer-friendly place of worship. “Search for what’s available in your area that could support you, because it’s not just in big cities anymore,” Marino said. “Not everywhere has something, but many places have more than you think.”\n\nThe ongoing migration might be painful, but it’s possibly for the best. Being free of Meta’s clutches gives us a chance to define our own community guidelines—to create ways of being together that are rooted in IRL camaraderie and solidarity and are available permanently, not just when a corporation endorses them. What’s not to “like” about that?","summary":"It turns out that moving on, even “just” online, isn’t so easy.","url":"https://slate.com/life/2025/03/meta-facebook-hate-speech-transgender-queer-delete-account.html?via=rss","image":"https://compote.slate.com/images/27ccd7c7-0b99-453a-9dea-55ce53cb0179.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-03-07 16:00:00","author":"Tom Sayers","authors":["Tom Sayers"],"language":"en","category":"politics","source_country":"US","sentiment":-0.211},{"id":297902176,"title":"DOGE job cuts bring pain to Trump heartland - Reuters","text":"PARKERSBURG, West Virginia, March 7 (Reuters) - Jennifer Piggott proudly hung a red-and-blue Trump campaign flag outside her one-story home during the November election race. Now, after she was abruptly fired from her civil service job, her days of supporting the president are over.\n\nPiggott is among more than 125 people dismissed in February from the Treasury Department's Bureau of Fiscal Service in Parkersburg, West Virginia, unsettling a community that voted overwhelmingly for Republican President Donald Trump.\n\nAdvertisement · Scroll to continue\n\n\"Nobody that I've talked to understood the devastation that having this administration in office would do to our lives,\" Piggott, 47, told Reuters in an interview, saying she would not have supported Trump if she knew then what she knows now.\n\n\"As much as I think that President Trump is doing wonderful things for the country in some regards, I don't understand this at all,\" she said.\n\nPiggott worked at BFS for five years and had recently been promoted. That promotion made her a target as the Trump administration began firing thousands of probationary federal workers - a group that includes new hires but also existing workers moving from one internal position to another.\n\nAdvertisement · Scroll to continue\n\nThe renunciation of allegiance to Trump by Piggott, a church-going conservative and three-time Trump voter, comes as political analysts are parsing early signs of a possible backlash in Republican strongholds where the government-slashing efforts of the president and his cost-cutting czar Elon Musk are beginning to be felt.\n\nA White House spokesman told Reuters that Trump had been given a popular mandate to overhaul the federal government to combat waste, fraud, and abuse. Trump edged out his opponent, Democratic former Vice President Kamala Harris, by 1.5 percentage points in the November contest.\n\n NEXT StayNext\n\nAbout ConnatixV567365 \nAbout ConnatixV567365 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\n\"The personal financial situation of every American is top of mind for the president, which is why he's working to cut regulations, reshore jobs, lower taxes, and make government more efficient,\" Harrison Fields added.\n\nThe Musk-led Department of Government Efficiency did not respond to requests for comment.\n\nSpokespeople for Riley Moore, who represents Parkersburg in the House of Representatives, and Senator Jim Justice did not respond to requests for comment. Senator Shelley Moore Capito told Reuters that while she understands the concerns some have about the DOGE cuts, she supports the Trump administration's efforts to \"right-size\" government.\n\nTrump spoke at length about eliminating unnecessary programs during his address to Congress on Tuesday but made no mention of the mass government firings that have roiled the country. So far 100,000 workers have been fired or taken a buyout.\n\nReuters/Ipsos polling shows Americans' attitudes toward Trump are so far essentially unchanged since he began firing federal workers in February. As of March 4, his approval rating was holding steady at 44%.\n\nWest Virginia is also strong Trump country. He won the state in November with 70% of the vote, among his biggest victories.\n\nStill, the economic impact of the mass dismissals across America may not be felt immediately.\n\nA handful of Republican voters who lost their federal jobs joined Democrats for a rally of more than 100 people protesting the cuts near the two BFS office buildings in Parkersburg last week, cheering on a local union leader as he criticized Trump and Musk while standing next to a large \"Fat Cat\" balloon.\n\nSupport for Trump's shrinking of government can, however, be heard in places around Parkersburg - a middle-aged couple singing DOGE's praises over breakfast at a local diner; a hotel patron saying remote workers deserved to be fired; a young bartender lamenting federal workers' relatively high pay.\n\nIn interviews with three dozen workers, business owners and politicians in Parkersburg, which sits at the convergence of two rivers including the mighty Ohio, nearly all said Trump's focus on cutting government spending was a worthy goal. But most said they knew BFS employees to be hard-working and didn't see them as the right target if the aim was to eliminate waste.\n\nScot Heckert, a Republican who represents parts of Parkersburg in the West Virginia state legislature, said he was worried that layoffs at BFS, which employs about 2,200 workers in Parkersburg, would \"devastate\" the local economy because the workers earned higher-than-average salaries, and because of the looming prospect of another round of cuts.\n\nHe said his daughter-in-law was among those fired and that he was seeking more information on why so many jobs were eliminated in a seemingly indiscriminate manner before he would commit to backing Trump in the future.\n\n\"People voted for Donald Trump to make a change,\" he added. \"It's an unfortunate thing in our community that is plagued with many things as it is.\"\n\nBUSINESS IMPACT\n\nTo the residents of Parkersburg, West Virginia's fourth-largest city with 29,000 people and the seat of Wood County, the cuts driven by Musk's DOGE feel like the latest in a series of economic blows.\n\nParkersburg has lost a third of its population over the past five decades, mirroring a hollowing out of manufacturing across the state. The glass producer Corning sold its Parkersburg factory in the 1990s, and in 2005 a major shovel plant buffeted by Chinese competition closed.\n\nBFS, which manages the federal government's accounting and payment systems, is a provider of stable, solid-paying jobs in Wood County, where the median household income is two-thirds the national average and 14% of the population lives below the poverty line.\n\nThe community is now bracing for another round of layoffs, with all government agencies ordered to make plans to cut career staff by March 13. That could mean hundreds more cut at BFS.\n\nBusiness owners in Parkersburg said they were worried that more job losses would ripple through the economy in the form of depressed spending on everything from clothing to rent.\n\nThe owners of the Blennerhassett Hotel, a fixture of downtown Parkersburg for more than 130 years with its turreted brick facade, have already told staff that seasonal hiring will be kept to a minimum for the usually busy summer months.\n\n\"It's a major economic disaster for our community,\" said co-owner Wayne Waldeck, likening the potential scale of the expected job cuts to another factory leaving town.\n\nParkersburg Brewing, a local bar and eatery, is also worried about a hit to demand. Roughly one-sixth of the brewery's 65 members, who pay an annual fee for a larger pour and other perks, work at BFS, manager Samantha Gibbs said.\n\n\"They have the extra money to come spend at places like this and give back to the community, and now a percentage of that is lost,\" she said. \"That's going to affect us tremendously.\"\n\nWest Virginia ranks third among the contiguous 48 states in the percentage of its total workforce — 3.7% — in federal jobs, Bureau of Labor Statistics data shows. That's about double the national average. Only Virginia and Maryland, the two states closest to Washington, are higher at 4.6% and 5.9%.\n\nJohn Deskins, an economics professor at West Virginia University, said he is worried about potential job losses at other large federal facilities in the state.\n\n\"We stand to suffer a disproportionate share when those jobs disappear, when that income disappears,\" he added.\n\nVETERANS CAUGHT IN LAYOFFS\n\nRoger Conley is a Trump supporter who left the Republican Party last year because he thought it was too liberal. In a Facebook post before BFS workers were cut, Conley said DOGE was acting like any successful business in boosting efficiency and wondered why anyone would question its moves to lower costs.\n\nThen his son lost his job at BFS, according to union members.\n\nIn a February 20 Facebook post, Conley said while he still backed Trump, he questioned the need to fire so many people so quickly and whether Musk was the right person to lead the effort.\n\nWhen reached by phone, Conley declined to comment. His son did not respond to requests to be interviewed for this story.\n\nMeanwhile Piggott, who like other fired probationary employees received no severance, faces an uncertain future. She said she and her husband, a disabled military veteran, have been discussing ways to make ends meet including selling their home.\n\nShe teared up when talking about how many veterans, who make up about 30% of the federal workforce, had lost their jobs at BFS and other agencies.\n\nOne veteran caught up in the BFS layoffs was Chauncy James, who was promoted twice during his 18 months at BFS, the second time to building maintenance.\n\nJames, 42, said he too worries about making his mortgage payment and feeding his five children. At last week's rally he marched with a sign criticizing Musk and said he regretted voting for Trump.\n\n\"They are pretty much just coming here, chopping heads off, without really doing their homework,\" James said. \"He got elected president and he's doing a lot of things that people never even imagined that he was going to do to us.\"\n\nReporting by Nathan Layne and Aleksandra Michalska in Parkersburg, West Virginia; Editing by Ross Colvin and Pravin Char\n\nPurchase Licensing Rights","summary":"DOGE job cuts bring pain to Trump heartland  Reuters","url":"https://www.reuters.com/world/us/doge-job-cuts-shake-trump-voting-west-virginia-town-2025-03-07/","image":"https://www.reuters.com/resizer/v2/7AUS2AIEF5K35OA22WFVLRZJSQ.jpg?auth=4a2adc0406bff2dc0745d94a54b97ade80859ce80c6840ec852bf1bd567f65cc&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-03-07 15:51:06","author":"Aleksandra Michalska,Nathan Layne","authors":["Aleksandra Michalska","Nathan Layne"],"language":"en","source_country":"gb","sentiment":-0.007},{"id":297788044,"title":"Harris to decide whether to run for California governor by end of summer","text":"Washington — Former Vice President Kamala Harris will decide whether she will run for governor of California in 2026 by the end of summer, a person familiar with her decision-making process said. Term limits prevent current California Gov. Gavin Newsom from running again, and the election to replace him will take place next year. Politico first reported the timing on Harris' self-imposed deadline to decide whether to run. Candidates have until early March 2026 to file paperwork ahead of the June 2, 2026, primary. Another source familiar with Harris' thinking told CBS News that she is \"seriously considering\" a run for governor. A gubernatorial bid would likely mean she would not run for president in 2028, which she is also considering.The field to replace Newsom, who has been governor since 2019, is expected to be sizable, but Harris' entry into the race could dissuade other Democrats from launching bids of their own.A former Harris adviser said \"she'd be great,\" and has already proven she could lead at the national level and as California attorney general.\"On a national level, what Newsom has been able to do with that job, there is a lot of upside with what she can do as the governor of the fifth-largest economy with her name ID, when our party is looking for national leadership and California looking for good governance — especially at a time when California is going through a lot,\" the former adviser said. Harris, 60, has largely stayed out of the spotlight since her November loss to President Trump. Following the election, Harris and former second gentleman Doug Emhoff first headed back to California, while she took time to decide her next move. Her primary residence is in Los Angeles. As of January, multiple sources said she was expected to work on books about her time in politics and her interest in food and cooking. But discussions were already underway among her allies about a possible run for governor. In California primaries, all candidates for office are listed on the ballot, and the top two vote-getters, regardless of party, move on to the general election.","summary":"Former Vice President Kamala Harris will decide whether she will run for governor of California by the end of summer, a person familiar with her decision-making process said.","url":"https://www.cbsnews.com/news/kamala-harris-california-governor-summer/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/09/d4c8154c-f19b-4a3f-8a74-716e2a2a6165/thumbnail/1200x630/63696b4f2d4dc0182652f3da7e6f33e0/gettyimages-2182629592.jpg?v=63a2b43e2ef8917aa6bd547ca29dd4fa","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3480810_hls/master.m3u8","publish_date":"2025-03-07 15:42:00","author":"Fin Gómez,Kathryn Watson,Weijia Jiang","authors":["Fin Gómez","Kathryn Watson","Weijia Jiang"],"language":"en","category":"politics","source_country":"US","sentiment":0.049},{"id":297781508,"title":"ESPN will pay Stephen A. Smith $100 million to work less and talk more about politics","text":"ESPN has agreed with Stephen A. Smith on a new contract that will pay the bombastic sports commentator $100 million over five years and allow him to scale back his network appearances so he can focus more time talking about politics, The Athletic first reported this week.\n\nAn ESPN spokesperson initially declined to comment to The Independent on Smith’s contract. However, later on Friday morning, the network released a statement announcing it had signed Smith to a new deal — though financial terms were not revealed.\n\n“ESPN has agreed to a multi-year contract renewal with Featured Commentator/Executive Producer, First Take Stephen A. Smith,” the press release stated. “His deal keeps him as the fixture of First Take, ESPN’s weekday morning studio debate show. It also includes appearances across ESPN programming.”\n\n“I’m happy and honored to remain a member of the Disney/ESPN family for, at least, the next five years,” Smith said in the press release. “There’s only bigger and bigger things ahead. It starts with continuing to put in that work. See y’all soon.”\n\nESPN chairman Jimmy Pitaro also described Smith as “a difference maker” and that ESPN is “grateful he will remain at ESPN.”\n\nWhile Smith will continue to host his morning sports talk show First Take on the network, he will be less of a presence elsewhere across ESPN. This includes stepping back from his regular role on the network’s NBA pregame show, though he is expected to pop up periodically on some of ESPN’s other top-tier programming like Monday Night Football’s pregame. \n\nPrior to this new agreement, Smith had been a part of Countdown, the network’s most-watched NBA pregame program. However, after Warner Bros. Discovery lost its basketball programming, ESPN signed a deal with TNT to air its seminal Inside the NBA, which features Charles Barkley and Kenny Smith.\n\nThe lighter workload for more cash — Smith had previously been making $12 million a year — frees up the brash sports pundit to further focus his attentions beyond ESPN, which would appear to include his increasingly politics-driven podcast and potential political ambitions.\n\nIn recent months, and especially since Donald Trump’s electoral victory in November, Smith has grown more outspoken about hot-button culture war issues and political figures. Besides sounding off on his podcast about Kamala Harris’ failed presidential run and how much Democrats “suck,” Smith has regularly appeared on his close friend Sean Hannity’s Fox News program and other talk shows to pontificate about politics.\n\nIn fact, Smith’s foray into political punditry and vocal criticism of the Democratic Party — while still speaking out against Trump — has led to the sports commentator being floated as a possible 2028 Democratic presidential candidate, a notion that Smith has only fed into recently. “I can beat them all,” Smith boasted on The View this week.\n\nStill, not everyone is impressed with Smith dipping his toe into the world of national politics. “When it comes to sports, I find him to be really insightful,” veteran Democratic strategist James Carville complained last month. “When it comes to politics, he don’t know his a** from a hole in the ground.”\n\nAdditionally, Smith recently caught flak for his friendly sitdown with controversial far-right extremist Candace Owens, who has faced condemnation from both conservatives and liberals for peddling antisemitic tropes and outrageous conspiracy theories. At the same time, Smith did find a fan of his Owens interview in notorious white supremacist Nick Fuentes. “Stephen A. Smith had Candace Owens on. He’s clearly red-pilled,” Fuentes gleefully declared this week.\n\nSmith’s massive new contract and decreased responsibilities also come as ESPN’s parent company Disney just slashed roughly 200 jobs across ABC News, shuttered the political data analysis site FiveThirtyEight, and consolidated several of its news programs — leaving network staffers “crying and upset.” Furthermore, ESPN parted ways with over 20 of its top on-air talent last fall amid budget cuts.","summary":"ESPN has agreed with Stephen A. Smith on a new contract that will pay the bombastic sports commentator $100 million over five years and allow him to scale back his network appearances so he can focus more time talking about politics, The Athletic first reported this week.","url":"https://www.independent.co.uk/news/world/americas/us-politics/stephen-a-smith-espn-contract-b2711007.html","image":"https://static.independent.co.uk/2024/12/24/14/GettyImages-2185337080.jpg?width=1200","video":null,"publish_date":"2025-03-07 15:24:48","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","category":"politics","source_country":"gb","sentiment":0.02},{"id":297838008,"title":"Kamala Harris reportedly considering run for California governor","text":"Kamala Harris is considering a run to be governor of California and has given herself until the end of the summer to make a final decision, sources close to her have told Politico.\n\nThe former US vice-president has been weighing up a gubernatorial campaign in her home state as one option for remaining in the political arena since her presidential election defeat to Donald Trump last November.\n\nNow allies have told Politico that she is close to throwing her hat in the ring after she turned up at pre-Oscar parties last weekend in Los Angeles at which she reportedly rubbed shoulders with wealthy Democratic power brokers.\n\nThe party’s nomination for the governor’s candidacy in 2026 is up for grabs because term limits prevent the incumbent, Gavin Newsom, from running again.\n\nHarris has retained her tightly knit team of advisers since leaving the vice-presidency in January and attended a series of political events, repeatedly telling people: “I am staying in this fight,” according to Politico.\n\nHer name recognition in a state that has leaned Democrat in recent decades is likely to give her a head start and will probably drive other internal party candidates from the field, commentators say.\n\nA recent poll conducted for Emerson College Polling, Inside California Politics and the Hill showed 57% of voters prepared to vote for Harris as governor.\n\n“If [former] Vice-president Harris enters the Democratic primary, she would start as the clear favorite. Without Harris in the race, the primary is wide open,” Spencer Kimball, executive director of Emerson College Polling, told Newsweek.\n\nA decision to run for governor is likely to preclude the possibility of Harris embarking on a second presidential campaign in 2028, although she is said to be keeping that option open. Her aides have already assessed that the Democratic primary contest will be highly competitive, and may include Newsom, the current California governor.\n\nHarris, a former California attorney general, has already drawn support from the current holder of that post, Rob Bonta, who had previously been touted as a potential governor’s candidate.\n\n“Her name recognition, her favorables, her ability to run a successful campaign would have the impact of clearing the field on the Democratic side,” Bonta told Politico. “If anyone wants to stay in, will I tell them: ‘You should leave because she’s clearing the field?’ Absolutely not. They can run. I think they’ll lose, and I will support her.”","summary":"Former California attorney general weighing campaign for 2026 election in home state since defeat to Trump, allies say\n\nKamala Harris is considering a run to be governor of California and has given herself until the end of the summer to make a final decision, sources close to her have told Politico.\n\nThe former US vice-president has been weighing up a gubernatorial campaign in her home state as one option for remaining in the political arena since her presidential election defeat to Donald Trump last November.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/mar/07/kamala-harris-california-governor","image":"https://i.guim.co.uk/img/media/931e94aa365226dabdc6cc6abe80a63642e6e8c9/0_113_3413_2049/master/3413.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-03-07 15:11:55","author":"Robert Tait","authors":["Robert Tait"],"language":"en","category":"politics","source_country":"us","sentiment":-0.076},{"id":297798256,"title":"CBS Urges Judge to Dismiss Trump’s $20 Billion Lawsuit Over Alleged “Doctored” Interview","text":"Attorneys for CBS have asked a federal judge in Texas to dismiss a lawsuit filed by Donald Trump, arguing that the former president engaged in “naked forum-shopping” in an attempt to have his case heard by a judge potentially favorable to his claims.\n\nTrump’s Allegations Against CBS\n\nThe lawsuit, originally filed in November 2024, stems from an episode of 60 Minutes that aired in October 2024, featuring an interview with then-Vice President Kamala Harris. Trump’s legal team alleges that the footage was deceptively edited to manipulate public perception and unfairly favor Democrats, amounting to “unlawful election interference.”\n\nSeeking $20 billion in damages, the lawsuit was filed in the Northern District of Texas, Amarillo Division, where U.S. District Judge Matthew Kacsmaryk—a Trump-appointed judge known for his conservative rulings—presides as the lone federal judge.\n\nCBS Challenges Lawsuit’s Jurisdiction\n\nCBS and its parent company, Paramount Global, have challenged the lawsuit, arguing that Texas has no jurisdiction over the case because none of the alleged events occurred in the state.\n\n“President Trump knows well that he cannot simply select his preferred jurisdiction when that jurisdiction bears little or no relationship to the events giving rise to his claim,” states CBS’s 33-page motion to dismiss.\n\nThe network’s legal team emphasizes that:\n\n• Trump resides in Florida.\n\n• CBS and Paramount Global are based in New York.\n\n• The interview took place in Washington, D.C., was edited in New York, and was broadcast nationwide from New York.\n\nTrump Adds Texas Congressman to Strengthen Case\n\nAnticipating the jurisdictional challenge, Trump’s legal team recently amended the lawsuit to include Texas Rep. Ronny Jackson—a Republican from Amarillo and Trump’s former White House physician—as a co-plaintiff.\n\nThe amended complaint argues that Jackson, as a consumer of CBS’s content, has been “injured” by the alleged deceptive editing. However, CBS’s legal team is likely to challenge whether Jackson’s claim establishes legal standing strong enough to keep the lawsuit in Texas.\n\nWhat’s Next?\n\nWith CBS pushing for dismissal and Trump’s legal team working to keep the case in Amarillo, the lawsuit’s fate now rests in the hands of the Texas federal court. The judge’s decision could have major implications not only for Trump’s battle against the media but also for the broader debate over jurisdiction shopping in politically charged cases.\n\nAs the legal showdown unfolds, all eyes remain on the Texas courtroom to see if Trump’s lawsuit will move forward or be thrown out.","summary":"Attorneys for CBS have asked a federal judge in Texas to dismiss a lawsuit filed by Donald Trump, arguing that the former president engaged in “naked forum-shopping” in an attempt to have his case heard by a judge potentially favorable to his claims. Trump’s Allegations Against CBS The lawsuit, originally filed in November 2024, stems [&#8230;]","url":"https://publishedreporter.com/2025/03/07/cbs-urges-judge-to-dismiss-trumps-20-billion-lawsuit-over-alleged-doctored-interview/","image":"https://publishedreporter.com/wp-content/uploads/2025/03/IMG_3886.jpeg","video":null,"publish_date":"2025-03-07 15:00:09","author":"Aradhana Jha","authors":["Aradhana Jha"],"language":"en","category":"politics","source_country":"us","sentiment":-0.285},{"id":297763668,"title":"Donald Trump Issued Impeachment Warning","text":"Fox News host Laura Ingraham has warned that Democrats \"are already planning to impeach President Trump\" if they triumph at the November 2026 midterm elections.The conservative presenter made the comment on her The Ingraham Angle show on Thursday, during a discussion with Texas Republican Representative Brandon Gill.Newsweek contacted the Democratic Party for comment on Friday outside of regular office hours via its online inquiry form.Why It MattersDuring his first term in office, President Trump was impeached twice, once over claims he abused his power to pressure the Ukrainian government to investigate his domestic political opponents and the other following the January 6, 2021, Capitol Hill riot. In both cases the Senate failed to meet the two-thirds threshold for a guilty verdict, so he remained in office.Ahead of the 2024 presidential election both Democratic candidate Kamala Harris and Trump suggested their rival was a threat to American democracy. A third impeachment bid against Trump would dramatically raise political tensions in the U.S. with his supporters likely viewing it as an act of persecution.What to KnowReferring to the November 2026 elections on her show, Ingraham said that if \"these midterms don't go the right way … the Democrats are already planning to impeach President Trump. That is the truth.\"Investigations are going to start and they're going to go to town on y'all, on the Republican Party.\"A 26-second clip covering Ingraham's remarks was posted on X by the 'Acyn' account, which shares prominent footage related to American politics. It went viral on the platform receiving over 400,000 views and 2,200 likes.On February 5, House Democrat Al Green said he was planning to file articles of impeachment against Trump after the president held a press conference at the White House with Israeli Prime Minister Benjamin Netanyahu, during which he suggested the U.S. would \"take over\" Gaza and turn it into the \"Riviera of the Middle East\" while resettling the Palestinian population.Speaking on Tuesday after being ordered to leave Trump's address to a joint session of Congress for heckling, Green said: \"I'm working on my articles of impeachment.\" He added: \"This president is unfit. He should not hold the office—34 felony convictions, two times impeached.\"According to the U.S. Constitution the president can be removed from office by Congress if he is found to have engaged in \"treason, bribery, or other high crimes and misdemeanors.\"The House of Representatives can start impeachment proceedings against a president if this is supported by a simple majority of its members. This triggers an impeachment trial in the Senate. If two-thirds or more of the Senate vote to convict, the president is removed from office, though this has never happened in American history.In February 2020, Trump was acquitted on impeachment charges of abuse of power and obstruction of Congress as the Senate failed to reach the two-thirds threshold for a conviction. This followed claims he improperly threatened to withhold military aid from Ukraine unless the country investigated his political rivals.Trump was also acquitted of inciting insurrection in a separate impeachment trial which took place in February 2021, following the previous month's storming of Congress by his supporters after he contested Joe Biden's presidential election win. In total, 57 Senators voted to convict while 43 found him not guilty, meaning the two-thirds threshold was not met.What People Are SayingSpeaking to Newsweek about potential impeachment proceedings Harrison Fields, the White House deputy press secretary, said: \"The Democrats continue to waste their time on publicity stunts that go against the wishes of the American people. President Trump was elected in a historic landslide to deliver his America First agenda and keep the promises he made on the campaign trail—Democrats can either get on board or keep losing elections.\"In February Green said it is wrong to say it requires a criminal offense to impeach the president, commenting: \"Many people assume that means a statutory offense. It does not, and the word misdemeanor means misdeeds. Aside from some minor offense, misdeeds are those things that will shock your conscience, so a president can literally be impeached for shocking one's conscience.\"What Happens NextThe Republicans currently have a majority in both the House and Senate. Getting to a position where two-thirds of Senators would seriously consider impeachment after the 2026 midterm elections would be a tall order, and would almost certainly involve dramatic Democratic Party gains.","summary":"The President was impeached, but not convicted, twice during his first term in office.","url":"https://www.newsweek.com/donald-trump-issued-impeachment-warning-2041112","image":"https://d.newsweek.com/en/full/2602380/donald-trump.jpg","video":null,"publish_date":"2025-03-07 14:36:00","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.478},{"id":297769228,"title":"The story behind MSNBC's purge of its most progressive anchors","text":"At a time when the Democratic Party’s opposition to the ongoing right-wing authoritarian assault on US government is failing miserably (FAIR.org, 2/27/25), MSNBC’s recent purge means it is all the more unlikely that the cable news network will have any role in holding Democrats’ feet to the fire.\n\nThe news channel has nixed or demoted their most progressive anchors, all of whom are people of color. These are the hosts who have drawn the most ire from Donald Trump’s online warriors, according to Dave Zirin of The Nation (2/28/25). They are also some of the few who were willing to air the network’s rare criticism of Israel. In their stead, MSNBC has elevated Democratic Party apparatchiks and a center-right never-Trumper. This rightward shift reflects the reality that the channel’s corporate ownership has never cared for its left-of-center brand.\n\nThe network’s overhaul, led by its new president Rebecca Kutler, cancels Joy Reid’s ReidOut, Alex Wagner’s nighttime spot and Ayman Mohyeldin’s weekend evening show, with Reid fired, Wagner demoted and Mohyeldin’s voice diluted into a co-anchor position.\n\nThe ReidOut is getting replaced by a panel show consisting of Symone Sanders-Townsend, the former Biden and Harris advisor; Alicia Menendez, the daughter of disgraced ex-Sen. Bob Menendez; and Michael Steele, the former Republican National Committee chairperson, now a Democrat whose politics symbolize the Democratic Party’s disastrous fetish for centrist triangulation. Wagner’s 9 pm slot will now be anchored by Jen Psaki, another Biden alum.\n\nAs an indication of just how disruptive Kutler’s new vision for MSNBC is, even Rachel Maddow—the network’s biggest star with the most popular show—is getting a staff downsizing. The move seemed almost retaliatory, as it came after Maddow aired her grievances during one of her nightly shows (2/24/25). “Personally, I think it is a bad mistake to let [Reid] walk out the door,” Maddow said. “It is not my call and I understand that, but that’s what I think.” She added:\n\nIt is also unnerving to see that, on a network where we’ve got two, count ’em, two non-white hosts in primetime, both of our non-white hosts in prime time are losing their shows, as is Katie Phang on the weekend. And that feels worse than bad, no matter who replaces them. That feels indefensible, and I do not defend it.\n\nBucking the trend\n\nJoy Reid has had her disagreements with the left. Her ardent defense of Hillary Clinton’s 2016 presidential bid veered frequently into baseless accusations, online scolding of Bernie Sanders and promotion of the Russiagate conspiracy theory (FAIR.org, 9/3/16, 6/30/17, 8/24/16). Altogether, that contributed to Democrats’ refusal to conduct a true postmortem of the Clinton loss, the ramifications of which still aid Donald Trump’s dominance.\n\nBut during Joe Biden’s presidential tenure, Reid proved to be progressive, relative not just to MSNBC’s other anchors, but many in the corporate media writ large. As New York’s skies turned orange amid historic Canadian wildfires in the summer of 2023, for instance, Reid was one of the few who called out the role of fossil fuels (FAIR.org, 7/18/23).\n\nWhile other outlets were overemphasizing the inflationary impact of President Biden’s paradigm-shifting economic stimulus in the wake of the Covid pandemic, Reid bucked the trend, drawing the ire of right-wing media (FAIR.org, 7/13/23).\n\nPerhaps most notably, Reid was an outlier in her coverage of Israel’s war on Gaza and its backlash in the US. A FAIR study (8/15/24) found that Reid’s show was the only weekday news program studied to feature students expressing pro-Palestinian sentiment during coverage of the student Gaza solidarity encampments that cropped up at college campuses across the country last spring. The same study found that her show was the only one studied to have mentioned the words “divestment” and “police violence” more than “antisemitism” in relation to the encampments.\n\nSimilarly, as outlets like the New York Times provided Israel cover for its bombing of the densely-populated Jabalia refugee camp that killed and wounded 400 Palestinians, Reid questioned how Israel could justify such a disproportionate attack (FAIR.org, 11/15/23).\n\nThe panel of Sanders-Townsend, Menendez and Steele promises none of that nonconformity. Instead, they represent MSNBC’s decision to represent an even smaller sliver of the Democratic elite. By elevating the former Biden and Harris advisor Sanders-Townsend, MSNBC has empowered someone with an interest in defending the current Democratic guard’s rule.\n\nThe Lincoln Project–affiliated Steele similarly owes his ascendancy to the sort of Democratic group-think that spurred Kamala Harris’s ruinous gun-touting, Cheney-approved centrist presidential bid. Expect Hakeem Jeffries praise.\n\nPointing out hypocrisy\n\nThough not fired, Mohyeldin and Wagner are two more MSNBC figures who have elevated criticism of Israel and are now facing a demotion. Following ex-Secretary of State Antony Blinken’s finding that Sudanese military forces had committed genocide against the Sudanese people, Mohyeldin (MSNBC, 1/13/25) took to the airwaves to point out Blinken’s hypocrisy:\n\nThe horrific atrocities committed against the Sudanese should be labeled as genocide. But Blinken’s declaration begs the question: Why is the US unable to apply that same standard to Israel?If the Biden administration is calling out the famine in Sudan, why not also address the ongoing famine in Gaza, which has been condemned by independent experts from the United Nations?\n\nAfter New York Mayor Eric Adams sicced the NYPD on Columbia and CUNY students who had erected Gaza solidarity encampments, Wagner (5/1/24) brought on Jelani Cobb, the dean of the Columbia School of Journalism, and CUNY journalism professor (and MSNBC contributor) Peter Beinart, a well-known critic of Israel. During the show, Wagner said she agreed with Beinart that it’s “probably a good thing for our national discourse” if the encampment movement is remembered in history as a turning point for debate about US support for Israel. She also suggested that common misrepresentations of the student protestors as treasonous were a “cudgel” to distract from the issue of US foreign policy towards Israel.\n\nMouthpiece for elite interests\n\nWagner’s replacement is Jen Psaki. No one is more qualified to execute MSNBC’s crusade to become nothing more than a mouthpiece for elite Democratic interests. As Julia Rock wrote in Jacobin (5/13/22) when Biden’s former press secretary left the administration for her first MSNBC gig:\n\nThe skills required to act as a press secretary in corporate Democratic presidencies—saying little of substance, committing to nothing, dispensing snark and scoffs, and never even accidentally challenging power—appear to carry over well to playing pundit on MSNBC, the corporate network that serves as the Democratic Party’s de facto propaganda outfit.\n\nAs press secretary, Psaki was known for insensitive and condescending quips in response to the public’s desire for good things. After the Democrats’ John R. Lewis Act, which would have enacted broad voting rights reforms, failed to pass the Senate in January 2022, Psaki suggested the public “go to a kickboxing class” or “have a margarita” to rejuvenate their spirits (Business Insider, 1/21/22).\n\nThen there was the time when Psaki got short with NPR national political correspondent Mara Liasson in response to her question asking why the United States, unlike other wealthy nations, couldn’t distribute free Covid-19 test kits to every US household (Jacobin, 12/8/21). Psaki, suggesting the best way to provide tests was Biden’s convoluted plan for reimbursements through private insurance, asked Liasson, “Should we just send one to every American?” Feigning ignorance, she continued, “Then what happens if every American has one test? How much does that cost, and then what happens after that?”\n\nPsaki’s knack for subduing the electorate’s impulse for government to meet their needs will serve MSNBC’s priorities well. Add to that her gig as a “crisis consultant” (Jacobin, 3/20/21) for the Israeli AI facial recognition startup formerly known as AnyVision, whose services were used to surveil Palestinians in the West Bank (NBC, 10/28/19), as well as her consultancy for the ride sharing giant Lyft (Business Insider, 4/1/22), and it’s no wonder she got the primetime 9pm slot.\n\nIdeological thrashing\n\nMSNBC’s rightward tack may come as a surprise to those who think it was born fully formed as Fox News’ liberal opposite. But its ideological thrashing over the years—oscillating between right-wing pundits like Laura Ingraham, Tucker Carlson and Michael Savage, and liberals like Phil Donahue and Keith Olbermann—before donning its current liberal identity in 2008, with the hiring of Rachel Maddow, shows the network is more akin to a cable news version of John Carpenter’s The Thing (FAIR.org, 8/28/21).\n\nThe owners of MSNBC—once Microsoft and General Electric, then GE alone, now the cable giant Comcast—have never held a commitment to its center-left brand beyond its capacity to capture as large a fraction of the market as possible. Now, as other mainstream corporate outlets like CNN are making similar adjustments (FAIR.org, 2/17/22), MSNBC seems to believe its best path to profit is shirking progressives.\n\nThe Democratic Party is facing an unprecedented—and justified—crisis in confidence among the public. A recent Quinnipiac University poll showed Democrats with just a 31% approval rating, the lowest since the school began measuring party approval. Meanwhile, a poll by the Institute for Middle East Understanding Policy Project found that “ending Israel’s violence in Gaza” was a top issue for voters who supported Biden in 2020, but cast their ballots for someone other than Harris in the 2024 election.\n\nMSNBC’s firing and demotion of its most progressive ranks, the ones who aired criticism of Israel, means that the Democratic Party—currently America’s sole opposition party in Congress—is all the less likely to be held accountable as the authoritarian right attempts to steamroll through our democracy.","summary":"At a time when the Democratic Party’s opposition to the ongoing right-wing authoritarian assault on US government is failing miserably (FAIR.org, 2/27/25), MSNBC’s recent purge means it is all the more unlikely that the cable news network will have any role in holding Democrats’ feet to the fire.\n\nThe news channel has nixed or demoted their most progressive anchors, all of whom are people of color. These are the hosts who have drawn the most ire from Donald Trump’s online warriors, according to Dave Zirin of The Nation (2/28/25). They are also some of the few who were willing to air the network’s rare criticism of Israel. In their stead, MSNBC has elevated Democratic Party apparatchiks and a center-right never-Trumper. This rightward shift reflects the reality that the channel’s corporate ownership has never cared for its left-of-center brand.\n\nThe network’s overhaul, led by its new president Rebecca Kutler, cancels Joy Reid’s ReidOut, Alex Wagner’s nighttime spot and Ayman Mohyeldin’s weekend evening show, w","url":"https://www.alternet.org/behind-msnbc-s-purge-of-its-most-progressive-anchors/","image":"https://www.alternet.org/media-library/image.png?id=53070459&width=1200&height=600&coordinates=0%2C137%2C0%2C137","video":null,"publish_date":"2025-03-07 14:16:40","author":"Fair,Luca Gold","authors":["Fair","Luca Gold"],"language":"en","source_country":"US","sentiment":-0.461},{"id":297749840,"title":"The Poisoning of the Democrat Mind","text":"On Tuesday night, President Donald Trump stood in the House of Representatives and introduced DJ Daniel, a 13-year-old boy battling brain cancer who desperately wants to be a police officer. His local police department made DJ an honorary officer. Last year, a video went viral of people ridiculing DJ for proudly wearing his uniform. He went viral for the second time on Tuesday night when Democrats refused to applaud him for his struggle with cancer.\n\nAt the not-quite State of the Union, President Trump heralded DJ’s valiant fight against cancer and made him an honorary member of the United States Secret Service. On Wednesday, DJ got to roam the White House, and reporters videoed him hugging President Trump in the Oval Office. On Tuesday night, Democrats could not muster the normalcy or decency to just clap for the kid.\n\nOn MSNBC, the rich, white, neurotic women who hold the Democratic Party captive let loose. Nichole Wallace openly hoped DJ would not grow up to be like the police officers who committed suicide after Jan. 6, 2021. Rachael Maddow called it “disgusting” that Trump would invite DJ to the ceremony. On CBS, Stephen Colbert blasted the Democrats for failing to do anything significant to protest Trump even as Americans watched Congressman Al Green get dragged out of the House Chambers. Democrats held up signs and dressed in bubblegum pink. All that was missing in the Democrats’ circus was a flaming trapeze. They resorted to a metaphorical flaming bag of poop in their conduct.\n\nOn Wednesday, Steve Rattner, who manages Michael Bloomberg’s billions after a stint in the Obama White House, went on MSNBC’s “Morning” to reiterate that former President Joe Biden had a great economy. The American public disagreed and removed Biden from office. Only with him gone do Democrats now care about an economy they cratered. But for four years, MSNBC, The New York Times, the late-night hosts, the pundits, the editorialists, and the activists all insisted everything was fine.\n\nThey insisted Joe Biden was fine. They insisted Kamala Harris was sharp. They insisted the economy was great. They insisted the border was secure. They insisted indicting Trump could stop him and that convicting him would turn Americans against him. They insisted a massive COVID-19 relief package would not provoke inflation. They insisted that they could call their Green New Deal the Inflation Reduction Act and Americans would believe it. Now they cannot clap for a kid with cancer or show compassion to the family of Laken Riley, murdered by an illegal alien, who was also present on Tuesday night.\n\nTheir editorialists affirm them. Their talking heads echo them. Their pundits praise them. Their activists push them until further and further left they go. The party of women wants men in women’s sports. The party of science embraces the pseudoscience of transgenderism. The party of compassion ignores a kid with cancer. The party that smugly thinks it is on the right side of history has gotten on the wrong side of the American people.\n\nTo Democrats, led by their media voices, the problem is the people, not the Democrats. The people are stupid, duped, racists, bigots, Nazis, desirous of whiteness or otherwise bad. The only virtuous Americans are those who agree with the progressive Left, which amounts to around 20% of the American public. Likewise, it is never their policies or proposals, just their messaging that is off. Guided by the voices of MSNBC, a network watched, on average, by just two-tenths of a single percent of the American public, and the neurotic women and gay men of The New York Times, the Democrats are not so much out of touch as they are outside reality.\n\nDemocrats have built an echo chamber that is poisoning them. Their preferred news network, newspapers, and voices, intoxicated by power and control, lack the humility to relate to people outside of their bubble. Their thought leader on MSNBC instead of wishing a young black teen battling brain cancer well, hoped he would not grow up to commit suicide. That is what the Democrats are doing by listening to Wallace, Maddow, Colbert, etc.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"On Tuesday night, President Donald Trump stood in the House of Representatives and introduced DJ Daniel, a 13-year-old boy battling brain cancer who desperately wants... Read More\n\n\nThe post The Poisoning of the Democrat Mind appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/03/07/the-poisoning-democrat-mind/","image":"https://www.dailysignal.com/wp-content/uploads/2025/03/colbert.jpg","video":null,"publish_date":"2025-03-07 14:00:00","author":"Age Over Support,Erick Erickson","authors":["Age Over Support","Erick Erickson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.589},{"id":297769224,"title":"'The worst generation': DC insider blasts today's 'morally grotesque' GOP","text":"For many years, conservative consultant/strategist Stuart Stevens was a prominent figure in the GOP. Stevens worked closely with a who's-who of pre-MAGA Republicans, from former Sen. Mitt Romney (R-Utah) to former Pennsylvania Gov. Tom Ridge to the late Sen. John McCain (R-Arizona). But in 2024, Stevens aggressively supported Democratic then-Vice President Kamala Harris' presidential campaign. And like many other Never Trumpers, Stevens (who expressed his disdain for Trumpism and the MAGA movement by leaving the GOP in 2020) was bitterly disappointed when she lost to now-President Donald Trump.\n\nIn a scathing article published by The New Republic on March 7, Stuart is vehemently not only of Trump, but of 2025 Republicans in general. Today's \"morally grotesque\" GOP, Stuart laments, is betraying the values of the \"Greatest Generation\" and should be called the \"Worst Generation\" instead.\n\nThe term \"Greatest Generation,\" used to describe the World War 2 Generation, was coined by NBC News journalist Tom Brokaw —and it caught on among both liberals and conservatives. \n\nREAD MORE:Musk is a liability — and it's only a matter of time before Trump gives him the boot\n\n\"This is on you, my Republican friends,\" Stuart argues. \"For years, I listened to your passionate commitments to freedom and democracy. I made hundreds of commercials laced with the iconography of the robust patriotism of America as the last, best hope. I watched you tear up to Ronald Reagan demanding, 'Mr. Gorbachev, tear down this wall'…. You inherited the legacy of the Greatest Generation only to ally with a mass-murdering tyrant invading a European democracy.\"\n\nThe former GOP consultant/strategist, now in his early seventies, continues, \"That was not inevitable. It was unthinkable.\"\n\nThe person Stuart describes as a \"mass-murdering tyrant\" is Russian President Vladimir Putin. Trump and Vice President JD Vance angrily berated Ukrainian President Volodymyr Zelensky during a February 28 meeting in the White House Oval Office, but they avoid criticizing Putin.\n\n\"What will happen to this Worst Generation of Republican elected officials?\" Stevens writes. \"I'd like to think they will be around to see the evil of their weakness destroy their careers, just as the German industrialists who grew fat on Hitler's war machine saw their empires in ruins. Alas, most will probably stumble along and, when Trump is gone, plead for heroic status for their behind-the-scenes efforts to blunt the worst of Trump’s madness. 'If it wasn’t for me, the battle for Greenland would have been far more bloody.' But I doubt they can escape history's judgment of their weakness.\"\n\nREAD MORE: There is no magical way out of this — there will be blood","summary":"For many years, conservative consultant/strategist Stuart Stevens was a prominent figure in the GOP. Stevens worked closely with a who's-who of pre-MAGA Republicans, from former Sen. Mitt Romney (R-Utah) to former Pennsylvania Gov. Tom Ridge to the late Sen. John McCain (R-Arizona). But in 2024, Stevens aggressively supported Democratic then-Vice President Kamala Harris' presidential campaign. And like many other Never Trumpers, Stevens (who expressed his disdain for Trumpism and the MAGA movement by leaving the GOP in 2020) was bitterly disappointed when she lost to now-President Donald Trump.\n\nIn a scathing article published by The New Republic on March 7, Stuart is vehemently not only of Trump, but of 2025 Republicans in general. Today's \"morally grotesque\" GOP, Stuart laments, is betraying the values of the \"Greatest Generation\" and should be called the \"Worst Generation\" instead.\n\nThe term \"Greatest Generation,\" used to describe the World War 2 Generation, was coined by NBC News journalist Tom Brokaw —an","url":"https://www.alternet.org/stuart-stevens-trump-worst-generation/","image":"https://www.alternet.org/media-library/image.jpg?id=56662224&width=1200&height=600&coordinates=0%2C442%2C0%2C443","video":null,"publish_date":"2025-03-07 13:53:46","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.084},{"id":297750696,"title":"Trump’s Decision to Stop Intel Sharing With Ukraine Hurts the US","text":"CIA Director John Ratcliffe confirmed that the United States halted intelligence sharing with Ukraine this week.\n\nSpeaking on Fox News, he said that the pause is “on the military front and the intelligence front” but did not provide additional details.\n\nNational Security Adviser to the White House Michael Waltz said the “pause” was done after a “reassessment” of US-Ukrainian relations.\n\nLater, also speaking on Fox News, Waltz said that the pause on intelligence and military aid could be lifted if Russia and Ukraine agree to peace talks, per AP.\n\n“The US will continue to suspend weapon supplies and intelligence sharing with Ukraine until a date for peace talks with Russia is set,” Waltz said.\n\nTwo different anonymous sources told the Washington Post conflicting information on what information was still being shared. One said that only intelligence for “force protection,” that is, Ukraine’s military sites, was still being provided.\n\nAnother said that exceptions were made related to “self-defense,” which could be “force protection” or include information on the targeting of civilians and civilian infrastructure. Malcontent News could not independently verify either claim.\n\nReports that the end of intel sharing would prevent Ukraine’s use of High Mobility Rocket Artillery Systems (HIMARS) were partially inaccurate: Ukrainian troops trained to use the M142 Guided Multiple Launch Rocket Systems (GMLRS – HIMARS) and M270 and MARS Multiple Launch Rocket System (MLRS) program each 227mm rocket in the field using the onboard Fire Control System (FCS). The M30 and M31 munitions do not require any US Department of Defense input, intelligence, or authorization.\n\nIn contrast, the MGM-140 ATACMS tactical ballistic missile is dependent on US Intelligence, Surveillance, Target Acquisition, and Reconnaissance (ISTAR) for programming.\n\nThis is why Washington resisted sending ATACMS missiles to Ukraine for over two years, with Russia calling their deployment a “redline.” Without the ISTAR information from the US, tactical ballistic missiles can’t be used.\n\nHowever, there is a twist.\n\nRussia is weakened after years of war\n\nUkraine has likely exhausted its MGM-140 inventory. Even if former US Vice President Kamala Harris had won the 2024 election, it was very unlikely that Ukraine would get more ATACMS. Production ended in 2007, restricting available inventory.\n\nRepublican leadership in the US Congress blocked an attempt to add money to the Pentagon budget in 2023 that would have funded the production of 1,700 new tactical missiles.\n\nThere may be quiet dissent within the Republican party. Congressman and Ranking Member of the House Intelligence Committee, Jim Himes (D-CT), used the official Twitter (also known as X) to post a call to restore intelligence support immediately:\n\nToday, National Security Advisor Mike Waltz and CIA Director John Ratcliffe publicly acknowledged that President Trump’s ‘pause’ on assistance to Ukraine includes intelligence sharing. \n\nAs Ranking Member of the Intelligence Committee, I have observed how critical our intelligence relationship with our Ukrainian partners has been in holding the line against Russia’s relentless and brutal offensive. It has saved the lives of Ukrainian servicemembers and civilians alike. \n\nThe pause on providing materiel to Ukraine against Putin’s aggression is unconscionable on its own, but the idea that we will now withhold life-saving intelligence from Ukrainians who are fighting and dying is unforgivable. Any pause in intelligence sharing must end immediately.\n\nWhile a Democrat wrote the statement, its posting on the official House Intelligence Committee “X” feed suggests that Republican leadership agreed with it.\n\nThere is no question that the loss of intelligence information from the US will have an impact on the battlefield, Ukraine’s ability to conduct deep strikes on some targets, and will increase civilian casualties.\n\nHowever, Russia is no longer capable of carrying out sustained missile attacks like it did in 2022, regardless of Ukrainian air defense capabilities.\n\nToday, Russia is producing cruise and ballistic missiles on a just-in-time basis.\n\nThe biggest threats will be the Iskander-M short-range ballistic missile (SRBM) and its North Korean Kn-23 counterpart, the Iskander-K ballistic cruise missile, the Kh-22/23 anti-ship cruise missile, which uses a ballistic trajectory in its terminal phase, and the Kh-47M2 Kinzhal air-to-ground ballistic missile.\n\nThe biggest risk to Ukraine and the rest of Europe is continued Russian strikes on Ukraine’s electrical infrastructure. If the power grid were to collapse, there is a non-trivial risk of a significant nuclear accident at any of Ukraine’s nuclear sites, including the occupied Zaporizhzhia Nuclear Power Plant.\n\nWashington is destroying decades of trust\n\nBeyond Ukraine, the new US policy of total self-interest without even a trace of realpolitik sent more shockwaves through its traditional allies in Europe, the Middle East, and the Asia Pacific.\n\nAt least two countries – Italy and India – are reportedly reconsidering signing deals with US defense contractors. Other nations, such as France, have said aloud that Europe now needs to consider a future without US support.\n\nIn 2022, Switzerland eroded trust in its defense industry by refusing to provide Germany with 35mm rounds for the Flakpanzer Gepard self-propelled antiaircraft gun and parts for other weapon systems. That decision has since affected Swiss defense companies, which have lost contracts. The Swiss government blocked the sale on the grounds of “neutrality” in armed conflict.\n\nInvestors may already be voting with their wallets. Since Donald Trump became president, Lockheed Martin has fallen 10%, and Northrop Grumman has dropped 6%.\n\nIn contrast, Rheinmetall ADR, based in Germany, is up almost 75%, Thales SA, based in France, is up over 73%, and BAE Systems PLC, based in the UK, is up almost 40%.\n\nWhile using metrics that boil down to geopolitics and dollars and cents is cold when compared to the invaluable nature of human life, it is a more tangible measurement for most people.\n\nIn Malcontent’s final assessment, we believe that many analysts are underestimating the potential long-term damage to the US defense industry. Foreign sales provide the dollars for future research and development of next-generation systems. Washington is gambling with its massive advantage in foreign military sales, which helps fuel its technological superiority.\n\nNo bucks? No Buck Rodgers.\n\nReprinted with permission from the substack of Malcontent News – Where the Truth Matters.\n\nThe views expressed in this article are the author’s and not necessarily those of Kyiv Post.","summary":"The decision comes as Washington piles new requirements on Kyiv to restart military aid.","url":"https://www.kyivpost.com/opinion/48360","image":"https://static.kyivpost.com/storage/2025/03/06/37e0c7f7179edd23de03e3dd9fc0f1da.jpg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-03-07 13:29:00","author":"Malcontent News","authors":["Malcontent News"],"language":"en","category":"politics","source_country":"ua","sentiment":-0.228},{"id":297744388,"title":"Gavin Newsom's Podcast Remarks Spark Backlash From Democrats","text":"California Governor Gavin Newsom's newly launched podcast is drawing criticism from fellow Democrats after he said he is against transgender athletes competing in women's events.Newsweek has contacted Governor Newsom's office for comment via email.Why It MattersNewsom has long positioned himself as a progressive leader, often clashing with conservatives on issues like LGBTQ+ rights. His stance on transgender athletes, however, puts him at odds with some members of his own party, especially as we head toward the 2028 presidential election, for which he is believed to be a contender for the Democratic nomination. His stance is also likely to be highly relevant to the 2028 Summer Olympics in Los Angeles.What To KnowNewsom was joined by conservative activist Charlie Kirk for the first episode of his new podcast, This is Gavin Newsom, which he launched last week.The pair discussed multiple issues, including why Democratic nominee Kamala Harris lost to President Donald Trump, which led to Newsom asking Kirk for advice he had for the Democratic Party.\"Get better ideas, governor,\" Kirk responded. \"You, right now, should come out and be like, 'You know what? The young man who's about to win the state championship in the long jump in female sports—that shouldn't happen.' You, as the governor, should step out and say, 'No.'\" Kirk was referencing a transgender high school student's victory in a girls' triple jump event in California last month. The student won the competition by eight feet.\"I think it's an issue of fairness. I completely agree with you on that,\" Newsom told Kirk. \"It is an issue of fairness, it's deeply unfair. We've got to own that. We've got to acknowledge it.\"He went on to say that the Democrats were being politically \"crushed\" on transgender issues.Transgender rights have become a challenging issue for Democrats, especially after Donald Trump made it a key attack line in his 2024 campaign. His team spent millions on ads targeting Kamala Harris, including one that declared, \"Kamala's For They/Them. President Trump is for you.\" Newsom described the ad as \"a great ad\" but said that it was \"devastating\" for his party.\"It was devastating. And she didn't even react to it, which was even more devastating,\" he told Kirk.Newsom's remarks come as potential contenders for the 2028 presidency are seeking to move away from the identity politics of 2024. In recent weeks, former Transportation Secretary Pete Buttigieg said that certain diversity initiatives contributed to the rise of \"Trump Republicans,\" while Illinois Governor JB Pritzker pointed to a looming budget deficit as justification for proposing cuts to a health care benefit for some noncitizen immigrants.But the California governor's comments have not gone down well with some Democrats.Former Chicago Mayor, Lori Lightfoot, called the remarks \"disgusting,\" saying transgender youth in California would feel hated by their governor. Washington Representative Pramila Jayapal urged Democrats not to give in to anti-transgender rhetoric, while Equality California said it was \"profoundly disappointed and angered,\" accusing Newsom of adding to the fear and hostility transgender people already face.When asked Thursday about Newsom's comments, House Minority Leader Hakeem Jeffries said he had not seen them but emphasized that Democrats opposed \"unleashing sexual predators on girls throughout the United States of America.\"Earlier this year, Democrats overwhelmingly voted against a bill that would ban transgender athletes from competing in women's or girls' sports. Party leaders criticized the legislation, calling it the \"Child Predator Empowerment Act\" and argued that it could result in adults inspecting children's genitals to determine their eligibility for sports.Other Democratic lawmakers also voiced concern. California Assembly member Chris Ward and State Senator Scott Wiener, both LGBTQ+ advocates, said Newsom was playing into Trump-driven narratives instead of standing with transgender people. Meanwhile, state Senator Sasha Renée Pérez criticized the focus on transgender women athletes, calling it a distraction driven by Republicans.However, some Democrats, including Massachusetts Representative Seth Moulton, suggested the backlash was overblown, arguing that public opinion is shifting in favor of restrictions on transgender athletes. \"More and more are willing to say what they've probably always thought—and that's a good thing,\" he told Politico. California Representative Sara Jacobs countered that targeting transgender kids for political gain is what's truly unfair.According to an opinion survey in January by The New York Times/Ipsos, almost all Republicans and nearly seven in 10 Democrats oppose allowing transgender female athletes to participate in women's sports.Throughout his career, Newsom has been a staunch advocate for LGBTQ+ rights, often pushing his party further to the left on the issue.As San Francisco mayor in 2004, he made national headlines by ordering the city clerk to issue same-sex marriage licenses—defying both state and federal law at the time.As governor, he has reinforced California's reputation as a leader in LGBTQ+ protections. He signed legislation making the state a sanctuary for transgender youth, safeguarded LGBTQ+ history in school curriculums, and last year, made California the first state to prohibit school districts from requiring staff to inform parents if a student changes their gender identity.What People Are SayingLori Lightfoot, the former Chicago mayor, said: \"It's disgusting. There are kids waking up today in California with this news thinking that their governor hates them, and rightly so.\"Representative Pramila Jayapal urged Democrats to \"not take the bait and give in to their anti trans people rhetoric.\"Equality California, a state LGBTQ rights group, said in a statement it is: \"profoundly disappointed and angered\" by Newsom's comments. \"Right now, transgender youth, their families, their doctors, and their teachers are facing unprecedented attacks from extremist politicians who want to eviscerate their civil rights and erase them from public life. In this moment of crisis, they need leaders who will unequivocally fight for them,\" the organization said. \"Instead of standing strong, the Governor has added to the heartbreak and fear caused by the relentless barrage of hate from the Trump Administration,\" it continued.Representative Sara Jacobs, vice chair of the Congressional Equality Caucus, told Politico: \"What's unfair is the targeting of transgender kids and politicians abandoning them for political expediency.\"Assembly member Chris Ward, a gay San Diego Democrat, told Politico: \"We woke up profoundly disappointed and sickened, when you have someone who has been thoughtful and has been a very unwavering ally release a statement like that. Look, this is playing into a lot of the conversation that Donald Trump is obsessing about in order to distract us.\"California State Senator Sasha Renée Pérez said on X: \"Shocked Gov. Newsom would join the obsession with trans women athletes who represent 10 of 510,000 college athletes in the USA. Republican solutions to 'regulate' this include having coaches monitor children's menstrual cycles or performing genital exams. Stay away from our kids.\"California State Senator Scott Wiener, a member of California's Legislative LGBTQ Caucus, said in a statement: \"This is not one of those moments. Charlie Kirk is a vile bigot, and standing with him on this issue is profoundly disturbing. Trans people are just trying to live their lives. They're facing a level of political hostility that leads to violence and homelessness. They need their allies to stand with them—especially when it's hard.\"What Happens NextNewsom is believed to be a contender for the 2028 Democratic nomination for president. However, he has not yet expressed any desire to run.In November, Newsom had +550 odds of becoming the next president, according to SportsBettingDime, which amounts to a 15 percent chance.","summary":"California's governor was joined by conservative activist Charlie Kirk for the first episode of his new podcast.","url":"https://www.newsweek.com/gavin-newsom-podcast-charlie-kirk-transgender-sports-2041035","image":"https://d.newsweek.com/en/full/2602281/gavin-newsom.jpg","video":null,"publish_date":"2025-03-07 13:19:55","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","category":"politics","source_country":"US","sentiment":-0.118},{"id":297734468,"title":"Has Kamala Harris made a decision about political future?","text":"Former Vice President Kamala Harris is reportedly getting “serious” about her next act.\n\nPolitico reported Friday she’s telling allies that she’s “staying in this fight” after losing to President Donald Trump in November.\n\nWhat does that mean?\n\nPotentially running for governor in California.\n\nPer Politico:\n\nAt a pre-Oscars party last weekend, Harris was asked by another partygoer when she would make a decision about jumping into the California governor’s race. She gave a definitive answer, according to two people with knowledge of the conversation: the end of the summer.\n\nAnd in calls to supporters, allies and trusted aides in recent weeks, Harris has made clear that she plans to make a decision in a few months.\n\nHarris’ timeline, reported here first, is the clearest indication to date that she may enter the race to succeed the termed-out Gavin Newsom in the Golden State. And, allies said, a win would almost certainly take a 2028 presidential run — which Harris is still mulling — off the table.\n\nIn January, as Trump prepared to return to the Oval Office, Harris told reporters she wasn’t ready to exit public life.\n\n“It is not my nature to go quietly into the night,” Harris said. “So don’t worry about that.”\n\nShe added: “I’ll keep you posted.”\n\nFormer President Joe Biden chose Harris as his running mate after her first presidential campaign stalled four years prior. After taking office, her schedule was limited by the coronavirus pandemic and her obligations on Capitol Hill. With the U.S. Senate evenly divided, she was often called on to cast tiebreaking votes, eventually setting a record as she helped advance judicial nominees and landmark legislation. \n\nThe Associated Press contributed to this report.","summary":"She's getting “serious” about her next act.","url":"https://www.nj.com/politics/2025/03/has-kamala-harris-made-a-decision-about-political-future.html","image":"https://www.nj.com/resizer/v2/KUJ3JQP2IVA55OJ7N6KEGSW75Y.jpg?auth=32e00408b64d7b964f66c0cc6d79fd7334f71fbf06a702fa89c17a6e15a2552a&width=1280&quality=90","video":null,"publish_date":"2025-03-07 13:11:10","author":"Matt Arco","authors":["Matt Arco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.243},{"id":297881604,"title":"The coming showdown in Trumpworld","text":"It is clear that Musk currently has Trump’s ear. The White House has given free rein to Musk’s so-called Department of Government Efficiency (DOGE), and Trump himself has encouraged Musk to be more aggressive.\n\nCOMMENT | DANI RODRIK | Although Donald Trump came to office riding a tsunami of public hostility against “elites,” his enablers are themselves leading members of the establishment and the plutocracy. As was true during his first term, Trump – a wealthy businessman and celebrity – has surrounded himself with a mix of conventional Republican politicians, Wall Street financiers, and economic nationalists. But this time, these groups have been joined by members of the techno-right, represented most glaringly by Elon Musk, the world’s wealthiest person.\n\nWhat unites these groups, at least for the time being, is not Trump’s character or his leadership – both of which leave much to be desired. Rather, it is the belief that their specific agendas will be better served under Trump than under the most likely alternative. Conservative Republicans want low taxes and less regulation, while economic nationalists want to close the trade deficit and restore US manufacturing. Free-speech absolutists want to end what they see as “woke censorship,” while the techno-right wants a free hand to enact its own vision of the future.\n\nIrrespective of their pet projects, these groups all regarded Kamala Harris (and Joe Biden) as a hindrance, and Trump as a promising ally. Most do not oppose democracy, per se, but they do seem willing to overlook, and hence facilitate, Trump’s authoritarianism so long as their agenda is being served. Press them on Trump’s anti-democratic impulses and contempt for the rule of law, and they will equivocate or minimize the risks.\n\nDuring Trump’s first term, I shared my concerns about him with one of his leading economic advisers (an economic nationalist). But my interlocutor pooh-poohed my worries and countered that Democrats and the administrative state were the more serious threats. Ultimately, he was interested in his boss’s commitment to tariffs, not any of the possible consequences for democracy.\n\nSimilarly, on a recent episode of New York Times journalist Ezra Klein’s podcast, free-speech absolutist Martin Gurri explained that his own support for Trump was driven mainly by the Biden administration’s clampdown on free expression. Biden had “basically told the [social media] platforms: You have to adhere to European standards of good behavior online,” Gurri claimed. Yet the restrictions Trump has placed on speech by civil servants and government-funded private entities are already far more egregious. Even as he concedes that Trump might end up “being even worse,” Gurri seems unfazed. When push comes to shove, it is apparently more important to decimate woke culture than to uphold the First Amendment.\n\nWith Trump’s elite supporters prioritizing their own narrow agendas over democratic principles, the risk of a slide toward authoritarianism should be obvious. Fortunately, however, the even more likely outcome is that these competing agendas will soon clash, causing the Trump coalition to implode.\n\nThe sharpest lines of conflict are between the economic nationalists and the techno-right. Both camps see themselves as anti-system, and both want to disrupt a regime that they feel has been imposed on them by Democratic Party elites. But they embody very different visions of America and where it should be going.\n\nThe economic nationalists want to return to a mythical past marked by American industrial glory, whereas the tech camp envisions an AI-administered utopian future. One is populist, the other elitist. One has faith in the wisdom and common sense of ordinary people, the other only in technology. One wants to stop immigration across the board, the other welcomes skilled newcomers. One is parochial, the other essentially globalist. One wants to break up Silicon Valley, the other to empower it. One believes in soaking the rich, and the other in spoon-feeding the rich.\n\nThe nationalist-populists claim to speak for the people Musk’s envisioned technological revolution would leave behind. So, it is not surprising that they hold Silicon Valley’s “technofeudalists” in deep contempt. Steve Bannon, a leading voice among the economic nationalists (and a graduate of Harvard Business School, of course), has even gone so far as to call Musk a “parasitic illegal immigrant.” Musk and what he represents must “be stopped,” Bannon warns. “If we don’t stop it … now, it’s going to destroy not just this country, it’s going to destroy the world.”\n\nWhile Bannon does not currently serve in the Trump administration, he is a major figure in the MAGA (“Make America Great Again”) movement, and he maintains close ties to many top administration staffers. Yet it is clear that Musk currently has Trump’s ear. The White House has given free rein to Musk’s so-called Department of Government Efficiency (DOGE), and Trump himself has encouraged Musk to be more aggressive.\n\nIt is typical of personalistic leaders, like Trump, to pit allies (courtiers, really) against each other so that none amasses too much power. Trump undoubtedly thinks he can stay on top and leverage the conflicts for his own advantage. But such tactics work best when the competition among different groups is over government resources and rents, rather than reflecting different ideologies and belief systems.\n\nGiven the vastly different worldviews and policy preferences of the forces animating the Trump administration, a showdown is all but inevitable. But what would come after. Will there be paralysis, or will one of the groups assert its dominance? Will the Democrats be able to capitalize on the rift? Will Trumpism be disgraced? Will the prospects for American democracy be revived, or diminished even further?\n\nRegardless of the outcome, the tragedy is that the less-educated working-class voters who flocked to Trump’s anti-elitist message will remain the losers. None of the contending wings of Trump’s coalition offers a compelling vision for them. This applies even to the economic nationalists (their rhetoric notwithstanding), whose aspirations hinge on an unrealistic revival in manufacturing jobs.\n\nAs different elites fight for their own versions of America, the urgent policy agenda needed to create a middle-class economy in a post-industrial society will remain as distant as ever.\n\nDani Rodrik, Professor of International Political Economy at Harvard Kennedy School, is President of the International Economic Association and the author of Straight Talk on Trade: Ideas for a Sane World Economy (Princeton University Press, 2017).\n\nCopyright: Project Syndicate, 2025.\nwww.project-syndicate.org","summary":"&#160; It is clear that Musk currently has Trump’s ear. The White House has given free rein to Musk’s so-called Department of Government Efficiency (DOGE), and Trump himself has encouraged Musk to be more aggressive. COMMENT &#124; DANI RODRIK &#124;  Although Donald Trump came to office riding a tsunami of public hostility against “elites,” his enablers &#8230;\n\n\nThe post The coming showdown in Trumpworld appeared first on The Independent Uganda:.","url":"https://www.independent.co.ug/the-coming-showdown-in-trumpworld/","image":"https://www.independent.co.ug/wp-content/uploads/2025/02/Musk-and-Trump.jpg","video":null,"publish_date":"2025-03-07 13:00:34","author":"The Independent","authors":["The Independent"],"language":"en","category":"politics","source_country":"ug","sentiment":-0.051},{"id":297794678,"title":"Trump’s Shockingly Lawless Second Term","text":"here were less than four days to go until Donald Trump was sworn into office for a second time. In those final days of the presidential transition, Trump and his team were busy finalizing their blitz of executive actions, which included a widespread crackdown on civil rights, trans Americans, and diversity programs. Trump’s government-in-waiting was putting the finishing touches on plans for a startlingly nativist propaganda campaign, which would soon feature an “ASMR” video of officials preparing to fly migrants to camps at Guantánamo Bay. \n\n Trump had preemptively allocated an astounding amount of power to the world’s richest man, Elon Musk, giving him near free rein to desecrate the federal workforce. And the president-elect was giddy about one of his more depraved opening acts still to come: the mass pardons and commutations for his supporters who stormed the U.S. Capitol on Jan. 6, 2021.\n\n Amid all of this, the incoming president had something else on his mind: his meme coin. The Friday night before his inauguration, Trump announced he was launching his own cryptocurrency called “Trump Meme” — a purely speculative asset, comparable to a digital baseball card, with no inherent value or use. The price of $TRUMP quickly blew up, surging from around $6 to $74, generating billions of dollars on paper for the Trump family. \n\n The launch was so successful that First Lady Melania Trump quickly raced her own meme coin out the door, too, less than 24 hours before Trump’s inauguration — a move that caused $TRUMP to begin crashing. By late February, the coin was trading at around $13. The earliest investors likely made huge profits; hundreds of thousands of suckers appear to have lost big. The Trump family will make a killing no matter what: By early February, his family and their partners had made nearly $100 million on trading fees.\n\n In the final days of the transition and even during his early presidency, Trump privately encouraged close allies — in big business and on Capitol Hill — to buy his meme coin, according to a source familiar with the matter and one Republican lawmaker. He’d even do this over dinner. \n\n “You should really get in on it,” Trump would bluntly recommend.\n\n “Of course he did,” the GOP lawmaker recounts. “He told the whole country to do it [via an X post], so why wouldn’t he tell the people he knows? There’s nothing wrong with that.” The lawmaker refused to say whether they invested — though if they bought any Trump coin more than an hour or two after it launched, they would have lost big.\n\n The meme coin was a blatant cash grab, to the point that one of Trump’s former White House communications directors denounced it as “Idi Amin-level corruption.” It wasn’t even the Trump family’s first foray into crypto — during the 2024 campaign, his family announced the creation of their own cryptocurrency platform, World Liberty Financial.\n\n As he promised on the campaign trail, Trump has worked aggressively to push the crypto industry’s interests in Washington and ensure the incredibly risky assets operate with little regulation, signing an executive order to promote crypto, announcing a “crypto strategic reserve,” and naming an industry ally to lead the Securities and Exchange Commission. At the end of February, Trump’s SEC moved to throw out its prosecution of Justin Sun — who had been charged with marketing unregistered crypto securities and manipulating the market for a crypto token — after Sun’s investments in World Liberty Financial reportedly netted the Trump family $56 million in fees. \n\n The crypto caper is a perfect encapsulation of the bold-faced graft at the heart of the new Trump presidency: Uber-wealthy elites are poised to cash in, while ordinary people get hosed. And public policy will be designed to encourage this exact outcome. \n\n “Compared to other major corruption scandals since the 1870s, this administration is shaping up to be the most corrupt of them all, because never before has a president been willing and able to blatantly use the office to make massive personal profit,” says Kedric Payne, the Campaign Legal Center’s general counsel and senior director for ethics. “Compared to his first term, he’s more strategic and more prepared to engage in corruption — and he’s taken big steps to wipe out any possible enforcement against his actions. An example of this is his financial interest in crypto, while at the same time shaping the policy to allow that very industry to flourish.”\n\n Payne adds: “The blatant nature of this is genuinely new, which I think a lot of people have trouble wrapping their heads around. Normal corruption involves lobbyists providing gifts and perks and campaign contributions to lawmakers in hopes they will receive beneficial legislation. These are acts that directly benefit Trump’s bottom line.” (The Trump administration did not respond to requests for comment.)\n\n “This administration is shaping up to be the most corrupt of them all.”Kedric Payne\n\n WHILE STILL IN its infancy, Trump’s second administration has been a shocking expression of corruption, lawlessness, and cruelty, with an even higher level of chaos than Americans had grown to expect from the former game-show host. It’s clear now his critics were correct about what a Trump win would mean; if anything, many of them undersold the threat he would pose. \n\n At the center of the horror show is Elon Musk, who spent $290 million boosting Trump and Republicans in the last election cycle. In return, Musk was put in charge of Trump’s so-called Department of Government Efficiency (DOGE). Trump and Musk have used this not-so-legitimate office to blitz through constitutional checks and balances and long-standing federal laws in order to consolidate and expand presidential power, so they can dismantle whole agencies and purge the workforce to make it more MAGA.\n\n With Musk and his team of young far-right helpers at DOGE leading the way, the Trump administration has moved to fire tens of thousands of federal employees with no basis at all — ranging from the vast majority of workers at the U.S. Agency for International Development, America’s foreign aid bureau; some health care workers at the Department of Veterans Affairs; staffers who take care of our great national parks; and employees at the Federal Aviation Administration who keep the skies safe. (They also fired hundreds of staffers at the agency that manages America’s nuclear weapons before attempting to hire them back.)\n\n Veterans make up 30 percent of the federal workforce — so Americans who served our country are all but assured to absorb the brunt of Trump and Musk’s mass firings. Moreover, Musk and DOGE specifically sought to cancel hundreds of Veterans Affairs contracts that would eviscerate the department’s ability to provide promised care and benefits; according to Washington Technology, a magazine for government contractors, most of the contracts targeted were held by service-disabled, veteran-owned small businesses. \n\n “Congress estimates 50,000 veterans will lose jobs, homes, and more,” says Michael Embrich, a former policy adviser to the secretary of Veterans Affairs, adding: “Those who swore to defend democracy will now have their pursuit of happiness stripped by two of the richest and most powerful men ever to skirt serving in the public interest.”\n\n ‘Paying to See the President’ \n\n In a short time, the ethical quandaries of Trump’s first term have begun to look comparatively small. Outside of the crypto space, there are so many different ways for businesses — or foreign interests — to put money directly in the coffers of the president and his family. \n\n During the campaign last year, Trump privately discussed jacking up the price for membership at his private Florida club and estate Mar-a-Lago, because members are “paying to see the president.” \n\n After Trump’s defeat of Vice President Kamala Harris, top CEOs and corporate executives amped up their visits to the president’s Palm Beach club — with Amazon’s Jeff Bezos, Facebook’s Mark Zuckerberg, suits from the pharmaceutical industry, and many others making a show of kissing the ring. \n\n Senior staff at lobbying outfits and a variety of corporate giants immediately began planning retreats, galas, and annual meetings at Mar-a-Lago and other Trump-branded golf resorts and event spaces — so they could shovel cash to Trump. One longtime D.C. lobbyist referred to these payments as “tips” for the president. Wired separately reports Trump’s Super PAC has charged $1 million per seat at Mar-a-Lago events with the president; one-on-one meetings cost $5 million. \n\n Even the first lady has been making deals — including an outlandish agreement with Amazon. The company signed a $40 million deal with Melania Trump for a documentary film that, as one Amazon source puts it, “nobody asked for.” Other studios, to the extent they were interested, reportedly offered far lower sums. It’s expected that most of the money will go directly to Melania. She personally pitched Bezos, Amazon’s founder and executive chairman, about the film project, directed by disgraced filmmaker Brett Ratner, over dinner at Mar-a-Lago in December, according to The Wall Street Journal. \n\n Becoming president again has given Trump leverage to resolve his often frivolous lawsuits against Big Tech companies and large corporate-owned media outlets, and to walk away with multimillion-dollar payouts. In one case, he has already wielded the weight of the Federal Communications Commission against a media company he’s suing. \n\n ABC, owned by Disney, announced in December it would pay $15 million to resolve Trump’s lawsuit over George Stephanopoulos’ claim that Trump had been “found liable for rape” in civil lawsuits from E. Jean Carroll. (Trump was found liable for “sexual abuse.”) In late January, Meta agreed to pay $25 million to settle Trump’s lawsuit over Facebook suspending his social media accounts after he fomented the Jan. 6 riot. \n\n The Facebook and ABC payments went to Trump’s new presidential library and museum slush fund. In the case of Trump’s settlement with X, Musk didn’t even bother with the library fund, and instead negotiated a $10 million deal with Trump that will reportedly benefit the president personally. Trump has claimed he gave Musk “a big discount.”\n\n Obvious Conflicts \n\n The $10 million deal with Trump might be smart for Musk after all, given that his relationship with the president has made him one of the world’s most powerful people and put him in a position to profit off the government even more. \n\n Musk’s DOGE team has demanded sweeping access across the federal government to sensitive data and systems in order to enact firings, cancel projects, and cut off payments to entities that Trump and Musk don’t like. The upshot for Musk is he now has access to an unparalleled trove of data about every American as well as his competitors. The opportunities for conflicts of interest are endless, given Musk’s businesses. \n\n As Ciara Torres-Spelliscy, a law professor at the Stetson University College of Law, puts it, “The number of potential conflicts of interest are legion.” \n\n The Trump White House has argued that Musk can police his own activities — and choose to excuse himself from DOGE’s work overseeing certain contracts or funding if he believes it poses a conflict. Musk, for his part, has suggested that the public will hold him accountable regarding any conflict — people won’t “be shy about saying that,” he said in a press conference with Trump. \n\n “The number of potential conflicts of interest are legion.” Ciara Torres-Spelliscy\n\n “We would not let him do that segment or look in that area if we thought there was a lack of transparency or a conflict of interest,” Trump volunteered, before waving away any concerns: “He’s a successful guy. That’s why we want him doing this.” Trump later publicly added one potential restriction: “Anything to do with possibly even space, we won’t let Elon partake in that,” he said. \n\n That would make sense, since Musk’s company SpaceX has received billions in contracts from NASA. \n\n When it was reported in February that the Trump administration was targeting NASA for a round of painful cuts — potentially 10 percent of the space agency’s workforce — the agency was abruptly let off the hook. Within hours of those reports emerging, NASA staff were told that they could take a breath: At least for the moment, those cuts were postponed, or maybe called off for good. \n\n The reason? Musk and his allies personally intervened to forestall the reported haircut, according to two sources with knowledge of the situation. \n\n As he tears through the federal workforce, Musk is cashing in on new and existing contracts, including with agencies that regulate his businesses.\n\n After Musk and DOGE cut hundreds of jobs at the FAA, an agency that previously fined Musk’s SpaceX for regulatory and safety violations, news outlets reported the agency was preparing to hire Starlink, owned by SpaceX, to upgrade the systems it uses to manage America’s airspace. As Rolling Stone reported, before anything was official, FAA officials quietly directed staff to find tens of millions of dollars to fund a Starlink deal.\n\n “If Musk is in charge of hiring and firing workers at the FAA, then getting a no-bid FAA contract to provide services would be an epic conflict of interest,” says Torres-Spelliscy. “If this is the case, then he is basically paying himself with taxpayer funds through a part of the government he partially controls through his ability to fire people.”\n\n Talk of hiring Starlink has come up elsewhere. According to a source familiar with the matter, during the first few weeks of the second Trump era, DOGE personnel reached out to officials at the FBI and Justice Department — and asked if the bureau had ever thought about adopting Starlink for sensitive operations and surveillance.\n\n “I wanted to vomit,” this source says, adding that there is no conceivable reason the FBI would need Starlink.\n\n The administration has also shielded Musk’s X platform from potential oversight, pausing the work of the Consumer Financial Protection Bureau, which polices big banks and other financial institutions, such as peer-to-peer payment apps. Musk is working with Visa to offer a peer-to-peer payment service called X Money Account.\n\n Other agencies scrutinizing Musk’s businesses have faced steep job cuts — including the National Highway Traffic Safety Administration, which has been investigating Tesla’s self-driving technology.\n\n “To the extent that Musk is hiring and firing people all over the U.S. executive branch, he is not in arm’s-length transactions with -government regulators,” Torres--Spelliscy says. “With respect to the National Highway Traffic Safety Administration, he would be both the regulator [NHTSA] and the regulated [Tesla].”\n\n ‘Elon Musk Is Unconstitutional’ \n\n Lawlessness is core to Musk’s DOGE project and Trump’s slash-and-burn agenda for his second administration. The president’s mass--firing campaign and efforts to expand executive power depend on his and his cronies’ willingness to ignore the Constitution, existing federal laws passed by Congress, and any expectations of transparency. \n\n Musk has not been appointed or confirmed; he is a “special government employee,” a designation that allows him to bypass a Senate confirmation process and avoid publicly disclosing his vast financial holdings. \n\n “Special government employees do not go around directing people in agencies and telling them what to do,” says Richard Painter, a University of Minnesota law professor who served as the chief ethics lawyer for President George W. Bush. “If you’re directing people in agencies and telling them what to do, under the appointments clause of the Constitution, you need to be appointed and confirmed by the Senate.”\n\n The office Musk has led, DOGE, was created by rebranding the U.S. Digital Service — a technology unit that was housed within the president’s Office of Management and Budget. Musk and Trump have attempted to bestow the office with expansive authorities never granted by Congress. (They also moved DOGE into the executive office of the president, to shield it from open-record laws.)\n\n In court, the Justice Department has claimed that “Mr. Musk has no actual or formal authority to make government decisions himself” — even as Musk publicly threatened to fire any federal employees who failed to respond to his HR emails asking them, “What did you do last week?”\n\n Meanwhile, DOGE has worked to help the Trump administration claw back funds appropriated by Congress, including $80 million taken right out of New York City bank accounts. Those funds, meant to help the city house asylum seekers, were removed after Musk falsely claimed that DOGE had “discovered” that disaster-relief funds were “being spent on high-end hotels for illegals.”\n\n There’s a term for this type of act: impoundment. Trump pledged to try this during the 2024 campaign. However, the Constitution does not give the president the power to impound, freeze, or refuse to spend funds appropriated by Congress. \n\n “It’s pretty clear as a textual matter, and the history is even clearer, that the president needs to defer to Congress, and cannot override Congress’ specific appropriations,” says Jed Shugerman, a Boston University law professor and expert in executive power. He notes that Musk “has deputies who are directly pushing the buttons that are blocking payments,” thanks to DOGE’s unprecedented access to America’s payment systems.\n\n Trump is challenging the Constitution in other ways. The president has attempted, via executive order, to end birthright citizenship — the 14th Amendment’s guarantee of citizenship to anyone born in the United States. (A judge appointed by Ronald Reagan found Trump’s order “blatantly -unconstitutional.”)\n\n “He who saves his country does not violate any law.” Donald Trump\n\n Compounding the constitutional threat, Vice President J.D. Vance has suggested Trump can ignore judges’ rulings, and Trump has publicly threatened to “look at” judges who rule against DOGE’s efforts to gut federal agencies and freeze their funds.\n\n “At this point, there’s enough reporting to suggest that Elon Musk is exercising invalid power that the Constitution doesn’t allow,” says Shugerman. “He should not have executive power at all if it hasn’t been established by Congress,” Shugerman continues. “The executive power he’s exercising is that of a department head or principal officer, and he has not been confirmed. Elon Musk is unconstitutional.”\n\n ‘What Are You Gonna Do About It?’ \n\n Since the dawn of his first administration, Trump has told his followers: “Promises made, promises kept.” One 2024 vow he’s kept was his pledge to make the federal government as autocratically MAGA and cultish as possible.\n\n During the Presidents’ Day weekend in mid-February, Trump screamed the quiet part out loud, writing online: “He who saves his Country does not violate any Law.” In paraphrasing an apparently fake Napoleon quote, Trump effectively declared that he thinks he can break any law he wants. \n\n In a more sane time, this sort of expression from the U.S. commander in chief would be a scandal. After all, the president is — due to the American Revolution — not a king. Trump and his staff soon doubled down, outright calling him “THE KING.”\n\n It would be easier to dismiss these words as mere trolling if Trump were not seeking to consolidate unchecked power. In his first month back in office, Trump moved to purge the FBI and Justice Department as vengeance for the criminal investigations he’s faced. He’s quickly turned the DOJ into a political arm of the White House and a protection racket for him, his friends, and allies — and a weapon against his enemies, real or perceived.\n\n Almost as soon as he was sworn in, multiple sources familiar with the matter tell Rolling Stone there was a sudden, jarring information clampdown at the DOJ. Senior career officials at the Justice Department were suddenly cut out of daily conference calls and meetings to go over top-line threats or prime suspects that the feds were focusing on. Trump’s political appointees repeatedly warned Justice Department career officials and attorneys that failure to comply with Trump’s interpretation of the law — however illegal it may sound — is grounds for removal.\n\n During the 2024 presidential campaign, Trump told several confidants that his new Justice Department would not be conducting any more, in his framing, “illegal” federal investigations of Trump’s Republican pals. Already, the president and his administration are following through on that. \n\n Ed Martin, Trump’s new interim U.S. Attorney for the District of Columbia, has publicly pledged to “protect DOGE,” and described his team as “President Trump’s lawyers.” More ominously, in February, his office reportedly declined to sign off on an arrest warrant for MAGA Florida Rep. Cory Mills, after he was accused of physically assaulting a 27-year-old woman. At the same time, Martin has publicly threatened to investigate Democratic lawmakers over their criticisms of Musk and the conservative Supreme Court.\n\n After Trump took office again, the Justice Department’s interest in corruption-busting quickly evaporated, and the department announced it was ending its focus on foreign bribery and influence. The DOJ also moved to throw out its corruption case against New York Mayor Eric Adams so that he could more fully devote his “attention and resources” to assisting Trump’s immigration crackdown. \n\n The ensuing scandal triggered a wave of resignations at the Department of Justice that included prosecutors who had clerked for staunchly conservative justices. In another presidency, it would have been the defining, darkest episode. In Trump 2.0, it was another day, another week, another chance for the president and his people to practice their guiding, Sopranos-style legal principle, which is simply — in the words of one conservative attorney close to Trump and his inner sanctum — “What are you gonna do about it?”","summary":"Donald Trump and Elon Musk are blindly purging the government to make it more MAGA and cruel, ignoring the law, and cashing in like America has never seen","url":"https://www.rollingstone.com/politics/politics-features/trump-musk-lawless-second-term-1235290095/","image":"https://www.rollingstone.com/wp-content/uploads/2025/03/R1398_NAT-AFF_Trump_B.jpg","video":null,"publish_date":"2025-03-07 13:00:00","author":"Andrew Perez,Asawin Suebsaeng,Steven Pearl","authors":["Andrew Perez","Asawin Suebsaeng","Steven Pearl"],"language":"en","category":"politics","source_country":"us","sentiment":0.023},{"id":297718186,"title":"Trump recalibrates as foes target Musk and tariffs","text":"The president also offered Canada and Mexico partial reprieve from his tariffs not long after imposing them on the two major trading partners. \n\nIt remains to be seen whether either move reflects a larger shift in Trump’s strategy or are merely brief tactical retreats.\n\nBut Democrats have been counting on a public backlash against the DOGE cuts and tariffs to sap Trump’s support and end what has, at least according to some polls, been a relative honeymoon for him to start his second term.\n\nPublic discontent with high prices after inflation hit a 40-year high under former President Joe Biden was a major factor in Trump’s victory late last year. Trump campaigned on DOGE and some measure of fiscal discipline but has never been much of a government-cutter, and the Musk-led task force has consumed more political oxygen since Jan. 20 than it ever did during the campaign.\n\nTrump inherited a soft but growing economy from Biden, with Democrats increasingly willing to call out economic weaknesses now that Biden and former Vice President Kamala Harris are gone.\n\nBut if Musk’s role in the Trump administration is to be more advisory and the tariffs are to be employed mainly as a negotiating tool, perhaps a reversal in political fortunes can be avoided. \n\nTrump appeared to acknowledge on Thursday that DOGE was moving too fast, just days after praising its government-cutting handiwork during his speech to a joint session of Congress.\n\n“We just had a meeting with most of the secretaries, Elon, and others, and it was a very positive one,” he wrote on Truth Social. “It’s very important that we cut levels down to where they should be, but it’s also important to keep the best and most productive people.”\n\nTrump also clarified, “We say the ‘scalpel’ rather than the ‘hatchet.’” He emphasized that there would be a collaborative process between Musk and the Cabinet secretaries, saying of the latter that as they “learn about, and understand, the people working for the various Departments, they can be very precise as to who will remain, and who will go.”\n\nMusk has also conceded to lawmakers and Cabinet members that DOGE has made mistakes.\n\nWhile Trump concentrated on the parts of his agenda that are broadly popular during his Tuesday night speech as most Democrats refused to clap for the mothers of murder victims and a young cancer survivor, his opponents have labeled him a chaos agent through his decade in national politics.\n\nThere was a growing perception that Musk was being too arbitrary in his federal personnel decisions and that Trump was giving his fellow billionaire too free a hand in government decision-making, even as polls show general support for curtailing wasteful spending.\n\nRepublican lawmakers have reported protests and other examples of anti-DOGE sentiment at their local townhall meetings, to the point where the chief of the House GOP’s campaign arm advised members to avoid such events. Even if the protests are organized by left-wing groups and not always reflective of local opinion, it could be a sign of liberal anger and passion that could carry over into the midterm elections.\n\nTrump’s commitment to tariffs is deeper and has a much longer history than his devotion to DOGE-like budget cuts, but he has also shown sensitivity to drops in the stock market and business community confidence. He campaigned heavily on having delivered low unemployment, respectable economic growth, and no Biden-like inflation during his first term until the pandemic rocked the country in 2020.\n\nIt is possible that neither Trump move is a major departure from his agenda. Previous instances of tariff relief have been short-lived. On Musk, Trump may only be trying to fortify DOGE against legal challenges.\n\nThere is also a chance that Trump’s wild swings will exhaust voters and damage the economy. He can be unpredictable, not always to his own benefit.\n\nBut Trump can also be pragmatic. The midterm elections take place next year. Virginia, which is home to many federal workers, will have statewide elections this November. After a four-year hiatus from the White House, this is Trump’s legacy term.\n\nTrump has moved quickly since returning to office. But he also has a better staff than he did at this point in his first term, which has made the burst of energy more disciplined. Democrats don’t believe that dynamic can last. Time, and Trump, will tell.","summary":"President Donald Trump showed his trademark flexibility Thursday on a pair of issues Democrats have been hoping to use to halt his second-term political momentum. Trump took his first steps toward reining in Elon Musk and the Department of Government Efficiency, telling a hastily convened Cabinet meeting that the Senate-confirmed agency heads will ultimately determine [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3339904/trump-recalibrate-democrats-elon-musk-tariffs/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/03/trump-recalibrate-musk.webp","video":null,"publish_date":"2025-03-07 12:00:00","author":"W. James Antle III","authors":["W. James Antle III"],"language":"en","source_country":"US","sentiment":0.116},{"id":297712028,"title":"Skydance open to hire ‘bias’ monitor to get FCC approval for Paramount merger: sources","text":"Skydance executives are open to the creation of an internal ombudsman for CBS News to assuage Trump administration concerns over bias and most of all, to gain approval for its merger with Shari Redstone’s fading media empire Paramount Global, On The Money has learned.\n\nThe ombudsman concept — essentially a layer of management ensuring that news content remains free of political bias — might appease Federal Communications Commission chair Brendan Carr, who is throttling the deal over concerns of left-wing partisanship at one of the nation’s top TV networks despite its vows of objectivity, according to people with knowledge of the matter.\n\nCarr is weighing his own set of remedies that the parties must agree on to gain his blessing that also include some sort of oversight mechanism at CBS News, these people say.\n\nA source close to Skydance tells On The Money that the ombudsman idea is something that Jeff Shell, the former NBC chief who is slated to run the merged company’s news operations, “would consider and likes.”\n\nA source close to Carr tells On The Money that the FCC chair has “some ideas in mind” for remedies that might end the stalemate. The ombudsman idea, this person said, “echoes” what he’s thinking.\n\nAn FCC spokesman had no comment. A Skydance rep also declined comment.\n\nThe FCC – the primary regulator over the broadcast media business – is a key player in the merger between the independent film company and Paramount. Under federal law, the agency can deny local broadcast licenses to companies and derail mergers when there is evidence that news content violates its so-called “public interest rules.”\n\nThose rules prohibit broadcasting of news over public airwaves (as opposed to cable) that contains obvious political bias. CBS News, a unit of Paramount, has come under fire from conservatives for years over an allegedly left-wing slant in its programming.\n\nLast month, the FCC delayed approval of the $8 billion deal when it launched a bias inquiry into the network. The investigation followed a complaint made by a conservative legal outfit that CBS deceptively edited the controversial Kamala Harris “60 Minutes” interview during the height of the 2024 presidential campaign.\n\nOn The Money has previously reported that barring an acceptable remedy solution, Carr’s investigation could delay his decision on the merger for months and possibly until the second half of the year. The players – including David Ellison, the Skydance chief, and Redstone, the increasingly cash-poor heir to her father Sumner Redstone’s troubled media empire – wanted to get the deal closed by the first quarter of 2025.\n\nRedstone is expected to earn $1.8 billion when the combo is inked. It’s a much-needed financial lifeline to preserve family wealth that has been dissipating as Paramount’s stock has tumbled due to vast structural changes in the media business, including cord cutting.\n\nEllison is the son of the multi-billionaire Oracle co-founder Larry Ellison, a close friend of President Trump. The elder Ellison is behind some of the financing for the transaction that would fulfill his son’s ambitions to emerge as a major player in the media business, tapping into Paramount programming like CBS and the Paramount movie studio and streamlining operations to meet the increasingly difficult operating conditions of the broadcasting business.\n\nDespite the elder Ellison’s friendship with Trump, such ambitions will have to wait until the FCC and Carr are satisfied that the new company will be different from the old one in terms of the alleged political bias in its straight news programming.\n\nThe “60 Minutes”-Harris interview has been steeped in controversy since its airing last Oct. 7. The then-VP and Democrat president nominee — known for her word salad answers when pressed on various public policy issues – gave unusually coherent answers under questioning by correspondent Bill Whitaker.\n\nConservative groups including the Center For American Rights, or CAR, soon discovered that CBS previously had aired a promo of the Harris interview where her answer to a question about the Middle East appeared markedly less coherent.\n\nAs reported, CAR filed a complaint with the FCC that triggered the investigation and ultimately throttled the Skydance-Paramount deal. A recently released transcript of the interview shows that CBS did in fact edit the piece down, though the network has said it did so to meet time constraints.\n\nCarr isn’t impressed with CBS’ denials, and neither is President Trump, sources close to them tell On The Money. Trump, when he was the GOP presidential candidate, filed a $20 billion lawsuit, alleging “60 Minutes” tried to improperly assist the Harris campaign. Trump demanded the release of a full transcript on top of monetary damages. The two sides are said to be conducting settlement negotiations, though it’s unclear how close they are to reaching a deal.\n\nABC recently agreed to pay Trump $15 million to settlement a defamation suit over comments made by correspondent George Stephanopoulos, who said on air that Trump was “found liable for rape” of writer E. Jean Carroll, statements which were false. The settlement money was donated to the Trump presidential library.\n\nEven with the Trump case looming, Carr’s inquiry remains the biggest sticking point in the Skydance-Paramount deal. People close to the FCC investigation say there are no major discussions on a settlement just yet.\n\nThe FCC staff, as reported by On The Money, met with CAR last week to get its views on possible remedies. They included moving some of the new company’s operations out of notoriously progressive enclaves of Los Angeles and New York City and hiring more ideologically diverse people.","summary":"FCC chief Brendan Carr is weighing his own set of remedies that the parties must agree on to gain his blessing.","url":"https://nypost.com/2025/03/07/media/skydance-open-to-hire-bias-monitor-to-get-fcc-approval-for-paramount-merger-sources/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/Paramount-Skydance-Ombudsman.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-07 12:00:00","author":"Charles Gasparino","authors":["Charles Gasparino"],"language":"en","source_country":"us","sentiment":0.142},{"id":297705112,"title":"Macron causes huge issues for EU by acting irrationally — Russia's State Duma speaker","text":"MOSCOW, March 7. /TASS/. French President Emmanuel Macron and other European leaders are trying to cling to power under the guise of ensuring security while creating problems for the European Union (EU), Russia's State Duma Speaker Vyacheslav Volodin said.\n\n\"In order to maintain power, Macron, [British Prime Minister Keir] Starmer, [leader of the Kiev regime Vladimir] Zelensky, [Polish Prime Minister Donald] Tusk need a war in Ukraine. Under the pretense of ensuring the security of European countries. But in reality, they are protecting themselves. This also applies to the EU institutions,\" Volodin wrote on his Telegram channel.\n\nThe speaker of the Russian State Duma (the lower house of Russia's parliament) noted that European Commission President Ursula von der Leyen who talked about plans to rearm Europe and \"announced its militarization does not care about the consequences,\" she is rather busy trying to \"maintain power.\"\n\n\"Macron is also preserving himself. He is acting irrationally. Claiming to be a pan-European leader, he creates huge problems for the EU and France in particular,\" Volodin emphasized.\n\nMacron's statement \"on the need to launch a discussion on the use of nuclear weapons and the continuation of war\" would be a path to a great tragedy that neither the French nor the citizens of other European countries want, Volodin stressed. \"But Macron is pushing for it in order to save himself. Without even considering what it will lead to,\" he added.\n\nVolodin emphasized that US President Donald Trump's coming to power \"was a total shock and surprise for most European leaders who supported [former US leader Joe] Biden and [former US Vice President Kamala] Harris.\" \"But they will have to build a relationship with him, because the US is in NATO and Trump is in world politics,\" he said. \"Diametrically opposed views on key positioning issues\" would make it hard for the current European leaders to support the Republicans if they want to retain power in the US and win the next election. \"The European leaders are well aware of it, but they also want to stay in power,\" Volodin emphasized.","summary":"Macron is \"claiming to be a pan-European leader, he creates huge problems for the EU and France in particular,\" Vyacheslav Volodin emphasized","url":"https://tass.com/politics/1924007","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-03-07 11:39:35","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":0.022},{"id":297686706,"title":"The Democratic Fork in the Road and the Woke Repudiation Imperative | Opinion","text":"Yogi Berra, the mid-century New York Yankees Hall of Fame catcher known for his pithy and often humorous life observations, once famously quipped: \"When you come to a fork in the road, take it.\" It was sound advice, perhaps, for a traveler on the go and in search of a quick meal. But the modern Democratic Party, rudderless and confused and reeling from a pitiful collective performance during Tuesday evening's presidential joint address to Congress, now confronts a fork in the road that's no joke.On the one hand lies the path of least resistance: doubling down on the status quo—the progressive culture-warring, woke/identity politics-driven agenda that has dominated the party ever since Barack Obama upset Hillary Clinton in the 2008 Democratic presidential primary. On the other hand lies the more difficult but ultimately more promising path: repudiation of that post-2008 legacy and a conscientious return to a politics of the prudential center. Which path Democrats choose from here will go a long way toward determining their relevance as a national political party for the foreseeable future.Obama's shocking upset over the madam-president-in-waiting was an inflection point for the institutional trajectory of the Democratic Party. Voters rejected the cultural centrism that was a Clinton-era hallmark in favor of the \"hope\" and \"change\" promised by Obama's \"coalition of the ascendant.\" Initially, perhaps, that may have looked like a smart bet: Obama trounced John McCain in the 2008 presidential general election. But the one-time \"coalition of the ascendant\" transmogrified into an identitarian and deeply off-putting \"coalition of aggrieved interests.\" Culturally militant wokeism eventually reached its pernicious apex during Joe Biden's presidency—which saw the first explicitly \"DEI\" Supreme Court justice selection (Ketanji Brown Jackson, after Biden vowed to nominate a black woman) and a DEI vice presidential running mate (Kamala Harris, after Biden was pressured to choose a black woman).This version of the Democratic Party, which featured the progenitor of wokeism, Obama himself, as the leading presidential campaign trail surrogate for Harris, was thoroughly rejected in November by the American people. It turns out that voters didn't really know what they were signing up for when they embarked on an extended political journey of \"hope\" and \"change.\" They weren't interested—and aren't interested—in legitimizing the juvenile genital mutilation and chemical castration that has been euphemistically sold as \"gender-affirming care.\" They weren't interested—and aren't interested—in assenting to wide-scale importation and resettlement of foreigners whose cultures and customs are antithetical to our own.Some leading Democrats do finally seem to get the memo. Former Clinton strategist James Carville, for instance, has called for Democrats to distance themselves from the excesses of woke civilizational arson. But many others disagree. There is no indication at all, for instance, that the ladies of \"The View\" have done any introspection: Shortly after November's electoral shellacking, cohost Sunny Hostin attributed Harris' loss to Donald Trump to \"racism\" and \"misogyny.\" Surveying the left-of-center punditocracy scene, it often seems that there are far more Hostin-like voices of escalation than there are Carville-like voices of sobriety.Democratic elected officials are also deeply split. California Gov. Gavin Newsom made headlines this week by repudiating certain facets of wokeism during an interview with Charlie Kirk, but congressional Democrats attending Trump's joint address to Congress on Tuesday evening took the opposite approach, well beyond merely refusing to applaud: Rep. Al Green (D-Tex.) obnoxiously heckled the president and was kicked out of the House chamber within the speech's first few minutes—deservedly so. In general, their conduct was positively buffoonish.In what world do Democrats think they do themselves any political favors with these antics and, more important, these underlying substantive political stances? One guest of Trump on Tuesday, Payton McNabb, is a female former high school athlete who was grievously injured during a match against a team with a biological male player. On this issue, recent CNN polling indicates that roughly four-fifths of Americans oppose biological male participation in female athletic competitions. Even Newsom, in his podcast episode with Kirk, called the practice \"deeply unfair.\"Newsom seems to be reading the tea leaves—unlike congressional Democrats. There is a similar divide on the issue of illegal immigration and so-called \"sanctuary\" jurisdictions; consider, for instance, New York City Mayor Eric Adams' high-profile flip on the issue, which has brought him into line with Trump.To make matters even worse, a majority of Democratic elites too often now come across not merely as schoolmarmish and excessively self-righteous—but as heartless and lacking compassion, to boot. Party leaders undoubtedly think of themselves as \"compassionate,\" especially for those perceived as being \"oppressed\" (on the neo-Marxist intersectional scale of victimization status). But where is the compassion for McNabb? Where is the compassion for the family of Laken Riley, the Athens, Georgia student whose life was tragically cut short by an illegal alien who never should have been on our soil?In order to recover their standing and regain lasting relevance as an electorally feasible national political party, Democrats are going to have to repudiate the entirety of their post-2008/post-Obama cultural legacy. That is the simple truth. The American people want a stable pocketbook, a stable border, and a stable world stage. They're not interested in the Obama-Biden-Harris Democratic Party's idiosyncratic conception of waging a culture war.Are Democrats up to such a challenge? The intraparty civil war is on—but I certainly have my doubts. Unless and until they do repudiate their cultural militance, however, Democrats will continue to flounder about in irrelevance. Perhaps they'll need to get their clocks cleaned at the ballot box a few more times. That wouldn't be the worst thing.Josh Hammer is Newsweek senior editor-at-large, host of \"The Josh Hammer Show\" and \"America on Trial with Josh Hammer,\" a syndicated columnist, senior counsel for the Article III Project, a research fellow with the Edmund Burke Foundation, and author of the forthcoming book, Israel and Civilization: The Fate of the Jewish Nation and the Destiny of the West (Radius Book Group, March 18). Subscribe here for \"The Josh Hammer Report,\" a Newsweek newsletter. X: @josh_hammer.The views expressed in this article are the writer's own.","summary":"The American people just want a stable pocketbook, a stable border, and a stable world stage.","url":"https://www.newsweek.com/democratic-fork-road-woke-repudiation-imperative-opinion-2040979","image":"https://d.newsweek.com/en/full/2601094/al-green.jpg","video":null,"publish_date":"2025-03-07 11:00:03","author":"Josh Hammer","authors":["Josh Hammer"],"language":"en","category":"politics","source_country":"us","sentiment":0.238},{"id":297684210,"title":"Trump Was Seen as the 'Crypto King'—MAGA's Bitcoin Dream is Breaking Apart","text":"Donald Trump's promise to make the U.S. the world's \"crypto capital,\" alongside campaign pledges to slash industry regulations, meant his election in November was widely hailed a watershed moment for digital assets.Bringing pro-crypto figures like Howard Lutnick into his administration led many to expect that the president would follow through on these pledges. These expectations were further reinforced by the recent announcement and ensuing executive order on establishing a \"Strategic Bitcoin Reserve and a U.S. Digital Asset Stockpile.\"However, since the beginning of this year, bitcoin's price has declined, along with other major tokens, prompting many to doubt whether the self-anointed \"crypto president\" will truly deliver the industry boom that was hoped.Donald Trump's Crypto HistoryFar from historically supportive, Trump previously referred to cryptocurrencies as \"highly volatile and based on thin air\" in 2019, and to bitcoin as merely \"another currency competing against the dollar\" during his first term.During his run for reelection, however, this stance shifted dramatically. The candidate pledged to end the Biden administration's \"anti-crypto crusade,\" and to position the U.S. as a global leader in this new financial frontier.In the weeks after his victory over Kamala Harris, these statements fueled a surge in positive sentiment around cryptocurrency, driving bitcoin past the once-unimaginable $100,000 mark.Why MAGA's Crypto Dream May Be Breaking ApartWhile his inauguration and subsequent crypto-focused executive orders led many to believe that this trend would continue, cryptocurrencies have experienced significant volatility in the weeks since. Bitcoin fell to below $80,000 for the first time since November last week, with ethereum suffering an even worse fate and seeing all its postelection gains erased.Bitcoin is currently changing hands at around $88,200, down 5.6 percent since the start of the year and 14 percent since Trump's inauguration.\"I think the Trump/Crypto honeymoon was a bit overdone, and so it's good to see some froth come out of the overall market,\" investment strategist and bitcoin advocate Lyn Alden told Newsweek.\"While the price drivers behind BTC can be notoriously hard to predict, a few factors have stood out as possible explanations for why it experienced such a severe crash last week,\" said Yesha Yadav, Milton R. Underwood Professor of Law at Vanderbilt University and former legal counsel to the World Bank.Yadav cited the hack of ByBit, a leading cryptocurrency exchange, as a key reason for bitcoin's recent decline. Approximately $1.5 billion worth of digital currencies were stolen in the attack, which the Federal Bureau of Investigation (FBI) has linked to North Korea, and which \"spooked\" the market, according to Yadav, resulting in significant sell-offs of both bitcoin and ethereum.Both Yadav and Alden also highlighted the general correlation between cryptocurrencies and traditional markets, citing the recent downturn in U.S. stocks as another factor behind the decline.As markets braced for the anticipated impacts of Trump's tariffs on Canada and Mexico, major indexes such as the Dow Jones, Nasdaq composite, and S&P 500 ended a sluggish February with a string of late sell-offs.\"Bitcoin is a very market-driven and liquidity-driven asset, so it tends to swing around with big moves when that happens,\" Alden told Newsweek.Is the Crypto Dream Really Breaking Apart?Although these events have impacted bitcoin's price and sparked doubts about its long-term utility and growth potential, they could be considered exogenous to cryptocurrency itself. Meanwhile, the administration's recent actions indicate that further gains for decentralized currency may still be on the horizon, keeping the Trump-crypto vision alive.On Sunday, the president announced via social media that he had ordered his Working Group on Digital Asset Markets to \"move forward on a Crypto Strategic Reserve.\" Trump said that the stockpile would comprise bitcoin (BTC), ethereum (ETH), as well as XRP, solana (SOL) and cardano (ADA), causing the prices of each token to skyrocket.\"With the crypto market very much in the doldrums last week, the weekend has seen a rapid turnabout,\" Yadav told Newsweek. \"The announcement of a digital asset strategic reserve—not simply consideration of it—has caused a massive surge in buying across major assets like BTC, ETH, XRP, SOL and ADA.\"Yadav added that the language of \"reserves,\" as opposed to previous references to \"stockpiles,\" \"suggests perhaps that the U.S. may emerge as a major buyer of these assets down the line.\"As well as the temporary price increases, most of which have now tempered despite Thursday's executive order, the announcement has been viewed by some as proof that Trump's promises on crypto were not empty, and that crypto has fully broken into the mainstream asset classes and shed its political stigma.Geoffrey Kendrick, Global Head of Digital Assets at Standard Chartered, described the move as the \"first solid data point of a 'Trump put' for crypto,\" meaning a government-backed safety net preventing these five currencies from seeing disastrous declines. As a result, Kendrick told crypto-focused outlet The Block that he had reaffirmed his target of $500,000 for bitcoin. Others, however, have criticized the idea of a government-run crypto reserve as antithetical to the purpose of decentralized currency and a poor use of taxpayer funds.However, the five currencies singled out by Trump are likely to get a further boost on Friday, according to Yadav, when the White House is scheduled to host its first ever Crypto Summit, with many notable individuals from the crypto space scheduled to attend.What Happens Next?Cryptocurrency still has its detractors, likely emboldened by last week's declines and skeptical of the promise of Trump's national reserve, which would almost certainly need Congressional approval.\"Crypto has no fundamentals. It's pure speculation. Bitcoin has no use case. So the price is entirely made of shenanigans,\" said David Gerard, crypto historian and author of the 2017 book \"Attack of the 50 Foot Blockchain.\"Looking ahead, Gerard told Newsweek that bitcoin's price \"could do anything,\" but will be determined by the number of \"prospective new suckers who will trade their actual dollars for some magic beans.\"Others, however, believe the crypto dream is very much alive, and that bitcoin can recover from last week's struggles and reach even greater heights in the near future.\"I don't invest based on hope, but my assessment of bitcoin continues to be long-term bullish, and I expect it to reclaim $100k and continue higher from there,\" said Lyn Alden.\"Whether that will happen in 2025 or not is a very different matter,\" she added. \"That will be highly reliant on overall liquidity conditions and any moves or lack thereof from the Trump administration about potential bitcoin purchases.\"","summary":"To many, the president has yet to deliver on his promise to make the U.S. the \"crypto capital of the world.\"","url":"https://www.newsweek.com/trump-maga-bitcoin-dream-breaking-apart-2040061","image":"https://d.newsweek.com/en/full/2599163/trumps-bitcoin-dream-breaking-apart.png","video":null,"publish_date":"2025-03-07 10:48:08","author":"Hugh Cameron","authors":["Hugh Cameron"],"language":"en","source_country":"US","sentiment":-0.219}]}