{"offset":0,"number":50,"available":249,"news":[{"id":352282318,"title":"White House launches official TikTok account as Trump's deadline to ban app looms","text":"The White House launched an official TikTok account on Tuesday, less than a month before President Trump's deadline for the social media app — owned by China-based ByteDance — to either find a new owner or face a U.S.-wide ban. The account posted its first video Tuesday afternoon: a 27-second montage of videos of Mr. Trump waking and speaking with supporters, overlaid with audio from his acceptance speech at the 2016 Republican National Convention.\"America we are BACK! What's up TikTok?\" reads the caption to the video, which drew more than 90,000 views in just over an hour.TikTok faces an uncertain future in the United States amid worries about national security. Under a law signed by former President Joe Biden last year, ByteDance was required to either sell TikTok's U.S. operations by Jan. 19 or face a ban from app stores. But Mr. Trump has repeatedly extended that deadline, giving ByteDance more time to find a buyer.The most recent extension runs out on Sept. 17. It's unclear if Mr. Trump is planning on extending the deadline again.When the last extension was granted in mid-June, White House press secretary Karoline Leavitt said at the time that the administration was \"working to ensure this deal is closed so that the American people can continue to use TikTok with the assurance that their data is safe and secure.\"CBS News has reached out to the White House. Members of both parties have expressed concerns about TikTok, arguing its Beijing-based parent company could be forced to share U.S. users' data with the Chinese government, or could manipulate the types of content promoted by the app's powerful algorithm to advance China's foreign policy goals. TikTok has long denied that it's subject to the Chinese government's whims, and has said American user data is stored on U.S. servers.Mr. Trump's views on TikTok have shifted in recent years. He tried to ban the app during his first term, citing national security risks, but reversed course during the 2024 presidential race, arguing a ban on TikTok would only empower Facebook. Both Mr. Trump and his Democratic opponent, former Vice President Kamala Harris, had active campaign TikTok accounts last year.","summary":"The White House launched an official TikTok account on Tuesday, less than a month before a Sept. 17 deadline for the app to either find a new owner or face a U.S.-wide ban.","url":"https://www.cbsnews.com/news/white-house-official-tiktok-account-trump-deadline-ban-app-looms/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/08/19/280baaa8-66f6-4b11-b55f-7e159f463ac4/thumbnail/1200x630/b2f529ecb2244e2658ecfb4bd343d95b/gettyimages-2229952821.jpg","video":null,"publish_date":"2025-08-19 23:42:26","author":"Joe Walsh","authors":["Joe Walsh"],"language":"en","category":"politics","source_country":"us","sentiment":0.016},{"id":352261444,"title":"Hunter Biden's interviewer reveals details about NY Times killing his op-ed amid Melania Trump suit","text":"The Times, they are a-changin’ their mind. \"Channel 5\" host Andrew Callaghan is opening up about The New York Times’ last-minute decision to pull his op-ed, giving Fox News Digital exclusive details on how it all unfolded. Callaghan revealed he had written a planned opinion piece for the Times that was set to be published the same day he posted Hunter Biden’s defiant response to Melania Trump’s lawsuit threat. However, plans unraveled when the paper abruptly pulled the plug. \"It really wasn't much of a critical piece. It just addressed the lawsuit. I've been working with [The New York Times] for like three weeks. We had near-daily meetings. I was just really excited. And then 24 hours before it was supposed to come out — and it was supposed to be timed exactly with the release of the Hunter Biden lawsuit response — they just said, ‘Hey, sorry, we have to pick our battles here, we can’t put this out,’\" Callaghan told Fox News Digital. FIRST LADY MELANIA TRUMP PUTS HUNTER BIDEN ON $1B NOTICE OVER 'FALSE, DEFAMATORY' EPSTEIN COMMENTS The independent journalist, whose YouTube channel has over 3 million subscribers, told Fox News Digital that a member of The New York Times' editorial staff informed him that his op-ed was cut. Callaghan believes the decision to kill his piece was made by someone higher up, and not by anyone he was working with. The op-ed was set to focus on \"the pitfalls of new media,\" and was meant to be a \"survival guide\" for new journalists navigating the treacherous waters of social media algorithms that, Callaghan noted, all too often reward \"salacious clickbait\" and \"reactionary, fear-mongering\" content. Yet, after multiple rounds of edits, the Times informed Callaghan that they were pulling his article. \"It was very disappointing, not only for me, but my mom subscribes to it and so does my grandma. I told them, ‘Like, yo, this s--- is going to come out.’ And then they were just like, I don't know, just this feeling of like, ‘What?’\" he said. HUNTER BIDEN DELIVERS PROFANITY-LACED RESPONSE TO MELANIA TRUMP'S $1B NOTICE FOR 'DEFAMATORY' EPSTEIN REMARKS Callaghan attributes the Times’ decision to the \"climate of fear\" created by the Trump family, which has aggressively pursued litigation against media outlets in recent months. President Donald Trump reached a $16 million settlement with Paramount after he sued, alleging that an episode of \"60 Minutes\" committed election interference by deceptively editing former Vice President Kamala Harris to make her sound more coherent in an interview which aired prior to the 2024 election. The Daily Beast also recently withdrew an article that alleged that Melania and Trump met through Epstein, which relied on comments from author Michael Wolff made on a podcast. Though Callaghan is an independent journalist who earns his living primarily through Patreon, he hasn’t been immune from the Trumps' ire. Melania threatened Hunter Biden with a $1 billion lawsuit over the controversial claims he made on Callaghan’s program last month. The former \"All Gas No Brakes\" host called the amount \"preposterous.\" DAILY BEAST PULLS STORY ALLEGING MELANIA-EPSTEIN CONNECTION AFTER LAWYERS DISPUTE FRAMING \"The Trump administration has had tension and has received some pretty rough treatment from a lot of these mainstream outlets throughout the past eight years. So, it kind of made sense why Trump would want to settle the scores with his historic ‘fake news enemies.’ But I didn't expect new media to be a part of this purge,\" Callaghan told Fox News Digital. Hunter, who was issued a wide-ranging pardon by his father after he was found guilty on federal gun and tax charges, alleged that Donald Trump and the first lady were introduced to each other by disgraced New York financier Jeffrey Epstein on an August 5 \"Channel 5\" episode. This accusation prompted Melania to threaten legal action against Hunter, calling on him to recant his claims and get Callaghan to pull the episode off the internet. Callaghan said he felt that Trump was trying to \"leverage pressure on me through Hunter\" via the lawsuit threat. \"Epstein introduced Melania to Trump. The connections are like so wide and deep,\" Hunter told Callaghan. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Melania’s attorney, Alejandro Brito, wrote that he would sue Hunter for $1 billion unless he retracted his \"false, disparaging, defamatory, and inflammatory statements.\" Hunter refused to acquiesce to the first lady’s demands in a subsequent interview on the program, and cited Wolff as the source of his claims. \"F--- that. That's not gonna happen,\" Hunter told Callaghan in an August 14 interview. \"I have this to say to them: if they want to sit down for a deposition and clarify the nature of the relationship between Jeffrey Epstein — if the president, the first lady, want to do that, and all of the known associates around them at the time of whatever time that they met – I'm more than happy to provide them the platform to be able to do it,\" Hunter told Callaghan. Callaghan told Fox News Digital he had pushed Hunter’s response forward two days to coincide with the publication of his op-ed and even declined to give a comment to any other publications in order to be a good \"team player\" with the Times. He also said he’s disappointed by what he perceives to be legacy media cowardice in the face of political attacks against the fourth estate — a phrase often used to describe the press. HOW TRUMP SUED CBS AND WON: THE '60 MINUTES' SETTLEMENT THAT ROCKED THE MEDIA WORLD, EXPLAINED \"The press is afraid of the president? The whole purpose of the fourth estate in the first place was to hold the other three branches of government accountable. That was the only point of it. It was supposed to be that safeguard against government overreach and press suppression,\" Callaghan told Fox News Digital. Despite the setback, Callaghan said he enjoyed the experience of working with the Times, and empathized with their predicament. \"It's not as if The New York Times has an infinite war chest of money to go to war with the president's team, because the president and those people, they have unlimited resources. But overall, it was a good experience working with the New York Times, like to kind of be able to pull back the curtain and see what it's like. They were actually really courteous and nice to me,\" Callaghan said. CLICK HERE TO GET THE FOX NEWS APP \"Editors in Times Opinion are in conversation with a large number of writers all the time on potential guest essays, but these discussions don't always result in publication for a number of reasons including scheduling, news relevance or when the submissions don't meet The Times's standards. We don't have a comment on why any one submission was or wasn't selected for publication, but any fair reading of our report will show we haven't shied away from guest essays that challenge the Trump administration,\" a representative for the New York Times said in a statement to Fox News Digital. The White House did not immediately respond to a request for comment.","summary":"Independent journalist Andrew Callaghan reveals New York Times canceled his column about new media pitfalls following Hunter Biden&apos;s Epstein claims about Melania Trump","url":"https://www.foxnews.com/media/hunter-bidens-interviewer-reveals-details-about-ny-times-killing-his-op-ed-amid-melania-trump-suit","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/hunter-andrew-melania-3.jpg","video":"https://www.foxnews.com/video/6375930506112","publish_date":"2025-08-19 23:00:34","author":"David Spector","authors":["David Spector"],"language":"en","category":"politics","source_country":"us","sentiment":-0.396},{"id":352276316,"title":"Blue cities are reminiscent of the creature in ‘Alien’","text":"Once, cities were fun.\n\nI used to love walking around the District of Columbia, visiting sites such as the National Archives Building and the Lincoln Memorial, paeans in stone to our greatness.\n\nEvery city had its unique charm: New York’s Rockefeller Center, Seattle’s Pike Place Market and Fisherman’s Wharf in San Francisco.\n\nNow it takes a hardy soul to visit America’s once proud cities without an armed escort.\n\nSongs were written about our cities in their heyday: “New York, New York – It’s a Wonderful Town,” “Chicago, Chicago!” and “I Left My Heart in San Francisco.” Today, you could leave your wallet and car there too.\n\nOur cities have become the face of the Democratic Party, akin to the creature in “Alien” on a bad hair day.\n\nEven though they are manifest failures, cities determine the politics of many states.\n\nWithout the five boroughs and a few upstate counties, New York state would be solidly red. Absent Los Angeles, San Diego and San Francisco, California still would be the type of state that twice-elected Ronald Reagan governor.\n\nIn 1800, Thomas Jefferson – ironically, the founder of the Democratic Party – wrote, “I view great cities as pestilential to the morals, the health and the liberties of man.” That was before homeless encampments, open-air drug markets, racial mobs and sanctuary cities.\n\nToday, our municipalities are noted for punitive taxes, rampant crime, abject poverty, failed schools, waste and corruption. From 2013 to 2023, Chicago’s commercial property taxes jumped 93%.\n\nNew York mayoral candidate Zohran Mamdani – with his free bus service, no-cost child care and municipal grocery stores – is merely the next logical step in the devolution of urban America.\n\nCrime is the most visible sign of urban decay. The District’s homicide rate is five times higher than Mexico City’s. In 2024, there were 1,026 assaults with a dangerous weapon in our nation’s capital. That’s after officials cooked the books to make the crime rate seem lower.\n\nNationally, shoplifting was up 54% in 2021. Former Chicago Mayor Lori Lightfoot blamed store owners for not keeping high-end merchandise locked up, which is like blaming rape victims for being vulnerable.\n\nSome mayors belong in a perp walk. Chicago Mayor Brandon Johnson blames youth crime on “a sense of hopelessness.” Los Angeles Mayor Karen Bass fiddled around in Ghana while L.A. burned.\n\nFor big cities, the standard solution to any problem is to throw tons of money at it.\n\nOn an average night in 2024, there were 771,450 homeless in the United States. San Francisco spends $1 billion annually on its homeless population, which has grown 32% since 2010.\n\nWith homelessness comes crime, addiction, disease and mental illness. Two-thirds of the homeless are addicts or alcoholics. City streets have been turned into toilets. San Francisco posts maps to help pedestrians navigate piles of human feces.\n\nCities that once educated generations of immigrants now are illiteracy factories. In 2020, the Illinois Department of Education estimated that only 1 in 10 Chicago schools had students reading or doing math at grade level.\n\nBlue cities have spurred urban flight. From 2020 to 2022, more than 2 million left our 10 largest cities.\n\nOnly one of our 15 largest cities has a Republican mayor. The Windy City elected its last Republican mayor in 1927.\n\nMany prominent Democrats started in municipal politics, then went on to ruin other things. Former Vice President Kamala Harris was a San Francisco district attorney. California Gov. Gavin Newsom was its mayor. Former Transportation Secretary Pete Buttigieg was the mayor of South Bend, Indiana.\n\nHow did big cities become liberal welfare plantations?\n\nUrban machines are a Democratic invention started by Boss Tweed. As more productive urbanites left for red states, those remaining were increasingly impoverished and easily manipulated.\n\nHandouts always have special appeal for big-city voters, hence Mr. Mamdani’s standing in the polls.\n\nAfter a string of high-profile homicides and assaults, President Trump deployed 800 National Guard troops to the District last week. Democrats are squawking about the Trump “dictatorship” as if the first thing Adolf Hitler did on coming to power was to stop carjackings in Berlin.\n\nThe head of the D.C. Police Union, who acknowledges “crime is out of control,” stands with the president.\n\nMr. Trump spent most of his career doing business in America’s biggest and busiest city. (Trump Tower is not located in Tupelo, Mississippi.) If anyone is up to the task of bringing sanity to urban America, it’s the 47th president of the United States.\n\nThis column was first published at the Washington Times.","summary":"'Zohran Mamdani is merely the next logical step in the devolution of urban America'","url":"https://www.wnd.com/2025/08/blue-cities-are-reminiscent-creature-alien/","image":"https://www.wnd.com/wp-content/uploads/2019/06/chicago-willis-tower-skyscraper-skydeck-city-building-pixabay.jpg","video":null,"publish_date":"2025-08-19 22:50:22","author":"Don Feder","authors":["Don Feder"],"language":"en","source_country":"us","sentiment":-0.067},{"id":352284582,"title":"Marjorie Taylor Greene reveals how her friendship ended with Laura Loomer","text":"Representative Marjorie Taylor Greene has explained why she’s no longer friends with Laura Loomer, a MAGA activist, conspiracy theorist and self-described “proud Islamophobe.”\n\nGreene, a right-wing lawmaker from Georgia, opened up about her long-standing rivalry with Loomer on Tuesday during an episode of The Megyn Kelly Show. Megyn Kelly, a conservative podcaster and former Fox News host, brought up their feud and asked Greene if she fell out with Loomer over their differing opinions on Israel.\n\nLoomer is a strong supporter of Israel, while Greene has said the U.S. should not intervene in foreign wars and has even called Israel’s war in Gaza a “genocide.” However, Greene told Kelly that wasn’t the reason their friendship ended.\n\nGreene said she was once friends with Loomer and even endorsed her failed 2020 Congressional bid in Florida. Their relationship took a turn when Loomer tried — and failed — to unseat GOP Representative Daniel Webster in a different Florida district in 2022, Greene explained.\n\n“The second time she decided to run, she jumped a district and wanted to run against Daniel Webster, who is actually a conservative Republican,” Greene said. “And I said, ‘Hey, Laura, I don't think you should run against Daniel Webster. I don't think you can beat him. Why don't you jump to another district where there's an open seat, and you'll have a much better shot.’”\n\n“Well, she refused,” Greene added. “She said no, she would not listen to anybody…So I said, ‘I can't get involved. I'm not going to endorse against him. I'm going to stay out.’ Well, she was furious at me, and then everything kind of plummeted from there.”\n\nGreene went on to accuse Loomer of attacking Trump’s “most loyal” allies “all the time.” \n\n“She attacks some of the most loyal people to the president, people that are unapologetically America first…Those of us that fight the hardest, for some reason, she attacks us the most,” Greene said.\n\nThe Independent has contacted Loomer for comment.\n\nLoomer and Greene often trade insults online. Earlier this month, Loomer accused Greene of corruption and claimed the lawmaker is using campaign funds to keep her daughter, who lives in Texas, on the payroll. Greene did not respond to The Independent’s request for comment last week. \n\nIn September, Greene accused the MAGA activist of making an “extremely racist” post after Loomer said that “the White House will smell like curry and White House speeches will be facilitated via a call center” if former Vice President Kamala Harris won the 2024 election.\n\n“It does not represent who we are as Republicans or MAGA. This does not represent President Trump. This type of behavior should not be tolerated ever,” Greene said of Loomer’s post.\n\nGreene also told Kelly about her feud with Democratic Representative Jasmine Crockett, claiming the Texas lawmaker “treats her staff like they are just beneath her.”\n\nGreene also recounted her public sparring with Crockett last year. During a House Oversight Committee meeting in May 2024, Greene told Crockett, “I think your fake eyelashes are messing up what you’re reading.” Crockett later fired back, saying Greene has a “bleach blonde bad built butch body.” \n\nGreene told Kelly she found the remark “hilarious.”\n\nOther Republicans have also sparred with Crockett, including President Donald Trump, who recently claimed she is one of the Democratic Party’s “low IQ” members.\n\nThe Independent has contacted Crockett for comment.","summary":"Marjorie Taylor Greene and Laura Loomer have long feuded despite their shared MAGA views","url":"https://www.independent.co.uk/news/world/americas/us-politics/marjorie-taylor-greene-laura-loomer-feud-b2810659.html","image":"https://static.independent.co.uk/2025/08/13/0/35/Screenshot-2025-08-12-at-8-42-21-PM.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/M8J0M8oX-4VHSaSK0.mp4","publish_date":"2025-08-19 22:47:55","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","source_country":"gb","sentiment":-0.397},{"id":352243190,"title":"Who Is Brave Enough To Stand With Texas State Rep. Nicole Collier?","text":"Source: Jim Vondruska / Getty History is never defined by those who protested on the sidewalks. Or those who shout from the sidelines. Or make pithy posts about what should happen. Those people choose the safety of obeying the law as they protest the obscenity of those very laws. There’s not a lot of courage in that, and no one remembers them. History is instead defined by those who walk off the sidewalk and into the streets to protest the existence of unfair processes, traditions, laws, and confront those who aim to put them under the heel of those laws. It is not about cooperating with the machine that produces these things, but disrupting the machine itself. Mario Savio, the 1960s Berkeley student who famously protested the lack of free speech at Berkeley by jumping on top of a police car, eloquently stated it. “There’s a time when the operation of the machine becomes so odious, makes you so sick at heart that you can’t take part! You can’t even passively take part! And you’ve got to put your bodies upon the gears and upon the wheels, upon the levers, upon all the apparatus — and you’ve got to make it stop! And you’ve got to indicate to the people who run it, to the people who own it — that unless you’re free the machine will be prevented from working at all!!” And that brings me to the machinery of Texas state politics and the undemocratic gerrymandering that Republican Governor Greg Abbott wants to do to give his political puppetmaster, Donald Trump, five Republican seats. To do it, Abbott and the Texas legislature needed a quorum, so to prevent that, Democratic legislative members fled the state for two weeks. Threatened with hundreds of thousands in fines, and with the state requesting federal intervention by the FBI to find and bring them back to the state, the Texas Democrats returned to the state after the Texas legislature ended their special session without a quorum, preventing a vote on the racist redistricting. Also, California Governor Gavin Newsom effectively stymied the Texas move by announcing that California would add five seats to counter Texas’s move. And so they came back, but with a caveat from the Republican led legislature. They were told that to leave the chamber, they’d have to be released into the custody of a public service office, and sign a permission slip acknowledging that they were to be in that custody. But Texas state representative Nicole Collier said no and refused to leave. She ‘stepped into the street,’ while others stayed on the sidewalk. After refusing the police escort or signing a release allowing herself to be in their custody, the Texas legislature locked Collier in the chamber, where she’ll stay until Wednesday, when the legislature meets again to process its racist agenda. “This is just my way of resisting,” Texas state Rep. Nicole Collier said to the Washington Post. There’s something obscenely poetic that a Black woman is the one who has the resolve to stand in the street, put her body on the gears of the machine, and to, as the kids like to say, stand on business, while everyone else acquiesces. That level of courage comes from understanding that as a Black woman, you walk this earth with few allies other than your courage and intelligence. But like Rep Collier, when you choose to lead, often when you look to see who’s following, the stage is empty. But that’s okay. “At what point, what is it going to take for us to say ‘enough is enough?’ Yesterday was my moment. Enough is enough,” Collier said in an interview with the Washington Post. “I see it. The writing is on the wall. They want power at all costs. And you’re not taking it from me without a fight.” Each attack on Black women, whether it be Trump attacking Texas Congresswoman Jazmine Crockett; or the GOP, and not a few white Democrats, denigrating former vice president Kamala Harris; or the fact that Black women are the top target being hurt by cuts to federal jobs during the Elon Musk led DOGE cuts, is a marker that twenty million Black women will not forget. And like Texas State Representative Collier, they’ll head to the midterm polls not because of a loyalty to the Democratic Party or even a hatred of the Republican Party. They’ll go because they know that to empower themselves, to prevent GOP racists from disenfranchising them, they’ll need to speak up for themselves because no one else will. So Rep. Nicole Collier now sits and sleeps in the chamber, but she’s not about to let them get her down. While her lawyers fight the detention, she made herself right at home, complete with a bonnet to protect her beautiful, black hair. In the tradition of Black folks everywhere, Texas Rep. Collier may have been stripped of her right to leave, but she’s not stripped of her right to make do with the situation as she sees it. “My community has sent me here to be a fighter, and this is the way that I am fighting. They’re taking away our vote,” Collier added, in an interview with the Washington Post. “I’m not going to let them take away my voice.” Fighting a fascist government requires more people acting like Collier, willing to stand for what’s right. To put their bodies on the gears of the machine. To stand in the street while others are on the sidewalk. Only then do you defeat those who’d marginalize you. Who’d disenfranchise you. Who’d convince you that your power is illusionary. Because if you don’t resist, they win. And in that way, Rep. Collier has already won and will be remembered long after the hoary policies of racist Texas legislatures are condemned to the dustbin of history. And as usual, in the tradition of Fannie Lou Hamer, it will be Black women who are ‘sick and tired of being sick and tired,’ and yet will still step into that street. The question is whether anyone will be behind them in support. Are you courageous enough to stand behind her? Lawrence Ross is the author of “The Divine Nine: The History of African American Fraternities and Sororities” and “Blackballed: The Black & White Politics of Race on America’s Campuses.” He’s also the founder of TheMetaphorClub.com, a new social media platform that emphasizes community, selflessness, and authentic relationships. He lives in Los Angeles with his wife, April. SEE ALSO: Texas Rep. Nicole Collier Being Held Hostage At State House Political Prisoner Rep. Nicole Collier Defies Republicans","summary":"In this op-ed, Lawrence Ross discusses the political imprisonment of Texas State Rep. Nicole Collier and the need to be brave enough to resist fascism.","url":"https://newsone.com/6394793/who-is-brave-enough-to-stand-with-rep-nicole-collier/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/08/17556390225043.jpg?quality=80&strip=all&w=1024&crop=0,0,100,682px","video":null,"publish_date":"2025-08-19 22:30:00","author":"Lawrence Ross","authors":["Lawrence Ross"],"language":"en","source_country":"US","sentiment":-0.255},{"id":352214724,"title":"Trump yanks security clearances from 37 intelligence officials who ‘have abused the public trust’","text":"“The President has directed that, effective immediately, the security clearances of the following 37 individuals are revoked,” a memo posted by Gabbard stated.\n\n“Their access to classified systems, facilities, materials, and information is to be terminated forthwith. Any contracts or employment with the U.S. Government by these 37 individuals is hereby terminated. Any credentials held by these individuals must be surrendered to the appropriate security officers,” it added.\n\nSome of the officials affected were involved in the January 2017 intelligence community assessment ordered by then-President Barack Obama. The report was meant to undermine Trump’s 2016 election victory by suggesting Russia interfered to help him defeat Hillary Clinton without evidence. Gabbard made this case when she declassified new evidence of the assessment last month.\n\nAmong the 37 people whose security clearances were revoked are Stephanie O’Sullivan and Vinh Nguyen, both of whom assisted former Director of National Intelligence James Clapper in creating the 2017 intelligence report on Russia’s alleged collusion with Trump.\n\nAlso on the list were Andrew Cedar and Andrew Miller, among the national security officials who signed a September 2019 letter supporting the first impeachment inquiry into Trump. Miller, who served on Obama’s National Security Council, later worked for the Biden administration at the State Department as a specialist in Israeli-Palestinian affairs.\n\n“Being entrusted with a security clearance is a privilege, not a right,” Gabbard said. “Those in the Intelligence Community who betray their oath to the Constitution and put their own interests ahead of the interests of the American people have broken the sacred trust they promised to uphold.”\n\n“Our Intelligence Community must be committed to upholding the values and principles enshrined in the U.S. Constitution and maintain a laser-like focus on our mission of ensuring the safety, security, and freedom of the American people,” she added.\n\nCritics took issue with Tuesday’s action, arguing it acts as a form of political retribution against intelligence officials who have opposed Trump.\n\nGABBARD REVOKES SECURITY CLEARANCES FOR BRAGG, BLINKEN, AND OTHER BIDEN OFFICIALS\n\n“Pure politicization of security clearance process,” national security lawyer Mark Zaid, whose security clearance was revoked by Trump earlier this year, wrote on X. “These are unlawful decisions that deviate from decades of precedent. Completely unprofessional that individuals are targeted in way that impacts their careers, yet they are not notified before leaking memo to friendly media.”\n\nIn March, the president revoked several clearances belonging to former President Joe Biden, former Vice President Kamala Harris, former Secretary of State Antony Blinken, Zaid, and others perceived as Trump’s political opponents. Zaid, who specializes in national security and whistleblower cases, later sued the Trump administration over the retaliatory move.","summary":"President Donald Trump has pulled security clearances from 37 current and former intelligence officials who, according to Director of National Intelligence Tulsi Gabbard, &#8220;have abused the public trust.&#8221; Gabbard announced the revocation of the more than three dozen security clearances on Tuesday. The Trump-appointed head of the intelligence community accused the officials of politicizing or [&#8230;]","url":"https://www.washingtonexaminer.com/policy/national-security/3760888/trump-gabbard-security-clearances-37-intelligence-officials/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25204667228746.jpg?w=696","video":null,"publish_date":"2025-08-19 22:29:12","author":"David Zimmermann","authors":["David Zimmermann"],"language":"en","category":"politics","source_country":"US","sentiment":0.009},{"id":352280944,"title":"Exclusive: White House launches official TikTok account - Reuters","text":"WASHINGTON, Aug 19 (Reuters) - The White House launched an official TikTok account on Tuesday, taking advantage of its more than 150 million U.S. users to spread the messages of President Donald Trump.\n\nTrump has a soft spot for the popular app, crediting it with helping him gain support among young voters when he defeated Democrat Kamala Harris in the November 2024 presidential election.\n\nPast intelligence assessments have said the short video app's owners are beholden to the Chinese government and that it could be used to influence Americans.\n\nAdvertisement · Scroll to continue\n\n“The Trump administration is committed to communicating the historic successes President Trump has delivered to the American people with as many audiences and platforms as possible,\" White House press secretary Karoline Leavitt said as the site went live.\n\n\"President Trump’s message dominated TikTok during his presidential campaign, and we’re excited to build upon those successes and communicate in a way no other administration has before,” she said.\n\nThe account, @whitehouse, began operation on Tuesday evening, with the aim of communicating the president's policies, a White House official said.\n\nReporting By Steve Holland; Editing by Colleen Jenkins, Leslie Adler, Rod Nickel\n\nPurchase Licensing Rights","summary":"Exclusive: White House launches official TikTok account  Reuters","url":"https://www.reuters.com/world/us/white-house-launches-official-tiktok-account-2025-08-19/","image":"https://www.reuters.com/resizer/v2/JMSNRTLFWJNNXCMLRPHVTCYDFE.jpg?auth=834b3eac35f0f28625a83d818df1ddafa6d148b1a413146b875c303df0d25944&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-08-19 21:53:10","author":"Steve Holland","authors":["Steve Holland"],"language":"en","category":"politics","source_country":"gb","sentiment":0.218},{"id":352214710,"title":"John Kennedy says Trump is not talking ‘enough’ about inflation","text":"However, Kennedy said Mamdani’s solution, “neo-socialism,” will only make the city’s inflation “worse.”\n\n“But in my opinion, and I’ve said this to him myself, President Trump is not talking enough about the economy and specifically inflation. People are tired of paying more to live worse. Republicans promised to get prices down. There are things we can do to do that that we are doing, but I don’t [think] the president’s talking about it enough,” Kennedy said on NewsNation’s On Balance with Leland Vittert.\n\nKennedy said Trump’s “never really liked” to discuss the economy “as long as I’ve known him.” The senator also listed other topics Trump “loves” talking about, such as reorganizing government, foreign affairs, and crime.\n\nKennedy said the president won the 2024 election because “Trump represented hope,” while former Vice President Kamala Harris “represented more hurt.” He added that the economy was a major factor in the contrast between the two candidates.\n\nKennedy said if he were Trump, he’d explain to the voting public that inflation dropping only means the price of goods isn’t going up as quickly as before. He’d also preview steps to lower the cost of living, such as deregulating the economy and getting “control” of the nation’s spending. \n\nIt’s possible the Democratic Party could lean on the economy ahead of the 2026 midterm elections. Republicans only have a small majority in the House of Representatives and a three-seat majority in the Senate. \n\nDemocratic strategist Stefan Hankin told the Washington Examiner such a focus needs to be “forward-looking” and about how younger people are “getting screwed.”","summary":"Sen. John Kennedy (R-LA) said voters are “tired of paying more to live worse” on Monday, and encouraged President Donald Trump and the Republican Party to deliver on lowering the cost of living. Kennedy said Democratic New York City mayoral nominee Zohran Mamdani is “probably” going to win the city’s general election, mainly because the [&#8230;]","url":"https://www.washingtonexaminer.com/policy/economy/3760796/john-kennedy-inflation-trump-not-talking-enough-about/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25212640487111.jpg?w=696","video":null,"publish_date":"2025-08-19 21:38:13","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.535},{"id":352293810,"title":"Hey, Teacher: Leave Them Kids Alone! 5 Things That Bug Me About School","text":"Well, well, well. It's another glorious Tuesday, which means it's time to get our complainin' on with another edition of The Gripe Report! This week, I was seeing tons of posts on social media and in the news about kids going back to school. If the youngsters in your neck of the woods haven't headed back to school yet, they will in due time. It got me thinking about how your perception of this time of year changes as you get older, and depending on what your life is like. Have a gripe? Send it in!: matthew.reigle@outkick.com When I was a school-aged kid, I think this time of year was about as depressed as I'd get all year long. It was brutal. Another fun summer of swimming pools, hanging with friends, and sleeping until noon was gone. However, as a 30-year-old who's about to get married and is one-half of a DINK couple (Dual-Income, No Kids), I don't know that I've ever been happier than I have the last week or so. My community swimming pool? Empty? The neighborhood? Quiet? I went out last night, and an area that is normally teaming with tourists was as dead as I had ever seen it because no parents are pulling their kids out of the first week of school to vacation in Central Florida. It's bliss. But I was also thinking about how much there is to gripe about when it comes to school, both as an adult and as a kid, so I figured that's what we'd do this week. Why? Because I make the rules, that's why! One more outburst like that, and I'll hit your knuckles with a yardstick, mister! On second thought, you're getting a week's detention! Buses Before you can start griping about school, you have to get there, and there’s no better way to do that than by riding the bus. Oh, wait; yes, there is: literally anything is better than the school bus. Walking, getting a ride to school from your parents, riding a bike, riding a scooter, getting shot out of a cannon like a carny, etc. The only person who has ever openly admitted to liking school buses is Vice President Kamala Harris, and only someone as unpopular as her could have such an absurd opinion. I couldn’t stand the bus when I had to ride it, and I can't stand them now when I get stuck behind them when I’m out driving. It’s terrible. You load a bunch of hellions finally freed from the shackles of a day of book learnin’, cram them in a big metal tube, and then some poor sap has to drive said big metal tube, all while making sure the kids don’t cause some kind of trouble. Every year around this time, I see news stories about how there’s a shortage of school bus drivers. How could that be?! Oh, because it's one of the worst jobs on the planet. If someone said to me, \"Matt — looking good by the way; you been dieting? — You either have to drive a bus full of middle schoolers to and from school for a year or go crab fishing on the Bering Strait,\" I'd have my rubber crab fishing suit on before they had even finished that sentence. Running Into School Pick Up Lines Now, a bus alternative is to drive your kid to school, and that's all well and good, but why do so many school pickup lines cause traffic on par with trying to leave the stadium after a football game? I have a pretty good idea of where the trouble spots are, but it never fails that sometimes we forget that. Between our house and the afternoon veterinarian appointment lies an elementary school with a pickup line the likes of which the road out front is not prepared to handle. I've been burned so many times by this sort of thing, and I swear, some of the parents in that line drive like the only time they ever get behind the wheel of an automobile is to shuttle their ̶h̶e̶l̶l̶i̶o̶n̶s̶ little angels to and from school. There's got to be a better way. Some of us DINKs work from home but have to run our French bulldogs to the vet for an allergy shot, then grab lunch at the avocado toast place on the way home… I know, I hate us too. Dreams About High School When You’re In Your Thirties We all have recurring dreams, and for some reason, it seems to be super common for these to have something to do with school. I have one school dream so frequently, I wish I could figure out what it means. It’s always some version of this: I’m back in high school, but for some reason I’ve forgotten all semester long that I have a second-period math class and haven’t been going. I can’t go to the class because the teacher is going to make a big deal of how \"It’s such a privilege to have Mr. Reigle join us for once.\" But while he’s right about that, it’s super embarrassing for me, and it’ll also make me realize I’m going to fail the class. But then, like clockwork, right before I wake up, I remember that I’m 30, already graduated high school, and, on top of that, already have a college degree, so who cares whether or not I go to calculus class? I swear, I have some iteration of this dream at least once every two weeks, and I have no clue why. Why am I being haunted by school like this? And I’m not alone. As I said, stuff like this is common. I mean, I think we’ve all had that dream where you can’t find the right classroom on the first day of school. That might be the cruelest thing about your school years; they haunt you for the rest of your life. Math When I was in school, I was great at English (my 12th grade English teacher was not a fan of mine, however, so it cracks me up thinking about her having to see that, of all her students, I was the one who turned out to be a professional writer), a whiz at history, pretty solid at science, and while not setting any records, I could hold my own in gym class. But, math? Nope. I remember my Algebra II teacher had a chart with mathematical concepts on one axis and professions on the other, with dots on it representing which professions used those concepts. One day, I announced that I was going to pursue whatever profession used the fewest of these concepts. That was a radio DJ, and while I never worked as a radio DJ, I'm proud to say that I hold a Radio-Television degree and used to drive the promotions van for a station that no longer exists. So, in short: suck it, math. But once you leave school, math still has opportunities to make your life miserable, like when your kids have math homework. One thing that always concerns me about the prospect of maybe having kids someday is having to help them with their math homework. Nothing can make you feel like a bigger dope than struggling with third-grade math as an adult. Like if I had to do some long division, I could probably get it done, but it would take a while, and it would not be pretty. Who am I kidding? I'd probably just ask ChatGPT to do it and go back to doing cool non-math-related adult stuff. School Lunches I'm going to zig when others zag when it comes to school lunches: sure, many of them are terrible. They've improved over the years, but even when I was going to a public high school a scant dozen or so years ago, there was some serious garbage getting dished out by ladies who looked like Chris Farley in his \"Lunchlady Land\" getup. Believe me: I was in middle school when Michelle Obama decided to make the youth of America healthy by making everyone's lunches way worse. But what I want to talk about are the good foods, and how, once you leave school, you will never be able to recapture their glory. My school used to have some killer chicken nuggets, and I've come across some that are close, but they're always a little too crispy to hit that sweet spot between a subtle crunch and a little soggy. There should be a restaurant that just replicates school lunches for adults, because eating that kind of slop really would be like getting in a time machine. Even the smell can do that. I still remember being in Kindergarten and them letting us test drive the cafeteria before first grade when we started going to school all day. They served chicken patties, and occasionally a restaurant (usually a Chick-fil-A) will have a similar smell as the cafeteria did that day, and it takes me back to being a kid. So, if someone wants to start a restaurant like this, go ahead, just give me one of those gold cards that entitle me to free food. If you really want to make it like school lunch, taxpayers should be footing the bill for my free grub. Now that's an idea! … That's it for this week's edition of The Gripe Report! Feel free to send in your own gripes!: matthew.reigle@outkick.com","summary":"This week&apos;s edition of The Gripe Reporet focuses on five of the worst things about school as students across the nation head back to class.","url":"https://www.outkick.com/culture/hey-teacher-leave-them-kids-alone-5-things-bug-me-about-school","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/08/gripe-report-8-19-25.jpg","video":null,"publish_date":"2025-08-19 20:39:50","author":"Matt Reigle","authors":["Matt Reigle"],"language":"en","source_country":"us","sentiment":-0.436},{"id":352265814,"title":"‘Dramatic Reset’: Expert Shares Inside Story Of What Forced Modi To Turn Towards China After 5-Year Chill","text":"India and China have been working to mend their ties. All of a sudden, ministers and officials from each country are visiting each other and Prime Minister Narendra Modi is making a visit to Beijing after seven years. Ahead of PM Modi’s visit, China lifted curbs on the export of rare earth minerals, fertilisers and other commodities, signalling a willingness to boost trade ties. Amid this unprecedented rebuilding exercise, a foreign policy expert has shared key insights on what led to the dramatic change in India’s diplomatic approach.Dramatic Shift In India-China TiesSpeaking to Bloomberg, Rockefeller International Chairman Ruchir Sharma claimed that only a few months ago, PM Modi was categorically saying that he wanted nothing to do with China and all of a sudden, India is now engaging with China at the highest level.“India is seeing a dramatic reset with China. Till about three or four months ago, Prime Minister of India Narendra Modi was very categorical when he would meet people, in saying how let down he felt by China and Xi Jinping. PM Modi was privately telling people he wanted nothing to do with China,” said Sharma.Sharma further claimed that Prime Minister Modi tried his best to form a relationship with China when Xi Jinping visited India in 2019. “Modi felt very let down personally about what China did in terms of the border dispute and other issues. The same was reinforced by the Indo-Pak conflict, which took place during Operation Sindoor, where Pakistan used extensively weapons supplied by China. That was a really low point in the ties,” Sharma told Bloomberg Insights, adding that the reset has been a ‘complete pivot’ in terms of what ‘Modi has been forced to do’. Why Modi Turned To China?Sharing details about the dramatic policy shift, Sharma credited it to PM Modi’s deteriorating ties with US President Donald Trump. “Modi is doing this because of the fact that the way hes fallen out with Trump that the two of them were extremely close during the first term of Trump,” said Sharma.He further claimed that during the US presidential polls in 2024, PM Modi was set to meet Kamala Harris and Donald Trump in September. However, since the meeting with Harris was cancelled, the meeting with Trump was also terminated so as not to appear close to any one candidate. Sharma claimed that this irked Trump and recently, when India did not endorse Trump’s ceasefire claim, the personal ties between Modi and Trump went downhill.Time For China To Rebuild TrustThe expert further said that many countries still do not trust China, and since many nations are under pressure by the United States, it could be the right time for Beijing to step-in in the right direction.“A lot of countries in Asia do not trust China. It is up to China to rise to the occasion with India and other nations. It has to build ties at a time when many countries are feeling pressured by America,” said Sharma.","summary":"The foreign policy expert shared that Prime Minister Narendra Modi tried his best to build ties with China in 2019 but he felt let down by the border skirmishes caused by the Chinese Army. ","url":"https://zeenews.india.com/india/dramatic-reset-expert-shares-inside-story-of-what-forced-modi-to-turn-towards-china-after-5-year-chill-2948595.html","image":"https://english.cdn.zeenews.com/sites/default/files/2025/08/19/1813316-xi-modi-ani1.jpg?im=Resize=(1200,900)","video":null,"publish_date":"2025-08-19 20:25:00","author":"Akash Sinha,Zee News","authors":["Akash Sinha","Zee News"],"language":"en","source_country":"in","sentiment":-0.32},{"id":352276286,"title":"WATCH: Former CBS head says network settled with Trump because he might have caught them red-handed","text":"Shari Redstone, the former controlling shareholder for CBS’ parent company Paramount Global, said Paramount agreed to settle with President Donald Trump because of worries about what his legal team may find in discovery, The New York Times reported on Tuesday.\n\nParamount agreed in July to pay $16 million to Trump to settle his lawsuit pertaining to the editing of a “60 Minutes” interview with former Vice President Kamala Harris. Redstone told the NYT that CBS employees informed her that former President Joe Biden appeared exhausted and needed to be nudged to answer questions during “60 Minutes” correspondent Scott Pelley’s October 2023 interview with him.\n\nScott Pelley asks President Joe Biden: “Can you foresee U.S. troops in combat in this new Middle East war?” https://t.co/h3sQKPHEtP pic.twitter.com/7khcV1dnCi\n— 60 Minutes (@60Minutes) October 15, 2023\n\nShe and her son were concerned that CBS could face allegations of editing in order to hide Biden’s issues, according to the NYT.\n\n“This case was never as black-and-white as people assumed,” Redstone told the NYT.\n\nOne individual who saw the interview in person, along with another who recently evaluated the raw footage asserted the Redstones’ worries were excessive and that Biden did not need to be nudged, according to the NYT. Pelley had described Biden as appearing “tired” on air.\n\nParamount said its payment, minus the legal fees, would be paid to Trump’s future presidential library and consented to publish the written transcripts of future “60 Minutes” interviews with presidential candidates, the NYT reported at the time. The settlement did not feature an apology.\n\nTrump had filed a $10 billion lawsuit against CBS News in October 2024 after the network seemed to manipulate Harris’ interview with “60 Minutes” just weeks prior to the November 2024 presidential election. The lawsuit, which surged to $20 billion in February, alleged that CBS News participated in “deliberate deception” by removing portions of Harris’ response on a question about Israel in order to boost her campaign.\n\nThe Federal Communications Commission (FCC) published the full, unedited version of the interview in February after FCC Commissioner Brendan Carr opened an investigation in October into the editing. The full cut revealed a completely different answer from Harris than the one broadcast by the network.\n\n“60 Minutes” journalist Bill Whitaker asked Harris whether the U.S. had sway over Israeli Prime Minister Benjamin Netanyahu.\n\nIn the version of her answer that aired on “60 Minutes,” Harris said, “We are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.”\n\nHowever, in a separate clip, broadcast the day before on CBS’s “Face The Nation,” she also said, “Well, Bill, the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by, or a result of, many things including our advocacy for what needs to happen in the region.”\n\nTrump’s lawsuit alleged the failure to include that segment of her answer crossed the line “from the exercise of judgment in reporting to deceitful, deceptive manipulation of news.”\n\nSome critics suggested the decision to settle was driven by Paramount pursuing an $8 billion merger with Skydance Media. Redstone told the NYT that she did not think about how the case could influence the merger.\n\nABC News also paid $15 million to settle Trump’s defamation lawsuit against the network in December after “This Week” host George Stephanopoulos falsely claimed in March 2024 that Trump was found liable of rape.\n\nMoreover, Trump filed a lawsuit in July against Rupert Murdoch, Dow Jones & Company Inc., News Corporation and the two Wall Street Journal reporters who authored a piece alleging that Trump sent deceased pedophile Jeffrey Epstein a suggestive letter for his 50th birthday in 2003.\n\nCBS and Paramount did not immediately respond to the Daily Caller News Foundation’s request for comment.\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].","summary":"'This case was never as black-and-white as people assumed'","url":"https://www.wnd.com/2025/08/watch-former-cbs-head-says-network-settled-trump/","image":"https://www.wnd.com/wp-content/uploads/2013/12/cbs-logo-600.jpg","video":null,"publish_date":"2025-08-19 20:17:43","author":"Daily Caller News Foundation","authors":["Daily Caller News Foundation"],"language":"en","source_country":"us","sentiment":0.092},{"id":352212706,"title":"The founders of this new development say you must be white to live there","text":"RAVENDEN, Ark. — In the Ozark Mountains of Arkansas, nearly an hour from the closest city, a small group of homesteaders is building an exclusive community from scratch.\n\nApplicants to the community are screened with an in-person interview, a criminal background check, a questionnaire about ancestral heritage and sometimes even photographs of their relatives.\n\nThe community’s two architects — a classically trained French horn player who has livestreamed his own sex videos, and a former jazz pianist arrested but not charged for attempted murder in Ecuador — say they must personally confirm that applicants are white before they can be welcomed in.\n\n“Seeing someone who doesn’t present as white might lead us to, among other things, not admit that person,” said one founder, Eric Orwoll, who moonlights as a Platonic scholar on YouTube but is now focused on developing 160 acres in Ravenden, Arkansas, into a community strictly for white, heterosexual people called Return to the Land.\n\nThe far right is surging in the United States, driven in part by white nationalists exploiting economic anxieties and a populace increasingly frustrated with the political status quo. Now, as the Trump administration rolls back diversity, equity and inclusion policies; cracks down on immigration; and offers pardons to white supremacists, some see an opening. In creating their community, the founders of Return to the Land are testing antidiscrimination housing laws that have been in place for 57 years.\n\nThe community’s other founder, Peter Csere, was arrested in Ecuador for stabbing a miner and is accused of stealing tens of thousands of dollars from a vegan community there. He and Orwoll say they believe Return to the Land meets the requirements for a legal exemption for private associations and religious groups that offer housing to their members.\n\nTim Griffin, the Arkansas attorney general, opened an investigation into potential legal violations by Return to the Land after reports on the community were published earlier in the summer in The Forward and on Sky News. Jeff LeMaster, his communications director, said in a statement, “We’re continuing our review of this matter.”\n\nReNika Moore, the director of the racial justice program at the American Civil Liberties Union, disputed the men’s claims that Return to the Land is legal.\n\n“Federal and state law, including the Fair Housing Act, prohibit housing discrimination based on race, period,” she said in an email. “Repackaging residential segregation as a ‘private club’ is still a textbook violation of federal law.”\n\nRepresentatives for America First Legal, the conservative advocacy group, did not respond to a request for comment on the community’s legal status. Representatives for Gov. Sarah Huckabee Sanders of Arkansas also did not respond to a request for comment.\n\nTo date, there have been no legal challenges to Return to the Land. But John Relman, a civil rights lawyer who specializes in fair housing violations, said the group could be sued under not just the 1968 Fair Housing Act but also multiple sections of the U.S. Civil Rights Act of 1866.\n\n“You’ve got a smoking gun case of intentional discrimination,” he said. “I think they’re misguided when they say that they’re home free.”\n\nBut Return to the Land says it sees an opening under a federal government that has pushed the boundaries of laws and norms, especially when it comes to race.\n\n“Return to the Land needs to strike while the iron is hot,” Orwoll wrote on a fundraising page for the group, which has raised nearly $90,000.\n\n“They see right now as a very opportune time. They see a friend in the White House at the highest level,” said Peter Simi, a professor of sociology at Chapman University in California who is an expert on extremist violence. “They see themselves quite literally in various positions in the administration, including the Department of Justice and Department of Defense.”\n\nThe timing, Orwoll and Csere said, is right. “I would rather the precedent is set and the discussion is had while there’s a relatively favorable cultural and legal climate for it,” said Orwoll. “So if we’re going to fight this battle — and it’s a battle that’s going to be fought at some point — it better be now.”\n\n40 occupants and some goats\n\nReturn to the Land is the name of both the 160-acre compound, which has about 40 residents, and a private association that Orwoll said “hundreds” have joined, paying a one-time $25 membership fee and earning acceptance after sharing information online about their ethnic background.\n\nOrwoll and Csere, along with three other men, run a limited liability company founded in September 2023. Nearly two weeks later, they bought the land in Ravenden for $237,000, property records show. Members of the association can buy shares currently valued around $6,600 each in the LLC. In exchange for each share, they each receive 3 acres in the compound.\n\nOrwell and Csere initially welcomed media attention into their compound, eager to draw in new recruits and also traffic to the donation pages for cryptocurrency and precious metals on their website.\n\nThey are now more wary.\n\nOrwoll, 35, recently gave The New York Times a limited tour, allowing entry to the property through a gate that had a lock. He sat on a folding chair in his office, housed in an insulated shed with air conditioning and fiber internet, two pianos and shelves full of philosophy texts. Before a photographer could snap pictures, he pulled a copy of “Mein Kampf” from a bookshelf and turned it around to hide its spine.\n\nThe compound feels isolated from the rest of the world. Ravenden is a tiny strip of a town that has about 400 residents and one barbecue restaurant. The closest grocery store is inside a Walmart Supercenter 30 minutes away. The town mascot, a raven, is commemorated by a 12-foot stucco statue on the side of its main road.\n\nAt the compound, rough gravel roads have been carved by bulldozer into the rugged, wooded terrain. Orwoll showed off one trim, two-story white cabin with an American flag flapping above its front door, and a rising community center he hopes will one day host dinners and events. Down past a creek was a pen of milk goats, both mothers and babies, guarded by Lucy, a white Great Pyrenees, on a long chain.\n\nThe rest of the compound, he said, was off-limits because of residents’ wishes. He declined to say how many cabins have been fully built, but some members, he said, already have installed solar panels, dug septic and water systems, and installed generators for electricity.\n\nFrom Plato to Orania\n\nOrwoll grew up in La Mirada, California, outside Los Angeles, and in high school, he considered himself a libertarian. He studied the French horn at the prestigious Eastman School of Music in Rochester, New York, before moving to Milwaukee to join the orchestra with Shen Yun, the classical Chinese dance and music production.\n\nWhile Orwoll considers the group a cult, he said, “I liked a lot of how they did things, though. They’re very efficient. I thought it was interesting having a compound like they have.”\n\nDespite never studying it formally, he’d always been drawn to Greek philosophy, and he eventually started uploading homemade videos about Plato and collective consciousness to his YouTube channel.\n\nHe attracted a following, including some commenters who responded with arguments about demographic shifts in the United States. They repeated ideas from what’s known as the Great Replacement theory — a conspiracy theory that nonwhite populations will replace white people through birthrates and mass migration — and racist pseudoscience about human intelligence and its link to genetics, an idea that has been broadly debunked by experts.\n\nThose comments, he said, began to convince him that white people in America were being persecuted and that the fabric of the United States was fraying as its nonwhite populations grew. “I got red-pilled,” he said, using a term for awakening to a supposed hidden truth. “If we never had mass immigration, if we were still a homogeneous nation, we would not feel as much of a need to form communities like this,” he said.\n\nBetween his recorded musings on Plato, he began weaving in videos about elites in the United States and theories on how the genetics for blond hair and blue eyes spread across the globe over history.\n\nThe videos caught the eye of Csere, 36, a Connecticut-raised jazz pianist. The two men struck up a friendship online.\n\n“Eventually, I realized there is a genetic component to IQ, and it’s one of those things that people like to pretend doesn’t exist because it’s politically inconvenient,” Csere said, repeating the theory in an interview on the compound. “You have cultures that invented the wheel thousands of years ago, and then you have cultures that never ever invented the wheel until it was given to them by somebody else.”\n\nHe said he became interested in Orania, a town for white people in South Africa established at the end of the apartheid era that is restricted to Afrikaners — South Africans of European descent — and has been largely ignored by the South African government.\n\nUnfulfilled by life as a musician, Csere said he began searching for something with “more meaning.” He first embraced veganism and a “need to become a hippie” and formed an eco-village in Ecuador. The village, Fruit Haven, publicly accused Csere of fraud and theft on its website. In a statement, it accused him of absconding in July 2023 with thousands of misappropriated dollars and said that he once stabbed an Ecuadorian miner, causing him a collapsed lung, and was arrested on a potential charge of attempted murder in Ecuador. He has not yet been formally charged. The Times reviewed documentation of the arrest as well as emails from members of the community begging Csere to return their funds.\n\nCsere said the stabbing was an act of self-defense during an altercation, and he left the country many months after the incident. He disputed the idea that he owed money to any members of the community.\n\n“They’ve been trying to press charges for a long time and were unable to,” Csere said of Ecuadorian authorities. Members of the community were “trying to generate drama” by discussing the incident and claiming he owed them money, he said.\n\n‘Well, it was bad’\n\nCsere designed the structure of Return to the Land. He and Orwoll believe the structure is legal because a line in the Fair Housing Act allows an exemption for private associations and religious groups to give preference to their own members when offering housing. It’s a rule, legal experts say, designed to allow groups like churches to offer a house for clergy on their property.\n\nOrwoll argued that other groups have communities designed exclusively for members of one race or religion; he pointed to EPIC City, a master-planned Muslim-centric community in Texas, as an example.\n\nThose communities do not explicitly bar outsiders. Rather, they are designed with amenities that would attract certain people. EPIC City, which has a mosque and halal markets, was investigated by the Justice Department for potential civil rights violations. No discrimination was found, and that investigation was dropped in June, although the state of Texas is continuing its own inquiry. The developers have said they will welcome residents of any faith.\n\nBut Orwoll and Csere believe the rule they’ve homed in on from the Fair Housing Act gives them grounds to restrict membership to those, as they put it, with strict European heritage. They’ve rejected applicants that they believed did not appear to be white enough.\n\n“They didn’t seem like a white person,” Orwoll said. “They didn’t look like a white person.”\n\nThe founders said many residents do not support President Donald Trump or are apathetic to his presidency. Unlike many of Trump’s most ardent supporters, most residents of Return to the Land are not particularly religious.\n\nOrwoll voted for Trump, he said, but only because the prospect of a Kamala Harris presidency seemed like a worse option. Csere criticized the MAGA movement’s “rabid support for Israel.”\n\nOn his X social media account, Csere uses antisemitic slurs and says that the Holocaust never happened but should have. When asked in an interview about the genocide, he contradicted his X posts and said he believed the Holocaust happened. “Well, it was bad,” he said.\n\nMen, women, and children\n\nOn a Monday in August, four children giggled and played on a rusty seesaw under the shade of a few trees.\n\nThere are about a dozen children living at Return to the Land — Orwoll declined to give a firm number — and all are homeschooled, he said. “I’d rather leave it to the parents to educate their kids how they want,” he said.\n\nOrwoll and his ex-wife, Caitlin Smith, have four children between the ages of 2 and 8. Living in the community, Smith said, has been great for her children because it has given them “people to play with that we could trust.”\n\nThe pair met at music school; like Orwoll, Smith, 31, who is originally from upstate New York, plays the French horn. Before they had four children, the pair made live sex videos for money on the porn site Chaturbate.\n\n“When I was doing that, I was a moral nihilist. I was not yet a Christian,” Orwoll said of the videos. “I had a different worldview and value system, and part of my rationale for going toward more traditional values was seeing the mistakes I made when I did not have them as a young person.”\n\nSmith declined to comment on the videos. According to her profile page, which is still visible, along with the videos, she listed a preference for men, women, trans people and couples. At Return to the Land, gay people of any race are barred.\n\nSmith is now remarried to another man, and they live on the compound. She sat next to Orwoll and his new fiancee, Allison, who declined to give her last name, saying she was fearful of being targeted for her views.\n\n“This is how I’ve always wanted to live — returning to the land,” Smith said. “The most important thing about this project for me is being able to actually vet my neighbors. You can move to a nice area, and in 10 years, you have no idea who’s going to be living down the street. What makes a person a person is their whole past, who they are now. And the genetics as well.”\n\nOrwoll hopes to one day welcome around 200 men, women and children to Return to the Land in Arkansas. He said supporters nationwide have expressed interest in following the Ravenden model to build their own communities. The website of Return to the Land shows five additional projects — two more in the Ozarks, one in the Deep South and two in the Appalachian Mountains.\n\nOrwoll has a trip planned to Missouri soon, he said, to look at potential land sites for a community there and to “vet people who may not necessarily be fully vetted.”\n\nThis article originally appeared in The New York Times.","summary":"Housing rights experts say a community restricted to white residents is illegal, but the creators believe they could win a potential challenge in court in the current political climate.\n\n\nThe post The founders of this new development say you must be white to live there appeared first on Boston.com.","url":"https://www.boston.com/real-estate/national-news/2025/08/19/the-founders-of-this-new-development-say-you-must-be-white-to-live-there/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2025/08/https___nytapi.wieck_.com_feed-photos_oGTq3z5N-68a4cc3ed8191-768x432.jpg","video":null,"publish_date":"2025-08-19 19:27:26","author":"New York Times Service","authors":["New York Times Service"],"language":"en","source_country":"US","sentiment":-0.111},{"id":352229842,"title":"Shari Redstone breaks silence on 'no-brainer' $16M Trump settlement that preceded Paramount-Skydance merger","text":"Shari Redstone, the longtime media executive behind CBS and Paramount Global, was \"blown away\" by the terms of the \"no-brainer\" settlement with President Donald Trump that cleared the way for a blockbuster merger with Skydance Media. Trump sought $20 billion in his lawsuit against CBS over its handling of an edited \"60 Minutes\" interview last year with then-Vice President Kamala Harris, accusing the network of election interference leading up to the 2024 contest. The dispute was settled in July, with Trump receiving $16 million upfront to cover legal fees, costs of the case, and contributions to his future presidential library or charitable causes. The settlement paved the way for the Federal Communications Commission (FCC) to approve a long-planned merger between Paramount Global and Skydance Media. That allowed Redstone, who controlled more than three-quarters of Paramount’s Class A voting shares, to exit the newly formed company. PARAMOUNT, SKYDANCE COMPLETE $8 BILLION MERGER AS FCC CONTINUES CBS PROBE The New York Times revealed on Tuesday that Redstone spoke to the paper multiple times over the past year \"with the understanding that nothing discussed could be used until after the merger closed.\" Critics have blasted the controversial settlement, as many feel it was essentially a \"bribe\" to get FCC approval. But it was revealed that Redstone was expecting to pay a larger sum and was thrilled that the network didn’t have to issue an apology or admission of wrongdoing. \"I was blown away,\" Redstone told the Times. \"How did they do it? I don’t know, and I didn’t ask.\" Before deciding to settle Trump’s lawsuit against CBS, Redstone observed that ABC News agreed last year to pay $15 million to Trump’s presidential library in order to settle a lawsuit after anchor George Stephanopoulos falsely insisted Trump had been found \"liable for rape.\" \"Redstone thought the deal by Disney, ABC’s owner, made sense, given the high costs and risks of litigation,\" the Times reported. Redstone and her inner circle believed CBS would have a difficult time beating Trump in a Texas court and wanted to avoid a damaging discovery process. SKYDANCE INFORMS TRUMP’S FCC IT WILL ELIMINATE DEI AT PARAMOUNT, CREATE CBS NEWS OMBUDSMAN FOLLOWING MERGER Specifically, a 2023 interview conducted with then-President Joe Biden could have resulted in accusations his shortcomings were concealed after he appeared \"drowsy and had to be prodded to answer,\" the Times reported, noting that others feel \"Redstone's concerns about the Biden interview were overblown.\" \"This case was never as black-and-white as people assumed,\" Redstone said. \"I believed it was always in Paramount’s best interest to settle.\" Redstone recused herself from settlement talks but made it clear that she preferred to reach a deal. \"We may not like the world we live in, but a board has to do what’s in the best interest of shareholders,\" Redstone told the Times. The Times reported that lawyers for Skydance were also pushing for a settlement and warned that the potential merger might fall apart without an agreement. The settlement was reached in July. There is an anticipation that there will be another allocation in the eight figures set aside for advertisements, public service announcements, or other similar transmissions, that will be funded by new ownership. Skydance has not publicly commented on it, but the Times reported Redstone was \"upset\" about any sort of side deal. PARAMOUNT, CBS FORCED TO PAY EIGHT FIGURES, CHANGE EDITORIAL POLICY IN SETTLEMENT WITH PRESIDENT TRUMP The deal became official on Aug. 7 and the company, dubbed \"Paramount, a Skydance Corporation,\" is now run by CEO David Ellison, the son of billionaire Oracle co-founder Larry Ellison. \"My legacy was to create security for my family and to put the company in good hands,\" Redstone told the Times. CLICK HERE TO GET THE FOX NEWS APP","summary":"Shari Redstone was “blown away&quot; by the terms of the &quot;no-brainer&quot; settlement with President Donald Trump that cleared the way for a merger with Skydance Media.","url":"https://www.foxnews.com/media/shari-redstone-breaks-silence-no-brainer-16m-trump-settlement-preceded-paramount-skydance-merger","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/shari-redstone-speaks.jpg","video":"https://www.foxnews.com/video/6375175077112","publish_date":"2025-08-19 19:20:35","author":"Brian Flood","authors":["Brian Flood"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.217},{"id":352276290,"title":"Trump Education Dept. ends federal funding of political activism at universities","text":"The Department of Education (ED) announced on Tuesday that it is ending the taxpayer funding of political activism jobs on college campuses.\n\nThe department is rescinding the Biden-era guidance that allowed the Federal Work Study (FWS) program, which provides college students with part-time jobs to help fund their education, to be used for jobs at political rallies, voter hotlines, poll workers and other political activism jobs. Institutions should instead “focus FWS funds on jobs that provide real-world work experience instead of political activities.”\n\n“Federal Work Study is meant to provide students opportunities to gain real-world experience that prepares them to succeed in the workforce, not as a way to fund political activism on our college and university campuses,” Nicholas Kent, under secretary of education, said in a statement. “Under President Trump and Secretary McMahon’s leadership, the American taxpayer will no longer fund poll workers, voter hotlines, or political rallies on campus. We will also not require institutions to solicit students to register to vote if they know they are ineligible.”\n\nThe announcement from the department also clarified to higher education institutions that the Higher Education Act (HEA), which requires schools “to make a ‘good faith’ effort to distribute voter registration forms to students,” does not require universities to distribute voter registration forms to students whom they know are ineligible to vote.” The clarity is meant to prevent schools from “aiding and abetting voter fraud.”\n\nThe new guidance was issued in response to President Donald Trump’s March executive order aimed at protecting the integrity of elections.\n\nThe FWS program was not eligible for jobs involving “any partisan or nonpartisan political activity” before 2024. Updated guidance issued under the Biden administration in February of that year declared “voter registration and election administration does not constitute ‘political activity.’”\n\nUniversities were often able to take advantage of the Biden administration’s rule to fund roles such as Pennsylvania State University’s (Penn State) Civic Engagement Ambassador, a position meant to “support the registration and education of community voters” while engaging in “anti-racism practices.” The job listing was available before the November election and hosted by the League of Women Voters (LWV), a pro-abortion organization committed to electing “women and those who can become pregnant.”\n\nDemocrats often flock to college campuses to promote their campaigns as younger voting bases lean towards the party. Then-Vice President Kamala Harris, during her 2024 presidential bid, focused a significant portion of her campaign on swing state college campuses with the understanding that the student vote — especially in states like Michigan — could move states in her favor.\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].","summary":"'The American taxpayer will no longer fund poll workers, voter hotlines, or political rallies on campus'","url":"https://www.wnd.com/2025/08/trump-education-dept-ends-federal-funding-political-activism/","image":"https://www.wnd.com/wp-content/uploads/2017/04/college-students-protest-instead-of-final-screenshot-600.jpg","video":null,"publish_date":"2025-08-19 18:14:11","author":"Daily Caller News Foundation","authors":["Daily Caller News Foundation"],"language":"en","category":"politics","source_country":"us","sentiment":-0.159},{"id":352324588,"title":"Former Paramount Leader Shari Redstone Says CBS Settled With Trump Because He Might Have Caught Them Red-Handed","text":"Shari Redstone, the former controlling shareholder for CBS’ parent company Paramount Global, said Paramount agreed to settle with President Donald Trump because of worries about what his legal team may find in discovery, The New York Times reported on Tuesday.\n\nParamount agreed in July to pay $16 million to Trump to settle his lawsuit pertaining to the editing of a “60 Minutes” interview with former Vice President Kamala Harris. Redstone told the NYT that CBS employees informed her that former President Joe Biden appeared exhausted and needed to be nudged to answer questions during “60 Minutes” correspondent Scott Pelley’s October 2023 interview with him. (RELATED: ‘Under Attack’: ’60 Minutes’ Host Chews Up 2 Minutes Of Commencement Address Raging Against Trump)\n\n Scott Pelley asks President Joe Biden: “Can you foresee U.S. troops in combat in this new Middle East war?” https://t.co/h3sQKPHEtP pic.twitter.com/7khcV1dnCi — 60 Minutes (@60Minutes) October 15, 2023 \n\nShe and her son were concerned that CBS could face allegations of editing in order to hide Biden’s issues, according to the NYT.\n\n“This case was never as black-and-white as people assumed,” Redstone told the NYT.\n\nOne individual who saw the interview in person, along with another who recently evaluated the raw footage asserted the Redstones’ worries were excessive and that Biden did not need to be nudged, according to the NYT. Pelley had described Biden as appearing “tired” on air.\n\nParamount said its payment, minus the legal fees, would be paid to Trump’s future presidential library and consented to publish the written transcripts of future “60 Minutes” interviews with presidential candidates, the NYT reported at the time. The settlement did not feature an apology.\n\nTrump had filed a $10 billion lawsuit against CBS News in October 2024 after the network seemed to manipulate Harris’ interview with “60 Minutes” just weeks prior to the November 2024 presidential election. The lawsuit, which surged to $20 billion in February, alleged that CBS News participated in “deliberate deception” by removing portions of Harris’ response on a question about Israel in order to boost her campaign.\n\nThe Federal Communications Commission (FCC) published the full, unedited version of the interview in February after FCC Commissioner Brendan Carr opened an investigation in October into the editing. The full cut revealed a completely different answer from Harris than the one broadcast by the network.\n\n“60 Minutes” journalist Bill Whitaker asked Harris whether the U.S. had sway over Israeli Prime Minister Benjamin Netanyahu.\n\nIn the version of her answer that aired on “60 Minutes,” Harris said, “We are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.”\n\nHowever, in a separate clip, broadcast the day before on CBS’s “Face The Nation,” she also said, “Well, Bill, the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by, or a result of, many things including our advocacy for what needs to happen in the region.”\n\nTrump’s lawsuit alleged the failure to include that segment of her answer crossed the line “from the exercise of judgment in reporting to deceitful, deceptive manipulation of news.”\n\nSome critics suggested the decision to settle was driven by Paramount pursuing an $8 billion merger with Skydance Media. Redstone told the NYT that she did not think about how the case could influence the merger.\n\nABC News also paid $15 million to settle Trump’s defamation lawsuit against the network in December after “This Week” host George Stephanopoulos falsely claimed in March 2024 that Trump was found liable of rape.\n\nMoreover, Trump filed a lawsuit in July against Rupert Murdoch, Dow Jones & Company Inc., News Corporation and the two Wall Street Journal reporters who authored a piece alleging that Trump sent deceased pedophile Jeffrey Epstein a suggestive letter for his 50th birthday in 2003.\n\nCBS and Paramount did not immediately respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Never as black-and-white'","url":"https://dailycaller.com/2025/08/19/former-cbs-head-says-network-settled-with-trump-because-he-might-have-caught-them-red-handed/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/GettyImages-2188925290-scaled-e1755623899173.jpg","video":null,"publish_date":"2025-08-19 17:56:08","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","source_country":"us","sentiment":0.086},{"id":352267968,"title":"Ella Emhoff shares climate anxiety concerns while using plastic bags in social media posts","text":"Ella Emhoff, stepdaughter of former Vice President Kamala Harris, complained to her TikTok followers that she was struggling with \"climate anxiety\" — after showcasing a plastic bag or two online the day before. The 26-year-old model and designer posted a six-minute video Friday lamenting the \"weight\" of environmental concerns, but shared an Instagram clip on Thursday where she held a plastic bag on her bed at home, as well as outside a Pasadena thrift store. The juxtaposition drew some criticism online, with one follower accusing Emhoff of hypocrisy — a charge complicated further by Harris’ own past calls to ban single-use plastics. In Friday's TikTok, Emhoff, who goes by the name of @smellaemhoff said: \"I think everything with the environment is really f---ing getting to me, and it is — I experience a lot of climate anxiety, like all of us do.\" ELLA EMHOFF FEELS 'TRAUMA' RETURNING TO NYC POLLING STATION WHERE SHE VOTED FOR HARRIS She added that while she tries to fight for change, \"it’s really hard not to sit in those moments where it just feels so heavy.\" The day before, Emhoff posted a different clip to her Instagram page. She can be seen sitting on her bed dressed in black jeans and a vest top with her dog running about next to her. Emhoff proudly shows off bundles of different colored yarn and fabric, in one part, a plastic bag. Emhoff’s Instagram footage also shows her visiting Remainders, one of her favorite thrift stores in California. She’s filmed outside holding another plastic bag and kicking up her leg, before heading inside and looking for items in plastic containers. While some followers cheered her thrifting trip, one criticized the plastic-heavy displays shown in the shop. \"Should probably not support a store filled with excessive plastic bins as shelves,\" one follower wrote. \"Not surprised one bit by the hypocrisy. People like you are truly doing a great amount of damage to our country. It’s dangerous,\" they added. ENVIRONMENTAL ACTIVISTS COMPLAIN CALIFORNIA DEMOCRATS HAVE 'BACKED DOWN' ON CLIMATE CHANGE It’s not the first time the Emhoffs have been spotted with plastic, despite the former VP herself once calling for bans on single-use plastics. In 2019, Harris said during a CNN town hall that \"we do need to ban the plastic straws.\" By early 2024, however, her campaign shifted its position. In January, Harris and her husband, Doug Emhoff, were also photographed leaving a California store with groceries packed in a plastic bag. OPINION: DON'T BE FOOLED. MAMDANI ISN'T THE FUTURE OF THE DEMOCRATIC PARTY Harris is a stepmother to Doug Emhoff’s two kids, Ella and Cole, 30, who he shares with lawyer Kerstin Emhoff. Harris and Doug Emhoff met in 2013 on a blind date and married the following year. At the time, Ella was 15. She has since garnered attention for her political activism and reactions. CLICK HERE TO GET THE FOX NEWS APP Earlier this year, she complained about experiencing \"a little trauma\" on her way to vote for socialist candidate Zohran Mamdani in New York City’s Democratic mayoral primary, held at the same polling place where she once cast a ballot for Harris, who lost the election in November 2024. Ella Emhoff did not respond to Fox News Digital's request for comment.","summary":"Kamala Harris&apos; stepdaughter, Ella Emhoff, complained on social media about her &quot;climate anxiety.&quot; But eagle-eyed followers called her out for a not-so-environmentally-friendly practice.","url":"https://www.foxnews.com/us/ella-emhoff-shares-climate-anxiety-concerns-while-using-plastic-bags-social-media-posts","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/ella-emhoff-climate-fox-news-001.jpeg","video":"https://www.foxnews.com/video/6345550420112","publish_date":"2025-08-19 17:51:09","author":null,"language":"en","source_country":"us","sentiment":0.396},{"id":352233174,"title":"Top California Dem Lawmaker Reportedly Had House Seat Gerrymandered for Him in Exchange for Support","text":"DAILY CALLER NEWS FOUNDATION—A top California Democrat who is expected to help steer the Golden State’s mid-decade redistricting plan through the state Legislature was reportedly involved in creating a new district to launch his own congressional run.\n\nMike McGuire, the president pro tempore of the California State Senate, had one of the newly configured districts drawn for him in return for his support for the redistricting effort, according to a report published by KCRA on Monday. McGuire is term-limited from running for reelection in the state legislature and is rumored to be considering making a run for Congress in a new safe Democrat seat in 2026.\n\nState Democrats led by California Gov. Gavin Newsom unveiled a new gerrymandered map Friday that could end the careers of up to five House Republicans currently representing Californians in Washington. One of the GOP lawmakers targeted by Golden State Democrats is Republican California Rep. Doug LaMalfa, who has represented a deeply conservative district for over a decade.\n\nLaMalfa’s rural district in the state’s far northeast corner along the Nevada and Oregon border was substantially reconfigured to take in parts of the Democrat-heavy wine country in Sonoma County and stretch further toward the Pacific coast. The California Republican could struggle to hold onto the seat, assuming voters approve the new congressional map given the newly drawn district’s voter registration advantage shifting nearly 30 points in favor of Democrats.\n\nPresident Donald Trump won LaMalfa’s deep-red district by 25 percentage points last November. Vice President Kamala Harris would have defeated Trump by 12 percentage points in the newly reconfigured district, according to the nonpartisan Cook Political Report.\n\nMcGuire, who has served as the top Democrat in the state Senate since 2022, represents a Northern California district that includes Sonoma County. He has defended California’s redistricting plans as “drawing a line in the sand to stop Texas and Trump from rigging the election.”\n\nThe web domain “mikemcguireforcongress.com” was registered on Aug. 11 but is currently blank.\n\nLaMalfa has characterized the new congressional map as a “ridiculous gerrymander.”\n\n“Anyone who knows anything about California should be outraged,” LaMalfa posted on the social media platform X on Friday.\n\nThe California Republican Party on Monday blasted McGuire’s reported role in remapping northern California to benefit his own career prospects.\n\n“The corruption of California Democrats knows no bounds as they work to nullify California’s independent, bipartisan citizen’s redistricting commission to ‘Save Democracy™,’” the California GOP wrote on X.\n\nRepublican California Assemblyman Carl DeMaio filed a ballot initiative on Monday that would bar state legislators who vote in favor of new congressional maps from running for Congress for 10 years. DeMaio will need to secure 1 million signatures to get his citizens’ initiative on California voters’ ballots in November 2026.\n\n“The state constitution already bans Independent Citizens’ Redistricting Commissioners from seeking elected office for 10 years—so if the politicians want to illegally seize back redistricting power from the citizens, it is only fitting that the ban against benefiting personally from those maps be imposed on them,” DeMaio said on Monday.\n\nIt is unclear if that initiative could stop McGuire from seeking a job promotion in California’s 1st Congressional District.\n\nCalifornia voters will decide whether to allow the hotly-contested congressional map to move forward during a ballot initiative this November. Though early polling suggests a majority of California residents oppose Newsom’s redistricting push, elected Democrats and deep-pocketed liberal donors are expected to aggressively whip public opinion in favor of new congressional maps.\n\n“Let’s be clear—we’re here at this flashpoint because Donald Trump and Republican leaders are trying to rig the election,” McGuire’s office said in a statement to the Daily Caller News Foundation sent post-publication. “These maps, submitted by the Democratic Congressional Campaign Committee, aren’t about any single legislator or Congressional seat, they’re about the future of our state, our country, and our democracy—and Trump’s attempt to steal the election.”\n\n“The pro tem is focused on the job he has leading the Senate, and any speculation on who will run for these seats before voters even have a say is wildly premature and inappropriate,” McGuire’s office added in the statement.\n\nOriginally published by the Daily Caller News Foundation","summary":"DAILY CALLER NEWS FOUNDATION—A top California Democrat who is expected to help steer the Golden State’s mid-decade redistricting plan through the state Legislature was reportedly... Read More\n\n\nThe post Top California Dem Lawmaker Reportedly Had House Seat Gerrymandered for Him in Exchange for Support appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/08/19/top-california-dem-lawmaker-reportedly-had-house-seat-gerrymandered-for-him-in-exchange-for-support-redistricting/","image":"https://www.dailysignal.com/wp-content/uploads/2025/08/GettyImages-2166341848.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-08-19 17:50:06","author":"Adam Pack","authors":["Adam Pack"],"language":"en","source_country":"us","sentiment":-0.043},{"id":352254408,"title":"The FBI is likely to 'get worse' with Trump’s latest 'bombastic partisan' nominee: analysis","text":"During former President Joe Biden's four years in the White House, he favored institutionalists for the FBI — which is how he regarded then-FBI Director Christopher A. Wray. Although Wray was a conservative Republican appointed by President Donald Trump during his first administration, Biden kept him as FBI director throughout his presidency.\n\nBut Trump's ultra-MAGA picks for the post-Wray FBI are the opposite of institutionalists, including FBI Director Kash Patel (a far-right conspiracy theorist) and Deputy FBI Dan Bongino. And Trump is also going total MAGA with his latest FBI pick: outgoing Missouri Attorney General Andrew Bailey, the president's choice for a second deputy FBI director.\n\nIn his August 19 column, MSNBC's Steve Benen lays out some reasons why he finds Bailey a troubling choice for the FBI.\n\nREAD MORE: 'Texas Republicans have lost their damned minds': Outrage as GOP employs 'Jim Crow playbook'\n\n\"In a normal administration,\" Benen argues, \"the FBI has a director and a deputy director, with the latter helping to oversee day-to-day operations at the bureau. The Trump Administration, however, isn't normal at all, which helps explain why the FBI will, at least for now, have two deputy directors.\"\n\nAccording to Benen, the FBI's \"new arrangement\" with Bailey \"is bizarre\" and \"appears to signal the beginning of the end of Bongino's tenure.\"\n\nBailey, Benen notes, has \"a reputation for making 'bombastic' partisan attacks.\"\n\n\"The outgoing Missouri attorney general might not be a household name — at least, that is, not yet — but his record during a brief career in elected office is one of a hyper-partisan Republican activist,\" the MSNBC columnist and \"Rachel Maddow Show\" producer observes. \"When prosecutors in New York, for example, successfully held Trump accountable for his business crimes, Bailey tried to sue New York to prevent sentencing after the guilty verdicts. The U.S. Supreme Court rejected the effort.\"\n\nREAD MORE: Buckle up: Former Trump attorney Alina Habba may be in office for awhile\n\nBenen continues, \"This is the same far-right lawyer who wanted then-President Joe Biden to be criminally prosecuted for his student loan debt forgiveness policy. He also launched an investigation into Google, alleging that the tech giant was secretly conspiring to suppress conservative views, which dovetailed with a related investigation into AI chatbots that Bailey said were too anti-Trump.\"\n\nHad Democratic presidential nominee Kamala Harris won the 2024 election, it's entirely possible that Wray would still be FBI director. Instead, the FBI moved far right during Trump's second presidency. \n\n\"Bailey has even fought to keep exonerated prisoners behind bars, while pushing weird ideas to advance his anti-abortion agenda,\" Benen writes. \"Put another way, under Kash Patel, the FBI has struggled. With Bailey joining the bureau's leadership team, it’s likely to get worse. \"\n\nREAD MORE: 'Complete 180' and 'hot mic moment': Brutal CNN supercut reveals how Trump got played by Putin\n\nSteve Benen's full MSNBC column is available at this link.","summary":"During former President Joe Biden's four years in the White House, he favored institutionalists for the FBI — which is how he regarded then-FBI Director Christopher A. Wray. Although Wray was a conservative Republican appointed by President Donald Trump during his first administration, Biden kept him as FBI director throughout his presidency.\n\nBut Trump's ultra-MAGA picks for the post-Wray FBI are the opposite of institutionalists, including FBI Director Kash Patel (a far-right conspiracy theorist) and Deputy FBI Dan Bongino. And Trump is also going total MAGA with his latest FBI pick: outgoing Missouri Attorney General Andrew Bailey, the president's choice for a second deputy FBI director.\n\nIn his August 19 column, MSNBC's Steve Benen lays out some reasons why he finds Bailey a troubling choice for the FBI.\n\nREAD MORE: 'Texas Republicans have lost their damned minds': Outrage as GOP employs 'Jim Crow playbook'\n\n\"In a normal administration,\" Benen argues, \"the FBI has a director and a deputy director, with th","url":"https://www.alternet.org/fbi-bailey-bongino-patel/","image":"https://www.alternet.org/media-library/image.jpg?id=61488220&width=1200&height=600&coordinates=0%2C473%2C0%2C473","video":null,"publish_date":"2025-08-19 17:33:17","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":-0.067},{"id":352229822,"title":"Transgender lawmaker says Democratic Party doesn't know how to respond to anti-trans attacks","text":"Rep. Sarah McBride, D-Del., criticized the Democratic Party's silence on Republican-led attacks on trans issues, arguing on Tuesday that the party needs to learn how to engage on the issue. \"I do think it was a problem that our party didn’t explicitly respond to the anti-trans attacks. We can’t ignore these issues. We can’t just not respond and leave the narrative entirely to the Republicans,\" McBride said when pressed by ex-DNC chair Jaime Harrison on his podcast. Discussing how Democrats should respond to Republicans on trans issues, the lawmaker specifically noted President Donald Trump's ad during the 2024 campaign that depicted former Vice President Kamala Harris as being for \"they/them\" and the president as being \"for you.\" McBride, a transgender lawmaker, said the party broadly should be focused on a \"diverse working class,\" and should reject the idea of \"absolute purity politics.\" DEMOCRATIC REP CALLS ON PARTY TO TOLERATE DISSENTING IDEAS ON CONTROVERSIAL ISSUES \"I will say one of the reasons why, the sense that I have gotten from some Democrats as I talked to them, that you often see silence from Democrats in response to these attacks is because, to your point, they don’t know how to respond, not because they don’t know what they believe or how they feel, but because they feel like there is no way to respond in a way that doesn’t result in everyone yelling at them,\" McBride said during Harrison's podcast, \"At Our Table.\" McBride said Democrats didn't need perfect terminology or to embrace the \"maximalist position\" on trans issues, but suggested acknowledging concerns about transgender people participating in sports. \"You can grapple with concerns around, for instance, trans people participating in sports, acknowledge that there are very real questions out there. But who is best able to answer those questions about how to balance respect and fairness in women’s sports? It’s not 435 members of Congress who know nothing about women’s sports and even less about trans people. It's the individual athletic associations that understand their sports the best,\" McBride said. ANONYMOUS DEMOCRATS CONFESS TO TIME MAGAZINE THEIR PARTY IS TOO EXTREME ON ABORTION, TRANS ATHLETES The Democratic lawmaker said Republicans were trying to misdirect when they talk about trans people, accusing Trump of wanting to \"line the pockets\" of corporations and wealthy people. \"And I think we have to be crystal clear about that while also pushing back against these attacks in ways that doesn't dismiss everyone with a question or a concern as a closed-minded bigot,\" McBride said. McBride said in June that the party might have overplayed its hand regarding trans issues. \"I think that’s an accurate reflection of the overplaying of the hand in some ways — that we as a coalition went to Trans 201, Trans 301, when people were still at a very much Trans 101 stage,\" McBride told The New York Times' Ezra Klein in an interview. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The Delaware lawmaker said many of the cultural norms surrounding transgender people were likely premature for a lot of Americans. CLICK HERE TO GET THE FOX NEWS APP \"We became absolutist — not just on trans rights but across the progressive movement — and we forgot that in a democracy we have to grapple with where the public authentically is and actually engage with it. Part of this is fostered by social media,\" McBride said.","summary":"Rep. Sarah McBride, D-Del., a transgender lawmaker, said the Democratic Party didn&apos;t know how to respond or engage on transgender issues during an interview with Jaime Harrison.","url":"https://www.foxnews.com/media/transgender-lawmaker-says-democratic-party-doesnt-know-how-respond-anti-trans-attacks","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/sarah-mcbride-capitol-hill.jpg","video":"https://www.foxnews.com/video/6377077714112","publish_date":"2025-08-19 17:26:48","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.204},{"id":352228824,"title":"Account tied to Trump nominee posted conspiracy theories about Epstein, the 2020 election and Covid, report says","text":"A social media account tied to President Donald Trump’s controversial pick to take over the Bureau of Labor Statistics has a history of posting various far-right conspiracy theories – the latest eyebrow-raising report to emerge about what is often a nonpartisan nominee.\n\nLast week, Trump announced he would nominate Erwin John “EJ” Antoni III, the chief economist at The Heritage Foundation, the conservative group that created Project 2025, to replace former BLS commissioner Erika McEntarfer. \n\nA surface-level review of Antoni, 37, shows that he is a loyal Trump supporter who has aligned himself with the current administration’s ideals – contributing to Project 2025, bashing former president Joe Biden’s record, and even being a “bystander” at the January 6 attack on the Capitol. \n\nBut a more in-depth look at Antoni’s history online indicates that a now-deleted X account, which once used Antoni’s name, posted theories about Jeffrey Epstein’s death, Covid-19’s origins, and the validity of the 2020 presidential election, according to WIRED.\n\nA website archive of the account “PhDofbombsaway,” shows that it used the name “Dr. Erwin J. Antoni III,” “Dr. J.,” as well as “Dr. Curtis LeMay,” – an apparent reference to the Air Force general largely credited with planning and executing mass bombings on Japan during World War II, as well as advocating for nuclear weapon usage. \n\nThe account’s profile picture was of a fiery mushroom cloud, not unlike the one associated with nuclear weapon detonations.\n\n“All or nothing. Do it die,” the account posted in late November 2020 in response to a tweet encouraging Republicans to stand up to “fraudulently mailed machines.” \n\nThe account consistently re-posted false claims about election fraud and theories about stolen ballots from prominent accounts. \n\nOn January 5, 2021, hours before the attack on the Capitol, the account posted a reference to violence in the Bible while responding to a tweet from Trump in which he encouraged Republicans to “fight.”\n\n“Samson has his arms around the temple pillars, and although he may not survive, he will bring it all down on his enemies,” it posted, referring to the story of Samson receiving strength from God to rise up against his enemies. \n\nLast week, photos of Antoni outside the Capitol on January 6 circulated online. The White House confirmed Antoni was present as a “bystander” who wandered over to see coverage of it on the news. \n\nOther posts from the account indicate the person running it was ingrained in far-right rhetoric and conspiracy theories. \n\nIn November 2019, the account responded to a person theorizing about Epstein’s death by suicide, claiming, “Epstein didn’t kill himself.” That theory was widely circulated among far-right communities online and continues to be a central part of concerns about government transparency around Epstein. \n\nLater that month, the same account replied to a tweet that seemed to make a sexual innuendo about former vice president Kamala Harris with its own. \n\n“She does her best work when life brings her to her knees,” the account wrote. \n\nThe Independent has asked the White House for comment. \n\nAntoni declined to comment to Wired. \n\nWhile the account has since been deleted, Antoni remains present online with an X account that mostly posts Trump-aligned views of the economy or economic data. \n\nBut his nomination has been subject to criticism even before NBC News reported his presence at the Capitol, or Wired reported about his alleged former X account. \n\nThe president previously fired McEntarfer, a career civil servant, after expressing dissatisfaction with the BLS’s job numbers reports. Trump insinuated, without evidence, that McEntarfer had manipulated the numbers to make the president look bad because the figures did not line up with Trump’s rhetoric about the economy.\n\nSome economists and lawmakers have expressed concern that Trump’s new nominee could be more inclined to alter BLS numbers to appease the president. While there is no rule about who may be the BLS commissioner, they are typically expected to be nonpartisan, given that the BLS is an independent fact-checking arm of the Department of Labor.\n\nUpon announcing Antoni’s nomination, the president vowed that his nominee would “ensure that the Numbers released are HONEST and ACCURATE.”\n\nAntoni previously tweeted, calling for a “better” way to collect and disseminate BLS data and criticizing the current method of doing so.\n\nAntoni’s nomination will require Senate confirmation. So far, at least two Democratic senators have called for the Senate to reject Antoni’s nomination.","summary":"Erwin Antoni, the president’s pick to take over the Bureau of Labor Statistics, serves as the chief economist for The Heritage Foundation and contributed to Project 2025","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-bureau-of-labor-statistics-ej-antoni-x-epstein-b2810430.html","image":"https://static.independent.co.uk/2025/08/19/14/14/EJ_Antoni_ENRweb-copy.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/m563U4oF-OhrQWqOm.mp4","publish_date":"2025-08-19 17:03:50","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.017},{"id":352234488,"title":"Control of the Senate Could Be Decided in Maine. This Oyster Farmer Is Vying to Unseat Susan Collins.","text":"Graham Platner, a 40-year-old oyster farmer from Sullivan, Maine (pop. 1,219), announced a bid for the seat of incumbent GOP Sen. Susan Collins on Tuesday.\n\nA Marine and Army veteran who served in both Iraq and Afghanistan, Platner says he’s running his Democratic campaign on a message of economic populism. His goal, he says, is to “claw back wealth that was created by the labor and the consumption of working class Americans who have not shared in the riches they helped build.”\n\nTo accomplish his mission, he will first have to win the party’s primary against at least two candidates: Democrats who have already announced their campaigns include Jordan Wood, the former chief of staff to then-Rep. Katie Porter, and David Costello, a former USAID worker who ran against Maine Independent Sen. Angus King in 2024. Maine Governor Janet Mills, who is term-limited in her current role, has also been floated as a strong possible Democratic contender should she decide to run.\n\nIf he wins the Democratic primary, Platner would likely face an even greater challenge: Collins, the only GOP senator up for reelection from a state won by Kamala Harris in 2024. In a markedly polarized Congress, Collins is one of just a handful of senators on either side who have dared to (on occasion) buck her party. She’s one of just three Republican senators, for example, who rejected Trump’s One Big Beautiful Bill.\n\nBut her nay vote didn’t the stop the legislation, which 58 percent of Maine residents opposed; it merely required Vice President JD Vance make a quick trip to the Capitol to break the tie. In a state Trump lost by nearly 7 points in 2024, Democrats see an opportunity in Collins’ declining approval rating to oust a GOP senator making only the faintest show of resistance against Trump’s controversial agenda. By contrast, ousting Collins could tip the Senate majority towards Democrats, which would help the party neutralize Trump moving forward.\n\nIn announcing his upstart bid, Platner is betting his broad embrace of the working class—and how he defines that group—could be the key to replacing her.\n\n“When I talk about the American working class, I talk about the people who work, who labor and struggle, and have and build families, and cannot access the wealth that this country has,” Platner says in an interview. “Someone who’s making a couple hundred thousand dollars a year is far, far, closer to someone who makes below the poverty line than they are to the rich.”\n\nIn other words, reader, he most likely means you. He also means himself. \n\nPlatner has never run for office and seldom wears a suit. His closest connection to Congress before his campaign was serving glasses of Jameson to the late-Rep. Raúl Grijalva (D-Ariz.) while working a brief stint at the beloved DC dive bar, Tune Inn. More recently, he spends the vast majority of his days on—or in—the Atlantic Ocean, running Waukeag Neck Oyster Company from the town he grew up in.\n\nBy his telling, his oyster farm is not making bank: “I don’t make a lot of money,” he says. But he still counts himself lucky. After his military career ended, he said he found it difficult to make ends meet. It wasn’t until several years later that disability benefits from the Department of Veterans Affairs afforded him the financial breathing room to seek out a living he’d actually enjoy. “I didn’t have to go get a job just to get health insurance. I could find something that I might really love, and I could take a risk of starting a business,” he tells me.\n\nMany Americans don’t have that luxury. Instead, they are often stuck working multiple jobs, or at least unfulfilling ones, that still don’t earn them enough to buy a house or comfortably afford basics like health care and groceries. Republicans, he says, obliterated Democrats in 2024 because they acknowledged these common adversities.\n\n“Everybody down here knows that the system is screwing them,” he says. “The one thing the Republicans and, more importantly, I would say, Donald Trump, did, is they told people that they were right. They told people that they were getting screwed, that the system wasn’t helping them.”\n\nWhere Trump and other Republicans erred, Platner says, is by not pinning the blame on the billionaires and massive corporations with immense political pull that reap the largest rewards from the government. \n\nInstead, Republicans “blamed minorities, immigrants, groups of people who live lives that are frankly, just as, if not more, full of suffering and pain than the rest of the American working class,” Platner says. “But at least they blamed somebody.”\n\nHe argues that addressing the woes of average Americans doesn’t mean abandoning the most marginalized groups; it just means listening to the concerns of all the other working-class Americans who are suffering too.\n\n“The working class abandoned the Democratic Party, primarily because the Democratic Party abandoned the working class,” says Platner. “And if we are going to move things forward, we need to fix that.”","summary":"Graham Platner, a 40-year-old oyster farmer from Sullivan, Maine (pop. 1,219), announced a bid for the seat of incumbent GOP Sen. Susan Collins on Tuesday. A Marine and Army veteran who served in both Iraq and Afghanistan, Platner says he’s running his Democratic campaign on a message of economic populism. His goal, he says, is [&#8230;]","url":"https://www.motherjones.com/politics/2025/08/graham-platner-susan-collins-maine-senate/","image":"https://www.motherjones.com/wp-content/uploads/2025/08/20250819_maine-senate_b_2000px.png?w=1200&h=630&crop=1","video":null,"publish_date":"2025-08-19 14:50:55","author":"Abby Vesoulis,Arianna Coghill","authors":["Abby Vesoulis","Arianna Coghill"],"language":"en","source_country":"US","sentiment":0.234},{"id":352217720,"title":"How California redistricting could impact congressional elections in Orange County","text":"If there’s one thing both sides of the aisle can agree on when it comes to plans underway in California to change congressional boundaries ahead of the 2026 midterms, it’s that the new maps are a bit much to digest.\n\nThe proposed new congressional maps for California districts were unveiled Friday evening, proposed to state legislators by the campaign arm for House Democrats. These suggested maps make sweeping changes to some districts, but for others, the tweaks — meant to counter proposed partisan redistricting in other, Republican-controlled states — are a bit more regional.\n\nThe maps create several domino-effect changes in the effort to reduce the number of California’s 52 congressional seats with a majority of registered Republican voters from nine (currently) to four (proposed), said Michael Trujillo, a Democratic strategist in Southern California who has experience with redistricting.\n\n“That’s shaken up the entire map,” Trujillo said. “Whether you’re in a safe seat, swing seat, whatever — things have wiggled in a way that might be uncomfortable for some communities.”\n\nNoticeably, the proposed changes would split Orange County among eight congressional districts, rather than six as it is now. Two of those proposed districts — the 38th District and 41st District — would mostly encompass communities to the north in Los Angeles County while picking up a few of OC’s cities.\n\nRemember, these proposed changes aren’t final. There are still several boxes that need to be checked before these new districts would be implemented for congressional elections in 2026, 2028 and 2030.\n\nFirst, the mid-cycle partisan redistricting is “triggered” by a Republican-led state moving forward with plans for similar — but other side of the aisle — congressional map redos. Attention has largely been on Texas, where President Donald Trump has said the GOP is “entitled to five more seats.”\n\nState legislators in Sacramento also have to agree to these proposed maps — and the Democratic majority is already teed up to do so this week. They will then put the maps before California voters in a special election in November, who will have the final OK.\n\nBut for now, as these new congressional maps are still being “digested,” here’s a look at what could change in Orange County — and what’s at stake.\n\n‘Surfboard congressmember’\n\nRep. Robert Garcia may need to trade in some comic books for a surfboard if the proposed maps are implemented, Trujillo joked.\n\nCalifornia’s 42nd Congressional District, represented now by Garcia, a former Long Beach mayor, could swivel down to pick up more coastal areas, including Orange County’s Huntington Beach and Newport Beach. In addition, the district would include Costa Mesa and part of southern Santa Ana.\n\nThe 42nd District now snakes north and inland, picking up Bellflower, Commerce, Downey, Huntington Park and Lakewood.\n\nAdding the more conservative Orange County cities to a fairly blue district for Garcia earned the congressman some praise from Trujillo.\n\n“If the mandate was to draw a map to neutralize Texas, it meant that seats that were safe (for the) Dems were going to pick up Republican precincts,” said Trujillo.\n\nThis will still be a relatively safe seat for Garcia, Trujillo predicted, but the new district could be ripe for a credible Republican challenger who could make re-election for Garcia — or election for a different Democratic candidate — tougher.\n\n“We all have to do our part, and I’m looking forward to repping OC,” Garcia said in a post on X. “The seat is solid blue, has over D+10 registration and Kamala Harris won it by over 13 points. Excited to represent LBC, Signal Hill, Seal Beach, Huntington Beach, Newport Beach, Costa Mesa & South Santa Ana.”\n\nStill, it’d be an uphill battle for a Republican. According to the proposed maps, the new district would still be comprised of 40% of registered Democratic voters, along with 30% Republican and 28% who are registered no party preference or other.\n\nAnd it changes messaging strategy, said Andrew Clark, a Republican strategist who has experience with congressional campaigns in Orange County.\n\n“Republicans here campaign on keeping failed L.A.-style policies out of Orange County,” Clark said. “These new maps pack red parts of Orange County directly into deep blue parts of L.A. County.”\n\n“The optics of liberal L.A.-style Democrats like Robert Garcia parachuting down into Orange County asking for votes would create a unique messaging angle for Republican campaigns to capitalize on and add a new element to the race that we haven’t usually seen,” Clark added.\n\n“Congressman Robert Garcia … welcome to Huntington Beach,” Matt Rexroad, an attorney and Republican redistricting consultant, posted on social media.\n\n“That should be fun for all involved.”\n\nA potential R-on-R showdown?\n\nOne way to cut out Republican seats is by smooshing some of them together.\n\nThat seems to be what the proposed maps do to districts represented by Reps. Young Kim, R-Anaheim Hills, and Ken Calvert, R-Corona.\n\nThe newly proposed 40th Congressional District is only one of the four congressional districts that would have a majority of registered Republican voters.\n\nThe 40th District now includes Mission Viejo, Villa Park and Yorba Linda, along with communities in western Riverside and San Bernardino counties, and is represented by Kim.\n\nBut the newly drawn one shifts the district more eastward, losing Orange County’s Aliso Viejo and Lake Forest and picking up Menifee, Wildomar and parts of Corona — areas represented by Calvert. (The district also picks up Murrieta, which is part of GOP Rep. Darrell Issa’s current district.)\n\nBoth Kim and Calvert — who have launched re-election bids prior to these redistricting efforts — have decried the proposed maps and vowed to challenge them.\n\nThere’s the possibility, with the way these maps are drawn, that the two could end up both running for the 40th District.\n\n“Rep. Kim plans to run for re-election and is focused on delivering results for her community as she stands up against Sacramento’s unconstitutional power grab,” said Callie Strock, a spokesperson for Kim’s campaign.\n\nA spokesperson for Calvert’s campaign didn’t immediately return a request for comment.\n\nShoring up the blue votes\n\nTwo of Orange County’s most closely watched congressional races in 2024 would have a stronger presence of registered Democratic voters if the proposed maps are adopted.\n\nCalifornia’s 45th Congressional District — which flipped from red to blue last year — would include 39% Democratic-registered voters, compared to 30% Republicans and 30% those registered no party preference or something else.\n\nRegistered Democrats now make up nearly 37% of registered voters in the district that Rep. Derek Tran narrowly won in 2024, along with 33% registered Republicans and 25% no party preference.\n\nAnd the changes made to California’s 47th Congressional District would create a district where registered Democrats outnumber Republicans, 36% to 32%. Those registered no party preference or other would account for 31%.\n\nAs of the latest tally by the secretary of state, the current 47th District, represented by Rep. Dave Min, has slightly more registered Republicans (35%) than Democrats (34%), along with 24% no party preference.\n\nBreaking up is hard to do\n\nSeveral Orange County cities are split among two — and sometimes three — congressional districts under these proposals.\n\nBoth Fullerton and Santa Ana are split into thirds.\n\nA small portion of Fullerton would be included in California’s 41st Congressional District, which mostly encompasses communities in Los Angeles County, as well as the 45th District and 46th District, according to data shared with the Southern California News Group.\n\nData shows Santa Ana splitting between California’s 45th and 46th districts as well, with a small portion of the southern part of the city included in the 42nd District, the district that would span the coast from Long Beach to Newport Beach.\n\nCarlos Perea, a Santa Ana resident and executive director of the Harbor Institute for Immigrant and Economic Justice, said he has mixed feelings about putting redistricting on the ballot in November.\n\n“I hate to say it, we need to fight fire with fire,” he said of California fighting redistricting efforts in Republican states. “But there’s also the contradiction of politicians essentially choosing their voters.”\n\nAt stake, he said, is Santa Ana’s political influence. The city is the largest in its current congressional district and “carries an outsize influence on our congressional representative,” Perea said. Redrawing the boundaries, he added, “essentially dilutes in many ways, the impact we have as a larger city in one congressional seat.”\n\nMeanwhile, parts of Newport Beach would break between California’s 42nd Congressional District and the 47th District, which would be redrawn to still include Irvine and Laguna Beach but pick up Dana Point.\n\nAnd Mission Viejo would also be divided, part of it in that new 47th District and the other in the 40th District.\n\n“Orange County’s cities are sliced and diced in ways that only a power-hungry partisan could love,” said former Newport Beach Mayor Will O’Neill, who leads Orange County’s Republican Party.\n\nStaff writer Hanna Kang contributed to this report.","summary":"Huntington Beach and Long Beach under the same district. Rep. Young Kim versus Rep. Ken Calvert. A look at these possible changes, and more.","url":"https://www.ocregister.com/2025/08/19/how-california-redistricting-could-impact-congressional-elections-in-orange-county/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/OCR-L-MAPTAKEAWAYS-0819.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-19 14:00:31","author":"Kaitlyn Schallhorn","authors":["Kaitlyn Schallhorn"],"language":"en","source_country":"us","sentiment":-0.19},{"id":352332928,"title":"Restoring Trust in the Heart of PA's Political Realignment","text":"One of the defining features of late 20th and early 21st century American politics is the loss of faith in our institutions. A recent poll in U.S. News shows that 85% of Americans say “government officials and other community leaders care more about their own power and influence than what’s best for the people they represent.” While government officials fare particularly poorly, supermajorities of Americans express disappointment with health care leaders, business leaders, and education leaders. It is safe to say there is across-the-board disenchantment with our institutions – not just with the government.\n\nIt wasn’t always this way. While it’s easy – and at times dangerous – to wax nostalgic about the past, there was a time when Americans expressed far greater trust in government and corporate opinions. In 1966, researchers found that almost 80% of Americans thought that they could trust the government in Washington to do the right thing “most of the time” or “just about always.” Over 60% of Americans believed that the government was being run for the benefit of all, and 70% believed that “not many” or “hardly any” of the people running the government in Washington could fairly be described as “crooked.”\n\nWhile having some skepticism about the government’s intentions or abilities may be healthy for a democracy, it seems likely that these astronomical levels of distrust make democracy difficult to sustain. If government’s authority derives from the consent of the governed, but the governed view the ones governing them as untrustworthy, that consent becomes more tenuous. But given that things were not always this way, there is cause for hope that there can be an end to them.\n\nTo better understand this shift in Americans’ faith in both their government and their society, RealClear Opinion Research has partnered with Emerson Polling, through a generous grant from The Heinz Endowments, to produce high quality, large-sample polls of residents of southwestern Pennsylvania.\n\nOur series will focus on ten counties in southwestern Pennsylvania: Allegheny, Armstrong, Beaver, Butler, Fayette, Greene, Indiana, Lawrence, Washington, and Westmoreland. They are depicted in the following map:\n\nWe chose to focus on a particular region because most investigations into trust are conducted at the national level. This can obscure important, granular-level details that may occur at the local level. The reasons a Hispanic resident of downtown Los Angeles may distrust the government, for example, could be different from the reasons that a rural resident of Pennsylvania’s Greene County may distrust the government. \n\nAs for why we chose these counties, we did so for several reasons. First, this is a remarkably diverse region, combining a major metropolitan center with suburban and even rural counties. Allegheny County is centered on the city of Pittsburgh and its inner suburbs. It combines an old industrial city that has experienced ongoing urban renewal with old-line and sprawling newer suburbs.\n\nButler County is the wealthiest county in the region, with a median household income approaching six figures. Like Allegheny’s neighboring counties – Westmoreland and Beaver – it faces challenges in accommodating population growth and commuters while still serving a substantial rural population. Meanwhile, Washington County mixes suburban growth and renewal with an old industrial base and rural areas in the south.\n\nFinally, our sample includes a few counties that are largely a mixture of rural and small-town settings. Greene and Fayette counties are of particular interest, as they are in the heart of Pennsylvania’s Appalachia; Fayette County persistently reports one of the state’s lowest household incomes and among its highest unemployment rates. By employing a unique, large-sample survey in the region, we can explore differences in trust in different contexts while controlling for the overall region.\n\nSecond, the challenges residents experience here exemplify those faced across the nation. Residents of Allegheny County search for affordable housing and scramble to make ends meet in an increasingly expensive Pittsburgh. Unemployment remains a persistent problem, yet while the city seeks to bring in new jobs by reinventing itself as a tech/AI hub, a decades-long decline in the county’s population strains the very tax base needed to provide new infrastructure. Meanwhile, the county’s suburban and exurban residents also need infrastructure improvements for travel to the city.\n\nRural residents express concerns about transportation but also face particular challenges as younger residents leave for seemingly greener pastures beyond the region; local news sources evaporate; and jobs become increasingly hard to find. In recent years, rural colleges in Pennsylvania have faced funding challenges, consolidating or even shutting down. Housing affordability has become an issue here, as corporations increasingly buy land and houses in scenic places like Fayette County, driving up home prices and property taxes. All these problems can affect an individual’s belief that the government is functioning well, as well as one’s ability to trust society as a whole.\n\nFinally, RealClearPolitics is, of course, a political website, so it should be unsurprising that there is a political angle. This region is home to one of the most remarkable political shifts in recent American political history. \n\nFor most of the post-New Deal era, this part of Pennsylvania was one of the most reliably Democratic areas of the U.S. In 1988, Michael Dukakis won almost 60% of the two-party vote (that is, excluding third parties) in the region. In 1992 and 1996, Bill Clinton won 63.2% and 56.5% of that vote. But the Democratic vote share in the area would decline in every subsequent election, until Hillary Clinton won just 46.4% of the vote in 2016. Joe Biden fared slightly better, with 47.7% of the vote – enough to enable him to narrowly carry the state – but Kamala Harris’ vote share dropped again to 47%.\n\nEven this doesn’t tell the entire story, because the Democratic vote share in Allegheny County, the most populous county in the region, has remained remarkably stable over time. Dukakis won 60.1% of the vote there, while Harris won 60.2%. In every other county, Harris ran at least ten points behind Michael Dukakis. This is all the more jarring, given that Harris nearly won the national popular vote, while Dukakis lost it handily. The shifts range from a 10.8 percentage point shift in Butler County to an astonishing 38 percentage point shift in Greene County (Dukakis won 65.2% of the vote, Bill Clinton won 70.8%, Harris won 27.2%).\n\nIn other words, this region is ground zero for the populist shift toward Republicans that we’ve witnessed in the past several decades, and that accelerated in the last decade. Much has been written about Donald Trump’s ability to harness individuals’ lack of faith in government and concerns about the direction of civil society. By looking at determinants of social trust here, we will be better able to understand the most consequential political developments of our time.\n\nWe do wish to emphasize that our goal is not to chide or castigate voters for their low levels of trust or their voting habits. This will not be “What’s the Matter With West Finley.” We will attempt to meet these residents where they are and to understand their viewpoints rather than to criticize them. This project is meant as much to give political leaders insight into how they can regain trust as it is to look at ways where the individual residents’ viewpoints may be in tension with reality.\n\nWe hope you look forward to watching our series unfold as we explore the attitudes of this unique region of America.","summary":"One of the defining features of late 20th and early 21st century American politics is the loss of faith in our institutions. A recent poll in U.S. News shows that 85% of Americans say","url":"https://www.realclearpennsylvania.com/articles/2025/08/18/restoring_trust_in_the_heart_of_pas_political_realignment_1129574.html","image":"https://assets.realclear.com/images/62/626811_6_.jpeg","video":null,"publish_date":"2025-08-19 13:39:03","author":"Sean Trende","authors":["Sean Trende"],"language":"en","category":"politics","source_country":"US","sentiment":0.007},{"id":352233190,"title":"Newsom Wants to Gerrymander His State in the Name of ‘Fairness’","text":"California Gov. Gavin Newsom wants to change California’s rules for drawing lines for House seats. Texas Republicans, he says, want to rig elections to help President Donald Trump in the 2026 election, so California Democrats have to rig back.\n\nForget that the Golden State’s rules already work handily for the Democrats: 45% of voters are registered as Democrats, 25% as Republicans, and 30% list no party preference or another party. Yet there are 43 Democrats representing California in the House, and a modest nine Republicans.\n\nIn 2024, 58% of Golden State voters supported former Vice President Kamala Harris, while 38% supported President Donald Trump. Yet only 17% of House members are Republicans.\n\nFor his part, Gov. Handsome is threatening to tilt the machine even further leftward—in the name of fairness.\n\nMeet his proposed Election Rigging Response Act, “a bold move to counter Texas’ Republican-led redistricting efforts,” which Democrats fear could help the GOP hold onto the House of Representatives during precarious midterm elections.\n\nThe Los Angeles Times reports that the Newsom map could turn five of Cali’s nine GOP seats blue—and cut the stake of the state’s GOP delegation to less than 10%.\n\nNewsom’s proposed Election Rigging Response Act would require a two-thirds majority of the deep blue state Assembly and Senate then passage by voters in a special election to override the independent redistricting commission embedded in the state Constitution by popular vote in 2010.\n\n“From everything I know, he has an incredibly high mountain to climb,” California Democratic political strategist Darry Sragow told me.\n\nSean Walsh, a consultant who served as deputy chief of staff to former GOP California Gov. Pete Wilson, told me Newsom has a bad habit: “The guy simply ignores the law when it’s convenient for him.”\n\nIn 2004, when he was mayor of San Francisco, Newsom flouted state law and directed City Hall to allow same-sex marriages. It was such a stunt that applications included a warning: “NO REFUNDS.”\n\nThe late Sen. Dianne Feinstein, D-Calif., was furious at a scheme that she thought would hurt Democrats at the ballot box. And sure enough, then-President George W. Bush won reelection that year. But Newsom found a sweet spot in the national spotlight.\n\nHistory repeats itself, as Newsom presents a scheme that steamrolls the voters’ will.\n\nAnd that’s no slam dunk.\n\n“As [former Gov.] Arnold Schwarzenegger was reminded in 2005, California voters are very discerning about ballot measures that don’t directly impact them one way or another,” said Sragow.\n\nThat’s the year California voters rejected all four ballot measures Schwarzenegger had backed in what was widely seen as a rejection of the governor’s overuse of the initiative system.\n\nSragow, a former Navy officer, is of two minds on the matter. On the one hand, if you have power, you use it. Period. On the other hand, even if Newsom wins at the ballot box, he will have done nothing to fix the party’s big problem: bad messaging.\n\nI would add that the whole exercise reminds swing voters just how cravenly opportunistic Newsom and company can be.\n\n“This guy is doing everything he can to appeal to national Democrats” to win the presidential nomination in 2028, Walsh noted, but he’s not stepping up on issues that matter to Californians. Think: crime, the state budget shortfall, homelessness.\n\nBut what do you see? Political self-protection.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"California Gov. Gavin Newsom wants to change California&#8217;s rules for drawing lines for House seats. Texas Republicans, he says, want to rig elections to help... Read More\n\n\nThe post Newsom Wants to Gerrymander His State in the Name of ‘Fairness’ appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/08/19/newsom-wants-gerrymander-state-name-fairness/","image":"https://www.dailysignal.com/wp-content/uploads/2025/08/newsom-3.jpg","video":null,"publish_date":"2025-08-19 12:00:00","author":"Debra Saunders","authors":["Debra Saunders"],"language":"en","category":"politics","source_country":"us","sentiment":0.004},{"id":352223436,"title":"Republicans are making a very simple, unforced mistake with Latino voters","text":"For all the talk of a new, lasting multiracial coalition that helped elect President Donald Trump, there are clues that this support may be wavering, particularly among Latino voters. Polls show the president’s approval rating with this group has plummeted since the last election, and a third of Latinos who voted for him say they are unlikely to back a Republican candidate in the next one. \nThis collapse happened for a few reasons. Latino voters are souring not only on the president generally, but also on his handling of key issues like immigration and the economy — the very topics that boosted his support with them initially. And curiously, this decline in support for the president isn’t translating into a surge for Democrats. Instead, many Latino voters express dissatisfaction with both parties.\nThis shifting dynamic suggests that both parties have been operating on flawed assumptions over the last few years. Democrats made the mistake of treating Latinos as a monolithic group, focusing on social justice issues while failing to address economic concerns that were pushing these voters toward the GOP. \nNow, Republicans may be poised to make a similar mistake. They have largely viewed these voters as Republicans-in-waiting, banking on a rightward drift that they assume extends to the most extreme parts of the conservative social agenda. This approach risks alienating a large segment of the Latino electorate. Ultimately, both parties are learning a crucial lesson: Demographics aren’t destiny, and they need a more nuanced understanding of this diverse and rapidly changing group of voters.\nThe Democrats’ shrinking Latino majority\nOver the last decade, Trump has remade the American electorate with the help of Latino voters. Back in 2016, his highly racialized and polarizing election victory resulted in one of the worst performances with Latino voters in modern history, winning fewer than three in 10 Hispanic and Latino voters, well below average for Republican candidates.\nBut splits began to develop among Latino communities in the US over the next few years. Working-class, non-college educated, and male Latinos, as well as those from Florida and the Southwest, began to drift away from Democrats, particularly at the national level. They were more intrigued by Republican pitches centered around the economy, small business growth, and affordability. \nAt the same time, Democrats were hesitant to admit they had an issue with the Latino population, quibbling over messaging and campaign investments while missing the plot. By the time of the 2020 election, Trump had managed to not just recover his party’s losses in 2016, but expand on them, shrinking the Democratic advantage with Latinos by nearly 20 points.\nDemocrats, it turns out, misread Latino voters’ priorities and beliefs, gradually losing support from the peak they had from 2012 to 2016 (when Barack Obama and Hillary Clinton enjoyed 40-point margins). The party largely approached Latinos as “voters of color,” marginalized minorities who could be mobilized through appeals to identity, immigrant solidarity, and social justice.\nFor some time, this worked, but Latinos weren’t behaving like a monolithic group. Instead, Latinos would fracture and become more dissimilar during this time, with various kinds of evangelicals, border residents, naturalized immigrants, and working-class Latinos remaining or becoming more conservative as the Democratic Party and its white, college-educated base became more progressive. \nParticularly on issues like crime, immigration and the border, and gender roles and identity, the liberal positions that Democrats took — or were portrayed to take — were out of step with the views of many conservative and moderate Latinos from 2020 to 2024.\nIn 2021, the Pew Research Center found that the most liberal, educated, and politically engaged Democrats exerted outsized influence on their party. By the 2024 election, this created an opening for Republicans, as Latino voters expressed greater openness to Trump and the GOP’s stances on the economy, immigration, and abortion. By then, their votes had begun to follow some of their beliefs.\nRepublican gains came quickly\nAs Democrats stumbled, Republicans stuck to a different approach: treating Latinos as a new kind of white voter. They doubled down on a hawkish and xenophobic immigration message that seemed to resonate with a large minority of Latinos, spoke of the border as an issue of crime and public safety, and talked nonstop about prices and affordability to exploit the lack of trust in Democrats’ stewardship of the economy.\nRepublicans sought to make the old Reagan line, that “Hispanics are conservatives, [but] they just don’t know it yet,” come true by hammering home the idea that Kamala Harris and the Democratic Party were too radical and out of touch. \nThis approach worked. Latinos concerned with immigration and the economy shifted to Republicans, and Trump posted a double-digit boost in support among Latinos, shrinking the Democratic advantage another 20 points.\nContinued Latino support is not a given\nAn array of data suggests that this advantage is looking more short-lived, largely because Republicans aren’t taking into account the nuances of Latino voters. The GOP still did not win a majority of Latinos last year — and much of the boost was from disaffected Democrats or more moderate, disengaged Latinos who don’t have the same strong ideological leanings as the primarily white MAGA base.\nThe most recent evidence for this divergence comes from two research projects undertaken by the Democratic-aligned Equis Research group. In the spring, they tracked growing dissatisfaction among Latino voters with Trump’s handling of the economy, cost of living, and immigration. Even among what Equis calls “Biden defectors,” those former Democrats who switched to supporting Trump in 2024, a slight majority were beginning to turn on Trump’s economic policies.\nThis dynamic extended to immigration, where an overwhelming majority of all Latino voters thought the administration’s actions were “going too far and targeting the types of immigrants who strengthen our nation.” Some 36 percent of Trump-voting Latinos said the same thing, and a majority of Biden defectors, some 64 percent, felt the same way. \nThis suggests some degree of remaining immigrant solidarity among these swingier, evolving segments of the Latino electorate and disapproval over how mass deportations and aggressive anti-immigrant policies will affect law-abiding immigrants and their families. \nNearly two-thirds of Latinos in Equis’ polling believe that the Trump administration’s actions “will make it difficult for hardworking Latinos to feel safe, by increasing racial profiling and harassing all Latinos regardless of immigration status.” In other words, there is a limit to what various kinds of Latino voters are willing to stomach.\nThe same dynamic is becoming clearer with regards to the economy, where Latino voters, and new Trump voters specifically, are unhappy with the state of the economy. Biden defectors, Equis finds, are net negative on Trump’s economic policies: -6 percent of support in May and -8 percent in July.\nWhether this dynamic not only hurts the GOP but also helps Democrats is unclear. Although many Latino voters still believe Republicans favor the wealthy over the working class, this long-standing sentiment is no longer pushing them toward the Democratic Party. Instead, they increasingly distrust both parties on this question.\nBut together, these signs suggest that the GOP is going too far with their policy and ideological mission in Trump’s second term, turning off the new converts they won to their coalition over the last 10 years.\nWhere the parties go from here\nThe two major parties are making errors with Latino voters. Both have to moderate their policy and ideological approaches while bringing more nuance to how they campaign.\nLatinos do have some things that bind them together, and they are not just like white voters who can ignore discrimination and scapegoating and uprooting of their extended community’s lives (as immigration enforcement is showing). At the same time, they need to be talked to with more nuance.\nDemocrats tried to do this in 2024, moderating on immigration, dropping the usage of the term “Latinx,” and investing in hyper-specific, hyper-local campaigning with various kinds of Mexican Americans, Cuban Americans, Puerto Ricans, and others. But there was only so much campaigning they could do when facing a wave of anti-Biden, anti-incumbent electoral sentiment.\nRepublicans, meanwhile, toned down immigration talk and zeroed in on subgroups of the Latino electorate in battleground states in 2020. They appealed to religious and ideological conservatives — Cuban, South American, and Puerto Rican communities in Florida, as well as border communities in Arizona, Nevada, and Texas. Some of this nuanced campaigning did carry over to 2024, but it focused more on young and male Latinos in general. And 2024 saw a return to a kind of dog-whistle, racialized, and anti-immigrant scapegoating, which helped the anti-incumbent tide.\nLatino voters are rapidly changing, existing as both a racial minority and an assimilating, formerly immigrant generation. Both parties will have to find a middle ground to recover or build up their coalitions. There is no such thing as a Latino voter, but rather, various kinds of Latino voters. Each must be approached differently.","summary":"For all the talk of a new, lasting multiracial coalition that helped elect President Donald Trump, there are clues that this support may be wavering, particularly among Latino voters. Polls show the president’s approval rating with this group has plummeted since the last election, and a third of Latinos who voted for him say they [&#8230;]","url":"https://www.vox.com/politics/458390/republicans-latino-realignment-trump-economy-solidarity-immigrant-deportations-democrat","image":"https://platform.vox.com/wp-content/uploads/sites/2/2025/08/gettyimages-2220155662.jpg?quality=90&strip=all&crop=0,10.752607989199,100,78.494784021602","video":null,"publish_date":"2025-08-19 10:45:00","author":"Christian Paz","authors":["Christian Paz"],"language":"en","category":"politics","source_country":"us","sentiment":0.184},{"id":352219616,"title":"Vaccines Under Attack","text":"How much will Texas’ redistricting efforts help Republicans? Eli McKown-Dawson breaks down the numbers for Nate Silver’s Silver Bulletin, saying that picking up an additional five seats in the House of Representatives isn’t as certain as some Republicans might hope: “It’s helpful to think about the five Texas districts that are supposed to flip from blue to red thanks to the new map as two separate groups. First, the 9th, 32nd, and 35th Congressional Districts. Kamala Harris won all three districts in 2024 under the old congressional map. Back then, they were located in the heart of major Texas cities: Houston, Dallas, and Austin, respectively. Under the new map, parts of each district would be moved into more suburban areas that voted for Trump in 2024. The result? Trump would have won the new 9th, 32nd, and 35th Districts by an average of 14 points in 2024 and he would have won all three districts in 2020. In these three districts, GOP plans change the composition of these districts pretty dramatically. Not only have they shifted right, but they’ve gone from mostly urban to largely suburban. …. But the other two districts (the 28th and 34th) are less of a straightforward win for Republicans. TX-28 and TX-34 are located in South Texas on the border with Mexico and are both majority Hispanic. About 87 percent of the citizen voting age population (CVAP) in the new TX-28 is Hispanic. And the new TX-34 is 72 percent Hispanic. Both of these districts also already voted for Trump in 2024 even under the old map. The new map makes them redder: R+7.3 → R+10.4 for TX-28 and R+4.5 → R+10.1 for TX-34. But even under those lines, Joe Biden would have carried these districts in 2020 by 9.6 and 2.9 points, respectively.” To read more about the Texas redistricting fight, read last Thursday’s TMD. \n\nThe definition of art can lead to a long and generally fruitless argument, but it has renewed pertinence in the era of AI-generated imagery. In a new Substack post, blogger and director of Effective Altruism DC, Andy Masley acknowledges that he can’t answer that question—or the question of whether you can say you even “made” AI-generated imagery—but presents a diverse series of 152 AI generated pictures, in a wide range of styles. “I think a lot of people still don’t know how good AI art’s gotten. I’m surprised that I haven’t seen more people playing around with it, or making the type of images I personally like,” he wrote. “If we have the same aesthetic taste, you’ve also probably thought a lot of popular AI art looks kind of ugly. If we enjoy the same vibes, I’m hoping this post will convince you that AI tools can help you make a lot of images you find interesting and fun.” The writers at TMD particularly like the album covers, “worlds made of weird textures,” and faux-photos of cafes and diners, but let us know which you like (or if you hate all of them) and what you think about AI imagery.","summary":"RFK Jr. turns the federal government against vaccines.","url":"https://thedispatch.com/newsletter/morning/vaccines-under-attack/","image":"https://thedispatch.com/wp-content/uploads/2025/08/GettyImages-2199432677.jpg?w=1024","video":null,"publish_date":"2025-08-19 10:30:49","author":"James P. Sutton,Peter Gattuso,Ross Anderson","authors":["James P. Sutton","Peter Gattuso","Ross Anderson"],"language":"en","source_country":"US","sentiment":0.365},{"id":352315208,"title":"Chris Pratt Says He 'Loves' Robert F Kennedy Jr and Finds Him 'Funny' at Family Gatherings","text":"Guardians of the Galaxy star Chris Pratt said he really got along with Robert F. Kennedy Jr., sharing that he has spent time with him at family gatherings. Speaking on Bill Maher’s Club Random podcast on August 18, Pratt noted their connection through his wife, Katherine Schwarzenegger. She is the granddaughter of Eunice Kennedy Shriver, making Kennedy Jr. her uncle.\n\n“I’ve spent a number of occasions hanging with him, just in a strictly family dinner kind of vibe, and I really got along with him well,” Pratt said. “I think he’s great. I think he’s funny. I like him. I love him.”\n\nChris Pratt reflects on the rough world of politics\n\nChris Pratt stressed that his comments were personal, not political. “It’s not like I sit with Bobby and go, ‘So hey, let’s talk about this,’” he told Maher. “We’re just playing cards or playing Mafia or having fun or having dinner.” He added that politics is “a nasty business,” and that he has seen “how the person you are can be such a contrast to the person that people are being told that you are.”\n\nIs Chris Pratt endorsing Robert F. Kennedy Jr.?\n\nPratt stopped short of a policy debate and said he tries not to judge headlines alone, especially after Robert F. Kennedy Jr. aligned with Donald Trump in 2024. “When you jump on the bandwagon with the most divisive president ever, it makes sense that you’re going to be made to look terrible. So I don’t know what to believe,” he said. “I’m not going to pick his brain to find out exactly which of those things are true. I just kind of assume that none of them are, and for the most part, I wish him well.”\n\nThe Guardians of the Galaxy lead, known to fans as Star-Lord, also argued that people should be able to acknowledge successes even if they oppose a president. “I’d hate to be so mired in hatred for the president that any success from his administration is something I’d have an allergic reaction to,” he said.\n\nPratt faced criticism ahead of the 2024 election for keeping a neutral public stance while many celebrities took sides. Several of his MCU co-stars publicly supported Kamala Harris, including in a widely shared “Avengers assemble” video, while Trump ultimately won the election.\nALSO READ: Michelle Yeoh Shares How She and Jean Todt Made Their 2-Year Marriage Work After a 6,992-Day Engagement","summary":"Guardians of the Galaxy star Chris Pratt said he really got along with Robert F. Kennedy Jr., sharing that he has spent time with him at family gatherings. Speaking on Bill Maher&rsquo;s Club Random podcast on August 18, Pratt noted their connection through his wife, Katherine Schwarzenegger. She is the granddaughter of Eunice Kennedy Shriver, making Kennedy Jr. her uncle.\n\n\n\n&ldquo;I&rsquo;ve spent a number of occasions hanging with him, just in a strictly family dinner kind of vibe, and I really got along with him well,&rdquo; Pratt said. &ldquo;I think he&rsquo;s great. I think he&rsquo;s funny. I like him. I love him.&rdquo;\n\n\n\nChris Pratt reflects on the rough world of politics\n\n\n\nChris Pratt stressed that his comments were personal, not political. &ldquo;It&rsquo;s not like I sit with Bobby and go, &lsquo;So hey, let&rsquo;s talk about this,&rsquo;&rdquo; he told Maher. &ldquo;We&rsquo;re just playing cards or playing Mafia or having fun or having dinner.&rdquo; He added that politics is &ldquo;a nasty ","url":"https://www.pinkvilla.com/entertainment/hollywood/chris-pratt-says-he-loves-robert-f-kennedy-jr-and-finds-him-funny-at-family-gatherings-1395781","image":"https://www.pinkvilla.com/images/2025-08/85766240_untitled-design-4.webp","video":null,"publish_date":"2025-08-19 07:07:01","author":"Sakina Kaukawala","authors":["Sakina Kaukawala"],"language":"en","source_country":"in","sentiment":0.142},{"id":352227506,"title":"Trump Critics Should Stop Treating Diplomacy Like a Gift to America's Enemies","text":"Is President Donald Trump \"coddl[ing] dictators\"? That was what Joe Biden said when Trump met with North Korean Supreme Leader Kim Jong Un during the first Trump administration. And Democrats have begun rolling out the same lines of attack in response to Trump's summit last week with Russian President Vladimir Putin in Anchorage, Alaska.\n\n\"The fact that this meeting even took place—at the invitation of President Trump, on American soil, without Ukraine present, and with zero concessions from Russia—is an undeserved reward for Putin, who has continued to bomb Ukrainian schools and hospitals, abduct Ukrainian children, and refuse to negotiate meaningfully about an end to the horrific war he started,\" House Foreign Affairs Committee Ranking Member Gregory Meeks (D–N.Y.) declared. \"By quite literally rolling out the red carpet, Trump has legitimized Russia's aggression and whitewashed Putin's war crimes.\"\n\nIn other words, Democratic critics are treating the very existence of contacts between leaders as a surrender. And by doing so, they're boxing themselves into a dangerous, pro-war position. Of course, diplomacy should be judged by its results; both the North Korean outreach and the Anchorage summit were inconclusive. But if the president can't even deign to talk to foreign rivals, then it becomes impossible to avoid or end violent conflict.\n\nThe North Korean case was particularly illustrative. Although it's easy to forget now, the risk of a nuclear war felt very real in 2017. North Korea was testing missiles capable of hitting American soil, and the U.S. military was massing forces on the Korean peninsula, as Trump advisers called for a first strike. While the meetings between Trump and Kim didn't convince North Korea to \"denuclearize\"—probably an impossible demand to begin with—they did cool down the situation enough to avoid an immediate conflict.\n\nAnd in other cases, the Democratic criticism was incoherent on its own terms. During the first Trump administration, Biden attacked Trump for bringing the U.S. to \"the brink of a major conflict across the Middle East.\" Then, during the 2024 election, Biden's successor Kamala Harris attacked Trump for not escalating more against Iran. After Trump bombed Iran earlier this year, Democrats had a confused and muddled response.\n\nSome Democrats believe that their party should stop trying to out-hawk Republicans in general. House Armed Services Committee Ranking Member Adam Smith (D–Wash.) declared earlier this year that Democrats should \"much more aggressively embrace diplomacy,\" particularly with Russia, and avoid being painted as warmongers. \n\nIn the run-up to the Anchorage summit, Smith told NewsNation that \"I don't think it's particularly bad that they have the conversation. What's bad, to date, is that President Trump has not shown, I think, the unity behind Ukraine to really put pressure on Putin.\" After the summit, he called it \"very disappointing\" that Trump moved away from his demand for an immediate ceasefire.\n\nIndeed, Trump told reporters on Monday that \"I don't think you'd need a ceasefire\" because \"we're working on a peace deal while they're fighting\" and \"we're not talking about a two-year peace and then we end up in this mess again.\"\n\nThe offer that appears to be on the table is a land-for-peace swap between Russia and Ukraine. Putin reportedly offered to withdraw from the Ukrainian border regions of Sumy and Kharkiv in exchange for Ukraine giving up the rest of Donetsk Oblast, which Russia claims as its own. According to The Times, the Trump administration has discussed a way for Ukraine to give up Donetsk without formally letting Russia annex it: putting it under an autonomous administration modeled off the Palestinian Authority under Israeli control.\n\nU.S. Special Envoy Steve Witkoff also said after the summit that Putin agreed that Ukraine could have international security guarantees. Sources who spoke to Reuters were more cautious, stating that Putin wanted Ukraine to be barred from NATO but seemed \"open to Ukraine receiving some kind of security guarantees.\" An adviser to Trump told Axios that the guarantees might include U.S. troops in Ukraine.\n\nThese are all very serious issues worthy of public debate, particularly the prospect of putting American peacekeepers in another conflict zone. That's exactly why the debate cannot stop at Meeks' complaints about \"rolling out the red carpet\" for Putin. There may be better or worse strategies to end the war—but refusing to talk is no strategy at all.","summary":"His negotiations with North Korea and Russia should be judged by their results. But opposing those talks from the beginning is a pro-war position.","url":"https://reason.com/2025/08/18/trump-critics-should-stop-treating-diplomacy-like-a-gift-to-americas-enemies/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/08/polspphotostwo306345.jpg","video":null,"publish_date":"2025-08-18 21:53:55","author":"Matthew Petti","authors":["Matthew Petti"],"language":"en","category":"politics","source_country":"US","sentiment":-0.502},{"id":352270814,"title":"An Account Using the Same Name as Trump’s BLS Pick Posted Red-Pilled Conspiracy Theories","text":"The account, which used “Dr. Erwin J. Antoni III” as its screen name for a time, was linked by the conservative Heartland Institute think tank when referring to Antoni in a 2020 post on Twitter promoting one of its own YouTube videos in which he appeared. A WIRED review of an archive of the account’s posts shows that in the months leading up to the attack on the Capitol, it spread baseless conspiracy theories about the 2020 election and shared content from The Donald, a virulently pro-Trump message board that was used to organize the events of Jan 6, 2021.\nOne of the final posts on the now deleted account used violent religious rhetoric in the hours before the assault on the Capitol began.\n“Samson has his arms around the temple pillars, and though he may not survive, he will bring it all down on his enemies,” the account posted late on January 5, 2021, in response to a Twitter post from Trump calling on Republicans to “FIGHT.“\nLast week, an NBC investigation uncovered video footage showing Antoni near the Capitol on January 6, 2021. The White House confirmed to NBC that it was Antoni, adding that he was merely a “bystander” who was in Washington, DC, for meetings and had wandered over after seeing coverage of the incident on the news.\nThe White House declined to answer WIRED’s questions about the account and its relationship to Antoni. When asked to comment on the account’s postings, Antoni did not respond.\nAntoni was nominated for the role of BLS commissioner after Trump fired Erika McEntarfer on August 1, claiming without evidence that she had purportedly “rigged” an updated jobs report that suggested the US economy was not as hot as Trump has repeatedly claimed.\nHis main qualification for the job appears to be that he is the chief economist for the Heritage Foundation, the conservative think tank behind Project 2025, a policy blueprint that Antoni contributed to. But his nomination has been widely criticized by Antoni’s fellow economists, who cite his lack of relevant experience and what they allege to be errors in his public comments on economic data.\n“I've been on several programs with him at this point and have been impressed by two things: his inability to understand basic economics and the speed with which he's gone MAGA,” Dave Herbert, an economist at the conservative American Institute for Economic Research, wrote on X.\nWhile Antoni’s current X account—which is almost exclusively filled with economic data and analysis—shows little sign of MAGA credentials, the now-deleted Twitter account bearing his name is filled with deeply red-pilled content.\nThe account was active at least between September 2019 and January 2021, and had the username @PhDofbombsaway. It used several different screen names, including “Dr. Erwin J. Antoni III” and “Dr. Curtis LeMay,” an apparent reference to the US Air Force general who oversaw a campaign of firebombing Japan in World War II, promoted the use of nuclear weapons, and ran for the vice presidency alongside segregationist George Wallace in 1968. The account’s profile picture was a stock image of a fiery mushroom cloud.\nThe account’s persona was that of a deeply loyal Trump supporter engaging in conspiracy theories ranging from Covid denialism to attacks on Black Lives Matter, and even ones related to the death of Jeffrey Epstein. The posting, which was infused with a deeply hard-line Catholic worldview, at times displayed misogyny and a knowledge of Nazi military techniques.\nThe account posted a mixture of conspiracy theories and pro-Trump MAGA content, sharing a veritable who’s who of right-wing influencer accounts, including Jack Posobiec, Mark Dice, James O’Keefe, Scott Adams, Cassandra MacDonald, Steven Crowder, James Woods and Robby Starbuck.\nThroughout 2020, the account shared Covid conspiracy theories, especially focusing on the claims that China had purposely manufactured the virus to destroy its enemies.\nIn February 2020, responding to a posting asking how many nuclear bombs America should drop on China if it turns out the country was responsible for Covid-19, the account—which was using the “Dr. Curtis LeMay” screen name, according to captures from the Internet Archive—wrote “All the bombs—trust me, I’m kind of the expert on this.”\nThe account posted a wide variety of conspiratorial content, as well as misogynistic content. In November 2019, for example, the person controlling the account claimed that Jeffrey Epstein “didn’t kill himself.” That same month, in response to a post about then presidential candidate Kamala Harris, they wrote, “She does her best work when life brings her to her knees.”\nBut the account was most consistently vocal in its embrace of the conspiracy theory that Joe Biden stole the 2020 presidential election.\nIn the days after the November 3, 2020, election, the account posted hundreds of times as it fully embraced numerous conspiracy theories about how the vote had been rigged.\nWhile citing dozens of different GOP lawmakers, Trump himself, and far-right influencers like Phillip Buchanan, the right-wing internet troll known as Catturd, the account most frequently shared claims of election conspiracies from an account called Election Wizard.\nThat account was run by Travis Vernier, a former Oklahoma City police officer who had no experience in assessing election data. Despite this, Election Wizard became one of the most influential voices in the Stop the Steal movement, to the point that Vernier was even invited to Mar-a-Lago for Trump’s 2022 announcement that he was running for president again.\nAs well as sharing conspiracy theories, the account bearing Antoni’s name repeatedly used violent rhetoric to declare how far it was willing to go to ensure Trump secured a second term in office.\n“One side has over 1 trillion rounds of ammunition and the other side can’t figure out which bathroom to use,” the account wrote in response to a post from QAnon promoter Tracy Beanz. “I’ll take those odds.”\nWhen Christina Bobb, a far-right television personality who became a primary promoter of election conspiracy theories, wrote on Twitter that the right should take “no prisoners” in defending Trump, the account wrote: “We give no quarter.”\nThe posts made by the account bearing Antoni’s name are sprinkled with hard-line Catholic content, including multiple interactions with Michael Voris, the founder of the hard-line Catholic group Church Militant. The account also frequently shared comments from ultra-conservative Catholic archbishop Carlo Maria Viganò, the former nuncio to the United States who was excommunicated in 2024 after having repeatedly repudiated and criticized then-Pope Francis, as well as challenging the reforms of the Second Vatican Council. Antoni attended Lansdale Catholic High School, where his mother was the STEM coordinator, and then St. Charles Borromeo Seminary in the Philadelphia suburbs.\nIt’s unclear if the person controlling the account deleted it or if it was included in a broad purge of Twitter accounts in response to January 6. As of Trump’s nominating Antoni as the top BLS official, he tweets from an account that is almost exclusively dedicated to sharing economic data.\nWhile Antoni's social media presence is largely single-subject focused, there are still signs of similarity between his interests and those of the account previously bearing his name.\nOn multiple occasions, for example, Antoni has made media and podcast appearances in a room with a large painting of a battleship behind him. During one 2023 podcast appearance, Antoni confirms to the host that the ship in question is from the fleet of Nazi Germany.\n“The Bismarck, yep, in all his glory,” Antoni said.\nThe Twitter account also referenced Nazi Germany. In 2019, in response to a Twitter user writing, “We definitely need AR-15s” next to a video of a Boston Dynamics robot, the account using Antoni’s name wrote: “We need panzerschrecks.“\nA Panzerschreck was a reusable anti-tank rocket launcher developed by Nazi Germany during World War II.\nWIRED initially contacted the White House last week after it received a direct message on X purporting to be from Antoni’s real account that seemingly confirmed @PhDofbombsaway was his. The White House noted that the DM actually came from a fake Antoni account and declined to answer further questions.","summary":"A WIRED review of a now deleted Twitter account that used the screen name “Dr. Erwin J. Antoni III” shows it posted conspiratorial content about the 2020 election, Covid-19, and Jeffrey Epstein.","url":"https://www.wired.com/story/twitter-ej-antoni-trump-bls-conspiracy-theories-epstein-covid-election-denial/","image":"https://media.wired.com/photos/689e2af77cc2dbb945f508ba/16:9/w_992,h_558,c_limit/politics_EJ_TWH.jpg","video":null,"publish_date":"2025-08-18 21:25:31","author":"David Gilbert","authors":["David Gilbert"],"language":"en","category":"politics","source_country":"US","sentiment":-0.096},{"id":352262312,"title":"Trump's Limbs Are Looking Awfully Swollen","text":"It appears that president Donald Trump's years of fast food and snack guzzling have finally caught up to him — and the entire world can tell.\n\nDuring Trump's summit last week with Russian president Vladimir Putin in Alaska to discuss finally bringing an end to the war in Ukraine, the junk food-loving president's ankles were visibly swollen to a painful-looking degree in his shiny black Oxfords.\n\nThat swelling was pronounced in the photo below, which was taken by Andrew Harnik for Getty Images and which we cropped and lightened so you can see the outline of his ankles where they were hidden by shadow.\n\nWhile there's nothing all that unusual about a larger aging man developing so-called \"cankles,\" Trump's do not appear to be the byproduct of your average weight gain.\n\nLast month, White House physician Sean Barbabella revealed in a statement that the president had been diagnosed with chronic venous insufficiency (CVI), which occurs, Johns Hopkins notes, when leg veins struggle to pump blood back up to the heart. Instead, it pools in the legs, resulting in the swollen appearance we see on Trump. Though it's fairly common for people over the age of 70 to develop CVI, it can be exacerbated by spending a lot of time on one's feet and eating a lot of junk food — and if nothing else, this president is indeed known for his love of golfing and hamberders.\n\nThat July admission came as a reversal from another Barbabella statement back in April, when the White House doctor denied following the president's annual physical that he had anything wrong with him. Despite a viral video in March showing the president limping on the golf course, Trump's physician insisted that \"blood flow to his extremities [was] unimpaired.\"\n\nThough we can't be positive of the exact impetus for Barbabella's course-correction, another photo of Trump's alarming ankle swelling was taken just a day prior to the White House physician's diagnosis announcement. Shown below, that photo, which was taken by Anna Moneymaker for Getty Images, shows just how pronounced the president's cankles appeared.\n\nJust a few days before the Trump-Putin summit — which was also attended by secretary of state Marco Rubio, who the president once maligned based on limb size — White House press secretary Karoline Leavitt defended her boss and his health.\n\n\"Look, you see the president every day,\" the press secretary told reporters last week. “He’s moving, he’s working, he’s continuing, there have been no adjustments made to his lifestyle.\"\n\nWhile it's very much in character for Trump to not change his habits after being diagnosed with a disorder that will, per the Cleveland Clinic, only get more painful if left untreated, it's very telling that the president has not taken steps to ease his condition, even as he holds important televised meetings with heads of state like Putin.\n\nAnd let's not forget that despite any insistence to the contrary, Trump is 79 years old — meaning he's twice broken the record as the oldest person inaugurated to the American presidency.\n\nThe ravages of aging, of course, catch up to us all in myriad ways — a biological happenstance that Trump made sure to pound into the ground when his predecessor, president Joe Biden, began to show hints of cognitive decline towards the end of his single presidential term.\n\nAs the Daily Beast points out in a separate piece, Biden's seeming cognitive issues didn't become undeniable until he had less than a year left as commander-in-chief — and they were so pronounced that Democrats decided, far too late, to select then-vice president Kamala Harris as their nominee. Trump, by comparison, is less than two-thirds of his way through his first year back in the Oval Office — and already, he's showing unmistakable signs of health problems.\n\nWhen his predecessor became too unwell to ignore, his party was forced to take action. Though Trump isn't visibly sundowning just yet, those cankles are mighty worrisome — and it seems nearly impossible to imagine this president getting into salads that aren't made in Trump Tower and feature edible bowls in enough time to reverse course.\n\nStill, it might be time for Trump to be strong-armed into cutting out at least some of the nutrition-less drivel that makes up his diet, lest we see him doze off on camera again in what could very well have been a blood sugar crash. After all, this man has the nuclear codes.\n\nMore on Trump-style diets: Test Shows Junk Food’s Alarming Impact on Human Cognition","summary":"It appears that president Donald Trump's years of fast food and snack-guzzling have finally caught up to him — and the entire world can tell. During a recent summit with Russian president Vladimir Putin in Alaska to discuss finally bringing an end to the war in Ukraine, the junk food-loving president's ankles were, as the Daily Beast flags, visibly swollen to a painful-looking degree in his shiny black oxfords. While there's nothing all that unusual about a larger, aging man developing so-called \"cankles,\" Trump's do not appear to be the byproduct of your average weight gain. Last month, White House […]","url":"https://futurism.com/neoscope/trump-limbs-swollen","image":"https://wordpress-assets.futurism.com/2025/08/trump-limbs-swollen.jpg","video":null,"publish_date":"2025-08-18 21:05:06","author":"Noor Al-Sibai","authors":["Noor Al-Sibai"],"language":"en","source_country":"us","sentiment":-0.227},{"id":352208468,"title":"Jimmy Kimmel says voting for Stephen Colbert at the Emmys is the 'least we could do at this point'","text":"Jimmy Kimmel is advocating for his friend and fellow late-night host Stephen Colbert to finally nab the hard-fought-for Outstanding Talk Series win at the Emmys this year.\n\n In a conversation with Variety shortly after CBS' parent company, Paramount, announced that The Late Show will end in May amid its Trump administration-sanctioned $8 billion merger with Skydance, Kimmel explained to the outlet why he chose to use his show's FYC billboard to declare his intention to vote for Colbert.\n\n \"Well, it seems like voting for Stephen is the least we could do at this point, and I think it will be a nice statement if he does win,\" Kimmel said. \"Obviously, awards don't mean much, but every once in a while they do, and in this case, I think it will. So I fully expect Stephen to win the Emmy as I think people are very, very upset about what happened to him and his show.\"\n\n Colbert's show has been nominated nine years in a row but has never won in the category.\n\n When asked why people should vote for Colbert's show, Kimmel complimented the late-night host for being a \"very ethical person.\"\n\n He continued, \"He is the salt of the earth. He is a humble person and an extremely smart person. I hope that whatever he does next is even more powerful than what he'd been doing. And I think that's very possible.\"\n\n The announcement of The Late Show's cancellation, which will end the franchise after it has aired for 33 years, provoked backlash from famous faces and fans alike.\n\n Sen. Elizabeth Warren — who has been candid about her disapproval over Paramount settling the lawsuit brought by Trump over a 2024 60 Minutes interview with his contender in that year's presidential election, Kamala Harris — is among the move's most vocal detractors.\n\n \"CBS canceled Colbert's show just THREE DAYS after Colbert called out CBS parent company Paramount for its $16M settlement with Trump — a deal that looks like bribery,\" the Massachusetts senator wrote on X on Thursday. \"America deserves to know if his show was canceled for political reasons. Watch and share his message.\"\n\n Kimmel expressed skepticism to Variety that Paramount's decision was financial, even with reports that Colbert's show was losing $40 million a year.\n\n \"The idea...is beyond nonsensical. These alleged insiders who supposedly analyze the budgets of the shows — I don't know who they are, but I do know they don't know what they're talking about,\" Kimmel asserted. \"They seem to only be focused on advertising revenue and have completely forgotten about affiliate fees, which number in the hundreds of millions — probably in total billions — and you must allocate a certain percentage of those fees to late-night shows.\"\n\n Kimmel countered that it is \"surprising how little the media seems to know about how the media works.\"\n\n \"There's just not a snowball's chance in hell that that's anywhere near accurate. Even that — that's all you need to know. Suddenly, he's losing $40 million a year? I will tell you, the first 10 years I did the show, they claimed we weren't making any money — and we had five times as many viewers on ABC as we do now,\" Kimmel said of his late-night show. \"Who knows what's true? All I know is they keep paying us —and that's kind of all you need to know.\"\n\n Many critics have questioned the timing of the announcement, pointing out that Colbert had recently criticized CBS' corporate parent, Paramount Global, for agreeing to pay $16 million to President Donald Trump over an interview with former Vice President Kamala Harris that aired on 60 Minutes in November. Trump has long disliked late-night hosts' jokes about his administration and celebrated news of The Late Show's cancellation on social media, writing that Colbert's \"talent was even less than his ratings.\"\n\n He then praised Fox News late-night comedian Greg Gutfeld, who Trump wrote \"is better than all of them combined, including the moron on NBC who ruined the once great Tonight Show,\" referring to Jimmy Fallon.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n For his part, Colbert has not backed down, continuing to openly criticize Trump and his administration throughout the president's second term. Reacting to Trump's post about his cancellation, Colbert said, \"How dare you, sir. Would an untalented man be able to compose the following satirical witticism: Go f--- yourself.\"","summary":"\"I think it will be a nice statement if he does win,\" Kimmel adds.","url":"https://ew.com/jimmy-kimmel-voting-for-stephen-colbert-at-the-emmys-11793086","image":"https://ew.com/thmb/zPDQknzRQ2D29r7T75tVL0zSdaY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/jimmy-kimmel-stephen-colbert-071825-63ee76c3fe0d43088e532850bee28df4.jpg","video":null,"publish_date":"2025-08-18 20:50:36","author":"Mekishana Pierre","authors":["Mekishana Pierre"],"language":"en","source_country":"US","sentiment":-0.1},{"id":352194538,"title":"CBS News plans major 'tweak' to its ailing nightly news show after two-anchor format sent ratings into freefall","text":"CBS Evening News is set to experiment with yet another format change after adding another anchor to the mix back in January - a strategy widely panned as a 'disaster' at the time.\n\nThe new strategy, insiders told Variety, will see one of the anchors more frequently thrust into the field to report on major, breaking events.\n\nThe other will stay on-set to oversee the broadcast solo, as Norah O'Donnell, Katie Couric, Dan Rather, and Walter Cronkite did previously.\n\nIt could be seen last week when John Dickerson was on the ground in Alaska to report on Donald Trump's summit with Vladimir Putin. As he delivered breaking news, Maurice DuBois stayed behind in Manhattan.\n\nMaking use of both cohosts in such a way appears to thrust the idea of having two anchors side-by-side to the wayside.\n\nThe show has lost more than 1.2million viewers since it strayed from the format.\n\nPeople familiar with CBS's news division further told Variety how staffers there are scared of rumored layoffs.\n\nExecutives from Skydance signaled earlier this month they intended to continue with Paramount's plans to cut $2 billion in costs from the company.\n\nStreaming continues to take away from revenue brought by traditional advertising and distribution.\n\nCBS News, however, has found itself in a tougher spot - last-place of the legacy news stations in both primetime and mornings.\n\nMost notably, the gap is growing on the evening front.\n\nO’Donnell, less than a year ago, had reeled in an average of roughly 5million total viewers, as well as 721,000 viewers aged 25 to 54 for her broadcast.\n\nThose numbers were down to 3.744 million total viewers and 516,000 viewers in the advertiser-coveted demographic as of August 4, seemingly in response to the dual-anchor experiment.\n\nAside from doing away with a single host after decades, the strategy saw staffers take a more magazine-style, 60 Minutes-esque approach to the evening's news.\n\nThe vision - masterminded by now-ex-60 Minutes boss Bill Owens and then-CBS News and Stations CEO Wendy McMahon - was promptly rejected by viewers within a matter of weeks, according to Nielsen data.\n\nThe show debuted with the Dickerson-Dubois pairing on January 27 to 5.2 million total viewers, the data showed.\n\nBy its third week, the show was receiving just under 4.5 million total viewers, the data showed. \n\nA former CBS News exec told Daily Mail at the time, 'It's a disaster,' referring to the two anchors and their feature, long-form style \n\n'It's been critically panned, ratings down week by week and from this time last year,' they said, under condition of anonymity.\n\n'[Executive Producer] Bill Owens is also overstretched and feeling the pressure with this lawsuit from [Trump].'\n\nThe suit, centered around a 60 Minutes interview with Kamala Harris that aired in October, was settled just last month, after Owens and McMahon has both left the company.\n\nBoth had been vocal about their opposition to a settlement, after Trump claimed the sit-down was 'deceptively edited.'\n\nThe suit was seen by many as a sticking point in the merger between Paramount and Skydance, which was approved by the FCC - after more than a year in limbo - last month as well.\n\nLast week, Paramount Studios new CEO, 42-year-old scion David Ellsion, previewed his plans for the new company, which he said will include CBS News.\n\n'We’re an entertainment company first, and I genuinely believe if you’re breathing, you’re our audience,' the son of MAGA billionaire Larry Ellison explained.\n\n'I don’t want to politicize this company.'\n\n'We want to be in the business of speaking to everybody,' he continued, after months of being accused of bribery and playing a part in Paramount's decision to cancel the show of prominent Trump critic Stephen Colbert.\n\n'One of our biggest priorities is actually restoring Paramount as the No. 1 destination for the most talented artists and filmmakers in the world. \n\n'Very simply, great filmmakers make great movies.'\n\nHe also talked up CBS’ relationship with the NFL, Masters golf tournament and the NCAA's March Madness. \n\nHis COO Andy Gordon added, 'I actually think every asset is underappreciated here.' \n\nEllison also mentioned how the Tiffany Network ended the regular television season in first place in primetime among broadcast networks for the 17th straight year.\n\n'Legacy media kind of swam out to the middle of the lake, but wasn’t exactly sure how to get to the other side,' he said of plans to embrace technology to make his vision possible.\n\nJeff Shell, the new president of what's being called Paramount Skydance, said any cuts and reductions needed to make that vision a reality will be disclosed by the company’s next quarterly report to investors in November. \n\nDaily Mail has contacted CBS News and Paramount for comment.","summary":"CBS Evening News is set to experiment with yet another format change after adding another anchor to the mix back in January - a strategy panned as a 'disaster'.","url":"https://www.dailymail.co.uk/media/article-15010579/cbs-news-evening-format-change-layoffs-two-anchors.html","image":"https://i.dailymail.co.uk/1s/2025/08/18/14/101320031-0-image-a-12_1755523125496.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/18/2164728972737363531/1024x576_MP4_2164728972737363531.mp4","publish_date":"2025-08-18 18:45:05","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.183},{"id":352182958,"title":"Elon Musk Is Going To Drive Journalists Off X By Throttling External Links | Bobby Burack","text":"OutKick touted Elon Musk's purchase of X, then known as Twitter, in 2022 as a win for free speech. And that it remains. Under its previous leadership, Twitter engaged in politically motivated censorship, a fact revealed by leaked internal documents known as the Twitter Files. Most notably, Twitter suppressed content at the request of the Biden administration — an action many legal scholars argue violated the First Amendment. The company also marked and shadow-banned prominent conservative accounts to blunt their influence. By contrast, under Musk, X became a critical counterweight to mainstream media narratives heading into the 2024 presidential election. Imagine if voters only knew the Kamala Harris portrayed on NBC or in The New York Times. For that reason, X is unquestionably better off under Musk than it was before. Free speech must remain a non-negotiable right across all platforms. That said, X has regressed in other ways. On Saturday, New York Post columnist Miranda Devine questioned Musk's decision to throttle posts containing external links: \"Forever grateful for the Twitter Files. But your throttling of posts with external links is infuriating and ultimately self-defeating. So is the shadow banning that is back with a vengeance,\" she posted on X. The New Problem: Suppression of External Links For background, Elon Musk implemented an algorithm change to suppress the visibility of external links. Specifically, a post including a link to an article or podcast now reaches far fewer users than one without it. Economic analyst Jesse Colombo estimates that including a link can decrease the reach of a post by as much as 94%. To do so, X introduced the highly-panned, default \"For you\" tab, which curates posts it wants you to see. By burying external links, users are more likely to keep scrolling – to the benefit of X's advertising partners. For years, Twitter served as a gateway to the broader media world. For all its faults, there was no better way to connect users to your content than through Twitter. Speaking in the first person, nearly every television, radio, or digital show I have appeared on is the result of a host or producer seeing my work on Twitter. I would never have met Clay Travis had he not seen my written work on Twitter. I'm sure many, many other writers and podcast hosts can relate. Today, even with nearly 1 million followers, columnists like Devine find promoting articles on X maddeningly ineffective. Over the weekend, I posted a video of ESPN host Monica McNutt appearing unfamiliar with NFL Hall of Famer Barry Sanders. That video has 1,000 reposts and more than 585,000 views. An hour later, I shared my column on the same subject. It sits at 150,000 views. The discrepancy is staggering – and, as Devine put it, self-defeating. We can point to several other examples over the past year in which posts without an external link performed far better than posts with links to OutKick.com or the OutKick YouTube channel. Note: X is no longer an operating communication department to contact for comment. Musk’s Short-Sighted Tradeoff To be clear, Elon Musk owes the media nothing. But his approach risks making X irrelevant to the very people who once gave it cultural weight. There used to be a saying within media circles, \"I would leave Twitter tomorrow if I didn't need it.\" While hyperbolic, X is approaching a point to which most journalists no longer need it. The upside of promoting content on it is so minimal. Musk might argue that journalists and podcasters should host their work directly on X. But the financial upside is negligible compared to running a website or podcast feed. As a \"scroll\" app, users expect to either click a link or consume a post in under 20 seconds. Put simply, industry insiders doubt X will ever serve as a true hosting platform for writers and podcasters. When Trolls Win, Thinkers Leave For X to remain the \"town square\" Musk wants it to be, it will need the top writers, podcasters, and thinkers to continue participating. Yet Musk is giving them little incentive to stay. Instead, the algorithm rewards the most shallow, low-value content. The \"For you\" tab elevates posts with high comment counts and native media, fueling the spread of AI-generated images, disinformation, and ragebait. There’s a reason so many X \"influencers\" aren’t particularly insightful: the algorithm doesn’t reward intelligence. It rewards provocation. At this rate, X risks devolving into a chaotic feed of deepfakes, fake news, and ditzy influencers by the start of the 2028 presidential election. Free speech notwithstanding, Elon Musk is daring quality journalists to stop promoting their work on X. Eventually, they just might.","summary":"Elon Musk&apos;s X platform improved free speech but now faces criticism for throttling external links, potentially making the platform less relevant to journalists and content creators.","url":"https://www.outkick.com/analysis/elon-x-throttling-miranda-devine","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/08/gettyimages-2218827914.jpg","video":null,"publish_date":"2025-08-18 17:50:05","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","source_country":"us","sentiment":-0.034},{"id":352165770,"title":"Sherrod Brown's Chances of Flipping GOP Seat in Ohio as He Enters Race","text":"Former Democratic Senator Sherrod Brown launched a comeback campaign on Monday as polls suggest Republican Ohio Senator Jon Husted has an early lead.Tyson Shepard, Husted's communications director, wrote in a statement that Husted offers \"Ohio's values and solutions to fix a broken Washington.\"Newsweek reached out to Brown's campaign for comment via email.Why It MattersBrown lost last year's Senate race to Republican Bernie Moreno, but Democrats are hopeful a more favorable national environment could make the race competitive. Historically, the party in the White House loses seats in the midterms, but Ohio has become increasingly conservative over the past decade and backed President Donald Trump by double digits last November.Democrats will need to win double-digit Trump seats to win control of the Senate, where Republicans hold a 53-47 majority. Democrats view Maine, which voted for Vice President Kamala Harris by about 7 points, and North Carolina, which voted for Trump by about 3 points, as flip opportunities. But no other GOP-held seats in Harris-won or single-digit Trump states are up for grabs, meaning Democrats have to target more conservative states like Alaska, Iowa, Ohio and Texas.What To KnowBrown, who served in the Senate from 2007 to 2025, made official his run on Monday, saying in a video released by his campaign that he didn't plan to run for office again after his defeat last November.\"But when I see what's going on, I know I can do something about it for Ohio,\" he said.The latest poll from Bowling Green State University showed Husted with a narrow lead over Brown but still pointed to a competitive race. It found that 49 percent of respondents preferred Husted, while 46 percent said they would vote for Brown in 2026. Five percent leaned toward other candidates.It surveyed 800 registered voters from April 18-24 and had a margin of error of plus or minus 4.08 percentage points.It found that 43 percent of respondents viewed Brown favorably, while 41 percent viewed him unfavorably. Meanwhile, 25 percent viewed Husted favorably and 28 percent viewed him unfavorably, the poll found.The poll from February found Husted with a larger lead—47 percent to 41 percent, with 12 percent undecided. It surveyed 800 registered voters from February 14-21 and had a margin of error of plus or minus 4 percentage points.No other polls of the race have been made public.Early betting odds also favor Husted. Kalshi's market for the Ohio Senate race gave Republicans a 74 percent chance of victory and Democrats only a 26 percent chance.Brown lost by about 3.6 points to Moreno last November, while Trump won by about 11.2 points over Harris in the state.What People Are SayingTyson Shepard, Husted's communications director, in a statement: \"Sherrod Brown's recent announcement means Ohioans will face a clear choice in 2026. For 30 years, he has imposed Washington's problems on Ohio, pushing radical liberal policies that have left a lasting burden on the next generation. Jon Husted offers the opposite approach, applying Ohio's values and solutions to fix a broken Washington. The challenges our nation faces are the same ones Husted has helped our state confront and overcome, championing the values he learned growing up in northwest Ohio: hard work, personal responsibility, family, faith, freedom and patriotism.\"Former Senator Sherrod Brown, on X: \"Every day, I hear from Ohioans who know the system's rigged. Washington's raising prices and cutting health care to benefit wealthy donors and corporate special interest while workers foot the bill. I can't just stay on the sidelines if I can do something about it for Ohio.\"What Happens NextThe general election is set for November 3, 2026. The Cook Political Report shifted the race to Lean Republican from Likely Republican following Brown's announcement. Sabato's Crystal Ball also classifies the race as Leans Republican.","summary":"Sherrod Brown made official his comeback campaign for U.S. Senate on Monday.","url":"https://www.newsweek.com/sherrod-brown-enters-race-polls-2115170","image":"https://d.newsweek.com/en/full/2704697/sherrod-brown-ohio-senate-polls.jpg?w=1600&h=900&q=88&f=b9899cd2ad04761ea74da95726cf6afa","video":null,"publish_date":"2025-08-18 17:20:48","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.031},{"id":352154894,"title":"Texas Republicans’ redistricting maps: How the GOP could increase its stronghold.","text":"Republicans control both chambers of the Texas Legislature, which draws congressional districts. GOP lawmakers in 2021 gave their party an advantage in Congress when they drew the district boundaries. Giving one political party an advantage over the other, or gerrymandering, is something both parties do in states across the country.\n\nUnder this year’s proposed plan, Democratic districts in the Dallas and Houston areas were drawn to increase, or “pack”, the number of Democratic voters in districts the minority party already controls. Packing those districts leaves fewer Democratic voters and more Republican voters in neighboring districts. Consolidating more Democrats into nearby districts could turn seats represented by Democratic U.S. Reps. Julie Johnson in North Texas’ 32nd District and Al Green in the Houston area’s 9th District into Republican districts.\n\nIn Hays County, 52.1% of voters chose Democrat Kamala Harris in 2024. Under the new proposal, that county south of Austin is split into two Republican districts, the 21st District and 27th District. Decreasing a party's voting strength is called “cracking.”","summary":"The proposed congressional districts are fueling a redistricting battle at the Texas Capitol and could have national consequences. A bipartisan war is already brewing across the U.S.","url":"https://www.texastribune.org/2025/08/18/texas-redistricting-maps-charts-analysis/","image":"https://thumbnails.texastribune.org/VrEpj5MrczSQ-tnpzhwQonaWF4w=/450x300/https://static.texastribune.org/media/files/8b2fb5d8c7e14924ab5e343f7b7639a6/lede-art-redistricting-viz.jpg","video":null,"publish_date":"2025-08-18 17:05:52","author":"Carla Astudillo","authors":["Carla Astudillo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.082},{"id":352143032,"title":"Texas Democrats return to state for second session on GOP redistricting","text":"TEXAS HOUSE ADJOURNS FOR SECOND TIME FRIDAY DUE TO DEMOCRATIC ABSENCES\n\nA majority of Texas’s 62 House Democrats fled the state on Aug. 3 and sought refuge in blue states like Illinois, California, and New York. They held press conferences to highlight Texas Republicans’ plans to redraw the congressional map and gain as many as five GOP seats.\n\nBut legal and financial pressure from state and national Republicans led to Democrats announcing on Thursday that they would return to the state. They said they would return on two conditions: when the first session concluded and when California introduced a new congressional map that would offset the Texas map. They’ve painted their walkout as a success by calling attention to the GOP’s “sham” redistricting plan. \n\nDemocrats have argued that Republicans are trying to manipulate the Texas congressional map because they are afraid they will not win in the 2026 midterm elections, in which Democrats only need a net gain of three seats to take back the House.\n\nRepublicans faced a similar dilemma in 2018, and Democrats successfully broke the GOP trifecta during President Donald Trump’s first term. The remaining two years of his presidency were met with pushback from the Democrat-controlled House on Trump’s agenda, resulting in two attempts to impeach him.\n\n“Democrats fought back ferociously and took the fight to Trump across America,” state Rep. Gene Wu of Houston, chairman of the House Democratic Caucus, said in a statement. “We will return to the House floor and to the courthouse with a clear message: the fight to protect voting rights has only just begun.”\n\nBy Friday, most of the Democrats had not returned to the House, and Speaker Dustin Burrows adjourned the chamber for the weekend. Republicans are expecting a quorum on Monday, and Burrows said he aims to have the second session wrapped up by Labor Day.\n\nThe Texas Democrats’ redistricting fight has drawn support from several national leaders, including former President Barack Obama, former Vice President Kamala Harris, and Democratic governors. In California, Gov. Gavin Newsom (D-CA) has called a special election for Nov. 4 that will determine whether the state can circumvent the independent redistricting commission and draw a new map ahead of the midterm elections.\n\nRepublicans have pushed back on this, arguing that Texas law allows the legislature to redraw the map, but states like California must adhere to their redistricting commissions.\n\n“Unlike other states, California must shred its own Constitution to succeed in its desperate gambit to ‘end the Trump presidency.’ Voters in California and across the nation see through this partisan stunt,” House Speaker Mike Johnson (R-LA) said in a statement Monday.\n\n“Democrats across the nation have played politics with redistricting for decades, and this is just the latest example,” Johnson added. “Republicans who are following state and federal laws will not be lectured by people who abused the system.”","summary":"Texas state Democrats are returning to the state capital on Monday for the start of the House&#8217;s special session on redistricting, ending a two-week strike to protest Republicans&#8216; plans to increase the number of GOP congressional seats in the state&#8217;s delegation. The state House is set to reconvene at noon Central time to begin the [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3758190/texas-democrats-return-house-second-session-gop-redistricting/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25228634394573.jpg?w=696","video":null,"publish_date":"2025-08-18 16:31:57","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.571},{"id":352158876,"title":"Nolte: Far-left Columnist Robin Givhan out at Far-left Washington Post","text":"The bloodshed continues at the far-left Washington Post with the news Pulitzer Prize-winning columnist Robin Givhan has accepted a buyout.\n\nThe Trump-era schlonging of the regime media shows no signs of slowing down.\n\n“So, recently The Post offered buyouts to anyone who’d been there for 10 years or longer. It was the first time I’d been eligible for such a thing. So, I considered it. (It was a fair amount of $$),” Givhan announced on her verified Instagram account. “I agonized about it. I fretted. I procrastinated until the last possible moment. I considered my needs, my desires, my beliefs. A creature of deadline to the end. And I decided to take it.”\n\n“I love The Post. It’s where I grew up as a journalist. I am a believer in the importance of institutions, of legacy media, of mainstream media,” she continued.\n\n“There’s still a lot to be said, and I’m just self-centered enough to believe I’m someone who needs to be heard. So I’m not done. Democracy definitely dies in darkness, but it is gravely wounded by silence.”\n\nWhatever. Bye.\n\nOne wonders how democracy will survive without Givhan’s headlines such as…\n\nMarc Jacobs’s anti-politics, from faux nails to creative freedom\nPresident Trump addresses Congress, and nothing about it was normal\nSee inside Kamala Harris’s V.P. house as JD Vance prepares to move in\nWhat does diversity mean in a second Trump administration?\nThanksgiving is our most woke holiday. That’s why it’s so great.\nCory Booker’s unflagging joy\nThe ground-breaking normalcy of Doug Emhoff\nKamala Harris’s powerful laughter in the face of weirdness\nHoping joy cometh in the morning: Auntie Maxine, a hallelujah chorus\nStormy Daniels’s voluble specificity\nDonald Trump’s specific brand of racism resurfaces as he woos Black voters\nWhen Fani Willis took the stand, her fury was precise and laser-focused\nMarjorie Taylor Greene’s big mouth and her big white, fur-rimmed coat\nRepublican Byron Donalds is Black. That’s basically the talking point.\nAdmiring the beauty — and beautiful politics — of the Black family home\nSpeaker Pelosi’s style of power\n\nI went back three years and can sum up her work in one word: ZZZZZZzzzzzzz.\n\nI don’t know what she won her Pulitzer for, but I’ll bet it was stupid.\n\nShe wrote the safest, most anodyne, and treacly nonsense you can write at the Washington Post. Nothing ever colored outside the lines or dared to question the conventional wisdom. She even gushed over the credibly accused girlfriend abuser Doug Emhoff.\n\nGivhan was not in the business of doing anything other than affirming and comforting the rich elites who subscribe to the Post so they can be affirmed and comforted. If she believed she was trolling Trump supporters, my job is to cover the media, and this is the first time I’ve paid any attention to her. So…\n\nJust another member of the leftist Borg…\n\nBut now she’s been schlonged, which means we can add her to the ever-expanding list of the schlonged, and rejoice in knowing we can return to our default position of forgetting someone so stridently forgettable…\n\nRobin Givhan Exits Washington Post.\nGlenn Kessler stops lying at the Washington Post.\nJonathan Capehart– Stomps out of WaPoin tears (I’m guessing).\nPhilip Bump– documented serial liarexits Washington Post.\nCatherine Rampell– Leftist WaPocolumnist accepts buyout.\nTerry Moran– Self-immolated out of ABC due to TDS meltdown.\nRuth Marcus– Washington Postcolumnist resigns.\n538– Disney/ABC’s wildly biased polling site shutters.\nPaul Krugman– Always-wrong New York Timescolumnist forced out.\nJim Acosta– CNN anchor forced out.\nNorah O’Donnell– Failed CBS anchor out.\nChuck Todd– NBC’s former Meet the Presshost DEI’d out.\nAndrea Mitchell– NBC harridan ages out of job.\nChris Wallace– Son of Someone out at CNN.\nJennifer Rubin— Lunatic columnist quits Washington Postin a snit.\nJoy Reid– Racist MSNBC anchor too racist for MSNBC. Fired.\nNeil Cavuto– Fox News anchor scurries away.\nAlex Wagner– Demoted at MSNBC.\nAyman Mohyeldin– Lost MSNBC show.\nOlivia Nuzzi– Out at New York Mag for allegedly stalking RFK Jr.\nKatie Phang– Lost MSNBC show.\nJonathan Capehart – Lost MSNBC show. Steps down from Washington Posteditorial board.\nLester Holt– Out as NBC Nightly News anchor.\nOne-thirdof New York TimesEditorial Board – Say, bye.\nEugene Robinson– Washington Postcolumnist quits in snit.\nRyan Lizza– Scurries to Substack over credible misconduct allegations.\nBill Owens—60 Minuteschief resigns in crybaby disgrace.\n\nThe list above represents the regime media schlongings that have taken place just since Trump took office.\n\nMore to come, I’m sure.\n\nAll decent people hope.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"The bloodshed continues at the far-left Washington Post with the news that Pulitzer Prize-winning columnist Robin Givhan has accepted a buyout.\n\n\nThe post Nolte: Far-left Columnist Robin Givhan out at Far-left Washington Post appeared first on Breitbart.","url":"https://www.breitbart.com/the-media/2025/08/18/nolte-far-left-columnist-robin-givhan-out-at-far-left-washington-post/","image":"https://media.breitbart.com/media/2025/08/Robin-Givhan-exits-640x335.jpg","video":null,"publish_date":"2025-08-18 16:31:54","author":"John Nolte","authors":["John Nolte"],"language":"en","category":"politics","source_country":"US","sentiment":-0.087},{"id":352136434,"title":"Pa. Treasurer Stacy Garrity to run for governor against Josh Shapiro","text":"Pennsylvania Treasurer Stacy Garrity kickstarted her gubernatorial campaign Monday with an attack ad against Gov. Josh Shapiro, the Democratic incumbent who may have presidential aspirations in 2028.\n\nGarrity, a Republican in her second term as treasurer, is a retired U.S. Army Reserve colonel and corporate executive who has vowed to bring affordability and fiscal responsibility to the state. In the Republican primary, she could compete against state Sen. Doug Mastriano, who is weighing another run for governor after he was trounced by Shapiro in 2022. \n\nMORE: Rapper Skrilla arrested for allegedly assaulting police officer while filming music video in Kensington\n\nGarrity has pledged to \"fix the problems\" of the Shapiro administration, singling out the state's overdue budget and rising costs for utilities and groceries. She endorsed President Donald Trump in last year's presidential election and included a photo taken with him at a rally in her new campaign ad. Trump previously had been expected to endorse a gubernatorial campaign run by state Rep. Dan Meuser, who withdrew from consideration in July.\n\nShapiro, who made the short-list of Democratic vice presidential candidates last year, is widely expected to run for governor again next year and leverage his vast fundraising network to defeat a Republican challenger. Shapiro has not said whether he intends to run for president, but he's got a rising national profile in a Democratic party searching for charismatic leaders. \n\nIn last year's race for Pennsylvania treasurer, \n\nLast year, Shapiro declined to make an endorsement in the race for Pennsylvania treasurer after Democratic candidate Erin McLelland criticized him as a potential running mate for Kamala Harris. Garrity benefited by landing endorsements from labor groups that otherwise might have sided with McLelland. \n\nAhead of Garrity's run for governor, some labor groups — including the Philadelphia Building Trades Council — already have made clear their allegiance will be with Shapiro.\n\nGarrity is vying to become the first woman to serve as Pennsylvania governor and first Republican to hold the office since Tom Corbett's lone term concluded in January 2015. Garrity has been a staunch opponent of abortion and an advocate for fiscal conservatism. The Bradford County native and Iraq war veteran increasingly has aligned with Trump administration policies, including last month's federal tax breaks and spending cuts. \n\nRepublicans have a more hopeful outlook in Pennsylvania after Trump took the battleground state in November and state row offices — including treasurer and attorney general — also went to the GOP. Next year's mid-term elections could dampen that momentum in a state where Shapiro has successfully won over moderate and independent voters, twice winning races for attorney general before becoming governor. \n\nGarrity will be the frontrunner in the Republican field ahead of the Pennsylvania GOP's anticipated endorsement in September.","summary":"Pennsylvania Treasurer Stacy Garrity announced Monday she will run for governor next year against Democrat Josh Shapiro, who may be vying for the White House in 2028. Garrity hopes to become the first woman elected governor in Pennsylvania.","url":"https://www.phillyvoice.com/stacy-garrity-pennsylvania-governor-2026-republican-shapiro/","image":"https://media.phillyvoice.com/media/images/81825_Garrity_Pennsylvania.2e16d0ba.fill-1200x630-c0.jpg","video":null,"publish_date":"2025-08-18 16:19:10","author":"Michael Tanenbaum","authors":["Michael Tanenbaum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.083},{"id":352143024,"title":"Joni Ernst challenger JD Scholten drops out and endorses Democratic rival","text":"“From the very beginning, I thought a prairie populist athlete from Western Iowa would be the best candidate to win in the General election,” Scholten said in a statement. “I still do, but instead of me, I have complete confidence that Josh Turek can take this on. That’s why I am suspending my campaign and endorsing him. As his friend, I’m proud to support him.”\n\nBoth Scholten and Turek are the only Democrats from western Iowa serving in the state House of Representatives. Scholten launched his campaign in June following Ernst’s controversial “we all are going to die” remark at a town hall on the One Big Beautiful Bill Act.\n\nErnst made the comment in response to an attendee calling out that “people are going to die” because of the law’s Medicaid reforms.\n\nScholten had experience with national races, most recently losing to Rep. Randy Feenstra (R-IA) in the 2020 elections. He has been a state representative since 2023 and is the only Democrat to represent a Republican stronghold in the state legislature. Prior to his election, President Donald Trump carried the district by 27 points in 2020.\n\nTurek launched his bid for the Senate last week. A Paralympian with two gold medals in wheelchair basketball, Turek has also been a state representative since 2023. He outpaced Democrats across Iowa and polled over 13 points ahead of former Vice President Kamala Harris in 2024.\n\nWith Scholten out of the running, Turek faces three other competitors for the Democratic nomination: former Michelle Obama adviser Jackie Norris, Iraq War veteran Nathan Sage, and state Sen. Zach Wahls.\n\nErnst has not announced whether she will run for reelection. So far, she has two primary challengers: former Iowa GOP state Sen. Jim Carlin and Libertarian-turned-MAGA candidate Joshua Smith.\n\nSmith announced his bid in April, pitching himself as an “America First” Republican. He ran for president last cycle on the Libertarian ticket but failed to get the party’s nomination. He unsuccessfully ran as a Libertarian to oust a Democratic state senator last year.\n\nIOWA STATE REP. JOSH TUREK JOINS CROWDED DEMOCRATIC PRIMARY TO OUST JONI ERNST\n\nCarlin, who announced his campaign in June, was a state senator from 2017 to 2023 and previously a state representative. He unsuccessfully launched a primary bid against Sen. Chuck Grassley (R-IA) in 2022. Carlin has argued that Ernst is not reflecting the values of Iowa Republicans in Congress and did not follow through on her token “make ’em squeal” promises, per the Iowa Capital Dispatch.\n\nThe nonpartisan Cook Political Report rates Ernst’s Senate seat as “likely Republican,” though that rating could shift if the incumbent decides she does not want to run for reelection. Ernst previously said she would plan to only serve two terms, a remark highlighted by Democrats leading up to the 2026 elections. However, she said in 2024 she was “very likely” to run for a third term.","summary":"Iowa state Rep. J.D. Scholten is dropping out of a crowded Democratic primary to oust Sen. Joni Ernst (R-IA) and endorsing fellow state Rep. Josh Turek instead. Scholten announced he would suspend his campaign at a rally with Turek in Council Bluffs, Iowa, on Monday, calling him the &#8220;best hope&#8221; Democrats have to defeat Ernst [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3758014/joni-ernst-challenger-jd-scholten-josh-turek-senate/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25226733868165.jpg?w=696","video":null,"publish_date":"2025-08-18 15:50:42","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.272},{"id":352112884,"title":"Ohio Democrat Sherrod Brown makes it official, challenging Trump ally in key Senate battle","text":"Former Sen. Sherrod Brown of Ohio on Monday launched his 2026 bid to return to the U.S. Senate, following last year's bitter re-election defeat at the hands of now-Sen. Bernie Moreno. \"Standing up for workers. Treating everyone with dignity and respect. Working as hard as possible for the people of Ohio. I've tried to live my life by those principles. But these days that's not what's happening in Washington—so I'm running for Senate,\" Brown said in a social media post as he highlighted his longtime working class and populist themes. Brown, who spent over three decades representing Ohio in the House and later the Senate, was highly recruited by top national Democrats, including Senate Minority Leader Chuck Schumer, who made two trips to the Buckeye state to try and convince Brown to run again. FOUR KEY SENATE SEATS REPUBLICANS AIM TO FLIP IN 2026 MIDTERMS Brown is seeking the seat held by Republican Sen. Jon Husted, the former Ohio lieutenant governor who was appointed in January to fill the seat left vacant when then Sen. JD Vance stepped down to become vice president in President Donald Trump's administration. SENATE DEMOCRATS LAND SOME BIG FISH IN BID TO WIN BACK MAJORITY IN 2026 Husted has Trump's endorsement as he runs next year to fill the final two years of Vance's six-year term. \"I didn’t plan to run for office again, but when I see what’s going on, I know I can do something about it for Ohio,\" Brown said in a campaign launch video. \"That’s why I’m running for Senate. Because even in these challenging times, I still believe if you stand up for workers, treat people with respect and always fight for Ohio, you can actually make a difference,\" he added. Schumer and Sen. Kirsten Gillibrand, chair of the Democratic Senatorial Campaign Committee (DSCC), argued in a statement that \"no one fights harder for Ohio than Sherrod Brown. From securing Ohioans’ retirement and Social Security benefits to cracking down on fentanyl from China and Mexico, Sherrod will always do what’s right for Ohioans.\" FIRST ON FOX: EX-SENATOR'S PAC SPLURGES ON LUXURY PERKS But the National Republican Senatorial Committee (NRSC) accused Brown of being a \"liberal sell-out\" and pointed to his defeat in last year's election. \"Ohioans just rejected Sherrod Brown's radical agenda of allowing biological men to compete in women's sports, fueling mass illegal immigration, and failing to protect Ohio's good-paying manufacturing jobs,\" NRSC regional press secretary Nick Puglia claimed. And Alex Latcham, executive director of the Senate Leadership Fund, which is the top super PAC supporting Senate Republicans, charged that \"Brown built his disgraceful career on the backs of hardworking Ohio families while he supported the woke Left’s agenda, including amnesty for criminal illegal immigrants, men in girls’ locker rooms, and sticking seniors with higher taxes. Ohioans gladly sent him packing last year, and they’ll not hesitate to toss him aside again.\" Ohio was once a top general election battleground state, but has turned increasingly red over the past decade. Trump carried the state by 11 points over then-Vice President Kamala Harris. But Brown outperformed the top of the ticket, losing to Moreno by less than four points. CLICK HERE TO GET THE FOX NEWS APP Brown is the second top recruit Senate Democrats have landed this year as they work to try and win back the chamber's majority next year. The GOP currently holds a 53-47 majority in the Senate. Last month, former two-term Democratic Gov. Roy Cooper of North Carolina declared his candidacy in the 2026 race to succeed retiring Republican Sen. Thom Tillis.","summary":"Sherrod Brown announces 2026 Senate bid in Ohio, targeting Republican Jon Husted&apos;s seat as Democrats work to regain chamber majority control","url":"https://www.foxnews.com/politics/ohio-democrat-sherrod-brown-makes-official-challenging-trump-ally-key-senate-battle","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/10/sherrod-brown.png","video":"https://www.foxnews.com/video/6376046336112","publish_date":"2025-08-18 13:40:14","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":0.032},{"id":352122852,"title":"Where Trump is popular, Democrats look to a new crop of candidates to help win back the House","text":"By JOEY CAPPELLETTI, Associated Press\n\nFAIRVIEW, N.C. (AP) — Jamie Ager has spent much of the past year rebuilding his farm in the foothills of western North Carolina after Hurricane Helene tore through the region, cutting power, destroying fences and scattering livestock.\n\nThen, earlier this year, Ager lost his beef contract with local schools, a casualty of billions of dollars in cuts to the U.S. Department of Agriculture under the Trump administration.\n\nNow, the fifth-generation farmer is running for Congress — part of a new crop of Democratic candidates the party is turning to as it tries to compete in the tough, often rural districts it may need to flip to retake the U.S. House in 2026.\n\nDemocrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity dominates. Many, like Ager, are already a well-known presence in their communities. And in parts of North Carolina, Kentucky, Michigan and elsewhere, the party is betting local credibility can cut through skepticism where the Democratic brand has fallen.\n\nAger says he sees national Democrats as out of touch with rural life: too “academic” and “politically correct and scripted.”\n\n“That’s just not what people are interested in,” he says. “The ideas of helping poor people, being neighborly, the ideal of doing those things, I think, are worthy, good ideas that are actually popular. But the execution of a lot of those ideas has been gummed up, you know, not well executed.”\n\nA shifting House map\n\nHeading into next year’s midterms, Democrats believe momentum is on their side. Historically, the president’s party loses ground in the midterms. In 2018, during Trump’s first term, Democrats flipped 41 seats to take control of the House. Republicans currently control the House by such a slim margin, Democrats need to pick up only a few seats to break the GOP’s hold on Washington.\n\nThe Republican-led tax break and spending cut bill has added to Democrats’ optimism. About two-thirds of U.S. adults expect the new law will help the rich, according to a poll from The Associated Press-NORC Center for Public Affairs Research. About half say it’ll do more harm than good for middle-class people and people like them.\n\nStill, Republicans remain confident. They point to having fewer vulnerable seats than Democrats have this cycle. Only three Republicans hold House districts Democrat Kamala Harris won last year, while 13 Democrats represent districts Trump won.\n\nThey also note Democrats’ low opinion of their own party after last year’s losses. In a July AP-NORC poll, Democrats were likelier to describe their own party negatively than Republicans, with many Democrats calling it weak or ineffective.\n\nIn places where local dynamics may give Democrats a shot, it means finding the right candidates is especially important, party leaders say.\n\n“Recruitment matters in these years when the environment is going to be competitive,” Democratic pollster John Anzalone said.\n\nDemocrats hope a farmer in western North Carolina can regain trust\n\nWith power, water and telecommunications down due to last year’s hurricane, Ager’s Hickory Nut Gap farm became a hub for the community — hosting cookouts and using propane to grill food for neighbors.\n\nStatewide, the storm caused nearly $60 billion in damage and killed more than 100 people. Little federal aid has reached the hardest-hit parts of western North Carolina.\n\n“Helene hitting definitely put an exclamation point on, like, ‘Whoa, we need help and support,’” Ager said.\n\nDemocrats see Ager as a high-risk, high-reward candidate who could be successful in a district where Democrats have struggled.\n\nNo Democrat has won North Carolina’s 11th Congressional District since it was redrawn by the Republican-controlled legislature in 2011. A court-ordered redistricting ahead of the 2020 election made it slightly more favorable to Democrats, encompassing Asheville and much of western North Carolina. Republican Rep. Chuck Edwards still won by nearly 14 percentage points last year and is expected to seek reelection.\n\nGrayson Barnette, a Democratic strategist who helped recruit Ager, said in some districts it’s a risk to run a candidate who hasn’t held elected office before.\n\n“But I would argue that’s a good thing, especially when the Democrats just took the big hit we did,” Barnette said. “We have to look in the mirror and say, ‘Let’s try something new.’”\n\nIn a district where nearly 62% of residents live in very low-density areas, Barnette believes Ager’s identity — as a business owner, coach and father with deep local roots — could cut through. His unpolished, direct style, he says, may resonate more than a polished political résumé.\n\nIn the video launching his campaign, Ager shows flooding on the farm and is seen on the porch of his home, feeding chickens, driving a tractor and spending time with his wife and three sons.\n\n“I’m not flashy, but I’m honest,” he says in the video.\n\nAger doesn’t call himself a Democrat in the roughly two-minute video and rarely used the word during a three-hour interview. Still, his ties to the party run deep: His brother serves in the state House, following in the footsteps of their father. His grandfather served six years in the U.S. House.\n\nAsked whether that might be a liability in the district, Ager shrugged: “Then don’t vote for me.”\n\nTrump’s big bill could reshape a conservative district in Michigan\n\nIn western Michigan, state Sen. Sean McCann is a different kind of candidate from Ager. He’s buttoned-up and soft-spoken, with a long resume in elected office and deep roots in Kalamazoo, having served for a decade on the city commission before winning a seat in the state House in 2010.\n\nIn a district anchored by conservative and religious values, Democrats see McCann as the kind of steady, experienced figure who can make inroads — especially as backlash builds to Trump’s tax bill, which includes deep spending cuts.\n\nAt a recent meeting at Kalamazoo’s Family Health Center, where nearly 65% of patients rely on Medicaid, the center’s president warned the proposed Medicaid cuts would be devastating.\n\n“It’s about being home in the community and listening to our community’s values — and carrying those to Washington,” McCann said.\n\nThe district is represented by Republican Rep. Bill Huizenga, who won reelection by nearly 12 percentage points in 2022. But Huizenga hasn’t said whether he’ll seek another term, and Trump carried the district by only 5.5 percentage points in 2024.\n\nDemocrats hope strong ties help elsewhere\n\nAcross the country, Democrats are watching similar races in places like Iowa and Kentucky, where local candidates with strong community ties are running. In Iowa’s 2nd District, state Rep. Lindsay James — a fourth-term lawmaker and Presbyterian pastor — is weighing a run in the northeast part of the state. In Kentucky’s 6th, which includes Lexington and Richmond, former federal prosecutor Zach Dembo is running his first campaign, describing himself as a political outsider.\n\nIt’s a mix of profiles: Ager, the farmer-turned-candidate feeding neighbors after a hurricane. McCann, the public servant meeting with health workers in his hometown. And others like them trying to reconnect a skeptical electorate.\n\n“Yes, the Democratic Party has some taint to it,” Ager said. “But when I go talk to Republicans who are friends that I’ve known forever, there’s genuine admiration and mutual respect for each other. And that comes from being in this community forever.”\n\nAssociated Press reporter Maya Sweedler in Washington contributed to this report.","summary":"Democrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity remains dominant.","url":"https://www.bostonherald.com/2025/08/18/2026-us-house-democrats-candidates/","image":"https://www.bostonherald.com/wp-content/uploads/2025/08/Election_2026_House_Democrats_62475-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-08-18 13:24:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.355},{"id":352273912,"title":"Where Trump is popular, Democrats look to a new crop of candidates to help win back the House","text":"By JOEY CAPPELLETTI, Associated Press\n\nFAIRVIEW, N.C. (AP) — Jamie Ager has spent much of the past year rebuilding his farm in the foothills of western North Carolina after Hurricane Helene tore through the region, cutting power, destroying fences and scattering livestock.\n\nThen, earlier this year, Ager lost his beef contract with local schools, a casualty of billions of dollars in cuts to the U.S. Department of Agriculture under the Trump administration.\n\nNow, the fifth-generation farmer is running for Congress — part of a new crop of Democratic candidates the party is turning to as it tries to compete in the tough, often rural districts it may need to flip to retake the U.S. House in 2026.\n\nDemocrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity dominates. Many, like Ager, are already a well-known presence in their communities. And in parts of North Carolina, Kentucky, Michigan and elsewhere, the party is betting local credibility can cut through skepticism where the Democratic brand has fallen.\n\nAger says he sees national Democrats as out of touch with rural life: too “academic” and “politically correct and scripted.”\n\n“That’s just not what people are interested in,” he says. “The ideas of helping poor people, being neighborly, the ideal of doing those things, I think, are worthy, good ideas that are actually popular. But the execution of a lot of those ideas has been gummed up, you know, not well executed.”\n\nA shifting House map\n\nHeading into next year’s midterms, Democrats believe momentum is on their side. Historically, the president’s party loses ground in the midterms. In 2018, during Trump’s first term, Democrats flipped 41 seats to take control of the House. Republicans currently control the House by such a slim margin, Democrats need to pick up only a few seats to break the GOP’s hold on Washington.\n\nThe Republican-led tax break and spending cut bill has added to Democrats’ optimism. About two-thirds of U.S. adults expect the new law will help the rich, according to a poll from The Associated Press-NORC Center for Public Affairs Research. About half say it’ll do more harm than good for middle-class people and people like them.\n\nStill, Republicans remain confident. They point to having fewer vulnerable seats than Democrats have this cycle. Only three Republicans hold House districts Democrat Kamala Harris won last year, while 13 Democrats represent districts Trump won.\n\nThey also note Democrats’ low opinion of their own party after last year’s losses. In a July AP-NORC poll, Democrats were likelier to describe their own party negatively than Republicans, with many Democrats calling it weak or ineffective.\n\nIn places where local dynamics may give Democrats a shot, it means finding the right candidates is especially important, party leaders say.\n\n“Recruitment matters in these years when the environment is going to be competitive,” Democratic pollster John Anzalone said.\n\nDemocrats hope a farmer in western North Carolina can regain trust\n\nWith power, water and telecommunications down due to last year’s hurricane, Ager’s Hickory Nut Gap farm became a hub for the community — hosting cookouts and using propane to grill food for neighbors.\n\nStatewide, the storm caused nearly $60 billion in damage and killed more than 100 people. Little federal aid has reached the hardest-hit parts of western North Carolina.\n\n“Helene hitting definitely put an exclamation point on, like, ‘Whoa, we need help and support,’” Ager said.\n\nDemocrats see Ager as a high-risk, high-reward candidate who could be successful in a district where Democrats have struggled.\n\nNo Democrat has won North Carolina’s 11th Congressional District since it was redrawn by the Republican-controlled legislature in 2011. A court-ordered redistricting ahead of the 2020 election made it slightly more favorable to Democrats, encompassing Asheville and much of western North Carolina. Republican Rep. Chuck Edwards still won by nearly 14 percentage points last year and is expected to seek reelection.\n\nGrayson Barnette, a Democratic strategist who helped recruit Ager, said in some districts it’s a risk to run a candidate who hasn’t held elected office before.\n\n“But I would argue that’s a good thing, especially when the Democrats just took the big hit we did,” Barnette said. “We have to look in the mirror and say, ‘Let’s try something new.’”\n\nIn a district where nearly 62% of residents live in very low-density areas, Barnette believes Ager’s identity — as a business owner, coach and father with deep local roots — could cut through. His unpolished, direct style, he says, may resonate more than a polished political résumé.\n\nIn the video launching his campaign, Ager shows flooding on the farm and is seen on the porch of his home, feeding chickens, driving a tractor and spending time with his wife and three sons.\n\n“I’m not flashy, but I’m honest,” he says in the video.\n\nAger doesn’t call himself a Democrat in the roughly two-minute video and rarely used the word during a three-hour interview. Still, his ties to the party run deep: His brother serves in the state House, following in the footsteps of their father. His grandfather served six years in the U.S. House.\n\nAsked whether that might be a liability in the district, Ager shrugged: “Then don’t vote for me.”\n\nTrump’s big bill could reshape a conservative district in Michigan\n\nIn western Michigan, state Sen. Sean McCann is a different kind of candidate from Ager. He’s buttoned-up and soft-spoken, with a long resume in elected office and deep roots in Kalamazoo, having served for a decade on the city commission before winning a seat in the state House in 2010.\n\nIn a district anchored by conservative and religious values, Democrats see McCann as the kind of steady, experienced figure who can make inroads — especially as backlash builds to Trump’s tax bill, which includes deep spending cuts.\n\nAt a recent meeting at Kalamazoo’s Family Health Center, where nearly 65% of patients rely on Medicaid, the center’s president warned the proposed Medicaid cuts would be devastating.\n\n“It’s about being home in the community and listening to our community’s values — and carrying those to Washington,” McCann said.\n\nThe district is represented by Republican Rep. Bill Huizenga, who won reelection by nearly 12 percentage points in 2022. But Huizenga hasn’t said whether he’ll seek another term, and Trump carried the district by only 5.5 percentage points in 2024.\n\nDemocrats hope strong ties help elsewhere\n\nAcross the country, Democrats are watching similar races in places like Iowa and Kentucky, where local candidates with strong community ties are running. In Iowa’s 2nd District, state Rep. Lindsay James — a fourth-term lawmaker and Presbyterian pastor — is weighing a run in the northeast part of the state. In Kentucky’s 6th, which includes Lexington and Richmond, former federal prosecutor Zach Dembo is running his first campaign, describing himself as a political outsider.\n\nIt’s a mix of profiles: Ager, the farmer-turned-candidate feeding neighbors after a hurricane. McCann, the public servant meeting with health workers in his hometown. And others like them trying to reconnect a skeptical electorate.\n\n“Yes, the Democratic Party has some taint to it,” Ager said. “But when I go talk to Republicans who are friends that I’ve known forever, there’s genuine admiration and mutual respect for each other. And that comes from being in this community forever.”\n\nAssociated Press reporter Maya Sweedler in Washington contributed to this report.","summary":"Democrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity remains dominant.","url":"https://www.sandiegouniontribune.com/2025/08/18/2026-us-house-democrats-candidates/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/Election_2026_House_Democrats_62475-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-18 13:24:12","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.355},{"id":352091958,"title":"Where Trump is popular, Democrats look to a new crop of candidates to help win back the House","text":"By JOEY CAPPELLETTI, Associated Press\n\nFAIRVIEW, N.C. (AP) — Jamie Ager has spent much of the past year rebuilding his farm in the foothills of western North Carolina after Hurricane Helene tore through the region, cutting power, destroying fences and scattering livestock.\n\nThen, earlier this year, Ager lost his beef contract with local schools, a casualty of billions of dollars in cuts to the U.S. Department of Agriculture under the Trump administration.\n\nNow, the fifth-generation farmer is running for Congress — part of a new crop of Democratic candidates the party is turning to as it tries to compete in the tough, often rural districts it may need to flip to retake the U.S. House in 2026.\n\nDemocrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity dominates. Many, like Ager, are already a well-known presence in their communities. And in parts of North Carolina, Kentucky, Michigan and elsewhere, the party is betting local credibility can cut through skepticism where the Democratic brand has fallen.\n\nAger says he sees national Democrats as out of touch with rural life: too “academic” and “politically correct and scripted.”\n\n“That’s just not what people are interested in,” he says. “The ideas of helping poor people, being neighborly, the ideal of doing those things, I think, are worthy, good ideas that are actually popular. But the execution of a lot of those ideas has been gummed up, you know, not well executed.”\n\nA shifting House map\n\nHeading into next year’s midterms, Democrats believe momentum is on their side. Historically, the president’s party loses ground in the midterms. In 2018, during Trump’s first term, Democrats flipped 41 seats to take control of the House. Republicans currently control the House by such a slim margin, Democrats need to pick up only a few seats to break the GOP’s hold on Washington.\n\nThe Republican-led tax break and spending cut bill has added to Democrats’ optimism. About two-thirds of U.S. adults expect the new law will help the rich, according to a poll from The Associated Press-NORC Center for Public Affairs Research. About half say it’ll do more harm than good for middle-class people and people like them.\n\nStill, Republicans remain confident. They point to having fewer vulnerable seats than Democrats have this cycle. Only three Republicans hold House districts Democrat Kamala Harris won last year, while 13 Democrats represent districts Trump won.\n\nThey also note Democrats’ low opinion of their own party after last year’s losses. In a July AP-NORC poll, Democrats were likelier to describe their own party negatively than Republicans, with many Democrats calling it weak or ineffective.\n\nIn places where local dynamics may give Democrats a shot, it means finding the right candidates is especially important, party leaders say.\n\n“Recruitment matters in these years when the environment is going to be competitive,” Democratic pollster John Anzalone said.\n\nDemocrats hope a farmer in western North Carolina can regain trust\n\nWith power, water and telecommunications down due to last year’s hurricane, Ager’s Hickory Nut Gap farm became a hub for the community — hosting cookouts and using propane to grill food for neighbors.\n\nStatewide, the storm caused nearly $60 billion in damage and killed more than 100 people. Little federal aid has reached the hardest-hit parts of western North Carolina.\n\n“Helene hitting definitely put an exclamation point on, like, ‘Whoa, we need help and support,’” Ager said.\n\nDemocrats see Ager as a high-risk, high-reward candidate who could be successful in a district where Democrats have struggled.\n\nNo Democrat has won North Carolina’s 11th Congressional District since it was redrawn by the Republican-controlled legislature in 2011. A court-ordered redistricting ahead of the 2020 election made it slightly more favorable to Democrats, encompassing Asheville and much of western North Carolina. Republican Rep. Chuck Edwards still won by nearly 14 percentage points last year and is expected to seek reelection.\n\nGrayson Barnette, a Democratic strategist who helped recruit Ager, said in some districts it’s a risk to run a candidate who hasn’t held elected office before.\n\n“But I would argue that’s a good thing, especially when the Democrats just took the big hit we did,” Barnette said. “We have to look in the mirror and say, ‘Let’s try something new.’”\n\nIn a district where nearly 62% of residents live in very low-density areas, Barnette believes Ager’s identity — as a business owner, coach and father with deep local roots — could cut through. His unpolished, direct style, he says, may resonate more than a polished political résumé.\n\nIn the video launching his campaign, Ager shows flooding on the farm and is seen on the porch of his home, feeding chickens, driving a tractor and spending time with his wife and three sons.\n\n“I’m not flashy, but I’m honest,” he says in the video.\n\nAger doesn’t call himself a Democrat in the roughly two-minute video and rarely used the word during a three-hour interview. Still, his ties to the party run deep: His brother serves in the state House, following in the footsteps of their father. His grandfather served six years in the U.S. House.\n\nAsked whether that might be a liability in the district, Ager shrugged: “Then don’t vote for me.”\n\nTrump’s big bill could reshape a conservative district in Michigan\n\nIn western Michigan, state Sen. Sean McCann is a different kind of candidate from Ager. He’s buttoned-up and soft-spoken, with a long resume in elected office and deep roots in Kalamazoo, having served for a decade on the city commission before winning a seat in the state House in 2010.\n\nIn a district anchored by conservative and religious values, Democrats see McCann as the kind of steady, experienced figure who can make inroads — especially as backlash builds to Trump’s tax bill, which includes deep spending cuts.\n\nAt a recent meeting at Kalamazoo’s Family Health Center, where nearly 65% of patients rely on Medicaid, the center’s president warned the proposed Medicaid cuts would be devastating.\n\n“It’s about being home in the community and listening to our community’s values — and carrying those to Washington,” McCann said.\n\nThe district is represented by Republican Rep. Bill Huizenga, who won reelection by nearly 12 percentage points in 2022. But Huizenga hasn’t said whether he’ll seek another term, and Trump carried the district by only 5.5 percentage points in 2024.\n\nDemocrats hope strong ties help elsewhere\n\nAcross the country, Democrats are watching similar races in places like Iowa and Kentucky, where local candidates with strong community ties are running. In Iowa’s 2nd District, state Rep. Lindsay James — a fourth-term lawmaker and Presbyterian pastor — is weighing a run in the northeast part of the state. In Kentucky’s 6th, which includes Lexington and Richmond, former federal prosecutor Zach Dembo is running his first campaign, describing himself as a political outsider.\n\nIt’s a mix of profiles: Ager, the farmer-turned-candidate feeding neighbors after a hurricane. McCann, the public servant meeting with health workers in his hometown. And others like them trying to reconnect a skeptical electorate.\n\n“Yes, the Democratic Party has some taint to it,” Ager said. “But when I go talk to Republicans who are friends that I’ve known forever, there’s genuine admiration and mutual respect for each other. And that comes from being in this community forever.”\n\nAssociated Press reporter Maya Sweedler in Washington contributed to this report.","summary":"Democrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity remains dominant.","url":"https://www.ocregister.com/2025/08/18/2026-us-house-democrats-candidates/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/Election_2026_House_Democrats_62475-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-18 13:24:12","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.355},{"id":352119132,"title":"The Silence of Hollywood Women in the Age of Epstein","text":"LOS ANGELES – As the summer grinds on with headline after headline about Jeffrey Epstein and Donald Trump, the women’s movement is strangely silent. I’m not even sure what I mean when I say “the women’s movement.” We used to have one, but I don’t think I could name a single national figure – political, cultural, business – who is leading the fight for women’s rights. \n\nMerely eight years ago, the righteous rage of women abused at the hands of powerful men shook the foundations of power across the world and birthed the hashtag #MeToo, all sparked by the fall of movie mogul Harvey Weinstein, spreading quickly across the entertainment industry to include directors, producers, CEOs and agents. \n\nIt was a movement aimed at change, meant to clear out the dark attics and scary basements where the bogeymen live and create a world that was better for our daughters. The women in Hollywood created Time’s Up and took up a social justice mantra that sought equity: “50/50 by 2020.” \n\nReporting on this at the time, I was shocked at the depth and breadth of the misconduct. Not just the proverbial casting couch, and not just Weinstein. This was a widespread culture of men helping themselves to women in the workplace and pressuring them to stay silent – until the dam broke. \n\nFor the most part, the men pushed out by that movement remain persona non grata, though some have defiantly returned to the spotlight. Louis C.K., canceled for masturbating in front of multiple women, is now on a national tour titled “Ridiculous” and will headline the New York Comedy Festival in November.\n\nJeff Shell, who had to step down as CEO of NBCUniversal in 2023 over allegations of sexual harassment, has just been named to a top job at Paramount Global with the Skydance merger complete. \n\nFrom Hollywood to politics, it feels like the #MeToo chapter is closed; Andrew Cuomo — who, after first winning praise with his high profile during COVID, had to resign as governor of New York — is back running for New York City mayor, for God’s sake.\n\nWhere are the women? #MeToo may now be a 501c3 called “me too,” but no one’s talking about it. Time’s Up disbanded in 2023 over conflicts of interest and problems in its leadership. Even women who have sought the highest office, including Hillary Clinton and Kamala Harris, appear to have lost their voice. \n\nA palpable fatigue seems to have followed that initial flurry of complaints. Even as new and lurid cases of misconduct emerge, such as accounts of Sean “Diddy” Combs’ sex parties during his recent trial, they have been greeted with more weariness than alarm. Combs, found not guilty of racketeering and sex trafficking but convicted of less serious offenses of transportation to engage in prostitution, is reportedly seeking a pardon from President Trump. \n\nWomen, especially famous ones, sense that speaking out now is not just out of fashion, but carries real reputational risks. No one wants to be “the target of the administration’s ire,” says Leigh Goodmark, an expert in gender-based violence and the Marjorie Cook Professor of Law at University of Maryland Carey School of Law.\n\nAnd undoubtedly confidence has been lost as the national movement for women’s rights has clocked one defeat after another: from the loss of Roe v. Wade to the re-election of Donald Trump a year after he was found liable of sexual abuse in the E. Jean Carroll case. Already besieged, Planned Parenthood is fighting a legal battle for its survival with the Trump administration over Medicaid funding.\n\nNow comes the Epstein case, which no one in Hollywood sees as a newfound rallying cry for the cause of women. It’s just an intra-MAGA political football. The survivors who say they feel abandoned also say they are simply exhausted, trying to manage their trauma, fight their court cases and make ends meet. \n\n“Survivors aren’t stupid. They understand that calling for the [Epstein] files to be released is a political move,” Goodmark said. “No one thinks it’s about survivors.” \n\nOf Trump, she added, “He’s a serial violator of women. They know already he was a friend of Jeffrey Epstein. They don’t believe he doesn’t make little drawings. So continuing to weigh in on this when Epstein is dead, when the people who support him don’t care, doesn’t seem like a great use of time or resources.”\n\nMore ominously, a lawyer who has worked on the Weinstein case said that both Epstein and Diddy involved too many powerful people, and the current silence is just plain fear of the consequences.\n\n“These guys are in a power network rubbing elbows with presidents and senators — people with real power. It’s paralyzing,” said the lawyer, who said she declined to represent victims of Diddy and Epstein. “I’m as guilty as the women who aren’t saying anything. I didn’t want to have a great career and then have it ended — either dead or bankrupt or vilified. And that’s the math on everyone else’s mind. The men were too powerful.” \n\nWhen I reached out to speak to some of the women who came forward in 2017, I was met with the harsh sting of their disappointment.\n\n“We are drowning in sorrow,” said Rosanna Arquette, who has said she was blacklisted from working as an actress in Hollywood after she rebuffed Weinstein. A longtime activist against sex trafficking, she is friends with women who came forward with claims of abuse by Epstein.\n\nMore concretely, “there’s a real dearth of a national-level, umbrella organization that focuses on sexual violence,” said Weinstein survivor Louise Godbold, who counsels victims of sexual abuse.\n\n“Survivors are busy dealing with their personal trauma, that’s the level I’m working with. It’s a formidable foe if you’re talking about the entrenched establishment power who have so much to lose if it came out that they were perpetrators. It’s an uphill battle. Most survivors are dealing with their PTSD and trying to hold down a job. They’re caught up in court cases that take every ounce of their energy. They don’t have the capacity to do more.” \n\nIs the silence a tacit agreement in Hollywood that #MeToo may have gone too far? I wonder. If pressed, I would argue that people seem to just want to get on with their lives, get back to work and declare a truce. \n\nThe power dynamics may never permanently shift in an industry where men dominate decisions and beautiful women will always vie for media attention and roles. But in Hollywood right now, the silence is deafening.","summary":"Is the lack of reaction a tacit nod to #MeToo being over? Or are women leaders and survivors just too exhausted to speak? \n\n\nThe post The Silence of Hollywood Women in the Age of Epstein appeared first on TheWrap.","url":"https://www.thewrap.com/the-silence-of-hollywood-women-in-the-age-of-epstein/","image":"https://www.thewrap.com/wp-content/uploads/2025/08/081425-The-silence-of-Hollywood-women.jpg","video":null,"publish_date":"2025-08-18 13:15:00","author":"Sharon Waxman","authors":["Sharon Waxman"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.172},{"id":352158880,"title":"'Star Wars' Star Mark Hamill Planned to Leave U.S. for Europe After Trump Beat Kamala","text":"Actor Mark Hamill revealed that he planned to leave the United States after President Donald Trump defeated former Vice President Kamala Harris in the 2024 election.\n\nHamill revealed to The Times that that he gave his longtime wife, Marilou Tork, the choice between “London or Ireland” after the election did not go as he had hoped\n\n“She’s very clever. She didn’t respond right away but a week later she said, ‘I’m surprised you would allow him to force you out of your own country,’” Hamill said. “‘That son of a bitch,’ I thought. I’m not leaving.”\n\nHamill lamented “the bullying, the incompetence, the people in place” in the Trump administration, adding that the only way he can tolerate the situation is view it “like a thick, sprawling political novel” instead of reality. He ultimately decided against moving to England under the belief that there are “more honest, decent people” in the country than what meets the eye.\n\nThe actor went on to promote his upcoming movie, The Long Walk, as a critique on U.S. gun culture as well as a story about Immigration and Customs Enforcement (ICE).\n\n“Francis Lawrence, the director, understood what was troubling me,” he said. “American society is gun violence and it’s hard to get past that, but as I spoke to him I realized this is just the guy. He said he would have been surprised if I wasn’t troubled by it.”\n\nHamill then said ICE agents have been “brutalizing people, kneeling on their necks.”\n\n“When I made the movie I wasn’t thinking in terms of it being timely but it’s proven to be just that,” he added.\n\nPaul Roland Bois directed the award-winning Christian tech thriller, EXEMPLUM, which has a 100% Rotten Tomatoes critic rating and can be viewed for FREE on YouTube, Tubi, or Fawesome TV. “Better than Killers of the Flower Moon,” wrote Mark Judge. “You haven’t seen a story like this before,” wrote Christian Toto. A high-quality, ad-free rental can also be streamed on Google Play, Vimeo on Demand, or YouTube Movies. Follow him on X @prolandfilms or Instagram @prolandfilms.","summary":"Actor Mark Hamill revealed that he planned to leave the United States after President Donald Trump defeated former Vice President Kamala Harris in the 2024 election.\n\n\nThe post &#8216;Star Wars&#8217; Star Mark Hamill Planned to Leave U.S. for Europe After Trump Beat Kamala appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/18/mark-hamill-reveals-he-planned-to-leave-u-s-after-trump-beat-kamala/","image":"https://media.breitbart.com/media/2025/08/Hamill-640x335.jpg","video":null,"publish_date":"2025-08-18 13:03:17","author":"Paul Bois","authors":["Paul Bois"],"language":"en","category":"politics","source_country":"US","sentiment":-0.12},{"id":352083286,"title":"James Comey prompts MAGA outrage after he posts ‘creepy video’ where he claims to be a Swiftie","text":"Former FBI director James Comey has unexpectedly outed himself as a fan of Taylor Swift, saying her music serves as his “coping mechanism” in the face of renewed hostility from President Donald Trump.\n\nComey, 64, who was fired by Trump in 2017, took to his Substack on Sunday to post an oddly formal video in which he praised the pop superstar as “a truly inspirational public figure” and said that “of course” he had watched her recent interview with the Kelce Brothers.\n\n“Taylor Swift and I go way back,” he explained. “I went to my first concert of hers 15 years ago. I’ve been to a second and I have helped financially support the attendance of a lot of family members and others. I’m in a family’s Swiftie group chat. I know all her music, and I listen to it in my headphones when I cut the grass.”\n\nMAGA commentators including Benny Johnson and Dinesh D’Souza were quick to deride Comey over the bizarre video, which was arguably still not as weird as the affair he found himself caught up in earlier this summer after he posted a photograph on Instagram of sea shells arranged on a beach to spell out “8647,” which was interpreted as a veiled call for Trump to be assassinated, leading to a Justice Department investigation. \n\nComey stated that his favorite Swift tracks are “All Too Well” (specifying the 10-minute version) and “Exile” featuring Bon Iver, and praised the star by saying she had soundtracked his family’s life, produced “great art” and served as a role model for his children. \n\nPivoting to the actual theme of his quasi-sermon, Comey said: “Like a lot of you, I struggle with how to stand up to bullies without letting their meanness infect me and change me.”\n\nDiscussing California Gov. Gavin Newsom’s recent parodies of Trump’s posting style on social media, he said, “I find it very funny. Hilarious even, sometimes. But I’ve got to be honest, it also leaves me with a strange feeling at times because I don’t want us to become like Trump and his followers.\n\n“There are far more decent, honest, kind people in America than there are mean jerks, and don’t get me wrong, we have our jerks, millions of them. You may have noticed! In particular, there’s a stunning coarseness and ugliness in the Republican Party today. \n\n“It’s upsetting, but it’s also a minority of America. On the whole, we aren’t like that and we don’t like that.”\n\nCircling back to Swift, Comey noted that she had “made clear that she sees Donald Trump for what he is,” having endorsed Joe Biden and then Kamala Harris in the 2020 and 2024 presidential elections.\n\n“While our elderly, makeup-covered president is posting about whether Taylor Swift is still ‘hot’ and declaring that he can’t stand her, what’s she doing? Living her best life, producing great music, and, as she urged all of us to do during the podcast, not giving the jerks power over her mind.”\n\nAfter praising Arthur C Brooks’ articles on happiness in The Atlantic, Comey concluded by reciting lyrics from Swift’s 2010 song “Mean” as his anthem of defiance: “I bet you got pushed around, somebody made you cold, but the cycle ends right now, because you can’t lead me down that road.”\n\nDirector of National Intelligence Tulsi Gabbard has since moved to refer several Obama administration officials – including Comey, ex-CIA director John Brennan and her predecessor James Clapper – to the same department for prosecution over allegations they had “manufactured” intelligence to substantiate the idea that Russia meddled in the 2016 presidential election to help Trump beat Hillary Clinton.","summary":"Ex-FBI director hails Taylor Swift as ‘truly inspirational public figure’ in bizarre anti-bullying sermon","url":"https://www.independent.co.uk/news/world/americas/us-politics/james-comey-taylor-swift-trump-b2809542.html","image":"https://static.independent.co.uk/2025/08/18/10/26/SwiftComey-split.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/Tv0sbYWc-OhrQWqOm.mp4","publish_date":"2025-08-18 12:06:24","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":0.193},{"id":352103262,"title":"Democrats are reliving the GOP’s 2012 nightmare. A Trump-style rebellion is needed","text":"Trump’s dynamic rebellion catapulted not only him into the national spotlight, but also the Republican Party, whose national relevance had faded since former President George W. Bush’s fall from grace, with approvals dipping to the mid-20s by the time he helicoptered back to his Texas ranch. In the years that followed, the Tea Party’s groundswell fueled GOP congressional victories, but it failed to produce strong national leaders during the Obama era.\n\nThe 2012 GOP presidential hopefuls epitomized the party’s troubles, offering nothing fresh beyond Herman Cain’s “9-9-9” tax plan and each battling to appear more opposed to the Obama agenda than the next. A dissatisfied primary electorate vacillated from one candidate to another in that uninspired scrum, with Cain, Rick Perry, Newt Gingrich, and eventual winner Mitt Romney sharing time in the national lead. \n\nIt’s easy to see shades of the 2012 GOP in today’s Democratic Party, where a restless base drives mass demonstrations, yet whose agenda is fundamentally oppositional and whose national leaders lack stature. The party is full of energy and desperate for unity but lacks the leaders and positive vision necessary to unify its constituent parts. \n\nMeanwhile, fealty to sacred cows keep them from an internal reckoning that could spark renewal. Democrats’ unwillingness to criticize Biden-era policies on the border, inflation, and hot-button cultural issues, and even to voice obvious concerns about his mental capacity, rendered them out-of-touch and left them vulnerable to countless political blind spots.\n\nThe 2012 GOP similarly resisted internal criticism, languishing in Bush-era pieties like uncritical support for free trade and military interventionism. Only Ron Paul proved willing to challenge prevailing orthodoxy during the primary, and debate crowds booed him lustily for his efforts, especially his criticisms of the Iraq War, while his mainstream conservative rivals shook their heads in disbelief at his every utterance.\n\nIt’s possible that Democrats today are mired in a deeper refusal to engage in meaningful self-scrutiny. Their coalition — Zohran Mamdani-style progressives, shapeshifting establishmentarians in congressional leadership, and meat-and-potatoes moderates such as Sen. Elissa Slotkin (D-MI) — is fractured but not warring, as exemplified by House Minority Leader Hakeem Jeffries’s (D-NY) refusal to endorse or challenge Mamdani’s socialist policies in New York’s mayoral race. The Democratic factions orbit one another like distant planets, drifting further apart without the gravitational pull of unifying ideas and leaders. \n\nThis drift springs from a paralyzing fear of internal conflict, driven by three forces that stifle the factional clashes needed for renewal.\n\nFor one, the hyper-conformity of the woke era conditioned liberals to view every conceivable circumstance as part of a Manichean struggle between good and evil in which only two sides existed: the “right side of history” and the wrong side, anti-racism and racism, allies and enemies. Breaking with orthodoxy meant joining forces with the worst possible element of humanity: white supremacists, Nazis, etc. Even the appearance of nonconformity came with severe social and professional consequences. In an environment where words amounted to violence and awareness of one’s “privilege” demanded constant monitoring, self-censorship became the norm. Breaking out of this deeply rooted and fear-based behavior will demand true courage and savvy.\n\nThe second cause flows from the first: To ensure the “right side of history” prevails, Democrats became obsessed with avoiding the appearance of giving aid to Trump’s “wrong side,” even indirectly. This led them to suppress reasonable doubts about obvious things, such as Biden’s mental decline, Kamala Harris’s political talent, or the state of the economy and border. Preventing Trump from winning even a single news cycle demanded rigid and artificial messaging alignment. This forced positivity came at the expense of both short- and long-term political goals, causing Democrats to appear untrustworthy, callous, and downright ignorant of the problems most Americans saw in their government. Ironically, this empowered Trump and the Republicans all the more. \n\nFinally, Democrats’ aversion to internal conflict springs from not having had much practice of late. Not since 2008 has the Democratic Party held an open, honest, and rigorous presidential primary, which is the forum where parties traditionally test ideas and leaders to forge unity among its factions. From the crucible of competitive primaries emerges bold and battle-tested governing visions. Without them, parties are stuck with stale ideas and outdated modes of politics and campaigning. \n\nWhile technically open, the 2016 Democratic primary was marred from the beginning with accusations by supporters of Bernie Sanders that the Democratic National Committee was biased toward the Hillary Clinton campaign. The Wikileaks dump later validated these suspicions, revealing internal emails showing DNC staff mocking Sanders and discussing ways to undermine his campaign. Interim DNC Chairwoman Donna Brazille, who gave Clinton’s campaign advance information about presidential debate questions, later admitted that the DNC was financially beholden to Clinton. The tipped scales prevented a true intraparty competition and crowned an unpopular nominee whose troubles were never truly reckoned with. The primary was a coronation in all but name.\n\nThe 2020 primary was similarly managed by insiders. After early Sanders victories, the party establishment rapidly consolidated behind Joe Biden, with Pete Buttigieg and Amy Klobuchar quickly dropping out to endorse him and effectively ending the race. While evidence of 2016-level corruption never emerged, the perception of a tipped-scale contest lingered among a large bloc of the Democratic electorate.\n\nThe 2024 coronation of former Vice President Kamala Harris following Biden’s withdrawal robbed the party of another opportunity for productive conflict and renewal. Party bosses again tightly managed the selection, tossing their full support behind the vice president without allowing Democratic voters to have their say. Harris’s highly scripted rollout followed the stale Obama playbook with its emphasis on her identity as the first black female nominee, replete with Obama-esque magazine covers depicting her gazing aspirationally into the distance and an Obama-esque campaign slogan “A New Way Forward,” which was an adaption of Obama’s 2012 slogan, “Forward.”\n\nMeanwhile, fractures in the party’s coalition were downplayed and at times outright ignored as party leaders attempted to keep the focus on Trump. A telling example of internal debate being suppressed came during the first night of the Democratic convention in Chicago. During Biden’s speech that capped the first night, a group of pro-Palestinian protesters erupted in the back of the United Center, holding up a Palestinian flag and booing wildly. As Biden struggled through his scripted remarks amid the uproar, the lights over the protesters’ section of the arena were shut, leaving them shrouded in noticeable darkness. It is therefore no surprise that the party has yet to settle upon a cohesive and unifying position on Gaza or on anything else, for that matter. \n\nThe Democratic Party’s commitment to being the “anti-Trump” party has left it in ruins, with its approval ratings at historic lows. It desperately needs, as the GOP once did, an internal rebellion led by a bold, unapologetic figure (Rahm Emanuel? Jon Stewart?) willing to slay their sacred cows, confront uncomfortable truths, and forge a unifying vision from the ashes.","summary":"It&#8217;s easy to forget that President Donald Trump&#8216;s rise began with an assault on fellow Republicans, not Democrats. Of course, Trump made waves by questioning former President Barack Obama’s claim to birthright citizenship in 2011. But he didn’t become a true political force until he savaged low energy Jeb Bush (Jeb!), Little Marco Rubio, and [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3757724/democrats-reliving-gop-2012-nightmare-trump-style-rebellion-needed/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP1202220120842-1.jpg?w=696","video":null,"publish_date":"2025-08-18 12:00:00","author":"Peter Laffin","authors":["Peter Laffin"],"language":"en","category":"politics","source_country":"US","sentiment":0.201},{"id":352066040,"title":"Democrats are reliving the GOP’s 2012 nightmare. A Trump-style rebellion is needed","text":"Trump’s dynamic rebellion catapulted not only him into the national spotlight, but also the Republican Party, whose national relevance had faded since former President George W. Bush’s fall from grace, with approvals dipping to the mid-20s by the time he helicoptered back to his Texas ranch. In the years that followed, the Tea Party’s groundswell fueled GOP congressional victories, but it failed to produce strong national leaders during the Obama era.\n\nThe 2012 GOP presidential hopefuls epitomized the party’s troubles, offering nothing fresh beyond Herman Cain’s “9-9-9” tax plan and each battling to appear more opposed to the Obama agenda than the next. A dissatisfied primary electorate vacillated from one candidate to another in that uninspired scrum, with Cain, Rick Perry, Newt Gingrich, and eventual winner Mitt Romney sharing time in the national lead. \n\nIt’s easy to see shades of the 2012 GOP in today’s Democratic Party, where a restless base drives mass demonstrations, yet whose agenda is fundamentally oppositional and whose national leaders lack stature. The party is full of energy and desperate for unity but lacks the leaders and positive vision necessary to unify its constituent parts. \n\nMeanwhile, fealty to sacred cows keep them from an internal reckoning that could spark renewal. Democrats’ unwillingness to criticize Biden-era policies on the border, inflation, and hot-button cultural issues, and even to voice obvious concerns about his mental capacity, rendered them out-of-touch and left them vulnerable to countless political blind spots.\n\nThe 2012 GOP similarly resisted internal criticism, languishing in Bush-era pieties like uncritical support for free trade and military interventionism. Only Ron Paul proved willing to challenge prevailing orthodoxy during the primary, and debate crowds booed him lustily for his efforts, especially his criticisms of the Iraq War, while his mainstream conservative rivals shook their heads in disbelief at his every utterance.\n\nIt’s possible that Democrats today are mired in a deeper refusal to engage in meaningful self-scrutiny. Their coalition — Zohran Mamdani-style progressives, shapeshifting establishmentarians in congressional leadership, and meat-and-potatoes moderates such as Sen. Elissa Slotkin (D-MI) — is fractured but not warring, as exemplified by House Minority Leader Hakeem Jeffries’s (D-NY) refusal to endorse or challenge Mamdani’s socialist policies in New York’s mayoral race. The Democratic factions orbit one another like distant planets, drifting further apart without the gravitational pull of unifying ideas and leaders. \n\nThis drift springs from a paralyzing fear of internal conflict, driven by three forces that stifle the factional clashes needed for renewal.\n\nFor one, the hyper-conformity of the woke era conditioned liberals to view every conceivable circumstance as part of a Manichean struggle between good and evil in which only two sides existed: the “right side of history” and the wrong side, anti-racism and racism, allies and enemies. Breaking with orthodoxy meant joining forces with the worst possible element of humanity: white supremacists, Nazis, etc. Even the appearance of nonconformity came with severe social and professional consequences. In an environment where words amounted to violence and awareness of one’s “privilege” demanded constant monitoring, self-censorship became the norm. Breaking out of this deeply rooted and fear-based behavior will demand true courage and savvy.\n\nThe second cause flows from the first: To ensure the “right side of history” prevails, Democrats became obsessed with avoiding the appearance of giving aid to Trump’s “wrong side,” even indirectly. This led them to suppress reasonable doubts about obvious things, such as Biden’s mental decline, Kamala Harris’s political talent, or the state of the economy and border. Preventing Trump from winning even a single news cycle demanded rigid and artificial messaging alignment. This forced positivity came at the expense of both short- and long-term political goals, causing Democrats to appear untrustworthy, callous, and downright ignorant of the problems most Americans saw in their government. Ironically, this empowered Trump and the Republicans all the more. \n\nFinally, Democrats’ aversion to internal conflict springs from not having had much practice of late. Not since 2008 has the Democratic Party held an open, honest, and rigorous presidential primary, which is the forum where parties traditionally test ideas and leaders to forge unity among its factions. From the crucible of competitive primaries emerges bold and battle-tested governing visions. Without them, parties are stuck with stale ideas and outdated modes of politics and campaigning. \n\nWhile technically open, the 2016 Democratic primary was marred from the beginning with accusations by supporters of Bernie Sanders that the Democratic National Committee was biased toward the Hillary Clinton campaign. The Wikileaks dump later validated these suspicions, revealing internal emails showing DNC staff mocking Sanders and discussing ways to undermine his campaign. Interim DNC Chairwoman Donna Brazille, who gave Clinton’s campaign advance information about presidential debate questions, later admitted that the DNC was financially beholden to Clinton. The tipped scales prevented a true intraparty competition and crowned an unpopular nominee whose troubles were never truly reckoned with. The primary was a coronation in all but name.\n\nThe 2020 primary was similarly managed by insiders. After early Sanders victories, the party establishment rapidly consolidated behind Joe Biden, with Pete Buttigieg and Amy Klobuchar quickly dropping out to endorse him and effectively ending the race. While evidence of 2016-level corruption never emerged, the perception of a tipped-scale contest lingered among a large bloc of the Democratic electorate.\n\nThe 2024 coronation of former Vice President Kamala Harris following Biden’s withdrawal robbed the party of another opportunity for productive conflict and renewal. Party bosses again tightly managed the selection, tossing their full support behind the vice president without allowing Democratic voters to have their say. Harris’s highly scripted rollout followed the stale Obama playbook with its emphasis on her identity as the first black female nominee, replete with Obama-esque magazine covers depicting her gazing aspirationally into the distance and an Obama-esque campaign slogan “A New Way Forward,” which was an adaption of Obama’s 2012 slogan, “Forward.”\n\nMeanwhile, fractures in the party’s coalition were downplayed and at times outright ignored as party leaders attempted to keep the focus on Trump. A telling example of internal debate being suppressed came during the first night of the Democratic convention in Chicago. During Biden’s speech that capped the first night, a group of pro-Palestinian protesters erupted in the back of the United Center, holding up a Palestinian flag and booing wildly. As Biden struggled through his scripted remarks amid the uproar, the lights over the protesters’ section of the arena were shut, leaving them shrouded in noticeable darkness. It is therefore no surprise that the party has yet to settle upon a cohesive and unifying position on Gaza or on anything else, for that matter. \n\nThe Democratic Party’s commitment to being the “anti-Trump” party has left it in ruins, with its approval ratings at historic lows. It desperately needs, as the GOP once did, an internal rebellion led by a bold, unapologetic figure (Rahm Emanuel? Jon Stewart?) willing to slay their sacred cows, confront uncomfortable truths, and forge a unifying vision from the ashes.","summary":"It&#8217;s easy to forget that President Donald Trump’s rise began with an assault on fellow Republicans, not Democrats. Of course, Trump made waves by questioning former President Barack Obama’s claim to birthright citizenship in 2011. But he didn’t become a true political force until he savaged low energy Jeb Bush (Jeb!), Little Marco Rubio, and [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3757724/democrats-reliving-gop-2012-nightmare-trump-style-rebellion/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP1202220120842-1.jpg?w=696","video":null,"publish_date":"2025-08-18 12:00:00","author":"Peter Laffin","authors":["Peter Laffin"],"language":"en","category":"politics","source_country":"us","sentiment":0.201},{"id":352073946,"title":"How Gavin Newsom is out-trumping Trump","text":"It began with a meme. Two photographs went viral on X: Gavin Newsom as a teenager, scarf draped across his shoulders, the very image of San Francisco privilege; and J.D. Vance, straight-backed in Marine fatigues, fresh out of high school and heading for Iraq.The contrast was deliberate. Newsom: born into money and connections, nurtured by the Getty family, polished into politics before he hit forty. Vance: raised in a chaotic household in Ohio, stabilized only by the Marines, hardened in Iraq, propelled upward by Yale Law and a bestselling memoir. It was the quintessential split screen — privilege versus grit, elites versus scrappers.But the meme was only the opening act.The Trumpian TurnFor years, Newsom’s official press accounts were standard Democratic fare: policy announcements, carefully worded releases, ribbon-cutting photos. Then, this August, something changed.His press office on X suddenly began sounding like Donald Trump at 3 a.m.:ALL CAPS proclamations.Mocking nicknames.Boasts so overblown they bordered on parody.Trump was rechristened “Taco Trump” — shorthand for “Trump Always Chickens Out.” J.D. Vance became “JD ‘Just Dance’ Vance.” And Newsom crowned himself “our nation’s favorite governor,” vowing to “SAVE AMERICA” from the “disastrous maps war” Trump had unleashed.The parody was deliberate. Newsom wasn’t talking policy; he was trolling.MAGA: From Mockers to the MockedMAGA has always thrived on ridicule. Trump’s nicknames — “Crooked Hillary,” “Sleepy Joe,” “Low-Energy Jeb” — weren’t just insults. They were branding. They turned opponents into caricatures and made Democrats look joyless, out of touch, and defensive.Newsom’s innovation was to flip the script. Instead of rolling his eyes or fact-checking, he mocked them back. He parodied their style, borrowed their cadence, threw their tactics in their face.And MAGA, for once, didn’t laugh.The Guilfoyle SubplotAdding spice to the feud is a subplot straight out of a political soap opera. Gavin Newsom’s ex-wife is Kimberly Guilfoyle — now a sequined staple of MAGA, US Ambassador to Greece and Donald Trump Jr.’s former partner. From 2001 to 2006, she was married to Newsom and even served as First Lady of San Francisco during his mayoralty. Their split was civil, blamed on geography, but history clearly enjoys irony. Today, she’s a leading voice of MAGA while her ex-husband needles MAGA’s king with memes. Why It WorksOn the surface, Newsom’s trolling looks juvenile. Why would a governor's press account waste time calling the Vice President “Just Dance Vance”? But Democrats spent the last decade underestimating ridicule as a weapon. Trump proved that attention is currency, and nicknames can define opponents more effectively than policy papers.By mimicking Trump’s style, Newsom isn’t trying to out-debate him. He’s trying to deny him the monopoly on mockery.The strategy is simple:Mock back.Dominate the oxygen.It’s crude. It’s performative. But it works.The MAGA Battlefield in 2025This fight isn’t happening in a vacuum. MAGA today isn’t just Trump’s campaign machinery; it’s a permanent movement. It controls school boards, censors textbooks, drives immigration crackdowns, and fuels conspiracies across social media.The Republican Party has been fully absorbed into this ecosystem. J.D. Vance may be Vice President, but figures like Ron DeSantis and Marjorie Taylor Greene still command cultural loyalty. The battlefield isn’t legislation; it’s narrative.That’s why Newsom’s trolling matters. He’s meeting MAGA not with white papers, but with memes — the lingua franca of the culture war.Carrot and StickTrolling is the stick. But Newsom also wields a carrot: direct engagement. His podcast, This Is Gavin Newsom, has featured right-wing guests like Charlie Kirk and Steve Bannon. Democrats were horrified. Why legitimise extremists? But Newsom’s message was clear: I’m not afraid of you, and I’ll argue with you in your own spaces. It’s a risky gamble. But it positions Newsom as one of the few Democrats willing to meet MAGA on the cultural battlefield rather than avoiding it.Harris vs. Newsom: Memo vs. MemeThe contrast with Kamala Harris’s 2024 campaign could not be sharper. Harris ran as the anti-Trump: sober, cautious, scripted. She leaned on biography — first woman Vice President, daughter of immigrants — and policy proposals on childcare and reproductive rights. But her campaign avoided spectacle.When Trump mocked her as “Laffin’ Kamala,” Harris didn’t punch back; she relied on fact-checkers and surrogates. Her message discipline made her look serious, but it left her flat-footed in a culture war defined by ridicule.Newsom, by contrast, leans into the chaos. Where Harris tried to be dignified and above the fray, Newsom revels in it. Where she treated memes as unserious, he treats them as currency. Harris thought voters would crave normalcy. Newsom bets they want someone who can fight Trump at his own game.Harris’s 2024 was a memo. Newsom’s 2025 is a meme.Democratic DoubtsNot everyone in the Democratic Party is impressed. Moderates see the trolling as reckless, undermining the gravitas of their brand. Progressives worry it trivialises policy battles like climate change and healthcare.But among the Democratic base, there’s also relief. For years, they’ve watched Trump humiliate their leaders with nicknames, while Democrats responded with sighs. Newsom is the first to punch back in kind.The RiskThe danger is obvious. If Democrats troll like Trump, do they risk becoming indistinguishable from him? Does parody politics normalise Trumpism rather than defeat it? This is the tightrope Newsom walks. But the louder they scoffed, the more they proved Newsom’s point. MAGA loves to brand others but hates being branded itself.The Lyndon Johnson QuestionYet trolling alone isn’t governing. The deeper question is whether Newsom, if he ever reaches the White House, could turn parody into power. Here’s where Lyndon B. Johnson looms. When John F. Kennedy was assassinated in 1963, Johnson was dismissed as a backroom Texan wheeler-dealer. But he stunned the nation by pushing through the Civil Rights Act, the Voting Rights Act, Medicare, and the Great Society.Johnson showed that politics requires both theatre and muscle — spectacle to capture attention, and force to deliver results. Can Newsom do the same? Can the man who tweets “TACO TRUMP” also twist arms in Congress to pass universal childcare or climate reform?Eyes on 2028Newsom insists he isn’t running in 2028. No one believes him. With Biden retired and Harris damaged, Democrats need a contender who won’t flinch in the meme arena. The question is whether Democrats will stomach a candidate who fights like Trump. For some, it’s unbecoming. For others, it’s overdue. For MAGA, Newsom is an irritation they can’t easily dismiss: rich, coastal, polished — but unafraid to mock them back.Back to the MemeThat viral split screen of scarf vs fatigues was meant to define who had grit and who had privilege. But in modern politics, biography matters less than performance. Vance leveraged his Marine past to ride Trump’s coattails into the vice presidency. Newsom is leveraging parody to carve out space as the Democrat unafraid of MAGA. Act one was the split screen. Act two is the troll war. Act three, if it comes, will be 2028 — where Gavin Newsom will either be remembered as the liberal who cosplayed Trump for a season or the Democrat who figured out how to use memes to win power. Could he be the Lyndon Johnson of the meme era — underestimated, even mocked, until history forced him into greatness? That remains unanswered. But for now, MAGA finally knows what it feels like to be on the receiving end of ridicule. And Gavin Newsom is laughing loudest.","summary":"That viral split screen of scarf vs fatigues was meant to define who had grit and who had privilege. But in modern politics, biography matters less than performance. Vance leveraged his Marine past to ride Trump’s coattails into the vice presidency. Newsom is leveraging parody to carve out space as the Democrat unafraid of MAGA. Act one was the split screen. Act two is the troll war. Act three, if it comes, will be 2028 — where Gavin Newsom will either be remembered as the liberal who cosplayed Trump for a season or the Democrat who figured out how to use memes to win power. Could he be the Lyndon Johnson of the meme era — underestimated, even mocked, until history forced him into greatness? That remains unanswered. But for now, MAGA finally knows what it feels like to be on the receiving end of ridicule. And Gavin Newsom is laughing loudest.","url":"https://timesofindia.indiatimes.com/world/us/how-gavin-newsom-is-taking-the-fight-to-maga-trump-style/articleshow/123363050.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123363622/123363622.jpg","video":null,"publish_date":"2025-08-18 11:30:03","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"IN","sentiment":-0.121},{"id":352057234,"title":"Republican Stacy Garrity seeks to challenge Pennsylvania Gov. Josh Shapiro’s reelection bid","text":"HARRISBURG, Pa. (AP) — Stacy Garrity, Pennsylvania’s two-term elected state treasurer, said Monday that she will seek the Republican nomination to challenge Democratic Gov. Josh Shapiro ’s reelection bid, setting up what could be a contest between a low-profile officeholder and a potential White House contender in 2028.\n\nGarrity said in a statement that she will \"will bring jobs back, strengthen our economy and make Pennsylvania more affordable for families in every corner of the state.”\n\nSome top Pennsylvania Republicans support Garrity in the 2026 race for governor and hope she’ll see a clear primary field, although those hopes have been buffeted in recent weeks by 2022’s losing gubernatorial candidate, Doug Mastriano, suggesting that he'll run again.\n\nGarrity has hinted at a run for months and stepped up her criticism of Shapiro. In campaign fundraising appeals, she accused Shapiro of being soft on law and order and hostile to her “pro-worker, pro-energy, pro-America agenda.”\n\nShapiro has returned fire, blasting her for supporting President Donald Trump’s big tax break and spending cut package. Shapiro said it would hurt rural hospitals and people who rely on Medicaid, drive up the cost of energy and blow up the federal deficit.\n\nGarrity’s task of challenging Shapiro is, by any measure, a tall one. Garrity is relatively untested and spent less than $3 million in her two campaigns for treasurer in 2020 and 2024.\n\nShapiro has won three statewide races, carries a reputation as a disciplined messenger and powerhouse fundraiser who spent more than $70 million alone in his sole campaign for governor, smashing Pennsylvania’s campaign finance record.\n\nHe’s grown into a national figure after he made Democratic presidential nominee Kamala Harris’ shortlist for vice presidential running mates last year and is viewed as a potential White House contender for the party in 2028.\n\nFollow Marc Levy on X at: https://x.com/timelywriter","url":"https://www.yahoo.com/news/articles/republican-stacy-garrity-seeks-challenge-111639337.html","image":"https://s.yimg.com/ny/api/res/1.2/0ZGjlHKqHhKCMIsVs04WkQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/ap.org/64a919adc5643c87f919cf05f313969f","video":null,"publish_date":"2025-08-18 11:16:39","author":"Marc Levy","authors":["Marc Levy"],"language":"en","category":"politics","source_country":"us","sentiment":0.267}]}