{"offset":0,"number":50,"available":339,"news":[{"id":392171796,"title":"Judge blocks Trump from freezing $10 billion in child, family aid to five US states","text":"NEW YORK, Jan 9 (Reuters) - A U.S. judge on Friday temporarily blocked President Donald Trump's administration from freezing access by five Democratic-led states to more than $10 billion of federal funds for childcare and family assistance based on what it said were concerns about fraud. U.S. District Judge Arun Subramanian in Manhattan, an appointee of Democratic former President Joe Biden, said he issued a temporary restraining order for the reasons stated in a legal filing by California, Colorado, Illinois, Minnesota and New York, which filed the lawsuit. The White House did not immediately respond to an email seeking comment on the ruling. The states sued the Trump administration late on Thursday, two days after the U.S. Department of Health and Human Services announced the freeze. Funds that were frozen include more than $7 billion from the Temporary Assistance for Needy Families program, which provides cash to low-income families with children. The funds also included $2.4 billion from the Child Care and Development Fund, which helps make childcare more affordable, and about $870 million in social services grants for children. HHS said it had concerns about \"widespread fraud and misuse of taxpayer dollars\" in the five states' welfare programs, including the possibility people other than U.S. citizens and lawful permanent residents might be receiving benefits. U.S. Agriculture Secretary Brooke Rollins on Friday said the Department of Agriculture had frozen federal benefit programs for Minnesota, citing fraud allegations. Minnesota Governor Tim Walz, a Democrat who was former Vice President Kamala Harris' running mate in the 2024 presidential election won by Trump, a Republican, announced on Monday he will not seek a third term so he can focus on the fraud scandal. The five states said HHS lacked a legitimate justification for this week's funding freeze and had usurped Congress' power to allocate the money. They also called the unsubstantiated fraud allegations a pretext to justify the lawsuit, whose real purpose was to \"punish perceived political enemies of the Trump Administration by unlawfully withholding critical funding pending purported fraud detection measures unauthorized by any statute.\" (Reporting by Jack Queen in New York; Editing by Chris Reese) By Jonathan Stempel and Blake Brittain","url":"https://www.marketscreener.com/news/judge-blocks-trump-from-freezing-10-billion-in-child-family-aid-to-five-us-states-ce7e59d3dd80f52c","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2026-01/2026-01-10T003000Z_1_LYNXMPEM0900A_RTROPTP_4_USA-TRUMP.JPG","video":null,"publish_date":"2026-01-09 23:40:19","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.135},{"id":392109324,"title":"Billie Eilish Shares Posts Calling ICE a ‘Terrorist Group’ in Light of Minneapolis Shooting","text":"Skip to main content\n\nBillie Eilish at the “Avatar: Fire and Ash” World Premiere held at the Dolby Theatre on Dec. 1, 2025, in Los Angeles.\n\nMichael Buckner/Variety\n\nBillie Eilish is using her platform to amplify protests against the United States Immigration and Customs Enforcement, which has come under fire (even more than usual) for the killing of a Minnesota woman earlier this week.\n\nOn Friday (Jan. 9) — two days after 37-year-old Renee Nicole Good was fatally shot by an ICE officer during an immigration enforcement operation in Minneapolis — the pop star shared several back-to-back posts condemning the organization. The first one was a graphic calling ICE a “federally funded and supported terrorist group,” with the original creator describing the agency’s actions as “tearing apart families, terrorizing citizens, and now murdering innocent people.”\n\nBillie Eilish Pushes for Gun Control Amid ‘Devastating’ Shootings in U.S. & Australia: ‘Raise Your Voice’\n\nJohn Mulaney Postpones Minneapolis Shows Following ICE Killing of Renee Nicole Good: ‘What’s Happening in Your City Is Heartbreaking’\n\nBillie Eilish Condemns Israel Defense Minister’s Plan to Forcibly Relocate Palestinians: ‘Horrifying’\n\nThe second post Eilish reshared on her Story calls on the country to “abolish ICE,” listing 32 people who reportedly died in ICE custody last year. The third encourages U.S. citizens to call their representatives in Congress to demand that ICE be defunded, and for the officer who fired the deadly shot in Minneapolis to be arrested and charged immediately.\n\nBillboard has reached out to the White House and the Department of Homeland Security for comment.\n\nICE’s actions under the Donald Trump administration have been polarizing since he took office a year ago, but backlash has reached an all-time high this week following the scene in Minneapolis. The DHS, the president and Vice President JD Vance have all claimed that Good was trying to run over the agents with her car leading up to the shooting, and that the officer in question was acting in self defense; however, widely circulated video footage of the incident shows that Good had actually been driving the opposite way.\n\nEven Trump struggled to explain what happened after he personally watched the video of the shooting in the Oval Office with a New York Times reporter also in the room. “Well … I … the way I look at it … it’s a terrible scene,” the newspaper reports of the twice-impeached POTUS’ reaction to the footage. “I think it’s horrible to watch. No, I hate to see it.”\n\nEilish has long been vocal in her opposition to Trump’s policies, endorsing his opponent, Kamala Harris, in the 2024 election. Prior to Friday, the nine-time Grammy winner had also shared other posts condemning the ICE raids in her home city of Los Angeles.\n\nGet weekly rundowns straight to your inbox\n\nWant to know what everyone in the music business is talking about?\n\nGet in the know on\n\nVisit Billboard Pro for music business news\n\nBillboard is a part of Penske Media Corporation. © 2026 Billboard Media, LLC. All Rights Reserved.\n\nPowered by WordPress.com VIP\n\noptional screen reader\n\nManage Account\n\nBillboard Hot 100™\n\nBillboard 200™\n\nHits Of The World™\n\nSongs Of The Summer\n\nYear-End Charts\n\nDecade-End Charts\n\nR&B/Hip-Hop\n\nBusiness News\n\nRecord Labels\n\nView All Pro\n\nSongwriters & Producers\n\nArtist Index\n\nRoyalty Calculator\n\nMarket Watch\n\nIndustry Events Calendar\n\nBillboard Español\n\nCultura y Entretenimiento\n\nCrossword Puzzle\n\nGET ACCESS TODAY","summary":"The singer's Stories also call for the abolishment of the immigration enforcement agency.","url":"https://www.billboard.com/music/music-news/billie-eilish-anti-ice-posts-fatal-minneapolis-shooting-1236152310/","image":"https://www.billboard.com/wp-content/uploads/2026/01/P103C91W-e1767993424404.jpg","video":null,"publish_date":"2026-01-09 22:11:56","author":"Hannah Dailey","authors":["Hannah Dailey"],"language":"en","source_country":"us","sentiment":-0.317},{"id":392081394,"title":"David Letterman Eviscerates ‘Idiots’ at CBS News","text":"David Letterman, 78, tore into the network he called home for 22 years.\n\nThe “mentality that drove the integrity of CBS News has been trampled on, p---ed on and eviscerated by these idiots that have taken it over,” Letterman said new video posted Friday.\n\nLetterman joined The Barbara Gaines Show, a YouTube talk show hosted by Letterman’s longtime producers Barbara Gaines and Mary Barclay, to share his thoughts.\n\n“CBS News is a wreck. It’s just gone,” Letterman asserted during a conversation with two of his longtime producers.\n\nLetterman was referring to the massive changes that have been underway at CBS News since the network’s parent company Paramount merged with billionaire scion David Ellison’s Skydance Media last year. \n\nEllison quickly installed The Free Press founder Bari Weiss as CBS News’ new editor-in-chief. Late last month, Weiss made an 11th-hour decision to pull a 60 Minutes story that was critical of President Trump. \n\nThis week, she has begun to remake CBS Evening News by promoting Tony Dokoupil, 45, to anchor that nightly broadcast. Dokoupil began his tenure by inserting MAGA-friendly language into messages to viewers. \n\nLetterman joined CBS in 1993, earning more than 50 Emmy nominations over 22 years as the network’s Late Show host before handing the show over to Stephen Colbert in 2015.\n\nLater in the video, he noted that television is “running out of places” for talk show hosts who use political satire, such as Jimmy Kimmel, Seth Meyers, and Stephen Colbert.\n\n“What people don’t understand is that Jimmy Kimmel single-handedly brought the people at Disney, and all of those other network television owners, to their knees,” Letterman said. “He made them appear to be the fools that they are and continues to call attention to the plight.”\n\nWhen Colbert, who Letterman described as a “precise, quick, witty political satirist,” was announced to be leaving CBS, the comedian did not shy away from sharing his objections.\n\n“They did not handle Stephen Colbert, the face of their network, the way they should’ve,” Letterman declared at the time. \n\nIn July 2025, CBS’s parent company, Paramount, settled a $16 million lawsuit with President Trump over a misleading edit in its 60 Minutes segment featuring then-presidential candidate Kamala Harris.\n\nJust weeks after the settlement was announced, CBS announced the vocal White House critic’s premature departure in May 2026. Letterman described the announcement as “pure cowardice.”","summary":"Jamie McCarthy / Jamie McCarthy/WireImage for Rock and Roll Hall of FameDavid Letterman, 78, tore into the network he called home for 22 years.\n\nThe “mentality that drove the integrity of CBS News has been trampled on, p---ed on and eviscerated by these idiots that have taken it over,” Letterman said new video posted Friday.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/obsessed/david-letterman-eviscerates-idiots-at-cbs-news/","image":"https://www.thedailybeast.com/resizer/v2/BNQUGVCCTNA6TOPIH4RMZHF334.jpg?smart=true&auth=d86ebaefb70f3e370ea1c86de6beb8f5071f6e8e8a3598596c754a26cf8f1e0d&width=1440&height=1080","video":null,"publish_date":"2026-01-09 20:17:00","author":"Owen Mason-Hill","authors":["Owen Mason-Hill"],"language":"en","source_country":"us","sentiment":-0.068},{"id":392069952,"title":"In reelection launch, Josh Shapiro admits violent attack almost drove him from race","text":"The crowd was loud and enthusiastic, packed with local figures such as newly sworn-in Pittsburgh Mayor Cory O’Connor and labor leaders, including Darrin Kelly of the Allegheny-Fayette Labor Council, alongside scores of trade and union workers filling the cavernous hall.\n\nVisually, the rollout differed from Shapiro’s 2022 kickoff along the river in Johnstown. Substantively, however, it was familiar: a message rooted in the importance of place.\n\nIn an exclusive interview with the Washington Examiner after the speech, before departing for his Philadelphia announcement, Shapiro summed it up simply: different location, same goal — ensuring every community in Pennsylvania gets a fair shot.\n\n“I wanted to be focused here in the union hall on those who I believe are going to make up the power of the next generation of workers in Pennsylvania,” he said of the trade union members who are already working on shovel-ready energy projects in the region.\n\n“If we don’t invest in skills-based labor, we’re not going to have as bright a future in our commonwealth,” he said. “And so that’s why I’m here today, focused on what I think is the ability to help every Pennsylvanian chart their own course and achieve success. And so much of that runs through halls like this one.”\n\nBefore Shapiro took to the stage, one of the people who stepped up ahead of him was a man who goes by “Tim O”, a 52-year-old father who is on his second career and his second year in a carpentry apprenticeship. Tim became choked up when he said, “I don’t look like other apprentices.”\n\nShapiro said Tim was an example of his administration’s investment in trade programs in a state where over 60% of the population did not attend college and that it was important to give him a platform.\n\n“One of the things I always ask the apprentices is, ‘Hey, how’d you get here? What brought you here? What was your journey?’ Some of them come right out of high school, and we want to create those pathways,” Shapiro explained of the variety of answers he has received over the years. “Some of them go to college for a year, realize it’s not for them. Some of them have different careers and then find their ways here.”\n\n“The key is opening up the doors to places like this and showing people it exists because we need people like Tim O., who, even at 52 to dedicate their lives to having the skills we need to produce more energy, to quite literally build bridges and build buildings,” Shapiro said.\n\nThe speech was filled with stories highlighting accomplishments, future goals, and governing with purpose, and included a brief swipe at the bipartisan chaos in Washington. Notably, Shapiro avoided inflammatory language, steering clear of demonizing Republicans or President Donald Trump.\n\nAnd he uses the word “we” instead of “I” when discussing accomplishments, something many politicians cannot find a way to do.\n\n“I obviously have profound differences from the president. You have written about that,” he said. “No one expects us to agree on everything. But to me, vilifying others, attacking others, is not a way to bring people together and get stuff done.”\n\nShapiro, who has a good relationship with Sen. Dave McCormick (R-PA), said his job is to champion the things people can do together for the commonwealth.\n\n“My focus is on building bridges, creating more opportunity for folks to come together, and delivering results for people like Tim O. and others who need help,” he said. “And so, to me, I want this campaign to be hopeful. I want to highlight differences where we have different policy views, but I want to focus on uplifting people.”\n\nLarry Ceisler, a Washington County native and Philadelphia-based public affairs official, said the reason you do not see Shapiro go personal on Trump is that, first of all, that is always who he has been and, second, because he always wants his governance to be about purpose, not divisiveness.\n\n“He always tries to make it substantive and not personal because he never wants to be perceived as attacking the people who support the president, so when he does criticize, it is based on the issues,” Ceisler said.\n\nShapiro begins his launch with a formidable amount of cash. This week, his campaign announced he ended 2025 with over $30 million in cash on hand and a Quinnipiac University poll that showed Shapiro’s favorability rating at 58%.\n\nHe faces Republican Stacy Garrity, the state treasurer, who has won back-to-back races for that statewide elected office. Garrity said in a statement that “Josh Shapiro is more concerned with a promotion to Pennsylvania Avenue than serving hardworking Pennsylvanians.”\n\nShapiro’s governorship entered the national spotlight early, shaped by crisis decisions beginning in 2023, shortly after he took office, with the train derailment in East Palestine, Ohio, near the Pennsylvania border. The fiery wreck, visible for miles, was followed by a controlled burn that raised concerns across Beaver and Lawrence counties over toxic contamination in the air and water.\n\nThat was followed in June 2023 by a tanker truck crash beneath Interstate 95 in Philadelphia, a vital East Coast artery carrying more than 150,000 vehicles a day. The crash killed the driver and caused the overpass to collapse. Despite predictions that the highway could be closed for years, six temporary lanes reopened within two weeks, allowing traffic to move while permanent repairs were made.\n\nShapiro was also governor in July 2024 when gunman Thomas Crooks attempted to assassinate Trump, killing local fire chief Cory Comperatore and wounding two others. Shapiro was on the scene in Butler the following morning with first responders and investigators. He was in office as well when Luigi Mangione was arrested in Altoona for the alleged killing of UnitedHealthcare CEO Brian Thompson, and when three police officers were murdered in York County in the deadliest day for Pennsylvania law enforcement in 16 years.\n\nDuring that period, Shapiro was also on the short list of possible running mates for 2024 Democratic presidential nominee Kamala Harris, before ultimately determining the role was not the right fit.\n\nLast year, an arsonist attempted to kill Shapiro and his family by firebombing the governor’s residence, setting the home ablaze, and causing extensive damage. Shapiro, his wife, their children, and other family members narrowly escaped the rapidly spreading flames.\n\nShapiro has said the attack prompted serious conversations with his wife about whether he should seek reelection.\n\n“I think a couple of days after that, my primary focus was on being a good dad and a good husband and being a good governor. And I have tried very, very hard to both heal myself and be there for my kids as they work through this and be there for Laurie,” he said of his wife, who was with him at the beginning of the interview.\n\nShapiro admits there were many family discussions on what they should do.\n\n“We had a long talk about whether we wanted to keep doing this in the face of that kind of attack and that kind of threat,” he said. “The reality is we all ended up in the exact same place. Yes, we not only have to keep governing, but we’ve got to run again and keep doing this because you can’t let those who want to inflict pain on others bring harm to communities. You can’t let them win.”\n\nShapiro said he expects to continue working through the aftermath for years, noting that members of both parties privately reached out to check on his well-being and offer help, including Trump, who was himself the target of an assassination attempt.\n\n“He called, and I appreciated that,” he said. “And we talked about his brush with death in public. No public officials should have to go through this. Our politics shouldn’t be this way.”\n\nShapiro said he hopes the way he runs his campaign and governs will help lower the temperature and allow for a measure of healing.\n\n“I said today in my speech, go talk to that person that voted a different way in the last election and have a respectful conversation,” Shapiro said. “We need more of that.”","summary":"COLLIER TOWNSHIP, Pennsylvania — Gov. Josh Shapiro (D-PA) launched his reelection bid in western Pennsylvania on Thursday, highlighting his accomplishments since taking office in 2023 and outlining his goals for a second term. Despite noting that Republicans and independents were present in the packed carpenters union hall, the only boos came when Shapiro mentioned his [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/4413057/reelection-launch-shapiro-admits-violent-attack-almost-drove-him-from-race/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2026/01/Screenshot-2026-01-09-at-1.58.32-PM-e1767989159594.png?w=696","video":null,"publish_date":"2026-01-09 20:02:18","author":"Salena Zito","authors":["Salena Zito"],"language":"en","category":"politics","source_country":"us","sentiment":0.197},{"id":392088452,"title":"'They're trying to break us': Trump's focus on Minnesota boils over with ICE shooting","text":"Two days before Christmas, with federal agents ramping up immigration arrests in Minnesota, Minneapolis Mayor Jacob Frey stepped to a microphone and issued a warning. “I am increasingly concerned because of the chaos that is being caused by these ICE agents,” Frey said. “Somebody is going to get seriously injured or killed.” Two weeks later, with some 2,000 federal agents — more than three times the number of police officers employed by the Minneapolis Police Department — deployed to the state, that very thing happened. A federal immigration officer fatally shot Renee Nicole Good, a 37-year-old mother and U.S. citizen, on Wednesday, unleashing a national furor, pitting federal and local officials against each other and drawing thousands of people to the streets in protest. Wednesday’s deadly confrontation was the culmination of weeks of intensified scrutiny, verbal attacks and even conspiracy theories directed at Minnesota and Gov. Tim Walz by President Donald Trump, his administration and his allies. Exactly why the president has been so fixated on Minnesota isn’t totally clear, though local officials and strategists working in state and national politics have pointed NBC News to Trump’s long-running — and unsuccessful — attempts to win the state and his personal disdain for Walz. Many said it’s a case of Trump going after deep-blue cities in part due to their immigration policies. A central focus of the administration’s attacks on Minnesota has also been the Justice Department’s yearslong fraud investigation that has involved some members of Minnesota’s Somali community. In 2022, during President Joe Biden’s administration, federal prosecutors announced initial indictments in what they called a $250 million scheme to defraud a federal child nutrition program. They described Aimee Bock, who is white, as the mastermind of the operation. A jury convicted her in March. So far, prosecutors have charged 92 people and dozens have been convicted. But conservative influencers have latched onto the scandal to push unsubstantiated claims, and Trump has used it to make disparaging remarks about people of Somali descent. For Minnesotans, the result of all this attention has largely been disgust, fury and exhaustion. “They’re trying to break us,” said Democratic state Rep. Emma Greenman, whose district is roughly a mile from where the shooting occurred. She said she believes the administration targeted the state because it is “a successful story of multiracial democracy and immigration — and it inherently represents a threat to authoritarian power.” White House press secretary Karoline Leavitt told NBC News that Trump “loves Minnesota and the people.” “It’s a state where he received historic Republican support, and he has long called out Walz for his incompetence and terrible leadership.” “I wish they would just leave us the f--- alone,” Democratic Sen. Tina Smith of Minnesota told NBC News on Wednesday. Asked why Trump was so fixated on the state, Smith replied, “I wish I knew.” 'He's never gotten Walz' Trump has called Walz “corrupt,” “whacked out” and “grossly incompetent.” On Saturday, the president shared a video on social media that promoted a conspiracy theory about a Democratic lawmaker in the state who, along with her husband, was assassinated in June. The video falsely implied that Walz had something to do with the killing. Trump has also repeatedly made derogatory comments in recent weeks about Somali immigrants in Minnesota, calling them “scammers” and “lowlifes.” While the fraud investigation into the use of federal social services funds in Minnesota has received bipartisan support in the past, Somali Americans who run child care facilities, which have been the subject of fresh allegations in the scandal, in the state say they’ve been harassed and threatened since a conservative influencer’s lengthy video on the issue went viral. Many Democrats in the state have acknowledged that its party leaders have mishandled the situation politically as well. A state audit report released in 2024 found that failures by the state’s Education Department led to the misuse of the Covid-era program. On Monday, Walz made the surprise announcement that he would no longer be running for re-election amid the scrutiny and pressure. A former senior White House official who, like others in this article, was granted anonymity to speak candidly, said Trump has long been mystified by why then-Vice President Kamala Harris chose Walz as her running mate in 2024. “He’s never gotten Walz. Never gotten it,” the official said, saying Trump and his team believed someone like Pennsylvania Gov. Josh Shapiro would have been a stronger choice. For some in Minnesota, what made Good’s shooting especially tragic was that they saw something like it coming. Bringing in federal agents, against the wishes of the state’s political leaders — and many of its residents — was a bomb waiting to go off, Frey and Walz said Wednesday. “What we’re seeing is the consequences of governance designed to generate fear, headlines and conflict. It’s governing by reality TV, and today that recklessness cost someone their life,” Walz said in a news conference. “Now we hear more political rhetoric. Enough. Enough is enough.” Frey called the incident “totally predictable” and “totally avoidable” and told Immigration and Customs Enforcement to “get the f--- out” of Minneapolis. On Fox News on Wednesday night, Vice President JD Vance declared that Walz should resign. He also made an admission. “Look, I’ve beaten up on Tim Walz enough. I don’t want to do it anymore on your program,” Vance said. “I almost feel bad for the guy, except for the fact that he should have seen this,” he said, referring to the fraud allegations. On Thursday, however, Vance joined Leavitt at the press briefing, where he again went after Walz. “Tim Walz is a joke,” he said. “His entire administration has been a joke, the idea that he’s some sort of freedom fighter. He’s not. He’s a guy who has enabled fraud, and maybe, in fact, has participated in fraud.” There is no evidence that Walz participated in alleged fraud. Leavitt also said the administration wouldn’t be taking its eye off Minnesota. “The Department of Homeland Security will continue to operate on the ground in Minnesota, not only to remove criminal illegal aliens, but also to continue conducting door-to-door investigations of the rampant fraud that has taken place in the state under the failed and corrupt leadership of Democrat Gov. Tim Walz,” she announced. Tensions, years in the making Trump’s focus on Minnesota can be traced to 2016, when he first toppled the so-called blue wall and won Wisconsin, Michigan and Pennsylvania — and saw Minnesota as potentially within reach. Republicans have not won Minnesota in a presidential election since 1972. In the view of one Democratic strategist who has worked in Minnesota, “the Trump folks thought if they squeezed Minnesota, they could turn it red.” Preya Samsundar, a Minnesota-based Republican strategist, noted Trump’s long-held goal of turning the state red and described the president’s attention and effort as a “poke in the eye” to Walz. “I think for a lot of folks, Minnesota is still one of those states that can be attainable with the right effort,” said Samsundar, a former Midwest regional communications director for the Republican National Committee. “I think now a part of the White House’s focus is because Tim Walz was a VP candidate from a state that Trump has wanted to flip for some while.” Until abandoning his campaign for a third term, Walz had been positioning himself as one of the Democratic Party’s future leaders, “making him a convenient person to go after,” Samsundar added. Indeed, Trump’s criticism of Walz intensified after Harris chose him as her running mate. Trump frequently assailed Walz as a “dangerously liberal extremist.” Walz, for his part, emerged as the Democratic ticket’s chief attack dog against Trump, further attracting his ire. After Trump won, he and his allies lumped Minnesota in with other Democratic states that, he said, weren’t aggressive enough on immigration. Minnesota is home to the nation’s largest Somali population, and most of them are U.S. citizens. Since 1993, thousands of people have fled war and instability in the East African country. As Trump has ramped up ICE actions across the U.S., the community, mostly based in the Twin Cities, has been the target of the agency’s efforts in Minnesota. And Walz hasn’t held his tongue regarding ICE, slamming it last year as Trump’s “modern-day Gestapo.” On Wednesday, Illinois Gov. JB Pritzker, a longtime Walz ally, called the governor to remind him to keep in mind what he was dealing with: a Trump administration that lies, according to a person with knowledge of the conversation. Pritzker also reupped a playbook he had shared in the past with Walz and other Democratic governors, which was to repeatedly remind his state’s residents that it was their right to protest the government but not to “take the bait” and descend into violence. That was, Pritzker believed, exactly what the Trump administration wanted so it could declare martial law. Later Wednesday, Walz conveyed that to his residents, imploring them not to “take the bait.” “They want a show,” Walz said at his news conference. “We can’t give it to them.” Unfolding fraud allegations Meanwhile, a broad fraud scandal has been unfolding in the state involving the alleged misuse of hundreds of millions of dollars in federal welfare funds. The allegations pertain largely to the Somali community. Trump has repeatedly said the Somali community has “destroyed Minnesota“ and “our country,” and his Justice Department is sending additional federal prosecutors to the state to assist the U.S. attorney’s office there with the ongoing investigations into the matter. Republicans in the state and at the national level have blamed Walz for not taking the allegations seriously. “The fraud is a powerful issue because it’s a real-life example of what the majority of Republicans and independents already feel is true — that their tax dollars are wasted by politicians and people taking advantage of the system,” said Matt Wolking, a longtime GOP strategist who was on Trump’s 2020 campaign. A state Democratic lawmaker, however, said the Republican attacks all feel “very personal.” “Donald Trump has vendettas — he goes after people. Clearly that’s a piece of this,” the person said. “The city is emotionally fatigued,” added Roy Temple, a national Democratic operative with decades of experience in Minnesota politics, who said that, even six years later, the city is “still healing” from the George Floyd murder and fallout. “People’s nerves are pretty shot,” Temple said, adding that the ICE raids and the fatal shooting are “triggering.” Complicating part of the picture, however, is the scope and potential severity of the allegations of fraud. Other Democrats in the state agreed with the sentiment that Trump was unfairly attacking many elements of Walz’s record and dumping on the Somali community — while also acknowledging the possibility that Walz hasn’t handled the situation well. “This has been in the air in Minnesota for some time; it’s one of those things that we knew at some point this issue would really kind of percolate to the top. And we’re seeing that happen now, where a spotlight is put on this — for multiple reasons,” a Minneapolis-based Democratic operative said. The operative added that Walz’s “biggest problem” with the fraud allegations was that “he just didn’t really have any good answers for any of this.” At a separate hearing in Congress this week on the Minnesota fraud issue, Democrats fumed about the hypocrisy of Trump administration officials who, while complaining about fraud and ICE protests in Democratic areas, pardoned fraudsters aligned with the president as well as those convicted of violence against federal officers on Jan. 6, 2021. Republicans in the state largely defended Trump’s message — though not necessarily his tone — expressing solidarity with efforts to unroot fraud and tackle immigration enforcement. “The national attention that the president has brought to Minnesota means that people are listening now,” state GOP Chair Alex Plechash said.","summary":"President Donald Trump and his allies have for weeks intensified scrutiny on Minnesota and its governor, Democrat Tim Walz.","url":"https://www.nbcnews.com/politics/donald-trump/trumps-focus-minnesota-ice-shooting-rcna252826","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2026-01/260107-tim-walz-vl-1220p-8bc968.jpg","video":null,"publish_date":"2026-01-09 19:26:10","author":"Adam Edelman,Natasha Korecki","authors":["Adam Edelman","Natasha Korecki"],"language":"en","category":"politics","source_country":"na","sentiment":-0.523},{"id":392147036,"title":"Jesse Ventura calls Trump 'coward,' says he's 'owed' another governor term","text":"In the wake of a deadly shooting by an immigration agent in his home state, former Minnesota Gov. Jesse Ventura slammed President Donald Trump and hinted at another run for office.\n\n“(Trump is) the draft-dodging coward who, when it was his time to serve his country, he did what all rich white boys did. I wasn’t a rich white boy. We had to go,\" Ventura, 74, told local reporters Jan. 8 when asked for his response to the shooting of Renee Nicole Good by a federal immigration agent in Minneapolis. \"He’s gonna tell me what courage is?\"\n\nGood's death, captured on video by witnesses, sparked protests and condemnation from local and state officials who refuted the Trump administration's assertion that the agent acted in self-defense.\n\nMinneapolis shooting 'did not have to happen,' Ventura says\n\n“What occurred yesterday did not have to happen,\" Ventura told reporters, calling Good's shooting a \"tragedy\" and a \"murder.\"\n\n\"We're a third-world country now,\" said Ventura, the WWE pro wrestling hall of famer who was Minnesota's governor from 1999 to 2003. \"You wanna know why? I'm an expert. I've been there. I spent 17 months in Southeast Asia while the draft dodger was playing golf.\"\n\nVentura is a former Navy SEAL and Vietnam veteran. Trump was a member of the generation eligible to be drafted for the Vietnam War, but did not serve after receiving several student draft deferments and a medical exemption.\n\nSome lawmakers have called for the arrest of the agent in the Minneapolis shooting, identified in court documents Jonathan Ross. A day after the shooting of Good, two people were injured on in a separate shooting involving federal agents in Portland, Oregon.\n\nThe shootings have highlighted growing tensions between the Trump administration's aggressive campaign to deport unauthorized immigrants and local leaders opposed to it.\n\n“Freedom is not arresting people without warrants,\" Ventura said. “We have a system here. It’s called a Constitution, and we have a party, the Republicans, who don’t seem to want to abide by the Constitution.”\n\nUSA TODAY has reached out to the White House regarding Ventura's comments.\n\n'Maybe it's time for Jesse' after Walz drops reelection bid\n\nVentura's comments come just days after Minnesota Gov. Tim Walz announced he would not run for a third term.\n\nWalz, who was the Democratic nominee for vice president on Kamala Harris' 2024 campaign, dropped his reelection bid amid mounting pressure over allegations of fraud in the state's social services programs.\n\n\"Maybe it's time for Jesse. I only did one term. I'm owed a second,\" Ventura said.\n\nNatalie Neysa Alund is a senior reporter for USA TODAY. Reach her at nalund@usatoday.com and follow her on X @nataliealund.","url":"https://eu.usatoday.com/story/news/politics/2026/01/09/jesse-ventura-trump-minnesota-governor-ice/88098645007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/09/USAT/88099107007-20240206-t-081937-z-883103856-rc-2-rw-5-afkber-rtrmadp-3-usapoliticsarizona.JPG?auto=webp&crop=4564,2568,x0,y456&format=pjpg&width=1200","video":null,"publish_date":"2026-01-09 17:11:05","author":"Usa Today","authors":["Usa Today"],"language":"en","category":"politics","source_country":"us","sentiment":-0.51},{"id":392045154,"title":"‘Going to start hitting land’: Donald Trump threatens military action against drug cartels in Mexico","text":"Days after the United States carried out an operation in Venezuela, capturing the country’s president, Nicolas Maduro, who Washington accused of leading a drug cartel, President Donald Trump has warned of a similar military action in neighbouring Mexico. \"We’ve knocked out 97% of the drugs coming in by water, and we are going to start now hitting land with regard to the cartels,\" Trump told Fox News. BREAKING: Trump implies that he’s going to start bombing Mexico. “We are gonna start hitting LAND with regard to the cartels. The cartels are running Mexico”Someone get me out of this nightmare. Imagine how much more peaceful a world this would be if Kamala Harris had won… pic.twitter.com/ogh58RHJaT— Brian Krassenstein (@krassenstein) January 9, 2026 Since September 2025, the Trump administration has killed at least 115 people in more than 30 strikes on alleged drug-transporting boats in the Caribbean and the Pacific. Drug trafficking through US-Mexico border The US and Mexico share a border of around 3,145 kilometres, stretching from the Pacific Ocean to the Gulf of Mexico. Successive US governments have long accused their counterparts in Mexico of failing to crack down on the cartels smuggling drugs across the border. Shoppers and commuters walk through the Tacubaya open-air market in Mexico City, Wednesday, Jan. 7, 2026. (AP Photo/Marco Ugarte) Throughout his three presidential campaigns, Trump had made stopping the flow of illegal immigrants and drugs to the US from Mexico, one of his key promises. US sanctions Mexican cartels In February 2025, the US State Department had designated several major Mexican criminal organizations, including Sinaloa Cartel, Cártel de Jalisco Nueva Generación, Cártel del Noreste, La Nueva Familia Michoacana, Cártel del Golfo and Carteles Unidos as Foreign Terrorist Organizations and Specially Designated Global Terrorists. also read After Venezuela, alarm bells in Mexico, Colombia, Cuba: What’s behind Trump’s latest threats? 'Cartels are running Mexico' On Thursday, Trump said Mexico was being run by the cartels. “The cartels are running Mexico—it’s very, very sad to watch, and see what’s happened to that country,” he said. Mexican President responds Responding to Trump’s comments, Mexican President Claudia Sheinbaum said that she has asked her foreign affairs secretary to reach out directly to Secretary of State Marco Rubio or the US President himself. FILE - Mexican President Claudia Sheinbaum presents a new security strategy against violence for Michoacan state, at the National Palace, in Mexico City, Nov. 9, 2025. (AP Photo/Claudia Rosel, File) Sheinbaum also downplayed the remarks, saying “it is part of his way of communicating.” She said she asked her Foreign Affairs Secretary, Juan Ramón de la Fuente, to strengthen coordination with the US. Sheinbaum has repeatedly rebuffed Trump’s offer to send US troops after Mexican drug cartels. She has insisted that there will be no violation of Mexico’s sovereignty, but the two governments will continue to collaborate closely.","url":"https://indianexpress.com/article/world/donald-trump-threatens-military-action-against-drug-cartels-in-mexico-10464907/","image":"https://images.indianexpress.com/2023/04/Trump_1600.jpg","video":null,"publish_date":"2026-01-09 16:29:26","author":"Express Web Desk","authors":["Express Web Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.168},{"id":392147056,"title":"ICE shooting live updates: New video emerges, Renee Good's wife speaks out","text":"Tensions remained high on Friday as two separate shootings involving immigration agents in Minneapolis and Portland, Oregon, drew protesters to the streets and deepened fractures between federal and state officials.\n\nVice President JD Vance shared footage on social media that appeared to show a new perspective on the fatal ICE shooting of Renee Nicole Good in Minneapolis, saying the officer acted in self defense, while criticizing \"media dishonesty\" over the incident.\n\nVideo analysis shows how fatal ICE shooting in Minneapolis unfolded\n\nProsecutors in Minneapolis announced efforts to independently investigate the death of Good, a 37-year-old mother of three, and asked for the public's help in acquiring evidence. The move comes after Minnesota state investigators said the FBI blocked local authorities from case materials.\n\n\"We in Minneapolis want a fair investigation,” Mayor Jacob Frey said at a news conference. “If you have nothing to hide, then don't hide from it.\"\n\nMore: Video analysis shows how fatal ICE shooting in Minneapolis unfolded\n\nGood's wife, Rebecca Good, released a statement describing her partner as a dedicated Christian who had \"stopped to support our neighbors\" before she was fatally shot. \"We had whistles. They had guns,\" Rebecca Good said. The agent involved has been identified as Jonathan Ross, a U.S. Army veteran and former Border Patrol agent, newly released documents show.\n\nPresident Donald Trump and Homeland Security Secretary Kristi Noem have said Renee Good struck an ICE agent with her car before she was shot. State officials dispute those claims.\n\nIn Portland, tensions flared after a Border Patrol officer shot and wounded two people on Thursday. Federal officials described the victims as undocumented immigrants with ties to the Venezuelan gang Tren de Aragua. Local prosecutors said they launched an investigation and the mayor demanded that federal agents leave Portland.\n\nMore: Agents have killed 4 people since Trump boosted migrant enforcement\n\nMore: ICE officer in shooting was Iraq vet, ex-Border Patrol\n\nHow many weekend ICE protests?\n\nMore than 1,000 anti-ICE protests are scheduled nationwide for Saturday, Jan. 10 and Sunday, Jan. 11 following the shooting death of Renee Nicole Good in Minneapolis.\n\n\"There's widespread anger right now. It's organic,\" said Ezra Levin, cofounder of the progressive group Indivisible, which helps organize rallies and train local activists.\n\n−Sarah D. Wire\n\nMore: Where are ICE protests taking place this weekend? Here's what to know\n\nTrump defends FBI's Minneapolis freeze-out, citing election claims\n\nPresident Trump defended the FBI’s decision not to share evidence from the ICE shooting with Minnesota state officials during a question and answer session at the White House on Friday, July 9. \n\nTrump said normally he would support the FBI sharing evidence, but in this case, he said, \"They’re crooked officials.”\n\n“I mean, Minneapolis and Minnesota, what a beautiful place, but it’s being destroyed,” Trump said. “It’s got an incompetent governor, fool. I mean, he's a stupid person,” the president continued.\n\nTrump then pivoted to false claims that he won Minnesota in the last three presidential elections. “It’s a corrupt state, a corrupt voting state, and the Republicans ought to get smart and demand on voter ID,” he said. “They ought to demand maybe same day voting and all of the other things that you have to have the safe election.”\n\n“I won Minnesota three times and I didn’t get credit for it. I did so well in that state,” Trump said. Trump lost Minnesota his Democratic opponents in 2016 to Hillary Clinton; to Joe Biden in 2020; and to Kamala Harris in 2024.\n\n−Dinah Pulver\n\nVance says new video proves ICE agent fired in self defense\n\nVice President JD Vance continued to show his support for the ICE agent who fatally shot a woman in Minneapolis, sharing footage on social media that appears to show a new perspective of the deadly interaction.\n\nVance reposted the clip multiple times on X, formerly known as Twitter, Jan. 9. He again said that the officer acted in self defense and criticized \"media dishonesty\" about the incident.\n\n\"Many of you have been told this law enforcement officer wasn't hit by a car, wasn't being harassed, and murdered an innocent woman,\" Vance wrote. \"The reality is that his life was endangered and he fired in self defense.\"\n\n−N'Dea Yancey-Bragg and Nick Penzenstadler\n\nMore: Vance uses new ICE shooting video to defend agent in Minnesota killing\n\nJesse Venutra slams Trump over ICE shooting of Renee Good\n\nIn the wake of a deadly shooting by an immigration agent in his home state, former Minnesota Gov. Jesse Ventura and slammed President Trump and hinted at another run for office.\n\nVentura called Trump \"the draft-dodging coward who, when it was his time to serve his country, he did what all rich white boys did. I wasn’t a rich white boy. We had to go,\" Ventura, 74, a Vietnam veteran and former Navy SEAL, told local reporters Jan. 8 when asked about the shooting of Renee Nicole Good. \"He’s gonna tell me what courage is?\"\n\n“What occurred yesterday did not have to happen,\" Ventura told reporters, calling Good's shooting a \"tragedy\" and a \"murder.\"\n\n\"We're a third-world country now,\" said Ventura, the WWE pro wrestling hall of famer who was Minnesota governor from 1999 to 2003. \"You wanna know why? I'm an expert. I've been there. I spent 17 months in Southeast Asia while the draft dodger was playing golf.\"\n\n--Natalie Neysa Alund\n\nMore: Jesse Ventura calls Trump 'coward,' says he's 'owed' another governor term\n\n'We had whistles. They had guns.' Renee Good's wife speaks out\n\nRebecca Good, the wife of Renee Good, released a statement on Friday, calling her partner \"pure joy\" and describing what led up to the deadly incident.\n\n\"On Wednesday, January 7th, we stopped to support our neighbors. We had whistles. They had guns,\" Rebecca Good said in a statement, multiple news outlets reported, including the Washington Post and MPR News.\n\n\"Renee leaves behind three extraordinary children; the youngest is just six years old and already lost his father,\" the statement continued. \"I am now left to raise our son and to continue teaching him, as Renee believed, that there are people building a better world for him. That the people who did this had fear and anger in their hearts, and we need to show them a better way.\"\n\n'Protest safely,' fire chief warns\n\nIn Minneapolis, Deputy Fire Chief Colm Black addressed a group of at least 30 protesters near the site where Good was killed.\n\n“Please protest safely, and please look out for each other, and remember this is our city. We don't want to ever have a repeat of what we had before,” Colm said. There were at least 50 police officers present on Friday afternoon.\n\n--Corey Schmidt, St. Cloud Times\n\nProsecutors launch evidence portal for ICE shooting probe\n\nMinnesota prosecutors launched an online portal for residents to submit evidence related to the shooting in Minneapolis, vowing to probe the incident despite the FBI withholding evidence from local and state authorities.\n\nThe Hennepin County Attorney’s Office and Minnesota Attorney General’s Office launched a webpage where residents and witnesses can submit evidence related to the investigation.\n\n\"After the FBI rescinded its cooperation agreement with the Minnesota Bureau of Criminal Apprehension, the HCAO and the MNAGO were in constant contact to determine a path forward that ensured necessary transparency for Minnesotans,\" said a statement on the website of the Hennepin County Attorney’s Office.\n\nAuthorities install barriers outside federal building\n\nMinneapolis protesters are expected to gather at 1 p.m. CT Saturday on the city's southside. They will meet at the northwest corner of Powderhorn Park, near the shooting site.\n\nConcrete barriers were put up outside the federal building in Minneapolis Jan. 9 where ICE and Border Patrol regularly meet, according to NewsNation.\n\n– Sarah D. Wire\n\nTreasury announces new initiatives targeting fraud in Minnesota\n\nU.S. Treasury Secretary Scott Bessent announced new initiatives targeting fraudsters in Minnesota on Friday which he said will be the “genesis for a national rollout.”\n\nThe announcement comes amid a deepening fraud scandal that's enveloped state and national politics. Federal prosecutors say billions of dollars have been bilked from government-backed social programs in Minnesota since the pandemic. The DOJ has charged more than 80 people in the scandal, many of them U.S. citizens of Somali descent.\n\nBessent said the Treasury Department has notified four money service businesses in the greater Minneapolis-St. Paul area, which may have transferred taxpayer funds out of the U.S., that they are under investigation. Bessent said the department is specifically investigating money sent to Somalia.\n\nBessent said the IRS is also auditing financial institutions in Minnesota that facilitated money laundering and will launch a task force to investigate organizations implicated in sprawling fraud schemes. “Treasury will deploy all tools, all tools, to bring an end to this egregious, unchecked fraud and hold perpetrators to account,” Bessent said.\n\n– N'dea yancey-Bragg\n\nMinneapolis Mayor Jacob Frey remains defiant\n\nFrey has received criticism from Republicans over what they've described as inflammatory comments in the wake of the Minneapolis ICE shooting.\n\nAt a Friday news conference, Frey dug in further, saying he stands by his earlier statements refuting the Trump administration's description of the shooting.\n\n\"What I said was it was a reckless abuse of power. Yes, it was a reckless abuse of power,\" Frey said, speaking about the deadly incident. \"I said that the narrative the administration was pushing in the immediacy following this shooting was garbage and false and BS. It was.”\n\nDHS identifies two people shot by Border Patrol agent in Portland\n\nThe Department of Homeland Security on Friday identified the two people shot by a Border Patrol agent in Portland.\n\nThe driver of the vehicle was Luis David Nico Moncada, who DHS described as a suspected \"Tren de Aragua gang member.\" The agency said he entered the U.S. in 2022 and has previously faced charges for drunk driving and unauthorized use of a vehicle.\n\nThe passenger, who was the target of the traffic stop that led to the shooting, was identified as Yorlenys Betzabeth Zambrano-Contreras. DHS described her as an undocumented immigrant from Venezuela who \"played an active role in a Tren de Aragua prostitution ring and is connected to a recent shooting in Portland.\"\n\nBoth Moncada and Zambrano-Contreras remained in the hospital. They will be released into FBI custody, DHS said.\n\nWhat we know about investigations into Portland, Minneapolis shootings\n\nOregon Attorney General Dan Rayfield said the state's Department of Justice is investigating the shooting in Portland involving a Border Patrol agent.\n\nRayfield said the investigation will probe whether \"any federal officer acted outside the scope of their lawful authority.\" Cases may be referred to the Multnomah County district attorney if evidence of criminal conduct is found, Rayfield added.\n\nIn Minneapolis, the state said it was forced to withdraw from an investigation after federal authorities blocked them from accessing evidence. State and local officials in Minnesota have pressed for an independent investigation into the ICE agent's use of deadly force, raising concerns about the integrity of a federal probe.\n\nUse of force experts analyze footage of Minneapolis shooting\n\nSeveral criminal justice experts viewed the footage of the Minneapolis shooting, which the Trump administration described as self-defense and state officials called a reckless abuse of power.\n\nDiane Goldstein, a former police lieutenant and executive director of the nonprofit Law Enforcement Action Partnership, described the agent’s tactics in Minneapolis as \"horrible\" and “aggressive.”\n\n“Law enforcement policy should always be about using the least amount of force and preserving people’s lives,” Goldstein told USA TODAY. She added that the footage suggests “a lack of training and a lack of understanding of what other tactics are available to de-escalate these types of situations.”\n\nGeoffrey Alpert, a professor of criminology at the University of South Carolina, said a full investigation is needed, but said the video appears to contradict the Trump administration's description of the incident. “It clearly looks like she was driving away,” Alpert said. “She turned her wheel and looked like she was trying to escape.”\n\nMore: Was ICE agent's use of force reckless? Experts analyze Minneapolis shooting.\n\nProtests intensify after shootings by immigration agents\n\nIn the aftermath of two shootings involving immigration agents, protesters on Thursday took to the streets to oppose the federal intervention.\n\nA demonstration was held at an ICE facility in the South Portland neighborhood, which has been a consistent site for protests since last summer. The Portland Police Bureau said its officers arrested six people on suspicion of disorderly conduct and other charges.\n\nIn Minneapolis, thousands gathered for a second night of protests. The demonstrations were largely peaceful, but tensions occasionally flared, leading federal agents to use pepper spray and tear gas.\n\n‘People need to quit demonstrating’\n\nTexas Republican Rep. Roger Williams told NewsMax Friday that clashes will continue as long as Americans keep challenging immigration officials.\n\n“We need to see some improvement in the fact that people need to quit demonstrating, quit yelling at law enforcement, challenging law enforcement, and begin to get civil,\" he said. \"And until we do that, I guess we’re going to have it this way and the people that are staying in their homes, are doing the right thing, need to be protected.”\n\n–Sarah D. Wire\n\nWalz declares Friday 'Day of Unity' to honor Renee Good\n\nMinnesota Gov. Tim Walz declared Friday a “Day of Unity” to honor Good. The governor asked Minnesotans and people across the country to observe a moment of silence at 10 a.m. to remember Good.\n\n“Now is a time to mourn together, in peace, unity, and service. People across Minnesota will peacefully stand up for shared American values,” Walz said in the proclamation.\n\nThe proclamation encouraged neighbors, families, and community members to \"care for one another in our time of grief.\" It also called on churches and faith organizations to open their doors, for community members to support local businesses, and Minnesotans to participate in acts of service for their communities.\n\n\"This is a moment for us to use our collective voice to stand for decency and democracy,\" Walz said.\n\nOregon senator calls for ICE to 'get the hell out'\n\nOregon state Senate Majority Leader Kayse Jama, D-Portland, echoed calls against Immigration and Customs Enforcement.\n\n\"We do not need you,\" Jama said during a news conference on Thursday evening. \"You’re not welcome here and you need to get the hell out of our community.\"\n\nJama’s message came after Minneapolis Mayor Jacob Frey gave fiery comments at a news conference after the fatal shooting of Good by immigration agents. State and local officials have demanded that federal authorities conduct a full and transparent investigation into the shooting.\n\nPortland Mayor Keith Wilson has called on ICE to halt all operations in the city until an investigation is completed.\n\n\"We know what the federal government says happened here,\" Wilson said at the news conference. \"There was a time when we could take them at their word. That time is long past.\"\n\nShooting in Oregon latest involving immigration agents\n\nThe shooting in Portland is just the latest involving federal agents carrying out Trump’s immigration enforcement around the country.\n\nOn Wednesday, Good was fatally shot by immigration agents in Minneapolis. Homeland Security Secretary Kristi Noem said Good \"weaponized\" her SUV to run over agents in an act of \"domestic terrorism.\" Local officials, citing video of the incident, vehemently disputed Noem’s account and called for the officer involved to be arrested.\n\nIn Maryland on Dec. 24, two people were wounded during an immigration enforcement action when the driver of the vehicle attempted to run over federal agents, according to federal officials. Agents at the scene shot the driver, and he crashed the vehicle. The passenger was wounded in the crash.\n\nSilverio Villegas-Gonzalez, a 38-year-old Mexican immigrant, was shot and killed by federal agents outside Chicago on Sept. 12. Homeland Security officials said the man resisted arrest and dragged an agent with his car. Video evidence from the scene shows the agent describing his wounds as \"nothing major.\" Villegas-Gonzalez’s lawyer and others have called for a full investigation into the shooting.\n\n– Michael Loria\n\nICE officer in shooting was Iraq vet, ex-Border Patrol\n\nThe federal immigration officer who shot and killed a woman in Minneapolis this week is a U.S. Army veteran with deployments to Iraq and years of experience, newly released records show.\n\nJonathan Ross, an Immigration and Customs Enforcement removal officer based in Minnesota, told a court about his career in December, during the criminal trial of a man who dragged Ross with a car, badly cutting Ross' arm and hand.\n\nRoss told the court he served in the Indiana National Guard and deployed from 2004 to 2005 to Iraq as a machine gunner on a gun truck and served on a combat logistical patrol team, delivering essential supplies in dangerous areas.\n\n– Nick Penzenstadler\n\nICE agent who fatally shot Minnesota woman identified\n\nThe immigration officer involved in this week's fatal shooting in Minneapolis is the same officer who was injured in June 2025 in another vehicle incident. He was identified in court documents as Immigration and Customs Enforcement's Jonathan Ross.\n\nOfficials declined to independently name Ross, but said he had at least 10 years of experience as an ICE officer and served on the agency's Special Response Team. Vice President JD Vance noted at the White House that this week's shooting incident echoed the agent's previous case that put him in the hospital.\n\n\"That very ICE officer nearly had his life ended, dragged by a car six months ago with 30 stitches in his leg, so he’s a little sensitive about being rammed by an automobile,\" Vance said at the White House on Thursday. The vice president did not directly name Ross at the briefing. Read more here.\n\n– Nick Penzenstadler","url":"https://eu.usatoday.com/story/news/nation/2026/01/09/minneapolis-ice-shooting-portland-oregon-live-updates/88095101007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/09/USAT/88105733007-20260109-t-190607-z-1884169689-rc-2-uxiam-25-y-0-rtrmadp-3-usatrumpminnesota.JPG?auto=webp&crop=5999,3375,x0,y313&format=pjpg&width=1200","video":null,"publish_date":"2026-01-09 11:35:29","author":"Usa Today","authors":["Usa Today"],"language":"en","source_country":"us","sentiment":-0.159},{"id":392093310,"title":"16 celebrities and reality TV stars who turned to politics from Trump to Katie Price","text":"Trisha Paytas‘ announcement that she intends to run for a seat in the US House of Representatives in her home state, California, has come as a surprise to many.\n\nAs someone put on X/Twitter on Tuesday (6 January): “Trisha Paytas announcing that she is running for the House of Representatives was not on my 2026 bingo card.”\n\nSince then, Spencer Pratt, a reality TV star, has announced his own political aspirations by launching a campaign to become the Mayor of Los Angeles.\n\nBut should we be surprised at this point? And even more so, should we doubt their ability to succeed? Have we also not learned from who’s in the White House (for a second time!).\n\nPaytas, Pratt, and even Donald Trump are hardly the first celebrities to turn to politics. Here’s a few more. \n\nTrisha Paytas\n\nThe YouTuber and podcast host announced her intention to run for the US House of Representatives in a video titled “2026 MANIFESTATIONS”. \n\nPosted on Tuesday, it sees Paytas enjoying a meal from the notoriously anti-LGBTQ+ food chain, Chick-fil-A, and explaining some of her thoughts.\n\nIn a TikTok video, also posted on Tuesday, Paytas added: “I never thought of myself as a political person until I started having kids and realising, like, the world could be just so disastrous.”\n\nOne thing she’s expressed an interest in doing is introducing a bill making sex work legal from the age of 25. \n\nSpencer Pratt\n\nStarting his reality TV career in the early 2000s with shows like The Princes of Malibu and The Hills, Pratt went on to feature in I’m A Celebrity… Get Me Out of Here and the UK’s Celebrity Big Brother. \n\nPratt announced his bid for LA Mayor on Wednesday (7 January) at an event organised by those who lost their homes in the 2025 Palisades Fire where Pratt and his wife, Heidi Montag, also live. \n\nThe BBC reported Pratt said: “Business as usual is a death sentence for Los Angeles.” He also said: “I’m done waiting for someone to take real action. That’s why I am running for mayor.”\n\nDonald Trump\n\nPerhaps the most well known celebrity to have entered politics (and succeeded, twice) is President Donald J. Trump. \n\nThe Celebrity Apprentice star first ran for the Presidency in 2016, defeating the Democratic candidate, Hillary Clinton.\n\nIt was a chaotic presidency with Trump taking many anti-LGBTQ+ actions. Thankfully it ended in 2020 when Joe Biden won the Presidency. \n\nSadly, Trump never went away and defeated Kamala Harris in 2024 to return to the White House a year ago. Need we say more…\n\nCynthia Nixon\n\nThe Sex and the City star announced her bid to run for the Governor of New York in March 2018. Quickly she was put down by a senior Democrat who described her as “an unqualified lesbian”.\n\nTaking a progressive stance, Nixon challenged Andrew Cuomo and could have been the state’s first out-gay governor.\n\nSadly, she wasn’t well supported by Democrats and LGBTQ+ groups including the Stonewall Democrats, the Democratic Party’s official LGBT caucus. \n\nShe ultimately lost the primary race to Cuomo but has remained a passionate advocate since. \n\nArnold Schwarzenegger \n\nFamous for roles such as The Terminator and Kindergarten Cop, few (if anyone) could have predicted that such a star would turn to politics at all. Though, this was pre-Trump.\n\nSchwarzenegger, a Republican, first ran for the Governor of California position in 2003, getting elected in a recall election. He was later re-elected in 2006.\n\nThroughout his time as Governor, Schwarzenegger called for more spending on US infrastructure as well as a deadline for the withdrawal of US troops from Iraq after the 2003 invasion. \n\nVolodymyr Zelenskyy\n\nFamously a comedian and broadcaster before he became the President of Ukraine, Volodymyr Zelenskyy also featured on Ukraine’s version of Dancing with the Stars, winning in 2006.\n\nZelenskyy also dubbed the voice of Paddington Bear for 2014’s Paddington and 2017’s Paddington 2. He also starred in the TV series Servant of the People in which he played a teacher who won the Ukrainian Presidential election.\n\nIn 2018 he announced he was running for the actual position of President, running on a platform of anti-establishment and inclusionary politics.\n\nIn 2019, he was elected with 73% of the vote, ousting Petro Poroshenko. He has since gone on to lead his country through Russia’s invasion. \n\nSuzy Eddie Izzard\n\nThe actor and comedian came out as trans in 1985 and is known for films such as Five Children and It, Dress to Kill, and Force Majeure.\n\nIn 2023, she put her name forward to be the Labour candidate for Brighton Pavilion at the 2024 general election. \n\nBut she was not selected, with the Mercury-Prize-winning musician Tom Gray contesting the seat for Labour instead. It was her second attempt after trying the same in Sheffield Central in 2022.\n\nPlacing second on American Idol in 2003 it would be another 11 years before Aiken tried his hand at politics. \n\nIn 2014, he ran for North Carolina’s second congressional district in the US House of Representatives. While he won the Democratic primary he was defeated by the Republican candidate, Renee Ellmers.\n\nAiken then tried running in another North Carolina district in 2022 but was defeated in the primary stage. He aimed to challenge White supremacy, racism and homophobia.\n\nDave Rowntree \n\nBlur’s drummer has run unsuccessfully for seats on Westminster City Council as well as to become the MP for the Cities of London and Westminster and Norwich South over the years. \n\nIn 2017 he was elected as a county councillor for the University ward of Norfolk County Council, which he left prior to the 2021 election.\n\nThen in 2024, the Blur band member was selected by Labour as the candidate for the Mid Sussex Parliamentary seat. He was beaten in the race by the Liberal Democrat candidate, Alison Bennett. \n\nRonald Reagan\n\nA former actor, Reagan‘s time as President is a painful one for the LGBTQ+ community given it’s remembered for a disastrously slow response to the HIV/AIDs crisis of the 1980s.\n\nReagan’s silence on the issue is considered to have led to the deaths of thousands of people across the US, including Reagan’s friend and Hollywood actor, Rock Hudson.\n\nIn 1982, when Reagan’s press secretary was asked if the president was tracking the spread of “the gay plague”, the room erupted in laughter as he replied: “I don’t have it, do you?”\n\nStacey Dash\n\nThe Clueless and CSI star and former Democrat announced her run as a Republican candidate for California’s 44th Congressional District in February 2018.\n\nIt was a short lived run however, as she exited the race a month later citing “overall bitterness surrounding our political process” and the rigours of campaigning as her reasons. \n\nKatie Price\n\nAt 23, Katie Price – aka Jordan – ran as an Independent MP for the Stretford and Urmston seat in the 2001 election with the campaign slogan: “For a Bigger and Betta Future.”\n\nSpeaking at an event in Old Trafford, the model said: “My policies are to make things fun. The election is boring. I’m here to spice things up,” as reported by the BBC.\n\nShe also promised free plastic surgery as well as cheap package holidays on the National Health Service… Ultimately, she only got 713 votes and lost the race.\n\nKanye ‘Ye’ West\n\nIn July 2020, West announced he intended to run in the Presidential election taking place that year. \n\nPreviously a Trump supporter, he ran independently as the Birthday Party. He explained to Forbes: “When we win, it’s everybody’s ‘birthday’.”\n\nPitching his America-first as well as faith-based run as a way to disrupt the two-party political system in the US, West failed to make much headway, only capturing 66,365 votes in the few states he was on the ballot for.\n\nWest also said he’d run in 2024 but it was confirmed in 2023 he was not.\n\nShirley Temple\n\nThe famed child actress entered politics in her late thirties with an unsuccessful run at becoming the representative of California’s 11th congressional district for the Republicans in 1967.\n\nWhile that didn’t work out for the iconic screen star, she later became a delegate to the United Nations General Assembly for President Nixon between 1969 and 1970. \n\nShe was then made the US Ambassador to Ghana between 1974 and 1976 by President Ford, before serving as the US Ambassador to Czechoslovakia under George H. W. Bush between 1989 and 1992.\n\nThe Harold & Kumar star, who came out publicly in 2021, joined President Obama’s administration in 2009. \n\nIn his role as Associate Director of the White House Office of Public Engagement and Intergovernmental Affairs, Penn worked as a liaison between Obama and Asian-American, as well as Pacific Islander communities.\n\nHe also served as a co-chair of Obama’s reelection campaign in 2012, later joining the President’s Committee on the Arts and Humanities. \n\nHe has since supported Hillary Clinton, Joe Biden, and Kamala Harris in their presidential elections, as well as Zohran Mamdani in his successful run at becoming New York’s Mayor.\n\nCaitlyn Jenner\n\nThe former Olympian and also reality TV star launched her campaign to be the governor of California in 2021 describing herself as a “compassionate disruptor”.\n\nThe Republican and Trump supporter finished in 13th place in the end, securing just one percent of the vote after a campaign in which she said trans girls shouldn’t be allowed to play in school sports teams that correspond with their gender identity.\n\nShare your thoughts! Let us know in the comments below, and remember to keep the conversation respectful.","summary":"Trisha Paytas&#8216; announcement that she intends to run for a seat in the US House of Representatives in her home state, California, has come as a surprise to many. As someone put on X/Twitter on Tuesday (6 January): &#8220;Trisha Paytas announcing that she is running for the House of Representatives was not on my 2026 [&#8230;]\n\n\nThe post 16 celebrities and reality TV stars who turned to politics from Trump to Katie Price appeared first on PinkNews | Latest lesbian, gay, bi and trans news | LGBTQ+ news.","url":"https://www.thepinknews.com/2026/01/09/16-celebrities-and-reality-tv-stars-who-turned-to-politics-from-trump-to-katie-price/","image":"https://www.thepinknews.com/wp-content/uploads/2026/01/k.jpg","video":null,"publish_date":"2026-01-09 09:50:43","author":"Alastair James","authors":["Alastair James"],"language":"en","source_country":"gb","sentiment":-0.133},{"id":392055006,"title":"Fentanyl smuggling into the U.S. fell during the Biden administration, study finds","text":"A MARTÍNEZ, HOST: \n\n A new study in the journal Science is raising questions about the way President Trump has framed the debate over fentanyl. Trump dismantled many of President Joe Biden's drug addiction policies. He says they were a failure. But researchers found fentanyl smuggling into the U.S. plunged under the Biden administration and overdose deaths also fell. NPR addiction correspondent Brian Mann is here. Brian, what does this new research say?\n\nBRIAN MANN, BYLINE: Well, A, this report really adds in fascinating ways to research showing the Biden administration made unprecedented progress, disrupting the illegal smuggling routes that were flooding U.S. communities with fentanyl. I spoke about this with Keith Humphreys. He's at Stanford University, one of the co-lead authors. And he says they studied fentanyl seizures. They found purity and potency dropped dramatically after 2023. And Humphreys' team of researchers also surveyed social media. They were looking for references to the fact that street supplies of the drug were drying up.\n\nKEITH HUMPHREYS: We start looking for shortage - the word shortage - or weaker. My fentanyl's not strong enough. I'm not getting high anymore - all these kinds of phrases. And there's an explosion, a 14-fold increase in the mention of these terms right when overdoses start dropping.\n\nMANN: And this paper in Science, A, found fentanyl deaths in Biden's final year in office dropped by more than a third from the peak in 2023. That kind of progress is just unheard of. And this paper builds on a lot of other research, as well as an analysis by the Drug Enforcement Administration that all show similar progress.\n\nMARTÍNEZ: How did the Biden administration do this?\n\nMANN: Yeah, it's pretty remarkable. When I first started reporting on fentanyl, A, most experts said stopping this drug or even slow [inaudible] significantly would be nearly impossible. That's because fentanyl is just easy to make from industrial chemicals. So drug policy experts I've been speaking to think Biden expanded health care and drug addiction treatment programs in ways that saved lives. And this new paper suggests Biden's team also convinced China to help curb the sale of so-called precursor chemicals that are needed to make fentanyl in ways that really hit the drug gangs hard. Again, here's Keith Humphreys.\n\nHUMPHREYS: Biden's people - the foreign policy people - can feel very proud that they made a positive impact.\n\nMANN: Now, here's something interesting. Humphreys and addiction researchers I've been speaking to think Biden made real progress on fentanyl but then failed to tell the American public about those policy gains.\n\nHUMPHREYS: I think it hurt them because they had a story of success to tell.\n\nMANN: And you may remember, A, that during the presidential campaign, Trump really clobbered Biden on the fentanyl issue. Trump claimed falsely that no progress was being made reducing overdose deaths.\n\nMARTÍNEZ: So if Joe Biden and Vice President Kamala Harris had this information, why didn't they use it? Why didn't they talk about this?\n\nMANN: You know, it's a real mystery, especially because some of the biggest improvements on fentanyl were happening in political battleground states like Ohio and Pennsylvania. I reached out to Kamala Harris and members of the Biden and Harris campaigns to ask about their messaging on fentanyl, and I got no response.\n\nTalking with addiction and drug policy experts, I did hear one interesting theory. Despite these plummeting fentanyl deaths and Biden's success, they think Trump succeeded in reframing this as a border issue, part of the wider migrant crisis. And that's brought sweeping consequences. Trump has now dismantled many of Biden's fentanyl policies, and he's shifted to a new range of policies from trade tariffs to an increasingly militarized drug war.\n\nMARTÍNEZ: All right. That's NPR's Brian Mann. Brian, thanks.\n\nMANN: Thank you, A.\n\nCopyright © 2026 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\n Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.","summary":"A new study indicates the amount of fentanyl being smuggled into the U.S. fell dramatically during the Biden administration.","url":"https://www.npr.org/2026/01/09/nx-s1-5668364/fentanyl-smuggling-into-the-u-s-fell-during-the-biden-administration-stidy-finds","image":"https://media.npr.org/include/images/facebook-default-wide.jpg","video":null,"publish_date":"2026-01-09 09:39:34","author":"Brian Mann","authors":["Brian Mann"],"language":"en","category":"politics","source_country":"us","sentiment":-0.404},{"id":392169090,"title":"Minnesotans continue to grapple with fatal ICE shooting","text":"MINNEAPOLIS - Drivers in a line of vehicles blared their horns Friday afternoon in a trendy Minneapolis neighbourhood as cyclists racing down nearby sidewalks blew on whistles.\n\nIt was a warning for the neighbourhood: Immigration and Customs Enforcement officers were in a vehicle at the front of the convoy.\n\nThe sounds of community members pushing back on an expanding federal immigration enforcement operation have been getting louder in this Minnesota city in the days since an ICE officer fatally shot Renee Good, a 37-year-old mother of three, in the head.\n\nGood’s death on Wednesday has rattled the Twin Cities of Minneapolis and St. Paul, now the scene of the Trump administration’s latest immigration crackdown. Rallies and protests continued Friday after Homeland Security shared a new video of the fatal altercation on social media that purports to show the view of the officer involved.\n\nMembers of the Trump administration said the video vindicates the officer’s actions, which they have insisted were in self-defence. Some Minneapolis residents are saying it does nothing of the kind.\n\nMinneapolis Mayor Jacob Frey told a news conference earlier Friday that his community fears the outcome of a federal probe into the shooting has been determined already.\n\n“This is not the time to bend the rules. This is the time to follow the law,” Frey said. “This is not a time to hide from the facts. This is a time to embrace them, making sure that we are pushing for transparency every step of the way.”\n\nFrey called for the Minnesota agency that probes shootings involving officers to take part in the investigation. Homeland Security Secretary Kristi Noem has said it does not have jurisdiction.\n\nFrey said there is a perception abroad that the Trump administration has decided the outcome of the investigation already and it’s critical to include independent state investigators.\n\n“We in Minneapolis want a fair investigation,” he said.\n\nFrey and other local officials repeated their call for ICE to leave the area so that tensions can subside.\n\nCommunity members have created a makeshift system to warn people of the presence of ICE officers.\n\nWhen federal officials showed up at a home where construction workers were present Friday afternoon, neighbours ran out blowing whistles. The workers went indoors and neighbours continued sounding the alarm until the federal officers departed.\n\nElsewhere, people on bikes sat near 24 Somali Mall, talking about rumours that ICE had been seen nearby.\n\nMore than 2,000 ICE officers have descended on the area in what the Department of Homeland Security has described as the largest immigration enforcement operation ever.\n\nMinnesota was a political flashpoint before the shooting. U.S. President Donald Trump has made multiple verbal attacks on Gov. Tim Walz — former vice-president Kamala Harris’s 2024 running mate — and derogatory remarks toward the state’s Somali population.\n\nTrump last month called the Somali population “garbage” following a federal investigation into COVID-19 and medical aid fraud connected to organizations serving Somali immigrants and others.\n\nLocal resident Saleban Duale said the mistakes of a few don’t reflect the whole community and the Somali population has contributed greatly to Minnesota.\n\nThe Somali American Leadership Table organized a rally at the location of Good’s death to call for unity and accountability for ICE. Khalid Omar, who is involved with the organization, said it was also an opportunity to honour Good — who he said pushed back on ICE with a whistle and was killed by a gun.\n\n“It’s a moral duty as a neighbour and as a person, as an American, as a Minnesotan, for us to stand up,” Omar said.\n\nThe Somali population is in ICE’s sights after Trump attempted to use the fraud investigation to frame the state as a hotbed of government fraud. Trump claimed last month that Somalis “contribute nothing” and “we don’t want them in our country.”\n\nHe has repeatedly made crude statements about Minnesota Democratic Rep. Ilhan Omar, who is Somali-American. The president has said he would end temporary protected status for Somalis in Minnesota.\n\nThe controversy ramped up last month after a conservative influencer posted unconfirmed claims that daycare centres run by Somalis in Minneapolis were also committing fraud and didn’t have any children registered.\n\nCiting concerns about fraud, Trump’s administration said Tuesday it would withhold funds from programs that support needy families with children in five Democratic-led states, including Minnesota. Treasury Secretary Scott Bessent travelled to Minneapolis Friday to announce new measures to stop what he called “Somali fraudsters.”\n\nOmar said the Somali community in Minnesota is afraid. He said community members are being questioned by ICE officers at their places of worship and when they shop for groceries.\n\n“This administration is bringing a lot of fear and I think that’s their goal,” he said.\n\n“We are greater than fear. We believe this storm is going to pass.” \n\nAdding more fuel to the fire, federal immigration agents in Oregon shot and wounded two people in a vehicle outside a Portland hospital Thursday.\n\nThe Department of Homeland Security said the vehicle’s passenger was “a Venezuelan illegal alien affiliated with the transnational Tren de Aragua prostitution ring” who was involved in a recent shooting in the city.\n\nThe department said that when agents identified themselves during a “targeted vehicle stop” in the afternoon, the driver tried to run them over.\n\nThis report by The Canadian Press was first published Jan. 9, 2026.\n\n— With files from The Associated Press","summary":"Renee Good was shot in the head Wednesday on Day 2 of the Trump administration's immigration crackdown on the Twin Cities of Minneapolis.","url":"https://www.thestar.com/news/world/united-states/minnesotans-continue-to-grapple-with-fatal-ice-shooting/article_848b8e02-b2c3-5ef8-9031-5a28b67af620.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/4/6d/46de1ddf-989e-5582-aa00-c3b5ca8cf69b/696066fd492db.image.jpg?crop=719%2C377%2C0%2C351","video":null,"publish_date":"2026-01-09 09:00:00","author":"Kelly Geraldine Malone The Canadian Press","authors":["Kelly Geraldine Malone The Canadian Press"],"language":"en","source_country":"ca","sentiment":-0.255},{"id":392051862,"title":"Trump is gaslighting Americans – and they are no longer buying it","text":"On Wednesday, a woman was shot in the head and killed by an Immigration and Customs Enforcement (ICE) agent in Minnesota, less than a mile from the spot where George Floyd was murdered by a policeman in 2020.\n\nBack then, the sense of dread that Donald Trump was presiding over an age of chaos and impunity was palpable, and led directly to his defeat by Joe Biden that year. If an election were held tomorrow, Trump would be beaten again.\n\nHere, but multiplied tenfold, are the same ingredients: a narcissistic US President, more intoxicated than ever by his own power, with out-of-control law enforcement officials and a country divided into two camps, unable to agree on the most basic facts.\n\nRenee Nicole Good, 37, a mother of three who described herself as a “poet and writer and wife and mom”, would appear to have been fired upon while trying to drive away from ICE agents during a protest against the round-up of illegal immigrants in Minneapolis. Her youngest son, aged six, is an orphan after his father died in 2023.\n\nThe left-wing congresswoman Alexandra Ocasio-Cortez called Good’s death “murder” and that’s what it looked like on video. However, Kristi Noem, the Homeland Security Secretary, who showed up at the press conference in a buccaneering ten-gallon cowboy hat, accused Good of “domestic terrorism”.\n\nTrump claimed on social media that Good “viciously ran over the ICE officer” and accused her of being “very disorderly, obstructing and resisting”. He produced a video clip which showed no such thing. Not for the first time, he required Americans to believe him rather than the evidence of their own eyes.\n\nAnd with Minnesota investigators claiming the FBI won’t give them access to the evidence or work with them on the case, we are entering into the cover-up phase of her killing in which conspiracies will substitute for the truth.\n\nThe day before Good’s death, 2,000 ICE agents had been dispatched to Minnesota in what the Trump administration hailed as the largest federal immigration enforcement operation in history.\n\nCritics warned, when Congress increased ICE’s budget by $75bn (£55.9bn) last autumn, that Trump was building a “deportation-industrial complex” flush with cash that would be used against US citizens.\n\nWe are seeing its results now. Good is the first US citizen to die in this conflict, but the ninth person to be shot by immigration officers in the last four months.\n\nThis “war” by masked, armed officers on American soil is taking place while Trump has embarked on regime change and an oil grab in Venezuela and is threatening to invade Greenland. Truly, we have entered a new age of impunity.\n\nWhether it is a turning point is too soon to say. But even the President has noticed the disconnect between his “empire strikes back” fantasies of world domination and unrivalled US prosperity, and his actual standing at home.\n\nHe whined to Republican lawmakers, at the renamed Trump-Kennedy Center in Washington a few days ago, that the popularity of his policies was “weaker than expected”.\n\nThe baffled US President added: “I wish you could explain to me what the hell is going on with the mind of the public because we have the right policy.”\n\nThe White House is currently frantically engaged in a round of “affordability” initiatives – from cheaper US car loans to a possible extension of healthcare subsidies – to counter Trump’s sinking status.\n\nAccording to an Economist/YouGov poll conducted in the first days of January, only 39 per cent of Americans approve of his performance in office compared to with 56 per cent who disapprove, with 36 per cent approving of his handling of the economy (57 per cent disapprove).\n\nTrump’s comment to The New York Times that US involvement in Venezuela could last years and that developing “the oil will take a while” will not ease his woes. Only one in three Americans told a Reuters/Ipsos poll they supported the military strike on Venezuela.\n\nNow the shooting of Good has put the his administration on the back foot just as it was enjoying a propaganda victory in Minnesota – a Midwestern, blue-collar state – after the uncovering of a brazen scam involving pockets of the Somali diaspora.\n\nThis week, Maga collected the scalp of Minnesota governor Tim Walz, Kamala Harris’s underpowered vice-presidential candidate, who announced he would not be seeking re-election after more than $1bn (£745m) was alleged to have been wasted on non-existent social services, including Covid-19 feeding programmes for children.\n\nBut Good’s killing has not only reminded voters of the horrendous murder of Floyd. Jarringly, it occurred at the same time Trump endorsed a new “official” history of the January 6, 2021 riot at the Capitol on the White House website.\n\nAs well as insisting the election was stolen by Joe Biden, the site proclaims that Ashli Babbitt, a 35-year-old Trump supporter who was shot by a policeman breaking into Congress five years ago, as a martyr.\n\nAccording to the White House timeline of events, Babbitt was “fatally shot… without warning as she climbs through a broken window toward the Speaker’s Lobby. No weapon was found on her, and she posed no threat.”\n\nThe smearing of Good and veneration of Babbitt feels like a whole new level of gaslighting from the US President. Just look at the video of both events and judge for yourself.","url":"https://inews.co.uk/opinion/trump-gaslighting-americans-no-longer-buying-it-4158450","image":"https://inews.co.uk/wp-content/uploads/2026/01/SEI_280072804.jpg?crop=0px%2C0px%2C1200px%2C677px&resize=1200%2C675","video":null,"publish_date":"2026-01-09 07:00:00","author":"Sarah Baxter","authors":["Sarah Baxter"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.131},{"id":392050604,"title":"San Diego protests continue in wake of killing of Minnesota woman by ICE officer","text":"Protesters again took to the streets in San Diego Thursday, calling for justice over the death of Renee Nicole Good, a 37-year-old Minnesota poet and mother who was killed by an ICE officer.\n\nThere were daytime and evening protests, both of which followed Wednesday’s late march through Little Italy, hours after the shooting death of Renee Nicole Good, 37.\n\nParticipants in the Thursday midday protest, organized by a coalition of labor groups, marched, chanted and carried signs outside Edward J. Schwartz Federal Building.\n\nIn a statement released prior to the event, Service Employees International Union Local 221 stated that local critics of the federal agency are “calling for an end to violent, out-of-control immigration operations with ICE raiding communities and tearing families apart.”\n\nThe federal building in the 200 block of West Broadway was chosen because ICE has a detention center there.\n\nBy late afternoon, the protesters had dispersed, with police reporting no significant problems or arrests.\n\nPolice were present for the Thursday evening gathering as well, also at the federal building, where the crowd reacted when they spotted a white van leaving the federal building. Police maintained watch over the the protesters, who moved back peaceably to Front Street after the van went by.\n\nSigns held aloft by demonstrators included “From San Diego to Minneapolis: Stop ICE Terror,” “Ice-cold killers” and “ICE are the domestic terrorists.”\n\nDepartment of Homeland Security Secretary Kristi Noem on Wednesday called Good’s actions prior to her shooting “an act of domestic terrorism.” President Donald Trump said on social media that “the woman driving the car was very disorderly, obstructing and resisting, who then violently, willfully, and viciously ran over the ICE Officer, who seems to have shot her in self defense.”\n\nFormer Vice President Kamala Harris, though, joined a host of Democratic leaders who criticized the government, saying the footage of Good’s death “makes it clear that the Trump administration’s explanation of this shooting is pure gaslighting.”\n\nPhotographer Adrian Childress and City News Service contributed to this report.","summary":"Police reported no significant problems or arrests at the daytime and evening protests over the death of Renee Good.","url":"https://timesofsandiego.com/politics/2026/01/08/more-san-diego-protests-ice-minnesota/","image":"https://timesofsandiego.com/wp-content/uploads/2026/01/0.Minn1_.jpg","video":null,"publish_date":"2026-01-09 06:45:21","author":"Adrian Childress,Jennifer Vigil • Times of San Diego","authors":["Adrian Childress","Jennifer Vigil • Times of San Diego"],"language":"en","category":"politics","source_country":"us","sentiment":-0.128},{"id":392140852,"title":"Column: Minnesota Democrats Are Testing How Woke Is Too Woke","text":"What is going on in The People’s Republic of Minnesota? The Democrat establishment in the Gopher State is nothing like it was back in the Reagan years, with ex-vice president Walter Mondale or Gov. Rudy Perpich. The insurrectionist echoes of their language about immigration-enforcement cops is eyebrow-raising in the same week the elitist media somberly mourned the attack on police at the January 6 riot.\n\nOn January 7, activist Renee Nicole Good used her car to try and block traffic to resist ICE agents. When she refused requests to step out of the car and instead drove her car into an ICE agent, he shot her. That’s a terrible thing. But so was the shooting of activist Ashli Babbitt by a policeman on January 6.\n\nHow is running over ICE agents not like threatening the Capitol Police on January 6? If you don’t believe ICE agents were in danger, then maybe you should read about how Cuban illegal alien Juan Carlos Rodriguez Romero “interacted” with ICE agents last December 21.\n\nOn January 5, a Justice Department press release noted when ICE agents initiated a traffic stop with Romero in St. Paul, he “refused to obey commands and attempted to flee in his car.” He accelerated his car toward ICE officers who were on foot. He then lost control of his car, and ICE tried to apprehend him a second time. Romero again accelerated his car and struck one officer. When ICE officers actually apprehended him, he “bit one of the officers, drawing blood. Two ICE officers were transported to the hospital, suffering from bruised ribs, a dislocated finger, and a bite wound.”\n\nLast September, an illegal alien ran over and dragged an ICE agent in Chicago until ICE shot him dead. But there was no sympathy for the dragged agent. CNN and the rest of the press treated that as ICE brutality, absolving the violent cop-dragging. WBEZ, the Chicago NPR station, openly promoted assisting the ICE resisters: “Here’s how you can help us track where ICE agents are being deployed in Chicago.”\n\nThe Democrats align themselves with violent leftists resisting ICE. “Get the f—k out of Minneapolis,” proclaimed Mayor Jacob Frey after Renee Good was killed. Gov. Tim Walz suggested he’d deploy the National Guard: \"I've issued a warning order to prepare the Minnesota National Guard. We have soldiers in training and prepared to be deployed, if necessary.”\n\nMinnesota Democrats openly allied themselves with Somali-Americans who defrauded the federal government of billions of dollars. When Team Trump drew attention to this massive fraud, Walz called it “white supremacy.”\n\nThese radical stances underline the wokeness, or the “anti-racism” of Democrats and their affiliated media outlets, who see everything through a lens of oppressive “white privilege.” It’s precisely this wokeness that enabled the massive fraud in the first place, and which now seeks to disable any attempt at deportations. \n\nWill these stances hurt the Democrats statewide in Minnesota? They already caused Walz to drop out, and Sen. Tina Smith is retiring, so there's open seats, and Kamala Harris only won the state by four points. Will it hurt Lt. Gov. Peggy Flanagan in the Senate race? She recently demonstrated her wokeness by donning a hijab in a video released on Christmas and proclaiming solidarity with our Somali “immigrant neighbors.”\n\nWokeness damaged Kamala Harris in 2024, but Democrats can’t seem to curb their pandering to illegal immigrants and Somali fraudsters. The “mainstream” media stand with the Democrat extreme on these issues, promoting Frey and Walz and Ellison, but biased media -- hailing their rants as \"powerful\" -- doesn’t always bring victory.","summary":"What is going on in The People’s Republic of Minnesota? The Democrat establishment in the Gopher State is nothing like it was back in the Reagan years, with ex-vice president Walter Mondale or Gov. Rudy Perpich. The insurrectionist echoes of their language about immigration-enforcement cops is eyebrow-raising in the same week the elitist media somberly mourned the attack on police at the January 6 riot.\n\nOn January 7, activist Renee Nicole Good used her car to try and block traffic to resist ICE agents. When she refused requests to step out of the car and instead drove her car into an ICE agent, he shot her. That’s a terrible thing. But so was the shooting of activist Ashli Babbitt by a policeman on January 6.\n\nHow is running over ICE agents not like threatening the Capitol Police on January 6? If you don’t believe ICE agents were in danger, then maybe you should read about how Cuban illegal alien Juan Carlos Rodriguez Romero “interacted” with ICE agents last December 21.\n\nOn January 5, a Justice Department p","url":"https://www.newsbusters.org/blogs/nb/tim-graham/2026/01/09/column-minnesota-democrats-are-testing-how-woke-too-woke","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2026-01/ABC%20World%20News%20Tonight%20With%20David%20Muir-6_34_43%20pm-2026-01-07-0.jpg?itok=OLaoHecV","video":null,"publish_date":"2026-01-09 06:45:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.598},{"id":392061618,"title":"Minnesota Democrats Are Testing How Woke Is Too Woke","text":"What is going on in the People's Republic of Minnesota? The Democrat establishment in the Gopher State is nothing like it was back in the Reagan years, with ex-Vice President Walter Mondale or Gov. Rudy Perpich. The insurrectionist echoes of their language about immigration-enforcement cops are eyebrow-raising in the same week the elitist media somberly mourned the attack on police at the Jan. 6 riot.\n\nOn Jan. 7, activist Renee Nicole Good used her car to try to block traffic to resist ICE agents. When she refused requests to step out of the car and instead drove her car into an ICE agent, the agent shot her. That's a terrible thing. But so was the shooting of activist Ashli Babbitt by a policeman on Jan. 6.\n\nHow is running over ICE agents not like threatening the Capitol Police on Jan. 6? If you don't believe ICE agents were in danger, then maybe you should read about how Cuban illegal alien Juan Carlos Rodriguez Romero \"interacted\" with ICE agents last Dec. 21.\n\nOn Jan. 5, a Justice Department press release noted that when ICE agents initiated a traffic stop with Romero in St. Paul, he \"refused to obey commands and attempted to flee in his car.\" He accelerated his car toward ICE officers who were on foot. He then lost control of his car, and ICE tried to apprehend him a second time. Romero again accelerated his car and struck one officer. When ICE officers actually apprehended him, he \"bit one of the officers, drawing blood. Two ICE officers were transported to the hospital, suffering from bruised ribs, a dislocated finger, and a bite wound.\"\n\nLast September, an illegal alien ran over and dragged an ICE agent in Chicago until ICE shot him dead. But there was no sympathy for the dragged agent. CNN and the rest of the press treated that as ICE brutality, absolving the violent cop-dragging. WBEZ, the Chicago NPR station, openly promoted assisting the ICE resisters: \"Here's how you can help us track where ICE agents are being deployed in Chicago.\"\n\nThe Democrats align themselves with violent leftists resisting ICE. \"Get the f--- out of Minneapolis,\" proclaimed Mayor Jacob Frey after Good was killed.\n\nGov. Tim Walz suggested he'd deploy the National Guard: \"I've issued a warning order to prepare the Minnesota National Guard. We have soldiers in training and prepared to be deployed, if necessary.\"\n\nMinnesota Democrats openly allied themselves with Somali Americans who defrauded the federal government of billions of dollars. When Team Trump drew attention to this massive fraud, Walz called it \"white supremacy.\"\n\nThese radical stances underline the wokeness, or the \"anti-racism\" of Democrats and their affiliated media outlets, who see everything through a lens of oppressive \"white privilege.\" It's precisely this wokeness that enabled the massive fraud in the first place, and which now seeks to disable any attempt at deportations.\n\nWill these stances hurt the Democrats statewide in Minnesota? They already caused Walz to drop out, and Sen. Tina Smith is retiring, so there's open seats, and Kamala Harris only won the state by four points. Will it hurt Lt. Gov. Peggy Flanagan in the Senate race? She recently demonstrated her wokeness by donning a hijab in a video released on Christmas and proclaiming solidarity with our Somali \"immigrant neighbors.\"\n\nWokeness damaged Kamala Harris in 2024, but Democrats can't seem to curb their pandering to illegal immigrants and Somali fraudsters. The \"mainstream\" media stand with the Democratic extreme on these issues, promoting Frey and Walz and Attorney General Keith Ellison and the rest. But biased media voices -- hailing their rants as \"powerful\" -- can't always ensure victory.\n\nTim Graham is director of media analysis at the Media Research Center and executive editor of the blog NewsBusters.org. To find out more about Tim Graham and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.COPYRIGHT 2026 CREATORS.COM\n\nEditor’s Note: Here at Townhall, we’ve been dealing with real government suppression of free speech for YEARS. Despite the threats and consequences, we refuse to go silent and remain committed to delivering the truth.\n\nHelp us fight back against government censorship by joining Townhall VIP and using promo code FIGHT to receive 60% off your membership.","url":"https://townhall.com/columnists/timgraham/2026/01/09/minnesota-democrats-are-testing-how-woke-is-too-woke-n2669144","image":"https://media.townhall.com/cdn/hodl/2026/7/1a781923-e5c4-4632-9596-f31eed245310.jpg","video":null,"publish_date":"2026-01-09 05:01:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"us","sentiment":-0.579},{"id":392076814,"title":"Five Quick Things: Minnesota Goes to Hell (Again)","text":"It really shouldn’t happen twice in six years. Then again, with the same cast of characters in charge, it’s hardly a surprise that it did.\n\nOr that it would keep happening.\n\nWe speak here about the national crisis occasioned by the leadership and citizenry (slightly more than half of it, to be fair) of the state of Minnesota.\n\nSo much has gone wrong there that an entire book can and perhaps should be written — perhaps in multiple volumes. But in the interest of brevity, we’ll limit this national filing of grievance to only five things.\n\nWhich we will endeavor, as best we can, to be quick in declaring.\n\n1. Piracy and Theft\n\nSince before Christmas, the nation has been transfixed by the scandal of Minneapolis’s Somali community and its “economic” activities, which mostly consist of running scams to steal money from the American taxpayer. (RELATED: Minnesota Welfare Scandal Is the Fraud Warning Americans Finally Noticed)\n\nThere can be no real argument at this point that it was a grievous mistake to import hundreds of thousands of people from the world’s worst country. This was sussed out brilliantly in Congressional testimony by Texas Republican Rep. Brandon Gill, who walked a panel of Minnesota state legislators through the litany of failure the Somali community has inflicted on the people of these United States since their arrival…\n\nWhat do you get when you import a community where four in five of its members become dependent on the welfare system? This isn’t a hypothetical question, of course; we already know — and Minnesota has provided us with the answer.\n\nYou get $9 billion in welfare fraud. Because while most Somalis aren’t on the ball enough to do much in the way of productive work, anyone immersed in a slack, openly incontinent system like SNAP or Medicaid will eventually find nooks and crannies in which to hide while draining its coffers. The masterminds of Somali fraud in day care centers, autism “crazy checks” and other things are almost certainly not just Somali — but there are clearly enough Somalis to fill up the fraud pipeline and make it so that any effort to clean these things up is going to be lambasted as “bigoted” or “racist.”\n\nSo you get this…\n\nThis is the type of wholesale racket that Democrats create. The Somalians here are the ones carrying it out, but we should not ignore the role played by their Democratic enablers who created the infrastructure for fraud to proliferate and go unchecked pic.twitter.com/prd3sjIPDS— Dinesh D’Souza (@DineshDSouza) December 24, 2025\n\nHow does the Somali daycare fraud work?– Somalis bring in kids\n– Check them in\n– Leave with the kids\n– Bill the state for care that never happened\n– Parents receive kickbacksOh, and this is surveillance from 2018. This has been happening for YEARS.\npic.twitter.com/MhV9zpTQ5s— Benny Johnson (@bennyjohnson) December 29, 2025\n\nAnd these scams have gone on unabated, outside of the odd prosecution here and there, for more than 15 years, with nobody doing anything effective about it.\n\nNaturally, there is another level to this, which is that when you start asking the old Roman question cui bono — who benefits? — you realize why this unconscionable rape of the American taxpayer has carried on with Minnesota as its locus.\n\nHere’s a hint…\n\nAnd here’s more than a hint…\n\n🚨 HOLY CRAP. Nick Shirley and David just confirmed that 1 Somali collects mail-in ballots for entire COMPLEXES — up to 9 BALLOTS per apartment home — and send them in for DemocratsThe voter fraud is MASSIVE 🤯 pic.twitter.com/AbyaQDigWG“They all vote together and there’s…— Eric Daugherty (@EricLDaugh) January 6, 2026\n\nThat’s pretty bad, you’d have to agree. Except it’s worse. Back in 2020, James O’Keefe exposed how bad it really is…\n\nProject Veritas was so far ahead of the Somali fraud in Minnesota.We exposed their illegal ballot harvesting schemes in 2020.No one was EVER arrested. pic.twitter.com/85irKXxYW4— Eric Spracklen 🇺🇸 (@EricSpracklen) December 30, 2025\n\n@JamesOKeefeIII and @Project_Veritas uncovered Minnesota voter fraud among the Somali community in September 2020, two months before the election. And when I wrote about it, the backlash was ferocious.\nThe story was “widely fact-checked” aka discredited by the “prestige” media… https://t.co/IuUVkBbfqm pic.twitter.com/JEzW0vM8Ub— Miranda Devine (@mirandadevine) December 27, 2025\n\n2. The Heave-Ho\n\nSo as this scandal began to unravel and ferment, the poll numbers began to sour for Minnesota’s governor, Tim Walz — a bizarre, unstable man who was exposed and rejected by voters across the country as Kamala Harris’s servile vice presidential nominee in 2024. Walz was called on the carpet by Minnesota’s senior senator, Amy Klobuchar, the story goes, and told that he’d gone politically septic and could therefore not be his party’s nominee for re-election this fall. (RELATED: Walz Can’t Escape the Somali Fraud Scandal)\n\nWalz seems to have a penchant for deferring to women not named Kristie Noem, so this was the result…\n\nIt was surely an on-brand performance from Walz, who, along with Minnesota’s Attorney General Keith Ellison, actively inflicted the Somali piracy of the welfare state on the American taxpayer and then, when the political price had to be paid for it, went all in on partisan attacks on Donald Trump.\n\nThe parallel that comes to mind is Harvey Weinstein, whose own denouement as a relevant figure on the national stage stemming from the failure of his character was seasoned with political attacks on Trump and a commitment to attack Americans’ gun rights in a failed leftist virtue signal.\n\nWalz’s downfall shouldn’t have been much of a blow to the national Democrat Party; after all, they’d given him his 15 minutes of fame, and he’d used them poorly. Flushing him was probably a net plus.\n\nExcept that the Somali fraud mess is larger than something that can be cleaned up by the political demise of one lackluster governor. It spans several states and billions of dollars; there are political donations on the books to Democrats all around, and it touches something primal in the minds of ordinary Americans.\n\nHeidi Hill, posting at X, summarized this perfectly…\n\nThere is something deeply insulting about watching a Somalian fraud ring siphon billions of dollars from the U.S. government through a scheme so sloppy it should have collapsed before it began.This wasn’t clever. It was incompetent. When confronted, the Somalian actors involved didn’t even deny the fraud outright. They claimed the records—and only the records needed to prosecute them— were stolen. All of them.Seemingly unaware they’d been caught in their own lies, one man bemoaned his innocence while wearing designer sunglasses priced around $2,500. It’s like watching every B movie where the embezzlers go buy a Ferrari and drive it to work the next day.Now activists are rushing in to block all conversation, which to any sane person makes them look even more guilty and increasingly ridiculous. As Frederic Bastiat warned, “When plunder becomes a way of life for a group of men in a society, over the course of time they create for themselves a legal system that authorizes it and a moral code that glorifies it.”\n\nThis mess was metastasizing, and it threatened to engulf an entire political party. Worse, it threatened to demoralize the Democrats’ base of affluent white female leftists — AWFLs — as some or perhaps many would reasonably conclude they’d been had by pirates and fraudsters bilking those beloved social programs.\n\nSomething had to be done. And miraculously, an opportunity arose.\n\n3. A Carpetbagging AWFL Earns Her Immortality\n\nThe public wanted action against the pirates and thieves in Minnesota, and where some of them were not here legally, ICE and the Border Patrol could do at least a modicum of good by sending them home.\n\nMinneapolis is not a focus of ICE activity, but the agency is quite active there. In response, what has happened is that leftist NGO’s, funded partially by American tax dollars, have set up networks on Signal and WhatsApp in order to track the activity of ICE agents and mobilize to stop them from turning arrests into deportations. (RELATED: Please Deliver Us From the Poorly-Behaved Women)\n\nBear in mind that more than 70 percent of everyone deported by ICE through the raids they’re carrying out across the country are not just illegal aliens but either criminals — meaning they’ve committed crimes while here illegally — or they’re under a judicial deportation order. So when ICE rolls in to make an arrest, and someone acts to interfere with their activity, that someone is, in more cases than not, acting to protect a criminal invader into our country. (RELATED: Are They Illegal? Because If They’re Illegal, That’s Why They’re Getting Arrested)\n\nFor some reason — mostly, I imagine, because they’re the base of the Democrat Party and the Left as a whole — the brigades of “activists” mobilizing to stop ICE agents from doing their jobs are chiefly made up of AWFLs.\n\nAnd on Wednesday, a woman named Renee Nicole Good, described as a mother of three and a poet, married to another woman, drove her Honda Pilot into an ICE engagement and parked it in a way that blocked a street so ICE officers couldn’t get out with an arrestee.\n\nGood was asked to move her car. She didn’t. Her lesbian partner got out of the car to film what came next.\n\nThen the ICE officers moved to surround the car and arrest her, because obstruction of a law enforcement activity is a crime.\n\nLet’s remember, because you’ve been propagandized to believe that the recent campaign of left-wing “protests” are “nonviolent,” that there are well-established principles of nonviolent resistance which have come down from Gandhi and Dr. Martin Luther King Jr. and others, and among those principles are that if you’re going to be arrested by the police for having demonstrated against some unjust thing, you go with them calmly and passively. (RELATED: Abusing Border Patrol Agents: Echoes of Vietnam)\n\nThat’s not what Renee Good did. As an ICE officer approached her open driver’s-side window and another got in front of her vehicle, she first threw the Pilot into reverse and then accelerated forward — perhaps in an attempt to escape, as her supporters have claimed, but the vehicle accelerated directly toward an ICE officer who shot her before being struck by the vehicle and then stepping aside as it careened into a parked car.\n\nThat same ICE officer had been attacked by another leftist protester with a vehicle in June; in that incident, he’d been dragged some distance by the vehicle. Any opprobrium you might have for his having shot Renee Good should be tempered by that knowledge.\n\nAnd as Noem noted, attempting to run ICE officers over with cars is a well-established pattern. A woman behind the wheel of a car is not physically infirm, as she might be attempting to resist an ICE officer on foot, you see, and so if the recruits to your fairly violent “non-violent” resistance are women, you use what you have.\n\nGood was not from Minneapolis. She was born in Colorado and had lived in Kansas City. She showed up in Minneapolis to cause trouble with ICE and had been involved in trying to block streets to prevent ICE officers from doing their jobs several times in the preceding hours and days.\n\nWith three children at home.\n\n4. A Foul Mouth Full of Soy\n\nWith Good’s death, Minnesota’s abjectly evil leftist politicians now had something other than Somali fraud to pivot to, and pivot they did. Jacob Frey, the noxious soyboy mayor of Minneapolis who was himself a carpetbagger — he’s from northern Virginia and has lived in Minneapolis only since 2009 — barely survived re-election against a Somali socialist named Omar Fateh, who might have turned that city into a full-on Mogadishu. Frey needed something to bolster his credibility as a leftist political figure after becoming a laughingstock for his pandering to the Somalis during the campaign, and now he could pander to the AWFLs.\n\nBoy, did he. Here was Frey last week…\n\n‼️ Americans are calling for Minneapolis Mayor Jacob Frey to resign after he threatened violence against ICE just weeks ago.Now, today, a suspect attempted to run over ICE agents with her vehicle, prompting self-defense gunfire in response. pic.twitter.com/IqkzqE3gaa— Digital Gal (@DigitalGalX) January 7, 2026\n\nThat was not a warning to the Renee Goods of the world that they needed to be careful how far to take their “activism,” by the way. No, it was a demand that ICE not enforce the law.\n\nAnd after Good’s entirely avoidable death — had she exercised some judgment and personal discipline in making one single smart decision on Wednesday, none of this would have happened — this was Frey…\n\nThere is absolutely no defense for the mayor of a city to speak this way — not just because of his foul, unprofessional language but because his message is utterly lawless.\n\nBut it was utterly on brand for the Minneapolis mayor, who had done everything he could to set his city on fire following George Floyd’s death in police custody in May 2020.\n\n5. Insurrection in the Wind\n\nNot to be outdone, and suddenly relevant again with a suitable helping of ghoulish attention-whoring, Walz returned to the political stage with his own announcement. And this was not just the usual demagoguery, but rather something more…\n\n“Peacefully, as you always do.” This from a governor who watched his largest city burn just five and a half years ago.\n\nAnd then Walz threatened to deploy the Minnesota National Guard against the federal government.\n\nThere is almost no precedent for that. It gives off a distinct stench of civil war.\n\nWalz, Frey and the rest of Minnesota’s governing class have encouraged billions of dollars of theft from the American taxpayer, with much of the proceeds remitted to a hostile foreign nation engaged in terrorism and piracy on the high seas, and to deflect from public attention of the resultant scandal, ginned up useful idiots to interfere with federal law enforcement officers while making not-so-veiled threats that violence was coming.\n\nAnd when it did come, they then escalated the conflict with the federal government.\n\nMinnesota is now beyond the pale. It’s a benighted, lawless place.\n\nWere Trump to respond to Walz by invoking the Insurrection Act and deploying the military into the streets of Minnesota’s cities, and perhaps sending special forces operators to pinch Walz as they did Nicolas Maduro last weekend in order to hold him as an accused revolutionary, it would not be an outrageous act.\n\nIt might even be a necessary act.\n\nMinnesota is now leading America into civil war. This would be the stupidest civil war in world history, and that would be beyond doubt on brand for the American Left, which allows itself to be led by people like Walz, Frey, Ellison, and Ilhan Omar. But this is where we are, and it must be dealt with.\n\nWalz and Frey must resign. Now. The full weight of the federal government must descend on Minnesota until they do.\n\nREAD MORE from Scott McKay:\n\nYou’ve Never Heard of the Citgo Six, and We’re Going to Change That Right Now\n\nThe Toppling of Villains Has Begun in Earnest. It Must Continue.\n\nTrump Sends a Cajun to Press the Message to Greenland","summary":"It really shouldn’t happen twice in six years. Then again, with the same cast of characters in charge, it’s hardly...","url":"https://spectator.org/five-quick-things-minnesota-goes-to-hell-again/","image":"https://spectator.org/wp-content/uploads/2026/01/Jacob_Frey_51653112905.jpg","video":null,"publish_date":"2026-01-09 03:04:51","author":"Scott McKay","authors":["Scott McKay"],"language":"en","source_country":"US","sentiment":-0.577},{"id":392011282,"title":"Critics draw iffy link between Gavin Newsoms record and Minnesotas food fraud scandal","text":"Last month, as required by law, State Auditor Grant Parks published an annual report on state programs and agencies that his office deems to be at “high risk” of costly inefficiency, waste or fraud.\n\nThe report reiterated concerns about seven situations, two of which have been on the list since 2007, including the bureaucracy’s chronic inability to successfully employ information technology — embarrassing for a state that is the global center for digital tools.\n\nParks has added a new program in his latest overview, the Department of Social Service’s food aid for poor families, once called food stamps but now known as CalFresh.\n\nThe federal government primarily finances supplemental food benefits, but the state’s share is determined, in part, by its management, as indicated by its rate of error when determining people’s eligibility.\n\nPresident Donald Trump’s One Big Beautiful Bill tightens the error rate thresholds. Thus, Parks notes, California’s 11% error rate, if not improved, could require the state to “spend about $2 billion annually to maintain CalFresh benefits.”\n\nThe most disturbing item on Parks’ list is the continuing inability of the Employment Development Department to effectively manage unemployment insurance benefits, which first came to light during the COVID-19 pandemic. Billions of dollars in fraudulent benefit claims were approved, almost all of which came in a federally financed expansion of the program.\n\nBy happenstance, the high risk report was released just as a scandal was erupting in Minnesota over widespread fraud in a program meant to keep children fed during the pandemic.\n\nDozens of people, mostly in Minnesota’s substantial Somali population, have been charged with looting the program by setting up companies that billed the state for supplying food that was never delivered.\n\nMinnesota Gov. Tim Walz, whom Kamala Harris chose as her running mate in her campaign for president in 2024, felt the political fallout from the scandal — generated mostly in right-leaning media outlets — and this week dropped his bid for re-election.\n\nMeanwhile, those same outlets — blogs, podcasts and YouTube videos — have been making an accusatory connection between the Minnesota scandal and the Parks report, suggesting the report proves the same kind of fraud was even more rampant in California and laying the blame on Gov. Gavin Newsom, who’s a likely 2028 candidate for president.\n\nThis week, Steve Hilton, a Republican candidate for California governor, and Herb Morgan, a Republican running for state controller, cited the Parks report, their own research and tips from whistleblowers in a broad assertion, dubbed “CALIFRAUDIA,” that “California’s exposure to fraud, waste, and abuse across major state programs is likely to reach $250 billion,” adding that it “underscores the urgent need for formal investigation and audit, as a matter of basic fiscal responsibility.”\n\nHowever, the allegations of widespread fraud and mismanagement during Newsom’s governorship is not confined to those on the starboard side of the political balance beam.\n\nKhanna told Politico, “I don’t know what the specific number is” of dollars lost to fraud or mismanagement. “It’s not particular to any person,” Khanna said. “It’s making government more effective. Tackling the mismanagement and waste and some fraud will build more credibility for asking for higher taxes.”\n\nNewsom’s staff responded by accusing Khanna of making a “MAGA made-up claim.”\n\nThere’s a reason why veterans of political wars refer to election years as the “silly season,” when political figures seeking media attention are prone to convert anthills of fact into mountains of rhetorical fantasy.\n\nDan Walters is a CalMatters columnist.","summary":"Critics draw iffy link between Gavin Newsoms record and Minnesotas food fraud scandal","url":"https://www.presstelegram.com/2026/01/07/critics-draw-iffy-link-between-gavin-newsoms-record-and-minnesotas-food-fraud-scandal/","image":"https://www.presstelegram.com/wp-content/uploads/2026/01/Congress_Epstein_19988.jpg?w=150&strip=all","video":null,"publish_date":"2026-01-09 01:01:33","author":"Gqlshare","authors":["Gqlshare"],"language":"en","category":"politics","source_country":"ie","sentiment":0.033},{"id":392029832,"title":"Liberal journalist recounts time Kamala scolded her over question they laughed about in private","text":"Journalist and podcast host Kara Swisher recounted Monday how Vice President Kamala Harris scolded her in front of an audience over a question about Health and Human Services Secretary (HHS) RFK Jr. that she previously laughed about backstage when the journalist brought it up. \"I just had an experience with Kamala Harris where we were joking about something backstage about Robert Kennedy Jr., circumcision and autism — the link he was making, a link which is not there. And it was so weird. It was like, ‘That’s so f------ strange.’ And then when I got on stage and mentioned it because it had just been in the news, right? She looked at me dead and said, ‘This is nothing to laugh about,'\" Swisher told The New Yorker's Isaac Chotiner during her podcast. Swisher interviewed Harris on her book tour at a Washington, D.C., stop in October. The first question Swisher asked was about her backstage reaction to RFK Jr. connecting \"circumcision and autism.\" \"And she had just laughed about it. And then she went into this sort of high-handed kind of thing where she was like yelling at me for even asking the question. I was like, ‘I’m going to kill you. I literally can’t believe you just did that,' which was interesting. And I thought it was a real insight,\" Swisher said. JOSH SHAPIRO CALLS KAMALA HARRIS BOOK CLAIMS ABOUT HIM 'UTTER BULL----' IN FIERY INTERVIEW RESPONSE Chotiner reacted by adding, \"I sometimes get the sense that she doesn't realize her political career is over.\" During the October interview, Harris responded to Swisher's question with a lengthy description of her family and how her mother worked at the National Institutes of Health. \"My mother was an adviser at NIH, and she would leave us in the Bay Area to go to NIH to work with scientists who have as their goal to alleviate pain and to uplift the human condition. And when I see what these people are doing right now to end the war on cancer, to deny science and fire scientist, Kara, it’s personal for me. It’s personal for me, and I can’t laugh at it,\" she said. KAMALA HARRIS SAYS SHE 'NEEDED MORE SUPPORT' FROM THE BIDEN ADMINISTRATION DURING HER 2024 CAMPAIGN The former vice president said people would \"die\" because of the Trump administration's actions. \"I can't laugh about that, I'm sorry,\" she added. \"It's f----- up.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO DOWNLOAD THE FOX NEWS APP Swisher smiled and pointed at Harris as the audience applauded the answer. Harris then shrugged and shook her head as the journalist tried to move to the next question. Harris toured the country in 2025 to discuss her book about her historically short presidential campaign.","summary":"Kara Swisher revealed during her podcast that Kamala Harris laughed backstage about RFK Jr. linking circumcision and autism, but then publicly scolded Swisher.","url":"https://www.foxnews.com/media/liberal-journalist-recounts-time-kamala-scolded-her-over-question-laughed-about-private","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/swisher-harris-tour.jpg","video":null,"publish_date":"2026-01-09 01:00:47","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"us","sentiment":-0.255},{"id":392117232,"title":"The Numbers Don't Lie: Once Again, Blue States Predictably Top Annual List of Where People Are Leaving","text":"California Governor Gavin Newsom has a habit of taking to his childish social media accounts, and boasting about how great his state has fared under his leadership, especailly compared to red states like Texas and Florida, which he takes every opportunity to badmouth in the media as well.\n\nOddly, he never mentions the statistics put out annually by U-Haul that have a predictable trend in recent years with blue states taking many of the prime spots, and California has once again garnered the top spot on it although it's hardly something any governor would boast about.\n\nIf this story seems familiar to you, there's a reason for that; RedState has written previously on this trend, most recently by my colleague Sister Toldjah who covered the 2023 U-Haul survey results\n\nAs we wrote in December 2025, blue state governors and legislatures are not exactly covering themselve in glory by attempting to block President Trump's no tax on tips and several other policies to help out the pocketbooks of the Americans in their states - something for which Speaker Mike Johnson (LA-01) called them out. And before you ask, no, it doesn't help sidestep the major mismanagement if you're rich.\n\nAnd RedState's Jennifer Van Laar's latest investigative reporting on the 2025 Palisades Fire catastrophe shows that far too many Californians aren't dreamin'; instead, they're living in a nightmare of Newsom's making:\n\nREAD MORE: Newsom's Nightmare: Interim Report Documenting FireAid Fraud Drops on Eve of Palisades Fire Anniversary\n\nWith the turning of the calendar page to January 2026, U-Haul has just released the new Growth Index - and unfortunately for Gov. Hair Gel and the Golden State - the 2025 numbers don't lie; this makes its sixth year in a row at number 50, that is, dead last--or at the top of the losers list, depending on how you look at it.\n\nOur pal Rep. Kevin Kiley (R-03) posted about the new polling on X about CA having the \"highest rate of people moving out\" - not in:\n\nNewsom, though, isn't the only blue state governor who will find embarrassing tidings in U-Haul's number crunching for 2025. Remember PEnnsylvania's Democrat Gov. Josh Shapiro, the almost-vice presidential pick in 2024? Yeah, he and the Keystone State join NJ, NY, and MD near the bottom of the barrel (44th place) for growth in 2025:\n\nNot a good look, when these state's chief executives appear to be on the heating-up speculation list of who Democrats might look to support during a 2028 run for president.\n\nREAD MORE: War of Words Between Josh Shapiro and Kamala Harris Intensifies As 2028 Speculation Heats Up\n\nAs I said, people seem to be fleeing those states in droves, according to U-Haul's records. Meanwhile, where are a growing number of Americans heading? Why, it's a passel of red states.\n\nTX, FL, NC, TN, and SC make up the top five places where people are moving in the U.S., per the survey. Honestly, I probably did not need to tell you readers what the predominant political party is in those states, right?\n\nIt's pretty clear that people are voting with their feet (and their moving vans/vehicles' wheels). No one stays in blue states and cities where they are taxed to death (with more levies on the way, often); they are not able to build their businesses and thrive as they would like. The American people, by and large, are smarter than that, and the numbers don't lie about that fact.\n\nEditor’s Note: Democrat politicians and their radical supporters will do everything they can to interfere with and threaten ICE agents enforcing our immigration laws.\n\nHelp us hold these leftists accountable and expose their obstruction. Join RedState VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://redstate.com/beccalower/2026/01/08/numbers-dont-lie-once-again-predicatible-states-top-u-haul-annual-list-n2197925","image":"https://media.townhall.com/cdn/hodl/2023/68/aa44a174-2729-4a2e-9721-da8001038064.png","video":null,"publish_date":"2026-01-09 00:55:00","author":"Becca Lower","authors":["Becca Lower"],"language":"en","source_country":"us","sentiment":-0.237},{"id":392134196,"title":"The GOP's Obamacare defectors were more numerous than expected","text":"“Rob Bresnahan unleashed a health care crisis on Northeastern Pennsylvania by voting for the largest cuts to Medicaid in history, stripping funding from our rural hospitals, and failing to take meaningful action in time to prevent health care costs from skyrocketing for Northeastern Pennsylvanians,” Scranton Mayor Paige Cognetti, a Democrat who is challenging Bresnahan, said in a statement after the vote. “Nothing he does now can paper over the fact that he caused this crisis in the first place.”\n\nWarning signs have been flashing for Republicans on the issue for months as Democrats hammered their opponents for sending Obamacare premiums soaring. Polls have shown broad support for extending the subsidies. A November survey from KFF found most Obamacare marketplace enrollees would blame Trump and congressional Republicans if they expired. Battleground-district surveys from Trump pollster John McLaughlin showed likely voters were less likely to vote for congressional candidates who let them expire. And they also showed the percentage of voters using the credits is higher among those who backed Trump in 2024 than his Democratic rival, Kamala Harris.\n\n“It affects the working-class Trump voters that we need to get Republicans re-elected. In 2025 there was a series of elections where the Trump voters did not come as strongly as they did in 2024,” McLaughlin said Thursday, referencing GOP losses in off-year elections in New Jersey and Virginia and elsewhere. “If you want to get the Trump voters back out, we need to seriously work on a solution where health care becomes more affordable for working class voters.”\n\nThe House bill is dead on arrival in the Senate, where a similar Democratic-led vote failed last year. Instead, Republican senators are hashing out a compromise that would reestablish the enhanced tax credit for two years, not three, along with other rule changes, but the outcome is uncertain.\n\nGOP strategists argued that vulnerable Republicans who voted to restore the subsidies could still get some cover.\n\n“It blunts Democrats’ attack, even though the Democrats are going to use it regardless because it’ll be part of their national messaging,” said Pennsylvania-based GOP consultant Christopher Nicholas.\n\nThe defectors included several moderates who’ve crossed swords with Johnson repeatedly, including Brian Fitzpatrick of Pennsylvania and suburban New Yorkers Mike Lawler, Nick LaLota and Andrew Garbarino, who prefer a bipartisan deal over another party-line health care bill.\n\n“This is absolute bullshit,” Lawler said in December about his party’s willingness to let the subsidies expire. Lawler went on to call GOP leaders “idiotic” for refusing an up-or-down vote on the issue.\n\nFitzpatrick broke the dam for Republicans to sidestep the speaker by signing a discharge petition to call up a vote last month. The fifth-term congressman, whose district has roughly 32,000 people on the marketplace, told POLITICO at the time “my people back home care tremendously about this.”\n\nHe was joined in signing the petition by Mackenzie and Bresnahan, who flipped their seats in 2024 by some of the thinnest margins in the country and are now among Democrats’ top targets for 2026. Mackenzie told POLITICO last month that he wanted to extend the subsidies to “help bring down the cost for millions of Americans” as Democrats try to wield affordability messaging as a weapon to erode Republicans’ long-held advantage on the economy in the midterms.\n\nSome Republican strategists have worried that Latinos who swung for Trump in 2024 won’t stay with the party in the midterms. Bresnahan’s swath of Pennsylvania features a large Hispanic population. He previously implored Johnson to not cut SNAP, the food assistance program, or Medicaid, the health insurance program for low-income people, arguing that his Hispanic constituents are “expected to bear the brunt of these reductions.”\n\nKean, in New Jersey, is staring down a crowded field of Democratic rivals that features a physician, Tina Shah, who’s trying to yoke the Republican to the Trump administration’s health care agenda. California’s Valadao, too, is being hammered over health care by his Democratic rivals. He represents large numbers on Medicaid, which Republicans cut funding for in last year’s One Big Beautiful Bill Act.\n\nRepublicans in districts with high numbers of Obamacare enrollees piled onto the Democrats’ bill Thursday.\n\nSalazar’s Miami district is among the highest: nearly 1 in 3, or 230,000, of her constituents are enrolled in Obamacare.\n\nTexas Rep. Monica De La Cruz’s district has more than 140,000 Obamacare enrollees.\n\nNicholas Wu contributed to this report.","url":"https://www.politico.com/news/2026/01/08/the-gops-obamacare-defectors-were-more-numerous-than-expected-00718102","image":"https://www.politico.com/dims4/default/44a6da4/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd6%2Fb9%2F4870e45b45b5be85776dbf79684d%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2174515181","video":null,"publish_date":"2026-01-09 00:25:00","author":"Lisa Kashinsky","authors":["Lisa Kashinsky"],"language":"en","source_country":"us","sentiment":-0.374},{"id":392029818,"title":"JD Vance says ‘dumbest’ Democratic candidate will win nomination in 2028","text":"Vice President JD Vance quipped in an exclusive Fox News interview released Wednesday that the \"dumbest\" Democratic frontrunner will likely rise to the top in the upcoming primary. \"Gavin Newsom, obviously, is running for president. Have you seen this guy cross his legs? Have you ever seen anyone cross their legs like that?\" Watters asked in a humorous tone on \"Jesse Watters Primetime.\" \"My legs don’t cross like that, Jesse,\" Vance replied while laughing. \"You can interpret that however you want to.\" \"Gavin and Kamala are on a collision course,\" Watters said. \"Who’s gonna win?\" 'CHARLIE KIRK SHOW' PRODUCER SAYS TURNING POINT USA 'ALL IN' BEHIND JD VANCE FOR PRESIDENT \"The dumbest candidate will probably win,\" Vance joked. \"That’s my guess with the Democratic Party. I mean, look, the Democrats have a couple of big issues, and one is that they lean so far into wokeism that they can’t see the obviousness of the fact, which is that Kamala Harris is not qualified to be president of the United States. \"That’s why she got the vice presidential nomination. That’s why she got the presidential nomination. This is who Kamala Harris is. Now, the flip side is, I think you have an unbelievably corrupt and incompetent governor in Gavin Newsom. The fact that those are the two frontrunners just suggests how deeply deranged the Democrat Party is. Let them fight it out. We’ll figure it out.\" Watters noted that Democrats will be running on \"cost of living,\" which Vance argued was a \"pot meet kettle\" situation because Democrats, he argued, caused the crisis with bad policy in the first place. Trump’s administration, he argued, has made significant progress to help the economy recover but suggested there is far more work to be done. \"We haven’t even been in office for a year, and you’ve already seen prices start to come down. You’ve seen rents start to come down. You’ve seen groceries leveling off. Is there more work to do? Absolutely. But the people who are going to do that work is the Trump administration, is the president of the United States, who is solving the Democrats’ affordability crisis,\" Vance said. \"You don’t give power back to the very people who set the house on fire. You give more power to the person who put the fire out.\" When asked about whether Trump will likely be impeached again if Democrats win the midterms, Vance argued that would be part of a cynical play by the Democrats. JD VANCE TURNS TURNING POINT SPEECH INTO MIDTERM BATTLE CRY — AND A PREVIEW OF 2028 \"I’m sure he’ll get impeached,\" Vance said. \"Look, they have nothing to actually run on or govern on. Their entire obsessive focus of that party is they hate Donald Trump. So, if they ever get power, are they going to, you know, lower Americans' taxes? No. Are they going to make your life more affordable? No. Are they going to solve the crime crisis? No. \"What they’re going to do is they’re going to spend all their time and all of your money trying to get Donald Trump,\" he continued. \"I think it’s ridiculous. That’s what they’re running on. But the American people are going to make this determination. I think the American people should vote for the people who want to make their life more affordable, who want to make their neighborhoods safer. That’s what we’re trying to deliver every single day.\" When reached for comment by Fox News Digital, Newsom’s office responded to the interview with a humorous, digitally altered image of Vance crossing his legs in a strange way, captioned, \"We all know JD copies Daddy.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to Harris’ office and did not receive an immediate response.","summary":"Vice President JD Vance criticized the Democratic Party&apos;s leadership and suggested there will be another Trump impeachment if Democrats win the midterms.","url":"https://www.foxnews.com/media/jd-vance-says-dumbest-democratic-candidate-win-nomination-2028","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/jd-vance-breitbart-fireside-chat.jpg","video":null,"publish_date":"2026-01-09 00:00:05","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.592},{"id":392009592,"title":"From George Floyd to Trump calling Somali immigrants ‘garbage’ to a fatal ICE shooting, Minnesota’s in the crosshairs","text":"Trump has focused on several blue states in the divide-and-conquer campaign that has characterized his second term, and now he has turned to Minnesota, where the killing of George Floyd and the protests it sparked stained his first presidency.\n\nTrump last month called the state’s Somali population “garbage” in the wake of a massive federal investigation into COVID-19 and medical aid fraud tied to organizations serving Somali immigrants, among others. The fraud cases led Minnesota’s Democratic governor, Tim Walz — former Vice President Kamala Harris’ 2024 running mate — to announce this week he will not run for reelection.\n\nIn June, a Democratic state lawmaker and her husband were assassinated by a Trump supporter, although conservatives insist the gunman was actually a leftist working at Walz’s behest. On Sunday, the victims’ family begged Trump to take down a social media post echoing those conspiracy theories.\n\nMemories of the chaos that followed the killing of George Floyd\n\nAmid that mounting tension, the Trump administration announced Tuesday that it was sending more than 2,000 federal officers to the Twin Cities of Minneapolis and St. Paul in what it claimed would be the biggest immigration enforcement operation in history.\n\nThe Immigration and Customs Enforcement officer who killed Renee Good during a protest Wednesday against the immigration raids opened fire just blocks from where, in 2020, a Minneapolis police officer killed George Floyd. The parallels were painful and frightening for many in the area, including Stephanie Abel, a 56-year-old Minneapolis nurse, who is keeping her gas tank full and cash handy in memory of the chaos that followed that slaying.\n\n“I thought the federal government would realize that now is not the time to be toying with people,” Abel said. “What are they going to try to do to get Minneapolis to ignite?”\n\nFloyd’s death sparked the biggest protests of Trump’s first term. The president, who is still publicly bitter about the unrest, contends it should have been met with a stronger show of force.\n\nThat’s the approach Trump has adopted in his second term, trying to cow blue states by surging military and immigration agents into their cities and insisting that anyone who doesn’t comply with federal demands will face severe consequences.\n\nImmigration operations that started last summer in liberal strongholds such as Chicago,Los Angeles and Portland also generated large protests. Good is at least the fifth person killed during ICE enforcement efforts.\n\nOn Thursday, Vice President JD Vance said Good’s death was “a tragedy of her own making,” blamed “leftist ideology” and said the media had encouraged protests against Trump’s immigration crackdown.\n\nFederal investigators have Somalis in their sights\n\nThe Twin Cities operation is intertwined with a conservative effort to make Minnesota the poster child for government fraud. Though prosecutions for the fraudulent use of hundreds of millions of dollars of federal COVID-19 and health aid by social service groups began in the Biden administration, Trump and conservatives have seized on the scandal in recent weeks.\n\nIn November, Trump called Minnesota “a hub of fraudulent money laundering activity” after a report by a conservative news site, City Journal, claimed federal money was fraudulently flowing to the militant group al-Shabab. There has been little, if any, evidence, proving such a link. Nevertheless, the president said he would end Temporary Protected Status for Somalis in Minnesota.\n\nThe allegations got a new charge late last month when conservative influencer Nick Shirley posted an unconfirmed video claiming that day care centers in Minneapolis run by Somalis had fraudulently collected over $100 million in government aid.\n\nJamal Osman, a Somali immigrant and Minneapolis city councilman who lives just a few blocks from the location of the ICE shooting, said he and other prominent Somalis in the area have been swamped with angry calls and messages since Trump made his statements. The vitriol, he said, mainly comes from out of state.\n\n“We have whole groups of people who’ve never been to Minnesota,” Osman said in an interview. “Minnesota is probably one of the nicest places to live. It’s a beautiful area with very nice people and we blended in, it’s all very nice. We don’t really see bad things happening here normally.”\n\nThe Trump administration on Tuesday said is withholding funding for programs that support needy families with children, including day care funding, in five Democratic-led states over concerns about fraud. Joining Minnesota on the list were California, Colorado, Illinois and New York.\n\n‘Leave our state alone’\n\nMinnesota’s place on a list of targeted blue states is not unexpected.\n\nUnder Walz, Minnesota has become something of a beacon for liberals as an example of a state that expanded the public safety net even as the nation swung to the right. Since Trump’s first election, the state has seen large increases in education spending, free school breakfasts and lunches, and improved protection of abortion rights.\n\nTrump lost Minnesota by only 4 percentage points in 2024, making it significantly less liberal than California and New York. Still, it has been reliably Democratic throughout the Trump years, a rarity in the swingy upper Midwest.\n\nThe state’s political tilt reflects the size of the Twin Cities metro area and its robust population of college-educated liberals, which overwhelm the state’s more conservative rural reaches.\n\nIt’s the sort of cleavage that has defined national politics during Trump’s years in office.\n\n“Minnesota is a microcosm of a lot of the tensions we have in our society,” said David Schultz, a political scientist at Hamline University in St. Paul. “We’re a country that’s hugely polarized, Democrats-Republicans, urban-rural.”\n\nOn Thursday, Minnesota was an ominous indicator of the damage those divisions can inflict. Minneapolis schools remained closed after immigration agents clashed with high school students at one campus on Wednesday. The state’s National Guard remained on standby at Walz’s directive.\n\nWalz begged Trump to ease up, saying Minnesota’s residents are “exhausted” by the president’s “relentless assault on Minnesota.”\n\n“So please, just give us a break,” Walz said during a news conference Thursday. “And if it’s me, you’re already getting what you want, but leave my people alone. Leave our state alone.”\n\nRiccardi reported from Denver. Associated Press reporters Giovanna Dell’Orto, Rebecca Santana and Tim Sullivan in Minneapolis contributed.","summary":"In June, a Democratic state lawmaker and her husband were assassinated by a Trump supporter, although conservatives blame Tim Walz.","url":"https://fortune.com/2026/01/08/why-is-minnesota-the-target-trump-ice-george-floyd-somalia/","image":"https://fortune.com/img-assets/wp-content/uploads/2026/01/AP26008550504580.jpg","video":null,"publish_date":"2026-01-08 23:03:00","author":"Nicholas Riccardi,Steve Karnowski,The Associated Press","authors":["Nicholas Riccardi","Steve Karnowski","The Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.192},{"id":392134236,"title":"Spencer Pratt’s GOP registration poses early test in LA mayor’s race","text":"“It’s a nonpartisan race,” he said.\n\nLA’s mayoral election is nonpartisan, but the city is deep blue. Of the city’s 2.2 million registered voters as of October, 55 percent are Democrats and just 15 percent are Republican, with 23 percent registered no party preference.\n\nNo Republicans serve on the 15-member city council and all but one are Democrats. Bass and her allies blasted the registration history of her opponent in the 2022 election, billionaire developer Rick Caruso, who was a registered Republican and independent before becoming a Democrat shortly before entering the mayoral race. The city hasn’t had a Republican mayor since Richard Riordan left office in 2001. The last four — Bass, Eric Garcetti, Antonio Villaraigosa and James Hahn — were Democrats.\n\nLos Angeles County voter records obtained by POLITICO show that Pratt registered as an independent in July 2008 and re-registered as a Republican in August 2020. He voted in the 2008 general election but did not again in the county until 2020, the records show. He’s voted in every general election since, and voted in last November’s special election on the Proposition 50 redistricting campaign.\n\nNeither Pratt nor a representative responded to requests for comment from POLITICO Thursday. Two hours after POLITICO sent Pratt a direct message on X asking for comment on the voter records, Pratt posted about the issue on the platform.\n\n“I’ve been in the public eye most of my life and there isn’t any dirt you can find on me that hasn’t already been aired,” Pratt wrote. “Seems like the only thing people don’t know is my voter registration, so here go: I registered Republican in 2020 and never changed it. And I wasn’t going to change it now just to check a different box. This is a non-partisan race — there will be no D or R next to my name. As Mayor, I will not serve either party. I will work with anyone who wants to help the City. No labels necessary.”\n\nAs he gained attention over the past year for his tirades on the post-fire rebuild, Pratt sidestepped questions about his party affiliation. He told the Hollywood Reporter in October that his fight is not partisan, noting that most voters in the Palisades supported Kamala Harris in the last presidential election.\n\n“If Newsom and Bass were Republicans, I’d be doing the exact same thing: spitting facts,” Pratt said.\n\nNevertheless, his wildfire activism and constant attacks on a likely 2028 Democratic presidential contender has attracted interest and support from GOP and Trump administration figures.\n\nSen. Rick Scott, a Republican from Florida, is leading a congressional investigation into the Palisades fire spurred by Pratt’s work. After Pratt made his mayoral announcement Wednesday, Scott posted his support on X.\n\nEndorsements also came from Richard Grenell, a Trump special envoy, right-wing influencer Benny Johnson and both leading Republican candidates for governor, Riverside Sheriff Chad Bianco and Fox News contributor Steve Hilton.","url":"https://www.politico.com/news/2026/01/08/yes-spencer-pratt-is-a-republican-00716927","image":"https://www.politico.com/dims4/default/0617347/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F64%2Fff%2Fab10c0d248958e85a1372bc224d4%2Fcongress-california-wildfires-29882.jpg","video":null,"publish_date":"2026-01-08 22:25:00","author":"Liam Dillon","authors":["Liam Dillon"],"language":"en","category":"politics","source_country":"us","sentiment":-0.26},{"id":392024662,"title":"Sen. Susan Collins breaks with Trump over Venezuela, reasserting War Powers Act","text":"Sen. Susan Collins voted in support of a resolution Thursday reaffirming the need for congressional approval for any future military action in Venezuela.\n\nCollins was one of five Republicans to join Democrats and support advancing the war powers resolution from Sen. Tim Kaine, D-Virginia, on a 52-47 vote and ensure a vote next week on final passage. It was a rare rebuke of President Donald Trump during his second term. \n\nSen. Angus King, an independent who caucuses with the Democrats, also voted in favor of the measure, which failed to gain the support of a veto-proof two-thirds majority.\n\nCollins’ vote represents a high-profile break with Senate Republicans and with Trump, who told The New York Times in an interview Wednesday that the U.S. could oversee operations and control oil reserves in Venezuela for years.\n\nTrump took to social media to blast Collins and other Republican defectors for their “stupidity,” saying they “should never be elected to office again.”\n\nCollins is seeking her sixth term in November. Her seat is viewed as a prime pick-up opportunity for Democrats because of Collins’ low approval ratings. She’s also the only New England Republican in Congress, and the only Republican senator up for reelection in a state won by Democrat Kamala Harris in the 2024 presidential election. \n\n“Republicans should be ashamed of the senators that just voted with Democrats in attempting to take away our powers to fight and defend the United States of America,” Trump said. \n\nHer vote is also a change in position. Collins voted against a bill last year that would have required Trump to seek congressional approval prior to any military action. A spokesperson said at the time that her opposition stemmed from vague language in the bill. \n\nCollins said in a recent written statement that she supported Saturday’s successful mission to capture Venezuelan President Nicolás Maduro and his wife. She said Maduro is a “narco-terrorist and international drug trafficker” who “held power through stolen elections and horrific violence against the people of Venezuela.”\n\n“With Maduro rightfully captured, the circumstances have now changed,” Collins said. “While I support the operation to seize Nicolás Maduro, which was extraordinary in its precision and complexity, I do not support committing additional U.S. forces or entering into any long-term military involvement in Venezuela or Greenland without specific congressional authorization.”\n\nCollins noted that the resolution doesn’t affect the original removal operation. Instead, it would reaffirm the need for Trump to seek congressional approval for future military action, while leaving enough room for the president to defend the U.S. from an attack or imminent threat.\n\n“I believe invoking the War Powers Act at this moment is necessary, given the president’s comments about the possibility of ‘boots on the ground’ and a sustained engagement ‘running’ Venezuela, with which I do not agree,” Collins said. \n\n“What happens now matters greatly — both in terms of accountability for Maduro and the future of the Venezuelan people. The long-term success of this operation will depend on Venezuelans having the opportunity to run Venezuela, with the support of international and private sector partners.”\n\nKing lauded the resolution’s advance in the Senate in an interview with the Press Herald. He said a confidential briefing with Secretary of State Marco Rubio yesterday raised “more questions than answers.” He also questioned Trump’s subsequent comments suggesting a yearslong commitment in Venezuela and possible action against Greenland.\n\n“Clearly that kind of intervention in another country should have some authorization from Congress,” King said. “The resolution today passed, which has not happened in the past. And I think that suggests that the Republicans are starting to also raise concerns.”\n\nKing said the shifting rationale and the lack of a clear plan suggest that the Maduro operation was a pretext for taking over the Venezuelan oil industry. He worries the administration raising national security concerns about Greenland would be a similar pretext for natural resource extraction.\n\n“We can have national security assets in place without owning the country,” King said. “This national security argument is nonsense. It’s so clearly meaningless that it makes me think that there is, in fact, some ulterior motive, and it’s perhaps natural resources.”\n\nGov. Janet Mills, who is running in a Democratic primary to take on Collins this fall, criticized Maine’s senior senator for opposing last year’s bill only to now lend her support to the latest resolution.\n\n“Once again, she is a day late and a dollar short,” Mills said in a written statement. “Susan Collins had the chance to stand up to Donald Trump and reassert congressional authority months ago, but instead she refused, giving him the greenlight to unilaterally move us towards war in Venezuela.”\n\nMills had previously called on Collins to use her power as chair of the Senate Appropriations Committee to hold public hearings to press the administration about its future plans in the region and add language to budget bills to prevent tax dollars from funding operations in Venezuela.\n\nCollins dismissed those ideas, saying senators needed to focus on passing budget bills to avoid another government shutdown at the end of the month.\n\n“My problem with Susan Collins is that she never does the right or hard thing the first time when it’s needed most — only when it serves her politically — and we always pay the price,” Mills said. \n\nEditor’s note: This story was updated Thursday to reflect that the War Powers Act resolution still needs final approval in the Senate next week.","summary":"Maine's senior senator was 1 of 5 Republicans who helped advance the Senate resolution in a rare rebuke of the president. Gov. Janet Mills says the vote was 'a day late and a dollar short.'","url":"https://www.centralmaine.com/2026/01/08/sen-susan-collins-breaks-with-trump-over-venezuela-reasserting-war-powers-act-2/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2026/01/Senate_Judges_Bove_19006_1894b6.jpg?w=780","video":null,"publish_date":"2026-01-08 21:51:12","author":"Randy Billings","authors":["Randy Billings"],"language":"en","category":"politics","source_country":"US","sentiment":-0.156},{"id":392061698,"title":"JD Vance Predicts a Rough Road for Democrats in 2028","text":"Vice President JD Vance shared his thoughts on the two current frontrunners for the 2028 Democratic nomination in an interview with Fox News' Jesse Waters, ultimately concluding that it doesn't look good for them. Vance also pushed back on the notion that the Trump administration bears responsibility for the \"cost-of-living crisis,\" arguing that it has already taken significant steps to lower costs and reverse Biden-era policies, with more efforts underway.\n\nHe argued that “the dumbest candidate,” between California Governor Gavin Newsom and former Vice President Kamala Harris, is likely to win the nomination. \n\n“I mean, look, the Democrats have a couple of big issues,” Vance said. “One is that they lean so far into wokeism that they can’t see the obviousness of the fact, which is that Kamala Harris is not qualified to be president of the United States. That’s why she got the vice presidential nomination [in 2020]. That’s why she got the presidential nomination [in 2024]. This is who Kamala Harris is.\"\n\n“Now, the flip side is, I think you have an unbelievably corrupt and incompetent governor in Gavin Newsom,” Vance continued. “The fact that those are the two front-runners just suggests how deeply deranged the Democrat Party is. Let them fight it out, we’ll figure it out.”\n\n🚨 JUST IN: JD Vance gives his PREDICTION about who will become the 2028 Democrat nominee between Gavin Newsom and Kamala Harris\"The DUMBEST candidate will probably win.\"\"Kamala Harris is NOT qualified to be President of the United States.\"\"The flip side - you have an… pic.twitter.com/s3fnijQJ0N— Eric Daugherty (@EricLDaugh) January 8, 2026\n\nCurrently, Newsom and Harris are the top contenders for the Democratic nomination in 2028, with the California governor getting 23.6 percent support and the former vice president receiving 21.4 percent, according to a RealClearPolitics polling average. \n\nThe relationship between the two is currently tense after Harris revealed in her memoir, \"108 Days,\" which details her short-lived presidential campaign, that Newsom never returned her call after she asked for his endorsement.\n\nThe poll also shows Vance with a 37.8 percentage-point lead over his closest hypothetical rival, Donald Trump Jr.\n\n“They have nothing to actually run on or govern on,” Vance said of Democrats. “Their entire obsessive focus on that party is that they hate Donald Trump. So if they ever get power, are they going to, you know, lower Americans’ taxes? No. Are they going to make your life more affordable? No. Are they going to solve the crime crisis? No.\"\n\n“What they’re going to do is they’re going to spend all of their time and all of your money trying to get Donald Trump,” he added. “I think it’s ridiculous. I think it’s ridiculous that’s what they’re running on. But the American people are going to make this determination. I think the American people should vote for the people who want to make their life more affordable and want to make their neighborhoods safer. That’s what we’re trying to deliver every single day.”\n\nThe vice president was then asked for his thoughts on the Democrats' focus on affordability and whether or not it could be a winning issue for them.\n\n“No, I’m not worried about that for the simple reason that the cost-of-living crisis, and it is real for a lot of American families, was caused by the Democrats,” Vance said. “We haven’t even been in office for a year and you’ve already seen prices start to come down. You’ve seen rent start to come down. You’ve seen groceries leveling off. Is there more work to do? Absolutely.”\n\nEditor's Note: President Trump is leading America into the \"Golden Age\" as Democrats try desperately to stop it. \n\nHelp us continue to report on President Trump's successes. Join Townhall VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://townhall.com/tipsheet/dmitri-bolt/2026/01/08/jd-vance-predicts-who-will-be-the-democrats-nominee-in-2028-n2669102","image":"https://media.townhall.com/cdn/hodl/2025/303/4e889ca1-5781-4ebf-8551-7c744857d9e8.jpg","video":null,"publish_date":"2026-01-08 21:30:00","author":"Dmitri Bolt","authors":["Dmitri Bolt"],"language":"en","category":"politics","source_country":"us","sentiment":-0.372},{"id":392120514,"title":"Former Rep. Gabby Giffords returns to House floor on 15th anniversary of shooting","text":"By JONATHAN J. COOPER, Associated Press\n\nPHOENIX (AP) — Former U.S. Rep. Gabby Giffords returned to the House floor Thursday on the 15th anniversary of the assassination attempt that cut short her promising political career and shocked a nation that has only seen political violence worsen in the years since.\n\nGiffords held hands with her husband, Sen. Mark Kelly, as House Minority Leader Hakeem Jeffries lauded her congressional service and her advocacy for tougher gun control measures. She received a standing ovation from a few dozen lawmakers in the chamber, most of them fellow Democrats.\n\n“House Democrats stand with Gabby and with all Americans who say ‘enough is enough,’” said Jeffries, who pledged that Democrats would prioritize gun control legislation if they win the House majority in November’s midterm elections.\n\nGiffords was shot in the head on Jan. 8, 2011, while meeting with constituents at a grocery store in Tucson, Arizona. Six were killed and 12 injured in addition to Giffords, who was left with limited motion on one side and aphasia, a verbal disability.\n\nNo coherent motive has been established for the shooter, Jared Loughner, who had schizophrenia and shared a variety of disjointed, nonsensical conspiracies in his online posts. He was sentenced to life in prison after being forcibly medicated to make him competent to stand trial.\n\nThe targeting of a political event foreshadowed the rising tide of violence that has shadowed American democracy. There was the U.S. Capitol riot on Jan. 6, 2021, two attempts on Donald Trump’s life, and the killing last June of a Minnesota lawmaker and her husband.\n\nMore recently, conservative activist Charlie Kirk was assassinated while talking to college students.\n\nGiffords left Congress after the shooting to focus on her recovery, cutting short a political career that many in Arizona believe would have included a run for governor or U.S. Senate.\n\nShe went on to create, along with Kelly, a political group—now known as GIFFORDS—that lobbies for tougher gun laws and works to elect state and federal lawmakers who will support them.\n\nKelly was elected to the Senate in 2020 and was a finalist to be Vice President Kamala Harris’ running mate in the 2024 presidential election.","summary":"Giffords left Congress after the shooting to focus on her recovery.","url":"https://www.sandiegouniontribune.com/2026/01/08/congress-giffords/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2026/01/House_Giffords_98606.jpg?w=150&strip=all","video":null,"publish_date":"2026-01-08 20:53:24","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.103},{"id":392024668,"title":"Trump: Susan Collins ‘should never be elected to office again’","text":"President Donald Trump on Thursday blasted Sen. Susan Collins and four other Republicans who joined Democrats to reaffirm the need for congressional approval for further military action in Venezuela. \n\nThe Senate advanced the war powers resolution on a 52-47 vote, ensuring a vote next week on final passage of the resolution and handing Trump a rare rebuke from his own party in his second term.\n\nTrump, who will likely veto the resolution from Sen. Tim Kaine, D-Virginia, condemned the defectors for their “stupidity,” saying they “should never be elected to office again.”\n\n“Republicans should be ashamed of the senators that just voted with Democrats in attempting to take away our powers to fight and defend the United States of America,” Trump said in a social media post.\n\nIn response to Trump, Collins spokesperson Blake Kernen explained Collins’ rationale for voting for the resolution.\n\n“It’s clear the president is frustrated about today’s vote. While Senator Collins supported the operation to seize Nicolás Maduro, she has a serious disagreement with the administration over the possibility of committing additional U.S. forces or entering into any long-term military involvement in Venezuela or Greenland without specific congressional authorization,” Kernen wrote in a statement.\n\nThe other Senate Republicans called out by Trump for supporting the resolution were Lisa Murkowski of Alaska; Rand Paul of Kentucky; Josh Hawley of Missouri and Todd Young of Indiana.\n\nThe criticism comes as Collins is locked in a tough reelection battle. She’s the only Republican senator running in a state won by Democrat Kamala Harris in the 2024 presidential election and the only New England Republican left in Congress.\n\nHarris won statewide and in the more liberal 1st Congressional District, while Trump won in the more rural, conservative 2nd Congressional District. Maine is one of two states that splits electoral votes, so Harris received three votes and Trump got one.\n\nThe leading Democrats vying to take on Collins are two-term incumbent Gov. Janet Mills and Graham Platner, a combat veteran and oyster farmer whose campaign has been backed by national progressives like Sen. Bernie Sanders, I-Vermont.\n\nBoth Platner and Mills have slammed Collins for voting against a bill last year that would have limited Trump’s ability to take military action in Venezuela. \n\nMills has also criticized Collins’ personal oil investments and called on her to use her power as chair of the Senate Appropriations Committee to hold hearings to get answers from the administration. Mills also wants Collins to add language to budget bills preventing tax dollars from being used in Venezuela.\n\nCollins dismissed Mills’ suggestions, saying senators are focused on advancing budget bills to avoid another government shutdown at the end of the month.\n\nThe criticism from both sides highlights the delicate balance Collins is trying strike while seeking her sixth term in office. \n\nCollins has a complicated relationship with Trump, who has maintained a tight grip on the Republican party. She hasn’t supported any of his campaigns for president and voted to impeach him after the Jan. 6, 2021, Capitol riots. She has at times enabled his agenda, while also leaving enough room to criticize his actions.\n\nOver the summer, Collins provided a key vote to advance Trump’s One Big Beautiful Bill Act, a measure that cut taxes — largely for the wealthy — and also cut nearly a trillion dollars from Medicaid.\n\nCollins ultimately voted against the package, even though she helped secure $50 billion in funding for rural hospitals to help make up for the Medicaid cuts. Her vote resulted in a 50-50 tie that was broken by Vice President JD Vance.\n\nTrump let Collins slide that time. But that detente ended in August when Collins opposed the administration’s proposal to claw back spending previously approved by Congress. \n\n“Republicans, when in doubt, vote the exact opposite of Senator Susan Collins,” Trump said in a social media post. “Generally speaking, you can’t go wrong. Thank you for your attention to this matter and, MAKE AMERICA GREAT AGAIN!”\n\nTrump also criticized Collins in 2022 for reportedly working with Sen. Mitch McConnell, R-Kentucky, to recruit “anti-Trump candidates.” Trump called Collins “absolutely atrocious” and said he could have ousted her from her Senate seat.\n\nA month later, Trump called Collins “wacky” for leading efforts to make it harder for members of Congress to challenge election results. Collins wanted to make it clear that the vice president only has a ceremonial role in counting electoral votes. The changes were made after Trump pressured former Vice President Mike Pence to overturn the 2020 election results.\n\nEditor’s note: This story was updated Thursday to reflect that the War Powers Act resolution still needs final approval in the Senate next week.","summary":"The criticism comes amid a tough reelection battle for Collins.","url":"https://www.centralmaine.com/2026/01/08/trump-susan-collins-should-never-be-elected-to-office-again/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2026/01/Trump_96589_bf5d71.jpg?w=780","video":null,"publish_date":"2026-01-08 20:46:47","author":"Randy Billings","authors":["Randy Billings"],"language":"en","category":"politics","source_country":"US","sentiment":-0.049},{"id":392047504,"title":"How the Right-Wing Outrage Machine Prompted the Conflagration in Minnesota","text":"More than 2,000 U.S. Immigration and Customs Enforcement agents are on the ground in Minnesota in what President Donald Trump’s administration officials have called the “largest immigration operation ever.” Deployed just days ago by Trump, one agent has already shot and killed a person and federal law enforcement has deployed tear gas and pepper spray against protesters.\n\nThe massive operation and subsequent violence in Minneapolis comes against the backdrop of Trump’s announcement Tuesday that he’s freezing $10 billion in federal funds approved by Congress for child welfare programs, including Temporary Assistance for Needy Families, foster care, and childcare subsidies in Minnesota and four other blue states. \n\nThis sharp escalation in action has its roots in a yearslong law enforcement investigation into widespread fraud and misuse of federal funds in Minnesota that in late 2025 was seized upon by the right-wing misinformation machine and, this week, reached a screeching fever pitch. Minnesota Governor Tim Walz announced Monday he would not be running for reelection, in part so he could devote his time to addressing the crisis. \n\nThe journey from legitimate local and federal investigations into fraud to the so-called largest ICE operation in history, the pausing of federal funds to blue states and the end of Walz’s gubernatorial tenure is a long and tangled one. As has become common in the Trump era, a serious situation was dispersed throughout the unserious realm of right-wing media and content creation, catching the attention of the president and yielding very real consequences. \n\nHere’s the backstory you need to understand these events.\n\nHow the Scandals Started\n\nAmid the right-wing uproar, there are elements of truth: Minnesota has grappled with Medicaid fraud for more than a decade, which has been the focus of federal and state investigations and local news reporting. The schemes were further fueled by the COVID-19 pandemic, during which an influx of federal funding for social programs came with relaxed vetting standards in an effort to allow speedy access for vulnerable populations. \n\nRepublican furor over widespread fraud has also flared up periodically over the years. But it reached new heights in recent months after a wave of new claims — ranging from the well-founded to the baseless to the entirely histrionic — caught the attention of the president. \n\nSome of the first claims of fraud arose in 2015, and focused on day care centers that local authorities accused of overbilling state welfare agencies. This gave rise to an early instance of right-wing outrage, when a local Fox affiliate in 2018 speculated that hundreds of millions of dollars were being stolen from the program and sent to terrorists in Africa. State officials found that claim to be baseless. \n\nIn 2021, feds began investigating fraud claims connected to a child nutrition program. By early 2022, the FBI seized property from a nonprofit called “Feeding Our Future.” The revelation of the investigation prompted bipartisan outrage toward the fraudsters; Rep. Ilhan Omar (D-MN), for example, questioned the U.S. Department of Agriculture about the misuse of funds, asking about the investigation and steps that could be taken to prevent “fraudulent misuse of federal funding meant to feed hungry children” in the future. \n\nIn September 2022, the Department of Justice announced federal criminal charges against a network of people connected to Feeding Our Future, alleging they defrauded the government of $250 million in federal child nutrition funding, using the funds instead for mansions, cars and other lavish personal expenses. Former Attorney General Merrick Garland said the indictments represented “the largest pandemic relief fraud scheme” to date. At the time, 47 people were indicted, many, but not all of whom, were members of the Minnesota Somali community. State Republicans began pointing a finger at the governor.\n\nThe scandal continued to unfold. Even the ensuing criminal proceedings were rife with corruption, with one juror dismissed after fraud defendants tried to bribe the juror with a literal bag of cash. The Feeding Our Future scheme has proven vast and deep. Between 2023 and 2025, more indictments came down connected to the case, with the 78th person indicted this past November. It has become the poster child for Minnesota’s tangled fraud network that has so far extended to autism services, Medicaid fraud, addiction services and housing..\n\nThe state has also investigated the network. In August 2023, Minnesota Attorney General Keith Ellison charged 18 people with defrauding Medicaid of $9.5 million with fake home health care businesses. Ellison in December 2023 announced charges in what his office called the largest Medicaid fraud case it had investigated. Three people were charged in an $11 million prosecution. A June 2024 state audit found the Minnesota Department of Education had received dozens of complaints about the nonprofit and failed to oversee the distribution of the $250 million at the heart of the case.\n\nThe Politics of the Scandals\n\nState Republicans continued to use the fraud investigations and indictments as evidence of Walz’s unfit leadership. When Walz became Kamala Harris’s vice presidential candidate in August 2024, the governor became a punching bag for Republicans in the state running for local and national office. On the Hill, House Republicans subpoenaed Walz for information about his actions and responsibilities related to the Feeding Our Future scheme.\n\nIn September 2025, eight people were charged in a multi-million dollar housing fraud scheme for a state program that used Medicaid funds for certain housing services. Then-Acting U.S. Attorney for the District of Minnesota Joseph Thompson called the indictments “the first wave of charges in a massive fraud” program. The abused housing program was dissolved in late October. \n\nIn addition to the political advantages of blaming the Democratic governor, some conservatives exploited the fact that most of the people implicated in each of the fraud investigations were members of Minnesota’s Somali community. That became paramount when Trump and prominent members of the MAGA-sphere got involved. \n\nTrump Grabs the Story\n\nOn Nov. 19, City Journal, a publication produced by the conservative New York think tank The Manhattan Institute published a post co-authored by Chris Rufo, the notorious anti-woke crusader who is also a fellow at the think tank. The report alleged Minnesota fraudsters were wiring their spoils to a Somalia-based terrorism organization called Al-Shabaab, citing “federal counterterrorism sources.” Two days later, news website and television station The National News Desk — owned by the conservative Sinclair Broadcast group — covered the City Journal report. Those posts may have been what caught the president’s eye. Two hours after The National News Desk report was published, Trump posted about the Minnesota fraud investigations on Truth Social. “Minnesota, under Governor Waltz, is a hub of fraudulent money laundering activity,” Trump wrote, misspelling the governor’s name. In the same post, he said he was removing a special immigration status that covers about 700 Somalian people in the U.S., and introduced the idea that “Somali gangs are terrorizing” Minnesotans.\n\nThe Truth Social posts marked the beginning of a far-right frenzy that has seen the president and extremist influencers feed off of one another, spinning narratives and pushing policies pulsating with outrage, xenophobia and Islamophobia. On Nov. 29, the New York Times echoed Republican talking points blaming the Somali community for federal funds theft, saying that the “fraud took root in pockets of Minnesota’s Somali diaspora as scores of individuals made small fortunes.” On Dec. 1, the White House issued a one-pager about the Minnesota situation, repeatedly highlighting the ethnicity of most of the people who had been federally charged and blaming Walz.\n\nTrump on Dec. 2 deployed a first round of ICE agents — about 100 — to Minneapolis and St. Paul to target the Somali community, an official told the New York Times. All the while, legitimate federal investigations continued to play out.\n\nProsecutor Thompson is now the First Assistant U.S. Attorney for the District of Minnesota. Appointed by Trump, Thompson has served as a longtime prosecutor. On Dec. 18, he charged five new people in the housing program Medicaid fraud scheme. Thompson said more than $9 billion in federal funds may have been stolen from Minnesota. \n\n“The magnitude cannot be overstated,” Thompson said. “What we see in Minnesota is not a handful of bad actors committing crimes. It’s staggering, industrial-scale fraud.”\n\nFollowing this announcement, the total number of people indicted in Minnesota fraud schemes reached 92. Eighty-two of those were of Somali descent, according to the U.S. Attorney’s Office for Minnesota, PBS reported. While a significant share of the scammers are Somali, the number is less than 0.1% of the entire Somali population in Minnesota, where the majority are U.S. citizens, and just about 0.03% of the Somali population nationwide, according to U.S. Census Bureau data cited by PBS.\n\nSix days later, a 23-year-old content creator dropped a 43-minute YouTube video that had the effect of planting dynamite in a minefield. In a vague Dec. 26 video, former prankster turned anti-immigrant influencer Nick Shirley visited Minnesota day care and health care centers, demanded people who appeared to work at the centers show him children, and accused the businesses of fraud. Shirley in the video is flanked by two masked men, whom he identifies as his security, and is following a man called David who purports to have papers showing evidence of fraud. The Intercept identified David as 65-year-old David Hoch, an eccentric, far-right political operative in the state.\n\nThat late December YouTube video was also lauded by Elon Musk, reposted by the Department of Government Efficiency and led Vice President JD Vance to declare Shirley deserving of a Pulitzer Prize. Trump then unleashed a torrent of retribution against Minnesota, Somalians, and Democratic states in general. \n\nIt doesn’t matter that claims made in Shirley’s video remain unfounded, and that it documents nothing untoward.\n\nIt also doesn’t seem to matter that the initial, 2018 report linking fraud in Minnesota to a Somalia-based terrorist group was debunked by the state, or that the only named source for the article told the Minnesota Star Tribune he was misquoted. (City Journal told the Star Tribune it stands by its reporting.)\n\nTrump has since early December used the fact that the majority of the defendants in each of these fraud cases were members of the Minnesota Somali community as ammunition, opening a dark new chapter in his signature anti-immigration crackdown.","summary":"More than 2,000 U.S. Immigration and Customs Enforcement agents are on the ground in Minnesota in what President Donald Trump’s...","url":"https://talkingpointsmemo.com/news/how-the-right-wing-outrage-machine-prompted-the-conflagration-in-minnesota","image":"https://talkingpointsmemo.com/wp-content/uploads/2026/01/GettyImages-2254655975.jpg","video":null,"publish_date":"2026-01-08 20:46:09","author":"Layla A. Jones","authors":["Layla A. Jones"],"language":"en","category":"politics","source_country":"US","sentiment":-0.179},{"id":392151196,"title":"The FBI Is Already Obstructing the ICE Shooting Investigation. It Might Not Matter.","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nThe first year of President Donald Trump’s second term in office has seen him unleash heavily armed Immigration and Customs Enforcement and Customs and Border Protection agents in Democratic-leaning cities such as Los Angeles, Chicago, and Minneapolis in what clearly appears to be a campaign of harassment and intimidation aimed at punishing those cities for their citizens’ political views. These officers’ behavior has been violent enough that Illinois Gov. J.B. Pritzker recently established a commission to look into charging federal agents in state court for their actions. So far, however, despite a growing list of violent and threatening acts by ICE and CBP, no local prosecutor in any city that ICE and CBP has “blitzed” has filed charges against any federal officers.\n\nThat may now change. On Wednesday, an ICE officer shot and killed Renee Nicole Good, a 37-year-old widowed mother of a now-orphaned 6-year-old child, whose car was blocking theirs. While the Department of Homeland Security quickly claimed the officer was acting in self-defense—DHS Secretary Kristi Noem hyperbolically said the officer was defending himself against “domestic terrorism”—cellphone videos taken by people on the scene tell a much different story. The officers aggressively approached the car, and none of the officers involved appear to be in much risk of harm before one opens fire at almost point-blank range, firing multiple shots through the window of the car, striking Good in the head and killing her. Minnesota Gov. Tim Walz has already said the state will “ensure there is a full, fair, and expeditious investigation to ensure accountability and justice.” And the Minneapolis police chief has likewise called for an investigation in a statement that put Good’s life, not the officer’s safety, in the foreground. All this certainly seems to suggest there is a real chance that local officials are open to arresting the still-unnamed ICE officer and charging him with homicide.\n\nWhich, to be clear, they legally can do. Back in October, Stephen Miller, the White House deputy chief of state for policy who is the driving force behind the current militaristic deployment of ICE and CBP, publicly told ICE officers during a Fox News interview that local officials could not even stop them, much less arrest them. But he is wrong. While it is true that federal courts have read the U.S. Constitution’s “supremacy clause” to give federal law enforcement a lot of protection from local charges, that protection can disappear if those officers act too recklessly, as is certainly plausible here.\n\nIt is also important to note that the claim made on Thursday by Noem that the FBI is excluding Minnesota authorities from the investigation because only the FBI has jurisdiction is completely incorrect as well. The FBI’s own website acknowledges that it cannot “take over” investigations from local authorities.\n\nSo the question now becomes not whether local officials can prosecute the ICE agent, but whether an investigation yields proof a crime was committed and they have the political desire to follow through with charges. At the investigatory level, it is not promising that the Minnesota’s state-level Bureau of Criminal Apprehension announced that it was no longer investigating the shooting due to the FBI’s refusal to cooperate, a choice that is not legally required by the FBI’s obstructive actions. But the Minneapolis Police Department, which is ultimately under the control of a clearly angry Mayor Jacob Frey, is still free to conduct its own investigation.\n\nPerhaps more important, there is certainly evidence to suggest that the Hennepin County Attorney Mary Moriarty—who can bring charges even without any arrest—is not one to back down from a case like this. The former chief public defender for Hennepin County (the home of Minneapolis), she ran as a reform candidate for the top prosecutor job in 2022; one of her platform’s positions was the need to better hold police accountable for misconduct, including charging them when they break the law.\n\nSince taking office, she has sought to do so, if perhaps sometimes arguably too aggressively. In 2024, she found herself caught up in a controversy over charging a state trooper, Ryan Londregan, with homicide when he shot and killed Ricky Cobb II during a traffic stop. Londregan shot and killed Cobb when, he claimed, Cobb was reaching for his gun during a struggle during the stop. While Moriarty pushed for charges, she eventually had to hire outside counsel to pursue the case because allegedly no prosecutors in her own office were willing to. At one point the state attorney general, Keith Ellison, said he was keeping tabs on the case in case he needed to step in to deal with it himself, likely out of concern that Moriarty was being overly aggressive. Tellingly, the state police union, the MPPOA, asked for Ellison—the man whose office convicted Derek Chauvin for the murder of George Floyd—to intervene, although Moriarty eventually dropped the charges on her own.\n\nIn other words, Moriarty does not appear to be one who would back down from a fight here. And it is a fight that will likely be politically popular. ICE is deeply unpopular nationwide. The only federal agency that is liked less is the IRS. And despite a massive media and sign-on incentive campaign fueled by billions of unrestricted dollars that Trump’s “One Big Beautiful Bill” gave ICE, the agency has struggled to find people willing to join it. Moreover, Moriarty represents the people of Hennepin County, where Kamala Harris defeated Trump in 2024 by over 40 points, and ICE is absolutely detested by Democrats and independents. In a November 2025 YouGov poll, 85 percent of Democrats and 62 percent of independents said they “somewhat or strongly disapprove” of ICE. And while GOP support for ICE remains quite high, we saw in Chicago that even Republicans seem to tire of ICE when it arrives in their communities.\n\nOne important caveat: The political upside is not directly relevant for Moriarty, since she announced this summer that she is not running for reelection. But she said that she was declining to run because she wanted the rest of her term to be about putting criminal legal reform in a good light and felt controversies around her distracted from that, so the politics of charging an ICE officer likely still matter to her. And the outrage already clearly brewing in Minneapolis makes it clear that the people of Hennepin are demanding accountability.\n\nIt’s also worth asking why we haven’t seen any similar efforts to prosecute federal officers in other strongly Democratic-leaning counties that have seen aggressive, violent ICE and CBP enforcement. Part of it is likely just the nature of the cases: The other lethal shootings have seemed more ambiguous, and the returns on going after nonhomicide assaults—even egregious ones like sniping a reverend in the head with a pepper ball—may not justify the unavoidable challenges of trying to convict federal officials on state charges.\n\nBut part of it may also be that we are seeing some of the costs of the Democrats’ only-lukewarm embrace of criminal legal reform. In 2024, a tough-on-crime Democrat, who received the endorsement of the local police union, squeaked out a razor-thin win over a more reform-minded candidate in the primary for Cook County state’s attorney, leaving Chicago with a prosecutor disinclined to go after the police in general as “Operation Midway Blitz” kicked off. And in Los Angeles, reformer George Gascón lost his reelection campaign in 2024 to a former federal prosecutor who has often remained distinctly quiet in the face of aggressive ICE behavior. By electing prosecutors less willing to confront police misconduct, two cities hit hard by ICE also found themselves with prosecutors less willing to stand up against ICE for them. (At least in California, however, the state attorney general still has the freedom to step in to pick up any perceived slack; the Illinois attorney general has less power in this regard.)\n\nBut whatever hesitancy we have seen elsewhere, it’s certainly possible that Minneapolis will be the first city to push back against the current right-wing authoritarianism in D.C. by indicting one of its federal agents for murder. The video evidence is shocking, the public outrage in Minneapolis and beyond is growing, and the city happens to be home to a prosecutor who has spent her legal career fighting police violence.","summary":"Hennepin County Attorney Mary Moriarty can bring charges even without any arrest and is not one to back down from a case like this.","url":"https://slate.com/news-and-politics/2026/01/fbi-minneapolis-investigation-ice-shooter-noem-lies.html?via=rss","image":"https://compote.slate.com/images/d4b0d005-46ff-4a67-90f7-a3116d945283.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2026-01-08 19:22:26","author":"John Pfaff","authors":["John Pfaff"],"language":"en","source_country":"US","sentiment":-0.243},{"id":392004072,"title":"JD Vance Predicts 2028 Democrat Presidential Nominee — His Pick Is Hilarious and Spot On","text":"I mean, look, the Democrats have a couple of big issues. One is that they lean so far into wokeism that they can’t see the obviousness of the fact, which is that Kamala Harris is not qualified to be president of the United States. That’s why she got the vice presidential nomination [in 2020]. That’s why she got the presidential nomination [in 2024]. This is who Kamala Harris is.\n\nNow, the flip side is, I think you have an unbelievably corrupt and incompetent governor in Gavin Newsom. The fact that those are the two front-runners just suggests how deeply deranged the Democrat Party is. Let them fight it out, we’ll figure it out.\n\nCalifornia, under Governor Gavin Newscum, is more corrupt than Minnesota, if that’s possible??? The Fraud Investigation of California has begun. Thank you for your attention to this matter! President DONALD J. TRUMP\n\nThey have nothing to actually run on or govern on. Their entire obsessive focus of that party is they hate Donald Trump. So if they ever get power, are they going to, you know, lower Americans’ taxes? No. Are they going to make your life more affordable? No. Are they going to solve the crime crisis? No.\n\nWhat they’re going to do is they’re going to spend all of their time and all of your money trying to get Donald Trump. I think it’s ridiculous. I think it’s ridiculous that’s what they’re running on.\n\n The dumbest candidate will probably win, [is] my guess, with the Democratic Party.","url":"https://redstate.com/mike_miller/2026/01/08/vance-predicts-wholl-win-2020-democrat-nomination-and-why-which-is-both-hilarious-and-spot-on-n2197906","image":"https://media.townhall.com/cdn/hodl/2026/5/9d187eb0-b640-4453-b710-775a8bc7b9e2.jpg","video":null,"publish_date":"2026-01-08 18:55:09","author":"Mike Miller","authors":["Mike Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.739},{"id":392061732,"title":"Leftist Shill Mehdi Hasan Wants the Next Democratic President to Do What?","text":"Leftist shill Mehdi Hasan is hoping the next Democratic president will be a full-out fascist who weaponizes the government against Republicans, and he's not shy about saying it out loud.\n\nWhy we tolerate this subversive Islamist’s continued presence in the United States is a mystery to meDenaturalize and deport Mehdi Hasan https://t.co/iUokSW2g43— Will Chamberlain (@willchamberlain) January 7, 2026\n\n\"I think the next Democratic president has to be ruthless,\" Hasan said. \"Not just the next president, next presidential candidate. The 2028 Democratic primaries have to showcase a group of politicians who are running for office to not just fix things, not just offer a bright new future, not just running on a change platform, but are running on a platform to prosecute and punish the people who broke the law, destroyed our country, destroyed our democratic fabric, destroyed society. I mean, turned people against one another.\"\n\nDoes he mean prosecute Democrats like Tim Walz, Kamala Harris, and Joe Biden? All of them have broken the law and destroyed our democratic fabric. They nominated Kamala to replace Biden in the election without her getting a single primary vote. That doesn't seem very democratic to us.\n\nAs for turning people against one another? Yep, also Democrats, who have spent the last decade calling Republican voters garbage, domestic terrorists, and white supremacists.\n\n\"What we saw over Christmas with the Somali fraud nonsense, the video from this right-wing YouTuber that went viral,\" Hasan continued. \"All these people jumping on, attacking the Somali community. That is all engineered by people like Elon Musk. The algorithm does that.\"\n\nWhat a revealing statement. Hasan, like all Leftists, hates that they don't have a stranglehold on social media so people actually see what's going on in the world. We wouldn't know about the Somali fraud, nor would we see videos from what really happened in Minneapolis, if guys like Hasan had their way.\n\n\"And I think, I said this recently,\" Hasan added, \"to Jon Favreau on Twitter...I'm only half joking when I say this, which is the next Democratic president should run on a plan to prosecute Elon Musk.\"\n\n(If you choose to watch the video, Hasan says this at 0:51, and watch the face of his fellow podcaster.)\n\n\"I mean, they would easily go to the top of the pack,\" Hasan continues, \"They would immediately go to the top of the polls in the Democratic race. The first Democrat who comes out and says, 'My first act as President is to prosecute Elon Musk,' now people will say, 'Oh, you're politicizing.' That ship has sailed. Republicans have no grounds to bring that up, and any Democrat who brings it up, they're living in the wrong world, right?\"\n\nThe only person who would be impressed by a candidate vowing to prosecute Elon Musk is Hasan himself. Most voters would be put off by such a statement, and would likely care more about the economy, crime, and other issues.\n\n\"There has to be accountability,\" Hasan said. \"It cannot be another 2009 in 2029; 20 years after Barack Obama came to office and said, 'Oh, we tortured some folks, but it's time to look forward, not back.' And then Obama prosecuted no one, no major banker for the bank frauds, no Bush politician for the torture at Abu Ghraib and Guantanamo Bay. Can't do that again in 2029.\"\n\nPerhaps Obama was right about that, and Hasan is too thick to understand why.\n\n\"The Democratic president, if he or she wins, in January 2029, is inaugurated, has to come in with a day-one plan for accountability, has to run on accountability, has to pledge accountability,\" Hasan said. \"He has to put the fear of God into their Republican opponents.\"\n\nThat's rich coming from a guy who not two minutes ago called the Somali fraud scandal \"nonsense\" and refuses to demand accountability. \n\nHasan doesn't want accountability. He wants political retribution, and as Will Chamberlain said, Hasan needs to go.\n\nWhy are Dems so hellbent on subverting justice? “Run on a plan to prosecute Elon,” for what? It’s blatant socialist thinking, show me the man I’ll show you the crime.This is the actual weaponization they accuse Trump of doing and they don’t even bat an eye. Sick.— justathreeringcircus (@ezroll234) January 7, 2026\n\nEverything the Democrats do is pure projection.\n\nEditor’s Note: Do you enjoy Townhall’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin Townhall VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://townhall.com/tipsheet/amy-curtis/2026/01/08/hassan-republican-threats-n2669024","image":"https://media.townhall.com/cdn/hodl/2022/264/8fdd0c2a-50d6-48ce-9cbf-59128025c7e9.png","video":null,"publish_date":"2026-01-08 18:30:00","author":"Amy Curtis","authors":["Amy Curtis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.434},{"id":392155036,"title":"California Rep. Julia Brownley is latest Democrat to announce retirement","text":"Democratic Rep. Julia Brownley announced Thursday that she wouldn’t seek an eighth term this year, opening up a deep-blue Southern California seat north of Los Angeles. \n\nBrownley, 73, joins a wave of older Democrats opting to retire in 2026. They include former Speaker and fellow Californian Nancy Pelosi and Reps. Steny H. Hoyer of Maryland, Jerrold Nadler of New York, and Jan Schakowsky and Danny K. Davis of Illinois.\n\nIn a statement released Thursday, Brownley called her tenure in Congress “the honor of a lifetime” and pledged to continue serving her constituents in California’s 26th District.\n\n“With another year remaining in my term, I will continue working every day to deliver results for our region, advance legislation that improves the lives and livelihoods of people in my district and across our country, and stand up for the values and priorities my constituents sent me here to defend,’’ she said.\n\nBrownley’s decision drew praise from the president of Run for Something, which backs progressive candidates 40 and under. In a social media post, Amanda Litman, who has publicly called on Democrats over 70 to consider stepping aside, thanked the congresswoman for her leadership “and for knowing when it’s time to pass the torch.’’ \n\nBrownley began her political career as a member of the Santa Monica-Malibu school board, serving for 12 years before successfully running for the State Assembly in 2006. \n\nShe was first elected to the House in 2012 from what was then a swing district. But she’s comfortably won reelection for nearly a decade as the area shaded heavily blue during the Trump era. \n\nThe partisan leanings of the coastal 26th District, which includes the cities of Oxnard and Thousand Oaks, didn’t shift significantly under the new map California voters approved via a ballot measure last fall. The redrawn seat would have backed Kamala Harris by 15 points, according to calculations by Inside Elections with Nathan L. Gonzales. \n\nUnlike some long-serving colleagues, Brownley had not drawn a high-profile Democratic challenger. But the now-open seat is likely to spark interest from Democrats. Shortly after Brownley’s announcement, California State Assembly Member Jacqui Irwin filed paperwork for the seat with the Federal Election Commission. Irwin, the former mayor of Thousand Oaks, told Politico she was “the most obvious person to run for that seat.”\n\nUnder California election rules, all candidates will run on the same ballot during the June 2 primary, with the top two vote-getters, regardless of party, advancing to the general election.\n\nA focus on veterans\n\nIn Congress, Brownley built her legislative portfolio on veterans’ issues, especially those affecting women. \n\nA member of the Veterans’ Affairs Committee since her freshman term, she serves as top Democrat of its Health Subcommittee. In her fourth term, she introduced a legislative package aimed at expanding women’s health care access at VA facilities. Her bill was ultimately folded into a separate veterans care bill. Brownley also authored legislation that would increase breast cancer screening access for veterans. An identical bill in the Senate, carried by former Montana Sen. Jon Tester, was signed into law.\n\nShe criticized the Trump administration’s recent proposal to eliminate abortion care and counseling at veterans health clinics. The ban took effect in December.\n\n“Veterans should be able to make personal decisions about their health without any interference from politicians,” Brownley said during a September news conference. “Their access to care should not shift with every administration.”\n\nBrownley also serves on the Natural Resources and Transportation and Infrastructure committees and is a member of the center-left New Democrat Coalition.\n\nNick Eskow contributed to this report.","url":"https://rollcall.com/2026/01/08/julia-brownley-retire-california-democrat-election/","image":"https://rollcall.com/app/uploads/2026/01/house_votes_203_072325.jpg","video":null,"publish_date":"2026-01-08 16:55:57","author":"Posted January 8, 2026 At 4:55pm","authors":["Posted January 8, 2026 At 4:55pm"],"language":"en","source_country":"us","sentiment":0.08},{"id":392001070,"title":"EXCLUSIVE: Tom Tiffany Touts Multi-Million-Dollar Haul To Flip Wisconsin Red","text":"Republican Wisconsin Rep. Tom Tiffany and allied groups are raking in campaign cash to propel his bid of becoming his state’s next governor.\n\nTiffany has raised $2 million since entering the critical swing state’s gubernatorial contest in September, his campaign exclusively told the Daily Caller News Foundation. The Wisconsin College Republicans, a pro-Tiffany group pledging to help elect him in November, has also raised $1 million this cycle. (RELATED: Clear GOP Frontrunner Emerges For Wide Open Governor Race, Polling Shows)\n\nTiffany, 68, who represents a vast swath of northwestern Wisconsin, is viewed as the clear frontrunner in the state’s Aug. 11 Republican primary.\n\nTiffany’s campaign did not disclose a cash on hand number ahead of the state’s Jan. 15 filing deadline. Donations came from all 72 counties in the state, according to a campaign official.\n\nThe candidate is touting his fundraising numbers as mostly grassroots and said his campaign is focused on improving education and affordability in the Badger State.\n\n“While Democrats rely on Hollywood donors and coastal elites, we are building a movement powered by the People of Wisconsin that is focused on better schools, lower taxes and restoring affordability after seven years of failure under Governor [Tony] Evers and Wisconsin Democrats,” Tiffany said in a statement. “[I] look forward to sharing a vision that reverses declining education outcomes, lowers electricity rates and property taxes and ensures Wisconsinites from young families to seniors on fixed incomes can afford to call Wisconsin home.”\n\nTiffany holds a commanding lead over Republican candidate Josh Schoemann, Washington County’s executive, ahead of the August 2026 primary, according to a Marquette University poll released in late October. The survey found 23% of GOP primary voters support Tiffany, followed by Schoemann at 6%, though roughly 70% of respondents were undecided.\n\nPresident Donald Trump has yet to publicly back a candidate in the race. An August survey from Republican firm Fabrizio, Lee & Associates, first reported by the DCNF, found that a Trump endorsement would widen Tiffany’s lead over the rest of the primary field.\n\nTrump narrowly defeated former Vice President Kamala Harris in the Badger State by roughly 30,000 votes in 2024. Wisconsin was the closest state of the presidential contest by percentage margin.\n\nTiffany boasts support from major Wisconsin law enforcement groups, including the Milwaukee Police Association and the Kenosha Professional Police Association Board of Directors. Every Wisconsin GOP member of Congress is backing his campaign.\n\nHe is also courting young conservatives in his bid to succeed Democratic Wisconsin Gov. Tony Evers, who announced in July he would not seek a third term. Tiffany was the first candidate Wisconsin College Republicans endorsed in the 2026 cycle. Tiffany also spoke at Turning Point USA’s AmericaFest in December.\n\n“After the horrific assassination of Charlie Kirk, a fire was lit inside every one of us. It reminded us that the future of Wisconsin is in our hands, and we refuse to sit on the sidelines,” Wisconsin College Republicans Chair Nicholas Jacobs said in a statement. “We are prepared to work night and day to take Wisconsin back to the top.”\n\nFormer Democratic Wisconsin Lieutenant Governor Mandela Barnes launched a bid for the open seat in December. Barnes narrowly failed to unseat Republican Wisconsin Sen. Ron Johnson in 2022 during which he faced scrutiny for previously supporting defunding the police, abolishing Immigration and Customs Enforcement (ICE) and ending cash bail.\n\nDemocratic Wisconsin Lt. Gov. Sara Rodriguez and Milwaukee County Executive David Crowley are also vying for the Democratic nomination among other lesser-known candidates.\n\nTiffany first won election to the House in 2020 and is a member of the conservative Republican Study Committee.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'we are building a movement powered by the People of Wisconsin'","url":"https://dailycaller.com/2026/01/08/tom-tiffany-fundraising-wisconsin-governor/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FTom-Tiffany-e1767873855312.jpeg","video":null,"publish_date":"2026-01-08 14:06:11","author":"Adam Pack","authors":["Adam Pack"],"language":"en","source_country":"us","sentiment":-0.352},{"id":392013396,"title":"Trump’s 'America First' is now just imperialism","text":"In early 2025, before Donald Trump was even sworn into office, he sent a plane with his name in giant letters on it to Nuuk, Greenland, where his son, Don Jr., and other MAGA allies preened for cameras and stomped around the mineral-rich Danish territory that Trump had been casually threatening to invade or somehow acquire like stereotypical American tourists — like they owned it already.\n\n“Don Jr. and my Reps landing in Greenland,” Trump wrote. “The reception has been great. They and the Free World need safety, security, strength, and PEACE! This is a deal that must happen. MAGA. MAKE GREENLAND GREAT AGAIN!”\n\nUpon returning, one of Trump’s so-called reps, an influential MAGA podcaster, told his audience that it was absolutely imperative that America acquire Greenland. Why?\n\n“It makes America dream again, that we’re not just this sad, low-testosterone, beta male slouching in our chair, allowing the world to run over us. It is the resurrection of masculine American energy. It is the return of Manifest Destiny.”\n\nWow. What an endorsement.\n\nThe idea that America is, essentially, owed Greenland as ordained by God, and that acquiring it was going to accomplish nothing short of resurrecting both the American dream and “masculine American energy” was quite the preposterous promise. But it was made in earnest by someone Trump voters loved and trusted: Charlie Kirk.\n\nIt was a huge shift in a very short period of time from the way Kirk and other MAGA acolytes had been talking. Kirk had long bought into Trump’s “America First” marketing pitch, and he often used it as a cudgel against all sorts of liberal ills.\n\n“American citizens should come first,” he’d insist, arguing for a total halt to immigration at times. “The last thing America needs right now is a new war,” he’d argue as it pertained to foreign policy and meddling in other countries’ affairs. He believed the United States was founded as an America First Christian nation. And he warned that a vote for Kamala Harris was a vote for WWIII.\n\nAs Trump touted an end to “forever wars” while on the campaign trail, Kirk and others in the manosphere — including previously Trump-skeptical media personalities — decided America First was Trump’s calling card, his raison d’être, his most compelling doctrine. \n\nGone were the days of George W. Bush’s cowboy neoconservatism — real men minded their own business. And if you couldn’t abide the other more sordid stuff — say, the fact that Trump was a convicted criminal — putting an end to America’s interventionist foreign policy should trump it all.\n\nThat was the pitch to voters made for years by MAGA influencers who promised nothing was more morally imperative than America retreating from the world.\n\nUntil it wasn’t.\n\nAbandoning MAGA principles\n\nKirk was hardly alone in flipping the script to suddenly defend the thing they’d been told would never happen. Now, they were telling us, intervention, threatening to invade sovereign nations, maybe even getting involved in some foreign wars, and even Trump’s tariffs — an economic interventionist policy — were not only OK, they were crucial to making America great again. (And men, too.)\n\nThe shameless abandonment of principles is so utterly comical in its scope and speed, calling it “hypocrisy” almost gives it too much intellectual heft. They simply don’t care.\n\nThis week Sen. Rick Scott, R-Florida, is boasting that Trump, in addition to toppling the Nicolás Maduro regime in Venezuela, will also see to the toppling of the Cuban government “this year,” after spending years touting Trump’s America first agenda.\n\nSen. Lindsey Graham, another of Trump’s America First foot soldiers, is now brazenly warning the leader of Iran that Trump is going to kill him — “Change is coming to Iran.”\n\nAfter lambasting just two months ago our “endless cycle of regime change,” Tulsi Gabbard, the U.S. director of National Intelligence, is now offering “kudos” to the Trump administration for the capture of Maduro in a constitutionally questionable operation that ended with Trump insisting “we’re in charge” now.\n\nThese people were either never serious about America First, ending forever wars, and minding our business, or they are so wholly owned by Trump that his unhinged whims just matter more.\n\nBut as he threatens to take Greenland and Canada and invade Colombia and Mexico and Cuba, it’s very clear Trump was never serious about America First. Just as he was never serious about releasing the Epstein files. Or making America affordable again. Or draining the swamp. Or replacing Obamacare. Or myriad other slick slogans he pitched to get elected.\n\nBut are his voters serious about America First? While MAGA falls in line to defend Trump’s imperialist warmongering and oil-grabbing, many of his voters did not sign up for this. Midterms are around the corner. We’ll know their answer soon enough.\n\nS.E. Cupp is the host of “S.E. Cupp Unfiltered” on CNN.","url":"https://chicago.suntimes.com/columnists/2026/01/08/donald-trump-america-first-imperialism-maduro-invasion-venezuela-greenland-charlie-kirk-cupp","image":"https://cst.brightspotcdn.com/dims4/default/aa437f9/2147483647/strip/false/crop/7680x5120+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F7c%2F12%2F485ad4d84438970fc34c90326678%2F22543","video":null,"publish_date":"2026-01-08 13:16:49","author":"S. E. Cupp","authors":["S. E. Cupp"],"language":"en","category":"politics","source_country":"us","sentiment":-0.334},{"id":392007464,"title":"Trump won't back down after the Minnesota shooting","text":"So much for ‘Minnesota nice’, the phrase that Midwesterners like to use to describe their calm dispositions. Three gunshots – fired point-blank in the gelid snows of Minneapolis by a federal immigration officer at Renee Nicole Good, a 37-year-old white woman and American citizen – have plunged the North Star State into renewed political turmoil. The fatal shooting took place only a few blocks from where George Floyd was killed in May 2020.\n\nIn responding to the tragedy, President Trump proceeded on his favourite premise – the best defence is a good offence. On social media, he declared that the need for the imposition of law and order by immigration and customs enforcement (ICE) was paramount: \n\nThe woman driving the car was very disorderly, obstructing and resisting, who then violently, willfully, and viciously ran over the ICE Officer, who seems to have shot her in self-defense.\n\nHomeland Defense Secretary Kristi Noem averred that the ICE agent had previously been the victim of an attempted car attack several months ago. The most subdued official was Trump’s border tsar, Tom Homan, who on CBS News called on lawmakers to ‘let the investigation play out’. As it happens, the official report on the US Customs and Border Patrol’s website indicates that ‘officers should be prohibited from shooting at vehicles unless vehicle occupants are attempting to use deadly force – other than the vehicle – against the agent.’\n\nTrump’s chief antagonist is, of course, Minnesota governor Tim Walz, the former running mate of Kamala Harris, whom he regards with particular contempt. This past Sunday, for example, the president disseminated a conspiracy theory video that falsley claimed that Walz was the moving spirit behind the assassination of Minnesota lawmaker Melissa Hortman and her husband in June last year. \n\nWalz, who recently announced that he would not seek a third term in the wake of allegations of widespread social service fraud in the state, has fired back with martial language. A day ago, he declared, ‘I don’t think any governor in history has had to fight a war against the federal government every single day.’ On Wednesday night, he asked Americans to ‘stand with us against this’, called ICE a ‘modern-day Gestapo’, and stated that he was prepared to call out the National Guard to quell any local protests that might turn violent.\n\nMinnesota Democrats are calling upon Trump to withdraw the 2,000 ICE agents that he has sent swarming into the state. But Trump is unlikely to relent. The days of ‘Trump always chickens out’ appear to be over, at least until he experiences a real setback.\n\nThe truth is that Trump is riding high. He’s invaded Venezuela. He seized a Russian-flagged tanker. He’s openly musing about seizing Greenland. He’s vowing to raise the Pentagon’s budget to $1.5 trillion (£1.1 trillion) to create a ‘dream military’. He’s given the go-ahead for passage of a draconian Russia sanctions bill in the Senate, to the delight of Senator Lindsey Graham. And he’s just terminated all food assistance to the government of Somalia.\n\nSo why would the President back down in Minnesota or other blue states? Trump reckons that he can shore up the support of Maga-world by targeting the tens of thousands of immigrants from Somalia residing in Minnesota whom he has previously dismissed as ‘garbage’. Trump doesn’t do Minnesota nice.","url":"https://spectator.com/article/trump-wont-back-down-after-the-minnesota-shooting/","image":"https://spectator.com/wp-content/uploads/2026/01/GettyImages-2255142413-e1767877264666.jpg","video":null,"publish_date":"2026-01-08 13:08:02","author":"Jacob Heilbrunn","authors":["Jacob Heilbrunn"],"language":"en","source_country":"gb","sentiment":-0.187},{"id":391986212,"title":"Pro-Life Groups Push Back on Trump's Abortion Funding Suggestion: 'No Hyde, No Deal'","text":"President Trump encouraged fellow Republicans to do what many consider the unthinkable – allow taxpayer dollars to fund abortions. He said it might be necessary to strike a new health care deal.\n\nThe health care stalemate led to the longest government shutdown in history late last year. \n\n Another failure to reach an agreement could force another shutdown. In current negotiations, Democrats insist Republicans give up the Hyde Amendment, which for the last nearly 50 years has prohibited federal tax dollars from being used to pay for most abortions. \n\nIn a surprising move Tuesday, President Trump said it might be necessary to get his health care package, which involves overhauling the Affordable Care Act, also known as Obamacare, by giving government money directly to plan participants, rather than to the insurance companies.\n\n\"Let the money go directly to the people,\" President Trump said, \"Now you have to be a little flexible on Hyde. You know that. You got to be a little flexible. You got to work something. You got to use ingenuity. You got to work. We're all big fans of everything, but you got to be flexible. You have to have flexibility.\"\n\nThe comments are a stark reversal for the president. Just days after being sworn-in to his second term, he signed an executive order calling for greater enforcement of the Hyde Amendment.\n\nKristan Hawkins, president of Students for Life of America, told CBN News there should be no flexibility on the prohibition of federal taxpayer dollars being used to pay for abortions.\n\n\"Just one year ago, we were honored to see President Trump shoring up, calling for Hyde protections, she said, \"He needs to go back to a year and review his remarks.\"\n\nHawkins said the Hyde Amendment signals a red line for most pro-life advocates.\n\n\"Since 1976, the first time we saw Hyde attached to a congressional spending resolution, it has been estimated from researchers that over two million children have been saved,\" she said, \"They've been spared the death by abortion.\"\n\nKelsey Pritchard, Susan B. Anthony Pro-Life America's communications director told CBN News a Republican forfeiture of the Hyde Amendment will hurt them in the upcoming midterm elections.\n\n\"Republican officials cannot win their races in November if they abandon their pro-life base,\" she said. \"Had one to two percent of pro- life voters stayed home in 2024, Trump would not be president right now. We would have Kamala Harris in the White House.\"\n\nWhile failing to negotiate a health care deal could mean another government shutdown, some lawmakers would prefer that to relinquishing Hyde.\n\n\"I think we've seen really great leadership from Speaker Mike Johnson, from leader John Thune in saying ,\"No Hyde, no deal,\" essentially all throughout this process,\" Pritchard said, \"And so we're hopeful that the GOP will hold strong and not compromise on Hyde.\"\n\n***Please sign up for CBN Newsletters and download the CBN News app to receive the latest news from a distinctly Christian perspective.","url":"https://cbn.com/news/health/pro-life-groups-push-back-trumps-abortion-funding-suggestion-no-hyde-no-deal","image":"/sites/default/files/media/slider/images/ljo1274trumphyde_hdv.jpg","video":null,"publish_date":"2026-01-08 12:45:57","author":"Lorie Johnson","authors":["Lorie Johnson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.234},{"id":391977632,"title":"Trump freeze on billions of child care funding becomes political cudgel for Democrats on affordability","text":"All five states will see $7.35 billion cuts to the Temporary Assistance to Needy Families program, a freeze on $2.4 billion to the Child Care and Development Fund, and $869 million to the Social Services Block Grant Program.\n\nBut in a midterm year when Democrats are itching to regain control of at least one, if not both, branches of Congress, the Trump administration risks Democrats seizing on attacking the White House for making daily life unaffordable for the average family.\n\nAlthough the cuts are in Democratic states, California and New York will feature several swing races that will determine control of the House as the GOP hopes to maintain or improve on its slim majority. \n\nTRUMP TO CUT $10 BILLION IN CHILD CARE FUNDING FOR FIVE BLUE STATES\n\n“It’s obviously going to be easy fodder for Democrats to say, ‘OK, you talked a big game about being pro-family, wanting more babies, why are you holding these programs hostage?’ And I frankly suspect that this will not persist that long,” Patrick T. Brown, fellow at the conservative Ethics and Public Policy Center, said. “It’s a very aggressive maneuver to kind of get attention and send the shock waves to the system.”\n\nDemocrats have excoriated the freeze as “downright shameful: Trump is ripping away child care and resources from states that didn’t vote for him,” according to Sen. John Hickenlooper (D-CO).\n\nGov. Kathy Hochul (D-NY) claimed the White House was aiming to “make life harder and more expensive for children and families,” while Rep. Sara Jacobs (D-CA) wrote on X that “I don’t ever want to hear any ‘pro-family’ bull**** from this Administration ever again. Cutting off $10 billion for child care in CA and 4 other blue states will make kids, parents, families, and providers suffer. This is disgusting political retribution.”\n\nKaivan Shroff, a 2024 delegate for former Vice President Kamala Harris, told the Washington Examiner that the freeze on federal funding is demonstrative of the Trump administration’s governing by revenge.\n\n“It does seem like really bad politics, and I do feel like maybe it’s also reflective of just a larger tone shift by this administration that they’re not really governing to win it seems anymore,” Shroff said. “But just to abuse, to drive the news cycle, to keep their grift going for what seems like maybe a shorter term window that they have in mind.” \n\nBrad Bannon, another Democratic strategist, similarly claimed this was “Donald Trump again, putting his own political vendetta ahead of the lives of women and children.”\n\n“And it’s a perfect opportunity to strike out against Trump for ignoring the economic realities of women and children and child care and how important that is to the economy,” he added. \n\nThe GOP clearly sees cracking down on abuse and fraud as a clear winner after reports showed that $1 billion in taxpayer money was stolen in three separate fraud schemes in Minnesota meant to support providers assisting people at risk of homelessness, provide therapy for autistic children, and feed children during the COVID-19 pandemic. \n\nBut the cuts also come as the administration and lawmakers on Capitol Hill are still hashing out next steps on the expired Affordable Care Act‘s premium tax credits, as well as the GOP still reeling over Trump’s admonition “to be flexible on Hyde,” on Tuesday, referencing the legislative provision barring federal funds from financing abortion services.\n\nDemocrats have used an affordability message, which Trump has called a “hoax,” to help win back races in several elections in 2025 and begin to reunify a fractured party, while also blaming the White House for increasing healthcare costs for the public.\n\n“For all the flak Hakeem Jeffries gets, he pretty much rolled Mike Johnson at the end of the year, won over, even some Republicans, some really pretty MAGA Republicans, to have this discharge position petition vote. So I do think they’re actually pretty effective on it, and effective messengers,” Shroff said.\n\nWhite House press secretary Karoline Leavitt defended the administration’s crackdown on the fraud in Minnesota and elsewhere during a Wednesday briefing. \n\n“When it comes to Minnesota, the fraud that we have seen, the wide scale of fraud, is really remarkable. It’s egregious,” Leavitt said. “The Department of Health and Human Services has also begun requiring a justification and photo evidence for all child care-related payments nationwide, and they required Minnesota to conduct a full audit of all child care centers. They also froze $185 million in funding to Minnesota.”\n\nThe Justice Department has charged 98 defendants in several Medicaid fraud and related case programs, with 64 of whom have been convicted, according to Leavitt. The Department of Homeland Security has also conducted investigations on the ground in Minneapolis, while the Department of Labor is reviewing Minnesota’s unemployment program.\n\n“This is an all-hands-on-deck effort from the entire administration to get to the bottom of this and to ensure that the ripping off of taxpayers in the state of Minnesota, and it won’t just be Minnesota,” she said. “It’ll be any state across this country where fraud has taken place, and we are protecting law-abiding, taxpaying American citizens.”\n\nAgriculture Secretary Brooke Rollins noted that 22 blue states have refused to share their Supplemental Nutrition Assistance Program data, impairing the agency’s ability to “figure out and ensure that those who really need these programs are actually getting these programs.” \n\n“Clearly, you all have been writing about Minnesota; California is next,” Rollins said at the briefing. “We’re looking at New York, some other states. The amount of fraud in all of these programs is absolutely stunning.”\n\nTRUMP AIRS GRIEVANCES AND PREACHES HEALTHCARE MIDTERM FOCUS AT HOUSE GOP RETREAT: ‘YOU’VE GOT TO BE FLEXIBLE ON HYDE’\n\nBut Brown, a fellow with the Ethics and Public Policy Center, cautioned that the tactics are reminiscent of the Department of Government Efficiency’s mixed results in slashing the federal budget.\n\n“This idea that because of these cases of fraud in Minnesota, we now need to just slam that red button and stop the presses and not fund these child care block grants … it’s exactly the DOGE playbook all over again,” he said. “And I do not see that as a particularly effective way of going about rooting out fraud and abuse, and I don’t expect it’ll be that effective this time either.”\n\nRepublicans and Democratic strategists claimed that Trump is simply using the power of the federal government to bend lawmakers to his will, a tactic he has employed for much of his second administration.\n\n“If blue-state governors want Washington money, they should follow federal law and policy rather than treating the Treasury as an ATM. It shouldn’t surprise anyone that Trump is using hardball tactics against Democrat governors in Democratic states,” Dennis Lennox, a GOP strategist, said. “Freezing funds forces Democrats to choose between investigating and prosecuting fraud and siding with fraud and abuse, the latter of which is hardly a winning position to take.”\n\n“It’s actually kind of brilliant on Trump’s part, because he’s not thinking electorally. He’s not thinking about the next election,” Michael Ceraso, a Democratic strategist, said. “He’s thinking about right now and what he can do to lean in and hold states that are dependent on federal resources hostage.”","summary":"Democrats quickly slammed the Donald Trump White House’s recent decision to cut $10 billion&#160;in funds for child care and social services across five states as a “vindictive” effort to harm families struggling financially. The announcement by the&#160;Department of Health and Human Services to cancel funding in California, New York, Illinois, Colorado, and Minnesota — all [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/4408285/trump-freeze-child-care-funding-democrats-affordability/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Housing_Immigrants_ff2_ICE_Immigration.webp?w=696","video":null,"publish_date":"2026-01-08 12:00:00","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.527},{"id":391967792,"title":"'Dumbest candidate will win': JD Vance mocks Harris–Newsom 2028 face-off — Here's what he said","text":"Gavin Newsom and Kamala Harris. One party, two frontrunners—and according to United States vice president JD Vance's prediction, may the “dumbest” candidate win. Yes, he actually said that.In an interview with Fox News, Vance, slamming both the candidates, said that Harris is not qualified to be the US president, and called the California Governor \"corrupt and incompetent.\" When asked who will win for the Democrats race, Gavin or Kamala, Vance said, \"The dumbest candidate will probably win, that's my guess, with the Democratic Party. I mean, look, the Democrats have a couple of big issues, and one is that they lean so far into wokeism that they can't see the obviousness of the fact, which is that Kamala Harris is not qualified to be President of the United States. That's why she got the vice presidential nomination. That's why she got the presidential nomination.\"\"This is who Kamala Harris is. Now, the flip side is, I think you have an unbelievably corrupt and incompetent governor in Gavin Newsom. The fact that those are the two frontrunners just suggests how deeply deranged the Democrat Party is. Let them fight it out,\" he added. Democratic nominee race: Gavin Newsom Vs Kamala Harris As the 2028 presidential race slowly comes into view, two of California’s most powerful Democrats—Vice President Kamala Harris and Governor Gavin Newsom—appear headed toward a potential showdown that could test friendships, loyalties and donor networks across the party. While both insist nothing is imminent, their moves suggest mutual awareness and quiet preparation. Newsom has told allies he is considering a White House run after leaving office in January 2027, while Harris remains publicly noncommittal, calling 2028 “three years from now.”Behind the scenes, however, Harris has taken steps that resemble early campaign positioning, including setting up a political action committee, reconnecting with newly elected Democrats nationwide and purchasing her own email list for roughly $7 million. Newsom’s allies, meanwhile, question whether Harris will run at all, citing her memoir 107 Days, which ruffled feathers within Democratic circles.Polls show Newsom currently enjoys more enthusiasm among California voters, but Harris retains deep institutional ties and national recognition. Should both enter the race, consultants, donors and advisers—many of whom have worked for both—could be forced into uncomfortable choices. For now, the rivalry remains polite, personal and quietly combustible.","summary":"US Vice President JD Vance ignited a political firestorm by predicting the \"dumbest\" candidate would win the Democratic presidential race, slamming both Kamala Harris as unqualified and Gavin Newsom as corrupt.","url":"https://timesofindia.indiatimes.com/world/us/unqualified-vs-corrupt-jd-vance-mocks-harrisnewsom-2028-face-off-says-dumbest-candidate-will-win/articleshow/126411831.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126412427/126412427.jpg","video":null,"publish_date":"2026-01-08 11:30:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.141},{"id":391971294,"title":"As midterms loom, Republicans in Congress are heading for the exits | Opinion","text":"The midterm elections for Congress won’t take place until November, but already a record number of members have declared their intention not to run – a total of 43 in the House, plus 10 senators. Perhaps the most high-profile person to depart, Republican Rep. Marjorie Taylor Greene of Georgia, announced her intention in November not just to retire but to resign from Congress entirely on Jan. 5 – a full year before her term was set to expire.\n\nThere are political dynamics that explain this rush to the exits, including frustrations with gridlock and President Donald Trump’s lackluster approval ratings, which could hurt Republicans at the ballot box.\n\nRather than get swept away by a prospective “blue wave” favoring Democrats – or possibly daunted by the monumental effort it would take to survive – many Republicans have decided to fold up the beach chairs and head home before the wave crashes.\n\nAs of now, two dozen Republican House members have either resigned from the House or announced their intent to not run for reelection in 2026. With only two exceptions – Republicans in 2018 and 2020 – this is more departures from either party at this point in the election calendar than any other cycle over the past 20 years.\n\nThere is also growing concern within the House Republican caucus that Greene’s announcement is a canary in the coal mine, and that multiple resignations will follow.\n\nAs a political scientist who studies Congress and politicians’ reelection strategies, I’m not surprised to see many House members leaving ahead of what’s shaping up to be a difficult midterm for the GOP.\n\nStill, the sheer number of people not running tells us something about broader dissatisfaction with Washington.\n\nMore from Freep Opinion: Trump looms over 2026, from war fears to democratic collapse\n\nWhy do members leave Congress?\n\nMany planned departures are true retirements involving older and more experienced members.\n\nFor example, 78-year-old Democratic congressman Jerry Nadler is retiring after 34 years, following mounting pressure from upstart challengers and a growing consensus among Democrats that it’s time for older politicians to step aside. Nancy Pelosi, the former speaker who will turn 86 in March, is also retiring.\n\nSometimes, members of Congress depart for the same reasons other workers might leave any job. Like many Americans, members of Congress might find something better elsewhere.\n\nRetiring members are attractive hires for lobbying firms and corporations, thanks to their insider knowledge and connections within the institution. These firms usually offer much higher salaries than members are used to in Congress, which may explain why more than half of all living former members are lobbyists of some kind.\n\nOther members remain ambitious for elective office, and decide to use their positions in Congress as a springboard for another elected role. Members of the House regularly retire to run for a Senate seat, such as, in this cycle, Democratic Rep. Haley Stevens of Michigan. Others run for executive offices, including governor, like Republican Rep. Nancy Mace of South Carolina.\n\nBut some are leaving Congress due to growing frustration with the job and an inability to get things done. Specifically, many retiring members cite growing dysfunction within their own party, or in Congress as a whole, as the reason they’re moving on.\n\nIn a statement announcing his departure in June, Sen. Thom Tillis, R-North Carolina, mused that “between spending another six years navigating the political theater and partisan gridlock in Washington or spending that time with my family,” it was “not a hard choice” to leave the Senate.\n\nMore from Freep Opinion: Trump's unauthorized Venezuela attack won't help Americans\n\nWhat’s unique about 2026?\n\nIn addition, there are a few other factors that can help explain why so many Republicans, in particular, are heading for the exits leading up to 2026.\n\nThe shifting of boundaries that has come with the mid-decade redistricting process in several states this year has scrambled members’ priorities. Unfamiliar districts can drive incumbents to early retirement by severing their connections with well-established constituencies.\n\nIn Texas, six Republicans and three Democrats – nearly a quarter of the state’s entire House delegation – are either retiring or running for other offices, due in part to that state’s new gerrymander for 2026.\n\nAll decisions about retirement and reelection are sifted through the filter of electoral and partisan considerations. A phenomenon called “thermostatic politics” predicts that parties currently in power, particularly in the White House, tend to face a backlash from voters in the following election. In other words, the president’s party nearly always loses seats in midterms.\n\nIn 2006 and 2018, for example, Republican members of Congress were weighed down by the reputations of unpopular Republican Presidents George W. Bush and Trump. Republicans had arguably even greater success in midterm elections during Barack Obama’s presidency.\n\nCurrently, 2026 looks like it will present a poor national environment for Republicans. Trump remains highly unpopular, according to polls, and Democrats are opening up a consistent lead in the “generic ballot” question, which asks respondents which party they intend to support in the 2026 midterms without reference to individual candidates.\n\nDemocrats have already been overperforming in special elections, as well as the general election in November in states such as New Jersey and Virginia, which held elections for governor. Democrats are on average running 13 points ahead of Kamala Harris’ performance in the 2024 election.\n\nAs a result, even Republicans in districts thought to be safe for their party may see themselves in enough potential danger to abandon the fight in advance.\n\nRetirement vs. resignation\n\nOne final, unique aspect of this election cycle with major consequences is not an electoral but an institutional one.\n\nHouse conservatives are quietly revolting against Speaker Mike Johnson’s leadership style. That members may be frustrated enough not just to retire but resign in advance, leaving their seats temporarily vacant, is a notable sign of dysfunction in the U.S. House.\n\nThis also could have a major impact on policy, given how slim the Republicans’ majority in the lower chamber is already. Whatever the outcome of the midterms in November, these departures clearly matter in Washington and offer important signals about the chaos in Congress.\n\nCharlie Hunt is an associate professor of political science at Boise State University. This article is republished from The Conversation under a Creative Commons license. Read the original article.","url":"https://eu.freep.com/story/opinion/contributors/2026/01/08/2026-trump-midterms-gop-congress-resigning/88072896007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/04/USAT/88017774007-usatsi-27651200.jpg?auto=webp&crop=1124,633,x0,y58&format=pjpg&width=1200","video":null,"publish_date":"2026-01-08 11:04:32","author":"Charlie Hunt, Detroit Free Press","authors":["Charlie Hunt, Detroit Free Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.003},{"id":391954292,"title":"Conventional Wisdom: Minneapolis ICE Shooting Edition","text":"On Wednesday morning in Minneapolis, an ICE agent shot and killed 37-year-old Renee Nicole Good, a U.S. citizen and who was behind the wheel of her Honda Pilot. Numerous videos are circulating online, reportedly showing the incident from multiple angles, but nevertheless the episode has become a familiar Rorschach test for a highly polarized America: President Donald Trump is calling it “self-defense“; New York City Mayor Zohran Mamdani and other Democrats are calling it “murder.“ The shooting occurred just blocks from where George Floyd was filmed dying in 2020. Kristi Noem ⬇ During her first press conference in Texas soon after the shooting, the Homeland Security Secretary claimed the incident was “an act of domestic terrorism“ after ICE officers “got stuck in the snow,“ adding, “They were attempting to push out their vehicle, and a woman attacked them, and those surrounding them, and attempted to run them over.“ Videos widely circulated on social media immediately contradicted both claims, making her initial story look as fake as the camouflage and sandbag props decorating the lectern she was delivering it from. Gregory Bovino ⬆ By the time Noem got to Minneapolis for her second press conference, this time vowing federal prosecutions for using vehicles as weapons, the Border Patrol commander was standing alongside her. After a federal judge found he lied about using tear gas in his Chicago operation, he finally got to take a break from being the craziest, most ruthless face of Trump’s immigration crackdown. Representative James Comer ⬇ While the shooting took place on Wednesday morning, the House Oversight Chairman was holding hearings on Republicans' best hit during the immigration debate: allegations of billions of welfare fraud by Somalis in Minnesota. By afternoon, the only thing anyone in Minnesota was talking about was the ICE shooting. Nothing kills a carefully choreographed scandal like an actual shooting. Governor Tim Walz ⬆ Comer and other Republicans had drawn political blood with the scandal, calling the Minnesota governor “asleep at the wheel,“ humiliating Kamala Harris’s former running mate into dropping his bid for re-election. The scandal is now pushed off the front page, and he’s vowing “a full, fair, and expeditious investigation.“ Senator Amy Klobuchar ⬆ A likely replacement for Walz on the Minnesota governor’s ticket, she issued a statement that began “I am praying for the family and loved ones of the woman who was shot and killed“ and ended without scoring political points with attacks on ICE or federal agents. In 2026, that passes for statesmanship. 'Abolish ICE' ⬆ A fringe slogan once as politically toxic as “defund the police.“ Now former Bush administration official and veteran conservative commentator Bill Kristol is saying it. The shooting accomplished what a thousand family separation protests that birthed the slogan in Trump’s first term couldn't—making a far-leftist issue respectable in neoconservative circles. Originally a staple of Newsweek's print edition, Conventional Wisdom used arrows to track whose stock was rising or falling in the political circus. We're reviving it in the digital age because the problem it lampooned—hyperbole and partisan certainty masquerading as insight—has only intensified. CW assigns arrows—up, down, or sideways—to the figures and forces shaping current events. The arrows don't predict the future or claim special insight. They capture the prevailing winds of the moment, uncluttered by tribal howling. In an era when partisan media reinforces rather than questions assumptions, CW operates from the center—skeptical of left and right alike, committed to puncturing inflated reputations and recognizing overlooked truths.","summary":"Featuring Kristi Noem, James Comer, Gregory Bovino and Tim Walz.","url":"https://www.newsweek.com/conventional-wisdom-minneapolis-ice-shooting-noem-walz-klobuchar-11327357","image":"https://assets.newsweek.com/wp-content/uploads/2026/01/CONVENTIONAL-WISDOM-01.08.26.jpeg?w=1600&h=900&q=88","video":null,"publish_date":"2026-01-08 11:00:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.222},{"id":391950970,"title":"US immigration agent fatally shoots woman in Minneapolis","text":"A US immigration agent has shot dead a 37-year-old woman in the city of Minneapolis, sparking protests overnight.\n\nFederal officials said the woman, Renee Nicole Good, had tried to run over immigration agents with her car but the city mayor said the agent who shot her had acted recklessly.\n\nVideos of the incident show ICE agents approaching a car which is in the middle of the street. As it attempts to drive off, one of them points his gun at the driver and at least two shots are heard. The FBI is investigating.\n\nHundreds of ICE agents have been deployed to Minneapolis, in the state of Minnesota, as part of the White House’s crackdown on illegal immigration.\n\nVideos posted to social media by onlookers appear to show the moment of the shooting, which occurred around 10:25 local time on Wednesday morning.\n\nFrom various vantage points, a maroon SUV can be seen blocking a residential street in Minneapolis.\n\nA crowd of people, who appear to be protesting, are lining the pavement.\n\nLaw enforcement vehicles appear nearby. ICE agents (Immigration and Customs Enforcement) pull up to the vehicle parked in the street, emerge from the truck and tell the woman behind the wheel to get out of the SUV. One of the agents tugs at the driver’s side door handle.\n\nAnother agent is positioned near the front of the vehicle.\n\nIt’s not clear exactly how close the agent is standing or whether he was struck by the vehicle based on the videos reviewed immediately by the BBC.\n\nThat agent opens fire as the maroon SUV attempts to drive off.\n\nThe vehicle can be seen losing control and crashing into a car parked nearby along the street.\n\nIn a post on Truth Social, Trump said an ICE officer was “viciously” run over. “It is hard to believe he is alive, but is now recovering in the hospital,” he wrote.\n\nThe Republican president also blamed the “Radical Left” for “threatening, assaulting, and targeting our Law Enforcement Officers and ICE Agents on a daily basis”.\n\nMinneapolis police chief Brian O’Hara said the driver was in her vehicle and was blocking the roadway on Portland Avenue. She was then approached on foot by a federal law enforcement officer, “and she began to drive off”.\n\nUS Homeland Security Secretary Kristi Noem said the woman was “stalking and impeding” officers throughout the day and tried to “weaponise her vehicle” in an attempt to run over the officer in an act of “domestic terrorism”.\n\nThe federal agent fired “defensive shots” and was himself injured, Noem said, before he was treated and discharged from a local hospital.\n\nThe Minneapolis City Council, however, said in a statement that Good was simply “caring for her neighbours” when she was shot and killed.\n\nThe same agent was also hit by a car in the line of duty in June, Noem said.\n\nShe added that ICE operations in the city would continue, and the FBI would investigate Wednesday’s incident.\n\nEmily Heller told CNN she was at home when she saw the ICE agents arguing with protesters outside. She said she heard agents shouting at a woman driving an SUV, then one agent tried to open her car door, and the driver went into reverse and began pulling away.\n\n“An ICE agent stepped in front of her vehicle and said, ‘Stop!’ and then – I mean, she was already moving – and then, point blank, shot her through her windshield in the face,” Heller told the US network.\n\nMinnesota State Governor Tim Walz also pushed back on federal accounts of the incident.\n\n“Don’t believe this propaganda machine,” Walz wrote in response to a Department of Homeland Security post about the shooting.\n\n“The state will ensure there is a full, fair, and expeditious investigation to ensure accountability and justice.”\n\nTop Democrats, including former Vice-President Kamala Harris and House minority leader Hakeem Jeffries, also released statements. Harris called the Trump administration’s version of events “gaslighting”.\n\nProtests and marches took place in several parts of the city as some outraged Minneapolis residents condemned the shooting and called for ICE to leave.\n\nThe scene of the shooting is about one mile from where George Floyd was murdered in 2020 by a city police officer, sparking worldwide anti-racism protests.\n\nProtests were being organised in other US cities, including New Orleans, Miami, Seattle and New York City.\n\nMinneapolis Public Schools announced that classes were cancelled for the rest of the week, “due to safety concerns”. It comes after federal agents reportedly made arrests outside a high school on Wednesday.\n\nWhy is ICE in Minneapolis?\n\nThe Trump administration deployed an additional 2,000 federal agents to the Minneapolis area in recent weeks in response to allegations of welfare fraud in the state.\n\nThe mayor said in the Wednesday press conference that ICE was not making the city safer. “They’re ripping families apart, they’re sowing chaos in our streets,” he said.\n\nThe deployment, which began on Sunday, is one of the largest concentrations of Department of Homeland Security personnel in a US city in recent years.\n\nIt follows an immigration enforcement campaign launched by ICE late last year to target individuals in Minneapolis who were issued deportation orders, including members of the city’s Somali community.\n\nThat community has been criticised frequently by Trump, who has called them “garbage”.\n\n“I don’t want them in our country. I’ll be honest with you,” the president has said. “Their country’s no good for a reason. Their country stinks.”\n\nTrump later doubled-down on his remarks after a YouTube video by a conservative online content creator accused daycare centres run by Somali immigrants of mass fraud.\n\nIn response, Trump has withheld federal childcare funds from the state of Minnesota.\n\nThe Trump administration has sent ICE agents to other cities across the US, where they have made thousands of arrests as part of what the administration says is a crackdown on crime and immigrants who illegally entered the country.\n\nSOURCE: BBC NEWS\n\nSource link","summary":"A US immigration agent has shot dead a 37-year-old woman in the city of Minneapolis, sparking protests overnight. Federal officials said the woman, Renee Nicole Good, had tried to run over immigration agents with her car but the city mayor said the agent who shot her had acted recklessly. Videos of the incident show ICE [&#8230;]\n\n\nThe post US immigration agent fatally shoots woman in Minneapolis appeared first on Ghana Latest News.","url":"https://ghananewss.com/us-immigration-agent-fatally-shoots-woman-in-minneapolis/","image":"https://i0.wp.com/ichef.bbci.co.uk/news/480/cpsprodpb/da15/live/a7f140b0-ec50-11f0-813a-8fffa32ccc28.jpg.webp?w=800&ssl=1","video":null,"publish_date":"2026-01-08 10:25:12","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.534},{"id":391940152,"title":"US immigration agent fatally shoots woman in Minneapolis","text":"A US immigration agent has shot dead a 37-year-old woman in the city of Minneapolis, sparking protests overnight.\n\nFederal officials said the woman, Renee Nicole Good, had tried to run over immigration agents with her car but the city mayor said the agent who shot her had acted recklessly.\n\nVideos of the incident show ICE agents approaching a car which is in the middle of the street. As it attempts to drive off, one of them points his gun at the driver and at least two shots are heard. The FBI is investigating.\n\nHundreds of ICE agents have been deployed to Minneapolis, in the state of Minnesota, as part of the White House’s crackdown on illegal immigration.\n\nVideos posted to social media by onlookers appear to show the moment of the shooting, which occurred around 10:25 local time on Wednesday morning.\n\nFrom various vantage points, a maroon SUV can be seen blocking a residential street in Minneapolis.\n\nA crowd of people, who appear to be protesting, are lining the pavement.\n\nLaw enforcement vehicles appear nearby. ICE agents (Immigration and Customs Enforcement) pull up to the vehicle parked in the street, emerge from the truck and tell the woman behind the wheel to get out of the SUV. One of the agents tugs at the driver’s side door handle.\n\nAnother agent is positioned near the front of the vehicle.\n\nIt’s not clear exactly how close the agent is standing or whether he was struck by the vehicle based on the videos reviewed immediately by the BBC.\n\nThat agent opens fire as the maroon SUV attempts to drive off.\n\nThe vehicle can be seen losing control and crashing into a car parked nearby along the street.\n\nIn a post on Truth Social, Trump said an ICE officer was “viciously” run over. “It is hard to believe he is alive, but is now recovering in the hospital,” he wrote.\n\nThe Republican president also blamed the “Radical Left” for “threatening, assaulting, and targeting our Law Enforcement Officers and ICE Agents on a daily basis”.\n\nMinneapolis police chief Brian O’Hara said the driver was in her vehicle and was blocking the roadway on Portland Avenue. She was then approached on foot by a federal law enforcement officer, “and she began to drive off”.\n\nUS Homeland Security Secretary Kristi Noem said the woman was “stalking and impeding” officers throughout the day and tried to “weaponise her vehicle” in an attempt to run over the officer in an act of “domestic terrorism”.\n\nThe federal agent fired “defensive shots” and was himself injured, Noem said, before he was treated and discharged from a local hospital.\n\nThe Minneapolis City Council, however, said in a statement that Good was simply “caring for her neighbours” when she was shot and killed.\n\nThe same agent was also hit by a car in the line of duty in June, Noem said.\n\nShe added that ICE operations in the city would continue, and the FBI would investigate Wednesday’s incident.\n\nEmily Heller told CNN she was at home when she saw the ICE agents arguing with protesters outside. She said she heard agents shouting at a woman driving an SUV, then one agent tried to open her car door, and the driver went into reverse and began pulling away.\n\n“An ICE agent stepped in front of her vehicle and said, ‘Stop!’ and then – I mean, she was already moving – and then, point blank, shot her through her windshield in the face,” Heller told the US network.\n\nMinnesota State Governor Tim Walz also pushed back on federal accounts of the incident.\n\n“Don’t believe this propaganda machine,” Walz wrote in response to a Department of Homeland Security post about the shooting.\n\n“The state will ensure there is a full, fair, and expeditious investigation to ensure accountability and justice.”\n\nTop Democrats, including former Vice-President Kamala Harris and House minority leader Hakeem Jeffries, also released statements. Harris called the Trump administration’s version of events “gaslighting”.\n\nProtests and marches took place in several parts of the city as some outraged Minneapolis residents condemned the shooting and called for ICE to leave.\n\nThe scene of the shooting is about one mile from where George Floyd was murdered in 2020 by a city police officer, sparking worldwide anti-racism protests.\n\nProtests were being organised in other US cities, including New Orleans, Miami, Seattle and New York City.\n\nMinneapolis Public Schools announced that classes were cancelled for the rest of the week, “due to safety concerns”. It comes after federal agents reportedly made arrests outside a high school on Wednesday.\n\nWhy is ICE in Minneapolis?\n\nThe Trump administration deployed an additional 2,000 federal agents to the Minneapolis area in recent weeks in response to allegations of welfare fraud in the state.\n\nThe mayor said in the Wednesday press conference that ICE was not making the city safer. “They’re ripping families apart, they’re sowing chaos in our streets,” he said.\n\nThe deployment, which began on Sunday, is one of the largest concentrations of Department of Homeland Security personnel in a US city in recent years.\n\nIt follows an immigration enforcement campaign launched by ICE late last year to target individuals in Minneapolis who were issued deportation orders, including members of the city’s Somali community.\n\nThat community has been criticised frequently by Trump, who has called them “garbage”.\n\n“I don’t want them in our country. I’ll be honest with you,” the president has said. “Their country’s no good for a reason. Their country stinks.”\n\nTrump later doubled-down on his remarks after a YouTube video by a conservative online content creator accused daycare centres run by Somali immigrants of mass fraud.\n\nIn response, Trump has withheld federal childcare funds from the state of Minnesota.\n\nThe Trump administration has sent ICE agents to other cities across the US, where they have made thousands of arrests as part of what the administration says is a crackdown on crime and immigrants who illegally entered the country.\n\nSOURCE: BBC NEWS","summary":"A US immigration agent has shot dead a 37-year-old woman in the city of Minneapolis, sparking protests overnight. Federal officials said the woman, Renee Nicole Good, had tried to run over immigration agents with her car but the city mayor said the agent who shot her had acted recklessly. Videos of the incident show ICE [&#8230;]","url":"https://www.gbcghanaonline.com/world/us-immigration-agent-fatally-shoots-woman-in-minneapolis/2026/","image":"https://i0.wp.com/www.gbcghanaonline.com/wp-content/uploads/2026/01/267d1760-ec01-11f0-b35a-ab7e077318c5.jpg.webp","video":null,"publish_date":"2026-01-08 10:22:14","author":"Henrietta Afful","authors":["Henrietta Afful"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.534},{"id":391928298,"title":"Kai Trump opens up about ‘really awkward’ dating life with Secret Service shadowing her","text":"Kai Trump may be the president’s granddaughter, but that hasn’t stopped her from dating — even as she’s being trailed by Secret Service agents. \n\nDuring Tuesday’s episode of the Impaulsive podcast hosted by the influencer and Donald Trump supporter, Logan Paul, the 18-year-old discussed the difficulties of going about life as a teenager with the protection of a federal agency that never strays too far. \n\n“It’s tough. I’d be lying if I said it wasn’t tough,” she told Paul. “It was a big adjustment having them come in, and then having to adjust my schedule and just kind of go about my day. It’s weird when you’re just like hanging out with your friends, a group of girls, and you have like a tall guy standing like three feet behind you. It’s weird.”\n\nAs far as dating goes, the golfer said she is still adjusting to the agents’ presence. \n\n“To be honest, it’s really awkward when you’re... going on a date with a guy and they’re two tables behind you. It’s a little weird,” she said. “But I try my best not to let it bother me, and I think I’ve learned, especially in the last year now... [that] yes, they’re following me, but also to focus and pretend like they’re not there.”\n\nDuring another portion of the podcast, Trump revealed that her grandfather has no plans to run for president again. \n\nHowever, she did not completely shut down rumors that he could run for an unprecedented third term in office, noting there were still three years until the election. \n\nOn Paul’s podcast, she also lifted the lid on her feelings about former Vice President Kamala Harris, whom her grandfather defeated in the 2024 election. She told Paul that there is no “bad blood” between her and the Democrat, who is widely believed to be planning another bid for the White House in 2028.\n\n“To be honest with you, I stay out of politics completely,” Kai said when Paul asked her opinion on Harris. “Like, I would never run and I don't want anything to do with politics.\n\n“I feel like politics is such a dangerous thing, and I think if both sides met in the middle, everyone would be so much more happier, and I think there's radical left, there's radical right, and there's a lot of people who get too extreme.”\n\nShe added that she was “very much in the middle” and said Harris’s frosty relationship with her grandfather “is what it is.”","summary":"The president’s granddaughter recently made her first podcast appearance speaking to Logan Paul","url":"https://www.independent.co.uk/life-style/kai-trump-interview-dating-secret-service-b2896710.html","image":"https://static.independent.co.uk/2026/01/07/15/06/GettyImages-2246397592.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/1c4wPAYi-4VHSaSK0.mp4","publish_date":"2026-01-08 10:11:17","author":"Brittany Miller","authors":["Brittany Miller"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.214},{"id":391944234,"title":"Shapiro launches reelection bid in Pennsylvania as 2028 looms","text":"The governor’s race will determine whether Shapiro can bolster his strongest argument for being Democrats’ 2028 standard-bearer: His ability to win sweeping victories and provide coattails to down-ticket Democrats in the country’s biggest, most important swing state.\n\nThe 52-year-old moderate Democrat has methodically climbed the political ladder from congressional aide to attorney general to top state executive over a more than 20-year career in which he’s never lost a race. His 15-point landslide victory in 2022 over Republican firebrand Doug Mastriano further burnished his reputation and put him on the national political map. And his favorability ratings in the state remain unusually high in this era of partisan polarization — a reason he was on the short list to be Kamala Harris’ running mate in 2024.\n\nPennsylvania-based Democratic strategist J.J. Abbott said that if Shapiro can run up the score again in a “big, important swing state” it would be a “strong credential” for the governor should he run in 2028.\n\nShapiro is not expected to face a significant primary challenger. He’ll likely square off against Republican state Treasurer Stacy Garrity, who has the backing of the state GOP, in November, after Mastriano declined Wednesday to seek a rematch. A fall Quinnipiac University poll showed Shapiro leading Garrity by 15 points.\n\nHe starts his bid for a second term ranked as one of the 10 most popular governors in the country. He’s highly popular at home — polls conducted over the fall showed his approval rating among Keystone State voters was higher than other recent Pennsylvania governors at the same point in their first term. Sixty percent of Pennsylvania voters gave the governor a thumbs-up in a late-September Quinnipiac University poll, while 51 percent said he was doing a “good” or “excellent” job in an October Franklin and Marshall College poll — including half of independents and a quarter of Republicans.\n\nBut Republicans don’t intend to let Shapiro off easy in a race that will decide which party controls a critical swing state heading into 2028. Garrity has been working to turn scuttlebutt about Shapiro’s higher-office ambitions and his cascade of criticism of President Donald Trump into a campaign cudgel, accusing him of being more focused on his future than on Pennsylvania’s present. Shapiro is embarking on a book tour later this month for his forthcoming memoir that’s fueling speculation about his 2028 intentions.\n\nThe state party is also teasing a series “exposing the years of corruption and scandal” surrounding Shapiro. And operatives in both parties point to criticism Shapiro has faced over his handling of a sexual harassment complaint against a former top aide and the lack of transparency surrounding fixes and upgrades to the governor’s public and private residences after last year’s arson attack as potential attack lines for Republicans — and fodder for his potential 2028 rivals.","url":"https://www.politico.com/news/2026/01/08/shapiro-launches-reelection-pennsylvania-00715593","image":"https://www.politico.com/dims4/default/391a0d3/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fb5%2F2e%2F780e7ba44a1f885c7db853ef247e%2Felection-2024-harris-74541.jpg","video":null,"publish_date":"2026-01-08 10:01:00","author":"Lisa Kashinsky","authors":["Lisa Kashinsky"],"language":"en","source_country":"us","sentiment":0.286},{"id":391930204,"title":"Shapiro kicks off 2026 re-election as 2028 White House buzz swirls","text":"Pennsylvania Gov. Josh Shapiro kicked off his 2026 re-election campaign Thursday, a move seen as a potential stepping stone for a Democratic presidential run in 2028. In a re-election campaign launch video shared with Fox News Digital, Shapiro highlighted his pragmatic approach as governor to get things done for Pennsylvanians. \"We've gotten shit done all across our Commonwealth to make a real difference in people's lives. Now, Pennsylvania is open for business,\" the governor said, repeating his unofficial slogan. And Shapiro, who was high up on then-Vice President Kamala Harris's shortlist for running mate in the summer of 2024, after she replaced then-President Biden as the Democratic Party's presidential nominee, pointed to the rebuilding of an interstate overpass that collapsed in 2023, shutting down one of the nation's busiest highways. JOSH SHAPIRO DEFENDS CLAIM THAT KAMALA HARRIS TRYING TO ‘COVER HER A—’ WITH CRITICAL BOOK EXCERPT \"When disaster struck, others underestimated us. But I never did. Reopen and ready for travelers, just 12 days after a devastating collapse,\" Shaprio said in the video. \"We cut through the red tape to get I-95 rebuilt in record time. We did it using materials from a Pennsylvania business and with the muscle and know-how of Pennsylvania union workers.\" In the video, which showcases the governor's accomplishments, Shapiro also touts his bipartisan efforts, noting that \"even with a divided state legislature — together — we've gotten a whole lot done on issues that have been stuck for decades. But there's always more to do — more people to help, more Pennsylvanians to protect, more bridges to build.\" Following his video launch, the governor is scheduled to hold campaign kick-off events Thursday in Pittsburgh and Philadelphia. Shapiro's launch comes two days after his campaign showcased their war chest, announcing that the governor hauled in $10 million in fundraising in the final quarter of last year and started the new year with more than $30 million in his coffers. The governor, a former two-term Pennsylvania attorney general who defeated conservative state Sen. Doug Mastriano by 15 points four years ago in the key battleground state's gubernatorial election, is likely to face state Treasurer Stacy Garrity as his Republican challenger this November. FRAUD FALLOUT FORCES WALZ TO ABANDON GUBERNATORIAL RE-ELECTION BID Garrity, hoping to avoid an expensive and divisive primary, has already lined up endorsements and support from many Pennsylvania Republicans, including the backing of the state GOP. And Mastriano, who had been mulling a second straight bid, announced on Wednesday that he wouldn't run for governor this year. \"The truth is that Josh Shapiro ignored the problems facing hardworking Pennsylvanians to gallivant around the country to raise money from liberal billionaires,\" Matt Beynon, a top Garrity campaign adviser, told Fox News Digital. \"Less than half of 8th graders read at grade level, over 3,000 of our bridges are deficient, and Pennsylvania families have one of the highest tax burdens in the country.\" But Shapiro enters the new year with formidable approval and favorable ratings in public opinion polls, and his campaign, pointing to his fundraising, said the governor was \"in a position of unprecedented strength.\" A release from the campaign highlighted that the governor \"is reporting the most money raised and the highest ending cash balance during the off-year ahead of an election of any Pennsylvania gubernatorial campaign on record.\" DEMOCRATIC HEAVYWEIGHTS HARRIS, NEWSOM TURN HEADS, FUEL 2028 SPECULATION A sizable November victory by Shapiro in the high-profile general election swing state could give the governor momentum heading into what is likely to be a crowded and competitive race for the next Democratic presidential nomination. And that field could include candidates with much higher name recognition, including California Gov. Gavin Newsom and former Vice President Kamala Harris. \"Anybody who has shown any interest in running for president will absolutely be closely watched during this year's elections, and it's only natural that they'll be judged initially on their abilities in their home state,\" longtime Democratic strategist Joe Caiazzo, a veteran of multiple presidential campaigns, told Fox News Digital. Behind the scenes, Shapiro spent part of 2025 increasing his grip on the state party. And he recruited and cleared the field for a handful of congressional candidates in Pennsylvania running in what will likely be crucial midterm elections in the battle for the House majority. The governor also campaigned for fellow Democrats on the ballot last year in Pennsylvania, helping his party to convincing victories in the off-year elections. And Shapiro also traveled to neighboring New Jersey to campaign on behalf of now-Gov.-elect Mikie Sherrill in the high-profile gubernatorial showdown. His efforts further raised his national profile and sparked further 2028 speculation. CLICK HERE TO DOWNLOAD THE FOX NEWS APP But John Brabender, a longtime Republican consultant who is advising Garrity, had a warning for Shapiro. \"The political graveyard is full of candidates who have miscalculated and have tried to run for multiple offices at the same time,\" Brabender, who served as media consultant for President Donald Trump's 2024 campaign, said as he pointed to Shapiro's likely national ambitions.","summary":"Pennsylvania Gov. Josh Shapiro launches his 2026 re-election campaign, positioning for potential 2028 presidential run after Harris VP shortlist.","url":"https://www.foxnews.com/politics/shapiro-kicks-off-2026-re-election-2028-white-house-buzz-swirls","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/josh-shapiro-philadelphia-august-6-2024.jpg","video":null,"publish_date":"2026-01-08 10:00:26","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.267},{"id":391969006,"title":"In bid for Senate seat, U.S. Rep. Seth Moulton hopes to restore constituent faith in Democrats","text":"PITTSFIELD — To U.S. Rep. Seth Moulton, the United States' incursion into Venezuela on Friday without prior congressional approval was just the latest example of President Trump’s “frankly insane” approach to governing.\n\nBut while much of his frustration is reserved for Trump, the Democrat also lays some of the blame at the feet of his own party for allowing the president to return to power in 2024 and lead without sufficient opposition.\n\n“We haven't challenged him effectively,” Moulton said. “I think we can all agree on that. And the bottom line is that the old playbook, the establishment approach, is not working.”\n\nJunking that playbook is at the heart of Moulton’s bid for Senate, where he hopes to defeat two-term incumbent U.S. Sen. Ed Markey in the 2026 midterm election. During a meeting with The Eagle's editorial board on Tuesday, Moulton, who represents the 6th Congressional District that includes Salem, diagnosed the Democratic Party’s main weakness as a lack of coherent policy stances on major issues.\n\n“Democrats need to be more outspoken and more simple and clear about how wrong this is,” he said of Trump’s decision to have military forces oust Venezuelan President Nicolás Maduro. That clarity of purpose also needs to extend to the party’s core issues, he said, whether it’s immigration, artificial intelligence or public transportation.\n\n“[Voters have] got to be able to see some leadership that's going to take us forward,” he said.\n\nMoulton announced in October that he planned to challenge Markey for his Senate seat. After serving as a House representative for over a decade, Moulton said he now feels that his leadership would be more effective beyond a single district.\n\n“There are also a lot of things I would like to do that are ‘whole of Massachusetts’ issues,” he said. While he has grand ambitions for a nationwide high-speed rail system, for example, he said he wants to see public transportation strengthened at the state level.\n\n“I also just want to, at a local level, make it faster than driving to get around Massachusetts, because that's actually the transformative change we need to dramatically increase affordable housing and access to jobs,” he said. \n\nAmong other priorities, he described a desire for Democrats to enact a clearer stance on immigration based on three core tenets: Prosecuting Immigration Customs and Enforcement agents who violate policies; encouraging legal immigration while discouraging illegal immigration; and creating a simpler path to citizenship.\n\n“[That platform] happens to be one that I think the majority of Americans could get behind,” he said. “But when our party isn't even able to articulate that from our leadership, then we've got to change.”\n\nIn calling for fresh faces in the Democratic Party, Moulton certainly isn’t alone. Promising a new approach to politics is becoming a familiar tactic for aspiring Democratic leaders nationwide seeking to energize a disenchanted voter base after Kamala Harris’s defeat in the 2024 election. From Zohran Mamdani’s mayoral victory in New York City to Abigail Spanberger’s gubernatorial win in Virginia, securing elections now seems like more a possibility for young, left-leaning candidates.\n\nMoulton is also currently outpacing Markey in campaign funding, with the Boston Globe reporting he has over $3 million to draw on heading into 2026 while Markey has $2.7 million.\n\nBut Markey, an incumbent who’s filled the seat since 2013, will prove difficult to take down. In 2020, he successfully defeated a primary challenger by over 100,000 votes. Moulton hopes to persuade voters to embrace a new candidate by capitalizing on Markey's age (he will turn 80 this year) and characterizing him as a member of the Democratic old guard that needs to be voted out.\n\nIt won’t be the first time that Moulton, 47, has pointed out a fellow Democrat’s age as a liability. He previously voiced concerns about former President Joe Biden’s fitness to run for office in 2024, and feels that Democrats did not properly address voters’ concerns on the issue.\n\n“There are a lot of Americans who just don't trust our party,” he said. “People could see with their own eyes that Biden was not ready to run for reelection. And again, the establishment Democratic Party just protected Joe Biden, which ended up really hurting our party.”\n\nMoulton has also upset members of his party before, weathering ire from Democratic peers and constituents in 2024 after he suggested in a New York Times interview that the party’s stance on transgender athletes alienated voters. (In subsequent interviews, he has clarified that he felt the issue should be more open to debate and discussion within the party).\n\nWhile he emphasized his belief that Democrats should be vocal about furthering their goals, Moulton said he also believes bipartisan collaboration would be essential to a successful Senate term.\n\n“You have to be able to have respectful relationships across the aisle to get things done, at the same time as you're willing to just fight Republicans tooth and nail,\" he said. \"A lot of these guys are such cowards. They know that Trump's terrible. They know that they don't want to support wars in Venezuela.”\n\nMoulton, currently a resident of Salem, visited Pittsfield as part of a Western Massachusetts listening tour that also included a brief stop in Springfield. As a representative whose district spans the area north of Boston, Moulton admitted he still needed to familiarize himself more deeply with other areas of the state.\n\n“I'm going to be a senator who genuinely represents Massachusetts and spends a lot of time in the parts of Massachusetts where I don't live,” he said, naming Western Massachusetts and South Coast as examples. “These are places that I need to learn more to represent better.”","summary":"“We haven't challenged [Trump] effectively,” Moulton said. “I think we can all agree on that. And the bottom line is that the old playbook, the establishment approach, is not working.”","url":"https://www.berkshireeagle.com/news/central_berkshires/us-rep-seth-moulton-hopes-to-restore-constituent-faith-in-democrats/article_a9346700-b050-44d1-9a9a-01e5c24a2ef0.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/assets/v3/editorial/0/ed/0edcdd59-fe67-4032-b346-9517174ea701/695d8c6668076.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2026-01-08 10:00:00","author":"By Tara Monastesse,Stephanie Zollshan — The Berkshire Eagle,The Berkshire Eagle","authors":["By Tara Monastesse","Stephanie Zollshan — The Berkshire Eagle","The Berkshire Eagle"],"language":"en","category":"politics","source_country":"us","sentiment":0.152},{"id":391936046,"title":"US immigration agent fatally shoots woman in Minneapolis","text":"A US immigration agent has shot dead a 37-year-old woman in the city of Minneapolis, sparking protests overnight.\n\nFederal officials said the woman, Renee Nicole Good, had tried to run over immigration agents with her car but the city mayor said the agent who shot her had acted recklessly.\n\nVideos of the incident show ICE agents approaching a car which is in the middle of the street. As it attempts to drive off, one of them points his gun at the driver and at least two shots are heard. The FBI is investigating.\n\nHundreds of ICE agents have been deployed to Minneapolis, in the state of Minnesota, as part of the White House's crackdown on illegal immigration.\n\nVideos posted to social media by onlookers appear to show the moment of the shooting, which occurred around 10:25 local time on Wednesday morning.\n\nFrom various vantage points, a maroon SUV can be seen blocking a residential street in Minneapolis.\n\nA crowd of people, who appear to be protesting, are lining the pavement.\n\nLaw enforcement vehicles appear nearby. ICE agents (Immigration and Customs Enforcement) pull up to the vehicle parked in the street, emerge from the truck and tell the woman behind the wheel to get out of the SUV. One of the agents tugs at the driver's side door handle.\n\nAnother agent is positioned near the front of the vehicle.\n\nIt's not clear exactly how close the agent is standing or whether he was struck by the vehicle based on the videos reviewed immediately by the BBC.\n\nThat agent opens fire as the maroon SUV attempts to drive off.\n\nThe vehicle can be seen losing control and crashing into a car parked nearby along the street.\n\nIn a post on Truth Social, Trump said an ICE officer was \"viciously\" run over. \"It is hard to believe he is alive, but is now recovering in the hospital,\" he wrote.\n\nThe Republican president also blamed the \"Radical Left\" for \"threatening, assaulting, and targeting our Law Enforcement Officers and ICE Agents on a daily basis\".\n\nMinneapolis police chief Brian O'Hara said the driver was in her vehicle and was blocking the roadway on Portland Avenue. She was then approached on foot by a federal law enforcement officer, \"and she began to drive off\".\n\nUS Homeland Security Secretary Kristi Noem said the woman was \"stalking and impeding\" officers throughout the day and tried to \"weaponise her vehicle\" in an attempt to run over the officer in an act of \"domestic terrorism\".\n\nThe federal agent fired \"defensive shots\" and was himself injured, Noem said, before he was treated and discharged from a local hospital.\n\nThe Minneapolis City Council, however, said in a statement that Good was simply \"caring for her neighbours\" when she was shot and killed.\n\nThe same agent was also hit by a car in the line of duty in June, Noem said.\n\nShe added that ICE operations in the city would continue, and the FBI would investigate Wednesday's incident.\n\nEmily Heller told CNN she was at home when she saw the ICE agents arguing with protesters outside. She said she heard agents shouting at a woman driving an SUV, then one agent tried to open her car door, and the driver went into reverse and began pulling away.\n\n\"An ICE agent stepped in front of her vehicle and said, 'Stop!' and then - I mean, she was already moving - and then, point blank, shot her through her windshield in the face,\" Heller told the US network.\n\nMinnesota State Governor Tim Walz also pushed back on federal accounts of the incident.\n\n\"Don't believe this propaganda machine,\" Walz wrote in response to a Department of Homeland Security post about the shooting.\n\n\"The state will ensure there is a full, fair, and expeditious investigation to ensure accountability and justice.\"\n\nTop Democrats, including former Vice-President Kamala Harris and House minority leader Hakeem Jeffries, also released statements. Harris called the Trump administration's version of events \"gaslighting\".\n\nProtests and marches took place in several parts of the city as some outraged Minneapolis residents condemned the shooting and called for ICE to leave.\n\nThe scene of the shooting is about one mile from where George Floyd was murdered in 2020 by a city police officer, sparking worldwide anti-racism protests.\n\nProtests were being organised in other US cities, including New Orleans, Miami, Seattle and New York City.\n\nMinneapolis Public Schools announced that classes were cancelled for the rest of the week, \"due to safety concerns\". It comes after federal agents reportedly made arrests outside a high school on Wednesday.\n\nWhy is ICE in Minneapolis?\n\nThe Trump administration deployed an additional 2,000 federal agents to the Minneapolis area in recent weeks in response to allegations of welfare fraud in the state.\n\nThe mayor said in the Wednesday press conference that ICE was not making the city safer. \"They're ripping families apart, they're sowing chaos in our streets,\" he said.\n\nThe deployment, which began on Sunday, is one of the largest concentrations of Department of Homeland Security personnel in a US city in recent years.\n\nIt follows an immigration enforcement campaign launched by ICE late last year to target individuals in Minneapolis who were issued deportation orders, including members of the city's Somali community.\n\nThat community has been criticised frequently by Trump, who has called them \"garbage\".\n\n\"I don't want them in our country. I'll be honest with you,\" the president has said. \"Their country's no good for a reason. Their country stinks.\"\n\nTrump later doubled-down on his remarks after a YouTube video by a conservative online content creator accused daycare centres run by Somali immigrants of mass fraud.\n\nIn response, Trump has withheld federal childcare funds from the state of Minnesota.\n\nThe Trump administration has sent ICE agents to other cities across the US, where they have made thousands of arrests as part of what the administration says is a crackdown on crime and immigrants who illegally entered the country.","url":"https://www.graphic.com.gh/international/international-news/us-immigration-agent-fatally-shoots-woman-in-minneapolis.html","image":"https://www.graphic.com.gh/images/2026/January/08/ICE.jpg","video":null,"publish_date":"2026-01-08 09:35:05","author":"Jemima Okang Addae","authors":["Jemima Okang Addae"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.534},{"id":391923038,"title":"Critics draw iffy link between Gavin Newsom’s record and Minnesota’s food fraud scandal","text":"Last month, as required by law, State Auditor Grant Parks published an annual report on state programs and agencies that his office deems to be at “high risk” of costly inefficiency, waste or fraud.\n\nThe report reiterated concerns about seven situations, two of which have been on the list since 2007, including the bureaucracy’s chronic inability to successfully employ information technology — embarrassing for a state that is the global center for digital tools.\n\nParks has added a new program in his latest overview, the Department of Social Service’s food aid for poor families, once called food stamps but now known as CalFresh.\n\nThe federal government primarily finances supplemental food benefits, but the state’s share is determined, in part, by its management, as indicated by its rate of error when determining people’s eligibility.\n\nPresident Donald Trump’s One Big Beautiful Bill tightens the error rate thresholds. Thus, Parks notes, California’s 11% error rate, if not improved, could require the state to “spend about $2 billion annually to maintain CalFresh benefits.”\n\nThe most disturbing item on Parks’ list is the continuing inability of the Employment Development Department to effectively manage unemployment insurance benefits, which first came to light during the COVID-19 pandemic. Billions of dollars in fraudulent benefit claims were approved, almost all of which came in a federally financed expansion of the program.\n\nBy happenstance, the high risk report was released just as a scandal was erupting in Minnesota over widespread fraud in a program meant to keep children fed during the pandemic.\n\nDozens of people, mostly in Minnesota’s substantial Somali population, have been charged with looting the program by setting up companies that billed the state for supplying food that was never delivered.\n\nMinnesota Gov. Tim Walz, whom Kamala Harris chose as her running mate in her campaign for president in 2024, felt the political fallout from the scandal — generated mostly in right-leaning media outlets — and this week dropped his bid for re-election.\n\nMeanwhile, those same outlets — blogs, podcasts and YouTube videos — have been making an accusatory connection between the Minnesota scandal and the Parks report, suggesting the report proves the same kind of fraud was even more rampant in California and laying the blame on Gov. Gavin Newsom, who’s a likely 2028 candidate for president.\n\nThis week, Steve Hilton, a Republican candidate for California governor, and Herb Morgan, a Republican running for state controller, cited the Parks report, their own research and tips from whistleblowers in a broad assertion, dubbed “CALIFRAUDIA,” that “California’s exposure to fraud, waste, and abuse across major state programs is likely to reach $250 billion,” adding that it “underscores the urgent need for formal investigation and audit, as a matter of basic fiscal responsibility.”\n\nHowever, the allegations of widespread fraud and mismanagement during Newsom’s governorship is not confined to those on the starboard side of the political balance beam.\n\nKhanna told Politico, “I don’t know what the specific number is” of dollars lost to fraud or mismanagement. “It’s not particular to any person,” Khanna said. “It’s making government more effective. Tackling the mismanagement and waste and some fraud will build more credibility for asking for higher taxes.”\n\nNewsom’s staff responded by accusing Khanna of making a “MAGA made-up claim.”\n\nThere’s a reason why veterans of political wars refer to election years as the “silly season,” when political figures seeking media attention are prone to convert anthills of fact into mountains of rhetorical fantasy.\n\nDan Walters is a CalMatters columnist.","summary":"Newsom’s staff responded by accusing Khanna of making a “MAGA made-up claim.”","url":"https://www.ocregister.com/2026/01/07/critics-draw-iffy-link-between-gavin-newsoms-record-and-minnesotas-food-fraud-scandal/","image":"https://www.ocregister.com/wp-content/uploads/2026/01/Congress_Epstein_19988.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2026-01-08 07:26:22","author":"Dan Walters","authors":["Dan Walters"],"language":"en","category":"politics","source_country":"US","sentiment":0.033},{"id":391902558,"title":"US immigration agent fatally shoots woman in Minneapolis, officials say","text":"A US immigration agent fatally shot a 37-year-old woman on Wednesday in the city of Minneapolis, but the details of what led up to the incident have left a wide chasm between federal and local government officials.\n\nTrump administration officials claim the woman, identified as Renee Nicole Good, was a “violent rioter” attempting to run over Immigration and Customs Enforcement (ICE) agents when one agent fired “defensive shots” into her vehicle.\n\nBut city and state leaders, and Democrats nationally, are disputing that account.\n\nMinneapolis Mayor Jacob Frey claims that “this was an agent recklessly using power that resulted in somebody dying”, telling ICE agents: “Get out of our city.”\n\nMultiple videos posted to social media by onlookers appear to show the moment of the shooting, which occurred around 10:25 local time.\n\nFrom various vantage points, a maroon SUV can be seen blocking a residential street in Minneapolis. A crowd of people, who appear to be protesting, are lining the sidewalk area.\n\nMultiple law enforcement vehicles appear nearby. Immigration agents pull up to the vehicle parked in the street, get out of the truck and order the woman behind the wheel to get out of the SUV. One of the agents tugs at the driver’s side door handle.\n\nAnother agent is positioned near the front of the vehicle. It’s not clear exactly where the officer is standing based on the BBC’s immediate review of the videos. That agent opens fire as the maroon SUV attempts to drive off.\n\nThree pops are heard, and the vehicle can be seen losing control and crashing into a white car parked along the street nearby.\n\nThe shooting comes amid a major immigration crackdown in Minneapolis by the Trump administration.\n\nUS homeland security secretary Kristi Noem said the deceased woman’s actions constituted “domestic terrorism” – and that ICE’s operations in the city will continue.\n\nIn a post on Truth Social, Trump said that an ICE officer was “viciously” run over. “It is hard to believe he is alive, but is now recovering in the hospital,” he wrote.\n\nThe president also blamed the “Radical Left” for “threatening, assaulting, and targeting our Law Enforcement Officers and ICE Agents on a daily basis”.\n\nSpeaking to the press later in the day, Noem called the loss of life “preventable.\n\nBut she repeatedly claimed that the ICE agent fired in self-defence and that Good used her vehicle as a “deadly weapon” against agents. The details are pending an FBI investigation, she said, adding that the same agent injured on Wednesday was also hit by a car in the line of duty in June.\n\nThe Minneapolis City Council, however, said that Good was simply “caring for her neighbours” when she was shot and killed.\n\nMinnesota State Governor Tim Walz also pushed back on federal accounts of the incident.\n\n“Don’t believe this propaganda machine,” Walz wrote in response to a Department of Homeland Security post about the shooting.\n\n“The state will ensure there is a full, fair, and expeditious investigation to ensure accountability and justice.”\n\nTop Democrats, like former Vice President Kamala Harris and House Minority Leader Hakeem Jeffries, also released statements Wednesday evening. Harris called the Trump administration’s version of events “gaslighting”.\n\nProtests erupted in several parts of the city as outraged Minneapolis residents condemned the shooting and called for ICE to leave. According to local media reports, the main gathering happened near the scene of the shooting.\n\nA makeshift vigil, displaying flowers and candles, was laid in the snow there, as protesters chanted slogans and delivered speeches.\n\nOne group of protesters formed a line blocking the entrance to a federal courthouse with ICE officers standing inside, according to the Minneapolis Star-Tribune. The group of around 50 people chanted Good’s name and dispersed after breaking a glass window.\n\nProtests are also taking place in cities outside Minneapolis, with gatherings expected in New Orleans, Miami, Seattle and New York City.\n\nWhy is ICE in Minneapolis?The Trump administration deployed an additional 2,000 federal agents to the Minneapolis area in recent weeks in response to allegations of welfare fraud in the state, sources told the BBC’s US partner, CBS News.\n\nFrey said in the press conference Wednesday that ICE is not making the city safer. “They’re ripping families apart, they’re sowing chaos in our streets,” he said.\n\nThe deployment, which began on Sunday, is one of the largest concentrations of Department of Homeland Security personnel in a US city in recent years.\n\nIt follows an immigration enforcement campaign launched by ICE in late 2025 to target individuals in Minneapolis who were issued deportation orders, including members of the city’s Somali community.\n\nThat community has been criticised frequently by Trump, who has called them “garbage”.\n\n“I don’t want them in our country. I’ll be honest with you,” the president has said. “Their country’s no good for a reason. Their country stinks.”\n\nTrump later doubled-down on his remarks after a YouTube video by a conservative online content creator accused day care centres run by Somali immigrants of fraud.\n\n“Send them back from where the came,” Trump wrote on Truth Social in December. He also withheld federal child care funds to the state of Minnesota in response.\n\nThe Trump administration has sent ICE agents to other cities as well, all part of a widespread crackdown on what it says is unlawful immigration in the US.\n\nSource: BBC","summary":"A US immigration agent fatally shot a 37-year-old woman on Wednesday in the city of Minneapolis, but the details of what led up to the incident have left a wide chasm between federal and local government officials. Trump administration officials claim the woman, identified as Renee Nicole Good, was a &#8220;violent rioter&#8221; attempting to run [&#8230;]\nSource","url":"https://rainbowradioonline.com/2026/01/08/us-immigration-agent-fatally-shoots-woman-in-minneapolis-officials-say/","image":"https://rainbowradioonline.com/wp-content/uploads/2026/01/image-370.png","video":null,"publish_date":"2026-01-08 06:16:41","author":"Rashid Obodai","authors":["Rashid Obodai"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.563},{"id":391896210,"title":"An ICE shooting was filmed from multiple angles. No-one agrees on what happened","text":"The fatal shooting of a 37-year-old woman by immigration agents in the US city of Minneapolis has sparked a political firestorm.\n\nIn a statement released shortly after the incident the Department of Homeland Security stated that \"violent rioters weaponised\" a vehicle and attempted to run over Immigration and Customs Enforcement (ICE) officers.\n\n\"An ICE officer, fearing for his life, the lives of his fellow law enforcement and the safety of the public, fired defensive shots,\" the statement said.\n\nUS President Donald Trump then posted a short, slowed down clip of the shooting on Truth Social, claiming it showed:\n\n\"The woman driving the car was very disorderly, obstructing and resisting, who then violently, willfully, and viciously ran over the ICE Officer.\"\n\nOfficials in Minnesota have rejected the Trump administration's claims that the agent fired in self-defence.\n\nMinneapolis Mayor Jacob Frey said he had seen video that directly contradicted what he called the government's \"garbage narrative\".\n\n\"Having seen the video myself, I want to tell everybody directly — that is bulls***,\" he said.\n\nFormer vice president Kamala Harris posted on social media that she was grateful her former 2024 running mate, Minnesota Governor Tim Walz, was taking \"swift action\" in investigating the shooting.\n\nShe added that the Trump administration was engaging in \"gaslighting\" with its account of the event.\n\nWhat the footage shows\n\nABC NEWS Verify has examined multiple videos and angles of the shooting and its aftermath.\n\nOne of the clearest videos starts 16 seconds before the shooting takes place.\n\nAn unmarked grey utility vehicle that had a flashing light visible in the side window pulled up to the scene and two armed ICE officers walked up to a stationary maroon SUV that appeared to be blocking a snowy road.\n\nThe two officials can be heard asking the driver of the maroon vehicle to step out of the car.\n\nTwelve seconds into the clip the maroon car's reverse lights can be seen before the agent reached the driver's side door.\n\nA second later the agent attempted to open the driver's door and the maroon vehicle reversed.\n\nA third ICE agent can then be seen standing in front of the maroon car as it reversed and moved forward.\n\nThe third ICE agent pulled a weapon and proceeded to jump out of the way of the maroon car as it drove forward and to the right. It is unclear if the vehicle struck him.\n\nThe vehicle's tyres appeared to be turning right as it went forward and not towards the ICE agent.\n\nThat agent fired three shots in quick succession into the front windscreen of the maroon car which then continued forward and crashed into two parked cars further down the road.\n\nA shorter video had clearer vision of the tyres of the maroon vehicle that were turning to the right as it moved forward.\n\nThe feet of the agent who fired the fatal shots can be seen jumping backwards from the maroon vehicle, but it is again difficult to tell if he was struck by the vehicle.\n\nA video posted on Truth Social by President Trump shows a different angle of the incident.\n\nThe footage is slowed down and only 13 seconds long, showing none of the lead-up to the incident.\n\nIt is unclear if there was contact between the maroon car and the ICE agent who fired the fatal shots.\n\nAnother short, low-quality video of the incident does appear to show some contact between the ICE agent and the maroon vehicle as it moved forward.\n\nIn a video from a second angle, examined by ABC NEWS Verify, it is unclear whether or not the agent and maroon vehicle came into contact.\n\nWhat is clear from this video is that the ICE agent who fired the fatal shots remained upright during the incident and walked towards the maroon vehicle after it crashed.\n\nThere is also limited evidence that ICE agents attempted to secure the scene.\n\nShortly after, Minneapolis city officials confirmed the identity of the victim as 37-year-old Renee Good.\n\n\"This was an agent recklessly using power that resulted in somebody dying,\" Cr Jacob said.\n\nWhat happens now?\n\nUS officials, including President Trump and Department of Homeland Security Secretary Kristi Noem, have claimed the vision showed the driver deliberately ramming the ICE agent, using the vehicle as a weapon, and described it as an act of \"domestic terrorism\".\n\n\"This appears as an attempt to kill or to cause bodily harm to agents,\" Ms Noem said.\n\nEyewitnesses and state and local officials including the Minneapolis mayor have disputed that claim.\n\nMinnesota Governor Tim Walz has promised a state investigation into the incident that would likely examine the lead-up and closely examine the maroon vehicle's tyre tracks and trajectory.\n\nIt is unclear if the ICE agents involved in the incident were wearing body-worn cameras.\n\nWhile agents have been involved in other non-fatal shootings during the Trump administration's immigration crackdown no officer has yet been charged.","summary":"ICE agents shot a woman in Minnesota. The president says it was self-defence while protesters claim it was murder. Here's what the vision shows.","url":"https://www.abc.net.au/news/2026-01-08/what-happened-in-minnesota-ice-shooting-abc-verify/106209188","image":"https://live-production.wcms.abc-cdn.net.au/7f4751768b4f15fa56379e4eba298032?impolicy=wcms_crop_resize&cropH=1406&cropW=2500&xPos=0&yPos=68&width=862&height=485","video":null,"publish_date":"2026-01-08 06:00:00","author":"Lucy Carter,Michael Workman","authors":["Lucy Carter","Michael Workman"],"language":"en","source_country":"AU","sentiment":-0.657}]}