{"offset":0,"number":50,"available":703,"news":[{"id":316934544,"title":"Kamala Harris weighs run for governor or another presidential bid","text":"Former Vice President Kamala Harris' return to the political spotlight Wednesday came not only with a sharp rebuke of President Donald Trump, but also a carefully worded acknowledgment of her political future ambitions.Speaking in San Francisco, in her first major public remarks since her 2024 presidential defeat, Harris blasted Mr. Trump's economic agenda. His tariffs, \"as I predicted, are clearly inviting a recession,\" she said, in what was close to an \"I told you so\" moment, just about six months since Mr. Trump won all seven of the battleground states, as well as the popular vote, with a margin exceeding 2.5 million votes.Harris also suggested she's been having conversations about her next political steps, as California prepares to elect its next governor in 2026 and Democrats search for a presidential candidate to run in 2028. \"Everybody is asking me, 'Well, what've you been thinking about these days,'\" she said, smiling as the Democratic crowd responded warmly.Sources familiar with Harris' thinking say she's weighing a gubernatorial bid in her home state, a third run for the presidency or not seeking elected office. \"I don't think she will make a wrong decision,\" a former senior Harris campaign official told CBS News. \"Seventy-five million Americans voted for her. She is well-positioned.\"In recent weeks, Harris has ramped up her private outreach, holding meetings and phone calls with Democratic officials, strategists and allies. Those close to her say the focus has been less about plotting her next campaign and more about helping shape the Democratic Party's path forward.\"She has been speaking to a lot of voices,\" the former Harris campaign official said.Harris is eyeing an end-of-summer deadline to announce her next political move and will be headlining a big fundraiser in May for the Democratic National Committee in New York, according to sources familiar with the planning.","summary":"In her first major public remarks since her 2024 presidential defeat, Kamala Harris acknowledged she's thinking about her next political steps.","url":"https://www.cbsnews.com/news/kamala-harris-california-governor-or-presidential-bid/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/01/01dc0699-c702-41f6-8311-a8dc3c27401b/thumbnail/1200x630g2/512a7a8ff1f615e5f6a34cfd39fc72be/gettyimages-2212212988.jpg?v=7c5acc180b39394767372ab4e02619ce","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3722641_hls/master.m3u8","publish_date":"2025-05-01 23:55:42","author":"Nidia Cavazos","authors":["Nidia Cavazos"],"language":"en","category":"politics","source_country":"us","sentiment":0.097},{"id":316928574,"title":"Patrick Mahomes Refers to His Hair as 'Nappy' While Commenting on His Haircut, Sparks Backlash on Social Media","text":"Patrick Mahomes' comments on his new haircut are sparking backlash online.\n\n In an April 23 interview with KCTV 5, Mahomes debuted a new shorter haircut. In the interview, he says, “I’ve wanted to do it for a while, but it was kind of one of those superstitions. I kept winning the Super Bowl, which is a good thing, but I didn’t want to cut the hair while I was doing it.\"\n\n The Kansas City Chiefs quarterback then said, \"I told everybody during the season that win or lose, if we win three in a row or if we lose, I’m getting a haircut like that’s enough.\"\n\n He elaborated, \"I’m very excited. I’ve looked at some videos from last year and I can’t believe all you guys let me keep that nappy hair for so long. I look way better now with the short hair, so I’ll be keeping this going forward.\"\n\n The clip, which was shared to X, is now inviting comments criticizing Mahomes' use of the term \"nappy.\" One commenter wrote, \"him saying 'nappy' just doesnt sit well with me.\" Another wrote, \"self hate is a real thing in that crowd.\"\n\n The term \"nappy\" originated as a derogatory term for Black peoples' textured hair dating back to the first slave ships in the American colonies in the 17th century, per NPR. Mahomes is biracial, and some commenters found his remarks insensitive following past comments that have led the public to believe his family supports President Donald J. Trump's administration.\n\n The president's administration has issued sweeping policies targeting marginalized communities, all under the umbrella of Project 2025. Mahomes previously stated that he did not wish to publicly endorse a candidate, instead saying that he hoped to \"inform people to vote\" and \"do their own research.\"\n\n However, his wife Brittany Mahomes sparked backlash for liking an Instagram post on Trump's official account. Brittany, 29, hit back at those criticizing her for allegedly supporting the president's 2024 campaign, writing, \"I mean honestly. To be a hater as an adult, you have to have some deep-rooted issues you refuse to heal from childhood.\"\n\n The August 2024 Instagram Stories post continued, \"There's no reason your brain is fully developed and you hate to see others doing well.\"\n\n Mahomes is close friends with the Chiefs' tight end Travis Kelce, who is in a relationship with Taylor Swift. During the 2024 presidential election, Swift publicly endorsed former Vice President Kamala Harris for the presidency.\n\n In response, the president called Brittany, a “big Trump fan” during a phone interview with Fox & Friends last September. “Well, I actually like Mrs. Mahomes much better, if you want to know the truth,” he said, before adding, “I was not a Taylor fan.”\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories.\n\n Members of Mahomes' family later stopped to pose for photos with the president at the 2025 Super Bowl. The Kansas City Chiefs quarterback's mother Randi, brother Jackson and sister Mia Randall posed for a photo in Trump's suite before the game, as seen in a post on X from Margo Martin, a special assistant to the president and communications advisor.","summary":"\"I look way better now with the short hair, so I’ll be keeping this going forward,\" the quarterback explained","url":"https://people.com/patrick-mahomes-nappy-hair-comment-sparks-backlash-social-media-11726821","image":"https://people.com/thmb/L8WOznnFu1tR6yGqfeISGR1ljQQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Patrick-Mahomes-0_04092025-da3c5ae2720e47738bc3f4462926e21d.jpg","video":null,"publish_date":"2025-05-01 23:26:50","author":"Madison E. Goldberg","authors":["Madison E. Goldberg"],"language":"en","category":"politics","source_country":"US","sentiment":0.105},{"id":316923820,"title":"‘60 Minutes’ Set to Air Segment That Will Infuriate Trump","text":"Brace yourself, Mr. President. \n\n60 Minutes plans to enrage Donald Trump Sunday with an episode bashing his intimidation efforts—despite being in a legal battle with the president themselves. \n\n“On the campaign trail, President Trump vowed to wield the power of the presidency to go after his perceived enemies,” the segment’s description reads. “Now in the White House, Trump is using executive orders to target some of the biggest law firms in the country that he accuses of ‘weaponizing’ the justice system against him.” \n\nThe drama between Donald Trump and CBS has heated up in recent weeks after the show’s executive producer Bill Owens abruptly quit after 37 years, accusing CBS executives of interfering with the program and pandering to Trump amid his $20 billion lawsuit. \n\nTrump sued 60 Minutes before his election win, slamming the show for editing an interview with Democratic presidential nominee Kamala Harris. The president, who alleged that the program modified Harris’ clip to make her sound better, was also offered an interview but refused to go once he found out it would be fact checked. \n\nSince taking office, Trump has dedicated a large part of his presidency to demonizing the press and attacking the so-called “fake news.” \n\nOn Wednesday, he escalated his assaults on 60 Minutes. \n\n“The case we have against 60 Minutes, CBS, and Paramount is a true WINNER,” he wrote on Truth Social. “They cheated and defrauded the American People at levels never seen before in the Political Arena.”\n\nBut now, 60 Minutes is biting back by roasting the president with a segment dedicated to calling out the president’s harsh measures against law firms that have been targeted with executive orders by second the Trump administration.\n\nCorrespondent Scott Pelley, who is reporting the story, last week noted the departure of Owens and called out CBS’ corporate parent, Paramount Global. \n\n“Bill made sure they were accurate and fair,” he told viewers. “He was tough that way, but our parent company Paramount is trying to complete a merger. The Trump administration must approve it. Paramount began to supervise our content in new ways. None of our stories has been blocked, but Bill felt he had lost the independence that honest journalism requires.”\n\nAfter his resignation, Owens said that the show’s independence was a “slippery slope” and added that he was “stepping aside so the show can move forward.” \n\nIn a memo he told staff that “over the past months, it has become clear that I would not be allowed to run the show as I have always run it, to make independent decisions based on what was right for ’60 Minutes,’ right for the audience.” \n\nMAGA reveled in the news that Owens quit, with Trump’s chief mouthpiece and White House Communications Director Steven Cheung writing on X that “Karma is a b----,” calling Owens a “liar and a fraud.” \n\nCBS and Trump’s settlement discussions have taken place as Paramount Global seeks the president’s approval of its merger with Skydance, an American media production company.","summary":"Chip Somodevilla/Getty ImagesBrace yourself, Mr. President. \n\n60 Minutes plans to enrage Donald Trump Sunday with an episode bashing his intimidation efforts—despite being in a legal battle with the president themselves. \n\n“On the campaign trail, President Trump vowed to wield the power of the presidency to go after his perceived enemies,” the segment’s description reads. “Now in the White House, Trump is using executive orders to target some of the biggest law firms in the country that he accuses of ‘weaponizing’ the justice system against him.” \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/60-minutes-set-to-air-segment-that-will-infuriate-trump/","image":"https://www.thedailybeast.com/resizer/v2/ZGHU2KJBWFAMXFRDHD4CES55HE.jpg?smart=true&auth=f664c2a990865926803558c88c911fcb2ad0495fde371c93dd00e1db0c993bb4&width=1440&height=1080","video":null,"publish_date":"2025-05-01 22:58:54","author":"Kenneal Patterson","authors":["Kenneal Patterson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.084},{"id":316936098,"title":"Trump thinks he runs the world. Australians might have something to say about that","text":"“I run the country and the world.” Donald Trump’s words echoed far beyond the reaches of Truth Social this week, even reaching Australian shores, albeit drowned out by the last frenetic week of the election campaign. \n\nTrump-style politics has undeniably permeated Australia’s political culture during this election campaign — both in the way political parties are engaging with media and by shaping the soundbites they share. Most recently has come the revelation that one of the architects of Donald Trump’s 2024 victory claims he made an unpublicised visit to Australia to advise the Liberal Party about “structural issues” related to Peter Dutton ahead of the federal election.\n\nBoth major party leaders’ interviews with YouTubers and influencers have sparked comparisons to the US presidential race, where campaigns unfolded in podcast studios rather than on the debate stage. Opposition Leader Dutton in particular has been accused of drawing straight from Trump’s playbook in his push to scale back DEI (diversity, equity and inclusion) in the public service and add a new government efficiency portfolio to his shadow ministry to cut “wasteful spending” — though he later walked back many of his public service policies.\n\nBut politicians could be vastly misjudging the political landscape here. Australians are avid consumers of the spectacle of US politics. But that doesn’t mean the vast majority are fans of the current president. In recent weeks, the effects of Trump 2.0 have been felt close to home, as his “Liberation Day” tariffs continue to send shockwaves through global markets that are hitting Australians’ pockets and retirement planning. \n\nThis sentiment was soon picked up in focus groups and thus, throughout the campaign, Dutton has swung between emulating Trump’s rhetoric and distancing himself from the president — from claiming he could find ideological “common ground” with Trump and vowing to visit the US as his first official trip if elected, to sidestepping questions about Coalition Senator Jacinta Nampijinpa Price’s call to “make Australia great again.” Meanwhile, some third-party players have appeared less cautious about taking direct inspiration from the US president, with fringe billionaire candidate Clive Palmer launching the “Trumpet of Patriots” — a new political party with the explicit goal to “make Australia great again.”\n\nHowever, a combination of structural factors means a Trump-like figure was always going to struggle to gain traction in an Australian context.\n\nHow Trump rose to power \n\nAs Trump stepped up to the lectern for his joint address to Congress earlier this year, the president basked in rapturous applause and chants from half the room. But he hasn’t always commanded such unwavering support from within his own party.\n\nIn 2016, Trump’s ascent from outsider to GOP standard-bearer stunned the Republican establishment. As Trump toppled a crowded field of far more seasoned and traditional political operatives, such as former Governor Jeb Bush and senator Marco Rubio, he provoked what many described as an all-out GOP “civil war”.\n\nEstablishment figures like Mitt Romney openly strategised about ways to deny the front-runner the nomination in an “anyone but Trump” plan. Trump publicly squabbled with party insiders like then speaker of the house Paul Ryan. Even after Trump had collected enough delegates to clinch the nomination, top Republican donors failed to throw their support behind his presidential campaign.\n\nYet the party machine wasn’t strong enough to deny Trump the Republican nomination nor the presidency.\n\nIn every presidential primary, hopefuls compete in state-by-state contests to lead their party to election. Factional opponents vie for voters and everyday Americans have direct influence over who emerges as the face of the party. A groundswell of grassroots public support was enough to carry Trump to the top of the Republican ticket despite a wall of fierce opposition from party elites. In America, individuals matter more than party structures.\n\nBut Australia’s “Washminster” democracy — a unique hybrid of political traditions that blends the Westminster parliamentary system with American-style federalism — does not operate in the same way. Ideological battles within the major parties are fought behind closed doors. And once a leader loses the confidence of their caucus, they are quickly ousted — as was the case for every Australian prime minister between 2007 and 2018, on both sides of the aisle.\n\nTrump’s unique advantages\n\nOf course, Trump’s “grievance” message would likely also struggle to find the same reception in an Australian setting. \n\nIn all three runs for the presidency, Trump capitalised on a widespread dissatisfaction with the status quo, and a palpable sense that working class Americans have been left behind by decades of economic neglect.\n\nBut Australia’s political culture and institutions create less fertile ground for grievance politics to thrive. \n\nThe country’s robust social safety net in part protects Australia from descending into US levels of inequality and economic disenfranchisement.\n\nCompared to the “first-past-the-post” US political system, Australia’s preferential ballots encourage coalition- and consensus-building, rewarding politicians that appeal to the middle rather than extreme ends of the electorate. Mandatory voting is another bulwark against polarisation: 97% of Australia’s population is enrolled to vote — and only a small minority don’t turn out on election day. \n\nThe independence of Australia’s electoral management (compared to the openly partisan redistricting process used in the United States) drives higher trust in elections and their outcome. Westminster-style daily question time spurs more sustained public political engagement. \n\nFor all these reasons, Australian politics tends towards the centre. Polling in Trump’s first term found that Australia’s conservative base shared more ideological common ground with Hillary Clinton’s supporters than Trump voters. Three quarters of Australians hoped that Kamala Harris would triumph last November — and polling continues to suggest that Trump is almost politically toxic to Australian voters.\n\nAs President Trump moves at breakneck speed to reshape America’s institutions and role in the world, the spectacle of Trump 2.0 will continue to consume media oxygen in Australia. With Australia barreling towards its own federal election, commentators are sure to remain fixated on any signs of “Trumpism” creeping into Australian political discourse.\n\nTrump’s reach and influence is undeniable. But perhaps the public’s fascination with US politics in part stems from just how out of place Trump’s tone and style would be in Australia’s own system.\n\nOur political structures mean a similar outsider takeover of the Australian government by a polarising, Trumpian figure is unlikely to occur anytime soon. However, for now it is the very real economic effects of his policies that seem to be turning most Australians against the idea of Trump himself.\n\nHave you felt the influence of Trump over the Australian election campaign?\nWe want to hear from you. Write to us at letters@crikey.com.au to be published in Crikey. Please include your full name. We reserve the right to edit for length and clarity.","summary":"Australians are avid consumers of US politics. But that doesn’t mean the vast majority are fans of the current president.\n\n\nThe post Trump thinks he runs the world. Australians might have something to say about that appeared first on Crikey.","url":"https://www.crikey.com.au/2025/05/02/donald-trump-australia-influence-popularity/","image":"https://www.crikey.com.au/wp-content/uploads/sites/3/2025/05/20250501128823005976-original.jpg?quality=70&w=1024","video":null,"publish_date":"2025-05-01 22:49:46","author":"Ava Kalinauskas","authors":["Ava Kalinauskas"],"language":"en","source_country":"au","sentiment":0.183},{"id":316913710,"title":"Kamala Harris reminds everyone why we didn’t elect her president","text":"The Democrats seem to be lost in the wilderness. But at least their former presidential candidate still has elephants for company.\n\nOn Wednesday evening Kamala Harris returned to the public stage for the first time in months. And in her own way she reminded us all how much we’ve missed her.\n\nThe event she spoke at was a California fundraiser for “Emerge,” an organization designed to help Democratic women to enter politics. And if any Democrat women need a role model for how not to run for political office, Harris once again sure helped them out.\n\nShe used most of her 15 minutes to do boilerplate campaign stuff. She claimed that in the Trump administration “instead of an administration working to advance America’s highest ideals, we are witnessing the wholesale abandonment of those ideals.”\n\nClearly she is appalled at a US administration doing things like securing the border and enforcing the law. These are certainly ideals she would never have approved of if she had been in office.\n\nKamala also slammed into the tariffs question. Because if there is one question that all economists and trade experts always had on their minds in recent years it was: “What would Kamala do?”\n\nTo the extent that she has any thoughts on the question of economics she showed which side she is on.\n\nShe did so by expressing her support for Bernie Sanders and Alexandria Ocasio-Cortez — the two left-wing radicals who have spent recent weeks jetting around the country by private jet to tell everyone how well socialist economics can work.\n\nBut the true highlight of Kamala’s speech came when she dug into her familiar wine-mom technique. Then the memories really came flooding back. To the public — if not to her.\n\nFlailing around with her hands and laughing before she had even said anything funny she invoked the behavior of animals in the zoo. Quite literally.\n\nIn that grating manner she has of speaking to a roomful of adults as though they are a nursery full of pre-schoolers she asked if anyone had seen the recent video of elephants in a San Diego Zoo.\n\nSome of the room seemed to know what she was talking about. The others had that reaction Dems often had when Kamala’s old boss Joe Biden began one of his memory-lane stories from yonder year.\n\n“Please allow me, friends, to digress for a moment” she said, wringing her hands like a little girl on Christmas morning. Deeply amusing herself she remembered to make an attempt at deeply amusing her audience.\n\n“I’m asking for a show of hands,” she continued. “Who saw that video from a couple of weeks ago — the one of the elephants at the San Diego zoo. Google it if you’ve not seen it.”\n\nThe point that Harris was grasping at was that after the recent earthquake in San Diego the local zoo released footage showing how the elephants at the zoo had behaved.\n\nWhen the elephants felt the tremors they immediately started to form a circle in order to protect the youngest elephant. Or in Kamala’s retelling of the story, the elephants gathered around “to protect the most vulnerable.”\n\nWhile telling this story she nodded and raised her eyebrows meaningfully — once again as though she was reading story-time for 3-year olds in a public library.\n\n“So that scene has been on my mind,” she continued, laughing hysterically. “Think about it,” she invited the audience, still nodding wisely. As though thinking is something no one would do unless Kamala Harris invited them to.\n\n“What a powerful metaphor,” she continued, inviting the audience to marvel anew.\n\nThis being Kamala the metaphor had to be explained. So a little of Kamala’s focus returned, and she recalled that there was a teleprompter she was meant to be trying to focus on in the near distance.\n\n“We know those who try to incite fear are most effective when they divide and conquer, when they separate the herd, when they try to make everyone think they are alone,” she said. “But in the face of crisis, the lesson is: Don’t scatter. The instinct has to be to immediately find each other and to know that the circle will be strong.”\n\nI marvel at the California audience who managed to pretend that this was some great insight. And I marvel even more at the idea that paying adults sat through this guff.\n\nBut most of all I think we can all marvel that Kamala Harris thinks the country still wants this stuff. To return to her favorite metaphor let me return to Kamala’s new favorite subject of elephants.\n\nWe must assume that Kamala would like us to forget her term in office and her horrible campaign. Perhaps she already has. Or at least is trying to.\n\nBut voters — like elephants — never forget. And America’s voters never should and never will.\n\nPay attention to Iran’s threats\n\nTalking of missed bullets, it is worth turning attention to Iran.\n\nThe Iranian Revolutionary government’s official media outlets recently marked President Trump’s first 100 days back in office.\n\nOne of the regime’s official media mouthpieces — Kayhan — printed an analysis calling Trump “narcissistic and delusional” and “a liar.”\n\nThat might sound like the sort of thing you could hear at any American-based anti-Trump fundraiser.\n\nExcept that the editor of Kayhan is Hossein Shariatmadari — a close associate of Iran’s Supreme Leader, Ayatollah Khamenei.\n\nAhead of Trump’s 100th day in office the editor of Kayhan had a much clearer message for the American President.\n\nDrawing on statements made by his friend the Supreme Leader the editor of Kayhan recently wrote: “The day is not far off when a few bullets will be fired into Trump’s hollow head.”\n\nThis promise was given because only by killing Trump could Iran “avenge the blood of the martyr Qassem Soleimani.”\n\nI hope that Homeland Security are keeping the most careful possible eyes on protecting the US President.\n\nBut I hope they are also looking into the multiple foreign actors in the US who still excuse the Iranian regime and think it some kind of benign political force.","summary":"The Democrats seem to be lost in the wilderness. But at least their former presidential candidate still has elephants for company.","url":"https://nypost.com/2025/05/01/opinion/kamala-harris-reminds-everyone-why-we-didnt-elect-her-president/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-ycplo9fvz-1746135999611.jpg?quality=75&strip=all&1746121696&w=1200","video":null,"publish_date":"2025-05-01 22:04:42","author":"Douglas Murray","authors":["Douglas Murray"],"language":"en","category":"politics","source_country":"zm","sentiment":0.167},{"id":316919410,"title":"'60 Minutes' Kamala Harris interview at the center of Trump's CBS lawsuit receives Emmy nomination","text":"The controversial \"60 Minutes\" interview at the center of President Donald Trump's high-stakes lawsuit against CBS News is now an Emmy-nominated program. The nominations for the 46th News & Documentary Emmy Awards were announced Thursday. \"60 Minutes\" landed several nods, most notably in the Outstanding Edited Interview category for its primetime special featuring then-Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz. Among the other nominees in that category include CBS' interviews with Supreme Court Justice Ketanji Brown Jackson and the late Pope Francis, as well as NBC's interview with Celine Dion and ABC's interview with Brittney Griner. CBS NEWS IN CHAOS SINCE DEPARTURE OF ‘60 MINUTES’ PRODUCER, WAITING FOR THE NEXT SHOE TO DROP, INSIDER SAYS \"Of course it’s nominated for best editing because it takes some serious talent to edit Kamala’s answer into something that’s coherent and understandable, which in the end they still failed to do,\" White House Communications Director Steven Cheung told Fox News Digital. Neither CBS News nor representatives for Trump's legal team responded to Fox News Digital's requests for comment. Last fall, Trump filed a $10 billion lawsuit (it has since been increased to $20 billion) against CBS News and its parent company Paramount Global for what he alleged was election interference with how the network handled its Harris interview in the days leading up to the presidential election. The lawsuit stems from an exchange Harris had with \"60 Minutes\" correspondent Bill Whitaker, who asked her why Israeli Prime Minister Benjamin Netanyahu wasn't \"listening\" to the Biden administration. Harris was widely mocked for the \"word salad\" answer that aired in a preview clip of the interview on \"Face the Nation.\" However, when Whitaker asked the same question during the primetime special, Harris had a different, more concise response. Critics at the time accused CBS News of editing Harris' \"word salad\" answer to shield the then-vice president from further backlash leading up to Election Day. ‘60 MINUTES’ CALLS OUT CORPORATE OWNER PARAMOUNT ON THE AIR, SAYS PRODUCER WHO QUIT FELT INTERFERED WITH Earlier this year, Federal Communications Commission (FCC) Chair Brendan Carr ordered CBS News to hand over the unedited transcript of the interview as part of its investigation into whether the network violated the FCC's \"news distortion\" policy after a complaint was filed. CBS had refused to release the unedited transcript when the controversy first began. The released raw transcript and footage showed that both sets of Harris' comments came from the same response, but CBS News had aired only the first half of her response in the \"Face the Nation\" preview clip and aired the second half during the primetime special. In the months since, CBS News has faced turmoil. Shari Redstone, Paramount’s controlling shareholder, is reportedly in favor of settling the lawsuit with the president. Many believe a settlement would help pave the way for Paramount's planned merger with Skydance Media in hopes of preventing potential retribution by Trump's FCC, which has the authority to halt the multibillion-dollar transaction. Both parties agreed to mediation which is currently underway, signaling their courtroom feud will result in a settlement. \"60 Minutes\" executive producer Bill Owens, who at the time refused to apologize for the Harris interview, resigned last week citing corporate pressure he said prevented him from maintaining editorial independence. Redstone not only wanted to reportedly \"keep tabs\" on upcoming segments involving Trump, she reportedly urged CBS execs to delay any sensitive reporting on Trump until after the merger deal closed with Skydance. The speculation was affirmed by journalists on \"CBS Evening News\" and \"60 Minutes\" who saluted the beloved network producer on-air while addressing Trump's looming lawsuit. CLICK HERE TO GET THE FOX NEWS APP One CBS News insider told Fox News Digital that everyone at the network is \"on edge\" over the ongoing drama. \"Nobody knows the next shoe that will drop,\" they told Fox News Digital. \"And internally, it's just very chaotic because everyone doesn't know what will happen next.\" CBS staffers believe Trump's lawsuit is \"BS\" and that no one wants to see Paramount settle. Some are even \"scared\" about the prospect of a settlement, believing it will \"hurt the news division and the perception of it.\"","summary":"The &quot;60 Minutes&quot; Kamala Harris interview at the center of President Trump&apos;s lawsuit against CBS News received an Emmy nomination for Outstanding Edited Interview.","url":"https://www.foxnews.com/media/60-minutes-kamala-harris-interview-center-trumps-cbs-lawsuit-receives-emmy-nomination","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/emmy60min.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-01 22:00:42","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.076},{"id":316909578,"title":"The week in whoppers: Michelle Obama whines over violent illegal-migrant deportations, Chuck Schumer shoots himself in the foot and more","text":"Diary of disturbing disinformation and dangerous delusions\n\nThis lament:\n\n“What’s happening to immigrants . . . keeps me up at night.”\n\n— Michelle Obama, Monday\n\nWe say: Team Trump is mainly deporting violent illegal immigrants.\n\nIs the former first lady upset with that? Is she ignorant about it? Our guess: It’s all a big show.\n\nAfter all, if Trump’s 140,000 deportations this year keep her up at night, how much sleep did she lose when her husband Barack kicked out 5.3 million illegal immigrants on his watch?\n\nSpot the difference:\n\n“Trump has the lowest 100-day approval rating since they started polling.”\n\n— Senate Minority Leader Chuck Schumer, Tuesday\n\n“Polls come and go.” \n\n— Schumer, a minute later, when asked about his own approval rating of 17%\n\nWe say: Oops. Looks like the kettle just learned a lesson about slamming the pot.\n\nYes, President Trump’s ratings have slipped somewhat in some polls. Yet even the worst of them are at least twice as good as Schumer’s. \n\nThis logic:\n\n“If the government . . . could use the threat of withholding money [from Harvard] . . . then it could threaten you to raise your income taxes unless you toe the line.”\n\n— Harvard law prof Laurence Tribe, Monday \n\nWe say: Team Trump froze Harvard’s funds because it failed to uphold civil-rights law, better protect Jews and comply with Supreme Court rulings on race-blind admissions.\n\nMeanwhile, where were Harvard’s defenders when the Obama and Biden folks threatened to withhold funds from schools that rejected their agendas?\n\nOr when Team Obama’s IRS actually did target the taxes of people who refused to “toe the line” — i.e., conservative groups?\n\nThis claim: \n\n“We’re in the middle of an attempted authoritarian overthrow of American democracy.” \n\n— Rachel Maddow, Saturday\n\nWe say: How long will the left continue with this idiocy? Their “threat-to-democracy” fearmongering didn’t work for Joe Biden, and it failed spectacularly for Kamala Harris in November.\n\nOh, and if anyone has ignored the will of the people (who elected Trump), it’s been the left.\n\nCompiled by The Post Editorial Board","summary":"Michelle Obama said the Trump administration's immigration polices are keeping her up at night — with no mention of how she felt about her husband deporting millions when he was in office.","url":"https://nypost.com/2025/05/01/opinion/the-week-in-whoppers-michelle-obama-whines-over-violent-illegal-migrant-deportations-chuck-schumer-shoots-himself-in-the-foot-and-more/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/whoppers-michelle-obama-chuck-schumer-103657798.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-01 21:43:05","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.596},{"id":316910612,"title":"The Week contest: Drinking chimps","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\npuzzles and quizzes\n\nThe Week contest: Drinking chimps\n\nNewsletter sign up\n\nThe first all-female multiperson spaceflight\n\n(Image credit: Fiona Rogers / Getty Images)\n\nThe Week US \n\nThis week's question: Wild chimpanzees have for the first time been filmed getting drunk together on fermented breadfruit, suggesting humans aren't the only primates who use alcohol to aid social bonding. If David Attenborough were to make a wildlife documentary about these booze-loving simians, what would it be titled?\n\nClick here to see the results of last week's contest: Spaceflight song\nHow to enter: Submissions should be emailed to contest@theweek.com. Please include your name, address and daytime telephone number for verification; this week, please type \"Drinking chimps\" in the subject line. Entries are due by noon, Eastern Time, Tuesday, May 6. Winners will appear on the Puzzle Page of the May 16 issue and at theweek.com/contest on May 9. In the case of identical or similar entries, the first one received gets credit. All entries become property of The Week.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nThe winner gets a one-year subscription to The Week.\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nThe Week US\n\nSocial Links Navigation\n\nHow could Trump ending a VA mortgage program leave veterans on the streets?\n\nToday's Big Question\nVets could face foreclosure as a result of the White House's actions\n\nKamala Harris steps back on center stage\n\nIN THE SPOTLIGHT\nIn her first major speech since Donald Trump took office, the former presidential candidate took solid aim at this administration as speculation grows about her future\n\nSupreme Court may bless church-run charter schools\n\nThe case is 'one of the biggest on church and state in a generation'\n\nYou might also like\n\nThe Week contest: Spaceflight song\n\nPuzzles and Quizzes\n\nQuiz of The Week: 19 - 25 April\n\nHave you been paying attention to The Week's news?\n\nMagazine solutions - May 2, 2025\n\nPuzzles and Quizzes\nIssue - May 2, 2025\n\nMagazine printables - May 2, 2025\n\nPuzzles and Quizzes\nIssue - May 2, 2025\n\nThe Week contest: Robot melodrama\n\nPuzzles and Quizzes\n\nMagazine solutions - April 25, 2025\n\nPuzzles and Quizzes\nIssue - April 25, 2025\n\nMagazine printables - April 25, 2025\n\nPuzzles and Quizzes\nIssue - April 25, 2025\n\nQuiz of The Week: 12 - 17 April\n\nHave you been paying attention to The Week's news?\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"The Week contest: Drinking chimps","url":"https://theweek.com/puzzles/the-week-contest-drinking-chimps","image":"https://cdn.mos.cms.futurecdn.net/YUJ8oEQj2BpfAwFxkWmcKW.jpg","video":null,"publish_date":"2025-05-01 20:48:54","author":"The Week US","authors":["The Week US"],"language":"en","source_country":"US","sentiment":0.438},{"id":316903530,"title":"Kamala Harris' viral backstage dance on 'Boots on the Ground' called 'cringe', Democrats celebrate her comeback","text":"Democrats celebrated Kamala Harris' comeback as she spoke at the 20th anniversary of Emerge America, where she tore into the Donald Trump administration as it completed its first 100 days. Kamala Harris accused the administration of abandoning America's highest ideals and said the White House belongs to the people. This was Harris' first big speaking event after her election loss and she is yet to announce her future plans whether she will be contesting for California Governor or whether she will prepare for the 2028 presidential election. As Harris appeared in her usual cheerful mood, a backstage video of her with viral content creator Kenneth Walden went viral as Harris learned the viral Boots of the Ground dance from Walden. \"Will you teach me?\" Harris said as the duo started dancing.— PopBase (@PopBase) Social media users called it 'cringe' and wondered how it would have been all vibing and no work, had Kamala Harris been the president. Walden asked Harris how she maintains her sense of 'Black Joy'. “I have a husband who is here right now, and an incredible circle of friends who are family, and family. I think it’s just important to be with those people who love you and care about you, and get you,\" Kamala Harris said in a message to naysayers who speculated Kamala Harris' marriage with Doug was breaking. “Some people are describing what’s been happening in recent months as absolute chaos,” Harris said during her address. “Tariffs that—as I predicted—are clearly inviting a recession,\" she said in her 15-minute speech. White House deputy chief of staff Stephen Miller said Harris’ appearance was a 'reminder' of how 'blessed' Americans are that Trump is in the Oval Office and not Kamala Harris. Miller said that if Harris had won, Biden’s disastrous policies would have been continued and led to the \"end of the American Republic.\"‘The only thing Americans want to hear from Kamala Harris is an apology for joining Joe Biden, remember she was the border czar, in aiding and abetting the invasion of our country,’ he said, calling it an ‘eternal stain on the Democrat party.’\"The only thing Americans want to hear from Kamala Harris is an apology for joining Joe Biden, remember she was the border czar, in aiding and abetting the invasion of our country,\" he said, calling it an \"eternal stain on the Democrat party.\"White House spokesperson Karoline Leavitt trolled her as she said, \"I think I speak for everyone at the White House. We encourage Kamala Harris to continue going out and doing speaking engagements.\"","summary":"","url":"https://timesofindia.indiatimes.com/world/us/kamala-harris-viral-backstage-dance-on-boots-on-the-ground-called-cringe-democrats-celebrate-her-comeback/articleshow/120803390.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-120803395/120803395.jpg","video":null,"publish_date":"2025-05-01 20:46:54","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":0.049},{"id":316921818,"title":"In southern parts of Michigan, Trump’s first 100 days under the microscope by voters - Detroit Free Press","text":"In communities spanning the southern parts of Michigan, there's a wide array of opinions on President Donald Trump's first 100 days back in the White House.\n\nIn areas more favorable to Democrats, like Ann Arbor, one voter used the word \"ineffective\" to describe Trump's term so far. But in Hillsdale, part of the heart of Michigan's Trump country, a supporter of the president said his agenda has been \"vindictive\" so far as he carries out campaign promises.\n\nThe Detroit Free Press, Lansing State Journal and Center for Community Journalism - Michigan spoke with voters in the region as part of a project interviewing more than 100 Michiganders about Trump's first 100 days. \n\nDale Biniecki, 70, Maybee\n\nDale Biniecki, 70, of Maybee, is a truck owner/operator and a Republican. He likes to see work getting done. \"I think Trump's doing a pretty good job. He’s keeping the good of the country in mind. He’s getting some stuff done that needed to be done. I hate to see politicians languish and use their office and not do anything.\"\n\n\"He’s made quality appointments to his cabinet. I’m hoping that we can get Social Security straightened out. I hope to have more business brought to the U.S. We should try to build everything we possibly can in the U.S.\"\n\n— Suzanne Wisler\n\nTom Barton, 64, Monroe\n\nTom Barton, of Monroe, a 64-year-old Democrat and retired payment cards program manager at Shell Oil Company, said President Donald Trump’s “executive orders defy common sense, are often unclear and, in other cases, are clearly illegal. He is sending the economy in the wrong direction. His policies are inflationary and economically destructive. His rollback of LGBTQ rights and protections has caused anxiety and stress for both my husband and me. Our worst fears have come into reality.”\n\n— Lisa Vidaurri Bowling\n\nGary Carter, 74, Carleton\n\nGary Carter, 74, of Carleton, is a retired aeronautical engineer. “So far, (President Donald Trump’s second term) is terrific. I’m so happy with what he’s done with the border. Tariffs are an issue but he’s looking at it for the long haul. They’ll be a short-term hit on the market and it will take time to turn around. His stance on DEI, I’m 100% behind him there. I’m hoping to see more building up of our defense. I look forward to him using his negotiating skills. He’s a guy who can make the deal. He’s a strong leader and can stand up against Europe, Russia, Iran. He’s looking out for America first. His heart is in the right place. He can get the nation in good working order.”\n\n— Suzanne Wisler\n\nSierra Seidelman, 22, Monroe\n\nMonroe County Community College student Sierra Seidelman, 22, of Monroe, votes Democratic and says she has been affected by President Donald Trump’s new policies and has been increasingly worried about those in the LGBTQ+, as well as minority groups, within the United States. “I am worried about laws being formed that strip rights away from those within these communities, where those rights to marriage are voided or massive deportations of immigrants, no matter their status in this country. I have had increasing fears over the last few months that we as a nation are reverting back almost 60 years, politically and socially,” Seidelman said.\n\n— Lisa Vidaurri Bowling\n\nJoel Williamson, 40, Monroe\n\nJoel Williamson, a Realtor from Monroe, saw both positives and negatives with President Donald Trump's second administration. He said he wasn't in favor of the number of executive orders issued, since he believes it puts too much power in the hands of the executive branch. On the other hand, he said he is in favor of Trump's cabinet picks and undocumented immigration policy. The one thing he wanted to see more of was grace. \"He's on a mission but try to have a bigger heart,\" he said. \"Less foreign conflict, let's keep shrinking our military budget and influence globally. We can have strength without policing the world.\"\n\n— Connor Veenstra\n\nCleon Broussard, 54, Tecumseh\n\nCleon Broussard, 54, of Tecumseh, is a physical therapist who considers herself a Republican. She said Trump isn't \"politically correct, in any way,\" but he has done a good job of looking at the big picture and working toward what she calls his \"pipe dream of fixing it all.\"\n\n\"He is a businessman and I think we need a businessman instead of a full-time politician,\" she said.\n\n— David Panian\n\nTroy Spiegel, 61, Blissfield\n\nTroy Spiegel, 61, of Blissfield, is currently on disability but he used to work several “odd jobs,” as he described it, mainly while farming.\n\nWhen it comes to politics, Spiegel said he doesn’t closely align with a certain political party. When casting a ballot in the November 2024 presidential election, Spiegel said he voted for the Donald Trump-JD Vance Republican ticket.\n\nSpiegel said he wants to see Trump do what he can to lower prices for consumers and says he’s optimistic about Trump’s remaining years in office.\n\n“I think he’s done great,” Spiegel said, when asked how he would describe Trump’s first 100 days in office, adding “there’s so much going on right now.”\n\n— Brad Heineman\n\nSteve Emerson Sr., 75, of Adrian\n\nSteve Emerson Sr., 75, of Adrian, is an industrial electrician instrument technician who summed up the first 100 days of President Donald Trump’s second term in office as “horrifying.” Emerson, who most closely aligns himself with the Democratic Party, said he voted for the Kamala Harris-Tim Walz Democratic ticket in the November 2024 presidential election. Since taking office as president, Trump has gotten “virtually nothing right,\" Emerson said.\n\nLess hatred, less unkindness and more empathy are some traits that Emerson said he would like to see Trump and his administration exhibit going forward. While his line of work hasn’t been personally affected by any of Trump’s actions or executive orders, Emerson said, “mentally, I’m affected.”\n\n“It remains to be seen whether or not my work is affected. It remains to be seen whether or not my Social Security is affected,” he said. “These things worry me. But I haven’t seen a direct effect to me yet.\"\n\n— Brad Heineman\n\nCraig Davalos, 63, Onsted\n\nCraig Davalos, 63, of Onsted, said President Donald Trump has violated his oath of office and the Constitution by raising tariffs and bombing the Houthis in Yemen and he's worried that Trump will get the U.S. into a war with Iran, despite campaigning on keeping the country out of wars. \"… He's acting like a king and we fought a revolution to get rid of kings,\" Davalos said.\n\nHowever, Davalos said he likes that Trump is doing something. \"Out of all the presidents we've ever had, he's the only one that's actually trying to make some of his campaign promises come true. He's actually doing something. Whether it's the right thing or not, that's why I'm worried because he is violating the Constitution, he's doing it too much, he's overstepping his lawful authority.\"\n\n— David Panian\n\nAvery Hollister, 18, Ann Arbor\n\nAvery Hollister, 18, of Ann Arbor, is a freshman at Michigan State University with an undecided major. Hollister was quick to speak her mind because she has a limited political space. She said most of her friends and family, besides her father, align with the Republican Party, so she doesn’t speak of her Democratic views often.\n\nSo far, President Donald Trump’s administration has discouraged her in two major ways: Federal cuts to health care and executive actions that hurt the LGBTQ+ community. “I’m diabetic, so cutting back on that kind of stuff affects me,” Hollister said.\n\nAlong with needing treatment and medication to care for her health, she needs her father to feel safe in a same-sex marriage. The fear is, one day, her dad’s marriage won’t be valid, “and that’s upsetting to him and for a lot of our family,” Hollister said. As Trump continues to serve, Hollister said she is hoping to see more unity but will carry her pessimism until she and her father feel represented.\n\n— Sarah Moore\n\nMike Bobalik, 73, Sturgis\n\nMike Bobalik, 73, is a Democrat in solidly Republican St. Joseph County, where 66% voted for President Donald Trump in the November 2024 election. “I think some of them are probably feeling that they made the wrong decision but now they're stuck with it,” he said.\n\nBobalik served for 12 years as clerk of Sturgis Township: “Most of my concern is the fact that the current administration is not looking out for the common man and woman in this country, they're looking out for the elitist. They should look out for the common man, the middle class, the lower income, the people in need.”\n\nAs Trump’s term continues, Bobalik said, “Maybe some of this chaos will slow down. But for right now, it's overwhelming.”\n\nMarty McClelland, 66, Quincy\n\nMarty McClelland, 66, is a retired sales rep who moved from Chicago to his wife’s former home on a lake near Quincy, Michigan. He said he hopes the nation's democracy can withstand the onslaught of attacks from President Donald Trump's administration.\n\n“We're in uncharted territory. We don't know what's what. … Anything can happen,” over the rest of Trump’s term.\n\n“I think his administration has joined everything they can to tear down the guardrails to democracy; he is making some things happen. As far as the influx of immigration, that is somewhat of a positive, but going after the universities, slashing aid is not a good thing,\" McClelland said.\n\nPenny Kelly, 76, Coldwater\n\nPenny Kelly, 76, is the wife of a retired Coldwater fireman and pilot. The Republican voter said she is happy with President Donald Trump and his efforts to remove undocumented immigrants “out of our country, the criminals and stuff. There's been too many crimes. I don't like my tax dollars going to people that are not citizens of our country and I understand that they have been going that way.”\n\nKelly said she hopes Trump ends taxes on Social Security. “I don't know what's going to happen with that but I hope that it goes off.”\n\nShe is concerned about the federal decision of the lower court on Trump’s actions. \"We have the Supreme Court that rules on a lot of things but we have regular federal judges from different states. They're trying to stymie and tie the hands of the administration that's trying to run our country right. I think that's wrong.”\n\nBryce Bellamy, 20, Quincy\n\nBryce Bellamy, 20, was a high school track star at Quincy High School, now working at a health club. The independent voted in his first presidential election in November.\n\nHe expressed concern about President Donald Trump’s deportation policies of those here legally, who didn’t commit crimes. “We can't bring them back, I think it's really concerning and morally very unjust.\"\n\nBellamy said he wants to see the economy turned around. “I know a lot of people that personally voted for Trump with hopes of him turning the economy around. I'm concerned whether that will happen. I had not seen that happen yet and so I still feel uneasy about the next four years.”\n\nOmar Ferdin, 44, Monroe\n\nOmar Ferdin, 44, of Monroe, is pessimistic about the next four years. As a Hispanic American, he said he feels nervous about the Trump administration's immigration policies. \"I get nervous when I drive past a police officer, knowing that it's legal for them to stop and question me simply because of the color of my skin,\" he said.\n\nHe's also concerned that the administration is \"attacking\" what he sees as essential institutions, like the Department of Education and health care. \"So I ask: How long until enough people are finally affected?\" he said. \"And by then, what will be left of the country we thought we knew?\"\n\n— Connor Veenstra\n\nJon Smith, 47, Hillsdale\n\nJon Smith, 47, of Hillsdale, is a lifelong Republican and active member of Hillsdale’s America First Republicans. As a former 5th Congressional District Chair for the Michigan GOP and a delegate for President Donald Trump, he liked Trump’s cabinet choices and efforts to reduce wasteful spending through DOGE, although government spending remains high. “I think he’s been the most productive president I’ve ever witnessed while being simultaneously attacked by the left and the establishment. I think his first 100 days have been excellent.”\n\n— Corey Murray\n\nPenny Swan, 66, Hillsdale\n\nPenny Swan, 66, of Hillsdale, is a lifelong Republican who voted third-party for the first time in the last presidential election. An active member of the Hillsdale County Republican Party, she said that President Donald Trump’s tit-for-tat tariffs are not good government. She is also against sending immigrants to foreign prisons. “I haven’t seen any documents showing these people are MS-13 gang members. And now he’s talking about sending Americans to foreign prisons. He’s desecrating our rights as citizens.”\n\n— Corey Murray\n\nThis series was reported by: Dana Afana, Lily Altavena, Sarah Atwood, Tresa Baldas, Duante Beddingfield, Dave Boucher, Lisa Vidaurri Bowling, Jackie Charniga, Natalie Davies, Paul Egan, Eric Guzmán, Christina Hall, Brad Heineman, Clara Hendrickson, Brendel Hightower, Johnathan Hogan, Violet Ikonomova, Cassidey Kavathas, Georgea Kovanis, Jamie L. LaReau, Eric D. Lawrence, Arpan Lobo, Keith Matheny, Sarah Moore, Darcie Moran, David Rodriguez Muñoz, Corey J. Murray, David Panian, Jenna Prestininzi, Nour Rahal, Nushrat Rahman, Liam Rappleye, Don Reid, JC Reindl, Adrienne Roberts, Andrea May Sahouri, Beki San Martin, Susan Selasky, Kristen Jordan Shamus, Scott Talley, Kristi Tanner, Connor Veenstra, Tess Ware, Niraj Warikoo, Jalen Williams, John Wisely, Suzanne Nolan Wisler and Frank Witsil.","summary":"In southern parts of Michigan, Trump’s first 100 days under the microscope by voters  Detroit Free Press","url":"https://www.freep.com/story/news/politics/2025/04/30/donald-trump-100-days-southern-michigan/83199338007/","image":"https://www.freep.com/gcdn/authoring/authoring-images/2025/04/29/PDTF/83342029007-new-promo-100-dayssouthern-1.png?crop=2047,1153,x0,y447&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2025-05-01 20:33:42","author":"Dana Afana","authors":["Dana Afana"],"language":"en","category":"politics","source_country":"us","sentiment":0.062},{"id":316899358,"title":"’60 Minutes’ report that prompted Trump lawsuit is nominated for an Emmy Award","text":"Last fall’s “60 Minutes” story on Kamala Harris — the subject of Trump’s $20 billion lawsuit against CBS — was nominated for an Emmy Award Thursday for “outstanding edited interview.” Trump, in his lawsuit, complained that the interview was deceptively edited to make his Democratic election opponent look good.\n\nThe annual News & Documentary Emmys will be awarded in late June. “60 Minutes” is competing against interviews with singer Celine Dion, U.S. Supreme Court Justice Ketanji Brown Jackson, Pope Francis and WNBA star Brittney Griner.\n\nThe fallout over the Harris interview still hangs over CBS News. The news division claims to have done nothing wrong, but its parent company, Paramount Global, is reportedly negotiating a settlement with Trump.\n\nMany CBS News journalists oppose a settlement. Former “60 Minutes” executive producer Bill Owens, who has fought against such a deal, resigned last month. Owens cited in his resignation the corporate restrictions placed on him in the wake of the Harris story, which is also the subject of an investigation by President Trump’s FCC chairman.\n\nTrump complained about the interview again on Wednesday in a Truth Social post. This time, his anger spread to The New York Times, which in a story on Tuesday said that “legal experts have called the suit baseless and an easy victory for CBS.”\n\n“They don’t mean that, they just have a non curable case of TRUMP DERANGEMENT SYNDROME,” the president wrote, saying he’s looking into potential legal action against the newspaper.\n\n“The New York Times will not be deterred by the administration’s intimidation tactics,” the newspaper said in response.","summary":"It got &#8220;60 Minutes&#8221; sued by the man who became president of the United States. Now it&#8217;s up for a major award &#8212; for precisely the same aspect of it that so enraged Donald Trump. Last fall&#8217;s &#8220;60 Minutes&#8221; story on Kamala Harris &#8212; the subject of Trump&#8217;s $20 billion lawsuit against CBS &#8212; was [&#8230;]","url":"https://torontosun.com/entertainment/television/60-minutes-report-that-prompted-trump-lawsuit-is-nominated-for-an-emmy-award","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/05/6813d5fd89cd72e971c013d3jpeg.jpg","video":null,"publish_date":"2025-05-01 20:30:20","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.029},{"id":316895936,"title":"Shari Redstone asked CBS to ‘delay sensitive stories about Trump’ until Paramount’s Skydance merger closed: source","text":"Paramount Global boss Shari Redstone asked CBS brass to delay airing sensitive stories about President Trump and his policies until after she closes the deal to merge with Skydance Media, The Post has learned.\n\nAccording to a source with knowledge, Redstone had become increasingly concerned over a handful of “60 Minutes” stories that drew criticism from the president and the Federal Communications Commission.\n\nThe media heiress called CBS CEO George Cheeks in April to express her concerns about critical Trump stories on Ukraine and Greenland that caused the president to urge FCC chair Brendan Carr in a Truth Social Post to “impose the maximum fines and punishment,” the source said. \n\nPuck News, which was first to report Redstone’s request to Cheeks, said she asked the exec what else she could expect from the program and wanted to know if it would be possible to delay sensitive stories about Trump and his policies until after she closed the Skydance deal. \n\nThe outlet added that there’s no evidence of Redstone’s increased oversight of “60 Minutes” that has caused the show to change its programming, nor has Cheeks ever tried to execute her request. \n\nCBS declined to comment. A rep for Redstone did not immediately return requests for comment.\n\nA CBS insider told The Post that Redstone’s request isn’t necessarily out of the ordinary; sometimes execs make it clear to network brass that there are sensitive times to hold off on running certain stories.\n\nBut in this case, the situation is different; there is a spotlight on “60 Minutes,” which is in the crosshairs of President Trump over alleged bias.\n\nCurrently Paramount is in mediation with lawyers for Trump, after he filed a $20 billion lawsuit against “60 Minutes,” in which he alleged the show “deceptively edited” its sitdown with then-Vice President Kamala Harris, who was running for president at the time, to make her look better\n\nCarr, who is charged with greenlighting Paramount’s $8.4 billion merger with Skydance, has also launched a probe into the interview over claims of “news distortion.”\n\n“60 Minutes” has claimed no wrongdoing and released the unedited interview and transcript of the sitdown, but the episode has rankled journalists inside of the network. \n\nLast week, Bill Owens, the head of the show, stepped down, citing concerns about a lack of editorial independence. \n\nIn recent months, Owens bumped heads with higher ups at the company, notably Redstone.\n\nRedstone, whose family stands to pocket about $1.75 billion if the $8 billion merger with Skydance Media goes through, allegedly pressed CBS News president Wendy McMahon to fire Owens for airing of a one-sided January report on the Gaza War. \n\nFollowing the episode, Redstone insisted that Susan Zirinsky, a legendary CBS producer who also served as the news division’s president from 2019 to 2021, oversee the Standards & Practices of “60 Minutes” and other CBS News programs.\n\nOwens privately bristled at the appointment of Zirinsky, who had once been in a bake-off with him for his job at the show. Zirinsky later brought in CBS News veteran Al Ortiz to help her with oversight of “60 Minutes,” which was much more palatable to Owens. \n\nOwens’ concerns of editorial interference were echoed by “60 Minutes” anchor Scott Pelley, who launched into a shocking on-air attack of Paramount on Sunday, in which he accused top brass of interfering with the program’s coverage. \n\nIn a tribute to “60 Minutes” Owens, Pelley went off on Paramount’s heavy handed-interference, which caused his boss to resign.\n\nAlthough Pelley said “none of our stories have been blocked,” he noted that Owens “felt he lost the independence that honest journalism requires.”","summary":"Redstone had become increasingly concerned over a handful of \"60 Minutes\" stories that drew criticism from the president and the Federal Communications Commission, sources said.","url":"https://nypost.com/2025/05/01/media/shari-redstone-asked-cbs-to-delay-sensitive-stories-about-trump-source/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/103658346.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-01 20:28:54","author":"Alexandra Steigrad","authors":["Alexandra Steigrad"],"language":"en","source_country":"zm","sentiment":-0.365},{"id":316895766,"title":"What Democrats’s debate on ‘oligarchy’ is really about","text":"Sen. Elissa Slotkin, D-Mich., while recently discussing the Democrats’ brand crisis, told Politico that the party ought to avoid using the term “oligarchy” because it doesn’t resonate outside coastal institutions and suggested that Democrats say “kings” instead. Days later, Sen. Bernie Sanders, I-Vt., who has been drawing massive crowds on his “Fighting Oligarchy” tour, retorted, “I think the American people are not quite as dumb as Ms. Slotkin thinks they are.” He continued, “I think they understand very well. When the top 1% owns more wealth than the bottom 90%, when big money interests are able to control both political parties, they are living in an oligarchy.” Naturally, a democratic socialist is more inclined than a conservative Rust Belt Democrat to push the idea that America is run by a small group of wealthy elites. But there’s another dimension to the rift over talking about “oligarchy” that’s not as much about politics as it is political communication: Establishment Democrats don’t believe they can persuade the public to adopt new positions and rethink their worldview. Slotkin said so herself. Prompted by a journalist to respond to Sanders’ comment, she said, “I agree with everything he said, other than, my dad didn’t know what oligarchy meant.” In other words, she’s skeptical that the idea of “oligarchy” can even be transmitted to and understood by a mass public. That hesitation to present alternative positions that might sit outside mainstream thinking is shared by many of her colleagues — and it’s key to understanding the party’s crisis, and the country’s crisis. Look at the way the Democratic Party has largely frozen up and avoided a full-on confrontation with President Donald Trump since the November election. The party knows that it was shellacked and yet has no confidence to pursue reinvention or explain what they’re fighting for. Democratic strategist James Carville’s advice to Dems after that election was to “roll over and play dead.” Senate Minority Leader Chuck Schumer said he was inclined to hang back and let Trump “screw up,” a mindset that has informed his refusal to fight hard in the Senate. Many Democrats have decided that Trump has won the day on immigration. They have voted with him on the issue and hesitated in pushing back against his extreme deportation agenda, despite him shredding up due process and First Amendment rights. California Gov. Gavin Newsom, a potential 2028 Democratic White House hopeful, seems to be adopting MAGA-friendly positions objecting to “woke culture.” On his podcast, he provided a friendly platform for former Trump campaign manager Steve Bannon to lie about the 2020 election. The party remains stuck in a state of permanent anxiety that preceded their loss — last year President Joe Biden and later Vice President Kamala Harris appeared to fear standing for anything other than defending against Trump. Democrats have quasi-surrendered to Trump in part because many believe Trump has a finger on the pulse of the body politic on issues such as immigration and believe that their pushing back will backfire. But there’s also an absence of faith that the party can embark upon persuading the public to see things in a way that isn’t defined by the right or isn’t a reversion to a pre-Trumpian status quo. Slotkin’s preference for “kings” is a poignant example because, while she’s obviously right that the word is more recognizable, she’s taking a position against pursuing a positive new identity and theory of class antagonism that “oligarchy” portends. If there ever was a time for Democrats to experiment with new ideas to adapt to our populist era, now’s that time. Trump won the popular vote and increased his share of support in over 90% of counties across the U.S., compared to 2020, and the Democratic Party is experiencing record-breaking levels of unpopularity. Democrats also have significant room to experiment with messaging and policy as a minority party — the next set of elections are still 18 months away. What is there to lose? Democrats have been unable to think outside narrow status quo-oriented paradigms for decades. President Bill Clinton’s strategy of “triangulation” — co-opting conservative talking points to deflect attacks from the right — has shaped the party’s thinking ever since, and his longtime allies are now saying it’s the way forward even as Trump plunges us into an authoritarian nightmare. An adjacent mistake is Democrats, especially center-left pundits and strategists, promoting “popularism,” the idea that Dems should only align themselves with policies and rhetoric that poll highly at the current moment. But Democrats are mistaken — and catastrophically so. And not just in their general refusal to call out “oligarchy.” The party needs to stand for something real and worthwhile instead of trying to find a way to contort itself to ride out waves of reaction. Persuasion requires an experimental mindset and a willingness to try new things. It is indeed possible to persuade people to accept radically new beliefs — as Trump has repeatedly proved in the last decade. Slotkin’s apparent belief that “oligarchy” is a term only intelligible to liberal elites isn’t even right. Data for Progress surveyed likely voters in late February and early March — after Sanders kicked off his tour — and asked them to choose the definition of “oligarchy” from multiple choices describing different forms of government without labels, including oligarchy, autocracy, theocracy and direct democracy. A majority answered correctly and, crucially, were able to correctly distinguish between definitions of oligarchy and autocracy. Not only did 54% of Democrats chose the correct answer, but 68% of independent or third-party voters, and 48% of Republicans did, too. After being given the definition of oligarchy, 60% of likely voters said the U.S. was at least somewhat oligarchic. Those results don’t mean that oligarchy is widely understood yet. But they illustrate that the term is legible with context and that it has the potential to gain purchase with the broader public. Public opinion is never fixed, and political leaders have a huge role to play in shaping the way their party understands issues. “There’s lots of research that shows that political leaders often can have very significant persuasive power over the loyal followers of their party,” David Hopkins, a political scientist at Boston College, told me. “For a lot of people who are partisans, their identity as a partisan is more central to them than their position on most policy issues.” He noted how President Barack Obama’s switch to support of gay marriage triggered “a noticeable jump” in the share of Democrats, especially Black Democrats, who support gay marriage. In another Data for Progress poll in March, likely voters were initially opposed to Nippon Steel Corporation, a Japanese company, acquiring U.S. Steel. But after seeing supportive messages from their own party regarding the acquisition, Democrats shifted in favor of it by an astonishing 69 points. Trump illustrates the capacity of a politician to persuade followers to adopt new beliefs. He has transformed his own party’s attitudes toward immigration, free trade, Canada, Europe, the Russia-Ukraine war, Ukrainian President Volodymyr Zelenskyy, and on all kinds of norms of propriety in the public sphere. Trump is anti-intellectual, but he has also brought obscure, abstract concepts into wide circulation, such as the idea of “the deep state.” It is a term that Trump uses deceptively and toward reactionary purposes, but there is a kernel of truth to his point that government bureaucracy personnel can have power and interests that are distinct from and at odds with democratically elected leaders — for better and worse. It’s a theoretical concept, and it doesn’t make oligarchy look like an impossible lift. Changing the views of your own party, ideally toward good ideas that match the moment and excite people, is in and of itself important in a highly polarized era where turnout is essential to winning electoral contests. But the tougher sell is persuading people outside one’s base. Here, too, Trump showed success. Trump not only changed his own party's positions on issues such as free trade and immigration, he also put Democrats on their back foot on those issues while attracting low-information swing voters looking for a change-coded candidate. None of this is to say that politicians should gravitate toward unpopular ideas or that they should show indifference to current public interest in policies. The point is that the popularity of a policy or a message is not fixed, and figuring out how a message can resonate is not something that can be worked out purely through guesswork. It involves effective, charismatic politicians testing assumptions and seeing what happens — and not backing off of the moment those new ideas, as so many do, receive backlash. (Consider how Harris immediately distanced herself from her most economically populist-sounding policy in 2024 — cracking down on corporate price gouging — the moment it got fierce pushback from mainstream media and the right.) “Especially in this moment, voters value their leaders being authentic and fighting for them,” Ryan O’Donnell, deputy executive director at Data for Progress, told me. “Public opinion matters — it’s important to know where voters stand — but popularism risks triangulation and inauthenticity if pinpointing those preferences is all you care about.” To that point, look at what the huge crowds for Sanders are telling us. Last month the data journalist G. Elliott Morris aggregated three months of YouGov polls asking respondents how favorably they view prominent political figures or possible 2028 candidates, and he determined that Sanders was the most popular political figure in America — and the only one with a significant net favorability rating. Here’s his analysis: There is a growing oligarchy in this country and Democrats not talking about it hasn’t helped them avoid horrific approval ratings. They need to embrace change, not only for their party’s survival, but for the survival of the republic.","summary":"Elissa Slotkin's clash with Bernie Sanders over using \"oligarchy\" captures the Democrats' crisis of identity and their loss of faith in the power of persuasion.","url":"https://www.msnbc.com/opinion/msnbc-opinion/oligarchy-slotkin-sanders-democrats-persuasion-rcna203422","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-04/250429-candidate-flag-mn-1205-4db491.jpg","video":null,"publish_date":"2025-05-01 20:03:12","author":"Zeeshan Aleem","authors":["Zeeshan Aleem"],"language":"en","category":"politics","source_country":"US","sentiment":-0.112},{"id":316892376,"title":"How could Trump ending a VA mortgage program leave veterans on the streets?","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\ntoday's big question\n\nHow could Trump ending a VA mortgage program leave veterans on the streets?\n\nVets could face foreclosure as a result of the White House's actions\n\nNewsletter sign up\n\nThe U.S. Department of Veterans Affairs headquarters is seen in Washington, D.C.\n\n(Image credit: Al Drago / Bloomberg via Getty Images)\n\nJustin Klawans, The Week US \n\nThe Trump administration has ended a program that served as a key lifeline for veterans, and many military and Department of Veterans Affairs advocates are worried that it could lead to more veterans foreclosing on their homes. The VA Servicing Purchase Program (VASP) was enacted by the Biden administration to help veterans avoid foreclosure by rolling their missed mortgage payments into low-interest loans.\n\nBut without the VASP, which has reportedly helped 17,000 vets avoid foreclosure, some veterans are concerned that they could have trouble meeting their next home payment.\nWhat did the commentators say? \nCutting the VASP \"leaves millions of military veterans with far worse options than most other American homeowners if they run into trouble paying their home loans,\" said NPR. Trump's decision to slash the program also \"comes at a time when nearly 90,000 VA loans are seriously past due, with 33,000 of those already in the foreclosure process.\" Given that the average mortgage rate is currently high at almost 7%, according to Freddie Mac, the VASP is \"often the only affordable option for homeowners with VA loans.\"\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nMany veterans with these loans have \"missed multiple payments and are in danger of losing their homes to foreclosure, according to recent data from Intercontinental Exchange,\" said MarketWatch. These loans \"make up a relatively small part of the mortgage market, with conventional loans forming the biggest share,\" but \"resumption of VA-loan foreclosures could result in an increase in overall foreclosure activity by as much as 15% in 2025.\"\n\nRepublicans lambasted the VASP \"because, they argued, the VA becoming the loan holder put taxpayer dollars at unacceptable risk,\" said Military.com. Despite this, advocates have been \"warning the VA that shutting down VASP without replacing it with something else first would result in large numbers of veterans losing their homes,\" said NPR.\nRep. Derrick Van Orden (R-Wisc.) and Sen. Richard Blumenthal (D-Conn.) have presented potential replacement plans for the VASP. These replacement programs would \"help vets struggling to keep their homes by moving their missed payments to the back of their loan term so they would pay them back down the road,\" said NPR. But these bills have a long way to go to become law, and between this is a \"chasm that could swallow thousands of VA home loans.\"\nWhat next? \nDemocrats have criticized the Trump administration for ending the program, even as they work to find an alternative. The VA is \"taking a misstep that will push thousands of veterans into foreclosure,\" Blumenthal said in a letter to the Trump administration. Ending VASP is \"cruel, wrong, and runs counter to the benefits earned by veterans.\"\nMortgage companies are also warning about what the program's end could mean. Bankers are \"very worried,\" said Justin Wiseman, the vice president for residential policy at the Mortgage Bankers Association, to CNN. They \"don't like to foreclose on anyone, and especially not on veterans,\" Wiseman said. \"We're very worried that without a replacement program for VASP, there will be more foreclosures.\"\nThe nonpartisan Center for Responsible Lending, a housing advocacy think tank, also wrote a letter claiming that ending the program means veterans will \"face unnecessary foreclosures, and the claims associated with these foreclosures will unnecessarily raise the budgetary cost of the home loan program for the VA.\" Many of these \"homeowners will be forced to sell their homes and move or face foreclosure, burdening the VA program with claims from foreclosures that could have been avoided.\"\n\nExplore More\n\nDonald Trump\nU.S. Military\nHousing crisis\nToday's big question\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nJustin Klawans, The Week US\n\nSocial Links Navigation\n\n Justin Klawans has worked as a staff writer at The Week since 2022. He began his career covering local news before joining Newsweek as a breaking news reporter, where he wrote about politics, national and global affairs, business, crime, sports, film, television and other news. Justin has also freelanced for outlets including Collider and United Press International.\n\nKamala Harris steps back on center stage\n\nIN THE SPOTLIGHT\nIn her first major speech since Donald Trump took office, the former presidential candidate took solid aim at this administration as speculation grows about her future\n\nSupreme Court may bless church-run charter schools\n\nThe case is 'one of the biggest on church and state in a generation'\n\n5 refreshing books to read this May to hop into spring\n\nThe Week Recommends\nA look at womanhood in the digital age, an ode to second chances and more\n\nYou might also like\n\nKamala Harris steps back on center stage\n\nIN THE SPOTLIGHT\nIn her first major speech since Donald Trump took office, the former presidential candidate took solid aim at this administration as speculation grows about her future\n\nTrump blames Biden for tariffs-linked contraction\n\nThe US economy shrank 0.3% in the first three months of 2025, the Commerce Department reported\n\nTrump's crypto 'sea change' upends Washington's finances\n\nIn the Spotlight\nBy embracing digital currency, the White House is clearing a path for a new era in dubious self-enrichment\n\n'It is not enough to simply defend the status quo'\n\nInstant Opinion\nOpinion, comment and editorials of the day\n\nTrump says he could bring back Ábgego García but won't\n\nAt a rally to mark his 100th day in office, the president doubled down on his unpopular immigration and economic policies\n\nA 'meltdown' at Hegseth's Pentagon\n\nThe Defense Secretary is fighting to keep his job amid leaked Signal chats and staff turmoil\n\nReining in Iran: Talks instead of bombs\n\nTrump edges closer to a nuclear deal with Iran—but is it too similar to former President Barack Obama's pact?\n\nTariffs: The quest to bring back 'manly' jobs\n\nTrump's tariffs promise to revive working-class jobs, but today's labor market has moved on\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"Vets could face foreclosure as a result of the White House's actions","url":"https://theweek.com/politics/trump-va-mortgage-veterans","image":"https://cdn.mos.cms.futurecdn.net/sHkdymxKfeZ7zPTXgocsLY.jpg","video":null,"publish_date":"2025-05-01 19:52:16","author":"Justin Klawans","authors":["Justin Klawans"],"language":"en","source_country":"US","sentiment":-0.129},{"id":316902084,"title":"How Seriously Should You Take the Trump 2028 Hats?","text":"Donald Trump, perpetual provocateur-in-chief, has caused outrage again—this time with “Trump 2028” hats that can be yours for only $50 apiece.\nThe Trump Organization dropped the hats and other Trump 2028 merch last week, amid growing concern that the president will attempt to seek an unconstitutional third term. The merch only fueled more speculation, leading people to ask: Is he trolling or is he serious?\nThe answer—as is often the case with Trump—seems to be a little bit of both, according to Nick Marx, co-author of That’s Not Funny: How the Right Makes Comedy Work for Them.\n“Joking, for him, serves the purpose of allowing him to test the boundaries of acceptability,” said Marx, who is also an associate professor of film and media studies at Colorado State University.\nTrump’s apparent lack of respect for political and social niceties has long been a part of his appeal. His brash, offensive, and unfiltered sense of humor has attracted edgelords and manosphere-types since his first campaign. In the following years, he would double down on the outrageous stunts because it keeps him relevant and his supporters happy.\n“He understands from the first term that, ‘There are going to be no consequences if I say this, so I'm going to keep doing it and keep pressing the buttons that both piss off liberals and attract my right wing base, fortifying their support behind me,’” Marx said.\nThe new hat is just Trump’s latest way of pushing these buttons, which is “fundamental to the trolling persona” he has cultivated, according to Marx.\nBut it also serves another purpose: Planting the seed for a third term now so that voters are more amenable to it in 2028, said Caleb Warren, an associate professor of marketing at the University of Arizona who specializes in consumer psychology.\n“If it doesn't go well, he can fall back and say it was just a joke, it was just a way to troll the liberals, it was just a way to make money,” said Warren. “He's using humor and irony as a cover. But I suspect it's part of a real testing of the waters to see if they'll be able to run for another term.”\nTrump has been elusive about whether or not he would run in 2028, which goes against the 22nd Amendment. A third term would require Congress to change the Constitution, which is highly unlikely. Trump told NBC News in March that he was “not joking” about a possible third term but that it was “far too early to think about it.”\nYet the merch drop suggests that the Trump camp is thinking about it. While press secretary Karoline Leavitt told Axios that “it’s just a hat,” the Trump website explicitly tells buyers to “rewrite the rules” with the hat—suggesting the president’s willingness to flout the Constitution.\nTrump is no stranger to capitalizing on his own controversies. He has sold sneakers with photos of his assassination attempt, mugs with his mugshot on them, and shirts trolling Taylor Swift for endorsing Kamala Harris during last year’s presidential election.\n“He's got a long history of grift, of merchandising to cash in on whatever thing people will buy at the moment and fatten his pockets,” Marx said.\nBut the hats also serve as a ripe distraction from what the Trump administration is doing now, said Warren. The president is skilled at keeping media attention for his wild stunts and statements, which obscures his actual policies. Just yesterday, Elon Musk stirred up further headwear-related mishegoss by wearing two hats during a Trump cabinet meeting: a red MAGA-style cap that read “GULF OF AMERICA” over top of a black “DOGE”-embroidered one.\n“The more we're talking about this, the less we're talking about him deporting people illegally or firing people who are in charge of our nuclear codes, or cutting all health services, or all the other things he's doing,” Warren said.\nSo with all of that being said, should we be taking these Trump 2028 hats seriously? Marx says yes.\n“He's proven again and again that joking is his way of introducing particularly harmful ideas into public discourse, and they have a way to sort of become normalized because we might dismiss them as jokes,” Marx said. “So even if it's framed as kind of a glib or ironic, we have to still take those things seriously and call them out for what they are.”","summary":"As Donald Trump toys with an unconstitutional third term, his new merch is fanning the flames of outrage.","url":"https://www.gq.com/story/trump-2028-hat-explainer","image":"https://media.gq.com/photos/6813bfa07cb7e5450a8e44a5/16:9/w_2992,h_1683,c_limit/Trump%202028%20Hat.jpg","video":null,"publish_date":"2025-05-01 19:42:28","author":"Daysia Tolentino","authors":["Daysia Tolentino"],"language":"en","source_country":"us","sentiment":-0.249},{"id":316894122,"title":"Fox News Politics Newsletter: Waltz-ing Up to Turtle Bay","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Kamala Harris comes knives out against Trump in first speech since leaving office: ‘Absolute chaos’ -JD Vance explains why meeting Pope Francis hours before his death was 'a sign from God' -35 GOP lawmakers say not repealing Biden’s green agenda in Trump tax bill is ‘hypocrisy’ Waltz Out at NSC, Rubio to Pull Double Duty President Donald Trump tapped former national security advisor Mike Waltz for his administration's ambassador to the United Nations after Waltz was ousted from the National Security Council office earlier Thursday. \"I am pleased to announce that I will be nominating Mike Waltz to be the next United States Ambassador to the United Nations,\" Trump posted to Truth Social Thursday. \"From his time in uniform on the battlefield, in Congress and, as my National Security Advisor, Mike Waltz has worked hard to put our Nation’s Interests first. I know he will do the same in his new role. In the interim, Secretary of State Marco Rubio will serve as National Security Advisor, while continuing his strong leadership at the State Department. Together, we will continue to fight tirelessly to Make America, and the World, SAFE AGAIN. Thank you for your attention to this matter!\" …READ MORE White House STAND STRONG: Parents of Hamas hostages urge Trump to be 'tough with enemies and friends' as Israel continues military operations in Gaza 'DEI STRANGULATION': White House vows to implement 'system of merit' in US, dismantle DEI 'strangulation' 'SIGNAL GATE': Dems say Trump 'firing the wrong guy' as Waltz ousted as national security advisor 'BRINGING RELIGION BACK': Trump jokes his admin will 'forget about' separation of church and state LEADERS OF FAITH: Trump executive order will stand up presidential religious liberty commission World Stage 'YOUR FATE': CIA videos aim to turn Chinese officials and 'steal secrets' SHIFTING BLAME: China blames US for origin of COVID-19 and turning 'deaf ear to the numerous questions over its conduct' 'SHAKEN': Israel cancels Independence Day celebrations as wildfires rage through country Capitol Hill OFF THE ROAD: Trucking vet lawmaker sounds off on illegal immigrant drivers as REAL ID deadline looms TAX TIME: Republicans discuss defunding 'big abortion' like Planned Parenthood in Trump agenda bill REPORTER'S NOTEBOOK: Where we stand with Trump's 'big, beautiful bill' Across America EDUCATION FREEDOM: School choice supporters protest exclusion of religious charter in Supreme Court case GRACE UNDER FIRE: Former Air Force Major who defied Biden vaccine mandate speaks out, applauds Hegseth HUNTER BACKS OFF: Hunter Biden drops lawsuit against IRS, which whistleblowers say 'shows you everything you need to know' 'POWERFUL METAPHOR': Harris draws social media scorn for digression about elephants during an earthquake 'MISSION-MINDED FOCUS': HUD Secretary Scott Turner lays out agency wins during first 100 days, shares priorities for next 100 HISTORY OF VIOLENCE: Columbia student activist interviewed by FBI for allegedly saying 'I like to kill Jews': court docs 'RESIDENT ALIENS': DOGE says it's referred dozens of potential voter fraud cases to DOJ WAR MODE: Hegseth orders sweeping Army overhaul and consolidation aimed at countering China and Golden Dome capabilities Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-waltz-ing-up-turtle-bay","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/waltztrmp.png?ve=1&tl=1","video":null,"publish_date":"2025-05-01 19:34:26","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.157},{"id":316895036,"title":"Kamala Harris’s speech shows she learned nothing from her election defeat","text":"She managed to say that “America has never fully lived up to these ideals,” the “American dream has, for decades, been slipping out of reach for so many,” a time frame which included her years as vice president and senator, and that the people deserve “leaders who make their lives better and make our country stronger.” Harris was vice president for four years, during which there were record-breaking gas prices and inflation, and immigration policies that allowed criminal illegal immigrants to enter the country and murder innocent women.\n\nHarris is as delusional as she ever was. Consider her speech’s references to the “courage” of Milwaukee Judge Hannah Dugan, whom the Wisconsin Supreme Court recently suspended, and colleges and universities that have been threatened with cuts in funding for failing to comply with federal laws such as Title IX or take necessary measures to control bigotry on campuses.\n\n“The courage of judges to uphold the rule of law in the face of those who will jail them,” Harris said. “Of universities who are defying unconstitutional demands that threaten the pursuit of truth and academic independence.”\n\nJudges who break the law and are held accountable for doing so? Colleges that enabled radical left-wing protesters to destroy campuses and attack students based on their ethnicity and religion? Universities that made female athletes compete with biologically stronger male swimmers and forced female athletes against their will to share the same locker rooms?\n\nHarris then had the audacity to mention the cost of living and daily life expenses, arguably the most tone-deaf thing she might have said. Her comments lacked any self-awareness and revealed she was in complete denial about what life was like in the country when she was vice president.\n\nShe bemoaned the Trump administration’s platform, denouncing it as “an agenda that is not lowering costs, not making life more affordable, and not what they promised.”\n\nOf course, this is intellectually disingenuous, given the state of affairs under her administration’s watch. Harris and her boss regularly promised reduced costs and more affordable goods, but they failed to deliver for four years.\n\nTrump hasn’t even been in office for four months. Harris held him to a higher standard than she held herself.\n\nAfter losing in 2024 and taking a break from politics, one would think she reflected on what happened and assessed the reality of her failed politics. However, Harris did nothing of the sort and came out as if it were Sept. 30, 2024, instead of April 30, 2025.\n\nKamala Harris is as she always was. It’s abundantly clear that she learned absolutely nothing from her loss, and one suspects she never will.","summary":"Former Vice President Kamala Harris gave a speech Wednesday night that many believe will be her reentry into the country’s political landscape. But after listening to her talk and cackle for slightly under 20 minutes, it felt as if her 2024 presidential campaign never ended. Her speech’s contents were dark, divisive, and filled with performative [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/beltway-confidential/3398309/kamala-harris-speech-shows-she-learned-nothing/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/harris.-gov.webp","video":null,"publish_date":"2025-05-01 19:25:41","author":"Christopher Tremoglie","authors":["Christopher Tremoglie"],"language":"en","category":"politics","source_country":"us","sentiment":-0.294},{"id":316882564,"title":"Political roasts in the age of Trump 2.0","text":"The political roast is an American pastime. President Trump has never had much appetite for it, skipping the famous annual comedy takedown at the White House Correspondents Dinner on Saturday.\n\nBut the tradition is still alive and well, just a mile from the White House.\n\nIn a city which voted overwhelmingly for Kamala Harris, we went along to a DC comedy roast.","summary":"The political roast is an American pastime. President Trump has never had much appetite for it, skipping the famous annual comedy takedown at the White House Correspondents Dinner on Saturday.","url":"https://www.channel4.com/news/political-roasts-in-the-age-of-trump-2-0","image":"https://fournews-assets-prod-s3-ew1-nmprod.s3.amazonaws.com/media/2025/05/roast-thuimb1-1920x1080.png","video":null,"publish_date":"2025-05-01 19:23:13","author":"Matt Frei","authors":["Matt Frei"],"language":"en","category":"politics","source_country":"GB","sentiment":0.375},{"id":316887332,"title":"Democrats' Chances of Beating GOP's Jon Husted in Ohio, According to Polls","text":"Republican Senator Jon Husted of Ohio has an early lead over two potential Democratic challengers in the latest poll of the Buckeye State's 2026 Senate race. \"I will work hard and win,\" he told Newsweek.However, a professor of political science at Bowling Green State University, which conducted the poll, said Democrats could yet retake the seat if the economy worsens, by regaining their standing as the party of the middle and working class.Newsweek also reached out to the Democratic Senatorial Campaign Committee (DSCC) for comment via email.Why It MattersDemocrats face a potentially challenging Senate map next year, as they will need to flip at least two states President Donald Trump won by double digits to secure a majority. This means Democrats will need to win states like Alaska, Florida, Iowa, Ohio or Texas, where they have not won major statewide races for years, if not decades.Ohio, which was a swing state for much of the 2000s, is viewed as perhaps Democrats' best chance beyond Maine and North Carolina, the two most competitive races. Husted, the former lieutenant governor, was appointed to the position by Governor Mike DeWine to replace Vice President JD Vance's term.Democrats are hoping a strong national environment will give them a chance at flipping the Senate seat, but Republicans are hoping its conservative lean will keep it off the board.What to KnowA new poll conducted by Bowling Green State University asked voters who they would vote for in hypothetical matchups between Husted and two prominent Democrats floated as potential candidates. The poll surveyed 978 registered voters from April 18 to April 24, 2025. It had a margin of error of plus or minus 4.08 percentage points.In a hypothetical race against former Senator Sherrod Brown, Husted held a slight lead of three points (49 percent to 46 percent), with 5 percent saying they would vote for someone else.He held a slightly larger lead against former Representative Tim Ryan, who lost to Vance in the 2022 Senate race, holding a 6-point lead (50 percent to 44 percent), while 6 percent said they preferred other candidates.The Ohio Senate race is an \"uphill battle\" for Democrats but could become competitive under the right conditions, Robert Alexander, Ph.D., professor of political science and founding director of the Democracy and Public Policy Network at Bowling Green State University, told Newsweek.\"Midterm races notoriously fare poorly for the president's party and Democrats had a historic wave during Trump's first midterm in 2018 capturing 40 seats. If voter perceive the economy is in worse shape in 2 years, Democrats would certainly have a chance to retake the seat,\" he said.Republicans have done well in the state by focusing on culture war issues and painting Democrats as out of touch, Alexander said. Democrats will need to \"turn that on their head\" to improve their standing in the state.Husted expressed confidence about his chances of victory in a statement to Newsweek.\"I have run statewide four times and have won by double digits in three of the four races. It doesn't matter if I am ahead or behind in the polls, I will work hard and win,\" he said.Alexander pointed to Trump's tariff policy as a potential sticking point for voters in Ohio, many of whom believe they will not benefit from the economic policy.\"If I were a Democrat in Ohio, I would beat that drum consistently—that our side is for the middle and working class and their side is for the wealthy and corporate class,\" he said.A February BGSU poll found Husted leading Brown by 6 points and Ryan by 7 points.Trump won Ohio by about 11 points in 2024, and 8 points in both 2016 and 2020. Brown lost last year's Senate race to Republican Bernie Moreno by about 3.6 percentage points. Vance defeated Ryan by about 6 points in 2022.What People Are SayingDavid Niven, professor at the University of Cincinnati's School of Public and International Affairs, told Newsweek: \"Democrats running statewide in Ohio are 1-27 since 2014. The outlook is never all that rosy for Democrats in Ohio these days.\"That one win was Sherrod Brown (in 2018). Brown lost his seat in 2024, in the most expensive senate race in U.S. history. There is certainly an expectation that if Brown runs again in 2026, he will be a potent candidate. If Brown runs for governor—or doesn't run at all—Democrats have no candidate of any profile to take on the senate race.\"Appointed senators have a rather shaky record in holding onto the seats they didn't win in the first place—so Republicans do have to deal with that liability as well as any Trump economic discontent that may take hold.\"Brown told CNN in November: \"I'm not dismissing anything at this point.\"What Happens NextNo prominent Democrats have jumped into the Senate race at this point, and Brown and Ryan haven't said what their plans are for 2026. Ohio voters will head to the polls next November to determine whether or not to reelect Husted.The Cook Political Report currently classifies the race as Likely Republican, meaning it is \"not considered competitive at this point\" but has \"the potential to become engaged.\"Democrats' top targets are Maine, which former Vice President Kamala Harris won by about 7 points, and North Carolina, which Trump won by about 3 points.","summary":"A new poll has shed light on the Senate race Democrats are hoping to contest in the 2026 midterms.","url":"https://www.newsweek.com/jon-husted-ohio-senate-race-poll-2066822","image":"https://d.newsweek.com/en/full/2637000/ohio-senator-jon-husted-polls.jpg","video":null,"publish_date":"2025-05-01 19:22:59","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.21},{"id":316881206,"title":"Demokratët amerikanë në “krizë”, një “yll” i ri po ngrihet në radhët e tyre","text":"Demokratët amerikanë, ende të tronditur nga suksesi i Donald Trump më 5 nëntor, po kërkojnë një identitet politik. Por jo vetëm kaq. Largimi i Joe Biden dhe humbja e dyshes Kamala Harris dhe Tim Walz, e ka lënë të majtën amerikane pa një udhëheqës. Megjithatë, në javët e fundit, kanë filluar të shfaqen disa figura që kërkojnë një vend në diell për zgjedhjet presidenciale të vitit 2028. Alexandria Ocasio-Cortez po bën një turne në Shtetet e Bashkuara me tetëdhjetëvjeçarin Bernie Sanders në turneun e tij “Lufta kundër Oligarkisë”, ndërsa Cory Booker, një senator luftarak nga New Jersey, po i drejtohet Kongresit me një fjalim rekord që zgjati mbi 25 orë. Megjithatë, në orët e fundit, ka hyrë edhe JB Pritzker, guvernatori i Illinois.\n\n“Ylli i ri”\n\nDuke mbushur 60 vjeç janarin e kaluar, Pritzker ka qeverisur tokën e Linkolnit që nga viti 2019 dhe u rizgjodh guvernator në vitin 2022 me një avantazh ndaj kundërshtarit të tij republikan prej më shumë se 12 pikësh. Më 28 prill, demokrati mbajti një fjalim para 800 aktivistëve në New Hampshire. Ndërhyrja shumë e ashpër u bë virale në mediat sociale dhe e katapultoi atë në krye të lajmeve kombëtare. Një moment i çmuar për këdo që synon të kandidojë në zgjedhjet paraprake presidenciale. “Asnjëherë më parë në jetën time nuk e kam gjetur veten duke bërë thirrje për protesta masive, duke bërë thirrje për mobilizim dhe trazira. Por e bëj tani.” Një fjalim i mbushur me një sulm frontal ndaj republikanëve: “Ata nuk mund të përjetojnë asnjë moment paqeje”, vazhdoi ai, “ata duhet ta kuptojnë se ne do ta luftojmë mizorinë e tyre me çdo megafon dhe mikrofon që kemi”. Në fjalimin e tij, ai kishte nga diçka për të gjithë.\n\nPasuria marramendëse\n\nPritzker është një demokrat atipik, por ka fizikun e një anti-Trump të përsosur. Sipas kalkulatorit të Forbes, ai ka një pasuri neto personale prej rreth 3.7 miliardë dollarësh (vetëm për t’ju dhënë një ide, pasuria e Trump vlerësohet në rreth 4.9 miliardë dollarë). Larg të qenit socialist, ai është pjesë e një familjeje shumë të pasur që zotëron rrjetin e hoteleve Hyatt. I diplomuar në Universitetin Duke dhe Universitetin Northwestern, Pritzker është në një pozicion të mirë për t’u folur një game të gjerë votuesish amerikanë. Bota e biznesit, por edhe populli demokratik, të tronditur nga 100 ditët e para të urdhrave ekzekutivë të Trump.\n\nSulmet ndaj Trump\n\nShfrytëzimi i guvernatorit është i rëndësishëm edhe për një arsye tjetër. Krahasuar me guvernatorët e tjerë që mund të jenë kandidatë për zgjedhjet paraprake të vitit 2028, si Gretchen Whitmer e Miçiganit, Josh Shapiro i Pensilvanisë dhe Gavin Newsom i Kalifornisë, ajo duket se nuk është e gatshme t’i japë administratës Trump një pushim. Menjëherë pasi manjati mori detyrën, e majta amerikane u nda në tre kampe. Ata që duan të bashkëpunojnë me Trumpin, ata që preferojnë të “presin e të shohin”, ata të opozitës me çdo kusht. Grupi i parë përfshin disa senatorë dhe përfaqësues, si dhe Newsom, ndërsa grupi i dytë përfshin shumë guvernatorë. Në segmentin e fundit është e majta më liberale e udhëhequr nga Ocasio-Cortez.\n\nPritzker tani i bashkohet këtij grupi, duke shkaktuar një debat të fortë të brendshëm. Në vitin 2024 ai mbështeti Kamala Harris dhe ishte ylli i konventës demokrate në Çikago që kurorëzoi kandidaten e saj, në veçanti duke ofruar JBeers në evente të ndryshme, birra të prodhuara nga fabrika të vogla birre të financuara nga vetë Pritzker. Dy ditë pas fitores së Trump, guvernatori ishte i pari që tha se ishte gati të rezistonte, duke u thënë gazetarëve se Illinois nuk ishte i papërgatitur për fitoren e Trump dhe se planifikimi për t’i bërë ballë kthimit të manjatit kishte filluar me furnizime shtesë të ilaçeve për abortin dhe ekipe avokatësh të gatshëm për të paditur qeverinë federale. Duke folur në një konferencë për shtyp, ai e kërcënoi drejtpërdrejt Trumpin: “Nëse sulmon popullin tim, do të duhet të merresh me mua.”","summary":"Demokratët amerikanë, ende të tronditur nga suksesi i Donald Trump më 5 nëntor, po kërkojnë një identitet politik. Por jo vetëm kaq. Largimi i Joe Biden dhe humbja e dyshes Kamala Harris dhe Tim Walz, e ka lënë të majtën amerikane pa një udhëheqës. Megjithatë, në javët e fundit, kanë filluar të shfaqen disa figura [&#8230;]\n\n\nThe post Demokratët amerikanë në “krizë”, një “yll” i ri po ngrihet në radhët e tyre appeared first on Konica.al.","url":"https://konica.al/2025/05/demokratet-amerikane-ne-krize-nje-yll-i-ri-po-ngrihet-ne-radhet-e-tyre/","image":"https://konica.al/wp-content/uploads/2025/05/Bota-Faqja-15-miliarderi-kunder-trump.jpg","video":null,"publish_date":"2025-05-01 19:00:40","author":"bionelda","authors":["bionelda"],"language":"en","source_country":"al","sentiment":-1},{"id":316901524,"title":"'Courage is contagious': Harris reemerges to slam Trump’s first 100 days","text":"Former Vice President Kamala Harris used a high-profile speech to sharply criticize President Donald Trump amid speculation about whether she will mount another presidential campaign or opt to run for California governor.\n\nIn her most extensive public remarks since leaving office in January following her defeat to Trump, Harris said Wednesday she’s inspired by Americans fighting Trump’s agenda despite threats to their freedom or livelihood.\n\n“Instead of an administration working to advance America’s highest ideals, we are witnessing the wholesale abandonment of those ideals,” Harris said a day after Trump reached 100 days in office.\n\nBefore Wednesday, Harris had barely mentioned Trump by name since she conceded defeat to him in November.\n\nIn a 15-minute speech, she spoke to the anxiety and confusion that have gripped many of her supporters since Trump took office but discouraged despair.\n\n“They are counting on the notion that if they can make some people afraid, it will have a chilling effect on others. But what they have overlooked is that fear is not the only thing that’s contagious,” Harris said. “Courage is contagious.”\n\nTrump went after Harris in a campaign-style rally Tuesday marking his 100th day in office. He sarcastically called her a “great border czar\" and a “great candidate,\" and repeated some of the applause lines he routinely delivered during the campaign.\n\nUntil Harris replaced Joe Biden atop the Democratic ticket last summer, Trump said, “I knew nothing about her.\"\n\nHarris cautioned Americans against viewing Trump’s administration as merely chaotic, casting it instead as a “high-velocity event,” the culmination of extensive work on the right to remake government.\n\n“A vessel is being used for the swift implementation of an agenda that has been decades in the making,\" Harris said. “An agenda to slash public education. An agenda to shrink government and then privatize its services. All while giving tax breaks to the wealthiest among us.”\n\nHarris chose a friendly audience for her return to the political arena, addressing the 20th anniversary gala for Emerge America, an organization that recruits and trains Democratic women to run for office. It grew in part from Harris’ run for San Francisco district attorney in the early 2000s.\n\nThe speech was delivered below luminous chandeliers in a gold-trimmed ballroom in the landmark Palace Hotel.\n\nHarris is ramping up her public presence as Democrats nationally search for a path forward after November's election, in which Republicans also won control of Congress. While a slate of high-profile Democrats — from governors to businessmen — seek leadership roles within the party, the former vice president retains unique influence and would reshape any future race she chooses to enter.\n\nShe praised Democrats who have been especially prolific in criticizing Trump, name-dropping lawmakers diverse in their ideology and style: Sens. Cory Booker, Chris Van Hollen, Chris Murphy and Bernie Sanders along with Reps. Jasmine Crockett, Maxwell Frost and Alexandria Ocasio-Cortez.\n\nBut she did not take a stand in one of her party's central divides, neither calling for mass mobilization like Illinois Gov. JB Pritzker or questioning Democratic positioning on key issues like California Gov. Gavin Newsom.\n\n“I’m not here tonight to offer all the answers,” Harris said. “But I am here to say this: You are not alone and we are all in this together.”\n\nBut she warned that things will probably get worse before they get better.\n\n“The one check, the one balance, the one power that must not fail is the voice of the people,” she said.\n\nHarris, a former state attorney general and U.S. senator from California, has not discouraged speculation that she might enter the race to replace the term-limited Newsom, himself a potential contender for president. And she has not ruled out another run for the White House.\n\nShe did not address her future Wednesday.\n\nShe continues to fundraise, using a joint committee that includes Harris for President, the Democratic National Committee and state Democratic parties. The committee, the Harris Victory Fund, reported having about $4.5 million on hand at the end of March, according to federal records.\n\nIn recent fundraising emails, Harris has been blunt about the need for Democrats to unify ahead of the 2026 midterm elections.\n\nDemocrats need to “organize and stop Trump’s agenda while electing Democrats everywhere,” she wrote in recent emails. “There has never been a more important time for a strong Democratic Party — one that is willing to stand up to Donald Trump, Elon Musk and what they are doing to this country.”\n\nThe event marks a homecoming of sorts. Harris lives in Los Angeles but she is from the San Francisco Bay Area, where her political career is rooted. For her first major speech since the election, she chose familiar terrain and a friendly, in some ways familial, crowd.\n\nLisa Gotbhi, a health care executive in San Francisco, said Harris' loss last year was a “shock,\" but “she’s a voice we need and a leader we need. Let’s get back in the fight.”","summary":"Former Vice President Kamala Harris used a high-profile speech to sharply criticize President Donald Trump amid speculation about whether she will mount another presidential campaign or opt to run for California governor.\n\n\n\nIn her most extensive public remarks since leaving office in January following her defeat to Trump, Harris said Wednesday she’s inspired by Americans fighting Trump’s agenda despite threats to their freedom or livelihood.\n\n\n\n“Instead of an administration working to advance America’s highest ideals, we are witnessing the wholesale abandonment of those ideals,” Harris said a day after Trump reached 100 days in office.\n\n\n\nBefore Wednesday, Harris had barely mentioned Trump by name since she conceded defeat to him in November.\n\n\n\nIn a 15-minute speech, she spoke to the anxiety and confusion that have gripped many of her supporters since Trump took office but discouraged despair.\n\n\n\n“They are counting on the notion that if they can make some people afraid, it will have a chilling effect on oth","url":"https://www.dailykos.com/story/2025/5/1/2319874/--Courage-is-contagious-Harris-reemerges-to-slam-Trump-s-first-100-days?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1428104/story_image/AP25121128251829.jpg?1746106190","video":null,"publish_date":"2025-05-01 18:30:06","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.244},{"id":316872500,"title":"Kamala Harris steps back on center stage","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\nIn The Spotlight\n\nKamala Harris steps back on center stage\n\nIn her first major speech since Donald Trump took office, the former presidential candidate took solid aim at this administration as speculation grows about her future\n\nNewsletter sign up\n\nThe former vice president offers political prognosticators a few tantalizing tea leaves about her plans\n\n(Image credit: Illustration by Stephen Kelly / Getty Images / AP)\n\nRafi Schwartz, The Week US \n\nThere's generally no right or wrong way to be a failed presidential nominee. While some past candidates have gone on to have a second act in public service, others have receded from the public eye. Former Vice President Kamala Harris spent the first few months of the Trump administration hewing to the latter — until this week. Delivering her first major speech since President Donald Trump assumed office on Wednesday, Harris reemerged into the political spotlight, raising speculation about her future.\n\nA 'calculated return'\nAlthough Harris has made several lower-profile appearances since losing the 2024 presidential election, this speech (delivered at a fundraiser for Emerge, an organization focused on Democrats recruiting and electing women) was her \"most pointed to date,\" said the Los Angeles Times. It also marked the \"first time since leaving office that she's publicly mentioned Trump by name.\"\nHarris used the address to encourage supporters to \"speak out and fight back\" against what she framed as the White House's \"efforts to roll back decades of progress,\" said The Washington Post. Her return to public life comes at a \"moment of deep anger and frustration\" within the party, with some Democrats \"ready to turn the page on the Biden era and a disappointing 2024 election.\" Harris conveyed a \"very negative, often angry-sounding message,\" said Fox News, accusing Trump of the \"wholesale abandonment\" of American ideals.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nThe remarks were part of a \"calculated return,\" said The New York Times, in which the former vice president \"acknowledged her monthslong departure from public life\" while \"not once\" mentioning her future plans. The speech retained the \"cautious approach\" that has long defined Harris' \"political brand.\"\n\n'Ramping up' her public presence\nHarris' speech and the interest it has generated come as she is \"set to possibly re-enter politics in the coming months,\" said ABC News. Her \"shadow\" has \"shaped the early months\" of the upcoming California gubernatorial race, into which she would \"probably vault to the top of the field\" should she decide to run, said the Post. It is \"no longer certain,\" however, that her candidacy would \"clear the field\" of high-profile Democrats vying to replace Gov. Gavin Newsom (D). Her speech was attended by \"several prominent Democrats already vying for governor in 2026\" who sat in the front row, Politico said. While she didn't raise any \"explicitly state-related issues or political fights\" in her remarks, she might be \"saving her powder until she's made a decision.\"\nBy \"ramping up her public presence\" while Democrats \"search for a path forward after November's election,\" Harris is leaning into the fact that she \"retains unique influence and would reshape any future race she chooses to enter,\" said The Associated Press. She has \"not discouraged speculation\" about joining future elections — including another potential run for the White House — and \"continues to fundraise, using a joint committee that includes Harris for President, the Democratic National Committee and state Democratic parties.\"\nEnding her speech on Wednesday, Harris struck a tone of cautious optimism, telling attendees that \"things are probably going to get worse before they get better.\" But, she said, \"we are ready for it.\"\n\nExplore More\n\nDonald Trump\n\n2024 presidential election\n\nKamala Harris\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nRafi Schwartz, The Week US\n\nSocial Links Navigation\n\nRafi Schwartz has worked as a politics writer at The Week since 2022, where he covers elections, Congress and the White House. He was previously a contributing writer with Mic focusing largely on politics, a senior writer with Splinter News, a staff writer for Fusion's news lab, and the managing editor of Heeb Magazine, a Jewish life and culture publication. Rafi's work has appeared in Rolling Stone, GOOD and The Forward, among others. \n\nSupreme Court may bless church-run charter schools\n\nThe case is 'one of the biggest on church and state in a generation'\n\n5 refreshing books to read this May to hop into spring\n\nThe Week Recommends\nA look at womanhood in the digital age, an ode to second chances and more\n\nUS, Ukraine sign joint minerals deal\n\nThe Trump administration signed a deal with Ukraine giving the US access to its mineral wealth\n\nYou might also like\n\nTrump blames Biden for tariffs-linked contraction\n\nThe US economy shrank 0.3% in the first three months of 2025, the Commerce Department reported\n\nTrump's crypto 'sea change' upends Washington's finances\n\nIn the Spotlight\nBy embracing digital currency, the White House is clearing a path for a new era in dubious self-enrichment\n\n'It is not enough to simply defend the status quo'\n\nInstant Opinion\nOpinion, comment and editorials of the day\n\nTrump says he could bring back Ábgego García but won't\n\nAt a rally to mark his 100th day in office, the president doubled down on his unpopular immigration and economic policies\n\nHow might Democratic fundraising survive Trump's ActBlue investigation?\n\nToday's Big Question\nCritics say the president is weaponizing the Justice Department\n\nA 'meltdown' at Hegseth's Pentagon\n\nThe Defense Secretary is fighting to keep his job amid leaked Signal chats and staff turmoil\n\nReining in Iran: Talks instead of bombs\n\nTrump edges closer to a nuclear deal with Iran—but is it too similar to former President Barack Obama's pact?\n\nTariffs: The quest to bring back 'manly' jobs\n\nTrump's tariffs promise to revive working-class jobs, but today's labor market has moved on\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"In her first major speech since Donald Trump took office, the former presidential candidate took solid aim at this administration as speculation grows about her future","url":"https://theweek.com/politics/kamala-harris-speech-trump-california-governor","image":"https://cdn.mos.cms.futurecdn.net/WD8xTjHM9Zrnv5gCLqXjJL.jpg","video":null,"publish_date":"2025-05-01 18:26:47","author":"Rafi Schwartz","authors":["Rafi Schwartz"],"language":"en","category":"politics","source_country":"us","sentiment":0.123},{"id":316871182,"title":"Trump announces Mike Waltz as UN ambassador pick","text":"President Donald Trump tapped former National Security Advisor Mike Waltz for his administration's ambassador to the United Nations after New York Rep. Elise Stefanik withdrew her nomination so she could hold onto her House seat amid concerns over the GOP's slim majority in the lower chamber. \"I am pleased to announce that I will be nominating Mike Waltz to be the next United States Ambassador to the United Nations,\" Trump posted to Truth Social Thursday. \"From his time in uniform on the battlefield, in Congress and, as my National Security Advisor, Mike Waltz has worked hard to put our Nation’s Interests first. I know he will do the same in his new role. In the interim, Secretary of State Marco Rubio will serve as National Security Advisor, while continuing his strong leadership at the State Department. Together, we will continue to fight tirelessly to Make America, and the World, SAFE AGAIN. Thank you for your attention to this matter!\" UN WATCHDOG PROJECT CALLS ON DOGE CAUCUS TO ‘AUDIT’ THE INTERNATIONAL ORG The announcement comes after news broke on Thursday morning that Waltz was no longer serving as the administration's national security advisor. A handful of names had been floated for the role after Stefanik withdrew her nomination in March, including former U.S. ambassador to Israel David Friedman, former deputy special envoy to monitor and combat anti-semitism at the State Department under the first Trump administration, Ellie Cohanim and special presidential envoy Richard Grenell. Grenell said he was a \"hard no\" on serving in the U.N. ambassador role ahead of Trump's announcement. Trump announced Stefanik as his original choice for the role back in November 2024, just days after his successful election against former Vice President Kamala Harris. The New York congresswoman, however, pulled her nomination last month as concerns mounted in Trump's orbit that the GOP's slim majority in the House would grow smaller in her absence. TRUMP URGED TO REVIEW UN IMMUNITY, LAX VISA RULES AMID NATIONAL SECURITY CONCERNS Concerns grew ahead of two special House elections in Florida on April 2, which ultimately saw both Republican victorious, but with significantly slimmer margins than their GOP predecessors in their previous elections. Stefank told Fox News' Sean Hannity in March that she bowed out of the confirmation process to serve as U.N. ambassador due to both the GOP's margin in the House, combined with the need for her to help combat Democratic \"corruption\" in her home state of New York. \"It was a combination of the New York corruption that we're seeing under Kathy Hochul, special elections and the House margin,\" Stefanik said on \"Hannity.\" \"I've been in the House. It's tough to count these votes every day. And we are going to continue to defy the political prognosticators and deliver, deliver victory on behalf of President Trump and, importantly, the voters across this country.\" \"The president knows that. He and I had multiple conversations today, and we are committed to delivering results on behalf of the American people. And as always, I'm committed to delivering results on behalf of my constituents,\" she added. Trump announced on Truth Social that Stefanik withdrew her nomination to \"remain in Congress to help me deliver Historic Tax Cuts, GREAT Jobs, Record Economic Growth, a Secure Border, Energy Dominance, Peace Through Strength.\" REPUBLICANS SEEK TO BLOCK THE REAPPOINTMENT OF UN OFFICIAL ACCUSED OF ANTISEMITISM \"With a very tight Majority, I don’t want to take a chance on anyone else running for Elise’s seat. The people love Elise and, with her, we have nothing to worry about come Election Day. There are others that can do a good job at the United Nations,\" he added. Under Trump's first administration, former South Carolina Gov. Nikki Haley and former diplomat Kelly Craft served as U.N. ambassadors. 'BLINDSIDED': HOW STEFANIK'S TRUMP NOMINATION AS UN AMBASSADOR IMPLODED Upon taking office, the 47th president made cuts to the U.S.' involvement with programs under U.N.'s umbrella, including ending the U.S.' engagement with the U.N. Human Rights Council and banning funding for the U.N. relief agency for Gaza. \"I've always felt that the U.N. has tremendous potential,\" Trump said in February while signing the executive order that made cuts to U.S. involvement with U.N. groups. \"It's not being well-run.\" CLICK HERE TO GET THE FOX NEWS APP \"A lot of these conflicts that we're working on should be settled, or at least we should have some help in settling them. But we never seem to get help. That should be the primary purpose of the U.N.,\" Trump continued. Fox News Digital's Julia Johnson and Elizabeth Elkind contributed to this report.","summary":"President Trump announced his choice to serve as ambassador to the U.N. after Rep. Elise Stefanik withdrew her nomination amid concern over the GOP&apos;s slim majority in the House.","url":"https://www.foxnews.com/politics/trump-announces-mike-waltz-un-ambassador-pick","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/donald-trump-oval-office-march-26-2025.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-01 18:23:33","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.012},{"id":316883686,"title":"Trump nominates Waltz for high-level post after ousting him as national security advisor","text":"President Donald Trump tapped former National Security Advisor Mike Waltz for his administration's ambassador to the United Nations after Waltz was ousted from the National Security Council office earlier Thursday. \"I am pleased to announce that I will be nominating Mike Waltz to be the next United States Ambassador to the United Nations,\" Trump posted to Truth Social Thursday. \"From his time in uniform on the battlefield, in Congress and, as my National Security Advisor, Mike Waltz has worked hard to put our Nation’s Interests first. I know he will do the same in his new role. In the interim, Secretary of State Marco Rubio will serve as National Security Advisor, while continuing his strong leadership at the State Department. Together, we will continue to fight tirelessly to Make America, and the World, SAFE AGAIN. Thank you for your attention to this matter!\" UN WATCHDOG PROJECT CALLS ON DOGE CAUCUS TO ‘AUDIT’ THE INTERNATIONAL ORG Waltz posted to X shortly after Trump's announcement that he was \"deeply honored to continue my service to President Trump and our great nation.\" Trump added in his post that Secretary of State Marco Rubio will simultaneously serve as his interim national security advisor after Waltz left the role on Thursday. In 1973, then-President Richard Nixon made a similar move when he named then-National Security Advisor Henry Kissinger to also serve as secretary of state, State Department records show. Waltz and other National Security Council staffers were ousted from their office Thursday, in the most high-profile executive office exits of the second Trump administration. Trump's announcement on naming Waltz as UN ambassador unfolded just hours after the news began circulating. The former national security advisor had been at the heart of the Signal chat leak debacle that unfolded in March, when the editor-in-chief of the Atlantic magazine was inadvertently added to a group chat with high-profile Trump officials such as Waltz, Secretary of Defense Pete Hegseth and CIA Director John Ratcliffe discussing military strikes on Houthi rebels in Yemen. Speculation had mounted for weeks that Waltz would be removed from his position amid the fallout of the chat leak, though the administration has maintained that no classified material was shared in the group chat and that the president had confidence in his National Security Council team. Ahead of Trump tapping Waltz for the new administration role, a handful of names had been floated for U.N. ambassador after Rep. Elise Stefanik withdrew her nomination in March, including former U.S. ambassador to Israel David Friedman, former deputy special envoy to monitor and combat antisemitism at the State Department under the first Trump administration Ellie Cohanim and special presidential envoy Richard Grenell. Grenell said he was a \"hard no\" on serving in the U.N. ambassador role ahead of Trump's announcement. Trump announced Stefanik as his original choice for the role back in November 2024, just days after his successful election against former Vice President Kamala Harris. The New York congresswoman, however, pulled her nomination last month as concerns mounted in Trump's orbit that the GOP's slim majority in the House would grow smaller in her absence. TRUMP URGED TO REVIEW UN IMMUNITY, LAX VISA RULES AMID NATIONAL SECURITY CONCERNS Concerns grew ahead of two special House elections in Florida April 2, which ultimately saw both Republican victorious, but with significantly slimmer margins than their GOP predecessors in their previous elections. Stefank told Fox News' Sean Hannity in March that she bowed out of the confirmation process to serve as U.N. ambassador due to both the GOP's margin in the House combined with the need for her to help combat Democratic \"corruption\" in her home state of New York. \"It was a combination of the New York corruption that we're seeing under Kathy Hochul, special elections and the House margin,\" Stefanik said on \"Hannity\" in March. \"I've been in the House. It's tough to count these votes every day. And we are going to continue to defy the political prognosticators and deliver, deliver victory on behalf of President Trump and, importantly, the voters across this country.\" \"The president knows that. He and I had multiple conversations today, and we are committed to delivering results on behalf of the American people. And as always, I'm committed to delivering results on behalf of my constituents,\" she added. Trump announced on Truth Social that Stefanik withdrew her nomination to \"remain in Congress to help me deliver Historic Tax Cuts, GREAT Jobs, Record Economic Growth, a Secure Border, Energy Dominance, Peace Through Strength.\" REPUBLICANS SEEK TO BLOCK THE REAPPOINTMENT OF UN OFFICIAL ACCUSED OF ANTISEMITISM \"With a very tight Majority, I don’t want to take a chance on anyone else running for Elise’s seat. The people love Elise and, with her, we have nothing to worry about come Election Day. There are others that can do a good job at the United Nations,\" he added. Under Trump's first administration, former South Carolina Gov. Nikki Haley and former diplomat Kelly Craft served as U.N. ambassadors. 'BLINDSIDED': HOW STEFANIK'S TRUMP NOMINATION AS UN AMBASSADOR IMPLODED Upon taking office, the 47th president made cuts to the U.S.' involvement with programs under U.N.'s umbrella, including ending the U.S.' engagement with the U.N. Human Rights Council and banning funding for the U.N. relief agency for Gaza. \"I've always felt that the U.N. has tremendous potential,\" Trump said in February while signing the executive order that made cuts to U.S. involvement with U.N. groups. \"It's not being well-run.\" CLICK HERE TO GET THE FOX NEWS APP \"A lot of these conflicts that we're working on should be settled, or at least we should have some help in settling them. But we never seem to get help. That should be the primary purpose of the U.N.,\" Trump continued. Fox News Digital's Julia Johnson and Elizabeth Elkind contributed to this report.","summary":"President Donald Trump announced his choice to serve as ambassador to the U.N. after Rep. Elise Stefanik withdrew her nomination amid concern over the GOP&apos;s slim majority in the House.","url":"https://www.foxnews.com/politics/trump-nominates-waltz-high-level-post-after-ousting-him-national-security-advisor","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/waltztrmp.png?ve=1&tl=1","video":null,"publish_date":"2025-05-01 18:23:33","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":0.04},{"id":316883528,"title":"LIVE | US State Department Briefing","text":"LIVE | US State Department Briefing\n\nET Online | 01 May 2025, 11:48 PM IST\n\nUS State Department Spokeswoman Tammy Bruce holds a regular briefing.\n\nPost a Comment\n\nRead more on\n\nTammy Bruce\n\nMarco Rubio\n\nDonald Trump\n\nUS State Department\n\nRelated Videos\n\nTrump LIVE | US President makes stunning announcement on Mike Waltz, China & Ukraine minerals deal\n\nMike Waltz, Trump's National Security Advisor and his deputy, to quit’ amid 'Signal Gate': Reports\n\n'Ukraine behind Trump assassination plot…': Tucker Carlson drops bombshell, 'exposes' shocking link\n\n‘Thank God Trump is in office’: White House brushes off Kamala Harris comeback speech\n\nLIVE | US President Donald Trump participates in National Day of Prayer\n\n‘Need an answer’: Maryland judge pushes back against Trump admin over Kilmar Abrego Garcia deportation\n\nIsrael continues to battle 'largest' wildfires near Jerusalem; major road closed, people evacuated\n\nStephen Miller schools reporters on MS-13 gang 'member' Garcia: 'Trump shamed you into reporting…'\n\nJapan: Man arrested for deliberately driving car into group of primary school kids\n\nLIVE | Putin ‘admits’ Ukrainian troops still ‘holed up’ in Kursk hours after ‘full recapture’ boast\n\nRussia attacks Ukraine's Odesa via drones, two dead and 15 injured\n\nLIVE | US Defence officials testify on drone program | TAL hearing | Small UAS and counter-small UAS\n\nLIVE | Trump 100 Days: White House Press Secretary Karoline Leavitt, Stephen Miller brief the Media\n\n'Russia is much stronger…': Trump reveals what he told Zelenskyy at viral Vatican meet\n\n'Islam has no place in Texas…': MAGA's Valentina Gomez interrupts muslim rally with anti-Islam rant\n\nLIVE | ICJ grills Israel on final day of hearing over Gaza aid blockade\n\nTesla board hunts Musk’s replacement as CEO? DOGE head fumes over shocking report: ‘Ethics breach’\n\nRubio slams Biden admin for secretly tracking Americans' posts as 'disinformation vectors’\n\n'This country is ours, it doesn't belong to...': Kamala Harris lambasts Trump in first speech since election loss\n\nConservative Kemi Badenoch rattles PM Keir Starmer after UK SC ruling said Equality Act defines gender as biological sex\n\nSenate deadlocks on ending Trump’s tariffs as economy shrinks, Vance blocks future re-vote\n\nUS-Ukraine strike game-changing minerals deal, Trump pact paves for $175 bn aid to Kyiv\n\nKaroline Leavitt calls out Jean-Pierre for engaging in 'cover-up' of Joe Biden\n\nLeavitt dubs Biden ‘mentally incompetent’, says Trump ‘cleaning up’ former president's ‘messes’\n\nLIVE | Kamala Harris at Emerge Gala in San Francisco, criticises Trump’s policies\n\nTrump's mega new tax cut plans to incentivise industries: 'We cut your taxes from almost 40% down to 15% ....'\n\n'Going to build NVIDIA's next gen technology here in US': CEO Jenseng Huang\n\n'Because of Secy Kennedy afraid of eating anything': Trump cabinet laughs as Marco Rubio speaks\n\nTrump pulls Hegseth’s leg in cabinet meet: ‘Least controversial person’\n\nLIVE | White House Press Secretary Karoline Leavitt briefs members of New Media\n\nTrump stands tough in face of judges blocking deportations, poor GDP numbers\n\nTrump stands tough in face of judges blocking deportations, poor GDP numbers\n\nLIVE | Democrats speak on first 100 days of Trump administration on Senate Steps\n\nPalestinian Columbia University student released after visa interview arrest\n\nLIVE | Democrat Schiff, Gun Safety Groups announce Introduction of Assault Weapons Ban\n\nTimes Square shooting: Food cart vendor shot after dispute with a group; NYPD arrests 3\n\nPakistan Markets Bleed as India Tensions Flare Up\n\nUS economy shrinks 0.3% in Q1 as tariffs kick in; Trump pins blame on Biden\n\nLIVE| Trump holds cabinet meeting to mark 100 days | US economy\n\nLIVE | Brooke Rollins, Noem & Bondi hold press briefing as charges dropped against Maude family","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/live-us-state-department-briefing/videoshow/120801626.cms","image":"https://img.etimg.com/thumb/msid-120801626,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-120801626,imgsize-106712.cms","publish_date":"2025-05-01 18:18:49","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":0.161},{"id":316887042,"title":"President Trump promised no taxes on tips, but workers are still waiting","text":"It was a hot June day during the 2024 campaign when then-former President Donald Trump held a rally at Sunset Park in Las Vegas and made what would be one of his most famous campaign promises.“So this is the first time I’ve said this, and for those hotel workers and people that get tips, you’re going to be very happy,” Trump said. “Because when I get to office, we are going to not charge taxes on tips, people making tips.”Trump was right: Tip earners in Las Vegas and elsewhere immediately embraced the idea, if not the president himself. Budget hawks are more wary; the Tax Foundation estimates not taxing tips as income could cost the treasury $118 billion over the next decade, and even more if the exemption were applied to payroll taxes.The idea was so popular, Democrats immediately jumped on it. Then-Vice President Kamala Harris echoed the promise. Nevada Democrats signed on, too.RELATED STORY | May Day protests against the Trump admin expected today nationwideAfter Trump was elected, he doubled down, coming to Las Vegas for a January rally to repeat his pledge. He said the popularity of the idea was the reason he won Nevada in November. (Trump lost the state in the 2016 and 2020 elections.) Democrats haven’t forgotten, either: Congressman Steven Horsford, D-Nevada, has a bill that would lift taxes on tips, albeit with some safeguards. Horsford’s measure would install an income cap, impose rules so that high-wage earners couldn’t dodge taxes by claiming their wages as tips, and abolish the sub-minimum wage that allows some businesses to pay workers as little as $2.13 per hour.That wage, which does not exist in Nevada, is premised on the theory that tips will make up the difference between the sub-minimum wage and the current federal minimum wage of $7.25 per hour.But despite the bipartisan support, neither Horsford’s bill nor a Republican plan that would simply end taxes on tips has advanced in Congress.“The longer we wait, the more it seems like it’s not going to happen,” said Heather Lind, a busser at the Aria. “Right now, it seems like it’s not going to happen, but, I mean, it would change people’s lives if it did.”Abel Garcia spoke to tipped workers in Las Vegas to learn what no taxes on tips would mean for them.Lind knows what she’s talking about. Before moving to Las Vegas, she worked in Texas and made just $2.13 an hour before tips. She said workers have to have multiple jobs, are always stressed and can’t even consider buying a home.RELATED STORY | Polls show President Trump losing support on immigration policies“It’s frustrating. It’s demoralizing,” she said. “That’s all you’re worth is $2 an hour? And it’s literally you’re living off your tips. So if a table doesn’t tip, you don’t get paid for your work.”That’s precisely why Horsford and other Democrats are trying to attach a sub-minimum wage repeal to any legislation that ends taxes on tips. And it’s why the Culinary Union Local 226 is backing Horsford’s plan, but also looking to hold Trump to his promise.“We’re waiting to see whether Trump’s going to keep his word on this. He needs to,” says Ted Pappageorge, the union’s secretary-treasurer. “But that’s only part of the equation. There’s not going to be anything moving forward just on taxes, on tips, and we were clear about that.”WATCH: Here's what President Trump said about his \"No Tax on Tips\" promise on Inauguration DayPappageorge, who earned tips when he worked as a busser, a barback and a bartender early in his career, says any legislation on tip taxes has to address the sub-minimum wage, which he calls “just criminal.”“So when it comes to working-class issues, we think that that’s what needs to be tackled at the federal level also, and we are going to fight tooth and nail to make sure that Democrats and Republicans tackle working-class, kitchen-table issues, and especially the cost of living,” Pappageorge says.But Republican activist Chuck Muth, who earned just more than $2 per hour in his days working at a restaurant, says insisting on a repeal of the sub-minimum wage might be the thing that kills no taxes on tips in general.“The restaurant owners, you’re paying $2, paying $5 an hour, let’s say they really increased it,” Muth said. “But the minimum wage here is somewhere around $15, $12 [per hour]. That comes directly out of the restaurant owner’s pocket. Now, if you’re a big, huge chain, it doesn’t affect you so much. If you’re a small mom and pop, going from $5 an hour plus tips to $15 an hour plus tips is a whole different story. It could put businesses out of business because of that.”Muth attributes the delay to negotiations over a budget deal that includes extending President Trump’s first-term tax cuts, a deal that is still in the works. But he predicts it will happen, and likely before summer.Why? He says Democrats can’t be seen as opposing no taxes on tips, even without the sub-minimum wage provisions, because they don’t want the issue used against them on the 2026 campaign trail.“If the Republicans dig their feet and say no, here’s what we’re going to do, I think you’re going to find more than enough Democrats who cannot politically take the chance of voting against the bill,” Muth says. “There will be more than enough Democrats to pass in both the Senate and the House.”Pappageorge says eliminating taxes on tips in general would be a gain for workers, although he suggests that Democratic votes for the idea could be assured by including the sub-minimum wage repeal provision in any bill.Meanwhile, workers like Lind wait and watch, seeing President Trump crack down on immigration, impose tariffs and work to eliminate diversity programs in the public and private sectors, fulfilling other promises on Trump’s campaign agenda.“Yeah, because it seems like the bad things, we’re going to get them done, but then our promises like no tax on tips, we’re just going to take our time and work on it,” Lind said. “So it’s frustrating.This article was written by Steve Sebelius for the Scripps News Group in Las Vegas.","summary":"After President Donald Trump was elected, he doubled down on his pledge to end taxation on tips. He said the popularity of the idea was the reason he won Nevada in November.","url":"https://www.scrippsnews.com/politics/economy/president-trump-promised-no-taxes-on-tips-but-workers-are-still-waiting","image":"https://ewscripps.brightspotcdn.com/dims4/default/ef05139/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5b%2Fe5%2Fc900e66f42e89fcc9f92ee47b30a%2Fthumbnails-10.png","video":null,"publish_date":"2025-05-01 18:12:10","author":"Scripps News Group","authors":["Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.523},{"id":316866406,"title":"CNN data guru reveals Trump can still trounce Democrats despite polls calling president ‘unpopular’: ‘Major wake-up moment’","text":"CNN chief data analyst Harry Enten on Thursday revealed stunning polls that showed even an “unpopular” Donald Trump could squash Democrats at the voting booth – calling it a “major wake-up moment” for the president’s rival party.\n\n“If Democrats think that at this particular point, just because Donald Trump is unpopular, that they’re going to run away with it like a Heisman Trophy winner – that is not necessarily the case. These numbers should be a major wake-up moment for Democrats,” Enten said. \n\n“When you match Donald Trump against his actual competition, Donald Trump comes out ahead…and that is why Democrats, in fact, cannot count their chickens just yet, because those eggs have not cracked at this particular moment,” he continued.\n\nAccording to CNN polling, 45% of registered voters believe Trump is doing a better job in the White House than former vice president Kamala Harris would have, compared to just 43% who believe the same of Harris. Trump’s lead falls within the survey’s margin of error.\n\n“This looks a heck of a lot like the election result, despite the fact that Trump’s favorable ratings aren’t too hot to trot,” Enten said. \n\nSurveys released over the weekend from CBS, ABC and The Washington Post, NBC, CNN and The New York Times showed Trump’s favorability plummet – with one claiming he has the lowest ratings at the start of a presidential term since World War II.\n\nHis sweeping tariffs, which economists have warned could reheat inflation and even trigger a recession, have been a particular sore spot. Nearly 90% of US adults said they believe the taxes will increase prices for American consumers, according to a new Gallup poll. \n\nBut Enten argued that Trump’s unfavorable ratings don’t look nearly as drastic when viewed side-by-side with Democrats in office.\n\n“The bottom line is when you look at Donald Trump in a vacuum, it’s one thing, but when you actually match him up against folks in the real world, all of a sudden his numbers look considerably better,” Enten said.\n\nWhen matched against Democrats in Congress, what Enten called Trump’s “main competition at this point,” the president still comes out on top.\n\nWhile 40% of registered voters say they trust Trump to better tackle the nation’s main issues, only 32% say the same of congressional Democrats, according to CNN polling.\n\n“I’s not even close. It’s an eight point advantage, which in this politics, well, that’s a wide ocean,” Enten added.\n\nThe Republican party as a whole also polls well above Democrats on key issues, like immigration and the economy, which the GOP leads by 19 and nine points, respectively, according to a CNN poll.","summary":"Harry Enten argued that the president’s unfavorable ratings don’t look nearly as drastic when viewed side-by-side with Democrats in office.","url":"https://nypost.com/2025/05/01/media/cnns-harry-enten-says-trump-can-still-beat-democrats-despite-polls-calling-president-unpopular/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/103647361.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-01 18:07:26","author":"Taylor Herzlich","authors":["Taylor Herzlich"],"language":"en","category":"politics","source_country":"us","sentiment":-0.36},{"id":316865614,"title":"Harris Condemns Trump Govt In First Major Post-Election Speech","text":"Former United States Vice President Kamala Harris delivered a forceful rebuke of President Donald Trump and his allies on Thursday, marking her first major public address since losing the November election.\n\nSpeaking at an event hosted by Emerge, a political organization focused on training Democratic women to run for office, Harris warned of a systematic and long-standing conservative agenda now accelerating under Trump’s leadership.\n\n“What we are, in fact, witnessing is a high-velocity event,” Harris told the crowd, “where a vessel is being used for the swift implementation of an agenda that has been decades in the making.”\n\n100 Days: Trump’s Approval Rating Plummets To New Low\nTrump’s 100 Days In Office Akin To 100 Years – OPS\nTrump Admin Fulfills Border Security Promise, Says Deputy Communication Director\n\nHarris accused conservatives of using Trump to reshape the nation to their benefit, citing efforts to defund public education, shrink and privatize government services, and deliver tax cuts to the wealthiest Americans.\n\n“This is a narrow, self-serving vision of America,” she said. “One where they punish truth-tellers, favor loyalists, cash in on their power, and leave everyone to fend for themselves.”\n\nTrump’s administration has taken rapid action in its first 100 days, issuing a flurry of executive orders on topics ranging from immigration and foreign aid to household appliance regulations. While supporters have applauded the swift changes, critics argue the administration is aggressively undermining democratic norms and clashing with judicial authority.\n\nRecent polls suggest a growing public unease with the administration’s volatile economic and political direction, particularly in response to shifting tariff policies.\n\nSince leaving office in January, Harris has largely remained out of the public spotlight. Her appearance at Wednesday’s event, however, signaled a potential return to the political arena. Speculation continues about her future ambitions, with observers noting possible bids for California’s governorship in 2026 or a presidential run in 2028.\n\nHarris ended her remarks with a stark warning: “They’re going after the universities. They’re going after the courts. Not because they fear dissent—but because they intend to silence it.”","summary":"ShareFormer United States Vice President Kamala Harris delivered a forceful rebuke of President Donald Trump and his allies on Thursday, marking her first major public address since losing the November election. Speaking at an event hosted by Emerge, a political organization focused on training Democratic women to run for office, Harris warned of a systematic...\n\n\nThe post Harris Condemns Trump Govt In First Major Post-Election Speech appeared first on New Telegraph.","url":"https://newtelegraphng.com/harris-condemns-trump-govt-in-first-major-post-election-speech/","image":"https://newtelegraphng.com/wp-content/uploads/2024/11/241017-donald-trump-kamala-harris-split-vl-1208p-43de60.jpg","video":null,"publish_date":"2025-05-01 18:05:47","author":"Boma Achenimie","authors":["Boma Achenimie"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.089},{"id":316873310,"title":"CBS Owner Asked ‘60 Minutes’ to Hold Back Mean Trump Stories","text":"CBS boss Shari Redstone secretly told 60 Minutes producers to hold stories critical of Donald Trump until federal authorities approved a crucial merger, it was reported Thursday.\n\nRedstone is trying to exit the media business by merging Paramount, CBS’ parent company, of which she is the controlling shareholder through the National Amusements company, with Skydance, which is owned by David Ellison, son of Oracle billionaire Larry Ellison.\n\nLongtime 60 Minutes producer Bill Owens announced his departure from CBS last week, claiming behind-the-scenes moves by network heads had left him without the editorial freedom to pursue the program’s storied hard-hitting journalism.\n\nBut a fresh investigation into the drama by Puck revealed cracks in the relationship first started to show in October, when Redstone apparently initially took offense over the program’s coverage of the one-year anniversary of the Israel-Gaza conflict, claiming the broadcast was imbalanced against Israel.\n\n“Being p---ed off about the Gaza stuff gives her moral permission to get involved,” an inside source told the outlet, and confirmed her anger over the story, combined with the upcoming merger, emboldened Redstone to exert more executive influence over 60 Minutes.\n\nFollowing the incident, Redstone appointed former CBS News president Susan Zirinsky to a new role overseeing editorial standards and reportedly gave her an express mandate to dive into coverage of the Middle East, with network insiders privately suspecting she served as a proxy for Redstone to indirectly exert more pressure on the show.\n\nAround the same time, sources claimed that Redstone also asked CBS CEO George Cheeks if it was possible to delay critical stories about Trump or his administration until after the Skydance merger had been approved.\n\nTrump has made 60 Minutes a focus of his ire after a long bad-tempered relationship with the primetime show. He refused to sit down for an interview last October then raged at their Kamala Harris interview. When the network showed an extract from Harris answering a question on Face the Nation then a different part of the same answer on 60 Minutes, he claimed it was an attempt to manipulate the election, then sued CBS for “$20 billion.” \n\nIn office, he has continued to rage at 60 Minutes for what he claims is unfair and biased coverage of his presidency. On April 15, he urged the Federal Communications Commission chair Brendan Carr to “impose the maximum fines and punishment,” on the network. The FCC has power to approve the Skydance-Paramount merger, giving Carr huge leverage over Redstone.\n\nSeparately, Trump is now in arbitration with Paramount over his lawsuit. It reportedly is offering $20 million—still a vast amount of money for a case which legal experts said was laughable—while Trump wants a much larger sum. He secured $15 million from ABC News for George Stephanopoulos mischaracterizing the E. Jean Carroll case, saying of Trump, “judges and two separate juries have found him liable for rape” when he was found liable for sexual assault\n\nPuck reported that after the April outburst, Redstone called Cheeks and told him to let her know what else she could expect from 60 Minutes while trying to end the lawsuit and complete the merger, a source told the outlet. While Paramount’s lawyers have claimed the president’s lawsuit has no chance of victory, Puck reported that Redstone is keen to settle the suit because Brendan Carr has said it will factor into his decision to approve the multi-billion dollar merger between Paramount and Skydance Media.\n\nIn a memo to staff announcing his resignation, Owens said that “over the past months, it has also become clear that I would not be allowed to run the show as I have always run it,” citing the Trump suit.\n\nOn Sunday, 60 Minutes host Scott Pelley called out his corporate bosses in a shocking on-air admission which alluded to the behind-the-scenes meddling which had led to Owens’ departure. “Stories we pursued for 57 years are often controversial,” Pelley said in a carefully-worded statement. “Lately, the Israel-Gaza war and the Trump administration. Bill made sure they were accurate and fair. He was tough that way. But our parent company, Paramount, is trying to complete a merger.”\n\nNoting that the “Trump administration must approve” the deal, Pelley then added: “Paramount began to supervise our content in new ways. None of our stories has been blocked, but Bill felt he lost the independence that honest journalism requires,” before concluding that “No one here is happy about it, but in resigning, Bill proved one thing. He was the right person to lead 60 Minutes all along.”","summary":"Dimitrios Kambouris / Getty ImagesCBS boss Shari Redstone secretly told 60 Minutes producers to hold stories critical of Donald Trump until federal authorities approved a crucial merger, it was reported Thursday.\n\nRedstone is trying to exit the media business by merging Paramount, CBS’ parent company, of which she is the controlling shareholder through the National Amusements company, with Skydance, which is owned by David Ellison, son of Oracle billionaire Larry Ellison.\n\nLongtime 60 Minutes producer Bill Owens announced his departure from CBS last week, claiming behind-the-scenes moves by network heads had left him without the editorial freedom to pursue the program’s storied hard-hitting journalism.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/cbs-owner-shari-redstone-asked-60-minutes-to-hold-back-mean-trump-stories/","image":"https://www.thedailybeast.com/resizer/v2/GUPCE2R2Q5EVFBSBTYWBIVWBCE.jpg?smart=true&auth=5bd5d15eb734786345eb06fc3654f720d5e972eaf853ffbf063e931a2c988a38&width=1440&height=1080","video":null,"publish_date":"2025-05-01 17:56:54","author":"Tom Sanders","authors":["Tom Sanders"],"language":"en","source_country":"us","sentiment":-0.087},{"id":316872412,"title":"'Delusional': Tim Walz Brutally Trolled For Claiming Kamala Harris Picked Him As The Democratic Vice Presidential Nominee Because He Could 'Code Talk To White Guys'","text":"Tim Walz thinks Kamala Harris selected him as his running mate because he was a pro at being able to \"code talk to white guys\" – and of course he's being brutally roasted.\n\nEarlier this week, the 61-year-old visited Harvard’s Kennedy School to touch on the future of the Democratic Party, but he discussed just why Harris chose him as her Vice Presidential nominee, RadarOnline.com can reveal.“I could code talk to white guys – watching football, fixing their truck, doing that, that I could put them at ease,” Walz told students during his speech.\n\nHe added: “I was the permission structure to say ‘look you can do this and vote for this.'”\n\nSome weren't on board, however, with Walz's comments as one person said: \"This is absurd. Democrats are so out of touch yet they will be back in charge in 2029.\"\n\nAnother blasted: \"Imagine thinking that your value is code talking to a certain element of people. Not you political instincts, smarts, experience or ideas, instead that you’re white and can speak to other white folk.\"\n\n\"Let's agree that it was a failed strategy,\" a person simply reacted.Despite Walz's apparent ability to talk to \"white guys,\" he and Harris “didn’t get enough of those votes” in swing states to take down Donald Trump who won his second term in the White House.\n\nWhile Walz seemingly struggled to reel in the male vote – even though he tried and failed to reload a shotgun during his hunting trip – Trump did not as he sat down with popular podcast host Joe Rogan, teamed up with Elon Musk, and at one point even entered the Milwaukee convention to the James Brown's It's a Man’s, Man’s, Man’s World. \n\nFollowing their defeat, Democrats will have to ponder over why the party lost its “self identity,” according to the Governor of Minnesota.Meanwhile, Harris made her first speech on Wednesday, April 30, since her brutal loss against Trump – and to no one's surprise, she went hard after the president, ripping him for numerous decisions including his tariffs plan and his immigration policy.\n\n“Let us not be duped into thinking everything is chaos. I know it may feel that way, but understand what we are, in fact, witnessing is a high velocity event where a vessel is being used for the swift implementation of an agenda that has been decades in the making,” she said during the speech in San Francisco, California.\n\nHarris then attempted to offer up some hope for those feeling down and out amid the rough climate.She said: “I am not here tonight to offer all the answers, but I am here to say this: You are not alone, and we are all in this together. And, straight talk, things are probably going to get worse before they get better, but we are ready for it.”\n\nThe Democratic party is currently up in the air at the moment, with no true leader; however, some seem to think Rep. Alexandria Ocasio-Cortez could take charge.\n\nThe 35-year-old – known as AOC – drew big crowds during her \"Fighting Oligarchy Tour\" alongside Sen. Bernie Sanders, and it got pundits thinking about her future.\"I think there’s a lot of points in her favor at this very moment. Alexandria Ocasio-Cortez has broad appeal across the Democratic Party,\" GD Politics podcast host Galen Druke said.\n\nHe added: \"I think equally important is the fact that she has very fervent support. I think a lot of people are gonna run in 2028 and it’s going to be a contest for attention and getting those sort of people who might be in your boat to turn out and stay with you through thick and thin.\"","summary":"Tim Walz made it clear that he was selected as Kamala Harris' running mate due to his ability to 'code talk to white guys.'","url":"https://radaronline.com/p/tim-walz-kamala-harris-democratic-vice-presidential-white-guys/","image":"https://media.radaronline.com/brand-img/rNHrGRc2Q/0x0/walz-white-1746118086797.jpg","video":null,"publish_date":"2025-05-01 17:45:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","category":"politics","source_country":"us","sentiment":-0.342},{"id":316908094,"title":"The First 100 Days for the Trump-Hating Left","text":"President Donald Trump’s approval declined after he announced broad tariffs not just on China but on trading partners who, in his opinion, take advantage of America with their tariffs on American goods. But how quickly those rooting for Trump’s failure forget the mood of the country during the Biden administration.\n\nIn September 2024, NBC News wrote: “Two in 3 voters say the country is on the ‘wrong track’ as voters weigh whether Vice President Kamala Harris or former President Donald Trump would be better able to change that less than two months from Election Day.” Not exactly a tough act to follow.\n\nCritics call Trump 2.0 an “imperial” presidency careening toward a “constitutional crisis,” meaning Trump intends to ignore lower court rulings that thwart his agenda. Yet most sat silently when one of the Democrat stars, Rep. Alexandria Ocasio Cortez (D-N.Y.,) demanded that President Joe Biden ignore a 2023 lower court ruling to ban the so-called abortion pill. AOC called the ruling a “mockery of our democracy and a mockery of our law.”\n\nWhen the Supreme Court ruled the Biden student debt forgiveness program unconstitutional, Biden insisted the ruling left him undeterred. He said, “The Supreme Court tried to block me from relieving student debt. But they didn’t stop me.”\n\nTrump has secured the southern border and is fulfilling his promise to deport the estimated 15 million illegal aliens -- prioritizing violent criminals -- intentionally admitted into the country by Biden. Former First Lady Michelle Obama recently fretted: “I worry for people of color all over this country. ... And that makes me -- that frightens me. It keeps me up at night.”\n\nMichelle Obama must not have gotten much sleep during her husband’s administration, when even Democrats derisively referred to President Barack Obama as “deporter-in-chief.” In January 2024, PolitiFact wrote: “Under Trump, from fiscal year 2017 to fiscal year 2020, the Department of Homeland Security recorded 2 million deportations ... During Obama’s first term, fiscal year 2009 to fiscal year 2012, there were 3.2 million deportations (removals and returns).”\n\nSuddenly, Democrats are pro-“insurrection.” Democrat Illinois Gov. JB Pritzker recently called for “mass protests” against Trump: “It’s time to fight everywhere and all at once. Never before in my life have I called for mass protests, for mobilization, for disruption. But I am now.”\n\n“Fight everywhere and all at once”? The governor will no doubt claim he means “fight” peacefully. But when Trump, on Jan. 6, 2021, urged his supporters to “fight like hell,” his critics described this as the equivalent of ordering his supporters to set the country on fire. Never mind Trump also said, “I know that everyone here will soon be marching over to the Capitol building to peacefully and patriotically make your voices heard.”\n\nSuddenly, “mocking” one’s disability isn’t such a bad thing after all. An August 2016 Bloomberg poll of likely voters found what most bothered them about then-candidate Trump was that he supposedly “mocked” a disabled reporter, something Trump has denied doing. Texas Gov. Greg Abbott, a Trump supporter, has since 1984 been paralyzed from the waist down. Rep. Jasmine Crockett (D-Texas) in March, at a California Human Rights campaign event, elicited laughter when she said: “Y’all know we got Governor Hot Wheels down there. Come on now. And the only thing hot about him is that he is a hot a-- mess.” Crickets from most Democrats.\n\nPolls show a majority of Americans support Trump’s border wall and a plurality support his goal of mass deportation. Democrats therefore find themselves thrashing about to decide on an effective anti-Trump attack strategy. What’s their message? Waste, fraud and abuse are to be protected? Illegal alien MS-13 gang member Kilmar Abrego Garcia is the equivalent of a political prisoner? Teslas are bad -- so much for climate change?\n\nDemocrats continue to claim that only the very rich stand to benefit from extending the Trump tax cuts. Biden in his first major speech since leaving office repeated the nonsense that Trump wants to “cut and gut” social security. So, there’s that.\n\nIf Trump is proven right on his tariff strategy and our trading partners cut deals that eventually turbocharge the economy, what’s left for the Democrats? Apart from mass suicide, there’s always the Trump’s a “racist/fascist/Nazi” card. It’s better than nothing.","summary":"President Donald Trump’s approval declined after he announced broad tariffs not just on China but on trading partners who, in his opinion, take advantage of America with their tariffs on American goods. But how quickly those rooting for Trump’s failure forget the mood of the country during the Biden administration.\n\nIn September 2024, NBC News wrote: “Two in 3 voters say the country is on the ‘wrong track’ as voters weigh whether Vice President Kamala Harris or former President Donald Trump would be better able to change that less than two months from Election Day.” Not exactly a tough act to follow.\n\nCritics call Trump 2.0 an “imperial” presidency careening toward a “constitutional crisis,” meaning Trump intends to ignore lower court rulings that thwart his agenda. Yet most sat silently when one of the Democrat stars, Rep. Alexandria Ocasio Cortez (D-N.Y.,) demanded that President Joe Biden ignore a 2023 lower court ruling to ban the so-called abortion pill. AOC called the ruling a “mockery of our democracy ","url":"https://www.newsbusters.org/blogs/nb/larry-elder/2025/05/01/first-100-days-trump-hating-left","image":"https://www.newsbusters.org/s3/files/styles/mobile_thumb_700x400_/s3/2025-05/Special%20Report%20With%20Bret%20Baier-6_29_10%20pm-2025-04-29-0.jpg?itok=a5gRZT9i","video":null,"publish_date":"2025-05-01 17:30:00","author":"Larry Elder","authors":["Larry Elder"],"language":"en","source_country":"US","sentiment":-0.254},{"id":316876146,"title":"Kamala Harris: Trump’s America is ‘Self-Serving’","text":"Former US Vice President Kamala Harris has conveyed her criticisms of President Donald Trump and his supporters during her first significant address since the November election loss.\nThe defeated Democrat informed her supporters last night that the seeming \"chaos\" of the last three months is, in fact, the outcome of a long-held strategy by conservatives using Mr. Trump to manipulate the US for their benefit.\n\"What we are witnessing is, indeed, a high-velocity event, where a vehicle is being utilized for the swift enactment of an agenda that has been in the works for decades,\" she articulated to an audience in San Francisco.\n\"An agenda to cut public education. An agenda aimed at reducing government and subsequently privatizing its services, all while providing tax reductions to the wealthiest.\"\n\nMr. Trump's initial 100 days in office have been characterized by a whirlwind of executive actions addressing a range of issues from immigration and foreign aid to showerhead water pressure.\n\nKamala Harris and Joe Biden observe as Donald Trump delivers his second inaugural address.\n\nCritics are alarmed at what they describe as a vindictive administration recklessly infringing upon democratic and constitutional principles, including conflicts with the judiciary.\nWhile some supporters of Mr. Trump have applauded the rapid changes, recent surveys indicate that a majority of Americans are growing disillusioned with the political and economic instability, particularly regarding his frequently altering tariffs.\nMs. Harris, rumored to be considering a run for the governorship of California in 2026 or a potential presidential bid in 2028, has mostly maintained a lower profile since departing Washington in January.\nShe spoke at an event organized by Emerge, a political group focused on recruiting and educating Democratic women for public office.\nMs. Harris remarked that Mr. Trump targets universities and the judiciary as a means to intimidate the opposition.\n\"President Trump, his administration, and their allies are relying on the idea that fear can spread,\" she stated.\n\"They bank on the assumption that if they can instill fear in some, it will create a chilling effect on others.\"\nHowever, she emphasized that there are judges, scholars, politicians, and everyday citizens who are standing up against the administration.\n\"Fear is not the only thing that can spread; courage can spread, too,\" she declared.\n\"The bravery of all these Americans inspires me.\"","summary":"Sure! Here&#8217;s a rewritten version of your content while keeping the HTML tags intact: &#60;p&#62;Former US Vice President Kamala Harris has conveyed her criticisms of President Donald Trump and his supporters during her first significant address since the November election loss.&#60;/p&#62; &#60;p&#62;The defeated Democrat informed her supporters last night that the seeming \"chaos\" of the [&#8230;]","url":"https://www.jowhar.com/world-news/kamala-harris-trumps-america-is-self-serving.html","image":"https://www.jowhar.com/wp-content/uploads/2025/05/00226865-1600.jpg","video":null,"publish_date":"2025-05-01 17:29:53","author":"Hanad","authors":["Hanad"],"language":"en","category":"politics","source_country":"so","sentiment":-0.067},{"id":316851180,"title":"Karoline Leavitt's brutal troll of Kamala Harris after cringe viral videos and strange anti-Trump speech sends internet ablaze","text":"Keep talking Kamala Harris.\n\nThat’s the message the White House shared with the press on Thursday morning just hours after the former vice president and failed presidential candidate criticized President Donald Trump after his first 100 days as president.\n\n‘I think I speak for everyone at the White House. We encourage Kamala Harris to continue going out and doing speaking engagements,’ Leavitt said during the White House press briefing when asked for the president’s reaction to Harris’ speech.\n\nHarris appeared at the Emerge 20th anniversary gala at the Palace Hotel in San Francisco on Wednesday, criticizing Trump’s agenda.\n\n‘Instead of the administration working to advance America’s highest ideals, we are witnessing a wholesale abandonment of those ideals,’ she said.\n\nWhite House deputy chief of staff Stephen Miller said Harris’ appearance was a ‘reminder to the American people of just how blessed we all are that the leader sitting in the Oval Office today is president Donald Trump and not Kamala Harris.’\n\nMiller said that if Harris had won, Biden’s disastrous would have been continued and led to the ‘end of the American Republic.’\n\n‘The only thing Americans want to hear from Kamala Harris is an apology for joining Joe Biden, remember she was the border czar, in aiding and abetting the invasion of our country,’ he said, calling it an ‘eternal stain on the Democrat party.’\n\nHarris only spoke for about 15 minutes at the San Francisco gala, but made it very clear she wanted to continue as part of the political conversation.\n\nShe urged Democrats to find inspiration from a group of elephants at the San Diego Zoo during a recent earthquake.\n\n 'As soon as they felt the earth shaking beneath their feet, they got in a circle and stood next to each other to protect the most vulnerable,' she said. 'Think about it. What a powerful metaphor.'\n\nShe also spoke to politically friendly influencers, urging them to stay together and oppose Trump’s agenda.\n\n‘People also have a right to be tired and to be overwhelmed, so let’s find safe places to be together to talk about that, but ultimately to work through that together and to lock in,’ she said to Zackory Kirk.\n\nHarris also practiced some moves with 2RawTooReal’s Kenny Walden as he taught her the 'Boots on the Ground' dance and clacked a rainbow colored fan. \n\nDuring her speech, the former vice president cautioned Democrats from dismissing Trump’s efforts as ‘chaos.’\n\n‘Understand what we are in fact witnessing is a high velocity event, where a vessel is being used for the swift implementation of an agenda that has been decades in the making,’ Harris said. \n\nShe urged Americans to stand against the administration with courage.\n\n'They are counting on the notion that if they can make some people afraid, it will have a chilling effect on others, but what they have overlooked is that fear is not the only thing that is contagious. Courage is contagious,' she added. \n\nHarris return to the public stage raises questions about the next step of her political career as she weighs whether or not she wants to run for Governor of California in 2026.\n\nCalifornia Governor Gavin Newsom is term limited from running again and is already eying the 2028 presidential race.\n\nHarris remains coy about her political future, keeping her options open as she rests and retools her message for the future. \n\nDemocratic strategists in Washington, DC fully expect Harris to run again, but the 2028 field is expected to be competitive. \n\nHarris continues to believe her failed 2024 campaign was 'nearly perfect' her advisors say but Biden's delayed decision to exit the race made it difficult for her to gain momentum against Trump.","summary":"Keep talking Kamala Harris. That's the message the White House shared with the press on Thursday morning just hours after the former vice president criticized President Donald Trump.","url":"https://www.dailymail.co.uk/news/article-14669275/karoline-leavitt-donald-trump-kamala-harris-dance.html","image":"https://i.dailymail.co.uk/1s/2025/05/01/18/97926467-0-image-a-11_1746118861797.jpg","video":null,"publish_date":"2025-05-01 17:06:39","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":0.198},{"id":316860334,"title":"Harris returns to political life, warning of constitutional crisis","text":"For the first 100 days of President Donald Trump’s new term, Kamala Harris drifted into the recesses of political defeat back home in Los Angeles. She mulled her thoughts and pondered whether to run for California governor but, noticeably, said little about the president.\n\nIt wasn’t until Wednesday night that the former vice president waded back into the conversation with an affirmation of Democratic frustrations, in a speech that her camp had billed as her most extensive remarks since leaving Washington after losing her bid for the White House.\n\nThe nation, she warned, was at risk of a constitutional crisis if the courts and Congress fail to stand up to the president — or if the president defies them nonetheless.\n\n“That is a crisis that will eventually impact everyone,” she said. “Because it would mean that the rules that protect our fundamental rights and freedoms, that ensure each of us has a say in how our government works, will no longer matter.”\n\nHarris’ 16-minute address covered the familiar ground that other Democrats have sounded the alarm about for months. She was in the friendly confines of San Francisco, where she launched her political career as district attorney more than two decades ago, speaking to an organization that lifts up Democratic women running for office.\n\n“It’s wonderful to be home,” Harris said as she began her speech beneath the chandeliers of a hotel ballroom.\n\nIt was a calculated return, streamed on Instagram and YouTube for public consumption. Harris is expected to decide by the end of the summer whether she will run for California governor in 2026, a choice that she believes would preclude her from running in the next presidential race.\n\nShe acknowledged her monthslong departure from public life, at one point joking, “Everybody’s asking me, ‘Well, what’ve you been thinking about these days?’ ” She did not once mention her aspirations for governor or president and kept her speech focused on national matters.\n\nHarris’ cautious approach has long defined her political brand, lacking the firebrand style that other Democratic leaders have increasingly used to tap into the frustration that voters are feeling after the first three months of Trump’s presidency.\n\nGov. JB Pritzker of Illinois urged Democrats in New Hampshire “to fight everywhere and all at once” in a speech this week that was considered an early shot across the 2028 bow. Sen. Bernie Sanders of Vermont and Rep. Alexandria Ocasio-Cortez of New York have attracted huge crowds to their “Fighting Oligarchy” rallies in Los Angeles and Denver, while also touring Republican districts to fire up sympathetic voters.\n\nHarris saluted Sanders and Ocasio-Cortez, along with other Democrats who have been speaking out against Trump in recent weeks. She said that the American people would have to serve as the ultimate check on executive power if the courts and Congress could not.\n\nElsewhere in her speech, Harris said that the nation was witnessing the “swift implementation of an agenda that has been decades in the making” at the hands of Republicans. It wasn’t so much chaos, she suggested, as it was part of the plan all along.\n\n“It’s an agenda, a narrow, self-serving vision of America where they punish truth tellers, favor loyalists, cash in on their power, and leave everyone else to fend for themselves,” Harris said. “All while abandoning allies and retreating from the world.”\n\nWhile she has weighed her options, Harris has taken calls from Democrats seeking her advice as they consider running for office, said her spokesperson, Kirsten Allen.\n\nHarris has kept her political deliberations very close to the vest. Not since Richard Nixon in 1962 has a former vice president come home to California to run for governor, and Harris is operating on her own timetable.\n\nWhile leading Democratic candidates are on the roster to speak at upcoming conventions of the California Labor Federation and the California Democratic Party, Harris has made no plans to attend either one. Some longtime supporters in California said they have not heard from her in months.\n\n“I don’t think she’s made up her mind because I would have heard the drumbeats,” said Mark Buell, a major donor to Democrats who lives in San Francisco and has supported Harris for decades.\n\nBuell was the finance chair during her first campaign in 2003, when Harris ran against the incumbent district attorney of San Francisco to become the first woman to win that office. The race inspired Harris’ supporters to form an organization, called Emerge, to recruit and train Democratic women to enter politics. Her speech in San Francisco on Wednesday was at the group’s 20th anniversary celebration.\n\nMore than half of the states have had female governors, but California, a trendsetter in so many respects, is not among them. Several women are running in the 2026 race, including two who attended Harris’ speech Wednesday: Lt. Gov. Eleni Kounalakis, a longtime friend of Harris’s, and Katie Porter, the former Congress member from Orange County.\n\n“The vice president will make her decision when she’s ready, and I’m sure she’ll let us know one way or the other,” said Porter, who observed late last year that Harris could have a field-clearing effect among Democrats running for governor.\n\nStill, Porter said she was on hand to run her own campaign “and just make sure I can get all the way to the finish line.”\n\nBecause Gov. Gavin Newsom is barred by term limits from running for reelection, the race to succeed him has attracted a large field of candidates. Among them are Democrats Xavier Becerra, the health and human services secretary under President Joe Biden, and Antonio Villaraigosa, a former mayor of Los Angeles.\n\nTwo prominent Republicans so far are Steve Hilton, a former Fox News host, and Chad Bianco, the Riverside County sheriff. After Harris’ speech, Hilton issued a statement calling on her to “stop dillydallying” and get in the race.\n\n“You were a disaster as a presidential candidate; you’d be defending the disaster of a Democrat rule in California,” he said. “I can’t wait to have a real policy debate with you.”\n\nHarris is likely to change the shape of the race if she decides to enter it. Her candidacy could cause some Democrats to drop out, while inspiring more Republicans to jump in at the chance to go up against the Democrat who lost to Mr. Trump.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"For the first 100 days of President Donald Trump&#8217;s new term, Kamala Harris drifted into the recesses of political defeat back home in Los Angeles. She mulled her thoughts and pondered whether to run for California governor but, noticeably, said little about the president.","url":"https://www.staradvertiser.com/2025/05/01/breaking-news/harris-returns-to-political-life-warning-of-constitutional-crisis/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/05/web1_20250501_brk_kma01.jpg","video":null,"publish_date":"2025-05-01 17:00:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":-0.079},{"id":316850726,"title":"Walz: Kamala picked me for white guys | Reporter Replay","text":"New York Post\n\n See All Videos \n\n Recommended \n\n White House lawn lined with illegal immigrants’ mugshots — and heinous crimes they’ve committed — showcasing ICE busts in Trump’s first 100 days \n\n DEA finds deadly ‘pink cocaine’ peddled by migrant gangs during Colorado nightclub bust \n\n Putin’s alleged son seen in leak | Reporter Replay \n\n Illegal immigrant convicted in Morin trail slaying | Reporter Replay \n\n Kilmar Abrego Garcia’s tattoos explained — as conspiracy theories run wild \n\n Inside Barron Trump’s college life at NYU: X-Box chats, girls and more \n\n What to know about Alito’s dissent in SCOTUS case to halt Trump’s deportations \n\n Everything we know about the MSNBC firings \n\n Russia escalates nuclear threat amid Ukraine war, are we a step closer to annihilation? \n\nWalz: Kamala picked me for white guys | Reporter Replay\n\nMay 1, 2025 | 12:50pm\n\nFormer Democratic vice presidential nominee Tim Walz is being mercilessly mocked after he claimed he was chosen to join Kamala Harris on the losing ticket because he could “code talk to white guys.”\n\nThe Minnesota governor drew the derision of conservatives after he said on his national tour stop on April 28 that he was picked because of his ability to “code talk to white guys watching football, fixing their truck” and “put them at ease.” NY Post reporter Deirdre Bardolf shares this story.\n\n Share thison","summary":"Former Democratic vice presidential nominee Tim Walz is being mercilessly mocked after he claimed he was chosen to join Kamala Harris on the losing ticket because he could “code talk to white guys.” The Minnesota governor drew the derision of conservatives after he said on his national tour stop on April 28 that he was...","url":"https://nypost.com/video/walz-kamala-picked-me-for-white-guys-reporter-replay/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/WALZ_CODE-wP-THUMB.jpg?quality=90&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/FIbERUDl-RyIcpnTz.mp4","publish_date":"2025-05-01 16:50:59","author":"New York Post Video","authors":["New York Post Video"],"language":"en","source_country":"us","sentiment":-0.22},{"id":316868054,"title":"AOC's 'triangulation will be one of the most fascinating trapeze acts in all of politics': Kennedy","text":"AOC's 'triangulation will be one of the most fascinating trapeze acts in all of politics': Kennedy\n\n 'Kennedy Saves The World' podcast host Kennedy reacts to Kamala Harris' reemergence, Tim Walz explaining why he was picked as Harris' running mate and Rep. Alexandria Ocasio-Cortez's remarks over impeachment.","summary":"&apos;Kennedy Saves The World&apos; podcast host Kennedy reacts to Kamala Harris&apos; reemergence, Tim Walz explaining why he was picked as Harris&apos; running mate and Rep. Alexandria Ocasio-Cortez&apos;s remarks over impeachment.","url":"https://www.foxbusiness.com/video/6372176125112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/70895645-b286-409b-939e-376a40e7115d/a3432ddf-5dc7-4b42-86ee-96dfb83e56e3/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-01 16:48:58","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.643},{"id":316856212,"title":"35 Democrats vote with GOP to block Biden rule allowing Newsom's gas car ban","text":"Thirty-five House Democrats are rebuking the Biden administration's 11th-hour waiver that cleared a path for California to enact a full ban on gas cars by 2035. A Republican resolution aimed at repealing the Biden-era Environmental Protection Agency (EPA) move passed by a 246 to 164 vote on Thursday morning. Notably, two California House Democrats were among the 35 who voted to rescind their own state's clean energy waiver – Reps. Lou Correa and George Whitesides. Other Democrats in the number include Reps. Bennie Thompson, D-Miss., Pat Ryan, D-N.Y., Tom Suozzi, D-N.Y., Jared Moskowitz, D-Fla., Hillary Scholten, D-Mich., and Frank Mrvan, D-Ind. KAMALA HARRIS REVEALS TIMETABLE FOR MAKING MAJOR POLITICAL DECISION IN DEEP BLUE STATE It was a stunning repudiation of their own former party leader's policies targeting one of Democrats' largest strongholds. Republican leaders, meanwhile, cheered the resolution's passage. House Majority Leader Steve Scalise, R-La., said of the California waiver, \"This radical measure bans the sale of gas-powered vehicles, forcing electric vehicles on the American people and taking away consumer choice.\" \"Americans should choose which car best suits their needs and the needs of their family, not the government,\" Scalise told Fox News Digital. House Majority Whip Tom Emmer, R-Minn., said, \"There is no reason the radical climate policies of California should regulate the entire American population and rob every American of consumer choice.\" \"House Republicans are righting yet another wrong done by the Biden administration and returning basic freedom to choose whatever car you want to the American people,\" Emmer told Fox News Digital. HHS DOWNSIZING BEGINS AMID RFK JR. ‘MAKE AMERICA HEALTHY AGAIN’ PUSH: ‘WIN-WIN FOR TAXPAYERS’ Rep. John Joyce, R-Pa., vice chairman of the House Energy & Commerce Committee, introduced a resolution of disapproval last month targeting a Biden administration-era waiver granted to California that would help the state realize its goal of a full ban on the sale of new gas cars by 2035. A resolution of disapproval, under the Congressional Review Act, allows lawmakers a mechanism to oppose unilateral rules made by federal agencies. Biden's EPA approved a waiver for California in December 2024, just over a month before he left office, that would make it possible for the state to phase out new gas-powered car sales by 2035. The waiver was granted despite concerns raised by major automakers earlier that year about the feasibility of California's goals – but state officials pushing the plan have insisted it was critical to take on climate change. At the time, the Biden administration argued the waiver amounted to an order rather than a regulatory rule, meaning it would not be subject to congressional review. CLICK HERE TO GET THE FOX NEWS APP However, it has been the subject of a standoff between the Trump administration and the federal bureaucracy since then. The Trump administration asked Congress to review the waiver in late February of this year – paving the way for a potential repeal under the GOP-controlled House and Senate. However, the Government Accountability Office said in March that California's waiver is not subject to the Congressional Review Act.","summary":"35 House Democrats joined Republicans to block a Biden-era waiver for Gov. Gavin Newsom&apos;s gas car ban.","url":"https://www.foxnews.com/politics/35-democrats-vote-gop-block-biden-rule-allowing-newsoms-gas-car-ban","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/newsom-johnson-ca.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-01 16:47:10","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":-0.113},{"id":316917282,"title":"Top 10 world news: Attari-Wagah border completely shut; Trump's NSA Mike Waltz to leave White House, and more","text":"The Attari-Wagah border between India and Pakistan was completely shut on Thursday (April 1) as tensions intensified between the two nations after the Pahalgam terror attack. Advertisment Meanwhile, in the US, National Security Adviser Mike Waltz will be leaving his post in the White House, as per multiple reports. Waltz has been in the headlines for a while now as he was involved in the Signagate scandal, and he added a journalist in the Houthi Signal chat. Click on the headlines for more Pahalgam terror attack: Attari-Wagah border completely shut, leaves many Pakistani nationals stranded Advertisment The Attari-Wagah border crossing between India and Pakistan was completely shut on Thursday (May 1) as the tensions between the two nations heightened after the Pahalgam terror attack, that killed 26 people. Trump's NSA Mike Waltz, guy involved in 'Signalgate' scandal, to leave White House: Reports Advertisment United States National security adviser Mike Waltz, who added journalist on Signal chat about Houthis, will be leaving his post in the White House, as per multiple reports. His deputy, Alex Wong, will also leave the post. It is not yet clear if US President Donald Trump has fired the duo or if they have resigned from their posts. The White House has not issued an official statement yet. \"Will hunt down every perpetrator\": Amit Shah\"s warning to terrorists on Pahalgam attack Union Home Minister Amit Shah on Thursday (May 1) said that they will hunt down each and every perpetrator behind the deadly terror attack in Jammu and Kashmir\"s Pahalgam that killed 26 people. 'Don't target Kashmiris, Muslims', appeals widow of Navy officer killed in Pahalgam terror attack On the birth anniversary of Indian Navy lieutenant Vinay Narwal - who was killed in the Pahalgam terror attack on April 22, his wife Himanshi appealed for peace and urged the people of the country to not target Muslims and Kashmiris. She spoke to reporters in Haryana's Karnal where a blood donation camp was organised on Narwal's birth anniversary. 'Reckless tariffs, immigration crackdown...': Kamala Harris accuses Trump of 'greatest man-made economic crisis' Former Vice President Kamala Harris in her first major speech since leaving office, criticised US President Donald Trump, while also accusing him of the \"greatest made-made economic crisis in modern presidential history\". 'Perhaps largest ever': What 'possibly' caused raging wildfires in Israel, causing national emergency As massive wildfires swept through Israel, Prime Minister Benjamin Netanyahu declared a \"national emergency\", and warned that the wildfires near Jerusalem could reach the city. Pahalgam terror attack 'hidden hands': How did the Over Ground Workers help terrorists kill 26 people? In the wake of the horrific terror attack in Jammu and Kashmir's Pahalgam, as the investigation continues by India, new insights have emerged that 15 Over-Ground WorkerS (OGW) helped the terrorists in carrying out the deadly attack in Pahalgam on April 22. Pahalgam attack: Pakistan disowns its people? Refusal to open border for hours leaves many stranded at Wagah-Attari Pakistani citizens who are to leave India have been stranded at the Attari-Wagah crossing as the neighbouring country is unwilling to open its border for their people to cross over. Since Thursday morning, Pakistanis have been waiting at the Attari-Wagah border crossing point without any response from Pakistan. Shah Rukh Khan romances a bottle, gives parenting tips and roasts Karan Johar at WAVES 2025 Shah Rukh Khan was his usual witty self as he took the stage for a panel discussion along with Deepika Padukone at the WAVES Summit 2025. Moderated by Karan Johar, SRK-Deepika\"s session was titled Outsider Who Becomes Ruler. EXPLAINED: What is Rajasthan Royals Pink promise? In the Pink city of Jaipur, as fans rushed into the Sawai Mansingh Stadium, eager to watch a thrilling clash between Rajasthan Royals (RR) and Mumbai Indians (MI) on Thursday (May 1) they expected a normal game of IPL, but what they experienced was more than just a cricket match it was a powerful move that stood for a meaningful cause.","summary":"The Attari-Wagah border between India and Pakistan was completely shut on Thursday (April 1) as tensions intensified between the two nations after the Pahalgam terror attack. \n\n\nMeanwhile, in the US, National Security Adviser Mike Waltz will be leaving his post in the White House, as per multiple reports. Waltz has been in the headlines for a while now as he was involved in the Signagate scandal, and he added a journalist in the Houthi Signal chat. \n\n\nClick on the headlines for more\nPahalgam terror attack: Attari-Wagah border completely shut, leaves many Pakistani nationals stranded\n\n\n\n\n\nThe Attari-Wagah border crossing between India and Pakistan was completely shut on Thursday (May 1) as the tensions between the two nations heightened after the Pahalgam terror attack, that killed 26 people. \n\n\nTrump's NSA Mike Waltz, guy involved in 'Signalgate' scandal, to leave White House: Reports\n\n\n\n\n\nUnited States National security adviser Mike Waltz, who added journalist on Signal chat about Houthis, will be leaving hi","url":"https://www.wionews.com/world/top-10-world-news-attari-wagah-border-completely-shut-trumps-nsa-mike-waltz-to-leave-white-house-and-more-9023588","image":"https://img-cdn.publive.online/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/05/01/E9Iy74roGMFAVtP4RHfr.png","video":null,"publish_date":"2025-05-01 16:44:32","author":"Mansi Arora","authors":["Mansi Arora"],"language":"en","category":"politics","source_country":"in","sentiment":-0.247},{"id":316856038,"title":"‘Thank God Trump is in office’: White House brushes off Kamala Harris comeback speech","text":"White House Deputy Chief of Staff Stephen Miller brushed off former Vice President Kamala Harris’ comeback speech after her failed bid at presidency last year. Miller said the speech was a ‘great reminder’ of how blessed everyone is that it is President Donald Trump, and not Harris sitting in the Oval Office.Harris, in her April 30 speech, spoke on tariffs, saying they were inviting recession. On the Trump presidency completing 100 days, Harris warned of a looming constitutional crisis and urged her allies to speak out loudly.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/thank-god-trump-is-in-office-white-house-brushes-off-kamala-harris-comeback-speech/videoshow/120799481.cms","image":"https://img.etimg.com/thumb/msid-120799481,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-120799481,imgsize-138544.cms","publish_date":"2025-05-01 16:43:59","author":"Youtube","authors":["Youtube"],"language":"en","category":"politics","source_country":"in","sentiment":-0.225},{"id":316855560,"title":"WATCH:  What TSA wants you to know about new Real ID requirements","text":"Mike Waltz \n\nMusk on DOGE progress \n\nUkraine mineral deal \n\nAlien Enemies Act \n\nSevere weather \n\n'Zombie' volcano \n\nWhat TSA wants you to know about new Real ID requirements\nAdam Stahl, TSA senior official performing the duties of the administrator, discusses essential details regarding Real ID.\nMay 1, 2025\n\nAdditional Live Streams\n\nAdditional Live Streams\n\nABC News Live\n\nNASA astronauts prepare for 5th-ever all-female spacewalk\n\nMay Day rally in Los Angeles\n\nSenate meets for legislative business\n\nHouse meets for legislative business\n\nDow Jones Industrial Average\n\nDisruptive severe weather, flash flooding linger in parts of Central and Eastern US; severe storms, flash flooding return to Plains tomorrow; messy weekend weather for both coasts\n\nTop Stories\n\nTop Stories\n\nMusk says DOGE has made progress but 'not as effective as I'd like' after 100 days\n16 minutes ago\n\nBaseball fan in critical condition after falling from stands at Pirates game\nMay 01, 2025\n\n30 million Americans in path of severe weather outbreak\nMay 01, 2025\n\nNew fallout over fate of Kilmar Abrego Garcia\nMay 01, 2025\n\nUS and Ukraine agree to mineral resources deal\nMay 01, 2025\n\nKamala Harris steps back into limelight in speech criticizing Trump\nMay 01, 2025\n\nTrump on defense as economy shrinks in first quarter\nMay 01, 2025\n\nKey witness describes Karen Read’s demeanor the night John O’Keefe died\nMay 01, 2025\n\nFalcons assistant coach breaks silence after son’s prank call during NFL draft\nMay 01, 2025\n\nHigh school students turn themselves in as hazing investigation begins\nMay 01, 2025\n\nWhat to know about the important time before papal conclave\n4 hours ago\n\nKing Charles speaks out on cancer fight\n4 hours ago\n\nSupreme Court appears poised to approve 1st religious charter school\nMay 01, 2025\n\nNFL legend John Elway involved in golf cart crash that killed friend\nMay 01, 2025\n\nTimberwolves move to next round, eliminating the Lakers\nMay 01, 2025\n\nNew study finds weight loss drugs may help treat fatty liver disease\n3 hours ago\n\nA Walk of Hope to raise awareness and help end the stigma of infertility \nMay 01, 2025\n\nPalestinian student activist Mohsen Mahdawi’s attorney on his release from custody\nApr 30, 2025\n\nFirefighters battle wildfire in Israel\nMay 01, 2025\n\n9/11 health program turning away critically ill first responders\nMay 01, 2025\n\nBill Belichick defends girlfriend after viral interview\nMay 01, 2025\n\nDisney's Week of Wishes continues with 'Once Upon A Wish' party\n3 hours ago\n\nFBI tip helped authorities prevent mass shooting Florida, sheriff says\nApr 30, 2025\n\nTrump says egg prices are falling. Some experts say the claim is misleading.\nApr 30, 2025\n\nSupreme Court poised to green light nation’s 1st religious charter school\nApr 30, 2025\n\n1 dead, several hurt in crash involving speeding U-Haul van: Police\nApr 30, 2025\n\nHow Americans describe Trump's term so far in 1 word: POLL\nApr 30, 2025\n\nTrump continues to blame Biden for GDP decline at start of his 2nd term\nApr 30, 2025\n\nTrump discusses first 100 days of historic presidency\nApr 30, 2025\n\nReal ID deadline just 1 week away\nApr 30, 2025\n\nABC News Live Presents\n\nABC News Live Presents\n\nOur Home: Local Action and Global Impact\nApr 22, 2025\n\nAmerica’s Care Crisis\nFeb 13, 2025\n\nImmigration Crackdown\nFeb 12, 2025\n\nShot in the Dark: Weight Loss Injection Wars\nNov 25, 2024\n\nOctober 7th: The Race to Survive\nOct 07, 2024\n\nJanuary 6th: The Fight to Rewrite History\nOct 03, 2024\n\nThe President and First Lady of Ukraine | Robin Roberts Reporting\nSep 25, 2024\n\nMaui Strong 808: Rising from the Ashes\nAug 08, 2024\n\n10 Million Names\nJun 19, 2024\n\nGeneration Swipe\nMay 23, 2024\n\nAmplified: Asian American Native Hawaiian Pacific Islander Voices\nMay 16, 2024\n\nThe Power of Us: People, Climate and Our Future\nApr 25, 2024\n\nTrashed: The Secret Life of Plastic Exports\nApr 23, 2024\n\nToll of War: The José Andrés Interview | Martha Raddatz Reports\nApr 08, 2024\n\nFertility in America | Rebecca Jarvis Reporting\nMar 28, 2024\n\nOne-on-One: A Conversation with Robin Roberts and Caitlin Clark\nMar 15, 2024\n\nAfter the Fall: A Conversation with Robin Roberts and Jenifer Lewis\nMar 12, 2024\n\nPrince Harry's Mission: Life, Family and Invictus Games\nFeb 23, 2024\n\nTackling Mental Health | Michael Strahan Reports\nFeb 16, 2024\n\nSevered: Diabetes Denial and Mistrust \nFeb 15, 2024\n\nExodus: Global Migration\nJan 26, 2024\n\nBattle Cry: Fighting Assault in the Military\nDec 08, 2023\n\nFallout: Two Nations Under Uranium\nNov 30, 2023\n\nThe American Classroom\nNov 17, 2023\n\nDisaster Uninsured\nNov 16, 2023\n\nHispanic Heritage Month: Entre Nos - 1st Gen\nSep 28, 2023\n\nHispanic Heritage Month: Entre Nos – 2nd Gen\nOct 09, 2023\n\nHip-hop at 50: The architect, the First Amendment and the fashion explosion\nAug 23, 2023\n\nElliot Page: In His Own Words\nJun 19, 2023\n\nCulture Conversations - CC: AANHPI Heritage Month\nMay 25, 2023\n\nABC News Specials on\n\nABC News Specials on\n\nImpact X Nightline: On the Brink\nDec 14, 2023\n\nImpact X Nightline: Unboxing Shein\nNov 27, 2023\n\nThe Lady Bird Diaries\nNov 27, 2023\n\nImpact X Nightline: It's Britney\nNov 27, 2023\n\nImpact X Nightline: Natalee Holloway -- A Killer Confesses\nNov 27, 2023\n\nImpact X Nightline: Who Shot Tupac?\nNov 27, 2023\n\nOct 26, 2022\n\nImpact x Nightline\nOct 28, 2022\n\nPower Trip: Those Who Seek Power and Those Who Chase Them\nSep 27, 2022\n\nThe Murders Before the Marathon\nSep 01, 2022\n\nThe Ivana Trump Story: The First Wife\nJul 25, 2022\n\nJul 18, 2022\n\nMormon No More\nJun 22, 2022\n\nLeave No Trace: A Hidden History of the Boy Scouts\nJun 15, 2022\n\nKeeper of the Ashes: The Oklahoma Girl Scout Murders\nMay 20, 2022\n\nThe Orphans of COVID: America's Hidden Toll\nMay 13, 2022\n\nSuperstar: Patrick Swayze\nApr 14, 2022\n\nThe Kardashians -- An ABC News Special\nApr 05, 2022\n\n24 Months That Changed the World\nMar 30, 2022\n\nHave You Seen This Man?\nMar 22, 2022\n\nShare a story idea with ABC News Live\nABC News Network\nPrivacy Policy\nYour US State Privacy Rights\nChildren's Online Privacy Policy\nInterest-Based Ads\nAbout Nielsen Measurement\nTerms of Use\nDo Not Sell or Share My Personal Information\nContact Us © 2025 ABC News","summary":"Adam Stahl, TSA senior official performing the duties of the administrator, discusses essential details regarding Real ID.","url":"https://abcnews.go.com/US/video/tsa-new-real-id-requirements-121360082","image":"https://i.abcnewsfe.com/a/df88fc21-5123-441d-956f-28bdc0c9de01/250501_abcnl_10a_stahl_realid_hpMain_16x9.jpg?w=992","video":null,"publish_date":"2025-05-01 16:24:24","author":null,"language":"en","source_country":"US","sentiment":-0.157},{"id":316841456,"title":"Joe and Jill Biden run to friendly show for first post-White House interview. Yes, it's 'The View'","text":"Former President Joe Biden chose a friendly venue for his first interview since leaving the White House: ABC's \"The View.\" The show announced Thursday that Biden and former first lady Jill Biden will appear on the program on May 8 for their first media appearance since leaving the White House in January. \"We'll ask about his legacy, accomplishments, regrets, and, of course, the current political landscape,\" co-host Whoopi Goldberg said. The ABC show could prove to be a soft landing spot for the Bidens. The six hosts of the show all opposed President Donald Trump in 2024, with several of them openly rooting for Vice President Kamala Harris after she replaced Biden as the Democratic nominee. ANNOYED WHOOPI GOLDBERG HAS TO PROMOTE ABC'S TRUMP INTERVIEW ON 'THE VIEW' Biden appeared on the show in 2019 for his first interview after launching his 2020 election bid and is known to be fond of the program, which has given him cozy receptions over the years. He also appeared on \"The View\" last September, where he said he was confident he would have beaten Trump again if he'd remained in the contest. Liberal co-host Ana Navarro, a strong Biden supporter, hosted a 2020 Florida event for him and served as the host of the second night of the 2024 Democratic National Convention. She was also one of many liberal media figures who countered concerns about Biden's age and mental abilities before 2024. When Harris appeared on the show in 2024, she was introduced by Goldberg as the \"next President of the United States.\" WHITE HOUSE REPORTERS RESPOND AFTER BEING CALLED OUT FOR WEAK COVERAGE OF BIDEN'S DECLINE AT WHCD The show did end up being a stumbling block for Harris in 2024, however. Asked by supporter and co-host Sunny Hostin what she would have done differently from Biden during his first term, Harris memorably blundered by saying nothing came to mind. The moment became fodder for Trump's campaign to show Harris would be more of the same as the unpopular Biden, whose poor approval ratings in combination with concerns about his mental cognition contributed to Democrats pushing him out of the race. CLICK HERE TO GET THE FOX NEWS APP The Bidens are appearing jointly in the midst of a series of books that have been, or are about to be, released, showing the White House worked to conceal his mental decline while he was in office. On Saturday, Axios reporter Alex Thompson said at the White House Correspondents' Dinner that the press \"missed a lot of this story.\"","summary":"ABC&apos;s &quot;The View&quot; will host former President Joe Biden and former First Lady Jill Biden for their first interview since leaving the White House next Thursday.","url":"https://www.foxnews.com/media/joe-jill-biden-run-friendly-show-first-post-white-house-interview-yes-its-the-view","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/BidenBehar.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-01 16:13:32","author":"David Rutz","authors":["David Rutz"],"language":"en","source_country":"us","sentiment":0.056},{"id":316844910,"title":"‘The View’ Lands First Post-White House Interview With Joe and Jill Biden","text":"Former President Joe Biden and first lady Dr. Jill Biden will sit for their first TV interview since leaving the White House on The View.\n\n The Bidens will join hosts Whoopi Goldberg, Joy Behar, Sunny Hostin, Sarah Haines, Alyssa Farah Griffin and Ana Navarro live on the May 8 edition of the ABC daytime show. The former first couple will discuss their life after the presidency, Joe Biden’s legacy and the current political landscape. \n\n That Joe Biden would choose The View for his first on-camera interview after the end of his presidency is not a surprise. He has been a guest on the show 10 times in the past, including in September 2024 when he became the first sitting president to appear live on the show (Barack Obama did a taped interview with the show in 2010). The show was also Biden’s first TV stop when he announced his run for president in 2019, and he appeared on the show several times when he was vice president.\n\n The Bidens’ interview follows on the heels of Kamala Harris, who became the Democratic nominee for president after Biden dropped his re-election bid, made her first major speech since the election earlier this week.","summary":"The former first couple will appear on the ABC daytime show on May 8.","url":"https://www.hollywoodreporter.com/tv/tv-news/joe-jill-biden-the-view-interview-1236205157/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/05/GettyImages-2185457002.jpg","video":null,"publish_date":"2025-05-01 16:13:31","author":"Rick Porter","authors":["Rick Porter"],"language":"en","category":"politics","source_country":"US","sentiment":0.201},{"id":316835802,"title":"America delivers its verdict on Trump's Cabinet members...and there is a clear favorite","text":"Americans have overwhelming favorites when it comes to figures in President Donald Trump's inner circle and among his Cabinet, according to Daily Mail/J.L. Partners polling.\n\nNearly half of registered voters – 45 percent – in the latest survey have a very or somewhat favorable view of Robert F. Kennedy Jr. Meanwhile, 39 percent have an unfavorable opinion of the Health and Human Services Secretary.\n\nOf those included in the perspective poll, Secretary of State Marco Rubio came in a distant second, three-points in the positive among those who have a very favorable and very unfavorable view of Trump's top diplomatic official.\n\nWhite House Press Secretary Karoline Leavitt also had a three-point positive approval, but only 24 percent very or somewhat favorable rating compared to a combined 22 percent unfavorable view.\n\nA whopping 34 percent of respondents said they had never heard of Trump's top spokeswoman.\n\nMelania Trump, 55, steals that show in the Daily Mail poll with 30 percent having a very favorable view of the first lady and 15 percent more expressing their somewhat positive perspective on the president's wife.\n\nOnly 32 percent of respondents say they have a very or somewhat unfavorable view of Melania.\n\n'First buddy' Elon Musk, who attends Cabinet meetings but is not an official member of the group, is underwater in the polling among 1,006 registered voters.\n\nThe DOGE boss and Tesla billionaire has a 15-point disadvantage when it comes to favorability.\n\nA whopping 53 percent of poll respondents have an unfavorable view of Musk, and only 38 percent have a favorable perspective of the SpaceX and X CEO.\n\nTrump held another meeting with his Cabinet on Wednesday – the 100th day of his non-consecutive second term.\n\nThe poll released this week from Daily Mail and J.L. Partners showed Trump at his lowest-yet approval rating since reentering the Oval Office.\n\nThe president's approval fell nine points from 54 percent on April 17 - when his popularity was at a record high - to 45 percent this week. \n\nThe decline is universal with voters increasingly concerned by issues that were critical to Trump's victory over Kamala Harris in the presidential election – rising prices and the economy.\n\nSix in ten say the economy is bad or getting worse, including 49 percent of Republicans. Many believe food, and their favorite products, are getting more expensive.\n\nPerhaps more surprising than his other Cabinet Secretaries is Treasury Secretary Scott Bessent's above-water rating at a one percent advantage for favorable versus unfavorable view.\n\nDespite increasing controversy over the administration's trade and economic policies, Bessent still has a 18 percent favorability versus 17 percent unfavorability. The vast majority at 40 percent have never heard of the Treasury Secretary's name and another 26 percent say they have no opinion of him.","summary":"Americans have overwhelming favorites when it comes to figures in President Donald Trump's inner circle and among his Cabinet, according to Daily Mail/J.L. Partners polling.","url":"https://www.dailymail.co.uk/news/article-14668123/america-verdict-trump-cabinet-members-clear-favorite.html","image":"https://i.dailymail.co.uk/1s/2025/05/01/16/97915085-0-image-m-12_1746111627852.jpg","video":null,"publish_date":"2025-05-01 16:07:19","author":"Editor,Katelyn Caralle","authors":["Editor","Katelyn Caralle"],"language":"en","category":"politics","source_country":"gb","sentiment":0.115},{"id":316842216,"title":"Ex-head of cybersecurity agency has Global Entry membership revoked","text":"Washington — Chris Krebs, who led the Cybersecurity and Infrastructure Security Agency during President Trump's first term, has had his membership in the Global Entry traveler program revoked, the Department of Homeland Security confirmed Thursday.The move comes after Mr. Trump issued a memorandum last month that targeted Krebs for defending the integrity of the 2020 election, which the president has continued to baselessly claim was rigged against him. The directive instructed Attorney General Pam Bondi and Director of National Intelligence Tulsi Gabbard to suspend security clearances held by Krebs and people working at entities associated with him, including at the cybersecurity company where he worked.Krebs, a CBS News cybersecurity expert and analyst, told the Wall Street Journal last month that he was resigning from that company, SentinelOne.Mr. Trump's memo also directed his administration to investigate Krebs' activities from his time in the federal government, including at CISA. A Department of Homeland Security spokesperson told CBS News that Krebs is \"under active investigation by law enforcement agencies. That is a fact disqualifying him for Global Entry.\" CNN first reported that Krebs' Global Entry membership had been rescinded.Global Entry is a program run by the U.S. Customs and Border Protection that allows expedited clearance for travelers arriving in the U.S. who are pre-approved and low-risk. A person may not be eligible for the Global Entry program if they are the subject of an ongoing federal, state or local law enforcement agency, according to CBP.Krebs was fired by Mr. Trump in 2020 after he refuted the president's unsupported claims that the election was rife was widespread voter fraud. CISA had released a joint statement days after the Nov. 3, 2020, election saying that it was the \"most secure in American history\" and that there was \"no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.\"In announcing his decision to remove Krebs from his role as CISA director, Mr. Trump claimed the statement was \"highly inaccurate.\" While the president and his campaign mounted dozens of lawsuits challenging the integrity of the 2020 election, none were successful and claims of widespread fraud were refuted, including by Mr. Trump's former attorney general, Bill Barr.Still, Mr. Trump has continued to claim that the 2020 election was stolen from him and has undertaken numerous actions to take revenge against his political adversaries and critics now that he is back in the White House. In addition to Krebs, the president has signed executive orders punishing major law firms that employed former special counsel Robert Mueller and members of his team, even though they no longer work there. He has also directed his administration to take away security clearances held by former Vice President Kamala Harris and former Secretary of State Hillary Clinton, his opponents in the 2024 and 2016 elections, respectively, and Biden, as well as members of his administration.Like the memo targeting Krebs, Mr. Trump issued another punishing Miles Taylor, a former Department of Homeland Security official who authored a book and op-ed under a pseudonym that criticized the president during his first term as \"impetuous, adversarial, petty and ineffective.\"","summary":"President Trump directed his administration to investigate Chris Krebs, who led the Cybersecurity and Infrastructure Security Agency in his first term.","url":"https://www.cbsnews.com/news/chris-krebs-cisa-trump-global-entry/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2023/03/12/30038901-1842-465b-97bf-7a04ef0a78f9/thumbnail/1200x630/5b8f4a71532415ea5386683f20983641/1678634705155.png?v=1b0e94005fac6507ba49eb1d05f63262","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3663916_hls/master.m3u8","publish_date":"2025-05-01 16:05:30","author":"Melissa Quinn","authors":["Melissa Quinn"],"language":"en","source_country":"us","sentiment":-0.24},{"id":316844916,"title":"2025 News & Documentary Emmy Awards Nominations Revealed","text":"The National Academy of Television Arts (NATAS) has revealed its nominees for the 46th annual News & Documentary Awards.\n\n The nominees for outstanding live new program include ABC World News Tonight with David Muir, The CBS Evening News with Norah O’Donnell, CBS Mornings, Good Morning America, NBC Nightly News with Lester Holt and Top Story with Tom Llamas. \n\n In the best documentary category, nominees include American Conspiracy: The Octopus Murders, The Commandant’s Shadow, The Grab, Hollywood Black, Mammals, Queendom, The Sing Sing Chronicles, The Sixth and The Truth vs. Alex Jones. \n\n This year, the awards will be presented in two ceremonies: News will take place on June 25, while documentaries will take place on June 26, at the Palladium Times Square in New York City. \n\n The News & Documentary Emmy Awards honor “programming content from more than 2,200 submissions that originally premiered in calendar-year 2024,” according to NATAS.\n\n “We are thrilled to recognize the extraordinary talent and relentless commitment of this year’s nominees,” says Adam Sharp, President and CEO of NATAS. “In a rapidly evolving media landscape, their innovative storytelling and unwavering pursuit of truth continue to inspire and inform audiences worldwide. We are proud to honor their remarkable work.” \n\n See below for the full list of nominees. \n\n OUTSTANDING LIVE NEWS PROGRAM\n\n ABC World News Tonight with David Muir ABC \n\n The CBS Evening News with Norah O’Donnell CBS \n\n CBS Mornings CBS \n\n Good Morning America ABC \n\n NBC Nightly News with Lester Holt NBC News \n\n Top Story with Tom Llamas NBC News NOW\n\n OUTSTANDING RECORDED NEWS PROGRAM\n\n CBS Sunday Morning CBS \n\n Dateline NBC NBC News \n\n In Real Life Evident | Scripps News \n\n Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n The Whole Story with Anderson Cooper CNN Worldwide\n\n OUTSTANDING EMERGING JOURNALIST\n\n Gerardo del Valle ProPublica | The Texas Tribune | Univision \n\n Skyler Henry CBS \n\n Jay O’Brien ABC News \n\n Katie Polglase CNN Worldwide \n\n Natasha Zouves NewsNation\n\n OUTSTANDING BREAKING NEWS COVERAGE\n\n Hurricane Helene Landfall Tracking Helene The Weather Channel \n\n Hurricane Milton CNN Worldwide \n\n Hurricane Milton State of Emergency ABC World News Tonight with David Muir ABC \n\n On the Brink PBS News Hour \n\n South Korea Declares Marital Law CNN Worldwide \n\n The Trump Assassination Attempt The New York Times\n\n OUTSTANDING CONTINUING NEWS COVERAGE – SHORT FORM\n\n Clarissa Ward: The Fall of Damascus CNN Worldwide \n\n Gang-Fueled Unrest in Haiti CNN Worldwide \n\n Inside Syria: Assad Overthrown ABC News \n\n Myanmar’s Civil War BBC News \n\n Nick Paton Walsh Covers the War in Ukraine CNN Worldwide\n\n OUTSTANDING CONTINUING NEWS COVERAGE – LONG FORM\n\n Abortion in America: Fallout from the Dobbs Decision Nightline ABC\n\n Border Coverage 60 Minutes CBS News \n\n Donie O’Sullivan: MisinfoNation Trilogy CNN Worldwide \n\n Sudan’s Civil War PBS News Hour PBS News Hour \n\n A Week in Israel & The Pager Plot 60 Minutes CBS News\n\n OUTSTANDING LIGHT FEATURE – SHORT FORM\n\n African Migration: The Deadly Atlantic Route ABC News Nightline and ABC News Prime ABC \n\n Empty Rooms CBS Sunday Morning CBS \n\n Face to Face CBS Sunday Morning CBS \n\n How Tyson Captured All The Pork You Eat (And Made Billions) More Perfect Union \n\n Return to Normandy ABC World News Tonight with David Muir ABC\n\n OUTSTANDING LIGHT FEATURE – LONG FORM \n\n Bhutan 60 Minutes CBS News \n\n The Cap Arcona 60 Minutes CBS News \n\n Last Lands: Central Africa ABC News Live and Global Conservation ABC \n\n The Man Who Feeds Gaza’s Children Business Insider \n\n The Moses Videos In the Shadows with Jason Bellini Scripps News \n\n The Playing Field The Whole Story with Anderson Cooper CNN Worldwide\n\n OUTSTANDING HARD NEWS FEATURE – SHORT FORM \n\n Haiti: Inside the City Ruled by Over 100 Gangs World News America BBC News [BBC World Service, BBC World News America] \n\n How Indiscriminate Israeli Fire Killed Half a Family in Gaza CNN Worldwide \n\n A Mother’s Tragic Tale from War-Torn Gaza CNN Worldwide \n\n Nowhere to Call Home: The Working Homeless Matter of Fact with Soledad O’Brien Hearst Television \n\n Sde Teiman: Israeli Whistleblowers Detail Abuse CNN Worldwide \n\n She Survived an Airstrike that Killed Her Entire Family in Gaza The New York Times \n\n The Walking Route CNN Worldwide\n\n OUTSTANDING HARD NEWS FEATURE – LONG FORM \n\n All That Remains Fault Lines Al Jazeera International USA \n\n Caught in a Coup Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Children of the Darien Gap Fault Lines Al Jazeera International USA \n\n A Hidden War In Real Life Evident | Scripps News \n\n On the Front Lines of Sudan’s Forgotten War The Wall Street Journal\n\n OUTSTANDING INVESTIGATIVE NEWS COVERAGE – SHORT FORM \n\n Dealing the Dead NBC Nightly News with Lester Holt NBC News \n\n Europe’s Migration Crisis BBC News \n\n Grandmother Shot and Killed Fleeing Gaza CNN Worldwide \n\n Hospitals in Peril, The Looting of Steward Health Care CBS News \n\n Maine Shooting: Missed Warnings Scripps News Investigates Scripps News\n\n OUTSTANDING INVESTIGATIVE NEWS COVERAGE – LONG FORM \n\n Baby Heaven: The Buried Stories of Camp Lejeune NBC News NOW \n\n Documenting Police Use of Force FRONTLINE PBS [The Associated Press, The Howard Centers for Investigative Journalism] \n\n The Drug Mule Scam Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n How ‘Trophy’ Videos Link Paramilitary Commanders to War Crimes in Sudan The New York Times \n\n Missed Warnings Scripps News Investigates Scripps News \n\n Targeting Americans 60 Minutes CBS\n\n OUTSTANDING LIVE NEWS SPECIAL\n\n 2024 Total Solar Eclipse: Through the Eyes of NASA NASA+ \n\n CNN Presidential Town Hall with Vice President Kamala Harris CNN Worldwide \n\n Decision 2024: Election Night NBC News \n\n Special Report: Assassination Attempt NBC News \n\n Total Eclipse of the Heartland CBS \n\n Your Voice Your Vote: The 2024 Election ABC News\n\n OUTSTANDING RECORDED NEWS SPECIAL\n\n Exodus: Global Migration ABC News Live ABC \n\n Growing Broke: Forever Chemicals in America’s Heartland NewsNation Prime NewsNation \n\n Hostages: The Road Home The Whole Story with Anderson Cooper CNN Worldwide \n\n Jimmy Carter: A Full Life 20/20 ABC \n\n Surviving Nova VICE Special Report VICE News\n\n Outstanding News Discussion & Analysis America First: A Fareed Zakaria Special CNN Worldwide \n\n American Autocracy: It Could Happen Here Deadline | White House MSNBC \n\n Elliott County Voted for Democrats For 144 Years. Then Came Trump… More Perfect Union \n\n Independent America In Real Life Evident | Scripps News \n\n Israel-Hamas War Face the Nation CBS\n\n OUTSTANDING NEWS DISCUSSION & ANALYSIS – EDITORIAL AND OPINION \n\n Deadlock: An Election Story PBS [Room 608, Inc., GBH Educational Foundation] \n\n Grab Your Calculators. We’re Going to Jail. The New York Times Opinion The New York Times \n\n How Tennessee Keeps Nearly Half a Million People From Voting The New York Times Opinion The New York Times \n\n I Put Him on Death Row. He Shouldn’t Die. The New York Times Opinion The New York Times \n\n Two Weeks Inside Gaza’s Ruined Hospitals The New York Times Opinion The New York Times\n\n OUTSTANDING LIVE INTERVIEW – SHORT FORM \n\n Breaking News: The Assassination Attempt of Donald Trump BBC News \n\n Interview with Jake Larson Amanpour CNN Worldwide \n\n Interview with Oklahoma School Superintendent Ryan Walters Newsroom with Pamela Brown CNN Worldwide \n\n Interview with the Parents of Breonna Moffett NewsNight with Abby Phillip CNN Worldwide \n\n Interview with Vice President Kamala Harris Anderson Cooper 360 CNN Worldwide\n\n OUTSTANDING LIVE INTERVIEW – LONG FORM \n\n Interview with JD Vance State of the Union with Jake Tapper and Dana Bash CNN Worldwide \n\n Interview with the Parents of Hersh Goldberg-Polin Anderson Cooper 360 CNN Worldwide \n\n Interview with Trump Advisor Stephen Miller The Beat with Ari Melber MSNBC \n\n One on One with President Biden Good Morning America ABC News \n\n President Biden Exclusive NBC News Specials & Nightly News NBC News\n\n OUTSTANDING EDITED INTERVIEW \n\n Celine’s Story: An NBC News Special with Hoda Kotb NBC News Special Report NBC News \n\n The Democratic Ticket 60 Minutes CBS News \n\n Ketanji Brown Jackson CBS Sunday Morning CBS \n\n Pope Francis 60 Minutes CBS News \n\n Prisoner in Russia: The Brittney Griner Interview 20/20 ABC\n\n OUTSTANDING SCIENCE AND TECHNOLOGY COVERAGE Darwin’s War In Real Life Scripps News \n\n Farming the Water Hope in the Water PBS [Intuitive Content] \n\n Growing Broke: Forever Chemicals in America’s Heartland NewsNation Prime NewsNation [NewsNation Films] \n\n The Promise 60 Minutes CBS News \n\n Quantum Arms Race The Future with Hannah Fry Bloomberg \n\n Sextortion Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media]\n\n OUTSTANDING CLIMATE, ENVIRONMENT AND WEATHER COVERAGE \n\n Apes Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Last Lands: Indonesia and Ecuador ABC News Live in Partnership with Global Conservation ABC \n\n Maui’s Deadly Firestorm FRONTLINE PBS \n\n Relief, NC 60 Minutes CBS News \n\n Toxic Trifecta PBS News Hour PBS \n\n Warning to the World: Australia’s Climate Disaster The Whole Story with Anderson Cooper CNN Worldwide\n\n OUTSTANDING HEALTH OR MEDICAL COVERAGE Black Market Meds Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Body Parts Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Lie to Fly The New York Times Presents FX | Hulu [The New York Times, Left/Right (a North Road company)] \n\n Master of the Mind 60 Minutes CBS News \n\n Starving Gaza Fault Lines Al Jazeera International USA \n\n Twice Harmed: Asylum Seekers Face Sexual Violence & Abortion Bans Alex Wagner Tonight MSNBC \n\n What’s My Life Worth? The New York Times Opinion The New York Times\n\n OUTSTANDING ARTS, CULTURE OR ENTERTAINMENT COVERAGE \n\n 10 Million Names ABC News Live ABC \n\n Bruce Springsteen: Backstage and Backstreets ABC News Studios ABC \n\n Finding His Voice CBS Sunday Morning CBS \n\n Illegal Gambling Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] The Last Heroes of Normandy ABC World News Tonight with David Muir and Nightline ABC \n\n Netflix is Betting Big on Latin America The Circuit with Emily Chang Bloomberg\n\n OUTSTANDING BUSINESS, CONSUMER OR ECONOMIC COVERAGE \n\n Migrant Smugglers Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Raising the Stakes: America’s Growing Sports Gambling Addiction CBS Reports CBS \n\n Trashed: The Secret World of Plastic Exports ABC News Live ABC \n\n The True Cost of Mining Electric Car Battery Metals True Cost Business Insider \n\n The Trustbuster 60 Minutes CBS News\n\n OUTSTANDING CRIME AND JUSTICE COVERAGE \n\n Assassins Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Breakdown in Maine FRONTLINE PBS [Portland Press Herald, Maine Public Radio] \n\n Hash Smugglers Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n How Russian Hackers Stole Millions from U.S. Investors — Putin’s Trader CNBC \n\n Sins of the Parents: The Crumbley Trials ABC News Studios Hulu\n\n OUTSTANDING CURRENT AFFAIRS DOCUMENTARY\n\n 64 Days: The Insurrection Playbook Goldcrest Films [Saboteur Media, Atomized Studios Limited, Smuggler Films] \n\n Bread & Roses Apple TV+ [Apple Original Films, Eyan Foundation, Extracurricular] \n\n Print it Black ABC News Live ABC \n\n We Will Dance Again Paramount+ [See It Now Studios, HOT 8, BBC Storyville] \n\n A Year of War: Israelis and Palestinians FRONTLINE PBS\n\n OUTSTANDING POLITICS AND GOVERNMENT DOCUMENTARY \n\n Battleground Texas VICE News \n\n The Body Politic POV PBS [ITVS, Black Public Media, Corporation For Public Broadcasting, Rowhouse, LC | Rowhouse Collective] \n\n Carville: Winning is Everything, Stupid CNN Worldwide [Altimeter Films, CNN Films] \n\n From Russia with Lev MSNBC [Rakontur, UTAS, Surprise Inside, MSNBC Films] \n\n The Riot Report American Experience PBS [GBH, 42nd Parallel Films] \n\n The Sixth Amazon | Apple TV [Apple Original Films, A24, Change Content] \n\n Who’s Afraid of Nathan Law? POV PBS [Pandamonium Productions LLC, Herochaser, Palm Pictures, Official, LLC]\n\n OUSTANDING SOCIAL ISSUE DOCUMENTARY \n\n Daughters Netflix [Netflix, XTR, Object & Animal, Epoch Films, Park Pictures, OPC, World of HA, Simpson Street, Two One Five] \n\n Death Without Mercy Showtime [MTV Documentary Films, Docsville Studios, Basement Films, AMC Media Production] \n\n Name Me Lawand POV PBS [Pulse Films] \n\n One With the Whale Independent Lens PBS [Vitamin Sea Productions, Siyuqaq Incorporated, Actual Films] \n\n Two American Families: 1991-2024 FRONTLINE PBS\n\n OUTSTANDING INVESTIGATIVE DOCUMENTARY\n\n American Conspiracy: The Octopus Murders Netflix [Stardust Frames, Duplass Brothers Productions] \n\n A Dangerous Assignment: Uncovering Corruption in Maduro’s Venezuela FRONTLINE PBS [Armando.Info] \n\n The Grab Apple TV+ | Google Play | Prime Video | Vimeo | Vudu | YouTube [Center for Investigative Reporting Studios, Magnolia Pictures, Participant Media, Rocklin | Faust, Impact Partners] \n\n The Night Won’t End Fault Lines Al Jazeera International USA \n\n South Korea’s Adoption Reckoning FRONTLINE PBS [The Associated Press]\n\n OUTSTANDING HISTORICAL DOCUMENTARY \n\n An American Bombing: The Road to April 19th HBO | Max [HBO Documentary Films, Blowback Productions] \n\n Fly With Me American Experience PBS [GBH, Sarah Colt Productions] \n\n The Sixth Amazon | Apple TV [Change Content] \n\n Tsunami: Race Against Time National Geographic [Blast Films] \n\n Turning Point: The Bomb and the Cold War Netflix [Luminant Media]\n\n OUTSTANDING ARTS AND CULTURE DOCUMENTARY \n\n As We Speak: Rap Music on Trial Paramount+ [MTV Entertainment Studios, District 33, Park Pictures, Strike Anywhere] \n\n Butterfly in the Sky Netflix [Sidestilt Films, Window Pictures, XTR] \n\n Hollywood Black MGM+ [Radical Media, Culture Machine, Significant Productions] \n\n King Coal POV PBS [Narrow Vision Endeavors, Cottage M, Drexler Films, King Coal Productions LLC, Fishbowl Films] \n\n Madu Disney + [Disney Branded Television, Hunting Lane Films]\n\n OUTSTANDING SCIENCE AND TECHNOLOGY DOCUMENTARY \n\n Anand Varma: Hidden Wonders Photographer National Geographic [Little Monster Films] \n\n Apollo 13: Survival Netflix [Insight TWI Films, Fee Fie Foe] \n\n Hunt for the Oldest DNA NOVA PBS [Handful of Films, HHMI Tangled Bank Studios, NOVA/GBH, ZDF, DR Danish Broadcasting Corporation] \n\n The Space Race National Geographic [National Geographic Documentary Films, The Kennedy/Marshall Company, Alegria Films, Cortés Filmworks, Diamond Docs] \n\n What’s Next? The Future with Bill Gates Netflix [Tremolo Productions]\n\n OUTSTANDING NATURE DOCUMENTARY \n\n Attenborough and the Jurassic Sea Monster Nature PBS \n\n Billy & Molly: An Otter Love Story National Geographic [Silverback Films] \n\n Grizzly 399: Queen of the Tetons Nature PBS [Lucky 8 TV, The WNET Group] \n\n Our Living World Netflix [Wild Space, Freeborne Media] \n\n Patrick and the Whale Nature PBS [Terra Mater Studios, The WNET Group] \n\n Paul Nicklen & Cristina Mittermeier: Win or Die Photographer National Geographic [Little Monster Films] \n\n Silverback Nature PBS [Off the Fence Studios, BBC, France Télévisions, Featuristic Films, The WNET Group]\n\n OUTSTANDING BUSINESS AND ECONOMIC DOCUMENTARY \n\n Bitconned Netflix [Glass Entertainment Group] \n\n Buy Now: The Shopping Conspiracy Netflix [Grain Media] \n\n Diane von Furstenberg: Woman in Charge Hulu [Sutter Road Picture Company, Fabiola Beracasa Beckman Media Production] \n\n The Hobby Documentary+ [XTR] \n\n Moviepass, Moviecrash HBO | Max [HBO Documentary Films, Unrealistic Ideas, Assemble Media, Nightbrain Pictures, Tower Way] \n\n Razing Liberty Square Independent Lens PBS [RLS Film, LLC]\n\n OUTSTANDING CRIME AND JUSTICE DOCUMENTARY \n\n Cult Massacre: One Day In Jonestown National Geographic [72 Films] \n\n Into the Fire: The Lost Daughter Netflix [Tripod Media LLC, Denver & Delilah] \n\n Mastermind: To Think Like a Killer Hulu [Campfire Studios, Lewellen Pictures, Invited by Girls, Rebecca Halpern Productions] \n\n Poisoned Ground: The Tragedy at Love Canal American Experience PBS [GBH, Madrona Productions] \n\n The Truth vs. Alex Jones HBO | Max [HBO Documentary Films, AMOS Pictures]\n\n OUTSTANDING SHORT DOCUMENTARY\n\n The Dirty Business of Monkey Laundering Bloomberg Investigates Bloomberg \n\n Love To The Max The New Yorker \n\n Motorcycle Mary ESPN [ESPN Films, Breakwater Studios] \n\n Swept Human Rights Watch \n\n Wings of Dust Documentary+ [Rolling Stone Films, Skyeyes Documentaries, 42 Parallelo, 5 Stick Films Inc.]\n\n BEST DOCUMENTARY \n\n American Conspiracy: The Octopus Murders Netflix [Stardust Frames, Duplass Brothers Productions] \n\n The Commandant’s Shadow HBO | Max [Warner Bros. Pictures, HBO Documentary Films, Snowstorm Productions, Creators Inc., New Mandate Films] \n\n The Grab Apple TV+ | Google Play | Prime Video | Vimeo | Vudu | YouTube [Center for Investigative Reporting Studios, Rocklin | Faust, Magnolia Pictures, Participant Media, Impact Partners] \n\n Hollywood Black MGM+ [Radical Media, Culture Machine, Significant Productions] \n\n Mammals BBC America | BBC+ [BBC Studios National History Unit, France Televisions, ZDF] \n\n Queendom Galdanova Film \n\n The Sing Sing Chronicles MSNBC [NBC News Studios, MSNBC Films, Trilogy Films] \n\n The SixthAmazon | Apple TV [Apple Original Films, A24, Change Content] \n\n The Truth vs. Alex Jones HBO | Max [HBO Documentary Films, AMOS Pictures]\n\n OUSTANDING NEWS PROGRAM IN SPANISH \n\n Conclusiones CNN Worldwide \n\n Noticias Telemundo con Julio Vaqueiro Telemundo \n\n Noticiero Univision Univision \n\n Noticiero Univision Edicion Digital Univision\n\n OUTSTANDING JOURNALIST IN SPANISH LANGUAGE MEDIA \n\n Damià Bonmatí Telemundo \n\n Albert Martínez The Weather Channel en Español \n\n Pau Mosquera CNN Worldwide \n\n Julio Vaqueiro Telemundo\n\n OUTSTANDING COVERAGE OF A BREAKING NEWS STORY IN SPANISH \n\n Atentado Contra Donald Trump Noticiero Univision Univision \n\n Eclipse Total Noticias Telemundo Telemundo \n\n Telemundo News Special Report: Inside Election Night 2024 Noticias Telemundo Telemundo\n\n OUTSTANDING INVESTIGATIVE NEWS COVERAGE IN SPANISH \n\n Cada Vez Más Migrantes Viajan Encerrados en Tráileres por México Rumbo a EE.UU. Telemundo \n\n China Inc: Un Negocio Criminal de Aduanas N+ Focus VIX | TelevisaUnivision \n\n Deportación Infantil: el Muro Mexicano N+ Focus VIX | TelevisaUnivision \n\n El Darién, Cementerio Sin Cruces Noticiero Univision Univision \n\n La Lucha por Salvar las Últimas 8 Vaquitas Marinas del Mundo El Último Refugio de la Vaquita Marina VICE News \n\n NarcoFiles: Tren de Aragua CNN Worldwide CNN Worldwide\n\n OUTSTANDING FEATURE STORY IN SPANISH \n\n El Camino Correcto: el Largo Viaje Para Pedir Asilo de Una Familia Venezolana ProPublica | The Texas Tribune | Univision \n\n Más y Más y Más Flores The New York Times \n\n Nacer Sin Extremidades: la Vida de Carlos Candelario Tras la Exposición a Pesticidas de su Madre Univision \n\n Nuestro Planeta: Voces del Cambio Climático Telemundo Station Group \n\n To Live in a Wild Sea The New York Times\n\n OUTSTANDING WRITING – NEWS \n\n CBS Sunday Morning: Empty Rooms CBS Sunday Morning CBS \n\n Dr. Kuznetzov 60 Minutes CBS News \n\n Elephant V. Man The Whole Story with Anderson Cooper CNN Worldwide \n\n Growing Broke: Forever Chemicals in America’s Heartland NewsNation Prime NewsNation \n\n A Mother’s Tragic Tale from War-Torn Gaza CNN Worldwide CNN Worldwide \n\n Apes Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media]\n\n OUTSTANDING RESEARCH – NEWS \n\n Apes Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Breakdown in Maine FRONTLINE PBS [Portland Press Herald, Maine Public Radio] \n\n The Cap Arcona 60 Minutes CBS News \n\n Documenting Police Use of Force FRONTLINE PBS [The Associated Press, The Howard Centers for Investigative Journalism] \n\n The Hidden Autopilot Data That Reveals Why Teslas Crash The Wall Street Journal \n\n K File Investigation in North Carolina Governor’s Race CNN Worldwide CNN Worldwide \n\n Starving Gaza Fault Lines Al Jazeera International USA\n\n OUTSTANDING DIRECTION – NEWS \n\n ABC News Your Voice Your Vote The ABC News Presidential Debate ABC \n\n Assassins Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] Caught in a Coup Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n The Drug Mule Scam Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Election Night NBC News \n\n Surviving Nova VICE Special Report VICE News\n\n OUTSTANDING VIDEO JOURNALISM \n\n Caught in a Coup Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Hash Smugglers Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n A Hidden War In Real Life Evident | Scripps News \n\n Migrant Smugglers Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n On the Front Lines With Ukraine’s Killer Drone Pilot The Wall Street Journal\n\n OUTSTANDING EDITING – NEWS\n\n Assassins Trafficked: Underworlds with Mariana van Zeller National Geographic \n\n Children of the Darien Gap Fault Lines Al Jazeera International USA \n\n The Drug Mule Scam Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Illegal Gambling Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Notes of Protest: Afghanistan’s Orchestra in Exile NBC News NOW | NBC News\n\n OUTSTANDING GRAPHIC DESIGN – NEWS\n\n AFP Videographic : The International Criminal Court AFP \n\n Four Gazans Show How War Devastated Their Coastline Business Insider \n\n The Hidden Autopilot Data That Reveals Why Teslas Crash The Wall Street Journal \n\n The Price of Money Bloomberg News Spotlight Bloomberg \n\n Rohingya Hijras Facing Transphobic Abuse and Sexual Violence CNN Worldwide \n\n You’re Being Lied To About Voter Fraud. Here’s the Truth. The New York Times Opinion The New York Times\n\n OUTSTANDING SHOW OPEN OR TITLE SEQUENCE – NEWS \n\n 2024 Total Solar Eclipse: Through the Eyes of NASA NASA+ \n\n Assassins Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Election Night Live with Brian Williams Prime Video [White Cherry Entertainment] \n\n Migrant Smugglers Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Total Eclipse of the Heartland CBS News \n\n What Happened to Karen Silkwood: The Lost Tapes Impact x Nightline ABC | Hulu\n\n OUTSTANDING LIGHTING DIRECTION – NEWS \n\n Assassins Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Hash Smugglers Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Illegal Gambling Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media] \n\n Sextortion Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media]\n\n TECHNICAL EXCELLENCE – NEWS \n\n America Decides, Election ’24 CBS News \n\n CNN Presidential Debate: President Joe Biden & Former President Donald J. Trump CNN Worldwide \n\n NBC News: Election Night Coverage NBC News \n\n Telemundo Decision 2024 Telemundo \n\n Trafficked: Underworlds with Mariana van Zeller National Geographic [Muck Media]\n\n OUTSTANDING WRITING – DOCUMENTARY \n\n Billy & Molly: An Otter Love Story National Geographic [Silverback Films] \n\n Join or Die Netflix [Delevan Street Films] \n\n King Coal POV PBS [Narrow Vision Endeavors, Cottage M, Drexler Films, King Coal Productions LLC, Fishbowl Films] \n\n The Night Won’t End Fault Lines Al Jazeera International USA \n\n Poisoned Ground: The Tragedy at Love Canal American Experience PBS [GBH, Madrona Productions] \n\n The Space Race National Geographic [National Geographic Documentary Films, The Kennedy/Marshall Company, Alegria Films, Cortés Filmworks, Diamond Docs]\n\n OUTSTANDING RESEARCH – DOCUMENTARY \n\n The Bibi Files Jolt.film [Jigsaw Productions] \n\n China, The U.S. and the Rise of Xi Jinping FRONTLINE PBS \n\n The Grab Apple TV+ | Google Play | Prime Video | Vimeo | Vudu | YouTube [Center for Investigative Reporting Studios, Magnolia Pictures, Participant Media, Rocklin | Faust, Impact Partners] \n\n Nazi Town, USA American Experience PBS [GBH, Pangloss Films] \n\n Our Oceans Netflix [Wild Space, Freeborne Media, Higher Ground}\n\n OUTSTANDING DIRECTION – DOCUMENTARY \n\n Billy & Molly: An Otter Love Story National Geographic [Silverback Films] \n\n Daughters Netflix [XTR, Object & Animal, Epoch Films, Park Pictures, OPC, World of HA, Simpson Street, Two One Five] \n\n Frida Prime Video [Imagine Documentaries, TIME Studios] \n\n Madu Disney + [Disney Branded Television, Hunting Lane Films] \n\n Poisoned Ground: The Tragedy at Love Canal American Experience PBS [GBH, Madrona Productions]\n\n OUTSTANDING CINEMATOGRAPHY – DOCUMENTARY \n\n Earthsounds Apple TV+ [Offspring Films] \n\n King Coal POV PBS [American Documentary | POV, Narrow Vision Endeavors, Cottage M, Drexler Films, King Coal Productions LLC, Fishbowl Films] \n\n Lions of the Skeleton Coast Nature PBS [Into Nature Productions, ORF Universum, Arte, WDR] \n\n Mammals BBC America | BBC+ [BBC Studios National History Unit, France Televisions, ZDF] \n\n Our Living World Netflix [Wild Space, Freeborne Media, Higher Ground] \n\n Secret World of Sound with David Attenborough Netflix [CBC, Sky, Humble Bee Films]\n\n OUTSTANDING EDITING – DOCUMENTARY \n\n Apollo 13: Survival Netflix [Insight TWI Films, Fee Fie Foe] \n\n Blink National Geographic [MRC, EYESTEELFILM, National Geographic Documentary Films, Fishbowl Films, Motive] \n\n Citizen Nation PBS [Retro Report] \n\n Death Without Mercy Showtime [MTV Documentary Films, Docsville Studios, Basement Films, AMC Media Production] \n\n We Will Dance Again Paramount+ [See It Now Studios, HOT 8, BBC Storyville]\n\n OUTSTANDING GRAPHIC DESIGN – DOCUMENTARY \n\n Buy Now: The Shopping Conspiracy Netflix [Grain Media] \n\n Food, Inc. 2 Apple TV+ | Amazon Prime Video | Google Play [The Food Project 2020] \n\n Frida Prime Video [Imagine Documentaries, TIME Studios] \n\n Join or Die Netflix [Delevan Street Films] \n\n Omnivore Apple TV+ [Fifth Season, Film 45]\n\n OUTSTANDING MUSIC COMPOSITION – DOCUMETNARY \n\n Billy & Molly: An Otter Love Story National Geographic [Silverback Films] \n\n Dan Winters: Life is Once. Forever. Photographer National Geographic [Little Monster Films] \n\n Endurance National Geographic [A Little Dot Studios, Consequential, History Hit Production, Little Monster Films, National Geographic Documentary Films] \n\n Frida Prime Video [Imagine Documentaries, TIME Studios] \n\n Mafia Spies Paramount+ [CreativeChaos vmg]\n\n OUTSTANDING SOUND – DOCUMENTARY \n\n Apollo 13: Survival Netflix [Insight TWI Films, Fee Fie Foe] \n\n Billy & Molly: An Otter Love Story National Geographic [Silverback Films] \n\n Earthsounds Apple TV+ [Offspring Films] \n\n Mammals BBC America | BBC+ [BBC Studios National History Unit, France Televisions, ZDF] \n\n Secret World of Sound with David Attenborough Netflix [CBC, Sky, Humble Bee Films]\n\n OUTSTANDING LIGHTING DIRECTION – DOCUMENTARY \n\n American Conspiracy: The Octopus Murders Netflix [Stardust Frames, Duplass Brothers Productions] \n\n American Seams POV Shorts PBS [LA Times Studios, Paper Hat Films, The Plains] \n\n Cold Case: Who Killed JonBenét Ramsey Netflix [RadicalMedia, Third Eye Motion Picture Company] \n\n Hitler and the Nazis: Evil on Trial Netflix [Smuggler Entertainment, Third Eye Motion Picture Company] \n\n Separated MSNBC [NBC News Studios, Participant Media, A Fourth Floor, Moxie Pictures Production, MSNBC Films]\n\n OUTSTANDING ART DIRECTION/SET DECORATION/SCENICE DESIGN – DOCUMENTARY \n\n Apollo 13: Survival Netflix [Insight TWI Films, Fee Fie Foe] \n\n Glitter and Greed: The Lisa Frank Story Prime Video [Amazon MGM Studios, Maxine Productions, Sony Pictures Television] \n\n Hitler and the Nazis: Evil on Trial Netflix [Smuggler Entertainment, Third Eye Motion Picture Company] \n\n Separated MSNBC [NBC News Studios, Participant Media, A Fourth Floor, Moxie Pictures Production, MSNBC Films] \n\n This Is What a Nuclear Strike Would Feel Like The New York Times Opinion The New York Times \n\n You’re Being Lied To About Voter Fraud. Here’s the Truth. The New York Times Opinion The New York Times [Sharp As Knives]\n\n OUTSTANDING PROMOTIONAL ANNOUNCEMENT – NEWS \n\n Election Night ABC News \n\n I’M IN (Image Campaign) Good Morning America ABC \n\n No Fear ABC World News Tonight with David Muir ABC \n\n Sins of the Parents ABC News Studios | Hulu \n\n Steve Kornacki Brand Campaign Decision 2024 MSNBC [Bodega Studios, Matt Wilcox Music]\n\n OUTSTANDING PROMOTIONAL ANNOUNCEMENT – DOCUMENTARY \n\n Billy & Molly: An Otter Love Story National Geographic [Silverback Films, Silk Factory] \n\n Blink National Geographic [MRC, EYESTEELFILM, National Geographic Documentary Films, Fishbowl Films, Motive] \n\n Brats ABC News Studios | Hulu \n\n The Grab Apple TV+ | Google Play | Prime Video | Vimeo | Vudu | YouTube [Center for Investigative Reporting Studios, Magnolia Pictures, Participant Media, Rocklin | Faust, Impact Partners] \n\n Patrice: The Movie ABC News Studios | Hulu \n\n Tsunami: Race Against Time National Geographic [Blast Films, Aspect]\n\n OUTSTANDING REGIONAL NEWS STORY: BREAKING/SPOT NEWS \n\n Deadly Tornado Coverage KCCI \n\n Jet Crash on I-75 WINK News \n\n Lakewood Church Shooting KPRC \n\n North Texas Tornadoes WFAA \n\n This is not Normal KUSA\n\n OUTSTANDING REGIONAL NEWS STORY: INVESTIGATIVE \n\n Coroner’s Criminal Past WWL-TV \n\n Disabled in Danger WFAA \n\n Double Injustice WVUE \n\n In Plane Sight WANF-TV \n\n KARE 11 Investigates: Nowhere to Turn KARE–TV \n\n Spit Hoods Can Be Deadly. Police Still Use Them Anyway WTSP-TV\n\n OUTSTANDING REGIONAL DOCUMENTARY \n\n Angels Too Soon WTTW / PBS \n\n Desde Cero: The Migrant Journey in Chicago WMAQ \n\n The Holly Rocky Mountain Public Media \n\n OKC Thunder STEPS Oklahoma City Thunder \n\n A Towering Task: The Story of the Peace Corps Rocky Mountain Public Media","summary":"The winners will be announced in two ceremonies on June 25 and June 26.","url":"https://www.hollywoodreporter.com/tv/tv-news/2025-news-documentary-emmy-awards-nominations-1236204666/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/01/Emmy-Statues-Displayed-GettyImages-183126331-H-2024.jpg","video":null,"publish_date":"2025-05-01 16:00:00","author":"Beatrice Verhoeven","authors":["Beatrice Verhoeven"],"language":"en","source_country":"US","sentiment":0.389},{"id":316843466,"title":"‘Eternal Stain’: Stephen Miller, Karoline Leavitt Respond To Kamala Harris’ First Public Speech Since Losing To Trump","text":"Instead of sucking up to the political and corporate powers that dominate America, The Daily Caller is fighting for you — our readers. We humbly ask you to consider joining us in this fight.\n\nNow that millions of readers are rejecting the increasingly biased and even corrupt corporate media and \n joining us daily, there are powerful forces lined up to stop us: the old guard of the news media hopes \n to marginalize us; the big corporate ad agencies want to deprive us of revenue and put us out of business; \n senators threaten to have our reporters arrested for asking simple questions; the big tech platforms want \n to limit our ability to communicate with you; and the political party establishments feel threatened by our \n independence.\n\nWe don't complain -- we can't stand complainers -- but we do call it how we see it. We have a fight on our \n hands, and it's intense. We need your help to smash through the big tech, big media and big government blockade.\n\nWe're the insurgent outsiders for a reason: our deep-dive investigations hold the powerful to account. \n Our original videos undermine their narratives on a daily basis. Even our insistence on having fun infuriates \n them -- because we won’t bend the knee to political correctness.\n\nOne reason we stand apart is because we are not afraid to say we love America. We love her with every fiber of \n our being, and we think she's worth saving from today’s craziness.\n\nHelp us save her.\n\nA second reason we stand out is the sheer number of honest responsible reporters we have helped train. We have \n trained so many solid reporters that they now hold prominent positions at publications across the political \n spectrum. Hear a rare reasonable voice at a place like CNN? There’s a good chance they were trained at Daily \n Caller. Same goes for the numerous Daily Caller alumni dominating the news coverage at outlets such as Fox News, \n Newsmax, Daily Wire and many others.\n\nSimply put, America needs solid reporters fighting to tell the truth or we will never have honest elections or a \n fair system. We are working tirelessly to make that happen and we are making a difference.\n\nSince 2010, The Daily Caller has grown immensely. We're in the halls of Congress. We're in the Oval Office. \n And we're in up to 20 million homes every single month. That's 20 million Americans like you who are impossible \n to ignore.\n\nWe can overcome the forces lined up against all of us. This is an important mission but we can’t do it unless you — \n the everyday Americans forgotten by the establishment — have our back.\n\nPlease consider becoming a Daily Caller Patriot today, and help us keep doing work that holds politicians, \n corporations and other leaders accountable. Help us thumb our noses at political correctness. Help us train a new \n generation of news reporters who will actually tell the truth. And help us remind Americans everywhere that there \n are millions of us who remain clear-eyed about our country's greatness.\n\nIn return for membership, Daily Caller Patriots will be able to read The Daily Caller without any of the ads that \n we have long used to support our mission. We know the ads drive you crazy. They drive us crazy too. But we need \n revenue to keep the fight going. If you join us, we will cut out the ads for you and put every Lincoln-headed cent \n we earn into amplifying our voice, training even more solid reporters, and giving you the ad-free experience and \n lightning fast website you deserve.\n\nPatriots will also be eligible for Patriots Only content, newsletters, chats and live events with our reporters \n and editors. It's simple: welcome us into your lives, and we'll welcome you into ours.\n\nWe can save America together.\n\nBecome a Daily Caller Patriot today.","summary":"'We encourage Kamala Harris to continue going out'","url":"https://dailycaller.com/2025/05/01/stephen-miller-karoline-leavitt-kamala-harris-speech/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/Screenshot-2025-05-01-at-10.44.06 AM-e1746110698596.png","video":null,"publish_date":"2025-05-01 15:49:38","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","category":"politics","source_country":"US","sentiment":-0.054},{"id":316917284,"title":"'Reckless tariffs, immigration crackdown...': Kamala Harris accuses Trump of 'greatest man-made economic crisis'","text":"Former Vice President Kamala Harris in her first major speech since leaving office, criticised US President Donald Trump, while also accusing him of the \"greatest made-made economic crisis in modern presidential history\". Advertisment While rebuking her former rival, Harris took note of major policy shifts brought by Trump, which led to a crisis in America. She blamed Trump's tariff policies, and immigration crackdown, among other policy changes, saying that it poses the risk of taking the US into recession. Harris was speaking in San Francisco at a gala event for the organization Emerge America, which helps women run for office. AdvertismentAlso read: \"We need to de-escalate\": US Treasury Secretary Bessent says he\"s confident China will want to reach tariff deal 'Reckless tariffs' \"Some people are describing what's been happening in recent months as absolute chaos. And of course, I understand why. It's certainly true of those tariffs. Tariffs that — as I predicted — are clearly inviting a recession,\" Harris said. Advertisment She further applauded those Americans who are rallying against the tariffs, saying that they will increase everyday costs and impact retirement accounts and small businesses. Harris said, \"Instead of an administration working to advance America\"s highest ideals, we are witnessing the wholesale abandonment of those ideals.” Also read: Are tariffs taking a 'bite' out of the US economy? She blamed Trump for \"reckless\" tariffs and said, \"As I predicted,” they are “clearly inviting a recession.” She added that the import taxes will \"hurt workers and families by raising the cost of everyday essentials, devastate their retirement accounts that people spent a lifetime paying into, and paralyze American businesses, large and small, forcing them to lay off people.” Stressing that Trump and his allies are counting on the notion that fear can be contagious, Harris said, \"They are counting on the notion that, if they can make some people afraid, it will have a chilling effect on others. But what they\"ve overlooked is that fear isn\"t the only thing that\"s contagious. Courage is contagious.” Harris calls out immigrants deportation Harris, who herself is a child of immigrants, also called out the Trump administration's deportations of lawful residents, including university students, and its interrogation of US citizens. It is “not OK to detain and disappear American citizens or anyone without due process,” she said. She also lauded Democrats who are standing up against Trump and his administration. Harris warned that “things are probably going to get worse before they get better,” but also expressed confidence that Democrats were “ready” to face the moment. Also read: One wrong turn that led to El Salvador prison - How Trump administration arrested McDonald's delivery guy","summary":"Former Vice President Kamala Harris in her first major speech since leaving office, criticised US President Donald Trump, while also accusing him of the \"greatest made-made economic crisis in modern presidential history\". \n\n\nWhile rebuking her former rival, Harris took note of major policy shifts brought by Trump, which led to a crisis in America. \n\n\nShe blamed Trump's tariff policies, and immigration crackdown, among other policy changes, saying that it poses the risk of taking the US into recession. \n\n\nHarris was speaking in San Francisco at a gala event for the organization Emerge America, which helps women run for office.\n\n\nAlso read: &lsquo;We need to de-escalate&rsquo;: US Treasury Secretary Bessent says he&rsquo;s confident China will want to reach tariff deal\n\n\n'Reckless tariffs'\n\"Some people are describing what's been happening in recent months as absolute chaos. And of course, I understand why. It's certainly true of those tariffs. Tariffs that &mdash; as I predicted &mdash; are clearly inviting a r","url":"https://www.wionews.com/world/reckless-tariffs-immigration-crackdown-kamala-harris-accuses-trump-of-greatest-man-made-economic-crisis-9023411","image":"https://img-cdn.publive.online/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/05/01/DVYvgCxrs9ySEVkiKdYE.png","video":null,"publish_date":"2025-05-01 15:39:23","author":"Mansi Arora","authors":["Mansi Arora"],"language":"en","category":"politics","source_country":"in","sentiment":-0.151},{"id":316828510,"title":"Kamala Harris bizarrely references viral elephant video in speech attacking Trump","text":"New York Post\n\n See All Videos \n\n Recommended \n\n Kamala Harris bizarrely references viral elephant video in speech attacking Trump \n\n DEA finds deadly ‘pink cocaine’ peddled by migrant gangs during Colorado nightclub bust \n\n Illegal immigrant convicted in Morin trail slaying | Reporter Replay \n\n Kilmar Abrego Garcia’s tattoos explained — as conspiracy theories run wild \n\n Inside Barron Trump’s college life at NYU: X-Box chats, girls and more \n\n What to know about Alito’s dissent in SCOTUS case to halt Trump’s deportations \n\n Putin’s alleged son seen in leak | Reporter Replay \n\n Everything we know about the MSNBC firings \n\n Russia escalates nuclear threat amid Ukraine war, are we a step closer to annihilation? \n\nKamala Harris bizarrely references viral elephant video in speech attacking Trump\n\nMay 1, 2025 | 11:38am\n\nFormer Vice President Kamala Harris emerged from political hibernation to deliver a stern rebuke of President Trump — soon descending into one of her trademark word salads, this time bizarrely focusing on a viral video of elephants during an earthquake.\n\n“A lot of folks are wondering what’s going to guide us through this moment. How are we all going to figure out how to chart the course?” Harris said during her April 30 address at Emerge’s 20th anniversary gala in San Francisco.\n\n Share thison","summary":"Former Vice President Kamala Harris emerged from political hibernation to deliver a stern rebuke of President Trump — soon descending into one of her trademark word salads, this time bizarrely focusing on a viral video of elephants during an earthquake. “A lot of folks are wondering what’s going to guide us through this moment. How...","url":"https://nypost.com/video/kamala-harris-bizarrely-references-viral-elephant-video-in-speech-attacking-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/kamala.jpg?quality=90&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/HXOuJjwX-RyIcpnTz.mp4","publish_date":"2025-05-01 15:38:53","author":"New York Post Video","authors":["New York Post Video"],"language":"en","category":"politics","source_country":"zm","sentiment":0.148},{"id":316829984,"title":"Harris accuses Trump of abandoning American ideals in first major speech since leaving office","text":"(CNN) — Former Vice President Kamala Harris rebuked President Donald Trump in her first major speech since leaving office, accusing her former rival of setting off the “greatest man-made economic crisis” in modern history through his across-the-board tariffs, and warning that his conflicts with the courts were moving the nation toward a constitutional crisis.\n\nHarris spoke Wednesday evening at the Emerge Gala in San Francisco, benefitting an organization that supports women interested in entering politics. The 2024 Democratic presidential nominee marked the first 100 days of the second Trump administration during her address, saying that “instead of an administration working to advance America’s highest ideals, we are witnessing the wholesale abandonment of those ideals.”\n\n“And what we are also seeing in these last 14 weeks is Americans using their voice and showing their courage,” Harris added.\n\nThe former vice president delivered a series of attacks on the administration, blaming Trump for the economic turbulence caused by the tariffs he has imposed on goods imported from major trading partners.\n\nHarris called Trump’s tariffs “reckless” and said, “as I predicted,” they are “clearly inviting a recession.”\n\nHarris said those import taxes will “hurt workers and families by raising the cost of everyday essentials, devastate their retirement accounts that people spent a lifetime paying into, and paralyze American businesses, large and small, forcing them to lay off people.”\n\nTrump has said the across-the-board tariffs are meant to correct a trade imbalance with other countries and restore US manufacturing jobs. However, the administration’s policy changes have rocked global markets and added to mounting economic pressure on the US economy. Official data released Wednesday showed the economy contracted in the first quarter by 0.3%.\n\nHarris told Democrats there is a method behind the break-neck pace of policy rollouts of the Trump administration, calling the president a “vessel” of a much larger conservative project.\n\n“Friends, please, let us not be duped into thinking everything is chaos. I know it may feel that way, but understand, what we are in fact witnessing is a high velocity event where a vessel is being used for the swift implementation of an agenda that has been decades in the making,” the former vice president said.\n\nThe path forward for Harris and the Democratic Party\n\nHarris’ speech on Wednesday comes at an inflection point for the 2024 Democratic presidential nominee, with weighty questions about both her own path forward and that of her party.\n\nIn the wake of last year’s loss, Harris and her team began debating her next steps, considering another run for president in 2028, or a return to her home state for a 2026 gubernatorial run. Notably, Harris’ public address on Wednesday took place in California. “It’s wonderful to be home,” Harris said during her speech.\n\nHarris’ advisors believe that getting into the governor’s race would require making her intentions clear at the latest by the summer of 2025, but she faces some pressure to make a decision soon – that contest is heating up, with Democratic former Rep. Katie Porter, Lt. Gov. Eleni Kounalakis, and several other prominent contenders having already launched campaigns.\n\nWhether she enters the California race as a heavy favorite, or holds out for the 2028 presidential primary, a less certain proposition, Harris’ remarks Wednesday also reflect a deliberate reemergence, months after her defeat, as Democrats look for leadership amid the turbulence of the new Trump administration.\n\nAs she lambasted the Trump administration Wednesday night for attempting to “divide and conquer,” Harris urged Democrats to stay together.\n\nShe also highlighted several lawmakers across the party’s ideological spectrum who she said have “in different ways have been speaking with moral clarity about this moment.” Harris named New Jersey Sen. Cory Booker, Maryland Sen. Chris Van Hollen, Connecticut Sen. Chris Murphy, Texas Rep. Jasmine Crockett, Florida Rep. Maxwell Frost, New York Rep. Alexandria Ocasio-Cortez and Vermont Sen. Bernie Sanders.\n\n“I am not here tonight to offer all the answers. But I am here to say this: You are not alone, and we are all in this together,” Harris said. “And straight talk: Things are probably going to get worse before they get better,” she said. “But we are ready for it. We are not going to scatter. We are going to stand together, everyone a leader.”\n\nReturning to the public eye\n\nFor Harris, the speech was part of a slow return to the public eye after leaving office in January.\n\nThe former vice president is slated to do a fundraiser for the Democratic National Committee in New York City on Tuesday, per a source who received an invitation. In recent months, Harris has also been regularly soliciting funds for the committee using the extensive email list she helped develop during the 2024 campaign.\n\nEarlier this month, Harris began ramping up her public criticism of her former rival, appearing at the Leading Women Defined Summit, also in California, to share her misgivings about the course of events since Trump’s inauguration. “There were many things we knew would happen,” Harris said in a video of her remarks. “I’m not here to say I told you so,” she added before laughing.\n\nHarris’ speech Wednesday included sober warnings about the potential for a “constitutional crisis” as she suggested that checks and balances within the government had begun to “buckle” amid the administration’s clashes with the courts.\n\n“We are living in a moment where the checks and balances on which we have historically relied have begun to buckle,” Harris. “And we here know that when the checks and balances ultimately collapse, if Congress fails to do its part, or if the courts fail to do their part, or if both do their part but the president defies them anyway – well friends that is called a constitutional crisis. And that is a crisis that will eventually impact everyone.”\n\nShe added, “The one check, the one balance, the one power that must not fail is the voice of the people.”\n\nFrom immigration fights to defending President Trump’s federal government cutbacks, the Justice Department has responded to more than a hundred emergency lawsuits in the first hundred days, in some case clashing publicly with judges as the administration lays out an expansive view of executive authority.\n\nHarris’ condemnation of the administration Wednesday – her most direct comments this year – adds to an increasingly crowded Democratic chorus. Several other prominent party members have been active during Harris’ quiet period, taking advantage of the leadership vacuum to elevate their national profiles, some with an eye toward 2028.\n\nSen. Bernie Sanders has been touring the country with Rep. Alexandria Ocasio-Cortez in an attempt to galvanize the party’s progressive base around fighting “oligarchy”; California Gov. Gavin Newsom has sparred with far-right leaders on his new podcast in an effort to broaden Democratic messaging; and Illinois Gov. JB Pritzker traveled to the early-voting state of New Hampshire and accused parts of his own party of “simpering timidity” in the face of Trump’s sweeping early actions.\n\nMeanwhile, Harris’ running mate, Minnesota Gov. Tim Walz, has been publicly reflecting on lessons learned from the ticket’s loss last year. And Walz also spoke to the delicate balance of setting the stage for the 2028 presidential race during an appearance earlier this week at Harvard University.\n\n“If people think you’re hungry for the office rather than the moment that we’re in and the fighting of this, I think they’re going to bury you. I think people are like, not very patient right now for the politics as usual,” Walz said.\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Time Warner Company. All rights reserved.","summary":"(CNN) —&#160;Former Vice President Kamala Harris rebuked President Donald Trump in her first major speech since leaving office, accusing her former rival of setting off...","url":"https://wsvn.com/news/politics/harris-accuses-trump-of-abandoning-american-ideals-in-first-major-speech-since-leaving-office/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/05/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbWE0c29pcmgwMDBxMjducGI2ZGo5b29q-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtYTRzb2lyaDAwMHYyN25wMTVrMWJiZGM.jpg?quality=60&strip=color","video":null,"publish_date":"2025-05-01 15:34:43","author":"Tynisa Senior","authors":["Tynisa Senior"],"language":"en","category":"politics","source_country":"us","sentiment":-0.155},{"id":316830986,"title":"Harris accuses Trump of abandoning American ideals","text":"By David Wright and Eric Bradner, CNN\n\n(CNN) — Former Vice President Kamala Harris rebuked President Donald Trump in her first major speech since leaving office, accusing her former rival of setting off the “greatest man-made economic crisis” in modern history through his across-the-board tariffs, and warning that his conflicts with the courts were moving the nation toward a constitutional crisis.\n\nHarris spoke Wednesday evening at the Emerge Gala in San Francisco, benefitting an organization that supports women interested in entering politics. The 2024 Democratic presidential nominee marked the first 100 days of the second Trump administration during her address, saying that “instead of an administration working to advance America’s highest ideals, we are witnessing the wholesale abandonment of those ideals.”\n\n“And what we are also seeing in these last 14 weeks is Americans using their voice and showing their courage,” Harris added.\n\nThe former vice president delivered a series of attacks on the administration, blaming Trump for the economic turbulence caused by the tariffs he has imposed on goods imported from major trading partners.\n\nHarris called Trump’s tariffs “reckless” and said, “as I predicted,” they are “clearly inviting a recession.”\n\nTrump has said the across-the-board tariffs are meant to correct a trade imbalance with other countries and restore US manufacturing jobs. However, the administration’s policy changes have rocked global markets and added to mounting economic pressure on the US economy. Official data released Wednesday showed the economy contracted in the first quarter by 0.3%.\n\nHarris told Democrats there is a method behind the break-neck pace of policy rollouts of the Trump administration, calling the president a “vessel” of a much larger conservative project.\n\n“Friends, please, let us not be duped into thinking everything is chaos. I know it may feel that way, but understand, what we are in fact witnessing is a high velocity event where a vessel is being used for the swift implementation of an agenda that has been decades in the making,” the former vice president said.\n\nThe path forward for Harris and the Democratic Party\n\nHarris’ speech on Wednesday comes at an inflection point for the 2024 Democratic presidential nominee, with weighty questions about both her own path forward and that of her party.\n\nIn the wake of last year’s loss, Harris and her team began debating her next steps, considering another run for president in 2028, or a return to her home state for a 2026 gubernatorial run. Notably, Harris’ public address on Wednesday took place in California. “It’s wonderful to be home,” Harris said during her speech.\n\nHarris’ advisors believe that getting into the governor’s race would require making her intentions clear at the latest by the summer of 2025, but she faces some pressure to make a decision soon – that contest is heating up, with Democratic former Rep. Katie Porter, Lt. Gov. Eleni Kounalakis, and several other prominent contenders having already launched campaigns.\n\nWhether she enters the California race as a heavy favorite, or holds out for the 2028 presidential primary, a less certain proposition, Harris’ remarks Wednesday also reflect a deliberate reemergence, months after her defeat, as Democrats look for leadership amid the turbulence of the new Trump administration.\n\nAs she lambasted the Trump administration Wednesday night for attempting to “divide and conquer,” Harris urged Democrats to stay together.\n\n“I am not here tonight to offer all the answers. But I am here to say this: You are not alone, and we are all in this together,” Harris said. “And straight talk: Things are probably going to get worse before they get better,” she said. “But we are ready for it. We are not going to scatter. We are going to stand together, everyone a leader.”\n\nReturning to the public eye\n\nFor Harris, the speech was part of a slow return to the public eye after leaving office in January.\n\nThe former vice president is slated to do a fundraiser for the Democratic National Committee in New York City on Tuesday, per a source who received an invitation. In recent months, Harris has also been regularly soliciting funds for the committee using the extensive email list she helped develop during the 2024 campaign.\n\nEarlier this month, Harris began ramping up her public criticism of her former rival, appearing at the Leading Women Defined Summit, also in California, to share her misgivings about the course of events since Trump’s inauguration. “There were many things we knew would happen,” Harris said in a video of her remarks. “I’m not here to say I told you so,” she added before laughing.\n\nHarris’ speech Wednesday included sober warnings about the potential for a “constitutional crisis” as she suggested that checks and balances within the government had begun to “buckle” amid the administration’s clashes with the courts.\n\nShe added, “The one check, the one balance, the one power that must not fail is the voice of the people.”\n\nFrom immigration fights to defending President Trump’s federal government cutbacks, the Justice Department has responded to more than a hundred emergency lawsuits in the first hundred days, in some case clashing publicly with judges as the administration lays out an expansive view of executive authority.\n\nHarris’ condemnation of the administration Wednesday – her most direct comments this year – adds to an increasingly crowded Democratic chorus. Several other prominent party members have been active during Harris’ quiet period, taking advantage of the leadership vacuum to elevate their national profiles, some with an eye toward 2028.\n\nSen. Bernie Sanders has been touring the country with Rep. Alexandria Ocasio-Cortez in an attempt to galvanize the party’s progressive base around fighting “oligarchy”; California Gov. Gavin Newsom has sparred with far-right leaders on his new podcast in an effort to broaden Democratic messaging; and Illinois Gov. JB Pritzker traveled to the early-voting state of New Hampshire and accused parts of his own party of “simpering timidity” in the face of Trump’s sweeping early actions.\n\nMeanwhile, Harris’ running mate, Minnesota Gov. Tim Walz, has been publicly reflecting on lessons learned from the ticket’s loss last year. And Walz also spoke to the delicate balance of setting the stage for the 2028 presidential race during an appearance earlier this week at Harvard University.\n\n“If people think you’re hungry for the office rather than the moment that we’re in and the fighting of this, I think they’re going to bury you. I think people are like, not very patient right now for the politics as usual,” Walz said.\n\nCNN’s Arlette Saenz and Edward-Isaac Dovere contributed to this report.\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.\n\nAbout The Author","summary":"May 1, 2025","url":"https://www.cbc.bb/news/international-news/harris-accuses-trump-of-abandoning-american-ideals/","image":"https://www.cbc.bb/wp-content/uploads/2025/05/Kamala-Harris-2025-April-Pool-via-CNN-Newsource-.jpg","video":null,"publish_date":"2025-05-01 15:31:20","author":"admin,David Wright","authors":["admin","David Wright"],"language":"en","category":"politics","source_country":"bb","sentiment":-0.104}]}