{"offset":0,"number":50,"available":635,"news":[{"id":400502058,"title":"Washington Post publisher Will Lewis says he&#8217;s stepping down, days after big layoffs at paper ","text":"Washington Post publisher Will Lewis said Saturday that he's stepping down, three days after the troubled newspaper said that it was laying off one-third of its staff. Lewis sent an email to the Post's staff, saying that \"difficult decisions have been taken in order to ensure the sustainable future of The Post.\" Lewis and the newspaper's billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs this week.The Post's chief financial officer, Jeff D'Onofrio, was named acting publisher and CEO. He joined the newspaper only last June.The British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee. The Post also lost tens of thousand of subscribers following Bezos' order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction. While anticipated, this past week's layoffs were deeper than anticipated, resulting in the shutting down of the Post's renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.","url":"https://indianexpress.com/article/world/us-news/washington-post-publisher-will-lewis-says-hes-stepping-down-days-after-big-layoffs-at-paper-10520072/","image":"https://images.indianexpress.com/2026/02/US-1-12.jpg","video":null,"publish_date":"2026-02-08 01:40:13","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.155},{"id":400500830,"title":"Washington Post CEO Will Lewis out after sweeping job cuts","text":"The Washington Post said on Saturday (February 7, 2026) its CEO and publisher, Will Lewis, was leaving effective immediately, just days after the storied newspaper owned by billionaire Amazon founder Jeff Bezos made drastic job cuts that angered readers.\n\nThough newspapers across the United States have been facing brutal industry headwinds, Mr. Lewis’s management of the outlet was sharply criticised by subscribers and employees alike during his two-year tenure as he tried to reverse financial losses at the daily.\n\nMr Lewis, who is English, has been replaced by Jeff D’Onofrio, a former CEO of the social media platform Tumblr, who joined the Post as chief financial officer last year, the paper announced.\n\nIn an email to staff shared on social media by one of the newspaper’s reporters, Mr. Lewis said it was “the right time for me to step aside.”\n\nA statement from the Post said only that Mr. D’Onofrio was succeeding Mr. Lewis “effective immediately.”\n\nHundreds of Post journalists — including most of its overseas, local and sports staff — were let go in the sweeping cuts announced on Tuesday (February 3, 2026).\n\nThe Post did not disclose the number of jobs being eliminated, but The New York Times reported that approximately 300 of its 800 journalists were laid off.\n\nThe paper’s entire Middle East roster was let go as was its Kyiv-based Ukraine correspondent as the war with Russia grinds on.\n\nSports, graphics and local news departments were sharply scaled back and the paper’s daily podcast, Post Reports, was suspended, local media reported.\n\nHundreds turned out on Thursday (February 5, 2026) at a protest in front of the paper’s headquarters in downtown Washington.\n\nEditorial interference\n\nNewspapers across the country have cratered under falling revenues and subscriptions as they compete for eyeballs with social media, and as internet revenue pales in comparison to what print advertising once commanded.\n\nHowever, national papers like The New York Times and The Wall Street Journal have managed to weather the storm and come out financially solid — something the Post, even with a billionaire backer, has failed to do.\n\nIn Mr. Lewis’s note to staff, shared on X by White House bureau chief Matt Viser, Mr. Lewis said “difficult decisions have been taken” during his tenure “in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news.”\n\nMr. Bezos, one of the world’s richest people, and Mr. Lewis have come under scrutiny for intervening directly in the paper’s editorial processes.\n\nMr. Bezos reined in the newspaper’s liberal-leaning editorial page and blocked an endorsement of Democratic presidential candidate Kamala Harris days before the 2024 election — breaking the so-called firewall of editorial independence.\n\nHe was widely seen as bowing to Mr. Trump.\n\nThe Wall Street Journal reported last month that 250,000 digital subscribers left the Post after it refrained from endorsing Ms. Harris, and the paper lost around $100 million in 2024 as advertising and subscription revenues fell.\n\nMarty Baron, the Post’s executive editor until 2021, said that the job cuts ranked “among the darkest days in the history of one of the world’s greatest news organisations.”","url":"https://www.thehindu.com/news/international/washington-post-ceo-will-lewis-out-after-sweeping-job-cuts/article70606423.ece","image":"https://th-i.thgim.com/public/incoming/dttj72/article70606419.ece/alternates/LANDSCAPE_1200/Media_Washington_Post_51453.jpg","video":null,"publish_date":"2026-02-08 01:33:25","author":"Jeff D","authors":["Jeff D"],"language":"en","category":"politics","source_country":"in","sentiment":-0.022},{"id":400501678,"title":"Washington Post publisher Will Lewis says he’s stepping down, days after big layoffs at the paper","text":"By David Bauder | Associated Press\n\nWashington Post publisher Will Lewis said Saturday that he’s stepping down, ending a troubled tenure three days after the newspaper said that it was laying off one-third of its staff.\n\nLewis announced his departure in a two-paragraph email to the newspaper’s staff, saying that after two years of transformation, “now is the right time for me to step aside.” The Post’s chief financial officer, Jeff D’Onofrio, was appointed temporary publisher.\n\nNeither Lewis nor the newspaper’s billionaire owner Jeff Bezos participated in the meeting with staff members announcing the layoffs on Wednesday. While anticipated, the cutbacks were deeper than expected, resulting in the shutdown of the Post’s renowned sports section, the elimination of its photography staff and sharp reductions in personnel responsible for coverage of metropolitan Washington and overseas.\n\nThey came on top of widespread talent defections in recent years at the newspaper, which lost tens of thousands of subscribers following Bezos’ order late in the 2024 presidential campaign pulling back from a planned endorsement of Kamala Harris, and a subsequent reorienting of its opinion section in a more conservative direction.\n\nMartin Baron, the Post’s first editor under Bezos, condemned his former boss this week for attempting to curry favor with President Donald Trump and called what has happened at the newspaper “a case study in near-instant, self-inflicted brand destruction.”\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganization plan that led to the departure of former top editor Sally Buzbee.\n\nHis initial choice to take over for Buzbee, Robert Winnett, withdrew from the job after ethical questions were raised about both he and Lewis’ actions while working in England. They including paying for information that produced major stories, actions that would be considered unethical in American journalism. The current executive editor, Matt Murray, took over shortly thereafter.\n\nLewis didn’t endear himself to Washington Post journalists with blunt talk about their work, at one point saying in a staff meeting that they needed to make changes because not enough people were reading their work.\n\nThis week’s layoffs have led to some calls for Bezos to either increase his investment in The Post or sell it to someone who will take a more active role. Lewis, in his note, praised Bezos: “The institution could not have had a better owner,” he said.\n\n“During my tenure, difficult decisions have been taken in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news to millions of customer each day,” Lewis said.\n\nD’Onofrio, who joined the paper last June after serving as the financial chief for the digital ad management company Raptive, said in a note to staff that “we are ending a hard week of change with more change.\n\n“This is a challenging time across all media organizations, and The Post is unfortunately no exception,” he wrote. “I’ve had the privilege of helping chart the course of disrupters and cultural stalwarts alike. All faced economic headwinds in changing industry landscapes, and we rose to meet those moments. I have no doubt we will do just that, together.”\n\nDavid Bauder writes about the intersection of media and entertainment for the AP. Follow him at http://x.com/dbauder and https://bsky.app/profile/dbauder.bsky.social.","summary":"The Post’s chief financial officer, Jeff D’Onofrio, was appointed temporary publisher.","url":"https://www.mercurynews.com/2026/02/07/washington-post-publisher-will-lewis-says-hes-stepping-down-days-after-big-layoffs-at-the-paper/","image":"https://www.mercurynews.com/wp-content/uploads/2026/02/APTOPIX_Washington_Post_41225-2.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2026-02-08 01:13:56","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.312},{"id":400498584,"title":"Washington Post CEO And Publisher Quits As Newspaper Implodes In Epic Chaos","text":"How the mighty have fallen.\n\nIn a \"poetic ending\" plot twist, that even jaded conspiracy theorists would have had trouble scripting, Washington Post CEO and publisher Will Lewis has abruptly and unexpectedly stepped down from his perch atop Jeff Bezos's crumbling media empire. Well, maybe not that unexpectedly...\n\nThat's right, the same WaPo that spent years hurling \"fake news\" grenades at us here at ZeroHedge, trying to get us deplatformed, demonetized, and disappeared from the internet, is now eating crow as their own house of CIA-funded cards collapses. Yes, this is our unapologetic victory lap – we've outlasted another establishment hack, which earlier this week saw an in house \"Red Wedding\" where hundreds of CIA conduits \"reporters\" were fired... and it feels good.\n\nLewis's exit was announced late on Saturday around 6pm ET, just days after he orchestrated a bloodbath of layoffs that axed a whopping 30% of the staff – over 300 journalists sent packing in what can only be described as a desperation move to staunch the bleeding from years of financial hemorrhaging and dwindling readership.\n\nLewis, ever the gracious Brit, framed his departure as a noble sacrifice \"in order to ensure the sustainable future of The Post.\" Sure, Will – because nothing says \"sustainable future\" like firing a third of your workforce and then bailing before the pitchforks come out. Also the news that he was at the Super Bowl after the biggest mass termination in WaPo history probably didn't help.\n\nWill Lewis has gone to Super Bowl every year since joining Washington Post… which is not a great excuse for missing a Zoom call. https://t.co/TMFJY1GrST\n— Dylan Byers (@DylanByers) February 6, 2026\n\nMeanwhile, as Semafor notes, the real reason for Lewis' departure is the he presided over two major errors, one his, and the other that of his boss, Jeff Bezos who clearly has grown bored with his vanity media project. \n\nFirst, Lewis blocked the Post reporting on his role in the UK phone hacking scandal, preventing the publication of a story few would have read anyway. Then, Bezos pulled a planned endorsement of Vice President Kamala Harris at the 11th hour, for apparent fear of offending Donald Trump. That endorsement wouldn’t have made much of a difference politically, but hundreds of thousands of subscribers canceled over what they saw as a craven capitulation.\n\n.@maxwelltani on the Post's lost years, and strategic void pic.twitter.com/wc8OEdD8AM\n— Ben Smith (@semaforben) February 8, 2026\n\nLet's rewind a bit on Lewis' illustrious - if catastrophically short - tenure. Handpicked by billionaire overlord Jeff Bezos - whose Amazon tried three times to demonetize ZeroHedge not once, not twice, but three times (and only thanks to the FCC intervening do we have any Amazon ads showing) - at the start of 2024, Lewis was supposed to be the savior who would \"transform\" the once-venerable rag and reverse its slide into irrelevance.\n\nInstead, he presided over a dumpster fire of epic proportions, culminating in this latest round of pink slips that left the newsroom in shambles. Former editor Marty Baron, the guy who once helmed the paper during its Watergate glory days or whatever passes for glory in legacy media these days, didn't mince words: he called it one of the “darkest days in the history of one of the world’s greatest news organizations.”\n\nOuch. And Katie Mettler, ex-chair of the WaPo guild, piled on with a zinger: “I’m glad Will Lewis has been fired. I wish it had happened before he fired all my friends.” Tell us how you really feel, Katie.\n\nCutting through the shades of gray, we were more laconic: WaPo is finished. \n\nIn the interim, the keys to the kingdom go to some dude named Jeff D’Onofrio - the former CFO who' nobody had ever heard of until now, and who is stepping up as the placeholder boss.\n\nGood luck, Jeff – you'll need it. With readership tanking, ad revenue in freefall, and trust in mainstream media at all-time lows, the WaPo's \"sustainable future\" looks about as promising as a subprime mortgage in 2008.\n\nBut let's not forget the delicious irony here. This is the same Washington Post that has repeatedly tried to kneecap ZeroHedge, labeling us as purveyors of \"disinformation\" and cozying up to Big Tech censors - such as Amazon and Google - in a bid to silence dissenting voices. \n\nRemember when they accused us of being Russian bots or spies, or whatever flavor-of-the-month smear was trending? That aged like milk. And while the CIA's favorite (well, ) mouthpiece was busy playing hall monitor for the establishment narrative, we've been here, grinding away, delivering truth that their advertisers wouldn't touch with a ten-foot pole. And guess what? We're still standing, stronger than ever, with record subscribers and 100 million page views per month, while their imported CEO packs his bags and slinks back across the pond.\n\nIs there a Polymarket, we wonder, on when ZeroHedge will surpass WaPo in readership. \n\nBut we digress: Karma, folks, is real, and it's spectacular. And as WaPo licks its wounds and hunts for yet another white knight to bail them out (or maybe they'll go for a black knight this time, after all the whole equity thing), we'll be over here popping the champagne. After all, in the cutthroat world of media, survival isn't about being \"respectable\"; it's about being right. And on that front, ZeroHedge wins again.\n\nIn the end, Democracy may well die in darkness, but WaPo's time of death was 6pm on February 7, 2026.","url":"https://www.zerohedge.com/political/washington-post-ceo-and-publisher-quits-newspaper-implodes-epic-chaos","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2026-02/red%20wedding.jpg?itok=oBnBFiQN","video":null,"publish_date":"2026-02-08 00:46:28","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.692},{"id":400496990,"title":"Washington Post CEO out after sweeping job cuts","text":"WASHINGTON, D.C. — The Washington Post said Saturday its CEO and publisher Will Lewis was leaving effective immediately, just days after the storied newspaper owned by billionaire Amazon founder Jeff Bezos made drastic job cuts that angered readers.Though newspapers across the United States have been facing brutal industry headwinds, Lewis's management of the outlet was sharply criticized by subscribers and employees alike during his two-year tenure as he tried to reverse financial losses at the daily.Lewis, who is English, has been replaced by Jeff D'Onofrio, a former CEO of social media platform Tumblr who had joined the Post as chief financial officer last year, the paper announced.In an email to staff shared on social media by one of the newspaper's reporters, Lewis said it was 'the right time for me to step aside.'A statement from the Post said only that D'Onofrio was succeeding Lewis 'effective immediately.'Hundreds of Post journalists -- including most of its overseas, local and sports staff -- were let go in the sweeping cuts announced on Tuesday.The Post did not disclose the number of jobs being eliminated, but The New York Times reported approximately 300 of its 800 journalists were laid off.The paper's entire Middle East roster was let go as was its Kyiv-based Ukraine correspondent as the war with Russia grinds on.Sports, graphics and local news departments were sharply scaled back and the paper's daily podcast, Post Reports, was suspended, local media reported.Hundreds turned out Thursday at a protest in front of the paper's headquarters in downtown Washington.Editorial interference Newspapers across the country have cratered under falling revenues and subscriptions as they compete for eyeballs with social media, and as internet revenue pales in comparison to what print advertising once commanded.However, national papers like The New York Times and The Wall Street Journal have managed to weather the storm and come out financially solid -- something the Post, even with a billionaire backer, has failed to do.In Lewis's note to staff, shared on X by White House bureau chief Matt Viser, Lewis said 'difficult decisions have been taken' during his tenure 'in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news.'Bezos, one of the world's richest people, and Lewis have come under scrutiny for intervening directly in the paper's editorial processes.Bezos reined in the newspaper's liberal-leaning editorial page and blocked an endorsement of Democratic presidential candidate Kamala Harris days before the 2024 election -- breaking the so-called firewall of editorial independence.He was widely seen as bowing to Trump.The Wall Street Journal reported last month that 250,000 digital subscribers left the Post after it refrained from endorsing Harris, and the paper lost around $100 million in 2024 as advertising and subscription revenues fell.Marty Baron, the Post’s executive editor until 2021, said that the job cuts ranked 'among the darkest days in the history of one of the world's greatest news organizations.","url":"https://www.manilatimes.net/2026/02/08/world/americas-emea/washington-post-ceo-out-after-sweeping-job-cuts/2273816","image":"https://www.manilatimes.net/manilatimes/uploads/images/2026/02/08/929255.jpg","video":null,"publish_date":"2026-02-08 00:39:00","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"ph","sentiment":-0.061},{"id":400497340,"title":"Washington Post CEO Will Lewis exits after mass layoffs spark outrage","text":"APFILE - Will Lewis, publisher and CEO of The Washington Post, poses for a portrait in Washington, Sunday, Nov. 5, 2023.\n\nThe Washington Post said Saturday its CEO and publisher Will Lewis was leaving effective immediately, just days after the storied newspaper owned by billionaire Amazon founder Jeff Bezos made drastic job cuts that angered readers.Though newspapers across the United States have been facing brutal industry headwinds, Lewis's management of the outlet was sharply criticized by subscribers and employees alike during his two-year tenure as he tried to reverse financial losses at the daily.Lewis, who is English, has been replaced by Jeff D'Onofrio, a former CEO of social media platform Tumblr who had joined the Post as chief financial officer last year, the paper announced.In an email to staff shared on social media by one of the newspaper's reporters, Lewis said it was \"the right time for me to step aside.\" A statement from the Post said only that D'Onofrio was succeeding Lewis \"effective immediately.\"Live EventsHundreds of Post journalists -- including most of its overseas, local and sports staff -- were let go in the sweeping cuts announced on Tuesday.The Post did not disclose the number of jobs being eliminated, but The New York Times reported approximately 300 of its 800 journalists were laid off.The paper's entire Middle East roster was let go as was its Kyiv-based Ukraine correspondent as the war with Russia grinds on. Sports, graphics and local news departments were sharply scaled back and the paper's daily podcast, Post Reports, was suspended, local media reported.Hundreds turned out Thursday at a protest in front of the paper's headquarters in downtown Washington.Editorial interference Newspapers across the country have cratered under falling revenues and subscriptions as they compete for eyeballs with social media, and as internet revenue pales in comparison to what print advertising once commanded.However, national papers like The New York Times and The Wall Street Journal have managed to weather the storm and come out financially solid -- something the Post, even with a billionaire backer, has failed to do.In Lewis's note to staff, shared on X by White House bureau chief Matt Viser, Lewis said \"difficult decisions have been taken\" during his tenure \"in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news.\"Bezos, one of the world's richest people, and Lewis have come under scrutiny for intervening directly in the paper's editorial processes.Bezos reined in the newspaper's liberal-leaning editorial page and blocked an endorsement of Democratic presidential candidate Kamala Harris days before the 2024 election -- breaking the so-called firewall of editorial independence. He was widely seen as bowing to Trump.The Wall Street Journal reported last month that 250,000 digital subscribers left the Post after it refrained from endorsing Harris, and the paper lost around $100 million in 2024 as advertising and subscription revenues fell.Marty Baron, the Post's executive editor until 2021, said that the job cuts ranked \"among the darkest days in the history of one of the world's greatest news organizations.\"Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onWashington Post CEO resignationWill Lewis job cutsWashington Post layoffs 2026Jeff D'Onofrio new CEOnews organization job cutsProtests against job cuts Washington Postimpact of digital subscriptions on newspaperseditorial independence Washington Postfinancial struggles of newspapersBezos and Washington Post\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onWashington Post CEO resignationWill Lewis job cutsWashington Post layoffs 2026Jeff D'Onofrio new CEOnews organization job cutsProtests against job cuts Washington Postimpact of digital subscriptions on newspaperseditorial independence Washington Postfinancial struggles of newspapersBezos and Washington Post","summary":"The Washington Post said Saturday its CEO and publisher Will Lewis was leaving effective immediately, just days after the storied newspaper owned by billionaire Amazon founder Jeff Bezos made drastic job cuts that angered readers. A statement from the Post said only that D'Onofrio was succeeding Lewis \"effective immediately.\"","url":"https://economictimes.indiatimes.com/news/international/business/washington-post-ceo-will-lewis-exits-after-mass-layoffs-spark-outrage/articleshow/128053924.cms","image":"https://img.etimg.com/thumb/msid-128053962,width-1200,height-630,imgsize-106952,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2026-02-08 00:35:11","author":"Swashington Post Ceo","authors":["Swashington Post Ceo"],"language":"en","source_country":"in","sentiment":-0.019},{"id":400490500,"title":"Publisher Will Lewis to step down days after Washington Post big layoffs","text":"Washington Post publisher Will Lewis said Saturday that he’s stepping down, three days after the troubled newspaper said that it was laying off one-third of its staff.Lewis sent an email to the Post’s staff, saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post.” Lewis and the newspaper’s billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs this week.The Post’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. He joined the newspaper only last June.The British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganization plan that led to the departure of former top editor Sally Buzbee..preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}The Post also lost tens of thousand of subscribers following Bezos’ order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.While anticipated, this past week’s layoffs were deeper than anticipated, resulting in the shutting down of the Post’s renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.- EndsPublished By: Nitish SinghPublished On: Feb 8, 2026Tune InMust Watch","url":"https://www.indiatoday.in/world/story/publisher-will-lewis-to-step-down-days-after-washington-post-big-layoffs-2864841-2026-02-08","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/file---will-lewis--publisher-and-ceo-of-the-washington-post--poses-for-a-portrait-in-washington--sun-081907977-16x9_0.jpg?VersionId=WItqsmiqVVoCBLpwdNKzNWgeI5HWbVNT?size=1280:720","video":null,"publish_date":"2026-02-08 00:22:34","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":-0.164},{"id":400492282,"title":"Trump refuses to apologise for racist clip of Obamas as monkeys","text":"US President Donald Trump refused to apologise on Friday for a video posted on his social media account depicting Barack and Michelle Obama as monkeys, though he said he condemned the post as the White House shifted the blame to staff.\n\nThe video shared on Trump’s Truth Social account late on Thursday night sparked censure across the US political spectrum, with the White House initially rejecting “fake outrage” only to then blame the post on an error by a staff member. “I didn’t make a mistake,” Trump said on Air Force One late on Friday when asked if he would apologise for the post.\n\nAsked if he condemns the racist imagery in the video, Trump replied: “Of course I do.”\n\nDemocrats slammed Trump as “vile” over the clip of the Obamas – the first Black president and first lady in US history while a senior Republican senator said the video was blatantly racist.\n\nNear the end of the one-minute-long video promoting conspiracies about Republican Trump’s 2020 election loss to Joe Biden, the Obamas were shown with their faces on the bodies of monkeys for about one second.\n\nThe video, uploaded late on Thursday amid a flurry of other posts, repeated false allegations that ballot-counting company Dominion Voting Systems helped steal the election from Trump.\n\nWhite House Press Secretary Karoline Leavitt initially played down the row, saying the images were “from an internet meme video depicting President Trump as the king of the jungle and Democrats as characters from The Lion King”.\n\n“Please stop the fake outrage and report on something today that actually matters to the American public,” Leavitt said in a statement to AFP.\n\nBut almost exactly 12 hours after the post appeared on Trump’s account there was an unusual concession from an administration that normally refuses to admit the slightest mistake. “A White House staffer erroneously made the post. It has been taken down,” a White House official told AFP.\n\nSpeaking to reporters on board Air Force One on Friday, Trump stood by the thrust of the video’s claims about election fraud, but said he had not seen the offensive clip.\n\n“I just looked at the first part … and I didn’t see the whole thing,” Trump said, adding that he “gave it” to staffers to post and they also didn’t watch the full video.\n\nThere was no immediate comment from the Obamas.\n\nFormer vice president Kamala Harris, who has long condemned Trump’s divisive racial rhetoric, called out the White House’s backpedalling in a post on X on Friday.\n\n“No one believes this cover up from the White House, especially since they originally defended this post,” she wrote. “We are all clear-eyed about who Donald Trump is and what he believes.”\n\nWhile Democrats pounced on the post, it was the outrage from some members of Trump’s own Republican Party that appeared to trigger the about-face.\n\nTim Scott, the only Black Republican senator and once a contender for the 2024 presidential nomination, called the video “the most racist thing I’ve seen out of this White House.” Scott said he was “praying it was fake” and called for Trump to remove it.\n\nRoger Wicker, another Republican senator, said the post was “totally unacceptable. The president should take it down and apologise.” The top Democrat in the House of Representatives, Hakeem Jeffries, called Trump “vile, unhinged and malignant” and urged Republicans on X to “immediately denounce Donald Trump’s disgusting bigotry”.\n\nTrump launched his own political career by pushing the racist and false “birther” conspiracy theory that Barack Obama was lying about being born in the United States.\n\nTrump has long had a bitter rivalry with his Democratic predecessor, taking particular umbrage at his popularity and the fact that he won the Nobel Peace Prize.\n\nIn his second term in the White House, Trump has used hyper-realistic but fabricated AI visuals on Truth Social and other platforms, often glorifying himself and rallying his conservative base around social issues. During negotiations to avoid a US government shutdown, Trump posted a video of Jeffries, who is Black, wearing a fake mustache and a sombrero. Jeffries called the image racist.\n\nOne AI-generated video showed fighter jets dumping human waste on protesters – which was created by the same X user who made the video showing the Obamas as monkeys. Since returning to the White House, Trump has led a crusade against diversity, equity and inclusion (DEI) programs.\n\nUS federal anti-discrimination programs were born of the 1960s civil rights movement, mainly led by Black Americans, for equality and justice after hundreds of years of slavery.","url":"https://dailytimes.com.pk/1447954/trump-refuses-to-apologise-for-racist-clip-of-obamas-as-monkeys/","image":"https://dailytimes.com.pk/assets/uploads/2025/07/app-icon-192x192-1-192x180-1.png","video":null,"publish_date":"2026-02-08 00:16:50","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.588},{"id":400494000,"title":"Washington Post publisher Will Lewis resigns after big layoffs at paper, writes note to staff: ‘Now is the right time'","text":"Will Lewis announced on Saturday that he's stepping down as the publisher of The Washington Post. The announcement came three days after the newspaper said that it was laying off one-third of its staff.Lewis sent an email to the Post's staff, saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post.”In a message to staff that was shared online by the newspaper's White House bureau chief, Matt Viser, Will Lewis thanked the newspaper's billionaire owner Jeff Bezos and said, \"…now is the right time for me to step aside.Will's message to staff — full textWill wrote, “All - after two years of transformation at The Washington Post, now is the right time for me to step aside. I want to thank Jeff Bezos for his support and leadership throughout my tenure as CEO and Publisher. The institution could not have a better owner.”“During my tenure, difficult decisions have been taken in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news to millions of customers each day,” the note read.Who's The Post's incharge now?The Post's chief financial officer, Jeff D'Onofrio, was named acting publisher and CEO. He joined the newspaper only last June, news agency Associated Press reported.The British-born Will Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee.The Post also lost tens of thousand of subscribers following Bezos' order late in the presidential campaign, pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.While anticipated, this past week's layoffs were deeper than anticipated, resulting in the shutting down of the Post's renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.","url":"https://www.livemint.com/news/us-news/washington-post-publisher-will-lewis-resigns-after-big-layoffs-at-paper-writes-note-to-staff-now-is-the-right-time-11770508876301.html","image":"https://www.livemint.com/lm-img/img/2026/02/08/1600x900/logo/Media-Washington-Post-0_1770509388033_1770509443670.jpg","video":null,"publish_date":"2026-02-08 00:04:51","author":"Akriti Anand","authors":["Akriti Anand"],"language":"en","source_country":"in","sentiment":-0.112},{"id":400491540,"title":"Trump won't apologise for racist clip of Obamas","text":"US President Donald Trump refused to apologise Friday for a video posted on his social media account depicting Barack and Michelle Obama as monkeys, though he said he condemned the post as the White House shifted the blame to staff.The video shared on Trump's Truth Social account Thursday sparked censure across the US political spectrum, with the White House initially rejecting \"fake outrage\" only to then blame the post on an error by a staff member. \"I didn't make a mistake,\" Trump said on Air Force One late Friday when asked if he would apologise for the post. Asked if he condemns the racist imagery in the video, the American president replied: \"Of course I do.\"Democrats slammed Trump as \"vile\" over the clip of the Obamas -- the first Black president and first lady in US history -- while a senior Republican senator said the video was blatantly racist.Near the end of the one-minute-long video promoting conspiracies about Republican Trump's 2020 election loss to Joe Biden, the Obamas were shown with their faces on the bodies of monkeys for about one second.The video, uploaded late Thursday amid a flurry of other posts, repeated false allegations that ballot-counting company Dominion Voting Systems helped steal the election from Trump. White House press secretary Karoline Leavitt initially played down the row, saying that the images were \"from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King.\"\"Please stop the fake outrage and report on something today that actually matters to the American public,\" she said in a statement to AFP.But almost exactly 12 hours after the post appeared on Trump's account there was an unusual concession from an administration that normally refuses to admit the slightest mistake. \"A White House staffer erroneously made the post. It has been taken down,\" a White House official said.Speaking on board Air Force One on Friday, Trump stood by the thrust of the video's claims about election fraud, but said he had not seen the offensive clip. \"I just looked at the first part... and I didn't see the whole thing,\" Trump said, adding that he \"gave it\" to staffers to post and they also didn't watch the full video. There was no immediate comment from the Obamas.Former VP Kamala Harris, who has long condemned Trump's divisive racial rhetoric, called out the White House's backpedalling in a post on X on Friday. \"No one believes this cover up from the White House, especially since they originally defended this post,\" she wrote. \"We are all clear-eyed about who Donald Trump is and what he believes.\" While Democrats pounced on the post, it was the outrage from some members of Republican Party that appeared to trigger the about-face. Tim Scott, the only Black Republican senator and once a contender for the 2024 presidential nomination, called the video \"the most racist thing I've seen out of this White House.\"","url":"https://timesofindia.indiatimes.com/world/us/trump-wont-apologise-for-racist-clip-of-obamas/articleshow/128053223.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-128053223/128053223.jpg","video":null,"publish_date":"2026-02-08 00:03:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.586},{"id":400492670,"title":"Washington Post publisher Will Lewis steps down, days after layoffs","text":"Washington Post publisher Will Lewis said Saturday that he’s stepping down, three days after the troubled newspaper said that it was laying off one-third of its staff.\n\nLewis sent an email to the Post’s staff, saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post.” Lewis and the newspaper’s billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs this week.\n\nThe Post’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. He joined the newspaper only last June.\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganization plan that led to the departure of former top editor Sally Buzbee.\n\nThe Post also lost tens of thousand of subscribers following Bezos’ order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.\n\nWhile anticipated, this past week’s layoffs were deeper than anticipated, resulting in the shutting down of the Post’s renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.\n\nBy DAVID BAUDER, The Associated Press","url":"https://www.dallasnews.com/news/national/2026/02/07/washington-post-publisher-will-lewis-stepping-down-days-after-big-layoffs-at-the-paper/","image":"https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/GULLXRC7WRB5HOVUBLOQDEKE74.jpg?auth=b93a9a76ed863c978871a12f7192602945c5f5d1e2c1b772b41046a04a48f489&quality=80&width=1200&height=630&focal=2490,747","video":null,"publish_date":"2026-02-08 00:00:46","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.216},{"id":400502284,"title":"Why Republicans are seething with celebrity envy","text":"Explaining the Right is a weekly series that looks at what the right wing is currently obsessing over, how it influences politics—and why you need to know.\n\nRight-wing advocacy group Turning Point USA on Monday announced the slate of performers who will appear at its “alternative” Super Bowl halftime show. The event is meant to shift attention from Sunday’s official halftime show and its headliner, the pro-immigrant Puerto Rican superstar Bad Bunny, who was Spotify’s top artist of 2025 with 19.8 billion streams.\n\nOn the other side of the field, the so-called All-American Halftime Show’s most well-known performer is Kid Rock, who started out in the early 1990s and hasn’t had a top 10 single in 24 years. The rest of the performers: Brantley Gilbert, Lee Brice, and Gabby Barrett.\n\nFame-obsessed President Donald Trump and his minions have nothing to brag about when it comes to the star power of “celebrities” on the right.\n\nRelated | Former Superman turns into an ICE supervillain\n\nAmong the more notable figures who stand 10 toes down for the GOP: Dean Cain, best known for a few years as Superman on TV, now shilling for ICE; Gina Carano, who was fired by Disney for comparing criticism of conservatives to the Holocaust; and Jon Voight, an award-winning actor who has spent the past couple of decades promoting conspiracy theories and Trump worship.\n\nEvery once in a while, conservatives attract a celebrity who is legitimately, currently famous, like rapper Nicki Minaj. But even then, Minaj’s past support of allegedly abusive men puts her praise of Trump in context.\n\nOverall, conservative celebrity is a usually low-wattage affair—especially in contrast to the actual stars who support the Democratic Party and liberal causes.\n\nBruce Springsteen released a new hit single on Jan. 28 in support of anti-ICE protesters in Minneapolis. Taylor Swift endorsed Kamala Harris in the 2024 presidential election while Trump whined about how much he hates the global pop star. Swift’s fellow singers Beyonce and Lady Gaga appeared at Harris rallies. Oprah Winfrey backed Harris, and even more famously backed former President Barack Obama in 2008.\n\nAnd Obama had the voice of God himself, legendary actor Morgan Freeman, telling America in a campaign ad why the incumbent president should be reelected in 2012.\n\nPerhaps the best example of this dichotomy occurred in 2016, when GOP presidential candidate Trump said the Republican National Convention would be star-studded, but it was the Democratic National Convention with Hillary Clinton that attracted actual celebrities. \n\nTrump had former TV star Antonio Sabato Jr., while Democrats had Meryl Streep, Katy Perry, and Kareem Abdul-Jabbar in attendance, among others.\n\nThe conservative movement has spent decades complaining about Hollywood and celebrities, who they decry for being too left wing and “woke,” especially on social issues. Fox News pundit Tomi Lahren fumed at Grammy attendees and winners on Monday for speaking out about ongoing ICE abuses, insisting that “social justice warrior grandstanding bullshit” is “why no one watches this trash anymore.”\n\nBut actor Don Cheadle got to the heart of the matter in his response to Lahren, writing, “But if ‘no one watches’ then how did you…”\n\nThe creative community naturally supports the arts while conservatives attack them. Diversity is key to the creation of film, music, television, the visual arts and more—so by nature, creative people support racial and gender diversity. The right does not.\n\nRelated | Kennedy Center crumbles under Trump\n\nThe right wants to be in the “cool” creative club while attacking the very things it stands for. Winning an election has never made creatives fundamentally change who they are and what they believe in, and art is inherently political.\n\nConservatives are envious of liberalism’s broad appeal and star power, and that is why they attack. They want to emulate the left’s appeal to well-known people, but there just aren’t enough bigoted celebrities to go around.\n\nThat’s how you end up with a store-brand Super Bowl halftime show featuring washed-up Kid Rock and a bunch of people nobody has ever heard of","summary":"Explaining the Right is a weekly series that looks at what the right wing is currently obsessing over, how it influences politics—and why you need to know.\n\n\n\n\nRight-wing advocacy group Turning Point USA on Monday announced the slate of performers who will appear at its “alternative” Super Bowl halftime show. The event is meant to shift attention from Sunday’s official halftime show and its headliner, the pro-immigrant Puerto Rican superstar Bad Bunny, who was Spotify’s top artist of 2025 with 19.8 billion streams.\n\n\n\nOn the other side of the field, the so-called All-American Halftime Show’s most well-known performer is Kid Rock, who started out in the early 1990s and hasn’t had a top 10 single in 24 years. The rest of the performers: Brantley Gilbert, Lee Brice, and Gabby Barrett.\n\n\n\nWho?\n\n\n\nFame-obsessed President Donald Trump and his minions have nothing to brag about when it comes to the star power of “celebrities” on the right.\n\n\n\n\nRelated | Former Superman turns into an ICE supervillain\n\n\n\n\nAmong the mo","url":"https://www.dailykos.com/story/2026/2/7/2367373/-Why-Republicans-are-seething-with-celebrity-envy?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1524835/story_image/ETR11.png?1770426748","video":null,"publish_date":"2026-02-08 00:00:09","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":0.055},{"id":400492862,"title":"Washington Post CEO out after sweeping job cuts","text":"The Washington Post said Saturday its CEO and publisher Will Lewis was leaving effective immediately, just days after the storied newspaper owned by billionaire Amazon founder Jeff Bezos made drastic job cuts that angered readers. Though newspapers across the United States have been facing brutal industry headwinds, Lewis's management of the outlet was sharply criticized by subscribers and employees alike during his two-year tenure as he tried to reverse financial losses at the daily. Lewis, who is English, has been replaced by Jeff D'Onofrio, a former CEO of social media platform Tumblr who had joined the Post as chief financial officer last year, the paper announced. In an email to staff shared on social media by one of the newspaper's reporters, Lewis said it was \"the right time for me to step aside.\" A statement from the Post said only that D'Onofrio was succeeding Lewis \"effective immediately.\" Hundreds of Post journalists -- including most of its overseas, local and sports staff -- were let go in the sweeping cuts announced on Tuesday. The Post did not disclose the number of jobs being eliminated, but The New York Times reported approximately 300 of its 800 journalists were laid off. The paper's entire Middle East roster was let go as was its Kyiv-based Ukraine correspondent as the war with Russia grinds on. Sports, graphics and local news departments were sharply scaled back and the paper's daily podcast, Post Reports, was suspended, local media reported. Hundreds turned out Thursday at a protest in front of the paper's headquarters in downtown Washington. - Editorial interference - Washington Post employees and supporters have expressed outrage over what they say is the gutting of a media institution (768x512, AR: 1.50)Newspapers across the country have cratered under falling revenues and subscriptions as they compete for eyeballs with social media, and as internet revenue pales in comparison to what print advertising once commanded. However, national papers like The New York Times and The Wall Street Journal have managed to weather the storm and come out financially solid -- something the Post, even with a billionaire backer, has failed to do. In Lewis's note to staff, shared on X by White House bureau chief Matt Viser, Lewis said \"difficult decisions have been taken\" during his tenure \"in order to ensure the sustainable future of The Post so it can for many years ahead publish high-quality nonpartisan news.\" Bezos, one of the world's richest people, and Lewis have come under scrutiny for intervening directly in the paper's editorial processes. Bezos reined in the newspaper's liberal-leaning editorial page and blocked an endorsement of Democratic presidential candidate Kamala Harris days before the 2024 election -- breaking the so-called firewall of editorial independence. He was widely seen as bowing to Trump. The Wall Street Journal reported last month that 250,000 digital subscribers left the Post after it refrained from endorsing Harris, and the paper lost around $100 million in 2024 as advertising and subscription revenues fell. Marty Baron, the Post’s executive editor until 2021, said that the job cuts ranked \"among the darkest days in the history of one of the world's greatest news organizations.\" nro/sst","url":"https://today.rtl.lu/news/world/washington-post-ceo-out-after-sweeping-job-cuts-456662562","image":"https://static-prod.rtl.lu/dims4/default/07f8e26/2147483647/strip/false/crop/768x512+0+0/resize/768x512!/quality/90/?url=https%3A%2F%2Frtl-luxembourg-new-production-web.s3.eu-central-1.amazonaws.com%2Fbrightspot%2F58%2F9a%2Ff562d5120781f2aab595d8429c3d%2F","video":null,"publish_date":"2026-02-07 23:58:22","author":null,"language":"en","category":"politics","source_country":"lu","sentiment":-0.05},{"id":400491754,"title":"Washington Post CEO steps down amid outcry over massive job cuts","text":"Washington Post publisher and CEO Will Lewis said on Saturday that he was stepping down, three days after the troubled newspaper said that it was laying off a third of its staff.\nLewis sent an email to staff at The Washington Post’s staff saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post”.\nLewis and the newspaper’s billionaire owner Jeff Bezos did not take part in a meeting with staff announcing the lay-offs this week.\nThe paper’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. He joined The Washington Post only last June.\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Washington Post in January 2024.\nHis tenure has been rocky from the start, marked by lay-offs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee.\nThe Washington Post also lost tens of thousands of subscribers following Bezos’ order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.\nWhile anticipated, this past week’s lay-offs were deeper than expected, resulting in the shutting down of the paper’s renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.","summary":"Washington Post publisher and CEO Will Lewis said on Saturday that he was stepping down, three days after the troubled newspaper said that it was laying off a third of its staff.\nLewis sent an email to staff at The Washington Post’s staff saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post”.\nLewis and the newspaper’s billionaire owner Jeff Bezos did not take part in a meeting with staff announcing the lay-offs this week.\nThe paper’s chief...","url":"https://www.scmp.com/news/world/united-states-canada/article/3342792/washington-post-ceo-steps-down-amid-outcry-over-massive-job-cuts","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/02/08/1ad2a97f-fe4f-4c63-9ad0-0b74ae3f4b26_68294aa7.jpg","video":null,"publish_date":"2026-02-07 23:56:41","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"cn","sentiment":-0.227},{"id":400489558,"title":"Washington Post CEO steps down amid outcry over massive job cuts","text":"Washington Post publisher and CEO Will Lewis said on Saturday that he was stepping down, three days after the troubled newspaper said that it was laying off a third of its staff.\nLewis sent an email to staff at The Washington Post’s staff saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post”.\nLewis and the newspaper’s billionaire owner Jeff Bezos did not take part in a meeting with staff announcing the lay-offs this week.\nThe paper’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. He joined The Washington Post only last June.\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Washington Post in January 2024.\nHis tenure has been rocky from the start, marked by lay-offs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee.\nThe Washington Post also lost tens of thousands of subscribers following Bezos’ order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.\nWhile anticipated, this past week’s lay-offs were deeper than expected, resulting in the shutting down of the paper’s renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.","url":"https://www.scmp.com/news/world/united-states-canada/article/3342792/washington-post-ceo-steps-down-amid-outcry-over-massive-job-cuts?module=top_story&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/02/08/1ad2a97f-fe4f-4c63-9ad0-0b74ae3f4b26_68294aa7.jpg","video":null,"publish_date":"2026-02-07 23:56:41","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"hk","sentiment":-0.227},{"id":400489554,"title":"Washington Post CEO steps down amid outcry over massive job cuts","text":"Washington Post publisher and CEO Will Lewis said on Saturday that he was stepping down, three days after the troubled newspaper said that it was laying off a third of its staff.\nLewis sent an email to staff at The Washington Post’s staff saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post”.\nLewis and the newspaper’s billionaire owner Jeff Bezos did not take part in a meeting with staff announcing the lay-offs this week.\nThe paper’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. He joined The Washington Post only last June.\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Washington Post in January 2024.\nHis tenure has been rocky from the start, marked by lay-offs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee.\nThe Washington Post also lost tens of thousands of subscribers following Bezos’ order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.\nWhile anticipated, this past week’s lay-offs were deeper than expected, resulting in the shutting down of the paper’s renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.","url":"https://www.scmp.com/news/world/united-states-canada/article/3342792/washington-post-ceo-steps-down-amid-outcry-over-massive-job-cuts?module=latest&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2026/02/08/1ad2a97f-fe4f-4c63-9ad0-0b74ae3f4b26_68294aa7.jpg","video":null,"publish_date":"2026-02-07 23:56:41","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"hk","sentiment":-0.227},{"id":400490328,"title":"Washington Post publisher Will Lewis says he’s stepping down","text":"Washington Post publisher Will Lewis said Saturday that he’s stepping down, three days after the troubled newspaper said that it was laying off one-third of its staff.\n\nLewis sent an email to the Post’s staff, saying that “difficult decisions have been taken in order to ensure the sustainable future of The Post.” Lewis and the newspaper’s billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs this week.\n\nThe Post’s chief financial officer, Jeff D’Onofrio, was named acting publisher and CEO. He joined the newspaper only last June.\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganization plan that led to the departure of former top editor Sally Buzbee.\n\nThe Post also lost tens of thousand of subscribers following Bezos’ order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.\n\nWhile anticipated, this past week’s layoffs were deeper than anticipated, resulting in the shutting down of the Post’s renowned sports section, sharp cutbacks in foreign and metro coverage, and the laying off of its photographic staff.","url":"https://www.courant.com/2026/02/07/washington-post-will-lewis-stepping-down/","image":"https://www.courant.com/wp-content/uploads/2026/02/APTOPIX_Washington_Post_41225-1.jpg?w=1024&h=683","video":null,"publish_date":"2026-02-07 23:54:54","author":"David Bauder","authors":["David Bauder"],"language":"en","category":"politics","source_country":"us","sentiment":-0.151},{"id":400491864,"title":"Washington Post publisher announces departure","text":"Washington Post publisher and CEO Will Lewis ​is leaving, ⁠three days after the troubled newspaper said it was laying off one-third of its staff.\n\nLewis and the newspaper's billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs.\n\n\"During my tenure, difficult decisions have been taken in order to ensure the sustainable future ‌of The ​Post so it can for many years ‍ahead publish high-quality nonpartisan news to millions of customers each day,\" Lewis wrote in a message to staff that was shared online by ​the newspaper's White House bureau ‌chief, Matt Viser.\n\nJeff D'Onofrio, chief financial officer of the ​newspaper, will serve ‍as acting publisher and CEO, the Post said. He joined the newspaper only last June.\n\nThe layoffs prompted an outcry from those in the media lamenting the demise of a once revered institution, including associate editor Bob Woodward who broke the Watergate scandal.\n\nThe British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024.\n\nHis tenure has been rocky from the start, marked by layoffs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee.\n\nThe Post also lost tens of thousand of subscribers following Bezos' order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction.\n\nWhile anticipated, this past week's layoffs were deeper than anticipated, resulting in the shutting down of the Post's renowned sports section, sharp cutbacks in foreign and metro coverage and the laying off of its photographic staff.","summary":"Washington Post publisher Will Lewis says he's stepping down, days after the Post cut a third of its staff.","url":"https://thewest.com.au/business/washington-post-publisher-announces-departure-c-21565985","image":"https://images.thewest.com.au/publication/C-21565985/72a384978542d7495c10b8965791c25da85e6986-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2026-02-07 23:54:01","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.091},{"id":400492256,"title":"Washington Post publisher announces departure","text":"Washington Post publisher and CEO Will Lewis ​is leaving, ⁠three days after the troubled newspaper said it was laying off one-third of its staff. Lewis and the newspaper's billionaire owner Jeff Bezos, did not participate in a meeting with staff announcing the layoffs. \"During my tenure, difficult decisions have been taken in order to ensure the sustainable future ‌of The ​Post so it can for many years ‍ahead publish high-quality nonpartisan news to millions of customers each day,\" Lewis wrote in a message to staff that was shared online by ​the newspaper's White House bureau ‌chief, Matt Viser. Jeff D'Onofrio, chief financial officer of the ​newspaper, will serve ‍as acting publisher and CEO, the Post said. He joined the newspaper only last June. The layoffs prompted an outcry from those in the media lamenting the demise of a once revered institution, including associate editor Bob Woodward who broke the Watergate scandal. The British-born Lewis was a former top executive at The Wall Street Journal before taking over at The Post in January 2024. His tenure has been rocky from the start, marked by layoffs and a failed reorganisation plan that led to the departure of former top editor Sally Buzbee. The Post also lost tens of thousand of subscribers following Bezos' order late in the presidential campaign pulling back an expected endorsement of Kamala Harris for president, and subsequent changes to turn the editorial pages in a more conservative direction. While anticipated, this past week's layoffs were deeper than anticipated, resulting in the shutting down of the Post's renowned sports section, sharp cutbacks in foreign and metro coverage and the laying off of its photographic staff. with AP Australian Associated Press","url":"https://www.goulburnpost.com.au/story/9170166/washington-post-publisher-announces-departure/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/dc239d45-0c0c-4aa8-a972-7e897f6778c6.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2026-02-07 23:52:08","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.142},{"id":400485488,"title":"Inside Track by Coomi Kapoor: India’s top export","text":"The much-delayed Indo-Us trade deal was finally announced last week. But the hyped clout of the Persons of Indian Origin (PIOs) in the USA appears to have played little part in reaching the nebulous agreement. In fact, 2025 saw the unraveling of the smug assumption that India’s most valuable export underpinning a special relationship with the USA are the PIOs, for whom Prime Minister Modi’s rally at Madison Square Garden in 2014 and the Howdy Modi show of strength in texas were organised. PIOs were once seen as america’s model immigrants, with a mean household income even higher than the US average and a low crime rate. Indian Americans have headed corporate giants and donated millions to the trump campaign. They have made a name for themselves in professions ranging from academia to technology, banking and medicine. They have even arrived in US politics, traditionally the preserve of those with well established roots in the country. Kamala Harris was the Democrats’ candidate for President in 2024. New York’s newly elected mayor Zohran Mamdani’s bloodlines are Indian, even if he opts to play up his African background. The Indian connection even extends to Vice President JD Vance’s household — his wife Usha’s parents migrated from Andhra Pradesh. The number of PIOs embedded in the trump administration is an eye-opener. ALSO READThe success of data centres lies in their management Trump’s PIO Army Kashyap (Kash) Patel is FBI chief, Sriram Krishnan is senior white House Policy advisor on artificial Intelligence, Kush Desai is Deputy Press Secretary at the White House, S Paul Kapur is assistant secretary of state for South and Central Asian Affairs. Harmeet Dhillon is the US Assistant Attorney General. With such powerful well-wishers, the Trump administration’s step motherly treatment of India, lumping us with Myanmar and Syria for tariffs, was puzzling. But lately, a sneaking suspicion has dawned that the PIOs in the Trump administration, far from being India’s backers, were working against our interests to demonstrate their loyalty to Trump. The imperative to adopt an anti-India line was pressure from trump’s powerful MAGA supporters who have targeted the Indian immigrant as the villain in depriving white Americans of jobs. Online abuse against Indians on social media have ballooned, with Indians accused of visa scamming and grabbing positions which should rightfully belong to the native-born American. The MAGA lobby complains that Indians have manipulated American laws so as to bring to the USA not just their kith but even village kin. A disproportionately high number of Indian students study at American universities. (In 2025, the number of Indians seeking college admission fell by some 70%.) After a Sikh truck caused a major accident on a Florida highway last year, there was a flood of abusive messages on social media, not just against all Sikh freight drivers, but even Raj Subramaniam, CEO of FedEx. Evangelical Christians, who form the backbone of MAGA, complain against recent Indian arrivals altering the character of picturesque Norman Rockwell-style neighbourhoods with their noisy exuberant celebration of festivals, smelly cuisine and other idiosyncrasies. A 90-foot statue of Hanuman in Texas caused much angst among locals. ALSO READKeynes’s general theory, 90 years on PIO Trojan horses Trump’s PIO cohort seems to believe in the old Hindi proverb that the newest convert is keenest to prove his loyalty. Recently, Republican Senator Ted Cruz in a leaked telephone call named Vance as one of the key white House men resisting an Indo-American trade deal. Vance, a product of the MAGA movement, is vulnerable because of his Hindu spouse and he even admitted that he hoped to persuade her to convert. Significantly, Usha did not even meet her relatives or visit her parents’ home state during the Vances’ brief trip to India. Dhillon in the Justice Department is known for her tough line in prosecuting student demonstrators on campuses and cracking down on universities’ hiring practices. Kash Patel has enforced Trump's agenda vigorously, with special attention to MAGA’s pet projects. S Paul Kapur contributed in formulating tough immigration-related policies. When Modi visited the USA for a Quad summit in 2024, Democrat candidate Harris’s office could not find an available time slot for meeting the Indian Prime Minister. Mamdani during his mayoral campaign declared that Modi was unwelcome in the USA. He even claimed flippantly that he doubted that after the 2002 riots there were any Muslims left in Gujarat. (In fact, the percentage population of Gujarati Muslims remains around eight per cent and their economic and education indicators are far higher than the average Indian Muslim.) Recently, Nalin Haley, son of PIO Nikki Haley, a former US ambassador to the UN, declared on social media that India was run by a “cheap government” which sends “cheap labour” to the United States. Disclaimer: The views expressed are the author's own and do not reflect the official policy or position of Financial Express.","url":"https://www.financialexpress.com/opinion/inside-track-bynbspcoomi-kapoor-indias-top-export/4135125/","image":"https://images.financialexpressdigital.com/2026/02/Exports_20260207174827.jpg","video":null,"publish_date":"2026-02-07 23:31:12","author":"Coomi Kapoor","authors":["Coomi Kapoor"],"language":"en","source_country":"in","sentiment":-0.127},{"id":400481812,"title":"Calm amid chaos: Noem defies calls to resign, touts border victory as shutdowns, storms, and riots swirl","text":"Department of Homeland Security Sec. Kristi Noem has been a lightning rod for criticism amid anti-ICE riots that have rocked the country, sparked a government shutdown and left many wondering whether the nation’s 8th DHS secretary would keep her job. Despite the mounting pressure, Noem appeared calm, collected, and confident during a trip this week that included a stop in Mississippi to assess winter storm damage recovery efforts, visits to the southern border in Texas and Arizona as well as the northern border in North Dakota, and a BBQ dinner hosted and served by Noem herself to Border Patrol agents in Arizona. During the first half of the four-day stint, Congress was still dealing with a partial government shutdown largely over how to fund DHS. The House ultimately reached an agreement, funding the agency through Feb. 13, but Noem's focus remained the same before and after the bill passed, and her schedule was left unchanged. During an exclusive interview along the border wall in Nogales, Ariz., Noem told Fox News Digital that the national security functions of the agency are too vital to be sidelined by a spending fight. BORDER CROSSINGS HIT 55-YEAR LOW — AFTER DEMOCRATS SAID REFORM WAS THE ONLY FIX \"Every day [DHS is] finding terrorists and removing them from our country, protecting our cybersecurity systems, our critical infrastructure,\" Noem told Fox. \"Only 11% of the DHS budget is ICE. The rest of it is FEMA, TSA, that runs our security checkpoints at our airports.\" \"It is also the Coast Guard, which is absolutely critical to our maritime protection and also partnering with the Department of War,\" Noem added. \"We have weapons of mass destruction, science and technology, our national labs.\" \"We have a lot of responsibilities that we absolutely need to fund in order to do them properly. So I'm hopeful that Congress will recognize that and pass this bill quickly,\" Noem said. KRISTI NOEM TO TESTIFY BEFORE HOUSE COMMITTEE NEXT MONTH But the debate around government spending wasn’t about the Coast Guard, FEMA or TSA. It was almost entirely based on one of the 23 agencies which Noem oversees – Immigration and Customs Enforcement, or ICE. Specifically, it centered around ICE's actions in Minneapolis, a so-called sanctuary city in which the local authorities provide only minimal support to federal officers enforcing immigration laws. Since the beginning of the year, DHS estimates that Operation Metro Surge has resulted in the apprehension of 4,000 criminal illegal migrants in Minneapolis. The operation was launched mainly due to a fraud scheme that involved members of the Somali community in Minnesota. The mission then evolved into a heated clash between agitators and federal officers that ultimately left two U.S. citizens dead, Renee Good and Alex Pretti, both killed by federal immigration agents. NOEM VOWS CRIMINAL PROSECUTION AFTER CATCHING ALLEGED DHS 'PROLIFIC LEAKER' Noem quickly labeled both Good and Pretti as \"domestic terrorists\" and said their deaths were due to impeding \"law enforcement operations,\" sparking outrage from Democrats and some Republicans who began to call for her resignation. Rumors swirled whether Noem would actually resign or if President Donald Trump would fire fire her, but the president told reporters shortly after the death of Pretti that he had no intention of relieving her from her position as head of DHS. When Fox News Digital asked Noem what she believed the American people want when it comes to ICE enforcing the law using the same tactics that led to riots, deaths and assaults on both agitators and agents, Noem said \"I think people would want less conflict.\" LEAVITT SAYS TRUMP WILL NOT ‘WAVER’ ON ILLEGAL IMMIGRATION CRACKDOWN DESPITE DEMOCRATIC BACKLASH \"[The American people] want to know that we're enforcing our laws and that we are going after dangerous criminals, and they don't want them to be released on the streets to perpetuate more crimes,\" Noem explained. At some stops along Noem’s trip, agitators appeared. At a dinner she hosted inside a hotel in Tucson, Arizona, for CBP officers, protesters with drums, megaphones and seemingly pre-made signs gathered at the entrance of the hotel. Every other car driving by the demonstration honked, though it’s unclear whether they were honking in support or in disagreement with the protesters. A Quinnipiac University survey taken from Jan. 29 to Feb. 2 showed 58% of those questioned saying that Noem shouldn’t have the job. DHS SECRETARY NOEM STANDS BY BODY CAMERA REQUIREMENT FOR FEDERAL AGENTS FOLLOWING TRUMP COMMENTS Fox News Digital spoke with a GOP insider who pointed to Noem’s inexperience on the national stage, saying her time as governor of South Dakota didn’t prepare her for one of the most challenging roles in the presidential cabinet. Despite the critics, Noem’s record on securing the border has proven successful, according to figures provided by the department and the Trump administration. Trump’s goal to deter illegal migrants from crossing the border, which was Noem’s mandate, has been a priority for the White House. More illegal migrants crossed the southern border in one average month under former President Biden’s watch than have crossed under Noem’s entire watch, according to DHS. NOEM DEPLOYS TO BOTH BORDERS, SAYS ICE WON'T BE DETERRED BY SANCTUARY OFFICIALS WHO 'WANT TO CREATE CONFLICT' \"We have over three million people that have deported, and that includes probably about 700,000 that we have detained and removed,\" Noem told Fox News Digital on Wednesday. \"Beyond that, over 2.3 million have self-deported.\" \"You know, you send the message around the world that America is now going to be enforcing its laws and making sure that if you're in this country illegally, that you should go home, and we've been incentivizing that through a $2,600 payment and a flight,\" Noem added. \"Millions of people have taken us up on that.\" Trump defended Noem for a second time during remarks at the National Prayer Breakfast on Thursday when discussing if he would relinquish her command at DHS. HOUSE DEMOCRATS HOLD 'SHADOW HEARINGS' AS THEY BUILD CASE TO IMPEACH KRISTI NOEM \"Why would I do that? We have the strongest border in the history of our country,\" Trump said. \"We have the best crime numbers we've ever had going back to the year 1900. That's 125 years. We have the lowest crime numbers.\" Trump also appointed Tom Homan, the former ICE director during Trump’s first term and the executive associate director of Enforcement and Removal Operations under President Barack Obama, to serve as border czar, a role previously held by Kamala Harris. Some reports painted a picture of an unspoken rivalry between Homan and Noem following Trump’s decision to put Homan in command of the situation in Minneapolis. NOEM SLAMS DEMS, BIDEN ADMINISTRATION FOR LACKING 'COMPASSION' AMID ANTI-ICE TENSIONS But Noem told Fox News Digital she credited Homan for working to get local leaders in Minneapolis to come to the table and negotiate order in what has been a chaotic scene in the Twin Cities. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"What people need to remember is that Democrat policies were destroying our country,\" Noem said. \"And President Trump came in and said, I'm going to protect the American people. It's not going to happen anymore. \" \"Since [the Biden administration], thousands of people's lives have been saved just here, just right here on the border, because those migrants are not victimized anymore,\" Noem added.","summary":"Kristi Noem faces mounting criticism as DHS secretary amid ICE operations that sparked riots and deaths, but Trump defends her border security record.","url":"https://www.foxnews.com/politics/calm-amid-chaos-noem-defies-calls-resign-touts-border-victory-shutdowns-storms-riots-swirl","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/02/noem-border-wall.jpg","video":null,"publish_date":"2026-02-07 22:36:56","author":"Preston Mizell","authors":["Preston Mizell"],"language":"en","category":"politics","source_country":"US","sentiment":-0.015},{"id":400480998,"title":"WATCH: Media Roasted for Emphasizing JD Was Vance Booed at Olympics, Ignoring Overwhelming Cheers","text":"The establishment media enthusiastically reported that Vice President JD Vance was booed during the opening ceremonies of the 2026 Olympics in Milan, Italy, but video clips appear to show an overwhelmingly enthusiastic response from the crowd.\n\nVance and his wife, Second Lady Usha Vance, arrived for the event on Thursday to lead President Donald Trump’s delegation to the games, the Associated Press (AP) reported.\n\nWhen the United States was introduced during the ceremony the voices of the crowd grew even louder. A handful of groans was overpowered by cheers.\n\nVideo footage shows the moment the announcer said, “The United States of America,” and those gathered in the stadium cheered and clapped. Some even chanted “USA! USA! USA!”\n\nVance and his wife were briefly shown on the Jumbotron:\n\nA USA Today reporter, the AP, and the New York Times claimed Vance was not warmly welcomed during the ceremony, per For the Win.\n\nThe White House also shared a clip from NBC News of the moment the United States was introduced:\n\nGov. Gavin Newsom’s (D-CA) press office commented on the situation, claiming President Donald Trump and Vance have “RUINED America’s reputation on the global stage.”\n\nTurning Point USA spokesman Andrew Kolvet also shared the video, writing, “Gavin Newsom, Kamala Harris and liberal outlets like NBC are falsely claiming the VP was booed during the Opening Ceremony at the Olympics.”\n\n“This is supposed to be a time of national pride and unity, but elected Democrats are using the Olympics to spread lies about our elected leaders and divide Americans. Pretty gross. Also, remember their lack of class when they inevitably run in ‘28,” he concluded.","summary":"The establishment media claimed Vice President JD Vance was booed during the opening ceremonies of the 2026 Olympics in Milan, Italy, but video clips appear to have destroyed that narrative.\n\n\nThe post WATCH: Media Roasted for Emphasizing JD Was Vance Booed at Olympics, Ignoring Overwhelming Cheers appeared first on Breitbart.","url":"https://www.breitbart.com/the-media/2026/02/07/media-roasted-emphasizing-jd-vance-was-booed-olympics-ignoring-overwhelming-cheers/","image":"https://media.breitbart.com/media/2026/02/jd-vance-usha-vance-olympics-getty-640x335.png","video":null,"publish_date":"2026-02-07 21:34:15","author":"Amy Furr","authors":["Amy Furr"],"language":"en","category":"sports","source_country":"US","sentiment":0.02},{"id":400474672,"title":"JD Vance joins controversial boxer Jake Paul to watch U.S. hockey team at Winter Olympics as Vice President brushes off opening ceremony boos","text":"Vice President JD Vance put the Winter Olympics opening ceremony embarrassment behind him as he joined boxing star Jake Paul as they cheered on the U.S. women's hockey team. \n\nVance and the YouTuber-turned-boxer sat next to one another as they watched the Americans cruise to a dominant 5-0 victory over Finland on Saturday. \n\nThe Vice President and the Second Family entered during the intermission at the end of the first period, with the Stars and Stripes leading 1-0.\n\nPaul, whose fiancee, speed skater Jutta Leerdam, is representing the Netherlands at the games, joined them shortly after. \n\nVance sat with his youngest child, daughter Mirabel, on his lap, while his wife, Usha, sported a sweatshirt with 'USA' in big letters and clapped along to Queen's 'We Will Rock You.'\n\n'Vice President Vance had a great time cheering on the U.S. Women’s Hockey team, and looks forward to seeing Team USA dominate the Olympic Games over the next few weeks,' a spokesperson for Vance told the Daily Mail.\n\nThroughout the game, Vance and Paul appeared in deep conversation as they shared a laugh amid the American celebrations. \n\nAmong those seated near Vance were 2010 Olympic figure skating gold medalist Evan Lysacek and hockey's twin sisters, Hall of Famers Jocelyne Lamoureux-Davidson and Monique Lamoureux-Morando. They were members of the U.S. gold medal-winning team at the 2018 Winter Games. \n\nThe Second Family's appearance came less than 24 hours after Vance was met with a chorus of boos as Team USA walked out during Friday's Opening Ceremony.\n\nWhile spirits were high throughout the event, when Team USA marched through the San Siro stadium in Milan, Italy, they were met with booing from furious Italian fans inside.\n\nTo make matters worse, the jeering only got louder when Vance was shown on screen following recent protests against the deployment of the US's Immigration and Customs Enforcement agents at the Olympics.\n\nTeam USA were lead by flagbearers Erin Jackson, a speed skater, and Frankie del Luca, part of the nation's bobsleigh team, as they entered the stadium.\n\nDespite the boos, both Team USA's athletes and Vance appeared in good spirits as they greeted the gathered fans in attendance.\n\nIt wasn't Vance's first appearance at the games. He and his family, along with Secretary of State Marco Rubio, watched the American women storm to a 5-1 victory against the Czech Republic on Thursday.\n\nIt came just days after the Vice President sat down for a wide-ranging exclusive interview with the Daily Mail on Tuesday.\n\nHe refused to admit any wrongdoing over spreading White Houseclaims that Alex Pretti, who was shot dead by ICE in Minneapolis last month, intended to kill law enforcement and let slip a fascinating insight into Trump's chain of command while discussing Nicolas Maduro's capture.\n\nThe Winter Olympics is the first stop for Vance on a trip combining diplomacy and sports. He is later stopping in Armenia and Azerbaijan in a show of support for a peace agreement brokered by the White House last year.\n\nVance told athletes the trip is a highlight of his time in office. 'The whole country - Democrat, Republican, independent - we're all rooting for you and we're cheering for you,' Vance said.\n\nVance is following in the footsteps of former vice presidents Joe Biden who attended the Winter Olympics in Vancouver in 2010 and Mike Pence who traveled to Pyeongchang, South Korea, in 2018.\n\nFormer vice president Kamala Harris did not attend the 2022 Winter Olympics in Beijing because the Biden administration did not send any diplomatic officials as a boycott over human rights concerns.","summary":"Vice President JD Vance put the Winter Olympics opening ceremony embarrassment behind him as he joined boxing star Jake Paulas they cheered on the U.S. women's hockey team.","url":"https://www.dailymail.co.uk/sport/winterolympics/article-15538685/jd-vance-jake-paul-hockey-olympics.html","image":"https://i.dailymail.co.uk/1s/2026/02/07/20/106193363-0-image-m-23_1770497676927.jpg","video":null,"publish_date":"2026-02-07 20:58:20","author":"Charlie Spiering,Editor,Isabel Baldwin","authors":["Charlie Spiering","Editor","Isabel Baldwin"],"language":"en","source_country":"gb","sentiment":0.191},{"id":400404830,"title":"Trump refuses to apologise for racist clip of Obamas as monkeys","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWASHINGTON, DC - FEBRUARY 02: U.S. President Donald Trump speaks as he announces the creation of the U.S. strategic critical minerals reserve during an event in the Oval Office of the White House on February 02, 2026 in Washington, DC. Trump, who was joined by manufacturing leaders, administration officials and lawmakers, announced the creation of Project Vault, a strategic reserve of rare earth minerals to help protect American manufacturers against potential supply chain disruptions.Alex Wong/Getty Images/AFP (Photo by ALEX WONG / GETTY IMAGES NORTH AMERICA / Getty Images via AFP) \n\n International News, Latest News \n\nFebruary 7, 2026\n\n\n\n\n Trump refuses to apologise for racist clip of Obamas as monkeys \n\n\n\n\n\n\n\nWASHINGTON, United States (AFP) — United States President Donald Trump refused to apologise Friday for a video posted on his social media account depicting Barack and Michelle Obama as monkeys, though he said he condemned the post as the White House shifted the blame to staff.\n\nThe video shared on Trump’s Truth Social account late Thursday night sparked censure across the US political spectrum, with the White House initially rejecting “fake outrage” only to then blame the post on an error by a staff member.\n\n“I didn’t make a mistake,” Trump said on Air Force One late Friday when asked if he would apologise for the post.\n\nAsked if he condemns the racist imagery in the video, Trump replied: “Of course I do.”\n\nDemocrats slammed Trump as “vile” over the clip of the Obamas — the first Black president and first lady in US history — while a senior Republican senator said the video was blatantly racist.\n\nNear the end of the one-minute-long video promoting conspiracies about Republican Trump’s 2020 election loss to Joe Biden, the Obamas were shown with their faces on the bodies of monkeys for about one second.\n\nThe video, uploaded late Thursday amid a flurry of other posts, repeated false allegations that ballot-counting company Dominion Voting Systems helped steal the election from Trump.\n\nWhite House Press Secretary Karoline Leavitt initially played down the row, saying the images were “from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King.”\n\n“Please stop the fake outrage and report on something today that actually matters to the American public,” Leavitt said in a statement to AFP.\n\n– About-face –\n\nBut almost exactly 12 hours after the post appeared on Trump’s account there was an unusual concession from an administration that normally refuses to admit the slightest mistake.\n\n“A White House staffer erroneously made the post. It has been taken down,” a White House official told AFP.\n\nSpeaking to reporters on board Air Force One on Friday, Trump stood by the thrust of the video’s claims about election fraud, but said he had not seen the offensive clip.\n\n“I just looked at the first part… and I didn’t see the whole thing,” Trump said, adding that he “gave it” to staffers to post and they also didn’t watch the full video.\n\nThere was no immediate comment from the Obamas.\n\nFormer vice president Kamala Harris, who has long condemned Trump’s divisive racial rhetoric, called out the White House’s backpedaling in a post on X on Friday.\n\n“No one believes this cover up from the White House, especially since they originally defended this post,” she wrote.\n\n“We are all clear-eyed about who Donald Trump is and what he believes.”\n\n– ‘Disgusting bigotry’ –\n\nWhile Democrats pounced on the post, it was the outrage from some members of Trump’s own Republican Party that appeared to trigger the about-face.\n\nTim Scott, the only Black Republican senator and once a contender for the 2024 presidential nomination, called the video “the most racist thing I’ve seen out of this White House.”\n\nScott said he was “praying it was fake” and called for Trump to remove it.\n\nRoger Wicker, another Republican senator, said the post was “totally unacceptable. The president should take it down and apologise.”\n\nThe top Democrat in the House of Representatives, Hakeem Jeffries, called Trump “vile, unhinged and malignant” and urged Republicans on X to “immediately denounce Donald Trump’s disgusting bigotry.”\n\nTrump launched his own political career by pushing the racist and false “birther” conspiracy theory that Barack Obama was lying about being born in the United States.\n\nTrump has long had a bitter rivalry with his Democratic predecessor, taking particular umbrage at his popularity and the fact that he won the Nobel Peace Prize.\n\nIn his second term in the White House, Trump has used hyper-realistic but fabricated AI visuals on Truth Social and other platforms, often glorifying himself and rallying his conservative base around social issues.\n\nDuring negotiations to avoid a US government shutdown Trump posted a video of Jeffries, who is Black, wearing a fake mustache and a sombrero. Jeffries called the image racist.\n\nOne AI-generated video showed fighter jets dumping human waste on protesters — which was created by the same X user who made the video showing the Obamas as monkeys.\n\nSince returning to the White House, Trump has led a crusade against diversity, equity and inclusion (DEI) programs.\n\nUS federal anti-discrimination programs were born of the 1960s civil rights movement, mainly led by Black Americans, for equality and justice after hundreds of years of slavery.\n\nSlavery was abolished in the United States in 1865, but other forms of institutional racism continued for decades.\n\n\n\n\n\n\n\n\nTags: Barack Obama Donald Trump Michelle Obama racisim racist The Lion King \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Clintons call for their Epstein testimony to be public \n\n\n\n\n\n\n\nFebruary 7, 2026 \n\n\n WASHINGTON, United States (AFP) -- Former US president Bill Clinton and former secretary of state Hillary Clinton are calling for their congressional ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Minibus crash kills 15 in northeastern Afghanistan \n\n\n\n\n\n\n\nFebruary 7, 2026 \n\n\n FAIZABAD, Afghanistan -- At least 15 people were killed when a minibus overturned and crashed into a valley in northeastern Afghanistan on Saturday, p... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Death toll rises to two in Colombia mine blast \n\n\n\n\n\n\n\nFebruary 6, 2026 \n\n\n GUACHETA, Colombia (AFP)-Rescuers in Colombia on Friday found the bodies of two workers killed after an explosion in an illegal coal mine, as the sear... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Cuba adopts urgent measures to address energy crisis \n\n\n\n\n\n\n\nFebruary 6, 2026 \n\n\n HAVANA, Cuba (AFP)—The Cuban government on Friday announced emergency measures to address a crippling energy crisis worsened by US sanctions, includin... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Holmwood Tech end Herbert Morrison win record in U19 basketball \n\n\n\n\n\n\n\nFebruary 6, 2026 \n\n\n ST JAMES, Jamaica—Holmwood Technical came from behind to score an upset 64-46 win over Herbert Morrison Technical in their rescheduled ISSA Rural Area... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n Bad Dawg marks 14 years as street-food brand expands vendor network and retail presence \n\n\n\n\n\n\n\nFebruary 6, 2026 \n\n\n KINGSTON, Jamaica — Bad Dawg, a Jamaican street-food brand best known for its sausages sold from mobile carts, is marking its 14th anniversary as it e... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n ACP Phillips issues call for several wanted men in central Jamaica to surrender \n\n\n\n\n\n\n\nFebruary 6, 2026 \n\n\n KINGSTON, Jamaica – Commanding Officer for Area Three, Assistant Commissioner of Police (ACP) Christopher Phillips, is urging several wanted men acros... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2026/02/07/trump-refuses-apologise-racist-clip-obamas-monkeys/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2026/02/AFP__20260202__2259645162__v1__MidRes__PresidentTrumpAnnouncesTheCreationOfTheUSStra-1024x683.jpg","video":null,"publish_date":"2026-02-07 20:08:17","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":-0.107},{"id":400448278,"title":"From Trump To Epstein, How Brad Karp Lost His Grip On Law Firm Paul Weiss","text":"Feb 7 (Reuters) - Brad Karp, the chairman of high-powered U.S. law firm Paul Weiss, joined other prominent Democratic fundraisers at election night gatherings in Washington in November 2024 hoping for a Kamala Harris victory over Republican rival Donald Trump.\n\nKarp had reached out to hundreds of corporate lawyers in a fundraising push for Harris soon after she replaced incumbent Joe Biden as the Democratic presidential candidate in July 2024, and one of his Paul Weiss partners helped prepare the former U.S. vice president for her debate with Trump.\n\nBut Trump won the election. And his return to the presidency last year set in motion a series of events that first shook Paul Weiss and later, with the U.S. Justice Department’s release of records involving the late financier and convicted sex offender Jeffrey Epstein, led Karp to resign this week as its chairman.\n\nThough he has not been accused of wrongdoing, the disclosures of his contacts with Epstein undid in a matter of days Karp’s longstanding grip over the firm that had cemented him as a Wall Street and Washington power broker.\n\n“If you were going to write a Greek tragedy about a law firm leader, this is it,” a former senior Paul Weiss attorney told Reuters, speaking on condition of anonymity.\n\nTransforming Paul Weiss\n\nAfter becoming chairman of Paul Weiss in 2008, Karp transformed it from a respected New York litigation firm to a big-money global powerhouse. And Paul Weiss lawyers and staff outpaced other major law firms in donations to Democrats during the 2024 election cycle.\n\nPaul Weiss devoted pro bono work to progressive causes and recruited star Wall Street dealmakers alongside litigators who had served in Democratic former President Barack Obama’s administration.\n\nTrump’s return to the White House quickly created tumult for Karp and his firm. Karp’s subsequent decision to cut a deal with Trump to rescind an executive order the president had issued punishing the firm made him the face of capitulation for some lawyers aligned with the Democratic Party.\n\nAt least a dozen partners, including the one who had advised Harris for her presidential debate, departed the firm afterward.\n\nA bipartisan push in Congress last year, despite Trump’s objections, required the Justice Department to release files related to Epstein. A trove of emails made public at the end of January revealed extensive communications between Karp and Epstein, prompting him to resign as chairman.\n\nKarp did not respond to requests for comment. The firm did not respond to a request for comment beyond the statement it released on Wednesday announcing his resignation.\n\nIn that statement, Karp said that “recent reporting has created a distraction and has placed a focus on me that is not in the best interests of the firm.” The firm previously had said he regretted his Epstein interactions and “never witnessed or participated in misconduct.”\n\nKarp, whose rolodex of representations has included large Wall Street banks and the National Football League, remains at Paul Weiss serving clients, the firm said in its statement. Karp was replaced as chairman by Scott Barshay, who he had recruited in 2016 to turbocharge the firm’s mergers and acquisitions practice and other corporate work.\n\nFrom litigation to dealmaking\n\nFounded in 1875 by Samuel William Weiss and Julius Frank, the firm built a reputation as a defender of civil liberties. In the 1940s, it became the first major New York firm to name a female partner. It assisted civil rights lawyer Thurgood Marshall in the U.S. Supreme Court’s landmark 1954 case Brown v. Board of Education that declared racial segregation in public schools unconstitutional.\n\nKarp joined Paul Weiss as a summer associate in 1983 and spent his entire career at the firm, rising to lead the litigation department before being elected chairman. Under his leadership, Paul Weiss became a primary defender of the financial industry, representing clients such as Citigroup and JPMorgan while maintaining deep ties to the Democratic establishment.\n\nOver time, Karp showed an ability to develop close relationships and build consensus that allowed him to attract star rainmakers, propelling Paul Weiss to a top-tier firm with loyal institutional clients and leading litigation and transactional practices, according to Kent Zimmermann, an adviser to law firms who interviewed Karp for an upcoming book.\n\nIn recruiting Barshay, Karp increased the firm’s dealmaking firepower.\n\nKarp frequently used Paul Weiss resources to challenge the first Trump administration and partner with civil rights and advocacy groups. The firm helped lead litigation following the 2017 white supremacist demonstration in Charlottesville, Virginia, and participated in lawsuits against the firearms industry.\n\nIn 2018, Karp mobilized lawyers to combat Trump’s family separation policy at the U.S. border.\n\nKarp also represented Leon Black, the co-founder of Apollo Global Management, a large Wall Street investment firm. Epstein became involved in fee disputes with Black. Karp’s communications with Epstein concerning Black and other matters would ultimately contribute to the law firm leader’s resignation.\n\nTrump punishment\n\nPaul Weiss employed lawyers who investigated Trump and sued participants in the January 6, 2021, attack on the U.S. Capitol by the president’s supporters in their failed effort to prevent congressional certification of Biden’s 2020 election victory. On the day of the riot, Karp said he watched in horror “as the disgraceful results of this attempted coup spilled into the hallowed halls of Congress.”\n\nThat made the firm a target when Trump returned to the presidency in January 2025. In March, Trump signed an executive order blacklisting Paul Weiss from federal buildings and government contracts, part of a series of such directives aimed at various law firms that the president viewed as adversaries.\n\n“The shifts he was able to achieve in the firm were the precise things that created the vulnerabilities Trump was able to exploit,” said Scott Cummings, a legal ethics professor at UCLA School of Law.\n\nFearing the order would prompt a client exodus and destroy the 150-year-old firm, Karp sought a settlement with Trump.\n\nHe arrived at a White House meeting in the Oval Office that began with a prolonged discussion of golf. Sullivan & Cromwell co-chair Robert Giuffra, a Republican and Trump lawyer, was patched into the meeting by phone and later helped Karp negotiate a deal to rescind the executive order in exchange for $40 million of free legal work for causes the president supported.\n\nEight other firms subsequently reached similar deals with the administration to avoid Trump executive orders, pledging work worth nearly $1 billion combined. Four other law firms that Trump targeted with executive orders sued and won court rulings striking down the directives as unconstitutional.\n\nA generational leader \n\nKarp was a generational leader who molded Paul Weiss into a highly profitable and elite competitor in the private equity legal market, according to Kevin Burke, a professor at the University of Southern California Gould School of Law who himself once led a law firm.\n\n“What ultimately makes this episode a cautionary tale is how even highly successful leadership can falter when institutional independence is compromised by proximity to executive power,” Burke said. “In a period marked by aggressive executive action and regulatory leverage, Paul Weiss’ decision to settle early and visibly engage with the administration created a perception of accommodation rather than resistance - one that stood in tension with the firm’s historic identity.”\n\nKarp met Epstein through his representation of Black, the firm said. Records released by the Justice Department documented Karp thanking Epstein for a “once in a lifetime” dinner in 2015 with Woody Allen and later seeking Epstein’s assistance in securing a role for his son working on one of the director’s film productions.\n\nOther emails showed Karp and Epstein discussing a woman demanding money from Black. Emails also showed them discussing Epstein’s non-prosecution agreement reached in 2008, when the financier pleaded guilty to prostitution charges in Florida, including soliciting an underage girl.\n\nThe emails indicated the two remained in contact as recently as early 2019, months before Epstein’s arrest on sex trafficking charges and subsequent suicide in a Manhattan jail while awaiting trial.\n\n(Reporting by Mike Spector in New York and David Thomas in Chicago; Additional reporting by Mike Scarcella; Editing by David Bario and Will Dunham)","url":"https://www.huffpost.com/entry/trump-epstein-brad-karp-lost-his-grip-law-firm-paul-weiss_n_69879114e4b00178c3c28b1a?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/6987924a1b000034246ff089.jpeg?cache=2gBY36L5Dz&ops=1778_1000","video":null,"publish_date":"2026-02-07 19:33:27","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"ca","sentiment":-0.365},{"id":400448276,"title":"From Trump To Epstein, How Brad Karp Lost His Grip On Law Firm Paul Weiss","text":"Feb 7 (Reuters) - Brad Karp, the chairman of high-powered U.S. law firm Paul Weiss, joined other prominent Democratic fundraisers at election night gatherings in Washington in November 2024 hoping for a Kamala Harris victory over Republican rival Donald Trump.\n\nKarp had reached out to hundreds of corporate lawyers in a fundraising push for Harris soon after she replaced incumbent Joe Biden as the Democratic presidential candidate in July 2024, and one of his Paul Weiss partners helped prepare the former U.S. vice president for her debate with Trump.\n\nBut Trump won the election. And his return to the presidency last year set in motion a series of events that first shook Paul Weiss and later, with the U.S. Justice Department’s release of records involving the late financier and convicted sex offender Jeffrey Epstein, led Karp to resign this week as its chairman.\n\nThough he has not been accused of wrongdoing, the disclosures of his contacts with Epstein undid in a matter of days Karp’s longstanding grip over the firm that had cemented him as a Wall Street and Washington power broker.\n\n“If you were going to write a Greek tragedy about a law firm leader, this is it,” a former senior Paul Weiss attorney told Reuters, speaking on condition of anonymity.\n\nTransforming Paul Weiss\n\nAfter becoming chairman of Paul Weiss in 2008, Karp transformed it from a respected New York litigation firm to a big-money global powerhouse. And Paul Weiss lawyers and staff outpaced other major law firms in donations to Democrats during the 2024 election cycle.\n\nPaul Weiss devoted pro bono work to progressive causes and recruited star Wall Street dealmakers alongside litigators who had served in Democratic former President Barack Obama’s administration.\n\nTrump’s return to the White House quickly created tumult for Karp and his firm. Karp’s subsequent decision to cut a deal with Trump to rescind an executive order the president had issued punishing the firm made him the face of capitulation for some lawyers aligned with the Democratic Party.\n\nAt least a dozen partners, including the one who had advised Harris for her presidential debate, departed the firm afterward.\n\nA bipartisan push in Congress last year, despite Trump’s objections, required the Justice Department to release files related to Epstein. A trove of emails made public at the end of January revealed extensive communications between Karp and Epstein, prompting him to resign as chairman.\n\nKarp did not respond to requests for comment. The firm did not respond to a request for comment beyond the statement it released on Wednesday announcing his resignation.\n\nIn that statement, Karp said that “recent reporting has created a distraction and has placed a focus on me that is not in the best interests of the firm.” The firm previously had said he regretted his Epstein interactions and “never witnessed or participated in misconduct.”\n\nKarp, whose rolodex of representations has included large Wall Street banks and the National Football League, remains at Paul Weiss serving clients, the firm said in its statement. Karp was replaced as chairman by Scott Barshay, who he had recruited in 2016 to turbocharge the firm’s mergers and acquisitions practice and other corporate work.\n\nFrom litigation to dealmaking\n\nFounded in 1875 by Samuel William Weiss and Julius Frank, the firm built a reputation as a defender of civil liberties. In the 1940s, it became the first major New York firm to name a female partner. It assisted civil rights lawyer Thurgood Marshall in the U.S. Supreme Court’s landmark 1954 case Brown v. Board of Education that declared racial segregation in public schools unconstitutional.\n\nKarp joined Paul Weiss as a summer associate in 1983 and spent his entire career at the firm, rising to lead the litigation department before being elected chairman. Under his leadership, Paul Weiss became a primary defender of the financial industry, representing clients such as Citigroup and JPMorgan while maintaining deep ties to the Democratic establishment.\n\nOver time, Karp showed an ability to develop close relationships and build consensus that allowed him to attract star rainmakers, propelling Paul Weiss to a top-tier firm with loyal institutional clients and leading litigation and transactional practices, according to Kent Zimmermann, an adviser to law firms who interviewed Karp for an upcoming book.\n\nIn recruiting Barshay, Karp increased the firm’s dealmaking firepower.\n\nKarp frequently used Paul Weiss resources to challenge the first Trump administration and partner with civil rights and advocacy groups. The firm helped lead litigation following the 2017 white supremacist demonstration in Charlottesville, Virginia, and participated in lawsuits against the firearms industry.\n\nIn 2018, Karp mobilized lawyers to combat Trump’s family separation policy at the U.S. border.\n\nKarp also represented Leon Black, the co-founder of Apollo Global Management, a large Wall Street investment firm. Epstein became involved in fee disputes with Black. Karp’s communications with Epstein concerning Black and other matters would ultimately contribute to the law firm leader’s resignation.\n\nTrump punishment\n\nPaul Weiss employed lawyers who investigated Trump and sued participants in the January 6, 2021, attack on the U.S. Capitol by the president’s supporters in their failed effort to prevent congressional certification of Biden’s 2020 election victory. On the day of the riot, Karp said he watched in horror “as the disgraceful results of this attempted coup spilled into the hallowed halls of Congress.”\n\nThat made the firm a target when Trump returned to the presidency in January 2025. In March, Trump signed an executive order blacklisting Paul Weiss from federal buildings and government contracts, part of a series of such directives aimed at various law firms that the president viewed as adversaries.\n\n“The shifts he was able to achieve in the firm were the precise things that created the vulnerabilities Trump was able to exploit,” said Scott Cummings, a legal ethics professor at UCLA School of Law.\n\nFearing the order would prompt a client exodus and destroy the 150-year-old firm, Karp sought a settlement with Trump.\n\nHe arrived at a White House meeting in the Oval Office that began with a prolonged discussion of golf. Sullivan & Cromwell co-chair Robert Giuffra, a Republican and Trump lawyer, was patched into the meeting by phone and later helped Karp negotiate a deal to rescind the executive order in exchange for $40 million of free legal work for causes the president supported.\n\nEight other firms subsequently reached similar deals with the administration to avoid Trump executive orders, pledging work worth nearly $1 billion combined. Four other law firms that Trump targeted with executive orders sued and won court rulings striking down the directives as unconstitutional.\n\nA generational leader \n\nKarp was a generational leader who molded Paul Weiss into a highly profitable and elite competitor in the private equity legal market, according to Kevin Burke, a professor at the University of Southern California Gould School of Law who himself once led a law firm.\n\n“What ultimately makes this episode a cautionary tale is how even highly successful leadership can falter when institutional independence is compromised by proximity to executive power,” Burke said. “In a period marked by aggressive executive action and regulatory leverage, Paul Weiss’ decision to settle early and visibly engage with the administration created a perception of accommodation rather than resistance - one that stood in tension with the firm’s historic identity.”\n\nKarp met Epstein through his representation of Black, the firm said. Records released by the Justice Department documented Karp thanking Epstein for a “once in a lifetime” dinner in 2015 with Woody Allen and later seeking Epstein’s assistance in securing a role for his son working on one of the director’s film productions.\n\nOther emails showed Karp and Epstein discussing a woman demanding money from Black. Emails also showed them discussing Epstein’s non-prosecution agreement reached in 2008, when the financier pleaded guilty to prostitution charges in Florida, including soliciting an underage girl.\n\nThe emails indicated the two remained in contact as recently as early 2019, months before Epstein’s arrest on sex trafficking charges and subsequent suicide in a Manhattan jail while awaiting trial.\n\n(Reporting by Mike Spector in New York and David Thomas in Chicago; Additional reporting by Mike Scarcella; Editing by David Bario and Will Dunham)","url":"https://www.huffpost.com/entry/trump-epstein-brad-karp-lost-his-grip-law-firm-paul-weiss_n_69879114e4b00178c3c28b1a?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/6987924a1b000034246ff089.jpeg?cache=2gBY36L5Dz&ops=1778_1000","video":null,"publish_date":"2026-02-07 19:33:27","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"ca","sentiment":-0.365},{"id":400468094,"title":"From Trump To Epstein, How Brad Karp Lost His Grip On Law Firm Paul Weiss","text":"Feb 7 (Reuters) - Brad Karp, the chairman of high-powered U.S. law firm Paul Weiss, joined other prominent Democratic fundraisers at election night gatherings in Washington in November 2024 hoping for a Kamala Harris victory over Republican rival Donald Trump.\n\nKarp had reached out to hundreds of corporate lawyers in a fundraising push for Harris soon after she replaced incumbent Joe Biden as the Democratic presidential candidate in July 2024, and one of his Paul Weiss partners helped prepare the former U.S. vice president for her debate with Trump.\n\nBut Trump won the election. And his return to the presidency last year set in motion a series of events that first shook Paul Weiss and later, with the U.S. Justice Department’s release of records involving the late financier and convicted sex offender Jeffrey Epstein, led Karp to resign this week as its chairman.\n\nThough he has not been accused of wrongdoing, the disclosures of his contacts with Epstein undid in a matter of days Karp’s longstanding grip over the firm that had cemented him as a Wall Street and Washington power broker.\n\n“If you were going to write a Greek tragedy about a law firm leader, this is it,” a former senior Paul Weiss attorney told Reuters, speaking on condition of anonymity.\n\nTransforming Paul Weiss\n\nAfter becoming chairman of Paul Weiss in 2008, Karp transformed it from a respected New York litigation firm to a big-money global powerhouse. And Paul Weiss lawyers and staff outpaced other major law firms in donations to Democrats during the 2024 election cycle.\n\nPaul Weiss devoted pro bono work to progressive causes and recruited star Wall Street dealmakers alongside litigators who had served in Democratic former President Barack Obama’s administration.\n\nTrump’s return to the White House quickly created tumult for Karp and his firm. Karp’s subsequent decision to cut a deal with Trump to rescind an executive order the president had issued punishing the firm made him the face of capitulation for some lawyers aligned with the Democratic Party.\n\nAt least a dozen partners, including the one who had advised Harris for her presidential debate, departed the firm afterward.\n\nA bipartisan push in Congress last year, despite Trump’s objections, required the Justice Department to release files related to Epstein. A trove of emails made public at the end of January revealed extensive communications between Karp and Epstein, prompting him to resign as chairman.\n\nKarp did not respond to requests for comment. The firm did not respond to a request for comment beyond the statement it released on Wednesday announcing his resignation.\n\nIn that statement, Karp said that “recent reporting has created a distraction and has placed a focus on me that is not in the best interests of the firm.” The firm previously had said he regretted his Epstein interactions and “never witnessed or participated in misconduct.”\n\nKarp, whose rolodex of representations has included large Wall Street banks and the National Football League, remains at Paul Weiss serving clients, the firm said in its statement. Karp was replaced as chairman by Scott Barshay, who he had recruited in 2016 to turbocharge the firm’s mergers and acquisitions practice and other corporate work.\n\nFrom litigation to dealmaking\n\nFounded in 1875 by Samuel William Weiss and Julius Frank, the firm built a reputation as a defender of civil liberties. In the 1940s, it became the first major New York firm to name a female partner. It assisted civil rights lawyer Thurgood Marshall in the U.S. Supreme Court’s landmark 1954 case Brown v. Board of Education that declared racial segregation in public schools unconstitutional.\n\nKarp joined Paul Weiss as a summer associate in 1983 and spent his entire career at the firm, rising to lead the litigation department before being elected chairman. Under his leadership, Paul Weiss became a primary defender of the financial industry, representing clients such as Citigroup and JPMorgan while maintaining deep ties to the Democratic establishment.\n\nOver time, Karp showed an ability to develop close relationships and build consensus that allowed him to attract star rainmakers, propelling Paul Weiss to a top-tier firm with loyal institutional clients and leading litigation and transactional practices, according to Kent Zimmermann, an adviser to law firms who interviewed Karp for an upcoming book.\n\nIn recruiting Barshay, Karp increased the firm’s dealmaking firepower.\n\nKarp frequently used Paul Weiss resources to challenge the first Trump administration and partner with civil rights and advocacy groups. The firm helped lead litigation following the 2017 white supremacist demonstration in Charlottesville, Virginia, and participated in lawsuits against the firearms industry.\n\nIn 2018, Karp mobilized lawyers to combat Trump’s family separation policy at the U.S. border.\n\nKarp also represented Leon Black, the co-founder of Apollo Global Management, a large Wall Street investment firm. Epstein became involved in fee disputes with Black. Karp’s communications with Epstein concerning Black and other matters would ultimately contribute to the law firm leader’s resignation.\n\nTrump punishment\n\nPaul Weiss employed lawyers who investigated Trump and sued participants in the January 6, 2021, attack on the U.S. Capitol by the president’s supporters in their failed effort to prevent congressional certification of Biden’s 2020 election victory. On the day of the riot, Karp said he watched in horror “as the disgraceful results of this attempted coup spilled into the hallowed halls of Congress.”\n\nThat made the firm a target when Trump returned to the presidency in January 2025. In March, Trump signed an executive order blacklisting Paul Weiss from federal buildings and government contracts, part of a series of such directives aimed at various law firms that the president viewed as adversaries.\n\n“The shifts he was able to achieve in the firm were the precise things that created the vulnerabilities Trump was able to exploit,” said Scott Cummings, a legal ethics professor at UCLA School of Law.\n\nFearing the order would prompt a client exodus and destroy the 150-year-old firm, Karp sought a settlement with Trump.\n\nHe arrived at a White House meeting in the Oval Office that began with a prolonged discussion of golf. Sullivan & Cromwell co-chair Robert Giuffra, a Republican and Trump lawyer, was patched into the meeting by phone and later helped Karp negotiate a deal to rescind the executive order in exchange for $40 million of free legal work for causes the president supported.\n\nEight other firms subsequently reached similar deals with the administration to avoid Trump executive orders, pledging work worth nearly $1 billion combined. Four other law firms that Trump targeted with executive orders sued and won court rulings striking down the directives as unconstitutional.\n\nA generational leader \n\nKarp was a generational leader who molded Paul Weiss into a highly profitable and elite competitor in the private equity legal market, according to Kevin Burke, a professor at the University of Southern California Gould School of Law who himself once led a law firm.\n\n“What ultimately makes this episode a cautionary tale is how even highly successful leadership can falter when institutional independence is compromised by proximity to executive power,” Burke said. “In a period marked by aggressive executive action and regulatory leverage, Paul Weiss’ decision to settle early and visibly engage with the administration created a perception of accommodation rather than resistance - one that stood in tension with the firm’s historic identity.”\n\nKarp met Epstein through his representation of Black, the firm said. Records released by the Justice Department documented Karp thanking Epstein for a “once in a lifetime” dinner in 2015 with Woody Allen and later seeking Epstein’s assistance in securing a role for his son working on one of the director’s film productions.\n\nOther emails showed Karp and Epstein discussing a woman demanding money from Black. Emails also showed them discussing Epstein’s non-prosecution agreement reached in 2008, when the financier pleaded guilty to prostitution charges in Florida, including soliciting an underage girl.\n\nThe emails indicated the two remained in contact as recently as early 2019, months before Epstein’s arrest on sex trafficking charges and subsequent suicide in a Manhattan jail while awaiting trial.\n\n(Reporting by Mike Spector in New York and David Thomas in Chicago; Additional reporting by Mike Scarcella; Editing by David Bario and Will Dunham)","url":"https://www.huffpost.com/entry/trump-epstein-brad-karp-lost-his-grip-law-firm-paul-weiss_n_69879114e4b00178c3c28b1a?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/6987924a1b000034246ff089.jpeg?cache=2gBY36L5Dz&ops=1778_1000","video":null,"publish_date":"2026-02-07 19:33:27","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":-0.365},{"id":400452878,"title":"Obama Hitting Trump Backers for Making ‘Excuses’ Resurfaces After Ape Video","text":"Footage of former President Barack Obama criticizing supporters of President Donald Trump for making “excuses“ for him has resurfaced on social media following a controversial video posted to the president's Truth Social account earlier this week. At the end of Trump's video about alleged voter fraud during the 2020 election—which was taken down after bipartisan backlash—the Obamas were portrayed as apes. White House officials later said that “a White House staffer erroneously made the post.“ The resurfaced video of Obama, from a stump speech he made in October 2024 for presidential candidate Kamala Harris, as of Saturday afternoon gained more than 11,000 retweets, 42,000 likes and over 668,000 views on X since being posted by The Tennessee Holler X account. Why It Matters Trump has made extensive use of social media, posting memes and artificial intelligence (AI)-generated content that has stirred up no end of controversy, including his now-infamous video in which he drops brown sludge on “No Kings“ protesters, with the White House consistently dismissing outrage or backlash to controversial posts as fake or performative. Meanwhile, Trump and his administration have repeatedly criticized Obama, who is the first Black U.S. president. In July, Trump accused him of “treason,“ which Obama's office denied, after Tulsi Gabbard, the director of national intelligence, released a report alleging Obama and members of his administration manufactured intelligence regarding Russian interference in the 2016 election. Trump also reposted an AI-generated video to Truth Social that month that showed Obama being arrested and put in jail. Despite the controversy over the newest video gaining national attention, the Obamas have been notably quiet on the matter. What To Know In the video, using footage from Patriot News Outlet that was posted to the president's Truth Social account at 11:44 p.m. ET on Thursday night, a narrator discusses what they view as voting irregularities in the 2020 election. Then, at around 58 seconds into the roughly one-minute video, it cuts to a brief clip of the former president and his wife, with their faces superimposed over the bodies of what appear to be apes as “The Lion Sleeps Tonight“ plays. The clip appears to be taken from a longer video posted by conservative meme creator Xerias in October, which shows several prominent Democrats as animals, including Representative Alexandria Ocasio-Cortez of New York, former Secretary of State Hillary Clinton, House Minority Leader Hakeem Jeffries, and Illinois Governor JB Pritzker, while Trump is depicted as a lion. However, only the clip of the Obamas was included in the post on Truth Social, and has stirred up comparisons to historic, racist caricatures that compare Black people to apes or monkeys. White House press secretary Karoline Leavitt responded to anger over the video in a statement shared with Newsweek, dismissing backlash to it. “This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from the Lion King,“ she said. “Please stop the fake outrage and report on something today that actually matters to the American public.“ While on Air Force One on Friday night, Trump told reporters he didn’t see the full video before it was posted and said, “It was a very strong post in terms of voter fraud. Nobody knew that was at the end. If they would have looked, they would have seen it, and probably they would have the sense to take it down.” Meanwhile, in resurfaced video on social media, Obama says of Trump’s more questionable behavior: “People make excuses for him. They say, ‘Well, he's not serious’…Everything a president says is serious. Everything that somebody who's aspiring to office is listened to. And people make excuses for it, they think, ‘Well, it's fun or it's okay as long as our side wins.’” The former president added: “And I've noticed this especially among some men who seem to think Trump's behavior of bullying people or putting them down is somehow macho. A sign of strength. I'm telling you, that's not what real strength is.” Former President Barack Obama is seen on November 1, 2025, in Norfolk, Virginia. What People Are Saying Senator Tim Scott of South Carolina, the only Black Republican in the Senate, wrote on X on Friday: “Praying it was fake because it’s the most racist thing I’ve seen out of this White House. The President should remove it.” President Donald Trump told reporters on Friday: “I didn’t see the whole thing. I gave it to the people, they posted it…I spoke to Tim Scott, and he was great. Tim is a great guy. He understood that 100 percent.“ House Minority Leader Hakeem Jeffries, a New York Democrat, said in an Instagram video on Friday: “F*** Donald Trump and his vile, racist and malignant behavior. This guy is an unhinged bottom feeder. President Obama and Michelle Obama are brilliant, caring and patriotic Americans. They represent the best of this country. It’s time for [Republican Senate Majority Leader] John Thune, [Republican House Speaker] Mike Johnson and Republicans to denounce this serial fraudster who’s sitting at 1600 Pennsylvania Avenue pretending to be the President of the United States.” He also said on MS Now, formerly MSNBC, on Saturday morning: “What I’ve said about the president is, look, if the guy is not a racist, he’s certainly doing the best job that he can trying to convince us otherwise.” X account “Republicans against Trump“ wrote: “Trump just posted a video on Truth Social that includes a racist image of Barack and Michelle Obama as monkeys. There’s no bottom.” What Happens Next Whether the Obamas respond to the video directly will be closely watched.","summary":"The ex-president&#039;s earlier comments were shared widely after the Obamas stayed quiet following the apes video controversy.","url":"https://www.newsweek.com/obama-hitting-trump-backers-for-making-excuses-resurfaces-after-ape-video-11483599","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/GettyImages-2244515344_28d1d9.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-07 19:33:23","author":"Steve Mollman","authors":["Steve Mollman"],"language":"en","source_country":"US","sentiment":-0.254},{"id":400453176,"title":"Karoline Leavitt Blames “Leftist Media” for Focus on Trump’s Racist Obama Video, Says “The Post Was Removed”","text":"A day after Donald Trump triggered a social media firestorm by sharing a racist video of former President Barack Obama and First Lady Michele Obama on Truth Social, White House Press Secretary Karoline Leavitt blamed left-leaning media outlets for their continued focus on the now-deleted post.\n\nFor the unversed, during a late-night Truth Social spree on Thursday, February 5, 2026, Trump shared a clip highlighting voter fraud conspiracy theories connected to the 2020 presidential election. A two-second footage of Barack and Michelle Obama’s faces superimposed onto the bodies of monkeys shockingly appeared towards the end of the clip, sparking major outrage.\n\nTrump later claimed that the video was posted by a White House staffer, and he did not look at the entire footage before it made its way to social media. “I just looked at the first part. I didn’t see the whole thing,” the President told reporters on Air Force One during his weekend trip to Mar-a-Lago.\n\nMeanwhile, Karoline Leavitt spoke about the video during an appearance on The Ingraham Angle. “It was a meme that was posted by a staffer on the president’s Truth Social account. It was from a Lion King video depicting, as you pointed out, different Democrats as different animals,” Leavitt said.\n\nIngraham: It’s not just Democrats. There are Republicans saying the President should come out and apologize for it. Why won’t he?\nLeavitt: I won’t get ahead of the President. This is a distraction from the fake news media. pic.twitter.com/1PH78reUyZ\n— Acyn (@Acyn) February 7, 2026\n\n“I think Kamala Harris was depicted as a turtle in this video meme. The president did take it down. He spoke with lawmakers today out of respect for them, including Senator Tim Scott,” she added.\n\nThe White House Press Secretary also claimed that the focus on the video distracted Americans from acknowledging the recent developments made under the Trump administration.\n\n“The post was removed. But leave it to the leftist media, of course, to talk about this all day rather than talk about the fact that the Dow has broken over 50,000 points for the first time in our nation’s history,” Leavitt said.\n\nKaroline Leavitt on Trump’s Truth Social post depicting Barack and Michelle Obama as monkeys:\n“This is from an internet meme video… Please stop the fake outrage and report on something today that actually matters to the American public.” pic.twitter.com/WkxtY3OsZW\n— FactPost (@factpostnews) February 6, 2026\n\n“Rather than talk about what President Trump did last night, launching TrumpRX.gov, which is the first of its kind, amazing, beautiful website for direct-to-consumer drug purchases,” she continued, urging Americans to check out the TrumpRX website, launched to allow the public to purchase prescription medicine at lower prices.\n\n“For the American people to go to TrumpRX.gov right now and to purchase prescription drugs that are at a much lower cost, sometimes more than 600% less, because of the successful deals that this president negotiated with pharmaceutical companies. It’s great news,” she said.\n\nLeavitt also attempted to defend Trump right after the video was shared, calling the backlash “fake outrage.” \n\n“This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King,” she initially wrote. “Please stop the fake outrage and report on something today that actually matters to the American public,” Leavitt added.","summary":"Trump's Obama post is gone but the outrage lives on, much to Karoline Leavitt's chagrin.","url":"https://www.inquisitr.com/karoline-leavitt-blames-leftist-media-for-focus-on-trumps-racist-obama-video-says-the-post-was-removed","image":"https://www.inquisitr.com/wp-content/uploads/2026/02/Karoline-Leavitt-and-Trump.jpg","video":null,"publish_date":"2026-02-07 18:08:26","author":"Barsha Roy","authors":["Barsha Roy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.282},{"id":400419504,"title":"Donald Trump’s Approval Rating Changes Course With Hispanic Voters","text":"President Donald Trump’s approval rating has dramatically changed course with Hispanic voters, according to data from a national polling series. A new ActiVote survey shows a sharp rebound in Trump’s approval rating among Hispanics from the prior month’s numbers, representing his strongest showing among this demographic in the series. Newsweek contacted the White House via email for comment. Republican National Committee (RNC) National Press Secretary Kiersten Pels told Newsweek: “Republicans are making steady gains with Hispanic voters by focusing on jobs, public safety, and the cost of living.“ Why It Matters Hispanic voters are a rapidly growing and geographically pivotal bloc whose political preferences vary widely across communities, making even modest shifts consequential in battleground states. An 18‑point swing towards approval in the ActiVote series highlights a group in motion at a moment when Trump’s overall approval remains negative, underscoring how gains with key demographics could reshape the 2026 electoral map. Donald Trump gaggles with reporters while aboard Air Force One on February 6, 2026 en route to Palm Beach, Florida. What To Know The latest ActiVote poll, released February 1 and based on a sample of 490 registered voters surveyed between January 1 and January 31 with a margin of error of 4.4 percent, shows Trump at 56 percent approval and 44 percent disapproval among Hispanic respondents. Just two months earlier, ActiVote found almost the opposite sentiment. Its November poll, conducted between October 1 and October 31 among 574 registered voters with a margin of error of 4.1 percent, measured Trump at 47 percent approval and 51 percent disapproval. By December, his numbers deteriorated sharply: ActiVote’s survey of 568 registered voters fielded November 1 through November 30, also with a margin of error of 4.1 percent, placed his Hispanic approval at just 38 percent against 62 percent disapproval. The January rebound to a majority‑approval position therefore represents an 18‑point swing in approval in a single month. Hispanic voters are one of the fastest‑growing segments of the electorate and play critical roles in states such as Arizona, Nevada, Georgia, Florida and parts of the Midwest. Even modest movement can shift statewide margins. A swing of this scale—if replicated or sustained—suggests that Trump retains the ability to regain support quickly after setbacks. What Is Trump's Overall Approval Rating? Trump’s aggregate national approval remains firmly negative across the major public tracking polls. CNN’s poll of polls, which blends multiple national surveys using each pollster’s own methodology, consistently places Trump’s approval in the low forties and his disapproval in the mid‑fifties. While the exact margins vary as new polls are added, the combined trendline has shown little movement throughout his second term. At the time of writing, it averaged 39 percent approval and 59 percent disapproval, a net –20. The Rasmussen Reports daily tracking poll—a conservative‑leaning survey that historically records higher GOP support—now places Trump at his lowest rating of this term at 41 percent approval and 57 percent disapproval, giving a net approval rating of -16. Rasmussen’s rolling three‑day averages typically include about 1,500 likely voters and carry margins of error of roughly 2 to 3 percent. For a pollster often favorable to Trump to show him at a term‑low rating is notable and underscores his broader national erosion. The Economist/YouGov national poll, which generally surveys around 1,500 registered voters online with a margin of error close to 3 percent, also shows Trump’s approval significantly below his disapproval. It currently stands at a net approval rating of -15 percent, a 2.2‑point improvement from last week, with 41 percent of voters approving, 56 percent disapproving and 5 percent undecided. YouGov’s methodology produces stable readings with less month‑to‑month volatility, making the negative trend especially clear. What People Are Saying RNC National Press Secretary Kiersten Pels told Newsweek: “Democrats are pointing to polls in deep-blue states and pretending that means they’re winning, but voters across the country are moving in the opposite direction. “Republicans are making steady gains with Hispanic voters by focusing on jobs, public safety, and the cost of living, while Democrats obstruct law enforcement and create chaos in our communities. Under President Trump, support among Hispanic voters has surged, when Democrats rallied behind failed candidate Kamala Harris. That’s why Republicans are on offense nationwide heading into 2026.” Justin Chermol, a spokesperson for the Democratic Congressional Campaign Committee, told Newsweek in an emailed statement: “The wind is at Democrats' backs as we continue to overperform in special elections, outpace Republicans in the polls, and remind the American people that corrupt House Republicans are an epic, flailing disaster.“ White House spokesman Kush Desai told Newsweek: “Nearly 80 million Americans gave President Trump a resounding Election Day mandate to end Joe Biden’s economic disaster and immigration crisis. The Trump administration remains laser-focused on continuing to cool inflation, accelerate economic growth, secure our border, and mass deport criminal illegal aliens.” What Happens Next Whether January’s surge becomes a durable trend or a short‑lived anomaly will become clearer with the next wave of polling. For now, Hispanic voters appear to remain firmly in play, and their movement could help define the political story of 2026.","summary":"The GOP says it is &quot;making steady gains with Hispanic voters by focusing on jobs, public safety, and the cost of living.&quot;","url":"https://www.newsweek.com/donald-trump-approval-rating-hispanic-voters-11483094","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/GettyImages-2259686863.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-07 17:09:48","author":"Sam Stevenson","authors":["Sam Stevenson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.185},{"id":400436438,"title":"Andrew Yang questioned on NYC's antisemitism czar and potential White House run","text":"to top close Video This video is playing in picture-in-picture.\n\nSaturday In America February 07, 2026 06:22 \n\n Andrew Yang questioned on NYC's antisemitism czar and potential White House run \n Andrew Yang discusses NYC's controversial new antisemitism czar, Felicia Wisdom, and his claim of being blacklisted by the Kamala Harris campaign.\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRSATURDAY IN AMERICA W/ KAYLEIGH MCENANYV-VIDEOPOLITICS","summary":"Andrew Yang discusses NYC&apos;s controversial new antisemitism czar, Felicia Wisdom, and his claim of being blacklisted by the Kamala Harris campaign.","url":"https://www.foxnews.com/video/6388928599112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9b177950-97d8-4938-89a5-6eb4ed57eacf/349cc441-a59f-4535-b7d2-7dccdf410ebe/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2026-02-07 16:50:37","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.479},{"id":400465776,"title":"WH's Leavitt: Attention on the Obama Truth Social Post 'Merely a Distraction for the Fake News Media'","text":"On Friday on FNC’s “The Ingraham Angle,” White House press secretary Karoline Leavitt was pressed by host Laura Ingraham about a Truth Social post from President Donald Trump that included a video briefly depicting former President Barack Obama and former first lady Michelle Obama as primates.\n\nLeavitt called the media attention a “distraction for the fake news media.”\n\n“Karoline, I know the president did remove it, deleted it, but it was up for, I think, 12 hours or something like that,” Ingraham said. “How did this happen? And can you really throw a staffer under the bus for this?”\n\nLeavitt replied, “Well, look, Laura, you know, it was a meme that was posted by a staffer on the president’s Truth Social account. It was from a Lion King video depicting, as you pointed out, different Democrats as different animals. I think Kamala Harris was depicted as a turtle in this video meme. The president did take it down. He spoke with lawmakers today out of respect for them, including Senator Tim Scott.”\n\n“The post was removed,” she continued. “But leave it to the leftist media, of course, to talk about this all day rather than talk about the fact that the Dow has broken over 50,000 points for the first time in our nation’s history. Rather than talk about what President Trump did last night, launching TrumpRx.gov, which is the first of its kind, amazing, beautiful website for direct to consumer drug purchases for the American people, to go to TrumpRx.gov right now and to purchase prescription drugs that are at a much lower cost, sometimes more than 600 percent less because of the successful deals that this president negotiated with pharmaceutical companies. It’s great news.”\n\nIngraham countered, “Yeah. It’s phenomenal news, actual solutions to problems that other politicians can kick down the road for years and years. But it’s not just Democrats. There are Republican senators, Pete Ricketts, others saying, look, we understand it was us, but the president just come out and apologize for it and say, look, this was a mistake. Sorry if it offended anyone. Why not?”\n\nLeavitt added, “Well, look, I won’t get ahead of the president, Laura, and he may be speaking with the press later today, but he did take down the post. And again, this is merely a distraction for the fake news media from Trump … from the fact that this week it was revealed zero illegal aliens were released into our country again for nine months in a row. Another historic achievement of this administration. The fact that this week we saw the data murder rates in this country, the lowest since 1900. I mean, these are unbelievable results on behalf of all Americans regardless of race, religion or creed, whether they live in a red state or a blue state. And we fight extremely hard here every single day to get the fake news media to pay attention to the wins and the achievements that I see this president firsthand, working around the clock to accomplish and to deliver on behalf of this great country, which he loves so much.”\n\nFollow Jeff Poor on X @jeff_poor","summary":"On Friday on FNC's \"The Ingraham Angle,\" White House press secretary Karoline Leavitt was pressed by host Laura Ingraham about a Truth Social post from President Donald Trump that included a video briefly depicting former President Barack Obama and former first lady Michelle Obama as primates.\n\n\nThe post WH&#8217;s Leavitt: Attention on the Obama Truth Social Post &#8216;Merely a Distraction for the Fake News Media&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2026/02/07/whs-leavitt-attention-on-the-obama-truth-social-post-merely-a-distraction-for-the-fake-news-media/","image":"https://media.breitbart.com/media/2026/02/Leavitt272026-640x335.jpg","video":null,"publish_date":"2026-02-07 16:41:12","author":"Jeff Poor","authors":["Jeff Poor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.273},{"id":400419518,"title":"Why Creed Has Disappeared From Kid Rock Festival Website","text":"Christian rock band Creed has been quietly removed from the lineup of the Rock the Country festival, as the stop in Anderson, South Carolina, where they were due to perform, has officially been cancelled. The cancellation follows multiple artists, including Shinedown and Morgan Wade, withdrawing or being removed from the lineup of the festival organized by Kid Rock. Newsweek has contacted representatives for Creed and Kid Rock via email for comment outside of regular business hours for comment. Why It Matters Kid Rock, whose real name is Robert James Ritchie and who last had a Top 40 single in 2008, is a vocal conservative and supporter of President Donald Trump, who has visited the White House several times. Fellow headliner Jason Aldean, a country musician, is also a vocal conservative. L: Kid Rock performs in concert at Intrust Bank Arena on April 18, 2025 in Wichita, Kansas. R: Scott Stapp (L) and Mark Tremonti (R) of the Rock Band Creed performs in concert with Eve To Adam at The Wiltern on May 15, 2012 in Los Angeles, California. Big names in entertainment have tended to skew liberal historically, with the likes of Bruce Springsteen, Taylor Swift and Beyoncé having publicly endorsed Democratic candidates, including former Vice President Kamala Harris, in prior elections. Musicians who skew conservative may contend with both public criticism and an increased public profile by virtue of their being less conservative voices in the entertainment world. This may be the case with Kid Rock, as in the lead up to big performances, there has been increased scrutiny over both his politics and past lyrics. The conversation over Rock the Country and bands withdrawing comes at a tense and polarized moment politically, with the group Shinedown saying they decided not the play the festival as they “do not want to participate in something we believe will create further division.“ Wade meanwhile withdrew without commenting. What To Know Creed were on the lineup for the Rock the Country festival as of February 4th, but as of reporting, they are no longer visible on the lineup. This is most likely in connection with the cancelled stop in South Carolina, but the One Last Breath hitmakers haven’t publicly confirmed a reason. The festival’s remaining lineup includes Blake Shelton, Hank Williams Jr., Jelly Roll, Brooks & Dunn, Miranda Lambert, Lynyrd Skynyrd and Nelly. The festival has seven stops now listed, in Texas, Georgia, South Dakota, Kentucky, Michigan, Florida and New York. Creed are popular among conservatives, as MAGA made calls on social media for them to replace Bad Bunny as the entertainer for the Super Bowl halftime show this year. TurningPoint USA is hosting a counterprogram halftime show, with a lineup that includes Kid Rock. Some social media users expressed upset that Creed wasn’t present on that lineup when it was announced. Criticism has been directed at Kid Rock ahead of the TurningPoint USA concert over past lyrics. The lyrics of his 2001 song “Cool, Daddy, Cool” have attracted scrutiny. Specifically, the line “Young ladies, young ladies, I like ‘em underage, see some say that’s statutory (but I say it’s mandatory)” has been criticized. As has the line “I got kids I've never seen/And their momma's 17,” from the 2007 song Lowlife (Living the Highlife). The TurningPoint USA concert pledges “faith, family and freedom.” Some argue that Kid Rock’s lyrics go against that pledge. What People Are Saying Shinedown, in a statement shared to Facebook: “SHINEDOWN is everyone’s band. We feel that we have been given a platform to bring all people together through the power of music and song. We have one BOSS, and it is everyone in the audience. Our band’s purpose is to unite, not divide. With that in mind we have made the decision that we will not be playing the Rock The Country Festival.” Representative Shri Thanedar, a Michigan Democrat, said in an February 4 X post: “’I like 'em underage, see, some say that's statutory, but I say it's mandatory.’ -Kid Rock. This is who the Vice President is promoting. No surprise here, sounds like the kind of guy he’d normally be sucking up to.” John Bourrscheid, an entrepreneur, in a post on X viewed over 70,000 times: “Kid Rock makes music for people who know the street value of copper pipe.” Erika Kirk told guest host Trace Gallagher on Fox News' The Story with Martha MacCallumon Wednesday: “For us to be able to provide an alternative that's pro-America, that's just pro everything, that that's not the opposite of what they're putting out there, I don't want to go into details and bash that, because there's apparently an audience that wants that… But there's a larger audience that wants ours. And so we are going to make it very amazing. I'm so excited.“ What Happens Next? It remains to be seen whether Creed will perform on another date or address the cancellation of the date.","summary":"The move follows multiple artists withdrawing or being removed from the lineup of Rock the Country.","url":"https://www.newsweek.com/creed-kid-rock-festival-website-line-up-shinedown-turning-point-usa-11482934","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/32-Split-Screen-2026-02-07T145256.432.png?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-07 16:37:45","author":"Marni Rose McFall","authors":["Marni Rose McFall"],"language":"en","source_country":"US","sentiment":0.032},{"id":400415114,"title":"Trump won't apologize for posting since-deleted racist video of Obamas: 'I didn't make a mistake'","text":"Donald Trump is doubling down on a racist video posted to his Truth Social account.\n\n On Friday, the president responded to a journalist asking if he would apologize for the since-deleted AI-generated video that appeared on Trump's official Truth Social page, which featured a depiction of Barack and Michelle Obama's faces superimposed onto the bodies of apes.\n\n \"No, I didn't make a mistake,\" Trump said while speaking to a group of reporters on Air Force One, confirming that he will not apologize for the post.\n\n Set to the Tokens' song \"The Lion Sleeps Tonight,\" the video also featured Trump's face superimposed onto a lion, and depicted other political figures as animals, including a monkey version of Joe Biden and a turtle version of Kamala Harris.\n\n Entertainment Weekly previously learned that the video was posted erroneously by a White House staffer and has since been taken down.\n\n However, Trump's further comments on the matter on Friday suggest that he personally approved the post.\n\n \"I mean, I look at a lot of thousands of things. I looked at the beginning of it. It was fine,\" the president said of the video. \"I guess it was a takeoff on The Lion King and certainly it was a very strong post in terms of voter fraud.\" (Trump has repeatedly made false claims about election interference in every presidential election in which he has participated.)\n\n The president did seemingly acknowledge that the last section of the video, which featured the Obama monkey imagery, was more problematic than the rest of the footage, and claimed that he had no knowledge of that portion of the video when it was posted.\n\n \"Nobody knew that that was in the end,\" he said. \"If they would have seen it and probably they would have had the sense to take it down.\"\n\n When later asked if the Truth Social post could hurt Republicans with Black voters, Trump said no and went on to tout his achievements\n\n \"I've done great with Black voters... I've been great to them, Black voters have been great to me,\" he said. \"And I am, by the way, the least racist president you've had in a long time, as far as I'm concerned.\"\n\n White House Press Secretary Karoline Leavitt previously tried to defend the video as a Lion King parody.\n\n \"This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King,\" she told PEOPLE of the video on Friday. \"Please stop the fake outrage and report on something today that actually matters to the American public.\"\n\n The video, which played into the racist trope of dehumanizing Black people by comparing them to primates, drew outrage from politicians on both sides of the aisle. \n\n \"The President's post is wrong and incredibly offensive — whether intentional or a mistake — and should be deleted immediately with an apology offered,\" Mike Lawler, a Republican Congressman from New York, wrote on social media.\n\n Get your daily dose of entertainment news, celebrity updates, and what to watch with our EW Dispatch newsletter.\n\n \"Trump posted a disgustingly racist video depicting the Obamas as apes,\" Bernie Sanders, a Democratic senator from Vermont, posted on X. \"Are my Republican colleagues going to continue to bend the knee to a racist, authoritarian president who wants the American people to bow down before him?\"\n\n Tim Scott, a Republican senator from South Caroline, wrote, \"Praying it was fake because it's the most racist thing I've seen out of this White House. The President should remove it.\"","summary":"The video featured footage depicting Barack and Michelle Obama as apes.","url":"https://ew.com/trump-wont-apologize-for-racist-video-obamas-11902024","image":"https://ew.com/thmb/by0vAOxHbdNyxnZb0LQ9rtQ43q8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Donald-Trump-Barack-Obama-Michelle-Obama-020726-437eb00723804302803793ace2858758.jpg","video":null,"publish_date":"2026-02-07 16:37:15","author":"Staff Author","authors":["Staff Author"],"language":"en","source_country":"US","sentiment":-0.379},{"id":400416324,"title":"Some Democrats Are Fighting Back Against the 'Interest Group Questionnaire Industrial Complex'","text":"As you've already guessed, Democrats do things a little differently. \n\n“These questionnaires, and more broadly the interest groups, are hurting our chances of winning,” Rohan Patel told Politico's Jonathan Martin. Patel and Seth London head up a new group called \"Majority Democrats.\" Centrist party members who recognize that the Democrats have been captured by crazies formed it in the aftermath of the 2024 electoral disaster. \n\n“They all have their own niche questionnaires, some of which are so broad as to be almost absurd, 20 to 30 pages of questions that don’t always have anything to do with their actual issue focus,\" Patel added.\n\nThe questionnaires have proven to be a trap for most Democrats who try not to run to the left of Che Guevara, but who are forced to adopt crazy positions due to \"litmus tests\" that \"The Groups\" (generic term for the left-wing advocacy groups) make into an ideological gauntlet that a candidate is forced to run if they want their support.\n\nKamala Harris fell into such a trap in 2024. She filled out an ACLU questionnaire in 2020, where she answered a question about federal funding for sex changes for transgender prisoners. Her affirmative answer came back to haunt her in Trump's most effective ad of the campaign ( \"Kamala is for they/them, President Trump is for you!\")\n\nPatel said the transgender question was “one of about 20 questions that were absolutely deranged.” \n\nAs Patel and London will post on a site they’re calling “The Questionable,” other groups have asked candidates to commit to federally mandated 32-hour workweeks, halting the expansion of all fossil fuel projects and signing broadly-worded pledges on criminal justice that Republicans happily portray as defunding the police.It’s the first notably aggressive effort by Majority Democrats to confront their own coalition a year after the group formed in the wreckage of the 2024 campaign. And the offensive goes deeper than merely criticizing the forms, which are a symptom of a broader challenge confronting the party — namely the role of “The Groups,” online shorthand for the constellation of left-leaning advocacy organizations, and the campaign-to-government-to-groups staffer ecosystem which perpetuates their influence.“In a normal, functioning environment, the party and the aligned institutions of the party would push back on this,” said London.\n\nBut Democrats can't \"push back\" on the radicals because The Groups now are the party. There is no campaign without them. They not only provide the cash to run competitive campaigns, but they are also a major source of the bright young men and women who staff them. And the bulk of foot soldiers who stuff envelopes, knock on doors, and man the phones in get-out-the-vote efforts are activist members of The Groups. \n\nThe 2024 \"autopsy\" that the mainstream party ordered will never see the light of day. That's because word is that it skewers the \"Interest Group Questionnaire Industrial Complex,\" primarily blaming them for the debacle. Party leaders decided discretion was the better part of valor, and rather than offend the sensibilities of the activists, hide their dirty laundry for another day.\n\nDemocrats are also fighting structural challenges to winning elections. The Electoral College is becoming an increasingly difficult hurdle to overcome as voters move from high-tax blue states to low-tax red states. Even with gerrymandering, Democrats' margin for error in House races is shrinking, and they are not competitive in large swaths of the country for Senate seats.\n\nConsider: When Barack Obama was first sworn in as president, his party had five of the six Senate seats in Montana and the two Dakotas. Now Republicans have all six.Yes, winning a bare Senate majority, breaking the filibuster and then granting Washington, D.C. and Puerto Rico statehood is one path to additional Senate seats. Yet that still won’t better the party’s chances across the South and Great Plains, which are vital to building a majority with cushion.“You look at the next two to three Senate cycles, we’ll be scratching and clawing to get and hold 50 or 51 seats,” as London put it.\n\nThey have no chance of winning any sustained majority as long as their candidates hold the most radical, most off-putting positions in most of the country. They are rapidly being relegated to a coastal, big-city, college-town party, with no hope of affecting the kind of change their candidates promise.\n\nThat's a sure way for the Democrats to remain irrelevant for the foreseeable future.","url":"https://pjmedia.com/rick-moran/2026/02/07/some-democrats-fighting-back-against-the-interest-group-questionnaire-industrial-complex-n4949230","image":"https://media.townhall.com/cdn/hodl/2018/283/735115af-5979-4cd7-839d-6e802f1cdfbe.jpg","video":null,"publish_date":"2026-02-07 16:13:00","author":"Rick Moran","authors":["Rick Moran"],"language":"en","source_country":"us","sentiment":-0.006},{"id":400403024,"title":"Trump refuses to apologise over Obama monkey video","text":"US President Donald Trump refused to apologise for a video showing Barack and Michelle Obama as monkeys. The clip, posted on his Truth Social account, sparked outrage across the US political spectrum. The White House later blamed the post on a staff error, but Trump defended the claims about election fraud.\n\nThe video, about one minute long, briefly depicted the Obamas’ faces on monkeys while promoting false claims about Dominion Voting Systems. Democrats called the post “vile” and racist, while some Republicans also condemned it. Trump claimed he did not watch the full video and delegated its posting to staffers.\n\nRead more: Trump deletes ‘racist’ video post of Obamas as monkeys\n\nFormer Vice President Kamala Harris criticised the White House cover-up on X, saying “no one believes this excuse.” Republican Senator Tim Scott, the only Black senator, called the video “the most racist thing I’ve seen from this White House.” Others urged Trump to remove it and apologise.\n\nTrump has a long history of racially charged attacks on Obama, including the “birther” conspiracy. During his second White House term, he frequently used AI-generated visuals to mock opponents and rally his conservative base. Democrats argue that such acts contribute to rising divisive rhetoric in the US.\n\nRead more: Trump faces backlash over racist Obama video\n\nCivil rights experts note that racism in the US persists despite decades of legal progress. Federal anti-discrimination programs aim to counter inequality, but critics say Trump’s actions undermine decades of efforts. The incident highlights the growing political polarization over race, media, and digital misinformation.","url":"https://dailytimes.com.pk/1447739/trump-refuses-to-apologise-over-obama-monkey-video/","image":"https://dailytimes.com.pk/assets/uploads/2026/02/07/obama-convert.io-1.jpg","video":null,"publish_date":"2026-02-07 15:45:39","author":"Attia Naveed","authors":["Attia Naveed"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.539},{"id":400489304,"title":"People Just Noticed The Subtle Change Kamala Harris Made To Her New Gen Z Account Username, And They're Calling It \"Even More Stupid\"","text":"\"Using the 67 meme to appeal to young people is just so deeply insulting to our intelligence. We want good jobs, green spaces, affordable homes, community, and a habitable planet. Speaking to us through a washed-up TikTok trend is infantilizing. Is it not?\" one account wrote in response.","summary":"\"It looks even more stupid.\"\n\nView Entire Post &rsaquo;","url":"https://www.buzzfeed.com/michaelabramwell/kamala-harris-gen-z-account-username-change-cringe","image":"https://img.buzzfeed.com/buzzfeed-static/static/2026-02/06/15/thumb/2QuqVUpYCF.jpg?crop=1245:830;2,0&resize=1250:830&resize=1200:*","video":null,"publish_date":"2026-02-07 14:52:12","author":"https://www.buzzfeed.com/about,Michaela Bramwell","authors":["https://www.buzzfeed.com/about","Michaela Bramwell"],"language":"en","source_country":"au","sentiment":-0.188},{"id":400414282,"title":"Kamala Harris' Gen Z Username Change Is Going Viral","text":"\"Using the 67 meme to appeal to young people is just so deeply insulting to our intelligence. We want good jobs, green spaces, affordable homes, community, and a habitable planet. Speaking to us through a washed-up TikTok trend is infantilizing. Is it not?\" one account wrote in response.","url":"https://www.buzzfeed.com/michaelabramwell/kamala-harris-gen-z-account-username-change-cringe?origin=hfspl&open_comments=on","image":"https://img.buzzfeed.com/buzzfeed-static/static/2026-02/06/15/thumb/2QuqVUpYCF.jpg?crop=1245:830;2,0&resize=1250:830&resize=1200:*","video":null,"publish_date":"2026-02-07 14:52:12","author":"Michaela Bramwell","authors":["Michaela Bramwell"],"language":"en","source_country":"us","sentiment":-0.188},{"id":400414280,"title":"Kamala Harris' Gen Z Username Change Is Going Viral","text":"\"Using the 67 meme to appeal to young people is just so deeply insulting to our intelligence. We want good jobs, green spaces, affordable homes, community, and a habitable planet. Speaking to us through a washed-up TikTok trend is infantilizing. Is it not?\" one account wrote in response.","url":"https://www.buzzfeed.com/michaelabramwell/kamala-harris-gen-z-account-username-change-cringe?origin=hfspl","image":"https://img.buzzfeed.com/buzzfeed-static/static/2026-02/06/15/thumb/2QuqVUpYCF.jpg?crop=1245:830;2,0&resize=1250:830&resize=1200:*","video":null,"publish_date":"2026-02-07 14:52:12","author":"Michaela Bramwell","authors":["Michaela Bramwell"],"language":"en","source_country":"us","sentiment":-0.188},{"id":400401222,"title":"Karoline Leavitt&#039;s Response to Trump&#039;s Obama Ape Post Under Scrutiny","text":"Karoline Leavitt’s attempt to depict President Donald Trump’s video showing Barack and Michelle Obama as apes as a “meme”, based on Disney classic ‘The Lion King’, has triggered a deluge of comments on social media criticizing the White House press secretary. In a statement shared by the BBC and other news media, Leavitt said of the video, which has been bashed by both Democrats and Republicans as racist, was “an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from the Lion King.” White House Press Secretary Karoline Leavitt answers questions during a news briefing in the James S. Brady Press Briefing Room of the White House on February 5, 2026 in Washington, D.C. But there are no apes in ‘The Lion King,’ political commentators and social media users were quick to point out—only a mandrill, Rafiki. Why It Matters Trump has been attacking the Obamas for years in a way that many have described as rooted in racism. Before being elected to his first term, Trump repeatedly spread false claims saying that Hawaii-born Barack Obama was in fact not born in the U.S. and should have been ineligible for president. On this occasion, Trump claimed that he did not see the full content of the 62-second video he posted on social media this week, which depicted the Obamas as apes under the notes of ‘The Lion Sleeps Tonight.’ While the video has since been removed from the president’s social media profile amid bipartisan outrage, the president has refused to apologize, saying he did not make a mistake. Asked if he condemned the racist part of the video, he said: “Of course I do.” But this is hardly the first time the president has been accused of racist behavior. The Trump administration has been accused of discrimination and bigotry amid its rollback of diversity, equity and inclusion (DEI) programs since the president’s return to the White House. The backlash on this particular video is also unlikely to convince the Trump administration to curb its growing use of AI-generated imagery to boast about its anti-immigration efforts and attack political opponents. What To Know The video was posted on Trump’s Truth Social account at 11:44 p.m. ET on Thursday night, allegedly by a staffer and not by the president himself. Most of the clip appeared to be drawn from a conservative video that falsely alleges deliberate tampering with voting machines in battleground states during the 2020 presidential vote count. A longer version of the video was first published by conservative meme creator Xerias in October on his X account. In it, Trump appears as the King of the Jungle while former president Joe Biden is shown as an ape eating a banana. Former U.S. President Barack Obama (L) greets former first lady Michelle Obama as he arrives to speak on stage during the second day of the Democratic National Convention at the United Center on August 20, 2024, in Chicago, Illinois. Delegates, politicians, and Democratic Party supporters are gathering in Chicago, as current Vice President Kamala Harris is named her party's presidential nominee. While the video posted on Thursday has been bashed by both Democrats and Republicans, key figures in the Trump administration have defended it, including Leavitt. In a statement shared with news media, Leavitt called for journalists to “please stop the fake outrage and report on something today that actually matters to the American public.” But her claim that the video, which tapped into a long and ugly history of representing Black people as primates in racist caricatures, was a meme based on ‘The Lion King’ has rubbed people on social media the wrong way. “But there are no gorillas in The Lion King,” Huffington Post’s deputy editor Philip Lewis wrote on X. “I said there are no apes in The Lion King, and these dumbass MAGAs are posting photos with monkeys in the comments trying to prove me wrong,” progressive commentator Alex Cole wrote on the social media platform, commenting on images showing monkeys in the Disney film which are not primates. “These people are inherently stupid. They literally don’t know the difference.” Journalist Jake Tapper said live on CNN: “There are no apes in The Lion King. For those wondering, Rafiki is a mandrill.” What People Are Saying Trump told reporters while aboard Air Force One on Friday of the video: “I guess during the end of it, there was some kind of picture people don’t like. I wouldn’t like it either, but I didn’t see it. I just, I looked at the first part, and it was really about voter fraud.” He added: “We took it down as soon as we found out about it.” Republican Senator Tim Scott, who is black, described the video as “the most racist thing I've seen out of this White House” in a statement shared by BBC. John Curtis, a Republican Senator from Utah, wrote on social media that the video was “blatantly racist and inexcusable.” The office of California Governor Gavin Newsom wrote on X about the video shared by Trump: “Disgusting behaviour by the president. Every single Republican must denounce this. Now.” Illinois Governor JB Pritzker wrote on X: “Donald Trump is a racist.” What Happens Next The Obamas are yet to comment on the video. Their first public comment since the incident has been to wish the U.S. team good luck at the Milan-Cortina Winter Olympics, which kicked off in Italy on Friday.","summary":"Leavitt said the video was “a meme” based on ‘The Lion King’. But there are no apes in the film, people were quick to point out.","url":"https://www.newsweek.com/karoline-leavitt-response-trumps-obama-ape-post-under-scrutiny-11482578","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/GettyImages-2260100849.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-07 14:39:08","author":"Giulia Carbonaro","authors":["Giulia Carbonaro"],"language":"en","category":"politics","source_country":"US","sentiment":-0.412},{"id":400389198,"title":"Texas just got a preview of how Democrats take over","text":"Last week, Democrats flipped a formerly red county blue in a special election in Texas Senate District 9, which covers part of Fort Worth and the neighboring suburbs of Keller and North Richland Hills. Taylor Rehmet, a young machinist with no political experience, beat Republican Leigh Wambsganss by more than 14 points.\n\nPolitical commentator Bill King flagged the scale of the shift. He noted that Republican Kelly Hancock won the seat by 20 points in 2022 and that Donald Trump beat Kamala Harris in the district by 17 points in 2024. A loss like this should worry Republicans heading into the midterms later this year.\n\nIn Texas and other red states, Republicans need to meet voters where they live.\n\nSo, what happened?\n\nSome Republicans blame turnout. They argue the county hasn’t turned left; Democrats simply showed up and Republicans stayed home. On that theory, the result reflects motivation, not the district’s real preferences.\n\nThat explanation doesn’t hold.\n\nA Republican candidate has the same opportunity to motivate voters as a Democrat. In a district with a large conservative majority, the Republican should enjoy a built-in advantage. She needs only a fraction of her base to turn out. The Democrat needs near-perfect performance from his side.\n\nKing also argues the result fits a broader trend. He says the numbers match polling over the last year and signal growing negativity toward Texas’ Republican leadership. Low turnout didn’t create the result so much as reveal it.\n\nRehmet’s win still doesn’t guarantee Democrats will take over Texas. But it does show a tactic that keeps working: Democrats run as generic moderates, keep the party label in the background, and dare Republicans to make the race about cultural signaling instead of daily life.\n\nAs writer Bill Scher noted in Washington Monthly, Rehmet didn’t “wrap himself in a Democratic flag.” Much like his counterparts in Virginia and New Jersey, he leaned on military service and blue-collar credibility. That presentation persuaded enough voters.\n\nRELATED: This is what happens when a state elects a ‘moderate’ Democrat\n\n Kendall Warner/The Virginian-Pilot/Tribune News Service via Getty Images\n\nThat strategy works in the short term. It doesn’t last.\n\nIf and when he’s seated, Rehmet will vote as a Democrat. He will support open borders, softer law enforcement, higher spending, expanded abortion access, and the full suite of progressive social priorities. At best, he will block conservative reforms. At worst, he will push the same policies that Texans have seen wreck other places.\n\nVoters in Tarrant County will learn the hard way what “affordability” talk usually delivers under Democratic rule: higher taxes, fewer opportunities, rising crime, and sanctimonious lectures about “reproductive rights,” all while public services strain under the load.\n\nSo, what does this election signal?\n\nMore Democrats will copy the Rehmet template. They will present themselves as normal, moderate, and practical. They will try to bait Republicans into fighting on secondary culture-war terrain instead of hammering a concrete agenda on costs, housing, and public safety. Wambsganss fell into that trap.\n\nRELATED: Democrats are running as Bush-era Republicans — and winning\n\n Photo by Reginald Mathalone/NurPhoto via Getty Images\n\nIn Texas and other red states, Republicans need to meet voters where they live. Prices keep climbing, and housing tops the list. I live in this part of the state and see the pressure every day.\n\nMassive in-migration from other states (particularly California and Illinois), along with continued inflows from abroad (especially from South Asia), has driven up prices and changed the character of communities fast. Many newcomers are decent people. The economic effect still hits hard: higher rents, higher home prices, heavier traffic, and more strain on schools, roads, and emergency services. Property taxes keep rising to cover it.\n\nRepublicans should say that plainly, then offer an agenda that meets the moment. They should outline feasible steps to lower costs, expand housing supply where it makes sense, reduce regulatory friction, and protect public safety.\n\nThey should also draw the contrast without flailing: Democratic governance has turned too many prosperous places into expensive, dysfunctional messes. Texans don’t need to import that model.\n\nVoters in red states also need to stop falling for the same performance. Democrats haven’t changed. They’ve changed the packaging.\n\nThey will do to the Lone Star State what they did to the Golden State. They will do to Dallas-Forth Worth what their allies have done to New York City. Texans should treat this moment as a warning, not a fluke: Stay alert, see through the ruse, and vote like it matters — because it does.","url":"https://www.theblaze.com/columns/opinion/texas-just-got-a-preview-of-how-democrats-take-over","image":"https://www.theblaze.com/media-library/texas-just-got-a-preview-of-how-democrats-take-over.jpg?id=63913338&width=1200&height=600&coordinates=0%2C140%2C0%2C141","video":null,"publish_date":"2026-02-07 14:30:00","author":"Auguste Meyrat","authors":["Auguste Meyrat"],"language":"en","category":"politics","source_country":"us","sentiment":-0.005},{"id":400407332,"title":"Fox News Host Corners Leavitt on Trump’s Vile Post","text":"Fox News anchor Laura Ingraham sharply questioned the White House on Friday for their wavering explanation and slow handling of President Donald Trump’s racist social media post targeting the Obamas. \n\nTrump posted the racist video to his Truth Social overnight on Friday, which at the end depicted Barack and Michelle Obama as apes, a racist trope. \n\n“Karoline, I know the president did remove it, he deleted it, but it was up for, I think 12 hours or something like that. How did this happen? And can you really throw a staffer under the bus for this?” Ingraham asked White House Press Secretary Karoline Leavitt on The Ingraham Angle.\n\n“Well look Laura, it was a meme that was posted by a staffer on the president’s Truth Social account,” Leavitt responded. \n\n“It was from a Lion King video depicting, as you pointed out, different Democrats as different animals. I think Kamala Harris was depicted as a turtle in this video meme,” Leavitt laughed. \n\nLeavitt continued that Trump had spoken with lawmakers that day “out of respect for them” and removed the post. \n\n“But leave it to the leftist media, of course, to talk about this all day, rather than talk about the fact that the DOW has broken over 50,000 points for the first time,” Leavitt complained. \n\nThe president posted the video with the racist clip in a longer video pushing an unfounded conspiracy about voting machines in the 2020 election. The post remained on Trump’s social media account for 12 hours before it was taken down.\n\nWhite House Press Secretary Karoline Leavitt originally defended the president for his racist post.\n\n “This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King. Please stop the fake outrage and report on something today that actually matters to the American public,\" she said in a statement to several news outlets.\n\nThe White House later deleted the post, claiming instead a staffer had “erroneously made the post.” \n\nTrump’s own explanation does not align with the official White House’s explanation that a staffer made the post. The president confirmed that he watched the video and posted it.\n\n“I looked at the beginning of it. It was fine,” Trump said Friday evening.\n\nWhen asked by reporters if he would apologize amid calls from his own party to do so, he declined.","summary":"The Ingraham Angle/Fox NewsFox News anchor Laura Ingraham sharply questioned the White House on Friday for their wavering explanation and slow handling of President Donald Trump’s racist social media post targeting the Obamas. \n\nTrump posted the racist video to his Truth Social overnight on Friday, which at the end depicted Barack and Michelle Obama as apes, a racist trope. \n\nThe post was met with swift criticism from both Democrats and Republicans, notably from Sen. Tim Scott, a staunch Trump ally and the only Black Republican in the Senate.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/fox-new-host-corners-leavitt-on-trumps-vile-post/","image":"https://www.thedailybeast.com/resizer/v2/SOWXWW36AFAVBLS63CH6HQ2KNE.png?smart=true&auth=2ea895fab903a330cfb7032fd996120a24e47fd8ef28ec69c419e097574fcfaa&width=1200&height=675","video":null,"publish_date":"2026-02-07 14:23:50","author":"Annabella Rosciglione","authors":["Annabella Rosciglione"],"language":"en","category":"politics","source_country":"us","sentiment":-0.569},{"id":400383136,"title":"The Truth About the ‘Racist’ Video Trump Posted That the Left Doesn’t Want You to Know","text":"The uproar over the Trump video tells you more about the left’s narrative machine than it does about what actually happened. What they want you to see is “Trump posts racist monkey video about the Obamas.” What they do not want you to see is context, intent, or basic honesty about how the clip ended up on his Truth Social feed in the first place.\n\nLet’s get something out of the way: the post should never have been made, and whoever was responsible was careless for not previewing the entire video first.\n\nThe original post from Trump’s Truth Social account was about voter fraud and election integrity, not about the Obamas.\n\nThe clip featured Colonel Phil Waldron talking about problems with Dominion and Smartmatic voting systems, which is exactly the kind of content that sends Democrats and their media allies into a complete meltdown on its own. After more than a minute of election-fraud material, a preexisting Lion King–style meme sequence auto-played at the end, showing various political figures as jungle animals, including Barack and Michelle Obama briefly depicted as monkeys. That tail-end meme lasted only a few seconds, and was tacked onto the fraud content like a reels-style add‑on.\n\nHere’s the source of Trump’s Truth post.It’s a downloadable video that Trump then reuploaded. The Lion King meme briefly appears at the end—after one whole minute—and was likely never seen by Trump.Every journalist who peddled this hoax should be fired for malpractice. https://t.co/CFbKU4wTf0 pic.twitter.com/WaWpMumSOv— johnny maga (@_johnnymaga) February 6, 2026\n\nOf course, if you believed the posts of left-wing social media influencers, elected Democrats, and media outlets posting about it, you would think it was just the video of the Obamas that was posted, as if that had been the intention of the post. It was not.\n\nIt’s pretty clear that the Obama Monkey video was a reels auto play at the end of a screen recording of an election fraud video which is the video Trump actually shared. pic.twitter.com/rQtNQsdOwa— Mostly Peaceful Memes (@MostlyPeaceful) February 6, 2026\n\nHere is the part that keeps getting “forgotten” in the coverage. The Trump team did not create the monkey imagery. It came from an internet meme video that has been circulating for months, portraying Trump as the lion — the king of the jungle — with Democrats as Lion King–type characters and other primates, including Joe Biden as a monkey eating a banana.\n\nThe same video that depicts Barack Obama and Michelle Obama as apes, also depicts Joe Biden as a chimpanzee, Kamala Harris as a turtle, Hakeem Jeffries as a lemur, and Whoopie Goldberg as a hippo.In other words, it's just more manufactured outrage from the desperate left. pic.twitter.com/E48O6vF0h0— Thomas Hern (@ThomasMHern) February 7, 2026\n\nSomeone had already edited all of that together, and a screen-grabbed version was posted on X. That pre-made meme was then downloaded and re-uploaded to Truth Social without anyone on the Trump team reviewing the entire video and seeing the few seconds of monkey imagery at the tail end. The watermark change alone gives away that this was two separate videos, with the Lion King video autoplaying at the end.\n\nThe White House initially responded by calling it what it was: a meme video. “This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King. Please stop the fake outrage and report on something today that actually matters to the American public,” Press Secretary Karoline Leavitt said Friday.\n\nThat statement was exactly right. The reaction exposed what the left really cares about. They are happy to let a meme about Trump as a lion and Democrats as cartoon animals go viral as long as they can isolate a few frames and scream “racism” on command.\n\nA senior official later admitted that a White House staffer had erroneously posted it and confirmed it had been taken down. The video stayed live for roughly 12 hours before it was removed. Whoever posted it should have watched the whole thing and noticed the ending. Sadly, this is kind of how things go with Trump’s social media accounts. Trump is no stranger to posting binges and saying things he shouldn’t. His reaction to the murder of Rob Reiner and his wife was is a prime example. But I’ve never really gotten the impression that Trump, or whoever else handles his social media when he’s not doing so, is being cautious about the links or videos being shared.\n\nStill, this whole situation has once again exposed a blatant double standard on the part of the media and the left. Joe Biden has a long record of making racist comments during his career, even preceding his time in the White House. From his opposition to desegregation to his infamous “you ain’t black” comment during the 2020 campaign, none of that mattered to Democrats when they made him their nominee. Heck, Kamala Harris’s big moment of the 2020 Democratic primary was attacking Biden as a racist.\n\nFlashback: The Top 7 Racist Comments Made by Joe Biden Over the Years\n\nThis controversy will fade. It was a communications screwup, not some grand act of racial malice, and the facts make that clear to anyone willing to look. Of course, it is still a reminder that Trump cannot afford sloppy mistakes in a media environment that salivates at every chance to shout “racist” during a crucial midterm election year. The left does not want you to know the whole story behind this video, because it would expose its selective outrage and its fear of the real issues Trump actually raised.\n\nIt doesn’t change the fact that the video should have been screened in its entirety first, but it’s not the blatant racism Democrats want you to believe it is, either.\n\nWant to support fearless journalism that exposes the left and tells the stories the media won’t? PJ Media delivers the truth and holds the powerful accountable. Become a VIP member today—your support fuels our mission and unlocks exclusive content, podcasts, an ad-free experience, and more. \n\nUse code FIGHT for 60% off. It's a great time to join our movement. Join now and stand for America-first journalism!","url":"https://pjmedia.com/matt-margolis/2026/02/07/the-truth-about-the-racist-video-trump-posted-the-left-doesnt-want-you-to-know-n4949227","image":"https://media.townhall.com/cdn/hodl/2017/128/eb6cb5b3-49e8-462f-9a82-e2db9952d8bf.jpg","video":null,"publish_date":"2026-02-07 14:20:00","author":"Matt Margolis","authors":["Matt Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.196},{"id":400414418,"title":"The Ingraham Angle - Friday, February 6","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode February 07, 2026 40:34 \n FULL EPISODE\n\n EXP 7 DAYS\n The Ingraham Angle - Friday, February 6 \n Nancy Guthrie, Trump, Democrats, Nazi, Dow, Kamala Harris\n Tags MOST RECENT EPISODES | VIDEOSTHE INGRAHAM ANGLE | FULL EPISODES","summary":"Nancy Guthrie, Trump, Democrats, Nazi, Dow, Kamala Harris","url":"https://www.foxnews.com/video/6388925723112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/07166eca-5431-4aa0-a479-e1ce978f61f2/283a8a54-92ba-4e06-a96c-b764a1788943/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2026-02-07 14:06:10","author":null,"language":"en","source_country":"us","sentiment":-0.439},{"id":400414428,"title":"Lara Trump on RNC's TikTok launch to court young voters, Harris campaign's missteps","text":"to top close Video This video is playing in picture-in-picture.\n\nFox And Friends February 07, 2026 04:06 \n\n Lara Trump on RNC's TikTok launch to court young voters, Harris campaign's missteps \n Lara Trump joins 'Fox & Friends Weekend' to discuss the RNC's TikTok launch to court young voters and comments on the Kamala Harris campaign's social media handle change after public backlash.\n Tags MEDIADEMOCRAT ELECTIONSKAMALA HARRISSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRFOX & FRIENDS WEEKENDV-VIDEOPERSONALITIESPERSONAL TECH","summary":"Lara Trump joins &apos;Fox &amp; Friends Weekend&apos; to discuss the RNC&apos;s TikTok launch to court young voters and comments on the Kamala Harris campaign&apos;s social media handle change after public backlash.","url":"https://www.foxnews.com/video/6388925415112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/4c21c733-5cab-4d66-a7c3-057222cabb38/2d6f5d38-550b-461c-a417-831353d7b75e/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2026-02-07 14:04:11","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.45},{"id":400382730,"title":"Will 'One Battle After Another' ride the anti-ICE protest wave to Best Picture at the Oscars?","text":"The film that's been praised by critics for its timeliness may be benefiting from the news cycle at the right time. \"One Battle After Another,\" Paul Thomas Anderson's politically-charged thriller, has maintained its frontrunner status for Best Picture at this year's Oscars since the fall. If you read my review, then you'd know I recommended it for those who are able to compartmentalize their personal politics because it's very left-wing. It's about a group of self-described revolutionaries on the run from a cabal of white nationalist authoritarians. The opening scene literally depicts them freeing illegal migrants from a detention center — not to mention that they also bomb courthouses and offices of anti-abortion lawmakers. One man's revolutionary is another man's domestic terrorist. ‘SEND HELP’ REVIEW: RACHEL MCADAMS, DYLAN O'BRIEN LEAD COMICALLY VIOLENT DESERT ISLAND THRILLER Putting that aside, \"OBAA\" is a well-made film. Despite its nearly 3-hour running time, it never lags. The performances from the cast led by Leonardo DiCaprio, the score, the editing were top-notch. Would I give it Best Picture? No. 2025 was a weaker year for films overall — I'd vote for \"Hamnet\" if I was a member of the Academy — nonetheless, a Best Picture win was always feasible. Now, with all the turmoil that's unfolded in Minnesota, a Best Picture win may already be locked up. ‘MERCY’ REVIEW: CHRIS PRATT MUST PROVE HIS INNOCENCE TO AI JUDGE IN FORGETTABLE CYBER THRILLER \"OBAA\" won the Golden Globe for Best Comedy or Musical (it's neither a comedy nor a musical. Don't even get me started on how films and TV shows are classified at the Golden Globes). It has since received 13 Oscar nominations, more than any other film besides Ryan Coogler's vampire thriller \"Sinners,\" shattering records with its 16 nominations. But the current political climate will likely propel \"OBAA\" in the Best Picture race. Liberal Hollywood isn't shy about making a statement. Just look at all the \"Be Good\" pins worn at the Golden Globes honoring Renee Good and the marathon ICE bashing at the Grammys last week. They'll use \"OBAA\" as a giant \"F you\" to Donald Trump and his administration despite the irony that \"OBAA\" would've been released regardless of whether Trump or Kamala Harris won the 2024 election. ‘28 YEARS LATER: THE BONE TEMPLE’ REVIEW: RALPH FIENNES BRINGS LEVITY TO EXPERIMENTAL ZOMBIE SAGA On top of that, many in the Academy probably feel that Paul Thomas Anderson is finally owed an Oscar. Anderson is now a 14-time nominee and was previously snubbed for films like \"Boogie Nights,\" \"Magnolia\" and \"There Will Be Blood.\" In other words, he'll get the same treatment as Christopher Nolan did two years ago with his Best Picture winner \"Oppenheimer\" after going decades without a win. Between national politics and Academy politics, the wind is surely hitting the back of \"OBAA.\" Are there chances for there to be an upset? Of course, \"Sinners\" — surpassing previous record holders \"Titanic,\" \"La La Land\" and \"All About Eve\" in total nominations — is clearly adored by the Academy and will likely nab a few trophies in the craft categories. But as we've seen before like last year with \"Emilia Pérez,\" having the most nominations doesn't always translate to a Best Picture win. And the Academy may believe that since 39-year-old Coogler will likely have a long career ahead of him as a writer and director, voters will wait before giving him an Oscar and hand it to 55-year-old Anderson instead. 'PRIMATE' REVIEW: PARAMOUNT COMES OUT SWINGING IN 2026 WITH WILD HORROR FLICK ABOUT A NIGHTMARE PET CHIMP \"Hamnet\" may be the darkest of dark horses in this race. It did pull an upset over \"Sinners\" in winning Best Drama at the Golden Globes, though notably has an entirely different body of voters (mostly foreign press). However, the Academy has increasingly welcomed more and more foreign filmmakers and actors in recent years, which is why we've seen more and more foreign films being nominated for Best Picture. They may rally behind the Shakespeare family drama over the very America-centric \"OBAA\" and \"Sinners.\" However, perhaps working against \"Hamnet\" is the fact that its writer/director Chloé Zhao just won two Oscars for her work on the 2021 Best Picture winner \"Nomadland.\" The only true indicators that will affirm the frontrunner status of \"OBAA\" between now and the Oscars are how the various guild awards play out in the coming weeks, mainly the Producers Guild Awards, the Directors Guild Awards, the Writers Guild Awards and the Screen Actors Guild Awards (now called the Actor Awards) since many guild voters are also Academy voters. If \"OBAA\" sweeps those, it will be incredibly likely a Best Picture win will follow. If other films like \"Sinners\" and \"Hamnet\" emerge as big winners, that could spice up the race. With all of that in mind, \"OBAA\" still has the edge. And since the firestorm over ICE isn't likely to melt away anytime soon, \"OBAA\" will almost certainly be our next Best Picture winner. CLICK HERE TO GET THE FOX NEWS APP","summary":"Paul Thomas Anderson&apos;s &quot;One Battle After Another&quot; is well-positioned in the Oscars race, particularly with the anti-ICE sentiment that has dominated liberal Hollywood.","url":"https://www.foxnews.com/opinion/one-battle-after-another-ride-anti-ice-protest-wave-best-picture-oscars","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/one-battle-after-another-2.jpg","video":null,"publish_date":"2026-02-07 14:00:49","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"US","sentiment":0.481},{"id":400378288,"title":"What does news industry carnage mean for MND? A perspective from our CEO","text":"The past few weeks have brought more troubling news across the news media landscape. To name a few:\n\n1. The Washington Post, a top-five circulation newspaper in the United States and in publication since 1877, announced significant cuts this week. The company fired over a third of its journalists, more than 300 people out of a total of 800.\n\n2. The Pittsburg Post-Gazette, the largest newspaper serving Pittsburg and in business since 1786, shut down last month after 240 years in business. That’s 240 years of community journalism — gone!\n\n3. “60 Minutes” — once one of the most respected news shows on TV for decades — has seen an erosion of trust from its viewers as the program has been seen as increasingly politically biased. In late 2025, it faced a scandal related to what was deemed favorable editing of an interview with Kamala Harris. Now again in 2026, under new leadership, it faces accusations of favoritism towards the Trump administration. What was once a rock steady pillar of unbiased journalism now has a serious credibility and reputation problem from both sides of the political aisle.\n\n4. Since 2005, the United States has lost nearly 40% of its newspapers, almost 3,500 in total. This means that in a typical week, an average of two newspapers in the U.S. shut down!\n\n5. Versant Media Group — the owners of the business news network CNBC and other outlets like MS NOW and the USA Network — had its IPO in early January and has since seen its stock drop by a third in just one month!\n\nThis is scary stuff if you own an online newspaper like my wife and I do. But the real question is: What does this mean for all of us?\n\nFor publishers:\n\n1. “Being political” or picking sides in today’s political climate is a very risky business.\n\n2. It’s nearly impossible to outrun a legacy print media business model as the “innovators dilemma” slows the transition to digital.\n\n3. A polarizing leader, such as Jeff Bezos of the Washington Post or Bari Weiss of CBS News, makes for an easy target for readers/viewers.\n\n4. The ad-based revenue model that sustained the media industry for decades simply doesn’t work anymore for most companies.\n\n5. Big tech companies and their AI models are truly an existential threat to the entire news media industry.\n\nFor consumers of news:\n\n1. Understand that although much of the pain being experienced by the industry is self-inflicted, much of it is not. The news industry has faced massive threats and challenges over recent years. From a shift of print to digital to a massive decline in ad revenues, to the rise of social media, to now the threat of AI. This has been exceptionally difficult to navigate and very few companies have been successful in managing it.\n\n2. Social media is not a “like for like” replacement of the traditional news media. It is less transparent, it is not fact-checked and it is easy to hide the author’s identify. It is also fraught with misleading or downright fake news, and it is increasingly filled with AI-created content that is completely false and misleading. Although traditional news media is far from perfect, social media news, relatively speaking, is a cesspool.\n\n3. Most importantly — it’s critical for you to support the media sources that you value. Put simply, if you don’t, they will disappear. It’s not hyperbole to imagine a world where unbiased, fact-checked news sources no longer exist — in fact, it’s happening before our very eyes at the rate of two newspapers per week!\n\nImagine a world where all news reporting is just opinions — we are racing towards that world. Although there are some great opinion perspectives out there, we cannot lose the agency to make up our own minds based on our own review of the facts. We cannot outsource thinking and opinion-forming to the loudest (or most well-funded) voices.\n\nOnce we reach that world, how do we ever go back? How do we ensure our children and grandchildren become trained, active, curious seekers of knowledge and truth? Very serious questions for very serious times.\n\nOur commitment — and our ask\n\nThe team at Mexico News Daily will continue to provide you, day in and day out, with fact-based, objective reporting on Mexico and Mexico’s relationship with the world. We will continue to do so without advertising, in order to give you the best reading experience possible. And we will continue to invest in our business to increase our impact, with initiatives like our new MND Kids platform now being used in schools in both the U.S. and Mexico.\n\nThis is not an easy business and my wife and I still have not taken one peso of salary in the nearly 3.5 years since we have purchased MND. That’s not right. That’s not fair. But it’s the reality we have chosen as we have eliminated advertising, built up and invested in our team, and added new platforms like MND Kids and MND TV on YouTube.\n\nI am often asked “How can I support the great work MND does?” The answer is simple and urgent:\n\nSubscribe. Encourage others to subscribe. Share our content with people who value complete, fact-based reporting on Mexico and its place in the world.\n\nWe will soon be adding a new feature on our website that allows paid subscribers to “gift” several free MND articles to friends each month — helping us reach future subscribers.\n\nHere’s one last thing that you need to know: Just reading our free newsletter or following us on social media generates zero revenue for us. I can’t tell you how many times I hear, “I love you guys, I follow you on social media” or “I love you guys, I get your free newsletter.” To which I am forced to say, “Thank you, but that isn’t really supporting us. If you truly value our work, we need you to become a paid subscriber.”\n\nThe business model is simple: Paid subscribers fund independent journalism. No subscribers means no journalism. We are asking you to choose which world you want to live in and which world do you want to leave behind for your children and grandchildren to live in.\n\nThank you for taking the time to read my perspective today and for supporting our work and our team.\n\nTravis Bembenek is the CEO of Mexico News Daily and has been living, working or playing in Mexico for nearly 30 years.","summary":"As legacy newspapers slash staff and shut down, what's next for small publications like Mexico News Daily — and why does it matter? CEO Travis Bembenek shares his take.\n\n\nThe post What does news industry carnage mean for MND? A perspective from our CEO appeared first on Mexico News Daily","url":"https://mexiconewsdaily.com/opinion/news-industry-carnage-mexico-news-daily/","image":"https://mexiconewsdaily.com/wp-content/uploads/2026/02/shutterstock_2618849207.jpg","video":null,"publish_date":"2026-02-07 13:00:17","author":"Travis Bembenek","authors":["Travis Bembenek"],"language":"en","source_country":"mx","sentiment":-0.297},{"id":400383146,"title":"A Handful of Examples of How ‘Harvard Is Woke,’ as Hegseth Said","text":"In his announcement video about preventing active duty military from doing programs with Harvard in future, Hegseth mentioned how sad it is that a university with ties to the U.S. military going all the way back to 1775 should now be so poisonous as to necessitate severing those ties. He cited Harvard's antisemitism and collaboration with Chinese Communists. Indeed, the former continues to be a prime point of contention between Harvard and the Trump administration.\n\nFile this under: LONG OVERDUEThe @DeptWar is formally ending ALL Professional Military Education, fellowships, and certificate programs with Harvard University.Harvard is woke; The War Department is not. pic.twitter.com/0kpsvivtsQ— Secretary of War Pete Hegseth (@SecWar) February 6, 2026\n\nIn fact, the obvious example of wokeness is Harvard’s ongoing extreme antisemitism, which is so blatant that Donald Trump raised his lawsuit for damages to $1 billion, and says he wants nothing further to do with the university at the federal level. “Dr. Alan Garber, the President of Harvard, has done a terrible job of rectifying a very bad situation for his institution and, more importantly, America, itself,” Trump stated earlier this week. Violent pro-Hamas, anti-Israel protests became commonplace at Harvard after the Oct. 7 atrocities, and the harassment extended not only to Israelis but to all Jews.\n\nNor are pro-Hamas riots the only sort of insanity still plaguing Harvard. Last year, Harvard hired Kareem Khubchandani, a Tufts University associate professor of Race, Colonialism, and Diaspora Studies (yes, apparently that is actually a college specialization). Khubchandani performs as a drag queen under the attractive pseudonym of \"LaWhore Vagistan,\" which he claims is a tribute to his Iranian roots — ironic considering he'd likely be executed in Iran.\n\nRead Also: Tomahawked: Bessent Flips the Tables on Sen. Warren Over Affordability\n\nTo return to the point, Harvard not only invited LaWhore Vagistan to teach a class; it invited him to host its Matthiessen Lecture on Feb. 10, called \"Auntologies: Queer Aesthetics and South Asian Aunties.\" Among the individuals to be discussed are Zohran Mamdani and Kamala Harris. And this is what Ivy League education has become now. By the way, tuition and fees at Harvard are around $86,000. Talk about a waste of money.\n\nIn December, Harvard canned one of its last Western civilization/history professors, without replacing him. At almost the same time, the university hired a virulently antisemitic divinity school graduate who assaulted an Israeli classmate. Harvard now offers basic algebra remedials to help ignorant students who somehow got accepted to an exclusive private school but can't do seventh grade-level equations.\n\nBravo to the War Department for cutting off Harvard. Having military officers whom Harvard has brainwashed is a national security threat.","url":"https://pjmedia.com/catherinesalgado/2026/02/07/a-handful-of-examples-how-harvard-is-woke-as-hegseth-said-n4949219","image":"https://media.townhall.com/cdn/hodl/2025/356/fd33396d-4306-4e7e-95c0-8c4debc7f222.jpg","video":null,"publish_date":"2026-02-07 12:57:00","author":"Catherine Salgado","authors":["Catherine Salgado"],"language":"en","source_country":"us","sentiment":-0.238},{"id":400362206,"title":"‘I didn’t make a mistake’: Trump refuses to apologise for racist clip of Obamas as monkeys","text":"US President Donald Trump refused to apologise on Friday for a video posted on his social media account depicting Barack and Michelle Obama as monkeys, though he said he condemned the post as the White House shifted the blame to staff.\n\nThe video shared on Trump’s Truth Social account late on Thursday night sparked censure across the US political spectrum, with the White House initially rejecting “fake outrage” only to then blame the post on an error by a staff member.\n\n“I didn’t make a mistake,” Trump said on Air Force One late on Friday when asked if he would apologise for the post.\n\nAsked if he condemns the racist imagery in the video, Trump replied: “Of course I do.”\n\nDemocrats slammed Trump as “vile” over the clip of the Obamas — the first Black president and first lady in US history while a senior Republican senator said the video was blatantly racist.\n\nNear the end of the one-minute-long video promoting conspiracies about Republican Trump’s 2020 election loss to Joe Biden, the Obamas were shown with their faces on the bodies of monkeys for about one second.\n\nThe video, uploaded late on Thursday amid a flurry of other posts, repeated false allegations that ballot-counting company Dominion Voting Systems helped steal the election from Trump.\n\nWhite House Press Secretary Karoline Leavitt initially played down the row, saying the images were “from an internet meme video depicting President Trump as the king of the jungle and Democrats as characters from The Lion King”.\n\n“Please stop the fake outrage and report on something today that actually matters to the American public,” Leavitt said in a statement to AFP.\n\nBut almost exactly 12 hours after the post appeared on Trump’s account there was an unusual concession from an administration that normally refuses to admit the slightest mistake.\n\n“A White House staffer erroneously made the post. It has been taken down,” a White House official told AFP.\n\nSpeaking to reporters on board Air Force One on Friday, Trump stood by the thrust of the video’s claims about election fraud, but said he had not seen the offensive clip.\n\n“I just looked at the first part … and I didn’t see the whole thing,” Trump said, adding that he “gave it” to staffers to post and they also didn’t watch the full video.\n\nThere was no immediate comment from the Obamas.\n\nFormer vice president Kamala Harris, who has long condemned Trump’s divisive racial rhetoric, called out the White House’s backpedalling in a post on X on Friday.\n\n“No one believes this cover up from the White House, especially since they originally defended this post,” she wrote.\n\n“We are all clear-eyed about who Donald Trump is and what he believes.”\n\n‘Disgusting bigotry’\n\nWhile Democrats pounced on the post, it was the outrage from some members of Trump’s own Republican Party that appeared to trigger the about-face.\n\nTim Scott, the only Black Republican senator and once a contender for the 2024 presidential nomination, called the video “the most racist thing I’ve seen out of this White House.” Scott said he was “praying it was fake” and called for Trump to remove it.\n\nRoger Wicker, another Republican senator, said the post was “totally unacceptable. The president should take it down and apologise.”\n\nThe top Democrat in the House of Representatives, Hakeem Jeffries, called Trump “vile, unhinged and malignant” and urged Republicans on X to “immediately denounce Donald Trump’s disgusting bigotry”.\n\nTrump launched his own political career by pushing the racist and false “birther” conspiracy theory that Barack Obama was lying about being born in the United States.\n\nTrump has long had a bitter rivalry with his Democratic predecessor, taking particular umbrage at his popularity and the fact that he won the Nobel Peace Prize.\n\nIn his second term in the White House, Trump has used hyper-realistic but fabricated AI visuals on Truth Social and other platforms, often glorifying himself and rallying his conservative base around social issues.\n\nDuring negotiations to avoid a US government shutdown, Trump posted a video of Jeffries, who is Black, wearing a fake mustache and a sombrero. Jeffries called the image racist.\n\nOne AI-generated video showed fighter jets dumping human waste on protesters — which was created by the same X user who made the video showing the Obamas as monkeys.\n\nSince returning to the White House, Trump has led a crusade against diversity, equity and inclusion (DEI) programs.\n\nUS federal anti-discrimination programs were born of the 1960s civil rights movement, mainly led by Black Americans, for equality and justice after hundreds of years of slavery.\n\nSlavery was abolished in the United States in 1865, but other forms of institutional racism continued for decades.","summary":"US President Donald Trump refused to apologise on Friday for a video posted on his social media account depicting Barack and Michelle Obama as monkeys, though he said he condemned the post as the White House shifted the blame to staff.\n\n\nThe video shared on Trump’s Truth Social account late on Thursday night sparked censure across the US political spectrum, with the White House initially rejecting “fake outrage” only to then blame the post on an error by a staff member.\n\n\n“I didn’t make a mistake,” Trump said on Air Force One late on Friday when asked if he would apologise for the post.\n\n\n    \n        \n    \n        \n    \n\n        \n    \nAsked if he condemns the racist imagery in the video, Trump replied: “Of course I do.”\n\n\nDemocrats slammed Trump as “vile” over the clip of the Obamas — the first Black president and first lady in US history while a senior Republican senator said the video was blatantly racist.\n\n\nNear the end of the one-minute-long video promoting conspiracies about Republican Trump’s 2020 elec","url":"https://www.dawn.com/news/1971685/i-didnt-make-a-mistake-trump-refuses-to-apologise-for-racist-clip-of-obamas-as-monkeys","image":"https://i.dawn.com/large/2026/02/07170653e7d79c6.webp","video":null,"publish_date":"2026-02-07 12:08:40","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.584},{"id":400357296,"title":"BROADCAST BIAS: ‘Public’ media furious Washington Post cut back on anti-Trump crusade","text":"The broadcast outlets that were most upset about The Washington Post announcing they were cutting 300 jobs were NPR and PBS. It makes sense, since the journalists at these outlets have no intention of trying to make money. They expect people to hand them endless millions so they can make the kind of \"news\"/commentary that attempts to change the world in their ideological direction. They have internalized the trauma of President Donald Trump and the Republicans taking away an annual half-billion dollars in taxpayer subsidies. On the Saturday before the layoffs, NPR media reporter David Folkenflik explained the view from Post staffers: \"They're saying that readers of The Washington Post deserve sophisticated, contextualized reporting that requires a sophisticated, contextualized reporting team.\" These are buzzwords for liberal bias, the same way Dan Rather always told people CBS gave you \"context and perspective.\" Weekend anchor Scott Simon asked Folkenflik: \"The Washington Post — it's a paper woven into U.S. history. Has it really come to this?\" The media reporter naturally thought of taking down President Richard Nixon, as liberals do: \"Well, obviously, you think of Watergate and the Pentagon Papers and other historic moments, but they're also doing things at the moment. They are holding power to account.\" 2025 LOOKBACK: TRUMP YANKS FEDERAL FUNDING FROM NPR IN MOVE CONSERVATIVE ADVOCATES SAID WAS LONG OVERDUE This being NPR, no one was going to consider conservatives suggesting that pandering to the left-wing base of the Democrat Party might not be a stellar business strategy. One of the amusingly tone-deaf moments before the Post job cuts came when staffers were hoping to enlist actors Meryl Streep and Tom Hanks to lobby the paper’s owner Jeff Bezos. They had starred in the 2017 movie \"The Post,\" which glamorized the paper’s war on Nixon. When liberal journalists blather about \"holding power to account,\" they really should ask if outlets like the Post energetically worked to hold the Biden administration to account. The Post wasn’t going to win a Pulitzer Prize for exposing Hunter Biden. Instead, in 2022, the Post won a prize for its reporting on the January 6 riot. Even the prize system is all about holding only one party accountable. Instead, we remember Post front-page articles like this Eli Saslow banger weeks after Barack Obama won in 2008. Obama \"was photographed looking like the paradigm of a new kind of presidential fitness, one geared less toward preventing heart attacks than winning swimsuit competitions. The sun glinted off chiseled pectorals sculpted during four weightlifting sessions each week, and a body toned by regular treadmill runs and basketball games.\" You could make a movie out of this, but it might be NC-17. WASHINGTON POST REELING FROM BUYOUT EXODUS AS BOSSES HOPE TO TURN THE PAGE AT EMBATTLED PAPER When the Post announced the job cuts, CBS anchor Jessi Mitchell summarized on its early-morning newscast: \"Outrage sparked online after the announcement, calling out the publication’s billionaire owner, Jeff Bezos, for the decision.\" On NPR, Folkenflik recalled that Bezos used to be a role model (for lefties). He \"was seen as a savior, a champion of tough and intense journalism, has not interfered with the newsroom, but he's apparently had enough.\" Now, he argued, \"You've seen both Marty Baron and Marcus Brauchli — two distinguished former executive editors of The Washington Post — just in the last hour or two share information with me, saying basically there seems to be no strategy. The Washington Post, its readers and the country deserve better.\" Baron is a poster boy for crusading liberal journalism. He was glamorized for The Boston Globe’s war on the Catholic Church in the 2015 movie \"Spotlight.\" Now he’s starred in several PBS segments lamenting Bezos. On \"Amanpour & Co.\" on January 23, he suggested Bezos was far too \"tepid\" toward Trump and no longer lives up to the Post’s drama-queen motto, \"Democracy Dies in Darkness.\" CLICK HERE FOR MORE FOX NEWS OPINION After the cuts were announced, \"PBS News Hour\" interviewed Baron for seven minutes, and he said the cuts did \"enormous damage\" to the paper. Baron uncorked the entire leftist critique. Bezos drove away the leftist subscribers by killing the paper’s endorsement of Kamala Harris in 2024, and then Bezos appeared on stage at Trump’s inauguration. He bought rights to Trump’s reality show \"The Apprentice\" for Amazon Prime and bankrolled a big documentary on Trump’s wife and First Lady, \"Melania.\" When the Post announced the job cuts, CBS anchor Jessi Mitchell summarized on its early-morning newscast: \"Outrage sparked online after the announcement, calling out the publication’s billionaire owner, Jeff Bezos, for the decision.\" Baron was so upset he added the Post bosses were \"completely changing the opinion pages so that essentially they have no columnists who are really left of center. And they're very deferential to Trump. And I think they lack a moral core.\" This would come as a surprise to their Trump-haters like Max Boot, David Ignatius, Kathleen Parker and Fareed Zakaria, to name a few. CLICK HERE TO DOWNLOAD THE FOX NEWS APP New York Times columnist Nicholas Kristof (last seen running for office as a Democrat in his native Oregon), tweeted out the NPR/PBS mindset: \"Jeff Bezos, who could keep the Wash Post a pillar of American democracy with the change dug out from his limousine seats, sets an example of surrender to authoritarianism for every other business person and institution in America.\" Everything is very black and white for these journalists. You are either raging against the Trump machine or you are collaborating with their imaginary Hitler. Their hurt feelings at Bezos feel like a tsunami of moral superiority and entitlement. CLICK HERE TO READ MORE FROM TIM GRAHAM","summary":"Former Washington Post editor Marty Baron appears on PBS to criticize the Jeff Bezos strategy of cutting the paper&apos;s staffing by 300 employees.","url":"https://www.foxnews.com/opinion/broadcast-bias-public-media-furious-washington-post-cut-back-anti-trump-crusade","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/03/broadcast-bias-image.jpg","video":null,"publish_date":"2026-02-07 12:00:11","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.237}]}