{"offset":0,"number":50,"available":535,"news":[{"id":295113438,"title":"Verizon becomes latest company to face probe by FCC boss over DEI policies","text":"Federal Communications Commission chair Brendan Carr on Thursday opened a probe into diversity practices at Verizon and raised the telecommunications company’s ongoing effort to purchase Frontier Communications.\n\nCarr, a Republican designated by President Donald Trump last month, earlier this month told NBC News-parent Comcast he was opening a similar probe into the company’s promotion of diversity, equity and inclusion programs. Verizon is awaiting FCC approval for its $9.6 billion purchase of Frontier.\n\n“In order to aid the FCC’s resolution of these matters, please reach out to the agency personnel that have been working on Verizon’s pending transactions at the FCC,” Carr wrote. “They are the FCC personnel most familiar with Verizon’s operations due to their merger review activity.”\n\nCarr criticized Verizon for its continued promotion of diversity, equity and inclusion programs.\n\nVerizon said in a statement, “we are aware of the chairman’s concerns. We look forward to engaging with the FCC staff on this issue. Verizon has always focused on having the best talent to deliver the best experiences to our customers.”\n\nCarr said in his letter to Comcast earlier this month that the commission would take “fresh action to ensure that every entity the FCC regulates complies with the civil rights protections enshrined in the Communications Act… including by shutting down any programs that promote invidious forms of DEI.”\n\nShortly after taking office on Jan. 20, Trump — who designated Carr as chair — issued sweeping executive orders to dismantle diversity, equity and inclusion programs in the United States and pressured the private sector to join the initiative.\n\nCarr is investigating numerous media companies.\n\nThe FCC is reviewing whether a CBS News “60 Minutes” interview with then Vice President Kamala Harris violates “news distortion” rules.\n\nParamount is seeking FCC approval for an $8.4-billion merger with Skydance Media.\n\nIn January, Carr reinstated complaints about how Walt Disney’s ABC News moderated the pre-election TV debate between then-President Joe Biden and Trump and NBC letting Harris appear on “Saturday Night Live” before the election.\n\nThe FCC, an independent federal agency, issues eight-year licenses to individual broadcast stations, not networks.","summary":"Verizon is awaiting FCC approval for its $9.6 billion purchase of Frontier Communications.","url":"https://nypost.com/2025/02/27/business/fcc-chair-opens-probe-into-diversity-practices-at-verizon/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/fcc-verizon.jpg?quality=75&strip=all&1740682457&w=1200","video":null,"publish_date":"2025-02-28 00:48:22","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":0.215},{"id":295116450,"title":"Trump could meet King in Scotland to plan state visit","text":"It was always expected that Donald Trump might pop up in Scotland at some point.\n\nThe president owns golf courses in Ayrshire and Aberdeenshire, and has family roots too with his mother hailing from the Isle of Lewis.\n\nBut now he has been invited to Scotland by none other than the King.\n\nPrime Minister Sir Keir Starmer hand-delivered an invitation from King Charles for an unprecedented second state visit as part of his own trip to Washington.\n\nAnd it said an initial planning meeting could take place at a Scottish royal estate, either Balmoral or Dumfries House, given their proximity to Mr Trump's golf courses.\n\nThe president said it would be an \"honour\" to return to the UK, which he called a \"fantastic\" country.\n\nTraditionally second term presidents are not offered a full state visit, but take tea or lunch with the monarch at Windsor Castle.\n\nSir Keir said the invitation was \"historic\" and \"truly unprecedented\".\n\nFirst Minister John Swinney endorsed Mr Trumps rival Kamala Harris during the US elections, but took a call from the president following his victory.\n\nAnd he's said he could seek to use Mr Trump's roots to avoid the prospect of tariffs being imposed on Scottish goods being imported to the US.","summary":"The US president is invited to a royal residence in Scotland to discuss the logistics of a second state visit.","url":"https://www.bbc.com/news/articles/cly4403gjxdo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/6211/live/b52ae440-f55f-11ef-9dd3-3538510401a1.jpg","video":null,"publish_date":"2025-02-28 00:18:12","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.214},{"id":295101228,"title":"Criticism of Wayne Gretzky by Canadians due to his support for Trump has 'broken his heart,' wife says","text":"Hockey legend Wayne Gretzky has been criticized by fellow Canadians for his apparent support of President Donald Trump. Trump has drawn disdain from the country up north for saying it should become the \"51st state\" and initiating tariffs on Canadian goods. Before the 4 Nations Face-Off championship between the U.S. and Canada in Boston, Gretzky was named Canada's honorary captain, and he received backlash. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM That prompted hockey legend Bobby Orr, a fellow Canadian, to write in the Toronto Sun that he was disappointed when he read criticism about someone he considers one of the \"greatest Canadians ever.\" \"How fickle can people be, when someone who has given so much time and effort to Canadian hockey is treated in such a way,\" Orr’s column said. \"Listen, we all have our personal beliefs as they pertain to things such as religion and politics. Wayne respects your right to such beliefs – why can’t you respect his?\" Janet Gretzky, Wayne's wife, saw Orr's column, and she reacted on social media. \"Thank you Mr. Bobby Orr. Your words mean the world to Wayne and his family , i have never met anyone who is more Proud to be a Canadian and it has broken his heart to read and see the mean comments . . He would do anything to make Canadians Proud , with his Love for Hockey and his Country,\" Janet wrote in an Instagram post in which she shared Orr's column. NHL STAR DISHES ON TEAM USA PLAYERS' AMERICAN PRIDE: 'HAVEN'T SEEN THAT FROM AMERICANS IN GENERAL' Janet's post did not end the criticism. One user commented, \"You cant be a great Canadian if you support trump who trying to destroy canada its that simple.\" Another wrote, \"Written from one Trumper for another. If Wayne is so proud, maybe he should make a public statement denouncing your friend’s call to annex his homeland. Thanks would speak louder than anything a fellow Trumper could write about him.\" Trump recently said he asked Gretzky to become the next \"governor of Canada\" after Prime Minister Justin Trudeau announced he would be resigning. But after Gretzky expressed support for \"Canada remaining a separate Country, rather than becoming a cherished and beautiful 51st State,\" Trump declared Gretzky a \"free agent.\" \"I don’t want anyone in Canada to say anything bad about him. He supports Canada the way it is, as he should, even though it’s not nearly as good as it could be as part of the Greatest and Most Powerful Country in the World, the Good Ole’ U.S.A.!\" Trump wrote in a Truth Social post Wednesday. CLICK HERE TO GET THE FOX NEWS APP Gretzky attended a victory party for Trump's 2024 election win after Trump defeated Vice President Kamala Harris. Gretzky was spotted wearing a MAGA hat shortly afterward and attended Trump's inauguration. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Wayne Gretzky&apos;s wife, Janet, said the criticism he has received from Canadians has &quot;broken his heart&quot; amid is support for President Donald Trump.","url":"https://www.foxnews.com/sports/criticism-wayne-gretzky-canadians-amid-his-trump-support-has-broken-his-heart-wife-says","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/trump-gretzky.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-27 23:03:44","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"us","sentiment":0.4},{"id":295110102,"title":"We Can Achieve Great Things","text":"American political culture goes through phases. Between 1933 and 1963 that culture went through a Hamiltonian phase. Leaders believed in centralizing power to build big things. Franklin Roosevelt created the Tennessee Valley Authority and the rest of the New Deal. Dwight Eisenhower built the national highways system and founded NASA.\n\nA lot of the stuff the centralizers did was great, like New York infrastructure czar Robert Moses' building Lincoln Center. Some of the stuff they did was horrific, like Moses' destroying Bronx neighborhoods to put in a highway.\n\nSomewhere around the late '60s the culture shifted in a decentralizing, Jeffersonian direction. A new generation of conservatives and progressives emerged who were suspicious of centralized authority and instinctively against the establishment, and who railed against \"the system.\" People with less power were automatically the good guys, and people with more power were automatically the bad guys.\n\nOn the right, Republicans from Ronald Reagan to the Tea Party crusaded against elites and the swamp in Washington. On the left, progressive activists like Ralph Nader and the environmentalists sued the government to halt development projects. Progressive community activists empowered neighborhoods to take on and stymie city hall. Federal workers passed masses of regulations to micromanage everyday life on a worksite. Republicans and Democrats joined forces to pass the National Environmental Policy Act, the California Environmental Quality Act and the Endangered Species Act, all of which could be used by activists to slow down and halt housing and transportation projects.\n\nThe decentralizing Jeffersonians overshot the mark. A group of activists who came of age during the New Deal era concentrated power to get things done. Then, a new generation of activists who came of age during the 1960s rebelled against concentrated power and made it nearly impossible to get anything done. This became the pattern.\n\nIn 2008 California set out to build high-speed rail between Los Angeles and San Francisco, promising that it would be finished in 2020. The project was blocked by a thousand little barriers, and now a scaled-down line between Merced and Bakersfield may open in 2033 at a cost, so far, of $35 billion.\n\nIn the United States it costs roughly $609 million to build a kilometer of rail. In Canada it costs only $295 million and in Portugal, $96 million. Because of regulations and the lack of cost-effective production, a basic elevator in New York City costs about four times as much as that same elevator in Switzerland.\n\nProgressives proved especially effective at blocking new home construction. A study in California found that as the share of liberal votes rises by 10 points in a given city, the number of housing permits issued declines by 30%. In San Francisco, according to one 2023 state report, it took 523 days on average to get clearance to construct new housing and then 605 days to get building permits, if your project wasn't killed in the meantime by lawsuits and citizen action.\n\nOne result has been scarcity and higher prices for the things that get regulated, like housing. Another is that highly educated people found they could game the permitting system and prevent poorer and less educated people from sullying their neighborhoods. Another is that when government tries to do big things, like build clean energy or rail lines, it finds it can't act. The irony is this: Progressives, who believe in using government to do good things, have built a system that renders government incompetent.\n\nBut now the culture may be shifting again. Over the past several years, various versions of something called the abundance movement have been growing at libertarian-leaning think tanks like the Niskanen Center, at right-leaning tech hubs like Andreessen Horowitz and at a wide array of left-leaning think tanks. The core argument is the need to get rid of regulations that make it impossible to build things, and we need to invest money in order to achieve great things.\n\nThis winter the abundance movement is having its coming-out party in the form of three spectacular books by some of its more prominent champions.\n\nNext month, Derek Thompson and Ezra Klein's book \"Abundance\" will be published, offering a comprehensive indictment of the current problems and a clear path forward. This month brought us Yoni Appelbaum's \"Stuck,\" a historical account of the forces that have produced the current housing crisis and its social and cultural effects. Marc J. Dunkelman's new book, \"Why Nothing Works,\" is an intellectual history that describes the ideas and values that first drove people like Moses to act the way they did and the values that drove the next generation of activists to oppose them. These three books have significantly altered the way I see our current political morass. (Klein, Thompson and Appelbaum are colleagues of mine at The New York Times and The Atlantic.)\n\nDunkelman summarizes the history perfectly: \"In ways big and small, Jeffersonian protections have prevented the movement from expanding the nation's housing supply, delivering high-speed rail and replacing carbon-emitting power with clean energy. We've become so terrified of Hamiltonian figures making bad decisions that we've curtailed government's ability to make tough calls.\"\n\nAppelbaum describes the way all this stasis has enervated American life. He points out that our housing crisis is not just a cost crisis; it's a mobility crisis. In the 1940s and 1950s, about a fifth of Americans moved. Then came the zoning and other regulations that progressives championed. Today, only 1 in 12 Americans moves every year.\n\nPeople can't afford housing in the places where opportunity is plentiful. That means fewer Americans are moving to improve their lives and fewer are climbing the social ladder. When people move to new places, they join churches and civic organizations to meet new people. When mobility slows, social and civic life, paradoxically, deteriorates. More Americans are, as Appelbaum puts it, stuck.\n\nIn their book, Klein and Thompson usher in a mood shift. They inspire hope and enlarge the imagination by describing the good things that are actually within our grasp: abundant energy, cheaper housing, affordable cities, shorter workweeks, lab-grown meat so that we no longer have to use 25% of global land to raise livestock.\n\n\"What is needed here is a change in political culture, not just a change in legislation,\" they write.\n\nWill the abundance movement take flight? There are some obstacles. A lot of people, especially rich Democrats, like having the power to block development around them. Public sector unions tend to instinctively defend bureaucracies and the regulations promulgated within them. The abundance folks call for both deregulation and more spending. Many progressives hate the former and many conservatives hate the latter.\n\nThe more troubling obstacles may be cultural. If anything, Americans have grown more cynical and more distrustful of authority than they were even in the 1970s. In an essay in The New Atlantis, American Enterprise Institute scholar Yuval Levin points to a \"willful paralysis that oddly passes for sophistication in our elite culture now.\" Americans now have trouble thinking about the future in the way previous generations did.\n\nLevin continues: \"It often bespeaks a kind of vanity unable to imagine the world without ourselves in it, and to take pleasure in benefiting our successors. The future, after all, is the home of other people -- people who will follow us when we are gone. To build durable infrastructure for future prosperity is to build for those other people. And the inability to value those other people and judge them worthy of our work and sacrifice is a characteristic failing of a decadent society.\"\n\nYet I strongly believe the abundance movement will form an important faction within the Democratic Party and maybe in the Republican one too. Democratic politicians including Kamala Harris and Rep. Jake Auchincloss of Massachusetts have seized some of its ideas. There is a natural tendency in our country to move in a Hamiltonian direction after a period of Jeffersonian ascent, and such a shift is overdue. Most important, the arguments these authors make are utterly compelling.\n\nIt's interesting to read these books during the Trump Anschluss. In some ways President Donald Trump can be seen as an extreme response to a government that can't get anything done. The problem is he's skipped over the Alexander Hamilton model of centralizing authority and gone straight to the Vladimir Putin model. If we still have a country when he is done, we're going to need a better establishment.\n\nSo I'd close with some questions for educators. Every society on Earth has a leadership class of one sort or another, so are you educating your students so that they can build a better establishment? Are you arming them with sensible views about authority so that they don't childishly dismiss all forms of it? Are you training them to be in touch with their fellow citizens, so that they don't rule imperiously from above? Are you training them to embrace the obligations that fall on them as leaders, to serve the country and not their own kind? Are you trying to inculcate in them both the humility to know what they don't know and the audacity to reach for abundance?\n\nThis article originally appeared in The New York Times.","summary":"American political culture goes through phases. Between 1933 and 1963 that culture went through a Hamiltonian phase. Leaders believed in centralizing power to build big things. Franklin Roosevelt created the Tennessee Valley Authority and the rest of the New Deal.…","url":"https://www.berkshireeagle.com/nyt/we-can-achieve-great-things/article_1aceb4ff-209b-561f-9ac5-ce35382219f7.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-27 22:59:00","author":"Blox Content Management,David Brooks","authors":["Blox Content Management","David Brooks"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.045},{"id":295112692,"title":"Democrats Expect a 2026 Comeback. But Will Free Elections Even Exist?","text":"Many mainstream Democrats are reassuring themselves that momentum is shifting and the party will stage a rebound in the 2026 midterms. Which is frightening, because that thinking naively assumes Trump doesn’t try to change the election rules.\nElon Musk’s bedazzled chain saw and other daily administration antics are obscuring the next ominous frontier in the Republican attempt to hold on to power: warping voting procedures and laws.\nThe offensive is quietly underway now, and it is likely to follow a familiar blueprint. “Trump and the Republican Congress changing the mechanics of voting and the certification of elections—it’s more than me making an educated guess,” says Bill Burton, a Democratic strategist who was a White House adviser to President Barack Obama. “It’s in Project 2025.” That right-wing agenda includes such steps as moving election law prosecutions from the Department of Justice’s civil rights division to its criminal division and giving the federal government greater access to state voter rolls—a change that opponents see as a precursor to a purge of hundreds of thousands of likely Democratic voters.\nTrump is already putting some of the building blocks in place. He tried to pressure California into requiring voter ID in exchange for federal wildfire aid money. He moved to fire the chair of the Federal Election Commission, Ellen Weintraub, though she refused to leave. He has nominated Harmeet Dhillon, a lawyer who helped Trump try to overturn the 2020 election results, as an assistant attorney general. He has backed the SAVE Act, congressional legislation that purports to crack down on noncitizen voting, an infinitesimal problem, by requiring proof of citizenship for voter registration—something that would likely disenfranchise millions of legitimately eligible college students, as well as Black and Latino voters. The SAVE Act may come up for a House vote as soon as next week.\nMuch of the key action, however, will take place on the state level. Georgia Republicans want to eliminate early in-person voting, no-excuse absentee balloting, and motor-voter registration. In Missouri, Republicans are trying to make it harder for citizen-led initiatives to appear on the ballot and be approved.\n“In Utah, they have a pretty independent Supreme Court that operates a little bit above politics. Last year it struck down a gerrymander,” says David Pepper, a former chairman of the Ohio Democratic Party and the author of Laboratories of Autocracy: A Wake-Up Call From Behind the Lines. “So the Republican legislature is talking about, ‘How can we change the way our courts are selected?’ You will see other really concerted efforts to not allow Democrats to win any state Supreme Court races, because that’s a frontline democracy-protecting position.”\nIndeed, North Carolina Republicans have stalled the certification of a Democratic state Supreme Court judge, Allison Riggs, for four months by claiming irregularities in voter registration forms. “This is their playbook,” Burton says. “In places where they don’t win elections, they’re going to claim fraud and not certify the winner.”\nFighting back against such a multipronged effort is highly complicated and expensive. One locus of the counterattack is Democracy Docket, a voting rights platform launched by Marc Elias, an election lawyer who worked with the presidential campaigns of Hillary Clinton and Kamala Harris, and who in 2020 went undefeated in 64 cases where Trump tried to contest the presidential outcome.\nOn Tuesday, Elias’s firm scored another win, defeating a provision in an Arizona law that required documentary proof of citizenship for voter registration in presidential elections. “Right now we are litigating nearly 50 voting and election lawsuits in nearly 20 states. We have a broad reach, and we’re anticipating more litigation if and when some of these new state laws are enacted,” says Aria Branch, a partner in Elias’s firm. “At some point Trump said he would be considering a third term, and I think that captured the public’s attention. Authoritarians and dictators, historically, try to disenfranchise people and make it more difficult to actually hold free and fair elections. And so I don’t think that issue is lost on anyone.”\nThat’s the hopeful view. There are plenty of other reasons to be pessimistic.\n“People are so caught up in the whirlwind of the day-to-day bullshit that the actual big stuff that’s foundational to democracy are fights that people aren’t really getting prepared for,” Burton says. “And by the time we get to the next election, it’s going to be too late.”","summary":"Growing anger with the Trump-Musk alliance could signal a 2026 blue wave, but that assumes MAGA won’t mess with elections before then. Unfortunately, they’ve already begun to do so.","url":"https://www.vanityfair.com/news/story/democrats-expect-2026-comeback-will-free-elections-exist","image":"https://media.vanityfair.com/photos/67c0a6dcd546ec627b8aaf1e/16:9/w_2000,h_1125,c_limit/VF0225_Trump-Musk_Tout.png","video":null,"publish_date":"2025-02-27 22:03:58","author":"Chris Smith","authors":["Chris Smith"],"language":"en","category":"politics","source_country":"US","sentiment":-0.396},{"id":295084328,"title":"Michigan Sen. Elissa Slotkin to deliver Democratic response to Trump address","text":"Feb. 27 (UPI) -- The Democratic Party has chosen Michigan Sen. Elissa Slotkin to provide the party's response to President Donald Trump's joint address to Congress on Tuesday evening.\n\nSlotkin is a freshman senator after winning election in November and someone whom Senate Minority Leader Chuck Schumer, D-N.Y., called \"nothing short of a rising star in our party.\"\n\nSchumer and House Minority Leader Hakeem Jeffries, D-N.Y., on Thursday announced Slotkin would deliver the rebuttal to Trump's address.\n\n\"She will offer a bold vision of hope, unity and a brighter future for everyone, not just the wealthy few at the top,\" Schumer said in a statement.\n\n\"Elissa Slotkin will lay out the fight to tackle the deep challenges we face today, chart a path forward and shape the future of our nation.\"\n\nJeffries said that path forward will include lowering the cost of living and protecting federal entitlement programs.\n\nJeffries said Slotkin will \"communicate that Democrats are fighting to lower the cost of living and protect Social Security and Medicaid while Republicans cut taxes for their billionaire donors and Elon Musk.\"\n\nSlotkin narrowly defeated challenger and former Rep. Mike Rogers in November to fill the Senate vacancy created when Michigan Sen. Debbie Stabenow retired from politics last year.\n\nSlotkin outperformed former Vice President Kamala Harris in Michigan, which Trump won by a narrow margin with 49.7% of votes to Harris' 48.3%.\n\nMichigan was one of seven battleground states, all of which Trump won over Harris.\n\nTrump's prime-time address on Tuesday will be his first to the nation after winning his second term in office, making him the second president to win two non-consecutive terms in the White House.\n\nFormer President Grover Cleveland was a Democrat and the nation's 22nd and 24th president after winning terms from 1885 to 1889 and from 1893 to 1897.","summary":"The Democratic Party has chosen Michigan Sen, Elissa Slotkin to provide the party's response to President Donald Trump's joint address to Congress on Tuesday evening.","url":"https://www.upi.com/Top_News/US/2025/02/27/elissa-slotkin-trump-address-rebuttal/7541740690912/","image":"https://cdnph.upi.com/ph/st/th/7541740690912/2025/upi/0072bdadf934cca8ef224fd7f82492e9/v1.2/Michigan-Sen-Elissa-Slotkin-to-deliver-Democratic-response-to-Trump-address.jpg","video":null,"publish_date":"2025-02-27 21:33:37","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":0.003},{"id":295080624,"title":"Elissa Slotkin to Give Democratic Response to Trump's Congressional Address","text":"Michigan Senator Elissa Slotkin will speak for the Democratic Party in its response to President Donald Trump's address to Congress next week.Why It MattersTrump is poised to deliver the first joint congressional address of his second term in office on Tuesday. During the speech, he is expected to lay out his policy goals amid escalating concerns over some of his efforts at slashing government.Choosing Slotkin—a moderate who won Michigan's Senate race in November even as Trump carried the state—to deliver the Democratic response may signal a party shift after last year's stinging losses in the general election.After Vice President Kamala Harris' loss to Trump last year, Democrats have been divided on embracing more progressive policies to motivate their base, or moving toward the center to win back moderates. Some view Slotkin, whose performance saved the party from losing a crucial Senate seat, as a model for how to win swing states in the future.What To KnowSenate Minority Leader Chuck Schumer, a New York Democrat, announced Slotkin would be giving the Democratic response in a post to X, formerly Twitter, on Thursday afternoon.\"Nothing short of a rising star in our party—she's dedicated her life to our country,\" he wrote. \"She will layout the fight to tackle the deep challenges we face and chart a path forward.\"Slotkin wrote in a statement that she is \"looking forward to speaking directly to the American people next week.\"\"The public expects leaders to level with them on what's actually happening in our country. From our economic security to our national security, we've got to chart a way forward that actually improves people's lives in the country we all love, and I'm looking forward to laying that out,\" she wrote.The speech will help give Slotkin a national profile, and a chance to share Democrats' message against Trump.A former CIA agent and Pentagon official, Slotkin was first elected to the House of Representatives in the 2018 midterms in a conservative-leaning district around Lansing. She held onto the seat in 2020, even as Trump won the district while losing the state, and in 2022.She narrowly won Michigan's Senate race in November by 0.3 percentage points after former Democratic Senator Debbie Stabenow retired.She has established herself as a more centrist Democrat. In the Senate, she has voted for some of Trump's Cabinet picks and supported the Laken Riley Act, a Republican-backed immigration bill.During Trump's first term, former Kentucky Governor Steve Beshear gave the Democratic response to his 2017 address. Former Representative Joe Kennedy III gave the response in 2018, and former Georgia gubernatorial candidate Stacey Abrams gave it in 2019. Michigan Governor Gretchen Whitmer gave the Democratic response in 2020.What People Are SayingAlex Sammon, politics writer for Slate magazine, on X: \"In case you thought Democrats had learned anything from the Liz Cheney debacle, they're rolling with one of George W. Bush's national security advisors as their spokesperson to respond to Trump's joint address.\"Senator Amy Klobuchar, a Minnesota Democrat, on X: \"@SenatorSlotkin knows Americans want to see costs come down—not more chaos and corruption. She also knows firsthand the importance of our leadership on the world stage. There's going to be a lot to respond to on Tuesday... She's going to do a great job!\"What Happens NextTrump's speech is scheduled for March 4, and Slotkin will speak afterward. The address is set to begin around 9 p.m. ET.","summary":"Slotkin, a Michigan Democrat, said she is \"looking forward to speaking directly to the American people next week.\"","url":"https://www.newsweek.com/elissa-slotkin-democrat-response-trump-joint-address-2037455","image":"https://d.newsweek.com/en/full/2597273/elissa-slotkin-democratic-response-trump-address.jpg","video":null,"publish_date":"2025-02-27 21:26:58","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":0.145},{"id":295090882,"title":"State of the nation is not good, sinking fund has $64,000 balance – Mahama","text":"Entertainment\n\nForeign News\n\nEbo Safo TV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThursday, February 27, 2025\n\n\n\n\n\n\nGhana Latest News\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\nForeign News\n\nEbo Safo TV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHomeBusinessState of the nation is not good, sinking fund has $64,000 balance...\n\n\n\nState of the nation is not good, sinking fund has $64,000 balance – Mahama\n\n\n\nBy Ghana News\n -February 27, 2025\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n State of the nation is not good, sinking fund has $64,000 balance – Mahama – Ghana Business News\n\n\n\n\n\n\n\n\n\n\n\nState of the nation is not good, sinking fund has $64,000 balance – Mahama\n\n\n\n\n\n\n\n\n\n\n\n\n\nSource link \n\n\n\n\n\n\n\n\n\nPrevious articleWe will amend existing Road Traffic Regulations to legalise ‘Okada’ business – Mahama\n\nNext articlePolice arrest male student of KNUST believed to be suspect in the murder of Level 400 female student\nGhana News \n\nRELATED ARTICLESMORE FROM AUTHOR\n\n\n\n\n\n\n\n\n\n\n\nWhat is Education Technology? – The Business & Financial Times\n\n\n\n\n\n\n\n\n\n\n\nOne person arrested for allegedly killing queen mother at Nungua\n\n\n\n\n\n\n\n\n\n\n\nNearly 16% of forest reserves completely destroyed -Lands Minister\n\n\n\n\n\n\n\n19,579FansLike\n\n1,785FollowersFollow\n\n0SubscribersSubscribe\n\n- Advertisement -\n\nMOST READ NEWS\n\n\n\n\n\n\n\nBreak dancing steals the show at 2025 Urban Sports Festival\n\nGhana News - January 26, 2025\n\n\n\n\n\n\n\nBENCHH Conference 2024 Launched | News Ghana\n\nGhana News - May 4, 2024\n\n\n\n\n\n\n\nKamala Harris Becomes Presumptive Democratic Nominee With Delegates – Hollywood Life\n\nGhana News - July 23, 2024\n\n\n\n\n\n\n\n”Stop fooling and grow up’’ – Shatta Wale’s savage reply to Stonebwoy’s birthday wish\n\nGhana News - October 19, 2024\n\n\n\n\n\n\n\nEntertainment\n\nRema and Tems Enjoy Special Moments Together in Ghana | WATCH\n\n\nGhana News - January 11, 20230\n\n\nGhana has been chosen the official vacation destination for all travelers in December. Since 2019, many famous people have flown to Ghana with...\n\n\n\n\n\n\n\n\n\nObrafour sues Grammy award-winner Drake; demands $10m over alleged copyright infringement\n\nApril 19, 2023\n\n\n\n\n\n\n\n\n\nStonebwoy holds star-studded party for ‘5th Dimension’ mega album [Video]\n\nApril 30, 2023\n\n\n\n\n\n\n\n\n\nI left my 5th boyfriend because of Burna Boy – Zimbabwean...\n\nMay 14, 2023\n\n\n\n\n\n\n\n\n\nEarl International Group build ultra modern school complex for the Gbane...\n\nJune 3, 2023\n\n\n\n\n\n\n\n\n\nPolice arrest male student of KNUST believed to be suspect in...\n\n\nGhana News - February 27, 20250\n\n\nBy Nicholas Osei-Wusu\n\nPolice in the Ashanti region have arrested a male student of the Kwame Nkrumah University of Science and Technology, KNUST, believed...\n\n\n\n\n\n\n\n\n\nMahama Appeals to Opposition Ahead of National Economic Dialogue\n\nFebruary 27, 2025\n\n\n\n\n\n\n\n\n\nPresident Mahama announces launch of women’s development bank\n\nFebruary 27, 2025\n\n\n\n\n\n\n\n\n\nEdena Bakatue Launched | News Ghana\n\nFebruary 27, 2025\n\n\n\n\n\n\n\n\n\n“Your appearance today mirrors the bleak economy you left,” Mahama Ayariga...\n\nFebruary 27, 2025\n\n\n\n\n\n\n\n\n\n\n\n\n\nGhananewss is your news, entertainment, music, fashion and sports website. We provide you with the latest breaking news and videos straight from Ghana, Africa and beyond.\nContact us: Info@ghananewss.com\n\n\n\n\nEVEN MORE NEWS\n\n\n\n\n\n\n\n\n\nPolice arrest male student of KNUST believed to be suspect in...\n\nFebruary 27, 2025\n\n\n\n\n\n\n\n\n\nWe will amend existing Road Traffic Regulations to legalise ‘Okada’ business...\n\nFebruary 27, 2025\n\n\n\n\n\n\n\n\n\nAccra Academy PTA swears in new executives\n\nFebruary 27, 2025\n\n\n\n\n\nPOPULAR CATEGORY\n\nEntertainment13797\nForeign News9107\n\nBusiness4211 \n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n© 2025 GHANA NEWS. ALL RIGHTS RESERVED.","summary":"&#13; &#13; &#13; &#13; &#13; &#13; &#13; State of the nation is not good, sinking fund has $64,000 balance &#8211; Mahama &#8211; Ghana Business News &#13; &#13; &#13; &#13; &#13; Home Politics State of the nation is not good, sinking fund has $64,000 balance – Mahama &#13; &#13; &#13; &#13; &#13; &#13; Source link\n\n\nThe post State of the nation is not good, sinking fund has $64,000 balance &#8211; Mahama appeared first on Ghana Latest News.","url":"https://ghananewss.com/state-of-the-nation-is-not-good-sinking-fund-has-64000-balance-mahama/","image":"https://www.ghanabusinessnews.com/wp-content/uploads/2025/02/Mahama_SONA.jpg","video":null,"publish_date":"2025-02-27 21:18:30","author":"Ghana News,Nicholas Osei","authors":["Ghana News","Nicholas Osei"],"language":"en","source_country":"gh","sentiment":0.279},{"id":295076164,"title":"Jeff Bezos' Trump secret that'll further infuriate liberal Washington Post staffers","text":"Jeff Bezos' Trump secret that'll further infuriate liberal Washington Post staffers\n\nPODCAST: All the biggest news and insider gossip from the Trump administration – listen to Welcome to MAGAland here\n\nBy JAMES CIRRONE FOR DAILYMAIL.COM\n\nPublished: 20:53 GMT, 27 February 2025 | Updated: 21:27 GMT, 27 February 2025\n\nAmazon founder Jeff Bezos had a secret relationship with Donald Trump long before anyone knew, which will likely further enrage Washington Post staffers after the billionaire owner radically overhauled the newspaper's opinion section.\n\nAxios has revealed that Bezos called Trump in July and urged him to pick Doug Burgum as his running mate.\n\nThe call, which was arranged by Burgum, occurred after Trump was nearly assassinated at a rally in Butler, Pennsylvania. Bezos reportedly commended Trump for how he handled himself after he was shot in the ear.\n\nHis endorsement of Burgum, who was the governor of North Dakota at the time, wasn't enough to get him the vice presidency. That title went to former Ohio Senator JD Vance, who was recommended to Trump by his eldest son Don Jr.\n\nBurgum wasn't totally snubbed, as he was selected then confirmed by the Senate to be the next Secretary of the Interior.\n\nBezos had this friendly conversation with the president three months before he ordered the Washington Post editorial board not to endorse Vice President Kamala Harris in October.\n\nThis broke with the newspaper's 48-year-long tradition of endorsing a presidential candidate, starting in 1976 with its blessing of Jimmy Carter.\n\nBezos denied that he was interceding on Trump's behalf at the time, but after the election, it became even more clear that he was eager to curry favor with the new administration.\n\nJeff Bezos (pictured with fiancée Lauren Sánchez and Google CEO Sundar Pichai) had a relationship with Donald Trump going back as far as July\n\nBezos called Trump after he was nearly assassinated at a rally in Butler, Pennsylvania, both to compliment him on how he handled himself and to recommend Doug Burgum as his VP\n\nOn November 6, the day after the election, Bezos congratulated Trump for his 'extraordinary political comeback and decisive victory.'\n\nIn December, Bezos and his fiancée Lauren Sánchez dined with Trump at his Mar-a-Lago resort in Palm Beach, Florida, as did Meta CEO Mark Zuckerberg and Google CEO Sundar Pichai.\n\nAll three men, whose fortunes could be significantly impacted with Trump in the White House, were seen front and center at the inauguration in January. \n\nDoug Burgum arranged the call between Bezos and Trump\n\nSome pointed out that these tech billionaires had better seats than the incoming Cabinet, who were in the row behind. \n\nThey were certainly closer to the action than Governors Greg Abbott and Ron DeSantis, who were forced into an overflow room due to a lack of space in the Capitol Rotunda.\n\nBezos caused further outrage this week with his changes to the Washington Post's left-leaning opinion page, perceived by many as another olive branch to Trump, who routinely attacked the paper's critical coverage of him during his first term.\n\n'We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,' Bezos wrote on X on Wednesday. 'We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.'\n\n'There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views. Today, the internet does that job.'\n\nScores of once-loyal readers have already begun angrily cancelling their subscription in protest.\n\nAfter Bezos killed the Washington Post's planned endorsement of Kamala Harris, the paper lost 250,000 subscribers\n\nThe paper's economics reporter Jeff Stein called the move a 'massive encroachment'.\n\nThe shakeup means that former editor David Shipley will step down from the position he has held since 2022. \n\n'I offered David Shipley, whom I greatly admire, the opportunity to lead this new chapter. I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no.' After careful consideration, David decided to step away,' Bezos explained.\n\nHe added that he is currently searching for Shipley's replacement.\n\n'This is a significant shift, it won't be easy, and it will require 100% commitment — I respect his decision,' Bezos said.\n\nThe impact of Bezos' decision to reimagine the opinion section hasn't been fully felt, although shortly after he killed the Harris endorsement, it was reported that the Washington Post lost 250,000 subscribers.\n\nDonald Trump\n\nShare or comment on this article:\nJeff Bezos' Trump secret that'll further infuriate liberal Washington Post staffers\n\nAdd comment","summary":"The Amazon founder has a secret and its about President Donald Trump. Ever since Trump won the election in November, Bezos has been getting closer to him and his allies.","url":"https://www.dailymail.co.uk/news/article-14444505/jeff-bezos-donald-trump-secret-washington-post-staffers.html","image":"https://i.dailymail.co.uk/1s/2025/02/27/20/95665115-0-image-m-119_1740689053393.jpg","video":null,"publish_date":"2025-02-27 21:12:46","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.172},{"id":295076796,"title":"What’s in a Poll?","text":"News Analysis\n\nSeveral polls indicate that the Liberal Party has made a recovery in support in the last two months. The polls suggest differing results, with some showing the Liberals catching up to the Conservatives or in one case even surpassing them, while another shows the Conservatives still maintaining a two-digit lead despite the Liberals gaining more ground since December. \n\nConversely, Ontario Liberal MP Helena Jaczek, who had said last year that she wouldn’t be seeking re-election, reversed her decision on Jan. 20, saying the “new energy” in the party has caused her to return to politics.Poll ResultsIn December 2024, all polls showed the Conservatives holding a two-digit lead over the Liberals.\n\nRelated StoriesPotential Carney Leadership Boosts Liberals as NDP Voters Shift, Narrowing Gap with Tories: Poll2/19/2025Poilievre Says He’s ‘Doubling Down’ on Key Policies Amid US Tariff Threat2/18/2025\n\nNanos polling from the week ending Dec. 20, 2024, showed the Conservatives with 44 percent support and the Liberals with 24 percent. Abacus Data reported the Tories at 45 percent compared with the Grits at 20 percent in a survey conducted from Dec. 16 afternoon until the next morning, after Freeland resigned as finance minister and deputy prime minister on Dec. 16 in the morning. Leger, meanwhile, had the Conservatives at 43 percent to the Liberals at 21 percent in a poll done between Nov. 29 and Dec. 1, 2024.\n\nThe first poll to start showing higher support for the Liberals was from Ekos Research, conducted Jan. 5–8 (Trudeau resigned on Jan. 6), with the Conservatives at 41.6 percent and the Liberals at 25. 8 percent. The firm then said the Conservatives’ lead over the Liberals had fallen to just 11 points in a poll conducted Jan. 13–16, and to 5 points according to Feb. 3–13 poll results. \n\nSome observers were skeptical since it was the first poll showing such a large reversal and because of a now-deleted 2022 social media post by Ekos president saying he is “going to make sure” Conservative Leader Pierre Poilievre is “never going to lead my country.”\n\nIn poll results released Feb. 18, Nanos indicated the Conservatives at 39 percent compared to the Liberals at 32 percent. Abacus, in poll results released Feb. 13, reported gains for the Liberals but still had the Conservatives with a comfortable lead of 46 percent against the Liberals’ 27 percent. Meanwhile, in a Feb. 19 release, Leger indicated 41 percent for the Conservatives and 33 percent for the Liberals.\n\nIn the most recent poll, conducted by Ipsos for Global News Feb. 21–24, results suggest that the Liberals are taking the lead with 38 percent support compared to 36 percent for the Conservatives. \n\n“They’re probably angry with the Liberals. They didn’t like Justin Trudeau, but dealing with Donald Trump is just a whole other new level of issue to deal with,” Nanos said in an interview.\n\nNanos said that while the recent February poll numbers are showing pressure for the Conservatives, they are even worse news for the NDP. That party’s support has fallen since December, with Nanos polling showing the New Democrats’ popularity falling from 18 percent to 16 percent; Abacus showing them falling from 18 percent to 15 percent; and Leger showing them falling from 19 percent to 11 percent.\n\n“As the Liberals improve their fortunes, Jagmeet Singh and the New Democrats have to worry about their support eroding even further as progressive voters think that perhaps the Liberals can challenge—not win—but just challenge the federal Conservatives,” Nanos said.\n\nThe sudden change in the Liberals’ popularity could also be an example of the “Rally around the flag” effect, where periods of crises or emergency situations lead to the ruling party seeing a boost in support. This was the case in 2020 during the onset of the COVID-19 pandemic, when the Liberal Party went from having the support of 32 percent of Canadians at the beginning of March to 43 percent support at the end of April, according to Leger polling at the time.Issues With PollingWhile polls can be a useful metric for determining support for political parties, they are far from infallible. The clearest examples can be seen in the last three U.S. elections, where the polls continually underestimated support for Donald Trump.\n\nPolling in the lead-up to the 2016 election highly underestimated support for Trump, leading to his surprise victory over Democratic candidate Hillary Clinton. While the 2020 election saw more accurate polling that correctly determined the election outcome, they still understated Trump’s support by several points.\n\nThe 2024 election again failed to capture the level of support for Trump, with the former president winning all seven swing states despite polls showing a dead heat with Kamala Harris. \n\nConrad Winn, a political science professor at Carleton University, said some pollsters can be inaccurate either because of a lack of training or the usage of methods that “seem objective but are inherently biased.”\n\nWinn, founder of polling company Compas, said surveys can also become inaccurate if respondents feel it necessary to lie about their voting choice. This has been seen with the “Shy Tory” factor in the U.K. in the 1990s, where conservatives were less likely to tell pollsters whom they intended to vote for, and the “Bradley effect” in the United States, where some white voters intending to vote for the white candidates lie to pollsters saying they were undecided or planning to vote for non-white candidates.\n\n“There are many, many ... examples of methods that assure bias, and then there are methods that assure neutrality,” Winn said in an interview. \n\nThe polling done during the recent streak of provincial elections generally seemed to agree with the final outcomes. Still, there have been cases in Canada as well where polls have been wrong. A paper in a 2015 edition of the Canadian Political Science Review said that “absolute change in voter turnout was the strongest predictor of polling accuracy,” while “sample size, survey mode, or electoral volatility were statistically significant predictors.”Political ParallelsThe current political situation of the Liberals recovering in the polls has some parallels to some previous elections. Similar to Trudeau’s resignation announcement in January, Progressive Conservative Prime Minister Brian Mulroney announced his resignation in February 1993 amid low popularity numbers. \n\nMulroney was replaced by Kim Campbell in June that year. Campbell’s leadership initially allowed the party to recover in the polls, rising from 21 percent support to the Liberals’ 49 percent in mid-February, and then to 35 percent support compared to the Liberals’ 39 percent by the end of June. However, the Tories’ popularity steadily declined throughout the rest of the year, and the October election saw them lose 154 seats as well as their official party status.\n\nA similar scenario unfolded in 1984 after Liberal Prime Minister Pierre Trudeau announced his resignation in February. Although the party saw its popularity rise after John Turner replaced Trudeau in June, and polls for that month showed the Liberals with 49 percent support compared to the Progressive Conservatives’ 39 percent, the Liberals went on to lose the fall election and 95 seats. \n\nForm Liberal MP Dan McTeague said the Liberals’ current popularity numbers resemble the 1993 and 1984 situations. \n\n“People were fairly upset, and turned out they weren’t just upset with the leadership, they were upset with the brand,” McTeague said.\n\n“A lot of people say, ‘Well, the only poll that counts is the one on election day,’” he said.","summary":"News Analysis Several polls indicate that the Liberal Party has made a recovery in support in the last two months. The polls suggest differing results, with some showing the Liberals catching up to the Conservatives or in one case even surpassing them, while another shows the Conservatives still maintaining a two-digit lead despite the Liberals [&#8230;]","url":"https://www.theepochtimes.com/world/whats-in-a-poll-5816730","image":"https://img.theepochtimes.com/assets/uploads/2025/02/26/id5816929-CP173050594-0-300x180.jpg","video":null,"publish_date":"2025-02-27 20:31:30","author":"Matthew Horwood","authors":["Matthew Horwood"],"language":"en","source_country":"us","sentiment":-0.603},{"id":295068840,"title":"WNBA champ Natasha Cloud says 'it's time to break down a system that has only been about White men'","text":"WNBA champion Natasha Cloud talked about her passion for social justice on Thursday. Cloud, who previously spoke out against the U.S. government on social media over the cost of living in May 2024, spoke this week in defense of DEI after President Donald Trump ordered the elimination of several government DEI programs. \"The systems of power are working as they always were intended to work,\" Cloud told The Associated Press. \"And it’s time to break down a system that has only been about White men.\" Cloud added that she believes the country is putting \"money over people.\" \"I understand the business aspect and I understand the human aspect,\" Cloud said. \"Too often this country has put the human aspect aside, and put profit and money over people.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM The 33-year-old Connecticut Sun guard's previous statement on the cost of living called for Americans of all backgrounds to speak up about the high cost of living. \"At some point we gotta put our differences aside and understand WE ARE ALL GETTING f-----. & idk about yall im tired of this s---. Everybody can eat. They just make us think everyone eating means someone’s taking from your plate. A lie. Our government been taking all OUR food,\" she wrote on X. \"Forreal idc if you’re a republican or a democrat. White black brown..idc what your religion or sexual preference is. Etc. \"If you don’t wanna fight for a stranger than fight for Yourself Your kids Your grandkids Your parents who worked their entire lives to not be able to afford retiring Your sister who pays thousand for insulin that costs dollars to make Your daughter in 100k debt after college.\" UCONN STAR PAIGE BUECKERS SAYS EMBRACING CHRISTIANITY IS BECOMING MORE COMMON IN WOMEN'S BASKETBALL In that post, Cloud tagged the Democratic Party, Republican Party, former President Joe Biden and former Vice President Kamala Harris, while pointing out issues like inflation and the national minimum wage. But prior to that, in 2020, Cloud sat out the WNBA season to focus on community reform efforts and join the George Floyd protests. She also used her social media platforms that year to call for WNBA arenas to be used as polling locations. Now, Cloud is just one of the players on the Connecticut Sun calling for political activism at the start of Trump's second term. CLICK HERE TO GET THE FOX NEWS APP Her Connecticut Sun teammate DiJonai Carrington incited fierce backlash by wearing an anti-Trump shirt in January, and a week later she called for WNBA players to \"take action.\" \"We see that some of the policies are already going into action, and, of course, that means that as the WNBA and being at the forefront of a lot of these movements, it's time for us to also take action,\" Carrington said. \"It definitely needs to happen as women, women's rights being taken away, like, now, LGBTQ rights being taken away now. They haven't happened yet, but definitely in the works.\" The Associated Press contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"WNBA veteran Natasha Cloud spoke this week in defense of DEI after President Donald Trump ordered the elimination of several government DEI programs.","url":"https://www.foxnews.com/sports/wnba-champ-natasha-cloud-says-its-time-break-down-system-has-only-been-about-white-men","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/natasha-cloud2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-27 20:26:45","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":-0.042},{"id":295056752,"title":"King Charles Invites Donald Trump for 'Unprecedented' Second State Visit to the U.K.","text":"King Charles has invited U.S. President Donald Trump for an \"unprecedented\" second state visit to the United Kingdom.\n\n On Feb. 27, British Prime Minister Keir Starmer presented Trump, 78, with a letter from the King, 76, inviting him for an official visit. The moment unfolded during a press conference in the Oval Office at the White House, and Trump accepted the invitation on the spot.\n\n \"He's a beautiful man and a wonderful man. We appreciate. I've gotten to know him very well actually. First term and now a second term,\" the president said in a video shared on X. \"Perhaps you'd like to say what that very important paragraph...\" and handed the premier the letter. \n\n Starmer, the leader of the Labour Party, said, \"Yeah, so this is a letter from His Majesty the King. It's an invitation for a second state visit.\"\n\n \"This is really special. This has never happened before, this is unprecedented,\" the prime minister continued. \"I think that just symbolizes the strength of the relationship between us. This is a very special letter, I think the last state visit was a tremendous success. His Majesty the King wants to make this visit even better than that, so this is truly historic. An unprecedented second state visit, he wants to talk that through with you.\"\n\n Trump remarked that the letter \"says at Windsor,\" which he described \"really something.\" \n\n Starmer, 62, said yes and asked, \"What I haven't gotten yet is your answer?\" which made the room laugh.\n\n \"The answer is yes, on behalf of our wonderful first lady, Melania, and myself, the answer is yes,\" replied Trump, who entered office for his second term on Jan. 20. \"We look forward to being there and honoring the King, honoring your country. Your country is a fantastic country, and it will be an honor to be there.\"\n\n A date was not announced for the proposed state visit.\n\n Trump becomes the first elected political leader in modern times to be invited for two state visits by a British monarch.\n\n Queen Elizabeth first invited Trump for a state visit to the U.K. after he was sworn into office during his first term in 2017, but the official state trip was repeatedly postponed amid speculation over the protests he might face, The New York Times reported at the time. In addition to other controversies surrounding his relationship with Great Britain, Trump sparked backlash in June 2017 after he criticized London’s mayor in the wake of a terror attack there. \n\n Queen Elizabeth met Trump and Melania on July 13, 2018, at Windsor Castle, where the American president made waves by walking in front of the monarch while inspecting the Guard of Honor, widely interpreted as a breach of protocol around the sovereign. \n\n The state visit came to fruition in June 2019 and coincided with the 75th anniversary of D-Day then. The state banquet of the Trumps' state visit was memorably attended by Queen Elizabeth, then-Prince Charles, the future Queen Camilla, Prince William and Kate Middleton. Prince Harry and Meghan Markle — who had welcomed their first child, son Prince Archie, the month prior — did not attend the diplomatic dinner.\n\n Trump connected with some of the British royals again at the NATO 70th anniversary reception at Buckingham Palace that December.\n\n In July 2024, it emerged that King Charles sent a letter to Trump after he was shot in an assassination attempt at a campaign rally in Pennsylvania. Trump went on to win the 2024 presidential election on the Republican ticket against Kamala Harris, and crossed paths with Prince William at the ceremonial reopening of the Notre Dame Cathedral in Paris in December 2024.\n\n The Prince of Wales, 42, represented his father at the ceremony as he further his role as a global statesman, and Trump later relayed that he was charmed by William when they met one-on-one at the U.K. Ambassador's Residence.\n\n \"I asked him about his wife, and he said she’s doing well. And I asked him about his father and his father is fighting very hard, and he loves his father and he loves his wife, so it was sad,\" Trump told The New York Post at the time about meeting William. He was seemingly referring to Princess Kate and King Charles' cancer diagnoses, both announced in 2024. The Princess of Wales has since shared that she is in \"remission,\" while the King's treatment is continuing into this year.\n\n Can't get enough of PEOPLE's Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, Meghan Markle and more!\n\n \"We had a great talk for half an hour, a little more than half an hour. We had a great, great talk,\" Trump said, adding that William looked well and \"very handsome.\" \n\n \"He’s a good-looking guy. He looked really, very handsome last night,\" he told the Post. \"Some people look better in person? He looked great. He looked really nice, and I told him that.\"\n\n \"I had a great talk with the prince,\" Trump said about the time they spent together.\n\n State visits are arranged as a way for Britain to maintain strong bonds with other countries and are organized in both outward and incoming formats. There's plenty of pomp and circumstance to the traditional schedules, which typically include a ceremonial welcome at Horse Guards Parade, Guard of Honor inspection, state banquet at Buckingham Palace, speeches and meetings with leaders over a few following days.","summary":"\"I think the last state visit was a tremendous success. His Majesty the King wants to make this visit even better than that, so this is truly historic,\" said Prime Minister Keir Starmer","url":"https://people.com/king-charles-invites-donald-trump-unprecedented-second-state-visit-uk-11687759","image":"https://people.com/thmb/td9HHy-mswyshdqs2rZaBACTXmI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/king-charles-invited-donald-trump-for-visit-tout-022725-0ce90350c09a48d8a8d1178319fe2c9a.jpg","video":null,"publish_date":"2025-02-27 20:03:59","author":"Janine Henni","authors":["Janine Henni"],"language":"en","category":"politics","source_country":"US","sentiment":0.498},{"id":295059152,"title":"Matt Taibbi: The Collapse of the Censorship Regime","text":"Are the online speech wars over? Just asking questions. \n\nAward-winning journalist Matt Taibbi joins Reason's Zach Weissmueller and Liz Wolfe on Just Asking Questions today to help analyze Vice President J.D. Vance's blistering speech at the Munich Security Conference, where Vance called on Europe's leaders to stop suppressing speech, banning populist political parties, and annulling elections. Taibbi predicts Vance's speech will be \"remembered as a moment of grave importance,\" as it signals the \"collapse of the post–World War II order.\" They also discuss a nonconfrontational 60 Minutes segment about German speech laws, Tulsi Gabbard's confirmation as director of national intelligence, the crumbling legitimacy of legacy media, and why Taibbi is glad Kamala Harris lost the 2024 election. \n\nYou can find Taibbi's work these days at racket.news and on the America This Week podcast with Walter Kirn. \n\nSources Referenced:\n\n \"Vice President J.D. Vance Delivers Remarks at the Munich Security Conference\" (Full speech) Full 60 Minutes video on Germany's censorship \"Bipartisan Coalition Finally Tells Europe, and the FBI, to Shove It,\" by Matt Taibbi Sen. Wyden questions Gabbard in confirmation hearing Original Romanian government document about the country's nullified election United States Department of State: Statement on Romania's Presidential Elections \"British Man Convicted of Criminal Charges for Praying Silently Near Abortion Clinic,\" by Emma Camp \"Trump Officials Attack a German Consensus on Nazis and Speech,\" by Jim Tankersley The Ron Wyden–Andy Biggs Letter to Director of National Intelligence Tulsi Gabbard on backdoor encryption Just Asking Questions with Lee Fang Just Asking Questions with Mike Pesca \n\n00:00 Coming up… 00:25 Introducing Matt Taibbi 00:54 Analyzing J.D. Vance's Munich speech 24:17 The history of free speech in Europe 32:09 Back to Vance: the end of the post–World War II American and European alliance? 35:58 Fear of populism fuels censorship 45:13 Is U.S. intelligence using the European Union to route around the First Amendment? 50:32 Tulsi Gabbard as the new director of national intelligence 53:53 Who did Matt Taibbi vote for? 58:05 Reacting to 60 Minutes' praise of German censors 01:16:40 Will the Democrats do any real post-election reflection? (No) 01:19:48 What is a question that you think more people should be asking?\n\nProducer: John Osterhoudt","summary":"The award-winning journalist discusses the collapse of a post–World War II consensus, online speech police, and the legacy media on the latest episode of Just Asking Questions.","url":"https://reason.com/podcast/2025/02/27/matt-taibbi-the-collapse-of-the-censorship-regime/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/02/Matt-2.png","video":null,"publish_date":"2025-02-27 20:00:51","author":"Matt Taibbi,Zach Weissmueller","authors":["Matt Taibbi","Zach Weissmueller"],"language":"en","source_country":"us","sentiment":0.064},{"id":295058602,"title":"Jeff Bezos applauded for reining in 'absurd lunacy' of Washington Post opinion pages","text":"‘Fox & Friends Weekend’ co-host Charlie Hurt reacted Thursday to Washington Post owner Jeff Bezos announcing a shift in direction for the paper's notoriously left-wing editorial pages. Bezos announced that the commentary would now focus on \"personal liberties and free markets.\" Hurt, opinion editor of The Washington Times, said the move is the latest indication that the Amazon billionaire wants the paper to move away from \"lunatic\" resistance to President Trump. WASHINGTON POST STAFFERS URGE OWNER JEFF BEZOS TO MEET IN SCATHING LETTER: ‘WE ARE DEEPLY ALARMED’ CHARLIE HURT: It sort of exposes the absurd lunacy, and The Washington Post has always been kind of a lunatic outfit over the past 20 years, but they really sort of lost it. I think it started in the Obama administration, where they just stopped questioning the administration. Then came 2016, when Donald Trump became president, they went just completely stark raving mad, and they didn't even pretend to try to actually cover the news. They just became this attack organization that, whatever Trump said, had to be bad. They lost all of their independence. So, I think it's really a reflection of that, but also a reflection of the realities of what's going on in newspapers. Obviously, the newspaper business is all but dead. … When I started in the business, we printed money. It was unlimited the amount of money we could make and that's no longer true. I think that Jeff Bezos looks at the situation and says, look, if this editorial page isn't going to reflect a reasonable, sane position that I could defend, then I'm not going to keep bankrolling it to the tune that I have to right now, because it's not making the money that they're used to it making. The personal freedom thing … I think it'd be so interesting to go back and look at every editorial that they wrote about, say, COVID lockdowns and put it through the new lens of personal freedom. Man, every editorial these people wrote over the past 10 or 15 years, you would have to like, flip it over, and it would almost be the opposite. Washington Post owner Jeff Bezos announced in an X post Wednesday, some major changes to the outlet's opinion page, including that the editorial page editor David Shipley would be stepping down as they introduce the changes. \"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets. We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others,\" Bezos wrote on X, announcing the decision. The paper came under fire after Bezos stopped the editorial page from endorsing former Vice President Kamala Harris in 2024, prompting several staffers to flee the paper. Former columnist Jennifer Rubin and editor-at-large left amid the endorsement fallout. Liberals also canceled their subscriptions to the Post after its non-endorsement decision. \"This is not about siding with any political party. This is about being crystal clear about what we stand for as a newspaper. Doing this is a critical part of serving as a premier news publication across America and for all Americans,\" the statement continued. \"Bravo, @jeffbezos!\" Elon Musk, wrote on X after reading the announcement. CLICK HERE TO GET THE FOX NEWS APP","summary":"&apos;Fox &amp; Friends Weekend&apos; co-host Charlie Hurt said the shift in the &apos;lunatic outfit&apos; newspaper company comes as a result of the company &apos;losing its independence.&apos;","url":"https://www.foxnews.com/media/jeff-bezos-applauded-reining-absurd-lunacy-washington-post-opinion-pages","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/10/931/523/bezos-washington-post.png?ve=1&tl=1","video":null,"publish_date":"2025-02-27 19:51:14","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.238},{"id":295053636,"title":"Tim Walz Claims America Was Stolen ‘by Fascists and Nazis’","text":"DAILY CALLER NEWS FOUNDATION—Former vice presidential candidate and Democratic Minnesota Gov. Tim Walz was caught claiming that America is being stolen by “fascists and Nazis,” according to an alleged recording of his statements.\n\nWalz defended the Democratic Party’s loud protests against President Donald Trump and Department of Government Efficiency (DOGE) overseer Elon Musk by stating that his party wants to protect the U.S. from so-called “Nazis,” according to a recording obtained by Alpha News. The outlet claimed to have received the recording from Republican Minnesota State Sen. Nate Wesenberg, who said the remarks were made at a Minnesota Nurses Association event.\n\n“I see the pundits on TV [asking], ‘what’s wrong with the Democratic Party?’ What’s wrong is our country is being stolen by fascists and Nazis and we’re trying to do all we can to try and [stop] that,” Walz said according to the recording.\n\nWalz, who was former Vice President Kamala Harris’ running mate in the 2024 presidential election, has previously invoked the Nazis when talking about Trump and Musk. He accused Musk in January of performing a Nazi salute during the inaugural parade at the Capitol One Arena in Washington, D.C., which Musk himself has repeatedly denied.\n\n“We spent three days, you know, having them try to debate whether President Musk gave a Nazi salute,” Walz told MSNBC’s Rachel Maddow during a Jan. 28 segment. “Of course he did. But that is a distraction.”\n\nMusk, who has been a staunch defender of the Jewish people, extended his arm as he told the audience that his heart “goes out to [them].”\n\nThe Minnesota governor also compared Trump’s massive campaign rally at Madison Square Garden to the 1939 pro-Nazi rally at the same arena. Democrats, including former President Bill Clinton, have held political events and rallies at the same stadium in the past.\n\nDuring the 2024 election cycle, Harris similarly accused Trump of being a “fascist” during a CNN town hall less than two weeks before the election.\n\nDemocrats repeatedly warned during the election cycle that Trump posed an “existential threat to democracy” and are currently arguing that the U.S. is facing a “constitutional crisis” over the administration’s efforts to eliminate wasteful government spending.\n\nWalz’s office and Wesenberg did not immediately respond to the Daily Caller News Foundation’s request for comment.\n\nOriginally published by the Daily Caller News Foundation","summary":"DAILY CALLER NEWS FOUNDATION—Former vice presidential candidate and Democratic Minnesota Gov. Tim Walz was caught claiming that America is being stolen by “fascists and Nazis,”... Read More\n\n\nThe post Tim Walz Claims America Was Stolen ‘by Fascists and Nazis’ appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/27/tim-walz-claims-america-was-stolen-by-fascists-and-nazis/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/GettyImages-2182134988.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-02-27 19:39:59","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","source_country":"us","sentiment":-0.532},{"id":295022056,"title":"Three billionaires: America’s oligarchy is now fully exposed | Robert Reich","text":"One of the unacknowledged advantages of the horrendous era we’ve entered is that it is revealing for all to see the putrid connections between great wealth and great power.\n\nOligarchs are fully exposed and they are defiant. It’s like hitting the “reveal codes” key on older computers that let you see everything.\n\nOn Wednesday, Jeff Bezos, the third-richest person in America, who bought the Washington Post in 2013, announced that the paper’s opinion section would henceforth focus on defending “personal liberties and free markets”.\n\nAnything inconsistent with this view would not be published, according to his statement. “Viewpoints opposing those pillars will be left to be published by others.”\n\nThe Post’s opinion editor, David Shipley, promptly resigned, as he should have.\n\nYou’ll recall that Bezos barred the Post from endorsing Kamala Harris in the last weeks of the 2024 election. Subsequently, the paper wouldn’t print its cartoonist’s drawing showing Bezos and other oligarchs bowing to Trump, leading the cartoonist to resign.\n\nElon Musk, the richest person in the world, bought Twitter in 2022, laid off everyone who was filtering out hateful crap on the platform, renamed it X and turned it into a cesspool of lies in support of Trump.\n\nMark Zuckerberg, the second-richest person, has followed suit, allowing Facebook to emit lies, hate and bigotry in support of Trump’s lies, hate and bigotry.\n\nAll three of these men were in the first row at Trump’s inauguration. They, and other billionaires, have now exposed themselves for what they are.\n\nThey are the oligarchy. They continue to siphon off the wealth of the nation. They are supporting a tyrant who is promising them tax cuts and regulatory rollbacks that will make them even richer.\n\nThey are destroying democracy so they won’t have to worry about “parasites” (as Musk calls people who depend on government assistance) demanding anything more from them.\n\nWhen billionaires take control of our communication channels, it’s not a win for free speech. It’s a win for their billionaire babble.\n\nWhen they talk of “personal liberties and free markets” they mean their own liberties to become even richer and more powerful, as the rest of America slides into worse economic insecurity and fear.\n\nWhen they speak of “freedom”, what they actually seek is freedom from accountability.\n\nThis “reveal code” moment is, in a way, a blessing. It allows everyone to see where the money and power have gone.\n\nIt is a prerequisite to the long and difficult but necessary process of creating an economy and democracy for the many rather than the few.","summary":"As Jeff Bezos, Mark Zuckerberg and Elon Musk alter US media, the connections between wealth and power are in plain sight\n\nOne of the unacknowledged advantages of the horrendous era we’ve entered is that it is revealing for all to see the putrid connections between great wealth and great power.\n\nOligarchs are fully exposed and they are defiant. It’s like hitting the “reveal codes” key on older computers that let you see everything.\n\n Continue reading...","url":"https://www.theguardian.com/commentisfree/2025/feb/27/america-billionaires-bezos-zuckerberg-musk","image":"https://i.guim.co.uk/img/media/4dc65c81185f1f3416a1a54bfb7144ca6a6f2ddf/0_6_5499_3299/master/5499.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3Bpb","video":null,"publish_date":"2025-02-27 17:37:40","author":"Robert Reich","authors":["Robert Reich"],"language":"en","source_country":"gb","sentiment":-0.099},{"id":295074692,"title":"The US Warfare State Paved the Way for a Trumpist Autocracy","text":"Donald Trump’s power has thrived on the economics, politics, and culture of war. The runaway militarism of the last quarter-century was a crucial factor in making President Trump possible, even if it goes virtually unmentioned in mainstream media and political discourse. That silence is particularly notable among Democratic leaders, who have routinely joined in bipartisan messaging to boost the warfare state that fueled the rise of Trumpism.\n\nTrump first ran for president nearly a decade and a half after the “Global War on Terror” began in the wake of the 9/11 attacks. The crusade’s allure had worn off. The national mood was markedly different than in the era when President George W. Bush insisted that “our responsibility” was to “rid the world of evil.”\n\nWorking-class Americans had more modest goals for their government. Distress festered as income inequality widened and economic hardships worsened, while federal spending on war, the Pentagon budget, and the “national security” state continued to zoom upward. Even though the domestic effects of protracted warfare were proving to be enormous, multilayered, and deeply alienating, elites in Washington scarcely seemed to notice.\n\nDonald Trump, however, did notice.\n\nPundits were shocked in 2015 when Trump mocked the war record of Republican Senator John McCain. The usual partisan paradigms were further upended during the 2016 presidential campaign when Trump denounced his opponent, Hillary Clinton, as “trigger happy.” He had a point. McCain, Clinton, and their cohort weren’t tired of U.S. warfare — in fact, they kept glorifying it — but many in non-affluent communities had grown sick of its stateside consequences.\n\nRepeated deployments of Americans to war zones had taken their toll. The physical and emotional wounds of returning troops were widespread. And while politicians were fond of waxing eloquent about “the fallen,” the continual massive spending for war and preparations for more of it depleted badly needed resources at home.\n\nStatus Quo Militarism\n\nPresident Barack Obama and Hillary Clinton represented the status quo that Trump ran against and defeated. Like them, he was completely insulated from the harsh boomerang effects of the warfare state. Unlike them, he sensed how to effectively exploit the discontent and anger it was causing.\n\nObama was not clueless. He acknowledged some downsides to endless war in a much-praised speech during his second term in office. “Our systematic effort to dismantle terrorist organizations must continue,” he affirmed at the National Defense University. “But this war, like all wars, must end. That’s what history advises. That’s what our democracy demands.”\n\nNew Yorker journalist Jane Mayer hailed that instance of presidential oratory in a piece touting Obama’s “anguish over the difficult trade-offs that perpetual war poses to a free society.” But such concerns were fleeting at the White House, while sparking little interest from mainstream journalists. Perpetual war had become wallpaper in the media echo chamber.\n\nPresident Bush’s messianic calls to rid the world of “evil-doers” had fallen out of fashion, but militarism remained firmly embedded in the political economy. Corporate contracts with the Pentagon and kindred agencies only escalated. But when Hillary Clinton ran for president in 2016, being a rigid hawk became a negative with the electorate as pro-Trump forces jumped into the opening she provided.\n\nSix weeks before the election, Forbes published an article under the headline “Hillary Clinton Never Met a War She Didn’t Want Other Americans to Fight.” Written by Doug Bandow, former special assistant to President Ronald Reagan, the piece exemplified how partisan rhetoric about war and peace had abruptly changed. Clinton “almost certainly would lead America into more foolish wars,” Bandow contended, adding: “No one knows what Trump would do in a given situation, which means there is a chance he would do the right thing. In contrast, Clinton’s beliefs, behavior, and promises all suggest that she most likely would do the wrong thing, embracing a militaristic status quo which most Americans recognize has failed disastrously.”\n\nClinton was following a timeworn formula for Democrats trying to inoculate themselves against charges of being soft on foreign enemies, whether communists or terrorists. Yet Trump, deft at labeling his foes both wimps and warmongers, ran rings around the Democratic nominee. In that close election, Clinton’s resolutely pro-war stance may have cost her the presidency.\n\n“Even controlling in a statistical model for many other alternative explanations, we find that there is a significant and meaningful relationship between a community’s rate of military sacrifice and its support for Trump,” a study by scholars Douglas Kriner and Francis Shen concluded. “Our statistical model suggests that if three states key to Trump’s victory — Pennsylvania, Michigan, and Wisconsin — had suffered even a modestly lower casualty rate, all three could have flipped from red to blue and sent Hillary Clinton to the White House.” Professors Kriner and Shen suggested that Democrats might want to “reexamine their foreign policy posture if they hope to erase Trump’s electoral gains among constituencies exhausted and alienated by 15 years of war.”\n\nBut such advice went unheeded. Leading Democrats and Republicans remained on autopilot for the warfare state as the Pentagon budget kept rising.\n\nOn the War Train With Donald Trump\n\nIn 2018, the top Democrats in Washington, Nancy Pelosi and Chuck Schumer, boasted that they were fully aligned with President Trump in jacking up Pentagon spending. After Trump called for an 11% increase over two years in the already-bloated “defense” budget, Pelosi sent an email to House Democrats declaring, “In our negotiations, congressional Democrats have been fighting for increases in funding for defense.” The office of Senate Democratic leader Chuck Schumer proudly stated: “We fully support President Trump’s Defense Department’s request.”\n\nBy then, fraying social safety nets and chronic fears of economic insecurity had become ever more common across the country. The national pattern evoked Martin Luther King’s comment that profligate military spending was like “some demonic destructive suction tube.”\n\nIn 2020, recurring rhetoric from Joe Biden in his winning presidential campaign went like this: “If we give Donald Trump eight years in the White House, he will forever alter the character of our nation.” But Biden said nothing about how almost 20 years of nonstop war funding and war making had already altered the character of the nation.\n\nAt first glance, President Biden seemed to step away from continuing the “war on terror.” The last U.S. troops left Afghanistan by the end of August 2021. Speaking to the United Nations General Assembly weeks later, he proclaimed: “I stand here today, for the first time in 20 years, with the United States not at war.” But even as he spoke, a new report from the Costs of War Project at Brown University indicated that the “war on terror” persisted on several continents. “The war continues in over 80 countries,” said Catherine Lutz, the project’s co-director. The war’s cost to taxpayers, the project estimated, was already at least $8 trillion.\n\nBiden’s designated successor, Vice President Kamala Harris, displayed a traditional militaristic reflex while campaigning against Trump. In her acceptance speech at the Democratic convention she pledged to maintain “the strongest, most lethal fighting force in the world.” Such rhetoric was problematic for attracting voters from the Democratic base reluctant to cast ballots for a war party. More damaging to her election prospects was her refusal to distance herself from Biden’s insistence on continuing to supply huge quantities of weaponry to Israel for the horrific war in Gaza.\n\nSupplementing the automatic $3.8 billion in annual U.S. military aid to Israel, special new appropriations for weaponry totaling tens of billions of dollars enabled mass killing in Gaza. Poll results at the time showed that Harris would have gained support in swing states if she had called for an arms embargo on Israel as long as the Gaza war continued. She refused to do so.\n\nPost-election polling underscored how Harris’s support for that Israeli war appreciably harmed her chances to defeat Trump. In 2024, as in 2016, Trump notably benefitted from the unwavering militarism of his Democratic opponent.\n\nOverseas, the realities of nonstop war have been unfathomably devastating. Estimates from the Costs of War Project put the number of direct deaths in major war zones from U.S.-led actions under the “war on terror” brand at more than 900,000. With indirect deaths included, the number jumps to “4.5 million and counting.” The researchers explain that “some people were killed in the fighting, but far more, especially children, have been killed by the reverberating effects of war, such as the spread of disease.”\n\nThat colossal destruction of faraway human beings and the decimation of distant societies have gotten scant attention in mainstream U.S. media and politics. The far-reaching impacts of incessant war on American life in this century have also gotten short shrift. Midway through the Biden presidency, trying to sum up some of those domestic impacts, I wrote in my book War Made Invisible:\n\n“Overall, the country is gripped by war’s dispersed and often private consequences — the aggravated tendencies toward violence, the physical wartime injuries, the post-traumatic stress, the profusion of men who learned to use guns and were trained to shoot to kill when scarcely out of adolescence, the role modeling from recruitment ads to popular movies to bellicose bombast from high-ranking leaders, and much more. The country is also in the grip of tragic absences: the health care not deemed fundable by those who approve federal budgets larded with military spending, the child care and elder care and family leave not provided by those same budgets, the public schools deprived of adequate funding, the college students and former students saddled with onerous debt, the uncountable other everyday deficits that have continued to lower the bar of the acceptable and the tolerated.”\n\nWhile the warfare state seems all too natural to most politicians and journalists, its consequences over time have been transformational for the United States in ways that have distinctly skewed the political climate. Along the way, militarism has been integral to the rise of the billionaire tech barons who are now teaming up with an increasingly fascistic Donald Trump.\n\nThe Military-Industrial-Tech Complex\n\nWhile President Trump has granted Elon Musk unprecedented power, many other tech moguls have rushed to ingratiate themselves. The pandering became shameless within hours of his election victory last November.\n\n“Congratulations to President Trump on a decisive victory,” Meta’s CEO Mark Zuckerberg wrote. “We have great opportunities ahead of us as a country. Looking forward to working with you and your administration.” Jeff Bezos, the owner of Amazon, Whole Foods, and the Washington Post, tweeted: “wishing @realDonaldTrump all success in leading and uniting the America we all love.”\n\nAmazon Web Services alone has numerous government contracts, including one with the National Security Agency worth $10 billion and deals with the Pentagon pegged at $9.7 billion. Such commerce is nothing new. For many years, thousands of contracts have tied the tech giants to the military-industrial complex.\n\nMusk, Zuckerberg, Bezos, and smaller rivals are at the helm of corporations eager for government megadeals, tax breaks, and much more. For them, the governmental terrain of the new Trump era is the latest territory to navigate for maximizing their profits. With annual military outlays at 54% of all federal discretionary spending, the incentives are astronomical for all kinds of companies to make nice with the war machine and the man now running it.\n\nWhile Democrats in Congress have long denounced Trump as an enemy of democracy, they haven’t put any sort of brake on American militarism. Certainly, there are many reasons for Trump’s second triumph, including his exploitation of racism, misogyny, nativism, and other assorted bigotries. Yet his election victories owe much to the Democratic Party’s failure to serve the working class, a failure intermeshed with its insistence on serving the industries of war. Meanwhile, spending more on the military than the next nine countries combined, U.S. government leaders tacitly lay claim to a kind of divine overpowering virtue.\n\nAs history attests, militarism can continue for many decades while basic democratic structures, however flawed, remain in place. But as time goes on, militarism is apt to be a major risk factor for developing some modern version of fascism. The more war and preparations for war persist, with all their economic and social impacts, the more core traits of militarism — including reliance on unquestioning obedience to authority and sufficient violence to achieve one’s goals — will permeate the society at large.\n\nDuring the last 10 years, Donald Trump has become ever more autocratic, striving not just to be the nation’s commander-in-chief but also the commandant of a social movement increasingly fascistic in its approach to laws and civic life. He has succeeded in taking on the role of top general for the MAGA forces. The frenzies that energize Trump’s base and propel his strategists have come to resemble the mentalities of warfare. The enemy is whoever dares to get in his way.\n\nA warfare state is well suited for such developments. Pretending that militarism is not a boon to authoritarian politics only strengthens it. The time has certainly come to stop pretending.","summary":"Militarism helped fuel the rise of billionaire tech barons who are now teaming up with an increasingly fascistic Trump.","url":"https://truthout.org/articles/the-us-warfare-state-paved-the-way-for-a-trumpist-autocracy/","image":"https://truthout.org/app/uploads/2025/02/2025_0227-trump-biden-scaled.jpg","video":null,"publish_date":"2025-02-27 17:23:03","author":"Norman Solomon","authors":["Norman Solomon"],"language":"en","category":"politics","source_country":"US","sentiment":0.157},{"id":294997278,"title":"Democratic donor John Morgan launches new political party ahead of possible run for Florida governor","text":"Prominent attorney John Morgan, who supported President Joe Biden but did not get on board to back Vice President Kamala Harris' presidential candidacy, has announced plans to launch a new political party. \"I am forming a new political party for those of us stuck in the middle. Our two party system is broken due to Gerrymandering and divisive issues… both sides. No labels is not an option. Everyone wants a team or tribe. Ron Myers is my lawyer drafting the paperwork. Stay tuned,\" he wrote in a post on X, adding his lawfirm's catchphrase, \"#ForThePeople.\" In another post he noted that he did not vote for Trump or Harris last year. BARRON TRUMP IS ‘SMARTER’ THAN HARRIS CAMPAIGN FOR TELLING FATHER TO GO ON JOE ROGAN: EX-DEM DONOR JOHN MORGAN \"People… we are all on the same f---ing team. I didn’t vote for Trump but I’m pulling like hell for Trump. I didn’t vote for Kamala either btw. It’s time for a third choice. If the choice is only vanilla or chocolate… you never get to eat strawberry,\" he declared. Morgan has previously floated the idea of potentially mounting a gubernatorial bid. Fox News Digital emailed Morgan and reached out to his law firm on Thursday to request a comment from the attorney. Back in 2017, ahead of the state's 2018 election, Morgan ruled out a gubernatorial bid, saying in a tweet that he couldn't \"muster the enthusiasm to run for the nomination.\" \"And I can’t muster enthusiasm for any of today’s politicians. They are all the same. Both parties. I plan to register as an Independent and when I vote, vote for the lesser of two evils. And if I ever ran, run as an Independent,\" he added in another post at the time. He said last year on the Fox News Channel that Harris \"has no talent\" and \"can never run for president again.\" TOP BIDEN DONOR ‘PAUSES’ FUNDRAISER: ‘THIS IS A DECISION FOR PRESIDENT BIDEN’ \"She should go away, and never, ever come back,\" he told Kayleigh McEnany. He described himself as a \"Bill Clinton Democrat,\" but said that he is now an independent. \"I love Joe Biden,\" he declared. Fox News Digital searched for Morgan on Florida's \"Voter Information Lookup\" portal on Thursday and found a result indicating that Morgan has \"No Party Affiliation.\" Fox35orlando.com reported in a December article that the attorney has been registered as having no party affiliation for years. During an interview with Chris Cuomo of NewsNation last year, Morgan praised former President Barack Obama and Rep. Nancy Pelosi, D-Calif. \"I wish he could be president for life,\" he said of Obama. He described Pelosi as the individual he admires \"the most in America.\" \"Any time Nancy Pelosi asks me for money I give it,\" he said, adding that Pelosi took his children to meet the Dalai Lama. \"Whatever she wants, I will do,\" he said. \"I wish she was president.\" BIDEN MEGADONOR REFUSES TO BACK KAMALA HARRIS ‘CORONATION,’ SAYS SHE CAN'T BEAT TRUMP CLICK HERE TO GET THE FOX NEWS APP \"For me, it’s going to be giving to people, not party,\" the wealthy political donor said, according to a New York Times report published earlier this month. \"The D.N.C. learned nothing from the last election.\"","summary":"Attorney John Morgan announces plan to form new political party. He noted that he did not vote for Donald Trump or Kamala Harris in 2024","url":"https://www.foxnews.com/politics/democratic-donor-john-morgan-launches-new-political-party-ahead-possible-run-florida-governor","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/john-morgan-screenshot-edit.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-27 16:21:49","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","category":"politics","source_country":"US","sentiment":-0.149},{"id":294996348,"title":"CNN’s Jake Tapper co-authors new book about ‘cover-up’ of ex-prez Biden’s decline — despite previously waving off age concerns","text":"CNN’s Jake Tapper is the co-author of a new book detailing the lengths to which the Biden administration and its allies engaged in a “cover-up” of Joe Biden’s cognitive decline — even though the anchor himself dismissed concerns about the then-president’s age.\n\nTapper was eviscerated on social media earlier this week after book publisher Penguin Press announced that the veteran anchor of “The Lead” and Axios correspondent Alex Thompson co-authored a book titled “Original Sin: President Biden’s Decline, Its Cover-up, and His Disastrous Choice to Run Again.” \n\nX users pointed out that Tapper frequently brushed aside suggestions that Biden’s verbal gaffes and physical stumbles were signs of advanced aging — instead accepting the administration’s claims that the then-president suffered from a stutter.\n\nIn 2020, Tapper interviewed Lara Trump, the daughter-in-law of President Donald Trump who said that Biden was exhibiting signs of “cognitive decline” while campaigning for the presidency.\n\n“How do you think it makes little kids with stutters feel when they see you make a comment like that?” Tapper asked Lara Trump in the 2020 interview. \n\n“I think you have absolutely no standing to diagnose somebody’s cognitive decline.”\n\nIn 2022, Biden gave a State of the Union address in which he mistakenly referred to Ukrainians as “Iranians.”\n\nIn analyzing the speech afterward, Tapper said: “Considering his speaking talents and challenges, it was a fairly solid performance.”\n\nThe reaction on social media was scathing.\n\n“What a joke,” former White House press secretary Sean Spicer observed on X. “Tapper and @CNN covered up Biden’s decline and now you guys want to profit from it.”\n\n“This is like committing a crime and then investigating yourself for that crime,” wrote Collin Rugg, who added: “If he was serious about exposing the cover up he could just report on what he did and didn’t do between 2021 and 2024.”\n\nSean Davis, a conservative commentator, wrote on X: “Tapper could’ve outed the Biden mental incapacity cover-up at any time over the last four years. But he didn’t.” \n\n“He waited until Biden was gone before trying to get rich for disclosing facts he claimed were lies the whole time Biden was in office,” Davis wrote.\n\nThe book, which is due out on May 20, bears the title “original sin” to describe what the authors view as the initial mistake which led to the Democrats’ downfall in the most recent election — Biden’s decision to run for re-election despite evident signs of his decline.\n\n“What you will learn makes President Biden’s decision to run for reelection seem shockingly narcissistic, self-delusional, and reckless — a desperate bet that went bust — and part of a larger act of extended public deception that has few precedents,” Penguin said in a press release.\n\nBiden, “his family, and his senior aides were so convinced that only he could beat Trump again, they lied to themselves, allies, and the public about his condition and limitations,” according to the press release.\n\n“Toni Morrison once said ‘If there’s a book that you want to read, but it hasn’t been written yet, then you must write it,’” Jake Tapper said in a statement. \n\n“That’s what inspired this book: we wanted to know more about what we all just lived through. More than 200 interviews later, Alex and I have a much better idea. And soon you all will too.”\n\nTapper and Thompson observe that “what the world saw at Joe Biden’s one and only debate was not an anomaly — it was not a cold, it was not someone who was under or overprepared, it was not someone who was just a little tired.” \n\n“It was the natural result of an eighty-one-year-old man whose faculties had been diminishing for years,” the co-authors wrote.\n\n“Biden, his family, and his team let their self-interest and fear of another Trump term justify trying to put an at times addled old man in the Oval Office for four more years,” the authors wrote. \n\n“What was the extent of it? Was it a cover-up? Was it a conspiracy? We will let the facts speak for themselves.”\n\nDuring his presidency, Biden faced growing concerns about his cognitive health, particularly due to his age.\n\nAt 78, he was the oldest president to assume office.\n\nThroughout his term, Biden’s frequent verbal gaffes, moments of confusion and physical stumbles fueled speculation about cognitive decline.\n\nThe White House maintained that he was in good health, but reports suggested aides carefully managed his schedule to limit unscripted interactions.\n\nConcerns intensified during the 2024 election cycle, especially after a poor debate performance in June, where Biden appeared confused and struggled to provide clear responses.\n\nThe debate, which aired on CNN, was moderated by Tapper and network colleague Dana Bash.\n\nThis led to calls for him to withdraw from the race, as polls indicated many voters doubted his ability to serve another term.\n\nA report from Special Counsel Robert Hur in early 2024 further highlighted his memory lapses, describing Biden as a “sympathetic, elderly man with a poor memory.”\n\nMounting pressure ultimately led Biden to withdraw from the 2024 race in July, endorsing Kamala Harris, the then-vice president who went on to lose the election to Donald Trump.\n\nMany analysts believe earlier acknowledgment of these issues could have improved the Democrats’ chances of keeping the White House.\n\nThe Post has sought comment from CNN.","summary":"In 2020, Tapper pushed back on Lara Trump's suggestion that Biden was exhibiting signs of \"cognitive decline\" while campaigning for the presidency.","url":"https://nypost.com/2025/02/27/media/jake-tapper-co-authors-book-about-media-coverup-of-biden-decline/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/99351386.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-27 16:18:45","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","source_country":"us","sentiment":-0.438},{"id":294994814,"title":"Turns Out Top Execs of Org Picked for Billions by Biden EPA Are Big-Time Democrat Donors","text":"DAILY CALLER NEWS FOUNDATION—Top executives of a green organization that the Biden administration’s Environmental Protection Agency selected to receive billions in public funds have collectively made hundreds of thousands of dollars in personal political donations to Democratic candidates and organizations in recent years, a Daily Caller News Foundation review of Federal Election Commission data found.\n\nThe Biden EPA chose the Coalition for Green Capital as an awardee of $5 billion in taxpayer funds through the administration’s massive Greenhouse Gas Reduction Fund program in April 2024. \n\nReed Hundt, the Coalition for Green Capital’s former CEO and chairman, has personally donated nearly $60,000 to Democratic candidates and aligned political organizations going back to 2013, while Richard Kauffman—the group’s CEO who replaced Hundt in January—has personally donated more than $600,000 to help Democrats since 2020, according to FEC data. \n\nHundt made donations of $10,000 to the Harris Victory Fund and the Democratic National Committee in 2024, and he also cut a $10,000 check to the Democratic State Central Committee of Maryland in 2016, FEC records show. Kauffman, meanwhile, gave $150,000 to the DNC in 2020 before giving another $20,900 to the DNC in 2024, the same year in which he made a $50,000 contribution to the Harris Victory Fund, government records show.\n\nKaufmann also donated to numerous state-level Democrat Party organizations and to boost Democrat Senate candidates like former Pennsylvania Sen. Bob Casey in the 2024 race, FEC records show. Notably, the Coalition for Green Capital is a 501(c)(3) nonprofit organization, meaning that it may not directly or indirectly engage in politics, at least as far as the Internal Revenue Service is currently concerned.\n\n“Between 2009 and 2023, CGC and its network mobilized more than $25 billion in public and private capital across America to deliver more affordable electricity, clean air and water, as well as the power to help ensure America’s AI leadership,” a Coalition for Green Capital spokesperson said in a statement to the Daily Caller News Foundation. \n\nThe Coalition for Green Capital spokesperson declined to address specific questions about how it squares the political spending of Hundt and Kauffman, as well as the political connections of other board members, with the organization’s official status as a 501(c)(3) nonprofit.\n\nHundt formerly worked in the Clinton administration as the chairman of the Federal Communications Commission and was a close ally of Vice President Al Gore, while Kauffman was a senior adviser to former Energy Secretary Steven Chu during the Obama administration, according to his LinkedIn profile.\n\nNotably, Hundt’s personal account on X featured numerous anti-Trump posts—including ones endorsing efforts to remove Donald Trump from the ballot—before it was deleted. Hundt did not respond to a request for comment.\n\nThe Coalition for Green Capital has received funding in the past from left-of-center and environmentalist nonprofits, including the Rockefeller Brothers Fund, the ClimateWorks Foundation, and the William and Flora Hewlett Foundation.\n\nThe Coalition for Green Capital features a number of other Democrat insiders in its ranks, the Daily Caller News Foundation reported in 2023 when the group was rumored to be on the shortlist for a major EPA payday. \n\nFor example, its board of directors includes David Hayes, who served as a climate adviser to former President Joe Biden; Cecilia Martinez, a former official in the Biden White House Council on Environmental Quality; Julie Greene Collier, chief of staff for the American Federation of Labor-Congress of Industrial Organizations, a major organized labor federation that endorsed Biden and, subsequently, former Vice President Kamala Harris in the 2024 presidential race. The union donated cash to help Democrats in the 2024 cycle, according to FEC records.\n\n“Coalition for Green Capital, like so many organizations funded by the Biden administration, has no business receiving a dollar of funding from the federal government, much less billions of dollars,” Parker Thayer, an investigative researcher for the Capital Research Center, told the Daily Caller News Foundation. “It is plain to see that the organization is intended to be a slush fund for bailing out the floundering green energy investments of the Democratic Party’s biggest donors.”\n\nNotably, two other groups that the Biden EPA picked to receive billions of taxpayer dollars—Power Forward Communities and Climate United—are also loaded with Democrat insiders, the Daily Caller News Foundation reported previously. The political connections that each of these recipients possess caught the attention of congressional Republicans in May 2024, and current EPA Administrator Lee Zeldin is working to claw back as much cash from the Greenhouse Gas Reduction Fund as possible.\n\nOriginally published by the Daily Caller News Foundation","summary":"DAILY CALLER NEWS FOUNDATION—Top executives of a green organization that the Biden administration&#8217;s Environmental Protection Agency selected to receive billions in public funds have collectively... Read More\n\n\nThe post Turns Out Top Execs of Org Picked for Billions by Biden EPA Are Big-Time Democrat Donors appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/27/top-execs-of-org-picked-billions-by-biden-epa-big-time-democrat-donors/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/Kamala01.jpg","video":null,"publish_date":"2025-02-27 16:00:00","author":"Biden Epa Are,Nick Pope","authors":["Biden Epa Are","Nick Pope"],"language":"en","category":"politics","source_country":"us","sentiment":0.066},{"id":295056520,"title":"‘Dark Ads’ Challenge Truth and Democracy in Australia","text":"The rise of “dark advertising” — personalized advertisements increasingly powered by artificial intelligence that evade public scrutiny — means Australians face a murky information landscape going into the federal election. It’s already happening and, combined with Australia’s failure to enact truth-in-advertising legislation and big tech’s backtracking on fact-checking, means voters are left vulnerable to ad-powered misinformation campaigns. And that’s not good for democracy. Tackling misinformation requires legislative action, international collaboration, and continued pressure on platforms to open their systems to scrutiny. The failures of U.S. tech platforms during their own elections should serve as a clear warning to Australia that industry self-regulation is not an option. Political advertising plays a pivotal role in shaping elections, even while it is shrouded in opacity and increasing misinformation. In the lead-up to the 2025 federal election, a significant volume of deceptive advertising and digital content has already surfaced. That’s not surprising, given the Australian Electoral Commission (AEC) limits its oversight to the official campaign period, meaning false claims can proliferate freely before the official campaign. At the heart of this challenge lies the evolution of digital political advertising. Modern campaigns rely heavily on social media platforms, leveraging associative ad models that tap into beliefs or interests to deliver digital advertising. Unlike traditional media, where ads are visible to all and subject to better regulatory and market scrutiny, digital ads are often fleeting and hidden from public view. Recent AI developments make it easier and cheaper to create false and misleading political ads in large volumes, with multiple variations increasingly difficult to detect. This “dark advertising” creates information asymmetries, where groups have access to information and can control and shape how it’s delivered. That leaves voters exposed to tailored messages that may distort reality. Targeted messaging makes it possible to selectively provide voters with very different views of the same candidate. In the recent U.S. presidential election, a political action committee linked to X owner Elon Musk targeted Arab-American voters with the message that Kamala Harris was a diehard Israel ally, while simultaneously messaging Jewish voters that she was an avid supporter of Palestine. Ad targeting online also lets political advertisers single out groups more likely to be influenced by selective, misleading, or false information. Conservative lobby group Advance Australia’s recent campaign basically followed this playbook, disseminating outdated news articles on Facebook, a tactic known as malinformation, where factual information is deliberately spread misleadingly to harm individuals or groups. The transparency tools provided by Meta, which covers Facebook and Instagram, and Google parent company Alphabet — which include ad libraries and “Why Am I Seeing This Ad?” explanations — also fall woefully short of enabling meaningful oversight. These tools reveal little about the algorithms that determine ad delivery or the audiences being targeted. They do include some demographic breakdowns, but say little about the combination of ads an individual user might have seen and in what context. Recent findings from the United States highlight the vulnerabilities of political advertising in the digital age. An investigation by ProPublica and the Tow Center for Digital Journalism revealed that deceptive political ads thrived on platforms like Facebook and Instagram in the lead-up to the 2024 U.S. elections. Ads frequently employed AI-generated content, including fabricated audio of political figures, to mislead users and harvest personal information. One ad account network has run about 100,000 misleading ads, significantly exploiting Meta's advertising systems. The U.S. developments are alarming, but it's important to recognize Australia’s unique political and regulatory landscape. Fundamental differences in media consumption, political structure, and culture and regulatory frameworks mean that Australia may not necessarily follow the same trajectory as the United States. The AEC does enforce specific rules on political advertising, particularly during official campaign periods, yet oversight is weak outside these periods, meaning misleading content can circulate unchecked. The media blackout period bans political ads on radio and TV three days before the federal election, but it does not apply to online advertising, meaning there is little time to identify or challenge misleading ads. The failure to pass truth-in-political-advertising laws only exacerbates the problem. The Albanese government recently withdrew a proposed truth-in-political-advertising bill, leaving voters vulnerable to misleading content that undermines democratic integrity. The bill was never introduced to Parliament and its future remains uncertain. Ad-driven technology firms like Meta and Alphabet have backed away from previous initiatives to curb misinformation and deceptive advertising and enforce minimum standards. Despite Meta's public commitments to prevent misinformation from spreading, deceptive ads still flourished throughout the 2024 U.S. election, raising significant concerns about the effectiveness of platform self-regulation while backtracking on fact-checking raises concerns about Meta’s overall commitment to combating misinformation. Given these developments, it is unrealistic to expect platforms to proactively police content effectively, especially in a jurisdiction like Australia. Independent computational tools have emerged in an attempt to address these issues. They include browser plugins and mobile apps that allow users to donate their ad data. During the 2022 election, the ADM+S Australian Ad Observatory project collected hundreds of thousands of advertisements, uncovering instances of undisclosed political ads. In the lead-up to the 2025 election, that project will rely on a new mobile advertising toolkit capable of detecting mobile digital political advertising served on Facebook, Instagram, and TikTok. Regulatory solutions like the EU’s Digital Services Act (DSA) offer another potential path forward, mandating access to political advertising data for researchers and policymakers. Australia lags in adopting similar measures. Without some of these solutions, platforms remain free to follow their economic incentive to pump the most sensational, controversial, and attention-getting content into people’s news feeds, regardless of accuracy. This creates a fertile environment for misleading ads, not least because platforms have been given protection from liability. That is not an information system compatible with democracy. Originally published under Creative Commons by 360info™.","summary":"Political inaction and big tech’s reluctance to protect users leave Australians vulnerable to a murky world of digital misinformation going into the election.","url":"https://thediplomat.com/2025/02/dark-ads-challenge-truth-and-democracy-in-australia/","image":"https://thediplomat.com/wp-content/uploads/2025/02/sizes/td-story-s-2/thediplomat_2025-02-27-160518.png","video":null,"publish_date":"2025-02-27 16:00:00","author":"Daniel Angus And Mark Andrejevic","authors":["Daniel Angus And Mark Andrejevic"],"language":"en","category":"politics","source_country":"us","sentiment":0.167},{"id":294981458,"title":"George Clooney blames media for hiding Biden’s mental decline","text":"“I love Joe Biden. As a senator. As a vice president and as president. I consider him a friend, and I believe in him. Believe in his character. Believe in his morals. In the last four years, he’s won many of the battles he’s faced,” Clooney wrote.\n\n“But the one battle he cannot win is the fight against time. None of us can. It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fundraiser was not the Joe ‘big F-ing deal’ Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate.”\n\nClooney told Dowd he wrote the op-ed “despite being urged not to.”\n\nAfter Biden stepped down and endorsed Vice President Kamala Harris to take his place at the top of the Democratic ticket, Clooney backed the party’s new candidate. But in his conversation with Dowd, Clooney said that Trump won over voters because of Biden’s poor messaging.","summary":"Oscar winner opens up on decision to turn on former president","url":"https://torontosun.com/entertainment/celebrity/george-clooney-blames-media-for-hiding-bidens-mental-decline","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/02/2160833058.jpg","video":null,"publish_date":"2025-02-27 15:12:56","author":"Mark Daniell","authors":["Mark Daniell"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.441},{"id":294962414,"title":"Former Biden donor to launch new political party","text":"John Morgan, a Florida lawyer and donor to former US President Joe Biden, has announced the launch of his own political party, citing discontent with both Democrats and Republicans.\n\nMorgan is a billionaire owner of personal injury law firm Morgan & Morgan and an independent who, however, has a long history of fundraising for Democratic campaigns. He made the announcement in a post on X on Wednesday, arguing that America’s two-party system is broken.\n\n“I am forming a new political party for those of us stuck in the middle. Our two party system is broken due to Gerrymandering and divisive issues… both sides. No labels is not an option,” Morgan said, adding that the paperwork for the new party is already being drafted.\n\nThe lawyer is no stranger to politics, having successfully bankrolled constitutional amendments on medical marijuana and raising the minimum wage in Florida. He also previously floated his intention of running for governor of Florida. The state’s next gubernatorial election in 2026 will be an open contest as Governor Ron DeSantis will be ineligible to run again.\n\nMorgan first voiced the idea of forming a new party last year, calling it the Capitalist Party. Commenting on this idea in a recent interview with Florida Playbook, he said, “when you take the ‘D’ and the ‘R’ down, most of us agree on most things,” referring to the Democratic and Republican parties.\n\nMorgan left the Democratic Party in 2017, explaining that he was driven to do so due to disillusionment with its direction. He has continued to support Democratic candidates after leaving the party, including Biden, but refused to contribute to fundraising efforts for former Vice President Kamala Harris in last year’s presidential election, saying “she would not be my first choice.”\n\nHowever, Morgan has expressed enthusiasm over President Donald Trump reelection, saying: “I don’t know if Trump is a stable genius, but he’s a f**king genius.”\n\n“He tapped into something the Republicans never saw, which was anger and populism on that side,” the lawyer said in an interview in December.\n\n It is unclear when Morgan plans to officially register his party, but in his announcement on X, he asked his followers to “stay tuned” for updates.","summary":"Florida lawyer John Morgan has announced he will form his own political party, citing discontent with both Democrats and Republicans \nRead Full Article at RT.com","url":"https://www.rt.com/news/613394-lawyer-us-new-party/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67c0737785f54062753907a9.jpg","video":null,"publish_date":"2025-02-27 14:55:52","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.189},{"id":294967922,"title":"Trump declares Wayne Gretzky a ‘free agent’ as Canada rift continues","text":"After previously referring to Wayne Gretzky as the “governor of Canada,” President Donald Trump has declared the NHL legend a “free agent.”\n\nJustin Trudeau announced his plan to resign as Canada’s prime minister earlier this year, prompting Trump to ask Gretzky if he wanted to be the country’s “governor” after Trump called for Canada to become the “51st state.”\n\nGretzky has faced some criticism from his fellow Canadians over his ties to Trump.\n\nHowever, Trump said in a Truth Social post Wednesday his “friend” is “somewhat “low key” about Canada remaining a separate Country, rather than becoming a cherished and beautiful 51st State.”\n\nSo, “The Great One” is now on the market.\n\n“Wayne Gretzky is a fantastic guy! They call him, ‘The Great One,’ and he is. He could run for any political office in Canada, and win. Wayne is my friend, and he wants to make me happy, and is therefore somewhat ‘low key’ about Canada remaining a separate Country, rather than becoming a cherished and beautiful 51st State, paying much Lower Taxes, a Free and Powerful Military, NO TARIFFS, and having a Booming Economy,” Trump wrote on Wednesday. \n\n“Wayne and Janet, his wonderful wife, love Canada, and they should only support Canada, and whatever else makes the Canadian People, and Governor Justin Trudeau, happy. He’s the Greatest Canadian of them all, and I am therefore making him a ‘free agent,’ because I don’t want anyone in Canada to say anything bad about him. \n\n“He supports Canada the way it is, as he should, even though it’s not nearly as good as it could be as part of the Greatest and Most Powerful Country in the World, the Good Ole’ U.S.A.!”\n\nWhile speaking to reporters at Mar-a-Lago last month, Trump said Gretzky was “not too interested” in becoming Canada’s “governor,” but “he probably would have liked statehood.”\n\nGretzky attended a victory party for Trump’s 2024 election win after Trump defeated Vice President Kamala Harris. Gretzky was spotted wearing a MAGA hat shortly afterward and attended Trump’s inauguration.\n\nThe NHL’s all-time points leader was named Canada’s honorary captain for the 4 Nations Face-Off final against the Americans. Canadian and American fans booed each other’s national anthem during the tournament due to political tensions between the countries.","summary":"After previously referring to Wayne Gretzky as the \"governor of Canada,\" President Donald Trump has declared the NHL legend a \"free agent.\"","url":"https://nypost.com/2025/02/27/sports/trump-declares-wayne-gretzky-a-free-agent-as-canada-rift-continues/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-iyp52zhvq-1740666354477.jpg?quality=75&strip=all&1740648403&w=1200","video":null,"publish_date":"2025-02-27 14:54:10","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":0.576},{"id":295050818,"title":"Uplifting Black History Month","text":"This Black History Month, Report for America is honored to uplift select reporting from corps members covering Black voices and communities, which have historically been undercovered and underrepresented in the media. \n\nAccording to a recent Pew Research Center study, only around 6% of reporting journalists in the United States identify as Black. We bring intentionality to our newsroom partnerships and corps member recruitment efforts, creating more opportunities and support for Black journalists and all journalists of color. Our current reporting corps includes 13% Black journalists. \n\nWe hope you’ll appreciate this selection of recent Report for America corps member stories:At this summer school, students learn about liberation and leadership\n\nBy Rebecca Cadenhead, MLK50, Tennessee\n\n The Sunflower County Freedom Project, a part of the Freedom Project Network, is an organization that gives Mississippi students “holistic and liberatory education experiences” during the summer and after school. Students learn about Black and Indigenous history, math, reading, and public speaking. The original Freedom Schools opened in 1969 to educate young Black Mississippians on Black history and political activism. One teacher said the need for the Freedom Project Network was obvious since local schools don’t teach in-depth Black history, despite Black students representing 84% of the district’s population. “When I was a student, we didn’t receive new textbooks, and we weren’t challenged to read many books,” she said. “Our teachers were amazing with the resources they had. But our schools were under-resourced.”\n\n Cooperatives empower Black farmers amid historic discrimination, land loss struggles\n\nBy Lucille Lannigan, Albany Herald, Georgia\n\n The fight to retain Black-owned land continues in the U.S. as farmers grapple with systemic discrimination that has barred them from government lending programs. To counter this discrimination and lack of access, a group of southwest Georgians came together in 1969 to acquire 6,000 acres of land in Lee County, forming the New Communities cooperative. At the time, it was the largest single land holding for Black people in the country. Though the cooperative later faced land loss, the community is still strong with new cooperatives sprouting in its place.\n\nAt America’s longest-running Black rodeo, ‘real cowgirls and cowboys’ carry on a rich history\n\nBy Anna Pope, KOSU, Oklahoma\n\n The Roy LeBlanc Okmulgee Invitational Rodeo is the nation’s oldest and largest continually-running Black rodeo. Held for two nights in early August at the Bob Arrington Rodeo Arena in Okmulgee, Oklahoma, it includes a variety of rodeo events from bull riding, calf roping, and steer wrestling to the Pony Express, ladies steer undecorating and junior barrel racing. The rodeo was formed in the 50s in response to the town barring Black cowboys from competing in the local rodeo.“The most important part is there are Black cowboys and we do this too. We were the first cowboys,” competitor Aaron Foster said. “It’s a different feeling competing out there; it’s something about it. It’s like history.”\n\n*The story aired nationally on NPR’s All Things Considered\n\nHow one Sacramento group is trying to make special education more accessible for Black families\n\nBy Srishti Prabha, CapRadio, California\n\nThe Black Parallel School Board is a community-based nonprofit founded in 2008 to address systemic inequities affecting Black students in Sacramento by helping families navigate school system bureaucracy. Statewide data underscores the urgency of their work: While Black students make up about 5% of California’s public school population, they are disproportionately represented in special education programs and over-disciplined. A parent of an autistic student said the organization’s advocacy for her son allowed her to finally feel confident in her son’s education. “Even though I knew my son’s rights, my rights as a parent and what he needed to succeed, it always felt like a fight,” she said. “I felt unsupported.” The Black Parallel School Board is mobilizing parents across California and families in five other districts have begun forming their own parallel school boards.\n\n*The story aired nationally on NPR’s Here and Now.\n\nBlack men are changing the game in literacy\n\nBy Ashley Winters, The St. Louis American, Missouri\n\n Three nonprofits worked together to create literacy posters featuring 25 St. Louis-area Black men proudly reading, inspired by vintage READ posters created by the American Library Association. The literacy initiative’s goal is to ignite joy in reading and promote literacy. Data reflects this need, with 81 percent of Black third-graders in the St. Louis metro area failing reading in 2022-2023. The campaign also aims to amplify the presence of Black men reading, Black men reading to the kids in their lives and to increase authentic representations of Black men as critical caregivers. “Our children need to have an image to aspire to,” said the founder of Believe Projects Julius B. Anthony. The combined efforts of Ready Readers, Black Men Read, and the Believe Project will reach more than 20,000 kids throughout the region. \n\nFrom Jim Crow to Kamala Harris: Black elders reflect on historic vote\n\nBy Corli Jay, The TRiiBE, Illinois\n\nFor this story, corps member Corli Jay interviewed five Black elders in Chicago who shared their past and present experiences with voting. The voters touched on segregation and discriminatory voting practices of the past and the historical significance of Kamala Harris potentially being elected the first Black woman president. “[…] I was from an era where Black people had to pay a poll tax to be able to vote,” one voter said. “My dad and some of his friends would pay for people who couldn’t afford to pay just so they had a right to vote. So, […] voting has always been important to me.” One voter compared the significance of Harris’ ticket to Barack Obama’s. “I remember when former President Obama got into office, and how so many people like my grandfather, who was in his 90s, cried to see a Black man that they never thought would get in office […],” she said.","summary":"A photo of Tamorris Carter sitting next to a statue of Rosa Parks while on a field trip to Dallas hangs on the bulletin board at the Sunflower County Freedom Project. Andrea Morales/ MLK50 This Black History Month, Report for America is honored to uplift select reporting from corps members covering Black voices and communities,\n\n\nThe post Uplifting Black History Month appeared first on Report for America.","url":"https://www.reportforamerica.org/2025/02/27/honoring-black-history-month/","image":"https://images.reportforamerica.org/wp-content/uploads/2025/02/240709-FreedomProjects-0071-scaled-Large.jpeg","video":null,"publish_date":"2025-02-27 14:53:59","author":"Gladi Suero","authors":["Gladi Suero"],"language":"en","category":"sports","source_country":"us","sentiment":0.287},{"id":295007100,"title":"'We need to change the conversation': Gavin Newsom starts new podcast","text":"On Tuesday, California Gov. Gavin Newsom announced via social media that he’s launching a new podcast, which he promised will be “anything but the ordinary politician podcast.”\n\nIt will be produced by iHeartMedia, the same San Antonio-based corporation that distributes Texas Sen. Ted Cruz’s thrice-weekly show, “Verdict.” Newsom promised to speak to people “directly that I disagree with” (i.e., Republicans and “architects in the MAGA movement”) as well as those he said he looks up to.\n\n“We need to change the conversation and that’s why I’m launching a new podcast,” Newsom said in a clip posted to X. “There’s an onslaught of information we take in, so let’s take it to the sources without the typical political mumbo-jumbo.”\n\nNewsom also promised to host “real conversations,” about topics like the rising price of eggs and the impact of tariffs on the everyday American. Beyond that, though, the day’s news events will drive what subjects the show hits, Anthony York, a spokesperson for Newsom told Daily Kos.\n\n“While it’s not just gonna be Californians listening to the podcast, a lot of what’s happening here has interest beyond the state’s borders,” York said, citing the wildfires that ravaged the state earlier this year and California’s efforts to rebuild as examples. Though future stories are in flux, York said that there are certain issues Newsom has a “personal interest” in that might make it to the show, such as the burgeoning artificial intelligence and tech industries.wi\n\nSo far, at least, this latest venture by the Democratic governor does sound a lot like the average political podcast. But you can’t really blame Newsom for wanting to attract a wider audience. After all, a verified voter survey from the Republican polling firm Echelon Insights, released earlier this month, asked likely Democratic voters whom they would vote for if the 2028 presidential primary were held today, found Newsom in fourth place. (Only 6% said they preferred Newsom, compared with 36% who wanted Vice President Kamala Harris. Former Transportation Secretary Pete Buttigieg netted 10% support, while 9% of respondents said they backed Minnesota Gov. Tim Walz.)\n\nBut it is notable that, of all mediums, Newsom chose to launch a podcast. His announcement comes as Democrats struggle to find a compelling message while President Donald Trump and his allies destroy the federal government.\n\nIndeed, a Democrat in the podcasting space could be good for the party, especially considering that right-wing influencers have dominated talk radio for decades.\n\nYork said the misinformation Republicans andTrump spread about Newsom and the wildfires underscored “how woefully behind Democrats are in the [podcasting] space.” \n\n“That kind of weaponized misinformation [by Trump and Musk] isn’t accidental, that’s a tactic and it’s effective,” he said. “It’s increasingly important to have information in place to be able to communicate with people, so this is Newsom feeling his way through and trying to experiment a little and build out a different mode of communicating.”\n\nWhile Newsom already co-hosts the show “Politickin’,” which is also produced by iHeart, with Super Bowl champion Marshawn Lynch and agent Doug Hendrickson, the governor suggested to Politico that his new show will give him the chance to focus more extensively on politics.\n\nSpeaking with Daily Kos, York said Newsom’s show will take inspiration from HBO’s “Real Time with Bill Maher” and defended the governor’s decision to invite Republicans onto it. Though it’s not clear who he’s booked for the show, his social media video announcing it featured right-wing influencer Charlie Kirk, DOGE bro Elon Musk, and Florida Gov. Ron DeSantis. Newsom also told Politico to “look at the lineup of [the Conservative Political Action Conference]” if you want a hint as to the half-dozen guests who have already agreed to appear on his show. (York offered no further hints to Daily Kos.)\n\n“Part of his brand is being willing to go into the lion’s den and have conversations with people he doesn’t always agree with. I think the hope is he can engage with ‘the other side’ a little bit and do it in a combative way when required,” York said. “We also hope he can do this in a more thoughtful and deliberative way when the personalities allow.”\n\nIt’s somewhat interesting, though, that Newsom found Republicans willing to go on his show considering CPAC’s recent straw poll, according to Politico, identified him and California Sen. Adam Schiff as two Democrats who pose the greatest threat to the Republicans and the nation. \n\nRelatedly, Newsom has been a frequent critic of Trump. In a November post to his social media site, Truth Social, Trump referred to the California governor as “Gavin Newscum.” \n\nThen again, Newsom is no stranger to the right-wing ecosystem, York said. He’s one of a few Democrats who has made semi-regular appearances on Newsmax and Fox News, two outlets with more conservative audiences. And for some reason, in 2023, he debated DeSantis, another politician who could easily run for the presidency again in 2028.\n\nNewsom assured Politico that his podcast won’t be all about elevating GOP voices, though. In fact, he encouraged Democrats to come on his show so he could challenge them on where the party is on various issues.\n\n“I’m asking the same questions you’re asking of me: Where the hell is the Democratic Party? What are we doing? Who are we? Where are we going? What’s the path back? I’m having the exact same conversations, and I just thought it’d be a hell of a lot more interesting to do it publicly and to do it as honestly as I can,” he said.","summary":"On Tuesday, California Gov. Gavin Newsom announced via social media that he’s launching a new podcast, which he promised will be “anything but the ordinary politician podcast.”\n\n\n\nIt will be produced by iHeartMedia, the same San Antonio-based corporation that distributes Texas Sen. Ted Cruz’s thrice-weekly show, “Verdict.” Newsom promised to speak to people “directly that I disagree with” (i.e., Republicans and “architects in the MAGA movement”) as well as those he said he looks up to.\n\n\n\n“We need to change the conversation and that’s why I’m launching a new podcast,” Newsom said in a clip posted to X. “There’s an onslaught of information we take in, so let’s take it to the sources without the typical political mumbo-jumbo.”\n\n\n\nNewsom also promised to host “real conversations,” about topics like the rising price of eggs and the impact of tariffs on the everyday American. Beyond that, though, the day’s news events will drive what subjects the show hits, Anthony York, a spokesperson for Newsom told Daily Kos.\n\n","url":"https://www.dailykos.com/story/2025/2/27/2306446/-Gavin-Newsom-has-his-reasons-for-starting-another-podcast?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1382861/story_image/AP24222249762268.jpg?1735587811","video":null,"publish_date":"2025-02-27 14:47:09","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"sports","source_country":"US","sentiment":0.042},{"id":294955782,"title":"Jeff Bezos takes the opinions out of the Washington Post opinion pages","text":"The Washington Post’s opinion section is about to include… fewer opinions. Amazon founder Jeff Bezos, who purchased the paper in 2013, announced that the opinion pages would now consult just two themes: “personal liberties and free markets”. Making the announcement on X, the billionaire wrote: “We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.” Bezos, who made the decision for the Post to not make a presidential endorsement for the first time days before Trump was re-elected, defended his decision to restrict opinions at the paper. “There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader’s doorstep every morning a broad-based opinion section that sought to cover all views,” the 61-year-old billionaire wrote. “Today, the internet does that job.”He continued that America’s success was defined by its “freedom in the economic realm and everywhere else”. As a driving force for the Post’s revamped opinion section, he opined simply that “freedom is ethical”. David Shipley, the Post’s opinions editor, has resigned in response to Bezos’ move, having been offered the opportunity to continue leading the section. “I suggested to him that if the answer wasn’t “hell yes,” then it had to be “no.” After careful consideration, David decided to step away,” Bezos wrote. The Post’s publisher and CEO William Lewis sent out a staff email to announce that the change was not about “siding with any political party”. Lewis wrote that this “is about being crystal clear about what we stand for as a newspaper”. Bezos’ move has been read as an attempt to shift the paper away from criticism of the newly elected Donald Trump. Elon Musk, the South African billionaire owner of X and key figure within the Trump administration, asserted his approval, writing “Bravo, @JeffBezos!” on social media. Conservative commentator Charlie Kirk said: “Good! The culture is changing rapidly for the better.”Amazon was one of the many tech firms that gave $1 million donations to Trump’s inauguration, and alongside the Post’s refusal to make a presidential endorsement (having endorsed only Democrats since 1976), Bezos has joined the ranks of the many tech billionaires kowtowing to the new executive-in-chief.The announcement, weeks before the November election, sparked a wave of resignations and thousands of subscription cancellations. Journalists Molly Roberts, David E. Hoffman and Mili Mitra announced their resignation after the paper pulled away from their anticipated endorsement of Kamala Harris. At the time, Shipley said he’d tried to convince Bezos to agree to make the endorsement. “I failed,” he told staffers at a meeting with the editorial section. Now, he joins the ranks of the many who have turned their back on the paper. “Bezos argues for personal liberties. But his news organization now will forbid views other than his own in its opinion section,” wrote Martin Baron, the editor of the Post from 2012 to his retirement in 2021. “There is no doubt in my mind that he is doing this out of fear of the consequences for his other business interests.” In an interview with independent news organisation Zeteo in response to the decision, Baron didn’t mince his words on Bezos. “It’s craven. He’s basically fearful of Trump. He has decided that, as timid and tepid as the editorials have been, they’ve been too tough on Trump.” “He’s saying they’re going to have an opinion page with one point of view. That’s an invitation to the editorial writers and the columnists to take a hike. That’s really extraordinary (considering) everything he has said in the past. It’s a Post that’s not going to be for all of America. At a time when we’re talking about freedom and democracy, he saying there will not be freedom and liberty on our own pages,” Baron continued. Senator Bernie Sanders weighed in with a post on X: “This is what Oligarch ownership of the media looks like,” he wrote. “The second-richest guy in the world, Bezos, owns The Washington Post. He has now declared that the editorial page of that paper is going Trump right-wing. Surprise, Mr. Musk agrees. We must support independent media.”","summary":"In a move seen by many to be appeasing Donald Trump, Washington Post owner Jeff Bezos has announced the restriction of opinions at the paper.","url":"https://www.euronews.com/culture/2025/02/27/jeff-bezos-takes-the-opinions-out-of-the-washington-post-opinion-pages","image":"https://static.euronews.com/articles/stories/09/08/31/10/1440x810_cmsv2_7ac887fe-9b65-57ff-a7f0-0414e1e5799c-9083110.jpg","video":null,"publish_date":"2025-02-27 14:30:34","author":"Jonny Walfisz","authors":["Jonny Walfisz"],"language":"en","category":"politics","source_country":"fr","sentiment":0.091},{"id":295049920,"title":"At the Races: Great egg-spectations","text":"Welcome to At the Races! Each week we bring you news and analysis from the CQ Roll Call campaign team. Know someone who’d like to get this newsletter? They can subscribe here.\n\nBy Niels Lesniewski, Mary Ellen McIntire and Daniela Altimari\n\nThe least expensive dozen eggs available for delivery from a Hannaford grocery store in Bangor, Maine, this morning cost $7.99.\n\n(We, of course, picked that grocery store at random and not because it’s located in a perennially competitive House district held by Democrat Jared Golden in a state with a battleground Senate race featuring Appropriations Chair Susan Collins in 2026.)\n\nAt least for the moment, the politics of eggs are real, and they seem emblematic of two broader trend stories in the political and policy space that we cover here at CQ Roll Call.\n\nOne is the Trump administration’s efforts, through the office known as the Department of Government Efficiency, to reduce the size of the federal workforce. The mass termination of probationary government employees, which appears to be a prelude to larger-scale federal worker layoffs, included Agriculture Department employees working to combat avian flu, as Iowa Public Radio reported. \n\nUSDA is among the departments and agencies that have needed to recall workers originally terminated as part of the DOGE efforts. On Wednesday, Agriculture Secretary Brooke Rollins announced a plan to spend $1 billion to address bird flu, as Olivia M. Bridges reported for Roll Call. The United States could also import more eggs in an effort to bring prices down, and as Rollins wrote in an opinion piece for The Wall Street Journal, more Americans could raise their own chickens.\n\nWhich brings us, of course, to the other part of the story: inflation. President Donald Trump ran and won on promises of bringing down costs, and his party’s midterm prospects may ultimately be tied pretty directly to the cost of living.\n\nThe latest Economist/YouGov numbers show only 19 percent of U.S. adults think the economy is “getting better.” Or, as our Editor-in-Chief Jason Dick writes this week, “No really; it’s still the economy, stupid.”\n\nStarting gate\n\nWhat’s old is new again: Democrats are criticizing the budget resolution adopted by House Republicans this week as an attack on Medicaid, reviving their 2018 focus on health care that helped them win the House as they look to another Trump midterm next year. \n\nDelBene’s deputies: Washington Rep. Suzan DelBene has announced the full roster of House Democrats who will support her efforts as DCCC chair for the 2026 cycle. They include four regional vice chairs: Reps. Lizzie Fletcher of Texas, Sara Jacobs of California, Rob Menendez of New Jersey and Mark Pocan of Wisconsin.\n\nDonalds for governor: Florida Rep. Byron Donalds has formally announced his candidacy for governor in what could be a contentious GOP primary against Florida first lady Casey DeSantis. Donalds already has Trump’s endorsement.\n\nRamaswamy for governor: Former Republican presidential candidate Vivek Ramaswamy made his bid for Ohio governor official this week. Hours after officially launching his campaign, the short-lived co-leader of Trump’s DOGE effort picked up the president’s endorsement.\n\nTown hall backlash: During last week’s House recess, some GOP members who have embraced Trump’s agenda faced anger from constituents at town hall meetings. Voters in blue districts also turned out, pressing Democrats to take an aggressive stance against the president and the sweeping cuts undertaken at his direction by DOGE. \n\n#MNSEN: Our colleague Olivia M. Bridges profiles Minnesota Rep. Angie Craig, who was elevated by her fellow Democrats to be ranking member on the House Agriculture Committee this year. Craig is also weighing a Senate bid to succeed retiring Democrat Tina Smith, telling Olivia that she’s having conversations with stakeholders back home but expects to take more time before making a final decision. If she does run, one candidate Craig won’t have to face for the Democratic nomination is Gov. Tim Walz, who passed on a Senate run this week as he weighs a third gubernatorial term.\n\nKnow your congressman: Alabama Democrat Shomari Figures talks to Roll Call’s Jackie Wang about his road to running for the House, which included staffing stints in all three branches of government. And Ohio Republican Michael Rulli spoke to Daniela about his eclectic path to politics.\n\nRidin’ with Biden: Roll Call’s final installment of our annual vote studies series looked at 2024 votes on legislation that former President Joe Biden took a position on. As Niels and Roll Call’s Ryan Kelly report, support for Biden’s priorities remained steady in his final year in office, with an uptick in Republican backing in both chambers. \n\nSnowbird district: With Donalds seeking the Florida governorship, speculation over who could succeed him in the 19th District is swirling around several former elected officials who have relocated to the Sunshine State. According to Florida Politics, potential GOP candidates include former North Carolina Rep. Madison Cawthorn, former New York Rep. Chris Collins and former Illinois state Sen. Jim Oberweis. \n\n#KYSEN: Republican Daniel Cameron, the former Kentucky attorney general who is running for Senate, criticized his former boss, retiring Sen. Mitch McConnell, for opposing some Trump nominees. \n\nNew York shuffle: New York Lt. Gov. Antonio Delgado said Monday he won’t run for reelection alongside Gov. Kathy Hochul next year. The former Democratic congressman said he’ll be exploring “all options” — and he filed a new campaign committee with the state elections board a day later, the (Albany) Times Union reported — suggesting he could challenge Hochul for the state’s top job. Meanwhile, Democratic Rep. Ritchie Torres, himself a potential gubernatorial candidate in New York, backed Andrew Cuomo for New York City mayor, although the former governor hasn’t officially entered the race. Rep. Hakeem Jeffries, the top House Democrat, said Cuomo would be “a candidate that a lot of people … would be very interested in checking out.”\n\nGuv watch: In Pennsylvania, state Sen. Doug Mastriano is weighing a rematch against the Democrat who trounced him in 2022, Gov. Josh Shapiro, The Philadelphia Inquirer reports. In New Mexico, former Las Cruces Mayor Ken Miyagishima has launched an exploratory campaign for governor, according to the Albuquerque Journal. Fellow Democrat and former Interior Secretary Deb Haaland is already running. And in Virginia, a pair of GOP hard-liners are looking to challenge Lt. Gov. Winsome Earle-Sears in the primary for the open governor’s race this year. Former Del. Dave LaRock has filed paperwork and is collecting signatures for a gubernatorial run, the Virginia Scope reports, while former state Sen. Amanda Chase, who has billed herself as “Trump in heels,” is also collecting signatures to earn a place on the ballot.\n\nBlue on blue: Massachusetts Rep. Stephen F. Lynch may face a primary challenger, Politico reports. Attorney Patrick Roath is seriously considering a run against the longtime Democrat, who received a cool reception at a rally in Boston last week, according to MassLive.\n\nMcCain, D-Ariz.? The Cook Political Report looks at potential Democratic candidates for House seats in Arizona this cycle. They include Jimmy McCain, whom some Democrats are trying to recruit to challenge GOP Rep. David Schweikert in the 1st District. McCain, the son of the late Republican Sen. John McCain, announced last year that he had registered as a Democrat and was backing Kamala Harris for president.\n\nParty chairs: Michigan Republicans picked state Sen. Jim Runestad as their new state party chair over Meshawn Maddock, who is a former party co-chair and close Trump ally, and Joseph Cella, a former Trump ambassador. Former state Sen. Curtis Hertel, who lost a competitive House race last year to Republican Tom Barrett, will chair the state Democratic Party. \n\nCharges dismissed: A New Jersey judge dropped racketeering charges against power broker George Norcross, a former Democratic National Committee member who is the brother of Democratic Rep. Donald Norcross.\n\nWhat we’re reading\n\nAll politics is local: The 51st ponders what might happen if Congress passes a bill proposed by two Republicans to eliminate D.C.’s home rule. Even though Trump has endorsed the idea, the measure faces long odds. \n\nA gap in Cumberland: The Boston Globe explores a political rift in Cumberland, Maine, which is at the center of a dispute between Trump and Gov. Janet Mills over transgender athletes. Meanwhile, the Democrat-controlled Maine House voted to censure Republican state Rep. Laurel Libby, who posted photos and identifying information about a transgender student-athlete days before Trump threatened to withhold federal funding from the state for not complying with his recent executive order.\n\nNo contest: The New York Times takes a look at the “death of competition” in U.S. elections. A third of House members ran unopposed in their primaries last year, while three-quarters of state legislative primaries were uncontested, the Times analysis found. \n\nCash is king: Trump may not be eligible for another White House run under the Constitution, but his campaign is still fundraising. National Journal looks at whether Trump may spread the wealth with other Republicans on the ballot in next year’s elections — something he hasn’t prioritized in past midterms. \n\nBehind the alliance: Axios provides a behind-the-scenes look at the relationship between Trump and Amazon founder and Washington Post owner Jeff Bezos. \n\nDonor disquiet: Democrats looking to rebuild their party after sweeping Republican wins last year are encountering frustrations from some donors, upset at how their money was spent in the last election, The Hill reports.\n\nThe count: 3\n\nThat’s how many of Trump’s nominees Mitch McConnell has voted against so far this year.\n\nWhile the president has often denigrated the Kentucky Republican and his time as Senate leader, McConnell had previously been steadfast in his support for Trump’s nominees.\n\nHis votes against Robert F. Kennedy Jr. for Health and Human Services secretary, Tulsi Gabbard for director of national intelligence and Pete Hegseth for Defense secretary were his first real votes against a Republican president’s picks in decades.\n\nOver the 12 years encompassing the presidency of George W. Bush and Trump’s first term, McConnell, who is retiring next year, voted against a presidential nominee just five times. One of those was a parliamentary move “reserving the right to reconsider,” often employed by Senate leaders when their majority loses a vote and they want the effective option of a do-over. \n\nThree others were votes he cast along with most of his Republican colleagues against nominees to fill spots reserved for Democrats. \n\nBefore this year, the only time in the past quarter-century that McConnell broke with a majority of Republicans to oppose the nominee of a GOP president was in 2001, when he voted against Bush’s renomination of Roger W. Ferguson Jr., a Clinton appointee, to the Federal Reserve. McConnell and fellow Kentucky Republican Jim Bunning were the only senators to oppose Ferguson’s confirmation vote, arguing that his views were too similar to then-Fed Chairman Alan Greenspan’s.\n\n— By Roll Call’s Ryan Kelly\n\nLawmakers will gather in the House chamber Tuesday night for Trump’s first address before a joint session of Congress in his second term. \n\nPhoto finish","summary":"Welcome to At the Races! Each week we bring you news and analysis from the CQ Roll Call campaign team. Know someone who’d like to get this newsletter? They&#160;can subscribe here. The least expensive dozen eggs available for delivery from a Hannaford grocery store in Bangor, Maine, this morning cost $7.99. (We, of course, picked [&#8230;]\n\n\nThe post At the Races: Great egg-spectations appeared first on Roll Call.","url":"https://rollcall.com/2025/02/27/at-the-races-eggs-elections-economy/","image":"https://rollcall.com/app/uploads/2024/12/AT-THE-RACES-LOGO-2024RCHP16x9.jpg","video":null,"publish_date":"2025-02-27 14:30:00","author":"Niels Lesniewski","authors":["Niels Lesniewski"],"language":"en","source_country":"US","sentiment":0.224},{"id":294948090,"title":"Kamala Voters Can’t Be Labeled ‘Conservatives’","text":"When Democrats switch parties and become Republicans or vote for Republicans, no one expects the liberal media to keep describing them with words like “liberal” or “Democrat.” But somehow, after former conservatives and ex-Republicans campaigned for staunchly leftist Kamala Harris for president, journalists just keep calling them “conservatives.”\n\nBill Barrow of the allegedly “fact-based” Associated Press wrote an article headlined “Conservatives who still oppose Trump gather at ‘Principles First Summit’ in search of a path forward.” Barrow’s first sentence read: “Conservatives from across the country filled a ballroom a few blocks from the White House and lamented that the United States is abandoning the ideals that forged a great nation.”\n\nThen the AP scribe turned to ex-Republican Heath Mayo, “the Yale-educated attorney who founded Principles First five years ago for self-identified politically homeless conservatives.” The “PBS News Hour” website published this repetitive falsehood, and its progressive partners at PolitiFact won’t object to it.\n\nObviously, you can be a principled conservative, be critical of President Donald Trump, and refuse to vote for him. But it’s much more common among the elites to hate Trump so much that you have to back anyone who could stop him. Then you can be seen all over liberal TV bashing Trump as a menace to society.\n\nNaturally, Mayo and many of his fellow “Principles First” people campaigned for Harris last year. The ad for their “summit” was stuffed with ex-conservatives starring on cable news: MSNBC host Michael Steele, MSNBC regulars Charlie Sykes and George Conway, CNN analyst Adam Kinzinger, and pollster Sarah Longwell, among others. Longwell sat on stage with Harris and Liz Cheney at campaign events last fall.\n\nYou can’t be “conservative” and support the woman who would make abortion as available as possible and push “gender-affirming care” for children. You can’t be “conservative” and back the team who made a disastrous withdrawal from Afghanistan and whose weakness led to wars in Ukraine and Israel.\n\nBut for Democrat journalists, it’s just too delicious to be truthful. CNN and MSNBC and PBS and NPR can’t get enough of “Republicans” who back Democrats. They line up with Mayo as he tweeted last year, “If Dick Cheney is voting for Kamala Harris, it’s safe to say this election is not any kind of referendum on conservatism.”\n\nA year ago, National Public Radio “Morning Edition” host Michel Martin supportively interviewed Mayo about his conference and cued him up to trash the Conservative Political Action Conference. He claimed it has “evolved into this sort of corrupt and crazy circus that was much more focused, I think, on the personalities that were on the stage and the crazy and crazier things that they would say, as opposed to the ideas and the principles that really should define who we are as conservatives.”\n\nWho “we” are? Are “we” suggesting voting for Democrats in 2024 aligned with conservative ideas and principles?\n\nSo Martin asked last year who he was endorsing for president. Mayo said, “Trump represents an existential threat not just to the Republican Party, but to the constitutional principles that shape our country. So I personally would be voting for [Joe] Biden.”\n\nMartin concluded the interview: “That is Heath Mayo. He is president and founder of Principles First. That’s the conservative group hosting an alternative to the CPAC conference.”\n\nThese journalists aren’t just pretending that Real Republicans oppose Trump. They’re hinting that they want Real Republicans who surrender to everything Democrats want to do and create a “uni-party” government and a “uni-party” media elite. These journalists would claim that this suffocating consensus would be the flowering of “democracy.”\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"When Democrats switch parties and become Republicans or vote for Republicans, no one expects the liberal media to keep describing them with words like &#8220;liberal&#8221;... Read More\n\n\nThe post Kamala Voters Can&#8217;t Be Labeled &#8216;Conservatives&#8217; appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/27/kamala-voters-cant-be-labeled-conservatives/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/GettyImages-2182334563.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-02-27 14:00:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"us","sentiment":0.306},{"id":294962408,"title":"CNN presenter accused of hypocrisy over book on Biden’s health","text":"CNN anchor Jake Tapper is facing a backlash on social media for co-authoring a soon-to-be-released book alleging the cognitive decline of former US President Joe Biden was covered up despite having previously dismissed similar claims. The book’s publisher, Penguin Press, issued a press release announcing the project on Wednesday.\n\nSet to be released on May 20, ‘Original Sin’ is co-authored by Tapper and Axios correspondent Alex Thompson. The book examines Biden’s decision to seek re-election, describing it as his “original sin” that led to a campaign of “gaslighting and denial,” ultimately resulting in current President Donald Trump’s election victory. The authors claim to provide an inside look into private discussions revealing the extent of Biden’s decline and efforts to conceal it. \n\nAfter the book’s announcement, critics blasted Tapper for hypocrisy, noting that he previously defended Biden against claims of cognitive decline. \n\nIn 2020, during an interview with Donald Trump’s daughter-in-law, Lara Trump, Tapper cut her off after she suggested Biden was in “cognitive decline,” stating, “I think you have absolutely no standing to diagnose somebody’s cognitive decline.” \n\nSome accused CNN of being “complicit in the fraud,” while others singled out Tapper calling his book a blatant attempt at deflection.\n\n“It’s a book written by Jake about how Jake covered up Biden’s decline so Jake could write a book. Tell me – if Biden had won would this book still be published?” one user wrote on X. \n\nAlthough Tapper previously defended Biden, he became one of the most vocal critics of the president’s decision to seek reelection following the debate between Biden and Trump in June 2024, which he co-moderated. \n\nQuestions about Biden’s physical and mental fortitude plagued his campaign throughout and Republicans often claimed that the 81-year-old lacked the acuity to serve another term in office. However, it was Biden’s poor performance at a CNN-hosted debate with Trump in June that put a spotlight on the president’s diminished prowess. During the debate, Biden repeatedly lost his train of thought, mixed up words and numbers, and struggled to finish sentences. \n\nBiden’s performance was widely criticized, including by Tapper himself. The former president ultimately dropped out of the race in July, about a hundred days before the election, and endorsed Vice-President Kamala Harris to run in his place.","summary":"In his new book Jake Tapper has alleged Joe Biden’s cognitive decline was disguised, despite previously dismissing such claims\n\n  \nRead Full Article at RT.com","url":"https://www.rt.com/news/613384-cnn-presenter-biden-health-hypocrisy/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67c066172030270eba283cc4.jpg","video":null,"publish_date":"2025-02-27 13:58:08","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.157},{"id":294962112,"title":"Hunter Biden, Covid, and censorship? Fired reporter Catherine Herridge’s explosive CBS revelations: ‘Attack on investigative journalism’","text":"Fired CBS News reporter Catherine Herridge reveals photos of files on Hunter Biden, Covid origins seized by network: ‘Attack on investigative journalism’It’s been a year since CBS News returned Catherine Herridge’s investigative files, and the veteran journalist is making sure everyone knows exactly what was taken.Herridge, the award-winning investigative reporter who was unceremoniously let go last February in CBS’s cost-cutting purge, posted photos of the confidential documents the network seized—revealing that they contained sensitive reporting on Covid-19’s origins and Hunter Biden.Taking to X (formerly Twitter) on Wednesday, Herridge wrote, “Today, I am releasing photos of the records for the first time so you can see the sheer volume involved.”— C__Herridge (@C__Herridge) The pictures showed an avalanche of paperwork, including stacks of folders next to a Home Depot-branded moving box. According to Herridge, CBS had seized four massive boxes weighing over 100 pounds in total. She minced no words, calling the act a “journalistic rape” and “an attack on investigative journalism.”“I hope no investigative reporter has to suffer a similar injustice in the future,” she added.CBS News, for its part, declined to comment—perhaps hoping this firestorm would burn out on its own. But it hasn’t.A high-stakes showdownThe saga ignited a political and media firestorm, leading to a House Judiciary subcommittee hearing titled “Fighting for a Free Press: Protecting Journalists and Their Sources.” Herridge testified, shedding light on her legal battles—including being held in contempt of court for refusing to disclose sources related to a national security story.Eventually, under mounting pressure from SAG-AFTRA, the union representing media professionals, CBS gave in and returned her files. Herridge thanked the union for backing her up when CBS wouldn’t, writing, “SAG-AFTRA stood up for journalism when CBS News executives seized my reporting files.”— C__Herridge (@C__Herridge) The Hunter Biden blackoutHerridge’s tenure at CBS was far from smooth sailing. A former Fox News staple, she joined CBS in 2019 and quickly ran into roadblocks when trying to report on Hunter Biden’s infamous laptop.Back in October 2020, Herridge unearthed evidence showing Hunter Biden’s million-dollar retainer from a Chinese energy firm, among other business dealings. But when she brought her findings to CBS executives—including then-SVP Ingrid Ciprian-Matthews and anchor Norah O’Donnell—her reporting was buried.As she watched “60 Minutes” correspondent Lesley Stahl dismiss the laptop’s contents as unverified during an interview with then-President Donald Trump, Herridge recalled feeling “sick.” It wasn’t until two years later—after the 2022 midterms—that CBS finally acknowledged the laptop was legitimate.CBS under fireCBS News has faced increasing scrutiny over allegations of bias. Last October, the network aired a “60 Minutes” interview with Kamala Harris, during which her answers on Israel policy were mysteriously edited—leading to a lawsuit from Donald Trump. He alleges that CBS deceptively cut the footage to make Harris appear more articulate. The lawsuit seeks a jaw-dropping $20 billion in damages.This week, reports surfaced that Trump and CBS’s parent company, Paramount, have agreed to bring in a third-party mediator in an attempt to settle the case out of court.As for Herridge, she’s far from done. Now running her own Substack, she remains a thorn in the side of legacy media, proving that investigative journalism isn’t dead—it just needs a new home.","summary":"","url":"https://timesofindia.indiatimes.com/world/us/hunter-biden-covid-and-censorship-fired-reporter-catherine-herridges-explosive-cbs-revelations-attack-on-investigative-journalism/articleshow/118606089.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-118606804/118606804.jpg","video":null,"publish_date":"2025-02-27 13:53:58","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.172},{"id":294930050,"title":"Barack and Michelle Obama Meeting SECRETLY to Avoid Nasty Public Split—Shocking Announcement Might be Coming Soon!","text":"Barack Obama and Michelle are now secretly dividing up their growing $70 million fortune so they could have an “amicable” split. RadarOnline.com revealed that as the political duo lay the groundwork for their upcoming shocking public announcement. Their separation would be the first White House marital split by a former president in the history of America.\n\nAs per sources advisers and lawyers for Barack, 63 and Michelle, 61, are meeting secretly to hammer out the nasty details of their upcoming split. This is an effort to reach an agreement on all grounds before the shocking public announcement is made later this year.\n\nAn insider close to the Democratic Party with knowledge of the deliberations claimed, “They want to have everything ironed out in advance. The last thing they want is an ugly fight with lots of nasty legal filings.”\n\n🇺🇸2/5 Latest news on Barack Obama, leader of the Democratic Party Inc.: DIVORCE\n21 Feb 2024: “They’d already been living separate lives for some time…after Michelle refused to run and Barack was forced to back Kamala. Total humiliation for him – especially since she lost.” pic.twitter.com/UjJm6XfKxI\n— Karen ⚾️ 🇺🇸 Multipolar World Order! (@KarenWontComply) February 26, 2025\n\nThe separation of News America’s 44th president and his glamorous and outspoken wife of 32 years is heading towards a split that comes across as no surprise. After Donald Trump’s victory in the election of 2024, the Obama marriage has turned “venomous” as per reports.\n\nSources said that Barack Obama had demanded Michelle to take up the Democratic Party’s standard after Joe Biden’s exit from the race in July. However, the Havard-trained lawyer and the former administrator baulked at Barack’s ultimatum. Instead, she chose to continue her conquest of Hollywood, by making deals through their film company Higher Ground Productions.\n\nIt seems like both Barack and Michelle’s choices go in different directions. While Barack’s still in politics, Michelle seems to be inclined towards showbiz. Sources say their decisions pushed their marriage to the brink of breaking point.\n\nAn insider added, “They’d already been living separate lives on opposite coasts for some time, but that was no longer an option after Michelle refused to run and Barack was forced to back Kamala Harris.” “That was a total humiliation for him, especially since she lost.”\n\nRumors Swirl Obamas Headed For Divorce As Michelle Obama Vanishes from Public\nREAD: https://t.co/NPnAPW9gDB pic.twitter.com/7YJZA7UERH\n— The Gateway Pundit (@gatewaypundit) January 16, 2025\n\nSources are now saying that a public revelation of Barack and Michelle’s marriage might end after the summer. This is because it will take some time for them to agree on their considerable assets.\n\nAn insider even said, “They have homes in D.C., Martha’s Vineyard and Chicago, plus a stock portfolio of over $25million. “There are also substantial revenue streams from their various media projects to divide and manage going forward.\n\n“It’s far from easy to untangle a life of three decades with someone, but maintaining the illusion of a happy and stable marriage is no longer a solution. “They both are of the mind that they will be better off on their own.”","summary":"Barack and Michelle Obama are reportedly preparing for an amicable $70 million divorce, secretly dividing assets before a public announcement later this year","url":"https://www.inquisitr.com/barack-and-michelle-obama-meeting-secretly-to-avoid-nasty-public-split-shocking-announcement-might-be-coming-soon","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/Barack-Obama-and-Michelle-secretly-heading-for-divorce.jpg","video":null,"publish_date":"2025-02-27 13:09:47","author":"Shrobana Rakshit","authors":["Shrobana Rakshit"],"language":"en","source_country":"US","sentiment":-0.219},{"id":294954940,"title":"It’s Weird That Eggs Were Ever Cheap","text":"Imagine telling someone five years ago that a carton of eggs would cost more than a pound of salmon fillet or a whole rotisserie chicken. Somehow, today, it does. Prices have doubled in the past year, with a dozen eggs going for as much as $15 in certain urban markets. Restaurants and bodegas are tacking surcharges onto breakfast dishes. Cold cases in big-box stores are empty; grocers are limiting customers to a dozen or two a visit to make stocks last. Google searches for the phrase backyard chickens have tripled in the past two months.\n\nConsumers are furious. Eggs are the second-most commonly consumed grocery item, beating out milk and cereal. The average American eats an egg every 1.3 days, or 277 a year. Eggs provide 4 percent of protein consumed in the country and are one of the least-expensive high-quality sources of the muscle-building macronutrient.\n\nOr at least they were, until a highly pathogenic form of bird flu spread to American flocks in 2022. Today, the Department of Agriculture is tracking 36 separate outbreaks across nine states. The disease has led to the death or culling of 27 million laying hens—nearly 10 percent of the nation’s commercial flock—in the past eight weeks alone.\n\nAs a result, the egg supply is severely constrained. Businesses are struggling. President Donald Trump campaigned on a promise to bring down the cost of consumer goods “starting on day one,” while standing in front of a display of Cheerios, bacon, flour, and, yes, eggs. But the U.S. Department of Agriculture forecasts “little chance” for improved supplies “in the near term.” Americans paying more for their omelets and bacon-egg-and-cheeses are incensed.\n\nIt might not make cash-strapped consumers feel any better, but the fact that eggs were ever ubiquitous and cheap is remarkable. Americans’ egg addiction has been made possible only through billions of dollars of technological and infrastructural investment, as well as the immiseration of billions of animals. The industrial advances that made eggs cheap in the 20th century are, in part, responsible for their excruciating cost today.\n\nContemporary laying hens are likely descended from dinosaurs. (When you eat a dino-shaped chicken nugget, you eat the present injection-molded into the shape of the past, the child in the shape of the grandparent.) Humans began domesticating the birds thousands of years ago, and Christopher Columbus brought them to this continent in 1493.\n\nThe 90 billion eggs that American laying hens now produce each year are a wonder. They are nutritional powerhouses: a complete protein, with all nine essential amino acids, abounding in vitamins B2, B12, A, D, E, and K; choline; selenium; phosphorus; and zinc. They are tasty; saturated-fat and cholesterol give them a tender and unctuous mouthfeel. Plus, they are a handy ingredient, binding compounds together and providing structure and moisture to baked goods.\n\nContrary to their reputation, eggs are strong too. Their shells are composed of calcium carbonate, known as “nature’s ceramic,” their pointed ovoid shape stellar at dispersing force; in architectural terms, they are palm-size marble cathedrals. In one demonstration at Harvard, a carefully cushioned single egg resisted the weight of 10 lead bricks, or 250 pounds. Try crushing a raw egg by wrapping your hand around it and squeezing: It’s tough if the egg is horizontal to your fingers, and impossible if it is vertical.\n\nAlthough the egg is resistant to slow, evenly distributed pressure, it is vulnerable to sharp, concussive pressure. It has to be. Neonatal chicks weighing a tenth of a pound peck their way out. Just 5.5 pounds of force will crack an eggshell. A polite handshake applies more pressure, a bite on a bacon-egg-and-cheese perhaps 20 times as much.\n\nThis quality makes eggs difficult to transport from farm to market, more like grapes than like milk or rice. Perishability poses another challenge. At room temperature, farm-fresh eggs are safe to eat for weeks. But the government requires eggs to be washed; once washed, they begin to develop dangerous concentrations of bacteria in a few hours. Whole eggs cannot be frozen; the water content in the egg expands, cracking open the shell. Separated whites freeze and dethaw fine, but separated yolks do not. Ice crystallization changes their lipid and protein structure, transforming their mucosal texture into something akin to nut butter or chewed gum. Gelatinization makes it impossible to beat the yolks into dough or whisk them into dressing, unless the frozen egg yolks are preprocessed.\n\nFor centuries, none of this was a problem, because nobody was trying to transport these fragile, messy, spoilable ovals long distances. Many American families never bought eggs. Chickens were ubiquitous on farms and homesteads—easy to raise, quick to reproduce, and free to fatten, given that the omnivorous birds are adept foragers and happy consumers of table scraps. Ranchers and growers would sell their “farmwives’ surplus” from April to July, when laying peaked.\n\nAround the turn of the 20th century, as the supply chain started to transform, so did the chicken and the egg. Selective breeding cleaved the broiler bird from the laying hen, the former specialized to grow fat thighs and breasts, the latter specialized to pump out eggs. Chicken farming became an industry of its own, and egg farming another.\n\nSpecialized farmers moved their flocks indoors, reducing mortality rates. They figured out that lighting their barns spurred the birds into laying more eggs, and into laying them year-round. One farmer who rigged up a 50-watt bulb noted that his hens were “cackling and behaving in liveliest fashion,” laying eggs at all hours, as recounted in Susanne Freidberg’s Fresh: A Perishable History. Farmers started to lift hens off the floor on wire-mesh systems, making barns easier to muck out and tamping down infection.\n\nA spate of agricultural innovations helped move the newfound bounty to market. Multiple inventors came up with the egg carton early in the 20th century, meaning farmers no longer had to use baskets and crates. Conveyor belts, incubators, sandblasters for cleaning, and egg-grading machines for measuring helped commoditize the product. The nascent industry piggybacked on innovations in the meatpacking industry. Companies transporting sides of beef in refrigerated trucks and warehouses began accepting eggs too.\n\nEven so, customers preferred fresh, local eggs to faraway, cold-stored ones well into the 20th century. Eggs were not routinely “candled” to check for spoilage, meaning a home cook never knew what cracking one open would bring, Freidberg writes. For a while, dehydrated powdered eggs became popular. The American military bought millions of pounds to feed soldiers during World War II. Bakeries started using frozen whites and processed frozen yolks. Analysts figured that consumers would opt for these stable products too. “The shell egg is fading in importance,” a member of the American Warehousemen’s Association concluded in 1941. It did not fade in importance. Advances in chicken-rearing, sanitation, shipping, and packaging, as well as advertising, brought consumers around. By the 1960s, many Americans were eating commodity eggs, rather than ones produced by local farmers or hens in backyard hutches.\n\nIndustrialization made eggs cheap. But it came with a cost, particularly for the animals that produced them.\n\nMale chicks have no role in egg production, so they are gassed, threshed, or crushed after hatching. Female chicks have their beaks trimmed without anesthetic. Once grown, most are placed in battery cages, each bird allotted 67 to 86 square inches of space, smaller than a piece of printer paper. In these crowded conditions, laying hens cannot preen, move around, or spread their wings. The wire in the cages is slanted to let the eggs roll out, making it hard for the chickens to settle. Although 11 states have banned battery cages, three in five American commercial hens continue to reside in them.\n\nMany birds on industrial farms show obvious signs of distress, afflicted by injury, osteoporosis, liver disease, and prolapse, as well as depression and social derangement. When their egg production drops, generally when the birds are a year or two old, they are gassed and turned into poultry meal, a main component of dog food.\n\nThe egg-production system imposes its own costs on consumers. In the 1970s, the country had thousands of small-scale egg farms, vying to win over customers with competitive prices and fresh quality. Today, 150 firms produce 95 percent of the country’s eggs, and a single one, Cal-Maine Foods, accounts for 20 percent of the market. The industry has consolidated vertically as well as horizontally. Two companies supply 90 percent of chicks. A single firm sets benchmark egg prices, hampering price discovery in the market. Consumer advocates and the courts have found evidence of price-fixing, price gouging, and “antitrust conspiracy”—made invisible on grocery-store shelves thanks to creative packaging and brand differentiation.\n\nOf late, the centralization and industrialization of the industry have intensified the bird-flu crisis. The largest commercial egg producers own millions of birds. A single laying house holds as many as 350,000, serried into wire crates and stacked on top of one another. The virus spreads rapidly in such environments. USDA rules obligate farms to cull an entire flock if a single bird is infected; the government then compensates the farm for its losses. The culling policy helps stop the spread of the lethal virus, but the compensation policy reduces farms’ incentive to invest in smaller-scale, more humane, and safer animal-rearing practices that would limit the need for workers to kill so many birds in the first place.\n\nSome egg producers have managed to eke out higher earnings despite the spread of bird flu, perhaps thanks to cartelization. From 2022 to 2023, retail egg prices tripled, noted Angela Huffman of Farm Action, a nonprofit advocating for small farms. She pointed to data indicating that prices would have gone up only 12 to 24 percent in a competitive market.\n\nThe price of a dozen eggs has been a potent political issue for the past half century or so. John F. Kennedy and Richard Nixon tussled over eggs in the 1960 presidential contest; a decade later, Nixon took up the issue again as inflation spiked. “Eggs have to be transported, processed, cooked, and served, but 30 cents a dozen to the farmer and $30 a dozen to whoever buys those eggs in a restaurant, that is just too much,” he told reporters in 1972, stressing that he would tackle the middleman for the common man.\n\nDuring his 1996 campaign for the Republican nomination, a reporter asked Lamar Alexander how much a dozen eggs cost. He did not respond, and was later caught asking an aide to get him the number: “I need to know right now.” The Bob Dole campaign was thrilled. “Lamar may be an outsider when it comes to grocery stores, but he’s an insider when it comes to politics,” it crowed in a press release. “Next time he’s walking across New Hampshire, he might want to stop at a supermarket.”\n\nOn the trail last year, Trump lambasted Joe Biden and Kamala Harris for failing to bring food prices down. In office, his administration has blamed egg prices directly on their policies. Biden “directed the mass killing of more than 100 million chickens, which has led to a lack of chicken supply in this country, therefore lack of egg supply,” Trump’s press secretary told reporters last month.\n\nThis week, the Trump administration laid out a five-point plan to get egg prices down: financing on-farm biosecurity upgrades, providing additional funds to farmers who have to cull their flocks, investing in bird-flu vaccines and therapeutics, eliminating regulations, and increasing foreign imports. Administration officials have critiqued the USDA culling policy, suggesting that vaccination and biosecurity measures should render it unnecessary. “Why does it make any sense to have a big perimeter of dead chickens, when it’s the ducks and the geese that are spreading it?” Kevin Hassett, the director of the National Economic Council, said on Face the Nation earlier this month.\n\nBut pharmaceutical firms have not invested much in bird-flu vaccines. There are no USDA-approved options, and there is no farm-by-farm vaccine infrastructure. “As ugly as it is, just like with the wildfires in California, sometimes you have to cut all the trees down and dig a fire line,” explained Matt Koci of North Carolina State University. “We can’t do anything to save that poultry house, but maybe we can dig enough of a line around it to save neighboring farms.”\n\nOf the proposed policy measures, increasing imports would likely be the most effective. But Trump is waging a global trade war at the moment, and as the coronavirus pandemic demonstrated, companies need time and money to adjust their supply chains. “The system for egg production is both complex and time sensitive,” Emily Metz, the president of the American Egg Board, wrote in a statement. “It’s going to take a sustained period” for supply to catch up with demand.\n\nConsumers aren’t happy, but the chickens are the ones really suffering. At least for protein-loving breakfast eaters, there are always beans.","summary":"What were we thinking, buying so many of these fragile, messy, remarkable ovals?","url":"https://www.theatlantic.com/ideas/archive/2025/02/egg-prices-rising/681844/","image":"https://cdn.theatlantic.com/thumbor/69vwThueBtNzeaxziySKchVdv-A=/0x43:2000x1085/1200x625/media/img/mt/2025/02/2025_2_26_Weird_Eggs_Updated_vJA/original.jpg","video":null,"publish_date":"2025-02-27 13:00:00","author":"Annie Lowrey","authors":["Annie Lowrey"],"language":"en","source_country":"US","sentiment":-0.104},{"id":294954950,"title":"The Democrats’ Working-Class Problem Gets Its Close-Up","text":"The distant past and potential future of the Democratic Party gathered around white plastic folding tables in a drab New Jersey conference room last week. There were nine white men, three in hoodies, two in ball caps, all of them working-class Donald Trump voters who once identified with Democrats and confessed to spending much of their time worried about making enough money to get by.\n\nAsked by the focus-group moderator if they saw themselves as middle class, one of them joked, “Is there such a thing as a middle class anymore? What is that?” They spoke about the difficulty of buying a house, the burden of having kids with student loans, and the ways in which the “phony” and “corrupt” Democratic Party had embraced far-left social crusades while overseeing a jump in inflation.\n\n“It was for the people and everything, and now it is just lies,” one man said when asked how the Democratic Party has changed.\n\nTrump, another man said, was the only one inhabiting the political center these days. But some expressed concern about how much they were benefiting from the early days of Trump’s second administration, about the potential cost of new tariffs, and about the president’s embrace of “distracting” issues such as renaming the Gulf of Mexico and planning to redevelop Gaza.\n\n“I feel like the administration is going for things that grab headlines, like trans rights, wars, things that people pay attention to, rather than actual inflation and pricing,” one of the men told the group. “So that is part of the negativity of politics that I don’t really enjoy.”\n\nThe February 18 focus group, in a state that saw deep Democratic erosion last year and will elect a new governor this fall, was the first stop of a new $4.5 million research project centered on working-class voters in 20 states that could hold the key to Democratic revival. American Bridge 21st Century, an independent group that spent about $100 million in 2024 trying to defeat Trump, has decided to invest now in figuring out what went wrong, how Trump’s second term is being received, and how to win back voters who used to be Democratic mainstays but now find themselves in the Republican column.\n\n“We want to understand what are the very specific barriers for these working-class voters when it comes to supporting Democrats,” Molly Murphy, one of the pollsters on the project, told me. “I think we want to have a better answer on: Do we have a message problem? Do we have a messenger problem? Or do we have a reach problem?”\n\nMitch Landrieu, a former New Orleans mayor and senior adviser to the Joe Biden White House, said the Democratic Party needs to think beyond the swing voters that were the subject of billions in spending last year and give attention to the people of all races and ethnicities who have firmly shifted away from Democrats to embrace the politics of Trump.\n\n“The first thing you got to do is learn what you can learn, ask what you can ask, and know what you can know,” Landrieu told me last week, before the New Jersey focus group. “When you see it through a number of different lenses, it should help you figure out how you got it wrong.”\n\nSince losing last fall, Democrats have railed against the price of eggs, denounced “President Elon Musk,” and promised to defend the “rule of law.” Senate Minority Leader Chuck Schumer even led a chant of “We will win” outside the U.S. Treasury building. But there is still little Democratic agreement about the reasons for Trump’s victory or how Democrats can make their way back to power.\n\nThe Bridge plan is to launch a series of interviews with party leaders, tracking polls and meetings with voters around the country to try to figure out how best to fix the party after an election that saw Democrats lose the popular vote for the first time since 2004. Former Democratic National Committee Chair Tom Perez and former Representative Colin Allred of Texas, who lost a bid for Senate last year, have signed up to work with Landrieu on the project.\n\nSeveral other parts of the Democratic power structure are searching for answers as well. The new chair of the Democratic National Committee, Ken Martin, has promised his own “postelection review” by the party. “Not an autopsy, because we’re not dead as a party,” he said late last year. The details have not yet been announced.\n\nThird Way, a moderate Democratic group, ran a recent Democratic strategist retreat outside Washington to begin the conversation about how to create a new economic agenda and how to extricate the party from unpopular positions on issues such as transgender athletes and immigration enforcement. Future Forward, the largest Democratic independent spender in the 2024 campaign, has continued to circulate “Doppler memos” to Democratic decision makers, offering them real-time updates about how Americans are digesting Trump’s actions and the most promising avenues for pushing back.\n\nThe Bridge effort emerged from a four-day Palm Beach donor retreat this month, just down the road from Mar-a-Lago. Top Democratic donors gathered for days of closed-door panels with titles such as “What Went Wrong?,” “What’s Going on With Men?,” “How to Stop Losing the Culture Wars,” and “Sending the Right Message: Reviving the Democratic Brand.” A Saturday-night panel at the conference with Landrieu, Allred, and others laid out how much was still unknown. The title: “It’s All About Listening: How Can We Reconnect With the Voters We Have Lost?”\n\n“I just really believe you have to start from scratch. You have to throw out all of your assumptions,” Landrieu told me. “Whatever happened in the past is the past, and that is the last campaign. Joe Biden isn’t president anymore, and they don’t have Joe Biden as a foil.”\n\nEven though the answers remain unclear, donors came away from the retreat saying they were eager to keep spending. Bridge has planned another donor conference in San Francisco for early next month. “At a time when some Democrats are in retreat, I saw a large group of donors at Democracy Matters in Palm Beach spoiling to re-engage in the fight,” John Driscoll, a health-care executive and an American Bridge donor, said in a statement.\n\nThe early after-action autopsy of Bridge’s own spending in Wisconsin, Michigan, and Pennsylvania last year echoed the early findings of other groups: Advertising for Kamala Harris and against Trump had a clear marginal impact where it was targeted, but it was unable to hold back the much greater Trump gains, including significant erosion among longtime Democratic voting blocs. A Bridge analysis conducted by the Democratic data firm BlueLabs of voters in the three states found that Democratic support overall dropped 3.9 percentage points in urban counties, 2.5 points in Hispanic-dominant counties, and 2.1 in Black-dominant counties. At the same time, counties where Trump received 60 percent or more of the vote saw their vote totals rise by about 5 percent.\n\nLandrieu hopes to share early results before this year’s fall elections so that new tactics and messages get a test run before next year’s midterm elections.\n\nAfter the focus group of white men, Bridge gathered a similar group of eight New Jersey Latino men—Trump-supporting members of the working class who had previously voted for Democrats. One voter said that the Democratic Party has walked away from representing the working class, given rising costs. Another expressed concern about the “woke” rules of Democratic governance. “People were getting hurt for any little comment, so you had to be politically correct for everything,” he said.\n\nDemocrats have spent years trying to convince nonwhite voters that Trump’s racial insensitivity should be a redline. These voters did not try to defend Trump’s racial views or argue that he is not racist. But even in that was a warning for the next iteration of the Democratic Party.\n\n“Whether he is or not, I don’t care,” one voter said. “I vote with my pocket.”","summary":"A group that spent heavily to defeat Trump is now devoting millions to study voters who were once aligned with the Democratic Party but have since strayed.","url":"https://www.theatlantic.com/politics/archive/2025/02/democrats-working-class-voters-trump/681849/","image":"https://cdn.theatlantic.com/thumbor/19FTU9qhDnjbpmcJh_xnH6WaSlE=/0x5:2000x1047/1200x625/media/img/mt/2025/02/Dems_workers_/original.jpg","video":null,"publish_date":"2025-02-27 12:30:00","author":"Michael Scherer","authors":["Michael Scherer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.227},{"id":294942022,"title":"What happened to the Gays for Trump?","text":"Voters in Germany maintained a few global trends this past weekend: They kicked out incumbents, their youth moved to the right, and they delivered another surprise. Their radical, anti-immigrant party (Alternative für Deutschland, or AfD) finished second, and was likely boosted by some LGBTQ voters.\nThe rightward shift of gay, lesbian, and bisexual voters is a dynamic playing out across western Europe. In the UK, France, and now Germany, gay voters or their allies are backing far-right or nativist political parties at growing rates. That queer shift to the right doesn’t seem to be materializing in the United States, however. During the 2024 election, LGBTQ voters actually got more Democratic than in 2020.\nWhat explains this gulf, especially as so many other global political trends replicate themselves in the US? \nAfter reviewing the trends and historical context, I offer two theories: that Europeans have had vastly different experiences with international migration than those in the US; and that the American LGBTQ community has historical reasons to distrust a radicalized Republican Party in a two-party system. \nThe “homonativist” shift of European gays and their allies\nIt was once thought that the growing public acceptance of queerness and homosexuality would reinforce — or at least coincide — with generally more progressive views on political issues, both in and outside the United States. But that doesn’t appear to be the case.\nIn Germany, those trends can be traced back to before the pandemic: Multiple analyses of LGBTQ voters found small, but sustained support from gay voters for AfD and center-right parties in 2021’s elections when compared to the 2017 federal elections there. One study even found that the probability of voting for the AfD increased in 2021 if you were LGBTQ. This year, one pre-election survey suggested AfD would receive the highest share of LGBTQ voters’ support among the major parties. (The AfD having a charismatic gay leader this year likely didn’t hurt either.)\nAs the researcher and political analyst François Valentin writes, this dynamic has been true in France and the United Kingdom going back to as early as 2015. One analysis of vote choice in 2015 found that it was married gay men who were most likely to support the anti-immigrant National Front (FN), the French far-right party, in that year’s regional elections (and more likely than married straight men), while married gay women supported the FN at about the same level as straight women. It was during that time that the FN went through a refresh, becoming less antagonistic to LGBTQ people and courting them.\nIn the United Kingdom, the center-left Labour Party has generally held strong support from lesbian, gay, and bisexual voters, while far-right parties have struggled to gain a substantial share of these voters in recent years. But across Europe, there has emerged a different kind of electorate: one with progressive views on homosexuality, but conservative or reactionary views on immigration. \nNearly a third of the British electorate could fall under this “homonativist” classification, according to one analysis prepared for the London School of Economics. \nFar-right parties in France and Germany have been nearly single-mindedly focused on tougher policies toward migrants and refugees, suspicion of Islam in particular, opposition to European Union integration, and a reclamation of native or national identity. The UK’s Conservative party has embraced many of these nativist ideals as well.\nBritish researcher Jesse Grainger, of King’s College London, suggests this focus on immigration and nativism may be key to understanding LGBTQ voters’ growing support for the far-right. \n“Cultural studies have also theorised that pro-LGBT attitudes may be increasing because of immigration,” he writes, “as progressive LGBT+ values can be weaponised as a means of differentiating the native liberal population from the backward immigrant population — constructing a tolerant vs intolerant binary.”\nIn other words, European far-right political parties have created various binaries around identity, security and public safety that place migrants and queer people at odds. And queer voters frustrated with the status quo have a welcome home in newer or rehabilitated far-right parties, particularly in France and Germany. \nWhy “homonativists” still haven’t gotten their footing in the US\nNot only have LGBTQ voters not seen the same rightward drift as their European counterparts, but they’ve actually seen the opposite: From 1992 to 2016, exit polls have shown this bloc of voters have been steadily getting more liberal. (Exit polls can be noisy and unreliable, and usually corrected months after elections, but are still the best tool we have for measuring trends for groups like LGBTQ voters.)\nIn 2020, polling did suggest a rightward turn for queer voters: Trump cut into the Democratic margin of victory with the demographic compared to 2016 by nearly 20 points. In 2024, signs were pointing toward another year of Republican improvement with these voters. \nBut the final result was another twist: Kamala Harris won the highest level of support from LGBTQ voters in modern history — 86 percent. In fact, LGBTQ voters were one of the only demographics that shifted left last year. And their ideologies have remained consistently liberal — 47 percent of LGBTQ men and 63 percent of LGBTQ women identify as liberal.\nThe explanations here are various — starting with the unique American political experience of the gay rights movement. But one key thing to understand is that while most European nations have multiparty systems that can give voters a sense that the most extreme positions of any given party will be checked by a team of rivals, the US really only has two parties.\nAnd while both started off as hostile to gay rights, the Democratic Party has been quicker to tolerate, accept, and champion LGBTQ people.\nThe Republican Party has been much more hostile. That’s been particularly true during the last five years, which have featured GOP fearmongering around trans athletes and bathrooms, “grooming,” and “Don’t Say Gay” legislation. In this way, the Republican Party went in the opposite direction of many European far-right or right-wing parties’ toning down of homophobic or bigoted speech and positions.\nYoung queer people may be turned off from any kind of ideological or policy pitch from Republicans who have largely turned toward bigoted, discriminatory, or hostile speech and policy. And those that do sour on the GOP have only two real options: Join the Democrats or ignore the political process completely. \nSome of American LGBTQ voters’ liberalism can also be explained by demographics. In the US, LGBTQ people skew younger and female, a part of the electorate that is more likely to hold more liberal views to begin with. And a small but growing share of Gen Z in particular identifies as transgender — meaning the Republican Party’s turn against trans people and trans rights is also likely to turn off potential future voters who are solidifying their ideological and partisan identities in their early years of political activity.\nAnd immigration, has just not functioned as a wedge issue in the same way it has for European LGBT voters or voters who support gay marriage or gay rights. America’s own immigration challenges are much more muted than what European countries have experienced — places like France and Germany have endured more of a shock because of the magnitude of the influx of refugees and migrants over the last 10 years, the degree of security and terrorist threats they’ve faced, and the relative size of their new foreign-born populations. Our own American mythos of being a land of immigrants has also generally made the country more accepting of immigrants over the last 30 years. It’s only recently that the country has taken a sharp anti-immigrant turn, largely because of economic anxiety and concerns over public order.\nAnd though some Republican activists and politicians tried to use the same rhetorical approach to persuade some (primarily) gay male voters, they just haven’t been as successful as European far-right parties.\nOf course, none of these dynamics are set in stone, and ideologies may continue to change. But for now, the prospect of a growing right-wing LGBTQ movement in the US seems to face many more hurdles.","summary":"Voters in Germany maintained a few global trends this past weekend: They kicked out incumbents, their youth moved to the right, and they delivered another surprise. Their radical, anti-immigrant party (Alternative für Deutschland, or AfD) finished second, and was likely boosted by some LGBTQ voters. The rightward shift of gay, lesbian, and bisexual voters is [&#8230;]","url":"https://www.vox.com/politics/401645/rise-queer-far-right-europe-america-trump-germany-afd","image":"https://platform.vox.com/wp-content/uploads/sites/2/2025/02/gettyimages-1162816707.jpg?quality=90&strip=all&crop=0%2C10.737568883469%2C100%2C78.524862233062&w=1200","video":null,"publish_date":"2025-02-27 12:00:00","author":"Christian Paz","authors":["Christian Paz"],"language":"en","source_country":"us","sentiment":0.149},{"id":294942026,"title":"The Trump revolution will be podcasted","text":"This story was originally published in The Highlight, Vox’s member-exclusive magazine. To get early access to member-exclusive stories every month, join the Vox Membership program today.\nKylie Kelce was at the top of the charts. The former field hockey coach and NFL royalty had dethroned Joe Rogan in his own domain — and his fans could not believe it.\nIt happened late last year: Kelce — whose marriage to former Philadelphia Eagles center Jason Kelce had pulled her into the limelight — had launched a podcast called Not Gonna Lie With Kylie Kelce, promoting it as a medium for her opinions on motherhood, sports, and, occasionally, politics.\nPodcasting is a male-saturated world. While Alex Cooper’s uber-successful Call Her Daddy podcast is among the few exceptions, men tend to occupy the top spots on podcasting charts. Think Joe Rogan, Theo Von, and Andrew Huberman.\nSo it came as a surprise, especially to Rogan’s fans, when Kelce’s debut in December unseated The Joe Rogan Experience from Apple’s No. 1 slot, and held the top spot for 10 days on Spotify’s chart. Indeed, some of Rogan’s fans claimed the numbers must have been artificially inflated. Kelce, they claimed, was a nobody.\nAnd yet the two shows would continue to trade places on Spotify for the next few weeks. Even now, though it only publishes once a week, Not Gonna Lie routinely remains in Spotify’s top 10.\nThere are many plausible reasons for the show’s breakout success: her Kelce and Taylor Swift connections, her ability to speak relatably about motherhood and femininity, the show’s relatively short (45-minute) length compared to competitors. But regardless of what fuels it, her trip to the top of the charts — and the resulting disbelief, mockery, and hot takes about that success — reveal a more interesting dynamic in entertainment and news media consumption in 2025.\nPodcasts have quickly become one of the main ways Americans inform themselves. While there are still traditional newscasts from news organizations, the most popular podcasts, particularly since the pandemic, are piloted by charismatic, trusted, and unpolished creators. Their content is a mix of news, political analysis, cultural commentary, and pop culture — with hosts often promising to deliver the truth or have the conversations no one else is having.\nBut not everyone is listening to the same thing. Americans are sorting themselves into ideological bubbles, giving these shows and their hosts the reach and influence that was once the exclusive provenance of mainstream media.\nAudiences’ ideological fragmentation, combined with these hosts’ power, are creating different realms of truth, both via the hosts’ opinions and the current events they choose to discuss for their fans. News and information is getting filtered to distinct groups of consumers in radically different ways — and there are no signs these habits are about to change. \nIndeed, as the second Trump administration takes off, they’re positioned to further drive American polarization, serving as the right’s chief communications wing in one realm and as a way to inform and organize opposition in another. \nAmericans have become obsessed with listening\nPodcasts’ role in the 2024 campaign, during which Donald Trump sat down for free-wheeling conversations with the most popular male hosts and Kamala Harris played catch-up with smaller liberal ones, demonstrated the medium’s surging predominance in American life.\nA little more than a decade ago, slightly more than a tenth of Americans reported listening to one in a given month. That number has since quadrupled, to nearly half of the American population over the age of 12, according to Edison Research’s “Infinite Dial” media survey in 2024.\nThe kinds of podcasts people are listening to have also shifted: What was once an arena dominated by public radio and establishment institutions has given way to a vast ecosystem of independent podcasters and non-news organization affiliated shows. As of 2023, less than 20 percent of the top 451 most-listened to shows are associated with mainstream news stalwarts like NPR, the New York Times, or The Ringer.\nUntil recently, men, millennials, and older Americans were the primary consumers of these shows; but over the last few years, Gen Zers and women are driving growth in podcasting audiences.\nWeekly, or even, daily, discussions that fold in news and politics with pop culture, sports, self-help advice, and personal stories are how nearly a third of America keeps up to date with current events. In 2023, a Pew Research Center report found that about two-thirds of American podcast listeners hear news “discussed” on their shows, even if it’s not the main reason they listen.\nAnd yet what they are hearing can be radically different depending on the host and the audiences they are cultivating. Fact and opinion often blend together in conversations that filter information, and listeners aren’t necessarily better informed as a result of it. \nAnd listeners really trust what they hear on these shows\nThis new breed of podcast — where the hosts primarily discuss sports, pop culture, history, or lifestyle trends and mix in some current events — creates a specific kind of intimacy and trust. Perhaps because these shows aren’t setting out to be overtly political, audiences are loyal. These shows aren’t your standard cable news fare — they might bring on a politician, like Trump’s appearances last year, or remain apolitical. But most commonly, they blur the line between news, opinion, and analysis.\nThe particular charisma and presence of podcast hosts makes them particularly influential in convincing their listeners to change habits or take action. Understanding this influence explains why the podcast circuit was such a major part of the strategies Trump and his campaign pursued — and just how important they’ll be for political efforts in the next four years.\nThat 2023 Pew study found a few practical examples of this sway. On average, more than half of listeners say a podcast has moved them to watch a movie or read a book, and about four in 10 had tried a new workout, or started a diet. And there are also signs of a core group of more loyal followers who feel comfortable spending money and time doing what these shows and their hosts suggest. At least one in 10 listeners had joined an online discussion group, donated to, volunteered for, or attended a political event or cause, and almost a third had bought something promoted on a podcast.\nThis influence also means that listeners expect podcasters to be telling them the truth. A huge share, 87 percent, believe that what they’re hearing on these shows is “mostly accurate.” A third say they trust this information to be more accurate than what they get from other sources.\nThese levels of trust are astounding, especially compared to trust in news from social media or mainstream media. And yet these kinds of shows don’t necessarily have the same kind of editorial oversight or infrastructure as traditional news organizations do to fact-check and verify the claims and narratives they’re spreading.\nAnd this is where the manosphere comes in. Republicans, or Americans who lean toward the GOP, are particularly loyal and trusting of these shows. They report, at much higher rates than Democrats or Democratic leaners, that they trust podcast news more than other sources, in part because they think these shows are giving them exclusive insights they wouldn’t hear anywhere else.\nThe most ideological and partisan listeners report that they tend to hear opinion and analysis that lines up with their preexisting views — they, in effect, shore themselves up in echo chambers in this ecosystem. When compared to moderate Republicans, twice as many conservative Republicans say they listen to political opinions that mostly match what they already think, according to Pew’s 2023 survey. The same goes for liberal Democrats when compared to moderate Democrats.\nThis ideological sorting also happens among listeners of the most popular shows. Some 54 percent of Rogan’s listeners, for example, leaned toward Trump before the presidential election, one Edison Research survey found. Only a quarter leaned toward Harris. Call Her Daddy’s listenership was a mirror image. And Pod Save America, the most popular left-leaning show, is almost exclusively for Democrats.\nThis development — where audiences are fiercely loyal to their chosen hosts and less exposed to others — creates an interesting dynamic. Information and political discussions get filtered into echo chambers. And it explains how the inhabitants of these different ideological realms can be surprised when they rediscover the other, as in the case for Rogan’s fans at Kelce’s success.\nThe podcast bubbles that await us\nThese different realms of podcasting reality don’t look like they’ll disappear anytime soon. Given Trump and the political right’s success in the last presidential cycle, it seems more likely that American liberals and the left will keep looking for ways to replicate, or at least mimic, what their rivals have accomplished.\nWhich is why Not Gonna Lie’s success came at an interesting time: in looking for reasons to explain Harris’s loss, Democrats and liberal thinkers identified one major contributor. Democrats had ignored the new media environment, and lost the fight for attention, particularly the influence of these podcasts and their hosts. Trump had understood this, and started early, at the suggestion of his zoomer son Barron and younger campaign aides.\nNow, Democrats need to create their own, liberal version of Rogan, the theory goes. They needed their own expansive, intimate network of relatable and trustworthy podcasters and influencers. The deeper angst here was the revelation that these increasingly popular podcasts could reach so many Americans and influence their thinking — and that liberals didn’t have an answer. \nA realm like this exists, though it’s not as expansive as those aiding the cultural right. The most obvious Rogan replicas — streamer Hasan Piker (3 million followers), the leftist Chapo Trap House network (about 150,000), the liberal Pod Save America bros (at least 1.5 million listeners per episode) — have loyal and devoted followers, but there are fewer of them, and the shows are more diffusely connected than those in the conservative manosphere, which seemed much better organized around politics in 2024.\nAll of which suggests there’s room to grow on the left. \nPodcasters themselves are trying to innovate to win these audiences. With declining interest in traditional formats of political and hard news, they’re experimenting with different formats: livestreams, pushing video content, and developing even more close relationships with audiences. Young people, in particular, are hungry for this kind of content and analysis, especially on YouTube, Rachel Janfaza, a Gen Z political consultant and writer, told me. The Google-owned video platform is now the leading podcast hosting service, driven in large part by young people’s demand for video-first content. Many of the most popular podcasts in America now record and stream directly on the platform.\n“We’ll see more movement there in terms of shows adding video components to podcasts, and that could be an area that explodes in the coming months, because [creators are seeing] ... young people love to keep YouTube streams on in the background, or YouTube shows on in the background while [doing other things],” she said.\n[Image: Kylie Kelce during an interview on NBC’s Today Show in 2024. https://platform.vox.com/wp-content/uploads/sites/2/2025/01/gettyimages-2123625004.jpg?quality=90&strip=all]\nThis makes Kelce’s position, along with other liberal and female hosts like Cooper of Call Her Daddy, all the more interesting to watch in the coming years. There are large and growing audiences out there for them to take advantage of — particularly young, female, and liberal. So when Kelce revealed her politics “aggressively” lean left, and that she hoped to interview former first lady Michelle Obama or Democratic Pennsylvania Gov. Josh Shapiro in the future, some wondered if they’d found their answer to the right.\n“That Kylie Kelce could end up being ‘the left’s Joe Rogan’ is going to really fuck with some of the (ahem, male) pundits’ heads,” the head of one Democratic PAC posted on X.\nBased on her first six episodes, it doesn’t seem like Kelce is trying to aggressively move down that lane. She’s not diving into analysis of the end of the Biden presidency or the Trump term so far. She’s instead talking with guests about the struggles of motherhood, the costs of child care, the struggle of raising young boys, and the future of TikTok. And that might be the whole point. She’s not saying anything groundbreaking — yet. But she’s saying something, feeding demand and cultivating an audience that will come to trust her when she wants to say something big.","summary":"This story was originally published in The Highlight, Vox’s member-exclusive magazine. To get early access to member-exclusive stories every month, join the Vox Membership program today. Kylie Kelce was at the top of the charts. The former field hockey coach and NFL royalty had dethroned Joe Rogan in his own domain — and his fans could not [&#8230;]","url":"https://www.vox.com/politics/396998/podcast-spotify-youtube-trump-rogan-kelce-politics-news","image":"https://platform.vox.com/wp-content/uploads/sites/2/2025/01/gettyimages-2185179146.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200","video":null,"publish_date":"2025-02-27 11:01:00","author":"Christian Paz","authors":["Christian Paz"],"language":"en","category":"politics","source_country":"us","sentiment":0.266},{"id":294899674,"title":"EXCLUSIVE: 'Divorcing' Barack and Michelle Obama 'Doing Everything They Can to Avoid Nasty Public Split' – 'They Want All Their Assets Split and Problems Ironed Out Before They Come Clean'","text":"Barack and Michelle Obama are secretly divvying up their sprawling $70million empire so they can have an \"amicable\" split, RadarOnline.com can reveal – as the couple lay the groundwork for their upcoming nation-shaking public announcement of the first post-White House marital split by a former president in American history. \n\nSources tell us lawyers and advisers for Barack, 63, and Michelle. 61, are in hush-hush meets, hammering out the details of their coming split in an effort to reach an agreement on all points before their shocking public announcement is made later this year.\n\nOne Democratic Party insider with knowledge of the deliberations said: \"They want to have everything ironed out in advance. The last thing they want is an ugly fight with lots of nasty legal filings.\"News America's 44th president and his glamorous wife of 32 years are headed for splitsville should come as no surprise. \n\nFollowing Donald Trump's victory in the 2024 election, the Obama marriage has reportedly turned \"venomous.\"\n\nSources said Barack had demanded Michelle take up the Democratic Party's standard following Joe Biden's July exit from the race, but the Harvard-trained lawyer and former hospital administrator balked at his ultimatum and chose to continue her conquest of Hollywood, making deals through their film company Higher Ground Productions.Their choices to go in different directions – he still in politics and she in showbiz – pushed their marriage to the breaking point, sources said. \n\n\"They'd already been living separate lives on opposite coasts for some time, but that was no longer an option after Michelle refused to run and Barack was forced to back Kamala Harris,\" our insider added. \"That was a total humiliation for him, especially since she lost.\"\n\nSources now say a public revelation of their marriage's end will likely be issued sometime after the summer since it will take some months to come to an agreement on their considerable assets.Our insider went on: \"They have homes in D.C., Martha's Vineyard and Chicago, plus a stock portfolio in excess of $25million. \n\n\"There are also substantial revenue streams from their various media projects to divide and manage going forward. \n\n\"It's far from easy to untangle a life of three decades with someone, but maintaining the illusion of a happy and stable marriage is no longer a solution.\n\n\"They both are of the mind that they will be better off on their own.\"","summary":"Barack and Michelle Obama are said to be scrabbling to settle their assets split privately amid growing divorce rumors.","url":"https://radaronline.com/p/barack-michelle-obama-divorce-rumors-asset-settlement-secret-split-come-clean-public-announcement/","image":"https://media.radaronline.com/brand-img/awivBDEvZ/0x0/barack-michelle-obama-divorce-rumors-asset-settlement-1740077086396.jpg","video":null,"publish_date":"2025-02-27 11:00:00","author":"Radar Staff","authors":["Radar Staff"],"language":"en","source_country":"us","sentiment":-0.146},{"id":294903416,"title":"Jeff Bezos Announces Restrictions On Washington Post's Opinion Coverage","text":"The Washington Post will no longer run views opposed to \"personal liberties and free markets\" on its opinion pages, owner Jeff Bezos announced Wednesday, the billionaire's latest intervention in the major US paper's editorial operations.The move, a major break from the norm at the Post and at most credible news media organizations worldwide, comes as US media face increasing threats to their freedom and accusations of bias from President Donald Trump.\"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,\" wrote Bezos on social media platform X.\"We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.\"Bezos said the US capital's premier daily did not have to provide opposing views because \"the internet does that job.\"\"If this was a regular news environment we might just raise our eyebrows at this, but this is happening at a time of unprecedented pressures for journalists working in the United States,\" said Katherine Jacobsen of rights watchdog Committee to Protect Journalists (CPJ).In October, Bezos sparked controversy by blocking the Post's planned endorsement of Democratic vice president Kamala Harris for the 2024 presidential election, triggering newsroom protests and subscriber cancellations.And in January, an award-winning political cartoonist for the newspaper announced her resignation after a cartoon depicting Bezos groveling before Trump was rejected.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");At the time, editorial page editor David Shipley defended the decision, saying it was made to avoid repeated coverage on the same topic.On Wednesday, Bezos announced Shipley would be leaving his post because he had not signed on to the new opinion pages policy.\"I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no,'\" said Bezos.Other Post staffers also expressed their concern.\"Massive encroachment by Jeff Bezos into The Washington Post's opinion section today -- makes clear dissenting views will not be published or tolerated there,\" Jeff Stein, the paper's chief economics correspondent, wrote on X.Stein added that he had \"not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the news side I will be quitting immediately.\"Amazon owner and world's third-richest man Bezos, along with other US tech moguls, have appeared increasingly close to Trump since his election last year.Bezos was among a group of tech billionaires who were given prime positions at Trump's inauguration, and he visited the Republican at his Mar-a-Lago estate during the transition period.CPJ has documented \"how ownership of media companies in countries such as Hungary and Russia has really had an impact on press freedom,\" the committee's Jacobsen cautioned.\"We would do well in the US to look at countries like that to see what happens when perhaps too much interest is given to owner interest versus serving the public good.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The Washington Post will no longer run views opposed to \"personal liberties and free markets\" on its opinion pages, owner Jeff Bezos announced Wednesday.","url":"https://www.ndtv.com/world-news/jeff-bezos-announces-restrictions-on-washington-posts-opinion-coverage-7807432","image":"https://c.ndtvimg.com/2024-07/5jp369v8_jeff-bezos_625x300_03_July_24.jpeg","video":null,"publish_date":"2025-02-27 10:42:23","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.052},{"id":295003828,"title":"CBS News Triples Down on Defending 60 Minutes-Kamala Interview, as Paramount Enters Mediation with Trump","text":"CBS News is still smarting over Paramount’s decision to release the full transcript of the creatively-edited 60 Minutes interview with Vice President Kamala Harris, which removed significant word salads from her responses. The beleaguered CBS Evening News is still defending the interview, even as the parties move closer to settling the $20B lawsuit.\n\nHere is the full item defending the interview, which aired on the “Evening News Roundup” segment of the CBS Evening News on Wednesday, February 26th, 2025:\n\nMAURICE DuBOIS: At that (Cabinet) meeting, the president made a false claim about the 60 Minutes interview with Vice President Kamala Harris last fall. The president claimed that after Harris was asked a question, quote: \"They took out her answer and they inserted an entirely different answer\", end quote. Not true. What viewers saw and heard was Harris' answer to the original question. The transcript shows, as 60 Minutes has said repeatedly, the broadcast was not doctored or deceitful. And you can watch the full, unedited interview for yourself on CBS News dot com.\n\nThe record reflects that CBS News got caught red-handed while editing Vice President Kamala Harris’s responses to correspondent Bill Whitaker, and that the network got caught airing different responses to the same question on 60 Minutes versus on Face the Nation.\n\nAs our colleague Nick Fondacaro noted when the raw video and transcript were released pursuant to the demand of these by the Federal Communications Commission:\n\nAfter reviewing the video (clip from the raw video below), NewsBusters can confirm that what appeared on 60 Minutes was highly edited. Not only did they edit what appeared on 60 Minutes, they also edited what appeared on Face the Nation, including cutting out a hard hitting question that called out the Biden-Harris administration for looking weak on the world stage.\n\nBut what CBS did was pluck out a fragment of a sentence that was in the middle of a word salad being spoken by candidate a with a problem connecting with voters. Again, they also edited out their reporter asking a question with critical analysis against said candidate. They later followed up with a different 60 Minutes episode smearing said candidate’s opponent.\n\nCompare what CBS actually did in furtherance of Harris’s candidacy to Maurice DuBois’ labored copy, which focuses on the semantics of Trump’s statement. There was indeed some taking out, and viewers saw something different to what was originally said. CBS News is desperately trying to cling to some shred of credibility in the midst of turmoil which includes cratering ratings subsequent to the ouster of anchor Norah O’Donnell, and a much-criticized overhaul of the Evening News (we told you so).\n\nBut the news division’s tripling down comes as its corporate parent, Paramount, has decided to enter into mediation with Trump- a necessary step towards coming into agreement on a settlement. Per The New York Post:\n\nLawyers representing Paramount and Donald Trump have agreed to bring in a mediator to facilitate discussions about a possible settlement in the president’s ongoing $20 billion lawsuit against subsidiary CBS, according to a report.\n\nThe decision to bring in a third party signals a potential effort by both sides to resolve the dispute outside of court, according to the New York Times.\n\nThe lawsuit filed by Trump accuses the CBS show “60 Minutes” of deceptively editing an interview with then-Vice President Kamala Harris, whose long-winded answer to a question about the Israel-Hamas conflict was condensed.\n\nThe decision to continually defend malicious and deceptive editing in the midst of potential settlement negotiations is but the latest in a string of incidents standing as proof evident of the decline and fall of CBS News.","summary":"CBS News is still smarting over Paramount’s decision to release the full transcript of the creatively-edited 60 Minutes interview with Vice President Kamala Harris, which removed significant word salads from her responses. The beleaguered CBS Evening News is still defending the interview, even as the parties move closer to settling the $20B lawsuit.\n\nHere is the full item defending the interview, which aired on the “Evening News Roundup” segment of the CBS Evening News on Wednesday, February 26th, 2025:\n\n\n\n\n\n\nMAURICE DuBOIS: At that (Cabinet) meeting, the president made a false claim about the 60 Minutes interview with Vice President Kamala Harris last fall. The president claimed that after Harris was asked a question, quote: \"They took out her answer and they inserted an entirely different answer\", end quote. Not true. What viewers saw and heard was Harris' answer to the original question. The transcript shows, as 60 Minutes has said repeatedly, the broadcast was not doctored or deceitful. And you can watch ","url":"https://www.newsbusters.org/blogs/nb/jorge-bonilla/2025/02/27/cbs-news-triples-down-defending-60-minutes-kamala-interview","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-02/CBS%20Evening%20News-6_35_49%20pm-2025-02-26.jpg?itok=tymO45Hz","video":null,"publish_date":"2025-02-27 10:41:00","author":"Jorge Bonilla","authors":["Jorge Bonilla"],"language":"en","source_country":"US","sentiment":-0.279},{"id":294902434,"title":"Tim Walz says he will not run for U.S. Senate seat in Minnesota","text":"Feb. 26 (UPI) -- Minnesota Gov. Tim Walz, who was Kamala Harris' running mate in the 2024 presidential election last year, said he will not seek a spot in the U.S. Senate, according to his spokesperson on Wednesday.\n\nInstead, Walz will explore running for a third term as governor. Walz's Lt. Gov. Peggy Flanagan has already announced she will run for the Senate seat being vacated by Tina Smith next year.\n\nThe seat, long held by Democrats, could draw other big names into the contest.\n\n\"He loves his job as governor and he's exploring the possibility of another term to continue his work to make Minnesota the best state in the country for kids,\" spokesperson Teddy Tschann said, according to the Star Tribune.\n\nRep. Angie Craig, another popular moderate Democrat, had been contemplating a run for governor, but a race against Walz could open the door for a Republican to score a rare win in the statewide office.\n\nThe Republicans said they believe the Senate seat is in play for a pickup, noting that Harris received just over 50% of the vote with Walz on the ticket last year against Trump.\n\nRepublicans who have been mentioned as possible candidates include State Sen. Julia Coleman, the daughter-in-law of former Sen. Norm Coleman, former sports broadcaster Michele Tafoya and ex-Senate candidate Royce White.","summary":"Minnesota Gov. Tim Walz, who ran with Kamala Harris in the 2024 presidential election last year, said he will not seek a spot in the U.S. Senate, according to his spokesperson on Wednesday.","url":"https://www.upi.com/Top_News/US/2025/02/27/Tim-Waltz-Senate-Minnesota/4141740584809/","image":"https://cdnph.upi.com/ph/st/th/4141740584809/2025/upi/dab3ea3afeddb354317bc18ade3a1988/v1.2/Tim-Walz-says-he-will-not-run-for-US-Senate-seat-in-Minnesota.jpg","video":null,"publish_date":"2025-02-27 10:33:11","author":"Clyde Hughes","authors":["Clyde Hughes"],"language":"en","source_country":"us","sentiment":0.299},{"id":294864610,"title":"Letter: We should recognize our country is in trouble","text":"To the editor: Pittsfield and the Berkshires have a long, proud and significant history of defending our country.\n\nKamala Harris recognized this.\n\nPittsfield can and should state to the nation that democratic politics starts here in Pittsfield. If the mayor and City Council could show some fortitude and not cower to the threat of repercussions, which will surely come, I'm asking our city leaders to officially declare our country is in trouble by displaying our nation's flag upside-down with the city limits.\n\nSuch an officially sanctioned demonstration could and should be followed by every municipality and state, starting in Pittsfield. Undeniably, my country is in trouble.\n\nMichael W. Jordan, Pittsfield","summary":"To the editor: Pittsfield and the Berkshires have a long, proud and significant history of defending our country.","url":"https://www.berkshireeagle.com/opinion/letters_to_editor/letter-we-should-recognize-our-country-is-in-trouble/article_d0016b18-f280-11ef-a0f5-d3957ab5bfa2.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-27 10:00:00","author":"Blox Content Management","authors":["Blox Content Management"],"language":"en","category":"politics","source_country":"us","sentiment":0.035},{"id":294870754,"title":"Floyd Mayweather throws his support behind Donald Trump with bold claim","text":"Boxing legend Floyd Mayweather has made a sensational claim that Donald Trump is the 'best president' in the history of America.\n\nBack in November, Trump was elected the 47th president of the United States in a stunning political comeback that shocked the nation. The tightly-contested race saw Trump and Kamala Harris neck and neck in their battle to the White House right up until the winner was named.\n\nPrior to winning the election, the 78-year-old had received a lot of support from several members within the combat sports industry, including UFC supremo, Dana White. Trump has attended multiple UFC events over the years, especially in his 2024 campaign, as part of efforts to appeal to younger male voters. \n\nWhite, in turn, has had speaking roles at the 2016, 2020 and 2024 Republican conventions and appeared on stage at Trump's election victory party in November, even speaking briefly to the crowd. However, it's not just the UFC boss who has voiced his support for the 47th president, Mayweather also appears to be a big advocate of Trump following his bold claim.\n\nIn an interview with Fox, Mayweather said: “In America, we’re never happy. I’m happy, but we’re never happy. We had Trump before, we didn’t appreciate him. But I think Trump is a great president, actually, he’s the best president in my eyes. He’s the best president we ever had. Great businessman, and that’s what it’s about. \n\n\"Trump has done an amazing job. And a lot of people around America are upset, but no matter who goes in the White House, we’re always upset. I think Trump is the man for the job. He’s the best president, in my eyes.\"\n\nThe American's comments gained a lot of attraction on social media as one user wrote: \"Great recognises Great... let's be honest, it's only one month in and he's flipped the entire story upside down. He's got to try to f*** this one up to not be considered one of the greatest comeback story of all time,'' while another wrote: \"Mayweather is a legend and he called out the truth.\"\n\nA third posted: \"Well at least Floyd Mayweather understands the assignment. He even know that Donald Trump is the best president ever.\" Another commented: \"Preach a little louder for the folks in the back, Floyd Mayweather.\"","summary":"Over the years, several stars within the combat sports industry have voiced their support for the president, with Mayweather now offering his verdict on the American","url":"https://www.mirror.co.uk/sport/boxing/floyd-mayweather-donald-trump-boxing-34759515","image":"https://i2-prod.irishstar.com/sport/boxing/article34650733.ece/ALTERNATES/s1200/0_GettyImages-2176848770.jpg","video":null,"publish_date":"2025-02-27 09:52:19","author":"James Evans","authors":["James Evans"],"language":"en","category":"politics","source_country":"GB","sentiment":0.151},{"id":294837080,"title":"Mary Millben Calls Donald Trump “Kind,” Shares How He Delayed Speech for Her Performance at CPAC","text":"Washington, DC [US], February 27 (ANI): African-American singer and actress Mary Millben described US President Donald Trump as \"kind,\" recalling an incident at the Conservative Political Action Conference (CPAC) last week when he delayed his speech to allow her to perform, despite an initial decision by the backstage team to cancel her act due to his early arrival, highlighting what she called his \"soft power\" and unwavering support for her career.\nMillben shared that while she was preparing to perform before Trump at CPAC, she was informed that her act was being cut as the former President had arrived earlier than scheduled and was set to go on stage immediately. Accepting the situation, she was ready to take her seat and listen to his speech. However, Trump, who overheard the discussion, intervened and insisted to CPAC Chairman Matt Schlapp that she must sing before he took the stage.\nIn a post on X, Millben wrote, \"One word that comes to mind when people ask me about President @realDonaldTrump – kind. Compelled to share publicly, here is one of many moments with the President that personifies his kindness. As I was preparing backstage to perform before President Trump at @CPAC last week, the President arrived backstage earlier than scheduled. The President and I had a quick exchange, his words always so supportive. The backstage team, certainly doing their job well, came over to me and informed me my performance was getting cut given the President was early and they were going to move him immediately onstage.\"\nShe added, \"After singing for five consecutive US Presidents, I have learned to be flexible and live by the motto, 'I serve at the pleasure of the President.’ And so I was prepared to not sing and happily be escorted to my seat for the President’s speech. Overhearing the conversation feet away, the President stopped everyone, clarified his desire, and told my friend CPAC Chairman @mschlapp and the team I was to sing. The President of the United States, leader of the free world, was going to delay speaking so I could sing. How much I was humbled in that moment and emotional walking onstage. Such kindness.\"\nMary Millben expressed her gratitude, saying she would never forget Trump's kindness and called it his \"soft power,\" adding that both Donald Trump and former First Lady Melania Trump had championed her career, supported her both publicly and privately, and given her opportunities during their time in the White House.\n\"I will never forget the kindness of the President, his ‘soft’ power, reminding everyone backstage who was really in charge. @POTUS and @FLOTUS have championed my career for years, supported me publicly and privately, opened their home to me, positioned me on stages when others said no, and given me tremendous opportunities to join them in moments of their Presidency. The President is kind, and in a moment that was purposefully about the President and his moment to speak, he graciously made it about me first so I could sing. No matter what you read or hear, I will be your evidence of this truth: The President is truly kind. Thank you wholeheartedly, #POTUS,\" she posted on X.\nOn February 23, Trump addressed CPAC, where he spoke about his deportation programme and other key issues.\nEarlier in November, Millben had voiced her strong support for Trump in his contest against former Vice President Kamala Harris. Speaking to ANI from near Palm Beach, Florida, where she prepared to join a gathering of Trump supporters, she expressed her hope for his victory.\nWhen asked whom she was supporting, Millben said,*\"I certainly want to see the President victorious tonight and serving again as our 47th President.\" However, she also emphasised that her work was independent of political outcomes. \"My work certainly continues. I have the great privilege of being in a profession that doesn't necessarily depend on who's in the White House,\"she said.\n(Inputs from ANI)\nAlso Read: Taiwan Detects Record 45 Chinese Warplanes Near Its Territory Amid Rising Tensions","summary":"Political Action Conference (CPAC) last week when he delayed his speech to allow her to perform, despite an initial decision by the backstage team to cancel her act due to his early arrival, highlighting what she called his &#8220;soft power&#8221; and unwavering support for her career.  ","url":"https://www.newsx.com/india/mary-millben-calls-donald-trump-kind-shares-how-he-delayed-speech-for-her-performance-at-cpac/","image":"https://www.newsx.com/wp-content/uploads/2025/02/Trump-5.webp","video":null,"publish_date":"2025-02-27 07:07:42","author":"Apurv Chhavi","authors":["Apurv Chhavi"],"language":"en","category":"politics","source_country":"in","sentiment":0.25},{"id":294901884,"title":"White House Correspondents Association to Members: You’re On Your Own Against Trump","text":"In response to the Trump administration sidelining the White House Correspondents Association and taking full control over which media outlets get White House access, on Wednesday WHCA denounced what it called a threat to “the independence of a free press in the United States,” and said it won’t cooperate.\n\nBut if the group’s members expected there would follow a plan, or at least a call for a coordinated response to that threat, they likely came away disappointed. The WHCA has decided to stop distributing pool reports, effectively ceding control of the process to Trump without a fight. And its message to members was, in essence, that they’re on their own.\n\nTrump’s press secretary, Karoline Leavitt, announced the change on Tuesday with a smug statement that said in part, “The White House press team in this administration will determine who gets to enjoy the very privileged and limited access in spaces such as Air Force One and the Oval Office.”\n\nIn a statement sent Wednesday night to members, WHCA president Eugene Daniels said in part, “This move from the White House threatens the independence of a free press in the United States. It suggests the government will choose the journalists who cover the president.”\n\nDaniels also said WHCA will no longer distribute pool reports because it “cannot ensure that the reports filed by government-selected poolers will be held to the same standards that we have had in place for decades.”\n\n“WHCA stands ready to assist in pool organization, travel planning, and logistical support – and will never stop advocating on behalf of our members,” Daniels continued. “But we cannot facilitate a pool where the President, rather than the press corps and the audience they represent, decides who can and cannot cover him.”\n\nBut, while Daniels avowed that the WHCA board “will not assist any attempt by this administration or any other in taking over independent press coverage of the White House,” that appears to be the extent of push back. \n\n“Each of your organizations will have to decide whether or not you will take part in these new, government-appointed pools,” he told members.\n\nIt’s unclear how this message was received by WHCA membership at large. But at least one member, Andrew Feinberg of The Independent, gave it an F, telling Oliver Darcy, “Speaking only for myself and not for my outlet, I am troubled by what appears to be a declaration that we are all on our own while this association orders us to not use the only way we have to communicate with the entire press corps as we navigate this unprecedented and disturbing situation.” \n\nDarcy also reported in the latest edition of his Status newsletter that “a few” other WHCA members have privately said they agree with Feinberg.\n\nThis follows a brutal few weeks in which Trump has escalated his attacks on independent media. It started when he banned the Associated Press from the White House for refusing to refer to the Gulf of Mexico as the “Gulf of America.” Perhaps emboldened by the fact that no other media outlets pulled out of White House coverage in solidarity with AP, Trump has now also banned Reuters and Huffington Post.\n\nThat’s in addition, of course, to the new, Trump-controlled White House press pool that is likely to be dominated but right wing outlets friendly to Trump. And the $20 billion lawsuit Trump filed against Paramount over the 2024 “60 Minutes” interview with Kamala Harris, which Trump baselessly claims was fraudulently edited.\n\nDaniels, until recently the co-author of Politico Playbook, was also just named as the host of a new weekend show on the liberal-leaning cable news network MSNBC, an announcement that came after a brutal wave of cancellations that even Rachel Maddow called out on-air. Network bosses and insiders have insisted there are no plans to change its focus on progressive politics.","summary":"\"Each of your organizations will have to decide whether or not you will take part in these new, government-appointed pools,\" org president Eugene Daniels tells members\n\n\nThe post White House Correspondents Association to Members: You&#8217;re On Your Own Against Trump appeared first on TheWrap.","url":"https://www.thewrap.com/whca-to-members-youre-on-your-own-against-trump/","image":"https://www.thewrap.com/wp-content/uploads/2025/01/trump-hannity.jpg","video":null,"publish_date":"2025-02-27 07:01:05","author":"Ross A. Lincoln","authors":["Ross A. Lincoln"],"language":"en","category":"politics","source_country":"US","sentiment":-0.344},{"id":294796982,"title":"Trump might not know it, but he’s forging a new relationship between Britain and the EU | Martin Kettle","text":"It would be absurd to claim to see a silver lining behind every Donald Trump cloud. Those clouds are too many, too dark and too dangerous. All the same, viewed from a domestic political perspective, there is a clear emerging British upside to Trump’s efforts at crashing the post-cold war order. It might even get a boost from Thursday’s Washington visit by Keir Starmer.\n\nIn July 2024, when Starmer became prime minister, Labour was rigidly on the defensive about Europe. Brexit was seen as an electorally unstable issue for a party whose priority was to reconnect with leave voters. Everything about Europe was thus sidelined during the election. Only vague generalities were permitted. The only foreign leaders pictured in the party manifesto were Ukraine’s Volodymyr Zelenskyy and Canada’s Justin Trudeau.\n\nSince July, Labour in government has continued to tread warily. Starmer’s personal goodwill towards Europe was clear in international meetings, especially bilaterals. But he remained circumspect and nervous about re-engaging on policy specifics, especially with the EU itself. For instance, a report last week that the UK would agree with the EU on youth mobility visas was quickly knocked down by the government.\n\nDowning Street’s response here was explicit. Such a scheme, even though only applying to 18- to 30-year-olds, restricted to a three-year limit and subject to an annual numbers cap, would be depicted as a resumption of pre-Brexit freedom of movement. It was not going to happen, said No 10. The reason is simple. Starmer is determined to prevent any replay of the Brexit years from entering the domestic political arena. The Liberal Democrat leader Ed Davey’s recent proposal for Britain to rejoin the European customs union also got a similarly immediate brush-off.\n\nImportantly, the Conservative opposition is also cautious about Europe, although for quite different reasons. Brexit still remains part of the Tory party’s creed. But even some Tory true believers can see there’s a problem. Brexit is synonymous in the public mind with the chaos of the Johnson, Truss and Sunak years, which led to the party’s worst modern election defeat last year. Nor has Brexit delivered any of the advantages promised in 2016. The Tories are therefore content with the standoff too. Even Reform UK says little about Brexit. Only the Lib Dems and the Scottish nationalists feel unfettered by the issue.\n\nThe politics of the UK-Europe relationship might have stayed quietly frozen there for the next two or three years, despite Trump’s return. That was, after all, the original Labour government plan. So much has happened in Washington so quickly that it is perhaps hard to remember that, just after the 20 January inauguration, the UK was wholly focused on trying to embrace Trump as much as practicable, as well as on keeping out of the developing US-EU tariff battle.\n\nThat changed for ever with Trump’s volte-face on the Russia-Ukraine war. By embracing Russia, and trashing Ukraine and Zelenskyy, Trump exposed the true scale of the security threat to Ukraine and Europe that would result from a deal between him and Vladimir Putin. JD Vance underlined the realities in Munich shortly after. As a result, Trump drove Britain and Europe closer together far sooner than might have happened if Kamala Harris had become US president. Starmer now talks almost daily with Zelenskyy and, just as importantly, with Emmanuel Macron.\n\nThis change is the product of necessity. It has been brought on by Trump’s recklessness. But it has a positive side. It forces Starmer to engage far more actively with Europe on defence and security. This is desirable all round. One consequence was Tuesday’s defence spending hike announcement. But this may be only the start.\n\nA further paradox is that Trump has also forced Kemi Badenoch and the Tory party to support Starmer’s more Europe-oriented response. Having backed Ukraine so passionately under Boris Johnson from 2022, anything else would discredit the Conservatives further. Remarkably, the Tories have almost nothing to say about a shift that would have been anathema in Johnson’s day. Even Nigel Farage, though less heavily politically invested in support for Ukraine and Zelenskyy, has had to join the slipstream.\n\nAll of which has gifted Starmer a new and previously closed space in British politics. Building up Europe’s defence effort is suddenly the patriotic course. In the past, it would have been depicted as divisive, anti-American and anti-Nato. Instead, with the US threatening to turn its back on Ukraine, Europe and even Nato, it is Trump who is now divisive. There is an echo here of modern Britain’s Churchillian mythology, and of the words uttered by a defiant British soldier who raises his fist to the gathering storm in David Low’s iconic 1940 cartoon: “Very well, alone.”\n\nNow, though, it is all Europe, not Britain, that stands alone. Trump deserves two sorts of credit for this amid all the justified condemnation. First, because all of Europe should have seen and acted earlier on the security need anyway – not exactly difficult after Putin’s seizure of Crimea and Trump’s first term. Second, because it pushes Britain closer to Europe more generally. This increases the possibility for other forms of European joint action, not just in defence, that will sometimes be based on nation states and not exclusively on the disturbingly unwieldy EU.\n\nLast weekend’s German election is potentially pivotal here. The likely German chancellor, Friedrich Merz, has long been open both to stronger German defence and, like Macron, to what is known in EU-speak as “variable geometry” relationships. This is where the priority for Europe’s future lies, not just for Britain. Whether these things will happen, and whether they will be sustained by the Merz-Starmer generation of leaders, are different questions altogether. But Trump has given Europe a chance. There is a gleam in the dark.\n\n Martin Kettle is a Guardian columnist","summary":"Support for Ukraine means that closer ties to Europe are now a patriotic priority, opening up avenues that Brexit had once blocked\n\nIt would be absurd to claim to see a silver lining behind every Donald Trump cloud. Those clouds are too many, too dark and too dangerous. All the same, viewed from a domestic political perspective, there is a clear emerging British upside to Trump’s efforts at crashing the post-cold war order. It might even get a boost from Thursday’s Washington visit by Keir Starmer.\n\nIn July 2024, when Starmer became prime minister, Labour was rigidly on the defensive about Europe. Brexit was seen as an electorally unstable issue for a party whose priority was to reconnect with leave voters. Everything about Europe was thus sidelined during the election. Only vague generalities were permitted. The only foreign leaders pictured in the party manifesto were Ukraine’s Volodymyr Zelenskyy and Canada’s Justin Trudeau.\n\nMartin Kettle is a Guardian columnist\n\n Continue reading...","url":"https://www.theguardian.com/commentisfree/2025/feb/27/donald-trump-britain-eu-relationship-ukraine-brexit","image":"https://i.guim.co.uk/img/media/c5fee8266dcba6803a0fc285061f3e3d100fff6d/0_52_4168_2502/master/4168.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3Bp","video":null,"publish_date":"2025-02-27 06:00:28","author":"Martin Kettle","authors":["Martin Kettle"],"language":"en","source_country":"us","sentiment":-0.163},{"id":294850374,"title":"It's the oligarchy, stupid","text":"One of the unacknowledged advantages of the horrendous era we’ve entered is that it is revealing for all to see the putrid connections between great wealth and great power. \n\nOligarchs are fully exposed, and they are defiant. It’s like hitting the “reveal code” key on older computers that let you see everything. \n\nToday, Jeff Bezos, the second-richest person in America, who bought The Washington Post in 2013, announced that the paper’s opinion section would henceforth focus on defending “personal liberties and free markets.” \n\nAnything inconsistent with this view would not be published. “Viewpoints opposing those pillars will be left to be published by others.” (Full statement here.)\n\nThe Post’s opinion editor, David Shipley, promptly resigned, as he should. \n\nYou’ll recall that Bezos barred the Post from endorsing Kamala Harris in the last weeks of the 2024 election. Subsequently, the paper wouldn’t print its cartoonist’s drawing showing Bezos and other oligarchs bowing to Trump — leading the cartoonist to resign. \n\nElon Musk, the richest person in the world, bought Twitter in 2022, laid off everyone who was filtering out hateful crap on the platform, renamed it X, and turned it into a cesspool of lies in support of Trump. \n\nMark Zuckerberg, the third-richest person, has followed suit, allowing Facebook to emit lies, hate, and bigotry in support of Trump’s lies, hate, and bigotry. \n\nAll three of these men were in the first row at Trump’s inauguration. They and other billionaires have now exposed themselves for what they are. \n\nThey are the oligarchy. They continue to siphon off the wealth of the nation. They are supporting a tyrant who is promising them tax cuts and regulatory rollbacks that will make them even richer, and destroying democracy so they won’t have to worry about “parasites” (as Musk calls people who depend on government assistance) demanding anything more from them. \n\nWhen billionaires take control of our communication channels, it’s not a win for free speech. It’s a win for their billionaire propaganda. \n\nWhen they talk of “personal liberties and free markets,” they mean their own liberties to become even richer and more powerful, as the rest of America slides into worse economic insecurity and fear. \n\nWhen they speak of “freedom,” what they actually seek is freedom from accountability. \n\nThis “reveal code” moment is, in a way, a blessing. It allows everyone to see where the money and power have gone. \n\nIt is a prerequisite to the long and difficult but necessary process of creating an economy and democracy for the many rather than for the few.\n\nNOW READ: The Supreme Court has a new playbook — and Democrats need to adapt before it's too late\n\nRobert Reich is a professor of public policy at Berkeley and former secretary of labor. His writings can be found at https://robertreich.substack.com/.","summary":"One of the unacknowledged advantages of the horrendous era we’ve entered is that it is revealing for all to see the putrid connections between great wealth and great power. \n\nOligarchs are fully exposed, and they are defiant. It’s like hitting the “reveal code” key on older computers that let you see everything. \n\nToday, Jeff Bezos, the second-richest person in America, who bought The Washington Post in 2013, announced that the paper’s opinion section would henceforth focus on defending “personal liberties and free markets.” \n\nAnything inconsistent with this view would not be published. “Viewpoints opposing those pillars will be left to be published by others.” (Full statement here.)\n\nThe Post’s opinion editor, David Shipley, promptly resigned, as he should. \n\nYou’ll recall that Bezos barred the Post from endorsing Kamala Harris in the last weeks of the 2024 election. Subsequently, the paper wouldn’t print its cartoonist’s drawing showing Bezos and other oligarchs bowing to Trump — leading the cartoonist to r","url":"https://www.alternet.org/bezos-washington-post/","image":"https://www.alternet.org/media-library/file-photo-jeff-bezos-owner-of-the-washington-post-delivers-remarks-at-the-grand-opening-of-the-washington-post-newsroom-in-w.jpg?id=56597925&width=1200&height=600&coordinates=0%2C542%2C0%2C542","video":null,"publish_date":"2025-02-27 05:13:34","author":"Robert Reich","authors":["Robert Reich"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.041},{"id":294779650,"title":"Elon Musk ‘doesn’t give a s**t’ that he’s making Trump’s job ‘1000 times harder,’ warns Mark Cuban","text":"Tech billionaire and DOGE king Elon Musk is on track to make Donald Trump’s job dismantling the federal government “1,000 times harder” — and Musk couldn’t care less, Shark Tank entrepreneur Mark Cuban warned at a political conference \n\n“Elon doesn’t give a s**t,” Cuban added. “He’s like, I’ll be rich no matter what.”\n\nThe Dallas Mavericks owner attacked Musk during an interview on stage over the weekend in Washington, D.C. at the Principles First Summit of mostly conservative anti-Trumpers with independents and even left-of-center Democrats.\n\nSpeakers included Trump critics like the president’s former National Security Adviser John Bolton, attorney George Conway, and former police officers attacked by Trump supporters at the January 6 Capitol siege. An email sent Sunday to organizers threatened several speakers’ lives and claimed that pipebombs had been planted on the site. No further information was provided on the pipebomb threat; no one was injured. \n\nCuban, who went on the stump for Kamala Harris in the presidential election, insisted he’s not a Republican or a Democrat, but “leans right fiscally, a little bit left socially.”\n\nHe praised Trump’s astounding “sales” skills in politics. And he mocked Democrats’ sales challenges. He complained that Democrats right now couldn’t sell $1 for 50 cents even after convening a committee to try to figure out how to do it — while Trump could sell a dollar for $2. \n\nThe problem is that Trump stumbles on “execution,” Cuban added.\n\nHis salesmanship is “what’s made Donald Trump so successful,” said Cuban. “He’s able to put out messages, and people see in him what they want to see. But that doesn’t mean he can execute,” Cuban added. “He’s still in the salesmanship phase, and that’s where we are right now [and] ... people are wondering: ‘Can you execute on this?’”\n\nDespite some cracks in his support, his backers are still reluctant to hit out — yet, said Cuban. ‘It’s like when “you marry somebody that your family hates. For at least the first three to six months, even if you find bodies [buried] in the basement, you’re not admitting to your family that you made a mistake.”\n\nBut Trump and Musk’s stumbles are a “gift to the Democrats,” said Cuban. And Trump’s problems are going to continue, not only because of Musk but because the president with a “few exceptions” has not “picked the best people” for his Cabinet and other positions, he added to laughter from the audience.\n\nCuban suggested Democrats up their “sales” game with intriguing bills. Even if they can’t pass, proposed legislation can make power points, he noted.\n\nCuban suggested, for example, that the Democrats could call for prosecution within a certain amount of time for any fraud uncovered by the Department of Government Efficiency. But if the DOGE accusations prove false, Musk and his staff would be liable for libel and slander.\n\nThat way, Cuban added: “Elon’s gotta either put up or shut up.”\n\nMusk could not immediately be reached for comment by The Independent.\n\nWhite House communications director Steven Cheung derided the summit on his government X account as the “Cuck Convention.” The word “cuck,” a favorite of macho far-right militant groups like the Proud Boys, describes a man who watches his wife have sex with other men.","summary":"‘He’s like, I’ll be rich no matter what,’ Shark Tank entrepreneur tells political conference crowd","url":"https://www.independent.co.uk/news/world/americas/us-politics/mark-cuban-elon-musk-trump-doge-b2705577.html","image":"https://static.independent.co.uk/2022/04/22/03/newFile.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/1vO7MlHs-OhrQWqOm.mp4","publish_date":"2025-02-27 03:55:46","author":"Mary Papenfuss","authors":["Mary Papenfuss"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.167},{"id":294761488,"title":"US Soldier Linked to AT&T Hack Accused of Contacting Spy Agency","text":"Article content\n\n(Bloomberg) — A 21-year-old US soldier accused of trying to sell AT&T call records of Donald Trump’s family members also attempted to pawn off sensitive data to a foreign intelligence organization, according to court documents.Cameron Wagenius pleaded guilty earlier this year to unlawfully posting and transferring confidential AT&T phone records, including of Kamala Harris and FBI informants. The US government has also accused him of attempting to extort AT&T Inc., asking for $500,000 to delete those confidential records in November last year while on active duty with the US army, stationed at Fort Cavazos.The records were stolen as part of a wider cyber campaign against Snowflake customers in the summer of 2024, which involved at least 10 organizations including Live Nation Entertainment Inc. and Advance Auto Parts Inc.According to a memorandum filed on Wednesday by the US government which asked a judge to keep Wagenius detained, the extortion was “only a small part of Wagenius’ malicious activity.” In November — the same month he posted the AT&T data for sale — Wagenius allegedly communicated with an email address he believed belonged to an unidentified country’s military intelligence service in an attempt to sell stolen information, prosecutors allege. Days later, he Googled “can hacking be treason.”\n\n“Wagenius conducted online searches about how to defect to countries that do not extradite to the United States and that he previously attempted to sell hacked information to at least one foreign intelligence service,” according to the memorandum. Wagenius also carried out Google searches about the Russian embassy in Washington, D.C and “U.S. military personnel defecting to Russia,” prosecutors added. Since his arrest, prosecutors have found evidence on Wagenius’ devices indicating that he had access to thousands of stolen identification documents, including passports and driver’s licenses, as well as access to large amounts of cryptocurrency. His co-conspirator, Connor Moucka, is expected to appear in an extradition hearing in Canada on Friday, on charges of stealing AT&T and other Snowflake customer data. \n\n Share this Story : US Soldier Linked to AT&T Hack Accused of Contacting Spy Agency Copy Link Email X Reddit LinkedIn Tumblr","summary":"Soldier stationed in Texas Googled how to defect to Russia","url":"https://financialpost.com/pmn/business-pmn/us-soldier-linked-to-att-hack-accused-of-contacting-spy-agency","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/thumbnail_thumbnail_potatoes-in-bloom-6.jpg?quality=5&strip=all&w=100&sig=Re0ZVlpDHAxbag1fUVqEhA","video":null,"publish_date":"2025-02-27 03:22:25","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.225},{"id":294762436,"title":"Jeff Bezos Shares Early Morning Note With The Washington Post Team, Opinion Page Head David Shipley Quits","text":"Jeff Bezos, billionaire owner of The Washington Post, announced a significant shift in the newspaper's opinion sections on Wednesday, outlining a new editorial direction centered on libertarian principles. The decision comes just four months after Bezos's controversial move to cancel a presidential endorsement of Vice President Kamala Harris, which triggered widespread backlash and led to hundreds of thousands of subscription cancellations.\nOpinions Editor Resigns\nDavid Shipley, the Post’s Opinions Editor, resigned in response to the announcement. Shipley, who joined the paper from Bloomberg Opinions in 2022 at Bezos’s invitation, chose to step down rather than oversee the revamped opinion section.\n\"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,\" Bezos wrote in a memo to staffers. \"We'll cover other topics too, of course, but viewpoints opposing those pillars will be left to be published by others.\"\nFor decades, newspaper opinion sections have traditionally featured a diverse range of viewpoints. The term \"op-ed\" itself stems from articles published \"opposite the editorial page,\" often providing perspectives that contrasted with the paper's editorial stance. However, Bezos framed this long-standing approach as outdated in the digital age.\n\"There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views,\" Bezos wrote. \"Today, the internet does that job.\"\nShock and Resignation Inside the Newsroom after Jeff Bezos Directive\nThe announcement sent shockwaves through the newsroom, prompting internal discussions and resignations. During a closed-door meeting with opinion writers, Shipley expressed uncertainty about the paper’s future direction.\n\"He said he wanted a broader, pluralistic place, but Bezos sought a focused [opinion] report,\" an attendee, speaking on condition of anonymity, revealed.\nBezos defended the decision in his memo, writing, \"I am of America and for America, and proud to be so. And a big part of America's success has been freedom in the economic realm and everywhere else.\"\nConcerns over editorial independence quickly surfaced. Senior news editors raised questions at a Wednesday meeting, prompting Executive Editor Matt Murray to reassure staff that Bezos had not signaled any intention to interfere with news coverage. \"The independent and unbiased work of The Post's newsroom remains unchanged, and we will continue to pursue engaging, impactful journalism without fear or favor,\" Murray wrote in a subsequent memo to the newsroom.\nVeteran Journalists Sever Ties Over Jeff Bezos Interference\nThe changes have prompted several high-profile departures. David Maraniss, an associate editor with more than four decades at the paper, announced on Bluesky that he would no longer write for the Post as long as Bezos remains its owner.\n\"One pernicious step after another, Bezos encroached on the Post editorial policy,\" Maraniss wrote. \"Today he seized it fully. The old Washington Post is gone.\"\nFormer senior managing editor Cameron Barr also severed ties, writing on LinkedIn that Bezos's changes represented \"an unacceptable erosion of its commitment to publishing a healthy diversity of opinion and argument.\"\nA Stark Contrast from First Trump Term\nThe libertarian pivot marks a stark departure from the Post's editorial stance during former President Donald Trump's first term. Under Bezos’s ownership, the newspaper adopted the motto Democracy Dies in Darkness, winning Pulitzer Prizes for its coverage of Russian interference in the 2016 election and the January 6 attack on the U.S. Capitol.\nHowever, Bezos’s business empire, including Amazon, maintains billions of dollars in contracts with the federal government. With regulators in Trump's second term signaling a more aggressive approach, some have questioned whether those interests influenced the Post's editorial shift.\nBezos’s decision in October to kill the Harris endorsement ignited widespread criticism, leading to the resignation of editorial writers and the loss of more than 300,000 digital subscriptions within days. While the Post has regained some subscribers in recent weeks, the fallout from the editorial overhaul continues to ripple through the organization.\nAlso Read: Donald Trump Calls Putin ‘Very Smart, Cunning’, Says He Must Make Concessions","summary":"Jeff Bezos’s decision to steer The Washington Post’s opinion section toward libertarian principles has sparked internal upheaval, resignations, and fears of editorial compromise. The shift, announced just months after Bezos canceled the paper&#8217;s endorsement of Kamala Harris, marks a stark break from the Post’s tradition of pluralistic commentary.","url":"https://www.newsx.com/world/jeff-bezos-shares-early-morning-note-with-the-washington-post-team-opinion-page-head-david-shipley-quits/","image":"https://www.newsx.com/wp-content/uploads/2025/02/Jeff-Bezos-The-Washington-Post-Washington-Post-Opinion-Page-Head-David-Shipley-Executive-Editor-Matt-Murray-trump.webp","video":null,"publish_date":"2025-02-27 03:21:34","author":"Zubair Amin","authors":["Zubair Amin"],"language":"en","source_country":"in","sentiment":0.265},{"id":294756130,"title":"Miranda Devine: Pitiful lefty White House press corps whines about access after barely making a peep when Biden was AWOL in office","text":"The White House press corps has a hide complaining about access to the president after it raised barely a peep in protest at Joe Biden being practically AWOL his entire presidency.\n\nBiden didn’t even hold a press conference until two months in. \n\nThe handful of press conferences he did conduct were a bad joke, in which he would take three or four questions from preselected reporters, whose names and photographs were printed on a card.\n\nYet he still got fawning praise from the Washington media. \n\nThe worst insult they could muster was “boring,” but The Baltimore Sun even spun that into “Biden’s superpower.”\n\nIn the absence of access to the president or real news to report, the pool contented itself with secondhand stories about Biden family life, doled out like party favors by unnamed White House staff.\n\n“President Biden has expressed a preference for a fire built in the Oval Office fireplace, and sometimes adds a log himself to keep it going,” was an example of CNN’s hard-hitting analysis.\n\nTrump, on the other hand, has taken more than 1,000 questions from reporters and is available every day.\n\nHe invites reporters into his suite on Air Force One, conducts impromptu press conferences in the Oval Office while signing executive orders, holds regular press conferences that exhaust every question.\n\nWednesday, he invited the media to observe his first Cabinet meeting for about an hour.\n\nIt’s the most transparent presidency in history, and yet The New York Times is comparing it to the Kremlin.\n\nSnarky Times reporter\n\n“Having served as a Moscow correspondent in the early days of [Vladimir] Putin’s reign, this reminds me of how the Kremlin took over its own press pool and made sure that only compliant journalists were given access,” Times reporter Peter Baker snarked on X.\n\nTheir latest Russia-hoax furor erupted after White House press secretary Karoline Leavitt announced she was sidelining the White House Correspondents’ Association — an outdated and unrepresentative group of legacy media outlets — from its previously privileged role of determining which media outlets can participate in the small press pool that takes turns covering presidential events.\n\nThe WHCA reacted to this savage diminution of its power with hyperbolic claims: “This move tears at the independence of a free press in the United States.”\n\nNo it doesn’t. \n\nThe WHCA is a private club that wants to keep control of the narrative, just like it did in the first Trump administration when derogatory stories about the president were amplified, hoaxes were treated like Pulitzer material and anything else was ignored.\n\nWhere was the WHCA when the Obama administration was spying on then-Fox reporter James Rosen’s email and phone records?\n\nIt acts like a cartel, ridiculing and ostracizing conservative voices. \n\nRemember Chanel Rion from OANN? \n\nThe WHCA tried to banish her from the White House. \n\nShe had to bring her own folding deck chair and sit in the back of the briefing room.\n\nOr Simon Ateba, the African journalist who got offside with Biden’s hopeless press secretary Karine Jean-Pierre? \n\nThe WHCA rescinded his membership and would not even let him buy a ticket to its annual partisan dinner, where WHCA officeholders canoodled repulsively onstage with Biden and Kamala Harris.\n\nIn Trump’s first term, by contrast, the WHCA invited a nasty comedian to trash the appearance of Sarah Huckabee Sanders, his then-press secretary.\n\nDespite the kid-glove treatment from the Washington press corps, Biden laughed in their faces.\n\n“In a lot of ways, this dinner sums up my first two years in office,” he told assembled sycophants at the WHCA dinner in 2023. \n\n“I’ll talk for 10 minutes, take zero questions and cheerfully walk away.”\n\nBiden treated the Washington press corps and the traveling press pool like garbage. \n\nHe reveled in their powerlessness, smirking contentedly as his wranglers yelled at them and forced them out after a photo opportunity.\n\nPerhaps they were suffering from Stockholm Syndrome because they put up with it for four long years.\n\nMaddow’s hard life\n\nAt least it was an easy life. \n\nRachel Maddow is not the only leftist complaining about how hard she has to work for her $25 million now that Trump is back as a veritable scoop machine. \n\nFor Trump’s first 100 days, MSNBC has brought her back five days a week now instead of one, and she whines about “the chaotic cadence of there being no normal days.” Easier when Biden napped through his presidency.\n\nIt’s unlikely that any journalist not under the strict control of the narrative police would have ignored Biden’s obvious cognitive decline over the past four years and played along with the obvious ruse that all that ailed the oldest president in history was a childhood stutter.\n\nRemember CNN’s Jake Tapper rudely talking over Lara Trump and trying to shame her for “mocking [Biden’s] stutter”? \n\nAll she said was that she felt “bad” for Biden because he was “struggling at times on stage and it’s concerning to a lot of people that this could be the leader of the free world.”\n\nInstead of acknowledging that truth, evident to anyone with eyes, Tapper scolded Trump’s daughter-in-law and told her she had “no standing to diagnose somebody’s cognitive decline.”\n\n“How do you think it makes little kids with stutters feel when they see you make a comment like that?”\n\nTapper’s ‘cover-up’\n\nWell, how the worm turns. \n\nHaving been complicit with the rest of the establishment media in covering up Biden’s cognitive decline for four years, now Tapper is writing a book about the “cover-up” of Biden’s cognitive decline.\n\nWhen the New York Post ran “Meanderer in Chief” on the cover over a photograph of Biden wandering around the G7 in Italy like a defective Roomba, we were accused of a new crime: “cheapfakes.”\n\nIt was obvious back in the 2020 Democratic primaries in Iowa and New Hampshire that Biden was cognitively shot. \n\nIn March 2020 he mistook his wife for his sister. \n\nHe forgot the words of the Declaration of Independence mid-sentence, substituting “the thing”for God.\n\nA year later, while announcing two new women generals, Biden forgot the name of his secretary of defense, Lloyd Austin, as well as the name of the building where Austin works — the Pentagon.\n\nHe was often spotted wandering around the White House lawn, searching for the entrance to his office.\n\nHe’d get lost on stage. \n\nHe wasn’t even able to read from the teleprompter properly.\n\nYet the Washington press corps just played along with the farce that this was a normal president doing normal things.\n\nSo spare us the histrionics. \n\nAfter eight years of Fake News and cover-ups, the WHCA and its members have lost the right to pose as guardians of free speech.","summary":"The White House press corps has a hide complaining about access to the president after it raised barely a peep in protest at Joe Biden being practically AWOL his entire presidency.","url":"https://nypost.com/2025/02/26/opinion/pitiful-lefty-white-house-press-corps-whine-about-access-after-barely-making-a-peep-when-biden-was-awol-in-office/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/VCIT12.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-27 03:06:06","author":"Miranda Devine","authors":["Miranda Devine"],"language":"en","category":"politics","source_country":"us","sentiment":-0.056}]}