{"offset":0,"number":50,"available":581,"news":[{"id":338025840,"title":"Trump enters his ‘Golden Age’ as bill passage caps long list of ‘remarkable’ accomplishments — wowing even critics","text":"WASHINGTON — President Trump is at the height of his political power following Thursday’s passage of his “One Big Beautiful Bill Act” – capping a remarkable two-week streak of domestic and foreign policy feats that even Democrats are calling impressive.\n\nTrump, 79, will sign the bill fulfilling his major campaign pledges – including to cut taxes on tips, overtime and Social Security benefits – at a pre-fireworks Independence Day party on the White House lawn.\n\nB-2 stealth bombers will fly over the celebration in recognition of their role in the Trump-ordered June 21 US airstrikes on Iran’s nuclear program, which was followed two days later by an equally unprecedented Trump-brokered cease-fire between Israel and Iran.\n\nThe commander in chief, riding high on that diplomatic coup, strong-armed NATO nations at the alliance’s annual conference to boost military spending to 5% of their GDP by 2035, after complaining for years that US allies were freeloading off American taxpayers.\n\nHe returned home to good news from the Supreme Court, which handed him wins on deporting illegal immigrants to third countries and restricting nationwide injunctions by district court judges — while CBS’s parent company agreed to fork over $16 million for deceptively editing an interview last year with Trump’s election rival, then-Vice President Kamala Harris.\n\nOver the weekend, Canada scrapped a digital services tax against US internet giants under pressure from Trump, followed days later by the University of Pennsylvania stripping honors from transgender swimmer Lia Thomas and the announcement of a pending trade deal with Vietnam – as major stock market indices notched record highs and illegal border crossings hit new record lows.\n\nThe Big Beautiful Bill Act also includes $25 billion in funding for Trump’s “Golden Dome” missile defense program, spends more on immigration enforcement, allows tax deductions for domestic car loan interest and — in a major win for New York and New Jersey Republicans — lifts the cap on the amount of state and local taxes that can be deducted from federal returns to $40,000 from the prior $10,000.\n\n“I didn’t vote for him and I’m not always aligned with his approach, but his success on the domestic and international front in such a compressed period of time is nothing short of remarkable and it’s all due to his impressive use of political and executive power,” Michael LaRosa, a former Biden White House spokesman, told The Post.\n\n“The last two weeks of his presidency are a throwback to the strong leadership styles reminiscent of LBJ or Reagan, both of whom engendered such personal and political loyalty within their parties, that they could muscle through historic success out of sheer goodwill.”\n\nA different Biden White House official, who served all four years in the Democratic administration, said Trump has “hit a stride” and marveled at his ability to pressure holdout Republicans into voting for the major legislation despite centrist reluctance over Medicaid and SNAP cuts and conservative demands for deeper spending reductions.\n\n“You voted for it because you’re scared of the guy. And frankly, that’s impressive, given that Biden never invoked fear in anyone,” the former Biden aide said of the GOP holdouts, all but two of whom eventually backed the bill.\n\n“Successful campaigns and successful operations excel when they are provided clarity in mission from their leader — in this case President Trump,” said Chris LaCivita, who ran Trump’s 2024 campaign alongside current White House chief of staff Susie Wiles.\n\n“Elections matter because you now have one of the greatest realignments in political history happening and being backed up by policy. If you work, pay taxes and aspire for a better tomorrow, you are voting Republican,” LaCivita said, describing the working-class reforms encompassed in the bill, which also made permanent Trump’s 2017 tax cuts to all brackets. \n\n“If you’re dour, rich and generally hold people that don’t agree with [you] in contempt – and you don’t know what a woman is – you’re a Democrat. This transformation in political power is because of the leadership and determination of one person — President Trump.”\n\nKellyanne Conway, senior counselor to Trump during his first term, declared “these have been the most consequential two weeks of Trump’s second term, as he makes peace deals, trade deals and tax deals, everywhere all at once.”\n\n“And he’s just getting started. America is in its Golden Age,” Conway said.\n\n“The snark and bark of his petty critics is muted and meaningless. If you can’t beat him, join him. Sit back and enjoy a nation that is sovereign, secure and prosperous. We are the envy of the world and Trump is just getting started.”\n\n“President Trump is on a roll,” said Vivek Ramaswamy, the former Republican presidential candidate and current contender for Ohio governor. “By 2026, it will be up to the states to lead the way on other critical fronts, like solving the educational achievement crisis in our country.”\n\nTrump’s trail of triumphs precedes a significant deadline next week for the sealing of bilateral trade deals to avert “reciprocal” levies on foreign countries — which could dramatically increase US consumer costs and drive up inflation, which has cooled this year.\n\nTrump has given countries until July 9 to reach agreements to avert high rates, but thus far has only announced the outlines of deals with China, the UK and Vietnam, along with a “roadmap” with India.\n\nPublicly, the president has brushed off concern about the rate of dealmaking and said he will decree new rates when next week instead of pushing the deadline.\n\nTrump also has thus far failed to cajole Federal Reserve Chairman Jerome Powell into lowering interest rates — causing the cost of homes, credit card balances and loans to remain high despite inflation nearing the Fed’s target of 2%.\n\nTrump has said he will allow Powell to remain in his role until his term expires next May, and that he intends to appoint a replacement who will promptly drop rates by at least 2 percentage points.\n\nBut for now, Trump’s series of successes offer momentum – with polling showing he’s getting credit for a strong economy, typically a top concern of voters, ahead of next year’s midterm election, which will determine whether the later half of his term is plagued by probes by congressional Democrats.\n\n“It’s becoming increasingly evident that Donald Trump is the dominant political figure so far of the 21st Century,” said American University professor Leonard Steinhorn, who teaches public communication and history courses.\n\nBut Steinhorn added that Trump’s administration contrasts with other powerful American presidents who – at least fleetingly – held broad-based national support. \n\n“As dominant as Donald Trump is today, he’s especially dominant over the Republican Party … But let’s not forget that he presides over half a country that believes that he is taking us on a very bad path, and to many people on a path to authoritarian or autocratic rule.”\n\nLaRosa, the former Biden White House aide, said he hopes that fellow Democrats will learn from Trump’s unexpected political abilities.\n\n“Even though I may disagree with him substantively, his effective use of power as an executive and party leader, despite congressional margins or ideological diversity, is something to admire for those of us who are practitioners of politics,” LaRosa said.\n\n“Instead of reflexively ridiculing his style and the fact that he uses the latitude he’s been afforded so skillfully, Democrats should learn from him and replicate it the next time we have the keys.”","summary":"President Trump is at the height of his political power following Thursday's passage of his “One Big Beautiful Bill Act”.","url":"https://nypost.com/2025/07/03/us-news/trump-in-midst-of-his-own-golden-age-as-list-of-remarkable-accomplishments-wows-critics/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/107571370.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/NNQR2YNT-RyIcpnTz.mp4","publish_date":"2025-07-03 22:40:33","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","source_country":"us","sentiment":0.39},{"id":338021160,"title":"World News | MAGA Faithful Cheer Trump for Pausing Ukraine Weapons After Bristling at Iran Strikes","text":"Washington, Jul 3 (AP) President Donald Trump is getting praise from his most ardent supporters for withholding some weapons from Ukraine after they recently questioned the Republican leader's commitment to keeping the US out of foreign conflicts. This week's announcement pausing deliveries of key air defence missiles, precision-guided artillery and other equipment to Ukraine comes just a few weeks after Trump ordered the US military to carry out strikes on Iranian nuclear facilities. Also Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign. Bombing those sites in Iran had some hardcore supporters of the \"Make America Great Again\" movement openly questioning whether Trump was betraying his vow to keep America out of “stupid wars\" as he inserted the US military into Israel's conflict with Tehran. With the Ukraine pause, which affects a crucial resupply of Patriot missiles, Trump is sending the message to his most enthusiastic backers that he is committed to following through on his campaign pledge to wind down American support for Ukraine's efforts to repel Russia, a conflict he has repeatedly described as a costly boondoggle for US taxpayers. Also Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official. “The choice was this: either prioritize equipping our own troops with a munition in short supply (and which was used to defend US troops last week) or provide them to a country where there are limited US interests,” Dan Caldwell, who was ousted as a senior adviser to Defense Secretary Pete Hegseth, posted on X. Caldwell publicly worried before the Iran strikes that US involvement could incite a major war and ultimately cost American lives. Far-right influencer Jack Posobiec, another ardent MAGA backer, warned as Trump weighed whether to carry out strikes on Iran last month that such a move “would disastrously split the Trump coalition.\" He was quick to cheer the news about pausing some weapons deliveries to Ukraine: “America FIRST,\" Posobiec posted on X. Trump weighed in on the pause for the first time Thursday, justifying the move as necessary. He said former President Joe Biden “emptied out our whole country giving them weapons, and we have to make sure that we have enough for ourselves.” “We've given so many weapons,” Trump told reporters before boarding Air Force One for a flight to Iowa. He added that “we are working with them and trying to help them.” Meanwhile, White House and the Pentagon officials said the move is consistent with Trump's campaign pledge to limit US involvement in foreign wars. “The president was elected on an America first platform to put America first,” Pentagon chief spokesman Sean Parnell said. At the same time, the decision is stirring anxiety among those in the more hawkish wing of the Republican Party. Many are flummoxed by Trump's halting the flow of US arms just as Russia accelerates its unrelenting assault on Ukraine. Rep. Brian Fitzpatrick, a Pennsylvania Republican who hails from a district that former Vice President Kamala Harris won in 2024, wrote to Trump and the Pentagon on Wednesday expressing “serious concern” about the decision and requesting an emergency briefing. “We can't let (Russian President Vladimir) Putin prevail now. President Trump knows that too and it's why he's been advocating for peace,” Rep. Michael McCaul, a Texas Republican, wrote on X. “Now is the time to show Putin we mean business. And that starts with ensuring Ukraine has the weapons Congress authorized to pressure Putin to the negotiating table.” Trump spoke by phone with Putin on Thursday, the sixth call between the leaders since Trump's return to office. The leaders discussed Iran, Ukraine and other issues but did not specifically address the suspension of some US weapons shipments to Ukraine, according to Yuri Ushakov, Putin's foreign affairs adviser. Zelenskyy said in Denmark after meeting with major European Union backers that he hopes to talk to Trump in the coming days about the suspension. The administration says it is part of global review of the US stockpile and is a necessary audit after sending nearly USD 70 billion in arms to Ukraine since Putin launched the war on Ukraine in February 2022. The pause was coordinated by Pentagon policy chief Elbridge Colby. Colby, before taking his position, spoke publicly about the need to focus US strategy more on China, widely seen as the United States' biggest economic and military competitor. At his Senate confirmation hearing in March, he said the US doesn't have a “multi-war military.” “This is the restrainers like Colby flexing their muscle and saying, Hey, the Pacific is more important,'” said retired Navy Adm. Mark Montgomery, an analyst at the Foundation for the Defense of Democracies. Backers of a more restrained US foreign policy say the move is necessary, given an unsettled Middle East, rising challenges in Asia and the stress placed on the US defence industrial complex after more than three years of war in Ukraine. “You're really coming up to the point where continuing to provide aid to Ukraine is putting at risk the US ability to operate in future crises,” said Jennifer Kavanagh, a senior fellow and director of military analysis at Defense Priorities. “And you don't know when those crises are going to happen.\" \"So you have to be a little bit cautious,” she added. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump is getting praise from his most ardent supporters for withholding some weapons from Ukraine after they recently questioned the Republican leader's commitment to keeping the US out of foreign conflicts.","url":"https://www.latestly.com/agency-news/world-news-maga-faithful-cheer-trump-for-pausing-ukraine-weapons-after-bristling-at-iran-strikes-6971743.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-03 22:32:07","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.024},{"id":338026552,"title":"How Podcasts Became Hollywood’s Next Retention Strategy | Charts","text":"Last month, the HFPA announced a new Golden Globe category dedicated exclusively to podcasts, starting in 2026. In recent years, podcasts have firmly established themselves within the Creator Economy. From journalists and comedians to athletes and actors, creators from diverse backgrounds are utilizing the format to create a community by cultivating their own loyal audiences.\n\nMajor media companies have taken note. Spotify and Amazon Music have built out their libraries with exclusive content, while Netflix is showing early signs of investing more heavily in the space. These strategic moves are far from incidental; the podcast format has proven effective at both attracting brand partnerships and elevating visibility, especially among talent. \n\nIn the meantime, streaming platforms have curated content around the podosphere, such as Hulu’s “Call Her Daddy” docuseries, which focuses on Alex Cooper, one of the most popular podcast hosts who has already had guests ranging from Paris Hilton to Kamala Harris. \n\nConsidering the podcasts from Spotify’s U.S. charts, different hosts reached exceptional peak demand levels in the U.S., according to Parrot Analytics, an achievement earned by less than 1% of all tracked talent, regardless of profession or nationality. This list reflects a broad spectrum of public figures, including political commentators, journalists, comedians and actors. \n\nWhile true crime, interviews and fiction remain staples, a growing podcast subgenre is the “behind-the-scenes” content, which could be particularly relevant to entertainment platforms like Netflix. These shows, hosted by original cast members, revisit beloved series with anecdotes and insider stories. The popularity of this category underscores the long-tail value of high-engagement IP.\n\nShows like “The Office,” “Glee,” “One Tree Hill” and “The O.C.” are examples of this format, serving as the central theme for podcasts hosted by their original cast members. “Office Ladies,” for instance, is hosted by Jenna Fischer and Angela Kinsey, who played Pam and Angela on “The Office.” \n\nAccording to Parrot Analytics’ Streaming Economics model, the TV show generated more than an estimated $120 million in streaming revenue contribution only in the UCAN (United States and Canada) region over the past five years, a notable figure considering its final episode aired in 2013. This sustained value highlights the wide range of opportunities that a multi-million-dollar IP can continue to unlock over time.\n\nThis strategic opportunity extends beyond nostalgia. High-profile actors like Amy Poehler and Julia Louis-Dreyfus are turning to podcasts as a space for creative expansion, far from the traditional routes once limited to late-night talk shows or guest appearances. From a streaming platform perspective, these ventures could offer more than just visibility. \n\nConsidering the performance of “Parks and Recreation” and “Seinfeld,” popular series led by Poehler and Louis-Dreyfus, respectively, both demonstrated high retention value on streaming platforms. On Peacock, 80% of the users associated with “Parks and Recreation’s” revenue contribution in the UCAN region over the last four years were retained users. “Seinfeld” performed even higher, with over 90% of its equivalent users being retained users on Netflix. These numbers reflect not only the enduring appeal of legacy titles, but also the audience stickiness that comes with familiar, beloved talent.\n\nIn this context, podcasts can serve as a powerful retention lever, either by leveraging pre-existing communities from digital natives like Alex Cooper, reigniting fan engagement with iconic IPs, or by offering new creative vehicles for actors already associated with high-performing content. As streaming platforms navigate an increasingly competitive landscape, podcasts might be a possibility to extend the lifecycle of premium IP, and keep subscribers meaningfully engaged within their content ecosystems.","summary":"Parrot Analytics data unpacks how talent-driven behind-the-scenes podcasts are extending IP value\n\n\nThe post How Podcasts Became Hollywood&#8217;s Next Retention Strategy | Charts appeared first on TheWrap.","url":"https://www.thewrap.com/how-podcasts-became-hollywoods-next-retention-strategy-charts/","image":"https://www.thewrap.com/wp-content/uploads/2025/07/office-ladies-podcasts.jpg","video":null,"publish_date":"2025-07-03 22:31:22","author":"Jenna Fischer,Lucas Mascarenhas","authors":["Jenna Fischer","Lucas Mascarenhas"],"language":"en","category":"politics","source_country":"US","sentiment":0.771},{"id":338012458,"title":"Trump-Endorsed MAGA Candidate for Karoline Leavitt’s Role Revealed – Here’s Why Her History Blocked Her Selection","text":"PRESIDENT Donald Trump might have suggested someone else for Karoline Leavitt’s position, according to a bombshell report.\n\nBefore 27-year-old Leavitt stepped up as the White House press secretary, there were reports that Trump considered a different candidate known for their controversial right-wing views.\n\nThe president initially considered MAGA enthusiast Laura Loomer, 32, for the role, according to a new book written by journalists Josh Dawsey, Tyler Pager, and Isaac Arnsdorf.\n\n2024: How Trump Retook the White House and the Democrats Lost America outlines Trump’s journey to reclaiming the presidency for a second term, as reported by the Daily Mail.\n\nWhen Trump considered who would face the media in his White House briefing room, he reportedly had Loomer, a conservative influencer known for spreading conspiracy theories, at the top of his list.\n\n“Many of Trump’s advisers viewed Loomer as too-conspiracy-minded and pugilistic, but he liked her,” the book said.\n\nThe book also says Trump once asked his advisers, “Is she too fringe to be press secretary?”\n\nTrump’s advisers clearly talked him down from the decision as he announced Leavitt would be taking on the role after election day.\n\nLoomer previously said she wasn’t officially joining Trump’s team and would only join him at certain events “as a guest.”\n\nSome of Trump’s allies distanced themselves from Loomer due to her inflammatory rhetoric, including when she posted a vile “good riddance” message after a Democratic congresswoman died last year.\n\nTrump publicly disagreed with Loomer after she launched racist attacks on Kamala Harris during her presidential run against Trump last year.\n\nDuring Harris’ campaign, Loomer wrote that if Harris beat out Trump for president, “the White House will smell like curry & White House speeches will be facilitated via a call center.”\n\nHarris is biracial. Her father is a Black Jamaican-born economist and her mother was an Indian-born scientist.\n\nTrump wrote on Truth Social at the time that he disagreed with Loomer’s statements, but didn’t clarify which comments he denied.\n\nHowever, Trump has maintained a closer relationship with Loomer throughout his presidency.\n\nSECURITY ‘RECOMMENDATIONS’\n\nBack in April, she encouraged Trump to fire National Security Council officials after the Signal scandal where a journalist was mistakenly added to a group chat where security officials discussed military plans.\n\nAfter an Oval Office meeting with Trump and top White House officials, Loomer tweeted that she reported “disloyal” staffers to the president.\n\nTrump denied that Loomer had anything to do with the firings.\n\nHe then called her a “very good patriot and a very strong person.”\n\nThe president then told reporters that Loomer had only made suggestions.\n\n“Sometimes I listen to those recommendations, like I do with everybody,” Trump said at the time. \n\n“She’s usually very constructive. She recommended certain people for jobs.”\n\nTrump announced Leavitt’s appointment in November after she worked as the national press secretary throughout his 2024 campaign.\n\n“Karoline is smart, tough, and has proven to be a highly effective communicator,” Trump said in a statement at the time.\n\n“I have the utmost confidence she will excel at the podium and help deliver our message to the American people.”\n\nThe Trump administration didn’t immediately return The U.S. Sun’s request for comment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPRESIDENT Donald Trump might have suggested someone else for Karoline Leavitt&#8217;s position,&#8230;\n\n\nThis Post: Trump-Endorsed MAGA Candidate for Karoline Leavitt&#8217;s Role Revealed &#8211; Here&#8217;s Why Her History Blocked Her Selection first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-endorsed-maga-candidate-for-karoline-leavitts-role-revealed-heres-why-her-history-blocked-her-selection/","image":"https://internewscast.com/wp-content/uploads/2025/07/MAGA-firebrand-who-Donald-Trump-touted-for-Karoline-Leavitts-job.jpg","video":null,"publish_date":"2025-07-03 21:57:57","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.064},{"id":338006456,"title":"Congress passed no tax on tips in Trump's 'big, beautiful bill.' Here's how it works","text":"Tipped workers in the U.S. could see significant changes to their taxes after Congress approved President Trump's legislative agenda on Thursday. This week, the GOP-controlled Senate and House narrowly passed the One Big Beautiful Bill Act — a massive spending and tax package that creates limited and temporary tax exemptions for tips, among other tax cuts. \n\nOnce the provision goes into effect, workers will be able to deduct $25,000 in tips annually from their taxable income. After that, tips will be federally taxed. \n\n\"If you look at the data on tipped income, that would cover the majority of individuals earning tips in the United States,\" said Garrett Watson of the Tax Foundation, an organization that advocates for simplifying the tax code in pursuit of economic growth. \"So, it's still pretty generous for most workers.\" \n\nIf a worker makes more than $150,000 a year, though, their tipped income will start to be taxed. \n\n\"That helps to sort of carve out some of the very high earners who may be incentivized to recharacterize their income tips inappropriately,\" Watson said. \n\nA chief concerns among tax experts during the campaign was that hedge fund managers and lawyers would turn themselves into \"tipped workers\" in order to skirt federal taxes altogether. \n\nThe package also restricts tax-free tips to worker at \"an occupation which customarily and regularly received tips\" — but the text does not define these jobs individually. \n\n\"It will ultimately fall, at the end of the day, to Treasury and the IRS administers and for this consistent with the language,\" Watson said. \n\nThe law, if not extended by Congress at a later date, will phase out at the end of 2028 — near the end of Trump's presidency.\n\nA political promise kept\n\nTrump campaigned heavily on the \"no taxes on tips\" policy during the 2024 presidential race. In June, Trump said he got the idea from a Las Vegas tipped-worker. By August, former Vice President Kamala Harris also campaigned on eliminating taxes on tips. \n\nWith the bill heading to the the president's desk, tipped workers could see their federal taxes shrink \"as soon as later this year\" depending on the speed of the IRS and Treasury Department, according to Watson.\n\n\"Especially going into next season, folks will see that adjustment in their taxes and a potential refund for any withholding on that tipped income,\" Watson said. \n\nThe \"no tax on tips\" idea had bipartisan supporters in Congress including Sen. Ted Cruz, R-Texas, Sen. Jacky Rosen, D-Nev., Rep. Vern Buchanan, R-Fla., and Rep. Steven Horsford, D-Nev.\n\nIn addition to disagreements over the specifics of the no-tax-on-tips policy, Democrats in Congress universally opposed the package, largely citing cuts to Medicaid. A government analysis predicts the law will strip health insurance from more than ten million Americans over the next decade.\n\n\"There is no spin for the human suffering they're causing,\" Horsford said in a statement Thursday. \"This is Robin Hood in reverse, and Republicans would be wise to remember that they won't have the last word here — the American people will, on Election Day.\"\n\nOn Monday, Horsford offered an amendment to make no taxes on tips permanent, instead of temporary. His amendment failed.\n\nBuchanan, though, celebrated the policy's passage. \"The One Big Beautiful Bill Act is the definition of promises made and promises kept,\" he said in statement to NPR Thursday. \n\nWhat does no taxes on tips mean for Americans? \n\nWhile it dominated the campaign and messaging from the Trump White House, Executive Director at the Yale Budget Lab Martha Gimbel — a former Biden administration official — said she doesn't think this law will have a significant impact on American workers and wages. \n\n\"Overall, tipped work is a really small sliver of the labor market,\" Gimbel said. \"It's about two and a half percent of all employment.\"\n\nMoreover, Gimbel said the policy won't affect the taxes of lower-income tipped workers. \n\n\"Very low income Americans are not going to benefit from this, largely because they already have little to no taxable income,\" Gimbel said. \"And so what you are largely seeing is that this provision will benefit people who are in the middle, upper-middle income brackets.\" \n\nGimbel said middle-class tipped workers and their employers will reap the most benefits and may take advantage of the new tax exemption. \n\n\"Let's take a hairdresser,\" Gimbel said. \"It would be very plausible to me that they might lower the cost of a haircut, but say that they expect the tips to go up. We'll see in years to come if that happens.\" \n\nFor Gimbel, the no tax on tips law should be taken in the broader context of the entire bill. \n\n\"Our analysis suggests that if your income is above 3.3 million, you get a tax cut of over 118 thousand,\" Gimbel said. \"And if you're in the bottom quintile, once SNAP and Medicaid cuts are taken into account, on average, you're losing $560.\"\n\n\"It's a really regressive bill and it's incredibly expensive,\" she said. \n\nWhat should tipped workers do now? \n\nTipped workers should wait for more guidance from the IRS and the Treasury Department, Watson said. \n\nOnce new guidance is released, tipped workers could update their W-4 withholdings to reflect the newly tax-exempt tips. Or workers can wait for a refund when they file in the spring. \n\n\"I do expect for a lot of folks to use software,\" Watson said. \"This will be quickly incorporated into next year's filing season and will be something that's that's asked for. But that's always something to watch for as well, just to make sure it's properly accounted for.\"\n\nWatson also noted that many tipped workers hold multiple jobs. He cautioned these workers that only $25,000 of their annual tips will be tax free — even across multiple tipped jobs.","summary":"Congress passed the tax cut and spending megabill with President Trump's legislative priorities which includes new tax exemptions for tipped hourly workers. But how will it work?","url":"https://www.npr.org/2025/07/03/g-s1-75790/no-tax-on-tips-congress-trump-big-beautiful-bill","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5799x3866+0+0/resize/5799x3866!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fca%2Ff8%2F9472c3aa4d4e9353168b86cef055%2Fap25025784744874.jpg","video":null,"publish_date":"2025-07-03 21:22:55","author":"Luke Garrett","authors":["Luke Garrett"],"language":"en","category":"politics","source_country":"us","sentiment":-0.07},{"id":338007472,"title":"Rural Clinic in Trump District Shuts Down as CEO Cites Medicaid Cuts","text":"A rural clinic located in a district President Donald Trump won by more than 50 points in the 2024 election is being forced to shut down as the CEO cites federal cuts to Medicaid as a driving factor.Newsweek reached out to the White House for comment via email on Thursday.Why It MattersThe clinic's closure comes as Republicans just shepherded a massive tax cuts and spending package through Congress that includes steep cuts to Medicaid and is expected to be signed into law by President Donald Trump on July 4.The One Big Beautiful Bill Act aims to deliver on Trump's biggest legislative priorities, including making permanent tax cuts that disproportionately benefit wealthy Americans and increasing funding for immigration enforcement.The tax cuts and immigration initiatives are being paid for largely by deep spending reductions to Medicaid and food assistance programs, which critics say will harm working-class, low-income and elderly Americans, especially those in red states.What To KnowCommunity Hospital, based in McCook, Nebraska, said this week that it will shut down a rural clinic it runs in the town of Curtis, which has about 900 people.\"Unfortunately, the current financial environment, driven by anticipated federal budget cuts to Medicaid, has made it impossible for us to continue operating all of our services, many of which have faced significant financial challenges for years,\" Community Hospital CEO Troy Bruntz said in a statement on Wednesday.More than 350,000 Nebraskans are Medicaid recipients as of the 2024 fiscal year. Both Community Hospital and Curtis Medical Center are located in Nebraska's 3rd Congressional District, which Trump carried by more than 50 points in the November general election.Trump won 76.3 percent of the general election vote in the district, compared to then-Democratic nominee and Vice President Kamala Harris's 22.5 percent.The Republican congressman who represents the district, Adrian Smith, voted to pass the One Big Beautiful Bill Act on Thursday.Smith celebrated the bill's passage, saying in a statement: \"Getting our work done on this legislation is a game changer for American workers, families, and our nation's long-term fiscal outlook. It not only prevents severe tax hikes and expands tax relief for family farms, small businesses, and middle-class Americans, it strengthens essential Farm Bill programs.\"What People Are SayingSmith said in his statement Thursday: \"[The bill] also ensures public assistance programs remain sustainable for the neediest Americans and empowers the Trump administration to keep our communities safe. I championed provisions in the package which will empower parents with educational choice, support biofuels producers and energy affordability, and boost growth for capital-intensive industries such as manufacturing. After years of work in the Ways and Means Committee and months of intense debate across both the House and the Senate, this bill will catalyze President Trump's plan to energize our economy and get our country back on track.\"What Happens NextThe Curtis Medical Center is expected to wind down its operations in the next few months. Trump is set to sign the One Big Beautiful Bill Act into law on Friday evening.This is a breaking news story. Updates to follow.","summary":"A rural clinic in a district Trump won by more than 50 points has been forced to shut down, with the CEO citing \"cuts to Medicaid.\"","url":"https://www.newsweek.com/nebraska-hospital-trump-district-closes-medicaid-cuts-2094487","image":"https://d.newsweek.com/en/full/2676788/donald-trump.jpg","video":null,"publish_date":"2025-07-03 21:19:03","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"us","sentiment":0.058},{"id":338012118,"title":"Joe Rogan Condemns Trump's Mass ICE Raids as 'Insane': 'Not Cartel Members, Just Construction Workers'","text":"On-again, off-again Donald Trump supporter Joe Rogan criticized the current administration's mass deportation raids during Tuesday's episode of \"The Joe Rogan Experience,\" labeling them \"insane.\"In a conversation with Jordanian-American entrepreneur Amjad Masad, Rogan discussed the Trump administration's response to the conflict in Gaza, which Masad described as \"disappointing.\"Masad added that he now feels more free to speak openly about the issue, crediting Elon Musk's acquisition of Twitter, now X, for shifting the tech industry's willingness to engage in political discourse.Rogan then asked Masad to imagine what would have happened if former Vice President Kamala Harris had won the presidency in 2024, prompting Masad to ask Rogan what he thinks about the Trump administration regarding \"what's happening now.\"\"It's insane,\" Rogan said in the episode, referring to the Trump administration targeting migrant workers. \"Not cartel members. Not gang members. Not drug dealers. Just construction workers, showing up in construction sites, raiding them.\"\"Or Palestinian students on college campuses,\" Masad added, referencing Rümeysa Öztürk, a Tufts student who was detained after she wrote an op-ed criticizing Israel.With the passage of Trump's \"big, beautiful bill\" on Thursday, deportation efforts are expected to ramp up once again. The legislation allocates an additional $150 billion to ICE and border enforcement, which exceeds the entire military budgets of most countries, including Italy, Brazil and Switzerland, Newsweek reported.Originally published on Latin Times","summary":"Podcast host and Trump supporter Joe Rogan condemned the administration's deportation raids during Tuesday's episode with tech entrepreneur Amjad Masad.","url":"https://www.ibtimes.com/joe-rogan-condemns-trumps-mass-ice-raids-insane-not-cartel-members-just-construction-workers-3777621","image":"https://d.ibtimes.com/en/full/4608909/rogan-v-trump-07032025-1.jpg","video":null,"publish_date":"2025-07-03 21:16:13","author":"Name Whose Voters","authors":["Name Whose Voters"],"language":"en","category":"politics","source_country":"US","sentiment":0.093},{"id":338005352,"title":"Chris Cuomo continues one-sided feud against AOC, suggests she’s to blame for ‘Big, Beautiful Bill’ passing","text":"NewsNation anchor Chris Cuomo continues to take personal swipes at Alexandria Ocasio-Cortez, this time suggesting that the progressive lawmaker is to blame for Donald Trump’s Medicaid-slashing megabill passing on Thursday.\n\nWith the “One Big, Beautiful Bill” passing the House after several Republican hardliners switched their votes overnight to clear a key procedural hurdle following some last-minute arm-twisting by Donald Trump, Ocasio-Cortez took aim at Sen. Lisa Murkowski (R-AK) for bemoaning her own vote for the legislation.\n\n“This isn’t about you,” the New York congresswoman tweeted on Thursday morning. “This is about the 17 million Americans whose health insurance you’re taking away.”\n\nOcasio-Cortez, who delivered an emotional House floor speech on Wednesday slamming the spending bill as a “deal with the devil,” further tore into Murkowski for urging House Republicans to vote against the legislation after paving the way for its passage in the Senate. \n\n“Americans are going to suffer. YOU admit that. And YOU supported it,” she concluded.\n\nCuomo, having spent the past couple of weeks raging about Ocasio-Cortez and the “dead” Democratic Party after Zhoran Mamdani defeated his brother Andrew in the New York City mayoral primary, took the opportunity to snipe at the congresswoman once more.\n\n“Dont [sic] forget we are in this situation because you took your party so far left that a majority in this country found your party unelectable,” he replied to her on X.\n\nWhile the Bronx lawmaker didn’t immediately react to Cuomo’s broadside, which has generally been the case amid the former CNN star’s one-sided war of words, other progressives pushed back against the cable news host’s online attack.\n\n“So unelectable a democratic socialist swept the mayoral primary against your Republican-light brother,” podcaster Francesca Fiorentini responded, while Breaking Points host Krystal Ball snarked that Cuomo’s “meltdown over his brother’s humiliating loss” to Mamdani continued.\n\n“Total utter BS,” Zeteo founder Mehdi Hasan declared, adding that polls suggested that if Kamala Harris “had actually campaigned on a populist economic message” and an antiwar position like Ocasio-Cortez, “she probably would have won.” \n\nCuomo, who was fired by CNN in 2021 after it was discovered he helped his then-governor brother strategize on discrediting his sexual misconduct accusers, tore into Ocasio-Cortez – one of Mamdani’s most prominent supporters – on the day of the New York City election. \n\n“I just think that she’s killing her party. She is a deranged form of Democrat,” he groused while expressing shock that she is viewed favorably in recent political polls.\n\nThe following night, after his brother had conceded the race to Mamdani, Cuomo delivered a lengthy monologue in which he claimed the Democratic Party was “dead” and no different than MAGA.\n\n“The outcome in this election wasn’t about affordability or about real change,” he fumed. “The winner is an open socialist, and the Democratic Party is now just that: socialistic. But be clear, this is a fictional fix for very real frustrations.”","summary":"Several prominent progressives insisted that Chris Cuomo was merely lashing out at AOC because of his brother’s ‘humiliating’ loss in the New York mayoral race.","url":"https://www.independent.co.uk/news/world/americas/us-politics/chris-cuomo-aoc-big-beautiful-bill-b2782312.html","image":"https://static.independent.co.uk/2024/11/11/17/665c50af1a50434fb0d2e427ee57ff95.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/mQEoBMpm-4VHSaSK0.mp4","publish_date":"2025-07-03 21:03:00","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.148},{"id":338005348,"title":"Transgender people notch rare win in fight over Trump’s ‘One Big, Beautiful Bill’","text":"Transgender Americans received a surprising mini-victory amid the Republican passage of President Donald Trump’s “One Big, Beautiful Bill” when an attempt to restrict gender-affirming care died in the legislative process. \n\nThe bill had included language that would have banned Medicaid from covering gender-affirming care for transgender minors. But in a final deal made to appeal to conservatives, the legislation struck the term “for minors.” \n\nRepublicans passed the legislation via the process of budget reconciliation, which allowed them to avoid a Democratic filibuster. But that meant the legislation had to relate to federal spending and the Senate Parliamentarian, who determines whether legislative language complies with the so-called “Byrd Rule” criteria found it was not germane. \n\nInitially, the Senate version included similar language. But the parliamentarian found that it did not comply with the Byrd Rule after Democratic staff argued for it. \n\nStill, Republicans included it in the language of the text they hoped to put on the floor. That would have required Democrats to raise a point of order on the legislation, which would mean the amendment would need 60 votes and the 53 Republican senators would need to pick off seven Democrats.\n\nRep. Dan Crenshaw (R-Texas) said he thought that would be an easy fight. \n\n“It’s a good bet to take,” he said on X. \n\n“For one thing, nothing to lose so why not try? But second, I believe the Democrats won’t want to pick this battle. This is a very very popular provision. I think the Democrats know they’ve lost the battle. The science isn’t on their side and neither is the public.” \n\nBut transgender people had a powerful ally in Sen. Ron Wyden, one of the remaining lawmakers who opposed the 1996 Defense of Marriage Act, the law that made the federal government recognize marriage as one man and one woman. Wyden said at the time that he would raise a point of order if needed. \n\n“I was first senators come out and support marriage equality and I said if you don't like gay marriage, don't get one,” the Oregon Democrat told The Independent. \n\n“This is the same thing. This is a private choice for adults should be blankship belong to them.”\n\nAccording to the Williams Institute at UCLA School of Law, about 276,000 transgender adults use Medicaid. But Republicans have focused heavily on anti-trans rhetoric and policy, with numerous state legislatures enacting bans on gender-affirming care for youth with gender dysphoria.\n\nIn addition, late last year, House Republicans included a provision in the National Defense Authorization Act that banned TRICARE, the health care program for active-duty military servicemembers, from covering “certain medical procedures for children that could result in sterilization.” \n\nIn 2024, the Trump campaign ran an advertisement criticizing his Democratic opponent Kamala Harris for allowing taxpayer-funded gender-affirming surgeries for undocumented immigrants in prison, famously using the tagline: “Kamala is for They/Them” while “President Trump is for you.” \n\nIn the end, the final agreement that led to the legislation being passed in the Senate excluded the language on gender-affirming care without the Democrats having to raise a point of order.\n\nRep. Mark Takano of California, the chairman of the Congressional Equality Caucus, heralded the win for transgender people, saying that the four big fights for them are access to medical care, freedom from bullying and harassment at school, freedom from harassment at the workplace and the ability to participate in sports. \n\n“The fact that this was achieved in the Senate, rather painlessly, was a was a pretty remarkable time of events,” Takano told The Independent. \n\nInitially, it looked like Republicans would want to include amendments to the Senate version. Rep. Marjorie Taylor Greene proposed an amendment to restore the ban. But Republicans opted to pass the legislation without amendments, meaning the language was not included in the final bill. \n\nBefore the final House bill’s passage, Rep. Sarah McBride of Delaware praised the fact the language died. \n\n“I think there are a lot of people who are rightfully relieved,” she said.","summary":"‘I think there are a lot of people who are rightfully relieved,’ Sarah McBride, the first openly transgender member of congress, tells The Independent","url":"https://www.independent.co.uk/news/world/americas/us-politics/transgender-medicaid-ban-trump-spending-bill-b2781844.html","image":"https://static.independent.co.uk/2025/07/03/10/54/GettyImages-2219152313.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/5GLIz138-OhrQWqOm.mp4","publish_date":"2025-07-03 20:58:23","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.358},{"id":338010076,"title":"Don't Worry, John Dickerson: CBS News Lost The Public's Trust Long Before Settlement With Trump","text":"On Thursday night, \"CBS Evening News\" anchor John Dickerson addressed the fact that parent company Paramount Global reached a $16 million settlement with President Donald Trump over the network's deceptive editing during an interview with former Vice President Kamala Harris ahead of the 2024 election. \"Paramount Global, the parent company of CBS News, settled a suit with President Trump today. Journalists don’t like to report on themselves. Sometimes that’s false humility. Mostly, it’s a practical limitation. Reporters try to find order in chaos. We prefer to explain the cause of a bombing, the intent of a bill, the marvel of a new discovery. Putting chaos in preliminary order helps viewers make sense of their world. They tell us this at airports, restaurants, and at church. The audience brings us their fears, their questions, their good faith view of things. It reminds us that we are stewards of that concern. It’s a grace to receive another’s trust, but also to have a mission that shapes your work,\" Dickerson began. \"Can you hold power to account after paying it millions? Can an audience trust you when it thinks you've traded away that trust?\" he asked. \"The audience will decide.\" The audience will decide. In terms of CBS News, the audience has already decided. \"CBS Evening News\" has been a distant third in the evening news wars for over a decade. But the show has never been less competitive with its ABC and NBC counterparts than it is today. Last week, CBS drew just 3.8 million viewers during the 6:30 pm news hour, compared to 7.3 million for ABC and 5.7 million for NBC. However, we don't put the onus entirely on John Dickerson or his co-host, some guy named Maurice DuBois. See, CBS News butchered its trust with the audience long before settling with Donald Trump. CBS News is as guilty as any news outlet in America of feeding its audiences politically-motivated lies to either cost Trump the election or damage his reputation publicly. The news operation was complicit in the Russia Hoax, the Biden cover-up, the \"bloodbath\" hoax, the \"very fine people\" hoax, and the Hunter Biden laptop was part of a Russian disinformation operation hoax, etc., etc., etc. Moreover, \"60 Minutes\" is a shell of itself. In addition to editing its interview with Kamala Harris, CBS's flagship news program recently fawned over censorship laws in Germany, downplayed how Hamas treated hostages, and broke format to editorialize about Trump's then-Cabinet nominations. Spoiler: CBS disapproved of his picks. Just last month, CBS News cited a misleading study that claimed \"one out of every 15 American adults has been at a mass shooting.\" In actuality, the referenced study simply found that one in 15 of the 10,000 respondents asked said they had \"heard\" gunshots from an incident they think involved more than four people. Nonetheless, CBS cited the study as evidence that the country ought to implement stricter gun laws. There was also the CBS News-led vice presidential debate last October, during which moderators Norah O'Donnell and Margaret Brennan repeatedly interrupted J.D. Vance with misleading fact checks while letting Tampon Tim spread lies about the Trump administration's first term. But, yeah, settling with Trump is what will cause Americans to lose trust in CBS News.","summary":"John Dickerson addressed parent company Paramount Global reaching a $16 million settlement with President Donald Trump.","url":"https://www.outkick.com/analysis/dont-worry-john-dickerson-cbs-news-lost-publics-trust-long-before-settlement-trump","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/07/gettyimages-1229297602.jpg","video":null,"publish_date":"2025-07-03 20:57:52","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.344},{"id":338001810,"title":"Paramount’s $16 Million Settlement With Trump Sends a Chilling Message","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nSome good news for David Zaslav: As of this week, it seems there may be another entertainment executive who’s more widely loathed than the Warner Bros. Discovery CEO. Some bad news for the rest of us: The woman who’s taken that ignominious crown, Paramount Global owner Shari Redstone, has further endangered the United States’ already crumbling democracy in the process.\n\nOn Wednesday morning, Paramount’s co-CEO George Cheeks (yes, that’s his name) had the unenviable task of explaining to shareholders why the entertainment giant—which owns CBS, among several other prominent TV assets—had chosen to settle a lawsuit brought by President Donald Trump over an October 60 Minutes interview with Kamala Harris that, he’d baselessly claimed, had been edited to make her sound better. “Yes, the company has agreed in principle to settle the lawsuit, and as reported, it does not include an apology,” Cheeks huffed to the investors, according to the Hollywood Reporter. “Look, companies often settle litigation to avoid the high and somewhat unpredictable cost of legal defense, the risk of an adverse judgment that could result in significant financial as well as reputational damage, and the disruption to business operations.”\n\nThat’s a long way of saying: We chickened out so we could get a deal. The long-struggling Paramount has been hoping to get bought out for a while now—preferably by the production giant Skydance Media, known for IP blockbusters like Top Gun: Maverick and Mission Impossible—The Final Reckoning. However, just when the deal seemed as good as ready, a Trump-size problem emerged. First, the then-candidate filed a $10 billion lawsuit the week before Election Day, nonsensically accusing Paramount-owned 60 Minutes of favorably editing opponent Kamala Harris’ “word salad” and thus conducting “a brazen attempt to interfere in the 2024 U.S. Presidential Election.” (Observers of the Jan. 6 insurrection might have had some thoughts about that.) The allegation stemmed from an instance of seemingly differing answers offered to host Bill Whitaker in a preview clip aired on Face the Nation versus the final broadcast. CBS clarified that those Harris quotes had both been part of the answer to the same question, and that certain edits had been made for the sake of timing, per usual practice. The broadcaster soon published the full transcripts to back this fact up.\n\nNevertheless, even after Trump won reelection, he kept up his case against Paramount, with the help of his loyalists. Soon after the election results, Brendan Carr—then a Federal Communications Commission commissioner who was in line to head the agency under Trump—straight-up told Fox News that the Harris edit would be taken into consideration when regulators decided whether or not to approve the Skydance merger. Shortly after the inauguration, Trump announced a private sector A.I. initiative that involved Oracle co-founder Larry Ellison—who just so happens to be a long-favored friend of Trump’s, as well as the father of David Ellison, founder and CEO of Skydance Media. Last month, the younger Ellison joined the president ringside at a UFC event, where they were spotted conversing and shaking hands. Trump would later praise David in public while once again bringing up the 60 Minutes interview. (His thoughts on David as potential chief of Paramount and CBS: “He’ll do a great job with it.”) Also worth a mention: Larry himself will have voting control over the Skydance-Paramount behemoth, as a corporate investor in the $8 billion merger.\n\nSo, even though various First Amendment lawyers had deemed Trump’s case to be baseless and absurd (one told CNN that the case was “ridiculous junk”), the White House kept unsubtly hinting that Paramount’s future depended upon whether the company would make Carr, Trump, and the Ellisons happy. Paramount’s owners and executives appeared to get that message, and insider reporting throughout Trump’s term kept indicating that Shari Redstone, Mr. Cheeks, and their fellow stakeholders appeared willing to kowtow to the administration—instead of defending their employees and journalists. In fact, their only purported hesitation seemed to be the appearance of effectively bribing Trump by settling with him.\n\nIn May, multiple Democratic senators sent letters to Redstone urging her to retract any settlement offer and to “stand up for freedom of the press and our democracy.” Oregon Sen. Ron Wyden, who signed on to those letters, went further by threatening to summon Paramount executives “to explain their crimes in front of Congress and to the public when Democrats retake power.” (After the settlement was made official, Wyden outright called it a “bribe” and reiterated that “when Democrats retake power, I’ll be first in line calling for federal charges. In the meantime, state prosecutors should make the corporate execs who sold out our democracy answer in court, today.”) Lawmakers from the California state government likewise invited former CBS executives to testify in front of the state Senate.\n\nNevertheless, we’ve reached this settlement. Lisa Graves, president of the Center for Media and Democracy, told me in a statement that it’s part of a dispiriting pattern under Trump’s second term.\n\n“The settlement seems designed in part to curry favor with Trump, who has wielded the power of the White House to subject companies and industries to what seem like shakedowns to get his way,” she said. “It comes in the wake of several major law firms caving to Trump. It also comes as Verizon obeyed with Trump’s authoritarian squeeze on industries by preemptively dropping its commitments to diversity, equity, and inclusion in its workplace.” (It should be noted: Paramount has admitted that the $16 million payout will serve to cover Trump’s legal fees, with the rest of the money acting as an in-kind donation to his future presidential library.)\n\nAnd how have CBS and the 60 Minutes felt about all this, you ask? Well, pretty awful. In April, 60 Minutes executive Bill Owens—who’d worked with CBS since the late 1980s—resigned in protest of the proposed settlement; about a month later, CBS News president Wendy McMahon was forced out for her consistent objection to the settlement. Live on the air to its millions of regular viewers, 60 Minutes correspondent Scott Pelley took a few minutes of his April 27 episode to chide CBS’ parent company, stating that “Paramount began to supervise our content in new ways” and calling it out for “trying to complete a merger” with approval from the Trump administration.\n\nIndeed, all of the show’s brand-name hosts sent a letter to the Paramount C-suite imploring Cheeks and his fellow execs to keep resisting Trump’s suit. Even non-CBS talent at Paramount registered their disapproval, as the creators of South Park (which remains one of the corporation’s most successful properties) alleged that Paramount and Skydance had messed with their contract even before the merger had been approved. While all accused have denied that characterization, the South Park guys are still shaking their fists, having declared the merger a “shitshow” just this week.\n\nThe angst inside Paramount and CBS has not calmed down, and likely will not anytime soon. Many 60 Minutes staffers are still frustrated that the company did not pursue what seemed like a very winnable case against Trump. The Writers Guild of America, East, which represents CBS News’ editorial union, said the parent company’s cop-out “threatens journalists’ ability to do their job reporting on powerful public figures.” On Wednesday, CBS Evening News co-anchor (and Slate Political Gabfest co-host) John Dickerson asked his viewers on air, “The Paramount settlement poses a new obstacle: Can you hold power to account after paying it millions? Can an audience trust you when it thinks you’ve traded away that trust?”\n\nMeanwhile, Trumpist media outlets have reacted just as you’d expect, with Ben Shapiro’s Daily Wire declaring, falsely, that the president’s lawsuit had “exposed” a “deceptively edited Kamala interview,” and the American Spectator pointing out, correctly, that this result is “humiliating” for CBS. (One reliably conservative outfit that did not take glee in this outcome: the Wall Street Journal’s editorial board, which labeled this outcome a “worrying precedent” for American media.) Plenty of aggrieved liberals and press advocates also took to social media to announce the immediate cancellation of their Paramount+ subscriptions.\n\nPaul Goodman, a legal counsel at the Center for Accessible Technology who’s been agitating against Verizon’s DEI capitulation to the FCC, was one of those Paramount+ quitters. “For Paramount, it seems like they’re commodifying First Amendment rights—the First Amendment has a price on it, and that price is getting a merger,” he told me in an interview. “It makes me think of that quote attributed to Ben Franklin: ‘Those who would give up essential liberty, to purchase a little temporary safety, deserve neither liberty nor safety.’ ”\n\nIf Paramount investors seem inclined to rush to that safety, it’s not least because the iconic entertainment brand has been run rather poorly. Rounds upon rounds of layoffs, cuts to programming, investment in a streaming service that everyone hates, Zaslav-level bungling of iconic brands, a rock-bottom crash in stock value post-pandemic, sweeping back-catalog scrubbing that’s pissed off the many celebrities who’ve done shows and movies under Paramount—this chaos is what has defined the executives, instead of any measurable business successes. For that reason, as Goodman noted to me and as my colleague Alex Kirshner has explained, it makes sense from a pure biz standpoint to do anything that could improve Paramount’s corporate health, including an expedited merger.\n\nBut there’s more trouble ahead for Paramount, even with its Skydance savior. Sen. Elizabeth Warren joined her colleague Wyden’s call for “a full investigation into whether or not any anti-bribery laws were broken.” The Freedom of the Press Foundation—which owns some shares of Paramount—has threatened to sue Redstone and the company over the settlement. The very liberals who form the audience for Paramount’s most popular shows, like 60 Minutes and The Daily Show, are likely to boycott the whole enterprise as fervently as they have, say, the now-struggling Washington Post. And this entire “shitshow” is likely to define the legacies of Shari Redstone, George Cheeks, Father and Son Ellison, and all their business partners as our bedrocks of democracy crumble under Donald Trump. At least they got some cash out of it.","summary":"With a $16 million settlement with Trump, the media company just struck a deal that showed how easily the First Amendment can be bartered away.","url":"https://slate.com/technology/2025/07/paramount-skydance-merger-trump-settlement.html?via=rss","image":"https://compote.slate.com/images/d4245487-af6c-4c62-9904-b4aef5e5d7c5.jpeg?crop=3000%2C2000%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-07-03 20:44:49","author":"Nitish Pahwa","authors":["Nitish Pahwa"],"language":"en","source_country":"US","sentiment":-0.507},{"id":338001630,"title":"The 2 House Republicans who voted no on Trump's sweeping domestic policy bill","text":"President Donald Trump's major tax cut and spending bill passed the House on Thursday, but not without some Republican opposition.\n\nRep. Thomas Massie of Kentucky and Rep. Brian Fitzpatrick of Pennsylvania voted against the legislation alongside the entire House Democratic Caucus.\n\nWhile Massie and Fitzpatrick were the only GOP members to vote no, several House GOP hardliners were angered by the changes made to the bill by the Senate and there was an overnight scramble by Speaker Mike Johnson to secure the necessary support to proceed. Some of the hardliners who ultimately voted yes say President Trump made promises to get their votes, including that he'd make the bill \"better\" in the future.\n\nOn Thursday, Massie said he did not vote for the bill because of its projected impact on the national debt. The nonpartisan Congressional Budget Office estimated the bill could add $3.4 trillion to the deficit over the next decade.\n\n\"Although there were some conservative wins in the budget reconciliation bill (OBBBA), I voted No on final passage because it will significantly increase U.S. budget deficits in the near term, negatively impacting all Americans through sustained inflation and high interest rates,\" Massie wrote on X. Massie also opposed the House version of the megabill that passed back in May.\n\nTrump's been a vocal critic of Massie, lambasting him last month in a lengthy social media post as not being \"MAGA.\"\n\n\"Actually, MAGA doesn’t want him, doesn’t know him, and doesn’t respect him,\" Trump wrote at the time.\n\nThe president accused Massie of being a \"grandstander\" who routinely votes no on key Republican-led legislation. Trump suggested Massie should be challenged in the upcoming Republican primary, even before this latest vote.\n\n\"The good news is that we will have a wonderful American Patriot running against him in the Republican Primary, and I’ll be out in Kentucky campaigning really hard,\" Trump wrote.\n\nRep. Fitzpatrick did vote for the House bill in May, but said on Thursday that the Senate changes to the bill (which resulted in deeper cuts to Medicaid) as the reason for his change in position.\n\nAs I’ve stated throughout these negotiations, with each iteration of legislative text that was placed on the House Floor, I’ve maintained a close and watchful eye on the specific details of these provisions, and determined the specific district impact, positive or negative, on our PA-1 community,\" Fitzpatrick said in a statement.\n\n\"I voted to strengthen Medicaid protections, to permanently extend middle class tax cuts, for enhanced small business tax relief, and for historic investments in our border security and our military,\" he added/ \"However, it was the Senate’s amendments to Medicaid, in addition to several other Senate provisions, that altered the analysis for our PA-1 community. The original House language was written in a way that protected our community; the Senate amendments fell short of our standard.\"\n\n\"I believe in, and will always fight for, policies that are thoughtful, compassionate, and good for our community. It is this standard that will always guide my legislative decisions,\" Fitzpatrick said.\n\nThe Pennsylvania congressman, who also faces reelection in 2026, represents a swing district that went blue in 2024 for Kamala Harris.","summary":"President Donald Trump's major tax cut and spending bill passed the House on Thursday, but not without some Republican opposition.","url":"https://abcnews.go.com/Politics/2-house-republicans-voted-trumps-sweeping-domestic-policy/story?id=123459797","image":"https://i.abcnewsfe.com/a/1010286d-94e3-4438-986b-a08f285b0616/fitzpaterick-massie-gty-gmh-250703_1751569548147_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-07-03 20:04:13","author":"Alexandra Hutzler","authors":["Alexandra Hutzler"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":337998318,"title":"One ‘big, beautiful’ reason why Republicans in Congress just can’t quit Donald Trump","text":"As the U.S. House of Representatives voted to approve President Donald Trump’s sweeping domestic tax and spending package, many critics are wondering how the president retained the loyalty of so many congressional Republicans, with so few defections.\n\nJust three Republican senators – the maximum allowed for the One Big Beautiful Bill Act to still pass – voted against the Senate version of the bill on July 1, 2025. In the House, only two Republicans voted against the bill, which passed the chamber on July 3.\n\nAmong other things, the bill will slash taxes by about US$4.5 trillion over a decade and exempt people’s tips and overtime pay from federal income taxes.\n\nBut the bill has been widely panned, including by some Republicans. \n\nDemocrats have uniformly opposed it, in part thanks to the bill’s sweeping cuts to Medicaid and Affordable Care Act marketplace funding. This could lead to an estimated 12 million more people without insurance by 2034.\n\nThe legislation is also likely to add between $3 trilion and $5 trillion to the national debt by 2034, according to the Congressional Budget Office.\n\nThe power of the presidency\n\nTrump is not the first president to bend Congress to his will to get legislation approved. \n\nPresidential supremacy over the legislative process has been on the rise for decades. But contrary to popular belief, lawmakers are not always simply voting based on blind partisanship. \n\nIncreasingly, politicians in the same political party as a president are voting in line with the president because their political futures are as tied up with the president’s reputation as they have ever been.\n\nEven when national polling indicates a policy is unpopular – as is the case with Trump’s budget reconciliation bill, which an estimated 55% of American voters said in June they oppose, according to Quinnipiac University polling – lawmakers in the president’s party have serious motivation to follow the president’s lead. \n\nOr else they risk losing reelection.\n\nLawmakers increasingly partisan on presidential policy\n\nOver the past 50 years, lawmakers in the president’s party have increasingly supported the president’s position on legislation that passes Congress. Opposition lawmakers, meanwhile, are increasingly united against the president’s position.\n\nIn 1970, for example, when Republican President Richard Nixon was in the White House, Republicans in Congress voted along with his positions 72% of the time. But the Democratic majority in Congress voted with him nearly as much, at 60% of the time, particularly on Nixon’s more progressive environmental agenda. \n\nThese patterns are unheard of in the modern Congress. In 2022, for example – a year of significant legislative achievement for the Biden administration – the Democratic majority in Congress voted the same way as the Democratic president 99% of the time. Republicans, meanwhile, voted with Biden just 19% of the time.\n\nElections can tell us why\n\nOver the past half-century, the two major parties have changed dramatically, both in the absolutist nature of their beliefs and in relation to one another. \n\nBoth parties used to be more mixed in their ideological outlooks, for example, with conservative Democrats and liberal Republicans playing key roles in policymaking. This made it easier to form cross-party coalitions, either with or against the president. \n\nA few decades ago, Democrats and Republicans were also less geographically polarized from each other. Democrats were regularly elected to congressional seats in the South, for example, even if those districts supported Republican presidents such as Nixon or Ronald Reagan.\n\nMuch of this has changed in recent decades. \n\nCongress members are not just ideologically at odds with colleagues in the other party – they are more similar than ever to other members within their party. \n\nDistricts supporting the two parties are also increasingly geographically distant from each other, often along an urban-rural divide. \n\nAnd presidents in particular have become polarizing partisan figures on the national stage.\n\nThese changes have ushered in a larger phenomenon called political nationalization, in which local political considerations, issues and candidate qualifications have taken a back seat to national politics.\n\nTicket splitting\n\nFrom the 1960s through most of the 1980s, between one-quarter and one-half of all congressional districts routinely split tickets – meaning they sent a politician of one party to Congress while supporting a different party for president. \n\nThese are the same few districts in Nebraska and New York, for example, that supported former Vice President Kamala Harris for president in 2024 but which also elected a Republican candidate to the House that same year. \n\nSince the Reagan years, however, these types of districts that could simultaneously support a Democratic presidential nominee and Republicans for Congress have gone nearly extinct. Today, only a handful of districts split their tickets, and all other districts select the same party for both offices. \n\nThe past two presidential elections, in 2020 and 2024, set the same record low for ticket splitting. Just 16 out of 435 House districts voted for different parties for the House of Representatives and president.\n\nMembers of Congress follow their voters\n\nThe political success of members of Congress has become increasingly tied up with the success or failure of the president. Because nearly all Republicans hail from districts and states that are very supportive of Trump and his agenda, following the will of their voters increasingly means being supportive of the president’s agenda. \n\nNot doing so risks blowback from their Trump-supporting constituents. A June 2025 Quinnipiac University poll found that 67% of Republicans support the bill, while 87% of Democrats oppose it.\n\nThese electoral considerations also help explain the unanimous opposition to Trump’s legislation by the Democrats, nearly all of whom represent districts and states that did not support Trump in 2024. \n\nThanks to party polarization in ideologies, geography and in the electorate, few Democrats could survive politically while strongly supporting Trump. And few Republicans could do so while opposing him.\n\nBut as the importance to voters of mere presidential support increases, the importance of members’ skill in fighting for issues unique to their districts has decreased. This can leave important local concerns about, for example, unique local environmental issues or declining economic sectors unspoken for. At the very least, members have less incentive to speak for them.","summary":"Lawmakers who are aligned politically with the president are increasingly voting in line with the chief executive. Doing otherwise could cost them on Election Day.","url":"https://theconversation.com/one-big-beautiful-reason-why-republicans-in-congress-just-cant-quit-donald-trump-260345","image":"https://images.theconversation.com/files/678208/original/file-20250703-56-lblxhq.jpg?ixlib=rb-4.1.0&rect=0%2C72%2C7600%2C3800&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-07-03 19:48:21","author":"Associate Professor of Political Science,Boise State University,Charlie Hunt","authors":["Associate Professor of Political Science","Boise State University","Charlie Hunt"],"language":"en","category":"politics","source_country":"AU","sentiment":0.044},{"id":338028598,"title":"Presidents Sometimes Use 4th of July Celebrations to Unveil Major Policies. Most Times, They Don't.","text":"The past offered little guidance for President Donald Trump on whether to make a major policy announcement on the Fourth of July, although he has invited the B-2 Spirit pilots who flew the mission against Iran last week to the White House for the occasion, which could offer a backdrop for a Mideast policy declaration.\n\nLast year, President Joe Biden hosted an Independence Day celebration at the White House, including a barbecue for several thousand active-duty military members and their families. Later that day, Biden and his family, joined by then-Vice President Kamala Harris, watched the annual fireworks display on the National Mall from the Truman balcony of the White House. There were no policy announcements.\n\nSome presidents have not stayed in Washington for the Fourth of July. Former President Bill Clinton spent the Fourth of July in 1993 in Philadelphia, where he delivered remarks at an Independence Day ceremony.\n\nRead Next: Guardsmen Help Operate 'Alligator Alcatraz' as Trump Increasingly Leans on Military for Immigration Crackdown\n\nAnd Trump might not want to recall his own gaffe-filled performance at the Lincoln Memorial on July 4, 2019, which he later blamed on a teleprompter going on the fritz in the rain.\n\nDuring the Revolutionary War, \"our Army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do, and at Fort McHenry, under the rocket's red glare, it had nothing but victory. And when dawn came, their star-spangled banner waved defiant,\" Trump said, although air travel had yet to be invented and the Fort McHenry battle took place during the War of 1812.\n\nBut in the annals of presidential happenings on the Fourth of July, perhaps none was more consequential than what President Harry Truman faced on July 4, 1945.\n\nTruman had yet to make up his mind on whether to order the ground invasion of Japan's home islands -- that would almost certainly entail a horrific body count -- or wait to see if the top-secret new bomb his advisers had been telling him about would actually work to unleash the fearsome destructive power of the atom.\n\nTruman used the day to go on a Potomac River cruise aboard the same-named presidential yacht USS Potomac with friends, cabinet members and advisers. He wrote a note to himself afterward about his chats during the cruise: \"Discussed Russian & Jap War, Govt. for Germany, Food, fuel & transportation for Europe, Sterling Block (the British pound), etc. Don't feel happy over situation,\" according to the National World War II Museum.\n\nThe note continued: \"I have to decide Japanese strategy -- shall we invade Japan proper or shall we bomb and blockade? That is my hardest decision to date. But I'll make it when I have all the facts.\"\n\nEarlier, Truman had released a \"Creed of Liberty\" message: \"Again this year we celebrate July Fourth as the anniversary of the day 169 years ago on which we declared our independence as a sovereign people.\"\n\n\"Here at home, on this July 4, 1945, let us honor our nation's creed of liberty, and the men and women of our armed forces who are carrying this creed with them throughout the world,\" the message said.\n\nBut in Congress, and among the families of the troops serving abroad, Truman was taking heat for not speeding up the demobilization of the Army and the Army Air Forces and sending some of the troops home. The War Department had ordered demobilization in Operation Magic Carpet under an \"Adjusted Service Rating Score\" two days after victory in Europe was declared with Germany's unconditional surrender on May 8, 1945.\n\nTo the troops, the Adjusted Service Rating Score was just the \"points system,\" and it was much despised in the ranks. The idea was that \"those who had fought longest and hardest should be returned home for discharge first,\" but it didn't often work out that way. Who was eligible for demobilization took on added importance as some of the troops in Europe were scheduled for redeployment to the Pacific for the possible invasion of Japan.\n\nInitially, enlisted troops needed a score of 85 points to be considered for demobilization. Troops got one point for each month of service and an additional one point for each month served overseas. Combat awards ranging from the Medal of Honor to the Purple Heart got five points, and a campaign participation award also was given five points. Troops with a dependent child under the age of 18 got 12 points for each child up to a limit of three.\n\nTwelve days after Truman said privately that he was undecided on what to do about the war in the Pacific, the decision was essentially made for him when the Manhattan Project team set off the 21-kiloton Trinity explosion -- the first atomic weapon -- in the New Mexico desert.\n\nB-29 bombers dropped atomic bombs on Hiroshima on Aug. 6, 1945, and Nagasaki on Aug. 9. Japan surrendered unconditionally aboard the battleship Missouri in Tokyo Bay on Sept. 2, 1945.\n\nIn a radio address following the signing of the terms of surrender aboard the Missouri, Truman said that \"the mighty threat to civilization which began\" with the attack on Pearl Harbor \"is now laid at rest. It was a long road to Tokyo and a bloody one. We shall not forget Pearl Harbor. The Japanese militarists will not forget the USS Missouri.\"\n\nCoasties Braved Withering German Fire to Put Troops Ashore on D-Day","summary":"The past offered little guidance for President Donald Trump on whether to make a major policy announcement on the Fourth of July, although he has invited the B-2 Spirit pilots who flew the mission against Iran last week to the White House for the occasion.","url":"https://www.military.com/daily-news/2025/07/03/presidents-sometimes-use-4th-of-july-celebrations-unveil-major-policies-most-times-they-dont.html","image":"https://images03.military.com/sites/default/files/styles/full/public/2025-07/ApNewsroom_US_Presidents_AP_Photo_Coverage_79782.jpg","video":null,"publish_date":"2025-07-03 19:41:48","author":"Richard Sisk","authors":["Richard Sisk"],"language":"en","source_country":"us","sentiment":0.21},{"id":337992034,"title":"Gavin Newsom decides he wants to build, but do his residents?","text":"Newsom was referencing the 4-month-old policy book Abundance, by Klein and Derek Thompson. Both are vociferous and lifelong liberals, and, theoretically, the book’s thesis is squarely left of center. The core assumption at the heart of it is that climate change is an existential threat to humanity that requires a whole-of-government approach to transition away from fossil fuels.\n\nIn practice, the book has been interpreted by much of the Left as an indictment of Democratic governance. And that’s because, despite the Democratic optimists who view Abundance as a deus ex machina and policy pathway out of the party’s current despair, Abundance is absolutely antithetical to the core beliefs and practices of the most indigo cities and states.\n\nCalifornia lost a net 588,000 residents from 2020 to 2023, with more than a 1% population decline since before the pandemic. A third of Californians polled by the Public Policy Institute of California in 2023 said they were considering leaving due to housing costs, and for more than a decade, the state has seen annual losses of tens of thousands of low-income residents, who have consistently left at higher numbers than the middle class.\n\nAbundance posits the correct reason for this wave of emigration that has inflated red state populations (and thus, in compounding measure, the political power of red states): California has simply made it too hard to build housing. And to its immense credit, Abundance pinpoints the direct reason why this problem really started in the 1970s.\n\n“Real wages stagnated over these decades, but they didn’t fall,” write Klein and Thompson. “The action was in housing prices, which rose and rose. This was something new. Prior to 1970, housing wasn’t a prime asset. You bought a home to live in it. But that changed in the 1970s. Inflation was part of the reason. One of the main aims of federal housing policy has been to make possible the thirty-year fixed-rate mortgage, a peculiar financial device that wouldn’t survive a day in the economic wild. What lender in their right mind would hand out thirty-year loans on fixed terms to virtually anybody with a job?”\n\nThe answer, of course, is no lender on Earth. But the 30-year fixed mortgage was backstopped by the federal government and, thus, mainstreamed by the end of World War II. So why did the 30-year fixed rate become a tool to invest in an asset class? Klein and Thompson indeed highlight inflation, which was a byproduct of President Lyndon Johnson’s creation of the “War on Poverty” and President Richard Nixon’s pathetic refusal to rescind the federal spending spree. In turn, the notion of wealth safeguarded in the homes while wages stagnated in real value was a feature, not a bug, of post-New Deal leftism.\n\n“In the ’70s, rising inflation and slowing home building turned the homes people did own into the center of their wealth,” Klein and Thompson concede. “But how do you protect the value of that asset? You can insure a home against fire, but you can’t insure it against rising crime rates or local schools slipping in quality or a public housing complex being built down the block. To manage those risks, you need to control what happens around your home. You do that through zoning and reorganizing.”\n\nBut states that President Donald Trump won decisively are approving new building permits per capita at twice the rate of the states that former Vice President Kamala Harris won. While Abundance does explore the fact that other states don’t have this problem because they lack California’s ostensible “environmental” regulations, Klein and Thompson don’t dig deeper into the ugly reason why California has created these sorts of building barriers while Florida and Texas haven’t.\n\nThe climax of Abundance details the sordid, decadeslong saga of California’s attempt to build a high-speed rail connecting Los Angeles to San Francisco. While the state’s failure, which has thus far resulted in a potential train connecting the minor city of Bakersfield to the relative hovel of Merced, is indeed a $100 billion laughing stock, I think another, even longer and less ambitious fiasco of a railroad reverie exemplifies the progressive problem with more honesty.\n\nContrary to popular consensus, Los Angeles does have a subway system — one that, as an undergraduate at the University of Southern California, I frequented nearly every day, either to go to my office downtown or to go out in Santa Monica. One of the busiest lines, the D line, is also one of the shortest, but it wasn’t supposed to be.\n\nA plan to connect Downtown with the LA Westside along the main thoroughfare of Wilshire Boulevard was in the works as early as the 1960s, but it wasn’t until 1980 that voters authorized a special sales tax to fund the construction of a rail to span the county. Henry Waxman, the dominant Democrat who represented WeHo, Santa Monica, and Beverly Hills in the House of Representatives, got local liberals to reject the subway under the guise of — you guessed it — environmental concerns. Declaring a portion of Mid-Wilshire a “methane zone” after a freak methane explosion, Waxman used federal force in 1985 to ban a subway tunnel from being built in this crucial crux of central LA.\n\nIn the 1990s, a subway connecting Downtown to Koreatown opened, but it stopped short of the Westside.\n\nA full two decades after his initial opposition, Waxman finally reversed course to allow the subway to extend from Mid-Wilshire, and with Congress finally overturning Waxman’s effective veto, the Metro board went forward with the intent to fulfill the original plan modeled more than 40 years prior. Then followed another decade of legal challenges on the basis of bogus environmental concerns. The Beverly Hills Unified School District, which encouraged students to stage a walkout in protest of the 9-mile extension, spent $13 million in local taxpayer-funded bonds to try to stop the extension.\n\nLater this year, an extra 4 miles of subway connecting the previous end of the Wilshire line to La Cienega will finally open.\n\nUnlike environmental regulations used as a pretense to preserve home values by preventing an influx of supply, a subway line does not dilute the concentration of homes in a neighborhood or obstruct the skyline. So why did the power brokers of Beverly Hills and the Westside rail so hard against the subway extension? Because the Westside is wealthy, and Downtown is the gateway to the city’s working class. In other words, the patrician class simply did not want the plebeians to gain easy access to how the other half lives.\n\nKlein and Thompson do make mention of zoning’s historical weaponization against racial minorities, but they stop short of exploring the psychology of the liberal penchant for excluding the have-nots. An easy answer would be that law and order does for Republican localities what zoning does for Democrats: eliminate the unfavorable. But there’s also the fundamental elitism that imbues the leftism of Klein and Thompson’s critics.\n\nBlue state progressive Democrats fought tooth and nail to close their public schools because they’re the residents most likely to have their children in private education. Some 1 in 5 students of the blue bastions of Hawaii and Washington, D.C., attend private schools, compared to 5% or fewer in Oklahoma, West Virginia, Alaska, Utah, and Wyoming.\n\nHOUSE HANDS TRUMP HIS JULY 4TH VICTORY WITH PASSAGE OF ‘BIG, BEAUTIFUL BILL’\n\nZohran Mamdani narrowly won the Democratic mayoral primary by promising New York City’s residents he would make the bus free, which, of course, necessitates reducing service frequency. Mamdani naturally lost the lower-income voters who actually rely on public transit, presumably to make it to jobs that are much more likely to be less flexible shift work — rather than Mamdani’s ill-fated career as a rapper, which was bankrolled by his Oscar-nominated mother and Columbia University professor father.\n\nFor the sake of my former state, I do wish Newsom well. But both he and the Abundance caucus may be surprised if they learn that the feudal lords of California actually don’t mind the exodus of the discarded serfs fleeing for redder lands.","summary":"Gavin Newsom hasn&#8217;t exactly hidden his presidential ambitions over the past half decade, but only now has the California governor finally conceded that his state has become a political punchline rather than a model, demonstrating the consequences of progressive governance. In a de facto admission of policy failure, Newsom signed two rare bipartisan bills dramatically [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3461521/gavin-newsom-decides-he-wants-to-build-but-do-his-residents/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/newsom-dc-visit-trump-biden.webp","video":null,"publish_date":"2025-07-03 19:23:12","author":"Tiana Lowe Doescher","authors":["Tiana Lowe Doescher"],"language":"en","category":"politics","source_country":"US","sentiment":-0.362},{"id":337986918,"title":"Melania Trump talks Taylor Swift, July 4 plans while doing arts and crafts with sick kids at DC hospital","text":"WASHINGTON — First lady Melania Trump joined child patients at a Washington, DC, hospital Wednesday for an arts and crafts hour, bringing teddy bears and other gifts while chatting with the kids about their favorite musical artists and what to expect for Friday’s Independence Day festivities.\n\n“Everybody gets a teddy bear — and more stuff, too,” the first lady said in greeting 10 inpatients and outpatients at Children’s National Hospital. “You know what we’re celebrating tomorrow?”\n\n“Independence Day!” one eager child shouted back.\n\nMrs. Trump’s trip came as House Republicans neared passage of President Trump’s marquee tax-and-spending bill, sending it to the president’s desk.\n\nA full-fledged signing ceremony could take place on the federal holiday, along with a military flyover including F-22s, F-35s and B-2 bombers — the same jets that decimated three Iranian nuclear sites just last month.\n\n“It’s a very special day,” the first lady said. “So we will have a big party at the White House … when you feel better, maybe next year, you come over and we’ll celebrate together.”\n\nMelania quizzed the kids about their favorite foods, sports and musical as they decorated rocks before placing American flags in planters in the Bunny Mellon Healing Garden, dedicated during President Trump’s first term in 2017.\n\nOne child shared that Taylor Swift — whom the president deemed “no longer ‘HOT’” in May — was the best singer, to which the first lady responded diplomatically that the “Bad Blood” hitmaker was “very talented.”\n\nTrump in mid-May had posted about the pop star, who endorsed Vice President Kamala Harris over him in the 2024 election, on his way home from a trip to the Middle East: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’”\n\n“I actually really like Sabrina Carpenter,” another girl coloring at the craft table added.\n\n“She’s great too,” the first lady said before walking with the children out to the garden to present the hospital with a new yellow tea rose, called the “Eternal Flame.”\n\nAsked by a child whether she liked to golf, Melania said she doesn’t play, though her husband is often seen out on the links during weekends at his West Palm Beach, Fla., club or Bedminster, NJ, resort.\n\nHospital president and CEO Michelle Riley-Brown the first lady and the youngsters outdoors to place Fourth of July-themed wind propellers and patriotic bows in the planting beds.\n\n“It’s beautiful here,” Melania Trump said.\n\nLater, the first lady visited a three-month-old patient and his family in the Transplant Unit as well as several patients with heart and kidney ailments.\n\nMelania Trump is the eighth first lady to preside over the garden after Jill Biden, Michelle Obama, Laura Bush, Hillary Clinton, Barbara Bush, Nancy Reagan, and Rosalynn Carter. \n\nPhotos of each adorn the wall inside — including one of Jill Biden and the bold toddler who stole the show by playing catch with then-President Joe Biden on a pre-Christmas visit to Children’s National in December 2024.","summary":"\"Everybody gets a teddy bear -- and more stuff, too,\" the first lady said in greeting 10 inpatients and outpatients at Children's National Hospital.","url":"https://nypost.com/2025/07/03/us-news/melania-trump-talks-taylor-swift-july-4-plans-with-sick-kids-at-dc-hospital/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/107557805.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/P3EElhiT-RyIcpnTz.mp4","publish_date":"2025-07-03 19:06:16","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","source_country":"us","sentiment":0.214},{"id":337981776,"title":"CBS’ John Dickerson Says Trump Settlement Jeopardizes Network Holding ‘Power to Account After Paying It Millions’ | Video","text":"“CBS Evening News” anchor John Dickerson used Wednesday’s show to address the elephant in the room. Dickerson took a portion of the news program to talk about the $16 million settlement CBS parent company Paramount made with President Donald Trump.\n\n“The Paramount settlement poses a new obstacle. Can you hold power to account after paying it millions? Can an audience trust you when it thinks you’ve traded away that trust?” Dickerson wondered aloud in his Reporter’s Notebook segment. “The audience will decide that. Our job is to show up to honor what we witness on behalf of the people.”\n\nDickerson’s commentary marks a break in ranks, as the CBS reporter publicly discussed the actions of his parent company. Plus, his sentiments could very well be shared by many newspeople under the Paramount umbrella.\n\nTrump sued Paramount over the pre-election airing of a “60 Minutes” interview with then-presidential candidate Kamala Harris. Trump asserted that the segment was edited in such a light to boost Harris’ profile and make her look better, while simultaneously causing him “mental anguish.”\n\nDickerson acknowledged the strange position he’s been put in since, using his platform to comment on the ramifications of a fellow CBS news program. Still, he felt the story was too significant to ignore as a reporter (the segment was included on Paramount+, but did not technically air on TV). \n\n“Journalists don’t like to report on themselves. Sometimes that’s false humility. Mostly, it’s a practical limitation. Reporters try to find order in chaos. We prefer to explain the cause of a bombing, the intent of a bill, the marvel of a new discovery. Putting chaos in preliminary order helps viewers make sense of their world,” Dickerson said. “They tell us this, at airports, restaurants, at church — the audience brings us their fears, their questions, their good faith view of things. It reminds us that we are stewards of that concern. It’s a grace to receive another’s trust, but also to have a mission that shapes your work. Mission. That can sound grandiose.”\n\nTrump initially sued Paramount for $20 billion over the “60 Minutes” editing. The $16 million settlement will help cover “plaintiffs’ fees and costs,” with the remainder being donated toward a “future presidential library.” “60 Minutes” will also release transcripts of interviews with U.S. presidential candidates going forward. However, an apology from CBS and Paramount was not included in the settlement.\n\nDickerson further asserted that the interview “was done in accordance with long-held CBS News standards and widely accepted journalistic practices.” In the light of such a settlement, he commented on the fallibility of both reporters and their parent organizations.\n\n“We are not all that. Public figures have taught us that misguided mission can do more harm than brute force. We pride ourselves on our BS detector, so it ought to work on ourselves, too. When it doesn’t, the stakes are real — a loss of public trust, the spread of misinformation,” he said. “A visitor to our newsrooms might wonder why we debate a single word for so long, why it takes hours to answer the simple question, ‘What is this story about?’ Why there’s a cry of frustration when a detail is off by an inch. That is what work looks like when it is deeply felt, when the audience’s concerns become ours, passed by bucket brigade from the subjects of our stories, to correspondence, to producers, to editors, fact checkers and writers.”\n\nThis week’s settlement is one of a growing number made between news organizations and Trump over their reporting. Given the president’s often aggressive stance toward reporters and publications — those he labels as “fake news” — reporters are beginning to fear that content may be overly moderated to avoid potential court hangups.\n\nStill, Dickerson concluded his segment by urging reporters and audiences alike to stay the course.\n\n“The network’s first heroes ran to rooftops during the bombing of London. Its current ones carry that same instinct,” he said. “But another story from CBS’s early days also captures this spirit. The young correspondent was filing a story when it started to rain. The takes they’d already filmed were fine. Everybody could have just gone inside, but she persisted the rain, turning the notes in her hand to pulp. Again and again, she worked to get it right. This wasn’t London under the fire. It was just a regular story. That’s the point.”\n\n“So, the rain has picked up, but we’ll stay at it. We hope you will, too. See you tomorrow.”","summary":"\"Can an audience trust you when it thinks you traded away that trust?\" the journalist poses of Paramount's $16 million \"60 Minutes\" settlement\n\n\nThe post CBS&#8217; John Dickerson Says Trump Settlement Jeopardizes Network Holding &#8216;Power to Account After Paying It Millions&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/cbs-john-dickerson-trump-settlement-network-trust/","image":"https://www.thewrap.com/wp-content/uploads/2024/04/Untitled-design-2024-04-09T145845.827.jpg","video":null,"publish_date":"2025-07-03 18:41:30","author":"Casey Loving","authors":["Casey Loving"],"language":"en","category":"politics","source_country":"US","sentiment":-0.123},{"id":337966118,"title":"Over 100,000 undocumented patients have sought medical care following Gov. Abbott’s executive order","text":"AUSTIN (KXAN) More than 100,000 undocumented people sought medical care in Texas in the first four months that hospitals were required to ask every patient their immigration status but that represents a small fraction of all patients during that timeframe.\n\nIn August 2024, Gov. Greg Abbott signed an executive order directing hospitals to start collecting data “regarding patients who are not lawfully present in the United States” beginning Nov. 1, 2024, including the number of patients and the cost of care provided to those patients.\n\nThe Texas Health and Human Services Commission (HHSC) previously released the first set of data in March showing more than 30,000 undocumented people sought medical care in November.\n\nAn updated data release Wednesday shows that figure grew to 108,581 by the end of February, about 2.3% of all patients. More than 4 million patients said they were either a U.S. citizen or in the country lawfully, 84.8% of the statewide total.\n\nHospitals in Texas are required to ask each patient their immigration status, but patients are not required to answer. In the first four months of data collection, almost 617,000 patients 12.9% declined to answer the question.\n\nThe cost of care provided between November and February to patients reported as undocumented totaled more than $434 million, according to Affiliate KXAN’s analysis of HHSC data.\n\nThe number of patients who reported they were undocumented is not uniform across the state. Hospitals in Webb County, home to the city of Laredo in South Texas, had the highest share of undocumented patients. Almost 13% of patients in the county self-identified as not being in the country legally.\n\nHartley County, northwest of Amarillo, was the only other county to have more than 10% of patients who were undocumented. Among the 158 counties that had data, 25 reported no patients who were in the country unlawfully.\n\nOf the 611 hospitals required to collect the data, only 471 were in compliance with the June 1 deadline for updated information, as outlined in Abbott’s order. The data shows 140 hospitals, 22.9%, were not in compliance. KXAN reached out to HHSC to ask what will be done regarding those hospitals and have not yet received a response.\n\nAbbott previously said his executive order was in response to then-President Joe Biden and Vice President Kamala Harris’ “open border policies.”\n\n“Now, Texas has reliable data on the dramatic financial impact that illegal immigration is having on our hospital system,” Andrew Mahaleris, Abbott’s press secretary, said after the initial data release in April. “Because of President Trump’s swift action in securing the southern border, illegal crossings have dropped to record lows. Texas is hopeful that his efforts to remove those who entered unlawfully may also cause these healthcare costs to decline.”\n\nKXAN reached out to the governor’s office Wednesday for comment on the updated data release but have not yet received a response.\n\nHospitals are required to inform patients that responding to the question will not affect their care. Still, immigrant advocate groups are concerned about the executive order’s impact. The American Civil Liberties Union of Texas previously told KXAN it was worried the order would discourage undocumented Texans from seeking necessary medical care.\n\n“This order should not impact anybody’s access to care period,” David Donatti, senior staff attorney with the ACLU of Texas, said. “Whether you are native-born, a U.S. citizen, an immigrant, whatever your status should be, you should be able to access the healthcare that you need, and the facility should not have the ability to block you from receiving that kind of care. That is crystal clear as a matter of federal law.”\n\nThe Texas Hospital Association had no comment Wednesday after the updated data was released, but previously told KXAN that hospitals have complied with the executive order by meeting deadlines and working with the state on clarifications along the way. \n\n“The fact that hospitals are required to collect this data should not be a deterrent for people in need of care. Hospitals remain open and ready to serve Texans’ acute care needs,” said Carrie Williams, chief communications officer with THA. “With 24/7 life-saving care, hospitals are required by law to treat anyone who comes through the door, regardless of ability to pay, regardless of their demographics.”\n\nTexas has the highest uninsured rate in the nation at 17% more than double the national average. Five million Texans had no insurance as of 2022, THA reported. In 2023, hospitals provided more than $8.1 billion in “charity care” for uninsured people, with more than $3 billion not reimbursed.\n\nMost uninsured Texans are citizens, however. While 1.6 million undocumented immigrants live in Texas, they go to the hospital at lower rates than U.S. citizens and make up a minority of the uninsured cost burden on state hospitals, the Texas Tribune reported.\n\nHospitals are required to report the data to HHSC each quarter. As part of the executive order, the data will be reported annually, beginning next year, to the governor, lieutenant governor and speaker of the House.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAUSTIN (KXAN) More than 100,000 undocumented people sought medical care in Texas&#8230;\n\n\nThis Post: Over 100,000 undocumented patients have sought medical care following Gov. Abbott&#8217;s executive order first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/over-100000-undocumented-patients-have-sought-medical-care-following-gov-abbotts-executive-order/","image":"https://internewscast.com/wp-content/uploads/2025/07/rewrite-this-title-100000-undocumented-patients-sought-care-since-Gov.jpg","video":null,"publish_date":"2025-07-03 18:22:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.142},{"id":337957400,"title":"CBS News anchor swipes at parent company for settling Trump lawsuit ‘it said is without basis in law and fact’","text":"John Dickerson ended Wednesday’s broadcast of CBS Evening News by subtly swiping at the network’s corporate boss Paramount for shelling out $16 million to settle Donald Trump’s lawsuit over a 60 Minutes interview, noting that the company itself said the president’s case “is without basis in law and fact.”\n\nThe veteran anchor’s commentary was even more pointed on the show he hosts for the network’s streaming platform, as he noted that the settlement “poses a new obstacle” for the network’s journalists.\n\n“Can you hold power to account after paying it millions? Can an audience trust you when it thinks you’ve traded away that trust?” Dickerson pondered.\n\nJournalists and free speech advocates have absolutely pilloried Paramount for capitulating to the media-bashing president in a case that legal experts described as frivolous and the network’s own lawyers said was completely without merit, warning that it sets an increasingly dangerous precedent.\n\n“Behavior that gets rewarded gets repeated,” the Foundation for Individual Rights and Expression stated. “This settlement will only embolden the president to continue his flurry of baseless lawsuits against the press — and against the American people’s ability to hear the news free from government intrusion.”\n\nBeyond that, the company is facing the threat of civil litigation and congressional probes over allegations that it violated anti-bribery statutes, as Paramount needs the Trump administration to approve its massive $8.4 billion merger with Skydance Media. Paramount, for its part, has insisted that the lawsuit is “completely separate from, and unrelated to” the transaction and the FCC approval process.\n\nAt the end of Wednesday’s telecast of CBS Evening News, Dickerson delivered a fairly straightforward recap of the settlement and what led up to it, which was the editing of a 60 Minutes interview with then-Democratic presidential nominee Kamala Harris just ahead of the 2024 election.\n\n“Under the terms of the settlement worked out with a mediator, Paramount will pay $16 million to cover Mr. Trump’s legal costs. Whatever’s left will go to his presidential library. No money will be paid directly to the president,” Dickerson noted. “The settlement does not require an apology or expression of regret for the editing of the interview, which was done in accordance with long-held CBS News standards and widely accepted journalistic practices.”\n\nThe news host also pointed out that despite Trump’s allegations that CBS ran a different portion of Harris’ answer to a question during a Face the Nation promotional clip to make her look better, the network has repeatedly denied this. Additionally, Dickerson explained that the 60 Minutes transcript revealed that the president falsely claimed the network had pulled a response from another question asked of Harris and “deceptively edited” it in.\n\nAfter telling viewers that a senior Paramount executive told shareholders this week that the corporation only settled to avoid what he called the “high and somewhat unpredictable costs of legal defense, Dickerson brought up that this took place as the company is looking to close the Skydance merger.\n\n“That deal needs Trump administration approval,” he concluded. “The corporation said the settlement of the Trump lawsuit is completely separate from and unrelated to the merger. In the end, Paramount decided to settle a suit it said is without basis in law and fact and an affront to the First Amendment.”\n\nOver on CBS Evening News Plus, which airs on Paramount’s streamers, Dickerson was even less sparing in his criticism of the network’s corporate overlords.\n\n“We pride ourselves on our BS detector, so it ought to work on ourselves, too. When it doesn’t, the stakes are real, a loss of public trust, the spread of misinformation,” he said in a monologue focused on Paramount’s payoff to the president.\n\n“A visitor to our newsrooms might wonder why we debate a single word for so long, why it takes hours to answer the simple question, what is this story about, why there’s a cry of frustration when a detail is off by an inch,” Dickerson continued. “That is what it looks like when it is deeply felt, when the audience’s concerns become ours, passed by bucket brigade from the subjects of our stories to correspondents, to producers, to editors, fact-checkers, and writers.”\n\nNoting that the “obstacles to getting it right are many,” he then declared that the settlement “poses a new obstacle” before asking: “Can you hold power to account after paying it millions? Can an audience trust you when it thinks you’ve traded away that trust?”\n\nIn the end, he pointed out, “the audience will decide that” and that job of CBS News’ journalists is “to show up” and “honor what we witness on behalf of the people we witness it for.”\n\nThe conglomerate, which is hoping to complete its merger later this month, could soon be staring down lawsuits and investigations over claims that it “bribed” the president in order to push the Skydance deal through. \n\n“Today is a dark day for press freedom. Paramount’s spineless decision to settle Trump’s baseless and patently unconstitutional lawsuit is an insult to the journalists of ‘60 Minutes’ and an invitation to Trump to continue targeting other news outlets,” Freedom of the Press Foundation said in a statement. The advocacy group is also gearing up to pursue legal action on behalf of shareholders to “stop this affront” and hold the company’s board accountable.\n\nSens. Ron Wyden (D-OR) and Elizabeth Warren (D-MA), who had warned Paramount in May that a settlement could potentially violate laws against bribery, promised to challenge the settlement in both Congress and the courts.\n\n“This looks like bribery in plain sight,” Warren said on Wednesday. “Paramount folded at the same time it needs Trump's approval for a billion-dollar merger. I’m calling for an investigation into whether any anti-bribery laws were broken, and I'm working on a new bill to rein in this kind of corruption.”\n\nMeanwhile, CBS News staffers past and present are expressing despair and fear over what the settlement means for the once-revered network and its newsmagazine, which has already lost two respected newsroom leaders due to tensions surrounding the company’s handling of the lawsuit.\n\n“No one is a fan of Shari right now,” one network staffer told The Independent, referencing Paramount chair Shari Redstone, who was the driving force behind the decision to settle. “People are still angry and frustrated and morale is very low.”\n\nFormer CBS News correspondent Armen Keteyian called the settlement “the nadir for the network” and “a breach of the public trust Murrow, Cronkite, Hewitt and thousands of us worked decades to build.”","summary":"‘Can you hold power to account after paying it millions? Can an audience trust you when it thinks you’ve traded away that trust?’ John Dickerson asked viewers on Wednesday.","url":"https://www.independent.co.uk/news/world/americas/us-politics/cbs-john-dickerson-paramount-trump-settlement-b2782199.html","image":"https://static.independent.co.uk/2025/07/03/17/20/cbs-evening-news-plus.jpg?width=1200","video":null,"publish_date":"2025-07-03 17:50:43","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.478},{"id":337996914,"title":"Nolte — Golden Era: Trump Settlement Put Tears In CBS Reporter’s Eyes","text":"President Trump is not only successfully suing the regime media, he’s bringing tears to their corrupt eyes.\n\nWelcome to what I consider to be the most golden part of Trump’s Golden Era.\n\nBill Whitaker, the 60 Minutes correspondent who interviewed Kamala Harris in the segment that brought on Trump’s lawsuit, learned that CBS had agreed to pay Trump $16 million during a Wednesday morning Zoom meeting. According to reports, after the “tense” meeting, the 73 year old Whitaker appeared — tee hee — “teary-eyed” and “quite somber.”\n\nHAHAHAHAHAHA!! Trump made the fake news cry! Trump made the fake news cry! First, he made them pay! Then he made them cry! Oh, is the widdle baby gonna have a tantrum now? Does the widdle baby want Trump to get hit by a train now? \n\nIt gets better…\n\nThe report goes on to describe the 60 Minutes staff as “dispirited” — which is just how we like them.\n\nAfter the crybaby Whitaker said a few words during the Zoom meeting, 60 Minutes correspondents Lesley Stahl and Sharyn Alfonsi “voiced deep frustration and dismay” over the settlement.\n\nFew things make me happier than knowing bad people are dispirited, frustrated, dismayed, and have tears in their eyes over a humiliating loss and a glorious piece of accountability.\n\nTrump filed a $20 billion lawsuit against CBS News for editing an interview with then-presidential candidate Kamala Harris in a way that was obviously meant to make her look a little less dumb. This happened just weeks before Election Day. It was a malicious edit with only one motive: to aid and abet the Harris campaign.\n\nWell, you can’t do that. CBS News can survive only because it uses airwaves owned by the public, and does so for free. With this gift comes a legal responsibility to serve the public honestly. Removing Kamala’s word salad and replacing it with the only part of that word salad that sounded halfway intelligent is a dishonest act of intentional misrepresentation on the part of CBS News. The outlet’s smug refusal to release a full transcript of the interview amounted to nothing less than corruption (only after Trump was re-elected did these gangsters release the transcript).\n\nBut we all know why CBS settled…\n\nSure, the Palace Guards in the media like to claim CBS settled to smooth CBS parent company Paramount Global’s merger with Skydance. I don’t think so…\n\nCBS News settled with Trump for the same reason ABC News settled with Trump earlier this year: both outlets knew that discovery (text messages, emails) would reveal just how partisan, corrupt, and dishonest they all are. It would’ve been the CNN defamation suit all over again (which CNNLOL lost) and what those internal CNN texts had revealed about CNN all over again.\n\nThe elites within the regime media are some of the most craven and dishonest left-wing activists on the planet. Bad people who knew discovery would’ve exposed them as such.\n\nIn my opinion, CBS is so corrupt and partisan, it was willing to pay $16 million to keep its texts and emails secret. And that pretty much says it all.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"President Trump is not only successfully suing the regime media, he’s bringing tears to their corrupt eyes.\n\n\nThe post Nolte — Golden Era: Trump Settlement Put Tears In CBS Reporter’s Eyes appeared first on Breitbart.","url":"https://www.breitbart.com/the-media/2025/07/03/nolte-golden-era-trump-settlement-put-tears-in-cbs-reporters-eyes/","image":"https://media.breitbart.com/media/2025/07/GettyImages-2222158648-640x335.png","video":null,"publish_date":"2025-07-03 17:31:18","author":"John Nolte","authors":["John Nolte"],"language":"en","category":"politics","source_country":"US","sentiment":-0.1},{"id":338016018,"title":"ABC Breaks in for Special Report to Dump on Big Beautiful Bill Passage","text":"ABC News Special\nJuly 3, 2025\n2:34 p.m. Eastern\n\nWHIT JOHNSON: Good afternoon. I’m Whit Johnson in New York. We’re coming on the air because House Republicans have just delivered a major victory for President Trump passing his mega spending bill. Final passage coming after an intense pressure campaign from the President, at times even threatening to primary holdout Republicans in both the Senate and the House. There you see speaker Mike Johnson, gaveling that win. He worked around the clock to cross this threshold here, many of his party’s holdouts flipping overnight, ultimately voting yes on the bill. Conservatives and moderates, though, raising some concerns ahead of this vote about cuts to Medicaid, which will cause an estimated 11.8 million Americans to lose their health care. Some also concerned about the price tag, expected to add $3.4 trillion to the debt. President Trump has disputed those estimates. The bill includes more spending for the President’s immigration policies and roughly $4 trillion in tax cuts. The bill passing without any Democratic support. House Minority Leader Hakeem Jeffries taking to the floor for what’s known as the magic minute. He ended up speaking for more than 8.5 hours, breaking a modern-day record, railing against the bill, warning it will have a devastating impact on millions of Americans. President Trump calling this one of the most consequential bills ever. Let’s go to Mary Bruce, our chief White House correspondent, with more Mary, we know this July 4 deadline was self-imposed by the President. We noted that pressure campaign. Ultimately, only two Republicans voted against it. So, what did it take to get this over the finish line? And what does this mean for Trump’s agenda?\n\nMARY BRUCE: It will, Whit. There is no question this is a massive victory, a huge win for President Trump, by far his biggest legislative victory so far in his second term. But this did not come easy. The President and Speaker Johnson had to put down a Republican revolt. This took a lot of arm twisting, cajoling, and haggling. The President deeply involved himself. He’s been working the phones over the last 24 hours, even meeting here at the White House with the holdouts in person. Whit, at one point, he was even handing out Trump merchandise and swag. And of course, the President was willing to give them assurances, especially about how this bill will be implemented. But he also warned that there would be consequences for any Republicans who opposed this. We have heard him in recent days and weeks say that he would primary anyone who got in the way of his agenda. So, those Republicans who voiced concerns one by one, we saw them caving and falling in line over the last 24 hours, despite many of their objections and concerns over what this bill would do to the debt, the $3.4 trillion it’s projected to add to the debt over the next decade, their concerns about what this would mean for Medicaid recipients, the estimated 11.8 million Americans that could lose their health coverage because of this bill, all of them except for two Republicans falling in line. Now, this is the cornerstone of the President’s agenda. You can guarantee there’s a lot of celebrating here at the White House right now, in addition, of course, to what this does for taxes, cutting roughly $4 trillion in taxes, mostly for the wealthiest Americans. It also includes more funding, as you mentioned, for immigration enforcement and border security. It also fulfills some of his campaign promises to eliminate taxes on tips and overtime. But, Whit, now that he has sold Republicans on this, the President now has to go out and sell the American people on this bill. And it starts tonight with a big speech he’s giving in Iowa.\n\nJOHNSON: It sure does, Mary Bruce. And again, as you illustrated, also points out the amount of power that he holds over the Republican party. Mary. Thank you. Once again, let’s go to ABC’s congressional correspondent Jay O’Brien on the Hill. And Jay, I want to talk about the Democrats here because House Democratic leader Hakeem Jeffries, we talked about that marathon, that record-breaking speech on the House floor. He warned all of us that he was going to take his sweet time. He said he felt obligated to do so. But Democrats were powerless. They just didn’t have the votes, so what message was he hoping to send here?\n\nJAY O’BRIEN: Exactly right. Whit. Jeffrey spoke for eight hours and 44 minutes, breaking a record for longest House floor speech that was previously set by Kevin McCarthy, who was speaking at the time in opposition in 2021 to a Biden-era piece of legislation. Jeffries elated — or Jeffries — Democrats elated by his speech. But ultimately, as you said, they did not have the votes to block this bill. They are not in the majority. Speaker Johnson, though, he had his work cut out for him, he could only afford to lose three Republicans. As Mary said, he lost two on two different ideological sides of his party. One is Thomas Massie, who’s a fiscal hawk who did not like the price tag of this bill. The other is Brian Fitzpatrick, a moderate Republican who represents a district in Pennsylvania that Kamala Harris won, who has long expressed concerns about cuts to Medicaid. Ultimately, though, those are the only two Republican no votes that Johnson loses. And this is the culmination of a months long process not just for Speaker Johnson, not just for President Trump, but congressional Republicans writ large, multiple, marathon, into-the-night votes in both the House and the Senate, backroom deal-making and, frankly, drama and dysfunction in their party on full display in both of these votes. But they pull it off, Whit, and they pull it off right before that self-imposed Friday, July 4 deadline from the President.\n\nJOHNSON: A long night on Capitol Hill. And, Jay, I know you’re awake through most of it. We appreciate you and the entire team. Thank you. Once again, our breaking news right now, the House passing President Trump’s sweeping spending bill — that big, beautiful bill.","summary":"ABC was surprisingly the only major broadcast network to break in Thursday afternoon for a special report on the House passage of President Trump’s Big Beautiful Bill, which he’s slated to sign into law Friday. What was unsurprising, however, was the ABC presented a wholly negative perspective declaring the bill was to “mostly” benefit “the wealthiest Americans” while stating as though it’s a done deal that “an estimated 11.8 million Americans” will “lose their health care.”\n\nWeekend Good Morning America co-host and Saturday World News Tonight anchor Whit Johnson helmed the ABC News Special Report, sharing the bill’s final pssage came after Speaker Mike Johnson (R-LA) having “worked around the clock to cross this threshold here, many of his party’s holdouts flipping overnight, ultimately voting yes on the bill.”\n\nHe then descended into all the standard liberal talking points, ignoring the tax cuts being extensions of ones that already exist, what “cuts to Medicaid” actually are (and instead calling it a fact ","url":"https://www.newsbusters.org/blogs/nb/curtis-houck/2025/07/03/abc-breaks-special-report-dump-big-beautiful-bill-passage","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-07/2025-07-03-ABC-Special-OBBBPassesHouse.jpg?itok=jVO2EN4W","video":null,"publish_date":"2025-07-03 17:15:00","author":"Curtis Houck","authors":["Curtis Houck"],"language":"en","source_country":"US","sentiment":-0.219},{"id":337974256,"title":"Elizabeth Warren Calls for 'Investigation' Into Paramount's Trump Settlement Amid Pending Merger Approval: 'Looks Like Bribery'","text":"Massachusetts Sen. Elizabeth Warren is calling for an investigation into Paramount's $16 million settlement with President Donald Trump as the entertainment giant awaits federal approval for a pending merger.\"This looks like bribery in plain sight,\" Warren wrote in an X post shared Wednesday. \"Paramount folded at the same time it needs Trump's approval for a billion-dollar merger.\"\"I'm calling for an investigation into whether any anti-bribery laws were broken, and I'm working on a new bill to rein in this kind of corruption,\" Warren added.In October 2024, Trump filed a $10 billion lawsuit against CBS News and its parent company, Paramount, alleging defamation over a \"60 Minutes\" interview with then–presidential nominee and Vice President Kamala Harris, PBS News reported.Trump claimed an interview segment concerning the Middle East was deceptively edited to portray Harris more favorably. In February, he amended the complaint, increasing the demand to $20 billion and adding federal claims of false advertising and unfair competition.On Tuesday, Paramount agreed to a $16 million settlement, according to CBS News, which will be paid out as a contribution to Trump's future presidential library and coverage of the plaintiffs' legal fees and costs. The agreement comes as Paramount Global awaits federal approval for its proposed $8 billion merger with Skydance Media.In recent weeks, lawmakers, regulatory experts and shareholders have raised concerns that Paramount's controlling shareholder, Shari Redstone, and others involved in the settlement could face potential bribery allegations, Deadline reported.Critics have argued the financial settlement was made in exchange for Trump smoothing the path to regulatory approval, mirroring lawsuits and political battles he has waged against Disney and NBCUniversal.Originally published on Latin Times","summary":"Donald Trump was awarded $16 million in a settlement with CBS News and Paramount after suing over a \"60 Minutes\" interview he favored Kamala Harris.","url":"https://www.ibtimes.com/elizabeth-warren-calls-investigation-paramounts-trump-settlement-amid-pending-merger-approval-3777574","image":"https://d.ibtimes.com/en/full/4608832/warren-trump-bribery-07032025-1.jpg","video":null,"publish_date":"2025-07-03 17:08:14","author":"Name Whose Voters","authors":["Name Whose Voters"],"language":"en","source_country":"US","sentiment":0.059},{"id":337947366,"title":"DAVID MARCUS: PBS, NPR and a lethal case of TDS","text":"For the first time, after decades of trying, Republicans appear on the verge of defunding PBS and NPR over the wild left-wing bias of their news reporting, and remarkably, rather than promising changes, the progressive elites in charge are doubling down on Trump derangement. It's all happening even as Congress considers a rescission bill from President Donald Trump to slash their lefty slush fund. WHITE HOUSE URGES CONGRESS TO CUT FEDERAL FUNDING FOR NPR, PBS On Wednesday, the PBS NewsHour aired a segment on Trump’s victory in a lawsuit against CBS News, which settled for $16 million over deceptive editing by \"60 Minutes\" of a Kamala Harris interview during the 2024 campaign. To address the issue, they brought on CNN’s Brian Stelter, yes the same Brian Stelter who, with a straight face, parroted the ludicrous White House line that President Biden was fine and just a victim of right-wing video \"cheap fakes,\" last year. You remember, about eight minutes before Grandpa Joe imploded on a debate stage. You will not be surprised to learn that the left-wing, water-carrying Stelter told the left-wing water-carrying NewsHour that the left-wing water-carrying \"CBS did not actually do anything wrong here. CBS engaged in standard television news editing practices.\" At this point, in a failure of journalistic ethics that would make Pravda blush, supposedly straight news anchor Amna Nawaz gave Stelter’s astounding lie no pushback. In fact, the abjectly subjective and obviously biased opinion of Stelter was simply treated as fact. So what really happened? We all saw it. One morning during the election campaign, \"60 Minutes\" put out a clip of its Harris interview in which she answered a question about Israel with a run-on nonsense sentence that made Joe Biden look eloquent. But, lo and behold, when the episode aired, the answer that we had already seen was no more, replaced by a highly edited version that made Harris almost seem cogent. In the original clip, when host Bill Whittaker asks why Israeli Prime Minister Benjamin Netanyahu is not listening to Biden, Harris said the following: \"Well, Bill ... the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by or a result of many things including our advocacy for what needs to happen in the region.\" And here is the answer that eventually aired on the program: \"We are not going to stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.\" In no universe of fair and honest journalism can this blatant clean-up on aisle Harris be viewed as anything other than CBS News trying to make the Democrat candidate look better. It's not a standard practice, it's a lie. PBS NewsHour and Stelter didn’t dare roll the actual tapes, or their feeble claim that CBS News parent company Paramount is bribing Trump to get approval for a merger would have collapsed faster than CNN’s ratings. And this is not a new issue for public broadcasting. It was April of last year when longtime NPR editor Uri Berliner penned a scathing column about the outrageous, if soft-spoken, bias at the outlet. But have we seen any changes? Have we seen the executives who run PBS and NPR take any action to present a fair news product? Obviously not. As the Stelter interview shows, these outlets are still as bad as ever. It very much seems that, having resigned themselves to the fact that Republicans are going to cut their direct federal funding, PBS and NPR have decided to go all in on the anti-Trump sentiment their base craves. Maybe they can move a few extra tote bags and umbrellas. Given the utter lack of remorse shown by PBS and NPR, even when evidence of their rank bias piles up like garbage during a trash strike, no self-respecting Republican should vote to give them a dime. CLICK HERE FOR MORE FOX NEWS OPINION PBS and NPR have been given years, even decades, to clean up their act and live up to their responsibility to provide unbiased news in the service of the public, not in the service of the Democrat Party. Time is up. Public broadcasting can be a propaganda arm of the Left or it can be funded by taxpayers; It can no longer be both. CLICK HERE TO GET THE FOX NEWS APP And after all, with the passage of Trump’s One Big Beautiful Bill, millions of people who love public broadcasting will be free to donate their significant tax savings to PBS and NPR, while the rest of us can opt out of funding fake news. I call that a win-win. CLICK HERE TO READ MORE FROM DAVID MARCUS","summary":"Republicans near defunding PBS and NPR over alleged left-wing bias, with Trump&apos;s rescission bill pending as broadcasters face criticism for CBS News settlement coverage","url":"https://www.foxnews.com/opinion/david-marcus-pbs-npr-lethal-case-tds","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/BrianStelter.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-03 17:01:28","author":"David Marcus","authors":["David Marcus"],"language":"en","source_country":"us","sentiment":-0.073},{"id":337957102,"title":"Donald Trump Exposing Himself to Massive Security Risks by Being Reckless 'Dial-a-Prez' — With Habit of Calling Reporters Personally","text":"Donald Trump is perhaps the most technologically forward president in history, and keeps his cell phone glued to his side, ready to take a personal call or send a self-serving tweet. \n\nHowever, RadarOnline.com can report security experts have warned the more attached Trump remains to his phone, the higher the target he becomes to hackers.Aides and advisors say Trump is often open to picking up his phone, even when he does not recognize the number. \n\n\"He just answers the phone,\" one assistant told The Atlantic. \"He doesn’t want to miss phone calls.\"\n\nThe president is said to have at least two different phones – one of which is devoted purely to his obsession with social media. He has changed his phone numbers multiple times, and political insiders say each phone has been given additional security features.\n\n\"He is not walking around with a run-of-the-mill iPhone off the shelf,\" one adviser said.Hacking ThreatsStill, there is concern about the president's privacy, and susceptibility to possible hacking attacks. \n\nBen Rhodes, President Barack Obama’s former speechwriter and deputy national security adviser, told the publication: \"It’s an obvious massive risk, especially given what we know about Chinese penetration of phones in recent years.\"\n\nDuring the 2024 presidential campaign, both Trump and his democratic opponent, Kamala Harris, found themselves at the center of a national security scare amid fears their phones were hacked into by Chinese spies.It's Happened BeforeEarlier that same year, three members of Iran's Revolutionary Guards Corps were charged with trying to disrupt the election by hacking into Trump's phone.\n\nPolitico first reported the hack after receiving emails from an anonymous account, including documents from Trump's campaign.\n\nAccording to the Trump camp, Iranian hackers \"sent a spear phishing email in June to a high-ranking official on a presidential campaign.\"\n\nIn a statement at the time, Steven Cheung, the Trump campaign's communications director, said the documents were \"obtained illegally from foreign sources\" and \"intended to interfere\" with the 2024 election.\n\nHe said: \"A new report from Microsoft found that Iranian hackers broke into the account of a 'high-ranking official' on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump's selection of a vice presidential nominee.\"Resistance to ChangeThe documents leaked to the political outlet were deemed authentic by two sources familiar with the matter.\n\nOne of the documents reportedly included Trump's running mate's vetting file. It included a 271-page dossier on the Ohio Senator's records, as well as his public criticisms of the former president.\n\nHowever, the repeated attempts to infiltrate the president's phones have not slowed his addiction to them, and it looks like aides and advisers have simply decided to give up trying to get Trump to change.\n\n\"He calls people nonstop,\" Trump’s campaign adviser Chris LaCivita said in an interview during the Republican National Convention last year. \"I don’t worry about it, because what are you going to do? Take his phone? Change his phone number? Tell him he can’t make phone calls?\"","summary":"Experts have warned the more attached Donald Trump remains to his personal cell phone, the higher the target he becomes to hackers.","url":"https://radaronline.com/p/donald-trump-security-risks-cell-phone-hacking/","image":"https://media.radaronline.com/brand-img/fYtiYp1rv/0x0/donald-trump-cell-phone-1751559834889.jpg","video":null,"publish_date":"2025-07-03 16:45:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","category":"politics","source_country":"us","sentiment":-0.325},{"id":337936814,"title":"Ex-CBS anchor Dan Rather laments Paramount settlement with Trump as ‘sad day for journalism’","text":"Disgraced ex-CBS News anchor Dan Rather condemned the $16 million settlement between his former outlet’s parent company and President Donald Trump on Wednesday. In an interview with Variety, the former anchor said that Paramount paying Trump $16 million was the media company groveling to the president. \"It’s a sad day for journalism. It’s a sad day for ’60 Minutes’ and CBS News. I hope people will read the details of this and understand what it was. It was distortion by the President and a kneeling down and saying, ‘yes, sir,’ by billionaire corporate owners,\" he told the outlet. FAIR ELECTION FUND URGES FCC TO HOLD CBS ACCOUNTABLE FOR 'UNLAWFUL CONDUCT’ RELATED TO ’60 MINUTES’ INTERVIEW Paramount Global and CBS agreed on Tuesday to pay Trump a $16 million settlement following the president’s election interference lawsuit against the network. This will cover legal fees, costs of the case, and contributions to his future presidential library or charitable causes, to be determined at Trump’s discretion. The media companies may have to pay another eight figures to Trump to cover advertisements, public service announcements, or other similar transmissions, in support of conservative causes by the network in the future, Fox News Digital has learned. Additionally, sources told Fox News Digital that CBS has agreed to update its editorial standards to install a mandatory new rule that the network will promptly release full, unedited transcripts of future presidential candidates’ interviews. Trump filed the lawsuit against the network — which was originally for $20 billion — based on his allegation that \"60 Minutes\" deceptively edited an interview with former Vice President Kamala Harris that aired prior to the 2024 election. ‘60 MINUTES’ PRODUCERS RAIL AGAINST TRUMP'S 'BULLS---' LAWSUIT, DREAD PROSPECTS OF PARAMOUNT MAKING SETTLEMENT Rather, who stepped down from his role as CBS Evening News anchor in 2005 and left the network the following year after reporting a discredited story about then-President George W. Bush, argued that there was no reason for Paramount and CBS to settle with Trump. \"What really gets me about this is that Paramount didn’t have to settle,\" he told Variety. \"You settle a lawsuit when you’ve done something wrong. ’60 Minutes’ did nothing wrong. It followed accepted journalistic practices. Lawyers almost unanimously said the case wouldn’t stand up in court.\" The former anchor added that his support for CBS News and \"60 Minutes\" is \"total, absolute,\" and noted that he believes much of the staff did their best to fight back against the suit. \"I do really think they fought a good fight on this, and they’ll continue to fight. The people on ’60 Minutes’ and at CBS News didn’t just take it lying down. They did their best to stop it.\" He mentioned he wasn’t surprised that Paramount and CBS executives settled, though. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"Big billionaire business people make decisions about money. We could always hope that they will make an exception when it comes to freedom of the press, but it wasn’t to be,\" he said, adding, \"Trump knew if he put the pressure on and threatened and just held that they would fold, because there’s too much money on the table.\" Rather then characterized the settlement as a \"sell-out to extortion by the president.\" The Wall Street Journal’s editorial board also criticized Trump’s lawsuit against CBS News and other outlets, referring to it as \"lawfare\" in a column Wednesday. Additionally, the editorial stated, \"President Trump has taunted the media for years, and some of his jibes are deserved given the groupthink in most newsrooms. What’s happening now, though, is different: The President is using government to intimidate news outlets that publish stories he doesn’t like. It’s a low move in a free country with a free press.\" CLICK HERE TO GET THE FOX NEWS APP Reps for Paramount did not immediately reply to Fox News Digital's request for comment.","summary":"Former CBS anchor criticized Paramount&apos;s $16 million Trump settlement over &quot;60 Minutes&quot; editing claims, arguing the network &quot;did nothing wrong&quot; and shouldn&apos;t have yielded to pressure.","url":"https://www.foxnews.com/media/ex-cbs-anchor-dan-rather-laments-paramount-settlement-trump-sad-day-journalism","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/05/931/523/DAN-RATHER-2015.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-03 16:34:04","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":-0.209},{"id":337920784,"title":"Trump’s War On The Press Might Feel Unprecedented, But It’s Not","text":"President Donald Trump speaks to reporters on the South Lawn before boarding Marine One and ... More departing the White House on July 01, 2025. (Photo by Anna Moneymaker/Getty Images)\nGetty Images\n\nThe newly announced $16 million settlement between CBS News and President Trump — over an edited 60 Minutes segment with Kamala Harris that Trump claimed was misleading — might look like yet another media skirmish involving a president who’s made press intimidation a hallmark of his playbook.\n\nBut while it’s easy to wring one’s hands over what looks like yet another erosion of the free press courtesy of Trump, it’s important to remember: He’s not the first president to wage war on the media. And he definitely won’t be the last.\n\nBasically, it’s worth keeping in mind some perspective here.\n\nNow in his second term, Trump is certainly using the levers of federal power to reshape the media, sideline critical voices, and pressure newsrooms through lawsuits and regulatory threats. As The Wall Street Journal editorial board put it: “The President is using government to intimidate news outlets that publish stories he doesn’t like. It’s a low move in a free country with a free press.”\n\nTrump’s war on the press is nothing new\n\nCBS says its Harris segment was edited for time, a standard industry practice. But Trump had leverage and decided to use it: The case landed just as CBS’s parent company, Paramount, was seeking government approval for its merger with Skydance. Trump got his pound of flesh, while CBS was essentially forced to pay a tax to pave the way for its merger.\n\nAs unsettling as this moment may feel, though, it’s actually not without precedent — presidents have long clashed with the press whenever coverage has cut too close to the bone. And some have gone much farther than Trump.\n\nMORE FOR YOU\n\nThomas Jefferson, for example, was once a free press champion before newspapers of the time turned against him. He used political influence to support libel prosecutions against unfriendly editors, steered government printing contracts to sympathetic newspapers, and privately derided the press as a “polluted vehicle” of falsehoods. “Nothing can now be believed which is seen in a newspaper,” he wrote in 1807.\n\nDuring the Civil War, meanwhile, Abraham Lincoln authorized the suspension of habeas corpus and allowed military authorities to arrest civilians including journalists without trial. His administration also shut down newspapers critical of the Union war effort and detained editors who were seen as sympathetic to the Confederacy.\n\nWoodrow Wilson signed the Espionage Act, which would later be weaponized to punish too-critical journalism, while Richard Nixon used federal agencies to spy on and discredit reporters. Even President Obama, widely seen as media-friendly, clashed with the press in his own way.\n\nThe Obama administration aggressively pursued leakers, seized journalists’ phone records, and labeled one Fox News reporter a “co-conspirator” in a leak investigation. While Obama avoided Trump’s bombastic style of media bashing, his White House still used institutional power along these lines to the fullest degree.\n\nTrump, by contrast, doesn’t seem to have any interest in precedence or subtlety. He’s rewritten the rules of presidential-media engagement — replacing traditional White House briefings with podcast interviews, settled lawsuits on political terms, and called for pushing out network executives who don’t play ball. The CBS settlement, which coincided with a very particular regulatory dependency, highlights how Trump is not just fighting the media — he’s reshaping the incentives that govern it.\n\nThe WSJ was right to call this a “low move.” But it’s not an unprecedented one. Presidents like Trump will always fight the press. The more interesting question is who’s still willing to push back.\n\nEditorial StandardsReprints & Permissions","summary":"From Abraham Lincoln to Donald Trump, U.S. presidents have a long history of clashing with the media and members of the press.","url":"https://www.forbes.com/sites/andymeek/2025/07/03/trumps-war-on-the-press-might-feel-unprecedented-but-its-not/","image":"https://imageio.forbes.com/specials-images/imageserve/6865e344ac400ebb4a7f333b/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-07-03 16:00:22","author":"Andy Meek,Anna Moneymaker,Senior Contributor","authors":["Andy Meek","Anna Moneymaker","Senior Contributor"],"language":"en","source_country":"US","sentiment":-0.224},{"id":337992326,"title":"At the Races: OBBB vs. OBUB","text":"Welcome to At the Races! Each week we bring you news and analysis from the CQ Roll Call campaign team. Know someone who’d like to get this newsletter? They can subscribe here.\n\nAfter quelling a potential uprising from fiscal conservatives, House Republicans handed President Donald Trump a big win Thursday when they approved the massive tax and spending package that’s key to his domestic policy vision. \n\n“Republicans in Congress have succeeded in our mission to enact President Trump’s America First agenda,” Speaker Mike Johnson said in a statement praising the legislation, dubbed the “one big beautiful bill.” \n\nBut Republicans also handed Democrats, who are united in their opposition, a midterm message. The party’s leader in the House, Hakeem Jeffries, didn’t have the votes to scuttle the measure he’s taken to calling the “one big ugly bill,” but he used his record-breaking floor speech to highlight its less popular elements, such as cuts to Medicaid and food assistance benefits and tax cuts for wealthy Americans.\n\nDuring his eight-hour, 44-minute, 25-second talkfest, Jeffries called the measure an “extraordinary assault” on the economy, veterans, small businesses, farmers and health care. “Beginning on Jan. 20, a flood of extremism the likes of which have never before been seen in the United States of America has been unleashed on the American people, an all-out assault on the American way of life,” he said.\n\nPolls show several parts of the budget bill are unpopular with voters: Several recent surveys found support for the measure underwater.\n\nThe Democratic Congressional Campaign Committee said it plans to use the bill to hammer Republicans, particularly those hailing from swing districts who’ve expressed concerns that the sweeping measure could lead to the closure of rural hospitals and hurt vulnerable populations. Jeffries name-dropped several of them in his floor remarks, including Reps. David Valadao of California, Mike Lawler of New York and Mariannette Miller-Meeks of Iowa. All ended up voting for the measure, which saw just two Republican defections: Kentucky’s Thomas Massie and Pennsylvania’s Brian Fitzpatrick, a co-chair of the Problem Solvers Caucus.\n\nRepublicans will embark on their own messaging mission, focusing on the bill’s more popular aspects, such as provisions to temporarily eliminate federal taxes on tips and bolster funding for border security. \n\n“Democrats want to maintain the status quo,” North Carolina Rep. Richard Hudson, who chairs the National Republican Congressional Committee, wrote in an op-ed for Breitbart News. “Republicans want you to keep more of what you earn. That’s the choice. And that’s the message we’ll be driving home across every battleground in America.”\n\nJohnson reiterated that point in his statement after the bill’s passage. \n\n“It should never be forgotten that every single House Democrat voted against all of it,” he said.\n\nStarting gate\n\nHeading for the exits: North Carolina Sen. Thom Tillis and Nebraska Rep. Don Bacon became the latest members of the Republican mainstream to opt for retirement this past week, as Trump tightens his grip on the modern GOP. \n\nAllred again: Texas Democrat Colin Allred, a former NFL player who served three terms in the House, is running for Senate for the second straight cycle, this time for the seat held by Republican John Cornyn. In 2024, Allred lost to Cornyn’s colleague, Sen. Ted Cruz, by more than 8 points. \n\nSouth Dakota launch: Rep. Dusty Johnson, South Dakota’s at-large member of Congress, joined a growing field of Republicans running for governor of the Mount Rushmore State. In his launch video, the co-chair of the Main Street Caucus highlighted his record of supporting Trump on immigration and other issues.\n\nEvans out: Pennsylvania Rep. Dwight Evans, who’s faced health issues over the past year, announced this week that he won’t seek a sixth full term representing his western Philadelphia district next year. The Democrat has been a mainstay in Keystone State politics for decades, serving more than 35 years in the state House before his election to Congress. \n\nSpecial election set: Democrat James Walkinshaw easily won his party’s nomination over the weekend in the special election to succeed his former boss, the late Virginia Rep. Gerald E. Connolly. Walkinshaw, a Fairfax County supervisor, will face Republican Army veteran Stewart Whitson in the Sept. 9 contest for the remainder of Connolly’s term. \n\nWait till next term: The Supreme Court last week delayed a decision on the constitutionality of Louisiana’s congressional map, announcing it needed more information and that the case would be re-argued next term. The Louisiana map was redrawn last cycle to include a second Black-majority district. Separately, the court announced this week that it would also hold oral arguments next term on a Republican-led challenge to the limits on how much national political parties can spend in coordination with federal candidates.\n\nThat was fast: Two months after announcing his bid to unseat Republican Rep. Ashley Hinson in Iowa, Democrat Kevin Techau has suspended his campaign for the 2nd District. The former U.S. attorney for the Northern District of Iowa said he wasn’t able to meet “the threshold level [of fundraising] that this race demands.”\n\nTorres takes a pass: Rep. Ritchie Torres says he’s unlikely to run for governor of New York in 2026. The Bronx Democrat had been weighing a primary challenge to Democratic Gov. Kathy Hochul, but he told MSNBC he wants to remain in Congress to “fight the catastrophe that is the Trump presidency.”\n\nBacking Foxx: Leaders We Deserve, the group led by former Democratic National Committee vice chair David Hogg, is backing Deja Foxx in this month’s Democratic primary for the special election in Arizona’s 7th District. Foxx is one of five Democrats competing to fill the Tucson-centered seat left open by the death of Rep. Raúl M. Grijalva in March. The field also includes Grijalva’s daughter, former Pima County Supervisor Adelita Grijalva.\n\nRepublican primaries: Former South Carolina Lt. Gov. André Bauer has launched a primary challenge against Republican Sen. Lindsey Graham, questioning the incumbent’s conservative bona fides. Graham already has Trump’s endorsement. And in Kentucky, businessman Nate Morris became the third high-profile Republican to join the race to succeed retiring former Senate Majority Leader Mitch McConnell. \n\nOn the House battleground ballot: Retired Navy SEAL Matt Maasdam is seeking the Democratic nomination to challenge Republican freshman Tom Barrett in Michigan’s 7th District. In Nebraska, Omaha City Council member Brinker Harding has entered the GOP primary to succeed retiring Rep. Bacon in the 2nd District. And in California, Democratic freshman George Whitesides got his first high-profile Republican challenger when Santa Clarita Councilman Jason Gibbs entered the race. Gibbs has the backing of former Rep. Mike Garcia, whom Whitesides unseated last year. \n\nGetting crowded in Texas: George Foreman IV, the son of the celebrated late boxer and businessman, is running as an independent in the Nov. 4 special election for Texas’ 18th District. Foreman joins a staggering field of more than two dozen candidates looking to fill the remaining term of Democratic Rep. Sylvester Turner, a former Houston mayor who died in March. \n\nLawsuit refiled: Trump this week filed a motion to drop his federal lawsuit against Iowa pollster J. Ann Selzer over a public opinion survey that showed him trailing former Vice President Kamala Harris in the state during the run-up to the 2024 election. He later refiled the lawsuit, which alleges that the Iowa poll amounted to election interference, in state court.\n\nNathan’s notes\n\nSince at least 1930, each election cycle has seen an average of five open Senate seats. With Tillis retiring, there are now seven senators who’ve decided against seeking another term in the chamber next year. And that list could grow, Roll Call elections analyst Nathan L. Gonzales of Inside Elections writes.\n\nWhat we’re reading\n\nStu says: Roll Call political analyst Stuart Rothenberg takes a look at the New York City mayoral race and draws a few parallels between presumptive Democratic nominee Zohran Mamdani and himself. \n\nMore Mamdani: Mamdani’s victory in New York City, which ranked-choice tabulations confirmed this week, wasn’t the first time the self-described democratic socialist had taken on the establishment and won. Slate writer Alessandro Marazzi Sassoon, who attended middle school with Mamdani, looks back on a mock presidential election at their school — and 12-year-old Mamdani’s upset win. \n\nTweeting from the grave: Politico reviewed the social media accounts of several recently deceased lawmakers and found that they are continuing to weigh in on a variety of topics, from posthumous endorsements to recent election results. \n\nNext phase: NOTUS spotlights the push to restrict the use of mifepristone, one of the drugs used in medication abortions. The effort is largely funded by a dark money group aligned with conservative legal activist Leonard Leo, the outlet reports.\n\nLeaning in in the Lone Star State: The Texas Tribune takes a look at Cornyn’s efforts to embrace the president as he stares down the “toughest electoral challenge” of his long career.\n\nThe count: 221,641\n\nThat’s the average number of people who receive their health insurance through Medicaid in the 62 House districts rated as competitive by Inside Elections. The total is about 5 percent higher than in the average noncompetitive House district (210,973). \n\nSimilarly, the average competitive House district has 17,037 children receiving health care through the Children’s Health Insurance Program, or CHIP, which is nearly 6 percent higher than in districts rated safe for either party.\n\nAlthough Trump said last week that Medicaid was “left alone” in the budget reconciliation bill, the Congressional Budget Office estimates the measure would cut gross federal Medicaid and CHIP spending by $1.02 trillion over the next 10 years. It expects that 11.8 million more people will be uninsured over the period as a result of the legislation. \n\nDemocrats and some town hall attendees have warned that Medicaid eligibility and financial cuts would result in people dying, but the White House and Republican supporters have argued that the cuts are about eliminating waste and fraud and target “able-bodied adults” who choose not to work. \n\n— By Roll Call’s Ryan Kelly\n\nTrump is expected to sign the sweeping budget reconciliation bill on Friday after Republicans delivered him his signature domestic policy legislation a day ahead of his requested July 4 deadline. \n\nAt the Races wishes our readers a happy and peaceful Independence Day!\n\nPhoto finish\n\nSubscribe now using this link so you don’t miss out on the best news and analysis from our team.","summary":"Welcome to At the Races! Each week we bring you news and analysis from the CQ Roll Call campaign team. Know someone who’d like to get this newsletter? They&#160;can subscribe here. After quelling a potential uprising from fiscal conservatives, House Republicans handed President Donald Trump a big win Thursday when they approved the massive tax [&#8230;]\n\n\nThe post At the Races: OBBB vs. OBUB appeared first on Roll Call.","url":"https://rollcall.com/2025/07/03/at-the-races-big-beautiful-bill/","image":"https://rollcall.com/app/uploads/2024/12/AT-THE-RACES-LOGO-2024RCHP16x9.jpg","video":null,"publish_date":"2025-07-03 16:00:00","author":"Daniela Altimari,Republican John Cornyn","authors":["Daniela Altimari","Republican John Cornyn"],"language":"en","category":"sports","source_country":"US","sentiment":0.075},{"id":337924130,"title":"Deb Fischer backs Omaha city councilman for Don Bacon’s House seat","text":"“Throughout a lifetime of service to Omaha and Nebraska, Brinker Harding has always championed public safety, economic development, and fiscal responsibility,” Fischer wrote in a post on X. “Brinker will make America safer, stronger, and more prosperous. I am honored to endorse him for Congress.”\n\nFischer’s endorsement likely won’t move many voters, but it will bring attention to Harding’s campaign. The city councilman will need help to fend off Democrats in a district that former Vice President Kamala Harris won in 2024. The Democratic Party is expected to focus significantly on this pickup opportunity.\n\nHarding also recently earned the endorsement of Jean Stothert, Omaha’s longest-serving mayor who recently lost reelection. She served the city from 2013 to 2025.\n\nHarding, who has served as an Omaha city councilman since 2017, announced his campaign on Tuesday.\n\n“I’m running for Congress to make America more like its heartland,” Harding said. “I want to take those good things we do in Omaha, like balancing the budget, [having] record-low crime [and] a strong economy, and take that to Washington and be successful.”\n\nThe Omaha city councilman could face GOP challenges from former state Sen. Brett Lindstrom and Dan Frei, who challenged Bacon in the 2024 GOP primary. Business owner Denise Powell and state Sen. John Cavanaugh have announced Democratic bids.\n\nDON BACON WILL NOT SEEK REELECTION IN 2026 IN KEY SWING DISTRICT\n\nHarding is hoping to distance himself from the field with a seasoned campaign team that has worked with Bacon and Fischer. “We will be the hardest working, the most organized, and we will win, not only the primary, but we will win the general election come next November,” Harding said.\n\nThe Cook Political Report rates Nebraska’s 2nd Congressional District as “lean Democrat.”","summary":"Sen. Deb Fischer (R-NE) endorsed Omaha City Councilman Brinker Harding in his bid for Rep. Don Bacon&#8217;s (R-NE) swing House seat in 2026. Fischer&#8217;s backing signals the Republican establishment is behind Harding, the vice president of the Omaha City Council, in his pursuit to keep the seat red. Bacon announced he would not run for [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3462080/deb-fischer-backs-omaha-city-councilman-brinker-harding-don-bacon-house-seat/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/deb-fischer.webp","video":null,"publish_date":"2025-07-03 15:36:18","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":0.199},{"id":337904914,"title":"Essence Fest leads a summer of events for Black entrepreneurs galvanized by economic uncertainty","text":"In a year when the U.S. consumer has been weighed down by economic uncertainty, geopolitical tensions and inflation, Black entrepreneurs are eager to get to the Essence Festival of Culture to connect with their core customers.\n\n\"Essence Fest is like my Black Friday,\" said Rochelle Ivory, owner of beauty brand On the Edge Baby Hair. \"It is my biggest sales weekend of the year. It's where I make all the capital I reinvest in my business.\"\n\nEssence Fest kicks off on Friday, with roughly 500,000 people attending the event in New Orleans. It generates around $1 billion in economic activity, according to organizers.\n\n\"It's the cannot-miss event for us,\" said Brittney Adams, owner of eyewear brand Focus and Frame. She said this year Essence Fest is even more important because she's seen Black consumers pulling back on spending.\n\n\"I would say the uncertainty of just the economic and political climate — that's giving people a little bit of hesitancy. Should they save the money? Should they buy the things they want?\" Adams said.\n\nIvory said her sales are down roughly 30% year over year, but she's hopeful people come to New Orleans looking to spend their time and money in the festival marketplace.\n\n\"This could make or break some of us,\" she said. \"It's one of the few places where Black women, Black founders can really come together and be seen.\"\n\nThe Global Black Economic Forum aims to bring visibility and create solutions for Black business owners at Essence Fest. This year speakers include Supreme Court Justice Ketanji Brown-Jackson and Maryland Gov. Wes Moore. Last year, then-Vice President Kamala Harris spoke.\n\n\"We intentionally curate a space that allows leaders to preserve, build and reimagine how we can collectively increase economic opportunity to thrive,\" said Alphonso David, CEO of the GBEF.","summary":"Essence Fest kicks off on Friday, with roughly 500,000 people attending the event in New Orleans. It generates around $1 billion in economic activity.","url":"https://www.cnbc.com/2025/07/03/essence-fest-leads-a-summer-of-events-for-black-entrepreneurs.html","image":"https://image.cnbcfm.com/api/v1/image/108167591-1751548693740-gettyimages-2160320047-DJ_Chark_Football_Camp_2024.jpeg?v=1751548783","video":null,"publish_date":"2025-07-03 15:00:01","author":"Frank Holland","authors":["Frank Holland"],"language":"en","source_country":"us","sentiment":0.082},{"id":337882766,"title":"Washington Post columnist torches Paramount for settling with Trump over '60 Minutes' interview","text":"Washington Post columnist Erik Wemple sharply criticized Paramount on Wednesday for settling with President Donald Trump for $16 million earlier this week over edits made to a CBS News \"60 Minutes\" interview with then-Vice President Kamala Harris last October. Wemple argued that Paramount's settlement sets a dangerous precedent for journalistic integrity and press freedom after capitulating to the president in hopes of protecting its merger with Skydance Media. The media partnership is subject to the approval of the Federal Communications Commission (FCC), which is currently overseen by Trump-appointed commissioners. CBS STAFFERS REVOLT OVER PARAMOUNT'S 'SHAMEFUL' TRUMP SETTLEMENT, 'BETRAYAL' TO THE NETWORK'S JOURNALISTS Wemple contended that the media giant settled with Trump because it believed the case \"could thwart merger approval.\" \"Honest journalism requires noting that Paramount’s leaders will never, ever hear the end of this abject decision. Nor should they,\" he asserted. The columnist claimed that Paramount's settlement \"withers\" the First Amendment after it \"caved prematurely and completely\" to Trump's lawsuit, unlike its subsidiary, CBS News, which cited First Amendment protections in their court filing. Wemple insisted that media organizations typically settle only when they \"screw up\" — something he maintains CBS News did not do. \"The settlement doesn’t include an apology, and that’s because there is nothing to apologize for. Its actions under attack in the Trump suit are the subject of great reverence from the First Amendment,\" he stated. BERNIE SANDERS BLASTS PARAMOUNT, SAYS LAWSUIT SETTLEMENT WILL FURTHER EMBOLDEN TRUMP TO ATTACK MEDIA Citing the 1974 case Miami Herald Pub. Co. v. Tornillo, in which the Supreme Court ruled in favor of the Herald after they refused to publish pushback by a politician to critical editorials, Wemple argued Paramount tarnished the precedent of this ruling with their settlement. \"That very function — the one that happens many times a day at newspapers, radio stations, TV stations, networks, social media accounts, newsletters, whatever — is what Paramount failed to stick up for,\" he declared. \"It doesn’t deserve the likes of \"60 Minutes.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to CBS News and Paramount for comment on Wemple's editorial but did not immediately receive a response.","summary":"Washington Post columnist Erik Wemple condemned Paramount&apos;s $16 million settlement with President Trump, claiming the media giant has set a dangerous precedent.","url":"https://www.foxnews.com/media/washington-post-columnist-torches-paramount-settling-trump-over-60-minutes-interview","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-60mins-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-03 13:58:39","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","source_country":"us","sentiment":-0.362},{"id":337877562,"title":"‘60 Minutes’ correspondent who interviewed Kamala Harris got ‘teary eyed’ after Trump lawsuit settlement: report","text":"The veteran “60 Minutes” correspondent who interviewed Kamala Harris for the segment that triggered the just-settled lawsuit filed by President Trump against CBS News and its parent company reportedly grew emotional during a staff meeting held after the deal was announced.\n\nBill Whitaker, 73, appeared “teary-eyed” and “quite somber” during a tense Zoom meeting Wednesday morning as he addressed his “60 Minutes” colleagues in the wake of Paramount Global’s $16 million settlement with Trump, according to Oliver Darcy’s Status newsletter.\n\nThe Post reported on Wednesday that CBS insiders were not buying the spin from Paramount co-CEO George Cheeks who insisted that the settlement with the president spared the company from “reputational damage.”\n\nThe “dispirited staff” of the iconic television newsmagazine attended a “hastily arranged” 11 a.m. virtual conference to which they were summoned by CBS News President Tom Cibrowski and Tanya Simon, the acting executive producer of “60 Minutes,” Status reported.\n\nAccording to the report, Simon told staffers that she learned of the settlement through press reports, though she added that she was relieved that neither “60 Minutes” or CBS News were forced to offer up an apology to Trump as per the terms of the settlement.\n\nAfter Whitaker spoke during the 11 a.m. Zoom conference, he was followed by fellow correspondents Lesley Stahl and Sharyn Alfonsi, who “voiced deep frustration and dismay” at the company’s decision to settle with Trump, according to Status.\n\nBoth criticized the move, which they saw as a “capitulation” to political pressure in order to smooth regulatory pathways for the planned merger between Paramount Global and Skydance, led by Larry and David Ellison, Status reported.\n\nThroughout the meeting, Cibrowski and Simon sought to reassure the newsroom, according to the report.\n\nThey emphasized that there had been no interference from corporate leadership during the closing stretch of the most recent season and pledged to protect the editorial independence of “60 Minutes” going forward.\n\nSimon also sought to address lingering concerns about a post-merger shake-up in which management may try to bring in new blood and perhaps reorient the editorial bent by hiring someone like Bari Weiss, who reportedly spoke to David Ellison about a role at CBS News.\n\n“The concern is what happens next,” one “60 Minutes” staffer told Status.\n\n“Is this it? Or [does Skydance] say we are going to bring a new person in and start tinkering around with this show.” The staffer added, “The institution could unravel.”\n\nA Paramount spokesperson declined to comment.\n\nParamount Global, CBS’s corporate parent, agreed on Wednesday to pay $16 million to settle Trump’s lawsuit over a “60 Minutes” interview that Whitaker conducted Harris just before the 2024 presidential election.\n\nTrump filed the suit claiming that CBS News deceptively edited the Harris interview in order to boost her chances of winning the election. \n\nThe settlement stipulates that the funds would be earmarked for his future presidential library and no money going directly to him.\n\nThe deal also includes no apology or admission of wrongdoing, but “60 Minutes” will now release transcripts of presidential candidate interviews after airing.\n\nThe settlement, which was reportedly sought by Paramount controlling shareholder Shari Redstone, was seen by many internally as a capitulation to Trump and a blow to the integrity of the institution. \n\nCBS had previously called the lawsuit “meritless” as it fought the case in court.\n\nCBS News staffers told Status that the cost of the settlement goes far beyond the $16 million payout. \n\nIt precipitated the ousters of CBS News President Wendy McMahon and “60 Minutes” Executive Producer Bill Owens — despite the fact that their colleagues insist that they had done nothing wrong.\n\nLast week, Status reported that all seven “60 Minutes” correspondents signed a letter to management demanding that Simon, the daughter of the late CBS News veteran Bob Simon, be named the permanent successor to Owens.\n\nA Trump spokesperson celebrated the outcome, declaring that the former president is holding “the fake news media accountable” and claiming that “CBS and Paramount Global realized the strength of this historic case and had no choice but to settle.”\n\nMeanwhile, lawmakers expressed outrage.\n\nSen. Elizabeth Warren (D-Mass.) called the deal “bribery in plain sight” and demanded an investigation.\n\n“Paramount has refused to provide answers to a congressional inquiry, so I’m calling for a full investigation into whether or not any anti-bribery laws were broken,” she said.\n\nSen. Ron Wyden (D-Ore.) claimed “Paramount just paid Trump a bribe for merger approval.”\n\n“When Democrats retake power, I’ll be first in line calling for federal charges. In the meantime, state prosecutors should make the corporate execs who sold out our democracy answer in court, today.”\n\nThe Post has sought comment from CBS News and Paramount.","summary":"Paramount Global, CBS’s corporate parent, agreed to pay $16 million to settle Trump’s lawsuit over a “60 Minutes” interview that Whitaker conducted Harris just before the 2024 presidential election.","url":"https://nypost.com/2025/07/03/media/60-minutes-bill-whitaker-got-teary-eyed-after-trump-lawsuit-settlement-report/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/60-mins.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-07-03 13:10:24","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","source_country":"us","sentiment":-0.461},{"id":337906522,"title":"Dan Rather Issues Blunt Response to Paramount Settling Donald Trump Lawsuit","text":"Former CBS Evening News anchor and 60 Minutes correspondent Dan Rather, 93, issued a blunt response to Paramount settling its Donald Trump lawsuit.\n\nOn July 1, Paramount revealed in a statement that it agreed to pay $16 million to Trump to settle a lawsuit accusing 60 Minutes of deceptively editing an interview with Kamala Harris. Trump’s team accused the CBS program of misleading U.S. voters amid the 2024 presidential election despite legal experts and the network labeling his argument was weak.\n\n“It’s a sad day for journalism,” Rather told Variety of the situation. “It’s a sad day for 60 Minutes and CBS News. I hope people will read the details of this and understand what it was. It was distortion by the President and a kneeling down and saying, ‘Yes, sir,’ by billionaire corporate owners.”\n\nBefore the settlement, legal experts argued that the First Amendment would likely shield Paramount in this case. Rather insisted the network “didn’t have to” settle.\n\n“You settle a lawsuit when you’ve done something wrong. ’60 Minutes’ did nothing wrong,” he declared. “It followed accepted journalistic practices. Lawyers almost unanimously said the case wouldn’t stand up in court.”\n\nDespite the settlement, Rather expressed his unwavering support for CBS News.\n\n“My support for them is total, absolute,” he said. “I do really think they fought a good fight on this, and they’ll continue to fight. The people on ’60 Minutes’ and at CBS News didn’t just take it lying down. They did their best to stop it.”\n\nIn May, longtime 60 Minutes reporter Lesley Stahl spoke out against her former employer’s handling of the lawsuit.\n\n“To have a news organization come under corporate pressure — to have a news organization told by a corporation, ‘Do this, do that with your story, change this, change that, don’t run that piece.’ I mean, it steps on the First Amendment, it steps on the freedom of the press,” Stahl said on The New Yorker Radio Hour, per Fox News Digital.\n\nStahl continued, “It steps on what we stand for. It makes me question whether any corporation should own a news operation. It is very disconcerting.”\n\n60 Minutes, Sundays at 7 p.m. ET, CBS and Paramount+\n\nMore Headlines:\n\nMSNBC Names New White House Correspondents & More in Major Shake-UpDan Rather Issues Blunt Response to Paramount Settling Donald Trump LawsuitHow ‘Criminal Minds: Evolution’ Just Set up Season 18 Finale — Who Was Kidnapped?How ‘The Sandman’ Just Set up Final EpisodesSterling K. Brown’s ‘Washington Black’ Dares to Dream in Globe-Trotting Adventure","summary":"The longtime CBS Evening News anchor, 93, didn't mince words with his bold message.","url":"https://www.guampdn.com/lifestyle/entertainment/dan-rather-issues-blunt-response-to-paramount-settling-donald-trump-lawsuit/article_40597b46-28b4-53c6-a461-171f950a4e9a.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/custom/image/d1d0565a-bcb2-11eb-8535-ab06d41ce483.jpg?resize=600%2C315","video":null,"publish_date":"2025-07-03 13:01:12","author":"Michelle Stein,TV Insider","authors":["Michelle Stein","TV Insider"],"language":"en","category":"politics","source_country":"gu","sentiment":-0.161},{"id":337858844,"title":"The controversial MAGA star that Trump floated for Karoline Leavitt's job... and why she didn't get the gig","text":"President Donald Trump has applauded the job that 27-year-old press secretary Karoline Leavitt has done since taking over the White House podium earlier this year. \n\nHowever, according to the forthcoming book 2024: How Trump Retook the White House and the Democrats Lost America, penned by the trio of journalists Josh Dawsey, Tyler Pager and Isaac Arnsdorf, candidate Trump once floated a much more unconventional choice. \n\nThat of right-wing MAGA personality Laura Loomer. \n\n'Many of Trump's advisers viewed Loomer as too-conspiracy-minded and pugilistic, but he liked her,' they wrote. '\"Is she too fringe to be press secretary?\" he asked aides once.' \n\nTrump's advisers clearly talked him out of it. \n\nBut Loomer still had an outsized role in shaping some of Trump's campaign rhetoric - and she's influenced decisions he's made in the White House since. \n\nDawsey, a reporter now with The Wall Street Journal, Pager of The New York Times and Arnsdorf of The Washington Post detailed how Loomer was responsible for one of Trump's most viral moments of the entire campaign cycle. \n\nOn September 10, the former president and Republican nominee had invited Loomer to join him on board 'Trump Force One' for the flight to Philadelphia for his only debate against Vice President Kamala Harris, after she replaced President Joe Biden as the Democratic nominee. \n\nLoomer was already in hot water with some Trump allies - notably Rep. Marjorie Taylor Greene - for using racist stereotypes against Harris, claiming the White House would 'smell like curry' if the Democrat won and 'speeches will be facilitated via a call center.' Harris' mother had immigrated to the U.S. from India. \n\nDuring the flight, the authors wrote, Loomer 'showed him allegations circulating online about a community of thousands of Haitian immigrants resettled in the Ohio town of Springfield, accusing them of stealing geese and cats for food.' \n\n'Loomer showed him a call to the county sheriff complaining of Haitians carrying geese away from a public park and a woman arrested for eating a cat,' the authors wrote. 'She showed him a video of her associate confronting Ohio Sen. Sherrod Brown outside the Capitol.' \n\nThe associate had asked the Democrat: 'Would you be happy if an illegal alien ate your dog, Sen. Brown?' \n\nOhio Sen. J.D. Vance - at that point Trump's running mate - had also promoted some of the allegations online 'to the chagrin of some local Republicans,' the authors pointed out. \n\n'On the plane to Philly, Trump responded by joining in the online frenzy,' they said. 'He posted several memes on Truth Social alluding to the mania: a computer- generated image of him on his plane surrounded by grateful-looking cats and ducks; and another of cats equipped with assault rifles and MAGA caps.' \n\nHarris was supposed to be prepared if the topic came up. \n\n'When Harris aides saw Loomer get off Trump's plane in Philly, they called the vice president to brief her on the Springfield rumors so she would be prepared if Trump brought them up,' the authors wrote. \n\nWhen it did, the moment was so wild the Democrat couldn't keep her composure. \n\n'In Springfield, they're eating the dogs. The people that came in. They're eating the cats. They're eating - they're eating the pets of the people that live there,' Trump said. \n\nOn the split screen, Harris was seen laughing, shaking her heads and mouthing words. \n\n'Talk about extreme,' she finally spit out, once ABC News' David Muir asked for her reaction. \n\nWhile Trump would go on to win the general election, the debate was largely seen as a win for Harris. \n\n'Loomer had no regrets about the dogs-and-cats outburst,' the authors wrote. 'She thought it was a defining moment of the campaign, like when Trump told Clinton at the second debate in 2016, if he were in charge, \"You’d be in jail.\"'\n\n'Trump's pet-eating line was the debate's most memorable, launching a thousand memes and becoming a TikTok trend,' they continued. 'It put the focus on immigration, the strongest possible terrain for Trump, and did so in a way that appealed especially to young voters.'\n\nBoth the immigration issue - and an improvement among youth voters - allowed Trump to beat Harris in November. \n\nOnce Trump started on the transition, he picked a more natural fit for press secretary, 27-year-old Leavitt, who held the position during the campaign. She made history as the youngest person ever picked for the job, with the president calling her a 'star.' \n\nBut Loomer stayed in the president's orbit - and has visited Trump and Vance at the White House complex. \n\nShe confirmed an early April meeting in the Oval Office with Trump to the Daily Mail. \n\nDuring the meeting, she said she showed the president her 'research findings' - as she took aim at several members of the National Security Council. Several NSC staffers were fired later that day. \n\nLoomer later took credit when Trump removed his National Security Advisor Mike Waltz - quickly nominating him instead for the role of U.N. ambassador. \n\nShe also claimed the head of Waltz's deputy, Alex Wong, after negatively highlighting his wife's Chinese heritage and pushing discredited claims about Wong's own family and business dealings with China. \n\n'SCALP,' she wrote, sharing news of Wong's firing. \n\nThe Daily Mail reached out to Loomer for comment on the claims in the book. \n\n2024: How Trump Retook the White House and the Democrats Lost America will be on sale Tuesday.","summary":"President Donald Trump has applauded the job that 27-year-old press secretary Karoline Leavitt has done since taking over the White House podium earlier this year.","url":"https://www.dailymail.co.uk/news/article-14865779/donald-trump-controversial-maga-personality-press-secretary.html","image":"https://i.dailymail.co.uk/1s/2025/07/03/03/99868659-0-image-m-12_1751508459513.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/04/03/4730919170971812468/1024x576_MP4_4730919170971812468.mp4","publish_date":"2025-07-03 12:42:44","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.097},{"id":337865044,"title":"Bill Moyers, the Face of Taxpayer-Funded Propaganda","text":"Liberal journalists dumped a barrel of glorifying adjectives upon the news Bill Moyers died at age 91. The Washington Post headline was “Bill Moyers, eminence of public affairs broadcasting, dies at 91.”\n\nAP’s Frazier Moore gushed, “the former White House press secretary who became one of television’s most honored journalists, masterfully using a visual medium to illuminate a world of ideas.” Some also used “legendary.”\n\nCNN’s Brian Stelter oozed, “His career can and should serve as a model for younger generations.” Ugh.\n\nNPR anchor Scott Simon hailed Moyers as “one of the signature figures, along with Big Bird and Susan Stamberg, who helped build public broadcasting in the United States.” Simon added, “He won the most prestigious awards of our profession, some in bunches—more than 30 Emmys, 11 Peabodys, two Columbia-duPonts, plus many other honors for his PBS documentaries and interviews.”\n\nMoyers was acclaimed by other leftists because he was a die-hard leftist. Objectivity was never observed. He crusaded on the public dime against those villainous conservatives. He won Emmy Awards just like the latest prizes to “60 Minutes”—for hating Donald Trump and laboring to elect Kamala Harris. They award having your “heart in the right place.”\n\nMoyers was the “signature figure” of everything wrong with “public” broadcasting. He savaged conservatives and also lined his own pockets with revenues of his programs being sold on PBS Home Video. He used his PBS fame to sell expensive coffee-table books, just as Ken Burns does today. But the notable quotes were outrageous.\n\nIn 1987, Moyers oozed over paintings glorifying the Marxist revolutionaries dominating Nicaragua: “The white dove of freedom soars with the Sandinista revolution, whose heroes included Jesus Christ, George Washington, and the nationalist hero Augusto Sandino.”\n\nAfter the bombing of a federal building in Oklahoma City in 1995, Moyers blamed conservative talk radio on NBC: “Talk radio in that part of the world is more anti-government today than ever. The airwaves are saturated with hostility. It’s just an unremitting vilification of government.”\n\nOn his PBS show “Now” in 2003, Moyers ripped Republicans who wore flag pins, which was somehow reminiscent of communism: “When I see flags sprouting on official lapels, I think of the time in China when I saw Mao’s Little Red Book on every official’s desk, omnipresent, and unread.”\n\nLater that year, Moyers came unglued over a press conference with President George W. Bush before the invasion of Iraq that was insufficiently vicious: “Matt Taibbi wrote in The New York Press at the time that it was like a mini-Alamo for American journalism. I’d say it was more a collective Jonestown-like suicide. At least the defenders of the Alamo put up a fight.”\n\nIn 2007, Moyers compared Bush-Cheney to an “arsonist” and a “burglar in the basement.” He suggested the press was in cahoots with the “arsonist.”\n\nIn 2011, Moyers ranted that Republicans want “to feed red meat to Fox News and the partisan talk radio hosts who have turned the public airwaves … into a right-wing romper room.” He quoted from yellow dog Democrat Rep. Lloyd Doggett of Texas, that “My constituents turn to (NPR) because they want fact-based, not Fox-based coverage.” The attacks, he continued, are “an ideological crusade against balanced news and educational programs.”\n\nNPR is balanced and nonideological? How delusional can you be?\n\nBut to Moyers, a crusading leftist press was the model, and a mildly liberal media were basically in cahoots with evil Republicans. This is why he’s “acclaimed” by people who still pretend their ideological screeds are “fact-based.” Their opinions aren’t opinions, they’re “truth,” and that “truth” should be eternally supported by all taxpayers.\n\nCOPYRIGHT 2024 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Liberal journalists dumped a barrel of glorifying adjectives upon the news Bill Moyers died at age 91. The Washington Post headline was &#8220;Bill Moyers, eminence... Read More\n\n\nThe post Bill Moyers, the Face of Taxpayer-Funded Propaganda appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/03/bill-moyers-face-taxpayer-funded-propaganda/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/GettyImages-576829060.jpgJB_-scaled.jpg","video":null,"publish_date":"2025-07-03 12:00:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"us","sentiment":0.148},{"id":337852750,"title":"Biden claims European leaders want him back in action","text":"Former US President Joe Biden has claimed that foreign leaders have been urging him to reengage in global affairs, despite his retirement from public office.\n\nSpeaking at the Society for Human Resource Management (SHRM) conference in San Diego on Wednesday, Biden, 82, said “I’m getting calls – I’m not going to go into them, I can’t – from a number of European leaders asking me to get engaged.”\n\nThe ex-president said that he declined to do so “because things are different.” At the same time, Biden acknowledged that while he is “not actively involved with NATO issues,” he is still “giving advice.” \n\nBiden also said he remains in touch with lawmakers from both sides of the aisle. “I’ve been dealing with a lot of Democrat and Republican colleagues calling me… wanting to talk and bounce things off of me,” he said, adding that he remains involved in political discussions “because I really cared about what I was doing.”\n\nBiden went on to voice frustration over the rollback of several of his administration’s policies under President Donald Trump, although he avoided mentioning his successor by name. “Many of the things I worked so damn hard [on] that I thought I changed in the country are changing so rapidly,” he said.\n\nThe Democrat noted that he was focused on completing a memoir about his four years in the White House, adding that he is “working like hell with a publisher to write another 500-page book.” \n\nBiden dropped out of the 2024 presidential race in the face of widespread criticism over recurring public gaffes and his disastrous debate performance against Trump, which raised concerns in his own party about his age and mental acuity. He formally withdrew from the contest in July 2024, endorsing his vice president, Kamala Harris, who lost the November vote to Trump.\n\nIn May 2025, Biden revealed that he had been diagnosed with an aggressive form of prostate cancer. He continues to appear in public and has struck an optimistic tone when speaking about his chances of beating the disease.","summary":"The former US president has said he is “giving advice” but steering clear of direct involvement \nRead Full Article at RT.com","url":"https://www.rt.com/news/620927-biden-european-leaders-want-comeback/","image":"https://mf.b37mrtl.ru/files/2025.07/article/68666f9c2030271f2011800a.jpg","video":null,"publish_date":"2025-07-03 11:56:44","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.208},{"id":337996804,"title":"This India-born founder built a multimillion-dollar spice company after seeing turmeric lattes in California coffee shops. This is how she did it","text":"Javeri Kadri, who is from Mumbai, was never a big fan herself of the haldi doodh, or turmeric milk, her grandmother made for her as a child—a drink that has been made in India for centuries. But the sight of it in San Francisco was proof of how much this spice had bubbled in popularity owing to its anti-inflammatory health benefits. It was one of the top-trending food searches made on Google that year, and Americans had started adding it to everything—their smoothies, salad dressings, soups, and, to Javeri Kadri’s disdain, their milk. But Javeri Kadri—who had worked on a farm through college and was then at the San Francisco high-end grocer Bi-Rite—knew that if people were going to add it to their milk anyway, it could sure taste quite a lot better.\n\nIn February 2017, Javeri Kadri decided to get into the spice business. She flew back to India and started cold-calling agricultural institutions until she finally got an introduction to Prabhu Kasaraneni, a fourth-generation turmeric farmer who had taught himself organic farming techniques on YouTube and WhatsApp. It was Javeri Kadri’s first partnership with a multigenerational farmer in India, and the beginning of what would become her startup and obsession, the Diaspora Co. Since Javeri Kadri started Diaspora in 2017, selling only turmeric at first from Kasaraneni’s farm, she has scaled the business to 30 spices from more than 140 farms. She now has retail customers like Amazon, and is on track to hit profitability by the end of 2025. Javeri Kadri says the business is generating “mid-millions” in annual revenue right now.\n\nI reached out to Javeri Kadri this week, because I wanted some answers. It’s summertime, I just bought a new grill, and I have been putting Diaspora Co. spices on every piece of meat and vegetable that I can get my hands on. Diaspora’s Byadgi chili, Jodhana cumin, and Peni Miris cinnamon are staples in my spice drawer. My boyfriend has requested I bring my Diaspora black pepper (yes, black pepper!) to his house when we cook together, because nothing you can buy at the grocery store tastes anything like it. \n\nAs Javeri Kadri explains, there’s a reason it all tastes so different. The majority of spices grown around the world are indigenous to South Asia. Seeds can be extracted and transported elsewhere—and have been since Europeans took over the spice trade—but the different soil, temperatures, and weather dramatically change the flavor. If you want the warm, earthy, slightly bitter taste of turmeric in its original form, you need to get it from Javeri Kadri’s homeland. Nutmeg grown in India is fruity, floral, and almost light. In Indonesia, it is more intense, and has a bit of a tobacco flavor, she tells me.\n\nJaveri Kadri learned early on that where you grow spices—and the way you grow them—are critical to the flavors that end up in your spice drawer. It all starts with the farms and, of course, the farmers.\n\nJaveri Kadri grins as she talks about the 140 farmers she now works with—97% of whom had never worked with a distributor before she met them. Like Kasaraneni and his turmeric farm. Or the garlic farm that grows Pahadi pink garlic, a nine hours’ journey up the Himalayan mountains, where there is no electricity half the year because of the deep snow. The first few years of the business, Javeri Kadri was spending four to six months of every year in India—18 of Diaspora Co.’s 23 employees are based there permanently.\n\nJaveri Kadri bootstrapped Diaspora Co. the first five years, and it was profitable. But in year five, she said, she needed to take out a loan to be able to give advances to the farmers, so they could purchase the equipment they needed to grow spices in large quantities, or process them. No bank would give her a line of credit without investors, she said, so she ended up raising a $1 million pre-seed round from a small group of angel investors, then a $1.5 million seed round in 2024 from 75 angel investors including Tyler Malek of Salt & Straw ice cream; Ellen Bennett, who runs Hedley & Bennett; Meena Harris, Kamala Harris’s niece, who runs Phenomenal Ventures; and Ben Jacobsen, who runs Jacobsen Salt Co. She has an advisory board, but has given up no voting rights, and about 35% of the equity in the company has been set aside for the farmers, company advisors, and employees, she says.\n\nJaveri Kadri says she has been careful to raise capital from angels, not institutional investors, as she doesn’t want to be forced into any kind of exit timeline. “With the grocery venture capital world right now, you’re often selling an unprofitable product at scale and hoping that it’ll eventually become profitable. I can’t do that for my farm partners—that’s a very short-term outlook. I want their kids to inherit their family business, and the family business to be thriving. I want our farmers to be happy,” she says.\n\nIf she gets to a point where Diaspora can grow more quickly, Javeri Kadri will take VC dollars, she says. But for now, the control she has over how she runs her business—and what she can pay her farmers—is her priority. On average, an Indian farmer earns the equivalent of roughly $2,381 a year in U.S. dollars, according to data from Indeed. Javeri Kadri said that her farm partners earned $26,000 a year, on average, in 2023. “They are earning 10x the natural average, and I think that kind of tells you everything you need to know.”\n\nJaveri Kadri’s passion and excitement are evident as she talks about Diaspora—in her smile and the way she starts talking faster, describing the impact it can have. “I just really see how it feels so frantic and fraught when we first started working with them,” Javeri Kadri says, speaking of the farmers. “And we really moved to a place of ease and trust over the years, which I think is incredible. There’s a belief that, Okay, I can give this business over to my kids and this land to my kids, and that’s a gift, not a burden.”\n\nJaveri Kadri says her business might not be as sexy as startups that have raised more capital. She doesn’t have money for fancy billboard ads or flashy parties. “But it gives us freedom and complete control, and I think, long-term, that’s worth a lot more,” she says.\n\nCorrection, July 3, 2025: A previous version of this article didn’t include the full name of Sana Javeri Kadri and misstated the number of employees based out of India.","summary":"Sana Javeri Kadri has built a business around small farmers in India.","url":"https://fortune.com/2025/07/03/diaspora-co-spices-india-startup-turmeric/","image":"https://fortune.com/img-assets/wp-content/uploads/2025/07/200124_INDIA_GUNTAR_CHILIES_6293_GentilHyers-e1751543684644.jpg","video":null,"publish_date":"2025-07-03 11:25:00","author":"Jessica Mathews","authors":["Jessica Mathews"],"language":"en","source_country":"US","sentiment":-0.026},{"id":337834296,"title":"Why Zohran Mamdani succeeded where Kamala Harris failed","text":"Harris was unable to do either of these things. The latter, especially, cost her last year’s election.\n\nThis wasn’t entirely Harris’s choice. During the general election, she tried to stop talking about her unpopular culture war stances and rolled out speeches and position papers about affordability.\n\nBut Harris was defined more by her opponent than her own campaign. By the time Democratic primary voters cast their ballots, Mamdani had mostly defined himself.\n\nWhether Mamdani is elected mayor of New York City will depend on the effectiveness of his opponents’ efforts to change voters’ impressions of this bright, young affordability crusader.\n\nMamdani was a better candidate than Harris. He was more entrepreneurial in using new media, while she was exceedingly risk-averse. He had a finely honed message, while she was known for word salads. Mamdani seemed comfortable in his own skin, while Harris shied away from uncomfortable interviews or unscripted moments, though she did have a good debate.\n\nHarris was also the sitting vice president of the United States. She was part of the administration that presided over inflation hitting a 41-year high. For much of her term, she had low approval ratings.\n\nMamdani, first elected to the state legislature from Queens in 2021, was introducing himself to many voters for the first time. They did not have ingrained perceptions of him, as many already did with Harris.\n\nAnother difference is that President Donald Trump was a better candidate in 2024 than past-his-prime former Gov. Andrew Cuomo is now. Cuomo ran a more conventional and less adventurous campaign than Mamdani this year and Trump’s presidential campaign last year. Cuomo did not capitalize on mountains of opposition research that could have dented Mamdani’s numbers.\n\nTrump and his allies made sure voters saw Harris staking out unpopular, left-wing positions in her own words on-camera. Her aides usually only amended or abandoned those positions, often under the cloak of anonymity in news stories. While some media outlets cooperated with her cleanup efforts, conservative-leaning voters generally didn’t believe the disavowals, while liberals were occasionally demoralized by them.\n\nIt would be just as easy to unearth clips of Mamdani talking about seizing the means of production, which he directly linked to more popular progressive policies such as “Medicare for All,” or having student loans bailed out by taxpayers, or saying things about Israel that would divide New York City Democrats.\n\nLeft-wing, even Marxist, economics may be more popular in a New York City Democratic primary than biological men competing in girls sports or taxpayer-funded surgeries for transgender prison inmates are in rural Pennsylvania. However, many of the topics on which Mamdani could have been vulnerable are only really being litigated now that he has won the primary in an overwhelmingly Democratic city, which seems like political malpractice. \n\nEven in a general election, Mamdani has advantages that were never available to Harris. Deep-blue cities sometimes elect radical politicians and, unlike when Rudy Giuliani was first elected in 1993, there is now a national trend in favor of replacing bad mayors with worse ones (see Chicago). Mamdani’s opposition would need to consolidate behind a single alternative, which is difficult with the incumbent mayor, a former governor, and a perennial Republican candidate already on the ballot.\n\nDespite, or perhaps because of, his socialist ideology, Mamdani still has problems that plagued more mainstream Democrats like Harris. His supporters are heavily college-educated and affluent, while the working class has been noticeably slower to warm to his appeal. Mamdani lost in the neighborhoods with the highest percentages of black and Hispanic residents. \n\nIf Mamdani wins, national Democrats will take away two lessons. The first is that it is possible for even socialist Democrats to position themselves as cost-of-living cutters rather than leftists, especially if Trump has ceded the affordability issue by focusing on tariffs and the Medicaid reforms in the One Big Beautiful Bill Act. (Even if at the federal level, heavy spending to make things “free” is more directly inflationary than the Trump tariffs.) The second is that the politics of 2019 and 2020 weren’t some progressive fever dream from which Democrats need to awaken but the party’s future. \n\nThe latter is a theory Democrats were unwilling to test by nominating Sen. Bernie Sanders (I-VT) and believe failed them with Harris in 2024. Mamdani could change their minds.","summary":"New York City mayoral candidate Zohran Mamdani has already succeeded in two areas where former Vice President Kamala Harris failed. First, the socialist New York assemblyman punched his ticket to the general election by winning a competitive Democratic primary. Second, Mamdani managed to change the focus from his radical views, many of which were expressed [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3461567/why-zohran-mamdani-succeeded-where-kamala-harris-failed/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/mamdani-kamala-harris.webp","video":null,"publish_date":"2025-07-03 10:15:00","author":"W. James Antle III","authors":["W. James Antle III"],"language":"en","source_country":"US","sentiment":-0.101},{"id":337817948,"title":"Former Clinton advisor sounds '9-1-1' alarm for Democrats after socialist's NYC mayoral victory","text":"Zohran Mamdani’s surprise victory over former Gov. Andrew Cuomo in the New York City Democratic mayoral primary has raised questions about the party’s political direction. Mark Penn, former pollster and advisor to President Bill Clinton and CEO of Stagwell Inc., issued a warning to the left following Mamdani’s primary upset. \"This is a 9-1-1 moment for the Democratic Party,\" Penn said on \"America's Newsroom\" Wednesday. \"He’s [Mamdani] an anti-Semitic socialist.\" Mamdani, a 33-year-old state assemblyman from Queens and self-identified Democratic socialist, beat former Gov. Andrew Cuomo last month. His platform includes eliminating transit fares, providing free municipal housing and childcare, and ending ICE operations in the city — proposals that Penn and others have labeled as extreme. DEMS AT A CROSSROADS AS ESTABLISHMENT PLANS 'PROJECT 2029' WHILE SOCIALIST CANDIDATE WINS NYC MAYORAL PRIMARY \"He is perhaps the most extreme major candidate ever to win such a major office,\" Penn said, going on to call out Mamdani for refusing to denounce the slogan \"globalize the intifada,\" a phrase widely understood to carry anti-Jewish undertones. Several top New York Democrats have not yet endorsed Mamdani, including Senate Minority Leader Chuck Schumer, House Minority Leader Hakeem Jeffries, and Governor Kathy Hochul. While Hochul has recently defended Mamdani from criticism by President Donald Trump, she hasn’t formally endorsed him. Penn argued that Mamdani's campaign has successfully positioned itself as a battle against Trump, a strategy he says could distract voters from looking closer at the candidate’s policies. \"It’s absolutely essential here that this not become Mamdani versus Trump,\" Penn said. \"That’s his strategy.\" MAMDANI'S PRIMARY WIN EXPOSES DEMOCRAT DIVIDE AS TOP LEADERS WITHHOLD ENDORSEMENTS MAMDANI'S POLITICAL EARTHQUAKE ROCKS DEMOCRATS, DIVIDING PARTY ON PATH FORWARD While Trump gained ground in New York during the last presidential election, increasing his vote share to nearly 44%, Vice President Kamala Harris still carried the state with over 56%. Penn warns that making the narrative about the president could cause Democrats not to fully grasp what Mamdani’s policies mean for the city. \"The other Democratic candidates have to come in here and say, ‘No, this is about the future of the city and how we save it and how we reduce crime,’\" he said, also noting that candidates need to focus on making Jewish New Yorkers feel safe and bringing business back to the five boroughs. Mamdani’s campaign has drawn significant enthusiasm from younger, progressive voters. But Penn believes many voters may not fully grasp the implications of Mamdani’s agenda. CUOMO CONCEDES IN NYC DEMOCRATIC PRIMARY FOR MAYOR, CONGRATULATES AOC-ENDORSED MAMDANI \"People really didn't know the full extent of his views on socialism and antisemitism,\" Penn said. \"I think if there's real focus on that, he could be beaten.\" As the official Democratic nominee, Mamdani will face Republican candidate Curtis Sliwa and incumbent Mayor Eric Adams this November in the general election, as well as his defeated opponent Andrew Cuomo, who's chosen to remain on the ballot as an Independent. CLICK HERE TO GET THE FOX NEWS APP","summary":"Former Clinton advisor Mark Penn calls Mamdani’s NYC mayoral win a “9-1-1 moment&quot; for Democrats, warning of deeper trouble for the party.","url":"https://www.foxnews.com/media/former-clinton-advisor-sounds-911-alarm-democrats-after-socialists-nyc-mayoral-victory","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/zohran-mamdani-nyc.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-03 10:00:38","author":"Madison Colombo","authors":["Madison Colombo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.05},{"id":337817946,"title":"CNN commentator suggests investigating Trump children's citizenship status","text":"CNN political commentator Bakari Sellers asked why people aren’t investigating the Trump family’s citizenship status while discussing the White House’s ongoing deportation efforts on Tuesday. Sellers took part in a panel on \"CNN NewsNight with Abby Phillip\" on the topic of the Trump administration attempting to revoke the citizenship of naturalized Americans who commit crimes. The panel referenced a recent memo from the Justice Department dated June 11 that directed U.S. attorneys to \"prioritize and maximally pursue denaturalization proceedings\" as part of an effort by the Trump administration to crack down on crime. While accusing President Donald Trump of refusing to give immigrants \"the benefit of their humanity,\" Sellers suggested people needed to \"have a full conversation\" about the Trump family’s legal status. BAKARI SELLERS INTERRUPTS COMMENTATOR, CORRECTS HIM OVER PRONUNCIATION OF KAMALA HARRIS' NAME \"Look, if we want to have a conversation about who belongs where, when, how, and whether or not their citizenship status- and we want to look at everything, I mean, I would look at Donald Trump Jr.,\" Sellers said. \"I would look at all of Melania‘s kids, all of Ivana‘s kids. I mean, let‘s just have a full conversation over who belongs here, how did they get here, their citizenship status.\" He added, \"Let‘s just have a full discussion about all of it. Why is that not on the table right now? I mean, the only person here should be Tiffany Trump, if we‘re going to have this discussion.\" First lady Melania Trump, Barron’s mother, was born in Slovenia before becoming a U.S. citizen in 2006. The late Ivana Trump, Trump’s first wife and Eric, Ivanka and Donald Jr.’s mother, was born in the Czech Republic before becoming a U.S. citizen in 1988. Trump’s second wife, Tiffany’s mother, Marla Maples, was born in the U.S. All of Trump’s children were born in the U.S. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The Justice Department memo from Assistant Attorney General Brett Shumate states that denaturalization cases against \"individuals who pose a potential danger to national security, including those with a nexus to terrorism, espionage, or the unlawful export from the United States of sensitive goods, technology, or information raising national security concerns\" are one of the key priorities. \"The benefits of civil denaturalization include the government’s ability to revoke the citizenship of individuals who engaged in the commission of war crimes, extrajudicial killings, or other serious human rights abuses; to remove naturalized criminals, gang members, or, indeed, any individuals convicted of crimes who pose an ongoing threat to the United States; and to prevent convicted terrorists from returning to U.S. soil or traveling internationally on a U.S. passport,\" Shumate wrote. CLICK HERE TO GET THE FOX NEWS APP","summary":"CNN political commentator Bakari Sellers suggested that the Trump family should be investigated for citizenship status as deportation efforts continue.","url":"https://www.foxnews.com/media/cnn-commentator-suggests-investigating-trump-childrens-citizenship-status","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/trump-family.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-03 10:00:29","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"us","sentiment":0.137},{"id":337782880,"title":"CBS staffers revolt over Paramount's 'shameful' Trump settlement, 'betrayal' to the network's journalists","text":"CBS News staffers are furious at their parent company Paramount Global's eight-figure settlement to President Donald Trump that was struck late Tuesday night, ending his $20 billion lawsuit against the network. \"This settlement is a cowardly capitulation by the corporate leaders of Paramount, and a fundamental betrayal of ‘60 Minutes’ and CBS News,\" veteran \"60 Minutes\" producer Rome Hartman told Fox News Digital. Fox News Digital has learned that the sum being paid to Trump could reach north of $30 million, with $16 million being paid upfront for his future presidential library, in addition to another eight-figure allocation set aside for advertisements, public service announcements, or other similar transmissions, in support of conservative causes by the network in the future. Current Paramount management disputes the additional allocation, and a source familiar with Paramount's current leadership told Fox New Digital only $16 million was sanctioned by the official mediator, and they have no knowledge of any deal Trump made with incoming ownership as Paramount is set to merge with David Ellison’s Skydance Media. However, the incoming ownership will be responsible for the additional allocation. PARAMOUNT, CBS FORCED TO PAY EIGHT FIGURES, CHANGE EDITORIAL POLICY IN SETTLEMENT WITH PRESIDENT TRUMP The lawsuit stemmed from the \"60 Minutes\" interview featuring then-Vice President Kamala Harris that aired in October and alleged CBS News deceptively edited an exchange to aid her candidacy in the 2024 race. Hartman, who was one of the producers of the \"60 Minutes\" Harris interview, maintains that his corporate bosses knew the segment that aired \"was edited by the book and in accordance with CBS News standards.\" Hartman insisted any talk of a settlement was at the behest of Paramount's controlling shareholder Shari Redstone in hopes of paving the for the Skydance merger without potential retribution of the Trump-backed FCC, which could halt the deal. Redstone recused herself from settlement negotiations in February. \"They know that this lawsuit is completely baseless. But they settled it in order to preserve Shari Redstone’s payday. That is shameful,\" Hartman told Fox News Digital. BERNIE SANDERS BLASTS PARAMOUNT, SAYS LAWSUIT SETTLEMENT WILL FURTHER EMBOLDEN TRUMP TO ATTACK MEDIA A second CBS News journalist told Fox News Digital, \"Nobody is happy,\" but the entire newsroom anticipated the outcome. \"I think the terms look as good as they could be in this situation with no apology, etc,\" the CBS journalist said. As part of the agreement, CBS News did not admit to any wrongdoing nor issue an apology, something Trump's legal team had previously demanded. However, the network did agree to update its editorial standards by mandating the release of full, unedited transcripts of interviews with future presidential candidates. '60 MINUTES' KAMALA HARRIS INTERVIEW AT CENTER OF TRUMP LAWSUIT RUNS AFOUL OF CRONKITE-ERA CBS GUIDELINES The settlement was addressed internally by CBS News president and executive editor Tom Cibrowski on Wednesday's 9 a.m. editorial call. He began the meeting by thanking staffers for \"blocking out the noise\" over the past several months and continuing forward with their work, the journalist familiar with the call told Fox News Digital. During the call, Cibrowski openly discussed how CBS would cover the settlement with \"CBS Evening News\" executive producer Guy Campanile, who the staffer said was \"clearly annoyed\" by the Trump payout. \"I would say almost everyone is upset because it impacts the brand as a whole,\" the CBS journalist said. \"CBS Evening News\" anchor John Dickerson, who previously saluted ousted \"60 Minutes\" executive producer Bill Owens and CBS News president Wendy McMahon, used Paramount's own words against itself while addressing the settlement on Wednesday. \"In the end, Paramount decided to settle the suit it said is without basis in law and fact, and an affront to the First Amendment,\" a stern Dickerson told viewers before ending the newscast, citing Paramount's motion to dismiss Trump's lawsuit in March. However, Dickerson reserved far more pointed commentary for his CBS online streaming program \"CBS Evening News Plus\" in a lengthy monologue focused on the mission for journalists to get the facts right. \"The obstacles to getting it right are many, but the Paramount settlement poses a new obstacle. Can you hold power to account after paying it millions? Can an audience trust you when it thinks you traded away that trust? The audience will decide that,\" Dickerson said. TOP '60 MINUTES' PRODUCER RESIGNS FROM SHOW, CITES LACK OF INDEPENDENCE CBS SETTLEMENT WITH TRUMP SLAMMED BY JOURNALISTS, COMMENTATORS AS ‘APPALLING’ SURRENDER CBS News' senior White House correspondent Weijia Jiang took a subtle swipe against her network by sharing a post by Bloomberg correspondent David Gura, who invoked CBS broadcasting legend Walter Cronkite's quote, \"Freedom of the press is not just important to democracy, it is democracy.\" Andrew Heyward, who previously served as CBS News president from 1996-2005, denounced the settlement, telling NPR, \"The decision to settle a case with no legal merit obviously comes squarely from the corporate suite, not from anybody at CBS News. To me, the critical issue is whether '60 Minutes' can hold onto its tradition of fierce editorial integrity under new management.\" \"I spent seven years as the Chief Investigative Correspondent for CBS News and eight as a contributing correspondent to 60,\" former CBS journalist Armen Keteyian wrote on X. \"This Paramount settlement is the nadir for the network – a breach of the public trust Murrow, Cronkite, Hewitt and thousands of us worked decades to build.\" Representatives for Paramount and CBS News did not immediately respond to Fox News Digital's requests for comment. At the center of Trump's legal battle with Paramount was an exchange Harris had with \"60 Minutes\" correspondent Bill Whitaker, who asked her why Israeli Prime Minister Benjamin Netanyahu wasn't \"listening\" to the Biden administration. Harris was widely mocked for the \"word salad\" answer that aired in a preview clip of the interview on CBS' \"Face the Nation.\" However, when the same question aired during a primetime special on the network, Harris had a different, more concise response. Critics at the time accused CBS News of deceitfully editing Harris' \"word salad\" answer to shield the Democratic nominee from further backlash leading up to Election Day. CBS BLASTS TRUMP’S LAWSUIT AS ‘MERITLESS’ DESPITE RECENT $15 MILLION SETTLEMENT OFFER CLICK HERE TO GET THE FOX NEWS APP The raw transcript and footage released earlier this year by the FCC showed that both sets of Harris' comments came from the same response, but CBS News had aired only the first half of her response in the \"Face the Nation\" preview clip and aired the second half during the primetime special. CBS News previously refused to release the raw transcript when the controversy first erupted in October. \"With this record settlement, President Donald J. Trump delivers another win for the American people as he, once again, holds the Fake News media accountable for their wrongdoing and deceit. CBS and Paramount Global realized the strength of this historic case and had no choice but to settle. President Trump will always ensure that no one gets away with lying to the American People as he continues on his singular mission to Make America Great Again,\" a spokesperson for Trump’s legal team told Fox News Digital.","summary":"CBS News staffers are outraged by parent company Paramount&apos;s decision this week to settle President Donald Trump&apos;s lawsuit which they thought was meritless.","url":"https://www.foxnews.com/media/cbs-staffers-revolt-over-paramounts-shameful-trump-settlement-betrayal-networks-journalists","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/cbs-building-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-03 09:00:16","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.402},{"id":337771788,"title":"Democrats should ‘break up’ with Randi Weingarten, ex-Harris campaign aide argues","text":"The Democratic Party should “break-up” with American Federation of Teachers (AFT) president Randi Weingarten, ex-Kamala Harris campaign aide Ben Austin wrote in an opinion piece on Monday.\n\n“Democratic leaders should thank Weingarten for her service, then lock the door behind her as she makes her way out,” Austin wrote in The Hill. “As a party leader, Weingarten gaslit Democrats into believing that the best response to the Republican free market smorgasbord of school choice with loosely regulated vouchers is to make sure there is no choice of any kind.”\n\nWeingarten announced that she would be leaving the Democratic National Committee due to a disagreement with party leadership in June. \n\nAustin, the founding director of Education Civil Rights Now and a strong supporter of unions, also called out an affiliate of AFT for wielding “considerable power to bully politicians and defiant parents into fealty during the school closures.” \n\nThe affiliate, United Teachers Los Angeles, strongly opposed Austin’s community-organized effort to get teachers back in the classroom throughout the COVID-19 pandemic.\n\n“Weingarten’s affiliate initially opposed teaching over zoom. And while United Teachers Los Angeles trapped Los Angeles Unified School District students at home indefinitely, cut off from learning, they rooted their opposition to reopening schools in bizarre racial ideology, not science,” he wrote.\n\n“These Los Angeles Unified School District parents encountered endless Kafkaesque roadblocks erected by Weingarten’s union. And as it happened, I watched a group of smart progressive parents I’d been organizing with transform into Trump voters one-by-one. It was like a real-time focus group of the damage Weingarten and her allies were doing to my party’s credibility,” Austin continued.\n\nAustin said Weingarten’s leadership had been “tragic” for American children. \n\nAustin accused the Democratic Party of “offshoring” education policy to teachers unions.\n\n“Here’s a lesson plan for my party: Presidents Bill Clinton and Barack Obama won because they had the guts to challenge party orthodoxy on behalf of the American people. Democrats like Harris — along with every nominee since Walter Mondale who lost in the general election — ran as avatars of party orthodoxy and offshored education policymaking to Weingarten and the teachers unions,” he wrote.\n\nHe said former Vice President Kamala Harris never talked about schools in her campaign speeches and said it was by design.\n\n“Democrats became the party of public education because they had the courage to fight for it. That courage is needed again today — to challenge failed leaders, stand with parents, take back power and fight for democracy,” Austin concluded.\n\nAFT did not immediately respond to a request for comment.","summary":"The Democratic Party should \"break-up\" with American Federation of Teachers (AFT) president Randi Weingarten, ex-Kamala Harris campaign aide Ben Austin wrote in an opinion piece on Monday.","url":"https://nypost.com/2025/07/03/us-news/democrats-should-break-up-with-teacher-union-president-randi-weingarten-ex-harris-aide-argues/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-54ew9f7bt-1751529223657.jpg?quality=75&strip=all&1751514857&w=1024","video":null,"publish_date":"2025-07-03 08:34:05","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.355},{"id":337774168,"title":"Paramount agrees to pay $16M to settle Trump lawsuit over '60 Minutes' interview - USA Today","text":"NEW YORK - CBS parent company Paramount on July 1 settled a lawsuit filed by President Donald Trump over an interview broadcast in October, the latest concession by a media company to a president who has targeted outlets over what he describes as false or misleading coverage.\n\nParamount said it would pay $16 million to settle the suit, with the money allocated to Trump's future presidential library, and not paid to Trump \"directly or indirectly.\"\n\n\"The settlement does not include a statement of apology or regret,\" the company statement added.\n\nTrump filed a $10-billion lawsuit against CBS in October, alleging the network deceptively edited an interview that aired on its \"60 Minutes\" news program with then-vice president and presidential candidate Kamala Harris to \"tip the scales in favor of the Democratic Party\" in the election. In an amended complaint filed in February, Trump bumped his claim for damages to $20 billion.\n\nCBS aired two versions of the Harris interview in which she appears to give different answers to the same question about the Israel-Hamas war, according to the lawsuit filed in federal court in Texas.\n\nCBS previously said the lawsuit was \"completely without merit\" and had asked a judge to dismiss the case.\n\nThe White House did not immediately respond to a Reuters' request for comment. Edward A Paltzik, a lawyer representing Trump in the civil suit, could not be immediately reached for comment.\n\nA spokesperson for Paramount Chair Shari Redstone was similarly unavailable for comment.\n\nThe case entered mediation in April.\n\nTrump alleged CBS’s editing of the interview violated the Texas Deceptive Trade Practices-Consumer Protection Act, which makes it illegal to use false, misleading, or deceptive acts in commerce. Media advocacy groups said Trump’s novel use of such laws against news outlets could be a way of circumventing legal protections for the press, which can only be held liable for defamation against public figures if they say something they knew or should have known was false.\n\nThe settlement comes as Paramount prepares for an $8.4-billion merger with Skydance Media, which will require approval from the U.S. Federal Communications Commission. On the campaign trail last year, Trump threatened to revoke CBS's broadcasting license if elected.\n\nHe has repeatedly lashed out against the news media, often casting unfavorable coverage as \"fake news.\"\n\nThe Paramount settlement follows a decision by Walt Disney-owned ABC News to settle a defamation case brought by Trump. As part of that settlement, which was made public on December 14, the network donated $15 million to Trump's presidential library and publicly apologized for comments by anchor George Stephanopoulos, who inaccurately said Trump had been found liable for rape.\n\nIt also follows a second settlement, by Facebook and Instagram parent company Meta Platforms, which on January 29 said it had agreed to pay about $25 million to settle a lawsuit by Trump over the company's suspension of his accounts after the January 6, 2021, attack at the U.S. Capitol.\n\nTrump has vowed to pursue more claims against the media.\n\nOn December 17, he filed a lawsuit against the Des Moines Register newspaper and its former top pollster over its poll published on November 2 that showed Harris leading Trump by three percentage points in Iowa. The lawsuit seeks unspecified damages and an order barring the Des Moines Register from engaging in \"ongoing deceptive and misleading acts and practices\" related to polling.\n\nA Des Moines Register representative said the organization stands by its reporting and that the lawsuit was without merit.\n\nOn June 30, Trump dropped the federal lawsuit and refiled it in an Iowa state court.\n\n(Reporting by Helen Coster and Jack Queen in New York, Kanjyik Ghosh and Surbhi Misra in Bengaluru; Editing by Noeleen Walder, Rod Nickel and Kate Mayberry)","summary":"Paramount agrees to pay $16M to settle Trump lawsuit over '60 Minutes' interview  USA Today","url":"https://www.usatoday.com/story/news/politics/2025/07/02/cbs-paramount-donald-trump-60-minutes-interview-kamala-harris/84440841007/","image":"https://www.usatoday.com/gcdn/authoring/authoring-images/2025/07/02/USAT/84440876007-20250701-t-155425-z-1328907652-rc-2-rdfaf-2-nqp-rtrmadp-3-usatrump.JPG?crop=2966,1669,x1119,y105&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2025-07-03 08:22:44","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","category":"politics","source_country":"us","sentiment":-0.357},{"id":337723698,"title":"Trump settlement triggers ‘widespread distress’ at CBS News","text":"LOS ANGELES, CALIFORNIA, (Reuters) – Paramount Global’s PARA.O settlement of the “60 Minutes” lawsuit filed by U.S. President Donald Trump provoked condemnation yesterday from CBS News current and former employees, press freedom advocates and legislators.\n\nParamount’s agreement to pay $16 million to resolve a civil suit over what Trump alleged was the network’s deceptive editing of an interview with presidential candidate Kamala Harris sets a dangerous precedent that threatens the free press, journalism advocates warned.\n\nOne current “60 Minutes” employee who spoke with Reuters said that during a call today, newsroom staff expressed “widespread distress” about the settlement and concerns about the future of the CBS News prime time news magazine and its hard-hitting brand of journalism.\n\nThe staffer, who requested anonymity to speak publicly about his employer, said that while CBS News avoided the worst outcome in its settlement with Trump – an apology – the agreement nonetheless sets a “horrible precedent” in agreeing to make public transcripts of future interviews with presidential candidates.\n\nThe settlement follows ABC News’s decision in December to pay $15 million to settle a defamation lawsuit over anchor George Stephanopoulos’s on-air description of the president’s conduct in the E. Jean Carroll case.\n\n“With two major network owners bowing to the president in quick succession, the danger is clear: emboldened politicians and powerful actors will feel more free than ever to weaponize lawsuits and bring regulatory pressure to bear to silence and censor independent journalism,” said Tim Richardson, journalism and disinformation program director at free-speech advocate PEN America.\n\nOn Wednesday, U.S. Senator Elizabeth Warren called for an investigation into the settlement, which will be paid to a fund supporting Trump’s future presidential library, said she will soon introduce legislation to “rein in corruption through presidential library donations.”\n\nTrump filed the $10-billion lawsuit against CBS in October, alleging the network deceptively edited an interview that aired on its “60 Minutes” news program with then-vice president and presidential candidate Kamala Harris to “tip the scales in favor of the Democratic Party” in the election. In an amended complaint filed in February, Trump bumped his claim for damages to $20 billion.\n\nCBS aired two different versions of Harris’s response to a question about the Israel-Hamas war, according to the lawsuit filed in federal court in Texas. CBS previously dismissed the lawsuit as “completely without merit” and asked a judge to dismiss the case.\n\nSteve Kroft, retired long-time “60 Minutes” correspondent called the settlement a “travesty” adding, “This is but the latest attempt by the Administration to damage the country’s institutions and encroach upon the rights granted to the people under the First Amendment.”\n\nRome Hartman, one of the producers on the Harris segment who retired from CBS two weeks ago, called the settlement “a cowardly capitulation by the corporate leaders of Paramount, and a fundamental betrayal of ‘60 Minutes’ and CBS News.”\n\nLike other current and former staffers, Rome lays blame at the feet of Paramount controlling shareholder Shari Redstone, who needs Trump administration approval for its $8.4 billion merger with Skydance Media.\n\nThe Redstone family’s payout for the sale of National Amusements, which holds the family’s controlling stake in Paramount, will be about $1.75 billion, Reuters previously reported.\n\n“They settled in order to preserve Shari Redstone’s payday,” Hartman said.\n\nParamount has said the lawsuit is “completely separate from, and unrelated to” the Skydance transaction and the pending FCC approval process.\n\nCBS News co-CEO George Cheeks told investors during Wednesday’s annual shareholder meeting that Paramount opted to settle the lawsuit to avoid the “unpredictable cost” of mounting a legal defense, and the possibility of an adverse outcome that would cause reputational damage.”\n\nParamount and CBS did not provide additional comment.\n\nFCC Chair Brendan Carr, who was named chair by Trump on Jan 20, said last week the commission was continuing to review the transaction. The FCC did not make a decision by the 180-day informal deadline in mid-May.\n\nAs the months-long legal standoff between Trump and Paramount dragged on, seven current and former journalists at “60 Minutes” said they have experienced heightened oversight over their work, including high-level executives sitting in on screenings, extensive review of any story touching on the Trump administration or the war in Gaza, and story lists being scrutinized at the highest level. However, no “60 Minutes” stories were blocked from airing.\n\n“60 Minutes” lost a key ally in May, insiders said, when CBS News President Wendy McMahon, who defended the news organization from meddling, resigned, saying “it’s become clear that the company and I do not agree on a path forward.”\n\nShe followed “60 Minutes” executive producer Bill Owens, who resigned in April after months of increasing oversight over the long-running newsmagazine, at the urging of Redstone, according to three people familiar with the matter.\n\n“Today is a sad day for press freedom,” said Jameel Jaffer, executive director of the Knight First Amendment Institute at Columbia University, who said he believes Paramount would have prevailed in court. “Now Trump’s presidential library will be a permanent monument to Paramount’s surrender, a continual reminder of its failure to defend freedoms that are essential to our democracy.”","summary":"LOS ANGELES, CALIFORNIA,  (Reuters) &#8211; Paramount Global’s PARA.O  settlement of the “60 Minutes” lawsuit filed by U.S.\n\n\nThe article Trump settlement triggers ‘widespread distress’ at CBS News appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/07/03/news/world/trump-settlement-triggers-widespread-distress-at-cbs-news/","image":"https://s1.stabroeknews.com/images/2019/06/sn-article-default.png","video":null,"publish_date":"2025-07-03 06:05:56","author":"Stabroek News","authors":["Stabroek News"],"language":"en","source_country":"gy","sentiment":-0.279},{"id":337752512,"title":"Nationalizing politics benefits Gavin Newsom but hurts Senate Democrats","text":"California Governor Gavin Newsom’s goal in life, besides looking like Gordon Gekko in “Wall Street,” is to become President Donald Trump’s foil in every way. If Trump is Superman, Newsom is Lex Luthor; if Trump is Hulk Hogan, Newsom is Andre the Giant; and if Trump is American Airlines, consider Newsom to be punctuality.\n\nWhy does Newsom want to frame himself as the anti-Trump? Because it’s been beneficial to his political survival, that’s why. He’s like a cruise ship magician, with one really good trick.\n\nHere’s how it works:\n\nConsider this, a Public Policy Institute of California poll from earlier this month showed a dramatic decline in support for Governor Newsom, with only 44 percent of Californians approving of Newsom’s job performance, down from 52 percent in February.\n\nAdditionally, a majority thought California was going in the wrong direction. In other words, Newsom and his leadership were about as popular in California as Pete Hegseth is in Iran right now.\n\nThen, all hell broke loose in Paramount and Los Angeles, after Immigration and Customs Enforcement agents started rounding up illegal aliens for deportation.\n\nNewsom and Los Angeles Mayor Karen Bass took the position that despite officers being assaulted, Waymos being set ablaze, motorists being pelted with chunks of concrete, and buildings being vandalized, the “protests” were mostly peaceful and the Los Angeles Police Department had things “under control.” Right. Kind of like how Congress has spending under control.\n\nNewsom’s objections were laughable. In fact, they were a real riot.\n\nTrump didn’t buy it, and sent in hundreds of National Guard troops to protect federal property and agents – all against Newsom’s objections, of course.\n\nNewsom embraced the conflict like it was Randi Weingarten at a DNC meeting, and at one point even challenged Trump administration “Border Czar” Tom Homan to arrest him. Not fake-arrest like Greta Thunberg. Newsom wanted real handcuffs and everything…making Newsom the first Democrat in history to ask a border agent to arrest anyone.\n\nThere is no question Newsom ended up benefiting from the face-off.\n\nAccording to a Morning Consult survey taken June 13-15, as the LA protests were fizzling out, 11 percent of Democrats and Democratic-leaning independents said they would back Newsom in a 2028 primary, up from 5 percent who said the same in March.\n\nThose results put Newsom in second place, behind former Vice President Kamala Harris, who garnered the support of 34 percent of Democrats.\n\nIn response John Pitney, a politics professor at Claremont McKenna College told The Hill newspaper, “He’s doing really well among Democrats, both in California and throughout the nation. He’s getting a boost in 2025.”\n\nBy nationalizing what was essentially a California story, the deeply unpopular Newsom was able to regain his standing among Democrats, in a state where the Dems outnumber Republicans by a two-to-one margin.\n\nIf the focus is on Newsom’s performance on crime, homelessness, the budget, the insurance crisis, The French Laundry, wildfires, or any number of other California catastrophes, Newsom loses. However, if the framing is one of a typical partisan food fight, with Newsom branded as the leader of the Democratic resistance, he wins.\n\nHowever, in politics you always have to worry about the law of unintended consequences. While it’s true that Newsom benefits from nationalizing every level of politics, the Democratic Party largely doesn’t: particularly, Senate Democrats.\n\nIn the pages of Split Ticket, Lakshya Jain, Harrison Lavelle, and Armin Thomas conclude that this type of partisanship is the real reason Democrats have been shut out from nearly half of the nation’s Senate seats. “The decline in ticket splitting means they [Democrats] can no longer overcome structural coalitional differences as easily as they once did,” they explain.\n\n“In 2012, they were winning Senate races in states like North Dakota and West Virginia, even as Barack Obama lost them by more than 20 points. But virtually no modern candidate achieves that type of overperformance now,” they conclude.\n\nIn short, Democrats benefit from ticket splitting a lot more than Republicans do.\n\nIf voters take Newsom’s cue and nationalize all aspects of politics, including down ballot races, the Democrats can say goodbye to the U.S. Senate for good.\n\nNone of this is any big surprise to those of us in California — we know that like everything with Newsom, as long as he personally benefits, he’s all in.\n\nAs we Californians say of people like Newsom: It’s his movie, we’re just in it.\n\nSo, enjoy those seats while you can, Senate Democrats. The rest of the country is in for a real treat.\n\nJohn Phillips can be heard weekdays from noon to 3 p.m. on “The John Phillips Show” on KABC/AM 790.","summary":"Nationalizing politics benefits Gavin Newsom but hurts Senate Democrats","url":"https://www.presstelegram.com/2025/06/30/nationalizing-politics-benefits-gavin-newsom-but-hurts-senate-democrats/","image":"https://www.presstelegram.com/wp-content/uploads/2024/08/AP24187703140415.jpg?w=150&strip=all","video":null,"publish_date":"2025-07-03 06:02:44","author":"Gqlshare","authors":["Gqlshare"],"language":"en","category":"politics","source_country":"au","sentiment":-0.285},{"id":337749110,"title":"Zohran Mamdani Laid Out The Real Reason He Thinks Donald Trump Is Attacking Him","text":"Zohran Mamdani, the Democratic nominee for New York City mayor, pointedly explained why he thinks US President Donald Trump has levied attacks on his citizenship and threatened to arrest him in recent days.\n\nTrump simply needs a distraction, Mamdani argued in a press conference with New York City labour leaders on Wednesday. \n\n“He said those things about me — someone who stands to be the first immigrant mayor of this city in generations, someone who would also be the first Muslim and the first South Asian mayor in this city’s history — less so because of who I am, because of where I come from, because of how I look or how I speak, and more so because he wants to distract from what I fight for,” Mamdani said. \n\n“I fight for working people. I fight for the very people that have been priced out of this city, and I fight for the same people that he said he was fighting for,” he added.\n\nRather than confront Mamdani’s policies, which have focused on the cost of living, or admit to the harms posed by Republicans’ own tax legislation, which is set to push millions off their health care, Trump is resorting to the same racism and xenophobia he’s always trafficked in, the New York state assembly member stressed. \n\nDuring a Tuesday press briefing in South Florida, Trump repeated comments falsely suggesting that Mamdani, who is a naturalized US citizen, could be in the country illegally, noting that “we’re going to look at everything.” Trump also said Mamdani would be arrested if he didn’t comply with Immigration and Customs Enforcement actions in New York City as mayor. \n\nThose statements continue a long history of Trump making racist comments about Democrats’ identities in order to divert attention from their policies and his own shortcomings. He’s previously advanced birtherist conspiracy theories about both former President Barack Obama and former Vice President Kamala Harris in a bid to discredit them and shift the attention from the proposals they were championing. \n\nTrump’s threats toward Mamdani also coincided with a pivotal week for his tax bill, which Republicans are now attempting to muscle through the House. In order to pay for the measure’s tax cuts, Republicans are slashing spending for social programs including Medicaid and food aid, which is expected to force millions to lose both benefits. \n\n“We know that he would rather speak about me than speak about the legislation that he is shepherding through Washington, DC,” Mamdani said. “Legislation that will quite literally take health care away from Americans, legislation that will steal food from the hungry, legislation that looks to build upon one of the largest transfers of wealth we’ve seen in recent history in his first administration.” \n\nWhite House spokesperson Abigail Jackson responded to these critiques by echoing Trump’s statements dubbing Mamdani a “communist” and suggesting that this was the reason he was condemning the Republican tax legislation.","summary":"New York Mayoral Candidate Zohran MamdaniZohran Mamdani, the Democratic nominee for New York City mayor, pointedly explained why he thinks US President Donald Trumphas levied attacks on his citizenship and threatened to arrest him in recent days.\n\nTrump simply needs a distraction, Mamdani argued in a press conference with New York City labour leaders on Wednesday.\n\n“He said those things about me — someone who stands to be the first immigrant mayor of this city in generations, someone who would also be the first Muslim and the first South Asian mayor in this city’s history — less so because of who I am, because of where I come from, because of how I look or how I speak, and more so because he wants to distract from what I fight for,” Mamdani said. \n\n“I fight for working people. I fight for the very people that have been priced out of this city, and I fight for the same people that he said he was fighting for,” he added.\n\nRather than confront Mamdani’s policies, which have focused on the cost of living, or admi","url":"https://www.huffingtonpost.co.uk/entry/zohran-mamdani-explains-why-he-thinks-trump-is-targeting-him_uk_686617aae4b0c546723fc4a5","image":"https://img.huffingtonpost.com/asset/6865ac3f1400004fd2d0d209.jpeg?ops=1200_630","video":null,"publish_date":"2025-07-03 05:42:18","author":"Li Zhou","authors":["Li Zhou"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.186},{"id":337729040,"title":"Former CBS anchor Dan Rather calls Paramount's $16 million deal with Trump 'a sell-out to extortion'","text":"Dan Rather, who worked at CBS News for 44 years before his 2006 departure, is speaking out against the settlement his former network's parent company reached with President Donald Trump.\n\n Trump had sued Paramount over the way CBS News edited a 60 Minutes interview with former Vice President Kamala Harris. As part of the agreement, the company will pay $16 million, including Trump's legal fees, with most of the sum going to the president's future presidential library. In addition, Paramount will release transcripts of future interviews with presidential candidates. But the company made no apology.\n\n A Trump spokesperson called the settlement \"a win for the American people.\"\n\n The career newsman sees it differently.\n\n \"Trump knew if he put the pressure on and threatened and just held that they would fold, because there's too much money on the table,\" Rather told Variety on Wednesday. \"Trump is now forcing a whole news organization to pay millions of dollars for doing something protected by the Constitution — which is, of course, free and independent reporting. Now, you take today's sell-out. And that's what it was: It was a sell-out to extortion by the President. Who can now say where all this ends?\"\n\n Rather, who has spoken out against Trump before, said that he was \"disappointed, but I wasn't surprised\" with what transpired.\n\n The settlement comes as Paramount seeks federal approval for a merger with another company, Skydance.\n\n \"Big billionaire business people make decisions about money,\" Rather said. \"We could always hope that they will make an exception when it comes to freedom of the press, but it wasn't to be.\"\n\n He called it \"a sad day for journalism.\"\n\n \"It's a sad day for 60 Minutes and CBS News,\" continued Rather, who left the network after being removed from the anchor chair over a story about President George W. Bush's time in the Texas Air National Guard. \"I hope people will read the details of this and understand what it was. It was distortion by the President and a kneeling down and saying, 'yes, sir,' by billionaire corporate owners.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n Trump had claimed that the news program deceptively edited Harris' interview — his lawsuit called it \"news distortion\" — to affect the election in which she ran against against Trump.\n\n Rather, a former 60 Minutes contributor, argued that Paramount \"didn't have to settle.\"\n\n \"You settle a lawsuit when you've done something wrong,\" he said. \"60 Minutes did nothing wrong. It followed accepted journalistic practices. Lawyers almost unanimously said the case wouldn't stand up in court.\"\n\n He said that his support for his former colleagues is \"total, absolute.\"","summary":"Rather worked at CBS News for 44 years.","url":"https://ew.com/dan-rather-calls-16-million-paramount-deal-with-trump-sell-out-to-extortion-11765952","image":"https://ew.com/thmb/xXy_-dYs8c-L9Z9IEPHHAy4IEx0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Dan-Rather-070225-b8f967bef9f1451d817de1727ea033cd.jpg","video":null,"publish_date":"2025-07-03 05:25:43","author":"Raechal Shewfelt","authors":["Raechal Shewfelt"],"language":"en","category":"politics","source_country":"US","sentiment":-0.409},{"id":337872518,"title":"Man charged with killing former Minnesota House speaker is due back in court after delay","text":"ST. PAUL, Minn. (AP) — The man charged with killing former Minnesota House Speaker Melissa Hortman and her husband, and wounding a state senator and his wife, is due back in federal court Thursday for a hearing that was put on hold after his lawyer said his client had been unable to sleep while on suicide watch.\n\nThe hearing is expected to address whether Vance Boelter should remain in custody without bail and affirm that there is probable cause to proceed with the case. He’s not expected to enter a plea. Prosecutors need to secure a grand jury indictment first, before his arraignment, which is when a plea is normally entered.\n\nAn unshaven Boelter, 57, of Green Isle, was wearing a green padded suicide prevention suit and orange slippers when he was brought into court last Friday. Federal defender Manny Atwal then asked Magistrate Judge Douglas Micko to continue the hearing. She said Boelter had been sleep deprived due to harsh conditions in the Sherburne County Jail, making it difficult for them to communicate.\n\n“Your honor, I haven’t really slept in about 12 to 14 days,” Boelter told the judge then. And he denied being suicidal. “I’ve never been suicidal and I am not suicidal now.”\n\nSherburne County Sheriff Joel Brott, whose jail houses both county and federal prisoners, rejected Boelter’s claims of poor conditions as absurd. “He is not in a hotel. He’s in jail, where a person belongs when they commit the heinous crimes he is accused of committing,” Brott said in a statement Friday.\n\nBoelter faces separate cases in federal and state court on charges of murder and attempted murder for what the state’s chief federal prosecutor, Acting U.S. Attorney Joe Thompson, has called “a political assassination” and “a chilling attack on our democracy.” The feds are going first.\n\nAuthorities say Hortman and her husband, Mark, were shot to death in their home in the Minneapolis suburb of Brooklyn Park in the early hours of June 14 by a man disguised as a police officer who was driving a fake squad car.\n\nBoelter also allegedly shot and seriously wounded state Sen. John Hoffman, and his wife, Yvette, earlier that morning at their home in nearby Champlin. The Hoffmans are recovering, but Hortman’s golden retriever, Gilbert, was seriously injured and had to be euthanized.\n\nBoelter surrendered near his home the night of June 15 after what authorities called the largest search in Minnesota history, a hunt of around 40 hours.\n\nAtwal told the court last week that Boelter had been kept in what’s known as a “Gumby suit,” without undergarments, ever since his first court appearance June 16. She said the lights were on in his area 24 hours a day, doors slammed frequently, the inmate in the next cell would spread feces on the walls, and the smell would drift to Boelter’s cell.\n\nThe attorney said transferring him to segregation instead, and giving him a normal jail uniform, would let him get some sleep, restore some dignity, and let him communicate better. The judge granted the delay.\n\nBoelter’s lawyers have declined to comment on the charges themselves, which could carry the federal death penalty. Thompson has said no decision has been made whether to seek it. Minnesota abolished its death penalty in 1911. But Attorney General Pam Bondi has said from the start that the Trump administration will be more aggressive in seeking capital punishment.\n\nProsecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. They also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nFormer President Joe Biden and former Vice President Kamala Harris joined the mourners at the Hortmans’ funeral last Saturday. Gov. Tim Walz, Harris’s running mate on the 2024 Democratic presidential ticket, eulogized Hortman as “the most consequential speaker in Minnesota history.”\n\nHortman served as speaker from 2019 until January. She then yielded the post to a Republican in a power-sharing deal after the House became tied in the 2024 elections, and became speaker emerita.","summary":"ST. PAUL, Minn. (AP) — The man charged with killing former Minnesota House Speaker Melissa Hortman and her husband, and wounding a state senator and his wife, is due back in federal court Thursday for a hearing that was put…","url":"https://www.thestar.com/news/world/united-states/man-charged-with-killing-former-minnesota-house-speaker-is-due-back-in-court-after-delay/article_8b782109-ea7c-50ac-abb2-2c163b7ebbf2.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/a/a1/aa16148b-705a-5319-b964-987c21f4c372/68602b499cd56.image.jpg?crop=1586%2C833%2C0%2C123&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-07-03 04:12:10","author":"Steve Karnowski The Associated Press","authors":["Steve Karnowski The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.42},{"id":337992182,"title":"Man charged with killing former Minnesota House speaker is due back in court after delay","text":"The man charged with killing former Minnesota House Speaker Melissa Hortman and her husband, and wounding a state senator and his wife, is due back in federal court Thursday for a hearing that was put on hold after his lawyer said his client had been unable to sleep while on suicide watch.\n\nThe hearing is expected to address whether Vance Boelter should remain in custody without bail and affirm that there is probable cause to proceed with the case. He's not expected to enter a plea. Prosecutors need to secure a grand jury indictment first, before his arraignment, which is when a plea is normally entered.\n\nAn unshaven Boelter, 57, of Green Isle, was wearing a green padded suicide prevention suit and orange slippers when he was brought into court last Friday. Federal defender Manny Atwal then asked Magistrate Judge Douglas Micko to continue the hearing. She said Boelter had been sleep deprived due to harsh conditions in the Sherburne County Jail, making it difficult for them to communicate.\n\n“Your honor, I haven’t really slept in about 12 to 14 days,” Boelter told the judge then. And he denied being suicidal. “I’ve never been suicidal and I am not suicidal now.”\n\nSherburne County Sheriff Joel Brott, whose jail houses both county and federal prisoners, rejected Boelter's claims of poor conditions as absurd. “He is not in a hotel. He’s in jail, where a person belongs when they commit the heinous crimes he is accused of committing,\" Brott said in a statement Friday. \n\nBoelter faces separate cases in federal and state court on charges of murder and attempted murder for what the state's chief federal prosecutor, Acting U.S. Attorney Joe Thompson, has called “a political assassination” and “a chilling attack on our democracy.” The feds are going first.\n\nAuthorities say Hortman and her husband, Mark, were shot to death in their home in the Minneapolis suburb of Brooklyn Park in the early hours of June 14 by a man disguised as a police officer who was driving a fake squad car. \n\nBoelter also allegedly shot and seriously wounded state Sen. John Hoffman, and his wife, Yvette, earlier that morning at their home in nearby Champlin. The Hoffmans are recovering, but Hortman's golden retriever, Gilbert, was seriously injured and had to be euthanized.\n\nBoelter surrendered near his home the night of June 15 after what authorities called the largest search in Minnesota history, a hunt of around 40 hours.\n\nAtwal told the court last week that Boelter had been kept in what’s known as a “Gumby suit,” without undergarments, ever since his first court appearance June 16. She said the lights were on in his area 24 hours a day, doors slammed frequently, the inmate in the next cell would spread feces on the walls, and the smell would drift to Boelter’s cell. \n\nThe attorney said transferring him to segregation instead, and giving him a normal jail uniform, would let him get some sleep, restore some dignity, and let him communicate better. The judge granted the delay.\n\nBoelter’s lawyers have declined to comment on the charges themselves, which could carry the federal death penalty. Thompson has said no decision has been made whether to seek it. Minnesota abolished its death penalty in 1911. But Attorney General Pam Bondi has said from the start that the Trump administration will be more aggressive in seeking capital punishment.\n\nProsecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. They also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nFormer President Joe Biden and former Vice President Kamala Harris joined the mourners at the Hortmans' funeral last Saturday. Gov. Tim Walz, Harris's running mate on the 2024 Democratic presidential ticket, eulogized Hortman as “the most consequential speaker in Minnesota history.” \n\nHortman served as speaker from 2019 until January. She then yielded the post to a Republican in a power-sharing deal after the House became tied in the 2024 elections, and became speaker emerita.","summary":"The man accused of killing former Minnesota House Speaker Melissa Hortman and her husband, and wounding a state senator and his wife, is due back in court after a week's delay","url":"https://www.independent.co.uk/news/world/americas/minnesota-mark-tim-walz-paul-gilbert-b2781649.html","image":"https://static.independent.co.uk/2025/06/28/18/Minnesota_Lawmakers_Shot_23360.jpg?width=1200","video":null,"publish_date":"2025-07-03 04:08:37","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.431},{"id":337669880,"title":"What happens if there's a tie vote in the House?","text":"The House began voting July 2, 2025, on whether to open debate for a sprawling Trump-backed domestic spending bill, but some GOP holdouts could endanger its passage. With such close margins, a tie vote is possible — here's a look back at what happens when the House ties.An unusual scene occurred on the House floor in February 2024 as the chamber's vote tally came to a tie at 215 to 215 when three House Republicans joined Democrats to oppose an effort to impeach Department of Homeland Security Secretary Alejandro Mayorkas. Although the impasse was quickly resolved, as a fourth House Republican changed his vote to oppose the bill in a procedural move that allows leadership to bring the legislation up again at a later date, it brought forward an issue that could come up again with a razor-thin Republican majority in the lower chamber — what happens if there's a tie vote in the House?What a tie vote means in the House According to House rules, in the case of a tie vote, a question before the chamber \"shall be lost.\" In the lower chamber, where Republicans hold just a slim majority and often see a handful of defections among their conference, there's no tie-breaker. Unlike in the Senate, where a tie-breaking vote may be cast, no one is brought in to resolve the issue.Breaking a tie vote in the SenateIn the upper chamber, which sees tie votes with more regularity, the Vice President is called upon to cast tie-breaking votes. In recent years, with a narrow Democratic majority in the Senate, Vice President Kamala Harris has on more than 30 occasions cast a tie-breaking vote, breaking the record set almost 200 years ago.","summary":"In the upper chamber, which sees tied votes with more regularity, the Vice President is called upon to cast tie-breaking votes.","url":"https://www.cbsnews.com/news/tie-vote-house-of-representatives/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/02/07/e88ff3ce-93d3-4d6d-b52e-70333353917d/thumbnail/1200x630/8246e830a27d308b5581e1cfc5db171e/gettyimages-1983626684.jpg","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/02/07/2307021891618/2661888_hls/master.m3u8","publish_date":"2025-07-03 02:33:44","author":"Kaia Hubbard","authors":["Kaia Hubbard"],"language":"en","category":"politics","source_country":"us","sentiment":-0.001},{"id":337676124,"title":"Freedom of the Press Foundation Weighing Legal Options Against Paramount Over Trump Settlement","text":"The Freedom of the Press Foundation is weighing its legal options following Paramount Global’s $16 million dollar settlement with President Donald Trump after the nonprofit filed a shareholder information demand asking for a litigation hold.\n\n“Today is a dark day for press freedom. Paramount’s spineless decision to settle Trump’s baseless and patently unconstitutional lawsuit is an insult to the journalists of ‘60 Minutes’ and an invitation to Trump to continue targeting other news outlets,” Seth Stern, director of advocacy at Freedom of the Press Foundation, said in a statement. “Each time a company cowers and surrenders to Trump’s demands it only emboldens him to do it again. It will be remembered as one of the most shameful capitulations by the press to a president in history.”\n\nFPF, a press freedom advocacy group, already filed a shareholder information demand back in May and said Wednesday it’s exploring further legal action to hold Paramount’s board accountable for what it sees as a capitulation to Trump that violates shareholders’ interests and the First Amendment. The organization itself is a shareholder.\n\nThe FPF called out the settlement as a conflict of interest and said it was “intended to clear the way for federal approval” in the sale of Paramount to Skydance Media which would also “result in a multimillion-dollar payout to Paramount Chair Shari Redstone.”\n\nThe nonprofit already filed a shareholder information demand to Redstone and announced Wednesday they are sending a second demand to uncover information regarding the decision. Based on the information, the FPF “will continue to pursue our legal options to stop this affront to Paramount shareholders, CBS journalists and the First Amendment.” The initial filing called the lawsuit “frivolous” and notified Paramount of its intention to take legal action in the event of a settlement with Trump. \n\nMany have called the settlement problematic with three U.S. senators (Elizabeth Warren, Bernie Sanders and Ron Wyden) launching an investigation into whether paying off Trump through a settlement to obtain approval of the sale would violate federal bribery and other laws. The California Senate opened a similar investigation.\n\n“With Paramount folding to Donald Trump at the same time the company needs his administration’s approval for its billion-dollar merger, this could be bribery in plain sight,” Warren said in a Wednesday statement to TheWrap. “Paramount has refused to provide answers to a congressional inquiry, so I’m calling for a full investigation into whether or not any anti-bribery laws were broken.”The settlement with Trump covers legal fees and other costs, as well as a donation that will be allocated to a “future presidential library.” Paramount also said that “in the future, ’60 Minutes’ will release transcripts of interviews with eligible U.S. presidential candidates after such interviews have aired, subject to redactions as required for legal or national security concerns.”\n\nNotably, the settlement does not include any statement of apology or regret from CBS or “60 Minutes.”\n\nParamount co-CEO George Cheeks addressed the settlement in a shareholder call early Wednesday morning and said the decision allows the company to focus on “core objectives, rather than being mired in uncertainty and distraction.”\n\nTrump initially sued CBS and “60 Minutes” for $20 billion, claiming that an Oct.7 interview with former Vice President Kamala Harris was deceptively edited and caused him “mental anguish.”\n\nTrump’s legal team called the settlement a “win for the American people.”“With this record settlement, President Donald J. Trump delivers another win for the American people as he, once again, holds the Fake News media accountable for their wrongdoing and deceit,” a spokesperson for Trump’s legal team said in a statement. “CBS and Paramount Global realized the strength of this historic case and had no choice but to settle.”\n\nParamount did not immediately respond to TheWrap’s request for comment.","summary":"The nonprofit organization is a Paramount Global shareholder and filed an information demand back in May asking for a litigation hold\n\n\nThe post Freedom of the Press Foundation Weighing Legal Options Against Paramount Over Trump Settlement appeared first on TheWrap.","url":"https://www.thewrap.com/freedom-of-the-press-foundation-paramount-settlement/","image":"https://www.thewrap.com/wp-content/uploads/2025/06/Redstone.jpg","video":null,"publish_date":"2025-07-03 02:20:57","author":"Daren DeFrank","authors":["Daren DeFrank"],"language":"en","category":"politics","source_country":"US","sentiment":-0.514}]}