{"offset":0,"number":50,"available":543,"news":[{"id":294725102,"title":"How Trump's No Tax on Overtime Proposal Compares to Current Tax Procedure","text":"Earlier this week, House Republicans passed a budget resolution that sets the stage for President Donald Trump's legislative agenda, including a potential policy eliminating federal taxes on overtime pay.While the measure does not yet have a formal bill, it aligns with Trump's campaign pledge to remove income tax from workers' overtime earnings.Why It MattersThe House budget resolution, which passed by a narrow 217-215 vote, allows Congress to negotiate tax and spending cuts but does not specify how these changes will be enacted. However, it has the potential to have significant repercussions for taxpayers nationwide.What To Know About The Current Tax SystemUnder the current tax code, overtime pay is treated like regular wages. Employees earning overtime are paid at least 1.5 times their standard hourly wage for hours worked beyond 40 per week, according to the Fair Labor Standards Act. However, this additional income is still subject to federal income tax, Social Security tax, and Medicare tax, just like regular wages.\"Overtime pay is an economic factor becoming more common, as some employers are having a harder time staying fully staffed and are leaning on existing employees to fill those additional hours,\" Alex Beene, financial literacy instructor for the University of Tennessee at Martin, told Newsweek.\"Consequently, even with additional pay, it can be difficult to find employees willing to take on those extra hours each week.\"Beene said that a no-tax proposal wouldn't just gain favor with employees earning additional dollars—it would be used as a marketing tactic for employers looking for ways to promote overtime to their employee base.\"The only question will be if Congress will be as enthusiastic to the proposal, especially at a time when more focus is being given to the national debt,\" Beene said.What Trump's Proposal Would ChangeA part of Trump's 2024 presidential campaign promise was his pledge to eliminate federal income taxes on overtime earnings, which he argues would encourage workers to take on additional hours and boost overall wages.The measure to cut taxes on overtime is part of Trump's broader tax cut initiative, his \"big, beautiful bill\" that includes eliminating some Social Security benefits and cutting taxes on tips, one of the rare commonalities he shared with former Vice President Kamala Harris, his 2024 opponent.\"To those hotel workers and people who get tips, you are going to be very happy because when I get to office, we are going to not charge taxes on tips, people making tips,\" Trump said last summer at a campaign rally in Nevada. \"We're going to do that right away, first thing in office.\"Republicans have supported the tips promise, and Texas Senator Ted Cruz introduced a bill that would amend the Internal Revenue Code to cut the application of the income tax on cash tips through a deduction allowed to all taxpayers.Trump has positioned the potential policy on overtime pay as a way to benefit hardworking Americans. At a September 2024 rally, he said: \"The people who work overtime are among the hardest working citizens in our country, and for too long, no one in Washington has been looking out for them.\"The nonpartisan Committee has criticized his broader agenda for a Responsible Federal Budget. The group predicts that Trump's overarching tax wish list could reduce revenue by $5 trillion over a decade and lead to income shifting, tax avoidance, higher interest costs, weakening of Medicare and Social Security trust funds and increase the risk of a debt spiral.What Happens NextWhile the House budget resolution sets the stage for legislative discussions, it has not yet enacted any specific tax policies.The Senate must also approve a version of the budget, and lawmakers must negotiate details before any changes occur. If a bill is introduced and passed, it could significantly alter how overtime earnings are taxed, but for now, overtime pay remains subject to the standard tax system.","summary":"Trump's proposal seeks to eliminate federal income tax on overtime pay, raising concerns over revenue loss.","url":"https://www.newsweek.com/no-tax-overtime-tips-donald-trump-irs-2036876","image":"https://d.newsweek.com/en/full/2596489/president-donald-trump.jpg","video":null,"publish_date":"2025-02-26 23:32:23","author":"Kate Nalepinski,Suzanne Blake","authors":["Kate Nalepinski","Suzanne Blake"],"language":"en","category":"politics","source_country":"us","sentiment":0.122},{"id":294729274,"title":"‘Political Athlete’: JD Vance Is Emerging As Most Active VP In Decades","text":"Vice President JD Vance is distinguishing himself as the most active vice president since former Vice President Dick Cheney in the early days of the second Trump presidency, taking charge on matters ranging from finding a deal to save TikTok to castigating European elites and leveraging Senate relationships to help advance key cabinet nominees.\n\nIn addition to taking on policy and working behind-the-scenes on Capitol Hill, Vance is aggressively pushing the Trump administration’s interests across the board and defending the Trump agenda as a chief spokesman of the Make America Great Again (MAGA) movement. Vance is showing himself to be a visible, committed and versatile enforcer of the Trump agenda with just a few weeks on the job under his belt.\n\n“Vance carries credibility with so many of these senators, and at a minimum, can be a radar for how they’re viewing things and inform the White House in terms of its own legislative strategy. So yeah, he definitely plays multiple parts for Trump,” Scott Jennings, an on-air conservative pundit for CNN, told the Daily Caller News Foundation. “Obviously, communications is public-facing, and there’s also behind-the-scenes legislative strategy. It was a great pick for Trump. And Trump had an embarrassment of riches, I think, when it came to picking this number two slot, but in Vance, they’ve got somebody who can do multiple things and do them well, and has a lot of credibility in numerous venues.” (RELATED: JD Vance Dunks On Former MSNBC Host Over Free Speech Debate)\n\nOn the policy front, the vice president is keeping himself busy. For example, Trump tasked Vance to take point on finding a deal to save TikTok in the U.S. and make use of his connections to Silicon Valley and the tech industry to help that process along, sources close to the vice president told the DNCF.\n\nFormer President Joe Biden signed the TikTok divest-or-ban bill into law in April 2024 with the help of congressional Republicans who supported the bill out of concern that the Chinese Communist Party (CCP) manipulates the platform to serve its own interests and undermine those of the U.S.\n\nTrump attempted to implement a similar policy in his first term, but he later came out against the law on the 2024 campaign trail and signaled he supports finding a way to keep the app accessible in the U.S. under the right conditions.\n\nGiven that many China-hawk Republicans in Congress supported banning Chinese-owned TikTok from the U.S. market, Vance could be navigating a somewhat fraught environment as he works to find a satisfactory deal. Trump signed a day-one executive order that paused enforcement of the TikTok law for a 75-day period for a deal to be reached, so Vance will have until early April to settle the issue.\n\nIf Vance’s experience helping Trump cabinet picks clear the Senate is any indication, he could leverage his existing relationships on Capitol Hill — forged over the period of two years before Vance hopped aboard the Trump campaign in July 2024 — to find an acceptable resolution to TikTok’s complicated situation.\n\n‘The Most Active Vice President Since Dick Cheney’\n\nVance played a leading role in assuaging the concerns that holdout Republican Sens. Todd Young of Indiana and Bill Cassidy of Louisiana had about signing off on the since-confirmed Human Health and Services Secretary Robert F. Kennedy Jr. and Director of National Intelligence Tulsi Gabbard, the Daily Caller reported on Friday. Vance was able to successfully whip the key votes for two of Trump’s most controversial cabinet picks from the two senators in part because the three men established and maintained good relations through Vance’s time in the Senate. (RELATED: JD Vance Gives Economics Lesson For CBS Host Trying Gotcha Question On Inflation)\n\nChristopher Bedford, senior politics editor and Washington correspondent for Blaze Media, told the DCNF he does not think Gabbard or Kennedy Jr. would have cleared the Senate confirmation process without Vance’s substantial behind-the-scenes efforts. Bedford is the former editor-in-chief of the DCNF and currently sits on its board of directors.\n\n“From everyone I’ve spoken to who spends time with them, they have a legitimate warmth between them, a friendship which gives some cover to be more outspoken,” Bedford said of Vance and the vice president’s relationship with Trump. “He’s been an ideological enforcer, the ‘stick’ part of negotiations with the Senate, but he’s also been the ‘carrot’ part, where he’s at White House meetings past midnight with senators working to get them over the line on different nominations. I strongly suspect that if it was not for JD Vance, you would not have seen Tulsi Gabbard, RFK Jr. or Pete Hegseth confirmed.”\n\nBiden did not make policy news often during his time as vice president, with rare exceptions like coming out in favor of legalizing gay marriage before his boss, Bedford explained, and former Vice President Kamala Harris was not widely considered to be an effective vice president for much of her tenure before she took Biden’s spot atop the presidential ticket in 2024. Compared to the two Democrats and former Vice President Mike Pence, Vance “is the most active vice president since Dick Cheney,” Bedford wrote in a Monday newsletter.\n\nCheney may not see today’s key policy issues the same way as Vance, but he was indeed a highly active vice president. Cheney is considered — including by his critics — to be one of the most powerful and engaged vice presidents in American history; he influenced policy related to the war on terror, worked to corral his former colleagues on Capitol Hill and played a major role in helping get Bush administration personnel in place, among other important undertakings.\n\nSenators who have seen Vance at work in his new role also describe the vice president as an asset to Trump as he takes on the status quo in D.C.\n\nRepublican Wyoming Sen. John Barrasso highlighted Vance’s “strong, personal relationships across the Senate Conference” that make him “a key member of our team” in a statement to the DCNF. In a statement of his own, Republican Indiana Sen. Jim Banks described Vance as “a big strategic asset” to Trump who “believes in the president’s agenda, can articulate it clearly and concisely” and knows how to navigate Capitol Hill.\n\n‘He Suffers No Fools’\n\nVance has been a fixture on legacy media Sunday news shows since being nominated to be Trump’s vice president in July 2024, consistently sparring with liberal hosts asking aggressive questions about the impacts and causes of Trump administration policy while often rejecting the premises underlying the hosts’ inquiries.\n\nThese exchanges have produced many viral moments, including his famous “I don’t really care, Margaret” retort in a discussion with CBS News’ Margaret Brennan about whether an Afghan migrant arrested while planning a terror attack in Oklahoma had been “properly vetted.” (RELATED: ‘I’m Going To Ask You Again’: JD Vance Calls Out NY Times Reporter For Regurgitating ‘Slogans’)\n\n 🔥WATCH🔥: VP Vance SHUTS DOWN CBS reporter on illegal immigration. BRENNAN: “It wasn’t clear if he was radicalized when he got here…” VANCE: “I don’t really care, Margaret. I don’t want that person in my country.” pic.twitter.com/swgockPnj6 — Daily Caller (@DailyCaller) January 26, 2025 \n\n“He is unapologetic. He suffers no fools,” CNN’s Jennings told the DCNF. “That is the sort of pugnacious, in-your-face communication style that I think they greatly value at the White House, and he is not going to shrink in the face of some of this lunacy that Trump faces from the media and from some audiences on a daily basis.”\n\nVance displayed some of the traits Jennings described to the DCNF during the televised portion of Trump’s first cabinet meeting in the second term on Wednesday. The vice president made a point to push back on media criticisms of the administration for its willingness to negotiate with Russia over the end of the Ukraine war, stating that Trump has not “conceded anything to anyone,” but is instead doing his job as a diplomat by moving to end a bloody war.\n\n“I mean, that’s the value of Vance’s skillset. He is not a shrinking violet. He will stand right up against lunatic questions or misinformed vectors in some of these interviews. And not only does he stand up to it, he sets the record straight,” Jennings said.\n\nWhile he has proven himself an effective communicator and attack dog for the MAGA agenda within the confines of cable news interviews, Vance has also demonstrated that he can aggressively drive home the administration’s message from behind the podium in longer-form speeches addressing abortion, foreign relations, artificial intelligence and many things in between. He has cemented himself as one of the preeminent spokesmen of the MAGA movement, driving the America First message at home and abroad in high-visibility public appearances.\n\nPerhaps most notably of all his speeches, Vance chided the European and Transatlantic elites gathered before him at the Munich Security Conference earlier in February for refusing to respond to voters’ concerns about mass migration and escalating censorship of alternative views that challenge the European establishment’s consensus. As the crowd sat stone-faced, Vance warned that “the retreat of Europe from some of its most fundamental values” poses a threat to the continent and its longstanding special relationship with the U.S., reminding Europe that its bond with America only works best when the two powers base their relationship in upholding the shared values of the West.\n\nAdditionally, Vance ventured to Damascus, Virginia, in January to publicly criticize the Federal Emergency Management Agency (FEMA) for its “bureaucratic inadequacy” under former President Joe Biden’s watch as it responded to 2024 hurricanes that decimated huge swaths of Appalachia and the Southeast. Vance then headed to East Palestine, Ohio, to mark the third anniversary of the Norfolk Southern train derailment disaster in that community.\n\nThe vice president also extolled the virtues of having children during a major speech at the 52nd March for Life in Washington, D.C., in January and kicked off the 2025 Conservative Political Action Conference (CPAC) this month with remarks on a wide array of policy issues after he drove home the need for America to win the artificial intelligence race at February’s Artificial Intelligence Action Summit in Paris, France.\n\n“He’s a political athlete, and when you’re the head coach, you want to put your best athletes in the game as often as possible,” Jennings said of Vance.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'He is not a shrinking violet'","url":"https://dailycaller.com/2025/02/26/political-athlete-jd-vance-is-emerging-as-most-active-vp-in-decades/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/02/GettyImages-2200864002-e1740421036752.jpg","video":null,"publish_date":"2025-02-26 23:27:59","author":"Nick Pope","authors":["Nick Pope"],"language":"en","category":"politics","source_country":"US","sentiment":0.266},{"id":294724686,"title":"RFK Jr. as Health Secretary Triggers Fear—Here’s How Women Are Taking Control of Their Health!","text":"Now that RFK Jr. has been officially confirmed as the 26th U.S. Health Secretary, many American women are considering changes in their healthcare access. His appointment includes overseeing the “Make America Healthy Again Commission” under President Donald Trump, which has already sparked unease. In just over a week, the Commission has questioned mental health medications and launched a review of the childhood vaccine schedule. Well, these moves are a clear contradiction to the earlier promises of maintaining the status quo.\n\nThe reproductive rights are already in a precarious state, and many women are discussing ways to safeguard their physical and mental health. A Reddit user asked the r/WomenOver30 community, “What should I be doing health-wise as a woman over 30 to protect myself and prepare for the next four years now that RFK Jr. is confirmed as the health secretary?”\n\nWomen from all walks of life talked about their concerns, strategies, and advice on how they are preparing for possible changes in healthcare. \n\nProtecting Digital Privacy\n\nMany users urged women to be cautious with their digital footprint. The concern is more valid particularly with period-tracking apps. A Reddit user warned, “Delete your period tracking app. Nothing is stopping these companies from giving your data to authorities who want to prosecute women for suspicion of abortions.”\n\nOrganizing and Community Involvement\n\nSome users talked about how important it was to take action beyond personal safety. Another Reddit user put a word: “Find a local political group and get involved ASAP—from grassroots campaigns to volunteering for abortion funds.”\n\nThey added that while individual precautions like getting an IUD or stocking up on medications are essential, systemic changes of course needs collective action. “Yes, get your passports, vaccines, and birth control. But above all, be part of the change.”\n\nView this post on Instagram\n\nPrioritizing Essential Vaccinations\n\nRFK Jr.’s history of opposing vaccines has raised concerns, particularly regarding access to the HPV vaccine. A user shared their personal experience where they mentioned how their father had been anti-vaccine and prevented them from getting the HPV vaccine in school. “By the time I got it as an adult, I had already contracted one of the high-risk cancer strains. Now, at 31 years old, I already have pre-cervical cancer.”\n\nLong-Term Birth Control\n\nSeveral users discussed the importance of securing birth control options before any restrictions could be imposed. Shared their approach, a user said, “I just got my third IUD in December. I had another year left, but given the new administration, I figured I’d get it done now.”\n\nAnother user, took it a step further and suggested sterilization for those who never plan on having children. The comment reads, “With the rising rates of childbirth-related deaths, the risk isn’t worth it.”\n\nFood Security and Self-Sufficiency\n\nSome users suggested preparing for potential supply chain disruptions by growing their food could be a good way as well. An Internet user encouraged women to start a home garden, as evident from the statement, “Between deportation, trade wars, and a likely gutting of the FDA, fresh food may become unaffordable or unsafe.”\n\nEYE-WATERING MOMENT: RFK Jr. delivers an emotional tribute to President Trump after being sworn in as HHS Secretary.\n“For 20 years, I’ve gotten up every morning on my knees and prayed that God would put me in a position where I could end the childhood chronic disease epidemic in… pic.twitter.com/wqbxzglwiI\n— The Vigilant Fox 🦊 (@VigilantFox) February 13, 2025\n\nThey recommended beginner-friendly crops like tomatoes, peppers, and zucchini and noted that even apartment dwellers can grow food using an aeroponic system.\n\nStocking Up on Essential Medications\n\nWomen also shared their concerns about access to fluoride, as some Republicans have floated the idea of removing it from water supplies. Someone remarked, “I might be misinformed about how serious this is, but my first thought was to stock up on high-fluoride toothpaste.”\n\nAnother user agreed, “Fluoride in toothpaste is crucial, especially for people without access to proper dental care. If they remove it from the water, it will have a major impact on children and low-income adults.”\n\nStrengthening Physical Health\n\nSeveral users said about the importance of building strength to be through the future healthcare struggles. Someone said that “We all know that a bad mammogram can happen, and you do NOT want to go through chemo without muscle mass.”\n\nPreparing for Emergency Healthcare\n\nOthers stepped in to talk about the importance of learning first aid and CPR. A person recommended checking with local EMT services for training, “Our office installed a new AED, and an ambulance service provided certified training—more accessible and less expensive than Red Cross.”\n\nStockpiling Medications and Emergency Contraception\n\nIn RFK Jr.’s first statement since becoming HHS Secretary, he applauded Trump dismantling USAID, calling it “a sinister propagator of totalitarianism and war across the globe.”\nHis uncle, President John F. Kennedy, created USAID 64 years ago.\nWhat a disgrace to his family. pic.twitter.com/SCqHtZhbbB\n— Protect Kamala Harris ✊ (@DisavowTrump20) February 13, 2025\n\nUsers also suggested to obtain essential prescriptions while they are still accessible. One such advice came from a user who wrote, “When you see your GP, get prescriptions for Plan B and other pregnancy-related medications because access may become limited.”\n\nSimilarly, a Reddit user noted that generic Plan B can be ordered online and discreetly delivered, “It might feel sketchy at first, but it works, and the meds arrive in the mail.”\n\nSeeking Alternatives to the U.S. Healthcare System\n\nSome women expressed their fears about the future of healthcare in America. A woman on Reddit had a blunt suggestion: “If you have the means, I suggest leaving the country. This s–tshow will only get worse, and as long as you’re free and able, there’s no reason to stick around and watch the circus unfold.”","summary":"With RFK Jr. leading the U.S. Health Department, American women are taking precautions to protect their healthcare access with below mentioned means!","url":"https://www.inquisitr.com/rfk-jr-as-health-secretary-triggers-fear-heres-how-women-are-taking-control-of-their-health","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/RFK-Jr.png","video":null,"publish_date":"2025-02-26 23:17:11","author":"Mohar Battacharjee","authors":["Mohar Battacharjee"],"language":"en","source_country":"us","sentiment":-0.067},{"id":294717728,"title":"Washington Post drops ‘leftist dogma’ in effort to boost readership: Tiana Doescher","text":"Bezos, the owner of the Washington Post, revealed on X that the paper would no longer publish opinion editorials opposing “personal liberties” or “free markets ” and would instead focus on writing “every day in support and defense” of them. The change, part of the “vibe shift” taking place across the nation, is a stark contrast to how people on “the Left” have ditched any notion of free speech or personal liberties being good.\n\nI shared this note with the Washington Post team this morning:I’m writing to let you know about a change coming to our opinion pages. We are going to be writing every day in support and defense of two pillars: personal liberties and free markets. We’ll cover other topics too…— Jeff Bezos (@JeffBezos) February 26, 2025\n\n“Bezos is a money man. He also sees what the future holds,” Doescher, a commentary writer for the Washington Examiner, explained on Fox News’s The Will Cain Show. “He sees that it’s bad business to continue trying to do what The New York Times has essentially had total domain over. Just remember Will: WaPo is on track for $100 million dollar net losses every single year. So right now, if the same thing isn’t working, if the same leftist dogma and groupthink isn’t working, why not try something new?”\n\nDoescher added that many billionaires involved in technology, such as Bezos, X owner Elon Musk, and Meta CEO Mark Zuckerberg, were all part of the “Obama-era idealism” in celebrating technology and what it can accomplish for humanity. However, these same billionaires were only rewarded with an “eat the rich” mentality among the public and a lack of growth in business despite creating “millions of jobs.”\n\nAdditionally, Doescher cited how the Washington Post’s audience was “decimated” during former President Joe Biden‘s leadership, dropping from 22 million daily users to just 2.5 million daily users.\n\n“And so I think Trump, and this new era, have given someone like Bezos permission to channel an energy that, let’s be real, he’s a capitalist, he knows that this stuff hasn’t been winning,” Doescher said. “He thought he could be empathetic, and he thought he could guide the culture, and he thought he could learn from the Left, and the Left didn’t want to teach anyone. They wanted to control thought.”\n\nTRUMP ADMINISTRATION BOOSTS NEWSMAX IN DEBUT SHAKE-UP OF PRESS ROTATION\n\nBezos, along with Musk and Zuckerberg, was among those in attendance at President Donald Trump’s inauguration. Prior to the 2024 election, the Washington Post opted not to issue a presidential endorsement, even though one for then-Vice President Kamala Harris was already in the works before Bezos pulled the plug.\n\nBravo, @JeffBezos! https://t.co/XZOxVryVTa— Elon Musk (@elonmusk) February 26, 2025\n\nMusk, a key ally of Trump, applauded Bezos’s decision to champion personal liberties and free markets, writing “bravo” on X regarding Bezos’s decision.","summary":"The Washington Examiner’s Tiana Lowe Doescher suggested that Jeff Bezos’s changes to the Washington Post, including dropping its &#8220;leftist dogma,&#8221; could be a bid to boost its readership. Bezos, the owner of the Washington Post, revealed on X that the paper would no longer publish opinion editorials opposing “personal liberties” or “free markets &#8221; and [&#8230;]","url":"https://www.washingtonexaminer.com/news/3331439/washington-post-drops-leftist-dogma-boost-readership-tiana-doescher/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/Bezos-the-post-scaled.webp","video":null,"publish_date":"2025-02-26 22:57:01","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.094},{"id":294721294,"title":"Trump Posts AI-Generated Video of Genderqueer Bellydancers Frolicking","text":"Late last night, Donald Trump took to Truth Social, the social media platform he has a majority stake in, to publish a hallucinatory AI-generated video of what he purports a Trump-ruled Gaza Strip might one day look like.\n\nThe video opens with synthetic clips depicting a war-torn Gaza, where ominous automatic rifle-wielding figures stand by while children run through rubble. That dire scene then melts away, and viewers are instead greeted with a string of AI-generated clips advertising an imagined Gaz-a-Lago: seaside high-rises, a person who looks like billionaire Elon Musk eating snacks and throwing cash at kids, a giant golden statue of the current American president, and Trump himself dancing with a scantily-clad woman and lounging poolside with Israeli prime minister Benjamin Netanyahu.\n\nPeople in this imagined Gaza also, apparently, according to the video, carry around golden balloons designed to look like Trump's head, and buy tiny golden statues of the self-styled American king. (The advertisement is even soundtracked by a promotional song, which sounds to be likely AI-generated as well.)\n\nAnd yet, somehow, that's not even all.\n\nIncredibly, the video also showcases a cohort of AI-generated dancers moving sensually on a beach, who despite their more traditionally feminine, ab-baring outfits have long hair and beards that present as masculine. Indeed: in Trump's gold-filled Gazan fantasyland, his imagined \"riviera of the Middle East\" includes gyrating trans, genderfluid, or otherwise gender-nonconforming bellydancers.\n\nThe inclusion of the dancers in the clip is confounding given Trump's and his MAGA base's contempt for transgender and gender nonconforming people.\n\nImmediately after taking office, the 47th president signed an executive order decreeing that it's now the \"policy of the United States to recognize two sexes, male and female.\" Trump has also signed executive orders blocking people under the age of 19 from access to gender-affirming care, banning trans women from competing in women's sports, and forbidding trans people from serving in the military. Several of these actions, among others, are under some level of federal review. But as judges weigh the legality and scientific accuracy of the orders, the message is loud and clear: the Trump White House thinks there's something wrong with trans people, and will do anything possible to make their lives more difficult.\n\nOn an intertwined note, the administration has also been hard at work waging a war on diversity, equity, and inclusion (DEI) initiatives, including the erasure of references to LBGTQ+ health from public databases. The president has elsewhere piled in on the demonizing of drag shows, canceling future drag events at the Kennedy Center — where Trump, breaking from past presidencies, recently took over the board and programming — while parroting the baseless far-right claim that drag performers target American kids.\n\n\"Just last year, the Kennedy Center featured Drag Shows specifically targeting our youth,\" the president claimed — again, baselessly — earlier this month in a Truth Social post. \"THIS WILL STOP.\"\n\nAll to say, it feels very unlikely that the current president's vision for Trump Gaza would include provocatively dancing seaside xaddies rocking long beards and midriff-revealing bikinis and skirts.\n\nBut here we are, and to that end, the dancing figures' inclusion in the promotional video raises unfortunate questions. After all, this isn't the account of a random poster; this is an official channel of the president of the United States. It's hard to believe that the clip went through any comprehensive review by a communications team, let alone careful scrutiny by the president himself.\n\nOf course, Trump has a well-documented affinity for AI. During the run-up to the 2024 election, he posted AI-generated images depicting his then-opponent, former vice president Kamala Harris, as a communist; synthetic pictures himself praying; and AI-made imagery showing fake lines of immigrants pouring out of apocalyptic-looking hospitals. And on the note of scrutiny, he's also been known — with alarming frequency — to mistake synthetic content as the real deal: the faux \"Swifties for Trump\" debacle was a perfect example, as was his recent mistaking of an AI crypto meme for a real image of a General Motors car. (It's also worth noting that the AI slop has been embraced more broadly by the MAGA movement — though other folks have been dipping their toe in that pool these days, too.)\n\nTo be sure, there are plenty of real things wrong with this video. That the president of the United States would post AI slop advertising the remodeling of a war-torn region — a place where tens of thousands of Palestinians, children included, are dead and dozens of Israeli hostages are still awaiting release — at a time when continued peace talks are entering a crucial and tentative new phase is disturbing on its face. The AI-generated Trump Gaza ad also fails to show the grim realities of what it means to forcibly displace millions of people, as Trump himself has said his grand remodeling idea would involve. And, by the way, Judeo-Christian texts are pretty clear that installing giant golden statues in or near the Holy Lands is... well, not great.\n\nAdd it all up, and our bearded beachfront heroes feel like the only real glimmer of hope in this synthetically-crafted dreamscape — even if their inclusion is likely the result of a too-quick social media trigger finger.\n\nMore on Trump Administration close-reading: Trump Appears to Have Accidentally Declared That Every Person in America Is Now Female","summary":"Late last night, president Donald Trump took to Truth Social, the social media platform he has a majority stake in, to publish a — strange? Baffling? Horrifying? All of the above? — AI-generated video of what he purports a Trump-ruled Gaza Strip might one day look like. The video opens with synthetic clips depicting a war-torn Gaza, where ominous automatic rifle-wielding figures stand by while civilians piece through ruin and children run through rubble. Quickly, though, that dire scene melts away, and viewers are instead greeted with a string of AI-generated clips advertising an imagined Gaz-a-Lago: seaside high-rises, a person […]","url":"https://futurism.com/trump-ai-genderqueer-bellydancers","image":"https://wordpress-assets.futurism.com/2025/02/trump-ai-genderqueer-bellydancers.jpg","video":null,"publish_date":"2025-02-26 22:34:15","author":"Maggie Harrison Dupré","authors":["Maggie Harrison Dupré"],"language":"en","category":"politics","source_country":"us","sentiment":-0.131},{"id":294713184,"title":"Donald Trump's Favorability Gap Is Slipping, Poll Shows","text":"President Donald Trump's favorability rating appears to be on a downward trajectory just five weeks into his second term, according to recent opinion polls.Newsweek reached out to the White House via email for comment on Wednesday.Why It MattersAfter achieving a decisive election victory over former Vice President Kamala Harris in November, polling showed Trump with improved favorability and his best-ever job approval ratings shortly after entering office on January 20.However, the president and his administration have recently faced backlash following a series of controversial executive orders, mass firings of federal workers and attempts to gut government agencies by Elon Musk and his Department of Government Efficiency (DOGE).What To KnowA poll released by The Economist/YouGov on Wednesday found that 47 percent of respondents had a favorable opinion of Trump, while 50 percent had an unfavorable opinion of the president.A version of the same poll released last week showed that 49 percent of respondents had an unfavorable opinion of Trump, and 47 percent had a favorable opinion. One week earlier, the poll showed the president with an equal rating, with 48 percent of respondents each viewing him unfavorably and favorably.One week into his second term, 50 percent of Americans viewed Trump favorably, and 48 percent viewed him unfavorably, according to a poll released on January 29. The results show that in less than one month, Trump's favorability rating has gone from net 2 percent favorable to net 3 percent unfavorable.The latest version of The Economist/YouGov poll was conducted among 1,604 U.S. adults in online interviews between February 23 and February 25. It has a margin of error of 3.4 percent.An average of recent polls compiled by the polling analysis website 538 showed that Trump had a net 1.9 percent unfavorable rating as of Wednesday.What People Are SayingAllan Lichtman, a distinguished professor of history at American University, previously told Newsweek: \"Trump has consistently garnered poor favorability ratings. Americans object to many aspects of Trump's character: His disdain for the law, his grifting, his dishonesty, and his sexual harassment of women.\"These flaws outweigh what people view as positive in his character: His forcefulness and willingness to speak his mind and challenge conventional wisdom.\"Democratic House Minority Leader Hakeem Jeffries told CNN: \"Donald Trump's poll numbers aren't going up. They are coming down, particularly as it relates to his management of the economy...Donald Trump is a chaos agent who promised to lower costs, lower the high cost-of-living in the United States of America, and he's doing the exact opposite because he's not focused on it.\"What Happens NextTrump's favorability rating will likely continue to change as his presidency continues. Public opinions on administration policies and issues like the state of the country's economy could significantly impact future favorability ratings.","summary":"The public's views on the president appear to be souring only five weeks into his second term.","url":"https://www.newsweek.com/donald-trump-favorability-poll-2036822","image":"https://d.newsweek.com/en/full/2596419/donald-trump-favorability-ratings-slide-poll.jpg","video":null,"publish_date":"2025-02-26 22:03:47","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"us","sentiment":0.019},{"id":294712430,"title":"Debating Elon Musk’s DOGE cuts: Letters to the Editor — Feb. 27, 2025","text":"The Issue: Confusion and turbulence amid Elon Musk-led budget cuts to federal government.\n\nThe key lesson to be learned from DOGE so far is this: When you put the wrong people in charge of taxpayers’ money, you get endless fraud and waste (“Serious about cuts,” Editorial, Feb. 25).\n\nOur leaders in Congress and civil servants in the federal government, despite stating their desire to “serve,” really do the opposite. \n\nThey all seem to acquire wealth beyond what would be expected from their salaries, while taxpayers fall further behind.\n\nNow that their combination of incompetence and corruption is being exposed, they’re squealing like stuck pigs. \n\nThey have been out of touch for so long that they can’t even see how foolish and corrupt they look trying to save the wasteful and fraudulent system.\n\nBarry McIntyre\n\nCalgary, Canada\n\nWhat is going on between President Trump and Elon Musk?\n\nTrump says he’s bringing jobs back to the United States, while Musk seems determined to replace those jobs with artificial intelligence. \n\nMusk is in the process of firing federal employees and contractors by the tens of thousands, while Trump’s Cabinet members are calling those employees and contractors back.\n\nMusk warns that there will be economic pain for Americans. \n\nTrump says not so much. \n\nIt’s a helluva way to run a country.\n\nMike Barrett\n\nAshburn, Va.\n\nSome government workers are refusing orders from Musk’s Department of Government Efficiency to describe their job functions.\n\nProbably because 80% of them don’t have job descriptions and don’t do anything in their positions. \n\nWhy would someone refuse to disclose what they do at work? \n\nThis isn’t private industry — taxpayers pay their salaries. \n\nWe should demand to know what they do.\n\nPeter Sulzicki\n\nStratford, Conn.\n\nThe DOGE entity is a fraud, a sham and most certainly illegal, as it has not been established as a department of government by Congress.\n\nI’m pretty sure our Constitution does not allow such an ad hoc entity, established by executive order, to be incorporated into government unless granted legal status and ratified by Congress. \n\nSid Sussman\n\nHallandale, Fla.\n\nThe Issue: Former Vice President Kamala Harris’ acceptance speech for NAACP Chairman Award.\n\nAccepting the NAACP Chairman’s Award, former Vice President Kamala Harris told us to not lose hope in the Democratic Party as it struggles with its next direction (“Lefties get pep talk from Kamala,” Feb. 24).\n\nShe told supporters not to give up: “We know exactly what to do, because we have done it before, and we will do it again.”\n\nHarris appeared not to have a clue that her words inadvertently directed people to not vote for her. Again, she said, “we know exactly what to do . . . and we will do it again.” \n\nThat message was perfectly clear to me: The American people know what to do (not vote for Democrats), and should do it again.\n\nAlan Hirsch\n\nPort Washington\n\nKamala Harris’ sore-loser speech at the NAACP clearly underscores how marginal a political force she has become.\n\nDoes she not understand that the overwhelming majority of Americans have rejected her perspective on where the United States is and where it should be going? \n\nJay Roberts\n\nWhat did Harris contribute to receive this award? \n\nWhy did the NAACP choose her? \n\nIt’s a mystery to me what people see in her as a leader. \n\nI am so grateful she lost.\n\nAlfred N. Bonnabel\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss confusion and turbulence amid Elon Musk-led budget cuts to federal government.","url":"https://nypost.com/2025/02/26/opinion/elon-musk-doge-cuts-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/elon-musk-holds-chainsaw-received-98884440_9e2b87-e1740601148204.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-26 21:58:34","author":"Post Readers","authors":["Post Readers"],"language":"en","source_country":"us","sentiment":-0.555},{"id":294707624,"title":"Fuming Washington Post editor blasts 'disgusting' Jeff Bezos for editorial board shake up","text":"Fuming Washington Post editor blasts 'disgusting' Jeff Bezos for editorial board shake up\n\nPODCAST: All the biggest news and insider gossip from the Trump administration – listen to Welcome to MAGAland here\n\nBy LAURA PARNABY FOR DAILYMAIL.COM\n\nPublished: 21:50 GMT, 26 February 2025 | Updated: 21:54 GMT, 26 February 2025\n\nA former Washington Post executive has blasted Jeff Bezos for 'betraying' the newspaper's principles by backing Donald Trump out of 'fear'. \n\nMarty Baron, 70, who edited the broadsheet from 2013 until 2021, said he was 'sad' and 'disgusted' to see what the billionaire has done to the opinion section. \n\nBezos, 61, said on Wednesday he would focus the section on supporting free markets and personal liberties, leaving any opposing views 'left to be published by others'. \n\nThe Amazon founder's move was met with widespread condemnation by current and former Post staffers on social media - while being praised by the White House. \n\n'It was only weeks ago that The Post described itself as providing coverage for 'all of America',' Baron wrote in an email to the Daily Beast. \n\n'Now its opinion pages will be open to only some of America, those who think exactly as he does.'\n\n'There is no doubt in my mind that he is doing this out of fear of the consequences for his other business interests, Amazon (the source of his wealth) and Blue Origin (which represents his lifelong passion for space exploration),' Baron added \n\n'He has prioritized those commercial interests over The Post, and he is betraying The Post's longstanding principles to do so.'\n\nFormer Washington Post executive editor Marty Baron (pictured) has blasted Jeff Bezos for 'betraying' the newspaper's principles by backing Donald Trump out of 'fear'\n\nBezos, 61, said on Wednesday he would focus the section on supporting free markets and personal liberties, leaving any opposing views 'left to be published by others'\n\nBaron, who is portrayed by Liev Schriber in the Oscar-winning movie Spotlight, also accused Bezos of cozying up to Donald Trump to further his business interests. \n\nBezos ended the Post's tradition of presidential endorsements ahead of the 2024 election, after the paper planned to support Kamala Harris. \n\nHe also appeared with his fiancée Lauren Sanchez at Trump's inauguration last month, and donated $1 million to the president's inaugural committee. \n\nBezos purchased The Post in 2013, but he has taken a more active role in running it over the past few months. \n\nHis plans to overhaul the opinion page sparked outrage this week. He has also axed previous opinion editor David Shipley after he declined to get on board with the new regime.\n\n'We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,' Bezos wrote on X on Wednesday.\n\n'We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.\n\n'There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views. Today, the internet does that job.'\n\nBaron, who is portrayed by Liev Schriber in the Oscar-winning movie Spotlight, also accused Bezos of cozying up to Donald Trump to further his business interests\n\nJeff Bezos has sparked outrage after announcing plans to overhaul the Washington Post's Opinion page to focus solely on support for, 'personal liberties and free markets'\n\nScores of readers have already begun angrily canceling their subscription in protest over the move.\n\nHowever the decision has been lauded by Elon Musk, who wrote 'Bravo Jeff Bezos' above a post on X about the news.\n\n'I am of America and for America, and proud to be so,' Bezos added. 'Our country did not get here by being typical.\n\n'And a big part of America's success has been freedom in the economic realm and everywhere else. Freedom is ethical — it minimizes coercion — and practical — it drives creativity, invention, and prosperity.'\n\nThe shakeup means that former editor Shipley will step down from the position he has held since 2022.\n\n'I offered David Shipley, whom I greatly admire, the opportunity to lead this new chapter. I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no.' After careful consideration, David decided to step away,' Bezos explained.\n\nHe added that he is currently searching for Shipley's replacement.\n\nThe Amazon founder, who owns the outlet, said he is ditching a traditional, 'broad-based opinion section that sought to cover all views'\n\n'This is a significant shift, it won't be easy, and it will require 100% commitment — I respect his decision,' Bezos said.\n\nThe Post's chief executive Will Lewis told staff that the changes were 'not about siding with any political party', the New York Times reports.\n\n'This is about being crystal clear about what we stand for as a newspaper,' Lewis wrote in a memo. 'Doing this is a critical part of serving as a premier news publication across America and for all Americans.'\n\nIn November, Bezos also fired the Post's long-time politics editor on the heels of Trump's election.\n\nMeanwhile, earlier this month he backed out of running a $115,000 front page advert targeting Elon Musk. \n\nAmazonJeff BezosDonald Trump\n\nShare or comment on this article:\nFuming Washington Post editor blasts 'disgusting' Jeff Bezos for editorial board shake up\n\nAdd comment","summary":"Marty Baron, 70, who edited the broadsheet from 2013 until 2021, said he was 'sad' and 'disgusted' to see what the billionaire has done to the opinion section.","url":"https://www.dailymail.co.uk/news/article-14440347/Washington-Post-editor-blasts-Jeff-Bezos-shake-up.html","image":"https://i.dailymail.co.uk/1s/2025/02/26/21/95623545-0-image-m-37_1740606065932.jpg","video":null,"publish_date":"2025-02-26 21:54:01","author":"Editor,Laura Parnaby","authors":["Editor","Laura Parnaby"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.042},{"id":294713196,"title":"Streamer Adin Ross Details Barron Trump's Involvement in Administration","text":"Adin Ross, the influential streamer and podcaster, shed light on his connection with Barron Trump and how the president's youngest son played a key role in securing his high-profile interview with the Republican candidate at a pivotal moment in the 2024 campaign.During a conversation on the latest episode of the \"Full Send Podcast\" with host Kyle Forgeard, Ross described his interactions with Barron and the influence the 18-year-old has had in bridging his father's campaign with digital media platforms and younger audiences.Why It MattersRoss' interview with Trump, streamed live on Kick last August, became one of the most widely viewed political streams ever, drawing between 400,000 and 550,000 concurrent viewers over the course of an hour.Trump's appearance with Ross was part of a broader effort to connect with young men, a key demographic that helped secure his victory over former Vice President Kamala Harris. His interview circuit during the campaign — eschewing mainstream outlets for popular podcasters like Joe Rogan and Theo Von — drew millions of views and listens, further cementing the strategy as a key component of his campaign's outreach.What to KnowWhen asked how he secured the interview with Trump, Ross recalled first meeting Barron and his father at a public event.\"Because I was with Barron and President Trump, [Barron] was like, 'Dad, this is who I've been talking about,'\" Ross said on the podcast. \"And Trump looks at me and says, 'All right, I'll do it. I'll do it.'\"At first, Ross admitted he didn't believe the opportunity was real. \"I was like, this is not going to happen. It can't be real,\" he said. But after persistent follow-ups with Trump's team, he was given a firm date.\"They were just like, 'Cool, let's make it happen,' and they made it happen.\"As the interview unfolded at Trump's Mar-a-Lago estate, Ross surprised the presidential candidate with extravagant gifts: a customized Tesla Cybertruck emblazoned with \"Make America Great Again\" across the hood and a gold Rolex watch.\"I think it's incredible,\" Trump said as he inspected the vehicle.Throughout the episode, Ross repeatedly praised Barron Trump, calling him \"a f---- stud\" and predicting that \"he's going to be a problem.\" He described Barron as \"charming, well-spoken, and smart,\" noting how influential the teenager has been in connecting Trump to younger audiences.Ross also said that Barron's involvement wasn't just surface-level; he actively pushed for Trump's digital outreach strategy. Ross highlighted how Trump trusted Barron's input.\"That's the one thing I noticed about Trump,\" Ross said. \"He really trusts certain people around him. It's cool how he trusts his son, and he's gassing him up. He knows his son's tapped in, and he just—whatever his son says, he just listens to.\"'Barron Changed Everything'Ross took personal pride in being part of Trump's effort to engage younger voters. He spoke about the behind-the-scenes negotiations that led to the interview, revealing that intermediaries initially tried to charge him large sums of money to secure Trump's appearance.\"At first, they were trying to charge me a million dollars, two million,\" Ross said. \"I'm like, come on, man.\"But Barron changed everything.\"I went through Barron with the right people, and man, they were so nice,\" Ross said. \"The Secret Service, the team, Trump's team—they're so nice. They're so good at what they do, and they helped orchestrate everything.\"Ross also credited UFC President Dana White as another key figure in helping Trump win over young men.\"Dana has been plotting on this since the last election loss,\" Ross said. \"He's been helping Trump get the youth.\"What People Are SayingAdin Ross, speaking on the FULL SEND PODCAST: \"It was definitely my dream stream to do a stream with the president. Nobody has ever done anything live with the president, I don't think. No, I don't think so. So I was the first to break the ice, and it was awesome.\"First Lady Melania Trump, speaking to Fox News in December: \"He [Barron] was very vocal, and he gave advice to his father. And it was incredible how he brought in success because he knew exactly who his father needed to contact and talk to.\"Media analyst Brad Adgate, speaking to Newsweek: \"These formats allow hours of unfiltered airtime without confrontation. The concern is that facts often get buried, and accountability disappears. But the results speak for themselves.\"What Happens NextRoss, once primarily known for his gaming streams, has now positioned himself as a key figure in the so-called \"manosphere,\" a growing online conservative movement appealing to young men who feel disillusioned with the mainstream media landscape. His relationship with Barron Trump has further solidified his influence.Barron, who does not give interviews and is rarely heard from in public, is currently attending NYU as a freshman.","summary":"The popular influencer revealed new details on his interactions with the youngest Trump son and his role in connecting his father's campaign with younger audiences.","url":"https://www.newsweek.com/adin-ross-full-send-donald-barron-trump-2036858","image":"https://d.newsweek.com/en/full/2596414/adin-ross-donald-trump-barron-trump.jpg","video":null,"publish_date":"2025-02-26 21:50:59","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.217},{"id":294712356,"title":"Billionaire Bezos announces restrictions on Washington Post opinion coverage","text":"The Washington Post will no longer run views opposed to \"personal liberties and free markets\" on its opinion pages, its owner Jeff Bezos announced on Wednesday, the latest intervention by the billionaire in the major U.S. paper's editorial operations.\n\n\"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,\" wrote Bezos on social media platform X. \"We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.\"\n\nThe move, a major break from the norm on opinion pages at the Post and at most credible news media organizations worldwide, comes as U.S. media face increasing threats to their freedom and accusations of bias from President Donald Trump.\n\nIn October, Bezos sparked controversy by blocking the Post's planned endorsement of Democratic Vice President Kamala Harris for the 2024 presidential election, triggering newsroom protests and subscriber cancellations.\n\nAnd in January, an award-winning political cartoonist for the newspaper announced her resignation after a cartoon depicting Bezos groveling before Trump was rejected.\n\nAt the time, editorial page editor David Shipley defended the decision, saying it was made to avoid repeated coverage on the same topic.\n\nOn Wednesday, Bezos announced Shipley would be leaving his post because he had not signed on to the new opinion pages policy.\n\n\"I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no,'\" said Bezos.\n\nOther Post staffers also expressed their concern.\n\n\"Massive encroachment by Jeff Bezos into The Washington Post's opinion section today -- makes clear dissenting views will not be published or tolerated there,\" said Jeff Stein, the paper's chief economics correspondent, on X.\n\nStein added that he had \"not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the news side I will be quitting immediately.\"\n\nAmazon owner and world's third-richest man Bezos, along with other U.S. tech moguls, have appeared increasingly close to Trump since his election last year.\n\nBezos was among a group of tech billionaires who were given prime positions at Trump's inauguration, and he visited the Republican at his Mar-a-Lago estate during the transition period.\n\nIn his post on Wednesday, Bezos said the Post did not have to provide opposing views because \"the internet does that job.\"","summary":"The Washington Post will no longer run views opposed to &quot;personal liberties and free markets&quot; on its opinion pages, its owner Jeff Bezos announced on Wednesday, the latest…","url":"https://japantoday.com/category/world/billionaire-bezos-announces-restrictions-on-washington-post-opinion-coverage","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/fd/c8/1825101c2f809ff458aefbfb583f1d88fbed/fdc81825101c2f809ff458aefbfb583f1d88fbed/_w1700.jpg","video":null,"publish_date":"2025-02-26 21:44:37","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.063},{"id":294702650,"title":"Arizona governor partners with Trump administration to combat cartels","text":"On Tuesday, the governor signed an executive order to create a task force gathering multiple state agencies, including the Department of Emergency and Military Affairs, the Department of Public Safety, and the Department of Homeland Security. They will work on combating transnational criminal organizations on the southern border.\n\nOperation Desert Guardian, as Hobbs titled it, will partner local law enforcement with the federal government to combat crimes committed by criminal organizations, identifying vulnerabilities in the border in Yuma, Pima, Santa Cruz, and Cochise counties, the state’s four counties along the Mexican border.\n\n“I’m proud to launch Operation Desert Guardian to combat the cartels, stop drug smuggling and human trafficking, and secure Arizona’s border,” Hobbs said in a statement. “My administration has been in contact with the federal government and local sheriffs about the Operation, its critical objectives, and our shared commitment to keeping criminals and drugs out of Arizona’s communities.”\n\n“I have worked productively with the federal government on Task Force SAFE and partnered with local law enforcement to deliver critical border security support, and I look forward to continued partnership on our shared border security priorities,” she added. “With Operation Desert Guardian, I’m confident we can take an important next step in our ongoing work to secure the border.”\n\nThe decision by Hobbs, a Democrat, to work with the Trump administration on border security continues the trend of Democratic state administrations cooperating more than they did during Trump’s first term in the White House.\n\nThe Arizona governor previously expressed a willingness to work with the Trump administration, saying shortly after last year’s election that she was looking “forward to having conversations with the incoming president about Arizona’s needs, including border security.” She did note that she would “not tolerate actions that harm Arizonans, that harm our communities and, quite honestly, divert resources from providing real security at our border.”\n\nHOBBS IS FIRST DEMOCRAT IN 20 YEARS TO APPOINT JUSTICE TO ARIZONA SUPREME COURT\n\nHobbs faces a tough reelection race next year in a state that voted for Trump over former Vice President Kamala Harris by 5.5% last November.\n\nThe race for governor in the Grand Canyon State in 2026 has been rated as a “toss up” by the Cook Political Report.","summary":"Gov. Katie Hobbs (D-AZ) announced a new border security initiative in the Grand Canyon State that includes a new partnership with federal authorities. On Tuesday, the governor signed an executive order to create a task force gathering multiple state agencies, including the Department of Emergency and Military Affairs, the Department of Public Safety, and the [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3331235/arizona-governor-partners-trump-administration-border-security-cartels/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/arizona-governor-border-action.webp","video":null,"publish_date":"2025-02-26 21:32:26","author":"Jack Birle","authors":["Jack Birle"],"language":"en","category":"politics","source_country":"US","sentiment":0.123},{"id":294715032,"title":"Any MP caught engaging in illegal mining will face full rigours of the law – Bagbin","text":"Entertainment\n\nForeign News\n\nEbo Safo TV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWednesday, February 26, 2025\n\n\n\n\n\n\nGhana Latest News\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\nForeign News\n\nEbo Safo TV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHomeBusinessAny MP caught engaging in illegal mining will face full rigours of...\n\n\n\nAny MP caught engaging in illegal mining will face full rigours of the law – Bagbin\n\n\n\nBy Ghana News\n -February 26, 2025\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Any MP caught engaging in illegal mining will face full rigours of the law – Bagbin – Ghana Business News\n\n\n\n\n\n\n\n\n\n\n\nAny MP caught engaging in illegal mining will face full rigours of the law – Bagbin\n\n\n\n\n\n\n\n\n\n\n\n\n\nSource link \n\n\n\n\n\n\n\n\n\nPrevious articleNo one is supposed to greet Akufo-Addo when they meet him in town – Bullgod\n\nNext articleGPHA Investigates Missing Trailers and Alleged Irregular Auction of Reachstacker\nGhana News \n\nRELATED ARTICLESMORE FROM AUTHOR\n\n\n\n\n\n\n\n\n\n\n\nBiblical business wisdom for economic transformation\n\n\n\n\n\n\n\n\n\n\n\nPrivatisation of ECG’s metering and billing systems will improve efficiency – Deputy Energy Minister-designate \n\n\n\n\n\n\n\n\n\n\n\nReforms, stability tops BoG Governor agenda\n\n\n\n\n\n\n\n19,579FansLike\n\n1,785FollowersFollow\n\n0SubscribersSubscribe\n\n- Advertisement -\n\nMOST READ NEWS\n\n\n\n\n\n\n\nGoogle Faces $7 Billion US Patent Infringement Trial Over AI Technology\n\nGhana News - January 9, 2024\n\n\n\n\n\n\n\nKudjoe Fianoo open to joining Asante Kotoko as CEO\n\nGhana News - July 9, 2023\n\n\n\n\n\n\n\nUS will increase investments in Africa to propel growth – Kamala Harris – Citi...\n\nGhana News - March 26, 2023\n\n\n\n\n\n\n\nAssemblies of God Ministers’ Wives Donate to Female Inmates at Nsawam Prison\n\nGhana News - December 3, 2023\n\n\n\n\n\n\n\nEntertainment\n\nRema and Tems Enjoy Special Moments Together in Ghana | WATCH\n\n\nGhana News - January 11, 20230\n\n\nGhana has been chosen the official vacation destination for all travelers in December. Since 2019, many famous people have flown to Ghana with...\n\n\n\n\n\n\n\n\n\nObrafour sues Grammy award-winner Drake; demands $10m over alleged copyright infringement\n\nApril 19, 2023\n\n\n\n\n\n\n\n\n\nStonebwoy holds star-studded party for ‘5th Dimension’ mega album [Video]\n\nApril 30, 2023\n\n\n\n\n\n\n\n\n\nI left my 5th boyfriend because of Burna Boy – Zimbabwean...\n\nMay 14, 2023\n\n\n\n\n\n\n\n\n\nEarl International Group build ultra modern school complex for the Gbane...\n\nJune 3, 2023\n\n\n\n\n\n\n\n\n\nGPHA Investigates Missing Trailers and Alleged Irregular Auction of Reachstacker\n\n\nGhana News - February 26, 20250\n\n\n\n\n\n\n\n\n\n\n\nVetting of Deputy Minister Nominees: Minority stage walk-out amid heated exchange...\n\nFebruary 26, 2025\n\n\n\n\n\n\n\n\n\nGhana Takes Action Against Devastating Impact of Small-Scale Mining\n\nFebruary 26, 2025\n\n\n\n\n\n\n\n\n\nWAFCON 2026Q: Black Queens to face Egypt in a two-legged clash...\n\nFebruary 26, 2025\n\n\n\n\n\n\n\n\n\nKOFIH Inaugurates GHC 950,000 Maternity Unit at Alavanyo Wudidi Health Centre...\n\nFebruary 26, 2025\n\n\n\n\n\n\n\n\n\n\n\n\n\nGhananewss is your news, entertainment, music, fashion and sports website. We provide you with the latest breaking news and videos straight from Ghana, Africa and beyond.\nContact us: Info@ghananewss.com\n\n\n\n\nEVEN MORE NEWS\n\n\n\n\n\n\n\n\n\nDoes the Couple Have Children? – Hollywood Life\n\nFebruary 26, 2025\n\n\n\n\n\n\n\n\n\nKOD And Abeiku Santana Get Juicy Offer From President John Dramani...\n\nFebruary 26, 2025\n\n\n\n\n\n\n\n\n\nGPHA Investigates Missing Trailers and Alleged Irregular Auction of Reachstacker\n\nFebruary 26, 2025\n\n\n\n\n\nPOPULAR CATEGORY\n\nEntertainment13777\nForeign News9096\n\nBusiness4205 \n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\n\n\n\n\n© 2025 GHANA NEWS. ALL RIGHTS RESERVED.","summary":"&#13; &#13; &#13; &#13; &#13; &#13; &#13; Any MP caught engaging in illegal mining will face full rigours of the law &#8211; Bagbin &#8211; Ghana Business News &#13; &#13; &#13; &#13; &#13; Home Lead Story Any MP caught engaging in illegal mining will face full rigours of the law – Bagbin &#13; &#13; &#13; &#13; [&#8230;]\n\n\nThe post Any MP caught engaging in illegal mining will face full rigours of the law &#8211; Bagbin appeared first on Ghana Latest News.","url":"https://ghananewss.com/any-mp-caught-engaging-in-illegal-mining-will-face-full-rigours-of-the-law-bagbin/","image":"https://www.ghanabusinessnews.com/wp-content/uploads/2024/12/Politics-Speaker-Swearing-in.jpg","video":null,"publish_date":"2025-02-26 21:12:29","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":0.378},{"id":294699924,"title":"Bezos Shakes Up Washington Post Opinion Pages","text":"Washington Post owner Jeff Bezos on Wednesday shared on X a memo he had sent that declared a broad reshaping of the Post’s liberal opinion pages. \n\nThe memo announced that starting soon, the paper would be publishing opinions in “support and defense of two pillars: personal liberties and free markets.” Bezos said opinions on other topics would be run, but “viewpoints opposing those pillars will be left to be published by others.”\n\nThe move comes as other media companies announce changes to their coverage and/or staffing. MSNBC in the past few days announced cancellations of shows hosted by Joy Reid, Alex Wagner, and Jonathan Capehart. Jim Acosta, a longtime CNN host and former chief White House correspondent, announced last month that he would be leaving the network. \n\nBezos bought the Post for $250 million in 2013. In late October, he preempted the Post editorial page’s endorsement of Vice President Kamala Harris‘ presidential bid in a move widely seen as hedging bets against a second Donald Trump presidency. The move led three of the Post’s 10 editorial board members to resign. Additionally, 21 opinion columnists signed onto a statement calling Bezos’ decision a mistake.\n\nThe decision also led to 250,000 subscribers canceling their subscriptions after the endorsement announcement. That contributed to the paper losing $100 million in 2024. Much of that financial loss comes from plummeting ad and subscription revenue. In 2021, the newspaper’s website drew 22.5 million daily visitors as compared with the approximately 3 million daily visitors during the summer of 2024. Fortunately for the Post, Bezos, who founded Amazon, is a centibillionaire and can afford to subsidize the loss.\n\nThe tech titan justified his new approach to the Post’s editorial content by pointing to the modern media ecosystem that exists with the internet.\n\n“There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader’s doorstep every morning a broad-based opinion section that sought to cover all views. Today, the internet does that job,” he opined.\n\nThe change resulted in the Post’s opinion editor David Shipley resigning from his position, which Bezos characterized as an amicable breakup. \n\n“I offered David Shipley, whom I greatly admire, the opportunity to lead this new chapter. I suggested to him that if the answer wasn’t ‘hell, yes,’ then it had to be ‘no.’ After careful consideration, David decided to step away,” Bezos wrote.\n\nThe mogul announced that he would be looking for a new opinion editor. Bezos ended his note with optimism about the potential for the change.\n\n“I’m confident that free markets and personal liberties are right for America. I also believe these viewpoints are underserved in the current market of ideas and news opinion. I’m excited for us together to fill that void,” he wrote.\n\nBezos’ move is being seen by some as yet another example of what’s perceived as a rightward shift in the country. The change arguably started when Elon Musk bought Twitter and released “The Twitter Files,” exposing how the social media platform under its prior owner censored Americans. \n\nTrump’s victory in November appears to have cemented the vibe shift. Amazon announced that it would be lifting a ban on Ethics and Public Policy Center President Ryan Anderson’s bestselling book “When Harry Became Sally” critical of transgenderism. Bezos was also not the only tech titan in attendance at Trump’s swearing-in on Jan. 20, which also featured executives of Tesla, Meta (Facebook), Alphabet (Google), TikTok, and Apple. Furthermore, Musk now serves as a senior adviser to the president and head of his Department of Government Efficiency.\n\nBezos took a patriotic tone in the Wednesday memo, writing, “I am of America and for America, and proud to be so. Our country did not get here by being typical. And a big part of America’s success has been freedom in the economic realm and everywhere else.”\n\nBezos’ appreciation for the success of the United States comes as a new poll shows, for the first time in more than 20 years, that a plurality of Americans thinks the country is on the right track.","summary":"Washington Post owner Jeff Bezos on Wednesday shared on X a memo he had sent that declared a broad reshaping of the Post’s liberal opinion... Read More\n\n\nThe post Bezos Shakes Up Washington Post Opinion Pages appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/26/bezos-shakes-up-washington-post-opinion-pages/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/Jeff-Bezos-2.0-1024x532.png","video":null,"publish_date":"2025-02-26 21:00:05","author":"Jacob Adams,Joy Reid","authors":["Jacob Adams","Joy Reid"],"language":"en","category":"politics","source_country":"us","sentiment":0.176},{"id":294702652,"title":"The Resistance 2.0 power rankings","text":"To be sure, there was no shortage of signs that the Democratic Party’s coalition was fraying in the Biden era. The party’s activist base split with Democratic leadership on a number of fronts: over arms deals with Israel, the merit of law enforcement and borders, and the depth of commitment to gender ideology and the Green New Deal. \n\nBefore President Donald Trump’s decisive victory in November, only a shared hatred for him and love for abortion seemed to unite them. \n\nBut Trump’s win shredded the glue that kept the party together, delegitimizing establishment leadership in the process. The various “houses” that have controlled the Democratic Party this century have all fallen to Trump’s sword. Team Obama failed to deliver the White House after commandeering the Kamala Harris campaign. The Clinton faction has moved into the private sector or aged out, with James Carville the lone surviving figure of political relevance. The Biden team, cast aside in humiliating fashion last summer, never had a tight grip on the party to begin with.\n\nThese power rankings hope to accurately capture the state of the race to lead the Resistance 2.0. Here is the board as it stands today:\n\n10: Boss Hogg\n\nDavid Hogg, the newly elected vice chair of the Democratic National Committee, has come a long way since first gaining notoriety as a student activist following the 2018 school shooting in Parkland, Florida. Busting into the inner sanctum of Democratic politics less than two years removed from college is no small feat, though it isn’t clear if his rise has more to do with the party’s disarray than his political talent. \n\nHe’d be higher if not for recent headlines, including reports that he’s been using the DNC’s phone list to solicit donations for his personal political action committee. But if you ask me, that just proves he knows how to play politics like a true donkey. \n\n9: Chuckles \n\nThis might be low for a highly visible Senate minority leader, but Chuck Schumer’s glow has never been duller. In the span of a month, he’s been clowned by Jon Stewart and mocked by former Rep. Tim Ryan (D-OH) as “depressing” for chanting “we will win” with other senior citizens outside of the Treasury. He’s also under investigation for blatantly threatening Supreme Court Justices at an abortion rights rally — and indictment isn’t unrealistic.\n\nSchumer only makes the rankings at all because of his considerable institutional power. But you have to think Schumer’s twilight is looming. \n\n8: The Nutty Professor\n\nSen. Elizabeth Warren (D-MA) is sizzling mad and wants you to know it. She’s mad about DOGE dicing up her beloved Consumer Financial Protection Bureau, about Robert F. Kennedy Jr.’s ability to sue drug companies, and Pete Hegseth prioritizing lethality over social justice in the armed forces. She’s piping hot about the Disney-Fubo deal.\n\nIn February, Warren stuck her angry mug in front of every camera she could find. Trump and Department of Government Efficiency chief Elon Musk pop champagne each time. \n\n7: Stephen A. Smith\n\nSmith, the frenzied sports commentator teasing a celebrity White House run, gets no nickname because he at least appears serious. So far, he’s running the Trump 2016 playbook by leveling tough truths at his party, particularly on the transgender issue, and wielding the sort of unfiltered authenticity that voters currently crave. \n\nLast week, Carville, the ultimate party insider, warned Smith to “stick to sports.” Not long ago, Republican insiders told Trump to stick to reality TV. \n\nSmith is already polling above household Democratic names such as Sen. Corey Booker (D-NJ) and Michigan Gov. Gretchen Whitmer. \n\n6: Princess Jasmine\n\nIn February, Rep. Jasmine Crockett (D-TX) said she’s rooting for Canada and Mexico against the U.S., banning men from competing in women’s sports “doesn’t protect women,” and that Republicans are “less educated folks.” On Tuesday, when asked outside the Capitol what she’d say to Elon Musk if they spoke directly, she brushed her hair from her eyes and said, “F*** off.”\n\nIn other words, Crockett has catapulted herself into the race to become the face of the party. Her penchant for virality has her arrow pointing up.\n\n5: Pothole Pete\n\nFormer Secretary of Transportation Pete Buttigieg is the Democrats’ communicator par excellence. His preternatural calm and ability to make terrible ideas sound reasonable make him a valuable asset in these dark times. The gay and married war veteran was built in a Democratic candidate lab and fine-tuned at McKinsey and Co.\n\nSo why hasn’t Buttigieg taken the reins? Two reasons: 1. His record in government is abysmal, both as a mayor and a Transportation Secretary. 2. He’s a non-human cyborg. \n\nAppearing at a forum at the University of Chicago this week, Buttigieg slammed the Democrats’ approach to DEI for “making people sit through a training that looks like something out of ‘Portlandia.’” \n\nIt’s a perfectly reasonable take, of course, and it’s obviously good politics in this climate. The problem is that he’s been one of DEI’s biggest supporters. He frequently touted his commitment to “equity” during his run at Transportation and famously decried the “racism” built into our highway system. \n\nThe sudden shift elicited ire from the Left and groaning from the Right. The episode distilled Buttigieg’s struggle to grab the Democratic mantle despite looking and sounding the part. \n\nBillionaire Mark Cuban is one of only a handful of high-profile liberals outside the party establishment who commands headlines and a massive audience at will. And despite recently morphing into Rachel Maddow, he’s emerged as a fierce party critic in recent weeks, sharing the same lane as Smith but with billions to back it up. \n\nAppearing at the Principles First Summit in Washington, D.C. last week, Cuban said 2024 taught him that “Democrats can’t sell worth s***” and blasted their “democracy is on the ballot” pitch. “Voters didn’t give a f*** about J6 or abortion,” he added.\n\nThis immediately set the establishment press abuzz with 2028 speculation: Was Cuban implying that he was the party’s best pitchman? \n\n“Hell no. It’s not going to happen,” Politico reported him saying.\n\nBut if he changed his mind, he’d shoot to the top in a hurry. \n\n3: Bern, baby, Bern!\n\nSen. Bernie Sanders (D-VT) hasn’t aged a day since his runs for president in 2016 and 2020, has he? I mean, he looked old back then, too. But he hasn’t lost much on his fastball. \n\nSanders has been liberated following the establishment’s implosion. “It should come as no surprise that a Democratic Party which has abandoned working-class people would find that the working class has abandoned them,” he stated the day after Kamala Harris’s defeat. And he has every right to gloat: He read the Trump-era electorate accurately and saw this coming. They didn’t. \n\nIn late February, Sanders hit the road with his “Fighting Oligarchy” tour in Omaha, where he railed against wealth inequality and framed the current political struggle as between working families and billionaires like Elon Musk. It isn’t a fresh take, but it has a better shot at meeting the needs than anything else Democrats are currently doing. \n\nAnd while Sanders is likely too old to lead the party, the fierce loyalty he still commands could make him the party’s most sought-after kingmaker. \n\n2. The Salad Spinner\n\nDid you know that Kamala is still out there talking about… something? About once a week, a video emerges of Harris attempting to connect a dot to a small crowd of loyalists who painfully nod along, hoping, waiting, please God, just make her stop.\n\nHere’s what she said a couple of weeks ago backstage at a Broadway show: “Look at what I mean this beautiful play and everything we know at the end… we have to be cleared-eyed. We’re seeing a U-turn right now. For those rights to be maintained which means we have to be vigilant. It’s just the nature of it. We have to be clear-eyed. And it doesn’t mean we don’t see the beauty in everything. These things all co-exist, but I believe we fight for something, not against.”\n\nEven her scripted remarks at the 2025 NAACP Image Awards last week were barely decipherable. \n\nAnd yet – and yet! – the early 2028 Democratic primary polls have her obliterating the field at this point. \n\nThat alone is enough to put her at or near the top of these rankings — for now. But in truth, it’s impossible to predict her political future. So many divergent paths feel plausible, from making a strong push to recapture the Democratic nomination to accepting the presidency of a small liberal arts college. But as long as her polling remains high, she is. \n\n1: The Bronx Bomber\n\nRep. Alexandria Ocasio-Cortez (D-NY) plays across Democratic factions — the activists, the suburban lib-moms, the late-night talkers, and the rising podcasters — better than any other figure. Her combination of youth (already a political veteran, she’s only 35), magnetism, and political savvy has enabled her to maintain her broad appeal among Democrats despite near constant derision from the Right over the past six years.\n\nThe Republican obsession with her boosts her already unmatched visibility in the same way the Democratic obsession with Trump keeps him perpetually in the headlines. And in this political environment, visibility is power. She knows that, and she knows how to wield it. \n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nIn February, two of the rising Left’s media gatekeepers, Mehdi Hasan and MSNBC’s Jen Psaki, all but crowned her as the party’s leader, the former praising her confrontation with Tom Homan, the latter scolding party elders for passing over the “young, fearless, connected” AOC to lead the House Oversight Committee. \n\nBut the slight only further cemented her status as the face of the next generation of Democrats.","summary":"The sudden power vacuum at the top of the Democratic Party has created a fresh competition to steer the Democratic ship through the political wilderness. A melange of contenders has emerged from across the Democratic sweep: Squad sisters, media mouths, graying senators, and motley liberal luminaries vie for the influence and notoriety that come with [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/beltway-confidential/3331185/the-resistance-2-0-power-rankings/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/alexandria-ocasio-cortez-AOC-yyi84.webp","video":null,"publish_date":"2025-02-26 20:55:53","author":"Peter Laffin","authors":["Peter Laffin"],"language":"en","source_country":"US","sentiment":-0.023},{"id":294683898,"title":"Jeff Bezos is muzzling the Washington Post’s opinion section. That’s a death knell | Margaret Sullivan","text":"Owners and publishers of news organizations often exert their will on opinion sections. It would be naive to think otherwise.\n\nBut a draconian announcement this week by Jeff Bezos, the Washington Post owner, goes far beyond the norm.\n\nThe billionaire declared that only opinions that support “personal liberties” and “free markets” will be welcome in the opinion pages of the Post.\n\n“Viewpoints opposing those pillars will be left to be published by others,” he added.\n\nThe paper’s top opinion editor, David Shipley, couldn’t get on board with those restrictions. He immediately – and appropriately – resigned.\n\nEspecially in the light of the billionaire’s other blatant efforts to cozy up to Donald Trump, Bezos’s move is more than a gut punch; it’s more like a death knell for the once-great news organization he bought in 2013.\n\nIt’s unclear what will happen to such excellent left-of-center columnists as Catherine Rampell, Eugene Robinson and EJ Dionne. And it’s unclear to what extent this ruling eventually will affect the paper’s hard-news coverage, which so far has been unbowed in covering the chaotic rollout of the new Trump administration.\n\nWhat is clear is that Bezos no longer wants to own an independent news organization. He wants a megaphone and a political tool that will benefit his own commercial interests.\n\nIt’s appalling. And, if you care about the role of the press in America’s democracy, it’s tragic.\n\n“What Bezos is doing today runs counter to what he said, and actually practiced, during my tenure at the Post,” Martin Baron, the paper’s executive editor until 2021 and the author of the 2023 memoir Collision of Power: Trump, Bezos and the Washington Post, told me in an email Wednesday.\n\n“I have always been grateful for how he stood up for the Post and an independent press against Trump’s constant threats to his business interest,” Baron said. “Now, I couldn’t be more sad and disgusted.”\n\nBezos is sacrificing the Post’s reputation and any hope for its financial stability on the altar of personal gain. Recall that the company lost some 300,000 subscribers a couple of months ago after Bezos forbid the publication, just before the presidential election, from publishing a planned editorial endorsing Trump’s Democratic rival, Kamala Harris.\n\nMore recently, the Post refused to publish Ann Telnaes’s cartoon that showed American oligarchs, including Bezos, bowing to Trump; in protest, she resigned from the Post, where she had worked since 2008.\n\nThis latest move certainly will mean more Post subscribers will flee, partly in protest and partly because the paper – at least on its opinion side – no longer does the job.\n\nHaving worked at the Post myself as its media columnist for six years, until 2022, I know the paper’s readership well.\n\nPost subscribers are well-informed, smart and savvy; they know and appreciate the paper’s history, including the way it bravely stood up to presidential power during the Pentagon Papers and Watergate eras when the Graham family were the owners.\n\nThese readers span the traditional political spectrum from liberal to old-school conservative. And they understand the sometimes adversarial relationship between government and the press.\n\nThis outrageous move will enrage them. I foresee a mass subscriber defection from an outlet already deep in red ink; that must be something businessman Bezos is willing to live with.\n\nHe must also be willing to live with hypocrisy.\n\n“Bezos argues for personal liberties. But his news organization now will forbid views other than his own in its opinion section,” Baron pointed out, recalling that it was only weeks ago when the Post described itself in an internal mission statement as intended for “all of America”.\n\n“Now,” Baron noted, “its opinion pages will be open to only some of America, those who think exactly as he does.”\n\nIt’s all about getting on board with Trump, to whose inauguration Bezos – through Amazon, the company he co-founded – contributed a million dollars. That allowed him a prime seat, along with others of his oligarchical ilk.\n\n“There is no doubt in my mind that he is doing this out of fear of the consequences for his other business interests, Amazon [the source of his wealth] and Blue Origin, [which represents his lifelong passion for space exploration],” Baron said. Now, Baron added, he is prioritizing those interests and, in so doing, “betraying the Post’s long-standing principles to do so”.\n\nAs a Post loyalist myself – drawn into my career by the courageous journalism I admired as a teenager in the 1970s, thrilled to join its ranks in 2016 – I’m crushed to see its precipitous decline.\n\nBezos set out to save the Washington Post from financial ruin when he bought it, and, for a time, he did that and more.\n\nBut the best thing he could do now would be to sell it to someone who understands the stewardship of a national treasure.\n\n Margaret Sullivan is a Guardian US columnist writing on media, politics and culture","summary":"‘I couldn’t be more sad and disgusted,’ says former top editor Martin Baron\n\nOwners and publishers of news organizations often exert their will on opinion sections. It would be naive to think otherwise.\n\nBut a draconian announcement this week by Jeff Bezos, the Washington Post owner, goes far beyond the norm.\n\nMargaret Sullivan is a Guardian US columnist writing on media, politics and culture\n\n Continue reading...","url":"https://www.theguardian.com/commentisfree/2025/feb/26/jeff-bezos-washington-post-opinion","image":"https://i.guim.co.uk/img/media/2d8f0e68ddadafcbc36439f3bbab21b06abe734e/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3B","video":null,"publish_date":"2025-02-26 20:10:38","author":"Margaret Sullivan","authors":["Margaret Sullivan"],"language":"en","category":"politics","source_country":"us","sentiment":0.049},{"id":294684354,"title":"Jeff Bezos' revamp of 'Washington Post' opinions leads editor to quit","text":"The Washington Post's billionaire owner, Jeff Bezos, announced a sweeping new libertarian vision for the paper's opinion sections on Wednesday, just four months after his decision to kill a presidential endorsement of Kamala Harris triggered hundreds of thousands of subscribers to cancel.\n\nPost Opinions Editor David Shipley, whom Bezos recruited from Bloomberg Opinions in 2022, chose to resign rather than stay to oversee the paper's revamped sections.\n\n\"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,\" Bezos wrote in a memo to staffers announcing the changes. \"We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.\"\n\nNewspaper op-ed sections have incorporated opposing views for years. The term \"op-ed\" is literally an abbreviation for pieces running \"opposite the editorial pages\" that often conflicted with a publisher's editorial line. But Bezos characterized that practice as outdated.\n\n\"There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views,\" Bezos said. \"Today, the internet does that job.\"\n\nShock inside the newsroom\n\nAt an hour-long meeting with opinion writers, Shipley said he did not know what lay ahead, according to an attendee who spoke on condition of anonymity because they did not have permission to speak publicly.\n\nShipley said he had wanted a \"broader, pluralistic place,\" but that Bezos sought \"a focused [opinion] report.\"\n\nBezos justified his decision in the memo to staffers. \"I am of America and for America, and proud to be so,\" he wrote. \"And a big part of America's success has been freedom in the economic realm and everywhere else.\"\n\nThe decision sparked fresh shock and dismay at the paper. After senior news editors raised concerns at a meeting Wednesday, Executive Editor Matt Murray reassured them that Bezos had given no indication that he wanted to interfere with news coverage, according to two people with direct knowledge. A spokesperson for the Post confirmed his remarks.\n\nLater in the day, Murray sent a memo to the newsroom to underscore the point: \"The independent and unbiased work of The Post's newsroom remains unchanged, and we will continue to pursue engaging impactful journalism without fear or favor.\" (Murray and Bezos did not reply to requests for comment.)\n\nPost Associate Editor David Maraniss, a legendary journalist whose association with the newspaper stretches back more than four decades, wrote on Bluesky that he would never write for it again as long as Bezos owns it.\n\n\"One pernicious step after another, Bezos encroached on the Post editorial policy,\" Maraniss wrote. \"Today he seized it fully. The old Washington Post is gone.\"\n\nOne writer for the opinions section told NPR he was \"heartsick,\" adding, \"leadership matters.\"\n\nNPR spoke to six people with direct knowledge of events for this article. They were given the ability to speak anonymously because they were not authorized to speak about internal matters at the paper.\n\nShipley did not respond to requests for comment. According to a person with direct knowledge, Shipley told Bezos that the new approach would violate the Post's promise of holding power to account.\n\nBezos new approach differs dramatically from first Trump term\n\nBezos stood by the newspaper's dogged reporting on the first Trump administration. In that period, the Post adopted the motto \"Democracy Dies in Darkness.\" It won Pulitzer Prizes for coverage of the Jan. 6 attack on the U.S. Capitol and, earlier, of Russian interference in the 2016 presidential election.\n\nMore recently, Bezos' decision in October to kill the Harris editorial sparked a furor inside and outside the paper, leading editorial writers to resign and more than 300,000 people to cancel their digital subscriptions in a matter of days. (The Post says it has been able to win some subscribers back and garner some new subscribers in the opening weeks of Trump's second term.)\n\nAs a practical matter, Shipley argued to Bezos, the Wall Street Journal's highly pro-markets pages have had a similar policy for decades. As with the decision not to publish the endorsement of Harris, Shipley's arguments fell on deaf ears.\n\nIn his memo to staff, Bezos praised Shipley and wrote that he offered the editor the chance to lead the reformed sections. \"I suggested to him if the answer wasn't 'hell yes,' then it had to be 'no,'\" Bezos wrote.\n\nThe Post has aggressively covered the new administration. But Bezos appears to have embraced the president's return to power. Bezos personally paid $1 million toward Trump's inaugural fund. He and his fiancée Lauren Sánchez traveled to Trump's Florida estate, Mar-a-Lago, to socialize with the Trumps. And, along with other digital chieftains, Bezos sat behind the president as he was sworn in for a second term.\n\nOpinions editor repeatedly in tough spot\n\nShipley's two-and-a-half years have brought acclaim for the section, with two Pulitzer Prizes and two Loeb Awards. But his standing was deeply undercut by Bezos's recent decisions, especially over the Harris endorsement.\n\nWhen Shipley decided to withhold a cartoon from the Pulitzer-winning staffer Ann Telnaes about Bezos from publication, he told colleagues he believed he was making a decision on the merits, not pulling his punches. The cartoon depicted Bezos abasing himself along with other tech titans before Trump.\n\n\"Not every editorial judgment is a reflection of a malign force,\" Shipley said in a statement shared at the time with NPR. \"My decision was guided by the fact that we had just published a column on the same topic as the cartoon and had already scheduled another column — this one a satire — for publication. The only bias was against repetition.\"\n\nShipley told colleagues privately that he understood, given the moment, it might be hard to credit his actual motivations.\n\nThe paper has bled veteran talent from both the opinion and news sides since the news broke about the killed editorial. Post journalists left for the Atlantic, the New York Times, the Wall Street Journal, and CNN among other outlets.\n\nBut Post Publisher and Chief Executive Will Lewis celebrated the change in direction on Wednesday. Lewis previously served for six years in the same role at the Journal, which is owned by Trump ally and conservative media magnate Rupert Murdoch. He has advocated for a similar approach at the Post. \n\nBezos hired Lewis, in significant part, due to his belief the British journalist could build better bridges to Trump and to conservatives. As well as serving Murdoch as an executive for a decade, Lewis was previously editor of the conservative Telegraph in the U.K. and later served as a consultant for Tory Prime Minister Boris Johnson. \n\n\"I am very excited about this new clarity and transparency, and cannot wait to see it brought to life in our opinion section. Every Day,\" Lewis said in a note to staff. \"This is not about siding with any political party. This is about being crystal clear about what we stand for as a newspaper. Doing this is a critical part of serving as a premier news publication across America and for all Americans.\"","summary":"Billionaire Jeff Bezos, who owns the Post, says the newspaper's editorial section will publish columns only \"in support and defense of two pillars: personal liberties and free markets.\"","url":"https://www.npr.org/2025/02/26/nx-s1-5309725/jeff-bezos-washington-post-opinion-section","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5965x3355+0+257/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F14%2Ff3%2Fc083c8ac4248ba39f24e335ce4a9%2Fgettyimages-2194958315.jpg","video":null,"publish_date":"2025-02-26 20:06:01","author":"David Folkenflik","authors":["David Folkenflik"],"language":"en","category":"politics","source_country":"us","sentiment":0.028},{"id":294685608,"title":"Writing the History of the Biden Presidency, in the Trump Era","text":"Joe Biden left office with abysmal approval ratings -- and faith that history would redeem him.\n\n\"It will take time to feel the full impact of all we've done together,\" he said in a farewell speech. \"But the seeds are planted, and they'll grow and they'll bloom for decades to come.\"\n\nIn the meantime, there is the opinion of history professors -- 17 of whom gathered last weekend at Princeton University to produce not a vindication, but something different: a first-cut scholarly evaluation of the Biden presidency.\n\nBefore the two-day gathering, the group had submitted essays on topics including immigration, foreign policy, the economy, media, political polarization and LGBTQ+ rights. After revisions and editing, they will be published by Princeton University Press in about a year under the title \"The Presidency of Joseph R. Biden: A First Historical Assessment.\"\n\nThe group may have been looking backward, with a perspective often deep in the policy weeds. But there were plenty of nods at the chaotic first few weeks since the return of his bitter political antagonist, whose name seemed to come up almost as much as Biden's.\n\n\"Donald Trump is the most consequential political figure of the 21st century, in the whole world,\" said Michael Kazin, a professor at Georgetown University, who contributed an essay about the Biden administration and labor. \"That's both shocking, and something we've all gotten used to. In some ways, you could say Biden is a figure in the Trump era.\"\n\nThe months since the election have brought bitter debate in Democratic circles about the failed Biden (then Kamala Harris) campaign. Julian Zelizer, a professor at Princeton and the event's organizer, said the goal of the project was to rise above both Monday morning quarterbacking and old assumptions -- including the idea that a two-term presidency is the norm.\n\nThe strength of Trumpism, he said, \"changes the way we evaluate how Biden did what he did, and forces us to think about how to even measure political success and failures.\"\n\nThe two-day discussion brought broad questions: How much do intentions, versus concrete, durable achievements, matter? How much do you view a policy record through the backlash it generated?\n\n(BEGIN OPTIONAL TRIM.)\n\nAlso, amid shocking events like the Jan. 6, 2021, riot and Biden's eleventh-hour withdrawal from the race, how do you keep your partisan emotions out of it?\n\n\"Not surprisingly,\" Kazin said wryly, \"people mix their opinion of what they think should have happened with what really did happen.\"\n\nIn November 2016, a group met to prepare a similar volume on the Obama presidency (following one dedicated to George W. Bush). That meeting took place a few days after Election Day, which had left the liberal-leaning group in a state of shock at Trump's victory, and some members wondering if they needed to revise their analysis of the previous eight years.\n\nA gathering in March 2021 to evaluate the Trump presidency took place on Zoom, because of the pandemic, and included lots of questions about whether the Trump years were an aberration, or the beginning of a durable realignment.\n\nTrump, it turned out, had opinions on the matter. After an article about the gathering appeared in this newspaper, an aide contacted Zelizer, saying the former president wanted to tell his side of the story.\n\nThe group met for an hour by videoconference with Trump that July (by coincidence, the day after a C-SPAN poll of historians deemed him the fourth-worst president in history). He ran through a list of \"tremendous\" successes on the economy, foreign policy and other areas, and was very much \"in character,\" Zelizer said, down to his prediction that the book would be \"a No. 1 bestseller.\" (It was not.)\n\n\"I had the impression he was speaking in a way he thought historians would want to hear,\" Zelizer said. \"But the substance was very much the same.\"\n\n(END OPTIONAL TRIM.)\n\nAt last weekend's gathering, there were warnings against seeing the Biden presidency as a failure, simply because Trump won the 2024 election and had begun dismantling his policies. Essays on subjects like environmental policy, the economy and race argued that Biden accomplished more than was often noted in the news media -- or advertised by the administration itself.\n\n\"It's easy to see it as a story of continually falling short,\" said Joel Goldstein, a historian of the vice presidency at St. Louis University, who contributed a chapter about Harris. \"But then you realize there was so much happening.\"\n\nThere was plenty of talk of big-picture patterns. Was the Biden presidency the end of the federal civil rights era inaugurated by Lyndon B. Johnson? The last gasp of New Deal liberalism (or Clintonian neoliberalism)? An anomaly akin to the one-term Carter (or Van Buren) administration?\n\nAt the end of the first day, a group of four political scientists came as guests, armed with charts and graphs, along with some not-great news for Biden: Presidents who leave office with approval ratings below 50% (Biden departed at 40%) struggle to control how their place in history is understood.\n\n(BEGIN OPTIONAL TRIM.)\n\nThey also raised the ways the Biden presidency -- including in his approach to executive power, and his use of pardons -- may have been more continuous with Trump than his champions want to acknowledge.\n\nIn his chapter for the book, about the Supreme Court, John Witt, a historian at Yale University, made a similarly cheeky argument, suggesting that Biden used the court both as an antagonist and an \"enabler.\"\n\nThe court's 2023 rulings outlawing affirmative action in college admissions and blocking Biden's student debt relief plan may have been defeats for the Biden agenda. But they also had a \"silver lining,\" Witt said, in taking an issue that split the Democratic coalition off the table.\n\n\"I think it's a pattern across all 20th-century presidents, and also Lincoln,\" he said. \"They found a way to navigate the court and use it to offload political costs.\"\n\n(END OPTIONAL TRIM.)\n\nAs for abortion, the political costs of overturning Roe v. Wade may not have fallen on Trump, as Democrats had hoped. But Mary Ziegler, a law professor at the University of California, Davis, who contributed a paper on reproductive rights, said that did not mean that the right had won the bigger fight.\n\n\"Social conservatives are acting like they have a mandate I don't think they have,\" she said.\n\nIn an essay on race, Khalil Gibran Muhammad, a professor of African American studies and public affairs at Princeton, offered a full-throated defense of Biden's record as \"the first equity president.\"\n\nBiden, he wrote, \"staked his entire presidency on battling white supremacy and delivering justice to every American left behind,\" spending significant political capital and billions of dollars on initiatives woven through 90 federal agencies.\n\nThey may have all been \"outlawed\" by Trump, he said. But in the history books, Muhammad noted, a president's record on race is usually defined by ideals and intentions. If backlash were the sole measure of a legacy, \"there would have been little to admire in the presidency of Abraham Lincoln.\"\n\nIn the last hour of the gathering, discussion turned to the most shocking event of Biden's presidency: his disastrous debate against Trump, followed by his decision to drop out of the race.\n\nHere, things took a sharp turn to what Muhammad called \"the land of speculation.\" Who in the party knew what about Biden's apparent cognitive decline, and when did they know it? Who in his inner circle was crucial to his decision to stay in it as long as he did?\n\nTimothy Naftali, a research scholar at Columbia University who wrote the essay on the resignation, wasn't the only participant to drop the historian's objectivity and confess to feeling emotional after the debate.\n\n\"I tried not to get into the issue of whether he was actually running the government, but I wanted to explain to myself why I felt so angry, instead of sad,\" Naftali said.\n\n\"I wouldn't say it was a Nixon-level cover-up,\" he added, referring to Biden's decline. \"But there was concealment.\"\n\nToday, Biden's withdrawal remains a raw topic for many. But by the time insider accounts and other sources that shed more light become available, Zelizer said, it may lose its emotional charge.\n\nThat partly depends, he said, on whether Trump's return to office ends up being just another turn of American politics, or a blow to the democratic system itself.\n\n\"The promise of Biden, for his supporters, was to get rid of the element of politics that Trump represented,\" Zelizer said. \"Not only did he not do that, but it's not a successor to Trump that wins the election -- it's Trump.\"\n\nThis article originally appeared in The New York Times.","summary":"Joe Biden left office with abysmal approval ratings -- and faith that history would redeem him.","url":"https://www.berkshireeagle.com/nyt/writing-the-history-of-the-biden-presidency-in-the-trump-era/article_80a67dec-6689-5507-9598-364de468cd49.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-26 19:53:59","author":"Jennifer Schuessler,Princeton University Press","authors":["Jennifer Schuessler","Princeton University Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.05},{"id":294685866,"title":"Trump’s FCC chairman calls on tech leaders to push back against European censorship","text":"FIRST ON FOX - Federal Communication Commission (FCC) chairman Brendan Carr on Wednesday asked to meet with America’s most powerful tech executives to discuss ways to support them in pushing back on European censorship. Carr, who was selected to serve as FCC chairman by President Donald Trump, sent a letter to Alphabet CEO Sundar Pichai, Apple CEO Tim Cook, Meta CEO Mark Zuckerberg, Amazon CEO Andy Jassy, Microsoft CEO Satya Nadella, X CEO Linda Yaccarino and Snap CEO Evan Spiegel, along with top executives from Wikipedia, LinkedIn and Pinterest. The letter to companies that are expected to be regulated by Europe’s new Digital Services Act marks Carr’s first meaningful move into the tech censorship space after focusing on media companies since Inauguration Day. \"Over the past few years, Americans lived through an unprecedented surge in censorship. In too many cases, tech companies silenced individuals for doing nothing more than expressing themselves online and in the digital town square. The Biden Administration only encouraged this conduct by pressuring tech companies to discriminate against Americans based on their political, social, or scientific viewpoints,\" Carr began the letter, which has been obtained by Fox News Digital. VANCE EVISCERATES 'SOVIET'-STYLE EUROPEAN CENSORSHIP IN ADDRESS TO MUNICH SECURITY CONFERENCE \"Thankfully, President Trump has already taken action to restore Americans’ First Amendment rights, marshaling efforts to dismantle the censorship cartel. Consistent with President Trump’s longstanding commitment to free speech, some of you, like X, stood strong even as those waves of censorship crashed across the country,\" Carr continued. \"Others, like Meta, have now joined in expressing a commitment to push back on efforts to silence Americans. And still others, like Google, have progress they can make towards embracing the values of free expression.\" Carr urged the high-powered tech leaders to support his efforts to stand up for free speech. \"Following President Trump’s lead, we are working across the government to ensure that all Americans can exercise their free speech rights online and access a true diversity of viewpoints. I am concerned, however, that foreign nations and regulators are moving in the opposite direction—and their efforts could hinder the progress we’re making in this country,\" he wrote. \"In particular, the EU’s Digital Services Act, or DSA, is positioned to thwart efforts by U.S. tech companies to preserve and respect First Amendment principles on their platforms. This is especially true for products the DSA considers very large online platforms or very large online search engines, which each of you are,\" Carr added. \"Amidst this European overreach, President Trump has made clear that the United States will defend American companies from discriminatory laws and foreign regulatory regimes that wrongly burden our businesses.\" FCC CHAIR CALLS CBS NEWS' CONDUCT 'HARD TO EXPLAIN' FOLLOWING RELEASE OF KAMALA HARRIS INTERVIEW TRANSCRIPT Carr also cited Vice President JD Vance’s recent warning about European efforts to censor speech on American internet platforms made during his speech at the Munich Security Conference. \"In those remarks, the Trump Administration made clear that the DSA threatens freedom of speech and diversity of opinion both within the United States and worldwide,\" Carr wrote. \"The DSA undermines U.S. companies’ ability to adhere to First Amendment principles by requiring them to censor, monitor, and report on users’ speech. This includes what EU Member States consider unlawful speech, including speech that falls within vague and subjective categories such as ‘hate speech,’ which has already been applied to expressions of religious belief,\" he added. \"Platforms must also censor blasphemy, insults, or even defiling the memory of a dead person.\" The DSA also requires the hiring of government-approved \"trusted flagger\" to forward content to platforms that must be \"treated with priority,\" Carr noted. SEVEN FEDERAL AGENCIES HAVE PUSHED TECH GIANTS TO CENSOR AMERICANS, MEDIA RESEARCH CENTER SAYS \"The Orwellian measures don’t end there—the EU’s Code of Conduct on Disinformation becomes law under the DSA on July 1, 2025, and will impose further requirements on American Internet platforms,\" Carr wrote. \"The DSA marks a fork in the road for U.S. technology companies. On the one hand, the DSA requires you to censor content in violation of free speech principles. On the other, violating the DSA would risk European regulators imposing exorbitant fines of up to six percent of your annual revenue,\" Carr continued. \"It is not clear how U.S. businesses will navigate the path forward. The DSA may force U.S. companies to skew their content moderation policies to EU standards—a race to the bottom and away from free speech.\" Carr requested that each tech leader schedule a briefing on plans in order for the FCC to support \"efforts to restore and preserve free speech\" on the platforms. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital has reached out to the companies who received the letter for comment but did not immediately receive any responses.","summary":"FCC chairman Brendan Carr wrote a letter to top tech CEOs, including Apple CEO Tim Cook and Meta CEO Mark Zuckerberg, calling on them to stand up to European censorship.","url":"https://www.foxnews.com/media/trumps-fcc-chairman-calls-tech-leaders-push-back-against-european-censorship","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/brendan-carr.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-26 19:47:39","author":"Brian Flood","authors":["Brian Flood"],"language":"en","category":"politics","source_country":"us","sentiment":0.269},{"id":294678370,"title":"‘Fox & Friends’ extends ratings lead as MSNBC’s ‘Morning Joe’ loses nearly half its audience since election","text":"“Fox & Friends” continues to pull away from the competition in the ratings race since President Trump was elected – drawing more than twice the viewership of reeling rival MSNBC’s “Morning Joe” — which has lost nearly half its audience, according to the latest Nielsen figures. \n\nFox News’ perennially top-ranked morning show pulled in an average 1.5 million viewers between Nov. 6 and last Friday — a 29% increase over its ratings from last Jan. 1 to the Nov. 5 election, the data showed. \n\nBy comparison, “Morning Joe” has seen its audience shrink by 40% in the post-election period — from 1.1 million before the Nov. 5 election to just 651,000 from Nov. 6 until this past Friday, according to Nielsen figures.\n\nThe struggling show, hosted by Joe Scarborough and wife Mika Brzezinski has even been beaten by left-leaning rival CNN in the key 25-54 demographic the past two months, the data show. \n\n“Fox & Friends,” which has maintained its first-place standing in the ratings for more than two decades, also outpaced “Morning Joe” in the advertiser-coveted 25-54 age demographic. Prior to the Nov. 5 election, the show was drawing on average 160,000 viewers in the demo.\n\nSince Nov. 6, that number has surged by 21% — to 193,000 viewers, according to Nielsen.\n\nThe popularity of “Fox & Friends” is even outpacing morning shows on network television in certain markets, according to the latest Nielsen figures.\n\nThe show has drawn bigger audiences than either ABC’s “Good Morning America” or “CBS Mornings” in 30 markets, including Los Angeles, Chicago, Philadelphia, Dallas, Boston, Washington, DC, Detroit and Cleveland.\n\n“Morning Joe,” meanwhile, has been hemorrhaging viewers in the 25-54 demographic. Prior to Nov. 5, the show was averaging 123,000 viewers in that age group. Since then, that number has shrunk to just 67,000 viewers, per Nielsen.\n\nThe couple have struggled to win back viewers after revealing they visited Donald Trump’s Mar-a-Lago resort following his historic rout over Vice President Kamala Harris.\n\nThey were eviscerated for “kissing the ring” — despite calling Trump a “fascist” in the months leading up to the election.\n\nThe network’s morning show woes comes amid upheaval in primetime after new MSNBC president Rebecca Kutler canned Trump-bashing anchor Joy Reid as part of a wider shakeup.\n\nAn MSNBC spokesperson tried to put a positive spin on the cratering ratings at “Morning Joe,” noting the show has seen its total viewership increase since Inauguration Day by 17% — from 587,000 in the period between Nov. 5 and Jan. 20, to 684,000 since Jan. 20.\n\nIn the 25-54 demographic, “Morning Joe” is averaging 24% more viewers since the inauguration — 68,000 compared with 55,000 prior to Jan. 20, the rep added.\n\nMSNBC noted that “Morning Joe” continued to command a larger overall audience than CNN in February — the 120th consecutive month that it has done so.\n\nLagging behind in a distant third is CNN’s “This Morning” and “CNN News Central.”\n\nIn the period that preceded the Nov. 5 election, the network drew an average of 352,000 total viewers between the hours of 6 a.m. and 9 a.m. ET.\n\nSince Nov. 6, however, the total viewership of the three-hour bloc on CNN dipped by 24%, to just 268,000 people.\n\nThe Warner Bros.-Discover-owned network has also been losing audience share in the 25-54 age demographic, Nielsen figures show.\n\nPrior to the election, 75,000 people in the demo tuned in to “This Morning” and “CNN News Central.” Since the election, that number fell by 32% to 51,000 people.\n\nBut CNN’s morning crew is making gains against MSNBC.\n\nIn a surprise development, “CNN News Central” outperformed “Morning Joe” in the 25-54 age demographic for the second straight month in February, according to Nielsen ratings.\n\n“CNN News Central” scored an audience of 79,000 in the 25-54 demographic this month compared to just 73,000 for “Morning Joe,” according to Nielsen figures.\n\nCNN also touted its total daytime numbers, which beat MSNBC for the fifth consecutive month in February. According to Nielsen, CNN daytime drew 83,000 total viewers, compared to just 67,000 for MSNBC.\n\nFox News is owned by Fox Corp — corporate sister to The Post’s parent company News Corp.","summary":"\"Morning Joe\" saw its total audience shrink by 40% in the post-election period -- from 1.1 million to just 651,000 from Nov. 6 until Friday.","url":"https://nypost.com/2025/02/26/media/fox-news-fox-amp-friends-outpaces-struggling-morning-joe-of-msnbc/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-ld9d716b1-1740591227248.jpg?quality=75&strip=all&1740573338&w=1200","video":null,"publish_date":"2025-02-26 19:41:25","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","source_country":"us","sentiment":-0.346},{"id":294675436,"title":"Jeff Bezos shakes up Washington Post with radical shift","text":"Bezos said he offered Shipley the opportunity to lead the new vision but that “after careful consideration, David decided to step away.”\n\nSince purchasing the Post in 2013, Bezos, the Amazon.com founder, had remained largely hands off of editorial coverage until recently. After an early, testy rivalry with Trump that goes back nearly a decade, Bezos had largely muffled his criticisms under Trump’s presidencies. In October, the Post made a controversial decision to not endorse a candidate for president, after it had initially drafted a piece in favour of Vice President Kamala Harris. The Post’s union said the decision not to publish was made by Bezos.\n\nThe move set off a firestorm of criticism, both inside and outside of the newspaper. Multiple editors and writers resigned. As many as 200,000 subscribers, or 8 per cent of the total, cancelled, National Public Radio reported.\n\nBezos, who is the world’s second-richest person, has businesses with contracts worth billions of dollars that depend on the federal government, including cloud-computing services and his Blue Origin space company.","summary":"The paper’s billionaire owner has announced a change in direction in a note to staff, resulting in the departure of the Post’s opinion editor.","url":"https://www.smh.com.au/business/companies/jeff-bezos-shakes-up-washington-post-with-radical-shift-20250227-p5lfif.html","image":"https://static.ffx.io/images/$zoom_0.2641%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/cadcbdbc8ca5f2e8923b689ade6cbe619ef40648","video":null,"publish_date":"2025-02-26 19:39:13","author":"Hannah Miller","authors":["Hannah Miller"],"language":"en","category":"politics","source_country":"au","sentiment":0.406},{"id":294682380,"title":"WaPo Employees Collectively Struggling To Process Jeff Bezos’ Editorial Shakeup In Defense Of ‘Free Markets’","text":"Jeff Bezos, the owner of The Washington Post, provoked ire among his staffers Wednesday after he announced a new directive for the opinion section to begin defending “personal liberties and free markets.”\n\nBezos said in a Wednesday announcement that the opinion section will allow no criticisms of these two pillars since they have been critical to America’s success, prompting opinion editor David Shipley to step down. A handful of staffers at the Post publicly threatened to quit if Bezos dared to make any changes to the news section’s coverage.\n\nJeff Stein, the chief economics reporter at the Post, said the new announcement is a “massive encroachment” on the opinion section and threatened to quit if Bezos “tries interfering” with the news section. (RELATED: Jeff Bezos Slams Washington Post, Offering Glimmer Of Hopes For Media)\n\n“Massive encroachment by Jeff Bezos into The Washington Post’s opinion section today—makes clear dissenting views will not be published or tolerated there I still have not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the news side I will be quitting immediately and letting you know,” Stein said on X.\n\n Massive encroachment by Jeff Bezos into The Washington Post’s opinion section today – makes clear dissenting views will not be published or tolerated there I still have not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the… pic.twitter.com/7hzWCUDCVV — Jeff Stein (@JStein_WaPo) February 26, 2025 \n\nThe Post’s military affairs reporter Dan Lamothe adamantly stated he will not “shift [his] coverage” of the Defense Department and other matters relating to his beat.\n\n“Anyone reading regularly knows we’ve landed a series of scoops in recent days about the Defense Department. I’m not shifting my coverage. That is my job. I have no expectation that will change. But should I be told otherwise, I will need a Plan B,” Lamothe said.\n\n Anyone reading regularly knows we’ve landed a series of scoops in recent days about the Defense Department. I’m not shifting my coverage. That is my job. I have no expectation that will change. But should I be told otherwise, I will need a Plan B. — Dan Lamothe (@DanLamothe) February 26, 2025 \n\nThe paper’s White House reporter Dan Diamond and video producer Dave Jorgenson made similar threats by vowing to “speak out and leave” if Bezos “interferes” in their work.\n\n“My colleagues and I have been working to break news + write stories holding powerful people accountable. These are the top stories on our homepage right now, one of which I worked on. Our newsroom work is continuing. No one has ever told me what to write. If that changes, I’d speak out and leave,” Diamond said.\n\n My colleagues and I have been working to break news + write stories holding powerful people accountable. These are the top stories on our homepage right now, one of which I worked on. Our newsroom work is continuing. No one has ever told me what to write. If that changes, I’d speak out and leave. — Dan Diamond (@ddiamond.bsky.social) February 26, 2025 at 12:06 PM \n\n Echoing Jeff (Stein), if Bezos interferes with my work on the news side – I’m out. — Dave Jorgenson (@davejorgenson.bsky.social) February 26, 2025 at 11:11 AM \n\nWashington Post columnist Philip Bump and former columnist Jen Rubin, who previously worked for the Post, did not appear happy with Bezos’ new direction for the opinion section.\n\n“What the actual f*ck?” Bump wrote on Bsky.\n\n what the actual fuck — Philip Bump (@pbump.com) February 26, 2025 at 9:36 AM \n\nRubin accused Bezos of “sucking up” to President Donald Trump and Elon Musk, the overseer of the Department of Government Efficiency, by “destroying” the Post.\n\nBezos said the opinion section’s columns need to begin reflecting on how freedom “drives creativity, invention, and prosperity” in the U.S.\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” Bezos said on X. “We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others … I am of America and for America, and proud to be so. Our country did not get here by being typical. And a big part of America’s success has been freedom in the economic realm and everywhere else. Freedom is ethical — it minimizes coercion — and practical — it drives creativity, invention, and prosperity.”\n\n I shared this note with the Washington Post team this morning: I’m writing to let you know about a change coming to our opinion pages. We are going to be writing every day in support and defense of two pillars: personal liberties and free markets. We’ll cover other topics too… — Jeff Bezos (@JeffBezos) February 26, 2025 \n\nThe opinion section shakeup comes as Bezos’ relationship with President Donald Trump has seemingly improved since the 2024 election. The Amazon executive, who was previously a staunch critic of the president during his first term, dined with Trump and Elon Musk at Mar-a-Lago in December and even donated $1 million to the president’s inaugural fund through Amazon.\n\nBezos further angered his staff in October when the paper decided not to endorse former President Kamala Harris ahead of the election. He defended his paper’s not to make an endorsement based on the media’s lack of credibility.\n\nThe Post lost a quarter of a million subscriptions since making its decision to not endorse a candidate, and some indicated that they canceled their subscription following Bezos’ new announcement. The paper laid off dozens of staff from its business side at the start of 2025.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Massive encroachment'","url":"https://dailycaller.com/2025/02/26/wapo-employees-jeff-bezos-editorial-shakeup/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/02/GettyImages-450831356-scaled-e1740588001775.jpg","video":null,"publish_date":"2025-02-26 19:19:48","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","category":"politics","source_country":"US","sentiment":0.071},{"id":294673606,"title":"Pro-Trump ‘Let’s Go Brandon’ store shutting down after 3 years in N.J.","text":"A Jersey Shore shop that has long specialized in pro-Trump merchandise is shuttering just over a month into President Donald Trump’s second term in office.\n\nThe store, Let’s Go Brandon, has called a strip mall off Route 37 in Toms River home since April 2022. Last week, its owners announced the store’s impending closure in a Facebook post.\n\nThe reason for the closure was a “loss of lease,” the post said.\n\nHowever, the post informed all “Proud Patriot supporters” that the business will live on through online sales and pop-up mobile sales throughout New Jersey.\n\nIt is unclear why the store is losing its lease. Owner Vincent Scuzzese signed a five-year lease on the storefront in 2022, the Philadelphia Inquirer reported last summer.\n\nScuzzese declined to comment to NJ Advance Media about the closure, according to Audrey Impaglia, his wife.\n\nEqual parts political rallying cry and internet meme, “Let’s go Brandon” is used interchangeably as an insult to former President Joe Biden and a signal of fealty to Trump. Its origin is rooted in a viral moment from October 2021, when an NBC reporter at a NASCAR race misinterpreted a crowd chanting an expletive at Biden as “Let’s go Brandon.”\n\nIn addition to stocking flags, hats and hoodies, the Let’s Go Brandon store hawks skateboards, poker chips and Christmas ornaments with political themes.\n\nOne ornament, for instance, features Jesus laying his hands on a praying Trump, both of them kneeling. That ornament, which retails for $10, was sold out on Tuesday on Let’s Go Brandon’s online site.\n\nIn a sign of the post-inauguration times, most of the store’s online stock available for purchase was more explicitly pro-Trump than anti-Biden. But there were still several items emblazoned with “Let’s go Brandon” and “FJB,” short for “F--- Joe Biden,” for sale. \n\nThere was no trace, however, of “Let’s go Brenda,” a brief rebrand attempted by Let’s Go Brandon and other MAGA stores after Biden stepped aside and endorsed Vice President Kamala Harris as the Democratic nominee for president last year.\n\nIn its closure notice last week, the store offered steep discounts of up to 70% on all merchandise. It was unclear when exactly the brick and mortar location’s final day would be.\n\nToms River is a particularly ruby-red swath of Ocean County, a Republican stronghold in the state. The township’s voters went for Trump by more than 65% in November’s election.\n\nThank you for relying on us to provide the local news you can trust. Please consider supporting NJ.com with a voluntary subscription.\n\nAJ McDougall may be reached at amcdougall@njadvancemedia.com. Follow her on X at @oldmcdougall.","summary":"“Proud Patriot supporters” will now have to shop for MAGA merchandise online or through pop-up sales around the state, the owner said.","url":"https://www.nj.com/ocean/2025/02/pro-trump-lets-go-brandon-store-shutting-down-after-3-years-in-nj.html","image":"https://www.nj.com/resizer/v2/Y5O556UBT5GPHKM42HILXEVNT4.jpg?auth=6254755ef4dfaaf1a5af187d23d229e03af5f1b399ee827bf1cc8b4e589d4717&width=1280&quality=90","video":null,"publish_date":"2025-02-26 19:12:50","author":"AJ McDougall,Aj McDougall | Nj Advance Media For Nj.com","authors":["AJ McDougall","Aj McDougall | Nj Advance Media For Nj.com"],"language":"en","category":"politics","source_country":"us","sentiment":-0.233},{"id":294693266,"title":"HANNAFORD: She said what? Freeland seeks friends-with-nukes to contain Trump","text":"Somewhere in the basement of a US government building in Washington, a very junior staffer assigned to watch the Liberal leadership debate last night must have snapped awake when Chrystia Freeland started talking about nuclear weapons.'What did she just say?\"It had thus far been a boring night. After nearly ten years in power, every promise of future action, was a tacit admission of past failure. Then 'this Chrystia Freeland person' said something about a 'new world order' that would organize everybody from Denmark to Japan to isolate the US, and she was saying her plans to ‘outwit’ Mr. Trump would mean working more closely with “our European NATO allies, and I would be sure that France and Britain were there to possess nuclear weapons.”.UPDATED: Trump dominates second Liberal debate, candidates push spending, AI, ‘new world order'.She really said this. Presumably she ran it past British Prime Minister Sir Keir Starmer and French President Macron first... (Right?)But whatever else Freeland had to say last night, the idea that somebody’s nuclear weapons — or any weapons — would have any part in a discussion over anything between historic allies engaged in a trade dispute, shows a staggering departure from reality. What does this woman read in bed before she goes to sleep?We will see soon enough what Mr. Trump makes of it. (And Starmer and Macron.)But it was a bizarre moment in an otherwise painful-to-watch two hour parade of promises to fix Canada.These people have been in (and in Mark Carney’s case, around) government for nearly ten years. Therefore promising to ‘fix’ anything, whether it be the army, the economy, productivity, the price of entry into a new home, or any of a dozen other things upon which Carney, Freeland, Baylis and Gould found themselves in violent agreement, was simply to admit that after ten years of command, control and caprice, the Canadian Liberal Party had made a complete cock of things.No surprise then, that so much attention was diverted from the Liberal record to the person of Donald Trump, bully and predator. And the rhetorical contest was which of these cutlery-drawer knife fighters was best equipped to tackle the man with the gun.Before Freeland went nuclear, Carney tried to convince us he was the man to deal with Trump, being as he is by his own account, a skilled negotiator and economic expert.As a two-time former bank governor, it would be churlish to deny him that boast. Indeed, perhaps Mr. Trudeau would have been better advised to send Carney to Mar-a Lago-than go himself, only to be patronised.However, Trump is no fan of bankers. He is also a bit of a negotiator himself. And what Mr. Trump says is that ‘the worst thing you can possibly do in a deal Is seem desperate to make it.’ (Art of the Deal, Chapter 2.)Should Mr. Carney draw the short straw, we wish him luck. But he’d look a little less desperate for a deal had he not in the name of fighting carbon emissions, encouraged Mr. Trudeau not to build pipelines that would have expanded Canada’s export options to more than one customer.Backbencher Frank Baylis (who?) says Trump is a bully, but he can ‘predict what bullies will do’ and that Canada’s weak border security is a red herring and ‘an excuse for a shakedown.’ Indeed, alone among the candidates he actually promised to cancel the Liberal government’s border crackdown — such as it is. This is to suppose Canada’s border security is fine, when it actually is not. Other than to make it look more like a race, I’m not sure what Frank Baylis was doing on the stage.Trump-fighter Karina Gould claims that she is underestimated by the US president, but she has the right skills to fight him.I’m sure she believes that.But one of the low-value perquisites of this job has been the obligation to watch Question Period when Parliament is in session. As Liberal House Leader Karina Gould was often on her feet, responding to Mr. Poilievre, I do not share her good opinion of her Trump-fighting talents.And after how Kamala Harris crashed and burned with her ‘born in the middle class’ line, one wonders why Ms. Gould chose to borrow it. The right skills…Which brings us back to a sleepy Washington staffer.For yes, you really can bet that somebody on Team Trump had been assigned to take note of what the Liberals were saying. And, once the last cliché had been launched into a reluctant firmament, they sent a brief summary further up the ladder. And they would have taken note that there was a longshot possibility the the president could find himself dealing with a crazy woman who, although Canada had no nuclear weapons itself, wanted to build a nuclear armed 'new world order' against America.\"Sounds nuts sir, I know. But that's what she said.\"","summary":"But whatever else Freeland had to say last night, the idea that somebody’s nuclear weapons — or any weapons — would have any part in a discussion over anything between historic allies engaged in a trade dispute, shows a staggering departure from reality. What does this woman read in bed before she goes to sleep?","url":"https://www.westernstandard.news/opinion/hannaford-she-said-what-freeland-seeks-friends-with-nukes-to-contain-trump/62555","image":"https://media.assettype.com/westernstandard/2025-02-26/e1r2uaw3/Freeland.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-02-26 19:12:03","author":"Nigel Hannaford","authors":["Nigel Hannaford"],"language":"en","source_country":"ca","sentiment":-0.19},{"id":294659540,"title":"Washington Post owner Jeff Bezos says opinion pages will defend free market and ‘personal liberties’","text":"By LAURIE KELLMAN\n\nThe billionaire owner of The Washington Post, Jeff Bezos, narrowed the topics covered by its opinion section Wednesday to defending personal liberties and the free market, a pivot away from the traditional broad focus and prompting the news outlet’s opinion editor to resign.\n\nBezos, who also is the founder and largest individual shareholder of Amazon, said on X that “viewpoints opposing those pillars will be left to be published by others.”\n\nThe move was received by some as an indication that Bezos is making decisions for the Post with an eye toward avoiding retaliation by President Donald Trump. Bezos, though, cast the change as a modernization from the days when newspapers offered opinions on a broad range of topics. Now, he said, “the internet does that job.”\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” Bezos wrote in his post, adding that the new topics “are right for America. I also believe that these viewpoints are underserved in the current market of ideas and news opinion.” Opinions editor David Shipley resigned rather than lead the shift, Bezos said.\n\n“I suggested to him that if the answer wasn’t `hell yes,’ then it had to be `no.’ After careful consideration, David decided to step away,” Bezos wrote.\n\nThe pivot echoes the Wall Street Journal’s editorial page banner: “free markets, free people.”\n\nBezos’ move Wednesday was the latest in a series of Bezos’ changes to the legacy news outlet, an award-winning organization that broke the Watergate scandal and whose motto is, “Democracy Dies in Darkness.”\n\nWeeks before the November election, Bezos announced that the Post would not endorse a presidential candidate, sparking a wave of resignations and thousands of subscription cancellations. The Post’s editorial staff had been prepared to endorse Democrat Kamala Harris before publisher Will Lewis wrote instead that it would be better for readers to make up their own minds. Bezos defended the decision by saying in “a note from our owner” that editorial endorsements create a perception of bias at a time many Americans don’t believe the media, and do nothing to tip the scales of an election.\n\nIn January, cartoonist Ann Telnaes quit after an editor rejected her sketch of Bezos and other media executives bowing before Trump — after The Washington Post editor was seen with other executives at Trump’s Florida club Mar-a-Lago.\n\nSome of Trump’s top allies tweeted their support for Bezos’ move.\n\n“Bravo, @JeffBezos!” posted fellow billionaire Elon Musk. Added conservative commentator Charlie Kirk: “Good! The culture is changing rapidly for the better.”\n\nBezos bought the broadsheet and other newspapers in 2013 for $250 million in a surprise move viewed as a demonstration of how the Internet has created winners and losers and transformed the media landscape.\n\nThe narrowing of topics will be obvious. On the Post’s homepage Wednesday afternoon, headlines linking to opinion material included “Your showerhead is lying to you” and “What we learned about politics by talking about … wolves.”","summary":"The move was seen by some as a rightward shift.","url":"https://www.ocregister.com/2025/02/26/washington-post-columns/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/Blue_Origin_Layoffs_51945_1ff337-1.jpg?w=1024&h=711","video":null,"publish_date":"2025-02-26 18:58:02","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.223},{"id":294676374,"title":"Washington Post owner Jeff Bezos says opinion pages will defend free market and ‘personal liberties’","text":"By LAURIE KELLMAN\n\nThe billionaire owner of The Washington Post, Jeff Bezos, narrowed the topics covered by its opinion section Wednesday to defending personal liberties and the free market, a pivot away from the traditional broad focus and prompting the news outlet’s opinion editor to resign.\n\nBezos, who also is the founder and largest individual shareholder of Amazon, said on X that “viewpoints opposing those pillars will be left to be published by others.”\n\nThe move was received by some as an indication that Bezos is making decisions for the Post with an eye toward avoiding retaliation by President Donald Trump. Bezos, though, cast the change as a modernization from the days when newspapers offered opinions on a broad range of topics. Now, he said, “the internet does that job.”\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” Bezos wrote in his post, adding that the new topics “are right for America. I also believe that these viewpoints are underserved in the current market of ideas and news opinion.” Opinions editor David Shipley resigned rather than lead the shift, Bezos said.\n\n“I suggested to him that if the answer wasn’t `hell yes,’ then it had to be `no.’ After careful consideration, David decided to step away,” Bezos wrote.\n\nThe pivot echoes the Wall Street Journal’s editorial page banner: “free markets, free people.”\n\nBezos’ move Wednesday was the latest in a series of Bezos’ changes to the legacy news outlet, an award-winning organization that broke the Watergate scandal and whose motto is, “Democracy Dies in Darkness.”\n\nWeeks before the November election, Bezos announced that the Post would not endorse a presidential candidate, sparking a wave of resignations and thousands of subscription cancellations. The Post’s editorial staff had been prepared to endorse Democrat Kamala Harris before publisher Will Lewis wrote instead that it would be better for readers to make up their own minds. Bezos defended the decision by saying in “a note from our owner” that editorial endorsements create a perception of bias at a time many Americans don’t believe the media, and do nothing to tip the scales of an election.\n\nIn January, cartoonist Ann Telnaes quit after an editor rejected her sketch of Bezos and other media executives bowing before Trump — after The Washington Post editor was seen with other executives at Trump’s Florida club Mar-a-Lago.\n\nSome of Trump’s top allies tweeted their support for Bezos’ move.\n\n“Bravo, @JeffBezos!” posted fellow billionaire Elon Musk. Added conservative commentator Charlie Kirk: “Good! The culture is changing rapidly for the better.”\n\nBezos bought the broadsheet and other newspapers in 2013 for $250 million in a surprise move viewed as a demonstration of how the Internet has created winners and losers and transformed the media landscape.\n\nThe narrowing of topics will be obvious. On the Post’s homepage Wednesday afternoon, headlines linking to opinion material included “Your showerhead is lying to you” and “What we learned about politics by talking about … wolves.”","summary":"The move was seen by some as a rightward shift.","url":"https://www.sandiegouniontribune.com/2025/02/26/washington-post-columns/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/02/Blue_Origin_Layoffs_51945_1ff337-1.jpg?w=1024&h=711","video":null,"publish_date":"2025-02-26 18:58:02","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.223},{"id":294677052,"title":"Washington Post owner Jeff Bezos says opinion pages will defend free market and ‘personal liberties’","text":"By LAURIE KELLMAN\n\nThe billionaire owner of The Washington Post, Jeff Bezos, narrowed the topics covered by its opinion section Wednesday to defending personal liberties and the free market, a pivot away from the traditional broad focus and prompting the news outlet’s opinion editor to resign.\n\nBezos, who also is the founder and largest individual shareholder of Amazon, said on X that “viewpoints opposing those pillars will be left to be published by others.”\n\nThe move was received by some as an indication that Bezos is making decisions for the Post with an eye toward avoiding retaliation by President Donald Trump. Bezos, though, cast the change as a modernization from the days when newspapers offered opinions on a broad range of topics. Now, he said, “the internet does that job.”\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” Bezos wrote in his post, adding that the new topics “are right for America. I also believe that these viewpoints are underserved in the current market of ideas and news opinion.” Opinions editor David Shipley resigned rather than lead the shift, Bezos said.\n\n“I suggested to him that if the answer wasn’t `hell yes,’ then it had to be `no.’ After careful consideration, David decided to step away,” Bezos wrote.\n\nThe pivot echoes the Wall Street Journal’s editorial page banner: “free markets, free people.”\n\nBezos’ move Wednesday was the latest in a series of Bezos’ changes to the legacy news outlet, an award-winning organization that broke the Watergate scandal and whose motto is, “Democracy Dies in Darkness.”\n\nWeeks before the November election, Bezos announced that the Post would not endorse a presidential candidate, sparking a wave of resignations and thousands of subscription cancellations. The Post’s editorial staff had been prepared to endorse Democrat Kamala Harris before publisher Will Lewis wrote instead that it would be better for readers to make up their own minds. Bezos defended the decision by saying in “a note from our owner” that editorial endorsements create a perception of bias at a time many Americans don’t believe the media, and do nothing to tip the scales of an election.\n\nIn January, cartoonist Ann Telnaes quit after an editor rejected her sketch of Bezos and other media executives bowing before Trump — after The Washington Post editor was seen with other executives at Trump’s Florida club Mar-a-Lago.\n\nSome of Trump’s top allies tweeted their support for Bezos’ move.\n\n“Bravo, @JeffBezos!” posted fellow billionaire Elon Musk. Added conservative commentator Charlie Kirk: “Good! The culture is changing rapidly for the better.”\n\nBezos bought the broadsheet and other newspapers in 2013 for $250 million in a surprise move viewed as a demonstration of how the Internet has created winners and losers and transformed the media landscape.\n\nThe narrowing of topics will be obvious. On the Post’s homepage Wednesday afternoon, headlines linking to opinion material included “Your showerhead is lying to you” and “What we learned about politics by talking about … wolves.”","summary":"The move was seen by some as a rightward shift.","url":"https://www.bostonherald.com/2025/02/26/washington-post-columns/","image":"https://www.bostonherald.com/wp-content/uploads/2025/02/Blue_Origin_Layoffs_51945_1ff337-1.jpg?w=1024&h=711","video":null,"publish_date":"2025-02-26 18:58:02","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.223},{"id":294665240,"title":"CNN star blasted for penning new book 'exposing' the cover up of Biden's health decline he 'actively participated in'","text":"CNN's Jake Tapper is facing ridicule for penning a book about the 'cover-up' surrounding Joe Biden's health despite claims he and his network did the same.\n\n'Original Sin: President Biden's Decline, Its Cover-up, and His Disastrous Choice to Run Again,' by Tapper and CNN contributor Alex Thompson, provides an in-depth look at the former president's 'serious decline' and cover-up. \n\nIt was announced Wednesday morning, by the the book's publisher Penguin Press.\n\nWithin hours, onlookers were expressing ire toward CNN and airing accusations of hypocrisy - as the network advertised the looming May release.\n\nCommenters under CNN's own story claimed the station had been 'complicit in the fraud', as other singled out Tapper specifically. \n\nOthers derisively mocked the State of the Union host, framing his book as a shameless attempt at deflection.\n\nOne reader typed how Tapper 'needs to go', weeks after a senior CNN staffer told DailyMail.com the network had laid off 200 of its staff because it had become inundated with workers who do the bare minimum.\n\nAll honed in on the mainstream media Tapper and Thompson said they had successfully unmasked, while seemingly ignoring the pair's part in the reporting.\n\n Tapper, 55, notably moderated the June 2024 debate that sparked Biden's decision to bow out.\n\n'The hopelessly corrupt leftist media, like CNN, was complicit in the fraud. Where is the penalty?,' wrote one CNN user, after the Warner Discovery-owned website launched a paywall that charges users $3.99 per month in October. \n\n'Can the Dem self-proclaimed stewards of democracy tell us what unelected person was lurking in the shadows actually exercising the powers of the presidency?' they asked, pointing to an even deeper conspiracy.\n\n'So now that \"cat is out of the bag\" [after] Tapper decides to write a book about it,' someone else sniped.\n\n'I wonder if he will include himself and all of the other \"news reporters\" in the cover-up. \n\n'Most people could see the decline in Biden, and didn't go on air to tell millions of viewers that the emperor did have clothes on, when we could see the naked truth,' they continued, echoing the opinions of countless others aired during the buildup to Biden's bowing out. \n\n'Tapper needs to go.'\n\n'This is rich,' another griped. 'Tapper (and the rest of the media and democrats) are SHOCKED to find that Biden was in decline[,] [b]ut is nothing but an attempt to deflect criticism from them for not doing their jobs and lying to the public. \n\n'What's even more rich is that the platform they had their puppet president run on was to save Democracy,' they went on. \n\n'So, propping up a candidate who was clearly in mental decline... so that the democrats could stay in power is saving Democracy? That's rich.' \n\n'What is the point of this, except to make the writers money?' another chimed in. 'No respect for Tapper.' \n\n'Most of the media ignored Biden's decline and didn't investigate till after the debate,' a final user remarked.\n\n'I'm not a Fox News fan but to their credit they were pointing it out for some time.'\n\nOthers offered more of the same on X, reacting to Tapper and Thompson's joint project and what they perceived as general hypocrisy from the former.\n\n'It's a book written by Jake about how Jake covered up Biden's decline so Jake could write a book,' one user wrote. Tell me - if Biden had won would this book still be published?'\n\n'If the book includes the role @jaketapper himself played, critically, I'll buy it. I'm game to support anyone who can reflect and learn on their mistakes,' someone else said. 'Otherwise, hard pass.'\n\n'Let me get this straight. You are writing a book about something that many in the media covered up,' a third X user asked.\n\n'The legacy media was responsible for covering up this issue that you are writing about. This would be like robbing a bank and then writing a book about your heist. \n\n'If you are writing about what the White House did to cover it up that's fine,' they concluded. '[B]ut I hope you include the media[']s role.'\n\n A synopsis for the book provided in a press release, meanwhile, described the liberal-led plot. It frames Biden, 'his family, and his senior aides' as 'so convinced that only he could beat Trump again, they lied to themselves, allies, and the public.'\n\n'What you will learn makes President Biden’s decision to run for reelection seem shockingly narcissistic, self-delusional, and reckless - a desperate bet that went bust,' Penguin stated while announcing the book.'\n\nThe publisher further framed the attempt - fueled by coverage that likely aired on legacy stations like ABC, NBC, and CBS - as 'part of a larger act of extended public deception that has few precedents.'\n\nTapper - who also moderated a 2020 debate between the then-candidates - added in a separate statement, in which he quoted Nobel Prize winning novelist Toni Morrison.\n\n ‘\"If there’s a book that you want to read, but it hasn’t been written yet, then you must write it.\"'\n\n'That’s what inspired this book,' the Lead With Jake Tapper host said. 'We wanted to know more about what we all just lived through. \n\n'More than 200 interviews later, Alex and I have a much better idea,' he said, talking up the book's sourcing.\n\n'And soon you all will too.'\n\nThe statement was delivered a little more than six months removed from the Atlanta debate that Tapper moderated, which led to accusations that CNN's lead Washington anchor took it easy on the president.\n\nOne segment in particular sparked such accusations, after Tapper appeared to cut the 81-year-old off in the midst of a rambling, nonsensical answer - one of several later cited after the Democrats' abrupt turnaround to opting for Kamala Harris.\n\n'We'd be able to wipe out his debt,' Biden said at the time of sums incurred by Trump-era tax cuts he said 'benefited the very wealthy.'\n\n'We'd be able to help make sure all those things we need to do: child care, elder care, making sure that we continue to strengthen our health care system,' he continued, stumbling at times over his words.\n\n'Making sure that we're able to make every single solitary person eligible for what I've been able to do with the... with the COVID, excuse me, with um, dealing with everything we have to with, uh,' he went on, languishing at this point. \n\n'Look, if we finally beat Medicare...'\n\nHe proceeded to fully trail off. \n\nThe silence that ensued - and the overall moment - went on to live in infamy, after Tapper's timely interjection.\n\n'Thank you President Biden - President Trump?'\n\nWithin days - thanks an array of other viral flubs during the make-or-break faceoff - Biden was bombarded with bipartisan calls to drop out.\n\nHe eventually did, albeit reluctantly, after several weeks.\n\nThat said, Tapper was one of few left-leaning hosts to call attention to Biden's seemingly waning health in the months leading up the debate, while talents like Thompson gave time to accounts from White House staffers insisting the president was fine.\n\nTapper, moreover, cut off Lara Trump during a tense interview that aired on State of the Union in 2020, during an conversation about the candidate's 'cognitive decline.'\n\nThe host - who was reportedly just denied a raise - had just aired a clip of Trump's daughter-in-law criticizing Biden's tendency to stutter, calling it evidence of his 'cognitive decline'.\n\n'I'm like \"Joe, can ya get it out, let's get the words out, Joe,\" You kinda feel bad for him,' she said - leading Tapper to chide her and point out previous reporting surrounding Biden overcoming a stutter over the years.\n\n'How do you think it makes little kids with stutters feel when they see you make a comment like that?' he asked Trump sternly. 'I think you have absolutely no standing to diagnose somebody's cognitive decline'. \n\nMeanwhile, the network recently lost embarrassing lawsuit after a correspondent defamed an Afghan war veteran on Tapper's eponymous show by falsely accusing him of running a 'black market' for Afghanistan evacuations.\n\nIt saw CNN pay him $5 million damages.\n\nSimultaneously, the network has been battling sagging ratings and vows from conservative lawmakers - including Trump himself - to crack down on what they claim is an unfair liberal bias.\n\nHours before the book was announced, Trump's Director of National Intelligence Tulsi Gabbard blasted CNN as the CIA’s 'propaganda arm', due to its reporting on Elon Musk's Doge.\n\nThe Trump administration is also behind a federal probe into NBCUniversal's Comcast, over the company's dated DEI practices.\n\nFollowing Trump's win, the station also lost Jim Acosta, who resigned in apparent refusal to cozy up to the conservative. \n\n 'One final message - don't give in to the lies,' he said during his final broadcast last month, before calling Trump 'a tyrant' in an anecdotal, opinionated speech.\n\n'Don't give in to the fear. Hold on to the truth and to hope,' he went on, years after clashing with the president and his aides' on the White House floor.\n\n'Even if you have to get out your phone,' he went on. 'Record that message. \"I will not give in to the lies. I will not give in to the fear.\" Post it on your social media, so people can hear from you, too.'\n\nAcosta went on to state how he'd share news of his planned career moves in the coming days, before launching a Substack.","summary":"'Original Sin: President Biden's Decline, Its Cover-up, and His Disastrous Choice to Run Again,' by Jake Tapper, provides an in-depth look at what the anchor has conceded was a ploy","url":"https://www.dailymail.co.uk/media/article-14438877/cnn-jake-tapper-new-book-cover-joe-biden.html","image":"https://i.dailymail.co.uk/1s/2025/02/26/15/95611963-0-image-a-7_1740585223564.jpg","video":null,"publish_date":"2025-02-26 18:57:17","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.578},{"id":294662462,"title":"Pennsylvania man harbored illegal immigrants in area hit by Haitian influx: Trump DOJ","text":"A Pennsylvania resident has pleaded guilty to harboring illegal immigrants for financial gain in a town that drew national attention last year over an influx of Haitian migrants, the Department of Justice announced this week. Acting U.S. Attorney Troy Rivetti said Andy Ha has pleaded guilty to charges of harboring illegal aliens for financial gain and failing to pay more than $3 million in employment taxes. The DOJ announced that Ha owned a staffing agency that provided workers to companies in the area of Charleroi, Pennsylvania. As part of that, he paid over 25 workers who were not legally authorized to be in the U.S. to stay in a former hotel and paid for them to be transported to and from work. The nationality of those workers was not stated. HAITIAN MIGRATION ROILS TOWN IN KEY BATTLEGROUND STATE WITH SIGNS OF PRO-TRUMP SUPPORT ON THE RISE Additionally, he is accused of providing the individual who prepared the business’ tax returns with spreadsheets listing only workers in the U.S. legally, which authorities said led to a tax loss of at least $3.1 million. \"The defendant broke the law by harboring and employing individuals not authorized to be in the United States,\" Rivetti said. \"In addition, defendant Ha cost the U.S. government millions of dollars through his failure to pay taxes related to his business.\" \"This investigation highlights the commitment of HSI Pittsburgh to protecting our communities from those who seek to exploit undocumented workers for their personal gain,\" said Edward Owens, special agent in charge of Homeland Security Investigations (HSI) Philadelphia. FEDERAL JUDGE IN MAJOR BLUE CITY BLOCKS KEY TRUMP MOVE ON REFUGEES: ‘NOT LIMITLESS’ Sentencing is scheduled for July. The investigation was conducted by the Internal Revenue Service, HSI and Pennsylvania State Police. President Donald Trump had pointed to Charleroi as an example of a town that had been hit by an influx of Haitian migrants arriving under the Biden administration, including under a parole process for four nationalities, including Haiti. CLICK HERE FOR MORE IMMIGRATION COVERAGE \"The small 4,000-person town of Charleroi, Pennsylvania, have you heard of it?\" Trump said in September in Tucson, Arizona. \"What a beautiful name, but it's not so beautiful now. It has experienced a 2,000% increase in the population of Haitian migrants under Kamala Harris.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reported from Charleroi in October, and found that some officials and residents believed the impact was exaggerated and the influx had revitalized the town, but others disagreed and slammed what they described as an \"invasion.\"","summary":"The Department of Justice announced this week that a resident in Pennsylvania has pleaded guilty to harboring illegal immigrants in a town hit by Haitian migration.","url":"https://www.foxnews.com/politics/pennsylvania-man-harbored-illegal-immigrants-area-hit-haitian-influx-trump-doj","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/trump-charleroi.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-26 18:45:50","author":"Adam Shaw","authors":["Adam Shaw"],"language":"en","category":"politics","source_country":"us","sentiment":-0.358},{"id":294662460,"title":"Monica Lewinsky says 'right way' for Bill Clinton to handle affair would have been to 'resign'","text":"Monica Lewinsky, a former White House intern, said during an interview on the \"Call Her Daddy\" podcast Wednesday that the right thing for former President Bill Clinton to do when their affair went public would have been \"to resign.\" \"I think that the right way to handle a situation like that would have been to probably say it was nobody’s business and to resign,\" Lewinsky told host Alex Cooper after revealing that she had never been asked about how the situation should have been handled. \"Or to find a way of staying in office that was not lying and not throwing a young person who is just starting out in the world under the bus.\" Clinton admitted to having an affair with Lewinsky while he was president, which ultimately led to his impeachment in 1998. \"At the same time, I hear myself say that and it’s like ‘Okay, but we’re also talking about the most powerful office in the world,'\" she said. \"I don’t want to be naive either.\" MONICA LEWINSKY GOES VIRAL FOR TAYLOR-SWIFT THEMED BILL CLINTON JOKE: ‘THE ASYLUM WHERE THEY RAISED ME’ Asked about her portrayal in the media, Lewinsky discussed how much coverage the affair got at the time, and how she was painted by outlets. \"I think for five seconds, it was sympathetic and maybe after about a week, once the White House got in gear, I was very quickly painted as a stalker, a whore, mentally unstable, a bimbo, I was very quickly painted as both the pursuer in this and also not attractive enough to be pursued,\" she said. \"There was a creation of a version of me that I didn't recognize.\" Lewinsky also reflected on the White House response, including when Clinton denied the affair by saying, \"I did not have sexual relations with that woman.\" Cooper asked Lewinsky to reconcile what people were saying about their relationship, and what she knew to be true. \"It was gaslighting,\" she said. \"I think that was what I experienced on a pretty large scale. It was devastating.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"I don't think the White House's intention was to gaslight me, I think the intention was to stay in power and to get out of legal jeopardy,\" she said. \"I think that is the core of being gas-lit.\" Lewinsky also said that while she felt Clinton's behavior was worse, she still made her own mistakes. \"Let's recognize that while there were so many ways that Bill's behavior was more reprehensible than mine, I did make mistakes,\" she said. Lewinsky, who has become an anti-bully activist in the aftermath of the affair with Clinton, also spoke about her new podcast, \"Reclaiming with Monica Lewinsky.\" CLICK HERE TO GET THE FOX NEWS APP Clinton, who helped campaign for former President Biden prior to him dropping out of the 2024 race, as well as for former Vice President Kamala Harris, recently released a memoir titled \"Citizens,\" which mentions Lewinsky. \"I live with it all the time,\" Clinton wrote of the scandal, complimenting her work on bullying. \"I wish her nothing but the best.\" Fox News Digital reached out to a Bill Clinton representative for comment.","summary":"Monica Lewinsky said during a podcast interview on Wednesday that Bill Clinton should have resigned after the affair, and called out the former president for throwing her under the bus.","url":"https://www.foxnews.com/media/monica-lewinsky-says-right-way-bill-clinton-handle-affair-resign","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/lewinsky-clinton.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-26 18:30:39","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"us","sentiment":-0.393},{"id":294656492,"title":"Jeff Bezos orders Washington Post opinion pages to support 'personal liberties and free markets'; top editor resigns","text":"Jeff Bezos, the Amazon founder and owner of the Washington Post, said Wednesday that his newspaper's opinion pages would now be dedicated to supporting \"personal liberties and free markets,\" and that the organization would not publish opposing views.\n\n\"We'll cover other topics too of course,\" Bezos said in an email to Post staffers that he posted on X. \"But viewpoints opposing those pillars will be left to be published by others.\"\n\nWhile the move garnered praise from some in President Donald Trump's administration, such as Elon Musk, it was panned by some current and former Post staffers, including former editor Marty Baron, who said he was \"disgusted.\"\n\nBezos said that editorial page editor David Shipley, who had held the job for over two years, decided to resign rather than lead the opinion section under the new policy.\n\n\"I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no,'\" Bezos said of Shipley, adding, \"I respect his decision.\"\n\nThe Post will be \"searching for a new Opinion Editor to own this new direction,\" Bezos said.\n\nHe asserted that while a major newspaper might once have considered it a service to offer its readers \"a broad-based opinion section that sought to cover all views,\" that is no longer the case.\n\n\"Today, the internet does that job,\" Bezos wrote.\n\n\"I'm confident that free markets and personal liberties are right for America,\" he added. \"I also believe these viewpoints are underserved in the current market of ideas and news opinion. I'm excited for us together to fill that void.\"\n\nRepresentatives for Bezos and the Post, as well as Shipley, did not immediately return CNBC's requests for additional comment.\n\nBy erecting new parameters around what opinions the Post can print, Bezos will likely draw fresh accusations that he is seeking to curry favor with Trump, who has long attacked the paper as \"Fake News.\"\n\nLess than two weeks before the 2024 presidential election between the Republican Trump and Democratic nominee Kamala Harris, the Post announced that it would not endorse either candidate, breaking with decades of recent precedent.\n\nThe Post in a news article at the time reported that the paper's editorial staff had planned to endorse Harris, and that Bezos himself made the decision to end the tradition.","summary":"Jeff Bezos said that Washington Post editorial page editor David Shipley decided to resign rather than lead the opinion section under the new policy.","url":"https://www.cnbc.com/2025/02/26/jeff-bezos-washington-post-opinion-markets-liberties-editor-resigns.html","image":"https://image.cnbcfm.com/api/v1/image/108089121-1737389074596-gettyimages-2194353799-AFP_36UT2E8.jpeg?v=1737389123","video":null,"publish_date":"2025-02-26 18:19:03","author":"Kevin Breuninger,Lillian Rizzo","authors":["Kevin Breuninger","Lillian Rizzo"],"language":"en","category":"politics","source_country":"US","sentiment":-0.225},{"id":294661730,"title":"Washington Post op-ed editor exits as Jeff Bezos unveils ‘free market’ focus","text":"This follows some 200,000 digital readers who canceled their subscriptions following the Washington Post’s decision not to offer an endorsement ahead of the 2024 election. A written endorsement of then-Vice President Kamala Harris had already been in the works when Bezos decided to break with tradition.\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets. We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others,” Bezos shared in the message he sent Washington Post staff on X.\n\n“There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader’s doorstep every morning a broad-based opinion section that sought to cover all views. Today, the internet does that job,” Bezos went on. “I am of America and for America, and proud to be so. Our country did not get here by being typical. And a big part of America’s success has been freedom in the economic realm and everywhere else. Freedom is ethical — it minimizes coercion — and practical — it drives creativity, invention, and prosperity.”\n\nBezos also announced the exit of opinion editor David Shipley, who held the position for two years. The owner offered Shipley the chance to continue leading this new effort but said, “If the answer wasn’t ‘hell yes,’ then it had to be ‘no,'” which prompted Shipley to bow out. The Washington Post has not announced his replacement.\n\nSome subscribers reacted to the news by announcing they had canceled their subscriptions. This foreshadows a new wave of mass cancelations, the second in under six months. Washington Post staff even voiced their disapproval.\n\n“Massive encroachment by Jeff Bezos into The Washington Post’s opinion section today – makes clear dissenting views will not be published or tolerated there,” Washington Post reporter Jeff Stein wrote on X. “I still have not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the news side I will be quitting immediately and letting you know.”\n\nStill, others approved of the move, such as X owner Elon Musk, who wrote, “Bravo.” Musk attended President Donald Trump’s inauguration with Bezos.\n\nBezos remains the executive chairman of Amazon, which contributed $1 million to Trump’s inauguration.\n\nJAKE TAPPER AND ALEX THOMPSON RELEASE BOOK ON JOE BIDEN’S COGNITIVE DECLINE\n\nAdditionally, three members of the editorial board left their posts in protest of the direction the paper was headed last year.\n\nThe announcement of the Washington Post‘s non-endorsement came less than two weeks before Election Day. The Washington Post took up the tradition in 1988. It will no longer offer an endorsement in perpetuity.","summary":"Washington Post owner Jeff Bezos announced Wednesday that the paper will no longer publish opinion editorials opposing &#8220;personal liberties&#8221; or &#8220;free markets.&#8221; This follows some 200,000 digital readers who canceled their subscriptions following the Washington Post&#8217;s decision not to offer an endorsement ahead of the 2024 election. A written endorsement of then-Vice President Kamala Harris [&#8230;]","url":"https://www.washingtonexaminer.com/news/business/3330865/washington-post-op-ed-editor-exits-jeff-bezos-unveils-free-markets-focus/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/AP25020578297305.webp","video":null,"publish_date":"2025-02-26 18:15:36","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","category":"politics","source_country":"US","sentiment":-0.133},{"id":294658922,"title":"Washington Post owner Jeff Bezos says opinion pages will defend free market and ‘personal liberties’","text":"“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” Bezos wrote in his post, adding that the new topics “are right for America. I also believe that these viewpoints are underserved in the current market of ideas and news opinion.” Opinions editor David Shipley resigned rather than lead the shift, Bezos said.\n\n“I suggested to him that if the answer wasn’t ‘hell yes,’ then it had to be ‘no.’ After careful consideration, David decided to step away,” Bezos wrote.\n\nThe pivot echoes the Wall Street Journal’s editorial page banner: “free markets, free people.”\n\nBezos’ move Wednesday was the latest in a series of Bezos’ changes to the legacy news outlet, an award-winning organization that broke the Watergate scandal and whose motto is, “Democracy Dies in Darkness.”\n\nWeeks before the November election, Bezos announced that the Post would not endorse a presidential candidate, sparking a wave of resignations and thousands of subscription cancellations. The Post’s editorial staff had been prepared to endorse Democrat Kamala Harris before publisher Will Lewis wrote instead that it would be better for readers to make up their own minds. Bezos defended the decision by saying in “a note from our owner” that editorial endorsements create a perception of bias at a time many Americans don’t believe the media, and do nothing to tip the scales of an election.","summary":"The billionaire owner of The Washington Post, Jeff Bezos, narrowed the topics covered by its opinion section Wednesday to defending personal liberties and the free market, a pivot away from the traditional broad focus and prompting the news outlet&#8217;s opinion editor to resign. Bezos, who also is the founder and largest individual shareholder of Amazon, [&#8230;]","url":"https://financialpost.com/pmn/washington-post-owner-jeff-bezos-says-opinion-pages-will-defend-free-market-and-personal-liberties","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/thumbnail_thumbnail_potatoes-in-bloom-6.jpg?quality=5&strip=all&w=100&sig=Re0ZVlpDHAxbag1fUVqEhA","video":null,"publish_date":"2025-02-26 18:13:42","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"CA","sentiment":0.073},{"id":294652420,"title":"Why my fellow California Republicans should consider a celebrity Democrat for governor — no joke!","text":"A popular meme making the rounds on social media shows an anguished citizen, outraged at California’s incompetent ruling Democrats Gov. Gavin Newsom, Los Angeles Mayor Karen Bass, Attorney General Rob Bonta and the rest of the state’s Democratic politburo, saying, “Next time I’ll vote for a different Democrat!”\n\nIt’s a mordant recognition California is a hopeless one-party state. For someone like me who grew up in California when it was considered “Reagan Country” and the bulwark of Republican strength in the Electoral College, this is a shocking and depressing state of affairs.\n\nThe California Republican Party is so feeble that it’s becoming more frequent that the state’s top-two “jungle” primary system adopted 20 years ago, in which all candidates are listed and voted on together with the top two finishers going on the November ballot, produces general-election contests for statewide office between two Democrats.\n\nKamala Harris was first elected to the US Senate in 2016 out of the jungle-primary process, beating another Democrat who finished second in the spring.\n\nSen. Adam Schiff last year ran TV ads successfully boosting Republican Steve Garvey’s candidacy in the primary so he wouldn’t have to contest another Democrat in November — and won.\n\nIn an open field for governor next year, it’s possible two strong Democrats could keep a Republican from making the general-election ballot. One of them is likely to be Kamala Harris, who’s leading in the early polls.\n\nPart of the problem for anyone, especially a Republican, seeking statewide office in California is that the state’s sheer size and expensive media markets make it difficult to break through to the public and establish basic name identification.\n\nSucceeding statewide requires that a candidate be part of a well-organized and well-funded political machine — which is how Newsom and Harris ascended in the Bay Area — or have celebrity status, like Arnold Schwarzenegger or Ronald Reagan back in 1966. \n\n(Lost in the mists of time is the Democratic effort in 1974 to get Warren Beatty to run for governor, mimicking Reagan’s celebrity success.)\n\nLong gone are the days when a Republican could slowly climb the greasy pole of statewide politics with a solid record in lower offices, like George Deukmejian or Pete Wilson.\n\nWhile Republican strength has atrophied, California Democrats have built a powerful and flush political machine, anchored in progressive San Francisco, that skillfully grooms and promotes statewide candidates, such as Newsom and Harris.\n\nIf next year’s election offers Harris and some other far-left Democrat such as AG Bonta, we few remaining California Republicans might well pack up our moving vans or consider assisted suicide.\n\nThe despair over today’s one-party rule has led to the faint hope that perhaps a moderate Democrat might come along some Republicans could swallow. \n\nBut amazingly Jerry Brown was about as moderate as you could expect from California Democrats, and that’s saying something.\n\nMaybe the time has come for Republicans to explore some exotic options besides exile. Are there any different Democrats out there with the possible appeal and ability to disrupt the Democratic Party’s far-left political machine?\n\nThere might be one: comedian Bill Maher.\n\nIt may sound crazy at first, but he seems to have finally made the turn toward across-the-board political sense.\n\nPerhaps Maher’s progress is a simple case of maturity that comes with advancing years, but one sees no such progress with other left-leaning comedians such as Jon Stewart or Stephen Colbert, who increasingly offer up unfunny partisan hackery. \n\nMaher appears to be a “liberal who was mugged by reality” — the Christopher Hitchens of lefty comedians.\n\nGoing back to his ABC show “Politically Incorrect” 25 years ago, Maher has always displayed an independent streak. He never sugarcoated radical Islam and chided fellow liberals who did.\n\n“Liberals need to stand up for liberal principles,” he insisted. “Liberal principles like freedom of speech, freedom to practice any religion you want without fear of violence, freedom to leave a religion, equality for women, equality for minorities including homosexuals — these are liberal principles that liberals applaud for, but then when you say in the Muslim world this is what’s lacking, then they get upset.” \n\nThat prompted guest Ben Affleck to call him a bigot.\n\nIn more recent years Maher has repeatedly attacked identity politics in his rants on his weekly HBO show, “Real Time.” \n\nIn one monologue several months ago, Maher said: “We need to stop talking about the things that make Americans different from each other and start honoring the things that make us the same. . . . Outdated racial pandering is one reason Democrats keep losing elections. Today’s Democrats should move on from identity politics.”\n\nThis has now become the conventional wisdom among many leading Democrats, though they haven’t figured out how to get out of it without infuriating their identity interest groups that hold so much sway over the party.\n\nIn the wake of the Los Angeles fires Maher suddenly sounds like a fiscal conservative, pointing out that people in California pay high taxes and rightly expect competent government — but aren’t getting it.\n\nIt’s pretty clear he has contempt for Newsom and Bass. He even dishes on high-speed rail, the greatest boondoggle in California history. One recent monologue on HBO he asked, “Can anyone really say our government is not broken?”\n\nHe followed up by saying President Trump might be right about getting rid of the Department of Education. Rare for a liberal, he looks at results rather than the good intentions and money spent, and he sees that the Department of Education has abjectly failed in its mission.\n\nAnd he’s called for getting tough on crime.\n\nThese are all heresies among the ideological minders of the Democratic Party but probably in step with a lot of rank-and-file Democrats. He is a callback to an older, hardheaded, commonsense social democrat.\n\nWould he make a good candidate?\n\nHe checks the well-known-celebrity box and would generate lots of free media. To be sure, Maher is a Trump-hater, a professed socialist and a celebrant of the drug culture. He’s made it clear he’ll never become a Republican or vote for a Republican.\n\nBut given that California Democrats now are incompetent socialists, Maher might still be attractive to many Republicans, while peeling off some of the growing number of Democrats in California, especially in Silicon Valley, who are quietly disgusted with the state of things.\n\nIn the absence of a credible Republican candidate (a good bet as of the moment), Maher presents Republicans with the opportunity at least to disrupt the Democrats’ machine. If nothing else, it would be amusing to watch other Democrats attack Maher from the left in a campaign, which would push the party’s public image even further left than it already is. There’s a chance that if he won, he’d include several Republicans in his cabinet because he’d know they’re more competent than the ideologues Democrats install now.\n\nIt will be objected that as a comedian, he has no government experience. That was the main objection to Reagan, of course, and we know how that turned out. \n\nAnd Maher wouldn’t be the first comedian propelled into high office at a stroke. There’s another TV comedian people have heard of who ascended into high office recently named Volodymyr Zelensky.\n\nDon’t knock the comic temperament. “A joke is a serious thing,” Winston Churchill remarked.\n\nWe’ll know wokeism is truly over when “Blazing Saddles” can be shown on a college campus.\n\nBesides, if Republicans can embrace Robert F. Kennedy Jr., they ought to be able to accept Bill Maher or at least enjoy the disruptive possibilities he might offer. \n\nWho knows how far his journey might yet take him? After all, coming around begrudgingly to the former host of “The Apprentice” has worked out fairly well for RFK Jr. Maher should follow his lead.\n\nSteven F. Hayward is the Edward Gaylord Distinguished Visiting Professor at Pepperdine University’s School of Public Policy.","summary":"A popular meme making the rounds on social media shows an anguished citizen, outraged at California’s incompetent ruling Democrats Gov. Gavin Newsom, Los Angeles Mayor Karen Bass, Attorney General Rob Bonta and the rest of the state’s Democratic politburo, saying, “Next time I’ll vote for a different Democrat!” It’s a mordant recognition California is a...","url":"https://nypost.com/2025/02/26/opinion/why-my-fellow-california-republicans-should-consider-celebrity-democrat-bill-maher-for-governor-no-joke/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/bill-maher-for-governor-2.jpg?quality=75&strip=all&1740574034&w=1200","video":"https://cdn.jwplayer.com/videos/hcqXnNCU-RyIcpnTz.mp4","publish_date":"2025-02-26 18:12:33","author":"Steven F. Hayward","authors":["Steven F. Hayward"],"language":"en","category":"politics","source_country":"us","sentiment":0.067},{"id":294659720,"title":"Is Donald Trump battling a health condition? Rumors fly as users on social media spot a bruise on right hand, many say the mark looks like IV bruise","text":"Recent images of President Donald Trump have sparked discussions about a noticeable bruise on his right hand. This observation has led to widespread speculation on social media platforms.Is the bruise on President Trump's hand a cause for concern?During a meeting at the White House with French President Emmanuel Macron, a prominent bruise was visible on President Trump's right hand. This sparked various theories online, with some suggesting it resembled a mark from an intravenous (IV) line. However, the White House has addressed these concerns.Could frequent handshakes explain President Trump's hand bruise?White House Press Secretary Karoline Leavitt attributed the bruise to President Trump's habit of extensive handshaking. She stated, President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other president in history. This explanation suggests that the bruise results from his regular interactions with the public. Also Read : Could Borderlands 4’s release date be the key to GTA 6 Trailer 2’s arrival? Fans speculate a major rockstar reveal Soon!Has President Trump experienced similar bruising before?This isn't the first time such bruising has been observed. In August and November of the previous year, similar marks were noted on President Trump's right hand. At that time, the White House provided a consistent explanation, linking the bruises to his frequent handshaking routine. Why hasn't President Trump released detailed health records?Despite being 78 years old and the oldest individual to assume the presidency, President Trump has not released comprehensive medical records. This departure from tradition has raised questions about his health transparency. In contrast, Democratic candidate Kamala Harris has publicly shared her medical information, emphasizing her physical and mental readiness for office. What are the implications of President Trump's health transparency?The absence of detailed health disclosures from President Trump has become a focal point in political discussions. Critics argue that, given his age, more transparency is warranted to assure the public of his capability to serve effectively. The Harris campaign has highlighted this issue, contrasting it with their own candidate's openness regarding health matters.FAQs:Why does Donald Trump have a bruise on his hand?The White House attributes it to frequent handshaking, dismissing medical concerns.Has Donald Trump addressed health transparency concerns?Trump has not released detailed health records, sparking ongoing debates.","summary":"Donald Trump’s health is in the spotlight after a visible bruise on his right hand sparked speculation. Social media users claim the mark resembles an IV bruise, fueling rumors of a medical condition. However, the White House dismissed concerns, stating it resulted from Trump’s frequent handshakes. Similar bruises were seen in the past, raising questions about his health transparency. At 78, Trump remains the oldest U.S. president, yet his medical records remain undisclosed. Critics demand clarity, especially as election debates intensify.","url":"https://economictimes.indiatimes.com/news/international/us/is-donald-trump-battling-a-health-condition-rumors-fly-as-users-on-social-media-spot-a-bruise-on-right-hand-many-say-the-mark-looks-like-iv-bruise/articleshow/118583530.cms","image":"https://img.etimg.com/thumb/msid-118583538,resizemode-4,width-1200,height-900,imgsize-36330,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-26 18:03:58","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":0.031},{"id":294652400,"title":"BlackRock, Bank of America drop DEI policies amid White House’s war on ‘woke’","text":"BlackRock and Bank of America dropped their Diversity, Equity, and Inclusion policies — becoming the latest Wall Street giants to scrap the controversial initiative after the White House declared war on woke in corporate America.\n\nRegulatory filings reviewed by The Post show that Larry Fink’s BlackRock, the world’s largest asset manager with $11.4 trillion under management, and the Brian Moynihan-led lender have axed language that promoted the representation and participation of different minority groups.\n\nThe moves follow a crackdown led by President Donald Trump on DEI in the workplace, tasking Attorney General Pam Bondi in a Jan. 21 executive order that asked her to stamp out the practice. \n\nBondi then vowed in a Feb. 5 memo that her DOJ would “investigate, eliminate, and penalize” such policies in the private sector.\n\nBlackRock, in its latest annual report filed late Tuesday, said that the company’s business “requires attracting the best people from across the world.”\n\n“BlackRock is committed to creating an environment that supports top talent and fosters diverse perspectives to avoid groupthink,” the report added.\n\nThat represents a huge climbdown for the Democrat-donating CEO, who joined the chorus of Wall Street executives backing DEI in the aftermath of the killing of George Floyd in 2020 and the Black Lives Matter movement.\n\nIn a letter to shareholders in 2021, Fink claimed: “To truly drive change, we must embed DEI into everything we do.”\n\nThe Post has reached out to Blackrock for comment.\n\nBofA also backed off the much-criticized DEI policies in its annual report filed on Tuesday evening, formally ending the requirements for hiring and interviewing bankers.\n\n“We are deliberate about the many ways we seek to create an inclusive environment where everyone hasthe opportunity to achieve their career goals,” the Charlotte-based firm wrote.\n\nA rep for Bank of America confirmed that was no longer company policy.\n\n“We evaluate and adjust our programs in light of new laws, court decisions, and, more recently, executive orders from the new administration,” a bank spokesperson said.\n\n“Our goal has been and continues to be to make opportunities available for all of our clients, shareholders, teammates, and the communities we serve.”\n\nThe rollback of DEI by the two giants of American finance echoes what some of their rivals have been doing since Trump trounced Kamala Harris on Nov. 5 in the race for the White House.\n\nWells Fargo, Citigroup, and Morgan Stanley have also scaled back their DEI commitments, while Goldman Sachs recently canceled a requirement to only take companies public if they had two diverse board members.\n\nJPMorgan CEO Jamie Dimon seemingly remains an outlier, insisting on Monday that nation’s largest bank would stand by its diversity policies, despite lashing out at DEI initiatives in a leaked recording of a town hall meeting with Chase employees.\n\nDimon told the audience that he “was never a firm believer in bias training” and blasted how the company was “spending money on some of this stupid shit.”\n\nThe Wall Street giant also scrubbed much of its DEI language in its recent annual report to investors, further confirming the shift in mood at America’s major banks.\n\n“Everyone in my industry wants diversity in their teams and a workplace that reflects society at large, but everybody on Wall Street privately agrees that the DEI doctrine had started to actually go too far. People have been afraid to speak up,” said Dan McCarthy, a veteran Wall Street headhunter and CEO of the specialist global search firm, One Search.\n\n“My clients are still hiring diversity and they are telling us that they want to continue to hire diversity,” McCarthy, the head of the Young Women Into Finance non-profit, added. \n\n“But some DEI policies became toxic to the point where they became discriminatory. It feels like we are starting to see more common sense around it.”","summary":"Filings reviewed by The Post show the firms have axed language that promoted the representation and participation of different minority groups.","url":"https://nypost.com/2025/02/26/business/blackrock-bank-of-america-drop-dei-policies-amid-white-houses-war-on-woke/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/99292793.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-26 18:01:21","author":"James Franey","authors":["James Franey"],"language":"en","category":"politics","source_country":"us","sentiment":0.379},{"id":294651896,"title":"How Donald Trump could change free speech as we know it","text":"Donald Trump, who is used to suing journalists and media companies about stories he doesn't like, says he's going to do more of it.In a post published on his Truth Social platform Wednesday, Trump vowed to \"sue some of these dishonest authors and book publishers, or even media in general,\" arguing that they make up stories about him and \"a big price should be paid for this blatant dishonesty.\"\"I'll do it as a service to our Country,\" Trump continued. \"Who knows, maybe we will create some NICE NEW LAW!!!\"Trump is presumably referring to the newest book by author Michael Wolff, who chronicled Trump's first term and is back at it again with \"All or Nothing: How Trump Recaptured America,\" which is out this week. Trump complained about the book in an earlier Truth Social post this week. I've asked Wolff and the White House for comment.Complaining about people who say or publish unflattering things about him, threatening to sue them, and actually suing them are nothing new for Trump. And up until recently, it was relatively easy for media companies and journalists to shrug off those threats and threatened suits. Even when Trump did lodge a claim, he rarely won in court.But in Trump 2.0, it is getting harder to dismiss a Trump rant about the media. Since his election last fall, he has already extracted a settlement from Disney and ABC over a defamation suit he filed last year, and he is in discussions with CBS and Paramount to settle another suit, this one over alleged \"election interference\" because he didn't like a \"60 Minutes\" interview with Kamala Harris. He has lodged a similar lawsuit against Gannett and its Des Moines Register.And while Trump's threat to create a new law about defamation seems like a reach — in the US, laws are hard to pass, even when the same party controls the White House, the House, and the Senate — the direction he's headed is worth taking very seriously.That's the underlying message of \"Murder the Truth,\" an upcoming book from New York Times editor David Enrich, which details an ongoing push to tear down the legal underpinnings that support freedom of speech in the US. Enrich is specifically focused on New York Times v. Sullivan, a 1964 Supreme Court ruling that established the basic framework for defamation law in the US: In short, it should be very hard to successfully sue someone because you don't like what they say.As Enrich notes in his book, this was both a landmark ruling and a popular one, cherished by free speech advocates across the political spectrum. But that has started to change in recent years.There are multiple reasons for that, but the main one is Trump himself, Enrich told me on this week's episode of my Channels podcast.On the campaign trail in 2016, Trump mused about wanting to \"open up our libel laws, so when they write purposely negative and horrible and false articles, we can sue them and win lots of money.\" Which, again, was easy to dismiss at the time, for multiple reasons. But Trump kept coming back to the idea — and as we're seeing now, he has already had success on the payments front.Next up: A potential showdown at the Supreme Court, where Justice Clarence Thomas has already said he is eager to revisit NYT v. Sullivan, as has fellow Justice Neil Gorsuch. So it's possible Trump could end up getting his way without passing a new law.There's been a slew of news about Trump and his allies battling with the press in recent weeks — see his fight with the Associated Press over the Gulf of Mexico/Gulf of America, and his dustups with the press corps over who gets to ask questions at press conferences, and who gets to participate in the White House press pool.And those stories unsettle me and other observers. But they're ultimately about access, not about limiting what the press — who, as Elon Musk likes to remind us, is everyone now — actually says, writes, and publishes. Threatening lawsuits, filing lawsuits, and extracting settlements from lawsuits is very much about that. Actually changing the law to make those suits that much more powerful is something that should alarm all of us.","summary":"Donald Trump's lawsuits &mdash; and threats &mdash; are very much about limiting what we're all allowed to say, write, or publish. The Supreme Court could decide.","url":"https://www.businessinsider.com/donald-trump-free-spech-lawsuits-threat-press-media-david-enrich-2025-02","image":"https://i.insider.com/67bf508769253ccddf97a454?width=1200&format=jpeg","video":null,"publish_date":"2025-02-26 17:57:30","author":"Peter Kafka","authors":["Peter Kafka"],"language":"en","category":"politics","source_country":"us","sentiment":0.043},{"id":294657708,"title":"Inside the mind of Trump – a president who talks tough but surrenders to Putin | Letters","text":"Jonathan Freedland’s comments about Donald Trump highlighted two Trumps: the shoot-from-the-hip tough guy and the supplicant at the court of Vladimir Putin (Trump is the world’s greatest showman – and the weakest strongman it has ever seen, 21 February). Isn’t he an example of the authoritarian personality (not to be confused with being authoritarian)?\n\nRupert Wilkinson’s 1972 book The Broken Rebel explored the subject. Some of the characteristics of the authoritarian personality that he listed are submission to a strong, admired authority; aggressive hostility to people in authority whose traits he resents, often as a result of being dominated himself in childhood or to compensate for a sense of weakness; open hostility to outsiders and admiration for his own side; a desire to be strong, to hold power and assert it aggressively; detests ambiguity and uncertainty; craves simple solutions and obvious results.Mary WilkinsonLondon\n\n So abject is Donald Trump’s surrender to Vladimir Putin that in this new counterintuitive world, Keir Starmer’s return from his trip to Washington this week must surely be accompanied by Trump’s vitriolic attack on him as a dictator with no mandate and a suppressor of free speech. Only then will we know that our prime minister has grown a backbone and challenged this abhorrent monstrosity that suffocates any moral order.Tom BrownGore End, Hampshire\n\n As a mediocre chess player, I was challenged to a game by someone much better than me. I beat him by making random, nonsensical moves, which turned out to be a brilliant tactic, because he panicked and became so confused that he conceded. Is this what Donald Trump is attempting in his dealings with Vladimir Putin over Ukraine? If so, he ought to be warned that it only works once. My vanquished opponent quickly realised I had no talent and I never beat him again.Jim HatleyBrighton, East Sussex\n\n Why aren’t we hearing from Joe Biden or Kamala Harris? Surely senior Democrats should be calling out Donald Trump’s shameless lies.Sally BurchLondon\n\n The Trump administration’s minerals deal with Ukraine (Report, 25 February) brings to mind the forced sale of art by Jews fleeing the Nazis. Perhaps in the future it will come to be seen in a similar light.Alison RouthClayhanger, Devon","summary":"Trump has the classic authoritarian personality – not the same as being authoritarian, writes Mary Wilkinson, plus, letters by Tom Brown, Jim Hatley, Sally Burch and Alison Routh\n\nJonathan Freedland’s comments about Donald Trump highlighted two Trumps: the shoot-from-the-hip tough guy and the supplicant at the court of Vladimir Putin (Trump is the world’s greatest showman – and the weakest strongman it has ever seen, 21 February). Isn’t he an example of the authoritarian personality (not to be confused with being authoritarian)?\n\nRupert Wilkinson’s 1972 book The Broken Rebel explored the subject. Some of the characteristics of the authoritarian personality that he listed are submission to a strong, admired authority; aggressive hostility to people in authority whose traits he resents, often as a result of being dominated himself in childhood or to compensate for a sense of weakness; open hostility to outsiders and admiration for his own side; a desire to be strong, to hold power and assert it aggressively; de","url":"https://www.theguardian.com/us-news/2025/feb/26/inside-the-mind-of-trump-a-president-who-talks-tough-but-surrenders-to-putin","image":"https://i.guim.co.uk/img/media/ce7d9a95fa2b005c782dd7b8e7c4e026b5109092/0_174_2943_1766/master/2943.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-02-26 17:56:43","author":"Guardian Staff","authors":["Guardian Staff"],"language":"en","category":"politics","source_country":"us","sentiment":0.083},{"id":294635538,"title":"Controversy Surrounds New Book Alleging Cover Up of Biden’s Health Decline by Well-Known CNN Personality","text":"CNN’s Jake Tapper is facing ridicule for penning a book about the ‘cover-up’ surrounding Joe Biden’s health despite claims he and his network did the same.\n\n‘Original Sin: President Biden’s Decline, Its Cover-up, and His Disastrous Choice to Run Again,’ by Tapper and CNN contributor Alex Thompson, provides an in-depth look at the former president’s ‘serious decline’ and cover-up. \n\nIt was announced Wednesday morning, by the the book’s publisher Penguin Press.\n\nWithin hours, onlookers were expressing ire toward CNN and airing accusations of hypocrisy – as the network advertised the looming May release.\n\nCommenters under CNN’s own story claimed the station had been ‘complicit in the fraud’, as other singled out Tapper specifically. \n\nOthers derisively mocked the State of the Union host, framing his book as a shameless attempt at deflection.\n\nOne reader typed how Tapper ‘needs to go’, weeks after a senior CNN staffer told DailyMail.com the network had laid off 200 of its staff because it had become inundated with workers who do the bare minimum.\n\nAll honed in on the mainstream media Tapper and Thompson said they had successfully unmasked, while seemingly ignoring the pair’s part in the reporting.\n\n Tapper, 55, notably moderated the June 2024 debate that sparked Biden’s decision to bow out.\n\n‘The hopelessly corrupt leftist media, like CNN, was complicit in the fraud. Where is the penalty?,’ wrote one CNN user, after the Warner Discovery-owned website launched a paywall that charges users $3.99 per month in October. \n\n‘Can the Dem self-proclaimed stewards of democracy tell us what unelected person was lurking in the shadows actually exercising the powers of the presidency?’ they asked, pointing to an even deeper conspiracy.\n\n‘So now that “cat is out of the bag” [after] Tapper decides to write a book about it,’ someone else sniped.\n\n‘I wonder if he will include himself and all of the other “news reporters” in the cover-up. \n\n‘Most people could see the decline in Biden, and didn’t go on air to tell millions of viewers that the emperor did have clothes on, when we could see the naked truth,’ they continued, echoing the opinions of countless others aired during the buildup to Biden’s bowing out. \n\n‘Tapper needs to go.’\n\n‘This is rich,’ another griped. ‘Tapper (and the rest of the media and democrats) are SHOCKED to find that Biden was in decline[,] [b]ut is nothing but an attempt to deflect criticism from them for not doing their jobs and lying to the public. \n\n‘What’s even more rich is that the platform they had their puppet president run on was to save Democracy,’ they went on. \n\n‘So, propping up a candidate who was clearly in mental decline… so that the democrats could stay in power is saving Democracy? That’s rich.’ \n\n‘What is the point of this, except to make the writers money?’ another chimed in. ‘No respect for Tapper.’ \n\n‘Most of the media ignored Biden’s decline and didn’t investigate till after the debate,’ a final user remarked.\n\n‘I’m not a Fox News fan but to their credit they were pointing it out for some time.’\n\nOthers offered more of the same on X, reacting to Tapper and Thompson’s joint project and what they perceived as general hypocrisy from the former.\n\n‘It’s a book written by Jake about how Jake covered up Biden’s decline so Jake could write a book,’ one user wrote. Tell me – if Biden had won would this book still be published?’\n\n‘If the book includes the role @jaketapper himself played, critically, I’ll buy it. I’m game to support anyone who can reflect and learn on their mistakes,’ someone else said. ‘Otherwise, hard pass.’\n\n‘Let me get this straight. You are writing a book about something that many in the media covered up,’ a third X user asked.\n\n‘The legacy media was responsible for covering up this issue that you are writing about. This would be like robbing a bank and then writing a book about your heist. \n\n‘If you are writing about what the White House did to cover it up that’s fine,’ they concluded. ‘[B]ut I hope you include the media[‘]s role.’\n\n A synopsis for the book provided in a press release, meanwhile, described the liberal-led plot. It frames Biden, ‘his family, and his senior aides’ as ‘so convinced that only he could beat Trump again, they lied to themselves, allies, and the public.’\n\n‘What you will learn makes President Biden’s decision to run for reelection seem shockingly narcissistic, self-delusional, and reckless – a desperate bet that went bust,’ Penguin stated while announcing the book.’\n\nThe publisher further framed the attempt – fueled by coverage that likely aired on legacy stations like ABC, NBC, and CBS – as ‘part of a larger act of extended public deception that has few precedents.’\n\nTapper – who also moderated a 2020 debate between the then-candidates – added in a separate statement, in which he quoted Nobel Prize winning novelist Toni Morrison.\n\n ‘”If there’s a book that you want to read, but it hasn’t been written yet, then you must write it.”‘\n\n‘That’s what inspired this book,’ the Lead With Jake Tapper host said. ‘We wanted to know more about what we all just lived through. \n\n‘More than 200 interviews later, Alex and I have a much better idea,’ he said, talking up the book’s sourcing.\n\n‘And soon you all will too.’\n\nThe statement was delivered a little more than six months removed from the Atlanta debate that Tapper moderated, which led to accusations that CNN’s lead Washington anchor took it easy on the president.\n\nOne segment in particular sparked such accusations, after Tapper appeared to cut the 81-year-old off in the midst of a rambling, nonsensical answer – one of several later cited after the Democrats’ abrupt turnaround to opting for Kamala Harris.\n\n‘We’d be able to wipe out his debt,’ Biden said at the time of sums incurred by Trump-era tax cuts he said ‘benefited the very wealthy.’\n\n‘We’d be able to help make sure all those things we need to do: child care, elder care, making sure that we continue to strengthen our health care system,’ he continued, stumbling at times over his words.\n\n‘Making sure that we’re able to make every single solitary person eligible for what I’ve been able to do with the… with the COVID, excuse me, with um, dealing with everything we have to with, uh,’ he went on, languishing at this point. \n\n‘Look, if we finally beat Medicare…’\n\nHe proceeded to fully trail off. \n\nThe silence that ensued – and the overall moment – went on to live in infamy, after Tapper’s timely interjection.\n\n‘Thank you President Biden – President Trump?’\n\nWithin days – thanks an array of other viral flubs during the make-or-break faceoff – Biden was bombarded with bipartisan calls to drop out.\n\nHe eventually did, albeit reluctantly, after several weeks.\n\nThat said, Tapper was one of few left-leaning hosts to call attention to Biden’s seemingly waning health in the months leading up the debate, while talents like Thompson gave time to accounts from White House staffers insisting the president was fine.\n\nTapper, moreover, cut off Lara Trump during a tense interview that aired on State of the Union in 2020, during an conversation about the candidate’s ‘cognitive decline.’\n\nThe host – who was reportedly just denied a raise – had just aired a clip of Trump’s daughter-in-law criticizing Biden’s tendency to stutter, calling it evidence of his ‘cognitive decline’.\n\n‘I’m like “Joe, can ya get it out, let’s get the words out, Joe,” You kinda feel bad for him,’ she said – leading Tapper to chide her and point out previous reporting surrounding Biden overcoming a stutter over the years.\n\n‘How do you think it makes little kids with stutters feel when they see you make a comment like that?’ he asked Trump sternly. ‘I think you have absolutely no standing to diagnose somebody’s cognitive decline’. \n\nMeanwhile, the network recently lost embarrassing lawsuit after a correspondent defamed an Afghan war veteran on Tapper’s eponymous show by falsely accusing him of running a ‘black market’ for Afghanistan evacuations and must pay him $5 million damages. \n\nThe network has been battling sagging ratings and vows from conservative lawmakers – including Trump himself – to crack down on what they claim is an unfair liberal bias.\n\nHours before the book was announced, Trump’s Director of National Intelligence Tulsi Gabbard blasted CNN as the CIA’s ‘propaganda arm’, due to its reporting on Elon Musk’s Doge.\n\nThe Trump administration is also behind a federal probe into NBCUniversal’s Comcast, over the company’s dated DEI practices.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCNN&#8217;s Jake Tapper is facing ridicule for penning a book about the&#8230;\n\n\nThis Post: Controversy Surrounds New Book Alleging Cover Up of Biden&#8217;s Health Decline by Well-Known CNN Personality first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/controversy-surrounds-new-book-alleging-cover-up-of-bidens-health-decline-by-well-known-cnn-personality/","image":"https://internewscast.com/wp-content/uploads/2025/02/rewrite-this-title-CNN-star-blasted-for-penning-new-book.jpg","video":null,"publish_date":"2025-02-26 17:44:52","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.582},{"id":294653372,"title":"5 Challenges Facing Keir Starmer As He Walks The Trump Tightrope In Washington","text":"Keir Starmer will be walking a diplomatic tightrope when he meets Donald Trump on Thursday for the most significant meeting between a British prime minister and US president in decades.\n\nThe PM has been at pains not to directly criticise America’s commander-in-chief ever since he defeated Kamala Harris to secure a second term in the White House last November.\n\nNevertheless, it is indisputable that the two men do not see eye to eye on a wide range of issues, from Ukraine and Russia to the Middle East and global trade.\n\nStarmer’s challenge during his 24 hours in Washington DC will be to stand up for his government’s strategic interests while strengthening the “special relationship” between the UK and the United States.\n\nHere, HuffPost UK looks at the main challenges facing the prime minister as he walks the Trump tightrope.\n\nGetting Agreement On Ukraine\n\nOn paper at least, this would appear to be the toughest conversation the two men will have.\n\nTrump has spectacularly blown up the previous consensus among western leaders that Vladimir Putin was solely to blame for the war which has now been raging for three years.\n\nAlthough the president’s desire for peace has been widely welcomed, his suggestion that Ukrainian president Volodymyr Zelenskyy is also culpable for the conflict, and then describing him as a “dictator” for not holding an election has provoked widespread condemnation.\n\nWhile not attacking Trump directly, Starmer has made it very clear that he does not agree with his analysis.\n\nAt PMQs on Wednesday, the PM said: “President Zelenskyy is a democratically-elected leader and suspending elections is precisely what we did in this country when we were fighting in the Second World War.”\n\nStarmer will have to draw on all of his powers of persuasion if he is to convince Trump that Putin is the true villain of the piece, and that any ceasefire agreement must come with a guarantee of US military support to ensure it is remains in place.\n\nA senior No.10 source told HuffPost UK: “Stopping the fighting in Ukraine is not enough. It has to be a lasting peace - which needs US backup.”\n\nDefence And The Future Of Nato\n\nIt is no coincidence that Starmer rushed out his announcement on Tuesday that the UK will start spending 2.5% of gross domestic product (GDP) on defence from 2027 - three years earlier than planned.\n\nThe PM wants to be able to go to the White House with tangible evidence of his government’s commitment to spending more on its military, just as Trump wants the whole of Europe to do.\n\nAlthough the US defence secretary Pete Hegseth insisted a fortnight ago that America remains committed to the Nato alliance, he also stressed that his country would no longer provide Europe with the military protection it has enjoyed for the past 80 years.\n\nWith the threat from Russia growing, Starmer needs to persuade Trump not to completely turn his back on the Europe as he pursues his “America First” strategy.\n\nThe PM told MPs on Wednesday: “Nato is the bedrock of our security. It’s been our most important alliance for many, many years - as important today as it’s ever been. And we build that alliance by working with the US.” \n\nIt’s The Global Economy, Stupid\n\nTrump’s first month back in the Oval Office has not seen him resile from his campaign pledge to impose hefty tariffs on all imports into America.\n\nBoth Mexico and Canada - previously seen as close allies of the USA - were both given last-minute reprieves by the White House after the president announced swingeing levies on the goods they sell to his country. But the threat of a global trade war has not gone away.\n\nThe UK could also find itself in Trump’s crosshairs as his administration has also said it will impose tariffs on countries which impose sales taxes, like VAT.\n\nLord Mandelson, the UK’s newly-installed ambassador to Washington, has been working behind the scenes to ensure Britain gets a carve-out from the White House, and Starmer will need to follow that up with some winning arguments of his own.\n\nThe offer of a second state visit to the UK - including a sleepover at Balmoral Castle with King Charles - may well help to win over Trump, who is half-Scottish and known to be a huge admirer of the Royal Family. \n\nChagos Islands Deal\n\nWhen the government announced last October that it had reached an agreement to hand over sovereignty of the Chagos Islands to Mauritius, the White House could not have been more supportive.\n\nThen President Joe Biden said: “I applaud the historic agreement and conclusion of the negotiations between the Republic of Mauritius and the United Kingdom on the status of the Chagos Archipelago.\n\n“It is a clear demonstration that through diplomacy and partnership, countries can overcome long-standing historical challenges to reach peaceful and mutually beneficial outcomes.”\n\nUnder the deal, Britain will reportedly pay Mauritius £9 billion so that the UK-US military base at Diego Garcia will continue to operate as it does at the moment.\n\nTrump’s re-election threw a giant spanner in the works, however.\n\nDespite Starmer’s best efforts, the deal could not be ratified before Trump - who is known to be sceptical about the agreement because of its security implications - returned to the White House.\n\nUK officials are still optimistic that the president will not veto the deal, but it is yet another tricky topic up for discussion in Washington tomorrow.\n\nPossibly Trump’s most outlandish declaration - and there have been plenty of them - has been his desire to effectively annexe Canada and make it America’s 51st state.\n\nThe Financial Times has reported that senior advisers to Trump even want to remove Canada from the “Five Eyes” intelligence-sharing arrangement, which also includes the UK, Australia and New Zealand.\n\nAt PMQs, Tory MP Simon Hoare called on Starmer to make clear the UK’s opposition to his comments.\n\nHe said: “I hope the prime minister knows that when he does travel to Washington to meet the former leader of the free world, he does so with the hopes and prayers of this house and the country.\n\n“While Ukraine will clearly dominate, will the prime minister undertake to raise with President Trump that Canada is a valued, respected and much-loved member of both Nato and our Commonwealth, and that this childish nonsense of a 51st state should be called out by the prime minister for what it is.”\n\nStarmer replied: “The UK and Canada are close allies and have been for a very long time, with a partnership based on a shared history and a shared set of values, and a determination to be an active force for good in the world.\n\n“We work closely with them on issues of the Commonwealth, on Nato and of course ‘Five Eyes’ intelligence sharing and we will work to strengthen that relationship.”\n\nHis comments will be welcomed by outgoing Canadian prime minister Justin Trudeau, but probably not by Donald Trump.","summary":"Donald Trump and Keir StarmerKeir Starmer will be walking a diplomatic tightrope when he meets Donald Trump on Thursday for the most significant meeting between a British prime minister and US president in decades.\n\nThe PM has been at pains not to directly criticise America’s commander-in-chief ever since he defeated Kamala Harris to secure a second term in the White House last November.\n\nNevertheless, it is indisputable that the two men do not see eye to eye on a wide range of issues, from Ukraine and Russia to the Middle East and global trade.\n\nStarmer’s challenge during his 24 hours in Washington DC will be to stand up for his government’s strategic interests while strengthening the “special relationship” between the UK and the United States.\n\nHere, HuffPost UK looks at the main challenges facing the prime minister as he walks the Trump tightrope.\n\n\n\nGetting Agreement On UkraineOn paper at least, this would appear to be the toughest conversation the two men will have.\n\nTrump has spectacularly blown up the ","url":"https://www.huffingtonpost.co.uk/entry/5-challenges-facing-keir-starmer-as-he-walks-the-trump-tightrope_uk_67bf28c2e4b0d509934afbca","image":"https://img.huffingtonpost.com/asset/67b5c17b1600001400e79cf9.jpeg?cache=U0YkHstkLm&ops=1778_1000","video":null,"publish_date":"2025-02-26 17:26:11","author":"Kevin Schofield","authors":["Kevin Schofield"],"language":"en","category":"politics","source_country":"gb","sentiment":0.254},{"id":294631900,"title":"Who Is the Anonymous Data Expert Telling Elon Which Cuts to Make?","text":"Since Elon Musk’s so-called Department of Government Efficiency (DOGE) swept into Washington last month, an anonymous X account called DataRepublican has taken the government demolition crew’s supporters by storm. \n\n The account, and its alleged findings of mismanaged government agency spending, has been shared by Musk often, as well as Utah Senator Mike Lee. The account is followed by Vice President J.D. Vance.\n\n The woman behind the account, who’s described herself as a Deaf software engineer, has appeared anonymously on NewsNation, and on several right-wing programs this month, like Glenn Beck’s Blaze Media show, wearing sunglasses and a hooded sweatshirt to obscure her identity, even as she’s billed as a government spending expert. \n\n The account accused neoconservative pundit Bill Kristol of being a “deep state agent,” asserting his nonprofit, the Defending Democracy Together, is an “indirect beneficiary of USAID,” the U.S. Agency for International Development, a government agency that Musk moved to shutter. \n\n The argument here was, in effect, that USAID gave money to a nonprofit donor-advised fund that gave some money to another nonprofit that then gave some money to Kristol’s organization — so he’s then benefiting from USAID spending. Donations can’t be traced this way, and this basic misunderstanding of how donor-advised funds work led several pundits to analyze DataRepublican’s claims, with one dubbing it the new “Twitter Files.”\n\n But DataRepublican’s fans think her work is genius. Nicole Shanahan, who was Robert F. Kennedy Jr.’s 2024 vice presidential nominee and financier, recently interviewed DataRepublican on her show, telling her: “While you are not necessarily in this administration, what you have done is extraordinary.” \n\n Conservative host Steve Deace called her a “genius software engineer,” adding “we want to keep her personal identity secure so she is free from corporate media types who would love to do something to intimidate her.”\n\n So who is this government information data guru? \n\n The woman behind the account shared her full name Tuesday evening, after a man on Facebook posted that he knew her from the Deaf community, prompting DataRepublican to confirm her identity as Jennica Pounds.\n\n Pounds is indeed a Deaf, female software engineer from Utah, who until this week worked as a senior software engineer at an AI lending company called Upstart, a company that has tangled with regulations from the Consumer Federal Protection Bureau (CFPB) for years. \n\n Pounds wrote on Tuesday, “I recently resigned from my job to pursue DOGE-adjacent efforts full-time.” \n\n But versions of Pounds’ LinkedIn viewed by Rolling Stone as recently as late last week showed she listed herself as a current employee of Upstart. Some time this week, the LinkedIn was edited to show a February end to her Upstart tenure.\n\n Earlier this month, Musk famously tweeted “CFPB RIP” as DOGE moved to gut the agency and the administration paused its work\n\n Replying to Musk’s post, DataRepublican tagged Senator Elizabeth Warren (the CFPB was Warren’s brainchild), writing: “Hey @ewarren look at this.”\n\n Musk has quoted DataRepublican on X at least 24 times over the last three weeks, telling people to follow the account, and replying “noted” to her claim on Jan. 21 that she found “a quick billion” of federal spending for DOGE to cut. \n\n Her suggested cuts were funds going to groups like Global Refuge, a faith-based organization that provides safety and support services to immigrants, migrant refugees and asylum-seekers around the world. Two weeks later, Musk declared at 3:14 a.m. on a Sunday that DOGE was “rapidly shutting down” supposedly “illegal payments” to Global Refuge.\n\n A newly-launched corresponding website DataRepublican.com lets users search for charities and nonprofit officers. A false claim that Jeffrey Epstein was paid by USAID appears to have started with people using the website and mixing up the notorious sex offender with another Jeffrey Epstein.\n\n On Friday, DataRepublican announced she’s adding an ActBlue donor search element to the website, which Musk then amplified, quoting her tweet and saying “interesting.”\n\n At Upstart, Pounds was a Senior Distinguished Machine Learning Engineer since 2023, a high-level position at the publicly-traded San Mateo, California-based company, where she works remotely.\n\n A software engineer who has knowledge of the company told Rolling Stone that Pounds’ position was one of the highest levels an engineer could reach there.\n\n Upstart received Series A funding and additional later funding from the far-right billionaire Peter Thiel’s Founders Fund, and co-founder Paul Gu was a Thiel Fellow before launching Upstart in 2012. Thiel, of course, founded PayPal with Musk. \n\n Upstart has a complicated relationship with CFPB regulations. The company received a special designation from the CFPB in 2017, during Trump’s first administration, allowing it special regulatory treatment by immunizing the lender from being charged with fair lending law violations with respect to its underwriting algorithm. \n\n Upstart was the first company to receive such a letter. The no-action status was renewed in November 2020, and the company then immediately closed its first public offering and began trading on Nasdaq.\n\n In February 2020, Sens. Warren and Cory Booker, and then-Sens. Kamala Harris and Robert Menendez, wrote to the company, expressing concern about the company’s adherence to fair lending laws and asking for insight into how the company made credit determinations.\n\n But in 2022, the company asked for its no-action status to be terminated, the bureau wrote, rather than have the CFPB review “significant changes to its artificial intelligence model,” as the CFPB required, “effectively ending the company’s special regulatory status, and allowing it to be able to make changes to its model without need for CFPB review and approval.”\n\n Pounds’ job at Upstart involved working on that AI model, two sources say, although she started with Upstart a year later, in May 2023.\n\n Upstart’s CEO and cofounder Dave Girouard participated in the U.S. Senate AI Insight Forum in November 2023, telling senators that his AI lending company is an example of AI working well without added legislation.\n\n “In 2012, before even launching the company, we naively marched up to the San Francisco office of the Consumer Financial Protection Bureau (CFPB) and introduced ourselves,” he stated. “This was not one of the new ‘Offices of Innovation’ — this was the local enforcement team. But what did we know? We were convinced that we were the good guys and were committed to innovating within the law.” \n\n Later that month, Upstart was subpoenaed by the Securities and Exchange Commission regarding disclosures related to use of its artificial intelligence models and loans, according to the company’s quarterly report. \n\n Before co-founding Upstart, Girouard was President of Enterprise at Google. \n\n He posted on X in December about the CFPB looking to AI for a new lending model, joking, “Hath hell frozen over?” \n\n “It costs NYC 8-12X more than EUROPEAN cities to build a mile of subway! We need DOGE for every state and city gov.,” he posted in January.\n\n In a statement to Rolling Stone, Pounds wrote: “My former employer has nothing to do with my activities. Leave them out of it.”\n\n Girouard and Gu did not immediately reply to comment.\n\n Before becoming DOGE’s favorite anonymous expert, Pounds ran a Github that analyzed election data in Florida and North Carolina, two states she has lived in. Prior to her role at Upstart, Pounds worked at Snap Inc., eBay and Amazon.\n\n Pounds and her husband, who worked for a decade at the National Oceanic and Atmospheric Administration, also own a distillery in Salt Lake City. \n\n Pounds registered a Utah company called Redata, LLC in 2020. The couple purchased a McMansion with an indoor pool and movie theater in 2021.\n\n The DataRepublican site has a donations section, with options for one-time and recurring donations: “I’m @DataRepublican, working hard to bring you the most transparent and insightful data on government spending and contracts. If you find value in what I do, would you consider supporting financially? It helps me continue this journey, ensuring that I can keep providing these insights independently. Every little bit supports the mission, and I truly appreciate your consideration.”\n\n DataRepublican posted this week that “a generous benefactor has reached out and offered to cover AI expenses,” and she is undergoing a “background check” as she seeks to work with DOGE.\n\n After Pounds posted about what she called her “doxxing,” Trump’s interim U.S. Attorney for the District of Columbia, Ed Martin, replied to her: “We are here for you, Jennica, just like you are here for America when we need you most. It is wrong and illegal to threaten anyone, and we will not tolerate a threat to a federal worker.”\n\n Martin, who recently described himself as “President Trump’s lawyer,” has pledged to use his office to “protect DOGE” and “hold accountable those who threaten workers.” \n\n The threats Martin referenced regarding Pounds were not immediately clear.\n\n “I join your mother @data_republican in awe and appreciation of your excellent work,” Martin added. “We got your back.”","summary":"Conservatives have used DataRepublican to spread misinformation about federal agencies. She’s been working at a tech firm that’s battled the CFPB","url":"https://www.rollingstone.com/politics/politics-features/elon-musk-data-republican-anonymous-data-expert-doge-tech-1235280817/","image":"https://www.rollingstone.com/wp-content/uploads/2025/02/elon-musk-favorite-anon-data-expert.jpg","video":null,"publish_date":"2025-02-26 17:19:25","author":"Andrew Perez,Jacqueline Sweet","authors":["Andrew Perez","Jacqueline Sweet"],"language":"en","source_country":"us","sentiment":-0.194},{"id":294661700,"title":"Washington Post owner Jeff Bezos says opinion pages will defend free market and 'personal liberties' (Business)","text":"The billionaire owner of The Washington Post, Jeff Bezos, narrowed the topics covered by its opinion section Wednesday to defending personal liberties and the free market, a pivot away from the traditional broad focus and prompting the news outlet’s opinion editor to resign.\n\nBezos, who also owns Amazon, said on X that “viewpoints opposing those pillars will be left to be published by others.”\n\nThe move was received by some as an indication that Bezos is making decisions for the Post with an eye toward avoiding retaliation by President Donald Trump. Bezos, though, cast the change as a modernization from the days when newspapers offered opinions on a broad range of topics. Now, he said, “the internet does that job.”\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” Bezos wrote in his post, adding that the new topics “are right for America. I also believe that these viewpoints are underserved in the current market of ideas and news opinion.\" Opinions editor David Shipley resigned rather than lead the shift, Bezos said.\n\n“I suggested to him that if the answer wasn’t `hell yes,' then it had to be `no.' After careful consideration, David decided to step away,” Bezos wrote.\n\nThe pivot echoes the Wall Street Journal's editorial page banner: “free markets, free people.”\n\nBezos' move Wednesday was the latest in a series of Bezos' changes to the legacy news outlet, an award-winning organization that broke the Watergate scandal and whose motto is, “Democracy Dies in Darkness.”\n\nWeeks before the November election, Bezos announced that the Post would not endorse a presidential candidate, sparking a wave of resignations and thousands of subscription cancellations. The Post’s editorial staff had been prepared to endorse Democrat Kamala Harris before publisher Will Lewis wrote instead that it would be better for readers to make up their own minds. Bezos defended the decision by saying in “a note from our owner” that editorial endorsements create a perception of bias at a time many Americans don’t believe the media, and do nothing to tip the scales of an election.\n\nIn January, cartoonist Ann Telnaes quit after an editor rejected her sketch of Bezos and other media executives bowing before Trump — after The Washington Post editor was seen with other executives at Trump’s Florida club Mar-a-Lago.\n\nBezos bought the broadsheet and other newspapers in 2013 for $250 million in a surprise move viewed as a demonstration of how the Internet has created winners and losers and transformed the media landscape.\n\nThe narrowing of topics will be obvious. On the Post's homepage Wednesday afternoon, headlines linking to opinion material included \"Your showerhead is lying to you\" and “What we learned about politics by talking about ... wolves.”","summary":"The billionaire owner of The Washington Post, Jeff Bezos, narrowed the topics covered by its opinion section Wednesday to defending personal liberties and the free market, a pivot away from the traditional broad focus and prompting the news outlet&amp;rsquo;s opinion editor to resign. Bezos, who also ow...","url":"https://www.castanet.net/news/Business/535441/Washington-Post-owner-Jeff-Bezos-says-opinion-pages-will-defend-free-market-and-personal-liberties","image":"https://www.castanet.net/content/2025/2/164b2386ac6d27ce0e8714ba3e5b04507dde51a9826a5ca6b3d86b07a00dc646_p4149722.jpg","video":null,"publish_date":"2025-02-26 17:18:00","author":"Laurie Kellman,The Canadian Press","authors":["Laurie Kellman","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.201},{"id":294627930,"title":"Washington Post staffers outraged at Jeff Bezos’ stunning plan for opinion pages that prompted top editor to quit","text":"The Washington Post’s billionaire owner Jeff Bezos left many of his paper’s staffers enraged on Wednesday after he announced a shocking new direction for the paper’s opinion content that resulted in a top editor resigning.\n\nBezos’ latest mandate comes amid concerns among the publication’s journalists that the Amazon founder is currying favor with Donald Trump by softening the Post’s coverage of the anti-media president, which began when he blocked the editorial board’s endorsement of then-Vice President Kamala Harris last October. \n\nIn a memo sent to staff Wednesday morning, Bezos noted that he was letting them “know about a change coming to our opinion pages,” which revolved around what topics columnists would now be allowed to write about.\n\n“We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,” he noted. “We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.”\n\nBezos added: “There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader’s doorstep every morning a broad-based opinion section that sought to cover all views. Today, the internet does that job.”\n\nBezos added that opinion editor David Shipley did not embrace this decision to focus on the two topics, prompting his resignation. Shipley was the editor who decided not to publish an editorial cartoon showing Bezos on bended knee before Trump, prompting the cartoonist to quit.\n\n“I offered David Shipley, whom I greatly admire, the opportunity to lead this new chapter. I suggested to him that if the answer wasn’t ‘hell yes,’ then it had to be ‘no.’ After careful consideration, David decided to step away,” Bezos stated. “This is a significant shift, it won’t be easy, and it will require 100% commitment — I respect his decision. We’ll be searching for a new Opinion Editor to own this new direction.”\n\nHe concluded: “I’m confident that free markets and personal liberties are right for America. I also believe these viewpoints are underserved in the current market of ideas and news opinion. I’m excited for us together to fill that void.”\n\nIn a separate statement, embattled publisher Will Lewis insisted to the staff that Bezos’ opinion mandate had nothing to do with partisanship. “This is not about siding with any political party. This is about being crystal clear about what we stand for as a newspaper,” Lewis wrote.\n\nNeedless to say, especially since the paper’s journalists have been begging Bezos to visit the newsroom and restore “trust that has been lost” under his watch, the ultra-wealthy businessman’s sudden and shocking mandate was not well received.\n\n“Massive encroachment by Jeff Bezos into The Washington Post’s opinion section today - makes clear dissenting views will not be published or tolerated there,” Washington Post chief economics reporter Jeff Stein tweeted on Wednesday.\n\n“I still have not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the news side I will be quitting immediately and letting you know,” he added.\n\nOther Post staffers told The Independent that the announcement was “being received badly” by the newsroom, with many reporters expressing their “anger” at Bezos’ further meddling in the editorial process of the paper.\n\n“I have a feeling this isn’t gonna bring back the 250K subs,” one reporter wrote in the Post’s Slack channel, referencing the quarter-million readers that canceled their subscriptions after Bezos pulled the Harris endorsement days before the 2024 election. \n\nBesides the lost subscriptions, the spiked endorsement also led to several editorial board members resigning in protest, while a number of star journalists and editors left for other opportunities. At the same time, the beleaguered paper recently laid off four percent of the staff, mostly from the business and public relations divisions. \n\nMeanwhile, Washington Post video producer Dave Jorgenson – who is the face of the paper’s YouTube and TikTok accounts – took to his Bluesky account on Wednesday to repost a video he made a few months ago about “why some billionaires are going soft on Trump.”\n\n“Using my ‘personal liberties’ to repost this,” Jorgenson noted, adding that followers could check out his personal YouTube and social media channels going forward. “Echoing Jeff (Stein), if Bezos interferes with my work on the news side - I'm out,” he added.\n\nMilitary affair reporter Dan Lamonthe reiterated that the paper’s “hard-news” division would continue to plug along and keep reporting on the important stories of the day. “As a hard-news journalist at The Washington Post, there's no shortage of important news to cover. I will keep digging in. As I've stated before: Nothing changes. We ask hard questions and hold those in power to account. That's the job, whether those in power like it or not,” he tweeted. \n\nThe Independent has reached out to the Post for comment.\n\nWhile staffers are outraged over this move, MAGA world was elated over Bezo’s new mandate for the Post’s opinion pages.\n\n“He says that viewpoints which disagree with those positions will be written elsewhere. David Shipley has stepped down as the paper’s opinion editor as a result of the shift,” far-right provacatuer Charlie Kirk posted on X (formerly Twitter.) \n\n“Bezos also affirms that he is “of America” and wants to celebrate these uniquely American values that have lead to innovation and prosperity. He believes these viewpoints are underserved in the current newspaper environment (he’s right),” he continued. “Good! The culture is changing rapidly for the better.”\n\nDOGE chief and “first buddy” Elon Musk, one of the only men in the world wealthier than Bezos, also expressed his explicit approval. \n\n“Bravo,” he tweeted.","summary":"“I have a feeling this isn’t gonna bring back the 250K subs,” one Post reporter wrote in the paper’s Slack channel on Wednesday.","url":"https://www.independent.co.uk/news/world/americas/us-politics/jeff-bezos-washington-post-opinion-section-b2705226.html","image":"https://static.independent.co.uk/2025/01/20/17/newFile.jpg?width=1200","video":null,"publish_date":"2025-02-26 17:02:33","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.028},{"id":294624008,"title":"Forget handshakes, make amends & find common ground: My advice to Starmer ahead of Trump visit, from an ex-US official","text":"MY first bit of advice to Prime Minister Keir Starmer would be not to worry about winning the \"handshake war\" with President Donald J. Trump when he meets him at the White House. \n\nFrench President Macron just lost and look at all the nice things Trump then said about France during their meeting in the Oval Office.\n\nBesides, even if you win...you lose. \n\nDo you really want to undermine the critical relationship between Britain and the United States because you bested Trump in a power handshake?\n\nReasoned diplomacy and multiple treaties, defence contracts, and economic initiatives scream out for you to throw the contest for the betterment of your fellow citizens back home.\n\nNext, before you broach any diplomatic or international relations issues, you have some fences to mend with Trump. \n\nThree which come to mind are these: First, you allow approximately one hundred members of the Labour Party to fly to the United States to actively campaign for Vice President Kamala Harris.\n\nIn case no one on your team told you, that really angered the President. \n\nHe and his team referred to it as \"foreign election interference.\" \n\nNext, we have Labour's Foreign Secretary David Lammy once shockingly labelling Trump a \"neo-Nazi-sympathizing sociopath.\" \n\nNot surprisingly, Trump and his team were not thrilled with that description from a \"professional\" diplomat in the Starmer government. \n\nLast -- Leaving London Mayor Sadiq Khan and his many insults of Trump aside -- we have Lord Peter Mandelson -- your current ambassador to the United States -- who once openly called Trump a danger to the world.\n\nRegardless if your diplomats need a refresher course in diplomacy or not, you can be assured that Trump's team in the White House will have reminded the President of these comments. \n\nBlame it all on bad curry, a total eclipse of the Sun, or the far-left all-in-one excuse/accusation of \"Russian interference,\" but acknowledge it all to be regrettable mistakes and then move on instantly to common ground.\n\nBefore you walk into the Oval Office, have several at your mental fingertips ready to discuss.\n\nLeaving poisonous and self-destructive partisan politics outside the door of the Oval Office, you will be reminded or instantly discover that President Trump truly likes people and rarely holds a grudge. \n\nOne of the latest examples of that is Trump joking and laughing with former President Barack Obama at the services for Jimmy Carter. \n\nTrump is convinced that Obama was out to destroy him and yet...water under the bridge in so many ways when they sat together.\n\nRemember also, that Trump's mother was from Scotland and he truly does have a soft spot for the United Kingdom, its traditions, and the Royal Family. \n\nMore than that, he respects you. As he recently said of you while aboard Air Force One: \"I get along with him well. I like him a lot. He's liberal, which is a bit different from me, but I think he's a very good person and I think he's done a very good job thus far.\"\n\nLike and respect Trump back. \n\nTo break the ice with the President maybe ask him if he sees much of America's and the world's problems through the lens of a highly successful businessman. \n\nWhat are the advantages of that? What are the disadvantages? \n\nAs you ask, keep in mind that in Joe Biden, Businessman Trump was replacing someone who had been a career politician for over half a century. \n\nHas Trump become the template for the \"Un-Politician?\" Ask him.\n\nNext, with regard to one of the President's most persistent criticisms of NATO, point out that you, as Prime Minister, did just lift defence spending to 2.5%. From there, move on to Ukraine.\n\nRemember that just a few short days ago, you said during a speech at an international summit on supporting Ukraine in Kyiv that: \"President Trump has changed the global conversation over the last few weeks, and it has created an opportunity. Now we must get the fundamentals right.\"\n\nLean into that positive regarding Trump. He has created an \"opportunity.\" \n\nThank him for doing so and then speak to the common ground the two of you do share regarding that horrific and needless war.\n\nLeave the details to the specialists from both our nations.\n\nNext, remind the President that a strong and secure Europe strengthens the United States while acting as one more buffer against China and Russia. \n\nAnd that the key to securing Europe is to build upon the special and crucial relationship between our two nations.\n\nIgnore the haters from both nations and speak from your heart to Trump.\n\nThat will go a long way toward getting the friendship back on track.\n\nDouglas MacKinnon is a former White House and Pentagon official and author of the book: The 56 – Liberty Lessons from those who risked all to sign The Declaration of Independence.","summary":"","url":"https://www.thesun.co.uk/news/33580850/keir-starmer-donald-trump-ukraine-russia/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/02/newspress-collage-tydm967wn-1740588417536.jpg?1740588546&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-02-26 17:01:29","author":"Douglas Mackinnon,Sayan Bose","authors":["Douglas Mackinnon","Sayan Bose"],"language":"en","category":"politics","source_country":"gb","sentiment":0.013},{"id":294633298,"title":"Gavin Newsom launches another podcast featuring architects of ‘MAGA movement’","text":"The announcement came as Newsom is a year away from reaching his two-term limit after he survived a recall election in 2021. Following the fires in Southern California, Newsom was again served recall papers.\n\n“I’m Gavin Newsom. And it’s time to have a conversation. It’s time to have honest discussions with people that agree AND disagree with us,” the podcast intro says. “It’s time to answer the hard questions and be open to criticism and debate without demeaning or dehumanizing one other.”\n\nI’m Gavin Newsom is the governor’s latest podcast after he launched Politickin’ with former NFL player Marshawn Lynch in July 2024. The last Politickin’ episode came out over a week ago and featured a conversation with comedian Chelsea Handler. It was recorded before the fires sparked in Southern California.\n\n“Real conversations. What’s going on with the cost of eggs? What are the impacts — real impacts — to you around tariffs? What power does an executive order really have? What’s really going on inside of DOGE?” Newsom said in a promotional video Wednesday. “In the first few weeks, we’re going to be sitting down with some of the biggest leaders and architects of the MAGA movement.” \n\nThe first episode has yet to be released, as the podcast only features a trailer as of Wednesday morning. \n\n“I’d rather pour acid in my ears than listen to a Gavin Newsom podcast,” former California congressional candidate John Dennis wrote on X.\n\nKAREN BASS ADMITS SHE FELT ‘TERRIBLE NOT BEING HERE FOR MY CITY’ AMID FIRES\n\n“I’m sure his 25 loyal listeners will tune in to each episode. Also, which governors do you know have their own podcasts? They don’t because they are busy doing their jobs…unlike Gavin Newsom,” the conservative group Log Cabin LA wrote on X.\n\nRegarding Newsom’s successor, former Vice President Kamala Harris appears to be in the lead. A poll from Emerson College Polling/Inside California Politics/the Hill reported that 57% of primary voters in Harris’s party would vote for her in a hypothetical election. Harris is trailed by former Democratic California Rep. Katie Porter at 9%, who is similarly fresh from a failed campaign in which she lost to Sen. Adam Schiff (D-CA). Nearly a fifth, 17%, remain undecided.","summary":"Gov. Gavin Newsom (D-CA) announced his newest venture Wednesday — a podcast dedicated to &#8220;honest discussions with people that agree and disagree with us.&#8221; The announcement came as Newsom is a year away from reaching his two-term limit after he survived a recall election in 2021. Following the fires in Southern California, Newsom was again served recall papers. &#8220;I’m [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3330726/gavin-newsom-launches-podcast-featuring-architects-maga-movement/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/newsom-exec.webp","video":null,"publish_date":"2025-02-26 16:52:24","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","source_country":"US","sentiment":-0.088},{"id":294639794,"title":"Billionaire Bezos announces restrictions on Washington Post opinion coverage","text":"The Washington Post will no longer run views opposed to \"personal liberties and free markets\" on its opinion pages, its owner Jeff Bezos announced on Wednesday, the latest intervention by the billionaire in the major US paper's editorial operations.\n\n\"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,\" wrote Bezos on social media platform X.\n\n\"We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.\"\n\nThe move, a major break from the norm on opinion pages at the Post and at most credible news media organizations worldwide, comes as US media face increasing threats to their freedom and accusations of bias from President Donald Trump.\n\nIn October, Bezos sparked controversy by blocking the Post's planned endorsement of Democratic Vice President Kamala Harris for the 2024 presidential election, triggering newsroom protests and subscriber cancellations.\n\nAnd in January, an award-winning political cartoonist for the newspaper announced her resignation after a cartoon depicting Bezos groveling before Trump was rejected.\n\nAt the time, editorial page editor David Shipley defended the decision, saying it was made to avoid repeated coverage on the same topic.\n\nOn Wednesday, Bezos announced Shipley would be leaving his post because he had not signed on to the new opinion pages policy.\n\n\"I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no,'\" said Bezos.\n\nOther Post staffers also expressed their concern.\n\n\"Massive encroachment by Jeff Bezos into The Washington Post's opinion section today -- makes clear dissenting views will not be published or tolerated there,\" said Jeff Stein, the paper's chief economics correspondent, on X.\n\nStein added that he had \"not felt encroachment on my journalism on the news side of coverage, but if Bezos tries interfering with the news side I will be quitting immediately.\"\n\nAmazon owner and world's third-richest man Bezos, along with other US tech moguls, have appeared increasingly close to Trump since his election last year.\n\nBezos was among a group of tech billionaires who were given prime positions at Trump's inauguration, and he visited the Republican at his Mar-a-Lago estate during the transition period.\n\nIn his post on Wednesday, Bezos said the Post did not have to provide opposing views because \"the internet does that job.\"\n\nSource: AFP","summary":"The Washington Post will no longer run views opposed to \"personal liberties and free markets\" on its opinion pages, its owner Jeff Bezos announced on Wednesday, the latest intervention by the billionaire in the major US paper's editorial operations.","url":"https://yen.com.gh/business-economy/278291-billionaire-bezos-announces-restrictions-washington-post-opinion-coverage/","image":"https://cdn.yen.com.gh/images/1200x675/06d9677025160142.jpeg?v=1","video":null,"publish_date":"2025-02-26 16:43:03","author":"Samuel Obour","authors":["Samuel Obour"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.071},{"id":294626138,"title":"YouTube viewers ‘do not care The Rest Is Politics looks like high school show’","text":"A YouTube boss has said that the low production values of the live version of The Rest Is Politics podcast are not of concern to audiences who are OK watching something that looks like a “high school” TV show.\n\nThe popular podcast is fronted by Alastair Campbell, former Downing Street director of communications and strategy, and ex-Tory MP Rory Stewart.\n\nPedro Pina, vice president of YouTube EMEA, told Wednesday’s session of industry event MIP London at The Savoy hotel that the podcast is “one of the most successful, I think it’s the number one podcast in this country, and we have a great partnership on YouTube”.\n\nHe added: “When you look at their podcast, their live transmission, which was on YouTube (covering) the US election… the production values was one of those (it) feels like a high school put together (with) a couple of tables, and yet the viewership was tremendous.\n\n“And so guess what? The viewers determine the production values that they’re prepared to accept.”\n\nHowever, Mr Pina did say later that “a lot of creators are moving for 4k production, 5k production”, and content “organised by seasons, by episodes”.\n\nThe Rest Is Politics US election YouTube live show saw guests including former White House spokesman Anthony Scaramucci, historian Dominic Sandbrook and columnist Marina Hyde from other Goalhanger offerings contribute.\n\nA clip of Mr Stewart’s disappointment after he wrongly predicted that Democratic nominee Kamala Harris would beat Republican nominee Donald Trump went viral.\n\nThe podcast also had episodes broadcast on Channel 4 before the 2024 UK general election, and has picked up the political podcast of the year award at the Political Podcast Awards and the podcast champion gong at the British Podcast Awards.\n\nThe show is produced by Goalhanger Podcasts, co-founded by Gary Lineker, and normally releases two episodes a week.\n\nMr Pina said that “the screen with the highest growth for us is connected TV in the living room”, and not a computer or a phone where YouTube flourished previously.\n\nHe added: “So this idea of teenagers closed in their bedrooms with their mobile phones was translated during Covid into ‘Hey, come to the living room and share with your parents’.\n\n“They taught their parents to actually watch YouTube because that’s their favourite viewing.”\n\nMr Pina said “there’s a lot of misconceptions about YouTube, there’s a lot of fears associated to what YouTube represents”, and the Google video hosting platform has “no interest whatsoever in producing our own content”.\n\nHe added: “We’ve tried it a little bit. We did a few experiments. Those who followed us may have seen something called YouTube originals, at some point in time… we are known for, let’s try, fail fast and move on.”\n\nGiving an example of how they work, Mr Pina said that the deal with Portuguese footballer Cristiano Ronaldo for a YouTube account – which shares advertising revenue – is the “same that we have with the kid that started the first video yesterday”.\n\nSpeaking about the move towards YouTube hosting Channel 4 content, including full episodes of TV shows, Mr Pina said they provide “extra reach in this country, and extra reach outside”, that “would not be monetised”.\n\nHe added that “one of the soft powers of (the) UK has been culture”, and called it “the envy of the world when it comes to fiction production”.\n\nMr Pina said YouTube gives “access to the world” through tools that break down “language barriers”, which he added “very soon will be done by AI, where you will be able to put content out there in any language you want and reach a global audience”.","summary":"The podcast is fronted by Alastair Campbell, former Downing Street director of communications and strategy, and ex-Tory MP Rory Stewart.","url":"https://www.standard.co.uk/news/uk/youtube-rory-stewart-downing-street-alastair-campbell-kamala-harris-b1213475.html","image":"https://static.standard.co.uk/2025/02/26/16/4aadea85a399f9b343506b4efb75771bY29udGVudHNlYXJjaGFwaSwxNzQwNjY5MDY3-2.71797865.jpg?width=1200","video":null,"publish_date":"2025-02-26 16:41:44","author":"Charlotte McLaughlin","authors":["Charlotte McLaughlin"],"language":"en","source_country":"gb","sentiment":0.214},{"id":294637268,"title":"Fat Joe praises Trump healthcare executive order after backing Harris in 2024","text":"Rapper Fat Joe, who backed then-Vice President Kamala Harris for president last year, hailed President Donald Trump's move to sign an executive order on healthcare price transparency. But in his statement about the order, the entertainer did not specifically mention Trump by name. \"Today marks a brighter future in America now that an executive order on healthcare price transparency has been signed,\" Fat Joe declared in Tuesday posts on social media. TRUMP SIGNS EXECUTIVE ORDER TO MAKE HEALTHCARE PRICES ‘TRANSPARENT’ \"This issue was never about politics for me, it was about doing the right thing for every patient, worker, employer, and union across the country. The American healthcare system had been robbing all of us by hiding their prices and charging whatever they wanted. It was un-American and unethical. Now, we can celebrate this huge victory and a big thank you to @PowertoPatnts and all that supported\" Trump's order seeks to bolster an order he previously issued during his first term. CHRIS ‘MAD DOG’ RUSSO RIPS ‘NONSENSE’ ICE CUBE, FAT JOE WORLD SERIES PERFORMANCES: ‘GIVE ME A BASEBALL GAME!’ \"Pursuant to Executive Order 13877 of June 24, 2019 (Improving Price and Quality Transparency in American Healthcare to Put Patients First), my Administration issued paradigm-shifting regulations to put patients first by requiring hospitals and health plans to deliver meaningful price information to the American people,\" Trump's new order declares. He asserted that former President Joe Biden's \"Administration failed to take sufficient steps to fully enforce my Administration’s requirement that would end the opaque nature of drug prices by ensuring health plans publicly post the true prices they pay for prescription drugs.\" The order calls for the Treasury, Labor, and Health and Human Services secretaries to seek to swiftly \"implement and enforce the healthcare price transparency regulations issued pursuant to Executive Order 13877 …\" 5 MISTAKES THAT DOOMED KAMALA HARRIS' CAMPAIGN AGAINST TRUMP CLICK HERE TO GET THE FOX NEWS APP Trump's Labor Secretary pick, former Rep. Lori Chavez-DeRemer, has not yet been confirmed by the Senate.","summary":"Rapper Fat Joe celebrates Trump executive order on healthcare price transparency after supporting then-Vice President Kamala Harris for president in 2024.","url":"https://www.foxnews.com/politics/fat-joe-praises-trump-healthcare-executive-order-after-backing-harris-2024","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/fat-joe.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-26 16:38:16","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","source_country":"us","sentiment":-0.026},{"id":294614606,"title":"Jeff Bezos sparks OUTRAGE with overhaul of Washington Post opinion page","text":"Jeff Bezos has sparked outrage after announcing plans to overhaul the Washington Post's Opinion page to focus solely on support for, 'personal liberties and free markets'.\n\nThe Amazon boss, who owns the outlet, said he is ditching a traditional, 'broad-based opinion section that sought to cover all views'.\n\nHe has also axed previous opinion editor David Shipley after he declined to get on board with the new regime.\n\n'We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,' Bezos wrote on X on Wednesday.\n\n'We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others. \n\n'There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views. Today, the internet does that job.' \n\nScores of readers have already began angrily cancelling their subscription in protest over the move.\n\nIt comes after Bezos prompted fury among his liberal staff after he ditched a planned endorsement for Kamala Harris before last year's election. \n\nHowever the decision has been lauded by Elon Musk, who wrote 'Bravo Jeff Bezos' above a post on X about the news.\n\n'I am of America and for America, and proud to be so,' Bezos added. 'Our country did not get here by being typical. \n\n'And a big part of America's success has been freedom in the economic realm and everywhere else. Freedom is ethical — it minimizes coercion — and practical — it drives creativity, invention, and prosperity.' \n\nThe shakeup means that former editor Shipley will step down from the position he has held since 2022.\n\n'I offered David Shipley, whom I greatly admire, the opportunity to lead this new chapter. I suggested to him that if the answer wasn't 'hell yes,' then it had to be 'no.' After careful consideration, David decided to step away,' Bezos explained.\n\nHe added that he is currently searching for Shipley's replacement. \n\n'This is a significant shift, it won't be easy, and it will require 100% commitment — I respect his decision,' Bezos said. \n\nThe Post's chief executive Will Lewis told staff that the changes were 'not about siding with any political party', the New York Times reports.\n\n'This is about being crystal clear about what we stand for as a newspaper,' Lewis wrote in a memo. 'Doing this is a critical part of serving as a premier news publication across America and for all Americans.'\n\nBezos has been slowly edging away from his paper's liberal leanings amid his budding friendship with the president and his allies. \n\nThe Amazon boss has begun playing a more active role in operations lately compared to when he first took the helm back in 2013.\n\nIn November, he fired the Post's long-time politics editor on the heels of Donald Trump's election.\n\nWhile earlier this month, he backed out of running a $115,000 front page advert targeting Elon Musk. \n\nThe decision came after Bezos was featured prominently at the 47th president's swearing-in ceremony, after he announced his plans too donate $1 million to the incoming president's inaugural fund.\n\nBezos and his fiancée Lauren Sanchez had earlier traveled to Mar-a-Lago for dinner with the then president-elect.","summary":"The Amazon boss said he is ditching a traditional, 'broad-based opinion section that sought to cover all views'.","url":"https://www.dailymail.co.uk/news/article-14439121/Jeff-Bezos-OUTRAGE-Washington-Post-opinion-page.html","image":"https://i.dailymail.co.uk/1s/2025/02/26/15/95611157-0-image-a-70_1740584197489.jpg","video":null,"publish_date":"2025-02-26 16:31:24","author":"Bethan Sexton,Editor","authors":["Bethan Sexton","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.274},{"id":294617054,"title":"Jeff Bezos announces big change to Washington Post opinion page, top editor steps down","text":"Washington Post owner Jeff Bezos announced some major changes to the outlet's opinion page on Wednesday, including that the opinion section editor would be stepping down as they introduce the changes. \"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets. We’ll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others,\" Bezos wrote on X, announcing the decision. Bezos said that Washington Post editorial page editor David Shipley decided to step away after being offered the opportunity to continue to lead the opinion section. The paper came under fire after Bezos stopped the editorial page from endorsing former Vice President Kamala Harris in 2024, prompting several staffers to leave the paper. \"I am of America and for America, and proud to be so. Our country did not get here by being typical. And a big part of America’s success has been freedom in the economic realm and everywhere else. Freedom is ethical — it minimizes coercion — and practical — it drives creativity, invention, and prosperity. WAPO COLUMNIST CALLS OUT JEFF BEZOS' ‘BULLS--- EXPLANATION’ ON NON-ENDORSEMENT: ‘BENDING THE KNEE’ TO TRUMP Washington Post publisher and CEO William Lewis also issued a statement regarding the announcement. \"Earlier today, our owner Jeff published a note explaining The Washington Post’s recalibrated content strategy for our opinion section. I want to thank him for clearly and succinctly spelling out what we stand for at The Washington Post, and I will be so very proud for The Post to be known for its two key pillars: our belief in free markets and personal liberties,\" Lewis said in a statement obtained by Fox News Digital. \"This is not about siding with any political party. This is about being crystal clear about what we stand for as a newspaper. Doing this is a critical part of serving as a premier news publication across America and for all Americans,\" the statement continued. Staffers fled the Post after the editorial page didn't endorse Harris. Former columnist Jennifer Rubin left the paper amid the endorsement fall out, as did editor-at-large Robert Kagan. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Liberals also canceled their subscriptions to the Post after its non-endorsement. \"I’m confident that free markets and personal liberties are right for America. I also believe these viewpoints are underserved in the current market of ideas and news opinion. I’m excited for us together to fill that void,\" Bezos wrote in his statement, posted to X. CLICK HERE TO GET THE FOX NEWS APP","summary":"Jeff Bezos announced some major changes to the Washington Post&apos;s opinion page on Wednesday following fallout at the paper due to his decision to not endorse a candidate in the election.","url":"https://www.foxnews.com/media/jeff-bezos-announces-big-change-washington-post-opinion-page-top-editor-steps-down","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/shipleybezos.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-26 16:29:43","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"US","sentiment":0.194},{"id":294623518,"title":"Tim Walz says he will not run for U.S. Senate seat in Minnesota","text":"Feb. 26 (UPI) -- Minnesota Gov. Tim Walz, who was Kamala Harris' runningmate in the 2024 presidential election last year, said he will seek a spot in the U.S. Senate, according to his spokesperson on Wednesday.\n\nInstead, Walz will explore running for a third term as governor. Walz's Lt. Gov. Peggy Flanagan has already announced she will run for the Senate seat being vacated by Tina Smith next year.\n\nThe seat, long held by Democrats, could draw other big names into the contest.\n\n\"He loves his job as governor and he's exploring the possibility of another term to continue his work to make Minnesota the best state in the country for kids,\" spokesperson Teddy Tschann said, according to the Star Tribune.\n\nRep. Angie Craig, another popular moderate Democrat, had been contemplating a run for governor, but a race against Walz could open the door for a Republican to score a rare win in the statewide office.\n\nThe Republicans said they believe the Senate seat is in play for a pickup, noting that Harris received just over 50% of the vote with Walz on the ticket last year against Trump.\n\nRepublicans who have been mentioned as possible candidates include State Sen. Julia Coleman, the daughter-in-law of former Sen. Norm Coleman, former sports broadcaster Michele Tafoya and ex-Senate candidate Royce White.","summary":"Minnesota Gov. Tim Walz, who ran with Kamala Harris in the 2024 presidential election last year, said he will seek a spot in the U.S. Senate, according to his spokesperson on Wednesday.","url":"https://www.upi.com/Top_News/US/2025/02/26/Tim-Waltz-Senate-Minnesota/4141740584809/","image":"https://cdnph.upi.com/ph/st/th/4141740584809/2025/upi/dab3ea3afeddb354317bc18ade3a1988/v1.2/Tim-Walz-says-he-will-not-run-for-US-Senate-seat-in-Minnesota.jpg","video":null,"publish_date":"2025-02-26 16:08:45","author":"Clyde Hughes","authors":["Clyde Hughes"],"language":"en","source_country":"US","sentiment":0.332}]}