{"offset":0,"number":50,"available":350,"news":[{"id":326273138,"title":"Jill Biden should have to answer for 'cover up' of former president's decline, White House says","text":"Former first lady Jill Biden should have to answer for her role in the \"cover up\" of her husband and former President Joe Biden’s mental decline, according to White House Press Secretary Karoline Leavitt. Multiple books published in 2025 have detailed the deterioration of Biden’s mental faculties while in the White House, including in the book \"Original Sin: President Biden’s Decline, Its Cover-up, and His Disastrous Choice to Run Again\" released May 20. \"The former first lady should certainly speak up about what she saw in regard to her husband and when she saw it and what she knew, because I think anybody looking again at the videos and photo evidence of Joe Biden with your own eyes and a little bit of common sense can see this was a clear cover up,\" Leavitt said. \"And Joe, by, Jill Biden was certainly complicit in that cover up.\" 'THE KAMALA EXCUSE': TENSIONS BETWEEN BIDEN AND HARRIS PLAGUED THEIR CAMPAIGNS, NEW BOOK REVEALS \"There's documentation, video evidence of her clearly shielding her husband away from the cameras that were just on ‘The View’ last week,\" Leavitt told reporters Thursday. \"She was saying, ‘Everything is fine.’ She's still lying to the American people. She still thinks the American public are so stupid that they're going to believe her lies. And frankly, it's insulting and she needs to answer for it.\" A spokesperson for Jill Biden did not immediately respond to a request for comment from Fox News Digital. \"Original Sin,\" authored by journalists Jake Tapper of CNN and Alex Thompson of Axios, includes stories about how former President Joe Biden struggled to handle fairly routine aspects of a campaign. For example, the book says his team attempted to film a campaign video for ads on television in a high school gym, and have people ask questions akin to a town hall meeting. BIDEN STRUGGLED TO FILM 2024 CAMPAIGN VIDEOS AMID DECLINING HEALTH, NEW BOOK CLAIMS: 'THE MAN COULD NOT SPEAK' \"The campaign was trying to make it look like the president was out there taking off-the-cuff questions from voters in public,\" the book said. \"But the event was closed to reporters, and the campaign had the full list of questions that people would ask.\" Even so, former President Joe Biden encountered so much \"trouble\" answering questions that his team decided to cut the footage. Some blamed the poor lighting in the gym, but the book said that others said the real problem remained with the former president. NEW BOOK REVEALS BIDEN'S INNER CIRCLE WORRIED ABOUT HIS AGE YEARS BEFORE BOTCHED DEBATE PERFORMANCE Meanwhile, Joe Biden's team has pushed back on the material in \"Original Sin,\" which chronicles the 2024 election cycle and how his team allegedly plotted a cover-up to hide just how severely his mental faculties had declined. CLICK HERE TO GET THE FOX NEWS APP \"There is nothing in this book that shows Joe Biden failed to do his job, as the authors have alleged, nor did they prove their allegation that there was a cover-up or conspiracy,\" a Biden spokesperson previously said in a statement to Fox News Digital. \"Nowhere do they show that our national security was threatened or where the President wasn’t otherwise engaged in the important matters of the Presidency. In fact, Joe Biden was an effective President who led our country with empathy and skill.\"","summary":"The White House says that former first lady Jill Biden was &quot;complicit&quot; in covering up just how badly former President Joe Biden&apos;s health had declined.","url":"https://www.foxnews.com/politics/jill-biden-should-have-answer-cover-up-former-presidents-decline-white-house-says","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/jill-biden-karoline-leavitt.png?ve=1&tl=1","video":null,"publish_date":"2025-05-29 22:18:08","author":"Diana Stancy","authors":["Diana Stancy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.321},{"id":326271580,"title":"Trump now claims 60 Minutes interview with Kamala Harris caused him ‘mental anguish’","text":"Donald Trump’s legal team claims in a new court filing that the president suffered “mental anguish” over the 60 Minutes interview with Kamala Harris at the center of his $20 billion lawsuit against CBS News, arguing that the network is wielding “the First Amendment as a sword.”\n\nIn a pair of objections filed in response to the network’s motions to dismiss the defamation suit, which legal experts have described as “frivolous,” the president’s lawyers reiterate that Trump was caused personal financial harm by the editing of the interview, claiming that CBS' parent company, Paramount, and Trump Media – which owns Truth Social – are competitors.\n\nThe latest development in this legal fracas comes after the Wall Street Journal reported Paramount had offered the president $15 million to settle the lawsuit, only for Trump to reportedly demand at least $25 million along with an apology over the interview. Trump also threatened to file another lawsuit accusing the network of biased news coverage, according to the Journal.\n\nEven though Paramount’s legal team filed motions to dismiss the lawsuit in March, calling it an “affront to the First Amendment without basis in law or fact,” the company has proposed settling the complaint as it needs the Trump administration’s approval to complete an $8 billion merger with Skydance Media.\n\nThe discussions around a settlement, which Paramount chair Shari Redstone has pushed for ahead of the merger, have resulted in tensions within the network. In recent weeks, 60 Minutes executive producer Bill Owens and CBS News chief Wendy McMahon, who had made it clear they would not apologize as part of any deal with Trump, abruptly announced their resignations.\n\nMeanwhile, mediation sessions between Paramount and Trump’s team have stalled over the past month, though the two sides were scheduled to meet again on Thursday. Redstone, meanwhile, has recused herself from the negotiations.\n\nOn the last day to file an objection, the president’s lawyers opposed both of Paramount’s motions to dismiss on Wednesday night. \n\nRegarding Paramount’s efforts to get the lawsuit kicked out of court due to improper venue and lack of personal jurisdiction, the president’s legal team rejected the notion that it was “naked-forum shopping” by filing the case in the Northern District of Texas. Instead, they argued that Trump and his co-defendant Rep. Ronny Jackson (D-TX) have “sufficient minimum contacts” in the state, and their complaints arise from that.\n\n“The fact that such commercial speech was issued by a news organization does not insulate Defendants from liability under the First Amendment,” the objection states. “The First Amendment is no shield to news distortion.”\n\nAs for the motion to dismiss based on failure to state a claim, Trump’s lawyers stated that the interview – which the president has asserted was deceitfully edited to make Harris look good and therefore interfere with the election – caused personal damage to both Trump and viewers.\n\n“This led to widespread confusion and mental anguish of consumers, including Plaintiffs, regarding a household name of the legacy media apparently deceptively distorting its broadcasts, and then resisting attempts to clear the public record,” the opposition motion declares.\n\nAdditionally, the president’s team claimed that Paramount and CBS “seek to wield the First Amendment as a sword, arguing that they cannot be held responsible for illegal conduct, intended to mislead the masses and undertaken in the pursuit of profit, because such conduct was the result of ‘editorial judgment.'”\n\n“No matter how many times they claim the conduct at issue was editorial speech, that ipse dixit does not make it so,” the objection adds.\n\nWhile Paramount appears to want to settle the complaint that CBS News has said is “completely without merit” sooner rather than later, it is also getting its ducks in a row in case the deal with Skydance falls through. \n\nAccording to the Journal, the company is expected to nominate three new directors to the board in the coming weeks to bring the total to seven. Additionally, a current director is expected to step down soon and will also need to be replaced.\n\nThough the media conglomerate seems desperate to settle with the president, some executives have expressed concerns that paying the president to make the lawsuit go away could open them up to liability or even criminal charges for bribery.\n\nIn fact, several Democratic senators have already warned Redstone and Paramount that they could face investigation for violating anti-bribery laws if a settlement with Trump is reached. Furthermore, the Freedom of the Press Foundation has said it intends to sue Paramount if the company settles with the president.\n\nDue to those concerns, the board is hoping to keep the settlement amount in the range of other media companies that have recently reached deals with Trump, in hopes that this would minimize any liability. \n\nThe $15 million that Paramount is reportedly offering Trump, for instance, is the same amount that Disney paid to end his defamation suit against ABC News and anchor George Stephanopoulos over an interview that saw Stephanopoulos claiming that Trump was found civilly liable for rape rather than sexual abuse.","summary":"The new objections to Paramount’s motions to dismiss CBS lawsuit come amid reports the president turned down a $15 million settlement, seeking $25 million and an apology","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-kamala-harris-60-minutes-lawsuit-mental-anguish-b2760380.html","image":"https://static.independent.co.uk/2025/03/07/7/15/Kamala-Harris.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/uMKgJ7oZ-4VHSaSK0.mp4","publish_date":"2025-05-29 22:00:49","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.562},{"id":326280480,"title":"Is Trump Falling Out of Love With Putin?","text":"Like so many stories about Donald Trump, this one begins with a tweet.\n\nMore than a decade ago, Trump mused about whether Vladimir Putin would attend a beauty pageant that Trump was sponsoring in Moscow and, if so, whether Putin would “become my new best friend.” That seemingly random 2013 Twitter missive launched one of the most enduring and significant geopolitical bromances in recent times—one that has persisted despite election-interference allegations, a special-counsel investigation, and the invasion of Ukraine.\n\nBut in recent weeks, the relationship has begun to show signs of strain.\n\nExasperated by Putin’s reluctance to sign off on a cease-fire with Kyiv and by new images of violence in Ukraine, Trump has expressed rare public anger at the Russian leader while privately mulling a series of sanctions meant to force Moscow to the negotiating table. Trump has started to feel humiliated that Putin is, as the president said this week, “tapping him along,” and is frustrated that Putin does not seem to want to end the war, two outside advisers to the president and a third person familiar with the negotiations told us. At the same time, Trump said yesterday that he will wait “two weeks”—his favorite verbal crutch when stalling for time—before deciding on his next move toward Russia, raising the specter that the Trump-Putin relationship will survive.\n\nThe two-week time frame also postpones a potential inflection point in the Ukraine war: Will the president walk away from the conflict, which would bolster Russia? Or will he, for the first time, truly stand up to Putin?\n\n“I do detect signs that he’s trying to put some blue water between himself and Putin. He thought, because they were good friends, he could wrap up the deal in 24 hours. Obviously none of that came close to being true,” John Bolton, Trump’s former national security adviser, told us. “Now Putin has started to push him a little bit. They’re starting to mock him.”\n\nThis is not how Trump thought it would go. He has long been impressed by Putin and his strongman’s grip on power, and he worked hard to establish a relationship with his Russian counterpart. During Trump’s first term, the pair met on multiple occasions without any staff present, a departure from protocol. And, infamously, Trump sided with Putin over his nation’s own intelligence agencies when asked during a 2018 Helsinki summit about Russian interference in the U.S. election two years earlier.\n\nDuring his time out of office, Trump praised Putin as a “genius” and said repeatedly that, once back in the White House, he would settle the Russia-Ukraine conflict in a single day. He has since sought a summit with Putin that could turn into a made-for-TV moment to announce the end of the war—and a long-coveted Nobel Peace Prize for himself. (“He really wants a Nobel Peace Prize,” Bolton told us. “He’ll take it for Ukraine, he’ll take it for Gaza, he’ll take it for Pakistan-India. He’s not particular.”) In his early months in office, Trump has been eager to make business deals with Russia and blamed Ukraine for somehow instigating a war that actually began when Russia deployed its military across the border. He berated Ukrainian President Volodymyr Zelensky in the Oval Office and temporarily cut off U.S. intelligence sharing and military aid, allowing Russia to make gains on the battlefield.\n\nHe also claimed that Ukraine—and specifically its leader—was the biggest obstacle to peace. Trump has flashed deep antipathy toward Zelensky, whom he deems ungrateful for U.S. support and at least partially responsible for his 2019 impeachment. (Trump withheld military aid from Ukraine to pressure Kyiv to investigate the family of his political rival Joe Biden.) In an Oval Office interview with The Atlantic in late April, when he was asked if there was anything Putin could do that would make him say he was on Zelensky’s side and not Putin’s, Trump again underscored his fraught relationship with the Ukrainian leader: “Not necessarily on Zelensky’s side, but on Ukraine’s side, yes,” the American president said. “But not necessarily on Zelensky’s side. I’ve had a hard time with Zelensky.”\n\nYet Zelensky had quickly agreed to a new U.S. proposal for a 30-day cease-fire in March. Russia stalled in doing the same. More than two months later, Moscow still has not agreed to a pause in the fighting and instead has escalated the violence, unleashing waves of drone and missile attacks on Ukrainian cities in recent weeks, killing more than a dozen people.\n\nThat onslaught was the latest act of defiance from Putin, coming days after he skipped a possible meeting with Zelensky and Trump in Istanbul and then blustered through a two-hour call with the American president without agreeing to a cessation in hostilities. On Sunday, Trump bemoaned Putin’s defiance, writing on Truth Social, “I’ve always had a very good relationship with Vladimir Putin of Russia, but something has happened to him. He has gone absolutely CRAZY!” A Kremlin spokesperson, Dmitry Peskov, responded by musing that Trump was having “emotional reactions.”\n\nTrump initially believed that Russia was willing to negotiate, according to the person familiar with the negotiations, who was granted anonymity to discuss sensitive internal conversations. But once Ukraine accepted the cease-fire proposal, “it was almost like calling the Russians’ bluff, and it’s clear at this point Putin is playing a delay tactic and the president finds it very frustrating,” the person said. “He’s genuinely frustrated that he thought Putin was in a place to have meaningful dialogue and seems to have reversed course.”\n\nDespite Trump’s claim, there is little evidence that Putin has changed in some way; the KGB officer turned dictator has a long history of deceit. For more than a year, the United States and its allies have assessed that Putin is not willing to negotiate an end to his war in Ukraine, because he thinks he’s winning. Multiple intelligence evaluations have reached the same conclusion: For Putin, negotiating would mean giving something up—for example, ceding territory or agreeing to let Western powers continue to arm Ukraine. Putin is simply not willing to do that. And he likely believes now—with some justification—that he is successfully disrupting the NATO alliance and dividing Kyiv from Washington, according to intelligence officials in the United States and Europe.\n\nTrump, who hates scenes of war, has been disturbed by recent images of dead Ukrainian civilians, including children, according to the two outside advisers, who were granted anonymity to discuss private conversations. Had Putin accepted Trump’s cease-fire offer instead of ratcheting up Russia’s attacks, Trump believes, those killings could have been prevented. It would not be the first time that gruesome images have spurred him into action. In 2017, Trump ordered missile strikes on a Syrian air base after he was shown what he said were “horrific” images of dead children killed by chemical weapons days before. Months later, he delivered a rare rebuke of Saudi Arabia after he was presented with photos of Yemeni children who were at risk of starving to death because of a blockade ordered by Riyadh.\n\nIn Trump’s first term, his administration sanctioned Moscow for a variety of misdeeds, including sponsoring election interference and cyberhacking, but the president himself has long been reluctant to punish Russia in any meaningful way. Although Trump has in recent days talked with aides about unleashing new sanctions against Russia, he is waiting to see what happens when representatives from Ukraine and Russia meet for a second round of talks, set for next week in Istanbul; the U.S. is not planning to send a delegation, but White House aides said Trump wants to see progress.\n\n“The president is mad, but he also wants a deal,” one of the outside advisers told us. “He’s trying to figure out the best path to get there—but believe him when he says he’ll walk away.”\n\nRepublican Senator Lindsey Graham of South Carolina, a Trump ally, has co-sponsored a bill with Democratic Senator Richard Blumenthal of Connecticut that would impose more sanctions against Russia—as well as secondary sanctions against other nations that do business with Moscow—if Putin does not commit to peace talks. The measure now has the support of a bipartisan group of more than 80 senators, a veto-proof majority. But the White House is worried about a global rise in gas prices if stringent measures are put in place, an administration official and one of the outside advisers told us. Some in the administration are also leery of secondary sanctions, which could anger U.S. trading partners that purchase Russian energy, including China and India.\n\n“President Trump inherited the brutal Russia-Ukraine war from Joe Biden, and has put forth great effort to solve it, in order to save lives,” White House Press Secretary Karoline Leavitt told us in a statement. “The President is hopeful this war will soon be solved and if it is not—he has options on the table.”\n\nIf a frustrated Trump fully walks away from trying to bring an end to the conflict, that decision will almost certainly work to Russia’s advantage. Without pressure from Washington to negotiate, Russia is likely to further escalate its violence. (Moscow’s recent uptick in attacks came after Trump had said he might abandon talks.) If the Trump administration also decides to stop sharing intelligence or aid with Ukraine, then the momentum of the conflict could shift dramatically. Europe would bear more of the responsibility for supplying Ukraine with weapons and guaranteeing its security. Although the continent has rallied around Ukraine since the war began, European militaries cannot match the ability of the United States to fortify Kyiv.\n\n“This is hardly the art of the deal—effectively telling Putin that if he doesn’t engage in serious negotiations, he will suffer no costs and get everything he wants,” Rebecca Lissner, a former deputy national security adviser to Vice President Kamala Harris, told us. “This is not particularly surprising, as Trump is perennially reluctant to get tough with Putin.”\n\nDespite the recent tension with Trump, Putin has gotten nearly everything he has wanted from Washington since Trump returned to the presidency in January. Trump has weakened U.S. soft power around the world and feuded with traditional allies. If Trump were to walk away from talks now, or fail to follow through on his threats to punish Moscow, he’d yet again be helping the man who in many ways did become his friend.\n\nShane Harris contributed reporting.","summary":"“The president is mad, but he also wants a deal.”","url":"https://www.theatlantic.com/politics/archive/2025/05/trump-putin-relationship-ukraine/682976/","image":"https://cdn.theatlantic.com/thumbor/Jk1gvX6zXrWNCg-D114Zd2W5Kmw=/0x43:2000x1085/1200x625/media/img/mt/2025/05/2025_05_28_putin_trump_mgp/original.jpg","video":null,"publish_date":"2025-05-29 22:00:00","author":"Ashley Parker,Jonathan Lemire","authors":["Ashley Parker","Jonathan Lemire"],"language":"en","category":"politics","source_country":"US","sentiment":0.035},{"id":326263132,"title":"Kamala Harris Warned to Steer Clear of Meghan Markle and her 'Kiss of Death' As Democrat Gets Set to Hit Comeback Trail","text":"Kamala Harris may be wise to say \"Thanks, but no thanks\" to any political endorsements from Meghan Markle, RadarOnline.com can reveal. \n\nThe former presidential candidate, who is considering her next step in her return to politics, is being advised to stay clear of the poisonous royal.Harris is said to be considering a run for governor of California, after current governor Gavin Newsom is forced to step down due to term limits. \n\nThe former VP has already served as senator of California, attorney general for the state, and district attorney of San Francisco, and remains popular in the liberal-leaning location, despite her trouncing in the 2024 election at the hands of Donald Trump.\n\nAs she considers endorsements from some of her famous pals, several advisors are warning her to skip events with the troubled Duchess of Sussex, 43, who is still reeling from the rough reception to her new personal lifestyle brand and podcast.\n\n\"It would reinforce the stereotype of Kamala Harris being an out-of-touch elitist who is more interested in royalty than the struggles of Californians,\" one political insider said.Disapproval RatingMarkle's approval rating in the U.S., where she and Prince Harry, 40, currently live in posh Montecito, California, sits at a lowly 41 percent. It's even worse back in the U.K., where it hit a record low of 20 percent according to a recent poll.\n\nThe low numbers have attracted the attention of political pollsters. Tab Berg, a Republican political strategist based in California, is among those who believe Harris needs to stay away from Markle. \n\n\"In general, celebrity endorsements are now a net negative,\" he said. \"It's not a working formula. There's a tiny number of voters who look for what celebrities say.\"\n\nHe added: \"I don't think any of the (major) players (in California) would take her seriously.\"Markle and Harry Need HelpIt seems Markle and Harry need Harris more than she needs them. Shortly after his big win, Trump vowed to consider deporting Harry over his visa issues and previous drug use, which has left the couple uncertain of what's next.\n\nA source claimed: \"They feel very torn about what to do next, they honestly thought Kamala Harris would get in and they would be friends with the President – this is a hellish situation for them.\n\n\"Harry's worried about deportation happening; he's worried about leaving. Meghan fears Harry having to leave the US, too.\"\n\nThe insider added: \"They're both feeling very unsettled right now, what with everything going on in America, plus all the pressure on them to do well with their projects.\"Visa SwipedConservative Heritage Foundation think-tank previously filed a lawsuit against the US Department of Homeland Security, questioning whether Harry's visa application for his January 2020 stateside move was properly vetted.\n\nThe lawsuit was filed after the 40-year-old admitted in his Spare memoir that he'd taken drugs, including cocaine and magic mushrooms, when he was younger. The Heritage Foundation asked that his records be made public\n\nAll United States visa applicants need to disclose current and past drug use.\n\nIn September, a judge ruled that Harry's application should remain private, but with Trump in control now, that could all easily change.","summary":"Former presidential candidate Kamala Harris is considering her next step in her return to politics","url":"https://radaronline.com/p/kamala-harris-meghan-markle-democrat-comeback/","image":"https://media.radaronline.com/brand-img/RUdIqltUm/0x0/kamala-harris-meghan-markle-1748550348758.jpg","video":null,"publish_date":"2025-05-29 21:30:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.038},{"id":326273196,"title":"Offset reportedly asks Cardi B for spousal support as divorce case drags on, Nigerians react","text":"Rapper Offset reportedly updated his divorce suit as he asks for spousal assistance from his estranged wife, Cardi BAccording to TMZ, while the former Migos member demanded a court-ordered payment from Cardi Reports about Offset’s demanded got the attention of many on the internet including Nigerians as they lashed out at him\n\nAmerican diva Cardi B and Offset's breakup has unfolded in front of the world over the last year, and the conditions of their protracted divorce take another dimension.\n\nThe former Migos member is apparently requesting financial aid from his ex-wife as they navigate their tumultuous life as a previously married couple.\n\nOn May 29, TMZ said that the Atlanta rapper “filed an amended divorce response earlier this month in which he’s now asking that Cardi pay him spousal support.” \n\nThe site claimed that he did not specify a specific amount in the filings and is still seeking shared custody of their children. He feels that Cardi's house should be the primary domicile for the children.\n\nThe Bronx rapstress filed for divorce in August 2024 after seven years of marriage, and the two have been throwing shots back and forth on social media since. That same summer, she also gave birth to her third child with ‘Set. They have three children in all, including their eldest daughter Kulture and son Wave.\n\nLast month, Offset attempted to fuel the public outrage sparked by their relationship conflict on the internet. \n\nHe posted on X: “Keep my name out shiit please thank you tired of this circus I want out. Let ppl live they life… I want peace no smoke I love all bardi gang we grown man she happy let her live she don’t want to see this sh*t either man life goes on we can all be friends man.”\n\nIn terms of music, the \"Ric Flair Drip\" rapper revealed on May 28 that his upcoming project has been officially filed and is ready for release.\n\nCardi B has been teasing fans about her sophomore album for several years, since her Grammy-winning debut album, Invasion of Privacy, was released in 2018. After promising followers that 2024 would be the year, the body of work did not come out, although she did explain to her admirers why the delay occurred.\n\n“I really need these fuckkking features,” she explained without placing the blame on anyone specifically. “And it’s like I’m not really trying to press or go crazy on these artists because I love them down. But it’s like come on now! I need that! I need that right now! Helloooo! Y’all don’t want to miss this opportunity. I’ll sing this s**t myself! But I really need y’all and I need y’all to hurry up and I love y’all. I feel like nobody would want to miss being on this album.”\n\nSee the post below:\n\nNigerians react to Cardi B and Offset’s fight\n\nLegit.ng compiled the reactions below:\n\nisieuros said:\n\n \"Oh he a princess yalll...glad she done with him ugh.\"\n\nisieuros said:\n\n \"Oh he a princess yalll...glad she done with him ugh.\"\n\nfredline156 said:\n\n \"Then they say Divorce only favors Women… #ConfusedBeings 😂😂😂.\"\n\ngreat_ynr said:\n\n \"I don’t know if this guy is serious or just trolling her😂.\"\n\nexcels_artistry said:\n\n \"Wow, princesses.\"\n\nverified_024 said:\n\n\"I support bro 😂and I pray he won 🏆.\"\n\nmorelloisart said:\n\n \"Let’s be honest if he was richer she would have done thesame 😂.\"\n\noluwa2obi said:\n\n \"Shame wear this one dreads 😂.\"\n\nromzzz______ wrote:\n\n \"Is he really broke? Or trying to get on her nerves?😂.\"\n\neminiyinkar said:\n\n\"Ole! He wants to ruin her.\"\n\njykez27 said:\n\n \"Ofcourse, she kept calling him broke that she has more money than him so she should pay up.\"\n\nkelztheareaboy wrote:\n\n \"The case don reverse now, ladies no kon dey smile for comment section 😂.\"\n\ngangster_wife__ said:\n\n \"He was a fairy 🧚‍♂️.\"\n\nthefoodnetworknig2 said:\n\n \"Nothing concern Rihanna with spousal support if anything go south! No marriage no case…Omo ogbon\n\nelia_beautyy_flo_werr_ wrote:\n\n\"Make una help,shame don push me inside pricy Range Rover.\"\n\nezeqwesiri wrote:\n\n \"Offset Omo Werey 😂 … Cardi B is richer then the werey found a loophole.\"\n\nCardi B supports Kamala Harris\n\nLegit.ng, in a previous report, noted that as the results of the United States presidential elections unfolded, rapper Cardi B continued to declare her support for Kamala Harris.\n\nKamala's ideologies appealed to her supporters, and Cardi B made it one of the bases for supporting the US politician. \n\nThe politician is the Vice President, and Cardi B believed the country needed someone who hails the Holy Mary.\n\nSource: Legit.ng","summary":"American rapper Offset is reportedly requesting a judge to approve spousal support from his soon-to-be estranged wife Cardi B, triggering reactions.","url":"https://www.legit.ng/entertainment/celebrities/1657483-offset-reportedly-asks-cardi-b-spousal-support-divorce-case-drags-nigerians-react/","image":"https://cdn.legit.ng/images/1200x675/38f0cc5ddc8d10d8.jpeg?v=1","video":null,"publish_date":"2025-05-29 21:24:16","author":"Bayo Olupohunda,Chinasa Afigbo","authors":["Bayo Olupohunda","Chinasa Afigbo"],"language":"en","source_country":"ng","sentiment":-0.015},{"id":326258990,"title":"Trump rejects Paramount's $15 million offer to settle CBS News lawsuit, demands apology","text":"President Donald Trump and Paramount Global are still at an impasse as they attempt to resolve his $20 billion lawsuit against the company through mediation. Fox News Digital confirmed that Trump rejected a $15 million offer to settle his lawsuit, according to a source familiar with the matter. The president's legal team is also demanding at least $25 million and an apology from CBS News. Trump's attorneys even floated another lawsuit against the company. Trump's settlement rejection was first reported by The Wall Street Journal. Trump's attorney did not respond to Fox News Digital's request for comment. Paramount declined to comment. ‘60 MINUTES’ STAFF STAND BY KAMALA HARRIS INTERVIEW AT THE CENTER OF TRUMP'S MAJOR PARAMOUNT LAWSUIT Last October, Trump sued CBS News and Paramount for $10 billion over allegations of election interference involving the \"60 Minutes\" interview of then-Vice President Kamala Harris that aired weeks before the presidential election (the amount has since jumped to $20 billion). The lawsuit alleges CBS News deceitfully edited an exchange Harris had with \"60 Minutes\" correspondent Bill Whitaker, who asked her why Israeli Prime Minister Benjamin Netanyahu wasn't \"listening\" to the Biden administration. Harris was widely mocked for the \"word salad\" answer that aired in a preview clip of the interview on \"Face the Nation.\" However, when the same question aired during a primetime special on the network, Harris had a different, more concise response. Critics at the time accused CBS News of deceitfully editing Harris' \"word salad\" answer to shield the Democratic nominee from further backlash leading up to Election Day. The raw transcript and footage released earlier this year by the FCC showed that both sets of Harris' comments came from the same response, but CBS News had aired only the first half of her response in the \"Face the Nation\" preview clip and aired the second half during the primetime special. CBS News has denied any wrongdoing and stands by the broadcast and its reporting. ‘60 MINUTES’ PRODUCERS RAIL AGAINST TRUMP'S 'BULLS---' LAWSUIT, DREAD PROSPECTS OF PARAMOUNT MAKING SETTLEMENT Shari Redstone, Paramount's controlling shareholder who recused herself from settlement discussions in February, made clear that she wanted to settle Trump's lawsuit in hopes of clearing the pathway for Paramount's multibillion-dollar planned merger with Skydance Media, which seeks approval from the Trump administration's FCC. However, there has been newsroom drama in recent months involving Redstone's efforts to \"keep tabs\" on the network's reporting of Trump, at least until the merger closes. That led to the abrupt resignation of \"60 Minutes\" executive producer Bill Owens, who claimed he could no longer maintain editorial independence. Also fueling settlement rumors was last week's ousting of CBS News CEO Wendy McMahon, who cited disagreement with the company behind her departure. CBS NEWS STAFFERS RATTLED BY CEO'S ABRUPT EXIT AS TRUMP LAWSUIT LOOMS OVER NETWORK CBS News journalists remain defiant, including \"60 Minutes\" correspondent Scott Pelley, who went viral with his commencement address at Wake Forest University repeatedly slamming Trump as well as his lawsuit. \"Why attack universities? Why attack journalism? Because ignorance works for power,\" Pelley told Wake Forest graduates. \"First, make the truth seekers live in fear, sue the journalists and their companies for nothing. Then, send masked agents to abduct a college student who wrote an editorial in her college paper defending Palestinian rights and send her to a prison in Louisiana charged with nothing. Then move to destroy the law firms that stand up for the rights of others.\" CLICK HERE TO GET THE FOX NEWS APP \"With that done, power can rewrite history with grotesque false narratives. They can make criminals heroes and heroes criminals. Power can change the definition of the words we use to describe reality. Diversity is now described as illegal. Equity is to be shunned. Inclusion is a dirty word. This is an old playbook, my friends. There's nothing new in this,\" he continued.","summary":"Fox News Digital confirmed that President Donald Trump rejected a $15 million settlement offer by Paramount Global hoping to end the months-long legal drama.","url":"https://www.foxnews.com/media/trump-rejects-paramounts-15-million-offer-settle-cbs-news-lawsuit-demands-apology","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/trumpcbs60.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-29 20:34:36","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.443},{"id":326263128,"title":"FBI Claims Threats to Assassinate Trump Have INCREASED As 'Copycats' Unite After James Comey's '8647' Post Put President's Life on The Line","text":"James Comey's now-deleted \"8647\" Instagram post has led to a rise in assassination threats against President Trump, RadarOnline.com can reveal.\n\nIn an interview with Fox News, FBI Director Kash Patel claims the bureau has been slammed by a huge uptick in threats, as agents have now had to drop other concerning issues.\"Do you know how many copycats we’ve had to investigate as a result of that beachside venture from the former director?\" Patel told Bret Baier during the interview.\n\nEarlier this month, former FBI Director Comey posted a photo featuring seashells on a beach arranged to form the numbers \"8647.\" In the hospitality world, the term \"86\" means to \"get rid\" of something.\n\nHowever, it has also been used by the mafia to describe a grave eight feet long and six feet deep. \n\nAnd \"47\" of course could have signified the 47th president, Trump.Patel added: \"Do you know how many agents I’ve had to take offline from chasing down child sex predators, fentanyl traffickers, terrorists Because everywhere across this country people are popping up on social media and think that a threat to the life of the president of the United States is a joke… and they can do it because (Comey) did it?\"\n\nThe 45-year-old also revealed the agency has had to \"deal with this every single day,\" and suggested Comey thought it was \"funny\" to share the seashell post. \n\nTwo attempts to take out Trump, 78, have already been documented, including during a rally in Pennsylvania in July 2024.2 Attempts To Take Out TrumpThe incident left two people dead: the shooter, 20-year-old Thomas Matthew Crooks, and spectator Corey Comperatore. Trump was left with a bloodied ear in a now-famous photo.\n\nTwo months later, a man named Ryan Wesley Routh set up a \"sniper's nest\" on the fence at Trump's West Palm Beach golf course before he was stopped by Secret Service and arrested.\n\nIn a note \"to the world,\" following the attempt, Routh wrote: \"This was an assassination attempt on Donald Trump, but I am so sorry I failed you.\n\n\"I tried my best and gave it all the gumption I could muster. It is up to you now to finish the job, and I will offer $150,000 to whoever can complete the job.\"Trump was also previously briefed by U.S. intelligence officials about \"real and specific assassination threats\" posed by the government of Iran.\n\n\"Make no mistake, the terror regime in Iran loves the weakness of Kamala Harris, and is terrified of the strength and resolve of President Trump,\" the president's campaign said at the time.\n\n\"He will let nothing stop him or get in his way to fight for the American people and to Make America Great Again.\"Living Rent-Free?Patel and Comey, 64, have never been on the same page, as Comey recently appeared on CNN to call out the new FBI Director's decisions, and claimed he \"has literally nothing in his entire adult life that prepares him for this role.\"\n\nComey added he \"feels a little bit sorry\" for Patel, and compared him to a dog that caught a car and \"now he has to drive it.\"\n\nHowever, during his Fox News interview, Patel hit back and said the criticism did not bother him.\n\n\"(I've been) living rent-free in that guy's head for years,\" Patel said.","summary":"FBI Director Kash Patel claims assassination threats on Donald Trump's life have gone up following James Comey's '8647' shock post.","url":"https://radaronline.com/p/fbi-assassination-threats-trump-james-comey-8647-kash-patel/","image":"https://media.radaronline.com/brand-img/D8lyP2kFI/0x0/trump-3-1748541709687.jpg","video":null,"publish_date":"2025-05-29 20:30:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","category":"politics","source_country":"us","sentiment":-0.171},{"id":326260230,"title":"Trump suffered ‘mental anguish’ from disputed CBS News interview with Harris, lawyer says","text":"By DAVID BAUDER, Associated Press\n\nNEW YORK (AP) — President Donald Trump suffered “mental anguish” from CBS News’ editing of a “60 Minutes” interview with Democratic opponent Kamala Harris last fall, his lawyers are arguing in court papers.\n\nTrump’s status as a “content creator” was also damaged by attention given to the interview, lawyers said. It was part of their argument opposing CBS parent Paramount Global’s effort to dismiss the president’s $20 billion lawsuit against the company, filed Wednesday in U.S. District Court in Amarillo, Texas. Trump has claimed the editing was done to advantage Harris, which CBS rejects.\n\nEven with the effort to dismiss the case, Paramount is engaged in settlement discussions with Trump. The prospect of a settlement has so rattled CBS News that two of its top executives have resigned in protest.\n\nTrump, who did not agree to be interviewed by “60 Minutes” during the campaign, has protested editing where Harris is seen giving two different answers to a question by the show’s Bill Whitaker in separate clips aired on “60 Minutes” and “Face the Nation” earlier in the day. CBS said each reply came within Harris’ long-winded answer to Whitaker, but was edited to be more succinct.\n\nTrump’s lawyer, Edward Andrew Paltzik, said that “this led to widespread confusion and mental anguish of consumers, including plaintiffs, regarding a household name of the legacy media apparently deceptively distorting its broadcasts, and then resisting attempts to clear the public record.”\n\nBecause they were misled, voters withheld attention from Trump and his Truth Social platform, Paltzik argued.\n\nTrump, described as a “media icon” by his lawyers, was “forced to redirect significant time, money and effort to correcting the public record,” he said.\n\nParamount and controlling shareholder Shari Redstone are seeking the settlement with Trump, whose administration must approve the company’s proposed merger with Skydance Media. CBS News’ president and CEO, Wendy McMahon, and “60 Minutes” executive producer Bill Owens, who both opposed a settlement, have resigned in recent weeks.\n\nMeanwhile, the Freedom of the Press Foundation, a media advocacy group that says it is a Paramount shareholder, said that it would file a lawsuit in protest if a settlement is reached.\n\nSeth Stern, the foundation’s advocacy director, said a settlement of Trump’s “meritless” lawsuit “may well be a thinly veiled effort to launder bribes through the court system.” U.S. Sens. Ron Wyden, Bernie Sanders and Elizabeth Warren have said they are investigating whether a settlement would violate bribery laws.\n\nThe Wall Street Journal reported on Thursday that Paramount has offered $15 million to settle but that Trump wants more money — and an apology. A company representative would not comment on the report.\n\nDavid Bauder writes about media for the AP. Follow him at http://x.com/dbauder and https://bsky.app/profile/dbauder.bsky.social.","summary":"Even with the effort to dismiss the case, Paramount is engaged in settlement discussions with Trump.","url":"https://www.ocregister.com/2025/05/29/media-trump-60-minutes/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/Media_Trump_60_Minutes_13126.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-29 20:08:17","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.36},{"id":326246304,"title":"Trump issues unexpected pardon for Long Island labor boss James Callahan less than 24 hours before sentencing","text":"A disgraced ex-Long Island union boss was spared prison Tuesday, after President Donald Trump issued a last-minute pardon less than 24 hours before he was set to be sentenced.\n\nJames Callahan, a 65-year-old Lindenhurst native and former top labor leader of the International Union of Operating Engineers, was set to be sentenced Wednesday by US District Judge Ana Reyes.\n\nBut on Tuesday, Callahan’s attorney, David Schertler, notified Reyes that his client had received a “full and unconditional” pardon from the President, with his sentence in a temporary state of suspension until prosecutors file a formal request to dismiss the case, court records show.\n\nSchertler said his client was “extremely grateful for President Donald Trump’s consideration and pardon and the opportunity to get back his life and his reputation after devoting over 40 years to the cause of organized labor and the members of the International Union of Operating Engineers and their families.”\n\nTrump has so far provided no reason as to why he decided to issue a pardon for Callahan, who prosecutors had only recommended a six-month prison sentence for.\n\n“No MAGA left behind,” Trump’s pardon attorney Ed Martin Jr. posted on X Monday as the President commuted a slew of sentences this week — but it’s unclear if Callahan fits that bill.\n\nThere’s no record he ever supported or donated to Trump in the past, and his union actually backed both Joe Biden and Kamala Harris over Trump in the last election while he was still in charge, according to records.\n\nThe judge, however, expressed that she was “quite disappointed” to learn of Callahan’s pardon, noting he had accepted responsibility for his criminal conduct, according to a transcript of Wednesday’s hearing.\n\nIn January, Callahan pleaded guilty to failing to report over $315,000 he scored in tickets to games, concerts, shows and other financial perks from a company that did business with his union.\n\nAs part of the plea deal, Callahan — who prosecutors say has a net worth of more than $5 million — agreed to repay the union and step down as president.\n\n“The Operating Engineers were unknowingly funding Defendant Callahan’s spree of pricey entertainments — a lifestyle his substantial salary could easily accommodate,” prosecutors wrote in their sentencing recommendation, calling him “one of the most powerful union leaders in the country.”\n\nThe Justice Department is now expected to file a motion to dismiss the case.","summary":"Trump has so far provided no reason as to why he decided to issue a pardon for Callahan, who prosecutors had only recommended a six-month prison sentence for.","url":"https://nypost.com/2025/05/29/us-news/trump-issues-unexpected-pardon-for-long-island-labor-boss-less-than-24-hours-before-sentencing/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105522104.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/79Caldev-RyIcpnTz.mp4","publish_date":"2025-05-29 19:53:08","author":"Brandon Cruz","authors":["Brandon Cruz"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.045},{"id":326244424,"title":"How President Trump Stopped Democrats’ Plan for Permanent Power","text":"It was not very long ago that liberal writers would rhapsodize about how America’s changing demographics would spell Republicans’ doom. A 2012 headline from The New York Times read “Demographic Shift Brings New Worry for Republicans.” By 2014, the corporate media was already writing the GOP’s obituary: “Republicans have a major demographic problem. And it’s only going to get worse” one Washington Post headline claimed.\n\nThen conservatives committed the crime of noticing—noticing that mass migration followed by mass amnesty was Democrats’ play for political power. The Left labeled them peddlers of the “Great Replacement Theory.”\n\nSen. Eric Schmitt, R-Mo, joined “The Signal Sitdown” to discuss how President Donald Trump upended Democrat plans for permanent control in Washington.\n\nFor Schmitt, it all starts with one crucial realization: The American nation is “not just an idea.”\n\nThis is a real nation with real people,” the Missouri senator said, and the GOP should be “fighting for them.”\n\n“When Joe Biden is letting 15 million people here illegally, people don’t understand. How could the president of our country allow this? And the answer is that he bought into and was captured by this worldview that there wasn’t anything particularly unique [about America], that America was just some economic zone with an airport attached to it,” Schmitt continued. “We can have our jobs shipped overseas, all those good-paying jobs, and we get cheap Chinese T-shirts in return and everything is going to be great.”\n\nIn fairness, Schmitt says some of these policies were justifiable prior to the end of the Cold War. In the aftermath of World War II, America’s trade and foreign policy focused on “rebuild[ing] our European allies and Japan, to bring them into the fold, and defeat Soviet communism. That defined our foreign policy in the sense that we had this security umbrella for our friends and allies. We had trade deals that weren’t really good for us, but that allowed them to get back on their feet.”\n\nOnce the Cold War ended, Schmitt told The Daily Signal, “this is when the mistakes were made because the people in charge, the elites, they never really adjusted. They never adjusted trade policy. They never really adjusted foreign policy.”\n\n“You sort of had this globalist view,” Schmitt said, “the end of history. And that fueled this mass migration. It fueled a wandering, aimless, Wilsonian kind of foreign policy that was based on these abstract ideas of global democracy.”\n\nIt was far from a Democrat-only problem. “Republicans were a part of this problem, too,” Schmitt added. Republicans of the post-Cold War era pursued trade policies “that shipped our jobs overseas,” but promised ‘creative destruction’ would leave Americans better off. The destruction came, but the creativity did not. \n\n“We’ve seen devastation in our communities, factories that are desolate now, and they’ve been replaced with, in many ways, despair and death,” Schmitt said.\n\nLong before Trump was president, he was one of the first to recognize the need for change. Since taking American politics by storm, he has vigorously reasserted the sovereignty of the American nation. Republicans of yesteryear hesitated to embrace this view, afraid of pejoratives like racist or xenophobic. But the Republicans of today have caught up to the party’s frontman. \n\nAmerica is “much more” than idea, Schmitt told The Daily Signal. “It’s our home.”\n\n“We’re a people and we believe in things and that we ought to be fighting for the dignity of the guy that doesn’t have a PhD, but who wants to work and he wants to be able to raise a family and he wants his kids to have a better life,” Schmitt said. “He shouldn’t have to compete with foreign labor for that.”\n\n“Work is important for people. It gives them meaning,” Schmitt continued. “And I think if we’re honoring the dignity of every individual, which we should, that’s a big part of what we should be fighting for. And President Trump tapped into that in a way that no political figure in my lifetime has ever really tapped into because he met the American people really where they were.”\n\nIn doing so, Trump reversed what the Washington Post and New York Times seemed to think was inevitable.\n\n“The Left understands they were playing a game of getting a permanent majority and total control,” Schmitt said. “It’s important, I think, to remember how close we were to maybe losing all of this.”\n\n“If they had the House and they had the Senate and [Joe] Biden or [Kamala] Harris or somebody else was in the White House,” Schmitt continued, “they would eliminate the filibuster in the Senate. They’d add states to the union. They would pack the United States Supreme Court. They would get mass amnesty. They’d add a bunch of new voters and they very well could have been in the majority for a very, very long time.”\n\n“Trump is a unique political figure in that way,” Schmitt claimed. “He was able to break through, and that’s why they came at him so hard.” But the task for the next generation of Republican leaders like Schmitt will be not to squander the inheritance they will receive from Trump.","summary":"It was not very long ago that liberal writers would rhapsodize about how America’s changing demographics would spell Republicans’ doom. A 2012 headline from The... Read More\n\n\nThe post How President Trump Stopped Democrats’ Plan for Permanent Power appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/29/how-president-trump-stopped-democrats-plan-permanent-power/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/Schmitt-WP.jpg","video":null,"publish_date":"2025-05-29 19:30:58","author":"Bradley Devlin","authors":["Bradley Devlin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.263},{"id":326234348,"title":"Original Sin, the Biden Cover-Up Book, Is Better Late Than Never","text":"The public at large is now well aware that Democratic Party elites worked to hide President Joe Biden's cognitive decline from the public, and the mainstream media was either complicit in this scheme or incurious enough to unmask it. Critics of the media, including many conservative, libertarian, leftist, and independent thinkers, have thus been enjoying something of a victory lap—the exposure of the Biden cover-up is a great told you so moment for contrarian commentators.\n\nGiven all this, nonliberals were clearly disinclined to extend the benefit of the doubt to CNN's Jake Tapper, who has just published a book about Biden's decline. That book, co-authored by Alex Thompson, an Axios reporter who did pursue the Biden decline beat with some fervency, is called Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again. Tapper has drawn criticism, including from Megyn Kelly, for previously dismissing Lara Trump when she raised the issue of Biden's infirmity. In response, Tapper asserts that his dismissiveness was a huge mistake and that he is ashamed that he did not pursue this story more aggressively.\n\nIn any case, the book should be judged on its own merits. And even readers who are profoundly distrustful of Tapper should pick up a copy. It's very good.\n\nOriginal Sin contains a wealth of new information, even for people who have closely followed developments in the cognitive decline cover-up. Here are some of my reactions to the relevant passages.\n\n Tapper and Thompson persuasively demonstrate that the shielding of Biden from public scrutiny was accomplished by a shockingly limited number of top aides, nicknamed the \"politburo.\" Just four or five people were in the know: advisers Mike Donilon, Steve Richetti, and Anita Dunn; Chief of Staff Ron Klain; and an incredibly small handful of others. By carefully limiting his public appearances, they managed to estrange Biden from his own Cabinet (though not entirely), congressional leaders, and ultimately voters. Contrary to some media assertions, Biden's cognitive decline was not a sudden development late in the campaign. His capacities had been greatly diminished for years. If anything, the real turning point was the death of his son, Beau, in 2015. While he still had some good days in the following years, there was a clear difference in his overall behavior. To that end, the COVID-19 pandemic was an exceedingly lucky break for Biden, because it gave him an excuse to campaign virtually, in a carefully controlled environment. The demands of a regular campaign would have exposed Biden as unfit for office, even in 2020. The decision to run for reelection was made by Biden, in consultation with his family: Jill Biden, Hunter Biden, and other people with the last name Biden. It was not made by his aides. It was announced to them, and they did not protest. In fact, the aides had essentially learned never to question the Biden family: Staffers who did ask questions were quickly sidelined. Jill Biden's senior adviser, Anthony Bernal, was a particularly militant enforcer. While the politburo was highly effective at hiding Biden, many Democrats had ample reason to suspect something was amiss. Anonymous former Cabinet officials tell Tapper and Thompson that their (infrequent) meetings with the president were so painful that it made them fearful for the country's national security. It is telling that none of them went public about this at the time, a decision that should haunt Cabinet officials who aspire to future office: most notably, Pete Buttigieg and, of course, Kamala Harris. \n\nWhat should we take away from all of this? Next time a president virtually disappears from the public, refuses to meet with officials in the mornings and evenings, and looks like a shell of his former self during the rare moments he is out and about, the media might just want to ask a question or two. Even so, better late than never.\n\nThis Week on Free Media\n\nWe are taping Free Media later this week, so the new episode isn't out yet. Check the Reason's Free Media YouTube channel for fresh content later tonight and tomorrow!\n\nWorth Watching\n\nI'm joining another internet news and debate show! You're probably thinking that between Free Media and Rising, the last thing the world needs is more commentary from Robby Soave. To that I say: Let the market decide, mwahaha.\n\nThe show is called The Group Chat, and it's debuting on 2WAY, a new platform and YouTube channel pioneered by journalist Mark Halperin. It's a five-person debate that spans the political spectrum, featuring Batya Ungar-Sargon, Dan Turrentine, Emma-Jo Morris, Nina Turner, and me. Episodes will air on Thursdays at 4 p.m., and our debut episode is today. Tune in!","summary":"Even readers who are profoundly distrustful of Jake Tapper should pick up a copy.","url":"https://reason.com/2025/05/29/original-sin-the-biden-cover-up-book-is-better-late-than-never/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/05/sipaphotostwentytwo617970-scaled.jpg","video":null,"publish_date":"2025-05-29 18:23:49","author":"Jack Nicastro,Robby Soave","authors":["Jack Nicastro","Robby Soave"],"language":"en","source_country":"us","sentiment":-0.009},{"id":326227818,"title":"New Study Reveals Why Trump Is So Popular Among Minority Voters","text":"A new study could shed light on one reason President Donald Trump may have gained ground with minority voters, who previously supported Democrats, in the 2024 presidential race.Why It MattersTrump's 2024 victory was in part due to his relative strength among Latino, Black and Asian and Pacific Islander voters who have drifted away from Democrats. The question about why these voters shifted rightward has perplexed some on the left, who are seeking to win them back in the 2026 midterms and beyond.The new study, published this month in Psychological Science, offers one explanation about this phenomenon.What to KnowEthnic minorities were closer in their attitudes about \"strong leaders\" to right-leaning white Americans compared to left-leaning white Americans, according to the study. Trump has in the past been compared to a \"strong leader,\" defined by the study as leaders who are \"tough, ironfisted, and viewed by supporters as dedicated to the pursuit of their goals.\"The study focused on minorities both in the U.S. and Europe—not on Trump specifically, though Krishnan Nair, a postdoctoral research associate at the University of Illinois Urbana-Champaign who is an author of the study, told Newsweek it could have implications on his electoral strength with some voting groups.The study found that levels of \"generalized trust,\" which is the level of trust a person has in others living around them, is a key factor in shaping leadership preferences. It noted that while there have been decades worth of studies on support for strong leaders among the right, those studies have mostly been made up of white participants.\"Minorities across ethnic and political backgrounds are generally closer to right-wing Whites than to left-wing Whites in their preference for strong leaders,\" Nair said. \"That's important because Trump being this prototypical strong leader, we also see a minority shift toward Trump even as Trump's rhetoric is viewed by a lot of people as being racially insensitive or offensive.\"Minorities may have lower levels of generalized trust if they are recent immigrants from countries with lower generalized trust or due to their social standing in the U.S, he said. Nair explained how this could translate to support for strong leadership.\"Imagine yourself in a group and you don't trust others in the group, to cooperate, you think others might be likely to exploit you,\" he said. \"In this situation, there's this idea that having a strong leader who punishes those who are rule breakers or don't cooperate or might exploit you, that reduces that kind of behavior and creates more cooperation or harmony.\"New data analysis released this week from Catalist showed how Democrats last ground among different racial groups in recent years.In 2024, 85 percent of Black voters supported former Vice President Kamala Harris—down from 89 percent who backed former President Joe Biden in 2020 and 93 percent who backed former Secretary of State Hillary Clinton in 2016.Meanwhile, 54 percent of Latino voters supported Harris—down from 63 percent who supported Biden in 2020 and 70 percent who backed Clinton in 2016. Sixty-one percent of Asian American and Pacific Islander voters backed Harris, compared to 65 percent who voted for Biden in 2020 and 70 percent who voted for Clinton in 2016, according to Catalist.What People Are SayingNair told Newsweek: \"I think this perception of your leader as being someone who's tough, strong and dominant, that could potentially play role in increasing support among minority voters, potentially. But that's something you need a lot more research on.\"William Frey of the Brookings Institution wrote in a December 2024 report: \"This year's very real shift among Latino or Hispanic voters is only a bit sharper than the one observed in the Bush-Kerry election of 2004, after which more Latino or Hispanic voters returned to the Democratic fold. Indeed, the shift away from 2020 and earlier elections among more vulnerable members of these minority groups could very well be a blip that was part of a nationwide reaction to the high price of groceries, housing, and other necessities that accompanied a once-in-a-century pandemic, which led to similar rightward political shifts in other developed countries.\"What Happens NextIt will be closely watched whether Democrats can win back voters who shifted toward Republicans in upcoming elections, including early tests for the parties in the New Jersey and Virginia gubernatorial races later this year. It's yet to be seen whether this is part of a longer-term trend.","summary":"A new study lays out one potential reason for why Trump gained ground with Latino, Black and Asian voters in 2024..","url":"https://www.newsweek.com/new-study-reveals-why-trump-popular-minority-voters-2078601","image":"https://d.newsweek.com/en/full/2653608/study-trump-minority-voters.jpg","video":null,"publish_date":"2025-05-29 18:10:10","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":0.074},{"id":326227826,"title":"White House Calls on Jill Biden to Testify to Congress Over 'Coverup'","text":"Speaking to reporters on Thursday, White House press secretary Karoline Leavitt called on former first lady Jill Biden to testify in front of Congress over an alleged \"coverup\" of the former president's declining health while in office.Why It MattersHouse Oversight Committee Chairman James Comer, a Republican from Kentucky, is calling for transcribed interviews with several senior staffers from former President Joe Biden's White House, alleging they played a role in secretly working to conceal Biden's cognitive decline during his presidency.Comer suggested this week that he may also issue subpoenas to former White House Press Secretary Karine Jean-Pierre, as well as Hunter Biden and Jill Biden.What to KnowIn response to a question from Fox News' Peter Doocy about Comer's congressional demands, Leavitt said, \"I think, frankly, the former first lady should certainly speak up about what she saw in regards to her husband and when she saw it and what she knew.\"She continued, \"I think anybody looking at the videos and photo evidence of Joe Biden with your own eyes and a little bit of common sense can see, this was a clear coverup, and Jill Biden was certainly complicit in that coverup. There's documentation and video evidence of her clearly trying to shield her husband away from the cameras.\"Newsweek has reached out to Jill Biden Thursday afternoon via the former president's contact page for comment.Biden stepped aside on the presidential campaign trail last year amid fears for his health and cognitive abilities, which left Vice President Kamala Harris at the top of the Democratic ticket.Now, a new book by CNN's Jake Tapper and Axios' Alex Thompson, which has shot to the top of the bestseller charts, suggests that senior members of Biden's administration were aware of his fragile health for some time before he stepped down.Tapper said this week that the alleged scandal \"may be even worse than Watergate.\"What People Are SayingComer told reporters this week, \"Obviously, we're interested in Jean Pierre. ... We're also interested in Jill Biden and Hunter Biden. \"If the trail leads us to the next step, which many believe would be perhaps Jill Biden and Hunter Biden, then we will go there.\"Leavitt also ripped the former first lady over her remarks during a recent appearance with former President Biden on The View last week: \"She was saying everything is fine. She's still lying to the American people. She still thinks the American public are so stupid that they're going to believe her lies, and frankly it's insulting, and she needs to answer for it.What Happens NextComer said Wednesday night he's even \"open\" to bringing former President Biden before the House Oversight Committee as part of his investigation into the 82-year-old's cognitive condition and alleged use of an autopen to authorize documents.\"We're going to see who was giving the directive to sign these,\" Comer told Fox News' Sean Hannity. \"If everyone says it was Joe Biden, then I'm certainly open to bringing him in.\"This is developing news and will be updated as more information is available.Update: 5/29/25, 2:35 p.m. ET: This article has been updated with additional information and remarks.Update: 5/29/25, 2:41 p.m. ET: This article has been updated with additional information and remarks.","summary":"Comer, a Republican from Kentucky, is calling for transcribed interviews with senior staffers from former President Biden's admin.","url":"https://www.newsweek.com/white-house-calls-jill-biden-testify-congress-over-coverup-2078646","image":"https://d.newsweek.com/en/full/2653678/bidens-trump.jpg","video":null,"publish_date":"2025-05-29 18:01:58","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.074},{"id":326220618,"title":"Paramount’s blockbuster settlement bid: Millions offered to Trump to quash $20 billion suit and clear Skydance merger","text":"Paramount is hoping that a hefty financial offer might help resolve one of its biggest roadblocks to a long-anticipated merger with Skydance: US President Donald Trump’s $20 billion lawsuit, as per a report.Trump Lawsuit Demands Sky-High SettlementWhile there’s no deal yet, sources close to the negotiations told Deadline that the Shari Redstone-controlled media company has made an “eight-figure” offer to the president in an effort to put the case behind them, according to the Deadline report. The lawsuit, filed by Trump late last year, centers on claims that CBS’ 60 Minutes deceptively edited an interview with then-Democratic nominee Kamala Harris in the final stretch of the 2024 election, according to the report.A source familiar with the talks between Trump’s lawyers and Paramount’s attorneys and executives told Deadline, “It’s very early days,” adding that, “An opening offer has been made, but more negotiations are underway,” quoted Deadline.According to The Wall Street Journal, Paramount has offered $15 million so far, but Trump’s legal team is reportedly wanting $25 million and a public apology from CBS News.ALSO READ: Royal Caribbean's Star of the Seas to finally sail in August — destination, departure date, and bookings nearly fullMerger Pressure Builds Behind the ScenesThis lawsuit came at a time when Paramount is in the process of trying to finalise an $8 billion merger with David Ellison’s Skydance Media, an effort backed by Ellison’s father, tech billionaire Larry Ellison, and RedBird Capital, according to Deadline.The merger, announced in July, still requires federal approval, and the progress has slowed as the FCC, led by Chair Brendan Carr, a Trump appointee, reviews the deal, as per the report. Deadline reported that, before Carr started his role as FCC chair, he had mentioned that the 60 Minutes complaint, which also is the subject of Trump’s lawsuit, was “likely to arise” as part of the merger review. However, Carr later said that Trump’s lawsuit is on a totally separate track from the merger consideration, reported Deadline.FAQsWhy is Trump suing CBS and Paramount?He claims CBS’ 60 Minutes misrepresented an interview with Kamala Harris.How much is Paramount offering to pay?Paramount reportedly offered $15 million to settle.","summary":"Paramount is reportedly attempting to resolve Donald Trump's $20 billion lawsuit, a major obstacle to its merger with Skydance. The lawsuit alleges that CBS's '60 Minutes' deceptively edited an interview with Kamala Harris. Paramount has offered Trump $15 million to settle, but his legal team is seeking $25 million and a public apology from CBS News.","url":"https://economictimes.indiatimes.com/news/international/us/paramounts-blockbuster-settlement-bid-millions-offered-to-trump-to-quash-20-billion-suit-and-clear-skydance-merger-donald-trump-news/articleshow/121495940.cms","image":"https://img.etimg.com/thumb/msid-121496143,resizemode-4,width-1200,height-900,imgsize-39740,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-29 17:21:52","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":-0.143},{"id":326203562,"title":"Lone Biden official breaks silence on cognitive decline as Cabinet stays mute","text":"Only a single member of former President Joe Biden's cabinet responded to a massive outreach effort from Fox News Digital asking if the more than two dozen cabinet-level officials stood by previous remarks that Biden was mentally and physically fit to serve as president. And even that lone statement, from former Health and Human Services Secretary Xavier Becerra, skirted addressing head-on whether he had witnessed instances of Biden's now widely acknowledged cognitive issues. \"I met with President Biden when needed to make important decisions and to execute with my team at HHS,\" Becerra said. \"It’s clear the President was getting older, but he made the mission clear: run the largest health agency in the world, expand care to millions more Americans than ever before, negotiate down the cost of prescription drugs, and pull us out of a world-wide pandemic. And we delivered.\" Roughly four months after Biden's Oval Office exit, a handful of political books detailing the 2024 campaign and Biden administration have hit store shelves and are painting a bleak picture of Biden's health. Adding fuel to the fire, audio recordings of Biden's October 2023 interview with former Special Counsel Robert Hur showed the former president tripping over his words, slurring sentences, taking long pauses between answers and struggling to remember key moments in his life, including the year his son Beau died of cancer. BIDEN'S WOES CONVERGE: LAST-MINUTE PARDONS UNDER FIRE, CALLS FOR PROSECUTION MOUNT FOLLOWING HUR TAPE RELEASE Fox News Digital has written extensively dating back to the 2020 presidential campaign about Biden's cognitive decline and his inner circle’s role in covering it up. BIDEN’S CABINET OFFICIALS STAND BY STATEMENTS OF SUPPORT AS TERM DRAWS TO A CLOSE Becerra's statement stood in marked contrast to the silence emanating from the rest of his former colleagues. Fox News Digital reached out to 26 Biden administration officials with cabinet-level positions — from former Vice President Kamala Harris to former Chief of Staff Jeff Zients — asking whether they still believe that Biden was fit to serve as president, or whether they've had a change of heart amid the cascade of damning evidence and anecdotes portraying a mental decline. If a majority of those cabinet-level officials believed Biden to be unable to perform his duties, they could have attempted to remove him from office through the 25th Amendment. Instead, those officials repeatedly said at the time that Biden was competent and in command. That talking point hasn't abated among the former officials. Former Transportation Secretary Pete Buttigieg weighed in on Biden's presidential health earlier in May during a town hall with veterans and military families in Iowa. When asked during the event whether Biden experienced cognitive decline, Buttigieg told reporters that \"every time I needed something from him from the West Wing, I got it.\" \"The time I worked closest with him in his final year was around the Baltimore bridge collapse,\" he added. \"And what I can tell you is that the same president the world saw addressing that was the president I was in the Oval with, insisting that we do a good job, do right by Baltimore. And that was characteristic of my experience with him.\" Buttigieg did not elaborate when responding to a separate inquiry from Fox News Digital. Biden's office recently revealed that the former president was diagnosed with aggressive prostate cancer that had metastasized and was undergoing treatment. The diagnosis sparked an outpouring of well-wishes from political leaders across both aisles, and shock from some doctors who said such cancer should have been caught before it advanced and metastasized. None of Biden's annual physical health reports as president tested for prostate cancer, Fox News Digital previously reported, with a representative confirming Biden's last-known prostate blood test was conducted in 2014. ‘FULL CONFIDENCE’ The 2024 presidential debate between Biden and President Donald Trump opened the floodgates of criticism surrounding Biden's mental acuity after the 46th president's poor performance, which included Biden losing his train of thought and stumbling over his words. CRITICISMS MOUNT THAT BIDEN IS A 'SHADOW' OF HIMSELF AFTER DISASTROUS DEBATE: 'NOT THE SAME MAN' FROM VP ERA Concerns over Biden's mental acuity had simmered for years among conservatives, but it wasn't until the June 2024 presidential debate that traditional Democrat allies and media outlets began questioning Biden's health and openly called for him to drop out of the race. Despite mounting concerns, members of Biden's cabinet vowed he was of sound health and mind. Then-Department of Homeland Security Secretary Alejandro Mayorkas said in a statement in September 2024, for example, that he has \"full confidence in President Biden’s ability to carry out his job.\" BIDEN'S PRESIDENCY WILL BE REMEMBERED AS THE ‘MAN THAT WAS TOO OLD,’ SAYS BYRON YORK \"As I’ve said before, I come fully prepared for my meetings with President Biden, knowing his questions will be detail-oriented, probing, and exacting,\" he said. \"In our exchanges, the President always draws upon our prior conversations and past events in analyzing the issues and reaching his conclusions.\" Conservatives in 2024 floated calling for the invocation of the 25th Amendment to remove Biden, which would have required Harris and the majority of the cabinet to declare him unfit to lead. Harris and the cabinet did not take such steps during the administration, and instead defended his health. BIDEN'S PRESIDENTIAL HEALTH REPORTS SHOWED NO SIGN OF RECENTLY REVEALED AGGRESSIVE CANCER In July 2024, Secretary of Commerce Gina Raimondo called Biden \"one of the most accomplished presidents in American history and continues to effectively lead our country with a steady hand.\" \"As someone who is actually in the room when the President meets with the cabinet and foreign leaders, I can tell you he is an incisive and extraordinary leader,\" Raimondo said at the time. 'PHYSICAL DETERIORATION' Since Biden's exit from the White House in January, political journalists have published a handful of books arguing that, behind the scenes of the administration, staffers were concerned about Biden's health. \"Biden's physical deterioration — most apparent in his halting walk — had become so severe that there were internal discussions about putting the president in a wheelchair, but they couldn't do so until after the election,\" according to a new book written by CNN's Jake Tapper and Axios reporter Alex Thompson, \"Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again.\" \"Given Biden's age, (his physician Kevin O'Connor) also privately said that if he had another bad fall, a wheelchair might be necessary for what could be a difficult recovery,\" the authors wrote. While another newly released book by longtime D.C. reporters Jonathan Allen and Amie Parnes, \"Fight: Inside the Wildest Battle for the White House,\" investigated Biden's mental decline in the lead-up to the general election, calling him a \"shell of himself.\" \"All of them,\" Parnes told Vanity Fair in April of who in Biden's inner circle was most to blame for covering up his mental decline when he was in office. \"It’s pretty remarkable how they kept him very closed off,\" Parnes said. \"He was a shell of himself. When he entered the White House, he was so, so different from the man who I covered as vice president, a guy who would hold court in the Naval Observatory with reporters until the wee hours.\" HUNTER BIDEN PARDON: MEDIA TAKES LATEST BLOW TO CREDIBILITY WITH BOTCHED COVERAGE OF BROKEN PROMISE \"We’d been watching Biden’s decline for a long period of time and, honestly, thought he had lost his fastball some when he was running in 2020,\" Allen added of Biden's mental decline. \"And it was still so shocking to see the leader of the free world so bereft of coherent thought.\" Earlier in May, hours of Biden's October 2023 interview with Hur's office were released to the public and underscored the president's apparent mental decline from his days as a senator from Delaware. Hur led an investigation into Biden's handling of classified documents after Biden's departure as vice president during the Obama administration. The then-special counsel announced in February 2024 he would not recommend criminal charges against Biden for possessing classified materials after his vice presidency, saying Biden is \"a sympathetic, well-meaning, elderly man with a poor memory.\" Hur came under fire from Biden, Harris and other Democrats in 2024 for suggesting in the report that Biden could not remember when his son Beau died. Beau Biden died of brain cancer in 2015. In February 2024, following the release of the report, Biden shot back at Hur: \"There’s some attention paid to some language in the report about my recollection of events. There’s even a reference that I don’t remember when my son died. How in the hell dare he raise that?\" BIDEN STRUGGLES WITH WORDS, KEY MEMORIES IN LEAKED AUDIO FROM SPECIAL COUNSEL HUR INTERVIEW Harris called the report \"gratuitous, inaccurate and inappropriate.\" The recently released audio recordings show it was Biden who brought up his son and could not remember when Beau died. \"So, during this time when you were living at Chain Bridge Road and there were documents relating to the Penn Biden Center, or the Biden Institute, or the Cancer Moonshot or your book, where did you keep papers that related to those things that you were actively working on?\" Hur asked Biden in the interview. \"Well, um … I, I, I, I, I don't know. This is, what, 2017, 2018, that area?\" Biden responded. \"Yes, sir,\" Hur said. \"Remember, in this timeframe, my son is either been deployed or is dying, and, and so it was and by the way, there were still a lot of people at the time when I got out of the Senate that were encouraging me to run in this period, except the president,\" Biden continued. \"I'm not — and not a mean thing to say. He just thought that she (Hillary Clinton) had a better shot of winning the presidency than I did. And so I hadn't, I hadn't, at this point — even though I'm at Penn, I hadn't walked away from the idea that I may run for office again. But if I ran again, I'd be running for president. And, and so what was happening, though — what month did Beau die? Oh, God, May 30th.\" Others present during the interview responded that Beau Biden died in 2015. Trump has called an alleged cover-up of Biden's health a \"scandal\" and has argued that White House staffers were controlling the administration through the use of an autopen. WHAT IS AN AUTOPEN? THE SIGNING DEVICE AT THE HEART OF TRUMP'S ATTACKS ON BIDEN PARDONS Autopen signatures are automatically produced by a machine, as opposed to an authentic, handwritten signature. The conservative Heritage Foundation's Oversight Project first investigated the Biden administration's use of an autopen earlier in 2025 and found that the same signature was on a bevvy of executive orders and other official documents, while Biden’s signature on the document announcing his departure from the 2024 race varied from the apparent machine-produced signature. CLICK HERE TO GET THE FOX NEWS APP \"Whoever had control of the 'AUTOPEN' is looking to be a bigger and bigger scandal by the moment,\" Trump posted to Truth Social in May.","summary":"Former President Joe Biden&apos;s Cabinet members are overwhelmingly staying silent on the former president&apos;s mental fitness amid reports of his mental and physical decline.","url":"https://www.foxnews.com/politics/lone-biden-official-breaks-silence-cognitive-decline-cabinet-stays-mute","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/04/931/523/0dde9e97-Joe-Biden.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-29 16:35:11","author":"Alec Schemmel,Deirdre Heavey,Emma Colton,Morgan Phillips,Peter Pinedo","authors":["Alec Schemmel","Deirdre Heavey","Emma Colton","Morgan Phillips","Peter Pinedo"],"language":"en","source_country":"us","sentiment":-0.09},{"id":326188466,"title":"Lone Biden official breaks silence on cognitive decline as cabinet stays mute","text":"Only a single member of former President Joe Biden's cabinet responded to a massive outreach effort from Fox News Digital asking if the more than two dozen cabinet-level officials stood by previous remarks that Biden was mentally and physically fit to serve as president. And even that lone statement, from former Health and Human Services Secretary Xavier Becerra, skirted addressing head-on whether he had witnessed instances of Biden's now widely acknowledged cognitive issues. \"I met with President Biden when needed to make important decisions and to execute with my team at HHS,\" Becerra said. \"It’s clear the President was getting older, but he made the mission clear: run the largest health agency in the world, expand care to millions more Americans than ever before, negotiate down the cost of prescription drugs, and pull us out of a world-wide pandemic. And we delivered.\" Roughly four months after Biden's Oval Office exit, a handful of political books detailing the 2024 campaign and Biden administration have hit store shelves and are painting a bleak picture of Biden's health. Adding fuel to the fire, audio recordings of Biden's October 2023 interview with former Special Counsel Robert Hur showed the former president tripping over his words, slurring sentences, taking long pauses between answers and struggling to remember key moments in his life, including the year his son Beau died of cancer. BIDEN'S WOES CONVERGE: LAST-MINUTE PARDONS UNDER FIRE, CALLS FOR PROSECUTION MOUNT FOLLOWING HUR TAPE RELEASE Fox News Digital has written extensively dating back to the 2020 presidential campaign about Biden's cognitive decline and his inner circle’s role in covering it up. BIDEN’S CABINET OFFICIALS STAND BY STATEMENTS OF SUPPORT AS TERM DRAWS TO A CLOSE Becerra's statement stood in marked contrast to the silence emanating from the rest of his former colleagues. Fox News Digital reached out to 26 Biden administration officials with cabinet-level positions — from former Vice President Kamala Harris to former Chief of Staff Jeff Zients — asking whether they still believe that Biden was fit to serve as president, or whether they've had a change of heart amid the cascade of damning evidence and anecdotes portraying a mental decline. If a majority of those cabinet-level officials believed Biden to be unable to perform his duties, they could have attempted to remove him from office through the 25th Amendment. Instead, those officials repeatedly said at the time that Biden was competent and in command. That talking point hasn't abated among the former officials. Former Transportation Secretary Pete Buttigieg weighed in on Biden's presidential health earlier in May during a town hall with veterans and military families in Iowa. When asked during the event whether Biden experienced cognitive decline, Buttigieg told reporters that \"every time I needed something from him from the West Wing, I got it.\" \"The time I worked closest with him in his final year was around the Baltimore bridge collapse,\" he added. \"And what I can tell you is that the same president the world saw addressing that was the president I was in the Oval with, insisting that we do a good job, do right by Baltimore. And that was characteristic of my experience with him.\" Buttigieg did not elaborate when responding to a separate inquiry from Fox News Digital. Biden's office recently revealed that the former president was diagnosed with aggressive prostate cancer that had metastasized and was undergoing treatment. The diagnosis sparked an outpouring of well-wishes from political leaders across both aisles, and shock from some doctors who said such cancer should have been caught before it advanced and metastasized. None of Biden's annual physical health reports as president tested for prostate cancer, Fox News Digital previously reported, with a representative confirming Biden's last-known prostate blood test was conducted in 2014. ‘FULL CONFIDENCE’ The 2024 presidential debate between Biden and President Donald Trump opened the floodgates of criticism surrounding Biden's mental acuity after the 46th president's poor performance, which included Biden losing his train of thought and stumbling over his words. CRITICISMS MOUNT THAT BIDEN IS A 'SHADOW' OF HIMSELF AFTER DISASTROUS DEBATE: 'NOT THE SAME MAN' FROM VP ERA Concerns over Biden's mental acuity had simmered for years among conservatives, but it wasn't until the June 2024 presidential debate that traditional Democrat allies and media outlets began questioning Biden's health and openly called for him to drop out of the race. Despite mounting concerns, members of Biden's cabinet vowed he was of sound health and mind. Then-Department of Homeland Security Secretary Alejandro Mayorkas said in a statement in September 2024, for example, that he has \"full confidence in President Biden’s ability to carry out his job.\" BIDEN'S PRESIDENCY WILL BE REMEMBERED AS THE ‘MAN THAT WAS TOO OLD,’ SAYS BYRON YORK \"As I’ve said before, I come fully prepared for my meetings with President Biden, knowing his questions will be detail-oriented, probing, and exacting,\" he said. \"In our exchanges, the President always draws upon our prior conversations and past events in analyzing the issues and reaching his conclusions.\" Conservatives in 2024 floated calling for the invocation of the 25th Amendment to remove Biden, which would have required Harris and the majority of the cabinet to declare him unfit to lead. Harris and the cabinet did not take such steps during the administration, and instead defended his health. BIDEN'S PRESIDENTIAL HEALTH REPORTS SHOWED NO SIGN OF RECENTLY REVEALED AGGRESSIVE CANCER In July 2024, Secretary of Commerce Gina Raimondo called Biden \"one of the most accomplished presidents in American history and continues to effectively lead our country with a steady hand.\" \"As someone who is actually in the room when the President meets with the cabinet and foreign leaders, I can tell you he is an incisive and extraordinary leader,\" Raimondo said at the time. 'PHYSICAL DETERIORATION' Since Biden's exit from the White House in January, political journalists have published a handful of books arguing that, behind the scenes of the administration, staffers were concerned about Biden's health. \"Biden's physical deterioration — most apparent in his halting walk — had become so severe that there were internal discussions about putting the president in a wheelchair, but they couldn't do so until after the election,\" according to a new book written by CNN's Jake Tapper and Axios reporter Alex Thompson, \"Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again.\" \"Given Biden's age, (his physician Kevin O'Connor) also privately said that if he had another bad fall, a wheelchair might be necessary for what could be a difficult recovery,\" the authors wrote. While another newly released book by longtime D.C. reporters Jonathan Allen and Amie Parnes, \"Fight: Inside the Wildest Battle for the White House,\" investigated Biden's mental decline in the lead-up to the general election, calling him a \"shell of himself.\" \"All of them,\" Parnes told Vanity Fair in April of who in Biden's inner circle was most to blame for covering up his mental decline when he was in office. \"It’s pretty remarkable how they kept him very closed off,\" Parnes said. \"He was a shell of himself. When he entered the White House, he was so, so different from the man who I covered as vice president, a guy who would hold court in the Naval Observatory with reporters until the wee hours.\" HUNTER BIDEN PARDON: MEDIA TAKES LATEST BLOW TO CREDIBILITY WITH BOTCHED COVERAGE OF BROKEN PROMISE \"We’d been watching Biden’s decline for a long period of time and, honestly, thought he had lost his fastball some when he was running in 2020,\" Allen added of Biden's mental decline. \"And it was still so shocking to see the leader of the free world so bereft of coherent thought.\" Earlier in May, hours of Biden's October 2023 interview with Hur's office were released to the public and underscored the president's apparent mental decline from his days as a senator from Delaware. Hur led an investigation into Biden's handling of classified documents after Biden's departure as vice president during the Obama administration. The then-special counsel announced in February 2024 he would not recommend criminal charges against Biden for possessing classified materials after his vice presidency, saying Biden is \"a sympathetic, well-meaning, elderly man with a poor memory.\" Hur came under fire from Biden, Harris and other Democrats in 2024 for suggesting in the report that Biden could not remember when his son Beau died. Beau Biden died of brain cancer in 2015. In February 2024, following the release of the report, Biden shot back at Hur: \"There’s some attention paid to some language in the report about my recollection of events. There’s even a reference that I don’t remember when my son died. How in the hell dare he raise that?\" BIDEN STRUGGLES WITH WORDS, KEY MEMORIES IN LEAKED AUDIO FROM SPECIAL COUNSEL HUR INTERVIEW Harris called the report \"gratuitous, inaccurate and inappropriate.\" The recently released audio recordings show it was Biden who brought up his son and could not remember when Beau died. \"So, during this time when you were living at Chain Bridge Road and there were documents relating to the Penn Biden Center, or the Biden Institute, or the Cancer Moonshot or your book, where did you keep papers that related to those things that you were actively working on?\" Hur asked Biden in the interview. \"Well, um … I, I, I, I, I don't know. This is, what, 2017, 2018, that area?\" Biden responded. \"Yes, sir,\" Hur said. \"Remember, in this timeframe, my son is either been deployed or is dying, and, and so it was and by the way, there were still a lot of people at the time when I got out of the Senate that were encouraging me to run in this period, except the president,\" Biden continued. \"I'm not — and not a mean thing to say. He just thought that she (Hillary Clinton) had a better shot of winning the presidency than I did. And so I hadn't, I hadn't, at this point — even though I'm at Penn, I hadn't walked away from the idea that I may run for office again. But if I ran again, I'd be running for president. And, and so what was happening, though — what month did Beau die? Oh, God, May 30th.\" Others present during the interview responded that Beau Biden died in 2015. Trump has called an alleged cover-up of Biden's health a \"scandal\" and has argued that White House staffers were controlling the administration through the use of an autopen. WHAT IS AN AUTOPEN? THE SIGNING DEVICE AT THE HEART OF TRUMP'S ATTACKS ON BIDEN PARDONS Autopen signatures are automatically produced by a machine, as opposed to an authentic, handwritten signature. The conservative Heritage Foundation's Oversight Project first investigated the Biden administration's use of an autopen earlier in 2025 and found that the same signature was on a bevvy of executive orders and other official documents, while Biden’s signature on the document announcing his departure from the 2024 race varied from the apparent machine-produced signature. CLICK HERE TO GET THE FOX NEWS APP \"Whoever had control of the 'AUTOPEN' is looking to be a bigger and bigger scandal by the moment,\" Trump posted to Truth Social in May.","summary":"Former President Joe Biden&apos;s cabinet members are overwhelmingly staying silent on the former president&apos;s mental fitness amid reports of his mental and physical decline.","url":"https://www.foxnews.com/politics/only-one-bidens-cabinet-speaks-out-about-his-fitness-amid-cognitive-decline-questions","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/bidencabinet.png?ve=1&tl=1","video":null,"publish_date":"2025-05-29 16:35:11","author":"Alec Schemmel,Deirdre Heavey,Emma Colton,Morgan Phillips,Peter Pinedo","authors":["Alec Schemmel","Deirdre Heavey","Emma Colton","Morgan Phillips","Peter Pinedo"],"language":"en","source_country":"us","sentiment":-0.09},{"id":326221872,"title":"Tyler Perry, Terri Vaughn Sued Over ‘She The People’ Netflix Series","text":"Source: Taylor Hill / Getty A lawsuit alleges that Tyler Perry’s new Netflix series “She The People” infringes on the brand identity and goodwill of a nonprofit organization and political space of the same name. Aimee Allison, president and founder of the nonprofit She the People, filed suit shortly before the release. Allison filed against Netflix, Perry, his company, Tyler Vision, LLC, and actress Terri Vaughn. According to her complaint, Allison previously contracted with Vaughn to develop a docuseries based on the “She the People” concept. She further alleged that Vaughn and Perry’s Netflix series pulls in many of the themes and frames from her work. “The Series echoes many of the same themes regarding Black women’s experiences in politics that Ms. Allison addresses through her activism under the SHE THE PEOPLE mark, albeit in a slightly different format,” reads the complaint. “With a lighthearted and comedic touch, the Series trailer (the “Trailer”) shows the newly-elected lieutenant governor confronting a number of issues likely to resonate with women of color[.]” While the scenarios themselves are not unique, coupled with the She the People brand, it could suggest the unfair usage of Allison’s intellectual property. A quick trademark search shows that Perry applied for the She the People trademark through legal representation. The application was initially denied in part due to the likelihood of confusion with Allison’s existing trademark. Allison has not provided any public comment on the show, but she posted a video last week talking about the importance of defending your brand and creative ideas. A seasoned political strategist, Allison was also a significant supporter of former Vice President Kamala Harris during both her 2020 and 2024 presidential campaigns. Ahead of the 2024 election cycle, Allison launched a podcast under the She the People brand in partnership with Design Observer. In her personal capacity, Allison supported several fierce state and federal candidates for office, including Stacey Abrams. Through She the People and related work, Allison has established a network of relationships and engagements designed to uplift Black and other women of color. Much of her work has involved breaking through stereotypes of who is considered electable and challenging barriers to entry to Black and other women of color into politics. Founded in 2018, She the People has existed as a space of convening and conversation for Black and other women of color. Allison organized two convenings for Black and other women of color political leaders in 2018 and 2019. The 2019 event centered on a presidential forum that elevated the leadership and voices of Black and other women of color leaders and organizers, as well as several major presidential candidates. Several media outlets covered the event and notable moments from several 2020 candidates, including Sen. Bernie Sanders, Sen. Elizabeth Warren, and Vice President Kamala Harris. I attended both convenings first as a staffer with former Democracy for America in 2018 and then as a freelance journalist in 2019. Across every moment, curated under the She the People brand, has been focused on shifting the cultural perception of who can be a leader. Allison has been in conversation with Congressional leaders like Rep. Bonnie Watson Coleman and newly elected Oakland Mayor Barbara Lee. Former Atlanta Mayor Keisha Lance Bottoms said she was glad to sign on as an executive producer despite people in her inner circle warning her to stay away from the project. Despite her involvement in similar social circles, it’s unclear whether Bottoms knew about the “She the People” connection to Allison’s work. “The world is full of people who wish they had good ideas,” Allison said in an Instagram Reel. “And too many who’ll try to take yours when they see it catching fire. So, put your paperwork in place. And prepare to protect the soul of what you’ve built.” SEE ALSO: St. Louis Community Fills Relief Gaps Left by Federal Delay Coalition Pushes New Media Code Of Ethics In Crime Reporting","summary":"Aimee Allison, president and founder of the nonprofit She the People, sued Tyler Perry shortly before the Netflix series’ release. ","url":"https://newsone.com/6191577/tyler-perry-sued-over-she-the-people-netflix-series/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/05/17485354943439.jpg?quality=80&strip=all&w=1024&crop=0,0,100,683px","video":null,"publish_date":"2025-05-29 16:24:48","author":"Anoa Changa","authors":["Anoa Changa"],"language":"en","source_country":"US","sentiment":0.125},{"id":326201914,"title":"Steve Jobs' daughter's high society wedding details revealed - including billionaire guestlist","text":"Eve Jobs, the daughter of the late Apple founder and CEO, Steve Jobs, is set to wed her boyfriend, Harry Charles, in a spectacular wedding in the British countryside very soon.\n\nThe model, 26, whose mother is Laurene Powell Jobs, and the Team GB Olympic gold-winning equestrian, 25, have been dating for a while and made their public debut as a couple at the Paris Olympics in the summer of 2024. Now, their big day is on the horizon.\n\nDespite the finer details of the Big Day being kept under wraps, Richard Eden reports in his Eden Confidential column for Daily Mail that Eve and Harry will be tying the knot in a lavish ceremony in the beautiful and star-studded area of the Cotswolds this summer.\n\nIt's perhaps unsurprising that the pretty Oxfordshire countryside has been chosen as the backdrop of their nuptials since the leafy and affluent area has become a playground for A-listers.\n\nDavid and Victoria Beckham own a farmhouse in the area, as does music mogul Simon Cowell and American former talk show host Ellen DeGeneres.\n\nEve, who is quite the talented rider and show jumper herself, has appeared on the British-born Olympian's Instagram page in numerous loved-up snaps, proving the husband-and-wife-to-be are beautifully matched.\n\nAs the daughter of a tech legend, Eve's guest list at the spectacular wedding is said to be full of fellow elite names. It's been reported that names such as Jennifer Gates, daughter of Microsoft founder Bill and Melinda, and former Vice President Kamala Harris are said to be attending.\n\nAll about Eve Jobs and fiancé Harry Charles\n\nWhen Harry was competing in Paris last year, Eve was front and centre cheering him and his beloved horse, Romeo, on. Harry picked up gold at the event and is also the recipient of a Bronze World Championship medal and a place in the World Cup finals.\n\nIn Eve's riding history, she has also gathered impressive accomplishments. According to Horse Sport, Eve was once ranked the fifth-best rider under 25 in the world. \n\nShe has also competed in the Hamptons Classic tournament and toured the international circuit.\n\n\"I was first put on a pony at two years old, but didn't actually start really riding until I was about six,\" she told Horse Sport in a previous interview, adding: \"I have always had a love and appreciation for animals and I think that passion was evident pretty early on.\"\n\nEve was aged 13 when her father died from pancreatic cancer in 2011. He was 56 years old. Eve has three siblings, Reed, 33, Erin, 29, and a half-sister, Lisa, 48, from Steve's earlier relationship with Chrisann Brennan. \n\nMeanwhile, Eve has notable credentials beyond horse riding. She's a Stanford University graduate and has ventured into the fashion industry.\n\nIn 2020, Eve, who is signed to DNA Model Management, appeared in a Glossier ad campaign and has also walked for Coperni during Paris Fashion Week in 2021.\n\nDespite being the daughter of a billionaire, Eve will not inherit her family’s estimated $21.7 billion fortune. \n\nHer mother previously told the New York Times: \"I'm not interested in legacy wealth building, and my children know that. Steve wasn't interested in that. If I live long enough, it ends with me.\"","summary":"The daughter of late Steve Jobs, billionaire Apple founder and former CEO is getting married in what is set to be a spectacular high society wedding very soon. Find out more…","url":"https://www.hellomagazine.com/brides/834869/steve-jobs-daughters-high-society-wedding-date-revealed/","image":"https://images.hellomagazine.com/horizon/landscape/be3413478f34-eve-jobs-vf.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-05-29 16:15:00","author":"Francesca Shillcock","authors":["Francesca Shillcock"],"language":"en","source_country":"gb","sentiment":0.353},{"id":326203548,"title":"FBI 'closing in' on suspects in case of DC pipe bombs placed on eve of Jan 6","text":"The FBI is ramping up its investigation into pipe bombs planted in Washington, D.C. on the eve of the Jan. 6 Capitol riots in 2021. One top official is now suggesting that after four years, the bureau is getting close to a major break in the case. \"I want answers on this, and I'm pretty confident that we're closing in on some suspects,\" FBI Deputy Director Dan Bongino told \"Fox & Friends\" Thursday, noting the case is a top priority. The FBI renewed its focus on the unsolved case earlier this year. In January, investigators released new video footage showing the person who planted the bombs outside the headquarters of both the Democratic National Committee and the Republican National Committee in Washington, D.C. FBI RELEASES VIDEO SHOWING JANUARY 2021 PIPE BOMB SUSPECT PLANTING DEVICE OUTSIDE DNC, RNC OFFICES IN DC Bongino criticized what he described as a lack of attention to the case during the Biden administration, despite the broader focus on the Jan. 6 Capitol breach, for which over 1,000 people were arrested and convicted. \"We were told by partisan actors out there, this was the insurrection, the world was [going to] fall apart, and no one seemed to show any interest in this case,\" he argued, adding that he and FBI Director Kash Patel have made the pipe bomb investigation a priority for their department. THE 6 BIGGEST FBI SCANDALS UNDER THE BIDEN ADMINISTRATION Besides the video footage, in January the FBI also released more details about the suspect's physical characteristics. They believe the individual to be about 5-foot, 7-inches and to have worn a grey hoodie, face mask, black gloves and Nike Air Max Speed Turf shoes. Investigators claim they’ve followed hundreds of leads, reviewed thousands of video files, and conducted over 1,000 interviews in the case. Bongino emphasized the importance of public involvement and said social media is a vital tool for generating new case leads. FBI REOPENING INVESTIGATION INTO COCAINE FOUND AT BIDEN WHITE HOUSE \"Every time I put a tweet out, we get tips. We got a fascinating tip on one of these cases. One of the three,\" Bongino said, referring to three high-profile cases: the 2021 pipe bombs, the 2022 leak of the Supreme Court’s Dobbs decision on abortion and the cocaine discovered in the White House in 2023. 'WHEN THEY FAIL, AMERICANS DIE': TRUMP SOURCE BLASTS FBI, URGES SWIFT CONFIRMATION OF KASH PATEL AS DIRECTOR \"I don’t [want to] say which one, but I'm pretty confident that we’re going to close out one of them, hopefully, soon.\" Although no one was injured in the 2021 pipe bomb incident, authorities say the attack could have been deadly. Then Vice President-elect Kamala Harris was inside the DNC’s offices when the pipe bomb was discovered. Then-House Speaker Nancy Pelosi also passed by the bomb before it was discovered and safely removed by authorities. CLICK HERE TO GET THE FOX NEWS APP The FBI is offering a $500,000 reward for information leading to an arrest in the case.","summary":"FBI Deputy Director Dan Bongino says they’re “closing in&quot; on suspect who planted pipe bombs outside the DNC and RNC on the eve of the January 6th Capitol riots in Washington.","url":"https://www.foxnews.com/media/fbi-closing-in-suspects-case-dc-pipe-bombs-placed-eve-jan-6","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/1200/675/bongino-2.png?ve=1&tl=1","video":null,"publish_date":"2025-05-29 16:08:52","author":"Madison Colombo","authors":["Madison Colombo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.222},{"id":326214124,"title":"Trump demands bigger bribe from CBS as network’s news staff jumps ship","text":"President Donald Trump is reportedly demanding that Paramount, the parent company of CBS News, pay him even more in ongoing settlement negotiations over a lawsuit that legal experts have labeled frivolous.\n\nParamount is attempting to arrange the payment to Trump while his administration has the power to approve a multibillion-dollar merger between Paramount and Skydance Media, which gives the entire arrangement the appearance of an overt bribe.\n\nThe Wall Street Journal reported on Thursday that Paramount offered to settle the suit for $15 million, but that Trump is demanding $25 million and an apology from CBS News. Trump has claimed that the network edited a “60 Minutes” interview with former Vice President Kamala Harris in 2024 and that the act interfered in the election.\n\nRelated | Why are Republicans freaking out over an old Harris ‘60 Minutes’ interview?\n\nTrump declined to sit down for an interview with CBS on the same program and stormed off the set during his “60 Minutes” interview in 2020 after he was asked a tough series of questions.\n\nExperts on media law have said the suit against CBS is without merit. Despite this, Paramount has pursued a settlement with Trump in the apparent belief that a payoff will clear a path to approval of their proposed merger.\n\nThe decision to bend to Trump, which previous reports say has the approval of lead Paramount shareholder Shari Redstone—despite pushback from the likes of Sen. Bernie Sanders—has created chaos in CBS’ news division.\n\nBill Owens, the former executive producer of “60 Minutes,” quit in April and said in a memo to staff that it had “become clear I would not be allowed to run the show” and was not allowed to make “independent decisions” on news content for the program.\n\nThen in May, Wendy McMahon left her role as the CEO/president of CBS News. In her departure memo, McMahon said, “It’s become clear that the company and I do not agree on the path forward. It’s time for me to move on and for this organization to move forward with new leadership.”\n\nThe CBS/Paramount concessions to Trump are part of an ongoing theme of capitulation at the highest levels of the mainstream media since his 2024 election victory.\n\nIn December, ABC News parent Disney decided to donate $15 million to Trump’s presidential library and apologize for comments by host George Stephanopoulos. Previously, Trump had filed a lawsuit against the network that legal experts found dubious—similar to the CBS suit.\n\nMeanwhile, Amazon billionaire Jeff Bezos attended Trump’s inauguration, donated to his inaugural committee, and announced a new MAGA-friendly editorial line for the Washington Post, which he owns. Multiple staffers have since departed in protest of the moves, and Trump has praised Bezos and the Post for their support.\n\nSome media organizations are pushing back. NPR filed a lawsuit against Trump on Tuesday and accused him of trying to take away their First Amendment rights by pushing to defund them, PBS, and the Corporation for Public Broadcasting.\n\nBut that has been the exception to the norm. Mainstream press continues to knuckle under to Trump while he elevates the stature of conspiracy-minded pro-Trump media, seeking to replace honest journalism with sycophantic propaganda. It is working.","summary":"President Donald Trump is reportedly demanding that Paramount, the parent company of CBS News, pay him even more in ongoing settlement negotiations over a lawsuit that legal experts have labeled frivolous.\n\n\n\nParamount is attempting to arrange the payment to Trump while his administration has the power to approve a multibillion-dollar merger between Paramount and Skydance Media, which gives the entire arrangement the appearance of an overt bribe.\n\n\n\nThe Wall Street Journal reported on Thursday that Paramount offered to settle the suit for $15 million, but that Trump is demanding $25 million and an apology from CBS News. Trump has claimed that the network edited a “60 Minutes” interview with former Vice President Kamala Harris in 2024 and that the act interfered in the election.\n\n\n\n\nRelated | Why are Republicans freaking out over an old Harris ‘60 Minutes’ interview?\n\n\n\n\nTrump declined to sit down for an interview with CBS on the same program and stormed off the set during his “60 Minutes” interview in 2020 af","url":"https://www.dailykos.com/story/2025/5/29/2324912/-Trump-demands-bigger-bribe-from-CBS-as-network-s-news-staff-jumps-ship?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1435147/story_image/AP25140733327170.jpg?1747852216","video":null,"publish_date":"2025-05-29 16:00:04","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.074},{"id":326175450,"title":"Dem Senator Says Illegals ‘Should Go Home’ — Her Voting Record Tells A Different Story","text":"Democratic Michigan Sen. Elissa Slotkin, one of several elected Democrats seeking to lead the party out of the wilderness, issued her strongest condemnation of illegal immigration to date and suggested her Democratic colleagues were out of step with voters on the issue.\n\nSlotkin told the New York Times in an interview published Wednesday that migrants who enter the United States with no legal status should “go home” and suggested that crossing the border illegally should be recognized as a criminal offense. Though Slotkin’s tough on-illegal immigration comments notably diverge from those of other congressional Democrats choosing to double down on abolishing immigration enforcement, Republicans argue that she has consistently voted for open borders. (RELATED: Sen. Elissa Slotkin Admits ‘War Plan’ To Defeat Trump Agenda Is Not Enough To Retake Senate)\n\nSlotkin has seldom broken with Democrats to join GOP lawmakers in voting to crack down on illegal migration or provide additional resources to federal immigration authorities during her time in Congress. NumbersUSA, a conservative immigration-focused advocacy organization, gives Slotkin a 12% lifetime rating on its “immigration-reduction grade card.”\n\nThe Michigan Democrat was first elected to the House in 2018 and the Senate in 2024 winning a congressional district and state that President Donald Trump also carried during the past election cycle. She has quickly gained national prominence by delivering the Democrats’ rebuttal to the president’s joint address to Congress in March and has rolled out a “war plan” to counter Trump who she argues poses an “existential” threat to democracy.\n\n“I’m a national security person by training. I spent my entire career trying to prevent threats to the homeland,” Slotkin told the Times’ David Leonhardt while defending her vote for the Laken Riley Act in January. “And if you’re here illegally, you shouldn’t be.”\n\n“[I]f you’re here illegally, you have committed a crime and you should go home,” Slotkin added. “[I] think we have to be honest with ourselves that while our immigration system is not functioning right and we owe an actual immigration plan for a nation of immigrants, that doesn’t mean someone has the right to be here illegally.”\n\nSlotkin was one of 12 Senate Democrats who crossed the aisle to back the Laken Riley Act, the first piece of legislation Trump signed into law during his second term, which made it easier for federal immigration authorities to detain and deport illegal migrants. She notably supported an effort by Senate Democrats, however, to weaken the bill by voting “yes” on a failed amendment that would have prevented states from suing the federal government for failing to enforce immigration laws.\n\nThe Michigan Democrat also voted against Senate Republicans’ budget resolution in April unlocking more than $175 billion in border security funding in the president’s “one big, beautiful bill.” The budget blueprint also laid the groundwork to enact an extension of the expiring provisions of the 2017 Trump tax cuts and deliver on the president’s campaign pledge to eliminate taxes on tipped wages and overtime pay.\n\nShe voted “no” on a resolution in July 2024 condemning the Biden administration and its “border czar” former Vice President Kamala Harris for failing to secure the border during Biden’s term.\n\nSlotkin also opposed House Republicans’ sweeping border security legislation known as H.R.2, the Secure the Border Act, during a vote in May 2023. The bill would have required most employers to use E-Verify to ensure new hires have legal status to work in the United States, issued new restrictions on asylum seekers and directed the Department of Homeland Security to resume border wall construction.\n\nSlotkin supported former President Joe Biden’s Build Back Better Act in 2021, which would have among other things granted amnesty to more than 7 million illegal migrants living in the United States.\n\nDuring Trump’s first term in 2019, she also joined House Democrats in voting to rescind the president’s national emergency declaration allowing Trump to use Department of Defense funds to build the southern border wall.\n\nDemocratic strategists have suggested that elected Democrats’ failure to address the surge in illegal immigration during Biden’s sole White House term contributed to the party’s lackluster performance last November.\n\nLeonhardt has notably argued that Democrats should shift right on illegal immigration and border security, allowing the party to become more competitive in national elections and align better with the median voter’s beliefs about immigration.\n\nThough 54% of registered voters believe the Trump administration’s immigration enforcement efforts have “gone too far,” roughly the same amount of voters support deporting illegal migrants back to their home countries and believe the government should not grant legal status to foreigners who came to the United States illegally, according to an April New York Times-Siena survey.\n\nSlotkin has also called on Democrats to reject identity politics and employ an “alpha energy” that appeals to voters who believe the party is “weak” and “woke.”\n\nSlotkin notably broke with Democrats in May to overturn California’s de facto national electric vehicle mandate. No other Senate Democrat joined her in raising concerns about banning the sale of new gas-powered cars by 2035 in California and 11 other states who adopted the Golden State’s vehicle emission rule.\n\n“I don’t think we can stand up to Trump in a credible, thoughtful, strategic way if we don’t own the mistakes we made in the last election that got us here,” Slotkin told the Times.\n\nA spokesperson for Slotkin did not immediately respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'If you’re here illegally, you shouldn’t be'","url":"https://dailycaller.com/2025/05/29/elissa-slotkin-illegals-go-home-voting-record/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/Elissa-Slotkin-scaled-e1748488197560.jpg","video":null,"publish_date":"2025-05-29 15:44:33","author":"Adam Pack","authors":["Adam Pack"],"language":"en","category":"politics","source_country":"us","sentiment":0.091},{"id":326174256,"title":"EXCLUSIVE: Revealed — The Secret Messages Furious CNN Moderators Shared During Joe Biden's Election-Losing Debate Performance Against Donald Trump","text":"Joe Biden's now legendary poor debate performance against Donald Trump in 2024 was so bad even the event moderators were left shocked, RadarOnline.com can reveal. \n\nThe former president's often stammering and confusing answers would soon lead to him being forced to drop out of the race.Debate DisasterBiden, who is currently battling an \"aggressive\" form of prostate cancer, suffered a series of successive stumbles when trying to lay out his plans for his proposed next four years that fateful June night. \n\nThe 82-year-old's derailed train of thought raised concerns among Democratic donors and supporters, who were at first looking forward to hearing him take on – and take down – Trump. \n\nHowever, after babbling through much of the night, questions about the then president's mental and physical health exploded, eventually leading him to step away to be replaced by Vice President Kamala Harris on the Democratic ticket.\n\nNow, in his explosive new book about Biden's health, CNN anchor – and debate moderator that night – Jake Tapper has revealed the puzzled reaction he shared with co-moderator Dana Bash.Game OverTapper described in his book Original Sin the amazement the co-workers shared in real time during breaks in the debate. \n\nHe shared: \"The moderators had iPads to communicate with the control room. Jake wrote: 'Holy smokes.'\n\n\"Dana wrote something down on a piece of paper and passed it to Jake: 'He just lost the election.'\n\n\"When it was over, the Bidens approached the table to say hello to the moderators. To Jake and Dana, it didn’t seem as if Biden had any idea how bad his performance was, though he did say, 'Sorry about my voice; I have a cold.'\"Damage ControlSwitching to immediate damage control after the horrific debate, Biden admitted it wasn't his best showing.\n\n\"I had a bad night, it wasn’t a great performance,\" Biden told a crowd at a fundraising event just days later. \"We could linger and talk about a bad performance, or we could talk about the leadership of the last four years or the end of democracy with Donald Trump.\"\n\nBut insiders at the time said the writing of the Biden administration was on the wall, and his eventual withdrawal was inevitable. \n\n\"It was a pretty shocking performance by Biden, obviously,\" one source said. \"Any thoughtful person has to ask themself: Should this man be leader of the free world for another 7 months, let alone 55?\"Lost ElectionIn the new book, top advisor advisor David Plouffe blamed Biden for Harris' \"f----- nightmare\" campaign.\n\n\"He totally f----- us,\" he declared, adding: \"We got so s----- by Biden, as a party.\"\n\nAn unnamed aide also told Tapper and Thompson, \"We attempted to shield (Biden) from his own staff, so many people didn't realize the extent of the decline beginning in 2023.\"\n\nWhile the source said they \"love Biden,\" they noted it was \"a disservice to the country and to the party for his family and advisers to allow him to run again.\"\n\nAnother insider, who claimed to be a democratic strategist, criticized Biden's reelection bid, calling it an \"abomination.\" They told the author the ex-POTUS \"stole an election\" from the Democratic party and the American people.","summary":"The former president's often stammering and confusing answers would soon lead to him being forced to drop out of the race.","url":"https://radaronline.com/p/secret-messages-cnn-moderators-joe-biden-election-losing-debate-donald-trump/","image":"https://media.radaronline.com/brand-img/wYVC5GU2J/0x0/joe-biden-vows-return-second-debate-democrats-replace-2024-ticket-3-1719592636192.jpg","video":null,"publish_date":"2025-05-29 15:37:49","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":-0.22},{"id":326247744,"title":"Paramount Global Reportedly Offers $15M To Settle Trump Lawsuit","text":"(MENAFN- AsiaNet News) Paramount Global has reportedly offered President Donald Trump $15 million to settle a lawsuit against its subsidiary, CBS News, but the President's team is not budging on its demands. According to a report by The Wall Street Journal, President Trump's team wants more than $25 million and an apology from CBS News. The lawsuit concerns an interview of former Vice President Kamala Harris in the run-up to the elections on CBS News' '60 Minutes'–President Trump's team says that the interview was deceitfully edited to make her seem better. Trump's team sued CBS News for $10 billion in October, while CBS News denies that the interview was doctored or deceitful. The President's team bumped the damages it was seeking to $20 billion in an amended lawsuit filed in February. Trump's team also threatened to file another lawsuit against CBS News, alleging bias in its news coverage. The report added that Paramount expects to nominate three new directors to its board, while one existing director intends to step down. The media giant wants to have a full board in place in case its planned merger with Skydance falls through. This case has also angered some of CBS News' top executives, including CEO Wendy McMahon, who announced earlier this month that she's leaving the network. The report noted that there was ongoing tension between McMahon and Paramount over a potential apology to President Trump. Paramount Global stock is up nearly 15% year-to-date and 2.78% over the past 12 months. For updates and corrections, email newsroom[at]stocktwits[dot]com.","summary":"(MENAFN - AsiaNet News) Paramount Global has reportedly offered President Donald Trump $15 million to settle a lawsuit against its subsidiary, CBS News, but the President's team is not ...","url":"https://menafn.com/1109613275/Paramount-Global-Reportedly-Offers-15M-To-Settle-Trump-Lawsuit","image":"https://menafn.com/updates/pr/2025-05/29/AN_web-p_dc153image_story.webp","video":null,"publish_date":"2025-05-29 15:15:22","author":"Date,MENAFN","authors":["Date","MENAFN"],"language":"en","source_country":"jo","sentiment":-0.595},{"id":326199188,"title":"The Latest Taylor Swift News Is Ominous for Blake Lively","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nAs someone who famously has a song called “Bad Blood,” Taylor Swift is no stranger to the friend breakup. We all know the ballad of Karlie Kloss and the rumors about Olivia Rodrigo. Swift has probably ended friendships for less than getting her involved in a lawsuit, as Blake Lively may have done by drawing Swift into her ongoing It Ends With Us legal saga over the past couple of weeks.\n\nOfficially, the Swift chapter of the case is over, for now at least: Several outlets have reported that Lively opponent Justin Baldoni and his lawyers withdrew the subpoena of Swift they issued earlier this month that would have compelled the singer to turn over documents relevant to the dispute. But where does that leave Lively and Swift? I’m worried, and not just for nosy reasons—a fracture could be an ominous sign in Lively’s quest to win the public narrative, with further-reaching consequences as well.\n\nI’ll attempt to summarize what’s gone on: News outlets first reported that Baldoni’s side issued the subpoena May 9, and Swift’s team responded with a fierce statement emphasizing that she had no involvement with the making of It Ends With Us other than permitting one of her songs to be used in it. The statement also accused Baldoni’s lawyers of only subpoenaing her to use her name to “draw public interest by creating tabloid clickbait instead of focusing on the facts of the case.”\n\nIt sure didn’t sound as if Swift were on Team Baldoni, not when she was lighting him up for bringing her into it. But, perhaps surprisingly, it didn’t sound as if she were on Team Lively either: Rather than affirm her friendship with Lively in any way, her statement instead made a point of saying that she didn’t see the movie “until weeks after its public release.” It also seemed to refute an impression you might have gotten if you read any of Baldoni’s defamation lawsuit against Lively, or press coverage surrounding it: In that filing, Baldoni included text-message exchanges between Lively and himself in which she memorably referred to a very famous friend, presumably Swift, as one of her “dragons”—which is to say, someone who had her back. In one text, Lively wrote that her “dragons” read and loved her rewrite of the It Ends With Us script—and felt disappointed with how Baldoni responded to it. So was Swift now indicating that she didn’t want anyone thinking of her as one of Lively’s fire-breathing pets?\n\nThen, on May 14, Baldoni’s main lawyer, Bryan Freedman, attempted to justify the subpoena by claiming he had gotten a tip that Lively had tried to extort Swift. Freedman alleged that a source told him that after this year’s Super Bowl—a game Swift attended but Lively did not, unlike last year—one of Lively’s lawyers contacted Swift’s lawyers and demanded that the artist release a statement supporting Lively. According to the source, Lively’s lawyers threatened that if she didn’t, Lively might release presumably damaging private text messages between the two of them.\n\nLively’s team, led by attorney Michael Gottlieb, moved quickly to request that Freedman’s letter be thrown out and issued a statement calling the extortion allegation “categorically false.” Rather than back down, the next day Freedman filed an affidavit offering more details on his claim, meaning that he was now swearing what he was alleging was true under the penalty of perjury. Gottlieb shot back by issuing another statement, this one calling the accusation “triple hearsay.” The judge in the case, Lewis Liman, apparently agreed, and he granted Lively’s motion to strike both the letter and affidavit.\n\nCase closed? In this dispute, nothing ever is. For one thing, who was the source? There’s rampant speculation online about that, with possible candidates including everyone from Swift’s father (this is the contention of right-wing provocateur Candace Owens, as well as of the Daily Mail) to, er, no one (because the lawyer made it up). Liman’s throwing out the affidavit was a win for Lively’s side, but as some of my colleagues in the gossip mines have written, it didn’t really feel that way: The explosive headlines about Lively and extortion were out there now, and they would travel much further than the news that a judge had deemed them improper.\n\nAnd now we have the latest, that Swift is not being subpoenaed anymore at all. Both sides quickly moved to declare this a victory. In the meantime, on May 19, Lively’s legal team filed a motion seeking sanctions against Baldoni’s team for its “frivolous, baseless claims” against Lively. In a statement, Lively’s attorneys said that Freedman was aware the sanctions motion was coming and may have timed his “latest inflammatory and defamatory media stunt”—i.e., the subpoena and the affidavits—as a distraction.\n\nSwift’s team hasn’t made a peep about any of this since the initial statement criticizing the subpoena. That isn’t necessarily personal; it could just be good business. Except we also know that business tends to be personal for Swift. And as all this subpoena stuff has been unfolding over the past few weeks, reports of a rift between the two of them have ramped up. Most notably, on May 15 People magazine published a story claiming that their friendship had “halted.” There have been other articles too—including in Page Six, which featured an extremely harsh headline asserting that Swift “wishes she’d never met” Lively—but, until the People story, none I took seriously. People tends to be a very celebrity-friendly outlet, frequently running stories stars want out there. Throughout this case, if the Daily Mail and TMZ are Freedman’s news outlets of choice, People has been the closest to that for Lively. It’s unlikely Lively would be behind this item, so it’s natural to wonder if Swift was, which would be a pretty strong signal that there’s some validity to the rumors of a rift. (The People story didn’t quote Swift’s publicist on the record, relying instead on unidentified sources, so it’s not a given that it came from her camp.)\n\nSwift is in a tricky place, and has been since this all started—she has almost certainly been aware all along that Baldoni’s side would be eager to try to shoehorn her into the lawsuit. From the moment this became a legal matter, any statement Swift made about Lively and any photo of the two of them together could lead to further legal trouble or public backlash or both, and it makes sense that Swift’s lawyers would advise her not to engage. Unfortunately, not engaging looks a whole lot like taking a side.\n\nHas Swift actually taken a side? The People article left the door slightly open that Swift and Lively could be friends again, with an anonymous source offering that the two are “taking some space” but are “not no longer friends.” It’s totally possible that Swift is doing the prudent thing and publicly distancing herself. When it comes to Swift, people are good at reading into what’s not there: In last fall’s presidential election, despite Swift’s having endorsed Democrats for several years running, a bunch of people worked themselves into a frenzy worrying that the singer wasn’t going to endorse Kamala Harris—a tizzy that subsided only after Swift, as predicted, officially endorsed Harris. It’s worth remembering that Swift herself has not actually said anything about the status of her friendship with Lively.\n\nIndeed, I usually advocate for not putting much stock in the endless chatter about Swift’s friendships: I don’t take Swift’s being seen in public with Brittany Mahomes, for example, as an indication that the singer approves of Mahomes’ purportedly conservative political leanings. But the question of whether Swift and Lively are still friends feels a little different. As someone who has watched this legal battle play out, I’ve been dismayed by the automatic suspicion of Lively, the movement that’s sprung up around Baldoni, and the tendency of even fair-minded people to dismiss the whole thing as “They’re both bad.” To lay my cards on the table, knowing what we know about Amber Heard, I believe that Lively may have been the victim of a smear campaign. I don’t want the grim Baldoni cheerleaders to have the satisfaction of Swift kicking Lively to the curb, because some of them will interpret it as validation of the narrative that Lively is a liar and a master manipulator, and we’ve seen all the insidious late–#MeToo directions this plays out, far beyond throwaway celebrity drama.\n\nThat’s why, as silly as it might seem for me to be invested in this, I am. Swift has supported women who were victims of sexual misconduct, and she won a sexual assault suit of her own in 2017. She also knows what it’s like to become a media punching bag. If Lively was indeed sexually harassed and retaliated against, it’s heartbreaking to think her attempt to call it out is instead isolating her. Still, I’ve caught myself wondering, if Swift no longer wants to align herself with a woman she until recently considered a confidante, maybe there’s something I’ve been missing in how I’ve been looking at the case. There’s also the completely plausible scenario that Lively is both a crummy friend who name-dropped Swift one too many times and someone who was victimized on the set of her movie.\n\nOne thing seems certain: It’s going to be a while before we see new paparazzi shots of Lively and Swift gallivanting around New York together, if ever. I used to think it was a little obnoxious how they were always photographed in a posse on their way to or from a fancy restaurant, flanked by the Haim sisters and various other hangers-on. Have I really managed to convince myself that Swift and Lively getting to go to Via Carota together again would represent the triumph of not only friendship but justice? Sigh. I can almost taste the cacio e pepe.","summary":"I can explain what’s happened—and why, regrettably, it matters.","url":"https://slate.com/life/2025/05/taylor-swift-blake-lively-justin-baldoni-lawsuit.html?via=rss","image":"https://compote.slate.com/images/a3169621-5793-46c0-b572-da5085a564d4.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-05-29 14:53:02","author":"Heather Schwedel","authors":["Heather Schwedel"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.329},{"id":326158880,"title":"Man Responsible for Racist Kamala Harris Flyer Faces Consequences","text":"A Michigan man convicted of a racist outburst against a U.S. Postal Service employee after the worker placed Kamala Harris flyers in his mailbox was handed a 12-month sentence this week. This comes despite his attorney arguing that he is “not inherently racist” and deals with “mental health issues coupled with alcohol use.”\n\nRussell Valleau, 62, from Farmington Hills, was sentenced on Tuesday in Michigan’s Eastern District following his February conviction for assaulting a postal worker, according to court documents.\n\nHis lawyer, James Amberg, had argued in Valleau’s sentencing memorandum that he deserved to be given a sentence of “time served” after being in custody since his arrest in September 2024.\n\n“This equates out to approximately eight months of incarceration,” Amberg said. “This time has been spent mainly in county jail, a place built not to house individuals indefinitely, but instead to lock up the town drunk for a week or two. ”\n\nLove true crime? Sign up for our newsletter, The Law&Crime Docket, to get the latest real-life crime stories delivered right to your inbox.\n\nA jury found Valleau guilty of assaulting a federal employee and acquitted him of using a dangerous weapon after a three-day trial and two hours of deliberations, according to the U.S. Attorney’s Office.\n\nThe mail carrier that Valleau attacked was in her truck on Rockwell Street in Farmington Hills, located 25 miles northwest of Detroit, when Valleau approached her on his bicycle and started yelling profanities. He was upset about receiving the mailer from Harris, who was the vice president and Democratic presidential nominee at the time, saying he did not want that “Black b— in my mailbox.”\n\nDuring his tirade, Valleau also muttered a range of vulgarities and additional racial slurs as he complained that he was “tired of getting” the mailers.\n\nThe carrier was unsure what the defendant meant by this, and told him to just leave the mail in the mailbox.\n\n“Do your f—in’ job,” Valleau railed.\n\nThe carrier told Valleau to back away and rolled up the window. As she did, he pulled out a knife and made motion toward her. In fear for her life, she then took out her USPS-issued pepper spray and sprayed him.\n\nA neighbor later backed up the carrier’s account and said she heard Valleau yell, “Ow my eyes” after being sprayed. Valleau appeared to be intoxicated.\n\n“Mr. Valleau used racial slurs in the case and there is no attempt by counsel to excuse that behavior,” Amberg said in his sentencing memo. “But what was said by Mr. Valleau was said by somebody with clear mental health issues. Just look at the pictures of his ramshackle trailer, this is a person living on the very edge of society. His mental health and alcohol issues place him in positions where he has been in and out of jail and prison his entire life.”\n\nMore from Law&Crime: ‘Go back to your f—ing country’: Man attacks victim in grocery store because of his race, says he’s ‘tired of foreigners,’ cops say\n\nAs Law&Crime previously reported, Valleau also faced state charges related to the incident, but it’s unclear what the status of his case is.\n\n“A letter carrier was simply trying to do her job, and this defendant physically attacked her while using racist and offensive language,” Acting U.S. Attorney Julie A. Beck said in a statement after Valleau’s conviction. “This type of behavior has no place in our community and will not be tolerated.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: Russell Valleau (Farmington Hills Police Department). Right: Former Vice President Kamala&#8230;\n\n\nThis Post: Man Responsible for Racist Kamala Harris Flyer Faces Consequences first appeared on Internewscast Journal","url":"https://internewscast.com/crime/man-responsible-for-racist-kamala-harris-flyer-faces-consequences/","image":"https://internewscast.com/wp-content/uploads/2025/03/Man-who-assaulted-carrier-for-Kamala-Harris-flyers-convicted.jpg","video":null,"publish_date":"2025-05-29 14:37:33","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.674},{"id":326201386,"title":"Trump Admin Signals It Will Return One Wrongfully Deported Man","text":"A lot of things happened. Here are some of the things. This is TPM’s Morning Memo. Sign up for the email version.\n\nMajor Breakthrough Or More Endless Stonewalling? \n\nIn what could be a major breakthrough, the Trump administration told a federal court Wednesday that it has taken affirmative steps to retrieve an unlawfully deported Guatemalan man and return him to the United States so that he can receive the due process he was initially denied. \n\nIt was the first concession of its kind that the Trump administration has made in the handful of cases where courts have ordered it to facilitate the return of wrongfully deported foreign nationals and which have become the focal point of a constitutional clash between President Trump and the judiciary. \n\nThe concession comes in the case of O.C.G., a gay man who had succeeded in U.S. immigration court at not being deported to his home country but whom the Trump administration them immediately deported to Mexico., which in turn sent him to Guatemala. In his immigration court hearing, the man claimed to have been previously kidnapped and raped in Mexico, but the immigration judge (probably correctly, under current law) said the case at hand was limited to Guatemala. \n\nO.C.G.’s situation emerged in a larger case in federal court in Massachusetts challenging third country deportations without notice and hearing. It’s the same case where the Trump administration tried to get around a court order with last week’s deportation flight to South Sudan.\n\nThe government alerted the court of its efforts to return O.C.G. in a filing that said certain paperwork had already been completed and that the administration “is currently working with ICE Air to bring O.C.G. back to the United States on an Air Charter Operations (ACO) flight return leg.” \n\nA few words of caution about what this means for O.C.G. and the other “facilitate” cases:\n\nO.C.G. is not back yet. Throughout his business and political life President Trump has dragged his feet at every step of litigation, including later stages after concessions have been made or a settlement reached. While this is a significant step compared to the previous defiance, it’s not a done deal yet.Unlike Kilmar Abrego Garcia and “Cristian,” the other two major “facilitate” cases, O.C.G. was not incarcerated after his deportation. He has remained in hiding in Guatemala, not in prison. That distinction is one that the administration may use to justify not similarly returning other wrongfully deported migrants.Unlike Cristian and the dozens of others incarcerated at CECOT in El Salvador, O.C.G. wasn’t deported under the Alien Enemies Act, which the Trump administration has sought to use as an entirely separate legal basis for removals and will likely use to distinguish O.C.G.’s case.\n\nAll of which is to say that while the administration’s signal that it will abide by the court order to facilitate O.C.G.’s return is a potential breakthrough that undermines its legal position in other cases, I’d caution against leaping to the conclusion that it is the beginning of a wholesale walk-back of the administration’s outrageous conduct in these key anti-immigration cases. \n\nJudge Rules In Favor Of Khalil … Sorta\n\nIn one of the most obtuse judicial opinions you’ll ever encounter, U.S. District Judge Michael E. Farbiarz of New Jersey ruled that the Trump administration’s attempt to deport Columbia University student Mahmoud Khalil, a pro-Palestinian activist, was likely unconstitutional, but stopped short of ordering Khalil’s release until both parties can file further briefs. \n\nShouting The Quiet Part\n\nEducation Secretary Linda McMahon provided valuable evidence on national TV that the Trump administration is targeting universities for illegitimate political reasons: \n\nLinda McMahon: \"Universities should continue to be able to do research as long as they're abiding by the laws and in sync, I think, with the administration and what the administration is trying to accomplish.\"[image or embed]— Aaron Rupar (@atrupar.com) May 28, 2025 at 10:54 AM\n\nTrump Wants Loyalist On Appeals Court\n\nPresident Trump announced his plan to nominate his former criminal defense attorney, now serving as the No. 3 at the Justice Department to a coveted seat on the U.S. Court of Appeals for the 3rd Circuit (which covers PA, NJ, DE, and the USVI). \n\nBove has been a leading figure in rapidly bringing the Justice Department firmly under Trump White House control, erasing its storied independence and eroding its professional reputation. \n\nTrump’s social media post announcing Bove’s nomination to the lifetime seat on the appeals court described the job in startling political terms: “He will end the Weaponization of Justice, restore the Rule of Law, and do anything else that is necessary to, MAKE AMERICA GREAT AGAIN.”\n\nPardonpalooza\n\nFollowing on remarks from U.S. pardon attorney Ed Martin, President Trump confirmed he is considering pardoning the violent extremists convicted in the 2020 plot to kidnap Michigan Gov. Gretchen Whitmer (D), falsely claiming that they “got railroaded.”President Trump pardoned former Rep. Michael Grimm, the Staten Island Republican who resigned from Congress in 2015 and did prison time for tax fraud. Grimm was paralyzed last year in a horseback riding accident. Trump has now pardoned a total of nine members of Congress convicted of corruption and/or tax crimes. Grimm wasn’t the only corrupt politician among the more than two dozen people Trump pardoned yesterday, a list that included political allies of his. \n\nThe kicker to Trump’s pardonpalooza: Trump is exacting retribution against more than three dozen former death row inmates whose sentences President Biden commuted by sending them to the nation’s only “supermax” prison. A judge has cleared the way for those transfers, saying the inmates had not yet exhausted their administrative remedies with the Bureau of Prisons, a necessary predicate to filing their federal lawsuits. \n\nFor The Record\n\nNancy Marks, one-time campaign manager to ousted Rep. George Santos (R-NY), avoided jail time for her role in his campaign finance schemes. The ousted fabulist congressman was sentenced last month to seven years in prison. Her possible cooperation with investigators against Santos has never been confirmed. “I’m going to leave that an enigma,” her lawyer said.\n\nThe Corruption Is Obvious Even To Them\n\nCBS News parent Paramount has offered $15 million to settle Donald Trump’s bogus lawsuit against it for how it edited an interview with Vice President Kamala Harris during the 2024 campaign. Trump is holding out for $25 million and an apology, but Paramount executive are leery of paying more than the going rate for these corrupt settlements of spurious Trump lawsuits because it might expose them to legal liability, the WSJ reports:\n\nDuring the Trump-suit negotiations, one sticking point for Paramount executives has been whether a settlement could expose directors and officers to liability in potential future shareholder litigation or criminal charges for bribing a public official, according to people familiar with the conversations. By settling within the range of what other companies have paid to end litigation with Trump, some Paramount executives hope to minimize such liability, some of the people said.\n\nParamount is eager to settle for its own corrupt purpose: winning government approval for a planned merger. \n\nHuge Blow To Trump’s Illegal Tariff War\n\nThe Court of International Trade blocked major elements of President Trump’s regimen of massive tariffs, ruling that he had exceeded his statutory authority and usurped Congress’ role. \n\nRFK Jr. Watch\n\nHHS has undermined the county’s capacity to fight future influenza pandemics by cancelling a $600 million contract with Moderna to develop flu vaccines. HHS Secretary Robert F. Kennedy Jr. blindsided CDC officials with his surprise announcement on social media that he was unilaterally changing the government’s guidance on who should get COVID vaccines and when. \n\nThe Toils Of Climate Change\n\nA massive chunk of Switzerland’s Birch Glacier – destabilized by climate change – came loose, unleashing a debris flow that almost completely wiped out an already-evacuated Alpine village. The BBC has video of the shock wave advancing across the valley floor. \n\n View this post on Instagram","summary":"A lot of things happened. Here are some of the things. This is TPM’s Morning Memo. Sign up for the email version....","url":"https://talkingpointsmemo.com/morning-memo/trump-admin-signals-it-will-return-one-wrongfully-deported-man","image":"https://talkingpointsmemo.com/wp-content/uploads/2025/05/GettyImages-1252671260.jpg?w=2048","video":null,"publish_date":"2025-05-29 14:22:32","author":"David Kurtz","authors":["David Kurtz"],"language":"en","category":"politics","source_country":"US","sentiment":-0.374},{"id":326228062,"title":"PolitiFact Flags Trump as 'FALSE' for Wanting More Info on Foreign Students at Harvard","text":"PolitiFact threw another \"False\" flag on their mountain of 1,095 Donald Trump \"fact checks\" on Wednesday. The dispute was whether Harvard gave the Department of Homeland Security the information they requested on their foreign students. They cited a recent press gaggle with the president: \n\n \"Part of the problem with Harvard is that there are about 31% of foreigners coming to Harvard ... but they refuse to tell us who the people are,\" Trump told reporters May 25. \"We want a list of those foreign students and we'll find out whether or not they're OK. Many will be OK, I assume. And I assume with Harvard many will be bad.\"\n\nPolitiFact immigration reporter Maria Ramirez Uribe reported things that made it sound like it's preliminary to cry \"False\": \n\nThe Department of Homeland Security says Harvard did not provide the information it requested about the university’s international students. DHS cited that as one reason for revoking Harvard’s certification. But Harvard disputed that in its lawsuit against the Trump administration.\n\nCourts have not yet ruled on whether Harvard complied with providing DHS with the additional information it requested. \n\nBut PolitiFact shopped for an expert to convict Trump of falsehood: \n\nHowever, immigration law experts said Trump’s statement that the U.S. government doesn’t know the identities of Harvard’s international students is incorrect.\n\nU.S. colleges and universities that enroll international students must be certified under the Department of Homeland Security’s Student and Exchange Visitor Program, called SEVP.\n\nSEVP’s database \"contains all information about every student visa holder. Addresses, courses, grades, jobs, social media accounts, and much more,\" Charles Kuck, an Atlanta-based immigration lawyer and Emory University law professor, said.\n\nAccording to campaign finance records, Chuck Kuck is (surprise!) is a serious donor to Democrats, including Kamala Harris, Joe Biden, Stacey Abrams, Raphael Warnock, and Jon Ossoff. In 2018, Kuck gave $10,000 to the Georgia Democratic Party. You'll also find Kuck used to donate to Republicans like Jeb Bush until.....Donald Trump became the leader of the GOP. \n\nPolitiFact also suggest Trump was \"False\" because the \"State Department issues visas. To apply for a student visa, a person must fill out a form and schedule an interview. As part of the application process, students must provide biographical and employment information, including information about their relatives, and answer security questions, including about their criminal records.\"\n\nSince they're Democrat-friendly, these journalists have zero suspicions that the Biden administration was lax on violent criminal immigrants coming into the country, and so the Trump people are vigilantly assuming something might have fallen through the cracks. \n\nDoes Maria Ramirez Uribe have a problem with Trump and his team? It would seem so, since in 2025, she hasn't \"fact checked\" a single Trump opponent. This is her author page so far this year, in reverse date order: \n\nMay 28: Donald Trump -- FALSE\n\nMay 15: Stephen Miller -- FALSE\n\nMay 9: Pam Bondi -- PANTS ON FIRE\n\nMay 8: Donald Trump -- FALSE\n\nMay 1: Pam Bondi -- PANTS ON FIRE\n\nApril 10: Donald Trump -- PANTS ON FIRE\n\nApril 8: Brooke Rollins -- MOSTLY FALSE\n\nFebruary 21: Elon Musk -- PANTS ON FIRE\n\nFebruary 14: Elon Musk -- FALSE\n\nFebruary 7: Kristi Noem -- HALF TRUE \n\nJanuary 31: Donald Trump -- FALSE\n\nJanuary 30: Karoline Leavitt -- FALSE \n\nThis is what PolitiFact calls \"independent fact checking.\"","summary":"PolitiFact threw another \"False\" flag on their mountain of 1,095 Donald Trump \"fact checks\" on Wednesday. The dispute was whether Harvard gave the Department of Homeland Security the information they requested on their foreign students. They cited a recent press gaggle with the president: \n\n\n \"Part of the problem with Harvard is that there are about 31% of foreigners coming to Harvard ... but they refuse to tell us who the people are,\" Trump told reporters May 25. \"We want a list of those foreign students and we'll find out whether or not they're OK. Many will be OK, I assume. And I assume with Harvard many will be bad.\"\n\n\nPolitiFact immigration reporter Maria Ramirez Uribe reported things that made it sound like it's preliminary to cry \"False\": \n\n\nThe Department of Homeland Security says Harvard did not provide the information it requested about the university’s international students. DHS cited that as one reason for revoking Harvard’s certification. But Harvard disputed that in its lawsuit against the Trum","url":"https://www.newsbusters.org/blogs/nb/tim-graham/2025/05/29/politifact-flags-trump-false-wanting-more-info-foreign-students","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/Trumpgagglefnc.jpg?itok=AcGyBna6","video":null,"publish_date":"2025-05-29 14:12:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.394},{"id":326152888,"title":"21 Democrats who may try to succeed Trump in the 2028 presidential election","text":"It has been just over four months since President Donald Trump returned to power in the White House, and the very early moves in the 2028 presidential race are already underway by some Democrats with likely national ambitions. This upcoming weekend, Minnesota Gov. Tim Walz, who was the Democrats' 2024 vice presidential nominee, and Maryland Gov. Wes Moore, who says he is not laying the groundwork for a 2028 presidential run, will make separate appearances in South Carolina, the state the Democratic National Committee anointed to hold the lead-off primary in their 2024 nominating calendar. Two weeks later, Sen. Amy Klobuchar of Minnesota, who ran for the White House in 2020, will headline a major Democratic state party dinner in New Hampshire, which for a century has held the first presidential primary. Two weeks ago, 2020 Democratic presidential candidate Pete Buttigieg, who later served as Transportation secretary in former President Joe Biden's administration, headlined a town hall with veterans and military families in Cedar Rapids, Iowa. SUCCEEDING TRUMP IN 2028: SIX REPUBLICANS TO KEEP YOUR EYES ON Iowa's caucuses for half a century kicked off both major political parties' presidential nominating calendars until the DNC demoted the Hawkeye State on their 2024 schedule. Another potential contender, two-term Illinois Gov. J.B. Pritzker, late last month, gave the keynote address at a major state party fundraising gala in New Hampshire. Also making noise is two-term Democratic Kentucky Gov. Andy Beshear, who said recently he would consider running for president if he felt he could successfully unite the country. WHAT BERNIE SANDERS SAID IN A FOX NEWS DIGITAL INTERVIEW Additionally, progressive firebrand Rep. Alexandria Ocasio-Cortez of New York grabbed plenty of attention the past couple of months, co-headlining a slew of large rallies across the country with longtime progressive champion Sen. Bernie Sanders of Vermont, which sparked plenty of 2028 speculation. The Democratic Party has been in the political wilderness since last November's election setbacks, when Republicans won back control of the White House and the Senate and defended their fragile House majority. Republicans additionally made gains among Black and Hispanic voters as well as younger voters, all traditional members of the Democratic Party's base. Since Trump's return to power, an increasingly angry and energized base of Democrats has been pushing for party leaders to take a stronger stand in pushing back against the president's sweeping and controversial agenda during the opening months of his second administration. EFFORT BY DEMOCRATS TO STOP THE SLIDE RIDICULED Democrats are not only looking ahead to next year's midterms, when they hope to make ballot box gains, but also to the next presidential race. \"There was a sense of hopelessness earlier this year among Democrats, as Trump came in with his wrecking ball, and it seemed like there was nothing but futile opposition to him,\" longtime Democratic strategist Chris Moyer told Fox News. \"So thinking about a presidential race with potential candidates is a way to get some hope back and look towards a future that doesn't include Trump.\" Moyer, a veteran of a handful of Democratic presidential campaigns, said the race is \"wide open, and it won’t be long before we see clear maneuvering from a litany of candidates.\" The results of the 2026 midterm elections will have a major impact on the shape of the next White House race. For now, however, here are 20 Democrats considered potential presidential contenders to watch on the road to 2028. Kamala Harris After lying low when the Biden administration came to a close, former Vice President Kamala Harris has picked up the political pace of late, including headlining a recent major DNC fundraiser in New York City, with another in San Francisco next week. Among her campaign options that she is weighing is a 2026 run for the open governor's seat in her home state of California and another bid in 2028 for the White House. A source in the former vice president's political orbit confirmed to Fox News Digital two months ago that Harris had told allies she would decide by the end of summer on whether to launch a 2026 gubernatorial campaign. Harris served as San Francisco district attorney, California attorney general and represented the Golden State in the U.S. Senate before joining Biden's 2020 ticket and winning that election as vice president. Additionally, Harris would be considered the clear frontrunner for governor in heavily blue California in the race to succeed term-limited Democrat Gov. Gavin Newsom. However, early polling in the 2028 Democratic nomination race indicates that Harris would be the frontrunner, thanks in part to her name recognition within her party. While there are plenty of voices within the party who would like to move on from the Biden/Harris era following Trump's sweeping victory, and there is little history of Democrats yearning for past defeated presidential nominees, Trump has re-written the rules when it comes to defeated White House contenders making another run. Potential buyers' remorse of a second Trump administration could boost the 60-year-old Harris in the years to come. Rep. Alexandria Ocasio-Cortez of New York The progressive \"rock star\" and best-known lawmaker among the so-called \"Squad\" of diverse House Democrats in October turned 35, the minimum age to run for president. Some Democrats argue that a riveting messenger with star power is needed as the party's next nominee, and Ocasio-Cortez is guaranteed to grab plenty of attention if she ultimately decides to run. There is also speculation the four-term federal lawmaker from New York City may primary challenge Senate Minority Leader Chuck Schumer of New York when he is up for re-election in 2028. Gov. Gavin Newsom of California California Gov. Gavin Newsom was a top surrogate for Biden during the president's re-election bid. With the blessing of the White House, the two-term California governor debated then-Republican presidential candidate and Florida Gov. Ron DeSantis last year on Fox News. Newsom's travels on behalf of Biden brought him to New Hampshire and South Carolina, two crucial early voting states on the Democratic Party's nominating calendar. After Harris, his friend and fellow Californian, replaced Biden atop the Democrats' 2024 ticket, the governor, after a pause, continued his efforts to keep Trump from returning to the White House. While Newsom and California's Democrat-dominated legislature took action to \"Trump-proof\" the Golden State, the governor has also worked with Trump on key matters, including January's wildfires that devastated parts of metropolitan Los Angeles. Newsom also appears to have moderated on some issues and invited well-known Trump allies Charlie Kirk and Steve Bannon on his weekly podcast. The 57-year-old Newsom, who is term-limited, completes his duties in Sacramento at the end of next year, right around the time the 2028 presidential election will start to heat up. Gov. J.B. Pritzker of Illinois Illinois Gov. J.B. Pritzker has become a leading voice in the Democrats' opposition to Trump and has taken steps to Trump-proof his solidly blue state. \"You come for my people, you come through me,\" Pritzker told reporters of his efforts to protect Illinois. Pritzker was also a high-profile surrogate on behalf of Biden and then Harris during the 2024 cycle. Those efforts brought Pritzker to Nevada, a general election battleground state and an early-voting Democratic presidential primary state, and New Hampshire. Additionally, the governor's recent trip to New Hampshire sparked more 2028 buzz. However, before he makes any decision about 2028, the 60-year-old governor must decide whether he will run in 2026 for a third term steering Illinois. Gov. Gretchen Whitmer of Michigan Two-term Michigan Gov. Gretchen Whitmer grabbed plenty of attention and became a Democratic Party rising star in 2020 when she feuded with Trump over COVID-19 federal assistance and survived a foiled kidnapping attempt. Trump, at the time, called her \"that woman from Michigan.\" Along with Newsom and Pritzker, Whitmer's name was floated as a possible replacement for Biden following his disastrous debate performance against Trump in late June, before the president endorsed Harris, and the party instantly coalesced around the vice president. Whitmer was a leading surrogate for Biden and then for Harris and made a big impression on Democratic activists during a stop this summer in New Hampshire on behalf of Harris. However, Whitmer was criticized by some in her party for appearing to cozy up to Trump during a White House visit earlier this spring. The 53-year-old governor is term-limited and will leave office after the end of next year. Gov. Josh Shapiro of Pennsylvania Gov. Josh Shapiro, the 51-year-old first-term governor of Pennsylvania, was on Harris' short-list for vice presidential nominee. Even though the vice president named Minnesota Gov. Tim Walz as her running mate, Shapiro remained a top surrogate on behalf of his party's 2024 national ticket. However, his two-day swing in New Hampshire during the final full week ahead of Election Day did raise some eyebrows and 2028 speculation. After Harris lost battleground Pennsylvania to Trump, there was plenty of talk within the party that Harris had made the wrong choice for her running mate. Shapiro, who has a track record of taking on the first Trump administration as Pennsylvania attorney general, is expected to play a similar role with Trump back in the White House. The governor will be up for re-election in 2026. Gov. Wes Moore of Maryland Maryland Gov. Wes Moore is considered by many to be another Democratic Party rising star. The 46-year-old Army veteran, who is also a Rhodes Scholar and CEO of the charitable organization the Robin Hood Foundation during the coronavirus pandemic, was elected two years ago. Even though Moore said in a recent interview on \"The View\" that he is \"not running\" in 2028, speculation persists, fueled in part because of his upcoming stop in South Carolina. Moore will be up for re-election in 2026. Pete Buttigieg Former Transportation Secretary Pete Buttigieg, who surpassed expectations during his 2020 Democratic presidential nomination run, was a very active surrogate on behalf of Biden and later Harris, during the 2024 cycle. He helped raise a lot of money for the Democratic Party ticket, including heading a top-dollar fundraiser in New Hampshire. The 43-year-old former South Bend, Indiana, mayor and former naval officer who served in the war in Afghanistan, is considered one of the party's biggest and brightest stars. He was known as a top communicator for the administration, including making frequent appearances on Fox News. Fueling buzz about a potential 2028 presidential run, Buttigieg passed on a 2026 Senate bid in his adopted home state of Michigan and made a high-profile stop in Iowa earlier this month. Gov. Andy Beshear of Kentucky Kentucky Gov. Andy Beshear, 47, who was elected governor in 2019 and then re-elected in 2023 in red-state Kentucky, was on Harris' longer list for potential running mates. Beshear made plenty of new friends and contacts as he ventured to New Hampshire last year to headline the state Democratic Party's annual fall fundraising gala. He served as Kentucky's attorney general before running for governor. Beshear said in a recent interview with local station WDRB that \"if you'd asked me a couple years ago if this is something I'd consider, I probably wouldn't have. But I don't want to leave a broken country to my kids. And so, if I'm somebody that can bring this nation together, hopefully find some common ground, it's something I'll consider.\" Sen. Raphael Warnock of Georgia Georgia Sen. Raphael Warnock, 55, is a major player in Washington as the Democratic minority in the Senate fights back against the second Trump administration. Warnock, who won Senate elections in 2020 and 2022 in battleground Georgia, served as senior pastor at the famed Ebenezer Baptist Church in Atlanta, where Martin Luther King Jr. once preached. He is up for re-election to the Senate in 2028. Sen. Cory Booker of New Jersey Sen. Cory Booker of New Jersey, who ran for the 2020 Democratic presidential nomination, is considered one of the party's most talented orators. Thanks to his 2020 run, Booker made plenty of friends and allies in such early states as New Hampshire and South Carolina. Booker made headlines earlier this year by delivering a record-breaking 25-hour and 5-minute marathon speech from the floor of the Senate. The speech protested the sweeping and controversial moves so far by Trump during his second administration, as well as the operations of Elon Musk's Department of Government Efficiency. The 56-year-old senator is up for re-election in 2026. Sen. Chris Murphy of Connecticut Since the November election, Sen. Chris Murphy of Connecticut has been very vocal about the steps Democrats need to take to win back working-class voters. First elected to the House in 2006 and later to the Senate in 2012, the 51-year-old Murphy cruised to re-election this year by nearly 20 points, which means he would not have to decide between a re-election bid and a White House run in 2028. Sen. Amy Klobuchar of Minnesota Minnesota Democratic Sen. Amy Klobuchar, 65, who once served as county attorney in Minnesota's most populous county, is now in her fourth term in the Senate. Klobuchar ran for the 2020 Democratic presidential nomination and came in a strong third in New Hampshire's first-in-the-nation primary. The senator has not ruled out making another run for the White House in 2028. Rep. Ro Khanna of California Rep. Ro Khanna, 48, was a tireless surrogate on behalf of Biden and then Harris. He has been a regular visitor to New Hampshire in the past couple of years, including a high-profile debate last year against then-GOP presidential candidate Vivek Ramaswamy. Khanna has grabbed plenty of attention so far this year as he has held town halls in Republican-controlled congressional districts and targeted Vice President JD Vance with events in the vice president's home state of Ohio and at Yale Law School, where both politicians earned their legal degrees. Stephen A. Smith The 57-year-old sports TV personality, sports radio host, sports journalist, and actor has generated a ton of buzz this year as he has mulled a White House run and has even grabbed Trump's attention. Mark Cuban Another potential contender with plenty of star power is Mark Cuban. The 66-year-old billionaire business mogul and part-owner of the NBA's Dallas Mavericks was a high-profile surrogate for Harris during her presidential election campaign. Gov. Roy Cooper of North Carolina Former North Carolina Gov. Roy Cooper, 67, who in January finished up his eighth and final year as governor, took his name out of the Harris running mate speculation early in the process last summer. Cooper served 16 years as North Carolina's attorney general before winning election as governor. The former governor is being heavily recruited by Democrats to try and flip a GOP-held Senate seat in North Carolina in next year's midterms. Gov. Michelle Lujan Grisham of New Mexico New Mexico Gov. Michelle Lujan Grisham, 65, is halfway through her second term steering New Mexico. The governor, a former member of Congress, was a high-profile and busy surrogate on behalf of Harris during the final weeks of the 2024 campaign. CLICK HERE TO GET THE FOX NEWS APP Minnesota Gov. Tim Walz The 61-year-old Minnesota governor, who served as Harris' running mate, has two years remaining in his second term in office. While the vice presidential nominee's energy and enthusiasm on the campaign trail this year impressed plenty of Democratic strategists, the final results of the election will make any potential future national run for Tim Walz difficult. Walz has said he is not thinking of 2028, but he has been very busy so far this year heading events across the country, and an upcoming stop in South Carolina is fueling more White House buzz. Rahm Emanuel The 65-year-old Rahm Emanuel, who served the past four years as ambassador to Japan during the Biden administration, has a jam-packed resume. Emanuel, a veteran of former President Bill Clinton’s administration in the 1990s, went on to serve in Congress and steered the Democratic Congressional Campaign Committee during its very successful 2006 cycle. He later served as Obama’s chief of staff before winning the 2011 election and 2015 re-election as Chicago mayor. Emanuel, who late last year mulled making a bid for Democratic National Committee chair, has seen his name floated in recent months as a potential 2028 Democratic presidential contender. Gina Raimondo The 54-year-old Gina Raimondo, a former two-term Rhode Island governor, made history as the first woman to steer the nation's smallest state. Raimondo, who served as Commerce secretary in Biden's cabinet, said \"yes\" when recently asked by veteran Democratic strategist David Axelrod if she was considering a 2028 White House run. Honorable Mentions: Two other names that also keep coming up in the Democrats 2028 conversation are Gov. Phil Murphy of New Jersey and Sen. Ruben Gallego of battleground Arizona.","summary":"Here is a very early look at the Democratic Party politicians considered to be potential 2028 presidential contenders in the next race for the White House.","url":"https://www.foxnews.com/politics/20-democrats-who-may-try-succeed-trump-2028-presidential-election","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/pete-buttigieg-gaggle-cedar-rapids-iowa-may-13-2025.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-29 14:00:15","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":0.194},{"id":326182994,"title":"Trump Suffered ‘Mental Anguish and Confusion’ From ‘60 Minutes’ Kamala Harris Interview, Lawyers Claim in Bid to Deny Dismissal","text":"President Trump suffered “mental anguish and confusion” as a result of how “60 Minutes” and CBS “deceptively edited” its interview with Kamala Harris leading up to the 2024 election, the president’s lawyers said in a legal filing on Wednesday.\n\nThe filing is an objection to parent company Paramount Global’s push to dismiss his $20 billion lawsuit against CBS for how it edited the Harris interview last year.\n\n“Defendants’ conduct, including news distortion, constituted commercial speechwhich cannot by any reasonable interpretation be found to have constituted editorial judgment, and that speech damaged Plaintiffs,” the president’s lawyers argued in the filing. \n\nThey continued:”The fact that such commercial speech was issued by a news organization does not insulate Defendants from liability under the First Amendment.”\n\nThe court filing from Trump’s attorneys argued “60 Minutes” intentionally edited its Harris interview to “misrepresent significant portions” of what she said — which ultimately misled the American public and led to “widespread confusion and mental anguish” for both viewers and the president. \n\nTrump’s attorneys also argued “viewers withheld attention from President Trump and Truth Social,” his social media platform, due to the “false advertising and tampering” tied to the Harris interview, resulting in a decrease in value for Trump Media and Technology Group and his other media holdings. \n\nCBS News has maintained that Trump’s accusations of deceitful editing were false, explaining that the promo shown on “Face the Nation” used a longer section of Harris’ answer. It also turned over the transcript and camera footage from the interview to the FCC as part of the agency’s investigation into allegations of “news distortion.”\n\nIn a March filing to dismiss the Trump suit, CBS called it “an affront to the First Amendment” and “without basis in law or fact.”\n\n“They not only ask for $20 billion in damages but also seek an order directing how a news organization may exercise its editorial judgment in the future,” the motion said. “The First Amendment stands resolutely against these demands.”\n\nThe latest filing from Trump’s team comes after he recently shot down Paramount’s offer to settle the lawsuit for $15 million, with the president aiming to get at least $25 million and an apology, The Wall Street Journal reported on Wednesday. Per the Journal, the parties are set to meet for a mediation session on Thursday as settlement discussions continue.\n\nParamount Global has been looking to smooth relations with the Trump administration as it awaits FCC approval of its pending $8 billion merger with Skydance Media. The deal, which is subject to regulatory approval from the agency due to a required transfer of broadcast licenses of Paramount’s 28 owned-and-operated local TV stations, had previously triggered its first automatic 90-day extension after failing to close by April 7.\n\nFCC chairman Brendan Carr has argued that the settlement talks with Trump are unrelated to the agency’s review of the Skydance deal. But he has warned that “all options remain on the table” in the agency’s ongoing investigation into alleged “news distortion,” including potentially revoking CBS’ broadcast license if the network is found to have violated the agency’s public interest standard. He has also previously threatened to block M&A for companies who embrace diversity, equity and inclusion (DEI) policies and is reportedly seeking concessions in the Paramount-Skydance deal.\n\nDisney previously paid $15 million to settle a defamation lawsuit Donald Trump brought against ABC News and star anchor George Stephanopoulos. Meta also paid $25 million to settle Trump’s lawsuit about being kicked off Facebook and Instagram after the attack on the Capitol on Jan. 6, 2021.","summary":"The president's attorneys say the interview at the heart of the lawsuit is not protected by the First Amendment\n\n\nThe post Trump Suffered &#8216;Mental Anguish and Confusion&#8217; From ‘60 Minutes&#8217; Kamala Harris Interview, Lawyers Claim in Bid to Deny Dismissal appeared first on TheWrap.","url":"https://www.thewrap.com/trump-suffered-mental-anguish-and-confusion-60-minutes-interview/","image":"https://www.thewrap.com/wp-content/uploads/2025/04/Donald-Trump-4-24-25.jpg","video":null,"publish_date":"2025-05-29 13:55:07","author":"Sean Burch","authors":["Sean Burch"],"language":"en","category":"politics","source_country":"US","sentiment":-0.063},{"id":326155326,"title":"Trump promised 'no tax on Social Security' — but his megabill is a 'far cry' from that","text":"In 2024, Donald Trump campaigned on eliminating taxes for tipped wages and Social Security benefits. And Trump's messaging on the economy, polls showed, was the thing that ultimately did the most to put him past the finish line. Democratic presidential nominee Kamala Harris campaigned on the economy as well, but in the end, Trump defeated her with a narrow victory of roughly 1.5 percent in the national popular vote.\n\nAccording to Wall Street Journal reporters Ashlea Ebeling and Richard Rubin, however, Trump's \"big, beautiful bill\" — which was narrowly passed along partisan lines, 215-214, in the U.S. House of Representatives and went to the U.S. Senate for consideration — is at odds with his 2024 campaign promise on Social Security taxes.\n\nIn a WSJ article published on May 29, Ebeling and Rubin report, \"The legislation passed by the House last week would give seniors a temporary extra deduction of $4000, which would lower taxes for many of the people Trump was targeting with his pitch. But this alternative to 'no tax on Social Security' would leave many people still paying income taxes on Social Security benefits.\"\n\nREAD MORE: 'Couldn't care less if he's upset': Critical number of GOP senators now oppose Trump bill\n\nTom O’Saben, director of government relations for the National Association of Tax Professionals, told the WSJ that Trump's \"big, beautiful bill\" is \"a far cry from making Social Security tax-free.\"\n\nAccording to Ebeling and Rubin, \"Lawmakers didn't end income taxes on Social Security altogether for two main reasons. This version significantly limits the revenue loss, clocking in at about $18 billion a year instead of about $100 billion for a full exemption; that larger version could have made it hard to fit inside the bill's fiscal constraints. What’s more, under the fast-track legislative procedure that Republicans are using to pass the bill, lawmakers aren't allowed to touch the Social Security trust funds, which is where some income taxes on benefits go.\"\n\nThe bill, they add, includes \"a bonus $4000 deduction for taxpayers 65 and older, good for tax years 2025 through 2028.\"\n\n\"For most people whose only source of income is Social Security,\" Ebeling and Rubin note, \"their federal income tax liability is zero. So the bonus deduction wouldn't help.\" \n\nREAD MORE: The Manosphere needs 'fathers': Columnist pans Dems' $20M outreach to men","summary":"In 2024, Donald Trump campaigned on eliminating taxes for tipped wages and Social Security benefits. And Trump's messaging on the economy, polls showed, was the thing that ultimately did the most to put him past the finish line. Democratic presidential nominee Kamala Harris campaigned on the economy as well, but in the end, Trump defeated her with a narrow victory of roughly 1.5 percent in the national popular vote.\n\nAccording to Wall Street Journal reporters Ashlea Ebeling and Richard Rubin, however, Trump's \"big, beautiful bill\" — which was narrowly passed along partisan lines, 215-214, in the U.S. House of Representatives and went to the U.S. Senate for consideration — is at odds with his 2024 campaign promise on Social Security taxes.\n\nIn a WSJ article published on May 29, Ebeling and Rubin report, \"The legislation passed by the House last week would give seniors a temporary extra deduction of $4000, which would lower taxes for many of the people Trump was targeting with his pitch. But this alternative to","url":"https://www.alternet.org/wsj-social-security-trump/","image":"https://www.alternet.org/media-library/image.jpg?id=60338896&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-05-29 13:46:17","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":-0.165},{"id":326139444,"title":"Trump Lawyers Claim ‘60 Minutes’ Harris Interview Caused Him ‘Mental Anguish,’ Argue That the ‘First Amendment Is No Shield to News Distortion’ in Motion to Deny Paramount Bid to Dismiss Lawsuit","text":"President Trump’s legal team filed an objection to Paramount Global‘s move to dismiss his $20 billion lawsuit against CBS over a “60 Minutes” segment, arguing that the TV newsmagazine’s alleged deceptive editing of an interview with Kamala Harris is not protected by the First Amendment. Trump filed the lawsuit against CBS just days before the […]","summary":"President Trump&#8217;s legal team filed an objection to Paramount Global&#8217;s move to dismiss his $20 billion lawsuit against CBS over a &#8220;60 Minutes&#8221; segment, arguing that the TV newsmagazine&#8217;s alleged deceptive editing of an interview with Kamala Harris is not protected by the First Amendment. Trump filed the lawsuit against CBS just days before the [&#8230;]","url":"https://variety.com/2025/tv/news/trump-lawsuit-60-minutes-mental-anguish-first-amendment-deny-paramount-dismiss-1236412707/","image":"https://variety.com/wp-content/uploads/2024/11/GettyImages-2183337623-e1730930138506.jpg","video":null,"publish_date":"2025-05-29 13:26:49","author":"Todd Spangler","authors":["Todd Spangler"],"language":"en","source_country":"us","sentiment":-0.574},{"id":326133366,"title":"The Disinformation Deluge Requires Experts to Step Up as ‘Truth Vigilantes’","text":"As they’ve licked their wounds since the 2024 election, Democrats have debated how to knife through an information system thick with conservative influencers “just asking questions” and other fact-free noise, wondering if they need “their Joe Rogan” to compete. Whatever the tactics, the unsettling reality is experts and true authorities appear ill-equipped to burst well-fortified media bubbles, in what even their allies see as an asymmetrical war.\n\nThe challenge, according to Angelo Carusone, who leads the liberal watchdog group Media Matters for America, is not just the advantage that purveyors of disinformation enjoy, but whether once-trusted institutions and the people who lead them possess the tools to effectively fight back. He sees ways, but they might require new messengers as well as fresh strategies about how and where to deploy them.\n\n“The expert community has to think about how they’re going to evangelize and buttress the credibility of their fields,” Carusone told TheWrap. “They’re going to need warriors. They’re going to need truth vigilantes.”\n\nRecent studies have painted a gloomy picture of the state of play. A Pew Research Center poll titled “What Is News?” found that 55% of Americans say it’s “at least somewhat important for their news sources to have political views similar to their own,” further noting that the audience, not journalists, determine what constitutes “news.”\n\nIn a related study, Media Matters explored how the most popular and influential online shows — including those that self-identify as nonpolitical — are “overwhelmingly right-leaning” by almost three to one, despite being described in categories like comedy, entertainment and sports.\n\nSome consciously straddle those lines, such as OutKick, whose founder, Clay Travis, parlayed his sports profile into a media platform that incorporates sports, politics and culture with a conservative bent. Fox acquired the site in 2021, and OutKick has grown significantly since then.\n\nOthers have clearly taken note of such successful examples, with the Media Matters study citing various programs that have “repeatedly pushed pro-Trump messaging” and right-wing narratives and disinformation that seeps into “supposedly nonpolitical spaces.”\n\nIn some respects, this dynamic is nothing new, in the same way Rush Limbaugh carved out a lucrative platform in AM radio, which then became overwhelmingly conservative, countering the “lamestream media” and attracting an army of loyal “ditto-heads.”\n\nThe reason the current battle is so one-sided, Carusone maintains, is the political left lacks the infrastructure to mobilize in a way that can counter voices coming from the right, which has made “strategic investments in incubating storytellers and talent.”\n\nThose storytellers are especially good at reaching what often get referred to as “low-information voters,” helping them process and understand — or rather, feel as if they understand — complex hot-button issues. The talking points echo across multiple shows and personalities, bolstering conservative and pro-Trump narratives.\n\n“They have reached such a center of gravity that they’ve created a feedback loop that is pulling more and more programming to the right,” Carusone said, while undermining confidence in institutions. “Broadly speaking, credentialism just doesn’t matter anymore.”\n\nThat dynamic has certainly been true in medicine and science, where figures like Dr. Anthony Fauci have been demonized as part of efforts to discredit them, a void frequently filled by purveyors of quack science and miracle cures.\n\nSome experts in fields like science, medicine, economics and history — people who have invested lifetimes studying them, only to see dabblers swoop in with their hot takes — have taken it upon themselves to try combating disinformation, beyond the customary TV hits within like-minded silos on cable news. Dr. Neil Stone, for example, a London-based infectious diseases specialist, persistently uses his X account to attack anti-vaccine rhetoric and medical misinformation emanating from online posters while regularly calling out Health and Human Services Secretary Robert F. Kennedy Jr.\n\n“Social media has a really tedious habit of people dragging up junk theories which have been thoroughly debunked maybe 20-30 years ago, and now we have to do it all over again,” Stone said in one tweet, adding in another, “RFK Jr. sounds learned and knowledgeable to the uninformed. He sounds like a fraudulent quack to experts.”\n\nOthers have sought to address disinformation head on by venturing into the belly of the beast, so to speak, confronting the “just asking questions” crowd on their turf. Historian Douglas Murray caused a stir by engaging in a viral exchange with Rogan and comic Dave Smith, challenging Rogan for booking guests who have “appointed themselves experts, who are not experts.”\n\n“If you throw a lot of s–t out there, there’s some point at which ‘I’m just raising questions’ is not a valid thing,” Murray argued, while taking Smith to task for weighing in on issues without committing the time to research them. “You’re not raising questions … You’re telling people something.”\n\nAlthough such moments occasionally break through via social media, the problem remains that people have limited time, and Trump and his acolytes suck up a great deal of media oxygen.\n\nIn addition, some attempts to counter the right have also prompted derision for how inorganic and tone-deaf they sound, from Democrats in Congress posting goofy videos to a recent New York Times report about a Democratic plan to “study the syntax, language and content” necessary to engage and gain attention from young men.\n\nAddressing that larger challenge serves as the underlying premise of MSNBC host Chris Hayes’ new book, “The Siren’s Call: How Attention Became the World’s Most Endangered Resource,” which argues that attention has become a major commodity, and observes that seeking to conduct serious conversations amid the current media din is “like trying to meditate in a strip club.”\n\n“Can’t help but feel we’re living through an increasingly existential war between spectacle and substance with spectacle winning battle after battle after battle,” Hayes recently posted on Bluesky, summing up the handicap that expert voices face.\n\nFormer “Meet the Press” host Chuck Todd complemented those sentiments during a podcast with Mediaite, saying that while Trump hasn’t really changed — he suggested people go read his 1990 Playboy interview as proof — the media has shifted in a manner that benefits him in “this era of grievance-driven, outrage-driven clicks.”\n\nWading into that vitriol-laced swamp isn’t for the faint of heart, which explains Carusone’s contention that Democrats need certain kinds of “warriors” to carry the banner. Moreover, Trump’s willingness to use the levers of government against political opponents comes with certain risks.\n\nWhile Trump has blustered about investigating celebrities like Bruce Springsteen and Oprah Winfrey who have spoken out against him (and endorsed Kamala Harris during the campaign), there have been more immediate and tangible manifestations of possible fallout, including reports the Federal Trade Commission is investigating Media Matters for possible collusion with advertisers against X — an action Carusone has characterized as overtly political and an effort to intimidate his group and others.\n\nNevertheless, Media Matters has vowed to continue fighting, with Carusone expressing the belief that despite the right’s messaging edge, it’s still possible to begin turning the tide.\n\n“It is terribly depressing, but there is still a spark there that’s not completely gone,” he said. “The cancer’s operable.”","summary":"The right-wing tilt of online voices favors “just asking questions” quacks and self-promoters. But Media Matters’ Angelo Carusone sees ways to break through\n\n\nThe post The Disinformation Deluge Requires Experts to Step Up as ‘Truth Vigilantes’ appeared first on TheWrap.","url":"https://www.thewrap.com/experts-battling-disinformation-media-matters/","image":"https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/05/052725-Fauci-Rogan-Travis.jpeg?fit=1200%2C675&quality=89&ssl=1","video":null,"publish_date":"2025-05-29 13:15:00","author":"Brian Lowry","authors":["Brian Lowry"],"language":"en","source_country":"US","sentiment":0.079},{"id":326108322,"title":"James Monroe Iglehart Reveals What Kamala Harris Told Him While Visiting “A Wonderful World ”(Exclusive)","text":"Kamala Harris spreads inspiration everywhere she goes. \n\n Speaking with PEOPLE at the 2025 Tony Award ‘Meet the Nominees’ event, Broadway star James Monroe Iglehart looks back on the special day the former vice president, 60, made a trip to see his musical, A Wonderful World: The Louis Armstrong Musical, based on the life and career of Louis Armstrong.\n\n Harris and her husband, Doug Emhoff, visited the show on Feb. 15, when it was playing at Studio 54 Theatre in New York City.\n\n \"First of all, they didn't tell us,\" Iglehart, 50, recalls of the big day. \"They just kept saying, 'There's somebody here and you guys all have to stay back.' We were like, 'Who is here?' \"\n\n The anticipation grew as the show started, but the seasoned actor, who played the titular character in the musical, eventually shook it off. \"We couldn’t look into the audience,\" he explains. \"As Louis, for the first time in my life, I felt like a serious actor. I was like, 'Just concentrate on what you're doing. Don't worry about what's going on. You'll see it at the end.' So I forgot there was somebody there.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human-interest stories.\n\n After the show, as Iglehart was taking off his costume, he heard an announcement. \"They were like, 'Ladies and gentlemen, please come down because Vice President Kamala Harris is here.' A scream came out of my mouth, I couldn't get dressed fast enough,\" he remembers. \"I got down there and I was just in awe.\"\n\n Then came the big moment. What do you say to a person of such caliber?\n\n \"I walked up to her and I didn't even get to say anything,\" Iglehart says. \"I was like, 'Hi, I'm…' And she said, 'What you're doing here is so important. The story you're telling is so important. I just want to thank you for that and thank you for your artistry.' And I was like, 'Oh...' I didn't speak to her.\"\n\n The starstruck actor proceeded to speak with Emhoff, who complimented his performance. Then, he found himself becoming \"a normal person again.\"\n\n The encounter remains etched into the actor’s memory, especially given that it was just weeks after President Donald Trump was sworn into office following his race against Harris. \n\n \"It was one of those moments where I really saw what theater could do,\" Iglehart says. \"Sometimes you forget that other people come to what we do to just chill out and get away from the world for a little bit. And our job is to entertain you for a couple of hours and take you away from whatever's going on in the world. The fact that we could do that for Vice President Kamala Harris, I was like, 'Okay, yeah, we did our job.' She was so sweet. We took pictures.\"\n\n The PEOPLE App is now available in the Apple App Store! Download it now for the most binge-worthy celeb content, exclusive video clips, astrology updates and more!\n\n Iglehart starred in the musical during its Broadway staging from November 2024 to February. He also co-directed the production alongside Christopher Renshaw and Christina Sajous, after having played Louis in the show's early runs in New Orleans and Chicago.\n\n The actor also took away a valuable lesson from playing the singer. \"Louis didn't try to be anybody else. He didn't try to act like anybody else or sound like anybody else. He was completely comfortable in his own skin, but he had to learn to be that,\" Iglehart says. \"And through this process, I have had to learn to be that.\"\n\n Now, the actor feels “more comfortable being me than I ever have in my entire life,\" which he credits to living through the jazz crooner.\n\n It’s been over a decade since Iglehart won a Tony for playing the Genie in Broadway’s Aladdin. When it comes to being back on the awards circuit, he describes the experience as \"surreal.\"\n\n \"I literally did not expect this,\" the actor says. \"I can't believe I'm here. Last time, I was excited because I was a newbie. This time, I'm just glad to be among the folks. I didn't know if I'd have a second time, so this time I'm just going to let the ride go and enjoy what happens.\"\n\n The 2025 Tony Awards will air live from N.Y.C.'s Radio City Music Hall Sunday, June 8 on CBS.","summary":"\"It was one of those moments where I really saw what theater could do,\" the Tony nominee says","url":"https://people.com/what-kamala-harris-told-james-monroe-iglehart-at-a-wonderful-world-11740764","image":"https://people.com/thmb/vdNH2ZozjR-b1clv1ycefmoDWZ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1046x547:1048x549)/Kamala-Harris-James-Monroe-Iglehart-052325-b2aeceed889e4d5da03a157062e74174.jpg","video":null,"publish_date":"2025-05-29 12:00:00","author":"Raven Brunner","authors":["Raven Brunner"],"language":"en","source_country":"US","sentiment":0.303},{"id":326129948,"title":"Voices: Who’ll draw first blood in the tariff wars: Trump or the US courts?","text":"If there was one difference between Donald Trump’s first term in the White House and his second, it was said to be his lessons learned. Nowhere was this more apparent than in the speed of his appointments and the torrent of executive orders he issued in his first hours. \n\nTrump’s brazen demonstration of executive power seemed at odds with everything most people learn about US democracy as being a system of checks and balances designed also to rein in presidential excess. But it met with little challenge – unlike in his first term. \n\nSomething similar applied to the appearance of the unelected billionaire tech CEO Elon Musk as head of a new Department of Government Efficiency (DOGE) to scythe through whatever he might define as waste and impediments to getting the presidential job done. \n\nSuddenly, with yesterday’s ruling from the US Federal Court of Trade, rejecting Trump’s imposition of new trade tariffs, and Musk’s announcement that he has left the administration, the Trump system, such as it was, seems in disarray more profound than his usual impression of chaos. Whether these developments mean that Trumpism 2.0 has hit its limits is another matter. \n\nThe ruling is the move that will have the greatest immediate impact, although one that is largely interim as Trump is set to appeal, precipitating an eventual showdown at the US Supreme Court. In the meantime, the status of the tariff increases unilaterally announced by Trump on 2 April, what he called “Liberation Day”, remains uncertain, along with the various compromise agreements reached by some – including by the UK – and under negotiation by others, including the EU.\n\nHaving upended the global trading system once, with dramatic effects on international markets that have largely been weathered, Trump will have few qualms about further disruption, not least because his comprehensive re-ordering of tariffs remains a cornerstone of his economic policy and enjoys wide popularity among his voters. \n\nThose trading with the US have little choice but to sit tight and let the US constitutional system take its course. Some, with the capacity to do so, rushed to export goods to the US under the old rules, but others either lacked the capacity or were not so lucky. For the time being, it is probably reasonable to conclude that a large part of the international trading system is on hold. \n\nAs for the likely outcome, it is hard to envisage a victory for Trump, if not impossible. Two groups brought cases in the Trade Court: an independent group called the Liberty Justice Center made representations on behalf of small importers and a group of state governors claimed their states’ interests had been damaged, with a three-person tribunal finding that Trump had misused a declaration of emergency to alter tariff arrangements essentially by decree, without consideration, as would otherwise be required, by the US Congress. \n\nThe Supreme Court will have to judge whether there were grounds for declaring an emergency, and, even if there were, whether that gave him the power to override Congress. The Supreme Court – perhaps, but not entirely, out of self-interest – is seen as preferring to uphold rather than weaken the system of checks and balances, which would tend to suggest a Trump defeat. However, nothing can be ruled out. \n\nMore surprising perhaps is that it has taken four months and resorting to a specialist federal court to cause Trump’s first second-term stumble. In his first term, practically every move he made encountered resistance, whether from Congress, the courts, or street protests. Or, in the case of his foreign policy, the “Russia-gate” claims of collusion with the Kremlin. \n\nThis time around the balance of power in Washington is different. There is the weakness of the Democrats following Kamala Harris’s defeat and now embroiled in recriminations over Joe Biden’s fitness for office, the fact that Republicans narrowly control both Houses of Congress, Trump’s clear electoral mandate, and the early dismissals he authorised in the FBI and other departments that had stymied him the first time around. \n\nThe departure of Elon Musk may be seen as having far less of an impact on the administration than the possible enforced reversal of Trump’s trade tariffs. After all, it was evident practically from day one that the White House could not be big enough for both of them. \n\nIt could also be argued that Musk has already had an outsized influence and not just in the Trump White House. The enthusiasm with which he set about slashing government departments, abolishing diversity measures, and government-funded operations such as USAID, delighted Trump supporters but also gave the voting public in many other countries new ideas about what might be feasible. \n\nIf Trump loses his tariff battle in the courts it is Musk’s brief and constitutionally questionable tenure at the White House that could have a farther-reaching legacy.","summary":"Trump’s chaotic rampage through executive power is finally meeting an immovable force in the US courts and constitution, writes Mary Dejevsky. Let battle commence…","url":"https://www.independent.co.uk/voices/trump-tariffs-federal-courts-musk-doge-b2759933.html","image":"https://static.independent.co.uk/2025/05/29/04/Musk_Trump_90406.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/CmMEdZ7h-4VHSaSK0.mp4","publish_date":"2025-05-29 11:28:58","author":"Mary Dejevsky","authors":["Mary Dejevsky"],"language":"en","source_country":"gb","sentiment":-0.114},{"id":326104152,"title":"Jesse Watters Primetime - Wednesday, May 28","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode May 29, 2025 40:03 \n FULL EPISODE\n\n EXP 7 DAYS\n Jesse Watters Primetime - Wednesday, May 28 \n Kamala Harris, Trump Approval, Voters \n Tags MOST RECENT EPISODES | VIDEOSJESSE WATTERS PRIMETIME | FULL EPISODES","summary":"Kamala Harris, Trump Approval, Voters","url":"https://www.foxnews.com/video/6373604005112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/567d5f17-5901-48be-8cea-72507ae70e93/15125e18-a774-471f-8087-7509f18e1538/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-05-29 11:07:02","author":null,"language":"en","source_country":"us","sentiment":-0.308},{"id":326099436,"title":"SCOOP: GOP push for new House committee to probe Biden decline 'cover-up' gains steam","text":"FIRST ON FOX: House Republicans are mounting a push to start a new select committee focused on investigating the Biden administration for allegedly \"covering up\" signs of the 82-year-old former president's decline. Rep. Buddy Carter, R-Ga., is introducing legislation Thursday that would establish a panel of congressional investigators to \"investigate and report upon the facts of President Joseph Robinette Biden, Jr.’s cognitive and physical health decline and the potential concealment of information from the American public,\" according to bill text obtained by Fox News Digital. Republicans have unleashed a tidal wave of scrutiny on the previous Democrat White House as new reports – as well as old concerns previously dismissed by mainstream media – surface about Biden's mental state while in office and what lengths those closest to him took to allegedly hide it from others. SCOOP: HOUSE GOP MEMO HIGHLIGHTS REPUBLICAN WINS IN TRUMP'S 'BIG, BEAUTIFUL BILL' Carter's text calls to investigate former Vice President Kamala Harris and former first lady Jill Biden as well as whoever took part in keeping the audio tapes of Special Counsel Robert Hur's interview with Biden from the public. The select committee would also focus on whether Biden allies \"concealed\" his prostate cancer diagnosis before it was announced publicly last week. Biden's spokesperson denied prior knowledge of the diagnosis in a statement to the New York Times. The resolution also specifically called for a probe into the use of the autopen in Biden's White House to sign meaningful legislation. \"This is potentially the biggest political scandal of our lifetime, and the American people deserve to know the truth about who was really running the White House during Biden’s tenure as president,\" Carter told Fox News Digital of his legislation. \"From using the autopen to pardon his own family members to likely concealing a cancer diagnosis, our government must restore trust with the public by fully investigating the former administration’s lies and getting to the bottom of one of the most consequential coverups in history.\" Carter, who is currently running for Senate in Georgia, was among several Republicans who demanded Biden take a cognitive test last year. \"The American people can no longer be left to wonder about their safety and security because of the President’s deteriorating mental state,\" Carter wrote in a June 2024 letter to the White House. MIKE JOHNSON, DONALD TRUMP GET ‘BIG, BEAUTIFUL’ WIN AS BUDGET PASSES HOUSE His new resolution comes on the heels of House Oversight Committee Chair James Comer, R-Ky., opening his own investigation into revelations surrounding Biden's cognitive decline. CLICK HERE TO GET THE FOX NEWS APP Comer spent much of the last Congress investigating whether Biden and his family unjustly profited from foreign cash. The House Oversight chair sent letters to former senior White House aides, including Biden's doctor, Kevin O'Connor, announcing a probe into \"the role of former senior Biden White House officials in possibly usurping authority from former President Joe Biden and the ramifications of a White House staff intent on hiding his rapidly worsening mental and physical faculties.\" Meanwhile, first-term Rep. Jimmy Patronis, R-Fla., called for a similar select committee on Wednesday.","summary":"House Republicans are proposing a select committee to investigate former President Joe Biden&apos;s alleged cognitive decline and concealment of health issues.","url":"https://www.foxnews.com/politics/scoop-gop-push-new-house-committee-probe-biden-decline-cover-up-gains-steam","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-dhs-split-bdep.png?ve=1&tl=1","video":null,"publish_date":"2025-05-29 11:00:36","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":0.071},{"id":326091582,"title":"Who Is Laura Loomer? All About The Trump Insider Who Wants 'Dream Job' To Vet Student Visas","text":"A far-right provocateur, conspiracy theorist, and Donald Trump’s close ally who has called for the deportation of Chinese President Xi Jinping’s daughter as the United States announced that it would “aggressively” revoke visas of Chinese students—Laura Loomer is all this and more.\nThe American far-right MAGA activist hit the headlines on Thursday again when she threw her weight behind the Trump administration’s efforts to tighten immigration controls and scrutinise international students. \nUS Secretary of State Marco Rubio said in a post on X: “The US will begin revoking visas of Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields.” In a statement, he added that the State Department will revise visa criteria to impose stricter scrutiny on all future applications from China and Hong Kong.\nReplying to this, Loomer said, “LET’S GO! DEPORT XI JINPING’S DAUGHTER! She lives in Massachusetts and went to Harvard! Sources tell me PLA guards from the CCP provide her with private security on US soil in Massachusetts!”\nWHO IS LAURA LOOMER?\nThe 31-year-old Loomer first shot to the limelight through her far-right activism, putting forth her controversial views on Islam and her incendiary statements.\nAccording to Firstpost, Loomer ran for US Congress in Florida’s 21st district in 2020, winning the Republican primary. However, she lost the general election to Democrat Lois Frankel and her subsequent bid in 2022 too was unsuccessful.\nA CONTROVERSIAL PAST\nLoomer is no stranger to controversies. Her anti-Islam and anti-immigration stance has left many divided—for instance, in 2018, she called herself a “proud Islamophobe” and suggested the creation of a ride-sharing service that excludes Muslims.\nBanned from social media platforms such as Twitter (now X), Facebook, and Instagram for her divisive comments, she quickly made a comeback to X after Elon Musk acquired it.\nOne of Laura Loomer’s most controversial claims is her insistence that the 9/11 attacks were an “inside job” carried out by the US government—a theory she has promoted frequently on social media, despite extensive evidence disproving it. At one point, she falsely connected the attacks to a comment made by then Secretary of Defence Donald Rumsfeld about $2.3 trillion in unaccounted funds. However, Rumsfeld’s remarks referred to inefficiencies in outdated accounting systems, not evidence of a conspiracy.\nLoomer had also infamously tweeted that if then US vice-president Kamala Harris were elected, “the White House will smell like curry” and that speeches would be “facilitated via a call centre.”\nDespite her controversial persona, Loomer is considered a part of Trump’s close coterie. Although she does not hold an official role in his campaign, Loomer has been a frequent presence at Trump events, including rallies and private meetings at his Mar-a-Lago resort and Bedminster golf club. She has also traveled with Trump on his campaign plane and attended significant events such as the 2024 presidential debate in Philadelphia and the September 11 commemorations.\nTrump has publicly praised Loomer, describing her as a “fantastic person” and a “woman with courage,” and has shared her content on his Truth Social platform. He has also acknowledged her as a “very important person, politically,” and commended her for her strong opinions.\nTHE IMMIGRATION ROW\nLoomer has been actively involved in advocating for restrictive immigration policies, particularly targeting foreign students and workers. She has publicly appealed to Trump for a position to vet the social media profiles of international students, describing it as her “dream job”. \nShe has also been vocal in her opposition to the H-1B visa programme, which allows US employers to hire skilled foreign professionals. She has referred to Indian immigrants as “third-world invaders” and criticised tech billionaires for exploiting the visa system for “cheap labour”.\nLoomer has criticised proposals to issue green cards to foreign students who graduate from US colleges, arguing that such policies could undermine American workers. She has called for a halt to visa issuance until issues like homelessness among veterans are addressed and illegal immigration is curtailed.\nHer latest comments on Jinping’s daughter come amid rising US-China geopolitical tensions and reflect the US’ broader agenda to restrict immigration, particularly targeting foreign students and skilled workers.","url":"https://www.news18.com/world/who-is-laura-loomer-all-about-the-trump-insider-who-wants-dream-job-to-vet-student-visas-ws-kl-9358248.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/loomer-2025-05-2af8d2378388efcd740d6c161dac5f60.jpg","video":null,"publish_date":"2025-05-29 10:51:58","author":"Apoorva Misra,News18","authors":["Apoorva Misra","News18"],"language":"en","source_country":"in","sentiment":-0.023},{"id":326099246,"title":"House GOP plans to impose harsher penalties on repeat border crossers","text":"Knott, a freshman on the House Homeland Security Committee, introduced his legislation three weeks ago. It was then referred to the Judiciary Committee and ultimately combined with the Stopping Illegal Entries Act, originally introduced by Rep. Stephanie Bice (R-OK).\n\nSince then, the House GOP has moved quickly to get the bill through committee and ready for the House floor.\n\nThe bill would be another tool for the Trump administration to use in its crackdown on illegal immigration and cross-border crime, as it would deter deported individuals from returning to the country as the Trump administration tries to carry out its mass deportation operation.\n\n“There’s obviously a great need for the wall, for deportations, for deployment of technologies, et cetera, but those alone are not going to be very effective,” said Knott, a former federal prosecutor. “We cannot round up 15 to 25 million people who are here illegally.”\n\n“A very big piece that no one is talking about yet anyway is the deterrence factor that my bill addresses,” Knott said. “If you are asked to leave the country, come back a second time, we’re not having that anymore.”\n\nRep. Troy Downing (R-MT), a cosponsor who lives on the U.S.’s northern border, said increasing penalties was long overdue.\n\n“When it comes to combating illegal immigration, deterrence is the best form of prevention,” Downing said in a statement. “For too long, a lack of repercussions for repeat offenders at the border drove encounters to record levels.”\n\nPresently, illegal immigrants caught reentering the country a second time or any time thereafter face a federal felony charge that is punishable by up to two years in federal prison. The average sentence length is 12 months, Knott said.\n\nHowever, not all cases are referred for prosecution to the Justice Department.\n\nThe bill would change the Immigration and Nationality Act to punish second-time border crossers with up to 10 years in prison.\n\nIllegal immigrants convicted of a state or federal felony while in the U.S. but who have not been deported would face a minimum five-year sentence.\n\nBORDER PATROL USING TECHNOLOGY TO ‘WALL’ OFF CANADIAN BORDER\n\nIllegal immigrants who committed a felony and were deported before returning to the U.S. would face between 10 years and life in prison.\n\n“We have to continue telling folks, ‘This is why we need a law.’ If Kamala Harris were to win, you know what would happen? You would have an immediate reversion back to the open border policies,” Knott said. “If that open border is achieved, it’s going to be much less pervasive if law enforcement has my bill to lean on, right? Because she cannot undo a statute.”","summary":"House Republicans are fast-tracking a bill that would dramatically raise the punishment for illegal immigrants caught attempting to enter the United States after being deported. The Stopping Illegal Entries Act was passed out of the House Judiciary Committee last week after being tweaked to include language from Rep. Brad Knott&#8217;s (R-NC) legislation titled the Punishing [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3423716/house-gop-fast-tracking-illegal-immigrant-punishment-bill/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/border-patrol-migrants.webp","video":null,"publish_date":"2025-05-29 10:30:00","author":"Anna Giaritelli","authors":["Anna Giaritelli"],"language":"en","category":"politics","source_country":"us","sentiment":0.071},{"id":326175424,"title":"\"It is like gravity being reversed\": How Trump's DOJ created \"an invitation to discrimination\"","text":"Donald Trump is America’s first White president. He is advancing a revolutionary project to end multiracial pluralistic democracy. As a practical day-to-day matter, this means protecting the power, influence, and privileges of white people over Black people and other non-whites.\n\nThe evidence about the role that white racism and white racial resentment played in Donald Trump’s return to power is overwhelming: contrary to the disproved narrative, it was racism and not “working class” anxiety that overdetermined white support for Donald Trump and the MAGA movement.\n\nDonald Trump was able to use that energy to fuel his ascent back to the White House, where he is now “governing” as an autocrat who has aspirations to be a dictator. In a 2018 op-ed essay in The New York Times, Charles Blow described this appeal as: “Trump is man-as-message, man-as-messiah. Trump support isn’t philosophical but theological. Trumpism is a religion founded on patriarchy and white supremacy.” As such, Donald Trump will (and is) amplify his racist policies and behavior to maintain control and power when/if he faces pushback from the American people.\n\nDonald Trump’s authority and power are being used not just against non-whites but against white people — including his own MAGA people — as well. To that point, Trump’s “big beautiful bill” that is being forced through Congress by his supplicant MAGA Republicans will take away hundreds of billions (and likely trillions) of dollars from the country’s social safety net by cutting programs such as Social Security, Medicare, Medicaid, and the Affordable Care Act and then transferring it to the plutocrats and kleptocrats. As President Johnson so wisely observed and warned, “If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.”\n\nUltimately, the power of white elites to use white racism and white racial resentment to influence and otherwise convince and compel white Americans to support policies and engage in behavior(s) that actually causes them harm is older than the nation itself.\n\nDamon Hewitt is the President and Executive Director of the Lawyers’ Committee for Civil Rights Under Law. Before joining the Lawyers’ Committee for Civil Rights, Hewitt served as lead counsel on litigation and policy matters and supervised teams of lawyers and non-lawyers at the NAACP Legal Defense and Educational Fund.\n\nIn this wide-ranging conversation, Dewitt explains how the struggle to defend democracy and civil rights in the Age of Trump will be a marathon and not the sprint of a few years between elections and campaigns. He also explains how if American democracy was a type of medical patient, they would be very sick and in need of long-term, sustained care because the rise of Trumpism and authoritarian populism reflects much deeper acute systemic problems.\n\nDewitt warns that the Trump administration’s assaults on democracy, freedom, democratic institutions, civil rights, the rule of law, and the Constitution will not be limited to just “those people” (i.e. “illegal aliens,” “migrants,” Black and brown people, the LGBTQ community and other marginalized groups) but will soon target the American people as a whole with drastically negative consequences for most, if not all, areas of their lives.\n\nHow are you feeling? How are you managing on the day-to-day given the worsening state of American democracy and rising authoritarianism? You lead an organization that is committed to defending civil rights. You are literally at ground zero right now.\n\nIt is challenging. This crisis is a test of our collective stamina for what is a marathon and not a sprint. I think about my work as being part of a generational struggle. The baton was passed to us, and we’d best not drop it. Defending civil rights can be exhausting — and that is in the best of times. But as I tell my team here at the Lawyers’ Committee for Civil Rights Under Law, “we must have joy amidst the struggle.” I said that before Trump's return to power, and that principle is much more important now. There is a profound sense of urgency among those who are working in this space in civil society. We are not in a moment where we can just wait three and a half years, and things are automatically going to get better once we have a new president. Part of the approach to stopping these assaults on democracy, the rule of law, and civil rights is a type of harm reduction model. We are trying to slow down that overflowing sewer, the flooding of the zone.\n\nYou summoned the type of therapeutic language that is necessary to understand that this American democracy and society are very sick and in pain. Using that framework and metaphor, if America in the Age of Trump is the patient and you are the doctor, how would you assess its health? \n\nThat is an amazing metaphor. Very powerful. As I see it, the patient has probably gone to an urgent care center when they actually need to see a specialist — or more likely multiple specialists. The patient needs to have an entire program of care, but they have been avoiding the doctor because they are afraid to do the work of taking care of themselves properly. They don't want to take the medicine or follow through on the treatments because it won't be easy. The patient does not want to change their diet. Getting better is going to require lots of hard work, and it is going to hurt. But guess what? If the patient stays sick, it is going to hurt even more. Denial is very powerful in America. There are large numbers of people and institutions who actually believe that they can just put their heads down and it will all be fine. It won't be. A big part of the denial is not realizing or admitting that you can continue to get sicker, that your health can devolve, the disease can and likely will get worse if left untreated. \n\nOne of the largest and most critical mistakes that the mainstream political class and news media types continue to make, years into the Age of Trump, is to not understand how Trump's ascent is the result of much deeper and far older problems and systemic failures in this society. This is more than a failure of imagination, it is a choice at this point.\n\nOne of the root causes of this crisis is deep social inequality and financial precarity. There was a time when having a high school diploma and getting a job with a pension was a formula to be part of the solid middle class in this country. Now, a college degree or even an advanced degree is often a formula for little to no upward economic mobility. In the United States, we have a generation of young people who are now much less likely to be better off than their parents economically. We are mired in reverse social mobility. If one believes that progress in this country is linear and upward, such a reality is jarring and enraging.\n\nThis helps to explain why there is a cohort among the American public who is attracted to both Bernie Sanders and Donald Trump. Both of them are very different in terms of politics and values. However, they both symbolize and channel rage at a system that is not working for a larger and growing number of Americans. And of course, racism is a deep part of the rise of Trumpism and the MAGA movement. The data is clear in that regard. Racism is not just a stain on the American social fabric, it is a deep and indelible part of that fabric. The inability of law and public policy in this country to keep up with the shifting, evolving manifestations of racism is leaving a lot of people disaffected as well.\n\nLooking at the white backlash and white frontlash, the rolling back of decades of progress along the color line, I have been asking myself what year is it really? Do Trump and his MAGA forces and their allies want to return the country to the 1950s? The Gilded Age? Even earlier? As the joke goes, Black people can't really mess with time machines. That is also true of many other groups, too — even if they are in denial about how precarious their rights and freedoms and personhood truly have been historically and continue to be in this country.\n\nHere is a thought experiment: Tell me a year when hundreds of 1000s of people took the streets in peaceful protest, when elected officials obstructed justice when it came to racism, when the President of the United States had to take to the airwaves to talk about the importance of voting rights not just for Black people, but all people in the country, when people who fought for racial justice had to worry about their physical safety and surveillance. That year was 1963. That is the year the Lawyers’ Committee for Civil Rights Under Law was founded. But what I am describing could have been any of the last few years, too.\n\nYou are correct. It does feel like we are in a time warp in this country right now, and in the last few years. It is very disorienting. Trump's election, twice, is also a reminder that social progress is not linear and that the country's democratic institutions and infrastructure are more fragile than many of the country's leaders — as well as average Americans — wanted to admit. After the Civil War, there was Reconstruction. Reconstruction was one of the most radical and successful experiments in expanding democracy in American history. The civil rights movement and its victories were a second Reconstruction. The United States is going to need a third Reconstruction to begin to heal from the damage that is now being caused and the deeper problems that got us to this democracy crisis. \n\nTo that point, Black Americans and other nonwhites have only been equal citizens under the law in this country for about 60 years.\n\nOne can make a compelling argument that the Civil Rights Act and Voting Rights Act were the nation's birth certificate. America as a modern nation was born from those laws, and the project of democracy has been expanding access and protecting all Americans and their right to the franchise. That was only 60 or so years ago. America's experiment in democracy is very young. The American democratic experiment and its fruits and legacy are very much imperiled now.\n\nI have also been thinking a great deal about the work of the legal scholar Lani Guinier and her concept of \"political race\" and how Black and brown people are the miners' canaries in American society. She passed away in 2022. A great loss. What does it mean to be the \"miner's canary\" in the Age of Trump and his return to power?\n\nI was a research assistant for Lani Guinier during my first year of law school. To be the miner's canary means that the experiences of Black people are a prism through which to see a whole wide range of inequalities, beyond race, in this society. Inequality and other forms of marginalization and identity overlap and intersect. We have tons of data and all manner of empirical and other forms of evidence that show how race and racism structure American society and people's life outcomes and other opportunities and experiences. But to the miner's canary, if we make conditions better for the canary to survive, if not thrive in that metaphorical mine, we are making it better for just about everyone else too. The harsh reality about the miner's canary is that it often ends up dying. That is the signal for everybody else to get out of that mine right now because the air is poisonous. Black people are the miners' canaries in American society who are dying younger and at higher rates from a range of causes directly and indirectly related to racism and other forms of inequality and oppression. And guess what? Those premature deaths are a warning to everyone else. We are interconnected.\n\nBlack people were that miner's canary warning, very loudly, that Donald Trump's return to the White House would be a disaster for all Americans and an existential threat to the future of the country's democracy and freedom. There were other alarm-sounders as well. For example, the relatively small number of people with a prominent public platform who kept trying to warn the American people about what would happen if Trump was elected to a second term. How come those tens of millions of Americans who put Trump back in the White House did not listen to these grave warnings — warnings that have now come true?\n\nI will preface my answer by saying that the Lawyers’ Committee for Civil Rights Under Law is a non-partisan organization. Looking at the data, I have concluded that the 2024 election was largely decided by how a few million people who voted for the Democrats in 2020 decided not to vote at all this time. Trump also won a larger percentage of the Latino vote. He also expanded his base marginally among young black men. There are also single-issue voters who ignored all of the other, much more important issues regarding the future of American democracy and our rights and freedoms. Trump would tell Black Americans, What do you have to lose by voting for me and not the Democrats? Well, it turns out a whole lot. \n\nThose Black folks who switched over to Trump were a marginal but key part of his victory. However, we cannot and should not ignore how Donald Trump won a majority of white women. He has now done this three times. We need to ask white women as a group how they can continue to support Donald Trump given his personal behavior and values, the \"Access Hollywood\" tape, his treatment of Hillary Clinton and then Kamala Harris and powerful women more generally? Trump's support for taking away women's most fundamental civil rights to control their own bodies? How does a woman look her daughter in the eye and tell her she voted for such a man?\n\nWhat is the state of the rule of law right now in this country?\n\nThe rule of law has been exposed as being much more fragile than was commonly believed or hoped. The law is the connective tissue of our society and institutions, and norms. Our democratic system works because the leaders respect the opinions of the courts even if they do not personally agree with them. Donald Trump and his administration and the right-wing have increasingly rejected those norms about how the law works in the American democratic system. It is different, but perhaps the closest analog might be so-called \"massive resistance\" in the South and some other parts of the United States to the mandate of Brown v. Board of Education, where school districts refused to integrate, sometimes they were shutting down entire schools or districts to avoid compliance. There were even these fake legal theories known as \"interposition\" to resist the courts' orders about civil rights.\n\nDonald Trump as president, has repeatedly shown that he only cares about himself and not preserving, upholding, or protecting the country's democratic institutions, of which the rule of law (and equality under it) and justice are central. I have been speaking with retired federal judges about what could potentially happen if the executive branch loses in court and then refuses to respect the outcome. Or what if an officeholder loses an election and refuses to respect the people's will? Their answers were not comforting. At the end of the day, we still rely on the collective instinct of a few good people in the right places so that things don't fall apart in this country and our democracy. But it could all easily collapse. It has happened many times in other countries. The rule of law is not on strong ground with Trump 2.0. That’s why we must all devote a good deal of attention and energy to upholding it and fighting back against efforts to erode it.\n\nWhat is your reaction to how the Trump administration has remade the Office of Civil Rights to focus on protecting the supposedly trampled-upon rights of White right-wing Christians and \"oppressed\" white people more broadly?\n\nThis is about much more than just a simple shifting of policy priorities. That happens with new administrations and is relatively routine. What the Trump administration is doing is turning empirical reality and the facts upside down. It is like gravity being reversed. The Civil Rights Division has long been known as the crown jewel of the Department of Justice. The reason that the Department of Justice was created was to enforce federal civil rights laws. What the Trump administration is doing is taking away the avenues for redress and protection for people who have suffered real injustice and violations of their rights. Moreover, the actual laws and procedures that have been developed over decades to protect the civil rights of marginalized people — and by extension all people in this country — are being weaponized to serve Trump and the larger radical political project that seeks to take away equality under the law for all people.\n\nFor example, the Department of Education's Office for Civil Rights (OCR) has been waging a campaign of threats and over-the-top rhetoric to falsely imply that Title VI of the Civil Rights Act prohibits efforts by K-12 school districts and colleges to further diversity, equity, inclusion, and accessibility. By issuing threatening press releases, diatribes masquerading as policy guidance, current OCR leadership is not trying to enforce the law. They are actually trying to remake the law by elevating their own warped interpretations of Supreme Court precedent in the recent higher education admissions cases to cover nearly every aspect of school environments.\n\nAt the same time that the Department of Education is engaged in this campaign of intimidation requiring school communities to scramble, and teachers and administrators to be fearful, the Department of Education has also shuttered 7 of its 12 regional civil rights offices, leaving school communities in Texas, Ohio, California and many other states without anyone to call when a child faces discrimination at school. This simultaneous weakening and weaponization of civil rights infrastructure has left school districts are scrambling to meet the Department's demands while at the same time leaving parents and students who have been bullied at school because of their race, or are not receiving necessary services in relation to a disability, with no one in government to call for assistance.\n\nIn another attack on multiracial, pluralistic democracy, the Trump administration recently ordered that the Office of Civil Rights reject what is known as “disparate impact” as evidence of racism and other forms of discrimination. They have also ended investigations and monitoring of police thuggery and brutality and other abuses of the civil rights. \n\nWhile destroying and subverting the civil rights infrastructure, the administration also aims to unravel essential civil rights legal frameworks for addressing modern-day discrimination. Today, structural racism built into the norms and policies of institutions is harder to prove as intentional disparate treatment, but it can be proved through a legal standard called disparate impact. The Supreme Court first recognized disparate impact as a form of discrimination in 1971 and has since repeatedly upheld cases brought under that standard. Disparate impact liability is an essential tool that has been utilized for decades to enforce civil rights protections for individuals who are harmed by policies that appear neutral on their face but which are shown to erect barriers to opportunity for people from certain groups.\n\nThrough Executive Order, the Trump administration has claimed that disparate impact liability is unlawful. It has called for immediate repeal of all “racial nondiscrimination” regulations under Title VI of the Civil Rights Act that contemplate disparate-impact liability, directed agencies to assess pending investigations, lawsuits, and consent judgments that rely on disparate-impact liability and deprioritize enforcement of claims alleging disparate impact discrimination, and directed the Department of Justice to target state laws, regulations, policies, or practices that relate to disparate-impact. The administration's aim here is to destroy the foundation of civil rights protections in this country — to erode guardrails preventing discrimination in housing, lending, employment, education, healthcare, and other areas of life. It’s like declaring “open season” for racism — an invitation to discrimination.\n\nRecently, the Trump administration turned reality and facts upside down again when it abandoned ongoing Justice Department investigations into police misconduct in cities all across America. This sweeping announcement even included two cities–Louisville and Minneapolis–that had already voluntarily agreed to make critical reforms to their police policies and practices to mitigate instances of police violence against its citizens. This police misconduct was not speculative, it was reality. We know this because the Justice Department thoroughly investigated these police departments and then made its findings public.\n\nThe timing of this announcement makes these actions even more troubling. The Trump administration made this announcement just days before the five-year mark of the lynching of George Floyd by a Minneapolis Police Officer, and on the same day, Trump claimed that South Africa engaged in genocide against white Afrikaner farmers. Make no mistake, the Trump administration is making clear its view about whether Black lives matter. But upside down or not, a fact is still a fact. The findings from those police misconduct investigations cannot be easily swept under the rug.\n\nIf the Trump administration and the larger revolutionary right-wing, as seen with Project 2025 for example, gets its way, what will America look like? What do you want to prepare people for?\n\nIn the infamous Dred Scott decision, Supreme Court Justice Taney, speaking for the majority, said that the Negro has no rights which the white man is bound to respect. Well, that's how everybody in this country is going to feel. You will have no rights that Trump and the federal government are bound to respect. If you are an American citizen or if you have legal status to be in this country, you could be picked up off the street or taken from your home and put on a plane to some foreign prison. Sure, there are provisions in the Bill of Rights and Constitution prohibiting such a thing, but the Trump administration doesn't care about that. It may start there, and many Americans will incorrectly convince themselves that they are \"good people\" and haven't committed any crimes, so they are safe. They are not. Once one group is targeted or fundamental rights are taken away, then it is a slippery slope. Again, this is why the treatment of Black people in America is like the canary in the coal mine. The mistreatment of Black people is a harbinger of the mistreatment of all Americans.\n\nVoting rights will be taken away next. The Republicans and their allies on the state and local level are already systematically targeting the voting rights of Black and brown people — and white people as well — who support the Democratic Party. Many people in this country are going to learn the painful lesson that once the government says that you have no rights it is bound to respect that not just their political freedoms and civil rights will be constrained by their ability to have a happy life and to be fulfilled if not thrive will be taken away too. The destitution will not just be political and moral, it will be economic too. Under such an autocratic, if not outright authoritarian regime, the rich get richer and the poor get even poorer, and the middle class shrinks and disappears.","summary":"\"The administration's aim here is to destroy the foundation of civil rights protections in this country\"","url":"https://www.salon.com/2025/05/29/it-is-like-gravity-being-reversed-how-doj-created-an-invitation-to-discrimination/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2021/08/gettyimages-1233853572.jpg ?>","video":null,"publish_date":"2025-05-29 10:00:01","author":"Chauncey Devega","authors":["Chauncey Devega"],"language":"en","category":"politics","source_country":"us","sentiment":-0.188},{"id":326212336,"title":"The Real Original Sins","text":"Earlier this month on State of the Union, Jake Tapper challenged Democrats to get their house in order. “The stunning election result traced back to the original sin of the 2024 election, President Biden’s decision to run for re-election,” despite years of serious decline of his mental abilities, Tapper said. With his co-author Alex Thompson, Tapper conducted 300 interviews for the book Original Sin that surely proved that.\n\nAs a result, they said, “Democrats are now in the wilderness, and they are trying to figure out how to regain the trust of the American people.”\n\nMany news shows and stories used the book’s launch to explore why the Democratic Party has such low approval now and what they must do to navigate a path back.\n\nBut you must be living in a bubble if you believe this “cover-up” is the main reason for the disastrous election last November.\n\nAt least two-thirds of voters were desperate for change in the election, and nothing was more important than their desperation about the sustained high prices for everything important to their family. In Democracy Corps’s survey right after the election, fully two-thirds choose “inflation and the cost of living” as their top worry. That number stood out almost 20 points above the next problem, “immigration and the border.” And those are the actual “original sins” that drive the distrust of Democrats.\n\nBiden’s chief of staff Ron Klain understood that the president had to address the cost of living as prices spiked after the pandemic. To achieve that, he allowed me to edit the “Prep Version” of President Biden’s remarks to the AFL-CIO Constitutional Convention on June 14, 2022. I made a few edits in track changes to the president’s version to show his new priorities.\n\nI deleted “The fact is my plan is working for working Americans.” I replaced it with “The fact is my plan has made working families more resilient in the face of spiking inflation and gas prices hitting them now.”\n\nI cut “we are now living through the strongest—fastest—most widespread and equitable recovery in American history” and substituted new text about helping working families “faced with post-pandemic global inflation.”\n\nBut the president rejected those edits to this critical speech to the AFL-CIO.\n\nThe president went on to conduct many events on “Bidenomics.” In January 2024, I wrote to his campaign team, “You have conducted an experiment—speaking positively about the economy for two years. Your approval rating has only declined every month.” The perception that we have a “poor economy” only grows.\n\nThe president’s insistence on lauding the economy over a two-year period even as people faced continued unaffordable prices led to growing anger with him. Biden was seen increasingly as uncaring, out of touch, and not on your side.\n\nIn fact, Biden is not vastly different from earlier Democratic nominees and presidents in talking up the American economy. President Barack Obama cheered the millions of new jobs created on his watch and in 2016 said, “We created 15 million new jobs, incomes are rising, poverty is falling.” Hillary Clinton committed to “build on the progress.” Candidate Kamala Harris said, “It will be my intention to build on the foundation of this progress.”\n\nSome have suggested Democrats apologize for Biden getting the economy wrong. But you first must answer this: Why aren’t Democrats more critical of an economy that has failed so many people? Why do so many economists and commentators describe the economy as “the envy of the world”?\n\nBut as daunting as the problems with the economy are, so is the other original sin of President Biden: failing in his responsibility to manage the country’s border and stem the flow of refugees into the country. In my poll, Trump securing “the border” and deporting “illegal immigrants” was by far the top reason to vote for him. And the top reason to vote against Harris was Biden’s “open borders and illegal immigrants in all our cities.”\n\nThe consuming worry in my survey if you imagined Harris winning was “The border being wide open to millions of impoverished immigrants, many are criminals and drug dealers who are overwhelming American cities.”\n\nHow do you begin to be trusted after such a worry? Democrats might have taken a step if Harris had said, “This is an issue where I differ with the president.” Imagine if she had acknowledged that we’d lost control and should have changed course two years earlier.\n\nThat would have been a start, but today Democrats remain deep in the wilderness and continue to lose ground to Republicans on which party people register in and identify with.\n\nI worked to elect President Bill Clinton. So do not underestimate the ability of Democrats to renew their party.","summary":"What do Democrats need to do to win back voters’ trust?","url":"https://prospect.org/politics/2025-05-29-real-original-sins-democrats-biden/","image":"https://prospect.org/downloads/22945/download/Greenberg-Dems%20052925.jpg?cb=2ffe274f66d7418667d5b1ce36bbc516&w=1024","video":null,"publish_date":"2025-05-29 09:00:00","author":"Stanley B. Greenberg","authors":["Stanley B. Greenberg"],"language":"en","source_country":"us","sentiment":-0.111},{"id":326002282,"title":"FBI director Kash Patel warns bombshell Jan 6 finding will 'surprise and shock' Americans","text":"FBI Director Kash Patel has teased that the bureau's upcoming findings into whether informants were at the scene of the January 6 Capitol riots will 'surprise and shock' the American public.\n\nThe FBI director sat down in an exclusive interview with Fox News' chief political anchor Bret Baier that aired on the network's Special Report Wednesday, when he discussed the agency's investigation into the riots.\n\n'People have had questions about January 6th, whether or not there were FBI sources - not agents, sources - on the ground during January 6. And I told you I would get you the definitive answer to that,' Patel said.\n\n'And we have, and we are in the process again of working with our partners to divulge that information - and it's coming,' he vowed.\n\nHe also noted that the answer about the FBI's involvement in the Capitol riot may 'surprise and shock people because of what past FBI leaders have said about it.'\n\nFormer FBI Director Christopher Wray had previously dodged questions from Congress about the agency's role in the Capitol riots.\n\nBut a damning report released by Justice Department Inspector General Michael Horowitz last year found that the FBI had more than two dozen confidential human sources in the crowd outside the Capitol - and three were assigned by the bureau to be at the protest.\n\nOf those three, one illegally entered the Capitol building, and the other two entered the restricted area around the Capitol. \n\nThe report also noted that none of the confidential sources were authorized to enter the Capitol or break the law or 'encourage others to commit illegal acts.'\n\nBut, it claimed there was one confidential human source who was in contact with the leadership of far-right groups such as the Oath Keepers, and were aware of plans discussed by the Proud Boys to prevent Congress from certifying the results of the 2020 presidential election.\n\nConfidential human sources work with the FBI to offer information and insights about the inner workings of organizations threatening the country, such as criminal, terrorist and espionage networks. \n\nAccording to the DOJ, these informants can be cashed out for the information they pass along to the feds.\n\nWhen news of the report spread in December, Vice President JD Vance pointed out that none of those confidential human sources who entered the Capitol have been prosecuted.\n\n'For those keeping score at home, this was labeled a dangerous conspiracy theory months ago,' he noted. \n\nNow, however, Patel says the report - entitled the FBI's Handling of its Confidential Human Sources and Intelligence Collection Efforts in the Lead Up to the Jan 6, 2021 Electoral Certification - is 'definitely a piece of the truth.'\n\nThe FBI director was sworn in promising to increase transparency at the federal law enforcement agency, which he had previously accused of covering up its own crimes as he derided the agency as 'one of the most cunning and powerful arms of the Deep State.'\n\nPart of that goal, Patel told Baier Wednesday, was to give Americans the answers they 'deserve.'\n\nIn that vein, he noted that there are also 'answers coming' in other investigations - including the pipe bombs placed outside of the Democratic National Committee and Republican National Committee just one day before the Capitol riot.\n\nThe FBI has previously released video of the alleged suspect from 2021. The latest video release, from January 2 of this year, shows grainy security camera video of the masked, hoodie-wearing suspect, who is difficult to identify. \n\nMeanwhile, House Republicans released an 80-page report cataloguing 'serious, and largely overlooked, security failure on January 6' including the 'delayed' discovery of the bombs close to the two party headquarters buildings and the 'chaotic response' once they were found.\n\nPatel's number two at the bureau, Dan Bongino, has since claimed the bomb scare was an 'inside job.'\n\n'I can say with almost absolute certainty from a whistleblower who was there who strongly believes it was a government contractor who planted those bombs to set up a fake assassination plot on Kamala Harris to basically generate sympathy, to shut down people from questioning the vote on January 6,' Bongino said in a September episode of his podcast.\n\nHe then went on to reference questions raised by Republican Rep. Thomas Massie, ticking through questions on his hand while recording the episode.\n\n'Videos are disappearing. Nobody seems to want to know who it is. Why would the FBI not want to know who it is? Because if they put out a video showing you who it is and someone recognizes them, this whole thing's going to blow wide open,' he claimed.\n\n'I'm telling you they are going to come out and say those pipe bombs are just a training exercise when they weren't,' Bongino continued.\n\n'I can't trust anyone. I can't trust anybody any more,' he said, calling the pipe bomb attack 'the biggest political scandal of our time.'\n\n'It is a story nobody wants to talk about, which is weird, because if the insurrection they claim is true, why wouldn't Kamala Harris want to talk about nearly being killed by a pipe bomb during the insurrection?' Bongino wondered.\n\n'Why does she not want to talk about this? Because my story is true. Those pipe bombs were put there as Plan A if the Republicans on certification day in front of an entire national media audience on the House floor ... objected and started talking about the problems in the election,' he said. \n\nIn addition to the two investigations related to the Capitol riots, Patel said the public will soon also have answers about the cocaine found in the White House during the Biden administration. \n\nIt was discovered just two days after recovering drug addict Hunter Biden had left with his father and family for their July 4th holiday weekend.\n\nA Secret Service investigation into the drugs was closed in less than two weeks due to a 'lack of evidence' as security footage was not able to determine the owner.\n\n'Without physical evidence, the investigation will not be able to single out a person of interest from the hundreds of individuals who passed through the vestibule where the cocaine was discovered,' it said in a statement.\n\nThe Biden family was away from Washington at the time of the discovery of the cocaine took place - and have repeatedly denied the drugs came from any of their family members.\n\nNew information will also be released about the FBI's investigation into the alleged connections between Trump and Russia following the 2016 election, Patel said as DailyMail.com exclusively revealed that a contractor allegedly made false claims to Congress about the origins of the probe.\n\nNellie Ohr was first accused of falsely testifying to Congress in a newly declassified FBI document from 2019.\n\nIt claims she falsely testified that she did not have any knowledge of the investigation into Trump's connections with Russia, and that she lied when she denied sharing her research on Russia with individuals outside of her company.\n\nSenate Judiciary Committee Chairman Chuck Grassley now says she 'showed contempt for congressional oversight and the American people.","summary":"FBI Director Kash Patel has teased that the bureau's upcoming findings into the January 6 Capitol riots will 'surprise and shock' the American public.","url":"https://www.dailymail.co.uk/news/article-14760053/FBI-director-Kash-Patel-January-6-findings.html","image":"https://i.dailymail.co.uk/1s/2025/05/29/05/98848183-0-image-m-28_1748494499129.jpg","video":"https://videos.dailymail.co.uk/video/mol/2022/01/11/6371256699897426326/1024x576_MP4_6371256699897426326.mp4","publish_date":"2025-05-29 06:11:27","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.209},{"id":325995870,"title":"Clueless Down Under","text":"Former Vice President Kamala Harris goes to Australia for a real estate conference. Back on the homeland, the democrat machine is still busted, and no one has the tools to fix it.\n\nLearn more about your ad choices. Visit podcastchoices.com/adchoices","summary":"Former Vice President Kamala Harris goes to Australia for a real estate conference. Back on the homeland, the democrat machine is still busted, and no one has the tools to fix it. Learn more about your ad choices. Visit podcastchoices.com/adchoices","url":"https://radio.foxnews.com/2025/05/29/clueless-down-under/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2025/05/FEATURED_IMAGE_JESSE_WATTERS_PRIMETIME_MONOLOGUES-1.png","video":null,"publish_date":"2025-05-29 05:20:15","author":"Jeffrey Petz","authors":["Jeffrey Petz"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.171},{"id":326082674,"title":"Who Is Laura Loomer? Donald Trump's 'Ally' Who Would Love To Find 'Excuse To Block' Foreign Students","text":"As US President Donald Trump' s administration moved to block enrollment of foreign students at Harvard Universit , reports suggested that it is now expanding social media vetting of foreign students.\n\n“The Trump administration is weighing requiring all foreign students applying to study in the United States to undergo social media vetting,” Politico reported earlier.\n\nMeanwhile, US State Department Spokesperson Tammy Bruce said, \"We use every tool in our tool chest to vet anyone coming in who wants to come into this country.\"\n\nAmid such claims, Laura Loomer said,“vetting on the social media accounts of foreign students...Sounds like a dream job for me.”\n\nShe wrote on X,“The White House is considering doing vetting on the social media accounts of foreign students. Sounds like a dream job for me. I would love to research foreign students all day and find an excuse to block them from coming into our country based on their radicalism. Sign me up.”\n\nLaura Loomer is a right-wing extremist and political influencer known for her controversial views and \"incendiary\" social media presence.\n\nLoomer, in her early 30s, is a Florida activis and an unsuccessful political candidate who once described herself as a“proud Islamophobe”. The Guardian described her as \"the white nationalist conspiracy theorist.\"\n\nAs per the report, Loomer had spread conspiracy theories about mass shootings, including the Parkland school shooting in Florida. She is known for claiming the 9/11 attacks were an inside job.\n\nLoomer was also banned on some social media networks because of her anti-Muslim and other controversial remarks. According to reports, she has described herself as a“proud Islamophobe\".\n\nEarlier, she said the“White House would smell like curry” if Kamala Harris , who is of Indian heritage, were elected as the US President.\n\nLoomer also sparred online with top Trump adviser Elon Musk over skilled workforce visas, the Associated Press reported. She has repeatedly argued that the administration's hires are being improperly vetted.\n\nLoomer also has a podcast called Loomer Unleashed on Rumble. It's a platform known for streaming far-right figures.\n\nLoomer has said it's her job to keep Trump on track. She has flitted in and out of the president's inner circle and claimed to be responsible for the firings of National Security Adviser Mike Waltz and other aides, the Associated Press reported.\n\nShe twice unsuccessfully ran for Congress, in 2020 and 2022.\n\nTrump had endorsed Loomer in 2020, when she unsuccessfully ran for the House in 2020, winning a Republican primary but losing the general election that year to Democrat Lois Frankel. Later, in 2022, she switched districts, narrowly losing another primary.\n\nIn 2023, Trump praised Loomer, saying,“You are a very opinionated lady, I have to tell you. And in my opinion, I like that.” Trump once also called her a“strong person” and a“free spirit.","summary":"(MENAFN - Live Mint) After saying,–Joe Biden could die in the next two months,– Laura Loomer is grabbing the headlines once again as she wrote about her \"dream job \" of \"vetting social media ...","url":"https://menafn.com/1109609840/Who-Is-Laura-Loomer-Donald-Trumps-Ally-Who-Would-Love-To-Find-Excuse-To-Block-Foreign-Students","image":"https://menafn.com/updates/pr/2025-05/29/LM_73870image_story.jpg","video":null,"publish_date":"2025-05-29 05:03:29","author":"Date,MENAFN","authors":["Date","MENAFN"],"language":"en","category":"politics","source_country":"jo","sentiment":-0.064},{"id":325953972,"title":"How President Trump Stopped Democrats’ Plan for Permanent Power","text":"It was not very long ago that liberal writers would rhapsodize about how America’s changing demographics would spell Republicans’ doom. A 2012 headline from The New York Times read “Demographic Shift Brings New Worry for Republicans.” By 2014, the corporate media was already writing the GOP’s obituary: “Republicans have a major demographic problem. And it’s only going to get worse” one Washington Post headline claimed.\n\nThen conservatives committed the crime of noticing—noticing that mass migration followed by mass amnesty was Democrats’ play for political power. The Left labeled them peddlers of the “Great Replacement Theory.”\n\nSen. Eric Schmitt, R-Mo, joined “The Signal Sitdown” to discuss how President Donald Trump upended Democrat plans for permanent control in Washington.\n\nFor Schmitt, it all starts with one crucial realization: The American nation is “not just an idea.”\n\nThis is a real nation with real people,” the Missouri senator said, and the GOP should be “fighting for them.”\n\n“When Joe Biden is letting 15 million people here illegally, people don’t understand. How could the president of our country allow this? And the answer is that he bought into and was captured by this worldview that there wasn’t anything particularly unique [about America], that America was just some economic zone with an airport attached to it,” Schmitt continued. “We can have our jobs shipped overseas, all those good-paying jobs, and we get cheap Chinese T-shirts in return and everything is going to be great.”\n\nIn fairness, Schmitt says some of these policies were justifiable prior to the end of the Cold War. In the aftermath of World War II, America’s trade and foreign policy focused on “rebuild[ing] our European allies and Japan, to bring them into the fold, and defeat Soviet communism. That defined our foreign policy in the sense that we had this security umbrella for our friends and allies. We had trade deals that weren’t really good for us, but that allowed them to get back on their feet.”\n\nOnce the Cold War ended, Schmitt told The Daily Signal, “this is when the mistakes were made because the people in charge, the elites, they never really adjusted. They never adjusted trade policy. They never really adjusted foreign policy.”\n\n“You sort of had this globalist view,” Schmitt said, “the end of history. And that fueled this mass migration. It fueled a wandering, aimless, Wilsonian kind of foreign policy that was based on these abstract ideas of global democracy.”\n\nIt was far from a Democrat-only problem. “Republicans were a part of this problem, too,” Schmitt added. Republicans of the post-Cold War era pursued trade policies “that shipped our jobs overseas,” but promised ‘creative destruction’ would leave Americans better off. The destruction came, but the creativity did not. \n\n“We’ve seen devastation in our communities, factories that are desolate now, and they’ve been replaced with, in many ways, despair and death,” Schmitt said.\n\nLong before Trump was president, he was one of the first to recognize the need for change. Since taking American politics by storm, he has vigorously reasserted the sovereignty of the American nation. Republicans of yesteryear hesitated to embrace this view, afraid of pejoratives like racist or xenophobic. But the Republicans of today have caught up to the party’s frontman. \n\nAmerica is “much more” than idea, Schmitt told The Daily Signal. “It’s our home.”\n\n“We’re a people and we believe in things and that we ought to be fighting for the dignity of the guy that doesn’t have a PhD, but who wants to work and he wants to be able to raise a family and he wants his kids to have a better life,” Schmitt said. “He shouldn’t have to compete with foreign labor for that.”\n\n“Work is important for people. It gives them meaning,” Schmitt continued. “And I think if we’re honoring the dignity of every individual, which we should, that’s a big part of what we should be fighting for. And President Trump tapped into that in a way that no political figure in my lifetime has ever really tapped into because he met the American people really where they were.”\n\nIn doing so, Trump reversed what the Washington Post and New York Times seemed to think was inevitable.\n\n“The Left understands they were playing a game of getting a permanent majority and total control,” Schmitt said. “It’s important, I think, to remember how close we were to maybe losing all of this.”\n\n“If they had the House and they had the Senate and [Joe] Biden or [Kamala] Harris or somebody else was in the White House,” Schmitt continued, “they would eliminate the filibuster in the Senate. They’d add states to the union. They would pack the United States Supreme Court. They would get mass amnesty. They’d add a bunch of new voters and they very well could have been in the majority for a very, very long time.”\n\n“Trump is a unique political figure in that way,” Schmitt claimed. “He was able to break through, and that’s why they came at him so hard.” But the task for the next generation of Republican leaders like Schmitt will be not to squander the inheritance they will receive from Trump.","summary":"It was not very long ago that liberal writers would rhapsodize about how America’s changing demographics would spell Republicans’ doom. A 2012 headline from The... Read More\n\n\nThe post How President Trump Stopped Democrats’ Plan for Permanent Power appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/28/how-president-trump-stopped-democrats-plan-permanent-power/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/Schmitt-WP.jpg","video":null,"publish_date":"2025-05-29 02:34:13","author":"Bradley Devlin","authors":["Bradley Devlin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.263},{"id":325964450,"title":"Rage Against the Machine guitarist rips Trump over president’s feud with Bruce Springsteen in fiery rant","text":"Rage Against the Machine guitarist Tom Morello had some choice words for President Donald Trump at a concert on Sunday. Rolling Stone reported that during his performance at the Boston Calling Music Festival, the famous musician unloaded on Trump in response to the president’s recent spat with classic rock legend Bruce Springsteen. \"Bruce is going after Trump because Bruce, his whole life, he’s been about truth, justice, democracy, equality,\" Morello said onstage, adding, \"And Trump is mad at him because Bruce draws a bigger audience. F---that guy.\" FLASHBACK: BRUCE SPRINGSTEEN ENDORSES KAMALA HARRIS The feud between Trump and Springsteen began nearly two weeks ago when the artist accused the president of treason during a concert in Manchester, England. \"The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock and roll in dangerous times. In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration,\" Springsteen said, drawing applause from his audience. TESLA DOXXING ATTACKS WRONGLY TARGET NONOWNERS ACROSS AMERICA Two days later, Trump slammed Springsteen in a Truth Social post, stating, \"I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States. Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.\" The background for Morello’s performance last weekend also included a giant \"F--- Trump\" sign surrounded by several other smaller ones featuring the same words. The background art also referred to Trump as \"HATER IN CHIEF.\" There was also an image that appeared to have Trump and Russian President Vladimir Putin’s faces morphed together into one person. During his set, Morello introduced his cover of Woody Guthrie’s song \"This Land Is Your Land\" with an anti-authoritarian, anti-billionaire message seemingly aimed at the commander-in-chief. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"It’s a beautiful song, but they censored out all the verses that explain what the song is really about. This is a revolutionary anthem. Woody Guthrie knew that music could be… an uplifting, unifying, transcendent thing; a defensive shield, and a weapon for change. Authoritarians and billionaires think this country belongs to them. Woody Guthrie knew that this land is yours,\" he said. The White House did not immediately respond to a request for comment. CLICK HERE TO GET THE FOX NEWS APP","summary":"Famous Rage Against The Machine guitarist Tom Morello ripped President Trump with strong words and visuals at a recent Boston music festival.","url":"https://www.foxnews.com/media/rage-against-machine-guitarist-rips-trump-over-presidents-feud-bruce-springsteen-fiery-rant","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/gettyimages-2210871101-1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-29 02:00:40","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","category":"politics","source_country":"us","sentiment":0.131},{"id":325957084,"title":"Freed Israeli hostage says Hamas treated him better after Trump was elected — and that terror group wanted Harris to win","text":"A freed Israeli hostage revealed his Hamas tormentors “immediately” treated him better when President Trump was elected — and claimed the group of terrorists wanted Kamala Harris to win the 2024 election.\n\nOmer Shem Tov, 22, provided insight into Hamas’ political calculations as he detailed the hellish conditions he endured for more than 500 days after he was kidnapped during the Oct. 7, 2023, attack on Israel.\n\n“As soon as Donald Trump was elected, they understood that he wants to bring the hostages back home,” he told CNN in a new interview published Wednesday. \n\n“So immediately the way they treated me changed … when Trump became president the way they treated us changed for me personally.”\n\nHis captors provided him with more food while they stopped cursing at and spitting on him, Shem Tov told CNN’s Bianna Golodryga.\n\nHe credited Trump for getting the hostages released as part of a cease-fire deal between Israel and Hamas earlier this year.\n\n“Before we felt like nothing is happening, and I remember ever since he came into the role, they were very scared of him,” Shem Tov said of Trump.\n\n“They wanted Kamala to be chosen,” he said of the former vice president, citing talks he had with his captors. \n\nShem Tov was released with five others on Feb. 22, more than a year after he was taken to Gaza when Hamas stormed the Nova music festival.\n\nHe said during the CNN interview that he dropped 50 pounds, relying on biscuits and salty water to survive.\n\n“I was being starved,” he said. “There’s no question about it.”\n\nShem Tov said Hamas captors told him “we’re gonna shoot you” if they heard Israeli forces nearby, but his biggest fear was dying from Israel’s military campaign in the Palestinian enclave.\n\n“I believe every soldier is a hero, I really do believe it, and I think the army, they’re doing an amazing job, but for us, it’s the scariest moments, it’s the bombing, you feel like your life can be taken in every moment,” he said.\n\nShem Tov has spent his time since his release advocating for the release of the other hostages still languishing in captivity. He and other former hostages met with Trump in March.","summary":"“Before we felt like nothing is happening, and I remember ever since he came into the role they were very scared of him,” Shem Tov said of Trump.","url":"https://nypost.com/2025/05/28/world-news/freed-israeli-hostage-omer-shem-tov-says-hamas-treated-him-better-after-trump-won/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/freed-hostage-tells-cnn-hamas-105475735.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/svaYJYA1-RyIcpnTz.mp4","publish_date":"2025-05-29 02:00:10","author":"David Propper","authors":["David Propper"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.282},{"id":325949644,"title":"California politicians led the way in covering up Biden’s cognitive decline","text":"Two recent books, Fight and Original Sin, explore the reasons behind the Democratic Party’s 2024 electoral defeat and document President Joe Biden’s mental and physical decline. Despite the insights provided by these revealing works, significant unanswered questions remain for both mainstream media and Democratic politicians. Why did they support a president who was incapacitated and, following a disastrous June 2024 debate performance, ultimately resigned from the 2024 campaign? How deep was the cover-up?\n\nIt’s important to note that California politicians took the lead in this deception. Politicians in the Golden State vigorously promoted disinformation about Biden to mislead the public and placate a Democratic base that was becoming increasingly disheartened. Additionally, they seized the opportunity to criticize Republicans who pointed out Biden’s falls and mental gaffes. Below is a brief summary of the “leaders” in spreading Biden disinformation:\n\nGavin Newsom: The governor, well known for his strong support of Joe Biden, served as a silver-tongued Biden surrogate nationwide. CalMatters described the governor as Joe Biden’s “most forceful surrogate.” The governor skillfully countered attacks from Republicans and conservative media regarding Biden’s mental infirmity and physical limitations. Even as late as July 19, 2024, just two days before Joe Biden announced he would not seek re-election, Gavin Newsom stated, “I am in [supporting Joe Biden], no daylight.”\n\nAdam Schiff, known for his anti-Trump rhetoric that borders on hatred, played a significant role in the House of Representatives during Trump’s impeachment. It’s hard to forget how then-Rep. Schiff criticized Special Counsel Robert Hur during a Judiciary Committee hearing, admonishing him for politicizing Biden’s lackluster deposition and defending a confused chief executive.\n\nHur, who was respectful of the aging president, declined to prosecute Joe Biden for his willful retention of classified documents found in Biden’s non-secure home garage. In his report, Hur stated that Biden was “an elderly man with a poor memory” as a rationale for not prosecuting the president. Now that the full audio tapes have been released, it’s clear that Joe Biden was then and is now old, confused, and addled. These facts didn’t stop Schiff from launching his overly partisan and public attack on Hur.\n\nOnly when Biden’s missteps became impossible to ignore did Schiff, in a profile in courage moment, call for Biden to step aside, stating on CNN and NPR, “I have serious concerns about whether the President can defeat Donald Trump in November.” However, Schiff had previously met with Biden and was likely aware of the president’s steep decline.\n\nKamala Harris: Unsurprisingly, the foremost defender of Biden was former Attorney General and U.S. Senator from California, Vice President Kamala Harris, despite the Biden Administration’s concerns about her future electability, as noted in the aforementioned books. Vice President Harris repeatedly misled the American public for four years, asserting that Biden was “sharp as a tack, fit as a fiddle.” Harris stated on ABC’s Good Morning America in February 2024 that, “Our president is in good shape, in good health, and is ready to lead in our second term.”\n\nEven after Biden withdrew from the race, Harris told CNN that she “doesn’t have any regrets about having defended President Biden’s mental capacity to the public.”\n\nWhether Harris chooses to run for governor or president in the future, her political career remains stalled until she provides a credible answer about what she knew and when she knew it regarding the language-challenged former Vice President.\n\nA cursory search of other California Democratic Congress members, including Speaker Nancy Pelosi (“We must re-elect Joe Biden” and “It’s up to the president to decide whether he stays in the race”) and Eric Swalwell (“He puts many of us to shame with his memory”), highlights the cover-up.\n\nToday’s Democratic Party tries hard to change the subject, claiming it’s “looking forward,” alongside its ongoing disdain for all things Trump. However, unless the party determines why its leaders allowed the Biden cover-up to go unchallenged for years, how can American voters trust Democrats?\n\nMatthew Klink is the owner and president of Klink Campaigns, Inc., a Los Angeles-based political consulting and strategic communications firm.","summary":"Unless the party determines why its leaders allowed the Biden cover-up to go unchallenged for years, how can American voters trust Democrats? ","url":"https://www.sandiegouniontribune.com/2025/05/28/california-politicians-led-the-way-in-covering-up-bidens-cognitive-decline/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/05/Biden-fire-1-1.jpg?w=800&h=533","video":null,"publish_date":"2025-05-29 01:39:12","author":"Matt Klink","authors":["Matt Klink"],"language":"en","category":"politics","source_country":"us","sentiment":-0.251},{"id":325947320,"title":"California politicians led the way in covering up Biden’s cognitive decline","text":"Two recent books, Fight and Original Sin, explore the reasons behind the Democratic Party’s 2024 electoral defeat and document President Joe Biden’s mental and physical decline. Despite the insights provided by these revealing works, significant unanswered questions remain for both mainstream media and Democratic politicians. Why did they support a president who was incapacitated and, following a disastrous June 2024 debate performance, ultimately resigned from the 2024 campaign? How deep was the cover-up?\n\nIt’s important to note that California politicians took the lead in this deception. Politicians in the Golden State vigorously promoted disinformation about Biden to mislead the public and placate a Democratic base that was becoming increasingly disheartened. Additionally, they seized the opportunity to criticize Republicans who pointed out Biden’s falls and mental gaffes. Below is a brief summary of the “leaders” in spreading Biden disinformation:\n\nGavin Newsom: The governor, well known for his strong support of Joe Biden, served as a silver-tongued Biden surrogate nationwide. CalMatters described the governor as Joe Biden’s “most forceful surrogate.” The governor skillfully countered attacks from Republicans and conservative media regarding Biden’s mental infirmity and physical limitations. Even as late as July 19, 2024, just two days before Joe Biden announced he would not seek re-election, Gavin Newsom stated, “I am in [supporting Joe Biden], no daylight.”\n\nAdam Schiff, known for his anti-Trump rhetoric that borders on hatred, played a significant role in the House of Representatives during Trump’s impeachment. It’s hard to forget how then-Rep. Schiff criticized Special Counsel Robert Hur during a Judiciary Committee hearing, admonishing him for politicizing Biden’s lackluster deposition and defending a confused chief executive.\n\nHur, who was respectful of the aging president, declined to prosecute Joe Biden for his willful retention of classified documents found in Biden’s non-secure home garage. In his report, Hur stated that Biden was “an elderly man with a poor memory” as a rationale for not prosecuting the president. Now that the full audio tapes have been released, it’s clear that Joe Biden was then and is now old, confused, and addled. These facts didn’t stop Schiff from launching his overly partisan and public attack on Hur.\n\nOnly when Biden’s missteps became impossible to ignore did Schiff, in a profile in courage moment, call for Biden to step aside, stating on CNN and NPR, “I have serious concerns about whether the President can defeat Donald Trump in November.” However, Schiff had previously met with Biden and was likely aware of the president’s steep decline.\n\nKamala Harris: Unsurprisingly, the foremost defender of Biden was former Attorney General and U.S. Senator from California, Vice President Kamala Harris, despite the Biden Administration’s concerns about her future electability, as noted in the aforementioned books. Vice President Harris repeatedly misled the American public for four years, asserting that Biden was “sharp as a tack, fit as a fiddle.” Harris stated on ABC’s Good Morning America in February 2024 that, “Our president is in good shape, in good health, and is ready to lead in our second term.”\n\nEven after Biden withdrew from the race, Harris told CNN that she “doesn’t have any regrets about having defended President Biden’s mental capacity to the public.”\n\nWhether Harris chooses to run for governor or president in the future, her political career remains stalled until she provides a credible answer about what she knew and when she knew it regarding the language-challenged former Vice President.\n\nA cursory search of other California Democratic Congress members, including Speaker Nancy Pelosi (“We must re-elect Joe Biden” and “It’s up to the president to decide whether he stays in the race”) and Eric Swalwell (“He puts many of us to shame with his memory”), highlights the cover-up.\n\nToday’s Democratic Party tries hard to change the subject, claiming it’s “looking forward,” alongside its ongoing disdain for all things Trump. However, unless the party determines why its leaders allowed the Biden cover-up to go unchallenged for years, how can American voters trust Democrats?\n\nMatthew Klink is the owner and president of Klink Campaigns, Inc., a Los Angeles-based political consulting and strategic communications firm.","summary":"Unless the party determines why its leaders allowed the Biden cover-up to go unchallenged for years, how can American voters trust Democrats? ","url":"https://www.ocregister.com/2025/05/28/california-politicians-led-the-way-in-covering-up-bidens-cognitive-decline/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/Biden-fire-1-1.jpg?w=800&h=533","video":null,"publish_date":"2025-05-29 01:39:12","author":"Matt Klink","authors":["Matt Klink"],"language":"en","category":"politics","source_country":"us","sentiment":-0.251},{"id":326023686,"title":"'Negotiate terms of bribe': Trump blasted after refusing Paramount's settlement offer","text":"Media conglomerate Paramount is now reportedly offering President Donald Trump an off-ramp in his lawsuit against the company. But the president is reportedly not enthused with the offer.\n\nThe Wall Street Journal reported Wednesday that the parent company of CBS has offered Trump $15 million in exchange for ending his litigation over what he alleged was a deceptively edited video. When Trump initially filed the lawsuit, he asked for $10 billion, accusing CBS' \"60 Minutes\" of editing an interview with then-Vice President Kamala Harris in which she was seen giving one answer to a question in a promotional clip, and another answer during the interview itself. However, CBS alleged that the two clips of Harris were from the same interview, that her full answer had been edited down for time and that news outlets regularly edit interviews in similar ways to meet the particular needs of a broadcast.\n\nAccording to the Journal, Trump is rejecting that $15 million settlement offer, and is instead pushing for at least $25 million along with an official apology from CBS. Several commentators, journalists and others on social media opined that Trump is simply taking advantage of a situation in which Paramount is relying on the administration to approve its proposed merger with Skydance.\n\nREAD MORE: 'This could be gigantic': Internet erupts as court 'slaps Trump around' in tariff ruling\n\n\"All of this is happening not because CBS did anything wrong, but because Trump knows he has Paramount over a barrel as they're trying to get a sale through the FCC,\" writer Matt Mueller tweeted. \"That's all this is: He just knows he can get pretty much anything he wants from them right now.\"\n\nPublic policy researcher Neil Weinberg disagreed with Paramount's apparent decision to settle, tweeting that CBS should \"simply use [its] giant media apparatus and army of lawyers to tell the president to f--- off rather than pay him a bribe.\"\n\nOn Bluesky, MSNBC columnist Paul Waldman proposed an alternate headline for the Journal's article, writing: \"Paramount Offers President Trump $15 Million Bribe to Approve Corporate Merger, but Trump Demands $25 Million Bribe; Parties Continue to Negotiate Terms of Bribe.\"\n\nOther journalists, like NBC affiliate 9News' director of investigations Chris Vanderveen, indicated they were watching the negotiations \"very very closely.\" Heatmap News correspondent Matthew Zeitlin held out hope that CBS would \"take its chances\" given the amount of \"legal pushback\" the Trump administration had been facing. And The Block editor Jason Shubell openly wondered if Trump was simply asking for more money from Paramount \"for added humiliation.\"\n\nREAD MORE: 'It's obligatory': Former federal judge says John Roberts should be 'condemning' Trump\n\nClick here to read the Journal's full report (subscription required).","summary":"Media conglomerate Paramount is now reportedly offering President Donald Trump an off-ramp in his lawsuit against the company. But the president is reportedly not enthused with the offer.\n\nThe Wall Street Journal reported Wednesday that the parent company of CBS has offered Trump $15 million in exchange for ending his litigation over what he alleged was a deceptively edited video. When Trump initially filed the lawsuit, he asked for $10 billion, accusing CBS' \"60 Minutes\" of editing an interview with then-Vice President Kamala Harris in which she was seen giving one answer to a question in a promotional clip, and another answer during the interview itself. However, CBS alleged that the two clips of Harris were from the same interview, that her full answer had been edited down for time and that news outlets regularly edit interviews in similar ways to meet the particular needs of a broadcast.\n\nAccording to the Journal, Trump is rejecting that $15 million settlement offer, and is instead pushing for at least $2","url":"https://www.alternet.org/trump-paramount-settlement/","image":"https://www.alternet.org/media-library/image.jpg?id=60336480&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-05-29 01:38:12","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.383},{"id":325949640,"title":"Kamala Harris is perfectly prepared to make all of the same mistakes","text":"Now that we are a half a year removed from the November presidential election, bookstore shelves are full of missives explaining just exactly why President Donald Trump was selected by voters for another term in the White House, and why the Democratic ticket came up short.\n\nA lot of the blame is being laid at the bedroom-slippered feet of former President Joe Biden, whom the books allege lacked the stamina, energy, and mental acuity necessary to vigorously campaign for the highest office in the land. Plus, yeah, okay, there was the uncontrollable drooling.\n\nLook for these tomes in the “painfully obvious” section of your favorite bookstore.\n\nOne of the books making that very point, written by Jake Tapper and Alex Thompson, is titled “Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again. “\n\nIn it, Tapper and Thompson give countless examples of Biden’s unfitness for the job, including unforgettable tales of Biden’s memory loss, like not knowing who actor George Clooney was on the very night that Cooney was hosting a campaign fundraiser for Biden. For you non-hipsters, George Clooney is the husband of attorney/activist Amal Clooney.\n\nBut ultimately, Biden’s name was not on the November ballot, Vice President Kamala Harris’ was. And she was the one who went down in defeat to Donald Trump.\n\nIn presidential elections, a million different factors go into why one candidate wins and one candidate loses, and it’s impossible to chalk up a result to any one thing.\n\nHowever, it’s clear to most people that Kamala Harris never really laid out a clear vision for the country the same way that President Trump did.\n\nEveryone knew what Trump was going to do if he won the election – get control of the border, impose tariffs on foreign nations, and reign in federal agencies.\n\nWhat was Kamala Harris’ agenda? I certainly couldn’t tell you.\n\nIn their book Fight: Inside the Wildest Battle for the White House, authors Jonathan Allen and Amie Parnes conclude that the lack of vision was the former Vice President’s fundamental problem.\n\n“She [Harris] had a chance to win, but she did not have the most fundamental premise of a presidential candidacy worked out: her reason for running. She did not articulate a vision for the country, or the concomitant policy matrix, that might have convinced enough voters to elect her. She did not have a counter to Trump’s use of her own words and record to portray her as a liberal extremist,” they wrote.\n\nThey went on to quote an unnamed Harris advisor who explained, “We were holding sand in the palm of our hand and it was slipping out of the fingers slowly…I don’t think we needed more time. We needed more sand. We needed more substance. And she did not have more substance.”\n\nFast forward to the present, Kamala Harris is kicking tires on running for California governor in 2026…and seems perfectly prepared to make all of the same mistakes.\n\nIn a lengthy piece on whether or not Harris will run for California’s top job, the New York Times wrote, “After 22 years as an elected official, she must decide whether, or how, to continue her political career in an environment that was remade by her defeat.”\n\nThe Times went on to say that, “Ms. Harris has good reason for leaning toward a run for governor, according to people who have spoken with her…She has watched with horror as institutions Democrats care about — universities, law firms and more — have caved under pressure. And she believes that as governor of the nation’s most populous blue state, she would have a powerful platform from which to push back against Mr. Trump and his policies, and to defend Democratic priorities and values.”\n\nMeaning a run for governor would be all about her. Her résumé, her legacy, her relevance, and her future run for president.\n\nShe has no vision for California, the same way she had no vision for the country.\n\nNobody, outside of the most rabid Democratic partisans, that’s who.\n\nCalifornia would just be just another stop on the road to 1600 Pennsylvania Avenue. Sorry, Kamala. If we wanted that distinction we have Gavin Newsom to work with.\n\nBut here’s the greater question: If Kamala gets elected governor in a deeply blue state and wins despite her lack of vision, does that make her a stronger candidate for president in 2028 than she was in 2024?\n\nNot likely.\n\nJohn Phillips can be heard weekdays from noon to 3 p.m. on “The John Phillips Show” on KABC/AM 790.","summary":"She has no vision for California, the same way she had no vision for the country.  ","url":"https://www.sandiegouniontribune.com/2025/05/28/kamala-harris-is-perfectly-prepared-to-make-all-of-the-same-mistakes/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/05/LDN-L-2FIRES-0121-15-SR.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-29 01:35:42","author":"John Phillips","authors":["John Phillips"],"language":"en","source_country":"us","sentiment":-0.135}]}