{"offset":0,"number":50,"available":4527,"news":[{"id":254217488,"title":"Nervous Republicans are urging Trump to 'stay on message'. He's refusing","text":"When Donald Trump took to the stage in Milwaukee for the Republican National Convention last month, many of those sitting inside the packed arena felt as though the former president was unstoppable. He'd survived an assassination attempt, unveiled his vice-presidential pick, and been treated to a hero's welcome from an adoring crowd — all while damaging speculation about the political future of his opponent continued to swirl. But in the weeks since Joe Biden withdrew from the race, his replacement at the top of the ticket has re-energised Democrats, giving the party new optimism about its chances of winning this year's election. The former president has complained about Kamala Harris's ascension, accusing her party of orchestrating a \"coup\" to oust Biden and arguing his campaign should be compensated for the money it spent opposing the wrong candidate. He's mocked her laugh as being that of a \"crazy person\", questioned her racial identity and alleged the vice-president isn't smart enough to hold a press conference, let alone run the country. Trump's approach to Harris isn't surprising, given his long history of making personal attacks central to his campaigns. But as Harris pulls ahead of the former president in the polls, an increasing number of Republicans are urging their nominee to change tack or risk losing in November. 'Fewer insults, more insights' Former presidential hopeful Vivek Ramaswamy — an outspoken supporter of Trump's, even when he was running against him — is among those encouraging the Republican candidate to rein it in. \"I do think we have not actually gone after [Harris] heavily enough on her policy record, and I think that's how we're going to win this,\" he told Fox News. \"The less we make it about policy, I think the worse it's going to be for us. And so that's my warning to our side. If we heed it, I think we're going to be successful.\" Former Trump campaign manager Kellyanne Conway, who later served as an advisor in his White House, called for \"fewer insults, more insights, and that policy contrast\". And former United Nations ambassador Nikki Haley, another one-time rival of Trump's, argued Republicans needed to \"quit whining\" about Harris. \"The campaign is not going to win talking about crowd sizes, it's not going to win talking about what race Kamala Harris is, it's not going to win talking about whether she's dumb,\" Haley said. Trump has spread debunked claims that artificial intelligence has been used to inflate the size of the crowds turning out to hear the vice-president speak. And he ignored pleas to keep to policy discussions, going off topic in a speech that was billed as being focused on his economic agenda. \"Today we're going to talk about one subject and then we'll start going back to the other, because we sort of love that, don't we?\" he told supporters in North Carolina on Wednesday, local time. \"They say [the economy's] the most important subject, I'm not sure it is.\" On Thursday, Trump appeared to exercise more discipline in his second press conference in as many weeks, at least initially. At his golf club in New Jersey, he detailed price hikes on various food products as he stood between tables piled with groceries. But when he was asked about the calls from within his party to dial down the attacks on Harris, he argued he was \"entitled\" to them. \"I don't have a lot of respect for her, I don't have a lot of respect for her intelligence, and I think she'll be a terrible president,\" he said. \"She certainly attacks me personally. She actually called me weird.\" Trump added that while he appreciated Haley's advice, he wouldn't change the way he campaigned. \"I fought Nikki very hard. I beat her in her own state by legendary numbers,\" he said. \"I have to do it my way.\" Harris avoids questions, looks ahead to Democratic convention Trump continues to pressure Harris over her reluctance to engage in similar media appearances, with the vice-president mostly sticking to scripted rallies. (Harris has suggested she'll sit down for an interview sometime this month – meaning it might not be for another couple of weeks.) The VP campaigned alongside her boss for the first time since the switch at the top of the ticket, sharing a stage in Maryland as they announced lower prices for prescription drugs. The pair exchanged compliments, with Biden telling the crowd that Harris would \"make one hell of a president\". But the new Democratic candidate will be looking to try to differentiate herself from the current commander-in-chief, scheduling her own economic address for later this week. And next week she'll take centre stage at the party's national convention, a four-day affair that the party hopes to use to build on Harris's early momentum. Biden will reportedly make a speech on the opening night, in what's expected to be sold as a symbol of the Democratic transition. Less than a month ago, he thought he'd be the one formally accepting the party's nomination. Now he'll need to watch on as the balloons drop on the woman he's \"passed the torch\" to. Loading One to watch: Abortion on the ballot The presidential election will obviously dominate attention in November, but a growing number of Americans will also be asked to decide on reproductive rights at the same time. Missouri this week joined at least half a dozen states where a question over abortion access will be added to the ballot. In most of them, voters will be asked whether to enshrine protections in their state's constitution. Similar measures have been backed in other states where the question has already been put to the people in the wake of the Supreme Court's decision to scrap the nationwide right to abortion by overturning Roe v Wade. Florida — where Donald Trump is registered — is one of the states where voters will have their say in November. The former president nominated three of the conservative judges who overturned Roe, but has since argued in favour of exceptions to abortion bans and urged Republicans to moderate their stance on the issue. Trump won't say how he plans to vote on Florida's ballot measure, but suggested the result might go the same way as the states that have come before it. \"I think probably the vote will go in a little more liberal way than people thought,\" he said. \"But I'll be announcing that at the appropriate time.\"","summary":"As Kamala Harris pulls ahead of the former president in the polls, an increasing number of Republicans are urging their nominee to change tack or risk losing in November. ","url":"https://www.abc.net.au/news/2024-08-16/donald-trump-kamala-harris-week-in-us-politics-macmillan/104227190","image":"https://live-production.wcms.abc-cdn.net.au/cbcd480a24f8a45f5083238da88ed100?impolicy=wcms_crop_resize&cropH=2559&cropW=4549&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2024-08-16 00:11:53","author":"Jade Macmillan","authors":["Jade Macmillan"],"language":"en","catgory":"politics","source_country":"AU","sentiment":-0.332},{"id":254217604,"title":"Orders spike for Petaluma shop's 'Kamala Jam' after ABC7 News report","text":"PETALUMA, Calif. (KGO) -- \"Kamala Jam\" has been a big seller for Petaluma Jam maker Leslie Goodrich. Following our story, the owner of Lala's Jam Bar says she has hundreds of orders to fill. PREVIOUS REPORT: Get a taste of 'Kamala Jam': How Petaluma shop is helping Harris and Walz presidential campaign By purchasing the jam, $5 from each $15-dollar, 8 oz jar are donated to the Harris-Walz campaign. Goodrich says she's sent $6,500 to the campaign this week.","summary":"Following our report, \"Kamala Jam\" maker Leslie Goodrich says she has hundreds of orders to fill, and has donated $6,500 to the Harris-Walz presidential campaign so far.","url":"https://abc7news.com/post/orders-spike-petaluma-shops-kamala-jam-after-abc7-news-report/15190551/","image":"https://cdn.abcotvs.com/dip/images/15190769_081524-kgo-kamala-jam-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/kgo/081524-kgo-4p-kamala-jam-vid.mp4","publish_date":"2024-08-16 00:04:29","author":"ABC7 Bay Area Digital Staff","authors":["ABC7 Bay Area Digital Staff"],"language":"en","source_country":"us","sentiment":0.262},{"id":254217036,"title":"Adams urges Harris to take a strong stance on crime","text":"Last Updated on August 15, 2024 New York City Mayor Eric Adams is pushing Vice President Kamala Harris to be or at least appear tough-on-crime for this presidential election. In an interview with Semafor, Adams said, “The Democratic Party has a tendency to run away from public safety, but it is a very attractive criterion and is a very attractive part of your resume.” According to the outlet, Harris “built her career in California as a ‘smart on crime’ prosecutor,” taking stances to the right of typical Democrats regarding criminal justice. Harris, of course, downplayed much of her role in law enforcement during the 2020 Black Lives Matter riots, which killed at least 25 people and tallied $2 billion in nationwide damages. Semafor said she “took positions intended to win her friends” by aligning with the so-called “defund the police” movement. If you’re able to, chip in now to the @MNFreedomFund to help post bail for those protesting on the ground in Minnesota.— Kamala Harris (@KamalaHarris) June 1, 2020 According to Newsmax, Harris encouraged much of the protesting during the riots. They’re not going to stop before Election Day in November and they’re not going to stop after Election Day. And that should be — everyone should take note of that on both levels, that this isn’t — they’re not going to let up and they should not. Adams, a retired transit police officer of 22 years, told Semafor, “She ran away. I don’t think she should have moved away from it. I think that now, you see, she’s leaning into it.” Harris was also a part of law enforcement as district attorney of Alameda County in California and San Francisco before becoming the state’s attorney general and then senator. The vice president has leaned into her law enforcement background when grilling former President Donald Trump. I took on perpetrators of all kinds – predators who abused women, fraudsters who ripped off consumers, cheaters who broke the rules for their own gain. So hear me when I say, I know Donald Trump’s type. Still, much of Harris’s efforts have been on railing against banks for foreclosures from over a decade ago. She has yet to discuss any substantial plan with law enforcement. Although, in July, she jilted her BLM friends, touting her tough-on-crime prosection. Harris has promoted herself in ads as pro-law, harking on President Joe Biden’s bipartisan Senate border deal, which would have actually increased illegal immigration across the southern border. RELATED: Kamala Harris Compared ICE Agents to KKK, Border Patrol to Slave Owners Given Adam’s political struggles, with an approval rating of 28% and the Manhattan Institute’s polling showing a mere 16% of voters in the city would vote to re-elect, Harris may be better off not taking his advice. RELATED: EXCLUSIVE: Kamala Harris Accused Of Putting A Child Into Sex Trafficking And Covering Up CPS Child Trafficking","summary":"Internewscast Journal\n\nInternewscast\n\n\nLast Updated on August 15, 2024 New York City Mayor Eric Adams&#8230;\n\n\nThis Post: Adams urges Harris to take a strong stance on crime first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/adams-urges-harris-to-take-a-strong-stance-on-crime/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-08-16 00:03:55","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.319},{"id":254217380,"title":"FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference","text":"At his New Jersey golf club, the Republican nominee blended falsehoods about the economy with misleading statements and deeply personal attacks about his Democratic opponent, Vice President Kamala Harris.","summary":"At his New Jersey golf club, the Republican nominee blended falsehoods about the economy with misleading statements and deeply personal attacks about his Democratic opponent, Vice President Kamala Harris.","url":"https://www.bostonherald.com/2024/08/15/fact-focus-trump-blends-falsehoods-and-exaggerations-at-rambling-nj-press-conference/","image":"https://www.bostonherald.com/wp-content/uploads/2024/08/AP24228796468684.jpg?w=1024","video":null,"publish_date":"2024-08-16 00:02:57","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.209},{"id":254217454,"title":"FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference","text":"Former President Donald Trump on Thursday gave his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week’s Democratic National Convention. At his New Jersey golf club, the Republican nominee blended falsehoods about the economy with misleading statements and deeply personal attacks about his Democratic opponent, Vice President Kamala Harris. Here’s a closer look at the facts. Inflation did not take the toll Trump claimed. Growth surged under Biden TRUMP: “As a result of Kamala’s inflation, price hikes have cost the typical household a total of $28,000. … When I left office, I left Kamala and crooked Joe Biden a surging economy and no inflation. The mortgage rate was around 2%. Gasoline had reached $1.87 a gallon. … Harris and Biden blew it all up.” THE FACTS: Trump made numerous economic claims that were either exaggerated or misleading. Prices did surge during the Biden-Harris administration, though $28,000 is far higher than independent estimates. Moody’s Analytics calculated last year that price increases over the previous two years were costing the typical U.S. household $709 a month. That would equal $8,500 a year. Separately, the U.S. economy was growing quickly as it reopened from COVID in 2020, as Trump’s term ended, and it continued to do so after Biden took office. Growth reached 5.8% in 2021, Biden’s first year in the White House, as the rebound continued, faster than any year that Trump was in office. Mortgage rates were low when Trump left because of the pandemic, which caused the Federal Reserve to cut its key rate to nearly zero. Gas prices fell as the economy largely shut down and Americans cut back sharply on their driving. ‘Foreign born’ is not the same as ‘migrants’ TRUMP: “Virtually 100% of the net job creation in the last year has gone to migrants.” THE FACTS: This is a misinterpretation of government jobs data. The figures do show that the number of foreign-born people with jobs has increased in the past year, while the number of native-born Americans with jobs has declined. But foreign-born is not the same as “migrants” — it would include people who arrived in the U.S. years ago and are now naturalized citizens. In addition, the data is based on Census research that many economists argue is undercounting both foreign- and native-born workers. According to a report by Wendy Edelberg and Tara Watson at the Brookings Institution released this week, native-born employment rose by 740,000 in 2023, while foreign-born rose by 1.7 million. Much of the disparity reflects the fact that the native-born population is older than the foreign-born, and are more likely to be retired. In addition, the unemployment rate for native-born Americans is 4.5%, lower than the 4.7% for foreign-born. A thief is not allowed to steal up to $950 TRUMP: “You’re allowed to rob a store as long as it’s not more than $950. … If it’s less than $950 they can rob it and not get charged.” THE FACTS: Trump was referring to regulations in California that allegedly allow for theft under $950. But his claim is not correct — a 2014 proposition modified, but did not eliminate, sentencing for many nonviolent property and drug crimes. Proposition 47 raised the minimum dollar amount necessary for theft to be prosecuted as a felony, instead of a misdemeanor, from $400 to $950. Alex Bastian, then-special adviser to Los Angeles District Attorney George Gascón, who co-authored Prop 47, told The Associated Press in 2021 that the minimum was raised “to adjust for inflation and cost of living,” but that most shoplifting cases were already prosecuted as misdemeanors any since they didn’t exceed $400. Prop 47 was enacted to comply with a 2011 U.S. Supreme Court order, which upheld that the state’s overcrowded prisons violated incarcerated individuals’ Eighth Amendment rights against cruel and unusual punishment. It instructed California to reduce its state prison population by 33,000 individuals within two years. Harris has not said in this campaign she wants to defund police TRUMP, on Harris: “You know, she wants to defund the police.” THE FACTS: Harris expressed praise for the “defund the police” movement after the murder of George Floyd in 2020, questioning whether money was being effectively spent on public safety. However, she has not said during her current campaign that she is in favor of defunding law enforcement. The Biden administration tried to overhaul policing, but the legislation stalled on Capitol Hill, and Biden ultimately settled for issuing an executive order. It also pumped more money into local departments. Trump did not win Pennsylvania in 2020 TRUMP: “I won Pennsylvania and I did much better the second time. I won it in 2016, did much better the second time. I know Pennsylvania very well.” THE FACTS: False. Trump did win the state in 2016, when he beat Democrat Hillary Clinton to win the presidency. But he lost the state in 2020 to President Joe Biden, a Pennsylvania native. According to the official certified results, Biden and Harris received 3.46 million votes, compared to Trump and Vice President Mike Pence with 3.38 million votes, a margin of about 80,000 votes. Oil production in U.S. hit record under Biden Trump says he will bring energy prices down by reversing President Joe Biden’s policy of encouraging renewable energy at the expense of fossil fuels. TRUMP: “We’re going to drill baby drill, we’re going to get the energy prices down, almost immediately.” THE FACTS: Oil production in the U.S. hit an all-time high under Biden’s administration. The U.S. Department of Energy reported in October that U.S. oil production hit 13.2 million barrels per day, passing a previous record set in 2020 by 100,000 barrels. Department statistics also show that the U.S. has produced more crude oil per year than any other nation — for the past six years. Economy has shown recent signs of strength, not evidence of collapse TRUMP: “We’re going to have a crash like the 1929 crash if she gets in.” THE FACTS: The economy has shown recent signs of strength — not evidence that America is on the edge of economic collapse. On Thursday the S&P 500 jumped 1.6%, its sixth gain in a row. The Dow Jones Industrial Average also increased Thursday, as did the Nasdaq composite. Recent economic reports show that shoppers increased their retail spending last month and fewer workers sought unemployment benefits. Fears the economy was slowing emerged last month following a sharp drop in hiring and higher unemployment rates. But those worries were assuaged earlier this month when better-than-expected jobless numbers led to Wall Street’s best rally since 2022. Harris was not named border ‘czar’ TRUMP: “She was the border czar but she didn’t do anything. She’s the worst border czar in history. … She was the person responsible for the border and she never went there.” THE FACTS: Biden tapped Harris in 2021 to work with Central American countries to address the root causes of migration and the challenges it creates. Illegal crossings are one aspect of those challenges, but Harris was never assigned to the border or put in charge of the Department of Homeland Security, which oversees law enforcement at the border. Black unemployment is lower under Biden TRUMP: “The Black population had the best numbers they’ve ever had on jobs, on income, on everything. The Hispanic population had the best numbers.” THE FACTS: It’s true that Black and Hispanic unemployment fell to then-record lows under Trump, but that was upended by COVID. When Trump left office, Black unemployment had soared to 9.3% and Hispanic unemployment to 8.5%. Under Biden, Black unemployment fell to a new record low of 4.8% in April 2023, while Hispanic unemployment in September 2022 matched the all-time low of 3.9% it had reached under Trump.","summary":"At his New Jersey golf club, the Republican nominee blended falsehoods about the economy with misleading statements and deeply personal attacks about his Democratic opponent, Vice President Kamala Harris.","url":"https://www.twincities.com/2024/08/15/fact-focus-trump-blends-falsehoods-and-exaggerations-at-rambling-nj-press-conference/","image":"https://www.twincities.com/wp-content/uploads/2024/08/AP24228796468684.jpg?w=1024","video":null,"publish_date":"2024-08-16 00:02:57","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.323},{"id":254216898,"title":"Trump takes questions from reporters at New Jersey golf club","text":"Trump takes questions from reporters at New Jersey golf club Former President Donald Trump took questions from reporters at his golf resort in Bedminster, New Jersey, on Thursday. He criticized Vice President Kamala Harris' economic policies, and said if she's elected, \"the worst is yet to come.\" Political strategists Joel Payne and Matt Gorman join \"America Decides\" with analysis.","summary":"Former President Donald Trump took questions from reporters at his golf resort in Bedminster, New Jersey, on Thursday. He criticized Vice President Kamala Harris' economic policies, and said if she's elected, \"the worst is yet to come.\" Political strategists Joel Payne and Matt Gorman join \"America Decides\" with analysis.","url":"https://www.cbsnews.com/video/trump-takes-reporter-questions-new-jersey-golf-club/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/15/7f3b509d-1591-4136-827e-508c4840e18b/thumbnail/1200x630/d25ee342563630b1490fc4c0af41103a/cbsn-fusion-trump-takes-reporter-questions-new-jersey-golf-club-thumbnail-3124848-640x360.jpg?v=d8f7565ef3e8b7256","video":null,"publish_date":"2024-08-15 23:52:53","author":null,"language":"en","source_country":"US","sentiment":-0.59},{"id":254216754,"title":"Economic choice in election is stark, bigger opportunity or a bigger state","text":"Kamala Harris believes she knows the choice before the public in November. It is between going “forwards” and going “backwards.” Since the Democratic nominee is wise about the nature of time she insists that this November America should choose to go forward. In fact it would good if this country could go back. To the economy we had before Kamala Harris and Joe Biden entered office Because the most consequential choice there is in this election is between left-wing economics and right-wing economics. Between the economics of Biden-Harris and the economics of Trump. In some areas of life the left-right divide is blurry. But in economics the difference is clear. It is between those who would grow the size of the economy and those who would grow the size of the state. When it comes to election season, some people will say anything they like just to be elected. People promise things. But they can’t be tested on them. At least not until they have arrived into office. That is one of the things that makes this election season so much better than most. Because the American public have two choices in front of them. Both of whom have a very clear track record. For once we can judge the candidates not on their words but on their deeds. Unfortunately this is not good news for Kamala Harris. Today the Vice President is trying to add some meat onto the bones (such as they are) of her economic plans. These are reported to include efforts to make housing more affordable, lower the costs of living for families, boost small businesses and take on “corporate excess.” The last of these is simply a left-wing pandering-point. Anyone hoping to stir up the left-wing base can always paint big bad capitalists and their excessive salaries as the problem. As though anything you did to tinker with top Wall Street salaries would do a thing for working class Americans. But on her other proposals we don’t need to judge how well Harris and Trump could do. We can judge them on what they already did do. During Trump’s four years in office rank-and-file American workers had their highest wage growth in over 10 years. Indeed the pace of their wage growth outpaced that of their supervisors. The Democrats like to pretend that Trump’s tax cuts only benefited the rich. But again that is not just playing the politics of pointless envy. It is simply untrue. The Tax Cuts and Jobs Act (2017) didn’t just massively spur economic growth, it also saw the average taxpayer receive an on-average tax cut of around $1,500. Hourly and weekly earnings increased by 1.1% between November 2018 to November 2019 alone. Again — these benefits helped everyone. Kamala Harris may enjoy talking about minority communities and how much the state needs to help them. But when Trump was in the White House, he helped African Americans and others to help themselves. During the first three years of Trump’s presidency median household incomes rose by 15.4% for black Americans and 11.5% for white Americans. Obama may have talked a great game, but just compare even his results with Trump’s. Between 2009 and 2015 Obama oversaw an economy in which in six years median household incomes increased only 2.3% for black Americans and 4.4% for white Americans. And what about Biden-Harris? Well between June 2021 and June 2022 alone real average hourly earnings fell by a whopping 3.6%. That’s the Biden-Harris economy for you. While the Democrats talk of equity and racial justice, Trump actually oversaw an economy in which 400,000 new black Americans workers entered the US economy every year. That is compared to an average of just 250,000 in each year of the Obama presidency. The most important issue that the Republicans can now push is not just how well the economy did under Trump, but how poorly it had done under Biden-Harris. Just last November, Moody’s downgraded its ratings outlook on the US government from stable to negative. Last August Fitch downgraded the US long-term foreign currency issuer default from its triple A rating. In fact the ratings agencies have pummeled the Biden-Harris more than that big Algerian pummeled his female boxing opponents at the Paris Olympics. As for home affordability. Under Biden-Harris home affordability in the US is now at its worst level since 1984. With mortgage and inflation rates at sky-high levels under Biden-Harris, would-be home-owners are now being hit from every side. Trump has already laid out how he proposes to tackle the curse of inflation. But what would President Harris do? Again we already have her record to judge her on. When Trump left office, he left an economy with a mere 1.4% inflation. During the Biden-Harris years the inflation rate has topped out at 9.1% (in June 2022). And although some politicians like to pretend inflation is just something like a major weather event (“Ukraine,” they often say, as if that excuses everything) in fact inflation is something you can deal with. You can make the economic weather. And Biden-Harris either chose to make it infinitely worse, or were just fantastically inept. It was their smart idea to try to tackle inflation by going on a $1.9 trillion spending spree (the American Rescue Plan) followed by the $433 billion Inflation Reduction Act. All despite Treasury Secretary Janet Yellen saying that inflation was “transitory.” This is why prices have increased almost 20% since Biden and Harris took charge. And it is the American public that is feeling it. In February 2020, 57% of Americans said they felt the US economy was excellent or good. In May this year a mere 23% of Americans were able to say the same thing. Here is the challenge for Harris. She has to present herself as having answers to this country’s economic problems. Yet she was just part of an administration that made things demonstrably worse. Trump, on the other hand, has a positive message to sell. Put personalities aside, the answer for his campaign is clear. Trump should run on his record and invite Harris to run on hers. I for one cannot wait to see her try.","summary":"Kamala Harris believes she knows the choice before the public in November.","url":"https://nypost.com/2024/08/15/opinion/economic-choice-in-election-is-stark-bigger-opportunity-or-a-bigger-state/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/KAM13.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-15 23:49:27","author":"Douglas Murray","authors":["Douglas Murray"],"language":"en","source_country":"us","sentiment":0.039},{"id":254216802,"title":"Trump openly criticizes Harris, says he is ‘entitled to personal attacks’ on his campaign opponent","text":"Trump was asked during a news conference whether his campaign needs more discipline as he faces a Democratic ticket newly energized since Harris replaced President Joe Biden as the party’s presidential candidate. “As far as the personal attacks, I’m very angry at her because of what she’s done to the country. I’m very angry at her that she would weaponize the justice system against me and other people, very angry at her. I think I’m entitled to personal attacks,” Trump said at his New Jersey golf club, where he invited reporters in his quest to saddle Harris with Biden’s unpopular economic record. “I don’t have a lot of respect for her intelligence and I think she’ll be a terrible president,” he added. Trump also took issue with Democrats branding him and his running mate, Ohio Sen. JD Vance, as “weird.” Harris is “weird in her policy,” he said. Trump stuck close to his scripted economic message for more than half an hour, reading from a binder in front of him in a news conference at his New Jersey golf club. Later, he veered into familiar stories he enjoys telling at his rallies. A day earlier, he had struggled to make a sustained case for his economic policies during a meandering speech that his campaign had billed as a major policy address. “Kamala Harris is a radical California liberal who broke the economy, broke the border and broke the world, frankly,” Trump told reporters. Trump was flanked by popular grocery store items, including instant coffee, sugary breakfast cereals and pastries, laid out on tables as he highlighted the cost of everything from food to car insurance to housing. Posters showed the increase of prices for grocery staples. At one point, as Trump talked about the 2020 election he lost, he noticed a box of cereal. “I haven’t seen Cheerios in a long time,” Trump said. “I’m going to take them back to my cottage.” As he turned to walk back inside, Trump did not respond to shouted questions about when he last went grocery shopping. The event came one day after the Labor Department announced year-over-year inflation had reached its lowest level in more than three years in July — the latest sign that the worst price spike in four decades is fading. But consumers are still feeling the impact of higher prices — something Trump’s campaign is banking on to motivate voters this fall. A new poll from The Associated Press-NORC Center for Public Affairs Research finds that Americans are more likely to trust Trump over Harris when it comes to handling the economy and immigration, issues he has put at the center of his case for returning to the White House. Harris is planning her own economic policy speech Friday in North Carolina, promising to push for a federal ban on price gouging on groceries. Trump predicted he would beat Harris by more that he would have beaten Biden by “once she’s exposed.” “People don’t know who she is,” Trump said. A small crowd of Trump supporters watched his news conference from the periphery, occasionally cheering him on. But without a crowd of thousands to please with red meat attacks on his enemies, Trump stuck closer to his prepared remarks. Hours before the news conference, Trump’s campaign leaders announced they were expanding his staff, bringing a number of former aides and outside advisers formally into the fold. Corey Lewandowski, Taylor Budowich, Alex Pfeiffer, Alex Bruesewitz and Tim Murtaugh will advise the campaign’s senior leadership. Lewandowski was Trump’s first campaign manager during his 2016 campaign. Budowich and Pfeiffer are moving over from MAGA Inc., a pro-Trump super PAC. Bruesewitz produces pro-Trump content for a large social media following. And Murtaugh was the communications director for Trump’s 2020 campaign. Summer has been the time for shakeups in Trump’s two prior campaigns. This year’s change comes weeks after the campaign itself was transformed by Biden’s decision to end his reelection campaign and endorse Harris. Trump gave his top advisers a vote of confidence Thursday, writing on his social media platform that his management team headed by Chris LaCivita and Susie Wiles is “THE BEST.” Trump spoke to the press as he has stepped up his criticism of Harris for not holding a news conference or sitting down for interviews since Biden made way for her. “I think I’m doing a very calm campaign,” Trump said after being asked about criticism from Republicans who want him to focus less on personal attacks. “Some of you will say, ‘He ranted and raved,’” Trump said to journalists. “I’m a very calm person, believe it or not.”","summary":"Donald Trump accused Kamala Harris of weaponizing the justice system against him. As vice president, Harris has no direct control over DOJ or its investigations.","url":"https://fortune.com/2024/08/15/trump-criticizes-harris-entitled-personal-attacks-campaign-inflation-costs/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/AP24228758437047-e1723765446359.jpg","video":null,"publish_date":"2024-08-15 23:49:22","author":"Jill Colvin,Jonathan J. Cooper,The Associated Press","authors":["Jill Colvin","Jonathan J. Cooper","The Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.313},{"id":254216748,"title":"Wisconsin Democrats’ effort to prevent Jill Stein from appearing on ballot may benefit Kamala Harris among supporters of Palestine","text":"In Wisconsin, the decision of just a few votes can sway the outcome of the presidential election. With a history of about 20,000 votes, less than 1% has determined the winner in four of the state’s past elections. The state’s 10 electoral votes are highly sought after, and even a small number of votes diverted to a third-party candidate could impact the final result. Recently, David Strang, the Democratic National Committee deputy operations director in Wisconsin, raised concerns about the ballot access of Jill Stein, the Green Party candidate who received over 30,000 votes in the 2016 election. The complaint alleges the Wisconsin Green Party, which qualified for ballot status in 2022 when a candidate garnered 1% of the stateâs vote, does not have qualified electors to put forward and therefore runs afoul of Wisconsin election law. The Green Partyâs virtual convention happens this week, where Stein is expected to win the partyâs presidential nomination. Her platform includes left-leaning positions such as codifying Roe v. Wade, abolishing student debt, opposing school choice and supporting the Equality Act, which would add sex, sexual orientation and gender identity to the 1964 Civil Rights Act. The Wisconsin Green Partyâs website features an article from May titled âStanding with the students standing with GAZA,â which praised student protests at the University of Wisconsin-Madison and University of Wisconsin-Milwaukee and endorsed the studentsâ demands. Stein and her campaign manager were arrested in April at Washington University in St. Louis while taking part in an anti-Israel protest. Removing an option for pro-Palestinian voters in Wisconsin would likely be a boon for the Democratic Party. In the April presidential primary, almost 48,000 voters cast an âuninstructed ballotâ as a protest against President Bidenâs handling of the Israel-Gaza conflict. Biden, Vice President Kamala Harris and Sen. Tammy Baldwin (D-Wis.) have all faced anti-Israel protests and hecklers when campaigning in Wisconsin. WisDem Chair Ben Wikler said after the primary that then-Democratic presidential candidate Biden had work to do to earn those uninstructed votes. Now booting other options for pro-Palestine voters off the ballot may be the Democratsâ key to pushing those voters toward Harris. Harris responded to a question in March about the uncommitted protest vote in neighboring Minnesota. Ã¢ÂÂThey matter,Ã¢ÂÂ the VP declared, Ã¢ÂÂand we care about them.Ã¢ÂÂ Ã¢ÂÂWe respect the fact that people feel very strongly about what we are witnessing,Ã¢ÂÂ Harris said, referring to the Israel-Hamas war. The DNC employee filed a complaint against former Green Party member and independent candidate Cornel West last week, attempting to deny his ballot access as well. âThis is a fishing expedition conjured up by the DNC,â Steinâs campaign manager Jason Call told The Post. âAnd [itâs] in line with their statements back in March that they will hire an army of lawyers and infiltrators to find any angle of attack to prevent Green Party ballot access.â âThe American people are tired of these anti-democratic shenanigans, and we absolutely will be hiring counsel to defend our ballot line in Wisconsin,â Call continued. In a poll out Wednesday, Harris took a strong lead over Donald Trump in Wisconsin when third-party candidates were factored in, leading the former prez 48% to 43%. The unelected, six-member bipartisan Wisconsin Election Commission will determine the fate of Stein, West, Robert F. Kennedy Jr. and two other independent candidates in an Aug. 27 commission meeting.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn Wisconsin, the decision of just a few votes can sway the&#8230;\n\n\nThis Post: Wisconsin Democrats&#8217; effort to prevent Jill Stein from appearing on ballot may benefit Kamala Harris among supporters of Palestine first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/wisconsin-democrats-effort-to-prevent-jill-stein-from-appearing-on-ballot-may-benefit-kamala-harris-among-supporters-of-palestine/","image":"https://internewscast.com/wp-content/uploads/2024/08/Wisconsin-Democrats-move-to-block-Jill-Stein-from-ballot-A¢AAAA-which.jpg","video":null,"publish_date":"2024-08-15 23:46:44","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.05},{"id":254216786,"title":"E. Jean Carroll Honored With Truth Seekers Award, Calls Donald Trump Verdict: ‘Happiest Day of My Life’","text":"Author and journalist E. Jean Carroll revealed what motivated her to go public with her rape accusations against former President Donald Trump and speculated on how he is handling Vice President Kamala Harris’ candidacy at Thursday’s Variety & Rolling Stone’s Truth Seekers Summit, presented by Paramount+, in New York. Her attorney Roberta Kaplan, who won […]","summary":"Author and journalist E. Jean Carroll revealed what motivated her to go public with her rape accusations against former President Donald Trump and speculated on how he is handling Vice President Kamala Harris&#8217; candidacy at Thursday&#8217;s Variety &#38; Rolling Stone&#8217;s Truth Seekers Summit, presented by Paramount+, in New York. Her attorney Roberta Kaplan, who won [&#8230;]","url":"https://variety.com/2024/biz/news/e-jean-carroll-trump-kamala-harris-1236108345/","image":"https://variety.com/wp-content/uploads/2024/08/E-Jean-Carrol-Truthseekers-Variety-Rolling-Stone.jpg","video":null,"publish_date":"2024-08-15 23:42:18","author":"Pat Saperstein,William Earl","authors":["Pat Saperstein","William Earl"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.365},{"id":254216670,"title":"Yes — the Democrats could win this","text":"Since Joe Biden dropped out of the US presidential race three weeks ago, a lot has happened in the Democrats’ camp, with the formal nomination of Kamala Harris and the announcement of her running mate Tim Walz energising the campaign. But can the Democrats actually win this? That’s the question our debaters are throwing around in this week’s Friday Fight. Arguing for the negative team we have Crikey’s very own Charlie Lewis. And in the affirmative corner we have Ava Kalinauskas, research associate at the United States Studies Centre. Kamala Harris’ ascent to the top of the Democratic ticket has shaken up the 2024 US presidential race and injected fresh life into the Democrats’ bid for the White House. Just three weeks ago, 81-year-old President Joe Biden was muddling through media appearances and press conference gaffes, all the while struggling to hold onto support from traditional Democratic constituencies, let alone from within his own party. The Democrats can now taste what was slipping away in the dying days of Biden’s campaign — a path forward to victory in November. It’s difficult to understate just how much Harris is energising the Democratic base. Her entry into the race catalysed one of the largest fundraising spikes in US electoral history, bringing in US$81 million in just 24 hours — most of it from first-time donors. Harris’ recent campaign blitz touring battleground states, with her newly minted running mate Tim Walz, drew crowds of a size and spirit not typically seen until far closer to election day. And that’s not to mention how she is gaining traction online, as users take to social media to memeify her campaign, stitching together videos of Harris with gen Z pop culture touchpoints. Some are even comparing the surge of enthusiasm for Harris to the wave of excitement that surrounded Obama’s campaign in the 2008 presidential election, which he went on to win in an electoral vote landslide. Recent polling suggests that this new momentum is translating into shifts in voter sentiment. The latest New York Times/Siena poll finds an almost 30-point jump in Democrats’ satisfaction about the choice of candidates this election compared to May, and confirms that Harris is winning back the key Democratic voting blocs that Biden was failing to consolidate, like Black and young voters. But beyond energising the base, Harris is also making crucial ground in the all-important swing states which will ultimately decide the election. Polling is beginning to show Harris opening a four-point lead in Michigan, Wisconsin and Pennsylvania. These three “Blue Wall” states, in which Biden was haemorrhaging support, all voted for Trump in 2016 and flipped to Biden in 2020. If Harris can continue this trajectory and win these critical states in November, she has perhaps her clearest path to the Oval Office. There’s no doubt that Trump and his allies can feel this sudden tidal wave of momentum shifting Harris’ way — and it’s placing them under pressure. Just last month, Trump was officially crowned the Republican nominee at an RNC that some suggested felt more like a religious ceremony than a party convention. Most commentary expected Trump to trounce Biden in an electoral rematch; he survived an assassination attempt which only seemed to energise Republicans, and Trump’s choice of JD Vance as a running mate was interpreted by many as a sign that Trump felt he needed to do little to expand his appeal beyond the base of voters already in his grasp. Now, Trump must compete with Harris for the media oxygen he thrives on. And Harris’ rise is unleashing Trump’s harshest impulses, as he levels personal attacks and questions her racial identity. His campaign has so far failed to land on its messaging — is Harris a “radical San Francisco liberal,” a continuation of Biden’s legislative agenda, or a “flip-flopper” running a “fraudulent campaign”? It’s no secret that Trump doesn’t do well on the back foot. And if his campaign fails to adapt to Harris’ jolt to the election, it will struggle to blunt the momentum that has propelled her from strength to strength in recent weeks. However, this is not to say that Democrats are certain to soar to an electoral victory in November. In 2019, Harris burst onto the Democratic primary scene with a groundswell of enthusiasm, but ultimately failed to deliver on the early promise of her campaign. She currently benefits from being a new face in a contest that Americans were increasingly bored of — but there’s only so much longer before the novelty may wear off. The upcoming weeks therefore represent a crucial test. Harris’ campaign has yet to lay out a specific policy agenda. But this ambiguity carries risk. Republicans are already filling the void with the left-wing positions from her previous primary run — like banning fracking and abolishing private health insurance — which she’s tried to distance herself from, and are out of step with the views of most moderate voters. Moreover, no amount of momentum can help Harris escape the fact she is tied to Biden’s record on immigration and the economy — two issues that matter most to the Americans she needs to win over in swing states. But while it may be early days, with Harris at the top of the ticket, pundits can now say what they couldn’t necessarily about Biden’s campaign: the Democrats have a fighting chance in November. Read the opposing argument by Charlie Lewis. Is the momentum behind the Democrats enough to win the presidency? Or is the bubble about to burst? Let us know your thoughts by writing to letters@crikey.com.au. Please include your full name to be considered for publication. We reserve the right to edit for length and clarity.","summary":"'It’s difficult to understate just how much Harris is energising the Democratic base.'\n\n\nThe post Yes — the Democrats could win this appeared first on Crikey.","url":"https://www.crikey.com.au/2024/08/16/2024-us-presidential-election-democrats-kamala-harris-friday-fight/","image":"https://www.crikey.com.au/wp-content/uploads/2024/08/Debate_Club_6_AK_1480x800.jpg?quality=70","video":null,"publish_date":"2024-08-15 23:40:57","author":"Ava Kalinauskas","authors":["Ava Kalinauskas"],"language":"en","catgory":"politics","source_country":"au","sentiment":0.321},{"id":254216666,"title":"No, the Democrats don’t ‘got this’","text":"Since Joe Biden dropped out of the US presidential race three weeks ago, a lot has happened in the Democrats’ camp, with the formal nomination of Kamala Harris and the announcement of her running mate Tim Walz energising the campaign. But can the Democrats actually win this? That’s the question our debaters are throwing around in this week’s Friday Fight. Arguing for the negative team we have Crikey’s very own Charlie Lewis. And in the affirmative corner we have Ava Kalinauskas, research associate at the United States Studies Centre. On November 8, 2016, the Hillary Clinton campaign took part in the then-viral trend of the mannequin challenge. And who could forget her warmly received cameo on the hit comedy Broad City, which did so much to sure up her vote in California? It was the kind of knowing, media-savvy stuff that played brilliantly to knowing, media-savvy types in Democratic strongholds and, as it turns out, absolutely no one else. I’m not sure what it is about the Democrats’ lusty embrace of Charlie XCX’s endorsement and jokes about JD Vance sticking his dick in a couch that reminded me of the 2016 campaign, except perhaps everything. To say that the Harris team’s embrace of meme culture feels easier and less corpse-stiff than Clinton’s is to clear a bar so low it’s currently liquefying in the earth’s core. Meanwhile, how many times did Trump do or say something that made you certain his campaign could never recover? Access Hollywood? His misogyny toward Fox News’ Megyn Kelly? His mockery of a disabled reporter? His many legal troubles, including his explicit contention that a judge could not be trusted to do their job because they were of “Mexican heritage”? For me, it was his mockery of a dead soldier’s family and of Republican senator John McCain for his years of torture during the Vietnam War. There was surely no more sacrosanct convention in US politics: mocking members of the armed forces or their families is Inland Taipan-like political poison. After this, I thought Trump’s campaign would be dead before it hit the ground. And remember what an unmitigated joke Donald Trump’s campaign seemed in 2016? The laughter over “Drumpf” and “Covfefe”. The way talk show hosts essentially gave up on non-Trump material for the year, figuring to make “scathing” assessments of his buffoonery while they still could. Trump’s candidacy wasn’t just an unpleasantness that could be gotten out of the way, he was tipped to lose so hard that it would disqualify the Republican party from office for a generation. The New York Times gave Clinton an 85% chance of winning, and just as he would four years later, Trump prepared for a loss by claiming the process was rigged. And after the roiling, uninterrupted scandal factory that was Trump’s time in office, Trump’s popular vote increased by nearly 12 million. So the apparent panic and chaos in the Trump camp doesn’t necessarily mean much about what voters will decide in November. I take absolutely no joy in bringing any of that up. I only do so because large swathes of the media seem to be so intent on forgetting it, caught up in the vibes of the last three weeks. “Kamala Harris must mobilize stan armies” writes Vulture, and like a lot of the coverage of Kamala’s brat summer, it’s borderline impossible to work out if it’s sincere, or an Onion headline that’s escaped into the real world. Harris has inarguably arrested and reversed Biden’s slide in national aggregate polls in the bright autumn of his campaign, and the media, audibly breathing a sigh of relief at the prospect of a contest rather than whatever the hell a Trump/Biden rematch would have become, have been hyping it. CNN this week reported on the “surprising” bump in support for Harris in a key demographic: White non-college-educated voters in swing states. Biden’s improvement among that cohort (as opposed to Clinton) was huge in 2020, and they were the only cohort keeping him afloat in 2024. So Harris now trails Trump by 14 points, rather than 25. Harris is now very marginally ahead in four of the seven closest swing states and 538 puts her ahead by 2.6% in its most recent national aggregate. Bear in mind that we are likely nearing the peak of Harris’ honeymoon period: next week’s Democratic National Convention. After that, the vigour and novelty of her entry and selection of her running mate will likely wear off, and questions of policy and communication will come to the fore. If we recall Harris’ first pitch at the presidential nomination — where early hype about her chances dissipated amidst high-profile policy backdowns and inconsistent messaging — there are very serious questions about how that will go. A lot of what Harris is up against is no fault of hers. However hard they try to avoid doing so, Trump is held to a different set of standards by a mainstream media which has never known how to effectively hold him to account. And one of the fears that kept Democrats largely behind Biden (at least in public) for so long — that a decent, possibly crucial chunk of the United States might not vote for any black woman — is presumably as true now as it was in June. Oh, and… DING! DING! DING! CRIKEY EDITORS DECLARE LEWIS HAS PASSED HIS ALLOCATED WORD COUNT …then there’s the fact in both 2016 and 2020, pollsters significantly underestimated Trump’s vote. There is a long way to go, of course, and none of this is terminal for the Democrats. But a lot has to improve before the current sense of triumphalism pervading the party matches up with any kind of reality. Read the opposing argument by Ava Kalinauskas. Is the momentum behind the Democrats enough to win the presidency? Or is the bubble about to burst? Let us know your thoughts by writing to letters@crikey.com.au. Please include your full name to be considered for publication. We reserve the right to edit for length and clarity.","summary":"If we look at numbers and history, rather than vibes, things look a lot less rosy for the Democrats.\n\n\nThe post No, the Democrats don&#8217;t &#8216;got this&#8217; appeared first on Crikey.","url":"https://www.crikey.com.au/2024/08/16/2024-us-presidential-election-democrats-donald-trump-friday-fight-no/","image":"https://www.crikey.com.au/wp-content/uploads/2024/08/Debate_Club_6_CL_1480x800.jpg?quality=70","video":null,"publish_date":"2024-08-15 23:40:30","author":"Charlie Lewis","authors":["Charlie Lewis"],"language":"en","catgory":"politics","source_country":"au","sentiment":0.006},{"id":254216480,"title":"Trump has taken 81 questions at press conferences, interviews compared to Harris' 14 since Walz joined ticket","text":"Former President Trump has answered at least 81 questions from reporters since Vice President Kamala Harris and Tim Walz emerged as the Democratic ticket, compared to only a handful for Harris and none for Walz. Harris hasn't taken on-record reporter questions aside from a tossed-out question about debates by an MSNBC reporter and a pair of press gaggles in Michigan and Arizona, amounting to just 14 total, Fox News Digital has found. She has not given a formal interview, either, although she claimed she hopes to schedule one before the end of the month. Neither has her running mate Walz, while Trump's running mate JD Vance has taken dozens of questions in three national interviews and multiple press conferences in that same period. Since Aug. 6, when Walz joined the Harris ticket, Trump has fielded dozens of questions during two lengthy press conferences, a long appearance on \"FOX & Friends\" and a two-hour conversation with supporter and X owner Elon Musk. 25 DAYS: KAMALA HARRIS HAS NOT HELD A PRESS CONFERENCE SINCE EMERGING AS PRESUMPTIVE DEMOCRATIC NOMINEE Trump answered at least 35 questions alone during last week’s Mar-a-Lago presser, and another 16 during Thursday’s Bedminster event. The former president drove his economic message during his latest remarks, appearing alongside tables of everyday grocery items, putting an emphasis on the soaring cost of goods during the Biden-Harris administration. Trump took another 16 direct questions from Musk during their conversation that also featured lengthy candid answers that didn’t necessarily stem from a specific question, but rather statements made by the X mogul. One moment that made particular waves was when Trump praised Musk as the \"greatest cutter,\" seemingly referring to his mass layoffs when he bought Twitter, now called X. The difference between press access of Trump and Harris is also striking when counting the time they’ve spent answering questions. CNN'S KASIE HUNT QUESTIONS WHY HARRIS IS HOLDING CAMPAIGN EVENT ALONGSIDE BIDEN: 'FEELS UNCOMFORTABLE' Trump fielded 14 questions for 28 minutes on \"FOX & Friends\" on Aug. 7 from the hosts as well as voters in South Dakota, discussing Walz's selection as Harris' running mate, inflation, social security and other issues. He spoke and then answered questions for a combined 65 minutes during the Mar-a-Lago presser last week. He spent roughly two hours speaking with Musk on Monday, and spent another 83 minutes at Bedminster for a total of four hours and 56 minutes. Harris, on the other hand, has taken roughly 14 questions for a combined three minutes since Aug. 6. Harris’ avoidance of reporters has gotten so blatant that CNN’s Jim Acosta recently asked a campaign spokesperson if it would \"kill you guys\" to hold a press conference. CNN HOST PRESSES HARRIS CAMP ON HER AVOIDING MEDIA: 'WOULD IT KILL YOU GUYS TO HAVE A PRESS CONFERENCE?' Vance has been critical of Harris dodging the press and called on the media to press her to answer tough questions. He put his money where his mouth was when he appeared Sunday on ABC’s \"This Week,\" CBS’ \"Face the Nation\" and CNN’s \"State of the Union,\" none of which could be considered friendly sit-downs. Vance answered at least 16 questions from ABC’s Jonathan Karl, 27 from CBS’ Margaret Brennan and 20 from CNN’s Dana Bash in the exchanges. All the interviews also included numerous statements or remarks that weren’t necessarily questions from the journalists that prompted Vance to offer thoughts on additional topics. CLICK HERE TO GET THE FOX NEWS APP In addition, Vance has done gaggles or press conferences during stops in Pennsylvania, Wisconsin and Michigan during that period. The Harris campaign didn't respond to a request for comment.","summary":"Former President Trump has taken more than five times the questions on the campaign trail than rival Vice President Kamala Harris, who hasn&apos;t done any interviews or press conferences.","url":"https://www.foxnews.com/media/trump-has-taken-81-questions-press-conferences-interviews-compared-harris-14-since-walz-joined-ticket","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/HARRIS-TRUMP.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-15 23:37:37","author":"Brian Flood,David Rutz,Joseph Wulfsohn","authors":["Brian Flood","David Rutz","Joseph Wulfsohn"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.391},{"id":254216442,"title":"Wisconsin Democrats move to block Jill Stein from ballot — which would likely boost Kamala Harris among pro-Palestine voters","text":"WATERTOWN, Wis. — There are swing states, and then there are swing states like Wisconsin, where about 20,000 votes — fewer than 1% — have decided four of the Dairy State’s last presidential elections. Even a few thousand votes siphoned off by a third-party presidential candidate could determine which direction Wisconsin’s coveted 10 electoral votes will go. David Strang, the state’s Democratic National Committee deputy operations director, filed a complaint Wednesday challenging the ballot access of Wisconsin Green Party candidate Jill Stein, who won more than 30,000 votes here in the 2016 presidential election. The complaint alleges the Wisconsin Green Party, which qualified for ballot status in 2022 when a candidate garnered 1% of the state’s vote, does not have qualified electors to put forward and therefore runs afoul of Wisconsin election law. The Green Party’s virtual convention happens this week, where Stein is expected to win the party’s presidential nomination. Her platform includes left-leaning positions such as codifying Roe v. Wade, abolishing student debt, opposing school choice and supporting the Equality Act, which would add sex, sexual orientation and gender identity to the 1964 Civil Rights Act. The Wisconsin Green Party’s website features an article from May titled “Standing with the students standing with GAZA,” which praised student protests at the University of Wisconsin-Madison and University of Wisconsin-Milwaukee and endorsed the students’ demands. Stein and her campaign manager were arrested in April at Washington University in St. Louis while taking part in an anti-Israel protest. Removing an option for pro-Palestinian voters in Wisconsin would likely be a boon for the Democratic Party. In the April presidential primary, almost 48,000 voters cast an “uninstructed ballot” as a protest against President Biden’s handling of the Israel-Gaza conflict. Biden, Vice President Kamala Harris and Sen. Tammy Baldwin (D-Wis.) have all faced anti-Israel protests and hecklers when campaigning in Wisconsin. WisDem Chair Ben Wikler said after the primary that then-Democratic presidential candidate Biden had work to do to earn those uninstructed votes. Now booting other options for pro-Palestine voters off the ballot may be the Democrats’ key to pushing those voters toward Harris. Harris responded to a question in March about the uncommitted protest vote in neighboring Minnesota. “They matter,” the VP declared, “and we care about them.” “We respect the fact that people feel very strongly about what we are witnessing,” Harris said, referring to the Israel-Hamas war. The DNC employee filed a complaint against former Green Party member and independent candidate Cornel West last week, attempting to deny his ballot access as well. “This is a fishing expedition conjured up by the DNC,” Stein’s campaign manager Jason Call told The Post. “And [it’s] in line with their statements back in March that they will hire an army of lawyers and infiltrators to find any angle of attack to prevent Green Party ballot access.” “The American people are tired of these anti-democratic shenanigans, and we absolutely will be hiring counsel to defend our ballot line in Wisconsin,” Call continued. In a poll out Wednesday, Harris took a strong lead over Donald Trump in Wisconsin when third-party candidates were factored in, leading the former prez 48% to 43%. The unelected, six-member bipartisan Wisconsin Election Commission will determine the fate of Stein, West, Robert F. Kennedy Jr. and two other independent candidates in an Aug. 27 commission meeting.","summary":"WATERTOWN, Wis. — There are swing states, and then there are swing states like Wisconsin, where about 20,000 votes — fewer than 1% — have decided four of the Dairy State&#8217;s last presidential elections. Even a few thousand votes siphoned off by a third-party presidential candidate could determine which direction Wisconsin&#8217;s coveted 10 electoral votes...","url":"https://nypost.com/2024/08/15/us-news/wisconsin-democrats-move-to-block-jill-stein-from-ballot-which-would-likely-boost-kamala-harris-among-pro-palestine-voters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87822609.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-15 23:37:14","author":"Amy Sikma","authors":["Amy Sikma"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.154},{"id":254216758,"title":"Trump press conference on economy veers into more personal attacks on Harris","text":"Aug. 15 (UPI) -- Republican presidential nominee Donald Trump again leveled personal attacks on Democratic opponent Kamala Harris on Thursday during what was promoted as a news conference at his New Jersey country club. After delivering prepared remarks on the economy over a 30-minute span during which he repeatedly criticized Vice President Harris and President Joe Biden over inflation, immigration and other topics, Trump took a handful of questions from reporters gathered at Trump National Golf Club in Bedminster, N.J. During the segment, he was asked if he if agreed with those in the Republican Party who are urging him to refrain from lobbing personal insults at Harris even as many polls show her surging ahead of him in key battleground states. Trump responded by saying he is justified in doing so. \"As far as the personal attacks -- because of what she has done to the country, I am very angry at her that she would weaponize the justice system against me and other people. Very angry. \"I think I am entitled to personal attacks. I do not have a lot of respect for her or her intelligence and I think she would be a terrible president,\" he said. Trump claimed Harris called him and his running mate, Sen. JD Vance, R-Ohio, \"weird,\" adding, \"She is weird. Weird with her policy.\" The comments about Harris' persona came after a lengthy opening statement in which Trump labeled the pro-consumer policy proposals of Harris and her running mate, Minnesota Gov. Tim Walz, as \"communist\" while standing in front of a table with an array of consumer products to demonstrate the effects of inflation. Harris is reportedly planning to issue a call for a ban on price-gouging in the food industry during a campaign stop in North Carolina on Friday. The former president also criticized Harris for changing her position on oil fracking in the key swing state of Pennsylvania, where she advocated it be banned due to environmental concerns during her failed run for the Democratic presidential nomination in 2020. \"I think she will do very badly in Pennsylvania,\" Trump said. \"You have to frack.\" Following the New Jersey event, the Harris-Walz campaign issued a statement characterizing Trump's remarks as revealing his \"opposition to lowering food costs for middle and working class Americans and prescription drug costs for seniors. \"No surprise, Trump doesn't want to defend his agenda that would raise costs for families by $3,900 a year, cut Social Security, and eliminate the Affordable Care Act -- all so he can give his rich donors tax breaks,\" the campaign said, adding that Harris \"has spent her life taking on fraudsters, cheaters, and criminals like Donald Trump.\"","summary":"Republican presidential nominee Donald Trump again leveled personal attacks on Democratic opponent Kamala Harris on Thursday during what was promoted as a news conference at his New Jersey country club.","url":"https://www.upi.com/Top_News/US/2024/08/15/Trump-press-conference-economy-veers-personal-attacks-Harris/8281723760150/","image":"https://cdnph.upi.com/ph/st/th/8281723760150/2024/upi_com/8fd56a906f1b14389391726c35b5fd02/v1.2/Trump-press-conference-on-economy-veers-into-more-personal-attacks-on-Harris.jpg","video":null,"publish_date":"2024-08-15 23:37:01","author":"Don Jacobson","authors":["Don Jacobson"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.289},{"id":254216276,"title":"14 busted as rowdy anti-Israel protesters descend on NYC rally for VP Kamala Harris: cops","text":"More than a dozen people – including a Big Apple sales rep and music teacher – were busted as rowdy anti-Israel protesters descended on a Harlem rally for Vice President Kamala Harris. Fourteen people were taken into custody – with two of them slapped with criminal charges — following the Wednesday night mayhem, according to police. Aida Kapica, 27, a sales development representative who lives in Staten Island, was arrested and charged with two counts of attempted assault in the second degree, attempted assault in the third degree, and two counts of disorderly conduct, police said. On her social media accounts, she has called President Biden “a g*nocidal maniac,” raged that “Z*onism is a disease” and declared, “My personality trait is being Albanian and always repping Palestine.” “When not working you can find me reading Kafka, Darwish and Khaled Hosseini. Enjoy traveling and immersing myself in new cultures,” she posted on her LinkedIn account. Keli Sutter, 45, of Upper Manhattan, was charged with criminal mischief, riot and resisting arrest, cops said. Both Kapica and Sutter were awaiting arraignment Thursday in Manhattan Criminal Court. Nine people, ranging in age from 21 to 51, were given criminal court summonses and three were released with desk appearance tickets. The majority lived in New York, though one of the arrested protesters was from Bayonne, NJ, one from Ohio and another from Texas. The disrupters barged into the site of the Democratic gathering in Harlem, where Mayor Eric Adams delivered an impassioned speech – before they were given the boot. While protesters were escorted out of the main rally, which wasn’t attended by Harris or her running mate, Minnesota Gov. Tim Walz, the demonstration took an ugly turn in front of a restaurant where up to 25 attendees stopped afterward for an after party. The angry mob of around 50 protesters stormed into the restaurant Bird in Hand at Broadway and West 146th Street as stunned patrons looked on, according to footage. Other videos showed cops taking rabble-rousers into custody as a crowd circled the police. Whistles and horns sounded, and smoke bombs were also set off during the brouhaha. Ayesha Schmitt, 27, of Astoria, who was slapped with a desk appearance ticket for resisting arrest, said she felt “a moral obligation to protest.” “We are currently witnessing a genocide happening, where every day I open up my phone and I see photos of children blown to bits,” Schmitt, who declined to reveal where she works, told The Post Thursday. She said that the cops who descended on the scene “escalated with violence far too much.” “They were kettling protesters and pushing them on and off the sidewalk,” she claimed. “I got pushed in the breast, then they tried to rip off my hijab, my religious covering. They choked me a little bit.” Joshua Santiago, 29, a music teacher from the Bronx who was charged with resisting arrest, claimed the “Zionists” – referring to the attendees at the Democratic Party event – “were kind of egging us on a little bit.” “We definitely made a lot of noise. We found out where the restaurant was, where their afterparty was going to be. The people ahead of me, in the restaurant disrupting the afterparty, were forcibly removed from the restaurant,” he said, noting he didn’t go into the eatery himself. Santiago was also present at a Columbia University protest over the spring, where he described himself as “advocating an anarcho communism” and toted flags supporting “Christian anarcho-communism” and Puerto Rican independence, according to a student news blog for the Ivy League university. He said he and others intervened Wednesday night as Schmitt was busted. “It was an assault,” he claimed. “She was shoved and dragged. The officer took out his baton to beat her and we all acted out against that. “I ran to her aid and stated, ‘I am not putting my hands on you’ and I crossed my arms and I asked ‘Why have you arrested this woman? Why are you physically assaulting this woman?’” He said one officer warned him to get back, but he “stayed firm” as cops then grabbed him and cuffed him. Santiago, who said he suffers from fibromyalgia, recalled telling cops that they were arresting a “disabled man,” but “one of them literally said ‘we do not care.’” “I was there because I believe in the freedom of all people, including Palestinians,” he said. “Until all of us are free, none of us are free.” Brian Felicetta, owner of Bird in Hand restaurant, said the protesters caused about $3,000 in damage. “It’s mostly just you know tables, chairs, flower boxes, the string lights so just when people started jumping up on things and stuff like that,” he said. — Additional reporting by David Propper","summary":"Fourteen people were taken into custody – with two of them slapped with criminal charges and hauled off to Manhattan Criminal Court -- following the Wednesday night mayhem, according to police. ","url":"https://nypost.com/2024/08/15/us-news/14-busted-as-rowdy-anti-israel-protesters-descend-on-nyc-rally-for-vp-kamala-harris-cops/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-f7xhhm3kg-1723764668774.jpg?quality=75&strip=all&1723750354&w=1200","video":"https://cdn.jwplayer.com/videos/w6pUzGp0-RyIcpnTz.mp4","publish_date":"2024-08-15 23:35:07","author":"Amanda Woods,Jack Morphet,Joe Marino","authors":["Amanda Woods","Jack Morphet","Joe Marino"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.339},{"id":254216350,"title":"Biden, Harris hold first joint event since Biden left race","text":"Biden, Harris hold first joint event since Biden left race President Biden and Vice President Kamala Harris on Thursday appeared in Maryland for their first joint event since Mr. Biden ended his reelection bid last month. The event focused on promoting a Biden administration plan to lower prescription drug prices for Medicare recipients. Weijia Jiang reports.","summary":"President Biden and Vice President Kamala Harris on Thursday appeared in Maryland for their first joint event since Mr. Biden ended his reelection bid last month. The event focused on promoting a Biden administration plan to lower prescription drug prices for Medicare recipients. Weijia Jiang reports.","url":"https://www.cbsnews.com/video/biden-harris-hold-first-joint-event-since-biden-left-race/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/15/f5e79d3f-c31e-448c-a720-552ad7389621/thumbnail/1200x630/71292d333ec7396dc7b1d3e9e7b62fd3/0815-en-jiang.jpg?v=d8f7565ef3e8b72561ee316b5993cbf9","video":null,"publish_date":"2024-08-15 23:34:43","author":null,"language":"en","source_country":"US","sentiment":0.031},{"id":254216658,"title":"South Asian voters in North Carolina express enthusiasm for Harris","text":"South Asian voters in North Carolina express enthusiasm for Harris For the first time, South Asian voters will be represented at the top of a presidential ticket with Vice President Kamala Harris. On Friday, she will hold a rally in North Carolina, where South Asians are the largest and fastest-growing Asian voting bloc. CBS News correspondent Shanelle Kaul spoke with voters about the 2024 race.","summary":"For the first time, South Asian voters will be represented at the top of a presidential ticket with Vice President Kamala Harris. On Friday, she will hold a rally in North Carolina, where South Asians are the largest and fastest-growing Asian voting bloc. CBS News correspondent Shanelle Kaul spoke with voters about the 2024 race.","url":"https://www.cbsnews.com/video/south-asian-voters-north-carolina-express-enthusiasm-harris/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/15/6083be8a-aa1a-41bd-9e08-a832be617412/thumbnail/1200x630/8d55b283cd877b43dcacba903bb48880/cbsn-fusion-south-asian-voters-north-carolina-express-enthusiasm-harris-thumbnail.jpg?v=d8f7565ef3e8b72561ee316b5","video":null,"publish_date":"2024-08-15 23:33:00","author":null,"language":"en","source_country":"US","sentiment":0.322},{"id":254216652,"title":"Trump criticizes Harris over economic policies","text":"Trump criticizes Harris over economic policies Former President Donald Trump held a news conference at his golf club in New Jersey on Thursday, his second in a week. Trump said Vice President Kamala Harris' economic policies are causing a catastrophe. CBS News' Fin Gómez and Willie James Inman have more.","summary":"Former President Donald Trump held a news conference at his golf club in New Jersey on Thursday, his second in a week. Trump said Vice President Kamala Harris' economic policies are causing a catastrophe. CBS News' Fin Gómez and Willie James Inman have more.","url":"https://www.cbsnews.com/video/trump-criticizes-harris-over-economic-policies/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/15/553705d2-fddb-4509-83aa-52c2ee7068e3/thumbnail/1200x630/d84ca4f62c6d89b0d3fb24668ef571c5/cbsn-fusion-trump-criticizes-harris-over-economic-policies-thumbnail.jpg?v=d8f7565ef3e8b72561ee316b5993cbf9","video":null,"publish_date":"2024-08-15 23:32:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.394},{"id":254216574,"title":"Top five takeaways from Trump press conference at Bedminster","text":"Former President Donald Trump‘s press conference at his Bedminster golf club in New Jersey featured a roughly 46-minute monologue with frequent attacks against Vice President Kamala Harris while repeating key topics from the campaign stump. This is Trump’s second press conference in about a week as he aims to pressure Harris into sitting down for a substantial press interview, which she has so far avoided. Last week’s press conference was held at his Mar-a-Lago resort in Palm Beach, Florida. The former president claimed Harris is “not smart enough” to face media questioning. Trump has struggled to adapt to a newly energized Democratic ticket and party after President Joe Biden suspended his campaign last month. The former president, flanked by a table full of food and coffee, blasted Harris as a “radical-left person” who “wants to put price controls all over the place.” In a surprise moment of kindness toward journalists, Trump praised CNN’s Dana Bash and Jake Tapper for their hosting duties during the June debate against Biden. “I have to say Jake Tapper and Dana Bash were unbelievably straight and honest. I give them a lot of credit for that,” Trump said of the debate where Biden did so poorly he was pressured into bowing out of the race. Before Trump’s press conference, the Harris campaign mocked the former president in an email with the subject line “Donald Trump To Ramble Incoherently and Spread Dangerous Lies in Public, but at Different Home.” Citing previous cases where Trump’s preference for incendiary comments overshadowed his message, the campaign warned readers that “Donald Trump intends to deliver another self-obsessed rant full of his own personal grievances to distract from his toxic Project 2025 agenda, unpopular running mate, and increasing detachment from the reality of the voters who will decide this election.” Here are the Washington Examiner’s five takeaways from the press conference. Trump tells Israel’s prime minister to end the war The last time Trump spoke with Israel’s Prime Minister Benjamin Netanyahu was during a 2 1/2 hour meeting at his Mar-a-Lago resort in late July, Trump told reporters Thursday. The assertion rebuts reporting that the two leaders spoke by phone Wednesday about the Gaza hostage and ceasefire deal. Trump did, however, encourage Netanyahu to hurriedly end the war against Hamas that has claimed the lives of thousands of civilians and led to 115 hostages still in the hands of Hamas. “He knows what he’s doing. I did encourage him to get this over with,” said Trump. “You want to get it over with. It has to get over with fast but have victory, get your victory, and get it over with. It has to stop. The killing has to stop.” Officials from the United States, Qatar, Egypt, and Israel are in the midst of high-level negotiations in Doha to bring out a deal that would end the fighting between Israel and Hamas. Trump calls early voting ‘ridiculous’ One day after early voting in Florida, Trump reverted to denouncing the voting strategy even as the GOP is pushing for the base to embrace early voting. Trump encouraged people who are struggling in credit card debt to vote for his campaign but segued into attacking early voting. “They should on Nov. 5 or sooner, if it’s early voting, which largely it is which is ridiculous, we should have one-day voting paper ballots,” Trump said. “We should have voter ID, and we should have proof of citizenship because people are voting.” On Wednesday, Trump cast an early vote ballot in Florida as a convicted felon. Trump was convicted of 34 felonies for falsifying business records, but depending on sentencing in New York and other legal cases, his right to vote could be curtailed. Trump ‘entitled’ to personal attacks against Harris For weeks, Harris and her running mate, Gov. Tim Walz (D-MN), have poked fun at Trump and his running mate, Sen. J.D. Vance (R-OH), via Generation Z-inflected memes, harsh campaign emails, and media appearances brandishing the GOP as “weird.” These attacks, according to Trump, allow him to lob criticisms right back at Democrats. “I think I’m entitled to personal attacks,” Trump said when asked about a more disciplined approach. “I don’t have a lot of respect for her. I don’t have a lot of respect for her intelligence, and I think she’ll be a terrible president, and I think it’s very important that we win,” Trump added. “And whether the personal attacks are good, bad, I mean, she certainly attacks me personally. She actually called me weird. ‘He’s weird.’ It was just a sound bite, and she called J.D. and I weird. He’s not weird. He was a great student at Yale. He went to Ohio State, graduated in two years at the top of his class, and all of these different things.” The GOP has continued to implore Trump to move away from attacks against Harris’s race and gender and focus more on pocketbook issues, to mixed results. Trump keeps commenting on Harris’s Time magazine cover In a Monday interview with Elon Musk on X, Trump claimed that Harris’s Time magazine cover reminded him of his wife and former first lady, Melania. Two days later, Trump brought up the magazine cover again at a rally in Asheville, North Carolina. “And now they’re putting her on the covers of Time magazine with an artist sketch. They don’t use a picture, they don’t use a picture, they use an artist sketch,” Trump said as the crowd booed. “I want to use that artist. I want to find that artist. I like him very much.” Thursday marked the third time that Trump publicly referenced the cover. “What was that all about? The whole thing is crazy. I just want to win for the country,” Trump said. “Some people say, ‘Oh, why don’t you be nice?’ But they’re not nice to me.” Trump’s openness to Nikki Haley Former U.N. Ambassador Nikki Haley recently slammed Trump’s attacks against Harris as “whining” and urged the campaign to focus on the liberal policies that Harris has endorsed and times pivoted away from. When asked about Haley’s comments, Trump appeared agreeable to his former primary rival joining him on the campaign trail. “Sure,” Trump said when asked about Haley as a campaign surrogate. “I think that we’ve done very well. I think that we’re hitting a nerve. I think this is a different kind of a race. All we have to do is define our opponent as being a communist or a socialist or somebody that’s going to destroy our country.” The former president then segued into discussing how he defeated the South Carolina lawmaker in her home state during the primary season. “I beat her in her own state by legendary numbers, and I get along with her fine. I appreciate that she endorsed me and all of that,” he said. “I think, relatively to what they’re doing and how radical they are and how, in many ways how sick they are. I think I’m doing a very calm campaign.” CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Trump has spent several campaign events attacking Harris but also engaging in rambling moments that diluted the impact of his criticisms. “I’m a very calm person, believe it or not. If I wasn’t, probably wouldn’t be around anymore you know,” he emphasized. But ultimately, while Trump appreciated Haley’s advice, he said, “I have to do it my way.”","summary":"Former President Donald Trump&#8216;s press conference at his Bedminster golf club&#160;in New Jersey featured a roughly 46-minute monologue with frequent attacks against Vice President Kamala Harris while repeating key topics from the campaign stump. This is Trump&#8217;s second press conference in about a week as he aims to pressure Harris into sitting down for a [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3123391/top-five-takeaways-trump-press-conference-bedminster/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/AP24228751858841.webp","video":null,"publish_date":"2024-08-15 23:31:13","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","catgory":"sports","source_country":"US","sentiment":-0.024},{"id":254216352,"title":"3 vulnerable Senate Democrats to skip DNC","text":"Washington — Three vulnerable Senate Democrats plan to skip next week's Democratic National Convention in Chicago, where members of their party will gather to celebrate Vice President Kamala Harris as the nominee. Sens. Jon Tester of Montana, Jacky Rosen of Nevada and Sherrod Brown of Ohio will be absent as Democrats convene for the four-day event, sources familiar with the matter told CBS News.All three are in tight races that could determine control of the Senate. Tester is the only one of the bunch who has not endorsed Harris' presidential bid. Tester and Brown, who both called on President Biden to withdraw from the race, represent states that Trump won in 2016 and 2020. Trump lost to Mr. Biden in Nevada, a battleground state, by less than 3 percentage points in 2020. Though Rosen is skipping the convention, she campaigned with Harris and her running mate, Minnesota Gov. Tim Walz, last week in Las Vegas. Axios was first to report the senators' convention plans.","summary":"Sens. Jon Tester of Montana, Jacky Rosen of Nevada and Sherrod Brown of Ohio will be absent as Democrats celebrate Kamala Harris' nomination.","url":"https://www.cbsnews.com/news/senate-democrats-skip-dnc/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/15/62a17270-462a-4750-b345-0b956d18e4fe/thumbnail/1200x630/5a8dd63632295b8c0caae0b0b2267250/gettyimages-1449402028.jpg?v=d8f7565ef3e8b72561ee316b5993cbf9","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3121965_hls/master.m3u8","publish_date":"2024-08-15 23:30:49","author":"Caitlin Yilek,Cristina Corujo","authors":["Caitlin Yilek","Cristina Corujo"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.527},{"id":254216852,"title":"Trump tries to make 'Kamala Crash' a thing, but stocks keep rallying","text":"For one nervous minute, it looked as if the stock market was in for a serious correction. The Dow Jones Industrial Average dropped over 1,000 points in a day, investors around the world were shouting “sell,” and Donald Trump was very, very happy. The Republican presidential nominee was gloating because just one week into Democratic nominee Kamala Harris’ surging campaign, the idea that he might be able to run during a real economic downturn, rather than the wishful doom and gloom he sells at his rallies, seemed like an unexpected reprieve. Trump took to his failing social media platform to pound out a series of messages blaming the downturn on his political opponent. In his standard all-caps shout, Trump declared that “VOTERS HAVE A CHOICE—TRUMP PROSPERITY, OR THE KAMALA CRASH & GREAT DEPRESSION OF 2024…” Just one day later, Trump was silent as markets began a swift recovery. As of Thursday, stocks were enjoying an extended rally that put the Dow at over 40,500. The reality: There is no looming depression—and the economy is looking great. Since that market blip, a great inflation report has made it seem more likely that the Federal Reserve Bank will cut interest rates at its next meeting. There was more good news on Thursday as the retail sales report showed that consumers are purchasing as if there are few economic concerns. Bank of America’s CEO told CBS’ “Face the Nation” that recession is no longer in the cards, according to the financial institution’s research team. The result is not just that sharp rise in the Dow, but a six-day rally of the S&P and NASDAQ stock indexes that has completely erased earlier losses. While Trump has repeatedly proven that he absolutely sucks at predicting the market, the markets are absolutely perfect at predicting Trump. When the markets are up, Trump will claim credit. When they’re down, he’ll spread blame on Democrats. In 2020, Trump predicted that the stock market would crash if Joe Biden was elected. That was before he began claiming credit for stock increases under Biden, even laughably insisting that stocks were rising only because Trump was ahead in the polls. Now Trump is making the same “if you don’t elect me” threats that he made last time. But the market has gone up by 30% since Trump left office. Under Biden, a record number of Americans have become 401(k) millionaires as those rising markets have buoyed their retirement accounts. Trump’s market predictions are one of his biggest and most obvious lies. But Trump was still screaming about the \"Kamala Crash\" in his unhinged speech on Wednesday evening, even as the market was heading back to near-record territory. Trump seems confused—and not just about the stock market.","summary":"For one nervous minute, it looked as if the stock market was in for a serious correction. The Dow Jones Industrial Average dropped over 1,000 points in a day, investors around the world were shouting “sell,” and Donald Trump was very, very happy.\n\n\n\nThe Republican presidential nominee was gloating because just one week into Democratic nominee Kamala Harris’ surging campaign, the idea that he might be able to run during a real economic downturn, rather than the wishful doom and gloom he sells at his rallies, seemed like an unexpected reprieve. Trump took to his failing social media platform to pound out a series of messages blaming the downturn on his political opponent.\n\n\n\nIn his standard all-caps shout, Trump declared that “VOTERS HAVE A CHOICE—TRUMP PROSPERITY, OR THE KAMALA CRASH &amp; GREAT DEPRESSION OF 2024…”\n\n\n\nJust one day later, Trump was silent as markets began a swift recovery. As of Thursday, stocks were enjoying an extended rally that put the Dow at over 40,500. The reality: There is no looming d","url":"https://www.dailykos.com/story/2024/8/15/2263491/-Trump-tries-to-make-Kamala-Crash-a-thing-but-stocks-keep-rallying?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1334685/story_image/GettyImages-2165424403.jpg?1723757880","video":null,"publish_date":"2024-08-15 23:30:19","author":"Mark Sumner","authors":["Mark Sumner"],"language":"en","source_country":"US","sentiment":-0.299},{"id":254216682,"title":"Harris' or Harris's? Apostrophe battle brewing among grammar geeks","text":"Whatever possessed vice-president Kamala Harris to pick Minnesota governor Tim Walz as her running mate, it probably wasn't a desire to inflame arguments about apostrophes. But it doesn't take much to get grammar nerds fired up. \"The lower the stakes, the bigger the fight,\" said Ron Woloshun, a creative director and digital marketer in California who jumped into the fray on social media less than an hour after Harris selected Walz last week to offer his take on possessive proper nouns. The Associated Press Stylebook says \"use only an apostrophe\" for singular proper names ending in S: Dickens' novels, Hercules' labours, Jesus' life. But not everyone agrees.Debate about possessive proper names ending in S started soon after Prez Joe Biden cleared the way for Harris to run last month. Is it Harris' or Harris's? But the selection of Walz with his sounds-like-an-s surname really ramped it up, said Benjamin Dreyer, the retired copy chief at Random House and author of \"Dreyer's English: An Utterly Correct Guide to Clarity and Style\". Dreyer was inundated with questions within minutes of the announcement, which came while he was at the dentist. \"I was like, 'All right, everybody just has to chill.'\"While there is widespread agreement that Walz's is correct, confusion persists about Harris' vs. Harris's. Dreyer's verdict? Add the 's. \"To set the 's is just simpler, and then you can take your valuable brain cells and apply them to more important things,\" he said.Woloshun chimed in with a similar opinion on X, where apostrophes are being thrown around like hand grenades. \"The rule is simple: If you say the S, spell the S,\" he argued. That puts them on the same side as New York Times, Washington Post and The Wall Street Journal - and at odds with AP. While AP style has evolved on many fronts over the years, there are no immediate plans to change the guidance on possessives, said Amanda Barrett, AP's vice-president for news standards and inclusion. \"This is a longstanding policy for the AP. It has served us well, and we've not seen any real need to change,\" she said. \"We do know that the conversation is out there and people make different choices, and that's all fine. \"Merriam-Webster, the oldest dictionary publisher in America, splits the difference: For names ending in an S or Z sound, you can add 's or just an apostrophe, though the dictionary says 's is the more common choice. Timothy Pulju, a senior lecturer in linguistics at Dartmouth College, said that until the 17th or 18th century, the possessive of proper names ending in S - such as Jesus or Moses - often was simply the name itself with no apostrophe or additional S. Eventually, the apostrophe was added (Jesus' or Moses') to denote possession, though the pronunciation remained the same. \"That became kind of the standard that I was taught and adhere to, even though in retrospect, I don't think it's a great standard,\" he said. That's because linguists view writing as a representation of speech, and speech has changed since then. Pulju said he expects the 's form to become dominant eventually. But for now, he - agreeing with Merriam-Webster - says either way is acceptable. \"As long as people are communicating successfully,\" he said. \"They're not getting confused about whose running mate Tim Walz is.\"If she wins in Nov, Harris would become the fourth US prez with a last name ending in S and the first since Rutherford B Hayes, who was elected in 1876 - 130 years before the founding of Twitter - and was spared the social media frenzy over apostrophes. Harris is the first nominee with such a tricky last name since 1988, when Democrat Michael Dukakis lost to George H W Bush. Dukakis, now 90, said in a phone interview Monday that he doesn't recall any similar discussion when he was the nominee. But he agrees with the AP. \"It sounds to me like it would be s, apostrophe, and that's it,\" he said.The Harris campaign, meanwhile, has yet to take a clear stand. A press release on Monday by her New Hampshire team touted \"Harris's positive vision\", a day after her national press office wrote about \"Harris' seventh trip to Nevada.\"","summary":"The selection of Tim Walz as Kamala Harris' running mate ignited a debate on possessive proper nouns ending in 'S'. Discussions arose over whether it should be 'Harris'' or 'Harris's'. Different style guides offer varying rules. Linguists like Timothy Pulju foresee 'Harris's' becoming the dominant form, although current usage varies.","url":"https://timesofindia.indiatimes.com/world/us/harris-or-harriss-apostrophe-battle-brewing-among-grammar-geeks/articleshow/112553975.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112553989/112553989.jpg","video":null,"publish_date":"2024-08-15 23:26:54","author":null,"language":"en","source_country":"in","sentiment":0.075},{"id":254216266,"title":"Trump Warns That if Kamala Harris Wins, ‘Everybody Gets Health Care’","text":"It’s a distant memory now, but Donald Trump publicly supported single-payer health care. Vice President Kamala Harris did, too. Neither candidate backs the idea now. This easily accessible history didn’t stop Trump from attacking Harris on Thursday as if she still supports single-payer — with the former president arguing that it would be bad to do so. During a rambling press conference at his golf club in Bedminster, New Jersey, Trump said of Harris: “She cosponsored legislation to abolish very popular private health insurance, which 150 [million] Americans rely on, dumping everyone onto inferior socialist government run health care systems with rationing and deadly wait times, while massively raising your taxes. She wants to take away your private health care.” “It’s the best health care in the world,” he continued, adding: “You’re all going to be thrown into a communist system … You’re going to be thrown into a system where everybody gets health care.” None of this is true. Harris did previously support eliminating private health insurance in favor of enacting “Medicare for All,” or a universal health insurance program. She has since backed away from this idea. While Harris has not offered her health care plan yet, her spokesperson recently told NBC News, “The VP will not push single payer as president.” The United States’ health care system is exceptional, but not because it provides the best care in the world. Americans pay far more for health care than residents of other high-income countries — like Canada, the United Kingdom, France, Germany, Japan, South Korea, and Australia — and experience the worst health outcomes. Our life expectancy is lower; infant, maternal, and avoidable deaths are all higher. While taxes would increase under a Medicare for All-style system, studies show Americans would save money in the aggregate. Today, more than 8 percent of Americans are uninsured, and tens of millions are underinsured, meaning they have insurance but cannot afford to access the health services they need. On a financial level, forgoing medical care ultimately creates larger health expenses. Insurers also regularly deny patients’ care, because it helps pad their profits. Trump claimed Thursday that, if the U.S. were to have a universal health care system, “You wait for your doctor, like 10 months, 12 months, 11 months, you gotta see some of these plans, how they work in other countries, it’s disgraceful.” Wait times in the U.S. are already long — not the absolute worst among wealthy countries, but poor nonetheless. Trump reiterated at the end of his health care rant that Harris “could change” her position. “She’s changed on everything,” he said. So has Trump. Years ago, he was a full-blown proponent of single-payer health care. “If you can’t take care of your sick in the country, forget it, it’s all over. I mean, it’s no good. So I’m very liberal when it comes to health care,” Trump told Larry King in 1999. “I believe in universal health care. I believe in whatever it takes to make people well and better.” He added that health care should be considered “an entitlement.” In his 2000 book, The America We Deserve, Trump wrote that America should “reexamine the single-payer plan, as many individual states are doing.” He wrote favorably about the Canadian single-payer system: “Administrative costs across America make up 25 percent of the health care dollar, which is two-and-a-half times the cost of health care administration in Canada. Doctors might be paid less than they are now, as is the case in Canada, but they would be able to treat more patients because of the reduction in their paperwork. The Canadian plan also helps Canadians live longer and healthier than Americans.” Trump did not support a single-payer health care system during his 2016 campaign, but he still defended the idea in a Republican debate. “As far as single payer, it works in Canada,” he said. “It works incredibly well in Scotland. It could have worked in a different age.”","summary":"Donald Trump repeatedly lies about single-payer health care — an idea he and Harris both previously supported but no longer do","url":"https://www.rollingstone.com/politics/politics-news/trump-kamala-harris-wins-everybody-gets-health-care-1235081328/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/trump-harris-healthcare.jpg","video":null,"publish_date":"2024-08-15 23:22:50","author":"Andrew Perez,Charisma Madarang","authors":["Andrew Perez","Charisma Madarang"],"language":"en","source_country":"us","sentiment":-0.125},{"id":254217510,"title":"Trump says he's 'entitled' to make personal attacks on Harris, citing lack of respect","text":"At a news conference Thursday afternoon at his Bedminster golf club in New Jersey -- his second in a week - former President Donald Trump said he's \"entitled\" to insult his Democratic opponent -- Vice President Kamala Harris -- because he doesn't respect her. \"I think I am entitled to personal attacks. I do not have a lot of respect for her. I don't have a lot of respect for her intelligence, and I think she'll be a terrible president. And I think it is very important that we win. And whether the personal attacks are good, bad – I mean, she certainly attacks me personally. She actually called me weird. 'He's weird,'\" he said. \"She's not -- she's not smart. I don't believe she loves our country,\" he added. \"Some people say, 'Oh, why don't you be nice?' But they're not nice to me. They want to put me in prison,\" Trump complained. \"They don't want me to be a little bit nasty. They want to put me in prison. Me!\" Asked about how his personal attacks on Harris could affect his standing with suburban women, moderates, and independents, Trump doubled down, saying he's running \"a very calm campaign.\" \"No, I think that, I think relatively to what they're doing and how radical they are and how, in many ways, how sick they are, I think I'm doing a very calm campaign. I mean, we're here. There's no shouting.\" Trump began by highlighting inflation and hitting Harris on the cost of grocery prices as he stood between two tables full of food store items such as cereal, deli meat, milk, eggs, baby formula and bread with a sign saying, \"Price Increases since Kamala Harris took office.\" \"Harris has just declared that tackling inflation will be a Day 1 priority for her. It's going to be Day 1. But Day 1, really, for Kamala was three and a half years ago. Where has she been?\" Trump said. He ticked off a long list of what he said were higher costs for a variety of common grocery items but offered no sourcing for his claims, other than saying the numbers came from \"the government.\" Inflation peaked at 9.1% during the Biden-Harris administration but since cooled to 2.9% in July compared to a year ago --- the lowest inflation reading since March 2021. He eventually veered off into talking about immigration, energy and other favorite topics, making numerous false claims and speaking for 45 minutes before taking any questions. Thursday's news conference follows one that Trump held at his Mar-a-Lago estate last Thursday, fielding questions for more than an hour on a range of topics including his recent attacks on Harris, immigration and reproductive rights. During that long and, at times, rambling exchange with reporters, Trump often pushed false claims on several topics, including the outcome of the 2020 election and size of the crowd at his Jan. 6, 2021, rally before the attacks on the U.S. Capitol by a pro-Trump mob. \"She refuses to do any interviews or press conferences, almost 30 days now, she has not done an interview,\" Trump said of Harris on Wednesday in North Carolina. \"You know why she hasn't done an interview? Because she's not smart. She's not intelligent,\" he said. His campaign says she's trying to \"duck and hide\" from the news media. Trump's recent news conferences appear to be part of the campaign's attempt to draw a contrast between the two candidates. On Thursday, ABC News' Rachel Scott asked him about comments he made to Tesla CEO and X owner Elon Musk earlier in the week about striking workers, saying, \"they go on strike, and you go, 'You're all gone.'\" \"Are you really comfortable with companies threatening to fire workers who go on strike?\" Scott asked. \"No, I want companies to get workers that are going to love them and work for a wage that lets the company make a profit so they can go and expand,\" Trump said. Trump argued that his comments praising Musk for being the \"greatest cutter\" was not comparable to assertions he was advocating for companies to threaten to fire workers who go on strike -- and then went on to repeat rhetoric that undocumented immigrants are threatening union workers and Black and Hispanic communities. The Harris campaign has been using Trump's news conferences to highlight flubs he has made and criticize policies he advocates. \"Trump did the only thing he knows how to do -- he went out and lied, made up stories, mixed up dates, attacked the media, and, overall, reminded Americans that he is a deeply unwell man,\" the Harris campaign said in a statement reacting to Trump's previous news conference. During her time out on the campaign trail since announcing her White House bid, Harris has held a few exchanges with reporters aboard Air Force Two and answered a few shouted questions; however, her campaign says she will participate in a sit-down interview before the end of the month. \"We will commit to directly engage with the voters that are actually gonna decide this election and that is gonna be complete with rallies, with sit-down interviews, with press conferences, with all the digital assets we have at our disposal,\" Michael Tyler, communications director for the Harris-Walz campaign, said on CNN Wednesday when pressed multiple times to commit to press conferences and media interviews.","summary":"\"She's not smart. I don't believe she loves our country,\" he said.","url":"https://abcnews.go.com/Politics/trump-hold-press-conference-campaign-criticizes-harris-limited/story?id=112837924","image":"https://i.abcnewsfe.com/a/e2076cf0-c04e-43d7-bcdf-21267fae6d06/trump-presser-rt-jt-240815_1723760334291_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2024-08-15 23:20:09","author":"Kelsey Walsh,Lalee Ibssa","authors":["Kelsey Walsh","Lalee Ibssa"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.227},{"id":254216622,"title":"Trump says he's 'entitled' to attack Kamala despite warnings from allies: Donald lists everything he's angry about as he uses tables of Cheerios and Wonder Bread to say her policies will turn US into Venezuela","text":"Trump says he's 'entitled' to attack Kamala despite warnings from allies: Donald lists everything he's angry about as he uses tables of Cheerios and Wonder Bread to say her policies will turn US into Venezuela READ MORE: Follow all the day's latest developments at our politics live blog By Rob Crilly, Chief U.S. Political Correspondent For Dailymail.Com At Bedminster, New Jersey Published: 00:15 BST, 16 August 2024 | Updated: 00:47 BST, 16 August 2024 e-mail 4 View comments Former president Donald Trump promised to keep up the personal attacks on Kamala Harris on Thursday evening, saying that he had plenty to be angry about during a rambling press conference delivered on the steps of his New Jersey golf course. Behind him aides had arranged boxes of Cheerios, tubs of instant coffee and packets of Wonder Bread. The point was to illustrate how prices had risen under the Biden-Harris administration. But the event had also been designed as a chance to paint a picture of his new opponent as a dangerous leftist intent on destroying the country. And he said he would pay no heed to allies who warn him that negative attacks turn off wavering voters. Donald Trump addressed the media at his Bedminster golf club on Thursday. He was surrounded by grocery items designed to show how prices had risen under Kamala Harris Read More EXCLUSIVE Trump STILL leads Harris says Daily Mail poll - as voters reveal biggest hesitation about Kamala... 'I'm very angry at her because of what she's done to the country,' he told an decidedly unconventional press conference at his Bedminster golf club. 'I'm very angry at her that she would weaponize the justice system against me and other people, very angry at her. 'I think I'm entitled to personal attacks.' There is never anything normal about a Trump press conference. And this was far from normal, from the moment he walked down the three steps from his clubhouse accompanied by whoops from supporters to the moment he finished taking questions in order to sign caps. His campaign has been in the doldrums since Harris replaced Joe Biden, depriving Trump of a frail, fragile 81-year-old target. Confidants said Thursday's press conference was long scheduled, along with the launch of 'Jewish Voices for Trump' afterwards. The whole point was to begin the business of defining Harris for the chunk of the population that don't know her well. Yet it also had the air of a live-streamed pick-me-up, giving Trump the chance to set aside recent travails and revel in a typically freewheeling speech (almost an hour and 10 minutes) before sparring with journalists for almost as long. He stuck close to his script at times, reeling off inflation statistics. 'Electricity prices are up 32 percent,' he said. 'Gasoline prices are up 50 percent and going higher. Meanwhile, real incomes are down by over $2,000 a year.' Republican presidential nominee former President Donald Trump after a news conference at Trump National Golf Club Trump had a spring in his step as he spoke for about 47 minutes before taking questions from journalists, some friendly and some hostile At times his supporters, corralled by the side of the live cameras, whooped and cheered. They arrived as if it was just another cocktail-hour mingle on the Bedminster scene. Staff whisked them around on golf buggies. Full-lipped ladies in party frocks rubbed shoulders with polo-shirted golfers and a Greek Orthodox priest whose gold chain outgleamed anything worn by the women. The ninth hole on the old course provided a backdrop to the whole surreal scene, and (at least in the eyes of his supporters) did nothing to undermine Trump's positioning as a man of the people. His plan, he said, was simple. He would open up gas and oil production ('We will drill, baby, drill' in his words), driving energy prices down and bringing with them the cost of the weekly shop. He offered no numbers to support the scheme. Trump positioned himself as a champion of working people as he went about defining Kamala Harris as a vice president who presided over rising prices Republican presidential candidate, former U.S. President Donald Trump holds a news conference outside the Trump National Golf Club Bedminster on August 15, 2024 in Bedminster, New Jersey In contrast, he described Harris's effort to go after 'price-gouging' corporations as 'communist price controls.' 'If they worked, I'd go along with it too,' he said. 'But they don't work. They actually have the exact opposite impact and effect. It leads to food shortages, rationing, hunger, dramatically more inflation.' He said she was bent on turning the U.S. into a northern Venezuela. It was the latest event held to illustrate how Trump is prepared to meet the media head on, in contrast to Harris who has yet to sit down for an interview since becoming the Democratic candidate. Trump reels off the prices of various goods during his press conference And it came as Trump tries to regain the initiative after three weeks of surging donations and enthusiasm for Harris. This week the Trump campaign shook up its top staff. It brought back Corey Lewandowski, who was Trump's first campaign manager back in 2015, as well as Tim Murtagh from his 2020 campaign, two figures from the MAGA Inc super PAC, and others. Lewandowski, Taylor Budowich, a former Trump spokesman, Alex Pfeiffer, who was a producer for Tucker Carlson at Fox News before joining the super PAC, online campaigner Alex Bruesewitz and Tim Murtaugh will all advise senior campaign officials. Trump has often proven impatient with staff when his numbers stutter. This week a DailyMail.com/J.L. Partners poll found that Harris's entry into the race left him clinging to a two-point lead. Other polls were even less kind, showing him trailing his new rival. J.L. Partners polled 1001 likely voters from Aug 7 to 11, using a mix of online, landline, cell phone and in-app techniques. The results come with a margin of error of +/- 3.1 points Against that backdrop he has stepped up his appearances in front of the media, and on Monday held a two-hour online conversation with X owner Elon Musk. But he has struggled to stay on message. An address in North Carolina on Wednesday, that was billed as a big economic set piece, included a list of his usual grievances and claims that California was now 'unliveable.' Trump shrugged off the data as the sun dropped over Bedminster. 'I tend to poll low,' he said, reminiscing about how he shocked the world with his unexpected 2016 election win. And he said the shake-up was not a sign of failing campaign. 'It's a sign that we want to close it out,' he said. Every now and again, he admitted, his eye was drawn to the display of groceries. With the maple ham in plastic packaging sweating beside tubs of mayonnaise and Oreos, it was like a 1950s nostalgia trip. 'I haven't seen Cheerios in a long time,' said Trump in between describing his vote haul in the 2020 election. 'I'm going to take them back to my cottage.' PoliticsDonald TrumpNew JerseyKamala Harris Share or comment on this article: Trump says he's 'entitled' to attack Kamala despite warnings from allies: Donald lists everything he's angry about as he uses tables of Cheerios and Wonder Bread to say her policies will turn US into Venezuela e-mail Add comment","summary":"Former Donald Trump promised to keep up the personal attacks on Kamala Harris during a rambling press conference delivered on the steps of his New Jersey golf course on Thursday","url":"https://www.dailymail.co.uk/news/article-13747871/donald-trump-press-conference-kamala-bedminster.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/08/16/00/88579321-0-image-a-15_1723763632111.jpg","video":null,"publish_date":"2024-08-15 23:16:37","author":"Editor,Rob Crilly","authors":["Editor","Rob Crilly"],"language":"en","catgory":"politics","source_country":"GB","sentiment":-0.34},{"id":254215868,"title":"Trump Says He Is ‘Entitled To Personal Attacks’ Against Harris Despite Republican Calls To Cease Insults","text":"Share to Facebook Share to Twitter Share to Linkedin Topline Former President Donald Trump doubled down on his personal attacks against Vice President Kamala Harris, saying in a Thursday press conference he thinks he is “entitled to personal attacks” following calls from Republicans allies for him to quit the insults in favor of a revamped focus on policy ahead of November. Trump spoke to reporters in a press conference Thursday. (Photo by Michael M. Santiago/Getty ... [+] Images) Getty Images Key Facts A reporter asked whether Trump agreed with calls to stop the personal attacks, to which Trump suggested he has levied insults at Harris because he is angry at her “because of what she’s done to the country.” “I don’t have a lot of respect for her,” Trump said, noting Harris’ recent comments calling him and his running mate, Ohio Sen. JD Vance, “weird.” Trump lobbed the same insult at Harris’ policies, calling them weird and propping up his own policies regarding the border and taxes. Trump’s comments come after figures such as former Trump White House aide Peter Navarro and former Republican candidate Vivek Ramaswamy have called for the former president to focus on policy instead of trading blows with Harris, with Navarro arguing in a podcast appearance this week that personal attacks hurt Trump among swing voters. Former House Speaker Kevin McCarthy, R-Calif., told Fox News this week he believes Trump has to, “Stop questioning the size of her crowds and start questioning her positions.” Get Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here. Key Background Trump’s personal attacks on Harris have revolved around her intelligence, laugh and race, as the former president suggested earlier this month she cannot be Black because of her acknowledgment of her Indian heritage. Trump received bipartisan scrutiny over his comment, which he defended in a Truth Social post calling Harris a “phony” and “not black” alongside a video of Harris and Indian American actress Mindy Kaling cooking Indian food. Harris is leading Trump in several polls by two to five points, including ones taken by Monmouth University, Economist/YouGov and Reuters/Ipsos, and is ahead of the former president by one point in a national-head-to-head contest, according to RealClearPolitics’ polling average, though Trump led Harris by one point in a recent Fox News poll. Further Reading Trump Pushes Back On 'Weird' Label From Kamala Harris And Tim Walz At Bozeman, Montana, Rally (Forbes) Why Harris and Democrats keep calling Trump and Vance ‘weird’ (AP) Follow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IV Following Editorial Standards Print Reprints & Permissions","summary":"Trump told reporters he did not have a lot of respect for Vice President Kamala Harris or her intelligence while defending personal attacks against her.","url":"https://www.forbes.com/sites/antoniopequenoiv/2024/08/15/trump-says-he-is-entitled-to-personal-attacks-against-harris-despite-republican-calls-to-cease-insults/","image":"https://imageio.forbes.com/specials-images/imageserve/66be8b796d604abc8f681295/0x0.jpg?format=jpg&crop=4103,2738,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-15 23:14:27","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.293},{"id":254215678,"title":"Trump would improve education for all kids, while Harris holds them hostage","text":"The difference between Donald Trump and Kamala Harris in November could not be clearer when it comes to education. Trump believes parents are the primary decision-makers for their children and supports the money following the child to the school that best meets their needs and aligns with their family’s values. In a May Truth Social post, President Trump said, “School Choice is the CIVIL RIGHTS ISSUE of our time, and parents must have a voice in their child’s education! When I am your President again, I will protect Parental Rights, support Teachers, and expand Educational Freedom for all American Families!” At a June campaign rally in Philadelphia, President Trump said, “I will support universal school choice. It’s such a big thing.” Red states are already unleashing education freedom. When teachers unions fought to keep the public schools closed for so long starting in 2020, parents were able to see what was happening in the classroom through “remote learning” and they were not happy about schools focusing more on far-Left indoctrination than education. We’ve seen more advancement on school choice in the past three years than in the preceding three decades. Twelve states have passed universal school choice — meaning all families are eligible — since 2021. School choice is a rising tide that lifts all boats. Public schools up their game in response to competition because it gives them an incentive to cater to the needs of children and their families. In Florida, for example, 10 out of 11 rigorous studies on the topic find school choice improves outcomes in public schools. Florida’s results have improved substantially as they’ve expanded school choice, with the latest U.S. News and World Report ranking putting the Sunshine State at number one for education. They are also now at the top of the pack for student achievement as measured by the Nation’s Report Card after adjusting for differences in student demographics across states. Florida boasts these results despite spending 27% less per student than the national average. Kamala Harris is in lockstep with the teachers unions and thinks your kids belong to the government. A teacher at a Harris campaign rally in August said she originally wanted to get into teaching because she “saw education for what it really was: the greatest instrument of social justice in this country.” Call me crazy, but I thought education was supposed to be about education. Harris further demonstrated her allegiance to the teachers unions by speaking at the American Federation of Teachers convention in July, just a few days after Joe Biden dropped out of the race. At that event, Harris called their president, Randi Weingarten, “a force” and “an incredible friend and an adviser.” That relationship should be disqualifying. No one did more to hold children’s education hostage by fighting to keep schools closed during the COVID era than Randi Weingarten and the teachers unions. Weingarten’s union lobbied the CDC to keep schools closed, threatened strikes over reopening, and engaged in fearmongering every step of the way. In fact, the Chicago Teachers Union posted and later deleted a tweet in December 2020 ridiculously claiming that, “The push to reopen schools is rooted in sexism, racism and misogyny.” The problem is the Democratic Party is a wholly-owned subsidiary of the teachers unions. More than 99% of the campaign contributions from Weingarten’s union went to Democrats in the 2022 election cycle, and it has been that way for decades. The coziness explains why Kamala Harris skipped over Pennsylvania Gov. Josh Shapiro as her pick for Vice President. Shapiro seemed like the obvious choice as the governor of a swing state that she needs to win, but he has voiced support for school choice over the past few years. Instead, she picked Minnesota’s far-Left Gov. Tim Walz, who opposes school choice and has downplayed the harms of school closures. In a November 2022 interview, Walz said, “I don’t buy it” when questioned about school closures harming kids, and even said that children benefited from being locked out of the classroom. He said, “these kids learned resiliency, these kids learned compassion […] These kids learned problem solving.” No, sir, they only learned that union-controlled politicians don’t care about them. Harris and Walz apparently only have one solution, which is throwing more money at the problem. We’ve already tried that. New York City’s public schools are a bottomless money pit. They spend more than $35,000 per student per year. Are their public schools the best in the nation? Of course not. NYC’s charter schools outperform their traditional public schools despite spending 20% less per student. Meanwhile, Education spending has skyrocketed in Minnesota under Gov. Walz while the state’s math and reading proficiency has plummeted. We spend nearly $20,000 per student per year in K-12 public schools in the United States, much more than just about any other country in the world, and that amount has increased by 164% since 1970. Have our outcomes gotten 164% better? Of course not. It also degrades the United States’ standing on the world stage. Of 37 countries tested by the Organization for Economic Cooperation and Development, the US ranked a dismal 28th in math. It’s the definition of insanity: doing the same thing over and over again, expecting different results. The money doesn’t make its way to the classroom because the one-size-fits-all union-controlled government school system is a monopoly with no incentive to spend additional dollars wisely. Average teacher salaries have only increased 3% in real terms since 1970. We are spending plenty of money but it’s wasted on administrative bloat. In fact, school district administrative staff has increased 95% since 2000, whereas student enrollment has only increased by 5% since then. The government school system has become more of a jobs program for adults than an education initiative for kids. The only way out of this mess is to empower families with education freedom. Only then will the government school system have real incentives to cater to the needs of families as opposed to the other way around. Corey DeAngelis is a senior fellow at the American Federation for Children and a visiting fellow at Stanford University’s Hoover Institution. He is the author of “The Parent Revolution: Rescuing Your Kids from the Radicals Ruining Our Schools” (Center Street, 2024).","summary":"The difference between Donald Trump and Kamala Harris in November could not be clearer when it comes to education.","url":"https://nypost.com/2024/08/15/opinion/trump-would-improve-education-for-all-kids-while-harris-holds-them-hostage/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/education-hp.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-15 23:13:28","author":"Corey DeAngelis","authors":["Corey DeAngelis"],"language":"en","source_country":"us","sentiment":0.098},{"id":254215670,"title":"Trump blasts Kamala Harris’ high grocery prices, slams her economic agenda as ‘Maduro plan’","text":"Former President Donald Trump talked at length about the state of the economy on Thursday, slamming Vice President Kamala Harris’ soon-to-be-revealed economic agenda as a socialist plan that will continue Biden-Harris policies that have ravaged the cost of living. “We call it the ‘Maduro plan,’ like something straight out of Venezuela or the Soviet Union,” he said, referencing socialist Venezuelan president Nicolas Maduro. “[Harris’ new economic plan] is an admission that her economic policies have totally failed and caused really a catastrophe for our country, and beyond that, a catastrophe in the world.” Harris is expected to roll out her full plans for the economy in a speech on Friday. The 45th president hosted an almost 2-hour speech and press conference in Bedminster, New Jersey. The tables were filled with cans of food, meat, milk and cereal, highlighting how much groceries have skyrocketed since Harris became vice president. Trump said that meat, poultry and fish are up 23%, children’s food is up by 24.1%, baking goods by 27.2% and cereal and bakery goods have gone up 26% under the Biden-Harris administration. He predicted that an economic crash will happen if Harris is elected in November, blasted her for wanting to take away his tax cuts and claimed she wants to end private health care in favor of a “Communist system.” Trump noted that the economy was in better shape when he was in office, and asserted that Harris has a “Communist lean.” To solve the price problem, he offered one large solution: “drill baby drill.” “So when I win, I will immediately bring prices down, starting on day one. We will end Kamala’s war on American energy, and we will drill baby drill. We’re going to drill, baby drill that’s going to bring down prices of everything, because energy brought it up,” Trump went on. He also reiterated his vow to reduce energy prices in half and no taxes on tips or Social Security, which he said the economy would be able to make back through “growth.” “Within a 12 month period, we’ll be able to reduce prices between regulation and having a tremendous supply which we have,” he said of energy. The no taxes on Social Security is due to the rising inflation, he said, adding that he won’t raise the minimum age. To solve the housing crisis, Trump said he would open up some federal land to build more houses on to increase supply. “We’re going to open up tracks of federal land for housing construction. We desperately need housing for people who can’t afford what’s going on now, and when we open it up and we take off some of the restrictions and regulations.” It comes after Trump on Wednesday outlined his second-term vision to support the middle class, featuring his plans to slash energy prices in half, dramatically claw back taxes and beat back inflation. In the press conference that followed, Trump responded to questions about Republicans pushing him to focus on issues and not personal attacks against Harris, pointing out that she also attacks him and arguing he’s “entitled” to make them. He said, “I’m very angry at her that she’d weaponized the justice system against me and other people very angry at her.” “I think I’m entitled to personal attacks. I don’t have a lot of respect for her. I don’t have a lot of respect for her intelligence, and I think she’ll be a terrible president, and I think it’s very important that we win, and whether the personal attacks are good bad. I mean, she certainly attacks me personally.” Trump later said he thinks he’s running a “calm campaign” and that this race is different in terms of strategy and defining his opponent, since “all we have to do” is call them “a communist or a socialist or somebody that’s going to destroy the country.” He barely mention Minnesota Gov. Tim Walz, Harris’ running mate, but did criticize him for putting tampons in boys bathrooms in the state. The press conference was Trump’s second in two weeks as he continues to pan Harris for “hiding” and doing zero interviews since taking over for Biden.","summary":"Former President Donald Trump talked at length about the state of the economy on Thursday, slamming Vice President Kamala Harris&#8217; soon-to-be-revealed economic agenda as a socialist plan that will continue Biden-Harris policies that have ravaged the cost of living. &#8220;We call it the &#8216;Maduro plan,&#8217; like something straight out of Venezuela or the Soviet Union,&#8221;...","url":"https://nypost.com/2024/08/15/us-news/trump-blasts-kamala-harris-high-grocery-prices-and-maduro-plan-while-standing-in-front-of-cheerios-meat/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87826433.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-15 23:10:45","author":"Diana Glebova","authors":["Diana Glebova"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.06},{"id":254215680,"title":"Panthers, Jets get into scrap at joint training camp practice","text":"Another day, another joint training camp fight in the NFL. The New York Jets headed to Carolina to take the practice field with the Panthers, and as one would expect, things turned sour rather quickly. Several players had to be separated from one another during practice, and one Jets player came in on the blindside. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Safety D.J. Reed picked up a football from several yards away from the melee, ran back over to it and then launched it as hard as he could at the back of Panthers receiver Terrace Marshall Jr. According to the New York Post, Marshall had caught a touchdown over Reed, and after Reed had fallen to the ground after the play, Marshall tossed it toward him. The Jets were apparently not very pleased, which led to the skirmish. The Post also reported that Gang Green defensive lineman Micheal Clemons was throwing punches in another altercation. DESIGNER KRISTIN JUSZCZYK, WIFE OF 49ERS FULLBACK, SAYS SHE HAD TO SHUT DOWN REQUEST FROM KAMALA HARRIS In comparison to other training camp fights this year, this one was rather calm. The New York Giants and Detroit Lions were both fined $200,000 this month for their fair share of incidents. Their joint practices in New Jersey got so violent that the teams had no choice but to end their practices early. They then faced each other for each of their preseason openers. In a scrap with his own teammates, DK Metcalf was seen swinging a helmet against his fellow Seattle Seahawks. CLICK HERE TO GET THE FOX NEWS APP The Jets and Panthers face each other in a preseason game on Saturday night in Charlotte. Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"The New York Jets paid a trip to Carolina to have joint practices with the Panthers, and to almost nobody&apos;s surprise, tempers flared early on.","url":"https://www.foxnews.com/sports/panthers-jets-get-scrap-joint-training-camp-practice","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/panthers-stadium.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-15 23:10:27","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"us","sentiment":-0.044},{"id":254215472,"title":"The week in whoppers: ABC’s Jon Karl flips on Kamala Harris’ border role, Politico goes wild for the veep and more","text":"Diary of disturbing disinformation and dangerous delusions Spot the difference: “The president put Kamala Harris in playing a critical role in terms of trying to stop the flow of migrants across the border.” — ABC’s Jon Karl, 2023 vs. “You know she’s not actually, she wasn’t the border czar.” — Karl, Sunday We say: Now that Harris is the Democrats’ presidential nominee, Karl suddenly wants folks to think she had absolutely nothing to do with the disastrous Biden-Harris policies that illegally opened the door to 10 million illegal migrants. What a switch from a year ago, when he labeled her role on border policies “critical.” Karl’s not alone. The rest of the media has similarly raced to hide what was supposed to be Harris’ most important mission: the border. But hey, at least they’re admitting, in effect, the Biden-Harris policies were a disaster. Spot the difference: vs. We say: Hmm. When Donald Trump suggests not taxing tips, CBS focuses on the billions it’ll cost the nation. Yet when Kamala Harris touts the very same thing, she’s fighting for workers. Any doubt which candidate CBS favors? This headline: “Kamala Harris is defying the laws of the political universe” — Politico, Tuesday We say: Could Politico be any more effusive? We can just guess its next headline: Harris’ Superpowers Will Save the World. Give us a break! This claim: “The media’s double standard favors Donald Trump, not Kamala Harris” — New York magazine, Tuesday We say: New York magazine’s Jonathan Chait claims the media favors Trump, but it looks like ABC’s Jon Karl, CBS News and Politico (see above) — not to mention the rest of the national media — didn’t get the memo. Is there no limit to the left’s spins on reality? — Compiled by The Post Editorial Board","summary":"ABC's Jon Karl went from saying that Vice President Kamala Harris played a \"critical role\" with the migrant crisis to now claiming she was never a border czar.","url":"https://nypost.com/2024/08/15/opinion/the-week-in-whoppers-abcs-jon-karl-flips-on-kamala-harris-border-role-politico-goes-wild-for-the-veep-and-more/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/Whoppers-aug-15.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-15 23:04:33","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.407},{"id":254217318,"title":"What to know about Tim Walz's 1995 drunken driving arrest and how he responded","text":"CTVNews.ca Top Stories BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Man linked to four murders in Kirkland Lake, Ont., is dead, police say Ontario Provincial Police say Martyn Rosko, the main suspect in four homicides in Kirkland Lake, is dead. Want to move out of Canada? Experts explain everything you need to know If you're planning to leave Canada, there's a laundry list of things that need to be checked off. Experts explain all the steps you need to take before making the move. Colombian President Petro calls on Venezuela's Maduro to release detailed vote counts from election Colombian President Gustavo Petro on Wednesday called on his close ally, Venezuelan President Nicolas Maduro, to release detailed vote counts of the weekend election in which electoral authorities declared Maduro the winner. Starbucks sales tumble as customers reject high-priced coffee Fewer people are going to Starbucks and buying drinks and food, as last quarter was Starbucks' second straight with a sales decline. Vermont man evacuates neighbours during flooding, weeks after witnessing a driver get swept away Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains. Families seek answers after inmates' bodies returned without internal organs Six families whose loved ones died in Alabama prisons have filed lawsuits against the commissioner of the state's department of corrections, saying their family members' bodies were returned to them missing internal organs after undergoing state-ordered autopsies. Economy grew 0.2% in May, StatCan estimates 2.2% annualized growth in Q2 The Canadian economy continued to keep its head just above water in May, growing 0.2 per cent, led by expansions in manufacturing and the public sector. 'Severely hypothermic' sailor rescued after spending hours adrift off B.C. coast A sailboat captain was found alive but suffering from a severe case of hypothermia on Monday after spending up to five hours adrift in the ocean off British Columbia, according to the coast guard. Canada Murder-conspiracy trial tied to Coutts, Alta., COVID-19 blockade set to go to jury A jury is set to begin deliberating today the fate of two men accused of conspiring to kill police at the Coutts, Alta., blockade in 2022. Edmonton man sentenced to 5 years in prison in terrorism case in United Kingdom An Edmonton man has been sentenced to five years in prison after being convicted in the United Kingdom of being a member of a proscribed terrorist group. Man linked to four murders in Kirkland Lake, Ont., is dead, police say Ontario Provincial Police say Martyn Rosko, the main suspect in four homicides in Kirkland Lake, is dead. Convicted B.C. killer loses bid to have guitar in his prison cell A Federal Court judge has thrown out a convicted killer's challenge of a British Columbia prison warden's decision not to allow the inmate to have an electric guitar in his cell. Canadian civil liberties group fighting 'abuse' of notwithstanding clause in Sask. pronoun law The Canadian Civil Liberties Association (CCLA) says it’s intervening in a legal dispute over Saskatchewan’s controversial pronoun laws to prevent the “abuse” of the notwithstanding clause. Want to move out of Canada? Experts explain everything you need to know If you're planning to leave Canada, there's a laundry list of things that need to be checked off. Experts explain all the steps you need to take before making the move. World Two strikes on militant leaders risk inflaming a Middle East on edge The targeting of two senior militant leaders in two Middle Eastern capitals within hours of each other — with each strike blamed on Israel — risks rocking the region at a critical moment. Colombian President Petro calls on Venezuela's Maduro to release detailed vote counts from election Colombian President Gustavo Petro on Wednesday called on his close ally, Venezuelan President Nicolas Maduro, to release detailed vote counts of the weekend election in which electoral authorities declared Maduro the winner. About 8 in 10 Democrats are satisfied with Harris in stark shift after Biden drops out: AP-NORC poll U.S. Vice President Kamala Harris appears to have energized Democrats in the early days of her candidacy, with the surge in warm feelings extending across multiple groups, including some key Democratic constituencies that had been especially tepid about U.S. President Joe Biden, a new poll shows. U.K. leader accuses far right of hijacking a town's grief after killing of 3 children sparks violence Residents swept up broken bricks, shattered glass and burnt plastic on Wednesday after far-right protesters clashed with police outside a mosque in a northwest England town where three girls were fatally stabbed. Vermont man evacuates neighbours during flooding, weeks after witnessing a driver get swept away Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains. UN report says Palestinians detained by Israeli authorities since Oct. 7 faced torture, mistreatment The UN human rights office issued a report Wednesday saying Palestinians detained by Israeli authorities since the Oct. 7 attacks faced waterboarding, sleep deprivation, electric shocks, the release of dogs, and other forms of torture and mistreatment. Politics 'Sellout Singh': Conservatives take aim at NDP in new attack ad ahead of byelections The federal Conservatives are shifting their focus from the governing Liberals to take aim at the NDP in a new attack ad. Intelligence task force to monitor all future byelections for foreign interference The Liberal government says measures to monitor and assess foreign interference threats will be part of all future federal byelections, not just general elections. Conservative MP Karen Vecchio not seeking re-election, will finish out term Ontario Conservative MP Karen Vecchio says she will not be seeking re-election. Health 'Incredibly disappointing': Ontario halts wastewater testing for COVID, other viruses Ontario is officially ending its COVID-19 wastewater surveillance program today in a move some public health experts call shortsighted. Common mental health disorder may triple risk for developing dementia, study finds As if people with anxiety don’t have enough to worry about, a new study is adding to that list — suggesting the disorder may nearly triple the risk of developing dementia years later. More Listeria infections reported amid outbreak linked to plant-based milk recall The Public Health Agency of Canada is reporting six additional cases of listeriosis linked to a national recall of plant-based milk beverages. Sci-Tech Microsoft appears to have resolved Azure network problems Microsoft appears to have resolved the issues with its Azure network infrastructure that impacted users around the world on Tuesday. Meta agrees to US$1.4B settlement with Texas in privacy lawsuit over facial recognition Meta has agreed to a US$1.4 billion settlement with Texas in a privacy lawsuit over allegations that the tech giant used biometric data of users without their permission, officials said Tuesday. Animals, like those in Jasper, know how to dodge wildfires, say biologists Parks Canada wants everyone to know that despite the wildfire scorching Jasper National Park, Bear 222 is OK. Entertainment Washington, D.C., sues StubHub, saying the resale platform inflates ticket prices with deceptive fees The attorney general for Washington, D.C., sued StubHub on Wednesday, accusing the ticket resale platform of advertising deceptively low prices and then ramping up prices with extra fees. R. Kelly petitions U.S. Supreme Court to overturn sex crimes convictions based on statute of limitations R. Kelly – who is currently serving a more than a 30-year prison sentence in North Carolina – is asking the U.S. Supreme Court to hear an appeal of his federal sex crimes convictions. Ojibwe language version of Star Wars to hit Winnipeg theatres Star Wars: A New Hope is rocketing back into theatres – in a completely new way. Business Boeing names new CEO as it posts a loss of more than US$1.4 billion in second quarter Boeing lost more than US$1.4 billion in the second quarter and said a longtime industry executive will take over as chief executive of the troubled aircraft manufacturer next week. Jasper's fire-affected small businesses face rocky road ahead After labouring for months to bring one of Jasper's newest business concepts to life, the owners of The Peacock Cork & Fork never dreamed the young restaurant's run would be so short-lived. Economy grew 0.2% in May, StatCan estimates 2.2% annualized growth in Q2 The Canadian economy continued to keep its head just above water in May, growing 0.2 per cent, led by expansions in manufacturing and the public sector. Lifestyle 9 tips from decor experts for a comfortable and functional dorm room How do you turn one room into a work, sleep and hangout space? Manitoba golfers set unofficial record of 333 holes of golf in 12 hours, all for a good cause One golf course, two men, 12 hours and 333 holes of golf played. That's how the 13th annual Marathon Monday shaped up for Patrick Law and Dylan Thornborough, which ended up being an unofficial world record. An Italian Olympic athlete lost his wedding ring at the opening ceremony. Here's his heartfelt apology to his wife An Italian athlete made a public and heartfelt apology to his wife after losing his wedding ring at the Paris Olympics opening ceremony. Sports BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Canada's Caeli McKay and Kate Miller 4th in women's synchronized diving Canadian divers Caeli McKay and Kate Miller have finished in fourth in women's 10-metre synchronized platform at the Paris Olympics. Manitoba golfers set unofficial record of 333 holes of golf in 12 hours, all for a good cause One golf course, two men, 12 hours and 333 holes of golf played. That's how the 13th annual Marathon Monday shaped up for Patrick Law and Dylan Thornborough, which ended up being an unofficial world record. Autos Toyota acknowledges more certification cheating and apologizes Toyota reported Wednesday more cases of cheating on certification tests for new models required by the Japanese government, on top of those acknowledged earlier. Tesla in Seattle-area crash that killed motorcyclist was using self-driving system, authorities say Authorities in Washington have determined that a Tesla that hit and killed a motorcyclist near Seattle in April was operating on the company's 'Full Self Driving' system at the time of the crash. How a weather event in the U.S. can hurt western Canada's drivers at the pumps Drivers in Saskatoon have been hit with unwelcome news as gas prices soared to $1.68 per litre this week. The increase is not limited to Saskatoon; drivers throughout western Canada have experienced similar hikes. Local Spotlight Manitoba golfers set unofficial record of 333 holes of golf in 12 hours, all for a good cause One golf course, two men, 12 hours and 333 holes of golf played. That's how the 13th annual Marathon Monday shaped up for Patrick Law and Dylan Thornborough, which ended up being an unofficial world record. Montreal-area woman shocked to find family rented her pool without her consent A woman who lives east of Montreal in Repentigny came home to a pool party on Sunday after a family of five had rented it on the Swimply app without the consent of the homeowner. CFL fan breaks world record for visiting all 9 stadiums in fastest time A CFL fan has unofficially broken the world record for watching CFL home games at all nine of Canada’s stadiums in the shortest amount of time. 'I've done it': Anne Murray reminisces about successful career as her hometown centre marks 35 years The Anne Murray Centre in Springhill, N.S., marked its 35th anniversary over the weekend drawing dozens to the event from around the globe. Montreal hair salon caters to women with face or head coverings Imani Nadir says she looked high and low for a hairdresser when she moved to Montreal in 2022. Finally, after six months of making calls and sending emails, the 20-year-old came across Two Horses, a Montreal hair salon offering specialized services to women who wear face or head coverings. 'She led it the whole way': 18-year-old B.C. woman leads hikers to safety in Jasper National Park As fire threatened people in Jasper National Park, Colleen Knull sprung into action. 'There's mom and dad's house': New video appears to show destruction of Jasper neighbourhood Video posted to social media on Thursday morning appears to show the charred remains of a Jasper, Alta., neighbourhood. Sask. Second World War veteran, 103, receives France's highest national order A Saskatchewan-born veteran of the Second World War was recently presented with France's highest national order. Former First Nations chief voices Disney's first Ojibwe language Star Wars movie A local First Nations elder and veteran is helping to bring the Ojibwe language to a well-known film for the first time. Vancouver 'I absolutely felt threatened': Former VPD exec speaks out alleging workplace toxicity and complicity She spent nearly 20 years working for the Vancouver Police Department, and now the woman at the centre of a lawsuit is speaking publicly about the threatening environment she claims to have experienced, and the alleged inaction of management. West Vancouver mayor on deadline to enact new housing bylaws: 'The gun is to our head' Last Thursday, Housing Minister Ravi Kahlon gave West Vancouver's mayor and council 30 days to change the city's bylaws to comply with new provincial regulations allowing for the construction of multiple units on all single family lots. New poll shows BC Conservatives closing gap with NDP as BC United loses another MLA A poll released Tuesday shows the gap narrowing between the BC NDP and the BC Conservatives with the latter party trailing by just three points months before the provincial election. Toronto 'Incredibly disappointing': Ontario halts wastewater testing for COVID, other viruses Ontario is officially ending its COVID-19 wastewater surveillance program today in a move some public health experts call shortsighted. 'Do not approach him:' Police say Hamilton man facing 11-year prison sentence is at-large Hamilton police are appealing for information about the whereabouts of a 24-year-old man who is facing an 11-year prison sentence in connection with a fatal hit-and-run back in 2021. 2 youths charged after several people hit with gel bullets in Vaughan Two youths have been charged after several people were struck by gel bullets in Vaughan, prompting a police warning on the dangers of replica firearms. Calgary Alberta Day of Caring: Recycle empty bottles and cans to help Jasper wildfire evacuees It's the Alberta Day of Caring, a province-wide event to support Jasper wildfire evacuees. Murder-conspiracy trial tied to Coutts, Alta., COVID-19 blockade set to go to jury A jury is set to begin deliberating today the fate of two men accused of conspiring to kill police at the Coutts, Alta., blockade in 2022. Jasper's fire-affected small businesses face rocky road ahead After labouring for months to bring one of Jasper's newest business concepts to life, the owners of The Peacock Cork & Fork never dreamed the young restaurant's run would be so short-lived. Ottawa Pedestrian dies after being struck by a vehicle in Ottawa's south end Emergency crews responded to a collision involving a pedestrian on Albion Road, between Rideau Road and Mitch Owens Road, just before midnight. Ottawa sees rise in whooping cough cases Ottawa Public Health is reminding parents to add vaccinations to the back-to-school list for the fall, as the capital sees an increase in whooping cough cases. BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Montreal Quebec woman who allegedly posed as lawyer arrested after missing court A Quebec woman who allegedly pretended to be a lawyer and evaded the authorities for weeks has been arrested. 10-year-old boy missing in Montreal Montreal police is looking for 10-year-old Jordan Blessing Nkhingu. Quebec e-bus and truck company Lion Electric cuts its workforce again, this time by 30 per cent For the third time this year, Quebec manufacturer of electric medium- and heavy-duty urban vehicles, Lion Electric, is slashing its workforce, reducing its workforce by 30 per cent. Edmonton Jasper's fire-affected small businesses face rocky road ahead After labouring for months to bring one of Jasper's newest business concepts to life, the owners of The Peacock Cork & Fork never dreamed the young restaurant's run would be so short-lived. WEATHER WEATHER | Josh Classen's forecast: Warm with a late-day storm risk We should see afternoon highs in the mid to upper 20s through the rest of the week and the coming weekend in Edmonton. Edmonton man sentenced to 5 years in prison in terrorism case in United Kingdom An Edmonton man has been sentenced to five years in prison after being convicted in the United Kingdom of being a member of a proscribed terrorist group. Atlantic Average Canadian household spends almost half its income on taxes: Fraser Institute Taxes are the largest household expense for families in Canada. BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Sand from the Sahara Desert causing recent lull in the hurricane season: scientists Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say. But it could soon come to an end. Winnipeg Bees, wasps to blame for wading pool closure There’s a buzz at the Braeside Park wading pool and it’s not the sound of kids splashing around. Remains believed to be missing man found in wooded area: Manitoba RCMP The remains of a missing Manitoba man were found in a wooded area on Monday. Rally for better bike safety blocks Winnipeg intersection Protestors shut down the Maryland Bridge on Tuesday as they called for better bike safety. Regina Sask. currently dealing with over 80 wildfires, none threatening communities, SPSA says As the devastating wildfire in Jasper National Park continues to burn, Saskatchewan is currently batting more than 80 active wildfires of its own. However, none are currently encroaching on any communities, the Saskatchewan Public Safety Agency said on Tuesday. Former Sask. MLA Lyle Stewart dead at 73 Former Saskatchewan Party MLA and provincial cabinet minister Lyle Stewart has died following a lengthy battle with cancer. 'It was a shock': Fire claims historic hotel and café in Radville, Sask. A long standing fixture in Radville, Sask. was destroyed by a fire in the early hours of Monday morning. Kitchener Death of neighbourhood deer sparks anger among Waterloo residents Waterloo residents are frustrated over the death of a wild deer that had been living in their neighbourhood, after repeated requests to help the animal were ignored. Guelph mayor calls out public drug use in city The Mayor of Guelph is speaking out about drug use in public spaces. Free little library destroyed in Kitchener Damaged books and bits of wood littered the ground on Wednesday after a free little library in Kitchener was destroyed. Saskatoon Pierre Poilievre spouts 'uneducated' opinions on safe consumption sites: Prairie Harm Reduction The executive director of a Saskatoon-based harm reduction group says federal Conservative leader Pierre Poilievre’s statements on supervised consumption sites are “uneducated.” Potentially toxic algae discovered in Saskatoon pond The City of Saskatoon has issued a warning to residents about the presence of toxic cyanobacteria in Briarwood Pond. Former Sask. MLA Lyle Stewart dead at 73 Former Saskatchewan Party MLA and provincial cabinet minister Lyle Stewart has died following a lengthy battle with cancer. Northern Ontario BREAKING BREAKING | Sudbury police investigating death at Bell Park Sudbury police say they are investigating a death at Bell Park and are asking the public to avoid it. Serious crash closes road at busy downtown Sudbury intersection Police are asking people to avoid the Lloyd Street area after a serious crash at a busy downtown Sudbury intersection Wednesday morning. Man linked to four murders in Kirkland Lake, Ont., is dead, police say Ontario Provincial Police say Martyn Rosko, the main suspect in four homicides in Kirkland Lake, is dead. London Back to work at IMT Defence in Ingersoll Workers voted to ratify a new four-year collective agreement that eliminates the two-tier wage system, they said discriminated against new hires and existing workers with limited seniority. Cyclist killed after being struck by transport truck One person has died after a crash Monday night in Lambton County. Around 10:05 p.m., crews responded to the area of London Line and Telfer road for the crash involving a transport truck and a cyclist. Intersection reopens following crash involving propane tanker truck Just after 12 p.m. on Tuesday, emergency crews rushed to the scene in Thames Centre after a transport carrying a full load of propane, collided with an SUV. Barrie Swim advisory for Couchiching Beach Couchiching Beach in Orillia has a swim advisory in place. Wasaga Beach calls for tent ban on beach Following reports of people defecating on the beach, Wasaga Beach Mayor Brian Smith passed a motion in council on Monday, formally requesting the province to ban four-sided tents on the beach. Rehabilitation centre for wildlife nears completion The National Wildlife Centre in Caledon Ont., has been helping sick and injured wildlife for 10 years and will soon offer its first permanent wildlife field hospital. Windsor Heat warning issued for Windsor-Essex Environment Canada has issued a heat warning for Windsor-Essex. High temperatures are expected to continue through Thursday. BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Here’s when you can expect a settlement payment from Loblaw for admitting to bread price fixing A Windsor law firm has been working on the case since it first came to light nearly a decade ago. Vancouver Island Wildfire burning near Sooke, B.C., now being held A wildfire burning west of Victoria is no longer considered out of control, according to an update from the B.C. Wildfire Service Tuesday. New poll shows BC Conservatives closing gap with NDP as BC United loses another MLA A poll released Tuesday shows the gap narrowing between the BC NDP and the BC Conservatives with the latter party trailing by just three points months before the provincial election. 'Severely hypothermic' sailor rescued after spending hours adrift off B.C. coast A sailboat captain was found alive but suffering from a severe case of hypothermia on Monday after spending up to five hours adrift in the ocean off British Columbia, according to the coast guard. Kelowna B.C. tree fruit grower co-operative shuts down after 88 years, citing low volume A British Columbia co-operative that has been selling and promoting the province's fruit for the last 88 years is shutting down. Mounties say missing B.C. children, wanted father all found safe Police in the British Columbia Interior say a missing father and his four young children have been found safe after the man failed to surrender the children to their mother, in violation of a court order. Kamloops RCMP officer charged with assault, mischief A Kamloops Mountie has been charged with assault and mischief in connection to an incident that occurred last summer, Crown prosecutors announced Wednesday. Lethbridge Murder-conspiracy trial tied to Coutts, Alta., COVID-19 blockade set to go to jury A jury is set to begin deliberating today the fate of two men accused of conspiring to kill police at the Coutts, Alta., blockade in 2022. Lawyer for Coutts accused says client 'bit of a wing nut,' but not murder conspirator The defence lawyer for Chris Carbert says her client is “a bit of a wing nut” who fell down a conspiracy rabbit hole at the border blockade in Coutts, Alta., but that doesn’t make him guilty of conspiring to kill police. Fire crews respond to massive Coaldale recycling plant fire Just before 3 p.m. on Friday, workers at the 2Point0 recycling plant were running plastic material through a machine to be processed. Sparks flew off the machine, which started a fire. Sault Ste. Marie Torrential rain in community west of Sault Ste. Marie strands cottagers and residents Cleanup is underway more than 24 hours since Mother Nature opened up the skies and flooded much of Prince Township. Group Health Centre workers in the Sault ratify contract CUPE 894 in Sault Ste. Marie announced Tuesday that its members approved a new contract with the Group Health Centre. Impaired arrests in the Sault: Driving in reverse, on the wrong side of the road Sault police say recent impaired driving arrests in the city involved such dangerous acts as driving in reverse and driving on a sidewalk. N.L. N.L. university chair disciplined for sending pro-Palestinian email to alumnus's dad The chair of the board of regents at Memorial University in Newfoundland and Labrador has been asked to take privacy training after he forwarded an alumnus's pro-Palestinian campaign email to her father. After a harrowing rescue in the cold Atlantic, a fisherman wanted two things: A new guitar, and Nickelback tickets Newfoundland and Labrador Premier Andrew Furey gave a special gift to David Tiller, one of seven fishermen who survived 48 hours on a life raft in the Atlantic Ocean. Newfoundland and Labrador doubles funeral benefits after unclaimed bodies pile up The Newfoundland and Labrador government has more than doubled the financial assistance it offers low-income residents who need to pay for a burial or a cremation, as health officials scramble to deal with unclaimed bodies at the province's largest hospital. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks I'm Fairly Certain You’ll Never Drive Without This Car Phone Mount Again (And It's On Sale Right Now) If You Have No Idea What To Get Them For Their Birthday, Try One Of These Gifts Prime Day Is A Few Weeks Away, But You Can Already Snag These 30+ Deals On Amazon Canada Home 15 Home Products With Near-Perfect Reviews On Amazon Canada (And You'll Want Every Single One) These Budget-Friendly Patio Furniture Pieces Will Make You Want To Spend Every Second Outdoors 15 Of The Best Cookware Sets You Can Get In Canada Gifts 18 Birthday Presents They'll Love More Than A Gift Card 20 Brilliant Gifts You'll Want To Order For Yourself, Too 19 Foolproof Gifts For Kids That Cost Less Than $50 Beauty If You're On The Hunt For A Heat Protectant Spray, Here Are 14 That Reviewers Are Loving Right Now This Sally Hansen Instant Cuticle Remover Keeps Selling Out, And Here’s Why People Are Loving It The Best Hair Masks For Dry And Damaged Hair Deals From Lululemon to Amazon Canada: Here Are All The Best Sales, Deals, and Discounts You'll Find Online Right Now Amazon Prime Day May Be Over, But You Can Still Take Advantage Of These 70+ Amazing Deals Amazon Prime Day Is Almost Over — Here Are 100+ Of The Best Deals And Discounts You Can Still Snag Stay Connected","summary":"Now that Minnesota Gov. Tim Walz is U.S. Vice President Kamala Harris ' running mate, his drunken driving arrest from 1995 in Nebraska — long before he entered politics — is getting renewed scrutiny.","url":"https://www.ctvnews.ca/world/what-to-know-about-tim-walz-s-1995-drunken-driving-arrest-and-how-he-responded-1.7002606","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/15/tim-walz-1-7002620-1723762950437.jpg","video":null,"publish_date":"2024-08-15 23:03:42","author":"Steve Karnowski,The Associated Press","authors":["Steve Karnowski","The Associated Press"],"language":"en","catgory":"politics","source_country":"CA","sentiment":-0.175},{"id":254215488,"title":"MSNBC anchor credits secret Democratic ‘inner sanctum’ for effort to push Biden out of race","text":"After being grilled on a talk show about who made President Biden relinquish the nomination, MSNBC host Alex Wagner eventually credited a secret \"inner sanctum\" of Democratic Party associated elites. The 2024 election changed radically when Biden gave up the Democratic nomination and endorsed Vice President Harris to take it up instead. As it stands, the nature of how Biden surrendered the nomination, and whether there was a coordinated campaign to make him do so, remains a mystery. Late night talk show host Stephen Colbert spoke with Wagner about the upcoming Democratic National Convention in Chicago, noting he heard that Monday will apparently be a night themed around Biden. He asked the MSNBC host if she has any concept of how the president will be celebrated. Wagner, who aside from being an MSNBC host, is married to former President Obama’s longtime personal chef, stammered and nervously laughed multiple times at Colbert’s question, \"I, listen, I, there, without any — there, there is a lot that is, there is a lot that is going to remain probably unreported about the sort of machinations to-\" CHICAGO GETTING ‘WINDOW DRESSING’ TREATMENT FOR DEMOCRATIC NATIONAL CONVENTION: FORMER CHIEF \"Like what?\" Colbert asked the news host. \"Go ahead, report it.\" When Wagner balked by sarcastically joking that nobody was listening, Colbert pressed again. \"Report it,\" he demanded. \"Like, who do you think actually got him out? Who do you think it was that put the shape charge under Joe that got him out of there? As Wagner continued to offer what sounded like a vague theory, by starting to say \"I think there was-\" Colbert grilled her for specifics. \"Was it Obama? Did Obama do it? Was it Clinton? Tell me who did it,\" he said. \"You know who did it. You are one of those liberal MSNBC things. You got the newsletter. Did you do it? Did you go up to Camp David with a 40-foot pry bar and pop him out of there like a lego?\" \"I wasn’t at soccer camp, I’ll tell you that much, Stephen!\" she replied. ANTI-ISRAEL AGITATORS PLAN DEMONSTRATIONS FOR DNC: ‘EQUIVALENT’ TO 1968 Colbert recalled a quote from Biden that only the \"Lord Almighty\" could make him leave the race and pressed again for Wagner to offer a name. \"Listen, I think there was more happening behind the scenes than the public will probably hear about,\" Wagner said. \"There is an inner sanctum of Democratic politics where a lot of powerful people are trying to take credit for this, but they don’t want to talk about it publicly because they are very, very, very acutely aware of how difficult this has been for Joe Biden, and by the way, remains difficult, and as it-which is totally understandable.\" Wagner continued by arguing, \"The man made the hardest decision you can make in American politics, and, y’know, he’s been vindicated, I think, by the fact that Kamala Harris has just created this wave of momentum. But it’s also hard to see your replacement do so much better than you.\" She then pivoted and spoke instead about how Biden would make his appearance at the convention. CLICK HERE TO GET THE FOX NEWS APP \"I think Joe Biden is going to bring it with a capital ‘B’ at the convention,\" she said. \"I think we are going to see State of the Union Joe Biden. I think he’s going to show the country that he is still, damn it, Joe Biden.\" She later returned to Colbert’s question, \"But as far as who edged him out, I don’t-I think that is a conversation that you’re not going to really hear publicly, for good reason. It’s, to some degree, I think, to protect Joe Biden from the sort of, the ugliness of the fact that a lot of people wanted him to leave before he was ready to. But at the end of the day, the person that got him out is Joe Biden. He’s the guy that ultimately decided, you know.\" \"And for that he deserves all of the praise in the world,\" Colbert said, to which Wagner agreed.","summary":"An MSNBC host was badgered by talk show host Stephen Colbert for insider knowledge about what forces in Democratic Party politics pushed Biden to give up the nomination.","url":"https://www.foxnews.com/media/msnbc-anchor-credits-secret-democratic-inner-sanctum-effort-push-biden-out-race","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Alex-Wagner-on-Colbert.png?ve=1&tl=1","video":null,"publish_date":"2024-08-15 23:00:45","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.272},{"id":254215242,"title":"Donald Trump blames Kamala Harris while surrounded by sugary breakfast foods","text":"Republican presidential nominee and former President Donald Trump speaks during a press conference at Trump National Golf Club, in Bedminster, New Jersey, on Thursday (Picture: Reuters) Former President Donald Trump blamed his 2024 opponent Kamala Harris for price hikes while surrounded by sugar breakfast foods. Trump pitched his economic plan while standing next to a table full of pastries, pie, sweet cereals, bacon and instant coffee at his New Jersey golf club on Thursday evening. The breakfast items were meant to illustrate the increasing prices for food and beyond. As Trump spoke about the 2020 presidential election that he believes was stolen from him, he digressed to speak about a box of cereal. ‘I haven’t seen Cheerios in a long time,’ he said. ‘I’m going to take them back to my cottage.’ Trump also sought to justify his continuing personal attacks against Harris. ‘As far as the personal attacks, I’m very angry at her because of what she’s done to the country. I’m very angry at her that she would weaponize the justice system against me and other people, very angry at her,’ Trump said. ‘I think I’m entitled to personal attacks.’ Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.","summary":"Ex-President Donald Trump was surrounded by pastries and sugary cereals as he blamed 2024 opponent Kamala Harris for price hikes.","url":"https://metro.co.uk/2024/08/15/donald-trump-breakfast-foods-kamala-harris-economy-new-jersey-21433693/","image":"https://metro.co.uk/wp-content/uploads/2024/08/SEI_217524712-b6bb.jpg?quality=90&strip=all","video":null,"publish_date":"2024-08-15 22:58:44","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.051},{"id":254216212,"title":"Harris to propose construction of 3 million new homes as part of economic agenda","text":"Vice President Kamala Harris’s housing plan involves pushing for the construction of millions of new homes while incentivizing the construction of homes for first-time buyers. Harris is set to unveil her economic and affordability plan Friday, but the details of what her economic policy agenda might look like are beginning to emerge. As part of the plan, she will call for the construction of 3 million new housing units over the course of her first term in office, according to Harris campaign officials. The push for more housing comes amid a bruising housing shortage in the United States that has featured decades of undersupply. Harris’s plan appears to build off President Joe Biden’s previous call for the construction of 2 million new homes. Harris will also unveil a new tax incentive for builders that will reward them for building homes for first-time homebuyers, although there are little details about that plan as of Thursday evening. Harris will also pitch a $40 billion fund to help local governments find solutions to housing undersupply. Biden had proposed a $20 billion fund to do the same thing. During this year’s State of the Union address, Biden proposed providing a $5,000 tax credit for middle-class first-time homebuyers for two years, which he described as a form of mortgage relief. He also pitched a $10,000 credit for those who sell their starter homes. But critics of that plan contend that doing so would backfire by increasing demand and putting upward pressure on home prices. Harris is now proposing that families who have paid their rent on time for two years and are first-time homebuyers receive up to $25,000 in down-payment assistance, with more generous support for first-generation homeowners. Biden has also pushed for Congress to make it so corporate landlords have to cap rent increases on existing units at 5% or lose prized tax breaks, something that Republicans in Congress would certainly not support. That proposal would apply only to corporate landlords with over 50 units in their portfolios and would cover more than 50 million units across the country, according to the White House. Also on Thursday, Harris unveiled a plan to target food inflation at the grocery store. As part of it, Harris would try to enact the “first-ever federal ban on corporate price-gouging,” something that critics argue would not work and could lead to food shortages.","summary":"Vice President Kamala Harris’s housing plan involves pushing for the construction of millions of new homes while incentivizing the construction of homes for first-time buyers. Harris is set to unveil her economic and affordability plan Friday, but the details of what her economic policy agenda might look like are beginning to emerge. As part of [&#8230;]","url":"https://www.washingtonexaminer.com/policy/finance-and-economy/3123612/harris-propose-construction-3-million-new-homes-economic-agenda/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/harris-housing-plan.webp","video":null,"publish_date":"2024-08-15 22:58:05","author":"Zach Halaschak","authors":["Zach Halaschak"],"language":"en","source_country":"US","sentiment":-0.027},{"id":254215202,"title":"Tuberville fires back at Walz's sideswipe from fundraiser: 'He’s trying to make himself look good'","text":"EXCLUSIVE: Sen. Tommy Tuberville, R-Ala., fired back at Minnesota Gov. Tim Walz Thursday after Vice President Kamala Harris’ running mate sideswiped him at a Boston fundraiser. Walz, after saying he doesn’t \"name-call people,\" made a crack about Tuberville, according to The Boston Globe. \"One of my roles in this now is to be the anti-Tommy Tuberville, to show that football coaches are not the dumbest people,\" Walz was quoted as saying. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Tuberville, who was the head coach at Ole Miss, Auburn, Texas Tech and Cincinnati and was the 2004 Coach of the Year, was critical of Walz in a post on X but told Fox News Digital he didn’t really understand where the swipe at him came from. Walz became the defensive coordinator for Mankato West High School in Minnesota in the late 1990s, and the team won the Class 4A state title in 1999. \"I think he’s trying to make himself look good. Kind of comparing himself to a coach, which he was only an assistant coach in high school. And if he had been any good, he would’ve been a head coach, to be honest with you,\" Tuberville said. \"I don’t know what he’s trying to do. He’s kind of conned his way up the totem pole, I guess. He’s second in line to being the president of the United States if they were to happen to win, which I don’t think that’s going to happen, but … if you just look at everything he’s done, it doesn’t coincide with being a coach.\" Tuberville said Walz took the shot against him because he has \"nothing else to talk about\" and warned that Walz and Harris need to start talking about their future for American citizens. \"We’re all — 330 million people — are just kind of around waiting for he and Kamala Harris to go on television and do an interview and talk about things that affect all of us, which are food prices, gas, the foreign wars, the border, the crime. They’re out here talking about things that don’t mean a hill of beans for the American people. ESPN STAR DOESN'T 'WANT TO HEAR S---' ABOUT COLIN KAEPERNICK PLAYING QB IN NFL, THINKS HE'D BE GOOD COACH \"Sure, if you want to talk about the past, that’s fine. But the past is not going to do us any good. The future. What are you going to do for the future? You’re running for the future of the United States of America. Get out there and sell what you’ve got. And if you don’t have anything to sell, what do you do? You try to do something else. You try to ignore it. You try to put other things in front of it. You try to give some semblance of bouncing a rubber ball around a room. \"Hey, we need something that’s going to stick. And so, the American people need to know what they stand for. And neither one of them yet, in a month’s time, have got in front of the cameras and say, ‘This is what we believe in. This is the direction we’re going now.’ They’ll hit or miss on it, but we need some structure because we’re 85, 86, 87 days away from the biggest elections ever. And we got two people out there running around making jokes behind the scenes when they should be talking about serious business for the American people.\" Tuberville led Auburn to a 13-0 record in 2004, finishing with a Sugar Bowl win. He was also the AFCA Coach of the Year, the Paul \"Bear\" Bryant Award winner and the Walter Camp Coach of the Year for that 2004 season. Additionally, he won the SEC Coach of the Year twice. Tuberville added that coaching college football is one of the toughest things to do and that it’s helped him strengthen his communication skills as a senator. \"You had a lot of people that are very smart. You had some people that struggled,\" he added. \"Being able to communicate (to) different personalities. You gotta remember now, when you’re a football coach in college, you deal with people from all backgrounds — rich, poor, all different races, urban, rural. And then your job is to bring them all together. And if you can do that, you have a good chance for success. \"That’s what I prided myself in — to be able to talk with a young White kid from a rural area that’s very shy, that wasn’t around a lot of people to an urban kid, whether he’s Black or White, and made them feel they were part of it when sometimes it was a very hard job. \"College athletics is very hard. Being a coach is very hard. Dealing with a hundred different personnel, 120 different personalities and people that they come, all those different backgrounds. It is a challenge. CLICK HERE TO GET THE FOX NEWS APP \"And it goes back to Walz. He should understand that. He should understand it. It’s one of the hardest jobs that you can ever do. To get to a point to put them in a situation where they can win and then have a chance to win championships, it’s even harder.\" Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Sen. Tommy Tuberville, R-Ala., fired back at a remark Minnesota Gov. Tim Walz made about him during a fundraiser in Boston. Walz is on Kamala Harris&apos; presidential ticket.","url":"https://www.foxnews.com/sports/tuberville-fires-back-walzs-sideswipe-from-fundraiser-hes-trying-make-himself-look-good","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Tommy-Tuberville2.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-15 22:55:18","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","source_country":"us","sentiment":-0.214},{"id":254215430,"title":"Trump says he is 'entitled' to personally attack Kamala Harris as his allies beg him to focus on her policies","text":"Former President Donald Trump on Thursday defended his attacks on Vice President Kamala Harris even as his top allies begged him to stay on message amid Harris' surging popularity.\"I think I'm entitled to personal attacks,\" Trump said in response to a question that mentioned some of his allies' uneasiness. \"I don't have a lot of respect for her. I don't have a lot of respect for her intelligence, and I think she'll be a terrible president. And I think it's very important that we win and whether the personal attacks are good, bad — I mean she, certainly attacks me personally, she called me weird.\"Trump's defense came during a meandering news conference that appeared to be set to focus primarily on the economy. The former president spoke for roughly an hour before beginning to take questions from reporters.Asked what his message was to Americans struggling with credit card debt, Trump said, \"My message to them would be very simple: vote for Trump and we're going to fix the problem. We're going to get it fixed. We'll get it fixed.\"In recent days, former Trump campaign manager Kellyanne Conway and other leading Republicans have urged the former president to focus more on Harris' policies and past positions over attacks on her intelligence and other areas.\"The winning formula for President Trump is very plain to see,\" Conway told Fox Business host Larry Kudlow, who served in Trump's administration as Director of the National Economic Council. \"It's fewer insults, more insights, and that policy contrast.\"Harris' campaign seemed almost giddy at the prospect that Trump was holding another news conference. She has not held an extended news conference since becoming the Democratic presidential nominee.\"We aren't sure what we just watched and neither is America,\" the Harris campaign said in a statement. \"From his member-only golf club, Donald Trump tried to read some paper for more than 40 minutes, while giving a stream of not-much-consciousness. It was quite boring. Networks cut from his speech (except Fox, he has Dominion over them). Then, he took some questions. It did not get better.\"On Wednesday, during a speech in North Carolina, billed to be about the economy, Trump began by mocking Harris' laugh.Earlier this month, Trump questioned whether Harris was truly Black in front of a room of Black journalists, an example of how he has reverted to form in stepping on his message. He also repeatedly attacked Georgia Gov. Brian Kemp, even though Kemp has supported him and tried to turn the page from the 2020 election. Polls show that Harris has gained ground as Trump stumbles.On Thursday, Trump's campaign announced that Corey Lewandowski, the first of three campaign managers on Trump's 2016 campaign, would join the 2024 run in some capacity. Asked about whether the announcement signaled a shake-up, Trump said that his approach remains the same.\"I think it's a sign of we want to close it out,\" Trump said.","summary":"Donald Trump's defense came during a meandering news conference that appeared to be set to focus primarily on the economy","url":"https://www.businessinsider.com/trump-kamala-harris-personal-attacks-focus-2024-8","image":"https://i.insider.com/66be7d1b1aa2ac29ee31c1aa?width=1136&format=jpeg","video":null,"publish_date":"2024-08-15 22:52:51","author":"Brent D. Griffiths","authors":["Brent D. Griffiths"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.373},{"id":254215962,"title":"How to watch, what to know about the 2024 DNC","text":"The Democratic National Convention is set to begin Monday, Aug. 19 in Chicago -- during which Democratic Party delegates are set to support Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz after their unconventional path to the party's nomination. During the four-day convention, Democratic heavyweights are set to fire up the base and rally behind Harris, who was officially certified as the Democratic presidential nominee earlier this month after getting the vast majority of delegate votes in a virtual roll call. Harris' path to the DNC has been an unorthodox and truncated one after President Joe Biden announced he was leaving the 2024 race and endorsed Harris for the job on July 21. Here's what to know about the DNC and how to follow along with all of the action. When and where is the DNC? The 2024 DNC takes place Aug. 19-22 in Chicago. Official proceedings, primetime programming and speeches will be held at the United Center -- home to the Chicago Blackhawks and Chicago Bulls. Other party activities will be held at the McCormick Place Convention Center. Democrats are in welcoming territory with a Chicago convention. Chicago is a Democratic stronghold that \"was part of the 'blue wall' crucial to the Biden-Harris victory in 2020 and will be for a Harris-Walz victory in November,\" according to the DNC. \"Chicago is the perfect place to bring the story of Vice President Harris, Governor Walz, and the Democratic Party to the American people. Chicago represents the diversity of the Democratic Party and the country,\" according to the DNC. What is the DNC schedule? Who are the speakers? While the DNC has not released its list of speakers scheduled for each evening, it has detailed some of the convention events through the day, including caucus and council meetings and press briefings on its website. Biden is set speak at the DNC on Monday. Sources told ABC News that a working speaking schedule, which can change, has former Secretary of State Hillary Clinton speaking on Monday evening as well; former President Barack Obama speaking on Tuesday; Walz and former President Bill Clinton speaking on Wednesday; and Harris speaking on Thursday. As is customary, Democratic National Committee Chair Jamie Harrison will gavel-in the first night of the convention. How can I watch the DNC? The DNC will stream on multiple platforms -- including TikTok, Instagram and YouTube. The official live stream of the 2024 Democratic National Convention will be available on its website. Prime-time programming will air live from 6:30 p.m.-11 p.m. ET/5:30 p.m.-10 p.m. CT on Monday and 7 p.m.-11 p.m. ET/6 p.m.-10 p.m. CT on Tuesday-Thursday, according to the DNC. ABC News will have special coverage of the DNC -- including primetime coverage from 10 p.m. until 11 p.m. ET on ABC every day of the conventions, and on ABC News Live from 7 p.m. until 12 a.m. ET. Hulu will also have live reports available all day, and ABC News Live will have robust coverage each day of the convention. ABC News Digital and 538 will live blog the latest from the convention and provide analysis as the convention events unfold.","summary":"Biden is set speak at the DNC on Monday.","url":"https://abc7news.com/post/when-is-dnc-chicago-how-watch-what-know-2024-democratic-national-convention/15190600/","image":"https://cdn.abcotvs.com/dip/images/15190626_DNC-banner-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/081924-wls-piekos-dnc-preps-11a-vid.mp4","publish_date":"2024-08-15 22:51:11","author":"ABCNews,Sarah Beth Hensley","authors":["ABCNews","Sarah Beth Hensley"],"language":"en","source_country":"US","sentiment":0.285},{"id":254215018,"title":"How to watch, what to know about the 2024 DNC","text":"The Democratic National Convention is set to begin Monday, Aug. 19 in Chicago -- during which Democratic Party delegates are set to support Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz after their unconventional path to the party's nomination. During the four-day convention, Democratic heavyweights are set to fire up the base and rally behind Harris, who was officially certified as the Democratic presidential nominee earlier this month after getting the vast majority of delegate votes in a virtual roll call. Harris' path to the DNC has been an unorthodox and truncated one after President Joe Biden announced he was leaving the 2024 race and endorsed Harris for the job on July 21. Here's what to know about the DNC and how to follow along with all of the action. When and where is the DNC? The 2024 DNC takes place Aug. 19-22 in Chicago. Official proceedings, primetime programming and speeches will be held at the United Center -- home to the Chicago Blackhawks and Chicago Bulls. Other party activities will be held at the McCormick Place Convention Center. Democrats are in welcoming territory with a Chicago convention. Chicago is a Democratic stronghold that \"was part of the 'blue wall' crucial to the Biden-Harris victory in 2020 and will be for a Harris-Walz victory in November,\" according to the DNC. \"Chicago is the perfect place to bring the story of Vice President Harris, Governor Walz, and the Democratic Party to the American people. Chicago represents the diversity of the Democratic Party and the country,\" according to the DNC. What is the DNC schedule? Who are the speakers? While the DNC has not released its list of speakers scheduled for each evening, it has detailed some of the convention events through the day, including caucus and council meetings and press briefings on its website. Biden is set speak at the DNC on Monday. Sources told ABC News that a working speaking schedule, which can change, has former Secretary of State Hillary Clinton speaking on Monday evening as well; former President Barack Obama speaking on Tuesday; Walz and former President Bill Clinton speaking on Wednesday; and Harris speaking on Thursday. As is customary, Democratic National Committee Chair Jamie Harrison will gavel-in the first night of the convention. How can I watch the DNC? The DNC will stream on multiple platforms -- including TikTok, Instagram and YouTube. The official live stream of the 2024 Democratic National Convention will be available on its website. Prime-time programming will air live from 6:30 p.m.-11 p.m. ET/5:30 p.m.-10 p.m. CT on Monday and 7 p.m.-11 p.m. ET/6 p.m.-10 p.m. CT on Tuesday-Thursday, according to the DNC. ABC News will have special coverage of the DNC -- including primetime coverage from 10 p.m. until 11 p.m. ET on ABC every day of the conventions, and on ABC News Live from 7 p.m. until 12 a.m. ET. Hulu will also have live reports available all day, and ABC News Live will have robust coverage each day of the convention. ABC News Digital and 538 will live blog the latest from the convention and provide analysis as the convention events unfold.","summary":"Biden is set speak at the DNC on Monday.","url":"https://abc13.com/post/when-is-dnc-chicago-how-watch-what-know-2024-democratic-national-convention/15190600/","image":"https://cdn.abcotvs.com/dip/images/15190626_DNC-banner-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/081924-wls-piekos-dnc-preps-11a-vid.mp4","publish_date":"2024-08-15 22:51:11","author":"ABCNews,Sarah Beth Hensley","authors":["ABCNews","Sarah Beth Hensley"],"language":"en","source_country":"us","sentiment":0.285},{"id":254215814,"title":"Rep. Jared Golden says he won’t endorse Harris for president","text":"Rep. Jared Golden, D-2nd District, said Thursday he won’t endorse his party’s presidential nominee, Vice President Kamala Harris. “Let me be as clear as I can be. I will not be endorsing in the presidential race,” Golden said in a written statement late Thursday afternoon. “The reason is simple: I am running to represent all the people of this district, regardless of who they vote for at the top of the ticket. “As I have always done, I will fight for Mainers no matter who occupies the White House. I am running to earn their vote on the merits, whether they support Harris, Trump, or none of the above. No matter who you vote for, there is room for you on Team Golden.” Golden is seeking reelection in the conservative district, which supported former President Donald Trump in 2016 and in 2020. Trump has endorsed his opponent, State Rep. Austin Theriault, R-Fort Kent. Golden has said he didn’t plan to vote for Trump, but also has distanced himself from his party and criticized Democratic policies in television campaign ads. And he has been hounded with questions from new reporters and criticism from Republicans about his reluctance to take a stand in the presidential election. Last month, when President Biden was still in the race against Trump, Golden authored a newspaper opinion column predicting Biden would lose and saying he would work with Trump. “While I don’t plan to vote for him, Donald Trump is going to win,” Golden wrote. “And I’m OK with that.” Then, when Biden stepped aside and Harris became to presumptive nominee, Golden refused to say if he would support her. In late July, he told a reporter for Axios that he is “absolutely not” committed to backing Harris and has to first hear more about her vision for the country. His brief written statement on Thursday did not provide any further explanation about why he’s not endorsing Harris. He also did not say who he plans to vote for. This story will be updated.","summary":"Golden has been hounded with questions from news reporters and criticism from Republicans about his reluctance to take a stand in the presidential election.","url":"https://www.centralmaine.com/2024/08/15/rep-jared-golden-says-he-wont-endorse-harris-for-president/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/06/Election_2024_Maine_Guns_10582_e94c5e.jpg?w=1000","video":null,"publish_date":"2024-08-15 22:47:26","author":"Staff Report","authors":["Staff Report"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.277},{"id":254214830,"title":"Donald Trump says he’s ‘entitled to personal attacks’ on Kamala Harris","text":"Former US president Donald Trump said on Thursday he thinks he is “entitled to personal attacks” on his Democratic rival, saying he’s “very angry” at US Vice-President Kamala Harris because of the criminal charges he faces. Trump was responding to a question about whether his campaign needs more discipline during a news conference at his New Jersey golf club, where he looked to saddle Harris with the unpopular economic record of US President Joe Biden. “As far as the personal attacks, I’m very angry at her because of what she’s done to the country. I’m very angry at her that she would weaponise the justice system against me and other people, very angry at her. I think I’m entitled to personal attacks,” Trump said. “I don’t have a lot of respect for her intelligence and I think she’ll be a terrible president,” he added. Trump stuck close to his scripted economic message for more than half an hour, reading from a binder in front of him in a news conference at his New Jersey golf club. Later, he veered into familiar stories he enjoys telling at his rallies. A day earlier, he had struggled to make a sustained case for his economic policies during a meandering speech that his campaign had billed as a major policy address. “Kamala Harris is a radical California liberal who broke the economy, broke the border and broke the world, frankly,” Trump told reporters. Trump was flanked by popular grocery store items, including instant coffee, sugary breakfast cereals and pastries, laid out on tables as he highlighted the cost of everything from food to car insurance to housing. At one point, as he talked about the 2020 election he lost, he noticed a box of cereal. “I haven’t seen Cheerios in a long time,” Trump said. “I’m going to take them back to my cottage.” The event came one day after the US Labour Department announced year-over-year inflation had reached its lowest level in more than three years in July – the latest sign that the worst price spike in four decades is fading. But consumers are still feeling the impact of higher prices – something Trump’s campaign is banking on to motivate voters this fall. Harris is planning her own economic policy speech Friday in North Carolina, promising to push for a federal ban on price gouging on groceries. A small crowd of Trump supporters watched his news conference from the periphery, occasionally cheering him on. But without a crowd of thousands to please with red meat attacks on his enemies, Trump stuck closer to his prepared remarks. Hours before the news conference, Trump’s campaign leaders announced they were expanding his staff, bringing a number of former aides and outside advisers formally into the fold. Corey Lewandowski, Taylor Budowich, Alex Pfeiffer, Alex Bruesewitz and Tim Murtaugh will advise the campaign’s senior leadership. Lewandowski was Trump’s first campaign manager during his 2016 campaign. Budowich and Pfeiffer are moving over from MAGA Inc., a pro-Trump super PAC. Bruesewitz produces pro-Trump content for a large social media following. And Murtaugh was the communications director for Trump’s 2020 campaign. Summer has traditionally been the time for shake-ups in Trump’s two prior campaigns. This year’s change comes weeks after the campaign itself was transformed by Biden’s decision to end his reelection campaign and endorse Harris. Trump gave his top advisers a vote of confidence Thursday, writing on his social media platform that his management team headed by Chris LaCivita and Susie Wiles is “THE BEST.” Trump spoke to the press as he steps up his criticism of Harris for not holding a news conference or sitting down for interviews since Biden made way for her.","summary":"The Republican US presidential candidate also says he does not ‘have a lot of respect’ for his Democratic rival’s intelligence.","url":"https://www.scmp.com/news/world/united-states-canada/article/3274678/donald-trump-says-hes-entitled-personal-attacks-kamala-harris","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/16/4302f95f-ad70-48a5-84b4-fd11b872e43e_e2e1ac35.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/22/web%20video.mp4","publish_date":"2024-08-15 22:46:53","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.233},{"id":254214820,"title":"Donald Trump, not Kamala Harris, is the candidate of the working class in Pennsylvania poll","text":"New Keystone State polling shows interesting coalitions lining up behind Kamala Harris and Donald Trump in a race the vice president leads by just 3 points, inside the +/- 3.8% margin of error. The Democratic presidential nominee is better regarded by well-educated, affluent voters regardless of race, especially in major metropolitan areas. And the Republican nominee’s base seems to be the less-educated, rural working class, at least according to a Franklin & Marshall survey conducted between July 31 and Aug. 11, with responses from 920 registered voters — 411 Democrats, 378 Republicans and 131 independents. Among white voters without a college degree, Trump dominates Harris, leading 53% to 35%, with Robert Kennedy Jr. at 7% and the Green Party’s Jill Stein at 1%. But while Harris lags against white voters who didn’t finish college, she makes up for it with those who did, taking 62% support, with Trump at 28%, Kennedy at 5% and Libertarian Chase Oliver at 1%. Among all voters, the educational divide is only reinforced. Trump leads Harris 59% to 29% with people with a “high school or less” education and 49% to 37% with those who had “some college.” Yet among those with a college degree, Harris leads 61% to 30%. And while many polls suggest a major ethnic gap in presidential preference, this survey tells a different story. Harris leads by 3 points with white voters, 46% to 43%, with Kennedy at 6%. Among nonwhite voters, Trump leads Harris 44% to 43%; Kennedy’s at 7%. Beyond suggesting education matters more than ethnicity in Pennsylvania, the poll offers further indications voters in the Keystone State see Trump, not Harris, as the working-class hero. The former president does best among those respondents who make less than $35,000 a year, with 48% support against 38% for Harris, 6% for Kennedy, 3% for Jill Stein, 1% for Oliver and 2% for someone else. But those making higher incomes like Harris. She leads Trump 48% to 36% with those making between $35,000 and $75,000 a year, with Kennedy at 8% and no other candidate above 1%. And among those making more than $75,000 a year, Harris is at 52%, with Trump 14 points behind. Some theorize that blue-collar voters in Pennsylvania and other states feel abandoned by the Democratic Party as organized labor’s power has waned, and the data speak to that. Underscoring that theory also in this survey: the concentration of Harris’ support in urban areas. Harris will hope to rack up the votes in what pollsters call “large central metro” areas, where she leads Trump 70% to 20%. She also leads Trump by 3 points in fringe metro areas. For the former president, it’s a shame trees can’t vote, as he dominates in more rural areas. He leads Harris 51% to 39% in medium metros, 56% to 30% in small metros, 54% to 32% in micropolitan areas and 54% to 37% in “noncore” areas. Harris will also rise or fall based on ability to turn out the vote in Philadelphia, which takes its time counting mail ballots like few other cities in the country. She leads 59% to 38% in that area of the state and by 8 points in Allegheny/southwest (the Pittsburgh region). Trump leads Harris in the northwest, northeast and central areas of the state. What’s clear from this survey: Pennsylvania will be hard fought, and for Trump to win, he and his team must be aggressive in turning out voters in more isolated areas to counter Harris’ advantages in population centers. And along those lines, just as in 2020, late-counted votes from urban areas may again make the difference in a close election.","summary":"New Keystone State polling shows interesting coalitions lining up behind Kamala Harris and Donald Trump in a race the vice president leads by just 3 points, inside the +/- 3.8% margin of error. The Democratic presidential nominee is better regarded by well-educated, affluent voters regardless of race, especially in major metropolitan areas. And the Republican...","url":"https://nypost.com/2024/08/15/us-news/donald-trump-not-kamala-harris-is-the-candidate-of-the-working-class-in-pennsylvania-poll/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87824416.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-15 22:44:53","author":"A.g. Gancarski","authors":["A.g. Gancarski"],"language":"en","source_country":"us","sentiment":-0.052},{"id":254214822,"title":"To win Michigan, Trump must earn the urban black and Latino vote","text":"Michigan is the most Democratic of the key swing states. Former President Donald Trump can win it, however, if he can do what many national polls suggest he can: get up to 20% of the black vote. Democrats win in Michigan because they dominate the urban vote. Just ask President Biden, who carried the state by nearly 3% in 2020 despite winning only 11 of its 83 counties. Those were the ones with Michigan’s large cities: Detroit, Grand Rapids, Lansing, Ann Arbor, Flint. These cities and their neighboring suburbs accounted for all his edge and then some. Biden won them with massive margins, too: Ann Arbor voted 87-11 for Biden; Grand Rapids went 70-28. Detroit topped the list with a 94-5 Biden margin, but places like Southfield (87-12) and Flint (82-16) weren’t far behind. These Democratic super-cities all share two characteristics: They are dominated either by college-educated whites in the state capital or large university towns (Lansing, Ann Arbor, East Lansing), or they have high populations of blacks and Latinos. Cut the margins among one or more of these groups, then, and Trump has a path to victory. He won’t do that with bureaucrats or university elites. America’s government managers and large educational institutions are the bastions of the so-called Resistance. Vice President Kamala Harris is the perfect candidate for Zoe from Ann Arbor, and Trump shouldn’t waste his time trying to change their minds. Black and Latino voters, however, have been shifting away from Democrats. Exit polls showed Biden beat Trump 92-7 with Michigan black voters, but the most recent New York Times-Siena poll showed Harris winning that demo by only 80-14. That may not seem like a big difference, but blacks were 12% of the total electorate in 2020 per the exit poll. If Harris wins them by 20 points fewer than Biden, that alone would cut 2.4% off Biden’s 2.8% statewide margin, reducing Harris’ expected lead to a mere 0.4%. Cutting her lead with Latinos and other nonwhite voters would do even more damage. They cast a combined 8% of the vote, with Latinos going 55-44 for Biden and other races backing him 66-30 — roughly 61-36 combined. The NYT/Siena poll had Harris winning by only 50-43 among Latinos and other nonwhites. Decreasing the Democrats’ margin with other nonwhites from 25 to 7 points would, along with the drop in black support, flip the state to Trump if his share of the white vote stays constant. Some of that decline may be due to the state’s Arab population. Hard numbers are difficult to come by, but it appears there are between 300,000 and 400,000 Arab and other Middle Eastern residents in Michigan. Many are not citizens, and they are not a large enough demographic to flip the state to Trump on their own. But they are numerous enough to contribute to a Trump victory if they abandon Harris over the administration’s policy towards Gaza. Harris will surely try to regain support among these traditionally Democratic groups, but she also hopes to expand the growing Democratic support in educated suburbs too. The NYT/Siena poll shows her ahead by 55-40 among whites with a college degree compared with Biden’s 53-46 margin. College-educated whites cast 29% of the state’s votes in 2020; expanding the Democratic lead with this demographic by 8 points roughly offsets the polling decline among blacks. That will give Harris the win if she maintains that level of support. Trump will win most places in the state because of his massive backing from its white working-class voters. Michigan is still home to a large population of whites without a college degree, and they abandoned their long-standing Democratic heritage to back Trump in 2016 and 2020. Gogebic County on the state’s remote Upper Peninsula best exemplifies this trend. It had not backed a Republican for president since 1972, when Richard Nixon swept to a historic landslide. Yet it gave Trump 54% in 2016 and 56% in 2020, creating a 20-point shift in the margin from Obama’s 8-point win there in 2012. Trump’s problem is that non-college whites are a shrinking share of the Wolverine State’s electorate. They cast 52% of the vote in 2020 but were only 50% of the sample in the recent NYT/Siena poll. Whites without a college degree are much older than other demographics, and merely the passage of time is reducing their political power. Michigan will be a reach for Trump, but it is a must-win state for Harris. Expect her to try to nail it down as early as she can. If she’s still spending lots of time here in October, it’s a sign her campaign is faltering. Henry Olsen, a political analyst and commentator, is a senior fellow at the Ethics and Public Policy Center.","summary":"Michigan is the most Democratic of the key swing states. Former President Donald Trump can win it, however, if he can do what many national polls suggest he can: get up to 20% of the black vote. Democrats win in Michigan because they dominate the urban vote. Just ask President Biden, who carried the state...","url":"https://nypost.com/2024/08/15/us-news/to-win-michigan-trump-must-earn-the-urban-black-and-latino-vote/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87772466.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Ns6L7i3k-RyIcpnTz.mp4","publish_date":"2024-08-15 22:44:10","author":"Henry Olsen","authors":["Henry Olsen"],"language":"en","source_country":"us","sentiment":0.126},{"id":254215210,"title":"Iconic Obama ‘Hope’ Poster Artist Shepard Fairey Makes Kamala Harris Print With a New Message: Forward","text":"Shepard Fairey, the artist behind Barack Obama’s iconic “Hope” poster, revealed a new print Thursday for Vice President Kamala Harris’ 2024 presidential bid with her own all-new mantra: “Forward.” The artist-activist and Obey clothing founder famously made former President Obama’s “Hope” poster for his 2008 run for office, and he said Thursday that the “Forward” poster was made “purely in pursuit of a better future.” “‘We are not going back.’ These words from Kamala Harris summarize the moment we are in, and in order not to go back, we must go FORWARD,” he said. “While we have not achieved all the goals we might be seeking, we are making progress – all in the face of expanding threats and regressive political adversaries.” Fairey continued: “But we are not going back. In fact, we have a very real opportunity to move forward. If we act, we can move forward our desire for a healthy planet, for corporate accountability, toward equality and away from racism, sexism, xenophobia and homophobia, for equitable access to opportunity, for full access to the medical care we want or need, for fair and just immigration policies.” The creator claimed that although politics was “messy,” Harris and her running mate, Minnesota Gov. Tim Walz, represented the best chance for the country to continue moving forward. “This art is a tool of grassroots activism for all to use non-commercially,” Fairey concluded. “I was not paid for it and will not receive any financial benefit from it. I created this work purely in pursuit of a better future. Let’s get there together!” Fairey is also known for his poster variations of Obama’s poster that say “Change” and “Vote,” as well as the “Andre the Giant Has a Posse” sticker he designed back in 1989.","summary":"\"I created this work purely in pursuit of a better future,\" the Obey clothing founder and activist says\n\n\nThe post Iconic Obama &#8216;Hope&#8217; Poster Artist Shepard Fairey Makes Kamala Harris Print With a New Message: Forward appeared first on TheWrap.","url":"https://www.thewrap.com/kamala-harris-obama-hope-poster-shepard-fairey/","image":"https://www.thewrap.com/wp-content/uploads/2024/08/Kamala-and-Obama-poster.jpeg","video":null,"publish_date":"2024-08-15 22:44:02","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","source_country":"US","sentiment":-0.052},{"id":254215074,"title":"Trump held another press conference - but it was the same old shtick","text":"Donald Trump summoned reporters to one of his properties for the second time in as many weeks on Thursday -but they would be hard-pressed to find something new or interesting to write about. Trump spoke for roughly 40 minutes before taking questions at his Bedminster, New Jersey golf resort. His lengthy diatribe touched on his opponent, Vice President Kamala Harris, his former opponent, Joe Biden, and a wide range of other issues — trucks, domestic energy policy, China and the wars in Gaza and Ukraine — all while flanked by two tables covered in groceries including Cheerios, a pack of quickly-warming raw bacon and tins of coffee. It was a spectacle that was clearly focused by his campaign to provide a platform for the GOP contender to attack Harris over economic issues, particularly inflation and the cost of consumer goods. However, the lack of any central focus in Trump’s remarks led to the event dragging on and losing some of its edge. In his first question, he was asked about Israel and his communications with Benjamin Netanyahu, rather than the economy. Questions were largely softballs and teed up the ex-president to launch attacks at Harris and set out a plan for his second-term agenda. But the president didn’t offer much of a vision for the future or how he would tackle the issues. Instead, he opted to look to the post to talk about the conditions when he was in the White House. Journalists failed to ask about newly uncovered remarks from JD Vance, his running mate, declaring “the whole purpose” of post-menopausal women to be assisting with child-rearing. “You've spoken very passionately about how God saved your life. And I'm wondering, have you put much thought into why God saved your life? As in, for what purpose has he been shielding you?” one reporter, veering closely towards cheerleading, asked Trump. The ex-president responded by riffing about his teleprompter and a chart displayed behind him at a rally in Butler, Pennsylvania, where he was nearly assassinated in July, before quipping: “Yeah, God has something to do with it. It's, it's a miracle, and God had something to do with it. And maybe it's [because] we want to save the world.” One change of pace for Trump appeared to be his apparent newfound acceptance of the fact that Harris will indeed be his opponent in the fall. While he derided the pressure campaign calling on Joe Biden to exit the 2024 race as a “coup”, there was no mention of his past suggestion that Biden would appear at the upcoming Democratic National Convention to attempt to “take back” his party’s nomination. The former president also attempted to back away from his remarks in support of Elon Musk firing striking workers, though he vaguely suggested that he wanted workers to accept wages that would allow companies to make profits. But more than anything else, this was a rehashing of the same flustered response to the newly-crowned Harris’s sudden recovery in the polls: none of his criticism of Harris or Tim Walz, her running mate, was any different from what Republicans have been slinging at the Harris campaign over the past few weeks since the incumbent president stepped aside from the campaign. Perhaps the clearest sign of that was Trump’s ongoing inability to pronounce Harris’s name — “Kamala”, he repeated several times, with different pronunciations at different moments during his remarks. He also claimed that people did not know Harris’s last name: “it’s Harris”, he informed reporters at his presser. Harris’s campaign, meanwhile, was busy pounding away at their opponent hours before the ex-president even took the microphone. “TODAY: Donald Trump To Ramble Incoherently and Spread Dangerous Lies in Public, but at Different Home,” the vice president’s campaign declared in a news release ahead of his remarks. It then presciently advised: “Tune in for the same old thing.”","summary":"Analysis: John Bowden details how the latest press conference from Donald Trump offered nothing new or different as the president continues to use the same messaging that has seen him drop in the polls.","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-press-conference-bedminster-harris-b2597145.html","image":"https://static.independent.co.uk/2024/08/15/23/SEI217524298.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/HbhLMibu-4VHSaSK0.mp4","publish_date":"2024-08-15 22:41:24","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.251},{"id":254214640,"title":"Donald Trump 'Flailing Wildly' During Presser, Ex-Obama Advisor Warns","text":"Former President Donald Trump was \"flailing wildly\" while attempting to attack Vice President Kamala Harris during a press conference on economic policies, according to a former key adviser to ex-President Barack Obama.Speaking at his Trump National Golf Club in Bedminster, New Jersey, on Thursday, the former president told reporters that he feels \"entitled to personal attacks\" on Harris because he does not \"have a lot of respect for her\" or \"her intelligence.\"While Trump blamed Harris for President Joe Biden's economic policies and illustrated inflation with a display of cereal boxes, he also strayed off topic by repeating false claims that his 2020 election loss was illegitimate and re-airing grievances about his legal troubles.In a series of posts to X, formerly Twitter, David Axelrod, who served as chief strategist for both of Obama's successful presidential campaigns, compared Trump's display to \"a rattled old boxer\" desperately attempting to attack a younger fighter in the form of Harris.\"'I think I'm entitled to personal attacks.' Trump seems like a rattled old boxer,\" Axelrod wrote. \"Trapped in the corner by a younger, agile fighter, and flailing wildly.\"\"This is really something,\" he added in a subsequent post. \"It is like watching someone have a nervous breakdown in public. He can't control himself.\"Newsweek reached out for comment to the Trump campaign via email on Thursday night.This is a developing story and will be updated as more information becomes available.","summary":"Trump said he feels \"entitled to personal attacks\" on Vice President Kamala Harris during a press conference on economics.","url":"https://www.newsweek.com/donald-trump-flailing-wildly-presser-adviser-1940089","image":"https://d.newsweek.com/en/full/2451125/donald-trump-flailing-wildly-david-axelrod-election.jpg","video":null,"publish_date":"2024-08-15 22:40:39","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.318},{"id":254215004,"title":"What to know about Tim Walz’s 1995 drunken driving arrest and how he responded","text":"MINNEAPOLIS (AP) — Now that Minnesota Gov. Tim Walz is Vice President Kamala Harris ‘ running mate, his drunken driving arrest from 1995 in Nebraska — long before he entered politics — is getting renewed scrutiny. Walz was a 31-year-old teacher when he was stopped the night of Sept. 23, 1995, near Chadron, Nebraska. He pleaded guilty in March 1996 to a reduced charge of reckless driving. Here’s a look back at what happened, and the aftermath as Walz embarked on a political career a decade later, and last week joined the Democratic presidential ticket: The case According to court records, a Nebraska state trooper clocked Walz going 96 mph in a 55-mph zone. The trooper wrote that he detected a strong smell of alcohol on his breath. Walz failed field sobriety and preliminary breath tests. He was taken to a hospital for a blood test and was booked into the Dawes County Jail. A transcript of his plea hearing on March 13, 1996, quotes the prosecutor as saying his blood test showed an alcohol level of 0.128%, compared with a legal limit of 0.10%. Walz’s attorney told the court Walz thought someone was chasing him because the trooper came up fast and didn’t turn on his red lights right away. The defense attorney acknowledged that Walz had been drinking but argued for a fine, saying his blood alcohol level was “relatively low.” He also noted that Walz was a teacher at a local high school and “felt terrible about this, was real disappointed, I guess, in himself.” He said Walz reported the incident to his principal, resigned from his coaching position and offered to quit his teaching job “because he felt so bad.” He said the principal talked him into staying on as a teacher, and that Walz was now telling students about what happens if one gets caught for drinking and driving. Walz lost his license for 90 days and was fined $200. Walz has said he quit drinking alcohol after his arrest. He now prefers Diet Mountain Dew. The incident surfaces A Republican blogger surfaced some court documents in 2006 when Walz made his first run for Congress, in which he ultimately upset incumbent Republican Rep. Gil Gutknecht. A few news outlets in the southern Minnesota district did stories, but it didn’t become a big issue in that campaign. It went largely forgotten until Walz ran for governor in 2018, when it got a mention in a broader profile by the Star Tribune of Minneapolis. He told the newspaper it was a gut-check moment, and an impetus to change his ways. His wife, Gwen, recalled to the newspaper that she told him: “You have obligations to people. You can’t make dumb choices.” Distortions The arrest resurfaced again after Harris picked Walz last week, and Republicans and media outside Minnesota started taking a closer look at his past. The main revelation was that Walz campaign staffers in 2006 gave misleading information to the few news outlets that wrote about it at the time. His campaign manager told the Post-Bulletin of Rochester that he was not drunk. She said Walz couldn’t understand what the trooper was saying to him because he had a hearing loss from his service in an artillery unit in the National Guard, and suggested that he might have had balance issues as a result. She also falsely claimed that the judge who dismissed the drunken driving charge chastised the officer for not realizing that Walz was deaf. His campaign spokeswoman made similar statements to KEYC-TV and The Journal of New Ulm, saying, “The DUI charge was dropped for a reason: It wasn’t true.” She claimed he failed the field sobriety test because of his deafness, and that the trooper let Walz drive to a police station and leave on his own. The court records don’t mention any ear issues and make clear that the trooper took him to jail. The transcript showing that he acknowledged in court that he was drunk apparently didn’t surface until 2022, when the conservative Minnesota site Alpha News reported on it. The Harris-Walz campaign did not immediately respond to a request for comment on why his former campaign staffers provided incorrect information. Walz did have ear surgery in 2005 to remedy his hearing loss. Steve Karnowski, The Associated Press","summary":"Now that Minnesota Gov. Tim Walz is Vice President Kamala Harris ' running mate, his drunken driving arrest from 1995 in Nebraska  is getting renewed scrutiny.","url":"https://toronto.citynews.ca/2024/08/15/what-to-know-about-tim-walzs-1995-drunken-driving-arrest-and-how-he-responded/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/f79af06f2552f425ab8af57be22461fdf25607fdad83e7d982574367be5e8e6a.jpg","video":null,"publish_date":"2024-08-15 22:39:37","author":"News Staff,Steve Karnowski","authors":["News Staff","Steve Karnowski"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.333},{"id":254214872,"title":"Kamala Harris & Tim Walz Share Their Love for Prince, Bruce Springsteen & More: ‘I Feel Like a Trip to Paisley Park Is Going to Happen Here’","text":"With the presidential elections approaching, the Democratic ticket is helping voters get to know them on a personal level. Kamala Harris and her selected Vice President, Minnesota governor Tim Walz, sat down for a wide-ranging chat uploaded to YouTube on Thursday (Aug. 15), where the duo discuss topics including their childhoods, taco recipes and their hope for the future of America. They also share a love for music, and the conversation led to each politician sharing the music that shaped them throughout their lives. For Walz, it started with Bruce Springsteen’s 1980 album The River, which he called a “transformational piece of music” for him. He also shared his love for Bob Seger. “My first car, it was the summer of 1980 and I’d been saving up. I buy a 1973 orange Chevy Camaro,” he recalled. “Got an eight-track player in it. The previous owner left Bob Seger’s Night Moves in there. I listened to it, and it’s kind of the soundtrack of my life. […] What’s really great about it is I’ve got a ’79 international that’s my car and it’s got an eight-track player in it. I have the very eight-track to this day.” For Harris, Aretha Franklin was a major part of her childhood. “My mother had every Aretha album and our Christmas gift to my mother, her birthday gift was always like, what’s the latest Aretha Franklin record?” she explained. Harris added that while Stevie Wonde, Miles Davis and John Coltrane were also fixtures within her family home, one of her “personal favorite musicians” was Minnesota’s own Prince. “My husband Doug and I — I’m more of a hip-hop girl, and he’s more Depeche Mode,” she shared. “However, in the Venn diagram of things, Prince he and I love the same. Talk about how Prince was with that guitar, man. I almost know by heart every one of those songs.” “I feel like a trip to Paisley Park is going to happen here,” Walz said of the late icon’s beloved Minnesota estate, to which Harris happily replied, “It’s on my bucket list.” Watch Kamala Harris and Tim Walz’s full conversation below.","summary":"The duo discussed their respective relationships with music.","url":"https://www.billboard.com/music/music-news/kamala-harris-tim-walz-talk-music-prince-bruce-springsteen-1235754359/","image":"https://www.billboard.com/wp-content/uploads/2024/08/kamala-harris-tim-walz-philadelphia-2024-billboard-1548.jpg","video":null,"publish_date":"2024-08-15 22:38:46","author":"Rania Aniftos","authors":["Rania Aniftos"],"language":"en","source_country":"US","sentiment":0.657},{"id":254215072,"title":"What to know about Tim Walz's 1995 drunken driving arrest and how he responded","text":"Now that Minnesota Gov. Tim Walz is Vice President Kamala Harris ' running mate, his drunken driving arrest from 1995 in Nebraska — long before he entered politics — is getting renewed scrutiny. Walz was a 31-year-old teacher when he was stopped the night of Sept. 23, 1995, near Chadron, Nebraska. He pleaded guilty in March 1996 to a reduced charge of reckless driving. Here's a look back at what happened, and the aftermath as Walz embarked on a political career a decade later, and last week joined the Democratic presidential ticket: The case According to court records, a Nebraska state trooper clocked Walz going 96 mph in a 55-mph zone. The trooper wrote that he detected a strong smell of alcohol on his breath. Walz failed field sobriety and preliminary breath tests. He was taken to a hospital for a blood test and was booked into the Dawes County Jail. A transcript of his plea hearing on March 13, 1996, quotes the prosecutor as saying his blood test showed an alcohol level of 0.128%, compared with a legal limit of 0.10%. Walz's attorney told the court Walz thought someone was chasing him because the trooper came up fast and didn't turn on his red lights right away. The defense attorney acknowledged that Walz had been drinking but argued for a fine, saying his blood alcohol level was “relatively low.” He also noted that Walz was a teacher at a local high school and “felt terrible about this, was real disappointed, I guess, in himself.” He said Walz reported the incident to his principal, resigned from his coaching position and offered to quit his teaching job “because he felt so bad.” He said the principal talked him into staying on as a teacher, and that Walz was now telling students about what happens if one gets caught for drinking and driving. Walz lost his license for 90 days and was fined $200. Walz has said he quit drinking alcohol after his arrest. He now prefers Diet Mountain Dew. The incident surfaces A Republican blogger surfaced some court documents in 2006 when Walz made his first run for Congress, in which he ultimately upset incumbent Republican Rep. Gil Gutknecht. A few news outlets in the southern Minnesota district did stories, but it didn't become a big issue in that campaign. It went largely forgotten until Walz ran for governor in 2018, when it got a mention in a broader profile by the Star Tribune of Minneapolis. He told the newspaper it was a gut-check moment, and an impetus to change his ways. His wife, Gwen, recalled to the newspaper that she told him: “You have obligations to people. You can’t make dumb choices.” Distortions The arrest resurfaced again after Harris picked Walz last week, and Republicans and media outside Minnesota started taking a closer look at his past. The main revelation was that Walz campaign staffers in 2006 gave misleading information to the few news outlets that wrote about it at the time. His campaign manager told the Post-Bulletin of Rochester that he was not drunk. She said Walz couldn't understand what the trooper was saying to him because he had a hearing loss from his service in an artillery unit in the National Guard, and suggested that he might have had balance issues as a result. She also falsely claimed that the judge who dismissed the drunken driving charge chastised the officer for not realizing that Walz was deaf. His campaign spokeswoman made similar statements to KEYC-TV and The Journal of New Ulm, saying, \"The DUI charge was dropped for a reason: It wasn’t true.” She claimed he failed the field sobriety test because of his deafness, and that the trooper let Walz drive to a police station and leave on his own. The court records don't mention any ear issues and make clear that the trooper took him to jail. The transcript showing that he acknowledged in court that he was drunk apparently didn't surface until 2022, when the conservative Minnesota site Alpha News reported on it. The Harris-Walz campaign did not immediately respond to a request for comment on why his former campaign staffers provided incorrect information. Walz did have ear surgery in 2005 to remedy his hearing loss.","summary":"Now that Minnesota Gov. Tim Walz is Vice President Kamala Harris’ running mate, his drunken driving arrest from 1995 in Nebraska — long before he entered politics — is getting renewed scrutiny","url":"https://www.independent.co.uk/news/world/americas/tim-walz-ap-minnesota-kamala-harris-nebraska-b2597151.html","image":"https://static.independent.co.uk/2024/08/15/23/Election_2024_Walz_75033.jpg?width=1200","video":null,"publish_date":"2024-08-15 22:38:09","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.333},{"id":254215208,"title":"Donald Trump Responds to Being Called Weird by Insisting Harris and Walz Are: ‘No, He’s a Weird Guy’ | Video","text":"Donald Trump didn’t start taking questions from reporters until nearly an hour into his Thursday press conference, but one of the first questions led the former president to respond to what he called “personal attacks” — including being called “weird” by Democrats, led by Tim Walz. After attacking Vice President Kamala Harris both on policy and by stating “I don’t have a lot of respect for her intelligence,” he turned to the Democratic pair’s use of the term “weird” to describe Republicans, which Walz popularized. “She certainly attacks me, personally. She actually called me ‘weird,’” Trump began, before going on to defend both himself and particularly his running mate. “‘He’s weird.’ It was just a soundbite — and she called J.D. and I ‘weird.’ He’s not weird — he was a great student at Yale, he went to Ohio State, graduated in two years, at the top of his class and all of these different things.” Turning to criticize Minnesota Gov. Walz, Trump continued, “And we have this guy that’s running a failed, really, a very failed state, who’s had a terrible career. I mean, you have him saying, ‘They’re weird’ — no, he’s a weird guy.” Trump then pivoted, looking to turn the “weird” term around on Harris in a different way. “And she’s weird in her policy. Who wouldn’t want to have strong borders? Who doesn’t want to have lower taxes?” Among other attacks of his own, Trump continued the standard conservative talking point of calling liberal policies “communist,” including remarking that under Harris, “You’re all going to be thrown into a communist system. You will be thrown into a system where everybody gets health care.” Trump spoke next to a table full of common groceries, which he joked about taking back to his cottage at his golf club in Bedminster, New Jersey — particularly the Cheerios. The props were used to drive home the Trump-Vance campaign’s argument about inflation under President Joe Biden and Vice President Harris. The former president also defended his stylistic approach during the long press conference, which featured numerous tangents throughout, including more talk about batteries — but this time, the batteries in electric vehicles as opposed to batteries and sharks. “I think I’m doing a very calm campaign,” he said. “We are here. There is no shouting. Some of you will say he ranted and raved. I didn’t rant and rave. I’m a very calm person.” As far as personal remarks of his own, Trump again brought up the illustration of Harris on the cover of Time Magazine after previously stating that it was so beautiful that it made her look reminiscent of his own wife, Melania. “They got a great artist to do it. What was that all about? The whole thing is crazy,” he said. This is Trump’s second press conference in a week as the Trump campaign criticizes Harris for still not giving a press conference since taking over the top of the Democratic Party’s ticket. She has been running for less than a month and will be speaking at rallies and the Democratic National Convention next week, while her campaign has also committed to doing a sitdown interview by the end of the month. You can watch Donald Trump’s full Thursday press conference in the video, below","summary":"Defending J.D. Vance, the Republican candidate adds, \"He's not weird — he was a great student at Yale, he went to Ohio State\"\n\n\nThe post Donald Trump Responds to Being Called Weird by Insisting Harris and Walz Are: &#8216;No, He&#8217;s a Weird Guy&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/weird-trump-jd-vance-tim-walz/","image":"https://www.thewrap.com/wp-content/uploads/2024/08/GettyImages-2166231401.jpg","video":null,"publish_date":"2024-08-15 22:34:50","author":"Mike Roe","authors":["Mike Roe"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.149}]}