{"offset":0,"number":50,"available":549,"news":[{"id":347418104,"title":"Astonishing whispers about Katy Perry and Justin Trudeau's date: Why he feels 'ambushed' and insiders now say he's the victim of a fading pop star: TOM LEONARD","text":"Only three months ago she described herself as 'battered and bruised' by the vicious backlash to her trip into space on Jeff Bezos's Blue Origin rocket but courageously reassured fans that she would 'keep looking to the light'.\n\nEarlier this week, however, Katy Perry was instead gazing into the clear blue eyes of dreamboat ex-Canadian prime minister Justin Trudeau across a restaurant table in Montreal.\n\nWhat a remarkable change in fortunes for a pop star who'd been having a pig of a year, both professionally and privately, one that reached its nadir just a month ago when she announced her split from her actor fiancé Orlando Bloom.\n\nThe dinner was also a welcome development for Trudeau, once the darling of the liberal Western world – especially the female half – but who dramatically resigned in January as his popularity plummeted amid a string of scandals and setbacks, including his 2023 split from wife Sophie.\n\nOn Monday evening, however, the battle-scarred pair put the damaging headlines and unfortunate break-ups behind them at super-hip Le Violon – named Canada's 'Best New Restaurant' when it opened last year – where they spent several hours chatting as they ploughed through the 'chef's tasting menu' (including tuna, steak tartare, lobster and lamb).\n\nThey later had cocktails at a nearby terrace bar where it was claimed (although there is no photographic evidence) that Trudeau had his arm 'practically welded' to Perry's waist.\n\nBut today the Daily Mail can reveal that everything may not be quite what it seems, with one specialist in the dark arts of celebrity public relations claiming that Trudeau may have been the victim of a manipulative, fading pop star looking for love.\n\nRob Shuter, a former celebrity publicist who once represented disgraced music mogul Sean 'P Diddy' Combs, revealed to the Daily Mail that sources close to the couple had told him that Perry 'really likes' Trudeau and thought their dinner was a 'date'. The retired politician, however – while he'd enjoyed her company – considered it was 'no more than dinner'.\n\nShuter added: 'I've heard [Trudeau] feels a bit ambushed by all this.'\n\nAmbushed? Shuter's information is that Perry set up the dinner – and possibly Trudeau, too. 'He wanted tickets to her show and she invited him,' he said. 'While that was going on, she invited him for dinner.'\n\nIf Perry did set up the rendezvous, it has helpfully catapulted her into the spotlight at a time when she badly needs some good publicity. The Teenage Dream singer's 84-date world tour got off to a rocky start in April when fans criticised her lacklustre dance moves, underwhelming vocals and clunky costumes, while ticket sales are said to have been disappointing.\n\nMeanwhile, Trudeau also finds himself struggling to rebuild his tarnished reputation and find a new career at the relatively young age of 53.\n\nHe would probably benefit from a public 'showmance', too. Toronto publicist Natasha Koifman told Canada's CBC News she had little doubt the pair wanted to be seen, as there must have been far more discreet options than a window table at the hottest restaurant in town.\n\n'I think that was actually probably a strategic move,' she said. 'I think it elevates both of their brands, for very different reasons, to be seen together.'\n\nUsing the jargon of her industry, she described their unlikely connection as a 'really great brand and reputational move'.\n\nStaff at the restaurant, including its chef, who chatted briefly with the couple, have insisted there was 'no PDA' (public display of affection) between them. And friends of Perry are also reportedly dubious, saying she never normally keeps matters of the heart to herself but has been silent about Trudeau.\n\nThe couple couldn't have been less discreet. The Daily Mail was told that far from trying to be private about their meet-up, they made no attempt to disguise their booking and chose a fashionable restaurant that often has paparazzi or celebrity watchers waiting outside.\n\nThen, as if to maximise the chance of being spotted, they sat at a table near a window and later visited the kitchen to thank the staff.\n\nAnd they didn't just meet up for dinner. It has emerged that they'd spent part of the preceding afternoon together, walking one of her dogs in a local park. And two days later, on Wednesday evening, Trudeau was photographed with his 16-year-old daughter in prime seats at the Montreal date of Perry's Lifetimes tour.\n\nNeither Perry, 40, nor Trudeau have yet commented on the fevered speculation, with the result that Canadians, who usually like to think they're too high-minded to be interested in such tittle-tattle, have been wondering whether the politician once dubbed the 'Crown Prince of Woke' had followed in the footsteps of his lady-killer father with the singer dubbed the 'Queen of Camp'.\n\nLike his son, Pierre Trudeau served as Canada's PM, retiring in 1984 after 15 years in office. After separating from Justin's mother Margaret in 1977, he was romantically linked with a string of glamorous stars including Barbra Streisand, Superman's Margot Kidder and Sex And The City actress Kim Cattrall. Margaret Trudeau was not exactly a nun either, enjoying affairs with Jack Nicholson and Ryan O'Neal, and hanging out with the Rolling Stones.\n\nIs history now repeating itself, some ask.\n\nApart from being thrown together in adversity there's precious little else that they have in common – apart, that is, from the weird coincidence of both having had their Left-wing 'progressive' credentials tarnished by 'blackface' scandals.\n\nTrudeau was severely embarrassed in 2019 when it was revealed that he had worn skin-darkening make-up three times in his past – twice with an Afro wig. The pictures emerged just five weeks before a general election but he survived after grovelling to voters, saying he 'should have known better'.\n\nPerry's blackface crisis blew up the very same year after one of the designs in her range of Katy Perry shoes – blue eyes and red lips on black leather –was deemed to be racist.\n\nOnline critics compared it with 'painful images' of blackface. The offence was hardly on a par with Trudeau's but she apologised and immediately withdrew them from sale.\n\nPerry, the daughter of two Pentecostal pastors, originally tried to launch her music career as a wholesome Christian singer but when that didn't work, she had a drastic re-think and played the sex kitten, scoring a No 1 hit in 2008 with her raunchy first single, I Kissed A Girl.\n\nAfter weathering a 2010 marriage to Russell Brand that lasted 14 months, she became one of the biggest-selling music artists ever – with sales of more than 143 million records – but critics say her brand of bubbly pop stagnated years ago, along with her tiresome theme of hyper-sexualised female empowerment. Perry still has more than 104 million followers on X but that doesn't mean they all love her.\n\nFor many, devotion has turned to contempt as she appeared to become increasingly desperate to rediscover commercial success – she hasn't had a top-ten hit since 2016.\n\nLast year's Woman's World was supposed to be her great comeback record but was mocked as a cynical attempt to cash in on Kamala Harris's ill-fated presidential run.\n\nIt was on an album that flopped and, to make matters worse, she made it with a producer who'd been accused of raping a woman.\n\nHer image as a compassionate feminist took another knock when, in 2015, she embarked on a protracted and ugly dispute with two elderly nuns to turn their former convent into her glitzy new home. Perry was allegedly so aggressive that one nun's dying words were: 'Katy Perry, please stop.'\n\nSo she was already drawing considerable online flak when, in April, she joined Jeff Bezos's all-female Blue Origin space flight, singing Louis Armstrong's What A Wonderful World to her fellow passengers, and the online abuse soared off the chart.\n\nPerry's fame and post-mission theatrics – bending down to kiss the ground on landing after the ten-minute flight – helped ensure that she took most of the vitriol when the flight was engulfed in a monumental backlash.\n\nCritics lambasted it as a frivolous and tone-deaf PR stunt that ignored the huge environmental cost of space tourism. Even the fast-food chain Wendy's joined in, mockingly asking: 'Can we send her back?' Perry complained that social media had turned her into a 'human pinata'.\n\nIn June, there was more drama when it was confirmed that she and Orlando Bloom, 48, had separated after nine years. They'd been engaged since 2019 and Perry gave birth to their daughter, Daisy, in 2020.\n\nAlthough they are reportedly on amicable terms and share parenting duties, some believe Bloom rubbed salt into the wound of their break-up by attending the late June wedding of Perry's great pal Lauren Sanchez to Jeff Bezos in Venice – despite Perry being unable to attend because she was performing in Australia.\n\nDinner and drinks with a human pinata is not calculated to burnish anyone's reputation, but Justin Trudeau is hardly Mr Popular either nowadays.\n\nAccording to political pundits, he was afflicted by essentially the same problem as Perry – the public got sick of the sight of him during ten years as Canadian PM, during which he and the media couldn't get enough of each other.\n\nCanadians have barely heard or seen anything of their once ubiquitous leader since he stepped down in March under pressure from his own Liberal Party. Amid serious economic problems, in part due to his open-door policy on legal immigration, and plummeting poll ratings, he'd become a huge political liability.\n\nHe didn't even try to keep his parliamentary seat in the federal election in late April.\n\nAs his star waned, Canadians were reminded of the various scandals that he'd survived when he was far more popular. They included three ethical controversies in which he was personally singled out for official criticism.\n\nBut his critics were riled as much as anything by Trudeau's stratospheric smugness and wokery – he was a master of style over substance who, alongside his equally narcissistic wife, would post photos online ranging from their impressively athletic yoga positions to them and their three children ridiculously dressed in traditional costumes during a 2018 trip to India.\n\nIn 2011, he performed a partial striptease at a charity gala and, ahead of the 2016 Invictus Games for disabled veterans, did some show-off press-ups for the media.\n\nUS Vogue rated him one of the sexiest men alive, fawning over how he was a 'feminist and capable of balancing a baby on one hand'. And Trudeau's wokeness reached new heights in 2018, when he corrected a woman for using the word 'mankind', telling her: 'We like to say 'peoplekind'.'\n\nThe 2023 collapse of his marriage to Sophie, a former TV presenter and close friend of the Duchess of Sussex, was hardly a surprise given they'd admitted to having problems for years. Trudeau denied rumours of infidelity, although his wife was more ambiguous when asked.\n\nThe ex-wife of an Ottawa paediatric surgeon named Marcos Bettolli later claimed in court papers that he'd been in a romantic relationship with Sophie some months before the Trudeaus announced they were separating.\n\nTrudeau, however, has not been linked with any woman since the split until now and he was reportedly anxious to concentrate on bringing up their three children: Xavier, 17, Ella-Grace, 16, and Hadrien, 11.\n\nXavier, incidentally, is trying to break into the music business and has just released his first record – a topic that one hopes came up with Perry.\n\nAfter all, if love really does blossom between North America's unlikeliest couple, they need to find something more than their terrible approval ratings to talk about.","summary":"Only three months ago she described herself as 'battered and bruised' by the backlash to her trip into space on Jeff Bezos's rocket but  reassured fans that she would 'keep looking to the light'.","url":"https://www.dailymail.co.uk/news/article-14963483/Katy-Perry-Justin-Trudeaus-date-victim-TOM-LEONARD.html","image":"https://i.dailymail.co.uk/1s/2025/08/01/18/100852253-0-image-m-34_1754067748652.jpg","video":null,"publish_date":"2025-08-02 00:35:28","author":"Editor,Tom Leonard","authors":["Editor","Tom Leonard"],"language":"en","source_country":"gb","sentiment":0.171},{"id":347412186,"title":"Ex-Trump Commissioner Warns of 'Dangerous Precedent' After New Firing","text":"President Donald Trump's firing of Dr. Erika McEntarfer, U.S. Bureau of Labor Statistics (BLS) commissioner, was \"totally groundless\" and \"sets a dangerous precedent,\" warns William Beach, former bureau chief.Newsweek reached out to economic analysts via email for comment Friday.Why It MattersThe dismissal of McEntarfer by Trump has raised significant concerns among economists and former officials regarding the independence of the BLS and the integrity of federal economic data.The firing followed the release of bleak job figures for July, as Trump claimed the numbers were \"rigged,\" without providing evidence. The number of new jobs dipped well below even modest expectations, with only 73,000 positions added, compared to the Dow Jones estimate of 100,000.The firing coincided with a significant drop in U.S. stock markets. The Dow Jones Industrial Average lost 542 points (1.2 percent), the S&P 500 fell 1.6 percent and the Nasdaq composite dropped 2.2 percent. This downward movement was attributed to both weak job figures and a new round of U.S. tariffs announced by Trump.What To KnowTrump announced McEntarfer's firing on Truth Social Friday, also accusing her of manipulating data to benefit former Vice President Kamala Harris around the 2024 presidential election \"to try and boost Kamala's chances of Victory.\"Beach took to X, formerly Twitter, to voice his frustrations with Trump's decision, saying in part, \"The totally groundless firing of Dr. Erika McEntarfer, my successor as Commissioner of Labor Statistics at BLS, sets a dangerous precedent and undermines the statistical mission of the Bureau.\"He also attached a full statement, which in part added: \"Today, President Trump called into question the integrity of the Employment Situation report that the BLS released this morning. He accused BLS Commissioner Erika McEntarfer of deliberately reporting false numbers to reflect poorly on this administration. This baseless, damaging claim undermines the valuable work and dedication of BLS staff who produce the reports each month. This escalates the President's unprecedented attacks on the independence and integrity of the federal statistical system.\"Beach added that he and other Friends of BLS Co-Chairs are calling for Congress to investigate Dr. McEntarfer's removal and to \"respond immediately.\"Trump nominated Beach for commissioner in 2017.McEntarfer's tenure as BLS commissioner began following her 2024 Senate confirmation by an 86-8 vote after being nominated by former President Joe Biden. She previously held senior roles in the Treasury Department, White House Council of Economic Advisers and U.S. Census Bureau, her bio notes.What People Are SayingJustin Wolfers, professor of economics at the University of Michigan, posted to X on Friday: \"This is a remarkable — and brave — statement from the guy who was Trump's handpicked BLS Commissioner in Trump's first term.\"Representative Marcy Kaptur, an Ohio Democrat, posted to X on Friday: \"Firing the nonpartisan commissioner of Bureau of Labor Statistics just hours after a deeply worrying report showing serious job loss in manufacturing is what you'd expect in a Banana Republic. Dr. McEntarfer is nonpartisan, and was confirmed with 86 bipartisan votes. This is no way to run a nation.\"What Happens NextIt is immediately unclear who will replace McEntarfer. Trump said in his post on Truth Social that \"She will be replaced with someone much more competent and qualified.\"","summary":"The removal followed the release of bleak job figures as Trump accused the numbers of being \"rigged.\"","url":"https://www.newsweek.com/ex-trump-commissioner-warns-dangerous-precedent-after-new-firing-2107884","image":"https://d.newsweek.com/en/full/2695303/donald-trump.jpg?w=1600&h=900&q=88&f=dae03f49e91a4c1a16d167dba6903acf","video":null,"publish_date":"2025-08-02 00:09:24","author":"Anna Commander","authors":["Anna Commander"],"language":"en","source_country":"US","sentiment":-0.207},{"id":347409936,"title":"Kamala Harris says U.S. political system is “broken” in first interview since 2024 loss (Video)","text":"Former Vice President Kamala Harris told Stephen Colbert on Thursday night's \"Late Show\" that she decided against a run for California governor because the system is \"broken.\" Political strategists Joel Payne and Leslie Sanchez join \"The Takeout\" with analysis.\n\nCBS News 24/7 is the premier anchored streaming news service from CBS News and Stations that is available free to everyone with access to the internet and is the destination for breaking news, live events, original reporting and storytelling, and programs from CBS News and Stations' top anchors and correspondents working locally, nationally and around the globe. It is available on more than 30 platforms across mobile, desktop and connected TVs for free, as well as CBSNews.com and Paramount+ and live in 91 countries.\n\nSubscribe to the CBS News YouTube channel: https://youtube.com/cbsnews\nWatch CBS News 24/7: https://cbsnews.com/live/\nDownload the CBS News app: https://cbsnews.com/mobile/\nFollow CBS News on Instagram: https://instagram.com/cbsnews/\nLike CBS News on Facebook: https://facebook.com/cbsnews\nFollow CBS News on X: https://x.com/cbsnews\nSubscribe to our newsletters: https://cbsnews.com/newsletters/\nTry Paramount+ free: https://paramountplus.com/?ftag=PPM-05-10aeh8h\n\nFor video licensing inquiries, contact: licensing@veritone.com","summary":"Former Vice President Kamala Harris told Stephen Colbert on Thursday night's \"Late Show\" that she decided against a run for California governor because the system is \"broken.\" Political strategists Joel Payne and Leslie Sanchez join...\n\n\nThe post Kamala Harris says U.S. political system is &#8220;broken&#8221; in first interview since 2024 loss (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/08/01/kamala-harris-says-u-s-political-system-is-broken-in-first-interview-since-2024-loss-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/08/02/maxresdefault.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1754093825","video":null,"publish_date":"2025-08-01 23:47:05","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","source_country":"in","sentiment":0.019},{"id":347408772,"title":"The Five - Friday, August 1","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode August 01, 2025 38:20 \n FULL EPISODE\n\n EXP 8 DAYS\n The Five - Friday, August 1 \n Donald Trump, Kamala Harris, White House\n Tags MOST RECENT EPISODES | VIDEOSTHE FIVE | FULL EPISODES","summary":"Donald Trump, Kamala Harris, White House","url":"https://www.foxnews.com/video/6376473910112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/bcd7b30e-8d74-4846-9274-fd5da5d4da1c/1c3457f8-651c-4318-b522-311554b2175d/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-08-01 23:46:10","author":null,"language":"en","source_country":"us","sentiment":-0.292},{"id":347409972,"title":"Top Dem senator posts 679-word salad excuse after she missed key vote to go on Stephen Colbert's doomed show","text":"Michigan Senator Elissa Slotkin posted a lengthy explanation for why she missed a vote on bills that would block arms sales to Israel to appear on Stephen Colbert's canceled CBS talk show instead. \n\nSlotkin, a former CIA agent and considered a rising star in the Democrat Party, raised eyebrows when she posted a photo from backstage at the Ed Sullivan Theater in New York to promote her appearance, writing: 'Tune in tonight!!'\n\nAfter missing the vote on the bill - which was rejected but saw a surprising majority of Democrats voting in favor - Slotkin attempted to explain herself in a 679-word long post to X. \n\nShe claimed that she 'unfortunately missed' the vote but then offered that she would have joined 27 other Democrats in voting for the bill, pushed by socialist independent Bernie Sanders. \n\n'I owe it to my state to make clear where I stand: Had I made it back for the vote yesterday, I would have voted yes to block offensive weapons to Israel based on my concerns over lack of food and medicine getting to civilians in Gaza,' she wrote.\n\nSlotkin, who is Jewish, added that she is a 'strong supporter of the Jewish State of Israel' but that she hears 'calls from Michiganders who have friends and family trying to survive in Gaza.'\n\nMichigan notably was a hotbed for the 'Uncommitted' movement, which refused to vote for Joe Biden and later Kamala Harris over the Democrats' support of Israel. \n\nAt no point did Slotkin apologize for her absence, instead saying the proposal was ineffective.\n\n'In general, I think these Disapproval votes are a bad way to do foreign policy. The Executive Branch, whether run by Democrats or now Republicans, has the responsibility to set U.S. foreign policy, and to lead negotiations with both allies and adversaries.' \n\nShe finished writing: 'No one leader should so significantly threaten the long-term security of the state of Israel. I urge the Trump Administration and the Israeli Prime Minister to get aid in as soon as possible and save lives.'\n\nPeople of all political stars and stripes seemed baffled by the lengthy post, asking Slotkin to simply do her job.\n\n'You skipped doing your job in order to appear on the Colbert show. Shame on you,' wrote one.\n\nFormer Ohio State Senator Nina Turner added: 'You don't need to explain being against sending offensive weapons to Israel. This is what your constituents want. No essay needed.'\n\nAIPAC Tracker, an account that publishes money given to American politicians by the pro-Israel lobby, wrote: 'The essay is not necessary, Senator. The people simply want you to stand against genocide. Your obfuscation is telling.' \n\nThe Senate rejected the effort Wednesday from Sanders to block the sale of U.S. bombs and firearms to Israel , though the vote showed a growing number of Democrats opposed to the arms sales amid widespread hunger and suffering in Gaza \n\nSanders, an independent from Vermont, has repeatedly tried to block the sale of offensive weapons to Israel over the last year. \n\nThe resolutions before the Senate on Tuesday would have stopped the sale of $675 million in bombs as well as shipments of 20,000 automatic assault rifles to Israel.\n\nThey again failed to gain passage, but 27 Democrats - more than half the caucus - voted for the resolution that applied to assault rifles, and 24 voted for the resolution that applied to bomb sales. \n\nIt was more than any of Sanders' previous efforts, which at a high mark in November last year gained 18 votes from Democrats.\n\nThe vote tally showed how the images of starvation emerging from Gaza are creating a growing schism in what has traditionally been overwhelming support for Israel from both Democratic and Republican lawmakers.\n\nSanders said Democrats are responding to 'a significant majority of the American people who are tired of spending billions and billions of dollars on an Israeli government which is currently starving children to death.'\n\nAs the war approaches its second year, the leading international authority on food crises said this week that a 'worst-case scenario of famine is currently playing out in the Gaza Strip.' \n\nInternational pressure, including from President Donald Trump, has led Israel to announce measures , including daily humanitarian pauses in fighting in parts of Gaza and airdrops. \n\nBut the U.N. and Palestinians on the ground say little has changed, and desperate crowds continue to overwhelm delivery trucks.\n\nThe Republican chairman of the Senate Foreign Relations Committee, Sen. Jim Risch of Idaho, argued that Hamas was to blame both for the conflict and the current situation in Gaza. All Republican senators voted against Sanders' resolutions.\n\n'They use the people of Gaza as human shields, and they steal the food that the people of Gaza need,' Risch said. \n\n'It is in the interest of America and the world to see this terrorist group destroyed.'\n\nKnown as joint resolutions of disapproval, the measures would have had to pass both houses of Congress and withstand any presidential veto to become binding. \n\nCongress has never succeeded in blocking arms sales with the joint resolutions.\n\nDemocratic senators spent an hour on Wednesday evening with a series of floor speeches calling attention to the children who have starved to death in Gaza. \n\nThey are also calling on the Trump Administration to recalibrate its approach to the conflict, including a large-scale expansion of aid into Gaza channeled through organizations experienced working in the area.\n\nSenate Democratic Leader Chuck Schumer said in a statement following the vote that the Trump administration and Israeli Prime Minister Benjamin Netanyahu 'have a responsibility to urgently' surge food and other aid into Gaza. Still, he voted against the resolution.\n\n'I have also long held that security assistance to Israel is not about any one government but about our support for the Israeli people,' said Schumer, a New York Democrat.\n\nOther senior Democrats were breaking from that standard.\n\nSen. Patty Murray, a Washington Democrat who voted against similar resolutions from Sanders in the past, voted in support of the legislation this time.\n\n'As a longtime friend and supporter of Israel, I am voting yes to send a message: the Netanyahu government cannot continue with this strategy,' she said in a statement.\n\nAnother Democrat, Sen. Dick Durbin of Illinois, said it was still 'painful' to support the resolution.\n\n'For many of us who have devoted our congressional careers to supporting Israel, standing by them through difficult times, it is impossible to really explain or defend what is going on today,' Durbin said. \n\n'Gaza is starving and dying because of the policies of Bibi Netanyahu.","summary":"Slotkin, considered a rising star in the Democrat Party, raised eyebrows when she posted a photo from backstage at the Ed Sullivan Theater in New York to promote her appearance.","url":"https://www.dailymail.co.uk/news/article-14964131/Democrat-senator-posts-word-salad-excuse-missed-vote-Stephen-Colbert.html","image":"https://i.dailymail.co.uk/1s/2025/08/01/23/100859583-0-image-a-8_1754088922480.jpg","video":null,"publish_date":"2025-08-01 23:20:09","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":-0.605},{"id":347406900,"title":"Republican senators raise concerns about Trump's firing of Labor Dept. official","text":"Some Republican senators have expressed concern about President Donald Trump’s decision Friday to fire the head of the Bureau of Labor Statistics hours after the release of the July jobs report. Several Republicans told NBC News that they would take issue with the firing of Erika McEntarfer, the commissioner of the BLS, if it is the result of Trump disliking the jobs report numbers, which showed the U.S. job market in the past months has been considerably weaker than previously thought. Trump defended his decision Friday, saying without evidence that the report’s numbers were “phony” and accused McEntarfer of releasing favorable jobs numbers before the election to give former Vice President Kamala Harris an edge. Sen. Cynthia Lummis, R-Wy., said if the data is untrustworthy, the public should find out, but firing the commissioner before knowing whether the numbers are inaccurate is “kind of impetuous.” “If the president is firing the statistician because he doesn’t like the numbers but they are accurate, then that’s a problem,” Lummis said. “It’s not the statistician’s fault if the numbers are accurate and that they’re not what the president had hoped for.” Sen. Thom Tillis, R-N.C., blasted Trump’s decision to fire McEntarfer as well. “If she was just fired because the president or whoever decided to fire the director just did it because they didn’t like the numbers, they ought to grow up,” Tillis said. Tillis announced in June that he does not intend to run for re-election, a day after opposing Trump’s “Big Beautiful Bill,” and subsequently drawing the president’s ire, including a threat to back a primary challenge against the senator. Sen. Rand Paul, R-Ky., who found out about the commissioner’s firing from NBC News’ question to him about it, said he did not know much about the topic but proceeded to question whether the move would be effective in improving the numbers. “We have to look somewhere for objective statistics. When the people providing the statistics are fired, it makes it much harder to make judgments that you know, the statistics won’t be politicized,” Paul said. “I’m going to look into it, but first impression is that you can’t really make the numbers different or better by firing the people doing the counting,” he added. Paul also opposed Trump’s “Big Beautiful Bill” last month. The senator said in June that due to his vocal opposition, he was uninvited from an annual White House picnic in the weeks leading up to the vote on the sweeping domestic policy package. However, Trump later said Paul and his family were invited. Democratic senators have spoken out against McEntarfer’s firing, too, with Senate Minority Leader Chuck Schumer, D-N.Y., accusing Trump of acting like “someone who imitates authoritarian leaders” during remarks on the Senate floor Friday. Sen. Bernie Sanders, I-Vt., called the move “the sign of an authoritarian type” and added, “what that means is, I think the American people are going to find it hard to believe the information that comes out of the government, because Trump will always want it to be great news, and when that happens, it’s hard for us to deal with the problems, because we don’t know what is going on.” Sen. Brian Schatz, D-Hawaii, went a step further, calling McEntarfer’s dismissal “the stuff of fascist dictatorships.”","summary":"Some Republican senators have expressed concern about President Donald Trump’s decision Friday to fire the head of the Bureau of Labor Statistics hours after the release of the July jobs report","url":"https://www.nbcnews.com/politics/donald-trump/republican-senators-raise-concerns-trumps-firing-bls-commissioner-rcna222584","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-08/250801-donald-trump-thom-tillis-seamless-2-up-split-3x2-ac-616p-6f144c.jpg","video":null,"publish_date":"2025-08-01 23:11:10","author":"Brennan Leach,Raquel Coronell Uribe","authors":["Brennan Leach","Raquel Coronell Uribe"],"language":"en","category":"politics","source_country":"us","sentiment":-0.25},{"id":347404728,"title":"Colbert fails to ask Harris about Biden decline, avoids her involvement in Trump's '60 Minutes' lawsuit","text":"Outgoing CBS \"The Late Show\" host Stephen Colbert failed to address the hottest topics with former Vice President Kamala Harris during his fawning interview on Thursday. Colbert rolled out the red carpet for Harris, who granted him her first interview since leaving office and took the opportunity to plug her forthcoming book \"107 Days\" about her failed presidential bid. However, Colbert avoided asking Harris anything about the controversy surrounding her ex-boss, former President Joe Biden, and the growing questions about his cognitive decline while in office. Multiple Biden aides, including his White House physician Kevin O'Connor, pleaded the Fifth when brought before Congress and several tell-all books have shed light on the former president's difficulty behind the scenes. KAMALA HARRIS SCOLDS ‘PILING ON’ AGAINST JOE BIDEN WHEN ASKED ABOUT SEPARATING HERSELF DURING 2024 CAMPAIGN Notably, Colbert emceed a star-studded fundraiser for Biden in March 2024. The closest Colbert got to broaching the subject was a couple of softball questions about Harris' experience after Biden's disastrous presidential debate in June 2024 and the moment he ended his reelection bid weeks later. Another giant elephant in the room was her involvement in President Donald Trump's \"election interference\" lawsuit against CBS News and parent company Paramount, which cascaded to a series of events that liberal critics say connect Paramount's settlement and its forthcoming merger with Skydance Media with the cancellation of \"The Late Show.\" Colbert has been outspoken with his criticism of his corporate bosses. The interview Harris gave to \"60 Minutes\" last October was at the center of Trump's lawsuit, which accused CBS News of deceptively editing her comments to aid her campaign. Critics at the time pointed out that her \"word salad\" response to a question about Israeli Prime Minister Benjamin Netanyahu aired in a preview clip on \"Face the Nation,\" while a more concise answer aired during the \"60 Minutes\" primetime special the following night. Raw transcripts released by the FCC after it ordered CBS News to hand them over earlier this year revealed that the first portion of her response aired in the preview clip, while the latter part of that same response aired in primetime. Both Colbert and Harris seemed to tiptoe around the CBS drama. At the top of the interview, after he pointed out that Harris \"looked rested,\" Colbert joked he'll get \"plenty of rest in June,\" which is the month after \"The Late Show\" will officially be off the air in 2026. Harris later called out the \"capitulation\" that has taken place since Trump took office, though not mentioning Paramount by name. There was very little substance throughout the roughly 30-minute interview as Harris repeatedly either dodged various questions or teased that the answers would be in her book. One question Harris refused to answer was who she thought was currently leading the Democratic Party. CLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS \"I think there are a lot of – I'm not going to go through names because then I'm going to leave somebody out and then I'm going to hear about it,\" Harris told Colbert. \"But let me say this. I think it is a mistake for us who want us to figure out how to get out and through this and get out of it to put it on the shoulders of any one person. It's really on all of our shoulders. It really is.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"Outgoing &quot;Late Show&quot; host Stephen Colbert gave a fawning interview with former Vice President Kamala Harris, who is out promoting her new book about her failed presidential bid.","url":"https://www.foxnews.com/media/colbert-fails-ask-harris-about-biden-decline-avoids-her-involvement-trumps-60-minutes-lawsuit","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/harris5.jpg","video":"https://www.foxnews.com/video/6376436446112","publish_date":"2025-08-01 23:00:18","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.251},{"id":347416538,"title":"Former Biden Advisor Reveals $4Million Incentive to Get Ex-President Reelected Before Party Booted Him for Kamala Harris — In Blistering House Oversight Committee Testimony","text":"The Democratic party's decision to replace Joe Biden with Kamala Harris in the 2024 election may have cost one staffer millions. \n\nDuring his testimony before the House Oversight Committee, ex-Biden staffer Mike Donilon confessed he was promised $4million if the Democratic president won a second term in the White House, RadarOnline.com can reveal. \n\nA source claimed Donilon told the committee he was paid $4million to work on Biden's 2024 reelection campaign and was set to receive another $4million if he was reelected.Salary ExposedDonilon's jaw-dropping salary was previously revealed in CNN host Jake Tapper's controversial book No Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again, but his additional $4million bonus was not widely reported. \n\nBiden's former advisor joined the growing list of former staffers summoned to testify before the House Oversight Committee as part of the ongoing investigation into an alleged cover-up of the ex-president's cognitive decline and use of autopen while in office.House Oversight Committee ProbeLike many Biden administration officials who testified before him, Donilon defended Biden's cognitive abilities and insisted he was fit to serve. \n\nDonilon reportedly said in his opening statement: \"What I saw, day in and day out, was a leader who was deeply engaged and in command on critical issues, both at home and abroad.\" \n\nHe added: \"I believed that President Biden was the best person to lead the country on the day he took the oath of office, and I continued to believe that was true every day he served as President.\"Staff Pleads the FifthSo far, the Oversight Committee has been met with resistance from Biden staffers, several of whom chose to plead the Fifth during their testimonies. \n\nAs RadarOnline.com reported, Oversight Committee Chairman James Comer slammed Biden officials for exercising their right to plead the Fifth following testimony from top aide Annie Tomasini. \n\nComer condemned the \"pattern of key Biden confidants seeking to shield themselves from criminal liability.\"He said in a statement: \"It's unbelievable that Ms. Tomasini and others refuse to answer basic questions about President Biden's fitness to serve. It's apparent they would rather hide key information to protect themselves and Joe Biden than be truthful with the American people about this historic scandal.\" \n\nTomasini lawyer fired back: \"The Committee has asked Ms. Tomasini to testify in connection with an investigation into use of the autopen. There is no actual evidence of wrongdoing by Ms. Tomasini, and President Biden has already confirmed that he made all decisions concerning the grants of clemency at the end of his term.\"Another top Biden advisor, Steve Ricchetti, slammed the probe and insisted there was nothing \"nefarious\" going on behind the scenes at the White House while the 82-year-old was in office. \n\nRicchetti reportedly explained he voluntarily testified \"because I believe it is important to forcefully rebut this false narrative about the Biden presidency and our role in it.\" \n\nHe said in a statement: \"There was no nefarious conspiracy of any kind among the president’s senior staff, and there was certainly no conspiracy to hide the president’s mental condition from the American people.\"","summary":"Mike Donilon revealed he was paid $4million to work on the Biden reelection campaign and was promised another $4million if the campaign won.","url":"https://radaronline.com/p/joe-biden-house-oversight-committee-probe-mike-donilon-reelection-bonus/","image":"https://media.radaronline.com/brand-img/zwJ-3l98R/0x0/joe-biden-splashed-51k-taxpayers-cash-robert-de-niro-hotel-8million-travel-expenses-one-year3-1750084668242.jpg","video":null,"publish_date":"2025-08-01 23:00:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.197},{"id":347403238,"title":"'Obsessed with propaganda': How Trump's 'temper tantrum' firing of BLS chief may backfire","text":"President Donald Trump's recent snap decision to fire the commissioner of the Bureau of Labor Statistics (BLS) could end up blowing up in his face, according to one analyst.\n\nIn a Friday essay for the Atlantic, columnist Jonathan Chait wrote that Trump's sacking of BLS commissioner Erika McEntarfer over a less-than-flattering jobs report gives Americans a distinct window into how the second Trump administration governs. Chait wrote that Trump's firing of McEntarfer was an emotionally driven \"lizard brain\" decision after the July 2025 jobs report showed not only sluggish job growth of just 73,000 new jobs added, but a downward revision of previous jobs numbers by 258,000 — the worst period of job growth since the onset of the Covid-19 pandemic in 2020. Chait wrote that Trump's reasoning that bureaucrats were scheming to undermine falls apart upon closer inspection.\n\n\"Revisions of past numbers are a normal part of BLS methodology. Every monthly report is a projection based on limited information, so the Bureau continues to update its findings,\" he explained. \"Last August, the BLS revised previous months’ job numbers downward. This was obviously a bad thing for the Biden administration, but Republicans decided that it was in fact evidence that the BLS had been cooking the books to make the economy look good.\"\n\nREAD MORE: 'The cover-up is huge': Epstein survivor says Maxwell pardon would be 'ultimate betrayal'\n\nAccording to Chait, McEntarfer's sudden firing can also shed light on Trump's ongoing feud with Federal Reserve chair Jerome Powell over Powell's refusal to lower interest rates. He argued that, similar to how Trump lacks an understanding of how the BLS routinely adjusts data, he also fails to grasp why interest rates are lowered in the first place. \n\nThe Atlantic columnist pointed out that the Fed typically only lowers interest rates when the economy is struggling, in order to stimulate more economic activity. And when the economy is strong, the Fed keeps interest rates higher as a means of preventing the economy from overheating and causing inflation to spike. After breaking that down, he likened Trump's frustration with Powell as claiming that the economy is stronger than it actually is, while pushing Powell to do things that suggest the economy is weaker than it actually is.\n\n\"He is obsessed with propaganda, and has had phenomenal success manipulating the media and bullying his party into repeating even his most fantastical lies,\" Chait wrote. \"But, as Joe Biden and Kamala Harris learned the hard way, voters don’t judge the economy on the basis of jobs reports. They judge it on the basis of how they and their community are doing. You can’t fool the public into thinking the economy is better than it is with fake numbers. All fake numbers can do is make it harder for policy makers to steer the economy.\"\n\n\"The president’s mad rush to subject the macroeconomic policy makers to the same partisan discipline he has imposed on the power ministries is less of a coup than a temper tantrum,\" he added. \"He thinks he wants loyalists and hacks running those functions. He might not like what happens when he gets his way.\"\n\nREAD MORE: 'Not a stunt': Dems make a shock move against Trump — as one shrugs it off\n\nClick here to read Chait's full column in the Atlantic (subscription required).","summary":"President Donald Trump's recent snap decision to fire the commissioner of the Bureau of Labor Statistics (BLS) could end up blowing up in his face, according to one analyst.\n\nIn a Friday essay for the Atlantic, columnist Jonathan Chait wrote that Trump's sacking of BLS commissioner Erika McEntarfer over a less-than-flattering jobs report gives Americans a distinct window into how the second Trump administration governs. Chait wrote that Trump's firing of McEntarfer was an emotionally driven \"lizard brain\" decision after the July 2025 jobs report showed not only sluggish job growth of just 73,000 new jobs added, but a downward revision of previous jobs numbers by 258,000 — the worst period of job growth since the onset of the Covid-19 pandemic in 2020. Chait wrote that Trump's reasoning that bureaucrats were scheming to undermine falls apart upon closer inspection.\n\n\"Revisions of past numbers are a normal part of BLS methodology. Every monthly report is a projection based on limited information, so the Bureau ","url":"https://www.alternet.org/trump-temper-tantrum/","image":"https://www.alternet.org/media-library/image.jpg?id=61227361&width=1200&height=600&coordinates=0%2C246%2C0%2C247","video":null,"publish_date":"2025-08-01 22:50:10","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.53},{"id":347408756,"title":"Kamala Harris punts when asked who she sees as a Democratic Party leader","text":"to top close Video This video is playing in picture-in-picture.\n\nSpecial Report August 01, 2025 02:06 \n\n Kamala Harris punts when asked who she sees as a Democratic Party leader \n Fox News senior national correspondent Rich Edson has the latest on the former vice president's political career and recent comments on 'Special Report.'\n Tags SPECIAL REPORTV-VIDEOSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIR","summary":"Fox News senior national correspondent Rich Edson has the latest on the former vice president&apos;s political career and recent comments on &apos;Special Report.&apos;","url":"https://www.foxnews.com/video/6376469632112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ee57a42e-3962-4fcb-83a3-7319a87421c1/2a4fca87-25ae-450a-9b56-750b780ab6ef/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-01 22:42:01","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.091},{"id":347399358,"title":"New Poll Shows Top 2028 Presidential Candidates in Swing State","text":"A new poll by Emerson College Polling released on Friday shows potential 2028 Republican and Democratic presidential contenders picked by North Carolina primary voters.Why It MattersEarly polls in crucial swing states like North Carolina have gained significance as potential contenders for the 2028 presidential election begin to emerge. Even with the election still a few years away, polling can offer insight into candidate viability, voter sentiment, and evolving party dynamics, particularly after the pivotal 2024 election cycle.North Carolina, often considered determinative in recent presidential contests, could offer a bellwether for national trends as both major parties consider their direction and platform for 2028.What To KnowIn the Emerson College survey conducted from July 28 to 30, of 1,000 North Carolina registered voters, Vice President JD Vance is leading the Republican nomination with 53 percent among likely Republican primary voters—well ahead of Florida Governor Ron DeSantis with 7 percent and Secretary of State Marco Rubio with 5 percent.Vance jumped 7 points from a previous survey taken in June by Emerson.In the Democratic field, former Transportation Secretary Pete Buttigieg was the top choice among likely primary voters at 17 percent, followed by former Vice President Kamala Harris at 12 percent and California Governor Gavin Newsom at 10 percent. The survey shows 24 percent are undecided.The poll has a margin of error of 3 percentage points, with separate credibility intervals for primary subgroups.Harris, meanwhile, announced this week that she is not running for California governor in the next cycle, fueling speculation she is considering another presidential run.In an interview on The Late Show with Stephen Colbert on Thursday, the former vice president said she thinks the political system is \"broken\" and does not want to be in it right now. She added she would always \"be part of the fight\" though.Friday's poll also shows that 40 percent of the swing state voters say their family's finances are worse off than one year prior, 32 percent say they are about the same and 28 percent say they are better off now.What People Are SayingPolitical science professor at Columbia University Robert Y. Shapiro to Newsweek via email Friday: \"The Democratic primary polling is much too early and all we are seeing is name recognition for past presidential candidates and ones in the news lately in a visible way. On the Republican side, DeSantis and Rubio are damaged goods as past losers in the past Republican primaries in 2016 and 2024. Vance is on the rise by virtue of being Vice President and visible when he echoes or advocates more strongly Trump's MAGA positions and what Trump—and he—have done. He has not been defeated in any past major election so untarnished in that respect.\"What Happens NextMajor candidates are not expected to announce their 2028 campaigns until after the 2026 midterm elections, in keeping with recent electoral cycles.However, the field of likely contenders is potentially taking shape as politicians such as Buttigieg, Newsom, and others make public appearances and pursue national media opportunities. Vance's strong polling position places him at the forefront of Republican prospects.","summary":"North Carolina, often considered determinative in recent presidential contests, could offer a bellwether for national trends.","url":"https://www.newsweek.com/new-poll-shows-top-2028-presidential-candidates-swing-state-2107871","image":"https://d.newsweek.com/en/full/2695280/kamala-harris-jd-vance.jpg?w=1600&h=900&q=88&f=541ba36f95e8fbd55dd129bd90aabfc6","video":null,"publish_date":"2025-08-01 22:31:35","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"US","sentiment":-0.415},{"id":347408758,"title":"CNN panel skewers Harris interview for lack of solutions after 'six months to figure it out'","text":"to top close Video This video is playing in picture-in-picture.\n\nMedia August 01, 2025 01:27 \n\n CNN panel skewers Harris interview for lack of solutions after 'six months to figure it out' \n A panel on CNN slammed former Vice President Kamala Harris' interview on \"The Tonight Show with Stephen Colbert,\" arguing she was visibly uncomfortable and vague with her answers about the Democratic Party's future.\n Tags MEDIAV-VIDEO","summary":"A panel on CNN slammed former Vice President Kamala Harris&apos; interview on &quot;The Tonight Show with Stephen Colbert,&quot; arguing she was visibly uncomfortable and vague with her answers about the Democratic Party&apos;s future.","url":"https://www.foxnews.com/video/6376466066112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e71bd163-8d4b-459e-a706-42a2cf46a304/2cbca447-6ac1-4bc8-bd4b-5fa3c3b2ddf9/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-01 22:10:40","author":null,"language":"en","source_country":"us","sentiment":-0.262},{"id":347400510,"title":"Trump fires Biden-appointed Bureau of Labor Statistics commissioner after bad jobs report: ‘Numbers were RIGGED’","text":"President Trump ordered the dismissal Friday of the head of the Bureau of Labor Statistics (BLS), hours after the economic data collection agency released a report showing unemployment ticked up last month. \n\nNow-former BLS Commissioner Erika McEntarfer, an appointee of former President Joe Biden, triggered Trump’s fury after her agency announced lower than expected employment gains in July and revised the numbers for May and June downward by a total of 258,000 jobs. \n\nThe president accused McEntarfer of manipulating the data and charged that she had done so in the past. \n\n“I believe the numbers were phony, just like they were before the election,” Trump told reporters as he left the White House to spend the weekend at his Bedminster, NJ club. “So you know what I did? I fired her.” \n\nA BLS spokesperson confirmed McEntarfer “was terminated today” and Deputy Commissioner William Wiatrowski will take over on an acting basis. \n\nMcEntarfer, a career federal employee, was confirmed by the Senate to lead BLS in January 2024 after previously serving as a senior economist at the White House Council of Economic Advisors under Biden. \n\nTrump explained in a Truth Social post that he was “just informed” that the nation’s employment reports were “being produced by a Biden Appointee” and charged that McEntarfer “faked the Jobs Numbers before the Election to try and boost Kamala’s chances of Victory.” \n\n“This is the same Bureau of Labor Statistics that overstated the Jobs Growth in March 2024 by approximately 818,000 and, then again, right before the 2024 Presidential Election, in August and September, by 112,000,” the president wrote. “These were Records — No one can be that wrong?” \n\nLast August’s revision of job growth for the 12 months ending in March 2024 – the largest downward revision to US payroll figures since 2009 – drew outrage from some Republican lawmakers, who suggested the numbers were intentionally fudged to boost the Harris-Biden administration.\n\n“We need accurate Jobs Numbers,” Trump wrote, noting that McEntarfer would be “replaced with someone much more competent and qualified.”\n\n“Important numbers like this must be fair and accurate, they can’t be manipulated for political purposes,” he continued. “McEntarfer said there were only 73,000 Jobs added (a shock!) but, more importantly, that a major mistake was made by them, 258,000 Jobs downward, in the prior two months.” \n\n“Similar things happened in the first part of the year, always to the negative.” \n\nSen. Roger Marshall (R-Kan.), who demanded testimony from McEntarfer last year over the Biden-era job stats revisions, praised Trump for removing her from the top BLS post.\n\n“I have been raising concerns for the past year about inaccurate job numbers put out by Dr. Erika McEntarfer,” Marshall wrote on X. “Her cooked-up numbers have misled the American people for too long.” \n\n“Glad President [Trump] is going to clean this up.”\n\nTrump doubled-down in a separate social media post, arguing that the July BLS report was “RIGGED in order to make the Republicans, and ME, look bad.”\n\nTrump told reporters Friday he has “about three” people in mind to replace McEntarfer.\n\n“I have a lot of good candidates. I will say, everybody wants it,” he said. “We’re gonna put someone in who can be honest.”","summary":"A spokesperson for BLS confirmed that McEntarfer “was terminated today” and that Deputy Commissioner William Wiatrowski will now serve as acting commissioner. ","url":"https://nypost.com/2025/08/01/us-news/trump-fires-biden-appointed-bureau-of-labor-statistics-commissioner-after-bad-jobs-report-numbers-were-rigged/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-nqfltvami-1754085070269.jpg?quality=75&strip=all&1754070691&w=1200","video":"https://cdn.jwplayer.com/videos/54akKcxz-RyIcpnTz.mp4","publish_date":"2025-08-01 22:08:04","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.268},{"id":347410236,"title":"Donald Trump Fires Bureau of Labor Statistics Commissioner, Accuses Biden Nominee of Faking Data to Boost Kamala Harris Before Election","text":"I was just informed that our Country’s “Jobs Numbers” are being produced by a Biden Appointee, Dr. Erika McEntarfer, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala’s chances of Victory. This is the same Bureau of Labor Statistics that overstated the Jobs Growth in March 2024 by approximately 818,000 and, then again, right before the 2024 Presidential Election, in August and September, by 112,000. These were Records — No one can be that wrong? We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY.\n\nShe will be replaced with someone much more competent and qualified. Important numbers like this must be fair and accurate, they can’t be manipulated for political purposes. McEntarfer said there were only 73,000 Jobs added (a shock!) but, more importantly, that a major mistake was made by them, 258,000 Jobs downward, in the prior two months. Similar things happened in the first part of the year, always to the negative. The Economy is BOOMING under “TRUMP” despite a Fed that also plays games, this time with Interest Rates, where they lowered them twice, and substantially, just before the Presidential Election, I assume in the hopes of getting “Kamala” elected – How did that work out? Jerome “Too Late” Powell should also be put “out to pasture.” Thank you for your attention to this matter!","summary":"President Donald Trump fired the commissioner of the Bureau of Labor Statistics (BLS) on Friday.\n\n\nThe post Donald Trump Fires Bureau of Labor Statistics Commissioner, Accuses Biden Nominee of Faking Data to Boost Kamala Harris Before Election appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/08/01/donald-trump-fires-bureau-labor-statistics-commissioner-accuses-biden-nominee-faking-data-boost-kamala-harris-before-election/","image":"https://media.breitbart.com/media/2025/07/Donald-Trump-2-1-640x335.jpg","video":null,"publish_date":"2025-08-01 22:04:58","author":"Sean Moran","authors":["Sean Moran"],"language":"en","category":"politics","source_country":"US","sentiment":-0.191},{"id":347403328,"title":"'It's An Insane Asylum Now': 'The View' Slammed For Booking Zero Conservative Guests in 2025 — After Show's Warned It's 'Next to Be Pulled Off Air'","text":"The View has faced backlash for not booking any conservative guests from January to July this year, despite warnings it could be yanked off-air, RadarOnline.com can reveal. \n\nA study by the Media Research Center's NewsBuster analyzed every episode from January 6 through July 25 and found The View hosted 102 left-leaning guests and zero conservative guests.Anti-Trump PanelIt's no secret The View has long been left-leaning. \n\nCo-hosts Whoopi Goldberg, Sunny Hostin, and Joy Behar have been outspoken critics of Donald Trump and Republican lawmakers. While Alyssa Farrah Griffin served in Trump's first administration, she previously confessed she voted for Kamala Harris in the 2024 election and regularly sides with her co-hosts on political issues discussed on the show. \n\nFollowing the stunning Media Research Center study, Fox News contributor Guy Benson reportedly said the program has turned into an \"insane asylum\" during an appearance on Fox & Friends.Fairness DoctrineBenson mocked the 102 liberal guests \"seems a little low\" for The View. \n\nHe said: \"I am actually surprised by this because 102 seems a little low. \n\n\"What's interesting (is)… the left talked for years about bringing back the fairness doctrine. This was an obsession of theirs to try to clamp down on the success of (conservative) talk radio. If they had succeeded and had gotten the fairness doctrine, The View would be out of business for that reason alone. That would be basically illegal.\"Fox & Friends co-host Ainsley Earhardt quipped: \"So The View only has one view?\" \n\nBrian Kilmeade added the study revealed the \"least surprising stat ever.\" \n\nHe added: \"They used to be somewhat balanced. Barbara Walters started this to get some political points of view – no script – and just get a conversation going, and let us know what women talk about when they're together. Then what happened? It ends up being an angry Democratic show.\" \n\nAs RadarOnline.com reported, The View was warned they could be the next left-leaning show to be pulled off-air during the Trump administration following Behar's rant about the president.Joy Behar Prompts White House WarningDuring July 23rd's episode of the program, Behar unleashed on Trump while discussing the Commander-in-Chief, accusing former President Barack Obama of \"treason.\" \n\nBehar told the panel: \"The thing about him is he is so jealous of Obama, because Obama is everything that he is not. Trim. Smart. Handsome. Happily married. And can sing Al Green’s song Let’s Stay Together better than Al Green.\" \n\nHer comments prompted a stern warning from Trump's spokesperson, saying, \"She should self-reflect on her own jealousy of President Trump’s historic popularity before her show is the next to be pulled off air,\" about Stephen Colbert's late-night show being axed. \n\nWhite House spokesperson Taylor Rogers also fired back: \"Joy Behar is an irrelevant loser suffering from a severe case of Trump Derangement Syndrome. It's no surprise that The View's ratings hit an all-time low last year.\"","summary":"A Media Research Center study revealed the talkshow booked 102 left-leaning guests and zero conservatives from January to July this year.","url":"https://radaronline.com/p/the-view-booked-no-conservative-guests-white-house-warning-could-be-canceled/","image":"https://media.radaronline.com/brand-img/zCP9xwCvY/0x0/the-view-warned-about-getting-too-policital-1753475084844.jpg","video":null,"publish_date":"2025-08-01 22:00:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","source_country":"us","sentiment":-0.178},{"id":347392282,"title":"Democrats want to move on. Joe Biden and Kamala Harris won’t let them","text":"Donald Trump is President of the United States. \n\nRepublicans control all three branches of government. \n\nYet even as Democrats are trying to regroup and claw their way back in next year’s midterm congressional elections, the two people whom many of them blame for that state of affairs.\n\nFormer president and vice president, Joe Biden and Kamala Harris, continue to dominate the Democratic spotlight — allowing Republicans to highlight their failures instead of letting their party move on and find a way to regain the support that was lost during their time in office. \n\nHarris, who lost all seven of the contested swing states in 2024, recently announced an upcoming book that will focus on the 107-day campaign she waged against Trump after Biden withdrew from the race following his disastrous debate performance that June. \n\nShe also revealed that she won’t enter the upcoming race to succeed California Gov. Gavin Newsom, who must leave office in 2027 when his second four-year term ends, leaving open the possibility that she’ll enter what is expected to be a crowded primary race for the 2028 Democratic presidential nomination. \n\nBiden, whose 11th-hour pardons of his family members and other political allies emboldened Trump to grant reprieves for the violent rioters who tried to prevent his 2020 loss from being certified, is still giving speeches in which he is attacking his predecessor-turned-successor, a stark contrast from how most former presidents have behaved after leaving office.\n\nAt one such appearance, an address to the National Bar Association in Chicago on Thursday, Biden accused the Trump administration of “doing its best to dismantle the Constitution,” giving right-wing media outlets plenty of fodder to use at a time when his party is trying to focus on the future and the current government’s policy problems.\n\nAnd the president’s son, Hunter Biden, is doing his best to stay in the headlines with a series of podcast appearances in which he casts blame for his father’s exit from the race on a broad range of people — but not his father. \n\nThe former Democratic ticket’s refusal to fade away after a devastating electoral performance is ruffling feathers among party figures who are tasked with moving forward and figuring out how to escape from the wilderness in next year’s midterms.\n\nA number of popular governors, including Illinois’ JB Prizker and Kentucky’s Andy Beshear, have been making the trek to early primary states with an eye towards 2028, and voters are increasingly eager to elect new faces rather than older establishment figures.\n\nDonna Bojarsky, a Democratic consultant, told The Washington Post that “nobody” in the party is looking to go “back to 2024” as they look for a way forward against the Republicans.\n\n“The shadow of 2024 is long, and I think all perspectives in the mix believe we need something fresh,” she said. \n\nAnother strategist Cooper Teboe, said the party’s current predicament stems from a sclerosis that has taken hold on account of incumbents refusing to relinquish power to the next generation. \n\n“The core reason the Democratic Party is in the position it is in today is because no new figures, no new ideas, have been allowed to rise up and take hold,” he said. \n\nBut there is a group eager for Biden and Harris to remain part of the national conversation — Republicans.\n\nOne GOP consultant who spoke to The Independent said Hunter Biden’s recent profanity-laced podcast appearances and the former president’s speeches are just what they need to keep his failures in the public eye as his party tries to regain the trust of voters.\n\n“Hunter Biden is just what Democrats need more of going into the midterms,” he said, more than a bit sarcastically.","summary":"The former president and vice president aren’t fading into the background as many in their party would prefer","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrats-biden-harris-2026-midterms-b2800626.html","image":"https://static.independent.co.uk/2025/08/01/6/56/Screenshot-2025-08-01-at-07-46-22.png?width=1200","video":"https://cdn.jwplayer.com/videos/eGPHWS17-OhrQWqOm.mp4","publish_date":"2025-08-01 21:53:31","author":"Andrew Feinberg","authors":["Andrew Feinberg"],"language":"en","category":"politics","source_country":"gb","sentiment":0.079},{"id":347405522,"title":"Burchett calls on Comer to ask George Soros to testify over Russiagate","text":"Among the disclosed evidence was an email allegedly written by Leonard Benardo, who currently works as the senior vice president of Soros’s Open Society Foundations. The email showed Benardo “plotting to discredit the incoming Trump Administration,” according to Burchett.\n\n“Considering the Open Society Foundations’ continued influence on U.S. elections, I respectfully request you invite Mr. Soros and Mr. Benardo to testify in a public hearing before the Committee,” the Tennessee Republican wrote in a brief letter to Comer.\n\nThe email in question, dated July 27, 2016, said former Secretary of State Hillary Clinton approved a campaign proposal to tie Trump to Russia to distract the public from her own email scandal, the New York Times reported. Benardo supposedly wrote the email, but in 2021, he told Department of Justice special counsel John Durham that he never saw or wrote the email.\n\nDurham concluded in 2023 that the email and another one, also allegedly written by Benardo, were likely manufactured. It is believed Russian hackers faked the purported emails, according to an annex to the special counsel’s report.\n\nIf Soros and Benardo don’t accept the invitation to testify, Burchett implored the Oversight chairman to use his subpoena powers.\n\n“Americans deserve answers into the subversion of our institutions by malicious actors,” he concluded.\n\nBurchett is one of many Republican lawmakers who have criticized Soros’s involvement in U.S. politics and the megadonor’s support of the Democratic Party.\n\nDuring the 2022 election cycle, Soros became the country’s largest donor after donating $128.5 million to Democratic political action committees, according to the Washington Post. During the last presidential election, Soros and his son Alexander endorsed former Vice President Kamala Harris, who lost to Trump.\n\nDECLASSIFIED DURHAM ANNEX REVEALS FBI IGNORED EVIDENCE OF A CLINTON PLAN TO CREATE RUSSIA HOAX\n\nPrior to the November 2024 election, Burchett called the elder Soros “a money changer of the worst kind” for funding a number of liberal groups and pushing soft-on-crime prosecutors, among other causes. Critics said the statement promoted an antisemitic stereotype against Soros, who is Jewish. Burchett redoubled his characterization of the billionaire.\n\n“I’d say my voting record clearly reflects my support for Israel and the Jewish people,” he told HuffPost last October. “Folks know what George Soros does with his billions of dollars, and if they don’t, I’d say they should probably look into him a little further.”","summary":"On Friday, Rep. Tim Burchett (R-TN) asked House Oversight Committee Chairman James Comer (R-KY) to invite George Soros and one of his employees to testify before Congress on the newly declassified Russiagate findings. Last month, Director of National Intelligence Tulsi Gabbard declassified evidence regarding the Obama administration&#8217;s efforts to undermine President Donald Trump in 2016 [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3488944/tim-burchett-calls-on-james-comer-ask-george-soros-russiagate-testify/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/soros-scaled-1024x683.webp","video":null,"publish_date":"2025-08-01 21:50:10","author":"David Zimmermann","authors":["David Zimmermann"],"language":"en","category":"politics","source_country":"US","sentiment":-0.372},{"id":347392958,"title":"Battle for Etoudi: Travel ban on Issa Tchiroma sparks fierce storm","text":"Battle for Etoudi: Travel ban on Issa Tchiroma sparks fierce storm – Cameroon Concord News\n\nRecent Posts\n\nBattle for Etoudi: Travel ban on Issa Tchiroma sparks fierce storm\n\nFootball: prosecutors seek rape trial for PSG football star Achraf Hakimi\n\nBiometrics to replace stamps at EU border from 12 October\n\nRace for Etoudi: Akere, Tchiroma, Kah Walla protest Maurice Kamto’s disqualification\n\nUS: Kamala Harris rules out running for California governor\n\nAugust 2025\n\nFebruary 2025\n\nJanuary 2025\n\nDecember 2024\n\nNovember 2024\n\nOctober 2024\n\nSeptember 2024\n\nAugust 2024\n\nFebruary 2024\n\nJanuary 2024\n\nDecember 2023\n\nNovember 2023\n\nOctober 2023\n\nSeptember 2023\n\nAugust 2023\n\nFebruary 2023\n\nJanuary 2023\n\nDecember 2022\n\nNovember 2022\n\nOctober 2022\n\nSeptember 2022\n\nAugust 2022\n\nFebruary 2022\n\nJanuary 2022\n\nDecember 2021\n\nNovember 2021\n\nOctober 2021\n\nSeptember 2021\n\nAugust 2021\n\nFebruary 2021\n\nJanuary 2021\n\nDecember 2020\n\nNovember 2020\n\nOctober 2020\n\nSeptember 2020\n\nAugust 2020\n\nFebruary 2020\n\nJanuary 2020\n\nDecember 2019\n\nNovember 2019\n\nOctober 2019\n\nSeptember 2019\n\nAugust 2019\n\nFebruary 2019\n\nJanuary 2019\n\nDecember 2018\n\nNovember 2018\n\nOctober 2018\n\nSeptember 2018\n\nAugust 2018\n\nFebruary 2018\n\nJanuary 2018\n\nDecember 2017\n\nNovember 2017\n\nOctober 2017\n\nSeptember 2017\n\nAugust 2017\n\nFebruary 2017\n\nJanuary 2017\n\nDecember 2016\n\nNovember 2016\n\nOctober 2016\n\nSeptember 2016\n\nAugust 2016\n\nBattle for Etoudi: Travel ban on Issa Tchiroma sparks fierce storm\n\nFootball: prosecutors seek rape trial for PSG football star Achraf Hakimi\n\nBiometrics to replace stamps at EU border from 12 October\n\nRace for Etoudi: Akere, Tchiroma, Kah Walla protest Maurice Kamto’s disqualification\n\nUS: Kamala Harris rules out running for California governor\n\nIvory Coast: President Ouattara to run for fourth term in October election\n\nCameroon’s natural wealth worth $222 billion\n\nPowered by GDPR Cookie Compliance\n\nPrivacy Overview\n\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\n\nStrictly Necessary Cookies\n\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\n\n3rd Party Cookies\n\nThis website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages.\n\nKeeping this cookie enabled helps us to improve our website.\n\nCookie Policy\n\nMore information about our Cookie Policy","summary":"On 31 July 2025, Cameroonian presidential candidate Issa Tchiroma Bakary was barred from flying to Senegal at Yaoundé Nsimalen International Airport. Tchiroma, who leads the Front for the National Salvation of Cameroon (FSNC) party, was accompanied by his daughter. The pair intended to visit the grave of former president Ahmadou Ahidjo in Dakar. Eyewitnesses and [&#8230;]","url":"https://www.cameroonconcordnews.com/battle-for-etoudi-travel-ban-on-issa-tchiroma-sparks-fierce-storm/","image":"https://www.cameroonconcordnews.com/wp-content/uploads/2025/06/Tchiroma.jpg","video":null,"publish_date":"2025-08-01 21:33:15","author":"Soter","authors":["Soter"],"language":"en","category":"politics","source_country":"cm","sentiment":0.813},{"id":347394762,"title":"‘The Five’: Biden, Harris’ public appearances keep ‘sabotaging’ any Dem comeback","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Five August 01, 2025 11:04 \n\n ‘The Five’: Biden, Harris’ public appearances keep ‘sabotaging’ any Dem comeback \n ‘The Five’ co-hosts unpack former President Joe Biden’s latest public appearance and former Vice President Kamala Harris’ interview on ‘The Late Show.’\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE FIVEPERSONALITIESV-VIDEOPOLITICS","summary":"‘The Five’ co-hosts unpack former President Joe Biden’s latest public appearance and former Vice President Kamala Harris’ interview on ‘The Late Show.’","url":"https://www.foxnews.com/video/6376467258112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/690e6fd6-a450-4697-ae5b-a4d2de6f4b4a/61fada21-1265-443d-92cb-e5fd0e23fe92/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-01 21:27:51","author":null,"language":"en","category":"entertainment","source_country":"us","sentiment":0.296},{"id":347402312,"title":"Donald Trump Shoots the Messenger","text":"Broadly speaking, Donald Trump’s authoritarian moves come in two flavors. The first is devious plans that help him amass power (say, turning the Departments of Justice and Defense over to lackeys, or using regulatory threats to bully media owners into favorable coverage). The second is foolish impulses that he follows because they make him feel momentarily better.\n\nFiring Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, as Trump did via a Truth Social post this afternoon, falls into the second category.\n\nMcEntarfer’s unpardonable sin was to oversee the routine release of BLS jobs data. This morning’s report showed that job growth last month fell somewhat short of expectations. The more interesting—and, to Trump, unwelcome—information came in its revisions, which found that previous months had much lower job growth than previous estimates. Economists had been puzzling over the economy’s resilience despite Trump’s imposition of staggering tariffs. Now that we have the revised data, that resilience appears to have largely been a mirage.\n\nTrump went with the familiar “fake news” defense. McEntarfer, he posted, had ginned up fake numbers to make him look bad. “We need accurate Jobs Numbers,” he wrote. “I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY. She will be replaced with someone much more competent and qualified. Important numbers like this must be fair and accurate, they can’t be manipulated for political purposes.”\n\nThe backdrop to Trump’s move, and the reason observers are shocked but not surprised, is that the suspicion that jobs numbers are faked to help Democrats has circulated on the right for years. When a strong jobs report came out in October 2012, during Barack Obama’s reelection campaign, the former General Electric CEO Jack Welch tweeted, “Unbelievable jobs numbers..these Chicago guys will do anything..can’t debate so change numbers.”\n\nWelch’s tweet was considered somewhat unhinged at the time, but like many paranoid forms of conservative thought, it gradually made its way into the Republican mainstream. Trump himself has spent years insisting that economic numbers were made up, regularly denouncing every positive jobs report during the Obama era as fake. And so, when this morning’s report came out, his lizard brain was primed to act: Bureaucrat say Trump economy bad. Trump fire bureaucrat. Now economy good.\n\nOne problem with this move, even from the narrow standpoint of Trump’s self-interest, is that his complaints with economic statistics don’t fit together logically. Revisions of past numbers are a normal part of BLS methodology. Every monthly report is a projection based on limited information, so the Bureau continues to update its findings. Last August, the BLS revised previous months’ job numbers downward. This was obviously a bad thing for the Biden administration, but Republicans decided that it was in fact evidence that the BLS had been cooking the books to make the economy look good. (They did not address the apparent puzzle of why it finally came clean, months before the election.) Now that Trump is president, however, downward revisions prove that the BLS is cooking the books to make the economy look bad.\n\nThe most prominent exponent of these incoherent theories is, of course, Trump himself. In his post firing the BLS commissioner, Trump cited the downward revisions as evidence that she was faking the numbers to hurt him: “McEntarfer said there were only 73,000 Jobs added (a shock!) but, more importantly, that a major mistake was made by them, 258,000 Jobs downward, in the prior two months.”\n\nIn another post an hour and a half later, he cited last year’s revisions as evidence that she had faked the numbers to make Joe Biden look good: “Today’s Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad — Just like when they had three great days around the 2024 Presidential Election, and then, those numbers were ‘taken away’ on November 15, 2024, right after the Election, when the Jobs Numbers were massively revised DOWNWARD, making a correction of over 818,000 Jobs — A TOTAL SCAM.” (The truth, as we’ve seen, is that the downward revisions under Biden were announced last August, not after the election, but never mind.)\n\nTrump’s anger with government statisticians also runs headlong into his feud with Federal Reserve Chair Jerome Powell. Trump has been raging against Powell for being too slow, in Trump’s view, to cut interest rates. But cutting interest rates is what the Fed does when the economy is weak. When the economy is growing fast, it keeps rates high to avoid overheating. Trump is thus simultaneously claiming that the economy is stronger than people think and that Powell should act as if it’s weaker than people think. He also blames Powell for failing to change policy quickly enough, when, according to Trump himself, the most important data Powell would use to make this decision are unreliable.\n\nTrump’s deeper confusion is his apparent belief that reported job numbers are what matter to him politically. He is obsessed with propaganda and has had phenomenal success manipulating the media and bullying his party into repeating even his most fantastical lies. But, as Biden and Kamala Harris learned the hard way, voters don’t judge the economy on the basis of jobs reports. They judge it on the basis of how they and their community are doing. You can’t fool the public with fake numbers into thinking the economy is better than it is. All fake numbers can do is make it harder for policy makers to steer the economy.\n\nThe president’s mad rush to subject the macroeconomic policy makers to the same partisan discipline he has imposed on the power ministries is less a coup than a temper tantrum. He thinks he wants loyalists and hacks running those functions. He might not like what happens when he gets his way.","summary":"Classic authoritarian move: When reality doesn’t go your way, deny reality.","url":"https://www.theatlantic.com/politics/archive/2025/08/trump-economy-bls-commissioner/683746/","image":"https://cdn.theatlantic.com/thumbor/kTJ9o4PRaYTz4AazxmY93VJhFAY=/0x0:2000x1125/720x405/media/img/mt/2025/08/2025_07_31_bls_trump_-1/original.jpg","video":null,"publish_date":"2025-08-01 21:20:00","author":"Jonathan Chait","authors":["Jonathan Chait"],"language":"en","category":"politics","source_country":"US","sentiment":-0.411},{"id":347392962,"title":"Football: prosecutors seek rape trial for PSG football star Achraf Hakimi","text":"Football: prosecutors seek rape trial for PSG football star Achraf Hakimi – Cameroon Concord News\n\nRecent Posts\n\nBattle for Etoudi: Travel ban on Issa Tchiroma sparks fierce storm\n\nFootball: prosecutors seek rape trial for PSG football star Achraf Hakimi\n\nBiometrics to replace stamps at EU border from 12 October\n\nRace for Etoudi: Akere, Tchiroma, Kah Walla protest Maurice Kamto’s disqualification\n\nUS: Kamala Harris rules out running for California governor\n\nAugust 2025\n\nFebruary 2025\n\nJanuary 2025\n\nDecember 2024\n\nNovember 2024\n\nOctober 2024\n\nSeptember 2024\n\nAugust 2024\n\nFebruary 2024\n\nJanuary 2024\n\nDecember 2023\n\nNovember 2023\n\nOctober 2023\n\nSeptember 2023\n\nAugust 2023\n\nFebruary 2023\n\nJanuary 2023\n\nDecember 2022\n\nNovember 2022\n\nOctober 2022\n\nSeptember 2022\n\nAugust 2022\n\nFebruary 2022\n\nJanuary 2022\n\nDecember 2021\n\nNovember 2021\n\nOctober 2021\n\nSeptember 2021\n\nAugust 2021\n\nFebruary 2021\n\nJanuary 2021\n\nDecember 2020\n\nNovember 2020\n\nOctober 2020\n\nSeptember 2020\n\nAugust 2020\n\nFebruary 2020\n\nJanuary 2020\n\nDecember 2019\n\nNovember 2019\n\nOctober 2019\n\nSeptember 2019\n\nAugust 2019\n\nFebruary 2019\n\nJanuary 2019\n\nDecember 2018\n\nNovember 2018\n\nOctober 2018\n\nSeptember 2018\n\nAugust 2018\n\nFebruary 2018\n\nJanuary 2018\n\nDecember 2017\n\nNovember 2017\n\nOctober 2017\n\nSeptember 2017\n\nAugust 2017\n\nFebruary 2017\n\nJanuary 2017\n\nDecember 2016\n\nNovember 2016\n\nOctober 2016\n\nSeptember 2016\n\nAugust 2016\n\nBattle for Etoudi: Travel ban on Issa Tchiroma sparks fierce storm\n\nFootball: prosecutors seek rape trial for PSG football star Achraf Hakimi\n\nBiometrics to replace stamps at EU border from 12 October\n\nRace for Etoudi: Akere, Tchiroma, Kah Walla protest Maurice Kamto’s disqualification\n\nUS: Kamala Harris rules out running for California governor\n\nIvory Coast: President Ouattara to run for fourth term in October election\n\nCameroon’s natural wealth worth $222 billion\n\nPowered by GDPR Cookie Compliance\n\nPrivacy Overview\n\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\n\nStrictly Necessary Cookies\n\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\n\n3rd Party Cookies\n\nThis website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages.\n\nKeeping this cookie enabled helps us to improve our website.\n\nCookie Policy\n\nMore information about our Cookie Policy","summary":"French prosecutors on Friday called for Moroccan international Achraf Hakimi to face trial for the alleged rape of a woman in 2023 which the Paris Saint-Germain player denies. The Nanterre prosecutor&#8217;s office told AFP that they had requested that the investigating judge refer the rape charge to a criminal court. &#8220;It is now up to [&#8230;]","url":"https://www.cameroonconcordnews.com/football-prosecutors-seek-rape-trial-for-psg-football-star-achraf-hakimi/","image":"https://www.cameroonconcordnews.com/wp-content/uploads/2025/08/Achraf-Hakimi.jpg","video":null,"publish_date":"2025-08-01 21:09:32","author":"Soter","authors":["Soter"],"language":"en","source_country":"cm","sentiment":0.813},{"id":347388236,"title":"Trump Fires Senior Labor Official Over Weak Jobs Numbers","text":"Labor Secretary Lori Chavez-DeRemer on Friday confirmed the firing of Biden-area appointee Erika McEntarfer, the commissioner of the U.S. Bureau of Labor Statistics, after a weak jobs report showed a steep drop off in positions added in July and eliminated hundreds of thousands of previously reported gains.\n\nUS President Donald Trump points as he speaks in the White House on July 31, 2025.\nAFP via Getty Images\n\nTrump ranted against McEntarfer in a Truth Social post and lodged accusations that she manipulated the jobs numbers during the 2024 election to benefit Democratic candidate Kamala Harris.\n\nThe president has long criticized the Bureau for its jobs data and revisions, specifically pointing to a revision made Friday that cut a combined 258,000 jobs from the counts of the two months prior, indicating a weaker market than previously thought.\n\nHe also called out two revisions made in 2024, one in March that revised numbers over the 12 months prior down more than 800,000, and one made just before the election that wiped out a combined 112,000 jobs across August and September of 2024.\n\nIt's not at all uncommon for the BLS to revise numbers as additional payroll data becomes available and initial estimates rarely tell the full story—the Bureau's third and final revision is considered the most accurate.\n\nTrump said McEntarfer will be replaced with someone \"much more competent and qualified.\"\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here: joinsubtext.com/forbes.\n\nCrucial Quote\n\n“In my opinion, today’s Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad,” Trump posted to Truth Social Friday. “A TOTAL SCAM. Jerome “Too Late” Powell is no better! But, the good news is, our Country is doing GREAT!”\n\nKey Background\n\nFriday's jobs report showed that only 73,000 nonfarm jobs were added last month, well below economists' projections, and that the unemployment rate rose slightly to 4.2%. June and May totals were also revised sharply lower, dropping to 14,000 from 147,000 in June and to 19,000 from 125,000 for May. An average of 130,000 jobs added per month this year is the weakest since the January to June period in 2010, in the wake of the Great Recession. An average of 168,000 jobs were added per month last year. A report from earlier this week from the career services firm Challenger, Gray & Christmas blamed job losses on tariffs, implementation of artificial intelligence and cuts made within the federal government.\n\nWhat To Watch For\n\nIf the weak report pushes the Federal Reserve to lower interest rates. The Fed on Wednesday voted to hold rates in place, despite harsh and constant criticism from the president, but the new numbers could push officials to make a change when they meet in September.\n\nFurther Reading\nForbesUnemployment Rose To 4.2% In July As Hiring Fell SharplyBy Ty RoushForbes2025 Job Cuts Have Already Surpassed All Of 2024—DOGE, AI And Tariffs Are Biggest CausesBy Mary Whitfill Roeloffs\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"The unemployment rate rose to 4.2% in July and the number of new jobs dropped this year’s average to its lowest number since 2010.","url":"https://www.forbes.com/sites/maryroeloffs/2025/08/01/trump-fires-senior-labor-official-over-jobs-numbers/","image":"https://imageio.forbes.com/specials-images/imageserve/688d2259dde5e74f042b1bbd/0x0.jpg?format=jpg&crop=2074,1165,x0,y107,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-08-01 20:27:18","author":"Forbes Staff,Mary Whitfill Roeloffs,Ty Roush","authors":["Forbes Staff","Mary Whitfill Roeloffs","Ty Roush"],"language":"en","category":"politics","source_country":"US","sentiment":-0.398},{"id":347378094,"title":"Top Biden aide reveals eye-popping sum he would have made if Trump lost and says Dems 'overreacted' to disastrous debate","text":"Former top Biden political aide Mike Donilon told lawmakers that he was paid $4 million to reelect the former Democratic president and would have received an additional $4 million if President Joe Biden had been successful. \n\nAxios reported late Thursday on the eye-popping sums, with the bonus $4 million never before disclosed. \n\nDonilon was the latest Biden adviser to appear behind closed doors before the Republican-led House Oversight Committee.\n\nThe panel is investigating the former president's fitness for office amid President Donald Trump's claims that Biden's aides were running the country using an 'autopen,' a device that scrawls the president's signature. \n\nBiden left office in January at age 82 - a record for an American president - and a number of books have suggested his cognitive decline was worse than what the White House was telling the American people. \n\nDonilon - who had worked alongside the Democratic president since the 1980s - left the White House in early 2024 to help run Biden's reelection campaign. \n\nHis salary, which was much higher than the $300,000 being paid to campaign chair Jen O'Malley Dillon, led to resentment among other aides and Democrats, according to Axios' Alex Thompson and CNN's Jake Tappers book, Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again.\n\nIt also gave Donilon a reason for wanting Biden to stay in the 2024 presidential race.\n\nAxios reported that Donilon told lawmakers that he believed Democrats made too big of a deal about Biden's disastrous June 2024 debate performance against now-President Donald Trump. \n\nThat debate appalled Democrats and started the wave of calls for then 81-year-old Biden to bow out. \n\nHe did so less than a month later, handing the Democratic nomination over to Vice President Kamala Harris, who lost the November election to Trump. \n\nIn his testimony to the House Oversight Committee, Donilon admitted Biden experienced some wear and tear, but pushed that he was up to the job. \n\nIn his opening statement Donilon said, 'every president ages over the four years of a presidency and President Biden did as well, but he also continued to grow stronger and wiser as a leader as a result of being tested by some of the most difficult challenges any president has ever faced,' according to Axios. \n\n'I thought that experience was enormously valuable for the nation,' the top political aide added. \n\nA spokesperson for Biden declined to comment to the Daily Mail. \n\nFormer Biden counselor Steve Ricchetti also spoke to lawmakers this week. \n\nLast week, Biden's first Chief of Staff Ron Klain appeared. \n\nAdditional aides are expected to appear on Capitol Hill in the coming weeks. \n\nThat includes his second Chief of Staff Jeff Zients, communications adviser Anita Dunn, press secretary Karine Jean-Pierre, senior deputy press secretary Andrew Bates and Ian Sam's a former spokesperson for the White House Counsel’s Office.","summary":"Former top Biden political aide Mike Donilon told lawmakers that he was paid $4 million to reelect the former Democratic president and would have received an additional $4 million bonus if Biden won.","url":"https://www.dailymail.co.uk/news/article-14963391/biden-aide-mike-donilon-campaign-bonus.html","image":"https://i.dailymail.co.uk/1s/2025/08/01/20/100851815-0-image-a-7_1754077381183.jpg","video":null,"publish_date":"2025-08-01 20:07:34","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.206},{"id":347402990,"title":"In a Biden-era retread, media push bogus narrative that Trump is helpless to stop Gaza genocide","text":"Republish this articleThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License.\nWe encourage republication of our original content. Please copy the HTML code in the textbox below, preserving the attribution and link to the article's original location, and only make minor cosmetic edits to the content on your site.In a Biden-era retread, media push bogus narrative that Trump is helpless to stop Gaza genocide\nby Adam Johnson, The Real News Network August 1, 2025\n\n In a Biden-era retread, media push bogus narrative that Trump is helpless to stop Gaza genocide\nby Adam Johnson, The Real News Network August 1, 2025\n\nOnce again, US media is helping take pressure off of the White House by parroting US officials and pro-Israel talking heads insisting that the president is more or less helpless to stop anything Israel is doing in the Middle East, up to and including their ongoing mass starvation campaign and genocide in Gaza. \n“‘He's a madman’: Trump's team frets about Netanyahu after Syria strikes,” Axios’s Barak Ravid breathlessly reported on July 20. “Trump was agitated all around…in a call with Bibi,” alleged Sohrab Ahmari, citing “sources in and near the administration.” \n“Trump’s frustration with the devastation in Gaza is real,” Semafor insists. “After angry call from Trump, PM says Israel deeply regrets mistaken shelling of Gaza church,” The Times of Israel claimed on July 18. “Washington Struggles to Rein In an Emboldened Israel: Trump administration has expressed frustration with Israeli actions in recent days,” The Wall Street Journal reported on July 26. \nIf this particular genre of reportage looks familiar it’s because it’s a pared-down version of a PR campaign pushed out by former President Biden, his aides, and pro-Israel media allies. I wrote about the trope—Fuming/Helpless Biden—in both TRNN, and, in greater detail, for the Nation the following year. Now that it’s spanned party and administration we can simply call it Fuming/Helpless President. Put simply: it’s any report, analysis, or opinion that describes the president as unable to do anything to stop Israel from committing war crimes or end the genocide overall or, relatedly, any reporting that gives readers the impression that not only is the president helpless, but is very upset/angry/sad at not being able to change Israel’s behavior. It’s an essential media convention because it allows the president to continue all material support to Israel—the endless flow of bombs, military and intelligence support, vetoes at the United Nations—while distancing themselves from the deep unpopularity of Israel’s campaign of indiscriminate bombing and mass starvation. \nThe primary conduit for Fuming/Helpless President nonstories is Axios’s Ravid, who, as I noted in the Nation last year, had written 25 different examples of this genre up to that point for then-President Biden, quoting either US officials directly or a string of anonymous “US officials”—often as alleged scoops—claiming that Biden and White House officials were some variation of “breaking with Netanyahu,” “increasingly frustrated,” “running out of patience,” or “deeply concerned” about civilian casualties. Ravid, a former member of Unit 8200, Israel’s “secretive cyber warfare unit,” was awarded for his endless Fuming/Deeply Concerned reports with the White House Correspondents’ Association’s award for journalistic excellence in April 2024. \nRavid has emerged again as the most aggressive practitioner of the Fuming/Helpless President routine for the new Trump administration. In just the last two weeks, he has published:\n\nIsrael bombs Syrian capital despite U.S. pressure to “stand down” July 16 2025\n“He's a madman”: Trump's team frets about Netanyahu after Syria strikes July 20 2025\nWhite House confirms Trump objected to Israeli strikes in Syria July 21 2025\nTrump team rethinks Gaza strategy after six months of failure July 26 2025\nTrump says kids in Gaza are starving in break with Netanyahu July 29 2025\n\nWhat Ravid did for Biden he is now doing for Trump, permitting the White House to distance itself from the more extreme and unpopular of Israel’s policies while maintaining the status quo of unfettered material support. Obviously, demand for this genre of low-effort propaganda is far less than it was under Biden, especially when 71 percent of Republicans continue to support Israel’s genocide. But there is a nontrivial faction of MAGA media world—from Tucker Carlson to Theo Von to Dave Smith—that have pushed back on the president’s lockstep support. They have done so for many reasons—principled libertarianism, humanitarian instincts, or, in Tucker’s case, genuine white nationalism—but there’s a modest revolt in the ranks nonetheless, and one that increasingly needs to be damped down by the Trump-aligned Right. \nNo doubt feeling the heat from this contingent, and recognizing that being associated with countless images of emaciated and maimed children is not good for the brand in general, the White House and zionist groups in their orbit have dusted off the Biden-era playbook of Helpless/Frustrated President and seek to use it to distance Trump from the horrors emanating from Gaza just as the Biden White House did with great success. It’s easy, low effort, panders to antisemitic tropes of our otherwise benevolent leaders being manipulated by a foreign other, and provides what any head of a criminal enterprise seeks: plausible deniability. \n\n... it allows the president to continue all material support to Israel—the endless flow of bombs, military and intelligence support, vetoes at the United Nations—while distancing themselves from the deep unpopularity of Israel’s campaign of indiscriminate bombing and mass starvation. \n\nTrump’s passing acknowledgement Monday that there’s mass starvation in Gaza was widely reported as a “break from Netanyahu” despite it being pure rhetoric. “What reporting in Gaza shows amid Trump's break from Netanyahu on starvation,” NPR tells its listeners. “Trump, breaking with Netanyahu, acknowledges ‘real starvation’ in Gaza,” Politico insists. “Trump raises pressure on Netanyahu, Israel,” the Hill reports. \nThis narrative, born entirely from off-the-cuff comments by Trump, was quickly rejected by US Ambassador to Israel Mike Huckabee who, it’s worth noting, is playing to a different audience. Huckabee went on Fox News’s “America’s Newsroom” Tuesday, and when asked about the supposed “break” with Netanyahu said, “Let me assure you that there is no break between the prime minister of Israel and the president. Their relationship I think to be stronger than it’s ever been. And I think the relationship between the US and Israel is as strong as it has ever been.”\nSo why did so many mainstream outlets rush to distance Trump from the horrific images of starving children coming out of Gaza of starving children? Because preservation of American Innocence is an ideological force greater than common sense and “mounting tensions” between US Presidents and Netanyahu is a genre of reportage requiring little evidence and even less effort. \nAnother recent masterclass in Fuming/Helpless President stenography is a front page story in the Wall Street Journal, “Washington Struggles to Rein In an Emboldened Israel: Trump administration has expressed frustration with Israeli actions in recent days,” by Shayndi Raice and Alexander Ward. The article is littered with every cliche of the genre: Fuming Behind Closed Doors (“The Trump administration in recent days has expressed frustration with Israeli actions in Syria and Gaza”), Trump Forced to Do Israel’s Bidding Against His Will (“So far, they see Netanyahu leading Trump to act against his instincts”), and Out of the Loop (“The White House said this past week that Trump was “caught off guard” by the bombing in Syria and the strike that hit the Catholic church.”)\nThe piece even doubles as a means for ex-Biden officials Amos Hochstein and Phil Gordon to wash their hands of Gaza and insist they, too, were powerless, helping Trump officials and allies paint a picture of a White House getting run over by an increasingly powerful and willful ally. Kamala Harris foreign policy adviser Phil Gordon, who, on the eve of the 2024 Democratic National Convention in Chicago, explicitly promised to never condition aid to Israel, wants WSJ readers to know that Trump is unable to do anything to “rein in” Israel for the same reason Biden was: \n\nOthers say the reality of the relationship is far more complex. While the U.S. sells Israel advanced weapons and actively defends it against attacks, no American president would fully cut off the support to send Israel a message. Netanyahu knows this and operates knowing he can’t really lose U.S. backing for whatever it does. “Every president thinks they have some ability to constrain him and shape him, and they do,” said Philip Gordon, who in the previous administration was national-security adviser to Vice President Kamala Harris. “But in the end, Netanyahu is an experienced, wily actor, and knows he can get away with a lot.”...\n\nBut this, of course, is simply argument by tautology: “No American president would fully cut off the support to send Israel a message” is a moral choice Biden and Trump decided to make, not a law of nature. It’s not imposed upon them by any outside force. They are not “forced” to back Israel anymore than any war criminal is forced to carry out any war crime in the history of war crimes. They support Israel because, despite some bickering around the margins over tactics and PR, they agree with and support what Israel is doing. This basic fact is simply hand-waved away, lampshaded with a throwaway line by friendly reporters about how the US cannot ever possibly condition aid to Israel without any explanation, treated as an unquestioned axiom. \nBut it’s not. Both Trump and Biden are and were more than capable of “reining in” Israel. They can do so by conditioning military support or cutting it off altogether. But clearly laying out how those conditions would work is awkward and associates the US government, and leadership in both parties, with the 21st century’s most horrific and well documented genocide. A much easier approach, consistent with the increasingly popular Politics of Feigned Helplessness, is to manage perception and use court reporters to wash one’s hands of the consequences of their policies and actions. Actually cutting off Israel is difficult and would require a president who opposes what they’re doing. It’s far easier to paint the most powerful empire in the history of the world as bumbling, out of the loop, getting “played” by a country the size of New Jersey, and ultimately frame the US as a spectator that funds and arms countless war crimes but, somehow, is not responsible for any of them. \n\n This article first appeared on The Real News Network and is republished here under a Creative Commons Attribution-NoDerivatives 4.0 International License. </script","summary":"The politics of feigned helplessness are bipartisan and essential to maintaining American Innocence.","url":"https://therealnews.com/biden-media-narrative-trump-helpless-stop-gaza-genocide","image":"https://therealnews.com/wp-content/uploads/2025/08/GettyImages-2209045599-scaled.jpg","video":null,"publish_date":"2025-08-01 20:03:07","author":"Adam Johnson","authors":["Adam Johnson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.067},{"id":347377078,"title":"Harris mourns 'broken system' as Colbert wonders if she's quitting politics","text":"Former Vice President Kamala Harris declared Thursday that she was taking a break from running for office because she doesn't want to be a part of America’s \"broken system.\" During her appearance on \"The Late Show with Stephen Colbert,\" Harris explained why she ruled out running for governor of California, stating she believes America’s political system is \"broken\" and she does not want to be a part of it at the moment. \"Recently, I made the decision that I just – for now, I don’t want to go back in the system. I think it’s broken,\" she told host Stephen Colbert after he asked about her declining a potential gubernatorial run. CALIFORNIA DEM DOUBTS SOMEONE FROM THEIR STATE COULD WIN PRESIDENCY SINCE THEY'RE THOUGHT OF AS 'CRAZY PEOPLE' Since Harris lost the White House to President Donald Trump in 2024, there has been much speculation about whether she’d run to succeed Gov. Gavin Newsom, D-Calif., once his current term ends. Harris, the former California Attorney General and U.S. senator from the state, was seen as a leading contender for the office. Sources close to Harris told Fox News Digital in March that the former presidential candidate was seriously considering a run and that she would make her decision by the end of summer. Harris posted a statement to X on Wednesday declaring that she would not be running to replace Newsom this year. \"For now, my leadership - and public service - will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,\" Harris wrote. SUCCEEDING TRUMP IN 2028: SIX REPUBLICANS TO KEEP YOUR EYES ON The former VP told Colbert what she’d rather do instead of running for office this year. \"For now, I don’t want to go back in the system. I want to travel the country. I want to listen to people. I want to talk with people, and I don’t want it to be transactional where I’m asking for their vote,\" she said, as the audience applauded. Colbert circled back to her \"broken system\" remarks, pointing out that for someone who has been in such high office as she has, that statement is \"harrowing.\" \"Well, but it’s also evident, isn’t it?\" she asked in reply. \"It is,\" Harris continued, \"But it doesn’t mean we give up. That’s not my point.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Colbert admitted he felt she was hinting at giving up the fight. \"Oh, absolutely not,\" she shot back. \"I am always going to be a part of the fight. That is not going to change.\" Although Harris is out of the California governor’s race, she is still considered a top contender for the 2028 White House race. If Harris eventually does launch a 2028 presidential campaign, she would start her ride on the road to the White House as the most recognizable Democrat in what's expected to be a large field of contenders. And she would also come equipped with a broad fundraising network that she built up last cycle. CLICK HERE TO GET THE FOX NEWS APP \"She would certainly be a very serious candidate in the primary in 2028, if she runs,\" a Democratic strategist and veteran of multiple White House campaigns told Fox News Digital.","summary":"Former Vice President Kamala Harris explained on &quot;The Late Show&quot; why she&apos;s ruling out a California gubernatorial run to focus on listening to Americans instead.","url":"https://www.foxnews.com/media/harris-mourns-broken-system-colbert-wonders-shes-quitting-politics","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/08/Harris.jpg","video":"https://www.foxnews.com/video/6376449597112","publish_date":"2025-08-01 20:00:30","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":-0.313},{"id":347377410,"title":"Paige Spiranac Wears PJs That'll Have Boob-Hating Libs Sweating, Kay Adams Turns On Target & Kamala Said What?","text":"Welcome to August! Our first football Friday of the season. The Libs let us get here. Sure, the market is in the shitter today, but it's not how we start, it's how we finish. We'll check back in a month to see how it shakes out. For now, though, we press forward. We had football last night. The Red Sox broke my heart, again, yesterday. Trump absolutely nailed Tua's last name. Kamala was in her bag on Colbert's show. We're rolling in #content today. Let's finish the week strong. Welcome to a Friday Nightcaps – the one where we curl up in bed with Paige Spiranac and see where the rest of the day takes us. What else? I've got the best of the rest from a loaded week of #content, Hilary Duff is making the internet rounds, everyone is pissed at the new NFL first down marker (shocker), and Kay Damn Adams went shopping in a picnic dress to grab her some Oreos. What a heater from Queen Kay. And it's only Aug. 1! I think we're in for a special fall. Grab you an ice-cold Busch Latte to start the first weekend of August, and settle in for a Friday 'Cap! What do y'all WANT!? First off – we nailed our first bet of the 2025 NFL season. I gave out the over yesterday, and there was absolutely no sweat involved. That game had over written all over it from the opening fumble, and we never looked back. What a way to start August! Now, here's what I don't understand … why is everyone bitching about the new ABS technology to correctly judge a first down? We bitched and moaned for MONTHS about the chain gang last year. We complained every single Thursday, Sunday and Monday about how horrible the refs were. I know I certainly did, because it became a routine Friday morning blog for me after a Thursday night game. There was constant outcry over it, and it was all justified. So, the NFL actually did something about it, and brought in the technology we were all begging for … … and then everyone shit on it last night: What a week of #content! OK, so, I sort of get it. Our biggest problem was never the method of measuring, but more the method of where to spot the ball. That was usually the issue, right? The chain gang had nothing to do with the result. They were just the messengers, really. Still, we're already bitching on July 31st? I guess I'm not all that surprised given I lost my shit on the league last year when they unveiled the stupid new kickoff in the Hall of Fame game. And by the way, I forgot about it AGAIN until I saw it last night, and immediately got angry. I don't think I'll ever like it. Some things, like the pitch clock in baseball, grow on you as time wears on. I don't see that happening with the stupid kickoff format. It just looks like something a liberal came up with. I can't get on board with it. OK, let's get to some of the best #content from a big final week of August. Here's a guy bats leadoff today! Kay's training camp (de)tour, decoding Kamala & Paige auditions for American Eagle What a week! Ending July strong. Expect anything different? Couple takeaways … 1. Everyone is raving about this Naked Gun reboot. Wanna hear a secret I'm not proud of? I've never seen the original. I know. Sad. 2. Hilary Duff is only 37, for those wondering. 3. How miserable are Twins fans today? Slightly more miserable than Red Sox fans, I'd imagine. Only slightly, though. Craig Breslow is such a simp. 4. Rich Rod back in Morgantown just feels right. I wrote about the glory days of West Virginia football this morning, but I'll rehash 'em here for nostalgia purposes. I LOVED the mid-2000s Big East days. Pat White and Steve Slaton vs. some unbelievable Louisville and Rutgers (!!!) teams? THIS was PEAK college football: Those were the days. What a time. OK, let's rapid-fire this class into the first big weekend of August. First up? Make that back-to-back classes for Kay Adams as her summer training camp thirst tour continues! That's our girl! Nobody does a training camp tour quite like Kay Adams. She's a Queen for a reason, you know. She's in Charlotte today, by the way, and I hear Charlotte resident SeanJo may be running some intel for us. Stay tuned. Next? From maybe the hottest girl on TV to the dumbest … let's check in with Kamala Harris as we near the one-year anniversary of her ass-kicking! I mean, my God. What the hell did she just say? I'm so confused. She had 10 months to come up with an answer, and that's what she pumps out? I truly don't know what any of that means. What system? Seriously, what the hell is she talking about? Also … how much of a bitch is Stephen Colbert? Let's just call a spade a spade here. He's such a beta. \"Are you maybe waiting for another office that might be …\" He's just giddy as a school-girl at the thought of Kamala Harris running for president again. And guess what? So are we! That's what these idiot Dems don't get. We would LOVE Kamala to run again. But only to see JD Vance embarrass her. They legitimately think she'd have a chance. That's how far up their own asses they are. Amazing. God, I love them. The best. OK, that's it for today – and this week! It started with Sydney Sweeney and American Eagle turning on half of America and pissing off the other half, and we're gonna end it with Paige Spiranac doing the same. Take us home, Paigeviews! OutKick Nightcaps is a daily column set to run Monday through Friday at 4 p.m. (roughly, we’re not robots). Can you decode Kamala? Email me at Zach.Dean@OutKick.com.","summary":"","url":"https://www.outkick.com/culture/paige-spiranac-pjs-thatll-have-boob-hating-libs-sweating-kay-adams-turns-target-kamala-said-what","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/08/paige-spiranac-36.jpg","video":null,"publish_date":"2025-08-01 19:41:29","author":"Zach Dean","authors":["Zach Dean"],"language":"en","source_country":"us","sentiment":-0.203},{"id":347367070,"title":"Corporation for Public Broadcasting to Shutter After Trump Axes Federal Funding","text":"Skip to main content\n\nAugust 1, 2025\n\nProtestors at a rally calling on Congress to protect federal funding for public radio and TV in March 2025.\n\nSAUL LOEB / AFP/Getty Images\n\nThe Corporation for Public Broadcasting, which helps direct federal funds to NPR and PBS, will begin to shutter after President Donald Trump signed a law taking back $1.1 billion in congressional funding.\n\nThe CPB announced the news Friday, with president and CEO Patricia Harrison saying in a statement, “Despite the extraordinary efforts of millions of Americans who called, wrote, and petitioned Congress to preserve federal funding for CPB, we now face the difficult reality of closing our operations. CPB remains committed to fulfilling responsibilities and supporting our partners through this transition with transparency and care” (via NPR). \n\nThe CPB funding cuts were part of a $9 billion rescissions package that Republicans in Congress approved last month (the package also included cuts to foreign aid). NPR and PBS receive about $500 million annually through the CPB, with the cuts in the package covering funding through 2027 fiscal year.\n\nIn winding down operations, the CPB is expected to eliminate most of its staff positions by the end of September. The CPB said that a small team would stick around until January 2026 to “focus on compliance, fiscal distributions, and resolution of long-term financial obligations including ensuring continuity for music rights and royalties that remain essential to the public media system.”\n\nDespite the cuts, many PBS and NPR stations will continue to operate as they are funded primarily through public fundraising. But congressional funding is particularly crucial for NPR and PBS stations in rural areas, which are expected to suffer most because of the cuts. \n\nTrending Stories\n\nInside the Battle Over ‘Napalm Girl’\n\nWhy a ‘Confused’ Trump Lashed Out at a MAGA Senator\n\nThe Tao of Jerry Garcia: 31 Trippy Quotes From the Grateful Dead Co-Founder\n\nBill Burr Slams ‘Racists’ and ‘Cowards’ Who Send Offensive Pictures to Him and His Wife\n\nTrump made his intentions to cut CPB funding clear in May when he signed an executive order that claimed neither NPR nor PBS “presents a fair, accurate or unbiased portrayal of current events to tax-paying citizens.” Despite Trump’s claims of bias, recent polling has shown that most Americans support federal funding for public broadcasting.\n\nThese attacks on NPR and PBS are in line with Trump’s similar salvos against private broadcasters whom he believes don’t cover him fairly. His lawsuit against CBS News over 60 Minutes’ editing of a Kamala Harris interview was settled for $16 million earlier this summer, not long before Trump’s FCC approved a merger involving CBS’ parent company. ABC News also agreed to pay $15 million to Trump’s future presidential library to settle a defamation suit against George Stephanopoulos. \n\nTrump Fires Labor Stats Chief Following Weak Jobs Report\n\nBanana Republic\n\nNikki McCann Ramirez and Ryan Bort\n\nMAGA’s New Russiagate ‘Evidence’ Was Likely Made Up by the Kremlin\n\nDeclassified\n\nNikki McCann Ramirez\n\nTrump Is Dismantling the VA to Privatize Veterans’ Health Care\n\nMichael Embrich\n\nTrump Super PAC Raises $200 Million From Elon Musk and People Who Want Stuff From Him\n\nAndrew Perez\n\nWhy a ‘Confused’ Trump Lashed Out at a MAGA Senator\n\nOld Man Yells At Senator\n\nAsawin Suebsaeng and Nikki McCann Ramirez\n\nGo to PMC.com\n\nMost Popular\n\nGwyneth Paltrow Is Astronomer's 'Temporary Spokesperson' After CEO, HR Chief Resign Following Coldplay Kiss Cam Scandal\n\n'The Naked Gun': First Reactions From the Premiere\n\nUS Government to Auction Works by Jean-Michel Basquiat, Pablo Picasso, and Diane Arbus Purchased with Funds from 1MDB Scandal\n\nAll About Ozzy Osbourne’s Oldest Kids Louis, Jessica & Elliot\n\nYou might also like\n\nAfter Skydance Doesn’t Deny ‘Side Deal’ With Trump as Part of CBS Settlement, Sen. Warren Repeats Call for Investigation Into Potential ‘Criminal Behavior’\n\n29 minutes ago\n\nIs ChatGPT’s Study Mode a Game Changer for Students or Just Hype? Here’s What Parents Need To Know\n\n3 hours ago\n\nAmouage Unveils New Fragrance, Opus XVI Timber, and Shares Retail Expansion Plans\n\n4 hours ago\n\n‘The Holiday’ Is the Latest Iconic 2000s IP to Get a Revival — This Time for Apple TV+\n\n2 hours ago\n\nSports Stocks Rally to 3.5-Year High Behind Rush Street, Rogers\n\n6 hours ago\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.\n\nPowered by WordPress.com VIP","summary":"The CPB helps direct funding to NPR and PBS stations around the country","url":"https://www.rollingstone.com/politics/politics-news/corporation-for-public-broadcasting-close-trump-cuts-funds-1235398795/","image":"https://www.rollingstone.com/wp-content/uploads/2025/08/GettyImages-2206434776.jpg","video":null,"publish_date":"2025-08-01 19:40:35","author":"Jon Blistein","authors":["Jon Blistein"],"language":"en","category":"politics","source_country":"us","sentiment":-0.203},{"id":347374692,"title":"Trump fires commissioner of labor statistics after weaker-than-expected jobs figures slam markets","text":"President Donald Trump on Friday fired the Bureau of Labor Statistics commissioner, hours after the agency reported that job growth in the U.S. had slowed to a near-halt.\n\nIn a Truth Social post that also directed even more fire at Fed Chair Jerome Powell, Trump accused BLS Commissioner Erika McEntarfer of being a political appointee who was manipulating jobs data.\n\n\"I was just informed that our Country's \"Jobs Numbers\" are being produced by a Biden Appointee, Dr. Erika McEntarfer, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala's [Harris'] chances of Victory,\" Trump wrote.\n\n\"We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY. She will be replaced with someone much more competent and qualified,\" he added.\n\nCNBC has reached out to the BLS for comment. NBC News confirmed that McEntarfer has been fired. The BLS operated under the Department of Labor, whose commissioner, Lori Chavez-DeRemer, is a Trump appointee.\n\nThe stunning demand came the same day that the BLS reported a gain of just 73,000 nonfarm jobs in July, below market expectations. In addition, the bureau revised the two previous months down sharply, cutting a combined 258,000 from the prior counts, putting the three-month growth rate at a paltry 35,000. It was the biggest two-month downward revision since April 2020, the early days of the Covid crisis.\n\nTrump and congressional Republicans have repeatedly criticized the BLS over the years for its data collection. In particular, the large revisions have been a target.\n\nIn his spending plan this year, Trump proposed an 8% reduction in staff at the bureau, raising questions over the integrity of its counts on employment, consumer prices and multiple other economic metrics. The bureau has had to impute a growing amount of estimated data into a number of its reports.","summary":"Trump accused BLS Commissioner Erika McEntarfer of being a political appointee who was manipulating jobs data.","url":"https://www.cnbc.com/2025/08/01/trump-erika-mcentarfer-jobs-report-fired.html","image":"https://image.cnbcfm.com/api/v1/image/108177424-1754074125683-108177424-17535422792025-07-25t213630z_455169627_rc2ptfa7r6cc_rtrmadp_0_usa-trump-britain.jpg?v=1754074139","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2025/M08D01/7000384355/1754073106-40990683874-hd_L.mp4","publish_date":"2025-08-01 19:02:14","author":"Jeff Cox","authors":["Jeff Cox"],"language":"en","source_country":"us","sentiment":-0.268},{"id":347391092,"title":"Trump orders labour statistics official fired after weak jobs report","text":"US President Donald Trump said on Friday he had ordered the commissioner of the US Bureau of Labour Statistics, Erika McEntarfer, fired, alleging data falsification, not long after July’s disappointing jobs numbers challenged his claim of a burgeoning American economy.\nThe latest BLS data, which had been released earlier on Friday, showed employment growth last month was anaemic, with a gain of merely 73,000 non-farm jobs, below market expectations of an increase of more than 100,000 jobs.\nFurthermore, the Labour Department lowered its payroll count for May and June by a combined 258,000 jobs, the largest downward revision for a preceding two-month period since March and April 2020, at the onset of the Covid-19 pandemic. The department has lowered month-earlier numbers each month so far this year.\nThe downward revision trend “has the potential to bring July’s positive employment reading into negative territory”, Eugenio Alemán, chief economist at Raymond James, said in a research note.\n“This is not a guarantee,” he added. “Nothing prevents the revision to July’s number from being positive, but year to date, the BLS has revised 2025 employment numbers by -461,000, which is not a great harbinger for what may be in store for the Federal Reserve (Fed) and markets going forward.”\nThe bleak jobs picture came as a blow to Trump’s sanguine take on the economy after US gross domestic product expanded in the second quarter by 3 per cent.\n“We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY. She will be replaced with someone much more competent and qualified. Important numbers like this must be fair and accurate, they can’t be manipulated for political purposes,” Trump said in a post on Truth Social.\nMcEntarfer was nominated by former president Joe Biden to serve in the role in 2023 and was confirmed by the Senate last year.\nTrump called the 73,000 jobs figure for July a “shock” and the 258,000 jobs numbers cut a “major mistake”.\n“The Economy is BOOMING under ‘TRUMP’ despite a Fed that also plays games, this time with Interest Rates, where they lowered them twice, and substantially, just before the Presidential Election, I assume in the hopes of getting ‘Kamala’ elected – How did that work out?” he wrote, referring to former vice-president Kamala Harris, his opponent in last year’s presidential election.\n\nIn a separate post, Trump further cranked up his rhetoric, claiming the new jobs numbers were “rigged” and a “scam” to make Republicans and himself “look bad”.\n“Just like when they had three great days around the 2024 Presidential Election, and then, those numbers were ‘taken away’ on November 15, 2024, right after the Election, when the Jobs Numbers were massively revised DOWNWARD, making a correction of over 818,000 Jobs – A TOTAL SCAM,” read his post.\nTrump also directed his ire at Federal Reserve Chair Jerome Powell again.\n“Jerome ‘Too Late’ Powell is no better … ‘Too Late’ Powell should also be put ‘out to pasture’,” he wrote.\nThe firing came on the day when Trump’s “reciprocal tariffs” come back into force for most of America’s trading partners after he made sweeping modifications to rates the night before.\nWith levies kicking in when the US has reached trade pacts with just a few partners, there have been broad concerns that companies are lowering hiring amid the uncertainty and as global trade is in a flux.\nSeveral widely traded US companies have issued warnings in recent months about how Trump’s tariff plans may damage their earnings prospects.\nWalmart CEO Doug McMillon warned investors in May that the company was unable to “absorb all the pressure given the reality of narrow retail margins” and that “higher tariffs will result in higher prices”.\nAbout a week later, Best Buy CFO Matt Bilunas lowered his company’s 2026 sales forecast to “incorporate the impact of tariffs”, which the retailer expects to “stay at the current levels for the rest of the year”.\nA long-awaited trade agreement with China, including the continuation of a pause on tariffs, is also taking longer to be confirmed by the Trump administration, days after Treasury Secretary Scott Bessent concluded the latest round of talks with the Chinese in Sweden on Tuesday.","summary":"US President Donald Trump said on Friday he had ordered the commissioner of the US Bureau of Labour Statistics, Erika McEntarfer, fired, alleging data falsification, not long after July’s disappointing jobs numbers challenged his claim of a burgeoning American economy.\nThe latest BLS data, which had been released earlier on Friday, showed employment growth last month was anaemic, with a gain of merely 73,000 non-farm jobs, below market expectations of an increase of more than 100,000...","url":"https://www.scmp.com/news/world/united-states-canada/article/3320512/trump-orders-labour-official-fired-after-weak-jobs-report-renews-attack-fed-chief","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/08/02/6f0d77af-9b98-4b88-9360-8e0b94fea261_36926cf5.jpg","video":null,"publish_date":"2025-08-01 18:56:48","author":"Frank Chen","authors":["Frank Chen"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.268},{"id":347373988,"title":"The Faulkner Focus - Friday, August 1","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode August 01, 2025 41:37 \n FULL EPISODE\n\n EXP 7 DAYS\n The Faulkner Focus - Friday, August 1 \n Donald Trump, Tariff date, Kamala Harris\n Tags MOST RECENT EPISODES | VIDEOSTHE FAULKNER FOCUS | FULL EPISODES | FOX NEWS","summary":"Donald Trump, Tariff date, Kamala Harris","url":"https://www.foxnews.com/video/6376457122112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/84dcd2a3-94cb-4965-ad2b-7578388153ab/f243c152-ef7d-4b3b-8e32-efa9cac5e9a8/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-08-01 18:53:49","author":null,"language":"en","source_country":"us","sentiment":-0.281},{"id":347380740,"title":"Kamala Harris says she doesn’t plan to return to ‘broken’ system of US politics","text":"After she announced she will not run for the governorship of California just a day earlier, Harris told the TV show that it was about something more “basic” than whether she wanted to run for something else instead — with the subtext being whether she will attempt a White House run again in 2028.\n\n“Recently I made the decision that I just — for now — I don’t want to go back in the system. I think it’s broken,” she said, provoking a collective groan from the studio audience. Colbert later returned to the subject, saying that her remark was harrowing.\n\n“Well, but it’s also evident, isn’t it?” she said.\n\nDescribing herself as a “devout public servant”, the former vice-president added: “I always believed, that as fragile as our democracy is, our systems would be strong enough to defend our most fundamental principles. And I think right now that they’re not as strong as they need to be. And for now I don’t want to go back into that system.” \n\nHarris’s choice of The Late Show as the channel for her first post-election defeat interview was pointed. The most-watched talkshow was cancelled last month by the CBS network, which pleaded financial stress, though the decision was widely denounced as being politically motivated.\n\nThe cancellation was announced after Colbert had criticized CBS and its parent company Paramount Global for reaching a $16m settlement with Trump. The president had sued CBS News over an interview on the 60 Minutes show with Harris at the height of last year’s presidential campaign, which Trump claimed had been manipulated in her favour.\n\nNone of this febrile back story was mentioned by either Colbert or Harris on Thursday. But she did delivery a passionate lament for the numbers of people who she said had “capitulated” to the aggressive second Trump administration.\n\nWhen Colbert invited her to say “I told you so” after she had predicted many of Trump’s most contentious moves — including Medicaid cuts, ignoring court orders, and “massive tax cuts to the rich” — she replied: “But Stephen, what I did not predict was the capitulation.” She went on: “Perhaps it’s naive of me … there should be many who consider themselves to be guardians of our system and our democracy who just capitulated, and I didn’t see that coming.” \n\nThe timing of the interview was also poignant, as she was considered to be the automatic frontrunner if she had decided to run to become the next governor of California.\n\nHer wider remarks on “the system” help explain that decision, though they still notably left room for another possible presidential run. In the meantime, Harris has a book to sell, 107 Days, which she name-checked copiously on the Late Show in advance of its publication next month.\n\nThe book, as its title suggests, relates the story of the shortest presidential run of all time. She said it would give a “behind-the-scenes sharing” of those intense days.\n\nWhether it is to sell the book or to lay the foundations for another presidential bid remains a moot point, but Harris said she wanted to use the next period to “travel the country and listen to people. I don’t want it to be transactional, where I’m asking for their vote.”\n\nHarris admitted that it had taken her months following her defeat before she had the strength to tune into the news again. “You know, I’m just not into self-mutilation,” she said. Instead there had been “lots of cooking shows”, her top choice being The Kitchen.\n\n — The Guardian","summary":"Former vice-president talked to Colbert in first interview since election, after declining bid for California governor","url":"https://www.irishexaminer.com/world/arid-41680811.html","image":"https://www.irishexaminer.com/cms_media/module_img/9455/4727603_2_seoimage1x1_US_20Harris_20155241.jpg","video":null,"publish_date":"2025-08-01 18:52:00","author":"Irishexaminer.com,The Guardian","authors":["Irishexaminer.com","The Guardian"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.276},{"id":347366382,"title":"The many reasons Kamala Harris is never running for public office again","text":"D) Inauthentic\n\nE) Both C and D\n\nIf you answered E, you’re correct. And sure, technically, Harris is historic in the sense she’s the first female vice president in history. But that title was bestowed, not earned, all thanks to Rep. James Clyburn (D-SC) reportedly demanding that she be chosen as former President Joe Biden‘s No. 2 if he wanted his endorsement to save his then-failing campaign in South Carolina in 2020. That made her the most infamous DEI hire in U.S. political history.\n\nEarlier this week, the former California senator announced she would not run for governor of her state. This was unsurprising considering that donors are not exactly lining up to hand her the same millions she blew through in the 107 days she ran for president — $1.5 billion to be precise.\n\nOn top of that, a July poll from the University of California shows that Harris only received 41% of the vote against an unnamed Republican in a hypothetical matchup, which is a shockingly low number for any Democrat in California, especially one with her kind of name-brand recognition.\n\nSimply put, in political terms, Harris is a losing proposition. Let’s take a walk down memory lane to underscore this point: She was the first to announce her run for president in 2019 to much media hype, with the usual pundits calling her “the female Obama.” And after a brief rise in the polls following an early July 2019 primary debate when she basically called Biden a racist, she looked to be the front-runner for the nomination.\n\n“Kamala Harris had a moment that was two hours long. I mean, a star was born tonight,” CNN’s Van Jones cooed at the time in providing analysis that has aged like milk in a sauna. “She completely dominated the stage, and most importantly, she would kick Donald Trump’s butt, and she proved it tonight. That was — if you had any doubt that you could nominate a woman that would take Donald Trump to the woodshed, she just took it away from you.”\n\nBut the more Harris spoke that year, the more voters ran away. Her campaign, devoid of any central theme or optimism, was a mess, with staffers jumping ship and complaining about how difficult it was to work for her. Donations dried up. And in the span of two months after that debate where she wounded Biden, she wasn’t even polling well in her home state of California, even trailing (checks notes) Andrew Yang in polls in the fall of 2019. She dropped out of the race well before the first votes were cast in Iowa.\n\nBut thanks to Biden’s promise to Clyburn, Harris was given new life as the old man’s running mate in a race dominated by COVID-19, which turned the economy completely upside down. The basement campaign worked, with Biden and Harris never being challenged or scrutinized by the media in any serious way. The two failed upward to the presidency by eking out wins in the swing states of Pennsylvania, Michigan, Wisconsin, Georgia, and Arizona.\n\nAfter taking office, the plan was to present Biden and Harris as a package deal in working as equal partners as president and vice president. To underscore this partnership, Harris was tasked to be “border czar” in an effort to find the “root causes” of illegal immigration. But this was a profoundly contradictory choice given she once compared Immigration and Customs Enforcement to the Ku Klux Klan, called Trump’s border wall “medieval” while arguing that illegal border crossings weren’t illegal.\n\nAs expected, border crossings under Harris continued to skyrocket as millions poured over the border each year of the administration, unabated. Harris, who has never been accused of having a strong work ethic, didn’t even bother to visit said border until months after it was assigned as her top priority as vice president. And when she did visit, the location chosen was not illegal crossing hotbeds such as Eagle Pass, Texas, or the Rio Grande Valley, but instead El Paso, Texas, which had significantly fewer crossings and was cleaned up ahead of her short visit.\n\nUnder Biden, Harris was also put in charge of “voting rights,” code for efforts to federalize voting laws over having individual states decide, but also failed on that front after Sens. Joe Manchin and Krysten Sinema, both Democrats-turned-independents, joined 50 Senate Republicans in shooting down the measure. She was also tasked with leading the National Space Council, only to leave two U.S. astronauts stranded in space who were eventually rescued by Elon Musk‘s SpaceX at the request of President Donald Trump earlier this year.\n\nAs vice president, if just looking at the facts, she gets an F-minus. But yet again, she received another political lifeline after Biden’s brain turned to mashed potatoes in front of the entire world during his disastrous debate against Trump in June 2024. Biden dropped out of the race a few weeks later, with Democrats being forced to turn to Harris thanks to $350 million in campaign contributions to the Biden-Harris campaign that were nontransferable.\n\nWe all know what happened from there: Harris didn’t do one news interview for the first six weeks of her campaign, even avoiding The View and MSNBC, clearly illustrating her advisers’ reluctance to have her speak anywhere outside of a teleprompter. When she finally engaged on a media tour, one of her stops included The View, where she somehow flubbed a T-ball question from Sunny Hostin: “If anything, would you have done something differently than President Biden during the past four years?”\n\nHarris, looking skyward in thought, said, “There’s not a thing that comes to mind.”\n\nAnd that essentially was the end of her campaign. Per Democratic strategist James Carville, “It’s the one question that you exist to answer, all right? That is it. That’s the money question. That’s the one you want. That’s the one that everybody wants to know the answer to. And you freeze, you literally freeze, and you say, ‘Well, I can’t think of anything,'” he said in a postelection analysis. “But when we go back, and history unearths this, it’s going to be right there on The View. And I think her name was Sunny Hostin … asked the question, and that’s the most devastating answer you could imagine.”\n\nHe’s 100% correct. Harris was running as the change candidate, yet said she wouldn’t change a thing about the worst presidency we have witnessed in our lifetimes.\n\nShe made mistake after mistake: paying millions for celebrities to perform at her rallies, skipping the Al Smith dinner, flip-flopping on every major issue, choosing goofy Tim Walz as her running mate, etc. In the end, Trump won every swing state, the popular vote, and 89% of counties in this country went more red than blue.\n\nIf that isn’t failure, I’m not sure what is.\n\nSome are now speculating that Harris decided to forgo running for California governor to opt for another run for president. But here’s a prediction: She will not run for any public office again.\n\nBecause, as we just laid out, she has never accomplished anything on a national level unless it was handed to her. She actually would have to fight for the nomination this time. And as we saw in 2019 and again in 2024, the more voters see and hear of her, the more they dislike her: Too scripted, too phony, no guiding principles whatsoever, and a person who simply does not want to put the work in.\n\nHarris appeared Thursday night on The Late Show with Stephen Colbert as the host continued his patently unfunny late-night therapy session for Democrats. The reason she appeared was to promote her new memoir, 107 Days, which is about her 2024 campaign.\n\nAt one point, in what is the most tedious late-night interview one will ever see, Colbert asked Harris twice if she could name any leaders in the Democratic Party.\n\nAnd she couldn’t do it and could only muster, twice, that there are “lots of good leaders.” Even Colbert couldn’t save her.\n\nFailed talk-show host. Failed candidate. Both know how to spend boatloads of money without any return on investment.\n\nIf Harris doesn’t run again, many Democrats will be breathing a sigh of relief.\n\nBecause “the third time’s a charm” doesn’t apply in presidential politics, especially to the likes of Kamala Devi Harris.","summary":"When you see the name &#8220;Kamala Harris,&#8221; what&#8217;s the first word that pops into your mind? A) Historic B) Winner C) Loser D) Inauthentic E) Both C and D If you answered E, you&#8217;re correct. And sure, technically, Harris is historic in the sense she&#8217;s the first female vice president in history. But that title [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3488678/why-kamala-harris-never-running-for-office-again/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/harris.-gov.webp","video":null,"publish_date":"2025-08-01 18:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","category":"politics","source_country":"US","sentiment":-0.261},{"id":347365346,"title":"Stephen Colbert’s Kamala Harris Interview Brought Together Two Beleaguered Symbols of Embattled Institutions","text":"To announce that she would not be running for any public office — including governor of California, a race she had already declined to enter in a written statement — Kamala Harris chose a fitting venue. The former Vice President gave her first major televised interview since losing last year’s presidential election to Stephen Colbert, […]","summary":"To announce that she would not be running for any public office — including governor of California, a race she had already declined to enter in a written statement — Kamala Harris chose a fitting venue. The former Vice President gave her first major televised interview since losing last year’s presidential election to Stephen Colbert, [&#8230;]","url":"https://variety.com/2025/tv/opinion/kamala-harris-stephen-colbert-column-1236476807/","image":"https://variety.com/wp-content/uploads/2025/08/3098261_0176-636e8660da6eefcb.jpg","video":null,"publish_date":"2025-08-01 17:40:00","author":"Alison Herman,Alisoncolleherman","authors":["Alison Herman","Alisoncolleherman"],"language":"en","source_country":"US","sentiment":-0.427},{"id":347367562,"title":"Charlamagne Tha God Pours Cold Water on Kamala Harris’ Hopes for 2028: ‘Democrats Suck So Bad’","text":"Podcaster and radio host Charlamagne Tha God is warning former Vice President Kamal Harris that another run for president would just be a waste of time for her.\n\nThe popular left-wing podcaster has been very dour on the Democrats for at least a year at this point as he found the party wanting long before Donald Trump won re-election to the White House. And he never really thought Harris had a shot at becoming president. Evidently, his opinion hasn’t changed at all.\n\nDuring Thursday’s The Breakfast Club show, Charlamagne was happy to help flog the ex-VP’s book, but he also had a warning for her for her future in politics.\n\n“I think Kamala can definitely be a leader in the Democratic Party. And I mean, I think the interesting thing about the former VP is I kind of like that strategy,” he said.\n\nHe went on to insist that she really has no chance to win the White House.\n\n“I don’t know if she should run again, but I definitely would like to see her write a book. I definitely would like to see her start a podcast and just build a real connection with people. And she is relatively young,” the podcaster and radio host said. “I just don’t know what’s going to happen in 2028, man. I just think Democrats suck so bad. I don’t know.”\n\nIf Harris were to try and run for president again, it would be her third shot at the nation’s top office. First, she ran a campaign so bad she was the one of the first to quit and didn’t win a single primary back in 2019. Then she became the accidental nominee when her boss, Joe Biden, decided not to seek a second term — and she suffered an historic loss that time, too.\n\nCharlamagne has been down on the Democrats for quite some time. Only days ago, the podcaster was complaining that the Democrat Party doesn’t “have the team or the message to win the midterms.”\n\n“That’s just my lack of faith in the Democrats,” Charlamagne said. “I just don’t see them having the team or the message to win in the midterms.”\n\n“I think we’ve seen and realize that Trump being bad is not good enough,” he continued. “Trump being a liar is not good enough” to let Democrats win,” he said.\n\nFollow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, X at WTHuston, or Truth Social at @WarnerToddHuston.","summary":"Podcaster and radio host Charlamagne Tha God is warning former Vice President Kamal Harris that another run for president would just be a waste of time for her. The popular left-wing podcaster has been very dour on the Democrats for\n\n\nThe post Charlamagne Tha God Pours Cold Water on Kamala Harris’ Hopes for 2028: ‘Democrats Suck So Bad’ appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/01/charlamagne-tha-god-pours-cold-water-on-kamala-harris-hopes-for-2028-democrats-suck-so-bad/","image":"https://media.breitbart.com/media/2025/07/Charlamagnekamala-640x335.jpg","video":null,"publish_date":"2025-08-01 17:10:24","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","source_country":"US","sentiment":-0.558},{"id":347348886,"title":"CNN Ratings: Another Brutal July","text":"CNN is still reeling in viewership after Donald Trump's election victory over Kamala Harris last November. Specifically, the network’s total viewership dropped by 42% in July compared to the same month last year, while ratings in the key 25–54 advertising demographic fell by 55%. Moreover, not a single CNN program ranked among the top 15 highest-rated shows in cable news for the month. That list was as follows: As evidenced by the chart, MSNBC continues to rely heavily on Rachel Maddow. Overall, the network’s total viewership declined by 27% in July compared to the same month in 2024. So, better than CNN. But still bad. Both CNN and MSNBC have a star problem. Between the two channels, Maddow is the only real difference maker – and she only hosts once a week. By comparison, Fox News has multiple needle movers, including Jesse Watters, Sean Hannity, Will Cain, and Bret Baier. It’s not even clear who CNN’s biggest star is these days. Anderson Cooper and Jake Tapper remain the most recognizable names, but they’ve struggled to stay relevant in the broader media conversation. Conservative commentator Scott Jennings has become the network’s most viral personality, yet he’s still just a contributor on Abby Phillip’s primetime program. Primetime remains CNN’s most pressing concern. In July, the network averaged just 497,000 total viewers in primetime. Re-airs on Nickelodeon are now more popular than CNN's primetime lineup. And it's hard to see much changing for CNN. Stephen Colbert could be a possibility, once he departs CBS next year. Then again, Colbert cost CBS around $40 million a year in losses. With parent company Warner Bros. Discovery announcing plans to separate its cable assets (CNN, TBS, and TNT) from its streaming service and studios (Max, DC Universe), CNN will likely look to spend less, not more, on talent moving forward. Other than another Russia Hoax, under 500,000 in primetime is likely CNN's new reality.","summary":"A look at CNN&apos;s ratings in July.","url":"https://www.outkick.com/analysis/cnn-ratings-another-brutal-july","image":"https://static.outkick.com/www.outkick.com/content/uploads/2024/01/GettyImages-498133654.jpg","video":null,"publish_date":"2025-08-01 17:09:44","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","source_country":"us","sentiment":-0.112},{"id":347417734,"title":"Kamala Harris, former US Vice President quits politics, says ‘US political system is…’, ‘will no longer…’","text":"New Delhi: Former US Vice President Kamala Harris has announced to quit politics. In an interview on The Late Show with Stephen Colbert she said that she will no longer contest for any political post including the post of Governor of California.\nWhat did Harris say about her political career?\nKamala Harris served as the 49th vice president of the United States from 2021 to 2025 under President Joe Biden. Harris said that she has served the public throughout her career.\nShe said “Americas political system is broken and I am not strong enough to protect democratic values. I thought a lot about becoming a governor. I love my state of California but now I feel that my ability to bring change in the system has diminished.”\nWhen is her book ‘107 Days’ releasing?\nStephen Colbert told Harris that it is worrying for such a capable person like her to say that the system is broken. Harris also said that she now wants to travel across the country and talk to people but not to ask for votes but to listen to them.\nHer new book 107 Days is going to be released on September 23 in which she has mentioned her experiences of 107 days of presidential election campaign. Harris was asked what was most surprising in those 107 days Harris said every night I prayed that I have done everything with my full strength today.\nKamala Harris lost to Donald Trump in the 2024 presidential election as Trump won the Electoral College of the presidential election with 312 votes while Harris got 226 votes.\nWhen did Harris start her political career?\nHarris started her political career as a district attorney in 1990. She rose from district attorney to state attorney and then to the Senate. A year after becoming the district attorney Kamala started getting embroiled in controversies over her approach. These controversies increased Kamalas popularity.\nAs an attorney Kamala worked to reduce the death penalty as she believes that the judicial system should focus more on preventing crime than giving punishment. She also got the major punishment reduced in minor crimes.","summary":"Harris started her political career as a district attorney in 1990.","url":"https://www.india.com/news/world/kamala-harris-former-us-vice-president-quits-politics-says-us-political-system-is-will-no-longer-stephen-colbert-california-joe-biden-107-days-donald-trump-7985491/","image":"https://static.india.com/wp-content/uploads/2025/08/QT-Kamala-Harris-BEFUN.jpg","video":null,"publish_date":"2025-08-01 17:07:13","author":"Tahir Qureshi","authors":["Tahir Qureshi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.043},{"id":347356872,"title":"Harris calls US political system 'broken' in first interview since election loss","text":"Former Vice President Kamala Harris says the U.S. political system is \"broken.\"Harris made the comment on \"The Late Show with Stephen Colbert,\" her first interview since losing the presidential election to Donald Trump.Asked whether her decision not to pursue the California governor’s office was because she hoped to run for a different office — possibly president again — Harris told Colbert, \"No.\"RELATED STORY | Former Vice President Kamala Harris says she will not run for California governor\"For now, I don't want to go back into the system. I want to travel the country, I want to listen to people, I want to talk with people, and I don't want it to be transactional where I'm asking for their vote,\" she said.Harris added that she wants to remind Americans that the country was founded on the idea of democracy, and that people have the power to change what they don’t like about their government.\"You can never let anyone take your power from you, and for me, that's what I would like to remind folks of,\" Harris said.RELATED STORY | Kamala Harris sounds alarm on authoritarianism in high-profile speechThe former vice president was in the presidential race for 107 days following President Joe Biden's decision to drop out.She has since written a book about the whirlwind experience.\"There are things I would do differently,\" Harris said, while noting she was grateful for her team and supporters who rallied around her candidacy.Her memoir, \"107 Days,\" is scheduled to be released on Sept. 23.","summary":"Kamala Harris says the U.S. political system is \"broken.\" The former VP made the comment on \"The Late Show with Stephen Colbert,\" her first interview since losing the presidential election.","url":"https://www.scrippsnews.com/politics/harris-calls-us-political-system-broken-in-first-interview-since-election-loss","image":"https://ewscripps.brightspotcdn.com/dims4/default/341f12d/2147483647/strip/true/crop/4495x2360+0+318/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fe9%2F80%2F6758c6334ed4a8c89ec132c965e5%2Fap25212453268760.jpg","video":null,"publish_date":"2025-08-01 16:38:31","author":"Scripps News Group","authors":["Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":347331208,"title":"Biden slurs way through latest speech, touts nominating ‘demographically diverse’ judges","text":"Former President Joe Biden touted appointing Supreme Court Justice Kentanji Brown Jackson, the first Black woman to serve on the Supreme Court, during a slur-filled speech at the National Bar Association's 100th annual gala at the Hyatt in Chicago Thursday evening — just hours after one of his top aides testified before the Republican House Oversight Committee for their investigation into the former president’s fitness for office. Biden slurred on multiple occasions during the night, including while discussing serving as the vice president to the first Black president, former President Barack Obama, and selecting Kamala Harris as his vice president. Harris was the first woman of Black and South Asian heritage to serve in the role. Likewise, Biden said he also selected demographically diverse judges during his administration. KAMALA HARRIS TO PUBLISH BEHIND-THE-SCENES ACCOUNT OF FAILED 2024 CAMPAIGN \"I promised to have an administration that looked like America and appoint a bench that looked like America,\" Biden said. \"And I kept my promise. I appointed the most demographically diverse … slate of judges ever in the history of the United States of America. The top of that list, one of the greatest lawyers I've ever met, Ketanji Brown Jackson, the first Black woman on the United States Supreme Court.\" \"Justice Jackson, as you witnessed earlier this week, has proven herself to have the wisdom and the character that I saw in her when I nominated her. Appointed 13 Black women to the Courts of Appeals of the United States Federal Court, more than every other president in American history combined,\" he said. \"For other historic firsts as well, for historic, for Hispanic Americans, Asian Americans, Muslim Americans, by the way, I didn't just appoint Ivy League judges.\" DNC VICE CHAIR COMPARES TRUMP TO NOTORIOUS SEGREGATIONISTS DURING HEATED TOWN HALL EVENT WITH BETO O'ROURKE The National Bar Association originally formed in Iowa before Black attorneys were permitted to join the American Bar Association, and is now made up of 66,000 members working in law who advocate for civil rights and diversity. Those who attended the event included Jackson, as well as Rep. Jasmine Crockett, D-Texas, Minnesota Attorney General Keith Ellison, Nevada Attorney General Aaron Ford, MSNBC pundit Joy-Ann Reid and New York Attorney General Letitia James. Biden and his allies have faced allegations of concealing the truth about Biden’s mental fitness while in office, following his debate performance against President Donald Trump on June 27, 2024 in Atlanta, where Biden struggled to answer seemingly basic questions. LONGTIME BIDEN AIDE TESTIFIES HE STOOD TO EARN UP TO $8M HAD PRESIDENT WON RE-ELECTION Multiple books have been written in 2025 detailing Biden’s final days in office, his deteriorating mental faculties and challenges within the Democratic Party as a result of his decision to withdraw from the election. Additionally, several investigations are ongoing on Capitol Hill concerning Biden’s mental decline. For example, the House Oversight Committee is examining the cover-up of Biden’s cognitive decline and potentially unauthorized executive actions taken during his presidency. Earlier Thursday, longtime Biden aide Michael Donilon appeared before the House Oversight Committee and told lawmakers that he could have raked in a total of $8 million if Biden had won re-election in 2024, Axios first reported. Fox News Digital reached out to Biden's spokesperson for comment and has not yet received a reply. Fox News’ Charlie Creitz and Alex Schemmel contributed to this report.","summary":"Former President Joe Biden slurred on multiple occasions during the night, including while discussing serving as the vice president to the first Black president, former President Barack Obama.","url":"https://www.foxnews.com/politics/biden-slurs-way-through-latest-speech-touts-nominating-demographically-diverse-judges","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/screenshot-2025-07-31-at-9.09.07 pm.png","video":"https://www.foxnews.com/video/6376444540112","publish_date":"2025-08-01 16:35:58","author":"Diana Stancy","authors":["Diana Stancy"],"language":"en","category":"politics","source_country":"us","sentiment":0.342},{"id":347350532,"title":"Mike Donilon Had $4 Million Incentive to Secure a 2024 Biden Win","text":"It is not uncommon for top campaign aides to be promised what is often referred to as a “win bonus” should their candidate prevail. But the amount that Mr. Donilon would have received had Mr. Biden won is a remarkable sum. The $4 million he was already paid dwarfed the salaries of other senior campaign officials for Mr. Biden — and later for Vice President Kamala Harris.\n\nMr. Donilon began his opening statement on Thursday by defending Mr. Biden’s record in office and his own role working for the president. He said Mr. Biden was not diminished by his advanced age.\n\n“Every president ages over the four years of a presidency and President Biden did as well, but he also continued to grow stronger and wiser as a leader as a result of being tested by some of the most difficult challenges any president has ever faced,” Mr. Donilon told the committee, according to a copy of his opening statement reviewed by The New York Times.\n\n“I thought that experience was enormously valuable for the nation,” he said. “I believed that President Biden was the best person to lead the country on the day he took the oath of office, and I continued to believe that was true every day he served as president.”\n\nHe said Mr. Biden was “deeply engaged and in command on critical issues.”\n\nBut later in his testimony, the person briefed on his remarks said, Mr. Donilon conceded that he was often “frustrated” by “the visuals of President Biden that people were seeing.”","summary":"Mike Donilon was promised a bonus that would have doubled his payment for work on the campaign if the former president had been re-elected.","url":"https://www.nytimes.com/2025/08/01/us/politics/mike-donilon-biden-2024-bonus.html","image":"https://static01.nyt.com/images/2025/08/01/multimedia/pol-donilon-kmhz/pol-donilon-kmhz-videoSixteenByNineJumbo1600.jpg","video":null,"publish_date":"2025-08-01 16:30:30","author":"Tyler Pager","authors":["Tyler Pager"],"language":"en","source_country":"us","sentiment":0.055},{"id":347347010,"title":"Kamala Harris decries 'broken' system as Colbert wonders if she's quitting politics","text":"to top close Video This video is playing in picture-in-picture.\n\nMedia August 01, 2025 01:19 \n\n Kamala Harris decries 'broken' system as Colbert wonders if she's quitting politics \n Kamala Harris and Stephen Colbert discuss what they claim is a \"broken\" political system on \"The Late Show.\"\n Tags MEDIAV-VIDEO","summary":"Kamala Harris and Stephen Colbert discuss what they claim is a &quot;broken&quot; political system on &quot;The Late Show.&quot;","url":"https://www.foxnews.com/video/6376449597112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b72f30e1-b85a-4577-85c4-1cbd1eb13e8c/c32b3523-0654-4704-9ebf-159d6e71c459/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-01 16:27:48","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.391},{"id":347321462,"title":"Awkward moment Kamala Harris waffles when pressed about who is the leader of the Democrats","text":"Former Vice President Kamala Harris wouldn't give a name when asked who the current leader is of the Democratic Party. \n\nHarris appeared Thursday night on the Late Show With Stephen Colbert following last month's shock announcement that CBS was cancelling the program next spring. \n\nThe previous Democratic presidential nominee announced this week that she had penned a book about her failed 2024 campaign experience entitled 107 Days, which will be released next month. \n\nHarris also revealed that she won't be running for California governor in 2026, teeing up speculation she's planning to mount another presidential bid in 2028 instead.\n\nColbert was quick to press her on who the real leader of the Democrats is now, as other potential 2028 hopefuls - including Gov. Gavin Newsom, Pete Buttigieg and Rep. Alexandria Ocasio-Cortez - wait in the wings. \n\n'Who's leading the Democratic Party? I'm just curious,' Colbert prodded. \n\nHarris briefly paused. 'There are lots of leaders,' she responded. \n\nColbert didn't buy it. \n\n'There's generally a leader of the Democratic Party,' the liberal comedian continued, cuing laughs. 'Who comes to mind?' \n\nHarris, again, didn't name names. \n\n'I think there are a lot of - I'm not going to go through names because I'm going to leave somebody out and then I'm going to hear about it,' the former VP answered. \n\n'But let me say this,' she continued. 'I think it is a mistake for us who want to figure out how to get out and through this, and get out of it, to put it on the shoulders of any one person. It's really on all of our shoulders. It really is,' Harris added. \n\nTypically a former president or the party's most recent presidential nominee would be considered the party leader - but Harris didn't volunteer herself nor former President Joe Biden. \n\nShe also announced this week that she would not seek the job of California governor. \n\nAfter leaving Washington in January for Los Angeles, Harris was reportedly mulling a run. \n\nShe had previously served as a U.S. senator from California and the state's attorney general, before being sworn-in as vice president in 2021. \n\nColbert asked Harris why she had decided to sit this one out - and if she planned to run for a different office, alluding to another presidential run in 2028. \n\n'No, no, no,' she answered. \n\n'It's more, perhaps, basic then that,' Harris continued. 'I am a devout public servant. I have spent my entire career in service of the people and I thought a lot about running for governor. I love my state, I love California.'\n\nShe then told Colbert she wanted to be 'very candid with you.' \n\n'For now, I don't want to go back in the system, I think it's broken,' Harris said. 'I want to travel the country, I want to listen to people, I want to talk to people and I don't want it to be transactional where I'm asking for their vote.' \n\nPresident Donald Trump, who beat Harris in November's election, was asked Thursday about his former rival's decision not to run for California governor. \n\n'Well, she can't speak,' Trump replied. 'She can't talk. She can't do an interview.' \n\n'I thought it was a very strange campaign that we had,' the president added.","summary":"Former Vice President Kamala Harris wouldn't give a name when asked who the current leader is of the Democratic Party.","url":"https://www.dailymail.co.uk/news/article-14962839/kamala-harris-stephen-colbert-leader-democrats.html","image":"https://i.dailymail.co.uk/1s/2025/08/01/16/100850825-0-image-m-34_1754063916091.jpg","video":null,"publish_date":"2025-08-01 16:15:29","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.205},{"id":347374068,"title":"Reporter speaks out about why The Washington Post is bleeding talent","text":"Pulitzer Prize-winning journalist Jonathan Capehart on Thursday called out The Washington Post’s shifting editorial focus when explaining his decision to leave the paper.\n\nWhile guest-hosting “The Last Word with Lawrence O’Donnell” on Thursday, Capehart alluded to Post owner Jeff Bezos’ February directive that the editorial section stop publishing pieces critical of traditionally conservative principles like “free markets.” Capehart also cited the paper’s new editorial head’s edict that the section “communicate with optimism about the country in particular and the future in general.”\n\n“How can we communicate with optimism about the future in general when we're living in the here and now, where American democracy is in peril?” Capehart said. “Unapologetic patriotism is incomplete if it doesn't allow for a mirror to be held up to America, her people, and her president—to hold them all accountable when they have strayed from her founding principles.” \n\nAfter detailing the Trump administration’s various abuses of power—such as deploying troops in Los Angeles—Capehart continued, “And we're supposed to ignore it, leave it to others to wrestle with on their news pages and websites? No, no, no, no, no. The Constitution gives us the inherent, unapologetically patriotic right to rail against such affronts to democracy and the rule of law, and the First Amendment demands it.”\n\nCapehart joins at least 100 journalists and staffers who have resigned or taken buyouts since November, according to a list compiled by Politico. Shortly before the 2024 presidential election, Bezos killed the Post’s endorsement of Democratic nominee Kamala Harris.\n\nThe Post continues to bleed both subscribers and talent as Bezos further prostrates himself before Trump, revealing his utter lack of principles.","summary":"Pulitzer Prize-winning journalist Jonathan Capehart on Thursday called out The Washington Post’s shifting editorial focus when explaining his decision to leave the paper.\n\n\n\nWhile guest-hosting “The Last Word with Lawrence O’Donnell” on Thursday, Capehart alluded to Post owner Jeff Bezos’ February directive that the editorial section stop publishing pieces critical of traditionally conservative principles like “free markets.” Capehart also cited the paper’s new editorial head’s edict that the section “communicate with optimism about the country in particular and the future in general.”\n\n\n\n“How can we communicate with optimism about the future in general when we're living in the here and now, where American democracy is in peril?” Capehart said. “Unapologetic patriotism is incomplete if it doesn't allow for a mirror to be held up to America, her people, and her president—to hold them all accountable when they have strayed from her founding principles.” \n\n\n\nAfter detailing the Trump administration’s various abu","url":"https://www.dailykos.com/story/2025/8/1/2336244/-Reporter-speaks-out-about-why-The-Washington-Post-is-bleeding-talent?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1462934/story_image/AP22138174103258.jpg?1754064440","video":null,"publish_date":"2025-08-01 16:14:05","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","category":"politics","source_country":"US","sentiment":-0.008},{"id":347367578,"title":"‘The Naked Gun’ (2025) Review: Good-Natured Reboot Eventually Runs Out of Gas","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBART\n\nTariff Deals\nTrump Interview\nNYC Shooting\nRussia Hoax Exposed\n\nIsrael vs Hamas\n\n‘The Naked Gun’ (2025) Review: Good-Natured Reboot Eventually Runs Out of Gas\n\n Paramount Pictures\n\nJohn Nolte1 Aug 2025 \n\nEntertainment\n\nmovie review \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nTrump Threatens Canada: No Trade Deal if Hamas Rewarded with State\nTim Kaine: Trump's 'Chaos and Tariffs' Running Economy Aground\nChina Debuts 15-Point 'Birth-Friendly' Plan to Reverse Fertility Collapse\nWatch: Kamala Harris Can’t Name Democrat Party Leader\nTOO LATE: The U.S. Economy Added 73,000 Jobs In July\nWhistleblower Reveals How They Were Threatened to Go Along with Russia Hoax\nExclusive -- FL DOE Calls for Discipline of School Board\nKamala Harris Mocked for Writing 'Word Salad' Book About Failed Campaign\nExclusive-Bessent Warns of ‘Caracas on the Hudson’ as Young Voters Turn to\nZelensky Calls For Regime Change to Remove Putin Permanently\n\nFROM THE HOMEPAGE\n\nEXCLUSIVE: Trump Delivers ‘Most Secure Border in History’ with New Record Low Arrests in July — Zero Admissions for 3 Months\nIs Fluoride Helping or Hurting Us? A New Option for Gum Health Emerges\nTrump Orders U.S. Nuclear Subs Repositioned Over Statements from Ex-Russian Leader Medvedev\nJury Finds Elon Musk’s Tesla Partly at Fault in Autopilot Crash Lawsuit, Awards $200 Million in Damages\nDark Brandon 2.0 Attempts Comeback: Joe Biden Declares ‘These Are Dark Days,’ Says Law and Media No Longer ‘Rooted in Justice’\nSkydance Says It Had No Role in Cancelling Stephen Colbert, Blowing Hole in Democrat Conspiracy Theory\nJD Vance Mocks Democrats Calling Sydney Sweeney ‘Nazi’ Over American Eagle Ad: ‘Great Strategy’ to Win Back Men\nChannel Migrant Crisis Arrivals For 2025 Soar Past 25,000 in Record Year\nVIDEO: Man Who Brutally Killed His Family with Machete Becomes Florida’s Ninth Execution in 2025\nExclusive — Marsha Blackburn: Democrats Earning ‘Obstructionist’ Brand by Delaying Trump Nominees\nFrance Suspends Palestinian Refugee Programme After Discovering it Admitted an Antisemite\n‘Fortnite’ Developer Epic Games Celebrates ‘Total Victory’ over Google in App Store Antitrust Case \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"Let’s hope The Naked Gun (2025) is a monster hit and marks a return to the good-natured, likable comedy. The first half alone is more enjoyable and filled with more laughs than 99 percent of what passes for comedy these days.\n\n\nThe post ‘The Naked Gun’ (2025) Review: Good-Natured Reboot Eventually Runs Out of Gas appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/01/the-naked-gun-2025-review-good-natured-reboot-eventually-runs-out-of-gas/","image":"https://media.breitbart.com/media/2025/08/the-naked-gun-640x335.jpg","video":null,"publish_date":"2025-08-01 16:08:33","author":"John Nolte","authors":["John Nolte"],"language":"en","source_country":"US","sentiment":-0.192},{"id":347335972,"title":"Is Kamala Harris Running for President in 2028? Why She Likely Won’t","text":"Former Vice President Kamala Harris is back in the public eye nearly one year after she accepted the Democratic Party’s nomination for president. At the time, former President Joe Biden retracted his candidacy, effectively kickstarting her 107-day campaign against Donald Trump. Now, Harris is promoting her new book, 107 Days, and she appeared on The Late Show with Stephen Colbert to discuss why she won’t run for governor of California. But could Harris run for president in 2028?\n\nBelow, we’re breaking down everything Harris said and what it means for her political future.\n\nWhy Isn’t Kamala Harris Running for California Governor?\n\nHarris confirmed in a public statement that she will not pursue a gubernatorial run for California. In her July 30, 2025, statement, the former VP wrote that she gave “serious thought to asking the people of California for the privilege to serve as their governor,” calling the state her home and adding that she loves the people.\n\n“But after deep reflection, I’ve decided that I will not run for governor in this election,” Harris wrote.\n\nView this post on Instagram\n\nWhile noting that she has “extraordinary admiration and respect for those who dedicate their lives to public service,” the Democrat added that we, as a nation, “must recognize that our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis.”\n\n“As we look ahead, we must be willing to pursue change through new methods and fresh thinking — committed to our same values and principles, but not bound by the same playbook,” Harris wrote, concluding, “For now, my leadership — and public service — will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.”\n\nWill Kamala Harris Run for President in 2028?\n\nIt looks like Harris will not run for president in 2028. Based on her public statement, she is adamant that her public service “will not be in elected office.” She doubled down on this during a July 31, 2025, appearance on Stephen Colbert‘s show.\n\n“Recently, I made the decision that, for now, I don’t want to go back into the system,” Harris said, adding that the system is “broken” today.\n\n“I always believed that as fragile as our democracy is, our systems would be strong enough to defend our most fundamental principles,” she continued. “And I think, right now, that they’re not as strong as they need to be. And I just don’t want to, for now — I don’t want to go back in the system. … I want to travel the country, I want to listen to people, I want to talk with people, and I don’t want it to be transactional, where I’m asking for their vote.”\n\nColbert then pressed her by saying it sounded as if she bowed out of politics, to which she responded, “Oh, absolutely not. I’m always going to be part of the fight.”\n\nWhen Does Kamala Harris’ 107 Days Book Come Out?\n\n107 Days will be released on September 23, 2025. The book is a glimpse into Harris’ weeks-long campaign in her 2024 race to the White House after Biden stepped down from re-election.","summary":"The former vice president sat down with Stephen Colbert about the possibility of running for public office in the future. Though she ruled out a gubernatorial run in California, how does she feel about the 2028 presidential election?","url":"https://hollywoodlife.com/feature/is-kamala-harris-running-for-president-2028-5432238/","image":"https://hollywoodlife.com/wp-content/uploads/2025/08/3098261_0075_acdcd6-e1754059212552.jpeg","video":null,"publish_date":"2025-08-01 15:58:32","author":"Elisabeth McGowan","authors":["Elisabeth McGowan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.217},{"id":347317712,"title":"JD Vance's Odds of Beating Gavin Newsom, AOC and Pete Buttigieg in 2028","text":"Vice President JD Vance is among the leading candidates to win the 2028 presidential race and could face off against Democrats like California Governor Gavin Newsom or Representative Alexandria Ocasio-Cortez, according to betting markets.Newsweek reached out to their teams for comment via email.Why It MattersThe 2028 presidential race is years away, but candidates are already making moves like traveling to early-voting South Carolina to build support among primary voters or fundraising for potential campaigns ahead of what is likely to be a competitive race.Betting markets like Polymarket accurately predicted President Donald Trump as the winner of the 2024 election over former Vice President Kamala Harris last November.Betting Odds for 2028 Election: What to KnowPolymarket kicked off its betting odds in July for the 2028 presidential race, and traders have already bet nearly $4 million on various candidates.Currently, Vance, who serves as Trump's second-in-command, is the leading candidate in the betting odds with a 28 percent chance of winning the election.Three leading Democrats follow. Newsom has a 15 percent chance of winning, Ocasio-Cortez has a nine percent chance and former Transportation Secretary Pete Buttigieg has an eight percent chance of becoming the next president.Secretary of State Marco Rubio, a Republican, follows at seven percent while Kentucky Governor Andy Beshear, a Democrat, is next at a five percent chance of winning.Kamala Harris Betting Odds Stall After AnnouncementHarris' chances of winning the presidential race stalled following her announcement that she is not running for governor in California, which fueled speculation that she will run for president.Prior to that announcement, she had about a 2.3 percent chance of winning the presidency, and her announcement caused her chances of winning to rise to 3.7 percent on Wednesday. By Friday morning, however, her chances had dropped back down to 3.3 percent.That's roughly on par with Michigan Governor Gretchen Whitmer and Pennsylvania Governor Josh Shapiro, both Democrats, as well as Trump, who is Constitutionally ineligible to run for a third term, and Elon Musk, who cannot run for president because he was not born in the United States.Her odds also slightly increased in the U.K. based bookmaker William Hill's market to 3.8 percent from 2 percent.Primary Election Odds in Kalshi Betting MarketRival betting market Kalshi also offered odds for the Democratic and Republican presidential primaries in 2028.On the Democratic side, Newsom is the frontrunner with 20 percent, followed by Ocasio-Cortez, a favorite among progressives, at 15 percent and Buttigieg at 10 percent. Maryland Governor Wes Moore follows at six percent. Harris, Shapiro, Beshear and Georgia Senator Jon Ossoff each have a five percent chance.Traders view Vance as more of a favorite on the Republican side with a 54 percent chance. Rubio has a nine percent chance, and Trump has a six percent chance of winning the primary. Virginia Governor Glenn Youngkin and Director of National Intelligence Tulsi Gabbard each have a five percent chance of winning.Presidential Race 2028: What Polls Say About Primaries, General ElectionWhile Harris' odds remain low, she does remain a polling frontrunner to win the party's nomination if she ends up running.A McLaughlin poll released in early July showed that Harris had support from 25 percent of respondents. Newsom and Representative Alexandria Ocasio-Cortez, who has not indicated she plans to run, each received 9 percent support, while Buttigieg received 8 percent. That poll surveyed 1,000 general election voters from July 9 to July 14.However, the latest AtlasIntel poll showed Buttigieg leading with 27 percent support. Ocasio-Cortez followed with 19 percent, while 16 percent backed Newsom. In that poll, only 14 percent of respondents picked Harris. It surveyed 1,935 adults from July 13 to July 18 and had a margin of error of plus or minus 2 percentage points.Across the aisle, Republicans seem to be rallying early behind Vance. The McLaughlin showed Vance with 31 percent, followed by Donald Trump Jr. at 19 percent, Florida Governor Ron DeSantis at eight percent and Rubio at four percent.The AtlasIntel survey found Vance at 58 percent, DeSantis at 13 percent, Rubio at 10 percent and Trump Jr. at five percent.An Emerson College poll, conducted among 1,400 registered voters from July 21 to July 22, 2025, showed Vance with an early lead over leading Democratic candidates.He led Buttigieg by one point (44 percent to 43 percent), Newsom by three points (45 percent to 42 percent) and Ocasio-Cortez by three points (44 percent to 41 percent), according to the poll, which had a margin of error of plus or minus 2.5 percentage points.What People Are SayingWilliam Hill spokesperson Lee Phelps previously told Newsweek: \"With Kamala Harris effectively ruling herself out of the running to become the next Governor of California, we think she could have her eyes on the 2028 presidential election.\"The organization Republicans against Trump wrote on a July 30 post to X: \"Newsom tops Polymarket's 2028 Dem odds at 21%, with AOC at 16%. Honestly, popular governors like Beshear or Shapiro would be stronger picks to win over moderates and Never Trumpers.\"Donald Trump Jr. wrote to X on July 22: \"LOL Trump has equal odds as Kamala for 2028. It's just as likely there will be a constitutional amendment to add a third term for Trump as it is for Kamala to win a national election after being her party's nominee. Hilarious!\"What Happens NextTypically, candidates don't make their presidential announcements until after the midterms, which are set to be held on November 3, 2026. Candidates are likely to spend the coming years laying the groundwork for their future runs.","summary":"Vice President JD Vance is the leading Republican ahead of the 2028 election, according to betting markets.","url":"https://www.newsweek.com/jd-vance-betting-odds-gavin-newsom-aoc-2107615","image":"https://d.newsweek.com/en/full/2694960/jd-vance-betting-odds.jpg?w=1600&h=900&q=88&f=2ddbf10e4773be674793dd04d8be929f","video":null,"publish_date":"2025-08-01 15:50:10","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"us","sentiment":-0.071},{"id":347347024,"title":"Kamala Harris steps back into the spotlight to sound off on the state of politics","text":"to top close Video This video is playing in picture-in-picture.\n\nAmericas Newsroom August 01, 2025 08:30 \n\n Kamala Harris steps back into the spotlight to sound off on the state of politics \n Fox News senior national correspondent Rich Edson has the details on Kamala Harris' new book. 'Fox News Sunday' anchor Shannon Bream discusses Democratic Party leadership on 'America's Newsroom.'\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRAMERICA'S NEWSROOMPERSONALITIESV-VIDEOPOLITICSKAMALA HARRISELECTIONSDEMOCRAT ELECTIONS","summary":"Fox News senior national correspondent Rich Edson has the details on Kamala Harris&apos; new book. &apos;Fox News Sunday&apos; anchor Shannon Bream discusses Democratic Party leadership on &apos;America&apos;s Newsroom.&apos;","url":"https://www.foxnews.com/video/6376446787112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ab374a82-9e8a-4348-9e4d-61615f55b36a/7f9e71b1-43d1-4bd2-bbdc-3413b734a833/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-01 15:49:26","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.195},{"id":347331202,"title":"Democrats fret return of Joe Biden, Kamala Harris to spotlight as party tries to 'turn the page': Report","text":"Democrats are lamenting the return of former President Joe Biden and former Vice President Kamala Harris to the center stage as a hindrance to the party’s ability to \"turn the page on 2024,\" according to a new report. \"Democrats are eager to turn the page on their 2024 losses — but their central figures from the last election keep stepping back into the spotlight, complicating their efforts to forge a new identity,\" Hannah Knowles and Maeve Reston wrote in a Friday Washington Post piece. The report highlighted how Biden called out the Trump administration for \"doing its best to dismantle the Constitution\" on Thursday at the National Bar Association's 100th annual gala in Chicago. It noted that Harris was also still in the limelight promoting a new book, \"107 Days,\" about her failed 2024 presidential campaign. POLITICAL ANALYST SAYS DEMOCRATS ARE ALREADY WORRIED ABOUT THE 'BIG PROBLEM' OF WINNING BACK VOTERS FOR 2028 Additionally, the story highlighted Hunter Biden’s appearance on the podcast scene, saying that the former president’s son is \"settling scores on podcasts, lashing out at political consultants, influencers and actor George Clooney for criticizing his father — to the dismay of Democrats who believe the younger Biden’s legal troubles hurt them in 2024.\" \"Many in the party are wary of elevating the people who led them to defeat in 2024 and exasperated to see the drama of that election repeatedly relitigated when they want to keep the focus on pushing back against Trump’s second-term agenda and identifying new leaders,\" Knowles and Reston wrote. Matt Bennett, co-founder of the centrist Democratic group Third Way, told the Post that Democrats need to do better with their credibility, and referenced the divided ranks on the Left that muddled the 2024 presidential election, with many insisting Joe Biden was capable of running again. \"If you say anything other than the guy was not up to the task of running again, and our party made a mistake in not making that clear… voters are going to think you’re lying,\" Bennett said. He added that \"no one needs to hear from Hunter Biden. Literally no one.\" 21 DEMOCRATS WHO MAY TRY TO SUCCEED TRUMP IN THE 2028 PRESIDENTIAL ELECTION Instead, the piece suggested new Democratic leaders, like Kentucky Gov. Andy Beshear, Illinois Gov. J.B. Pritzker, and Arizona Sen. Ruben Gallego could be the party's focus. Cooper Teboe, a Silicon Valley-based Democratic strategist, said Democrats need fresh blood. \"I think most Americans are grateful for the service and contributions of the last generation of officeholders,\" he said. \"But the core reason the Democratic Party is in the position it is in today is because no new figures, no new ideas, have been allowed to rise up and take hold.\" DNC chairman Ken Martin said in an interview Wednesday, highlighted by the Post, that it’s time to move on. \"Do I have a time machine? No. So what good does it serve me or anyone of answering the question, should Joe Biden have stepped down? Can’t change it,\" Martin said. \"I’m not trying to protect anyone. I’m trying to save us spending a lot of time and energy on a question that really doesn’t help me win elections.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The defining factor, however, of how the Democrats move on, Democratic strategist Steve Schale said, will be the person who takes up the mantle of the party. CLICK HERE TO GET THE FOX NEWS APP \"I don’t think there’s a lot we can do to turn the page until we have a fight over who gets to turn the page,\" Schale said. \"And that will be the 2028 primary fight.\"","summary":"Former President Biden&apos;s recent criticism of President Trump and former Vice President Kamala Harris promoting a new book reportedly complicate Democratic efforts to move on from 2024.","url":"https://www.foxnews.com/media/democrats-fret-return-joe-biden-kamala-harris-spotlight-party-tries-turn-page-report","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/05/biden-harris.jpg","video":"https://www.foxnews.com/video/6376141232112","publish_date":"2025-08-01 15:34:49","author":"Rachel Del Guidice","authors":["Rachel Del Guidice"],"language":"en","category":"politics","source_country":"us","sentiment":-0.267},{"id":347335572,"title":"Kamala Harris Calls Out ‘Completely Naive’ People Caving to Trump as a Means of ‘Riding Out the Storm’ | Video","text":"Former Vice President Kamala Harris predicted a lot about Donald Trump’s second presidential term, but she admitted on Thursday night that one thing she didn’t see coming was the amount of organizations and people caving to him. She also noted that it’s “completely naive” to think that caving even temporarily will work out in the end.\n\nHarris stopped by “The Late Show” for her first interview since the 2024 election this week, staying for nearly half the program as host Stephen Colbert asked her questions. At one point, the CBS host joked, “I know you’re not here to say I told you so, but would you like to?”\n\n“Let me just say this. You are correct that I did predict a lot of it. But Stephen, what I did not predict was the capitulation,” Harris replied. “I didn’t predict that. I didn’t see that. I didn’t see that coming.”\n\n“And perhaps it’s naive of me, someone who has seen a lot that most people haven’t seen, but I believed that on some level, you know, there are many — there should be many who consider themselves to be guardians of our system, and our democracy, who just capitulated. And I didn’t see that coming.”\n\nAt that, Colbert noted that Harris still has plenty of connections in Washington and questioned if there are people who have caved to Trump purely because they “think that they can just ride out the storm and everything will be fine on the other side.”\n\n“I think there are some who do,” Harris confirmed. “And I think that it is completely naive. I think there are a lot of people who think they’re riding out the storm as an excuse to be feckless.”\n\nYou can watch Stephen Colbert’s full interview with Kamala Harris in the video above.","summary":"\"I didn't see that coming,\" the former vice president tells Stephen Colbert\n\n\nThe post Kamala Harris Calls Out &#8216;Completely Naive&#8217; People Caving to Trump as a Means of &#8216;Riding Out the Storm&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/kamala-harris-colbert-interview-completely-naive-caving-to-trump/","image":"https://www.thewrap.com/wp-content/uploads/2025/08/kamala-harris-colbert.jpg","video":null,"publish_date":"2025-08-01 15:25:13","author":"Andi Ortiz","authors":["Andi Ortiz"],"language":"en","source_country":"US","sentiment":-0.325},{"id":347307882,"title":"Kamala Harris tells Stephen Colbert that U.S. democracy is ‘broken’","text":"Harris warned against trying to ‘ride out’ Trump’s presidency\n\nWhen Colbert asked if Harris believed people think they can “just ride out” Trump’s presidency, Harris said it is “completely naive” to think that way. “There are a lot of people who think they’re riding out the storm as an excuse to be feckless,” she added. Moments earlier, Harris had said that those who should “consider themselves to be guardians of our system and our democracy” had capitulated to Trump.\n\n“Look, we designed our democracy with three independent, coequal branches of government,” Harris continued, before denouncing Congress for not doing enough to challenge Trump’s aim to dismantle the Department of Education.\n\n“I mean, when you see that the president of the United States is trying to get rid of the Department of Education, and Congress has the role and responsibility to stand in the way of that, and they’re just sitting on their hands, and then they go to recess,” she said.","summary":"Former vice president Kamala Harris expressed deep concern about U.S. democracy, describing it as a broken system on CBS&#8217;s &#8220;The Late Show With Stephen Colbert&#8221; on Thursday evening, in her first interview since the 2024 presidential election. She denounced Congress for &#8220;sitting on their hands&#8221; and for failing to &#8220;stand in the way&#8221; of some [&#8230;]","url":"https://torontosun.com/news/world/kamala-harris-tells-stephen-colbert-that-u-s-democracy-is-broken","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/08/election-2026-governor-harris_297939213-e1754060389468.jpg?quality=100&strip=all","video":null,"publish_date":"2025-08-01 15:00:37","author":"Washington Post","authors":["Washington Post"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.402},{"id":347298852,"title":"Kamala Harris can’t answer simple Colbert question: Who is the leader of the Democrats? ","text":"New York Post\n\n See All Videos \n\n Recommended \n\n Nancy Pelosi gets defensive over insider trading claim: ‘Why do you have to read that?’ \n\n Dems blame Trump, not rioters | Reporter Replay \n\n Why Sydney Sweeney’s American Eagle ad is being slammed as ‘Nazi propaganda’ by crazed woke mob \n\n Widow of Hamas chief smuggled out of Gaza with large sum of cash – and is already remarried \n\n FBI leaving DC HQ, transferring 1,500 employees | Reporter Replay \n\n Doctor explains what to know about NPH, Billy Joel’s brain disorder \n\n Major ‘No Kings Day’ protest brewing | Reporter Replay \n\n Yes, Biden’s autopen use needs to be probed | Reporter Replay \n\n What is habeas corpus? And can it be suspended? \n\n WATCH: Brooklyn rental goes from drab to fab in less than a day! \n\n America Party? Stick to rockets, Elon | Red Hot Takes \n\n A battle for equality or unfair advantage? The transgender athlete controversy explained \n\n Netanyahu bets legacy on Iran strikes | Reporter Replay \n\n Was Lyme disease manufactured in a lab as a bioweapon? Joe Rogan thinks so \n\n Why did Israel bomb Syria? Everything you need to know about the volatile conflict \n\nKamala Harris can’t answer simple Colbert question: Who is the leader of the Democrats? \n\nAugust 1, 2025 | 10:49am\n\nFormer Vice President Kamala Harris was unable to say who the current leader of the Democratic Party was in an interview with Stephen Colbert on “The Late Show,” and balked at the simple question by refusing to name a single Democrat. “There are lots of leaders,” she said.\n\nColbert, who wasn’t satisfied with the answer, pressed her, asserting there’s “generally a leader” of the party and asking again if any names came to mind. Harris wouldn’t budge.\n\n“I think there are a lot — I’m not going to go through names because then I’m going to leave somebody out and then I’m going to hear about it,” she said.\n\n Share thison","summary":"Former Vice President Kamala Harris was unable to say who the current leader of the Democratic Party was in an interview with Stephen Colbert on “The Late Show,” and balked at the simple question by refusing to name a single Democrat. “There are lots of leaders,” she said. Colbert, who wasn’t satisfied with the answer,...","url":"https://nypost.com/video/kamala-harris-cant-answer-simple-colbert-question-who-is-the-leader-of-the-democrats/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/WP-thumb-NEW_7383f2.png?w=1024","video":null,"publish_date":"2025-08-01 14:49:30","author":"New York Post Video","authors":["New York Post Video"],"language":"en","category":"politics","source_country":"us","sentiment":-0.273}]}