{"offset":0,"number":50,"available":259,"news":[{"id":352208468,"title":"Jimmy Kimmel says voting for Stephen Colbert at the Emmys is the 'least we could do at this point'","text":"Jimmy Kimmel is advocating for his friend and fellow late-night host Stephen Colbert to finally nab the hard-fought-for Outstanding Talk Series win at the Emmys this year.\n\n In a conversation with Variety shortly after CBS' parent company, Paramount, announced that The Late Show will end in May amid its Trump administration-sanctioned $8 billion merger with Skydance, Kimmel explained to the outlet why he chose to use his show's FYC billboard to declare his intention to vote for Colbert.\n\n \"Well, it seems like voting for Stephen is the least we could do at this point, and I think it will be a nice statement if he does win,\" Kimmel said. \"Obviously, awards don't mean much, but every once in a while they do, and in this case, I think it will. So I fully expect Stephen to win the Emmy as I think people are very, very upset about what happened to him and his show.\"\n\n Colbert's show has been nominated nine years in a row but has never won in the category.\n\n When asked why people should vote for Colbert's show, Kimmel complimented the late-night host for being a \"very ethical person.\"\n\n He continued, \"He is the salt of the earth. He is a humble person and an extremely smart person. I hope that whatever he does next is even more powerful than what he'd been doing. And I think that's very possible.\"\n\n The announcement of The Late Show's cancellation, which will end the franchise after it has aired for 33 years, provoked backlash from famous faces and fans alike.\n\n Sen. Elizabeth Warren — who has been candid about her disapproval over Paramount settling the lawsuit brought by Trump over a 2024 60 Minutes interview with his contender in that year's presidential election, Kamala Harris — is among the move's most vocal detractors.\n\n \"CBS canceled Colbert's show just THREE DAYS after Colbert called out CBS parent company Paramount for its $16M settlement with Trump — a deal that looks like bribery,\" the Massachusetts senator wrote on X on Thursday. \"America deserves to know if his show was canceled for political reasons. Watch and share his message.\"\n\n Kimmel expressed skepticism to Variety that Paramount's decision was financial, even with reports that Colbert's show was losing $40 million a year.\n\n \"The idea...is beyond nonsensical. These alleged insiders who supposedly analyze the budgets of the shows — I don't know who they are, but I do know they don't know what they're talking about,\" Kimmel asserted. \"They seem to only be focused on advertising revenue and have completely forgotten about affiliate fees, which number in the hundreds of millions — probably in total billions — and you must allocate a certain percentage of those fees to late-night shows.\"\n\n Kimmel countered that it is \"surprising how little the media seems to know about how the media works.\"\n\n \"There's just not a snowball's chance in hell that that's anywhere near accurate. Even that — that's all you need to know. Suddenly, he's losing $40 million a year? I will tell you, the first 10 years I did the show, they claimed we weren't making any money — and we had five times as many viewers on ABC as we do now,\" Kimmel said of his late-night show. \"Who knows what's true? All I know is they keep paying us —and that's kind of all you need to know.\"\n\n Many critics have questioned the timing of the announcement, pointing out that Colbert had recently criticized CBS' corporate parent, Paramount Global, for agreeing to pay $16 million to President Donald Trump over an interview with former Vice President Kamala Harris that aired on 60 Minutes in November. Trump has long disliked late-night hosts' jokes about his administration and celebrated news of The Late Show's cancellation on social media, writing that Colbert's \"talent was even less than his ratings.\"\n\n He then praised Fox News late-night comedian Greg Gutfeld, who Trump wrote \"is better than all of them combined, including the moron on NBC who ruined the once great Tonight Show,\" referring to Jimmy Fallon.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n For his part, Colbert has not backed down, continuing to openly criticize Trump and his administration throughout the president's second term. Reacting to Trump's post about his cancellation, Colbert said, \"How dare you, sir. Would an untalented man be able to compose the following satirical witticism: Go f--- yourself.\"","summary":"\"I think it will be a nice statement if he does win,\" Kimmel adds.","url":"https://ew.com/jimmy-kimmel-voting-for-stephen-colbert-at-the-emmys-11793086","image":"https://ew.com/thmb/zPDQknzRQ2D29r7T75tVL0zSdaY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/jimmy-kimmel-stephen-colbert-071825-63ee76c3fe0d43088e532850bee28df4.jpg","video":null,"publish_date":"2025-08-18 20:50:36","author":"Mekishana Pierre","authors":["Mekishana Pierre"],"language":"en","source_country":"US","sentiment":-0.1},{"id":352194538,"title":"CBS News plans major 'tweak' to its ailing nightly news show after two-anchor format sent ratings into freefall","text":"CBS Evening News is set to experiment with yet another format change after adding another anchor to the mix back in January - a strategy widely panned as a 'disaster' at the time.\n\nThe new strategy, insiders told Variety, will see one of the anchors more frequently thrust into the field to report on major, breaking events.\n\nThe other will stay on-set to oversee the broadcast solo, as Norah O'Donnell, Katie Couric, Dan Rather, and Walter Cronkite did previously.\n\nIt could be seen last week when John Dickerson was on the ground in Alaska to report on Donald Trump's summit with Vladimir Putin. As he delivered breaking news, Maurice DuBois stayed behind in Manhattan.\n\nMaking use of both cohosts in such a way appears to thrust the idea of having two anchors side-by-side to the wayside.\n\nThe show has lost more than 1.2million viewers since it strayed from the format.\n\nPeople familiar with CBS's news division further told Variety how staffers there are scared of rumored layoffs.\n\nExecutives from Skydance signaled earlier this month they intended to continue with Paramount's plans to cut $2 billion in costs from the company.\n\nStreaming continues to take away from revenue brought by traditional advertising and distribution.\n\nCBS News, however, has found itself in a tougher spot - last-place of the legacy news stations in both primetime and mornings.\n\nMost notably, the gap is growing on the evening front.\n\nO’Donnell, less than a year ago, had reeled in an average of roughly 5million total viewers, as well as 721,000 viewers aged 25 to 54 for her broadcast.\n\nThose numbers were down to 3.744 million total viewers and 516,000 viewers in the advertiser-coveted demographic as of August 4, seemingly in response to the dual-anchor experiment.\n\nAside from doing away with a single host after decades, the strategy saw staffers take a more magazine-style, 60 Minutes-esque approach to the evening's news.\n\nThe vision - masterminded by now-ex-60 Minutes boss Bill Owens and then-CBS News and Stations CEO Wendy McMahon - was promptly rejected by viewers within a matter of weeks, according to Nielsen data.\n\nThe show debuted with the Dickerson-Dubois pairing on January 27 to 5.2 million total viewers, the data showed.\n\nBy its third week, the show was receiving just under 4.5 million total viewers, the data showed. \n\nA former CBS News exec told Daily Mail at the time, 'It's a disaster,' referring to the two anchors and their feature, long-form style \n\n'It's been critically panned, ratings down week by week and from this time last year,' they said, under condition of anonymity.\n\n'[Executive Producer] Bill Owens is also overstretched and feeling the pressure with this lawsuit from [Trump].'\n\nThe suit, centered around a 60 Minutes interview with Kamala Harris that aired in October, was settled just last month, after Owens and McMahon has both left the company.\n\nBoth had been vocal about their opposition to a settlement, after Trump claimed the sit-down was 'deceptively edited.'\n\nThe suit was seen by many as a sticking point in the merger between Paramount and Skydance, which was approved by the FCC - after more than a year in limbo - last month as well.\n\nLast week, Paramount Studios new CEO, 42-year-old scion David Ellsion, previewed his plans for the new company, which he said will include CBS News.\n\n'We’re an entertainment company first, and I genuinely believe if you’re breathing, you’re our audience,' the son of MAGA billionaire Larry Ellison explained.\n\n'I don’t want to politicize this company.'\n\n'We want to be in the business of speaking to everybody,' he continued, after months of being accused of bribery and playing a part in Paramount's decision to cancel the show of prominent Trump critic Stephen Colbert.\n\n'One of our biggest priorities is actually restoring Paramount as the No. 1 destination for the most talented artists and filmmakers in the world. \n\n'Very simply, great filmmakers make great movies.'\n\nHe also talked up CBS’ relationship with the NFL, Masters golf tournament and the NCAA's March Madness. \n\nHis COO Andy Gordon added, 'I actually think every asset is underappreciated here.' \n\nEllison also mentioned how the Tiffany Network ended the regular television season in first place in primetime among broadcast networks for the 17th straight year.\n\n'Legacy media kind of swam out to the middle of the lake, but wasn’t exactly sure how to get to the other side,' he said of plans to embrace technology to make his vision possible.\n\nJeff Shell, the new president of what's being called Paramount Skydance, said any cuts and reductions needed to make that vision a reality will be disclosed by the company’s next quarterly report to investors in November. \n\nDaily Mail has contacted CBS News and Paramount for comment.","summary":"CBS Evening News is set to experiment with yet another format change after adding another anchor to the mix back in January - a strategy panned as a 'disaster'.","url":"https://www.dailymail.co.uk/media/article-15010579/cbs-news-evening-format-change-layoffs-two-anchors.html","image":"https://i.dailymail.co.uk/1s/2025/08/18/14/101320031-0-image-a-12_1755523125496.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/18/2164728972737363531/1024x576_MP4_2164728972737363531.mp4","publish_date":"2025-08-18 18:45:05","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.183},{"id":352182958,"title":"Elon Musk Is Going To Drive Journalists Off X By Throttling External Links | Bobby Burack","text":"OutKick touted Elon Musk's purchase of X, then known as Twitter, in 2022 as a win for free speech. And that it remains. Under its previous leadership, Twitter engaged in politically motivated censorship, a fact revealed by leaked internal documents known as the Twitter Files. Most notably, Twitter suppressed content at the request of the Biden administration — an action many legal scholars argue violated the First Amendment. The company also marked and shadow-banned prominent conservative accounts to blunt their influence. By contrast, under Musk, X became a critical counterweight to mainstream media narratives heading into the 2024 presidential election. Imagine if voters only knew the Kamala Harris portrayed on NBC or in The New York Times. For that reason, X is unquestionably better off under Musk than it was before. Free speech must remain a non-negotiable right across all platforms. That said, X has regressed in other ways. On Saturday, New York Post columnist Miranda Devine questioned Musk's decision to throttle posts containing external links: \"Forever grateful for the Twitter Files. But your throttling of posts with external links is infuriating and ultimately self-defeating. So is the shadow banning that is back with a vengeance,\" she posted on X. The New Problem: Suppression of External Links For background, Elon Musk implemented an algorithm change to suppress the visibility of external links. Specifically, a post including a link to an article or podcast now reaches far fewer users than one without it. Economic analyst Jesse Colombo estimates that including a link can decrease the reach of a post by as much as 94%. To do so, X introduced the highly-panned, default \"For you\" tab, which curates posts it wants you to see. By burying external links, users are more likely to keep scrolling – to the benefit of X's advertising partners. For years, Twitter served as a gateway to the broader media world. For all its faults, there was no better way to connect users to your content than through Twitter. Speaking in the first person, nearly every television, radio, or digital show I have appeared on is the result of a host or producer seeing my work on Twitter. I would never have met Clay Travis had he not seen my written work on Twitter. I'm sure many, many other writers and podcast hosts can relate. Today, even with nearly 1 million followers, columnists like Devine find promoting articles on X maddeningly ineffective. Over the weekend, I posted a video of ESPN host Monica McNutt appearing unfamiliar with NFL Hall of Famer Barry Sanders. That video has 1,000 reposts and more than 585,000 views. An hour later, I shared my column on the same subject. It sits at 150,000 views. The discrepancy is staggering – and, as Devine put it, self-defeating. We can point to several other examples over the past year in which posts without an external link performed far better than posts with links to OutKick.com or the OutKick YouTube channel. Note: X is no longer an operating communication department to contact for comment. Musk’s Short-Sighted Tradeoff To be clear, Elon Musk owes the media nothing. But his approach risks making X irrelevant to the very people who once gave it cultural weight. There used to be a saying within media circles, \"I would leave Twitter tomorrow if I didn't need it.\" While hyperbolic, X is approaching a point to which most journalists no longer need it. The upside of promoting content on it is so minimal. Musk might argue that journalists and podcasters should host their work directly on X. But the financial upside is negligible compared to running a website or podcast feed. As a \"scroll\" app, users expect to either click a link or consume a post in under 20 seconds. Put simply, industry insiders doubt X will ever serve as a true hosting platform for writers and podcasters. When Trolls Win, Thinkers Leave For X to remain the \"town square\" Musk wants it to be, it will need the top writers, podcasters, and thinkers to continue participating. Yet Musk is giving them little incentive to stay. Instead, the algorithm rewards the most shallow, low-value content. The \"For you\" tab elevates posts with high comment counts and native media, fueling the spread of AI-generated images, disinformation, and ragebait. There’s a reason so many X \"influencers\" aren’t particularly insightful: the algorithm doesn’t reward intelligence. It rewards provocation. At this rate, X risks devolving into a chaotic feed of deepfakes, fake news, and ditzy influencers by the start of the 2028 presidential election. Free speech notwithstanding, Elon Musk is daring quality journalists to stop promoting their work on X. Eventually, they just might.","summary":"Elon Musk&apos;s X platform improved free speech but now faces criticism for throttling external links, potentially making the platform less relevant to journalists and content creators.","url":"https://www.outkick.com/analysis/elon-x-throttling-miranda-devine","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/08/gettyimages-2218827914.jpg","video":null,"publish_date":"2025-08-18 17:50:05","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","source_country":"us","sentiment":-0.034},{"id":352165770,"title":"Sherrod Brown's Chances of Flipping GOP Seat in Ohio as He Enters Race","text":"Former Democratic Senator Sherrod Brown launched a comeback campaign on Monday as polls suggest Republican Ohio Senator Jon Husted has an early lead.Tyson Shepard, Husted's communications director, wrote in a statement that Husted offers \"Ohio's values and solutions to fix a broken Washington.\"Newsweek reached out to Brown's campaign for comment via email.Why It MattersBrown lost last year's Senate race to Republican Bernie Moreno, but Democrats are hopeful a more favorable national environment could make the race competitive. Historically, the party in the White House loses seats in the midterms, but Ohio has become increasingly conservative over the past decade and backed President Donald Trump by double digits last November.Democrats will need to win double-digit Trump seats to win control of the Senate, where Republicans hold a 53-47 majority. Democrats view Maine, which voted for Vice President Kamala Harris by about 7 points, and North Carolina, which voted for Trump by about 3 points, as flip opportunities. But no other GOP-held seats in Harris-won or single-digit Trump states are up for grabs, meaning Democrats have to target more conservative states like Alaska, Iowa, Ohio and Texas.What To KnowBrown, who served in the Senate from 2007 to 2025, made official his run on Monday, saying in a video released by his campaign that he didn't plan to run for office again after his defeat last November.\"But when I see what's going on, I know I can do something about it for Ohio,\" he said.The latest poll from Bowling Green State University showed Husted with a narrow lead over Brown but still pointed to a competitive race. It found that 49 percent of respondents preferred Husted, while 46 percent said they would vote for Brown in 2026. Five percent leaned toward other candidates.It surveyed 800 registered voters from April 18-24 and had a margin of error of plus or minus 4.08 percentage points.It found that 43 percent of respondents viewed Brown favorably, while 41 percent viewed him unfavorably. Meanwhile, 25 percent viewed Husted favorably and 28 percent viewed him unfavorably, the poll found.The poll from February found Husted with a larger lead—47 percent to 41 percent, with 12 percent undecided. It surveyed 800 registered voters from February 14-21 and had a margin of error of plus or minus 4 percentage points.No other polls of the race have been made public.Early betting odds also favor Husted. Kalshi's market for the Ohio Senate race gave Republicans a 74 percent chance of victory and Democrats only a 26 percent chance.Brown lost by about 3.6 points to Moreno last November, while Trump won by about 11.2 points over Harris in the state.What People Are SayingTyson Shepard, Husted's communications director, in a statement: \"Sherrod Brown's recent announcement means Ohioans will face a clear choice in 2026. For 30 years, he has imposed Washington's problems on Ohio, pushing radical liberal policies that have left a lasting burden on the next generation. Jon Husted offers the opposite approach, applying Ohio's values and solutions to fix a broken Washington. The challenges our nation faces are the same ones Husted has helped our state confront and overcome, championing the values he learned growing up in northwest Ohio: hard work, personal responsibility, family, faith, freedom and patriotism.\"Former Senator Sherrod Brown, on X: \"Every day, I hear from Ohioans who know the system's rigged. Washington's raising prices and cutting health care to benefit wealthy donors and corporate special interest while workers foot the bill. I can't just stay on the sidelines if I can do something about it for Ohio.\"What Happens NextThe general election is set for November 3, 2026. The Cook Political Report shifted the race to Lean Republican from Likely Republican following Brown's announcement. Sabato's Crystal Ball also classifies the race as Leans Republican.","summary":"Sherrod Brown made official his comeback campaign for U.S. Senate on Monday.","url":"https://www.newsweek.com/sherrod-brown-enters-race-polls-2115170","image":"https://d.newsweek.com/en/full/2704697/sherrod-brown-ohio-senate-polls.jpg?w=1600&h=900&q=88&f=b9899cd2ad04761ea74da95726cf6afa","video":null,"publish_date":"2025-08-18 17:20:48","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.031},{"id":352154894,"title":"Texas Republicans’ redistricting maps: How the GOP could increase its stronghold.","text":"Republicans control both chambers of the Texas Legislature, which draws congressional districts. GOP lawmakers in 2021 gave their party an advantage in Congress when they drew the district boundaries. Giving one political party an advantage over the other, or gerrymandering, is something both parties do in states across the country.\n\nUnder this year’s proposed plan, Democratic districts in the Dallas and Houston areas were drawn to increase, or “pack”, the number of Democratic voters in districts the minority party already controls. Packing those districts leaves fewer Democratic voters and more Republican voters in neighboring districts. Consolidating more Democrats into nearby districts could turn seats represented by Democratic U.S. Reps. Julie Johnson in North Texas’ 32nd District and Al Green in the Houston area’s 9th District into Republican districts.\n\nIn Hays County, 52.1% of voters chose Democrat Kamala Harris in 2024. Under the new proposal, that county south of Austin is split into two Republican districts, the 21st District and 27th District. Decreasing a party's voting strength is called “cracking.”","summary":"The proposed congressional districts are fueling a redistricting battle at the Texas Capitol and could have national consequences. A bipartisan war is already brewing across the U.S.","url":"https://www.texastribune.org/2025/08/18/texas-redistricting-maps-charts-analysis/","image":"https://thumbnails.texastribune.org/VrEpj5MrczSQ-tnpzhwQonaWF4w=/450x300/https://static.texastribune.org/media/files/8b2fb5d8c7e14924ab5e343f7b7639a6/lede-art-redistricting-viz.jpg","video":null,"publish_date":"2025-08-18 17:05:52","author":"Carla Astudillo","authors":["Carla Astudillo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.082},{"id":352143032,"title":"Texas Democrats return to state for second session on GOP redistricting","text":"TEXAS HOUSE ADJOURNS FOR SECOND TIME FRIDAY DUE TO DEMOCRATIC ABSENCES\n\nA majority of Texas’s 62 House Democrats fled the state on Aug. 3 and sought refuge in blue states like Illinois, California, and New York. They held press conferences to highlight Texas Republicans’ plans to redraw the congressional map and gain as many as five GOP seats.\n\nBut legal and financial pressure from state and national Republicans led to Democrats announcing on Thursday that they would return to the state. They said they would return on two conditions: when the first session concluded and when California introduced a new congressional map that would offset the Texas map. They’ve painted their walkout as a success by calling attention to the GOP’s “sham” redistricting plan. \n\nDemocrats have argued that Republicans are trying to manipulate the Texas congressional map because they are afraid they will not win in the 2026 midterm elections, in which Democrats only need a net gain of three seats to take back the House.\n\nRepublicans faced a similar dilemma in 2018, and Democrats successfully broke the GOP trifecta during President Donald Trump’s first term. The remaining two years of his presidency were met with pushback from the Democrat-controlled House on Trump’s agenda, resulting in two attempts to impeach him.\n\n“Democrats fought back ferociously and took the fight to Trump across America,” state Rep. Gene Wu of Houston, chairman of the House Democratic Caucus, said in a statement. “We will return to the House floor and to the courthouse with a clear message: the fight to protect voting rights has only just begun.”\n\nBy Friday, most of the Democrats had not returned to the House, and Speaker Dustin Burrows adjourned the chamber for the weekend. Republicans are expecting a quorum on Monday, and Burrows said he aims to have the second session wrapped up by Labor Day.\n\nThe Texas Democrats’ redistricting fight has drawn support from several national leaders, including former President Barack Obama, former Vice President Kamala Harris, and Democratic governors. In California, Gov. Gavin Newsom (D-CA) has called a special election for Nov. 4 that will determine whether the state can circumvent the independent redistricting commission and draw a new map ahead of the midterm elections.\n\nRepublicans have pushed back on this, arguing that Texas law allows the legislature to redraw the map, but states like California must adhere to their redistricting commissions.\n\n“Unlike other states, California must shred its own Constitution to succeed in its desperate gambit to ‘end the Trump presidency.’ Voters in California and across the nation see through this partisan stunt,” House Speaker Mike Johnson (R-LA) said in a statement Monday.\n\n“Democrats across the nation have played politics with redistricting for decades, and this is just the latest example,” Johnson added. “Republicans who are following state and federal laws will not be lectured by people who abused the system.”","summary":"Texas state Democrats are returning to the state capital on Monday for the start of the House&#8217;s special session on redistricting, ending a two-week strike to protest Republicans&#8216; plans to increase the number of GOP congressional seats in the state&#8217;s delegation. The state House is set to reconvene at noon Central time to begin the [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3758190/texas-democrats-return-house-second-session-gop-redistricting/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25228634394573.jpg?w=696","video":null,"publish_date":"2025-08-18 16:31:57","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.571},{"id":352158876,"title":"Nolte: Far-left Columnist Robin Givhan out at Far-left Washington Post","text":"The bloodshed continues at the far-left Washington Post with the news Pulitzer Prize-winning columnist Robin Givhan has accepted a buyout.\n\nThe Trump-era schlonging of the regime media shows no signs of slowing down.\n\n“So, recently The Post offered buyouts to anyone who’d been there for 10 years or longer. It was the first time I’d been eligible for such a thing. So, I considered it. (It was a fair amount of $$),” Givhan announced on her verified Instagram account. “I agonized about it. I fretted. I procrastinated until the last possible moment. I considered my needs, my desires, my beliefs. A creature of deadline to the end. And I decided to take it.”\n\n“I love The Post. It’s where I grew up as a journalist. I am a believer in the importance of institutions, of legacy media, of mainstream media,” she continued.\n\n“There’s still a lot to be said, and I’m just self-centered enough to believe I’m someone who needs to be heard. So I’m not done. Democracy definitely dies in darkness, but it is gravely wounded by silence.”\n\nWhatever. Bye.\n\nOne wonders how democracy will survive without Givhan’s headlines such as…\n\nMarc Jacobs’s anti-politics, from faux nails to creative freedom\nPresident Trump addresses Congress, and nothing about it was normal\nSee inside Kamala Harris’s V.P. house as JD Vance prepares to move in\nWhat does diversity mean in a second Trump administration?\nThanksgiving is our most woke holiday. That’s why it’s so great.\nCory Booker’s unflagging joy\nThe ground-breaking normalcy of Doug Emhoff\nKamala Harris’s powerful laughter in the face of weirdness\nHoping joy cometh in the morning: Auntie Maxine, a hallelujah chorus\nStormy Daniels’s voluble specificity\nDonald Trump’s specific brand of racism resurfaces as he woos Black voters\nWhen Fani Willis took the stand, her fury was precise and laser-focused\nMarjorie Taylor Greene’s big mouth and her big white, fur-rimmed coat\nRepublican Byron Donalds is Black. That’s basically the talking point.\nAdmiring the beauty — and beautiful politics — of the Black family home\nSpeaker Pelosi’s style of power\n\nI went back three years and can sum up her work in one word: ZZZZZZzzzzzzz.\n\nI don’t know what she won her Pulitzer for, but I’ll bet it was stupid.\n\nShe wrote the safest, most anodyne, and treacly nonsense you can write at the Washington Post. Nothing ever colored outside the lines or dared to question the conventional wisdom. She even gushed over the credibly accused girlfriend abuser Doug Emhoff.\n\nGivhan was not in the business of doing anything other than affirming and comforting the rich elites who subscribe to the Post so they can be affirmed and comforted. If she believed she was trolling Trump supporters, my job is to cover the media, and this is the first time I’ve paid any attention to her. So…\n\nJust another member of the leftist Borg…\n\nBut now she’s been schlonged, which means we can add her to the ever-expanding list of the schlonged, and rejoice in knowing we can return to our default position of forgetting someone so stridently forgettable…\n\nRobin Givhan Exits Washington Post.\nGlenn Kessler stops lying at the Washington Post.\nJonathan Capehart– Stomps out of WaPoin tears (I’m guessing).\nPhilip Bump– documented serial liarexits Washington Post.\nCatherine Rampell– Leftist WaPocolumnist accepts buyout.\nTerry Moran– Self-immolated out of ABC due to TDS meltdown.\nRuth Marcus– Washington Postcolumnist resigns.\n538– Disney/ABC’s wildly biased polling site shutters.\nPaul Krugman– Always-wrong New York Timescolumnist forced out.\nJim Acosta– CNN anchor forced out.\nNorah O’Donnell– Failed CBS anchor out.\nChuck Todd– NBC’s former Meet the Presshost DEI’d out.\nAndrea Mitchell– NBC harridan ages out of job.\nChris Wallace– Son of Someone out at CNN.\nJennifer Rubin— Lunatic columnist quits Washington Postin a snit.\nJoy Reid– Racist MSNBC anchor too racist for MSNBC. Fired.\nNeil Cavuto– Fox News anchor scurries away.\nAlex Wagner– Demoted at MSNBC.\nAyman Mohyeldin– Lost MSNBC show.\nOlivia Nuzzi– Out at New York Mag for allegedly stalking RFK Jr.\nKatie Phang– Lost MSNBC show.\nJonathan Capehart – Lost MSNBC show. Steps down from Washington Posteditorial board.\nLester Holt– Out as NBC Nightly News anchor.\nOne-thirdof New York TimesEditorial Board – Say, bye.\nEugene Robinson– Washington Postcolumnist quits in snit.\nRyan Lizza– Scurries to Substack over credible misconduct allegations.\nBill Owens—60 Minuteschief resigns in crybaby disgrace.\n\nThe list above represents the regime media schlongings that have taken place just since Trump took office.\n\nMore to come, I’m sure.\n\nAll decent people hope.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"The bloodshed continues at the far-left Washington Post with the news that Pulitzer Prize-winning columnist Robin Givhan has accepted a buyout.\n\n\nThe post Nolte: Far-left Columnist Robin Givhan out at Far-left Washington Post appeared first on Breitbart.","url":"https://www.breitbart.com/the-media/2025/08/18/nolte-far-left-columnist-robin-givhan-out-at-far-left-washington-post/","image":"https://media.breitbart.com/media/2025/08/Robin-Givhan-exits-640x335.jpg","video":null,"publish_date":"2025-08-18 16:31:54","author":"John Nolte","authors":["John Nolte"],"language":"en","category":"politics","source_country":"US","sentiment":-0.087},{"id":352136434,"title":"Pa. Treasurer Stacy Garrity to run for governor against Josh Shapiro","text":"Pennsylvania Treasurer Stacy Garrity kickstarted her gubernatorial campaign Monday with an attack ad against Gov. Josh Shapiro, the Democratic incumbent who may have presidential aspirations in 2028.\n\nGarrity, a Republican in her second term as treasurer, is a retired U.S. Army Reserve colonel and corporate executive who has vowed to bring affordability and fiscal responsibility to the state. In the Republican primary, she could compete against state Sen. Doug Mastriano, who is weighing another run for governor after he was trounced by Shapiro in 2022. \n\nMORE: Rapper Skrilla arrested for allegedly assaulting police officer while filming music video in Kensington\n\nGarrity has pledged to \"fix the problems\" of the Shapiro administration, singling out the state's overdue budget and rising costs for utilities and groceries. She endorsed President Donald Trump in last year's presidential election and included a photo taken with him at a rally in her new campaign ad. Trump previously had been expected to endorse a gubernatorial campaign run by state Rep. Dan Meuser, who withdrew from consideration in July.\n\nShapiro, who made the short-list of Democratic vice presidential candidates last year, is widely expected to run for governor again next year and leverage his vast fundraising network to defeat a Republican challenger. Shapiro has not said whether he intends to run for president, but he's got a rising national profile in a Democratic party searching for charismatic leaders. \n\nIn last year's race for Pennsylvania treasurer, \n\nLast year, Shapiro declined to make an endorsement in the race for Pennsylvania treasurer after Democratic candidate Erin McLelland criticized him as a potential running mate for Kamala Harris. Garrity benefited by landing endorsements from labor groups that otherwise might have sided with McLelland. \n\nAhead of Garrity's run for governor, some labor groups — including the Philadelphia Building Trades Council — already have made clear their allegiance will be with Shapiro.\n\nGarrity is vying to become the first woman to serve as Pennsylvania governor and first Republican to hold the office since Tom Corbett's lone term concluded in January 2015. Garrity has been a staunch opponent of abortion and an advocate for fiscal conservatism. The Bradford County native and Iraq war veteran increasingly has aligned with Trump administration policies, including last month's federal tax breaks and spending cuts. \n\nRepublicans have a more hopeful outlook in Pennsylvania after Trump took the battleground state in November and state row offices — including treasurer and attorney general — also went to the GOP. Next year's mid-term elections could dampen that momentum in a state where Shapiro has successfully won over moderate and independent voters, twice winning races for attorney general before becoming governor. \n\nGarrity will be the frontrunner in the Republican field ahead of the Pennsylvania GOP's anticipated endorsement in September.","summary":"Pennsylvania Treasurer Stacy Garrity announced Monday she will run for governor next year against Democrat Josh Shapiro, who may be vying for the White House in 2028. Garrity hopes to become the first woman elected governor in Pennsylvania.","url":"https://www.phillyvoice.com/stacy-garrity-pennsylvania-governor-2026-republican-shapiro/","image":"https://media.phillyvoice.com/media/images/81825_Garrity_Pennsylvania.2e16d0ba.fill-1200x630-c0.jpg","video":null,"publish_date":"2025-08-18 16:19:10","author":"Michael Tanenbaum","authors":["Michael Tanenbaum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.083},{"id":352143024,"title":"Joni Ernst challenger JD Scholten drops out and endorses Democratic rival","text":"“From the very beginning, I thought a prairie populist athlete from Western Iowa would be the best candidate to win in the General election,” Scholten said in a statement. “I still do, but instead of me, I have complete confidence that Josh Turek can take this on. That’s why I am suspending my campaign and endorsing him. As his friend, I’m proud to support him.”\n\nBoth Scholten and Turek are the only Democrats from western Iowa serving in the state House of Representatives. Scholten launched his campaign in June following Ernst’s controversial “we all are going to die” remark at a town hall on the One Big Beautiful Bill Act.\n\nErnst made the comment in response to an attendee calling out that “people are going to die” because of the law’s Medicaid reforms.\n\nScholten had experience with national races, most recently losing to Rep. Randy Feenstra (R-IA) in the 2020 elections. He has been a state representative since 2023 and is the only Democrat to represent a Republican stronghold in the state legislature. Prior to his election, President Donald Trump carried the district by 27 points in 2020.\n\nTurek launched his bid for the Senate last week. A Paralympian with two gold medals in wheelchair basketball, Turek has also been a state representative since 2023. He outpaced Democrats across Iowa and polled over 13 points ahead of former Vice President Kamala Harris in 2024.\n\nWith Scholten out of the running, Turek faces three other competitors for the Democratic nomination: former Michelle Obama adviser Jackie Norris, Iraq War veteran Nathan Sage, and state Sen. Zach Wahls.\n\nErnst has not announced whether she will run for reelection. So far, she has two primary challengers: former Iowa GOP state Sen. Jim Carlin and Libertarian-turned-MAGA candidate Joshua Smith.\n\nSmith announced his bid in April, pitching himself as an “America First” Republican. He ran for president last cycle on the Libertarian ticket but failed to get the party’s nomination. He unsuccessfully ran as a Libertarian to oust a Democratic state senator last year.\n\nIOWA STATE REP. JOSH TUREK JOINS CROWDED DEMOCRATIC PRIMARY TO OUST JONI ERNST\n\nCarlin, who announced his campaign in June, was a state senator from 2017 to 2023 and previously a state representative. He unsuccessfully launched a primary bid against Sen. Chuck Grassley (R-IA) in 2022. Carlin has argued that Ernst is not reflecting the values of Iowa Republicans in Congress and did not follow through on her token “make ’em squeal” promises, per the Iowa Capital Dispatch.\n\nThe nonpartisan Cook Political Report rates Ernst’s Senate seat as “likely Republican,” though that rating could shift if the incumbent decides she does not want to run for reelection. Ernst previously said she would plan to only serve two terms, a remark highlighted by Democrats leading up to the 2026 elections. However, she said in 2024 she was “very likely” to run for a third term.","summary":"Iowa state Rep. J.D. Scholten is dropping out of a crowded Democratic primary to oust Sen. Joni Ernst (R-IA) and endorsing fellow state Rep. Josh Turek instead. Scholten announced he would suspend his campaign at a rally with Turek in Council Bluffs, Iowa, on Monday, calling him the &#8220;best hope&#8221; Democrats have to defeat Ernst [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3758014/joni-ernst-challenger-jd-scholten-josh-turek-senate/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP25226733868165.jpg?w=696","video":null,"publish_date":"2025-08-18 15:50:42","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.272},{"id":352112884,"title":"Ohio Democrat Sherrod Brown makes it official, challenging Trump ally in key Senate battle","text":"Former Sen. Sherrod Brown of Ohio on Monday launched his 2026 bid to return to the U.S. Senate, following last year's bitter re-election defeat at the hands of now-Sen. Bernie Moreno. \"Standing up for workers. Treating everyone with dignity and respect. Working as hard as possible for the people of Ohio. I've tried to live my life by those principles. But these days that's not what's happening in Washington—so I'm running for Senate,\" Brown said in a social media post as he highlighted his longtime working class and populist themes. Brown, who spent over three decades representing Ohio in the House and later the Senate, was highly recruited by top national Democrats, including Senate Minority Leader Chuck Schumer, who made two trips to the Buckeye state to try and convince Brown to run again. FOUR KEY SENATE SEATS REPUBLICANS AIM TO FLIP IN 2026 MIDTERMS Brown is seeking the seat held by Republican Sen. Jon Husted, the former Ohio lieutenant governor who was appointed in January to fill the seat left vacant when then Sen. JD Vance stepped down to become vice president in President Donald Trump's administration. SENATE DEMOCRATS LAND SOME BIG FISH IN BID TO WIN BACK MAJORITY IN 2026 Husted has Trump's endorsement as he runs next year to fill the final two years of Vance's six-year term. \"I didn’t plan to run for office again, but when I see what’s going on, I know I can do something about it for Ohio,\" Brown said in a campaign launch video. \"That’s why I’m running for Senate. Because even in these challenging times, I still believe if you stand up for workers, treat people with respect and always fight for Ohio, you can actually make a difference,\" he added. Schumer and Sen. Kirsten Gillibrand, chair of the Democratic Senatorial Campaign Committee (DSCC), argued in a statement that \"no one fights harder for Ohio than Sherrod Brown. From securing Ohioans’ retirement and Social Security benefits to cracking down on fentanyl from China and Mexico, Sherrod will always do what’s right for Ohioans.\" FIRST ON FOX: EX-SENATOR'S PAC SPLURGES ON LUXURY PERKS But the National Republican Senatorial Committee (NRSC) accused Brown of being a \"liberal sell-out\" and pointed to his defeat in last year's election. \"Ohioans just rejected Sherrod Brown's radical agenda of allowing biological men to compete in women's sports, fueling mass illegal immigration, and failing to protect Ohio's good-paying manufacturing jobs,\" NRSC regional press secretary Nick Puglia claimed. And Alex Latcham, executive director of the Senate Leadership Fund, which is the top super PAC supporting Senate Republicans, charged that \"Brown built his disgraceful career on the backs of hardworking Ohio families while he supported the woke Left’s agenda, including amnesty for criminal illegal immigrants, men in girls’ locker rooms, and sticking seniors with higher taxes. Ohioans gladly sent him packing last year, and they’ll not hesitate to toss him aside again.\" Ohio was once a top general election battleground state, but has turned increasingly red over the past decade. Trump carried the state by 11 points over then-Vice President Kamala Harris. But Brown outperformed the top of the ticket, losing to Moreno by less than four points. CLICK HERE TO GET THE FOX NEWS APP Brown is the second top recruit Senate Democrats have landed this year as they work to try and win back the chamber's majority next year. The GOP currently holds a 53-47 majority in the Senate. Last month, former two-term Democratic Gov. Roy Cooper of North Carolina declared his candidacy in the 2026 race to succeed retiring Republican Sen. Thom Tillis.","summary":"Sherrod Brown announces 2026 Senate bid in Ohio, targeting Republican Jon Husted&apos;s seat as Democrats work to regain chamber majority control","url":"https://www.foxnews.com/politics/ohio-democrat-sherrod-brown-makes-official-challenging-trump-ally-key-senate-battle","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/10/sherrod-brown.png","video":"https://www.foxnews.com/video/6376046336112","publish_date":"2025-08-18 13:40:14","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":0.032},{"id":352122852,"title":"Where Trump is popular, Democrats look to a new crop of candidates to help win back the House","text":"By JOEY CAPPELLETTI, Associated Press\n\nFAIRVIEW, N.C. (AP) — Jamie Ager has spent much of the past year rebuilding his farm in the foothills of western North Carolina after Hurricane Helene tore through the region, cutting power, destroying fences and scattering livestock.\n\nThen, earlier this year, Ager lost his beef contract with local schools, a casualty of billions of dollars in cuts to the U.S. Department of Agriculture under the Trump administration.\n\nNow, the fifth-generation farmer is running for Congress — part of a new crop of Democratic candidates the party is turning to as it tries to compete in the tough, often rural districts it may need to flip to retake the U.S. House in 2026.\n\nDemocrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity dominates. Many, like Ager, are already a well-known presence in their communities. And in parts of North Carolina, Kentucky, Michigan and elsewhere, the party is betting local credibility can cut through skepticism where the Democratic brand has fallen.\n\nAger says he sees national Democrats as out of touch with rural life: too “academic” and “politically correct and scripted.”\n\n“That’s just not what people are interested in,” he says. “The ideas of helping poor people, being neighborly, the ideal of doing those things, I think, are worthy, good ideas that are actually popular. But the execution of a lot of those ideas has been gummed up, you know, not well executed.”\n\nA shifting House map\n\nHeading into next year’s midterms, Democrats believe momentum is on their side. Historically, the president’s party loses ground in the midterms. In 2018, during Trump’s first term, Democrats flipped 41 seats to take control of the House. Republicans currently control the House by such a slim margin, Democrats need to pick up only a few seats to break the GOP’s hold on Washington.\n\nThe Republican-led tax break and spending cut bill has added to Democrats’ optimism. About two-thirds of U.S. adults expect the new law will help the rich, according to a poll from The Associated Press-NORC Center for Public Affairs Research. About half say it’ll do more harm than good for middle-class people and people like them.\n\nStill, Republicans remain confident. They point to having fewer vulnerable seats than Democrats have this cycle. Only three Republicans hold House districts Democrat Kamala Harris won last year, while 13 Democrats represent districts Trump won.\n\nThey also note Democrats’ low opinion of their own party after last year’s losses. In a July AP-NORC poll, Democrats were likelier to describe their own party negatively than Republicans, with many Democrats calling it weak or ineffective.\n\nIn places where local dynamics may give Democrats a shot, it means finding the right candidates is especially important, party leaders say.\n\n“Recruitment matters in these years when the environment is going to be competitive,” Democratic pollster John Anzalone said.\n\nDemocrats hope a farmer in western North Carolina can regain trust\n\nWith power, water and telecommunications down due to last year’s hurricane, Ager’s Hickory Nut Gap farm became a hub for the community — hosting cookouts and using propane to grill food for neighbors.\n\nStatewide, the storm caused nearly $60 billion in damage and killed more than 100 people. Little federal aid has reached the hardest-hit parts of western North Carolina.\n\n“Helene hitting definitely put an exclamation point on, like, ‘Whoa, we need help and support,’” Ager said.\n\nDemocrats see Ager as a high-risk, high-reward candidate who could be successful in a district where Democrats have struggled.\n\nNo Democrat has won North Carolina’s 11th Congressional District since it was redrawn by the Republican-controlled legislature in 2011. A court-ordered redistricting ahead of the 2020 election made it slightly more favorable to Democrats, encompassing Asheville and much of western North Carolina. Republican Rep. Chuck Edwards still won by nearly 14 percentage points last year and is expected to seek reelection.\n\nGrayson Barnette, a Democratic strategist who helped recruit Ager, said in some districts it’s a risk to run a candidate who hasn’t held elected office before.\n\n“But I would argue that’s a good thing, especially when the Democrats just took the big hit we did,” Barnette said. “We have to look in the mirror and say, ‘Let’s try something new.’”\n\nIn a district where nearly 62% of residents live in very low-density areas, Barnette believes Ager’s identity — as a business owner, coach and father with deep local roots — could cut through. His unpolished, direct style, he says, may resonate more than a polished political résumé.\n\nIn the video launching his campaign, Ager shows flooding on the farm and is seen on the porch of his home, feeding chickens, driving a tractor and spending time with his wife and three sons.\n\n“I’m not flashy, but I’m honest,” he says in the video.\n\nAger doesn’t call himself a Democrat in the roughly two-minute video and rarely used the word during a three-hour interview. Still, his ties to the party run deep: His brother serves in the state House, following in the footsteps of their father. His grandfather served six years in the U.S. House.\n\nAsked whether that might be a liability in the district, Ager shrugged: “Then don’t vote for me.”\n\nTrump’s big bill could reshape a conservative district in Michigan\n\nIn western Michigan, state Sen. Sean McCann is a different kind of candidate from Ager. He’s buttoned-up and soft-spoken, with a long resume in elected office and deep roots in Kalamazoo, having served for a decade on the city commission before winning a seat in the state House in 2010.\n\nIn a district anchored by conservative and religious values, Democrats see McCann as the kind of steady, experienced figure who can make inroads — especially as backlash builds to Trump’s tax bill, which includes deep spending cuts.\n\nAt a recent meeting at Kalamazoo’s Family Health Center, where nearly 65% of patients rely on Medicaid, the center’s president warned the proposed Medicaid cuts would be devastating.\n\n“It’s about being home in the community and listening to our community’s values — and carrying those to Washington,” McCann said.\n\nThe district is represented by Republican Rep. Bill Huizenga, who won reelection by nearly 12 percentage points in 2022. But Huizenga hasn’t said whether he’ll seek another term, and Trump carried the district by only 5.5 percentage points in 2024.\n\nDemocrats hope strong ties help elsewhere\n\nAcross the country, Democrats are watching similar races in places like Iowa and Kentucky, where local candidates with strong community ties are running. In Iowa’s 2nd District, state Rep. Lindsay James — a fourth-term lawmaker and Presbyterian pastor — is weighing a run in the northeast part of the state. In Kentucky’s 6th, which includes Lexington and Richmond, former federal prosecutor Zach Dembo is running his first campaign, describing himself as a political outsider.\n\nIt’s a mix of profiles: Ager, the farmer-turned-candidate feeding neighbors after a hurricane. McCann, the public servant meeting with health workers in his hometown. And others like them trying to reconnect a skeptical electorate.\n\n“Yes, the Democratic Party has some taint to it,” Ager said. “But when I go talk to Republicans who are friends that I’ve known forever, there’s genuine admiration and mutual respect for each other. And that comes from being in this community forever.”\n\nAssociated Press reporter Maya Sweedler in Washington contributed to this report.","summary":"Democrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity remains dominant.","url":"https://www.bostonherald.com/2025/08/18/2026-us-house-democrats-candidates/","image":"https://www.bostonherald.com/wp-content/uploads/2025/08/Election_2026_House_Democrats_62475-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-08-18 13:24:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.355},{"id":352091958,"title":"Where Trump is popular, Democrats look to a new crop of candidates to help win back the House","text":"By JOEY CAPPELLETTI, Associated Press\n\nFAIRVIEW, N.C. (AP) — Jamie Ager has spent much of the past year rebuilding his farm in the foothills of western North Carolina after Hurricane Helene tore through the region, cutting power, destroying fences and scattering livestock.\n\nThen, earlier this year, Ager lost his beef contract with local schools, a casualty of billions of dollars in cuts to the U.S. Department of Agriculture under the Trump administration.\n\nNow, the fifth-generation farmer is running for Congress — part of a new crop of Democratic candidates the party is turning to as it tries to compete in the tough, often rural districts it may need to flip to retake the U.S. House in 2026.\n\nDemocrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity dominates. Many, like Ager, are already a well-known presence in their communities. And in parts of North Carolina, Kentucky, Michigan and elsewhere, the party is betting local credibility can cut through skepticism where the Democratic brand has fallen.\n\nAger says he sees national Democrats as out of touch with rural life: too “academic” and “politically correct and scripted.”\n\n“That’s just not what people are interested in,” he says. “The ideas of helping poor people, being neighborly, the ideal of doing those things, I think, are worthy, good ideas that are actually popular. But the execution of a lot of those ideas has been gummed up, you know, not well executed.”\n\nA shifting House map\n\nHeading into next year’s midterms, Democrats believe momentum is on their side. Historically, the president’s party loses ground in the midterms. In 2018, during Trump’s first term, Democrats flipped 41 seats to take control of the House. Republicans currently control the House by such a slim margin, Democrats need to pick up only a few seats to break the GOP’s hold on Washington.\n\nThe Republican-led tax break and spending cut bill has added to Democrats’ optimism. About two-thirds of U.S. adults expect the new law will help the rich, according to a poll from The Associated Press-NORC Center for Public Affairs Research. About half say it’ll do more harm than good for middle-class people and people like them.\n\nStill, Republicans remain confident. They point to having fewer vulnerable seats than Democrats have this cycle. Only three Republicans hold House districts Democrat Kamala Harris won last year, while 13 Democrats represent districts Trump won.\n\nThey also note Democrats’ low opinion of their own party after last year’s losses. In a July AP-NORC poll, Democrats were likelier to describe their own party negatively than Republicans, with many Democrats calling it weak or ineffective.\n\nIn places where local dynamics may give Democrats a shot, it means finding the right candidates is especially important, party leaders say.\n\n“Recruitment matters in these years when the environment is going to be competitive,” Democratic pollster John Anzalone said.\n\nDemocrats hope a farmer in western North Carolina can regain trust\n\nWith power, water and telecommunications down due to last year’s hurricane, Ager’s Hickory Nut Gap farm became a hub for the community — hosting cookouts and using propane to grill food for neighbors.\n\nStatewide, the storm caused nearly $60 billion in damage and killed more than 100 people. Little federal aid has reached the hardest-hit parts of western North Carolina.\n\n“Helene hitting definitely put an exclamation point on, like, ‘Whoa, we need help and support,’” Ager said.\n\nDemocrats see Ager as a high-risk, high-reward candidate who could be successful in a district where Democrats have struggled.\n\nNo Democrat has won North Carolina’s 11th Congressional District since it was redrawn by the Republican-controlled legislature in 2011. A court-ordered redistricting ahead of the 2020 election made it slightly more favorable to Democrats, encompassing Asheville and much of western North Carolina. Republican Rep. Chuck Edwards still won by nearly 14 percentage points last year and is expected to seek reelection.\n\nGrayson Barnette, a Democratic strategist who helped recruit Ager, said in some districts it’s a risk to run a candidate who hasn’t held elected office before.\n\n“But I would argue that’s a good thing, especially when the Democrats just took the big hit we did,” Barnette said. “We have to look in the mirror and say, ‘Let’s try something new.’”\n\nIn a district where nearly 62% of residents live in very low-density areas, Barnette believes Ager’s identity — as a business owner, coach and father with deep local roots — could cut through. His unpolished, direct style, he says, may resonate more than a polished political résumé.\n\nIn the video launching his campaign, Ager shows flooding on the farm and is seen on the porch of his home, feeding chickens, driving a tractor and spending time with his wife and three sons.\n\n“I’m not flashy, but I’m honest,” he says in the video.\n\nAger doesn’t call himself a Democrat in the roughly two-minute video and rarely used the word during a three-hour interview. Still, his ties to the party run deep: His brother serves in the state House, following in the footsteps of their father. His grandfather served six years in the U.S. House.\n\nAsked whether that might be a liability in the district, Ager shrugged: “Then don’t vote for me.”\n\nTrump’s big bill could reshape a conservative district in Michigan\n\nIn western Michigan, state Sen. Sean McCann is a different kind of candidate from Ager. He’s buttoned-up and soft-spoken, with a long resume in elected office and deep roots in Kalamazoo, having served for a decade on the city commission before winning a seat in the state House in 2010.\n\nIn a district anchored by conservative and religious values, Democrats see McCann as the kind of steady, experienced figure who can make inroads — especially as backlash builds to Trump’s tax bill, which includes deep spending cuts.\n\nAt a recent meeting at Kalamazoo’s Family Health Center, where nearly 65% of patients rely on Medicaid, the center’s president warned the proposed Medicaid cuts would be devastating.\n\n“It’s about being home in the community and listening to our community’s values — and carrying those to Washington,” McCann said.\n\nThe district is represented by Republican Rep. Bill Huizenga, who won reelection by nearly 12 percentage points in 2022. But Huizenga hasn’t said whether he’ll seek another term, and Trump carried the district by only 5.5 percentage points in 2024.\n\nDemocrats hope strong ties help elsewhere\n\nAcross the country, Democrats are watching similar races in places like Iowa and Kentucky, where local candidates with strong community ties are running. In Iowa’s 2nd District, state Rep. Lindsay James — a fourth-term lawmaker and Presbyterian pastor — is weighing a run in the northeast part of the state. In Kentucky’s 6th, which includes Lexington and Richmond, former federal prosecutor Zach Dembo is running his first campaign, describing himself as a political outsider.\n\nIt’s a mix of profiles: Ager, the farmer-turned-candidate feeding neighbors after a hurricane. McCann, the public servant meeting with health workers in his hometown. And others like them trying to reconnect a skeptical electorate.\n\n“Yes, the Democratic Party has some taint to it,” Ager said. “But when I go talk to Republicans who are friends that I’ve known forever, there’s genuine admiration and mutual respect for each other. And that comes from being in this community forever.”\n\nAssociated Press reporter Maya Sweedler in Washington contributed to this report.","summary":"Democrats say these new recruits are uniquely suited to break through in districts where President Donald Trump’s popularity remains dominant.","url":"https://www.ocregister.com/2025/08/18/2026-us-house-democrats-candidates/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/Election_2026_House_Democrats_62475-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-18 13:24:12","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.355},{"id":352119132,"title":"The Silence of Hollywood Women in the Age of Epstein","text":"LOS ANGELES – As the summer grinds on with headline after headline about Jeffrey Epstein and Donald Trump, the women’s movement is strangely silent. I’m not even sure what I mean when I say “the women’s movement.” We used to have one, but I don’t think I could name a single national figure – political, cultural, business – who is leading the fight for women’s rights. \n\nMerely eight years ago, the righteous rage of women abused at the hands of powerful men shook the foundations of power across the world and birthed the hashtag #MeToo, all sparked by the fall of movie mogul Harvey Weinstein, spreading quickly across the entertainment industry to include directors, producers, CEOs and agents. \n\nIt was a movement aimed at change, meant to clear out the dark attics and scary basements where the bogeymen live and create a world that was better for our daughters. The women in Hollywood created Time’s Up and took up a social justice mantra that sought equity: “50/50 by 2020.” \n\nReporting on this at the time, I was shocked at the depth and breadth of the misconduct. Not just the proverbial casting couch, and not just Weinstein. This was a widespread culture of men helping themselves to women in the workplace and pressuring them to stay silent – until the dam broke. \n\nFor the most part, the men pushed out by that movement remain persona non grata, though some have defiantly returned to the spotlight. Louis C.K., canceled for masturbating in front of multiple women, is now on a national tour titled “Ridiculous” and will headline the New York Comedy Festival in November.\n\nJeff Shell, who had to step down as CEO of NBCUniversal in 2023 over allegations of sexual harassment, has just been named to a top job at Paramount Global with the Skydance merger complete. \n\nFrom Hollywood to politics, it feels like the #MeToo chapter is closed; Andrew Cuomo — who, after first winning praise with his high profile during COVID, had to resign as governor of New York — is back running for New York City mayor, for God’s sake.\n\nWhere are the women? #MeToo may now be a 501c3 called “me too,” but no one’s talking about it. Time’s Up disbanded in 2023 over conflicts of interest and problems in its leadership. Even women who have sought the highest office, including Hillary Clinton and Kamala Harris, appear to have lost their voice. \n\nA palpable fatigue seems to have followed that initial flurry of complaints. Even as new and lurid cases of misconduct emerge, such as accounts of Sean “Diddy” Combs’ sex parties during his recent trial, they have been greeted with more weariness than alarm. Combs, found not guilty of racketeering and sex trafficking but convicted of less serious offenses of transportation to engage in prostitution, is reportedly seeking a pardon from President Trump. \n\nWomen, especially famous ones, sense that speaking out now is not just out of fashion, but carries real reputational risks. No one wants to be “the target of the administration’s ire,” says Leigh Goodmark, an expert in gender-based violence and the Marjorie Cook Professor of Law at University of Maryland Carey School of Law.\n\nAnd undoubtedly confidence has been lost as the national movement for women’s rights has clocked one defeat after another: from the loss of Roe v. Wade to the re-election of Donald Trump a year after he was found liable of sexual abuse in the E. Jean Carroll case. Already besieged, Planned Parenthood is fighting a legal battle for its survival with the Trump administration over Medicaid funding.\n\nNow comes the Epstein case, which no one in Hollywood sees as a newfound rallying cry for the cause of women. It’s just an intra-MAGA political football. The survivors who say they feel abandoned also say they are simply exhausted, trying to manage their trauma, fight their court cases and make ends meet. \n\n“Survivors aren’t stupid. They understand that calling for the [Epstein] files to be released is a political move,” Goodmark said. “No one thinks it’s about survivors.” \n\nOf Trump, she added, “He’s a serial violator of women. They know already he was a friend of Jeffrey Epstein. They don’t believe he doesn’t make little drawings. So continuing to weigh in on this when Epstein is dead, when the people who support him don’t care, doesn’t seem like a great use of time or resources.”\n\nMore ominously, a lawyer who has worked on the Weinstein case said that both Epstein and Diddy involved too many powerful people, and the current silence is just plain fear of the consequences.\n\n“These guys are in a power network rubbing elbows with presidents and senators — people with real power. It’s paralyzing,” said the lawyer, who said she declined to represent victims of Diddy and Epstein. “I’m as guilty as the women who aren’t saying anything. I didn’t want to have a great career and then have it ended — either dead or bankrupt or vilified. And that’s the math on everyone else’s mind. The men were too powerful.” \n\nWhen I reached out to speak to some of the women who came forward in 2017, I was met with the harsh sting of their disappointment.\n\n“We are drowning in sorrow,” said Rosanna Arquette, who has said she was blacklisted from working as an actress in Hollywood after she rebuffed Weinstein. A longtime activist against sex trafficking, she is friends with women who came forward with claims of abuse by Epstein.\n\nMore concretely, “there’s a real dearth of a national-level, umbrella organization that focuses on sexual violence,” said Weinstein survivor Louise Godbold, who counsels victims of sexual abuse.\n\n“Survivors are busy dealing with their personal trauma, that’s the level I’m working with. It’s a formidable foe if you’re talking about the entrenched establishment power who have so much to lose if it came out that they were perpetrators. It’s an uphill battle. Most survivors are dealing with their PTSD and trying to hold down a job. They’re caught up in court cases that take every ounce of their energy. They don’t have the capacity to do more.” \n\nIs the silence a tacit agreement in Hollywood that #MeToo may have gone too far? I wonder. If pressed, I would argue that people seem to just want to get on with their lives, get back to work and declare a truce. \n\nThe power dynamics may never permanently shift in an industry where men dominate decisions and beautiful women will always vie for media attention and roles. But in Hollywood right now, the silence is deafening.","summary":"Is the lack of reaction a tacit nod to #MeToo being over? Or are women leaders and survivors just too exhausted to speak? \n\n\nThe post The Silence of Hollywood Women in the Age of Epstein appeared first on TheWrap.","url":"https://www.thewrap.com/the-silence-of-hollywood-women-in-the-age-of-epstein/","image":"https://www.thewrap.com/wp-content/uploads/2025/08/081425-The-silence-of-Hollywood-women.jpg","video":null,"publish_date":"2025-08-18 13:15:00","author":"Sharon Waxman","authors":["Sharon Waxman"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.172},{"id":352158880,"title":"'Star Wars' Star Mark Hamill Planned to Leave U.S. for Europe After Trump Beat Kamala","text":"Actor Mark Hamill revealed that he planned to leave the United States after President Donald Trump defeated former Vice President Kamala Harris in the 2024 election.\n\nHamill revealed to The Times that that he gave his longtime wife, Marilou Tork, the choice between “London or Ireland” after the election did not go as he had hoped\n\n“She’s very clever. She didn’t respond right away but a week later she said, ‘I’m surprised you would allow him to force you out of your own country,’” Hamill said. “‘That son of a bitch,’ I thought. I’m not leaving.”\n\nHamill lamented “the bullying, the incompetence, the people in place” in the Trump administration, adding that the only way he can tolerate the situation is view it “like a thick, sprawling political novel” instead of reality. He ultimately decided against moving to England under the belief that there are “more honest, decent people” in the country than what meets the eye.\n\nThe actor went on to promote his upcoming movie, The Long Walk, as a critique on U.S. gun culture as well as a story about Immigration and Customs Enforcement (ICE).\n\n“Francis Lawrence, the director, understood what was troubling me,” he said. “American society is gun violence and it’s hard to get past that, but as I spoke to him I realized this is just the guy. He said he would have been surprised if I wasn’t troubled by it.”\n\nHamill then said ICE agents have been “brutalizing people, kneeling on their necks.”\n\n“When I made the movie I wasn’t thinking in terms of it being timely but it’s proven to be just that,” he added.\n\nPaul Roland Bois directed the award-winning Christian tech thriller, EXEMPLUM, which has a 100% Rotten Tomatoes critic rating and can be viewed for FREE on YouTube, Tubi, or Fawesome TV. “Better than Killers of the Flower Moon,” wrote Mark Judge. “You haven’t seen a story like this before,” wrote Christian Toto. A high-quality, ad-free rental can also be streamed on Google Play, Vimeo on Demand, or YouTube Movies. Follow him on X @prolandfilms or Instagram @prolandfilms.","summary":"Actor Mark Hamill revealed that he planned to leave the United States after President Donald Trump defeated former Vice President Kamala Harris in the 2024 election.\n\n\nThe post &#8216;Star Wars&#8217; Star Mark Hamill Planned to Leave U.S. for Europe After Trump Beat Kamala appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/18/mark-hamill-reveals-he-planned-to-leave-u-s-after-trump-beat-kamala/","image":"https://media.breitbart.com/media/2025/08/Hamill-640x335.jpg","video":null,"publish_date":"2025-08-18 13:03:17","author":"Paul Bois","authors":["Paul Bois"],"language":"en","category":"politics","source_country":"US","sentiment":-0.12},{"id":352083286,"title":"James Comey prompts MAGA outrage after he posts ‘creepy video’ where he claims to be a Swiftie","text":"Former FBI director James Comey has unexpectedly outed himself as a fan of Taylor Swift, saying her music serves as his “coping mechanism” in the face of renewed hostility from President Donald Trump.\n\nComey, 64, who was fired by Trump in 2017, took to his Substack on Sunday to post an oddly formal video in which he praised the pop superstar as “a truly inspirational public figure” and said that “of course” he had watched her recent interview with the Kelce Brothers.\n\n“Taylor Swift and I go way back,” he explained. “I went to my first concert of hers 15 years ago. I’ve been to a second and I have helped financially support the attendance of a lot of family members and others. I’m in a family’s Swiftie group chat. I know all her music, and I listen to it in my headphones when I cut the grass.”\n\nMAGA commentators including Benny Johnson and Dinesh D’Souza were quick to deride Comey over the bizarre video, which was arguably still not as weird as the affair he found himself caught up in earlier this summer after he posted a photograph on Instagram of sea shells arranged on a beach to spell out “8647,” which was interpreted as a veiled call for Trump to be assassinated, leading to a Justice Department investigation. \n\nComey stated that his favorite Swift tracks are “All Too Well” (specifying the 10-minute version) and “Exile” featuring Bon Iver, and praised the star by saying she had soundtracked his family’s life, produced “great art” and served as a role model for his children. \n\nPivoting to the actual theme of his quasi-sermon, Comey said: “Like a lot of you, I struggle with how to stand up to bullies without letting their meanness infect me and change me.”\n\nDiscussing California Gov. Gavin Newsom’s recent parodies of Trump’s posting style on social media, he said, “I find it very funny. Hilarious even, sometimes. But I’ve got to be honest, it also leaves me with a strange feeling at times because I don’t want us to become like Trump and his followers.\n\n“There are far more decent, honest, kind people in America than there are mean jerks, and don’t get me wrong, we have our jerks, millions of them. You may have noticed! In particular, there’s a stunning coarseness and ugliness in the Republican Party today. \n\n“It’s upsetting, but it’s also a minority of America. On the whole, we aren’t like that and we don’t like that.”\n\nCircling back to Swift, Comey noted that she had “made clear that she sees Donald Trump for what he is,” having endorsed Joe Biden and then Kamala Harris in the 2020 and 2024 presidential elections.\n\n“While our elderly, makeup-covered president is posting about whether Taylor Swift is still ‘hot’ and declaring that he can’t stand her, what’s she doing? Living her best life, producing great music, and, as she urged all of us to do during the podcast, not giving the jerks power over her mind.”\n\nAfter praising Arthur C Brooks’ articles on happiness in The Atlantic, Comey concluded by reciting lyrics from Swift’s 2010 song “Mean” as his anthem of defiance: “I bet you got pushed around, somebody made you cold, but the cycle ends right now, because you can’t lead me down that road.”\n\nDirector of National Intelligence Tulsi Gabbard has since moved to refer several Obama administration officials – including Comey, ex-CIA director John Brennan and her predecessor James Clapper – to the same department for prosecution over allegations they had “manufactured” intelligence to substantiate the idea that Russia meddled in the 2016 presidential election to help Trump beat Hillary Clinton.","summary":"Ex-FBI director hails Taylor Swift as ‘truly inspirational public figure’ in bizarre anti-bullying sermon","url":"https://www.independent.co.uk/news/world/americas/us-politics/james-comey-taylor-swift-trump-b2809542.html","image":"https://static.independent.co.uk/2025/08/18/10/26/SwiftComey-split.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/Tv0sbYWc-OhrQWqOm.mp4","publish_date":"2025-08-18 12:06:24","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":0.193},{"id":352103262,"title":"Democrats are reliving the GOP’s 2012 nightmare. A Trump-style rebellion is needed","text":"Trump’s dynamic rebellion catapulted not only him into the national spotlight, but also the Republican Party, whose national relevance had faded since former President George W. Bush’s fall from grace, with approvals dipping to the mid-20s by the time he helicoptered back to his Texas ranch. In the years that followed, the Tea Party’s groundswell fueled GOP congressional victories, but it failed to produce strong national leaders during the Obama era.\n\nThe 2012 GOP presidential hopefuls epitomized the party’s troubles, offering nothing fresh beyond Herman Cain’s “9-9-9” tax plan and each battling to appear more opposed to the Obama agenda than the next. A dissatisfied primary electorate vacillated from one candidate to another in that uninspired scrum, with Cain, Rick Perry, Newt Gingrich, and eventual winner Mitt Romney sharing time in the national lead. \n\nIt’s easy to see shades of the 2012 GOP in today’s Democratic Party, where a restless base drives mass demonstrations, yet whose agenda is fundamentally oppositional and whose national leaders lack stature. The party is full of energy and desperate for unity but lacks the leaders and positive vision necessary to unify its constituent parts. \n\nMeanwhile, fealty to sacred cows keep them from an internal reckoning that could spark renewal. Democrats’ unwillingness to criticize Biden-era policies on the border, inflation, and hot-button cultural issues, and even to voice obvious concerns about his mental capacity, rendered them out-of-touch and left them vulnerable to countless political blind spots.\n\nThe 2012 GOP similarly resisted internal criticism, languishing in Bush-era pieties like uncritical support for free trade and military interventionism. Only Ron Paul proved willing to challenge prevailing orthodoxy during the primary, and debate crowds booed him lustily for his efforts, especially his criticisms of the Iraq War, while his mainstream conservative rivals shook their heads in disbelief at his every utterance.\n\nIt’s possible that Democrats today are mired in a deeper refusal to engage in meaningful self-scrutiny. Their coalition — Zohran Mamdani-style progressives, shapeshifting establishmentarians in congressional leadership, and meat-and-potatoes moderates such as Sen. Elissa Slotkin (D-MI) — is fractured but not warring, as exemplified by House Minority Leader Hakeem Jeffries’s (D-NY) refusal to endorse or challenge Mamdani’s socialist policies in New York’s mayoral race. The Democratic factions orbit one another like distant planets, drifting further apart without the gravitational pull of unifying ideas and leaders. \n\nThis drift springs from a paralyzing fear of internal conflict, driven by three forces that stifle the factional clashes needed for renewal.\n\nFor one, the hyper-conformity of the woke era conditioned liberals to view every conceivable circumstance as part of a Manichean struggle between good and evil in which only two sides existed: the “right side of history” and the wrong side, anti-racism and racism, allies and enemies. Breaking with orthodoxy meant joining forces with the worst possible element of humanity: white supremacists, Nazis, etc. Even the appearance of nonconformity came with severe social and professional consequences. In an environment where words amounted to violence and awareness of one’s “privilege” demanded constant monitoring, self-censorship became the norm. Breaking out of this deeply rooted and fear-based behavior will demand true courage and savvy.\n\nThe second cause flows from the first: To ensure the “right side of history” prevails, Democrats became obsessed with avoiding the appearance of giving aid to Trump’s “wrong side,” even indirectly. This led them to suppress reasonable doubts about obvious things, such as Biden’s mental decline, Kamala Harris’s political talent, or the state of the economy and border. Preventing Trump from winning even a single news cycle demanded rigid and artificial messaging alignment. This forced positivity came at the expense of both short- and long-term political goals, causing Democrats to appear untrustworthy, callous, and downright ignorant of the problems most Americans saw in their government. Ironically, this empowered Trump and the Republicans all the more. \n\nFinally, Democrats’ aversion to internal conflict springs from not having had much practice of late. Not since 2008 has the Democratic Party held an open, honest, and rigorous presidential primary, which is the forum where parties traditionally test ideas and leaders to forge unity among its factions. From the crucible of competitive primaries emerges bold and battle-tested governing visions. Without them, parties are stuck with stale ideas and outdated modes of politics and campaigning. \n\nWhile technically open, the 2016 Democratic primary was marred from the beginning with accusations by supporters of Bernie Sanders that the Democratic National Committee was biased toward the Hillary Clinton campaign. The Wikileaks dump later validated these suspicions, revealing internal emails showing DNC staff mocking Sanders and discussing ways to undermine his campaign. Interim DNC Chairwoman Donna Brazille, who gave Clinton’s campaign advance information about presidential debate questions, later admitted that the DNC was financially beholden to Clinton. The tipped scales prevented a true intraparty competition and crowned an unpopular nominee whose troubles were never truly reckoned with. The primary was a coronation in all but name.\n\nThe 2020 primary was similarly managed by insiders. After early Sanders victories, the party establishment rapidly consolidated behind Joe Biden, with Pete Buttigieg and Amy Klobuchar quickly dropping out to endorse him and effectively ending the race. While evidence of 2016-level corruption never emerged, the perception of a tipped-scale contest lingered among a large bloc of the Democratic electorate.\n\nThe 2024 coronation of former Vice President Kamala Harris following Biden’s withdrawal robbed the party of another opportunity for productive conflict and renewal. Party bosses again tightly managed the selection, tossing their full support behind the vice president without allowing Democratic voters to have their say. Harris’s highly scripted rollout followed the stale Obama playbook with its emphasis on her identity as the first black female nominee, replete with Obama-esque magazine covers depicting her gazing aspirationally into the distance and an Obama-esque campaign slogan “A New Way Forward,” which was an adaption of Obama’s 2012 slogan, “Forward.”\n\nMeanwhile, fractures in the party’s coalition were downplayed and at times outright ignored as party leaders attempted to keep the focus on Trump. A telling example of internal debate being suppressed came during the first night of the Democratic convention in Chicago. During Biden’s speech that capped the first night, a group of pro-Palestinian protesters erupted in the back of the United Center, holding up a Palestinian flag and booing wildly. As Biden struggled through his scripted remarks amid the uproar, the lights over the protesters’ section of the arena were shut, leaving them shrouded in noticeable darkness. It is therefore no surprise that the party has yet to settle upon a cohesive and unifying position on Gaza or on anything else, for that matter. \n\nThe Democratic Party’s commitment to being the “anti-Trump” party has left it in ruins, with its approval ratings at historic lows. It desperately needs, as the GOP once did, an internal rebellion led by a bold, unapologetic figure (Rahm Emanuel? Jon Stewart?) willing to slay their sacred cows, confront uncomfortable truths, and forge a unifying vision from the ashes.","summary":"It&#8217;s easy to forget that President Donald Trump&#8216;s rise began with an assault on fellow Republicans, not Democrats. Of course, Trump made waves by questioning former President Barack Obama’s claim to birthright citizenship in 2011. But he didn’t become a true political force until he savaged low energy Jeb Bush (Jeb!), Little Marco Rubio, and [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3757724/democrats-reliving-gop-2012-nightmare-trump-style-rebellion-needed/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP1202220120842-1.jpg?w=696","video":null,"publish_date":"2025-08-18 12:00:00","author":"Peter Laffin","authors":["Peter Laffin"],"language":"en","category":"politics","source_country":"US","sentiment":0.201},{"id":352066040,"title":"Democrats are reliving the GOP’s 2012 nightmare. A Trump-style rebellion is needed","text":"Trump’s dynamic rebellion catapulted not only him into the national spotlight, but also the Republican Party, whose national relevance had faded since former President George W. Bush’s fall from grace, with approvals dipping to the mid-20s by the time he helicoptered back to his Texas ranch. In the years that followed, the Tea Party’s groundswell fueled GOP congressional victories, but it failed to produce strong national leaders during the Obama era.\n\nThe 2012 GOP presidential hopefuls epitomized the party’s troubles, offering nothing fresh beyond Herman Cain’s “9-9-9” tax plan and each battling to appear more opposed to the Obama agenda than the next. A dissatisfied primary electorate vacillated from one candidate to another in that uninspired scrum, with Cain, Rick Perry, Newt Gingrich, and eventual winner Mitt Romney sharing time in the national lead. \n\nIt’s easy to see shades of the 2012 GOP in today’s Democratic Party, where a restless base drives mass demonstrations, yet whose agenda is fundamentally oppositional and whose national leaders lack stature. The party is full of energy and desperate for unity but lacks the leaders and positive vision necessary to unify its constituent parts. \n\nMeanwhile, fealty to sacred cows keep them from an internal reckoning that could spark renewal. Democrats’ unwillingness to criticize Biden-era policies on the border, inflation, and hot-button cultural issues, and even to voice obvious concerns about his mental capacity, rendered them out-of-touch and left them vulnerable to countless political blind spots.\n\nThe 2012 GOP similarly resisted internal criticism, languishing in Bush-era pieties like uncritical support for free trade and military interventionism. Only Ron Paul proved willing to challenge prevailing orthodoxy during the primary, and debate crowds booed him lustily for his efforts, especially his criticisms of the Iraq War, while his mainstream conservative rivals shook their heads in disbelief at his every utterance.\n\nIt’s possible that Democrats today are mired in a deeper refusal to engage in meaningful self-scrutiny. Their coalition — Zohran Mamdani-style progressives, shapeshifting establishmentarians in congressional leadership, and meat-and-potatoes moderates such as Sen. Elissa Slotkin (D-MI) — is fractured but not warring, as exemplified by House Minority Leader Hakeem Jeffries’s (D-NY) refusal to endorse or challenge Mamdani’s socialist policies in New York’s mayoral race. The Democratic factions orbit one another like distant planets, drifting further apart without the gravitational pull of unifying ideas and leaders. \n\nThis drift springs from a paralyzing fear of internal conflict, driven by three forces that stifle the factional clashes needed for renewal.\n\nFor one, the hyper-conformity of the woke era conditioned liberals to view every conceivable circumstance as part of a Manichean struggle between good and evil in which only two sides existed: the “right side of history” and the wrong side, anti-racism and racism, allies and enemies. Breaking with orthodoxy meant joining forces with the worst possible element of humanity: white supremacists, Nazis, etc. Even the appearance of nonconformity came with severe social and professional consequences. In an environment where words amounted to violence and awareness of one’s “privilege” demanded constant monitoring, self-censorship became the norm. Breaking out of this deeply rooted and fear-based behavior will demand true courage and savvy.\n\nThe second cause flows from the first: To ensure the “right side of history” prevails, Democrats became obsessed with avoiding the appearance of giving aid to Trump’s “wrong side,” even indirectly. This led them to suppress reasonable doubts about obvious things, such as Biden’s mental decline, Kamala Harris’s political talent, or the state of the economy and border. Preventing Trump from winning even a single news cycle demanded rigid and artificial messaging alignment. This forced positivity came at the expense of both short- and long-term political goals, causing Democrats to appear untrustworthy, callous, and downright ignorant of the problems most Americans saw in their government. Ironically, this empowered Trump and the Republicans all the more. \n\nFinally, Democrats’ aversion to internal conflict springs from not having had much practice of late. Not since 2008 has the Democratic Party held an open, honest, and rigorous presidential primary, which is the forum where parties traditionally test ideas and leaders to forge unity among its factions. From the crucible of competitive primaries emerges bold and battle-tested governing visions. Without them, parties are stuck with stale ideas and outdated modes of politics and campaigning. \n\nWhile technically open, the 2016 Democratic primary was marred from the beginning with accusations by supporters of Bernie Sanders that the Democratic National Committee was biased toward the Hillary Clinton campaign. The Wikileaks dump later validated these suspicions, revealing internal emails showing DNC staff mocking Sanders and discussing ways to undermine his campaign. Interim DNC Chairwoman Donna Brazille, who gave Clinton’s campaign advance information about presidential debate questions, later admitted that the DNC was financially beholden to Clinton. The tipped scales prevented a true intraparty competition and crowned an unpopular nominee whose troubles were never truly reckoned with. The primary was a coronation in all but name.\n\nThe 2020 primary was similarly managed by insiders. After early Sanders victories, the party establishment rapidly consolidated behind Joe Biden, with Pete Buttigieg and Amy Klobuchar quickly dropping out to endorse him and effectively ending the race. While evidence of 2016-level corruption never emerged, the perception of a tipped-scale contest lingered among a large bloc of the Democratic electorate.\n\nThe 2024 coronation of former Vice President Kamala Harris following Biden’s withdrawal robbed the party of another opportunity for productive conflict and renewal. Party bosses again tightly managed the selection, tossing their full support behind the vice president without allowing Democratic voters to have their say. Harris’s highly scripted rollout followed the stale Obama playbook with its emphasis on her identity as the first black female nominee, replete with Obama-esque magazine covers depicting her gazing aspirationally into the distance and an Obama-esque campaign slogan “A New Way Forward,” which was an adaption of Obama’s 2012 slogan, “Forward.”\n\nMeanwhile, fractures in the party’s coalition were downplayed and at times outright ignored as party leaders attempted to keep the focus on Trump. A telling example of internal debate being suppressed came during the first night of the Democratic convention in Chicago. During Biden’s speech that capped the first night, a group of pro-Palestinian protesters erupted in the back of the United Center, holding up a Palestinian flag and booing wildly. As Biden struggled through his scripted remarks amid the uproar, the lights over the protesters’ section of the arena were shut, leaving them shrouded in noticeable darkness. It is therefore no surprise that the party has yet to settle upon a cohesive and unifying position on Gaza or on anything else, for that matter. \n\nThe Democratic Party’s commitment to being the “anti-Trump” party has left it in ruins, with its approval ratings at historic lows. It desperately needs, as the GOP once did, an internal rebellion led by a bold, unapologetic figure (Rahm Emanuel? Jon Stewart?) willing to slay their sacred cows, confront uncomfortable truths, and forge a unifying vision from the ashes.","summary":"It&#8217;s easy to forget that President Donald Trump’s rise began with an assault on fellow Republicans, not Democrats. Of course, Trump made waves by questioning former President Barack Obama’s claim to birthright citizenship in 2011. But he didn’t become a true political force until he savaged low energy Jeb Bush (Jeb!), Little Marco Rubio, and [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3757724/democrats-reliving-gop-2012-nightmare-trump-style-rebellion/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/AP1202220120842-1.jpg?w=696","video":null,"publish_date":"2025-08-18 12:00:00","author":"Peter Laffin","authors":["Peter Laffin"],"language":"en","category":"politics","source_country":"us","sentiment":0.201},{"id":352073946,"title":"How Gavin Newsom is out-trumping Trump","text":"It began with a meme. Two photographs went viral on X: Gavin Newsom as a teenager, scarf draped across his shoulders, the very image of San Francisco privilege; and J.D. Vance, straight-backed in Marine fatigues, fresh out of high school and heading for Iraq.The contrast was deliberate. Newsom: born into money and connections, nurtured by the Getty family, polished into politics before he hit forty. Vance: raised in a chaotic household in Ohio, stabilized only by the Marines, hardened in Iraq, propelled upward by Yale Law and a bestselling memoir. It was the quintessential split screen — privilege versus grit, elites versus scrappers.But the meme was only the opening act.The Trumpian TurnFor years, Newsom’s official press accounts were standard Democratic fare: policy announcements, carefully worded releases, ribbon-cutting photos. Then, this August, something changed.His press office on X suddenly began sounding like Donald Trump at 3 a.m.:ALL CAPS proclamations.Mocking nicknames.Boasts so overblown they bordered on parody.Trump was rechristened “Taco Trump” — shorthand for “Trump Always Chickens Out.” J.D. Vance became “JD ‘Just Dance’ Vance.” And Newsom crowned himself “our nation’s favorite governor,” vowing to “SAVE AMERICA” from the “disastrous maps war” Trump had unleashed.The parody was deliberate. Newsom wasn’t talking policy; he was trolling.MAGA: From Mockers to the MockedMAGA has always thrived on ridicule. Trump’s nicknames — “Crooked Hillary,” “Sleepy Joe,” “Low-Energy Jeb” — weren’t just insults. They were branding. They turned opponents into caricatures and made Democrats look joyless, out of touch, and defensive.Newsom’s innovation was to flip the script. Instead of rolling his eyes or fact-checking, he mocked them back. He parodied their style, borrowed their cadence, threw their tactics in their face.And MAGA, for once, didn’t laugh.The Guilfoyle SubplotAdding spice to the feud is a subplot straight out of a political soap opera. Gavin Newsom’s ex-wife is Kimberly Guilfoyle — now a sequined staple of MAGA, US Ambassador to Greece and Donald Trump Jr.’s former partner. From 2001 to 2006, she was married to Newsom and even served as First Lady of San Francisco during his mayoralty. Their split was civil, blamed on geography, but history clearly enjoys irony. Today, she’s a leading voice of MAGA while her ex-husband needles MAGA’s king with memes. Why It WorksOn the surface, Newsom’s trolling looks juvenile. Why would a governor's press account waste time calling the Vice President “Just Dance Vance”? But Democrats spent the last decade underestimating ridicule as a weapon. Trump proved that attention is currency, and nicknames can define opponents more effectively than policy papers.By mimicking Trump’s style, Newsom isn’t trying to out-debate him. He’s trying to deny him the monopoly on mockery.The strategy is simple:Mock back.Dominate the oxygen.It’s crude. It’s performative. But it works.The MAGA Battlefield in 2025This fight isn’t happening in a vacuum. MAGA today isn’t just Trump’s campaign machinery; it’s a permanent movement. It controls school boards, censors textbooks, drives immigration crackdowns, and fuels conspiracies across social media.The Republican Party has been fully absorbed into this ecosystem. J.D. Vance may be Vice President, but figures like Ron DeSantis and Marjorie Taylor Greene still command cultural loyalty. The battlefield isn’t legislation; it’s narrative.That’s why Newsom’s trolling matters. He’s meeting MAGA not with white papers, but with memes — the lingua franca of the culture war.Carrot and StickTrolling is the stick. But Newsom also wields a carrot: direct engagement. His podcast, This Is Gavin Newsom, has featured right-wing guests like Charlie Kirk and Steve Bannon. Democrats were horrified. Why legitimise extremists? But Newsom’s message was clear: I’m not afraid of you, and I’ll argue with you in your own spaces. It’s a risky gamble. But it positions Newsom as one of the few Democrats willing to meet MAGA on the cultural battlefield rather than avoiding it.Harris vs. Newsom: Memo vs. MemeThe contrast with Kamala Harris’s 2024 campaign could not be sharper. Harris ran as the anti-Trump: sober, cautious, scripted. She leaned on biography — first woman Vice President, daughter of immigrants — and policy proposals on childcare and reproductive rights. But her campaign avoided spectacle.When Trump mocked her as “Laffin’ Kamala,” Harris didn’t punch back; she relied on fact-checkers and surrogates. Her message discipline made her look serious, but it left her flat-footed in a culture war defined by ridicule.Newsom, by contrast, leans into the chaos. Where Harris tried to be dignified and above the fray, Newsom revels in it. Where she treated memes as unserious, he treats them as currency. Harris thought voters would crave normalcy. Newsom bets they want someone who can fight Trump at his own game.Harris’s 2024 was a memo. Newsom’s 2025 is a meme.Democratic DoubtsNot everyone in the Democratic Party is impressed. Moderates see the trolling as reckless, undermining the gravitas of their brand. Progressives worry it trivialises policy battles like climate change and healthcare.But among the Democratic base, there’s also relief. For years, they’ve watched Trump humiliate their leaders with nicknames, while Democrats responded with sighs. Newsom is the first to punch back in kind.The RiskThe danger is obvious. If Democrats troll like Trump, do they risk becoming indistinguishable from him? Does parody politics normalise Trumpism rather than defeat it? This is the tightrope Newsom walks. But the louder they scoffed, the more they proved Newsom’s point. MAGA loves to brand others but hates being branded itself.The Lyndon Johnson QuestionYet trolling alone isn’t governing. The deeper question is whether Newsom, if he ever reaches the White House, could turn parody into power. Here’s where Lyndon B. Johnson looms. When John F. Kennedy was assassinated in 1963, Johnson was dismissed as a backroom Texan wheeler-dealer. But he stunned the nation by pushing through the Civil Rights Act, the Voting Rights Act, Medicare, and the Great Society.Johnson showed that politics requires both theatre and muscle — spectacle to capture attention, and force to deliver results. Can Newsom do the same? Can the man who tweets “TACO TRUMP” also twist arms in Congress to pass universal childcare or climate reform?Eyes on 2028Newsom insists he isn’t running in 2028. No one believes him. With Biden retired and Harris damaged, Democrats need a contender who won’t flinch in the meme arena. The question is whether Democrats will stomach a candidate who fights like Trump. For some, it’s unbecoming. For others, it’s overdue. For MAGA, Newsom is an irritation they can’t easily dismiss: rich, coastal, polished — but unafraid to mock them back.Back to the MemeThat viral split screen of scarf vs fatigues was meant to define who had grit and who had privilege. But in modern politics, biography matters less than performance. Vance leveraged his Marine past to ride Trump’s coattails into the vice presidency. Newsom is leveraging parody to carve out space as the Democrat unafraid of MAGA. Act one was the split screen. Act two is the troll war. Act three, if it comes, will be 2028 — where Gavin Newsom will either be remembered as the liberal who cosplayed Trump for a season or the Democrat who figured out how to use memes to win power. Could he be the Lyndon Johnson of the meme era — underestimated, even mocked, until history forced him into greatness? That remains unanswered. But for now, MAGA finally knows what it feels like to be on the receiving end of ridicule. And Gavin Newsom is laughing loudest.","summary":"That viral split screen of scarf vs fatigues was meant to define who had grit and who had privilege. But in modern politics, biography matters less than performance. Vance leveraged his Marine past to ride Trump’s coattails into the vice presidency. Newsom is leveraging parody to carve out space as the Democrat unafraid of MAGA. Act one was the split screen. Act two is the troll war. Act three, if it comes, will be 2028 — where Gavin Newsom will either be remembered as the liberal who cosplayed Trump for a season or the Democrat who figured out how to use memes to win power. Could he be the Lyndon Johnson of the meme era — underestimated, even mocked, until history forced him into greatness? That remains unanswered. But for now, MAGA finally knows what it feels like to be on the receiving end of ridicule. And Gavin Newsom is laughing loudest.","url":"https://timesofindia.indiatimes.com/world/us/how-gavin-newsom-is-taking-the-fight-to-maga-trump-style/articleshow/123363050.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123363622/123363622.jpg","video":null,"publish_date":"2025-08-18 11:30:03","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"IN","sentiment":-0.121},{"id":352057234,"title":"Republican Stacy Garrity seeks to challenge Pennsylvania Gov. Josh Shapiro’s reelection bid","text":"HARRISBURG, Pa. (AP) — Stacy Garrity, Pennsylvania’s two-term elected state treasurer, said Monday that she will seek the Republican nomination to challenge Democratic Gov. Josh Shapiro ’s reelection bid, setting up what could be a contest between a low-profile officeholder and a potential White House contender in 2028.\n\nGarrity said in a statement that she will \"will bring jobs back, strengthen our economy and make Pennsylvania more affordable for families in every corner of the state.”\n\nSome top Pennsylvania Republicans support Garrity in the 2026 race for governor and hope she’ll see a clear primary field, although those hopes have been buffeted in recent weeks by 2022’s losing gubernatorial candidate, Doug Mastriano, suggesting that he'll run again.\n\nGarrity has hinted at a run for months and stepped up her criticism of Shapiro. In campaign fundraising appeals, she accused Shapiro of being soft on law and order and hostile to her “pro-worker, pro-energy, pro-America agenda.”\n\nShapiro has returned fire, blasting her for supporting President Donald Trump’s big tax break and spending cut package. Shapiro said it would hurt rural hospitals and people who rely on Medicaid, drive up the cost of energy and blow up the federal deficit.\n\nGarrity’s task of challenging Shapiro is, by any measure, a tall one. Garrity is relatively untested and spent less than $3 million in her two campaigns for treasurer in 2020 and 2024.\n\nShapiro has won three statewide races, carries a reputation as a disciplined messenger and powerhouse fundraiser who spent more than $70 million alone in his sole campaign for governor, smashing Pennsylvania’s campaign finance record.\n\nHe’s grown into a national figure after he made Democratic presidential nominee Kamala Harris’ shortlist for vice presidential running mates last year and is viewed as a potential White House contender for the party in 2028.\n\nFollow Marc Levy on X at: https://x.com/timelywriter","url":"https://www.yahoo.com/news/articles/republican-stacy-garrity-seeks-challenge-111639337.html","image":"https://s.yimg.com/ny/api/res/1.2/0ZGjlHKqHhKCMIsVs04WkQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/ap.org/64a919adc5643c87f919cf05f313969f","video":null,"publish_date":"2025-08-18 11:16:39","author":"Marc Levy","authors":["Marc Levy"],"language":"en","category":"politics","source_country":"us","sentiment":0.267},{"id":352068156,"title":"Gavin Newsom's Odds of Beating AOC for 2028 Nomination Widen","text":"California Governor Gavin Newsom's chances of beating New York Representative Alexandria Ocasio-Cortez (AOC) to win the Democratic presidential nomination in 2028 are increasing.According to online betting website Polymarket, a platform where users can place \"yes\" or \"no\" bets on the likelihood of world events, Newsom is leading the progressive firebrand by 7 percentage points in a hypothetical matchup that also includes other high-profile Democratic figures.This is 3 percentage points more than earlier this month, when he was 4 percentage points ahead of AOC.Why It MattersWhile neither Newsom nor AOC have formally announced their candidacy in the 2028 Democratic primaries, they have not ruled it out. They have both been mentioned as figures who could lead the Democratic Party into the next election, following then-Vice President Kamala Harris' loss to Donald Trump in the 2024 presidential election.Whoever emerges as the next party leader will shape the Democratic narrative for change and hold a lot of responsibility for healing internal divisions in the party and leading it to electoral success.What To KnowNewsom has sparked speculation that he might run for president because he has delivered a number of speeches around the country and he has been among the leading candidates in most polls of the 2028 primary.Meanwhile, AOC has posted campaign-style social media videos and toured the country with Vermont Senator Bernie Sanders earlier this year.The betting odds also showed former Transportation Secretary Pete Buttigieg has a 9 percent chance of winning the nomination while Maryland Governor Wes Moore is on 6 percent. Harris is at 5 percent.What People Are SayingSpeaking to Newsweek, Mark Shanahan who teaches American politics at the University of Surrey in the U.K, said: \"We are incredibly early in the presidential election cycle with campaigning proper still years down the line. But everything Gavin Newsom is doing suggests he's serious about running in 2028. This started last year when he didn't put his hat in the running once Joe Biden relinquished the Democrat nomination, and has continued through building a sizeable war chest, building his public profile beyond California through everything from the regular media round to launching his own podcast, presenting California as a bastion against presidential overreach, and now mocking Trump through memes and X posts.\"At this stage in the cycle, it's all about getting yourself known, both personally and by what you stand for. AOC is well known but currently her left-leaning makes her less attractive to center-right voters who could be wooed away from Trump. Resolutely branding himself as centrist, Newsom could reach the parts of the electorate never open to AOC. He's flying his kite high at the moment and all the signs are this will lead to a serious run in 2028.\"In June 2025, Newsom told the Wall Street Journal: \"I'm not thinking about running, but it's a path that I could see unfold.\"In April, AOC told a Fox News Digital reporter: \"Frankly, what people should be most concerned about is the fact that Republicans are trying to cut Medicaid right now and people's healthcare. It's a danger and that's really what my central focus is.\"What Happens NextWhether or not Newsom and AOC run remains to be seen. Candidates don't tend to announce presidential runs until after the midterm elections which, in this cycle, are slated for November 2026.Meanwhile, a number of other high-profile Democrats are rumored to be considering a presidential run, including Arizona Senator Ruben Gallego, New Jersey Senator Cory Booker and Michigan Governor Gretchen Whitmer.","summary":"New betting odds show the California governor's chances of beating the New York representative are increasing.","url":"https://www.newsweek.com/gavin-newsom-2028-president-emocratic-nomination-aoc-2114845","image":"https://d.newsweek.com/en/full/2704272/gavin-newsom.jpg?w=1600&h=900&q=88&f=3270d30cda227a0abcee6e10cb5b98ac","video":null,"publish_date":"2025-08-18 11:04:25","author":"Kate Plummer","authors":["Kate Plummer"],"language":"en","source_country":"US","sentiment":0.41},{"id":352078262,"title":"SCOOP: Stacy Garrity launches Republican campaign for Pennsylvania governor","text":"FIRST ON FOX: Pennsylvania State Treasurer Stacy Garrity announced her Republican campaign for governor Monday, teeing up what could be a competitive race against incumbent Democratic Gov. Josh Shapiro in 2026. Speaking exclusively with Fox News Digital ahead of her campaign launch, the Republican candidate said she is challenging Shapiro in next year's gubernatorial election because he \"has failed the state,\" on critical issues, including energy production, education and job creation. She said the state's vast oil and gas resources are the keys to its economy. \"I have a much different vision for the Commonwealth,\" Garrity, 61, said in a phone interview before announcing her campaign for governor. \"We really need to take advantage of what we have right under our feet, which would create a lot of financial breathing room for the Commonwealth that we desperately need.\" Garrity said her position on energy puts her right in step with President Donald Trump and Sen. Dave McCormick, who both called for unleashing American energy in battleground Pennsylvania during the 2024 presidential election. 2028 HOPEFUL CHALLENGES TRUMP'S JUVENILE SURGERY BAN WHILE OPPOSING WOMEN'S SPORTS BILL RESTRICTIONS \"We have so much natural gas under our feet,\" Garrity said, calling the energy \"billions of dollars in economic opportunity.\" DEMOCRAT MIKIE SHERRILL WINS NJ GUBERNATORIAL PRIMARY, SETTING UP SHOWDOWN WITH TRUMP-BACKED GOP WINNER Pennsylvania, a reliable swing state, experienced a red wave in 2024, as Trump won at the top of the ticket and McCormick unseated former longtime Sen. Bob Casey, D-Pa., on the Senate line. Garrity said Pennsylvania voters delivered a message loud and clear last year. Pennsylvanians want \"more money in our pockets\" and less of the \"government's hands in our pockets,\" the treasurer, who said she travels to all 67 counties in the Commonwealth each year, said. Keystone State residents also want school choice, safe communities and no \"boys competing against girls in sports,\" Garrity said. The Republican hopeful took aim at Shapiro's policies on school choice, arguing that \"he might be able to play political games with education, but our kids certainly can't.\" Shapiro recently told reporters that the Commonwealth doesn't need \"extremist politicians\" trying to legislate student participation in sports, in reference to a recent bill in the Pennsylvania legislature that would prevent transgender athletes from playing in women's sports, according to WITF. \"He's with radical liberals that are pushing a political agenda,\" Garrity said, before adding, \"As far as I'm concerned, that's not fairness, and it's not leadership. It's really, in my opinion, a betrayal of common sense and the integrity of women's athletics.\" Garrity also criticized Shapiro for what she described as flip-flopping on school choice and \"fail[ing] the state\" in delivering a state budget. Shapiro, who presides over a politically divided state legislature, missed the Commonwealth's deadline to pass its budget this year. The Democratic governor captured national attention last year when he was short-listed as a potential running mate for former Vice President Kamala Harris, after former President Joe Biden suspended his re-election campaign. \"I'm not as well polished as Josh Shapiro,\" Garrity admitted to Fox News Digital. \"I'm definitely not as good of a politician as Josh Shapiro, and he's a prolific fundraiser. This is going to be a tough race.\" But despite Shapiro's potential advantage as an incumbent governor with national recognition, Garrity said, \"I am a really tough worker.\" Garrity touted that in her first race for state treasurer, she managed to upset a popular incumbent, and \"then the second time around, I got more votes for this election than any statewide candidate in Pennsylvania's history, including Josh Shapiro.\" \"I have been an underdog my whole life, in the army and in business and in politics, and that's why I've been able to succeed when the odds are stacked against me,\" Garrity said. \"State treasurer is my first role in public office, but not my first in public service,\" the Republican hopeful said. \"I did spend 30 years in the Army Reserves. I was deployed three times to the Middle East.\" Garrity also served in the private sector, at Global Tungsten & Powders, where she worked her way up to becoming one of two female vice presidents. Now, as state treasurer, Garrity said, \"Every day that I get to wake up and serve hardworking Pennsylvanians is truly a blessing.\" Garrity has been teasing her gubernatorial run for months. Fellow Trump-ally Rep. Dan Meuser, R-Pa., was considered a potential Republican candidate as well. CLICK HERE TO GET THE FOX NEWS APP His announcement last month that he would not run for Pennsylvania governor cleared a path for Garrity's announcement on Monday morning. Pennsylvania's gubernatorial primary is set for May 19, 2026, and the midterm election is slated for Nov. 3, 2026.","summary":"Army veteran and state treasurer Stacy Garrity entered a likely competitive Pennsylvania governor race against popular incumbent Josh Shapiro.","url":"https://www.foxnews.com/politics/scoop-stacy-garrity-launches-republican-campaign-pennsylvania-governor","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/stacy-garrity.png","video":"https://www.foxnews.com/video/6373802762112","publish_date":"2025-08-18 11:00:58","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","category":"politics","source_country":"US","sentiment":-0.07},{"id":352069280,"title":"Conan O'Brien foresees the end of late-night TV, predicts bold prediction on Stephen Colbert's future","text":"Conan O'Brien said late night television is dying but made bold predictions about \"The Late Show\" host Stephen Colbert’s future during an award acceptance speech Saturday. O'Brien, known for his \"Late Night\" and \"Tonight Show\" hosting stints on NBC from 1993 to 2010, also hosted the TBS talk show \"Conan,\" which aired for nearly eleven years. He made the remarks during his induction into the Television Academy Hall of Fame on Saturday. \"Yes, late-night television, as we have known it since around 1950, is going to disappear. But those voices are not going anywhere. People like Stephen Colbert are too talented and too essential to go away,\" O'Brien said. \"Stephen is going to evolve and shine brighter than ever in a new format that he controls completely.\" Colbert took over \"The Late Show\" on CBS from former host David Letterman in 2015, but the gig has an expiration date. CBS announced that \"The Late Show\" will be canceled effective May 2026 with no replacement host being selected for the program. Many supporters of Colbert have claimed his show was canceled because he was a frequent critic of President Donald Trump and parent company Paramount was trying to curry favor with the Trump administration in order to get approval for a company merger. WASHINGTON POST, NY TIMES COLUMNS INSIST COLBERT CANCELATION IS DUE TO OBSOLETE FORMAT, NOT POLITICS Trump sued Paramount, claiming that CBS’s \"60 Minutes\" engaged in election interference by deceptively editing an interview with then–Vice President Kamala Harris during the 2024 presidential election. Paramount settled with Trump, which led to Colbert joking that the $16 million settlement Paramount paid to the former president was a \"big fat bribe.\" \"I believe that this kind of complicated financial settlement with a sitting government official has a technical name in legal circles, it’s ‘big fat bribe.’\" Colbert joked. However, CBS execs denied that Colbert was canceled for his politics, and instead pointed to the financial losses the show was incurring. \"The Late Show\" reportedly cost network $40 million a year as audiences flee traditional television in favor of streaming. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE O'Brien, a former writer for \"Saturday Night Live\" and \"The Simpsons,\" waxed philosophical about the future of television during his speech. He struck an optimistic tone that television would endure no matter how new technologies roil the industry, so long as creators are \"brave and of goodwill.\" \"Technology can do whatever they want. It can make television a pill. It can make television shows a high-protein, chewable, vanilla-flavored capsule with added fiber. It still won’t matter, if the stories are good, if the performances are honest and inspired, if the people making it are brave and of goodwill,\" he said. CLICK HERE TO GET THE FOX NEWS APP","summary":"Television Academy Hall of Fame honoree Conan O&apos;Brien discusses the future of late night TV and praised Stephen Colbert following CBS Late Show cancellation news","url":"https://www.foxnews.com/media/conan-obrien-foresees-end-late-night-tv-predicts-bold-prediction-stephen-colberts-future","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/colbert-conan-split.jpg","video":"https://www.foxnews.com/video/6376286015112","publish_date":"2025-08-18 11:00:05","author":"David Spector","authors":["David Spector"],"language":"en","source_country":"us","sentiment":0.127},{"id":352069468,"title":"Obama stays in political fray as Democrats look for new leader","text":"After making the rounds last fall in support of then-Democratic presidential nominee Kamala Harris, Obama, who has kept a residence in Washington, D.C., is again upping his involvement despite leaving office in January 2017.\n\nFor Democrats concerned about what the future holds both for their party and for the nation after their staggering 2024 losses, Obama’s presence can be reassuring.\n\n“I think Barack Obama is still a good spokesperson for the party,” Democratic strategist Brad Bannon said. “Obama is very popular, and I’m always glad to see him enter the political fray.”\n\nBannon points to Gallup polling that found Obama was the most popular living president with a 59% favorability rating, with his Vice President and successor Joe Biden the lowest at 39%.\n\nBut Obama’s ability to uplift his party in the era of President Donald Trump remains in doubt. He, of course, cannot run for office again, and his party is floundering as it seeks a new leader to rally behind.\n\n“A wise old philosopher once said that the simple answer is usually the correct one,” presidential historian Craig Shirley said. “This is about his ego.”\n\nObama, still just 64 years old, wants to be talked about, Shirley added, and fears being surpassed in relevance by younger politicians. Meanwhile, the Democratic Party has reached historic lows in popularity, with just 29% approving in a recent CNN poll.\n\nObama’s re-entry into the political discussion hasn’t always been voluntary. Trump was delighted when Director of National Intelligence Tulsi Gabard declassified emails from the Russia collusion investigation that began when Obama was still in office.\n\nA declassified statement released earlier this month from a senior United States intelligence official-turned-whistleblower said that Obama officials had pressured him to support flawed conclusions that Russia interfered in the 2016 election. The intelligence community assessment in question came during the final days of Obama’s second term.\n\n“There is irrefutable evidence that details how President Barack Obama and his national security team directed the creation of an intelligence community assessment that they knew that was false,” Gabbard claimed. “The evidence that we have found and that we have released directly points to President Obama leading the manufacturing of this intelligence assessment. There are multiple pieces of evidence and intelligence that confirm that fact.”\n\nTrump even shared an artificial intelligence video of Obama being arrested in the Oval Office.\n\nBut Obama has been more than happy to turn the lights back on himself as well.\n\nThe details of his call with Mamdani are short, but it was widely seen as a signal to other Democrats that it’s okay to associate with him despite his views that some see as far Left or even Marxist.\n\nWhile speaking to Texas Democrats about redistricting, Obama told them their actions were made necessary by Trump’s moves in Texas, Ohio, and elsewhere to gain an advantage through new maps.\n\n“We can’t let a systematic assault on democracy just happen and stand by, and so because of your actions, because of your courage, what you’ve seen is California responding, other states looking at what they can do to offset this mid-decade gerrymandering,” Obama said, according to CNN.\n\n“My hope is that rather than have a race to the bottom where every district is predetermined based on how it’s drawn, that over time, the American people, ideally with the help of the courts, realize that there’s a better way,” Obama added.\n\nTRUMP’S TAKEOVER OF BLUE DC MET WITH PRAISE AND RAGE BY FED-UP RESIDENTS\n\nShirley, the presidential historian, argues that Obama would be better off following the lead of other recent ex-presidents who moved to rural areas far removed from the capital. Ronald Reagan retired to his ranch in California, George W. Bush retreated to his ranch in Texas, and Jimmy Carter spent his long post-presidency in the hinterlands of Plains, Georgia.\n\n“Obama can’t get away from politics,” Shirley said. “When Reagan left, he went back to California and started a new life. That was the last entry in his diary, ‘I’m back in California, starting a new life.’ He put the White House behind him.”\n\nAs a symbol of pre-Trump politics, Shirley added that Obama would not be the one to lead the Democratic Party into the future.\n\nBut Bannon countered that Obama still has a meaningful role, which is part of why he remains so popular among the electorate.\n\n“Obamacare was a dramatic innovation in the way that the government delivers healthcare services,” Bannon said. “Democrats should carry that forward, talking about how they can continue to innovate in the healthcare policy space to improve the lives of voters.”","summary":"Former President Barack Obama refuses to leave the political spotlight, even though his last election was more than a dozen years ago, and Democrats are trying to find a new leader to rally behind. Obama has been seen as of late speaking to Texas House Democrats about the redistricting battle, sharing a phone call with [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3501189/obama-stays-political-fray-democrats-look-new-leader/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/12/obama-obama-foundation-chicago-scaled.webp?w=696","video":null,"publish_date":"2025-08-18 10:00:00","author":"Haisten Willis","authors":["Haisten Willis"],"language":"en","category":"politics","source_country":"US","sentiment":0.108},{"id":352032486,"title":"Pop culture and politics are intertwined in the age of Trump. Just look at the Paramount-Skydance merger","text":"What’s unusual, perhaps, is the degree to which the two worlds have become intertwined. It helps that Trump comes from that world, having spent several years in reality TV and most of his adult life as a media celebrity. Along with installing himself as chairman of the Kennedy Center, President Trump personally picked this year’s list of honorees, which includes Kiss and Sylvester Stallone, and will host what he promises to be an ‘anti-woke’ ceremony.\n\nFew CEOs are more attuned to the political winds in Hollywood right now than David Ellison, the new CEO of Paramount following Skydance Media’s merger with Paramount Global earlier this month. To get the deal done, Skydance agreed to “address bias and restore fact-based reporting,” according to FCC Commissioner Brendan Carr, and appoint an ombudsman to address any concerns about bias. Paramount had also reached a $16 million settlement with Trump over a “60 Minutes” interview with Kamala Harris prior to the deal getting done. \n\nIn one of his first moves as head of the combined Paramount, Ellison last week announced a $7.7 billion agreement to air Ultimate Fighting Championship events over the next seven years. That’s no doubt a smart business decision and certainly not lost on Ellison that UFC is a Trump-friendly form of entertainment, as well as a “global sports powerhouse.” UFC CEO Dana White said Ellison negotiated an “all-or-nothing” deal. White is close to Trump, who recently said he’d love to stage a UFC match on the White House lawn. (White also recently joined Meta’s board, too.)\n\nEllison, meanwhile, also struck a multi-year partnership with Taylor Sheridan, the creative mind behind “Yellowstone” and various spinoffs that are popular with conservative audiences. \n\nTo grow beyond the $30+ billion it made last year, Paramount will need to appeal to a wide and varied demographic. While its cancellation of “The Late Show with Stephen Colbert” sparked accusations of pro-Trump bias, Paramount’s recent $1.5 billion streaming deal with “South Park” creators Trey Parker and Matt Stone suggests that Ellison understands the power of polarizing entertainment on both sides of the house.\n\nMore news below.Contact CEO Daily via Diane Brady at diane.brady@fortune.com\n\nZelenskyy goes to DC…\n\nUkraine President Volodymyr Zelenskyy is in Washington DC today, joined by European leaders including European Commission head Ursula von der Leyen. The meeting follows an inconclusive meeting between U.S. President Donald Trump and Russia President Vladimir Putin in Alaska on Friday. On social media, Trump ruled out Ukraine joining NATO, or getting back Crimea, which Russia annexed in 2014.\n\n…and China's top diplomat goes to Delhi\n\nChinese Foreign Minister Wang Yi is in India for a trip aimed at repairing a relationship that’s been cool since deadly border clashes in 2020. The dispute has hurt trade and investment between the two Asian economic powers. Both countries also face steep U.S. tariffs: Trump’s decision to slap 50% tariffs on India now threatens a broader strategy to make the South Asian country an alternative to China. \n\nIgniteTech’s AI-induced layoffs\n\nSoftware developer IgniteTech laid off nearly 80% of its employees within a year to make way for generative AI. CEO Eric Vaughan tells Fortune that he’d do it again: “It was extremely difficult … But changing minds was harder than adding skills.”\n\nPowell to speak on Friday\n\nFed Chairman Jerome Powell will give an indication of whether rate cuts will resume next month in a speech on Friday. Some analysts think Powell will keep his cards close to his chest—and may not cut rates in September at all, despite Wall Street hopes of easing. \n\nCan OpenAI stay in front?\n\nOpenAI’s industry-leading position could be vulnerable, thanks to an underwhelming release of GPT-5 and new open-source challengers like China’s DeepSeek. Fortune’s Geoff Colvin investigates how strong the company’s competitive “moat” really is.\n\nThe markets\n\nS&P 500 futures are down by 0.1% before market open, following a 0.3% drop by the index on Friday. Japan’s Nikkei 225 is up 0.8%, briefly hitting a record high. The Shanghai Composite rose 0.9%, briefly surpassing a 10-year high. Hong Kong’s benchmark Hang Seng Index fell 0.4%. The South Korea KOSPI is down 1.5%. The STOXX Europe 600 is down 0.1% in early trading, Bitcoin is down 2.5% to fall below $116,000.\n\nAround the watercooler\n\nTrump says tariffs are going to be enough to pay down national debt. It likely won’t even touch the sides by Eleanor Pringle\n\nA millennial couple grew their side hustle into a business bringing in $4.5 million a year—here’s how the cofounder would start it again, with nothing by Jessica Coacci\n\nTrump could trigger a financial crisis in Russia — if he wants to — but has backed off from his threat of ‘very severe consequences’ by Jason Ma \n\nNvidia and AMD’s ‘special treatment’ from Trump is shaking up an already tangled global chip supply chain by Nicholas Gordon\n\nMeta spends more guarding Mark Zuckerberg than Apple, Nvidia, Microsoft, Amazon, and Alphabet do for their own CEOs—combined by Dave Smith\n\nThis edition of CEO Daily was compiled and edited by Joey Abrams and Nicholas Gordon.","summary":"Also: All the news and watercooler chat from Fortune.","url":"https://fortune.com/2025/08/18/paramount-skydance-merger-pop-culture-politics-trump/","image":"https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2215458421-e1755497725540.jpg","video":null,"publish_date":"2025-08-18 09:19:52","author":"Diane Brady","authors":["Diane Brady"],"language":"en","source_country":"us","sentiment":0.471},{"id":352007722,"title":"Martina Navratilova amused as Donald Trump's inadvertent praise for Kamala Harris & Gavin Newsom resurfaces amid feud with California governor","text":"Tennis legend Martina Navratilova reacted to a meme drawing attention to US President Donald Trump's comments from last year about San Francisco. Before the presidential elections last fall, in August 2024, Trump inadvertently praised California Governor Gavin Newsom and the Democratic Party's presidential nominee Kamala Harris, while hailing the city.While visiting the Golden City, Trump said San Francisco was great 15 years ago. However, at the time, Harris was San Francisco’s district attorney while Newsom was the mayor. Seeing this, Navratilova couldn't help but laugh off Trump's comment.\"lol,\" she reacted.Donald Trump was constant in his verbiage, accusing Harris of destroying San Francisco. During his speech at the nation’s southern border in Cochise County, Arizona, last year, he said:“She destroyed San Francisco, absolutely destroyed it. She destroyed California. You can’t go into California. You can’t go into San Francisco. It’s not livable. Fifteen years ago, it was the best city in the country, one of the best cities in the world, and now you can’t do anything.”Kamala Harris was one of the top prosecutors during that time. She advanced to the position of California’s attorney general in 2011.Martina Navratilova has spoken out against Donald Trump’s actions in the pastLast year in December, Donald Trump was reelected for a second term in the Oval Office. However, his actions since have continuously sparked intense debates among netizens. Among them is Martina Navratilova, who has always candidly shared her political views.The former tennis player previously condemned Trump after the president reinstated the Presidential Fitness Test and appointed Lawrence Taylor, a registered sex offender, to the President’s Council on Sports, Fitness, and Nutrition.\"Nothing like hiring a sex offender and a former drug abuser for this particular job….\" Navratilova wrote on X (formerly Twitter).Moreover, the 18-time Grand Slam winner has also opposed Trump's decision to deploy 800 National Guard troops to battle the rise of violent crimes in Washington. She wrote:\"He would love nothing more than an excuse to open fire on protesters.\"Most recently, after a summit between Russian President Vladimir Putin and Donald Trump in Alaska, where no peace agreement was reached on Ukraine, Navratilova commented on the US President's body language. The 68-year-old wrote:\"The body language of a beaten man…\"Moreover, Martina Navratilova has also expressed outrage over Trump's alleged connection with known child sex offender Jeffrey Epstein.","summary":"Tennis legend Martina Navratilova reacted to a meme drawing attention to US President Donald Trump's comments from last year about San Francisco.","url":"https://www.sportskeeda.com/tennis/news-martina-navratilova-amused-donald-trump-s-inadvertent-praise-kamala-harris-gavin-newsom-resurfaces-amid-feud-california-governor","image":"https://staticg.sportskeeda.com/editor/2025/08/01cdd-17554991220375-1920.jpg","video":null,"publish_date":"2025-08-18 08:05:48","author":"Krutik Jain","authors":["Krutik Jain"],"language":"en","category":"politics","source_country":"in","sentiment":0.288},{"id":351956140,"title":"TV star, 50, wows in G-string bikini","text":"The Desperate Housewives star, 50, showed off her impressive figure in a black string bikini in the beachside city of Marbella, in Spain.\n\nLooking as youthful as when she first shot to fame in her late twenties, Longoria was seen enjoying a low-key beach day with her family.\n\nUnlike the likes of Leonardo DiCaprio, Dua Lipa and Chris Hemsworth, who’ve all been spotted across Spain over the past few days, Longoria resides in Marbella with her family.\n\nIt was revealed last year Longoria and her husband José Bastón and their six-year-old son Santiago had relocated from California to Spain, and have been splitting their time between homes they own in both Marbella and Mexico.\n\nOf her decision to leave Los Angeles, Longoria made controversial comments to Marie Claire in November describing America as a “dystopian country”.\n\nThe interview came after the TV star dedicated much of her time to campaigning for Kamala Harris before Donald Trump was ultimately elected for a second term.\n\n“I had my whole adult life here [in LA]. But even before [the pandemic], it was changing. The vibe was different. And then Covid happened, and it pushed it over the edge,” Longoria told the magazine.\n\n“Whether it’s the homelessness or the taxes, not that I want to s**t on California — it just feels like this chapter in my life is done now.”\n\n“I’m privileged,” she continued. “I get to escape and go somewhere. Most Americans aren’t so lucky.”\n\n“They’re going to be stuck in this dystopian country, and my anxiety and sadness is for them.”\n\nLongoria later clarified her comments, saying on The View: Behind the Table podcast she had been predominantly living in Europe for the previous three years.\n\n“By the way, the [Marie Claire] article says that. People just grabbed some clickbait stuff to be divisive, which makes me so sad,” she said.\n\n“Everything you say is just meant to be divisive when we can’t be that way right now.”","summary":"The ageless Desperate Housewives star has stunned beachgoers in a tiny black bikini in Spain, joining the long list of celebs chasing the sun in Europe.","url":"https://www.news.com.au/entertainment/celebrity-life/celebrity-photos/eva-longoria-spotted-wearing-black-gstring-bikini-in-spain/news-story/d74171dd019df96d7d68c120f6413364?from=rss-basic","image":"https://content.api.news/v3/images/bin/51ca88afea5d81a0d8905d5529baafc5","video":null,"publish_date":"2025-08-18 04:33:59","author":"Less Than 2 Min Read August 18, 2025 - 2:33pm | Copy Link Share Via Email Share On X Share On Facebo","authors":["Less Than 2 Min Read August 18, 2025 - 2:33pm | Copy Link Share Via Email Share On X Share On Facebo"],"language":"en","source_country":"au","sentiment":-0.075},{"id":351921038,"title":"BRIG. GEN. JOHN TEICHERT: Accountability For America’s Afghanistan Catastrophe","text":"August marks the solemn four-year anniversary of the American failure in its tragic withdrawal from Afghanistan under President Joe Biden. On Aug. 15, 2021, the Afghan capital of Kabul fell into the hands of Taliban control. On Aug. 26,, thirteen military members disastrously lost their lives at Abbey Gate; and by the end of the month, the last American soldier ingloriously stepped onto a C-17 to complete the U.S. withdrawal. It was the low point in American power and prowess in my adult lifetime, providing images that have been seared into the American consciousness like the withdrawal from Vietnam had been two generations prior.\n\nThe situation in August of 2021 in Afghanistan was the biggest operational failure of the United States in decades. It provided striking images of incompetence that emboldened adversaries and embarrassed allies. It set off a chain of events that can be directly tied to Russia’s reckless invasion of Ukraine in February 2022 and Hamas’s unthinkable terrorist surge into Israel in October of 2023. With American weakness on full display, adversaries around the world were enticed to fill the void.\n\nPresident Donald Trump and Secretary Pete Hegseth have been unequivocal in their calls for complete accountability. Their staffs have echoed these same commitments to the American people. Several months later, Americans eagerly await results, and the anniversary offers the ideal time for the Administration to unveil its findings and to finally close this gut-wrenching chapter in American history. (RELATED: Three States To Send National Guard Troops To DC) \n\nThe voters have already held President Biden and the Vice President Kamala Harris accountable at the ballot box, with the results of the 2024 election being informed by this tragic geopolitical misstep. America’s confidence in their lackluster leadership rightfully never recovered from this self-inflicted wound.\n\nSimilarly, two senior military leaders with unique influence on the withdrawal – Chairman of the Joint Chiefs of Staff General Mike Milley and U.S. Central Command Commander General Frank McKenzie – have since retired. Their absence from the force is almost enough to put this operational blunder behind us.\n\nYet, there remain a slew of senior leaders with complicity in the Afghan withdrawal who were a part of the insular senior staff of U.S. Central Command (CENTCOM) at the time. Accountability remains undone until the American public learns of their fate from the Trump Administration.\n\nThere are two primary elements of the Afghan withdrawal that warrant robust questioning – the strategic decision to withdraw and the operational decision about how to withdrawal. From my position in Iraq as our nation’s Senior Defense Official during that time, it was clear that U.S. Central Command ruled both decisions with an iron fist, with little room for discussion, dissent, or even boots-on-the-ground perspective from those stationed in Afghanistan or elsewhere in the region. And while the buck stops with the President, the strategic recommendations and operational planning from U.S. CENTCOM were pivotal in the final determination for the withdrawal and its details.\n\nU.S. CENTCOM includes a robust staff, with general officers responsible for operations, strategy, planning, policy, and security cooperation functions. They are charged with providing the best military advice to the President and the Secretary of Defense and are considered the unquestioned strategic and operational experts in their area of responsibility. In their role in this situation, these high-ranking officers stunningly and irredeemably failed their predecessors, the military community, and the American people. They also tragically sent a shameful signal to those who had sacrificed, bled, and died in Afghanistan that their service was in vain.\n\nThe U.S. population would be horrified to know that key leaders from U.S. CENTCOM from that time have been promoted and are serving in positions with even greater authority today. This is in spite of their substandard performance during the Afghanistan withdrawal that indicated that they had already been promoted beyond their maximum levels of competence and discernment. And unlike Biden, Harris, Milley and McKenzie, their continued service flies in the face of President Trump’s clear direction to remove them from our force. Until that happens, the anniversary of the U.S. withdrawal from Afghanistan brings further shame to all of us while allowing the same military leaders to run a national security establishment that needs them immediately removed for our nation’s well-being!\n\nUnited States Air Force Brig. Gen. John Teichert (ret) is a leading expert on foreign affairs and military strategy. He served as commander of Joint Base Andrews and Edwards Air Force Base, was the U.S. senior defense official to Iraq, and recently retired as the assistant deputy undersecretary of the Air Force for international affairs. A prolific author and speaker, he can be followed at johnteichert.com and on LinkedIn.\n\n The views and opinions expressed in this commentary are those of the author and do not reflect the official position of the Daily Caller News Foundation.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"BRIG. GEN. JOHN TEICHERT: Accountability For America’s Afghanistan Catastrophe","url":"https://dailycaller.com/2025/08/17/opinion-accountability-for-americas-afghanistan-catastrophe-brig-gen-john-teichert/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/06/GettyImages-1234780587-scaled.jpg","video":null,"publish_date":"2025-08-17 21:35:58","author":"John Teichert","authors":["John Teichert"],"language":"en","category":"politics","source_country":"US","sentiment":0.094},{"id":351911662,"title":"Democrat ex-FBI director admits he learned unlikely wisdom from popstar to deal with Trump","text":"Former FBI Director James Comey has tried his best to stay culturally relevant, chiming in Sunday with his take on some viral advice from a pop-culture icon.\n\nIn a video post made on his Substack Sunday, Comey shared that he listens to Swift's music and tries to emulate her softer approach to dealing with President Donald Trump.\n\n'While our elderly makeup-covered president is posting about whether Taylor Swift is still hot and declaring that he can't stand her, what's she doing?' Comey asked.\n\n'Living her best life, producing great music and as she urged all of us to do during the podcast, not giving the jerks power over her mind,' Comey said, referring to the pop icon's recent appearance on the 'New Heights' podcast hosted by her NFL star boyfriend Travis Kelce and his brother Jason Kelce. \n\nTrump's most recent attack on Swift came earlier this month when he pitted the pop star against actress Sydney Sweeney, claiming that Swift was 'No Longer Hot' after she endorsed his 2024 Presidential rival Kamala Harris last year. \n\n'She said something about dealing with internet trolls that stuck with me - think of your energy as if it's expensive,' Comey added in his Sunday video.\n\nComey is currently under investigation for implying President Donald Trump 'should be assassinated.'\n\nHe uploaded a cryptic picture on his Instagram account back in May which featured an assortment of shells arranged to spell out: '86 47.'\n\nThat specific combination of numbers has been linked to the assassination of Trump and a 'quiet resistance.'\n\nThe number 86 is considered slang for 'to kill or murder' within some circles, in an apparent reference to a standard sized grave being eight feet long and six feet deep.\n\nTrump is the 47th president, so some anti-Trump groups use the two numbers together to indicate that Trump should be assassinated.\n\nThe former FBI Director's daughter, Maureen Comey, was fired from her post as a prosecutor in the Manhattan US attorney's office last month, a move that was announced by Trump's Attorney General Pam Bondi. \n\nThe former FBI chief channeled Swift in his Sunday video, after the singer noted during her appearance on the New Heights podcast last week to 'think of your energy as if it's expensive, as if it's a luxury item.'\n\n'Not everyone can afford it. Not everyone has invested in you in order to be able for you have the capital to care about this,' the 'Bad-Blood' singer added.\n\nBrittney Mahomes, wife of Kelce's Kansas City Chiefs teammate Patrick Mahomes, was one celebrity who reposted the clip of Swift's advice on Friday morning and wrote, with three applauding emojis: 'That. Is. The. Day.'\n\nThe star WAG duo's at times rocky friendship appears stronger than ever after the singer's podcast appearance.\n\nThis time last year, the brand new besties appeared to suddenly be at odds after Mahomes endorsed Donald Trump in the upcoming election while Swift, who has a long-running feud with Trump, backed Harris.\n\nSwift also announced her new album on the podcast, with her 12th record 'The Life of a Showgirl' to be released October 3.\n\nThree-time Super Bowl winner Patrick revealed Wednesday he had an early heads-up that Swift was finally appearing on the show, telling reporters at practice: I knew before y'all did just because they called me after the podcast was done.'\n\nHe jokingly corrected himself, adding: 'They didn't call me, they called Brittany. I was in the back of the FaceTime.'\n\nSoon enough, Mahomes and Swift will be reunited at Arrowhead Stadium once the Kansas City Chiefs start the new NFL season.","summary":"Former FBI Director James Comey has tried his best to stay culturally relevant, chiming in Sunday with his take on some viral advice from a pop-culture icon.","url":"https://www.dailymail.co.uk/news/article-15008841/Democrat-ex-FBI-director-admits-learned-unlikely-wisdom-popstar-deal-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/08/17/22/101304463-0-image-m-28_1755464438164.jpg","video":null,"publish_date":"2025-08-17 21:19:11","author":"Editor,Victoria Churchill","authors":["Editor","Victoria Churchill"],"language":"en","source_country":"gb","sentiment":0.091},{"id":351929260,"title":"How Taylor Swift’s star power keeps growing despite Trump’s bad blood","text":"Taylor Swift has been on the road—and the political stage—longer than many presidential candidates. Her 21-month-long “Eras Tour” took to 21 counties and over 50 cities, drawing stadiums full of die-hard fans. Earlier this year, she reminded everyone of her reach with a brief but buzzy appearance on the Super Bowl jumbotron.\n\nNot everyone’s impressed, though. President Donald Trump has emerged as one of her most vocal critics, declaring in both May and August that Swift is “no longer hot.” His grudge isn’t random—Swift famously endorsed Democratic presidential candidate Kamala Harris in 2024, directly opposing Trump.\n\nTrue to form, he seems unable—or unwilling—to shake it off.\n\nBut Trump’s jabs don’t seem to be hurting her. A new Navigator Research poll, conducted Aug. 7-11, finds that 50% of registered voters view Swift favorably, while 36% view her unfavorably.\n\n“Donald Trump’s Truth Social attacks on Taylor Swift aren’t working, and the data proves it,” said Erica Seifert, senior director of Navigator Research. “As we have known all too well, the majority of Americans view her favorably. It’s not a fearless move to go after Swift; it’s another attempt by a failed leader to take attention away from his big, bad reputation.”\n\nHer politics have deepened partisan fault lines, though. Among Democrats, her net favorability is +49 points, and among independents, it’s +8 points. Among Republicans, however, she’s now at -22 points—a sharp drop from August 2023, when she was at +15 points. That decline accelerated after her Harris endorsement, especially among voters without a college degree.\n\nThe pessimistic view among Republicans isn’t surprising given Trump’s ongoing attacks. Last September, he blasted out an all-caps Truth Social post declaring his hatred for Swift, a message that set the tone for conservative media coverage and GOP voter sentiment.\n\nThis shift matches other polling. An NBC News survey conducted in September 2024, just days after Swift publicly endorsed Harris, found that about 47% of Republicans viewed her negatively—a sharp rise from 26% in November 2023. Positive views among Republicans fell from 28% to just 12% over the same period. Meanwhile, her favorability among Democrats increased from 53% to 58%.\n\nIt’s worth noting that not everyone was paying attention. A YouGov poll conducted before Swift’s endorsement in August 2024 found that just over two-thirds of Americans (68%) were indifferent to her political nod, while only 8% said it would make them more likely to endorse her preferred candidate.\n\nSwift’s popularity goes beyond politics, though. In the past week, she revealed the title of her upcoming album, “The Life of a Showgirl,” as well as more details about the album on an enormously popular football podcast hosted by her boyfriend, Kansas City Chiefs tight end Travis Kelce.\n\nAs Swift prepares for a new era, her political and cultural influence shows no signs of waning. Whether on stage or in the political arena, she remains a powerful force capable of shaping public discourse—and, for better or worse, drawing the ire of the most powerful person in the country.","summary":"Taylor Swift has been on the road—and the political stage—longer than many presidential candidates. Her 21-month-long “Eras Tour” took to 21 counties and over 50 cities, drawing stadiums full of die-hard fans. Earlier this year, she reminded everyone of her reach with a brief but buzzy appearance on the Super Bowl jumbotron.\n\n\n\nNot everyone’s impressed, though. President Donald Trump has emerged as one of her most vocal critics, declaring in both May and August that Swift is “no longer hot.” His grudge isn’t random—Swift famously endorsed Democratic presidential candidate Kamala Harris in 2024, directly opposing Trump.\n\n\n\nTrue to form, he seems unable—or unwilling—to shake it off.\n\n\n\nBut Trump’s jabs don’t seem to be hurting her. A new Navigator Research poll, conducted Aug. 7-11, finds that 50% of registered voters view Swift favorably, while 36% view her unfavorably.\n\n\n\n“Donald Trump’s Truth Social attacks on Taylor Swift aren’t working, and the data proves it,” said Erica Seifert, senior director of Naviga","url":"https://www.dailykos.com/story/2025/8/17/2338272/-How-Taylor-Swift-s-star-power-keeps-growing-despite-Trump-s-bad-blood?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1258183/story_image/AP23347645089273.jpg?1703270614","video":null,"publish_date":"2025-08-17 21:00:08","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","source_country":"US","sentiment":-0.149},{"id":351908944,"title":"Trump Calls DC ‘City Of Violent Gangs’ As Three Republican-led States Sends National Guard To DC","text":"President Donald Trump has ordered reinforcements from three Republican-led states to bolster the National Guard presence in Washington, DC, even as city officials cite data showing crime levels at their lowest point in five years. West Virginia Governor Patrick Morrisey confirmed that 300–400 National Guard troops would be dispatched to the nation’s capital. South Carolina Governor Henry McMaster announced the deployment of 200 troops, while Ohio Governor Mike DeWine confirmed 150 military police officers would join the operation. These deployments add to the roughly 800 troops already stationed in the city. Trump declared a “public safety emergency” on Monday, saying Washington was suffering from “complete and total lawlessness” and was plagued by “violent gangs and bloodthirsty criminals.” Data Contradicts Trump’s Portrayal Metropolitan Police Department (MPD) statistics, however, contradict Trump’s claims. Homicides in Washington dropped by 32% between 2023 and 2024, reaching their lowest level since 2019. Preliminary figures show violent crime overall has declined by 26% so far in 2025 compared to the same period last year, while robberies have fallen 28%, according to MPD data cited by BBC Verify. Mayor Muriel Bowser rejected Trump’s assertions, noting that while crime spiked in 2023, it has since stabilised and fallen significantly. “The data speaks for itself,” she said. Residents Push Back The deployment has sparked anger among residents, with hundreds marching through the streets over the weekend to protest Trump’s policies. Demonstrators gathered in Dupont Circle before moving through the city, chanting “Free DC!” while others beat drums and rang bells. Many residents, 92% of whom voted for Vice President Kamala Harris in the 2024 election, have voiced frustration with the heavy federal presence. Social media videos show residents filming National Guard patrols and questioning the need for a military build-up. Legal and Political Dispute The Trump administration previously attempted to assume command of the city’s police force under the District of Columbia Home Rule Act but backed down after legal challenges. However, Judge Ana Reyes later ruled that Mayor Bowser must comply with White House directives. Critics argue that Trump’s depiction of Washington is politically motivated. “This is about optics, not reality,” one DC resident said at Saturday’s march. Meanwhile, federal officials maintain that the troop deployments are necessary to ensure public safety. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"President Donald Trump has described Washington, DC, as a city overrun by “violent gangs” and “lawlessness,” despite official data showing violent crime has fallen to a five-year low. At Trump’s request, West Virginia, South Carolina, and Ohio are sending National Guard units to join the 800 troops already deployed in the capital.","url":"https://www.timesnownews.com/world/us/us-news/trump-calls-dc-city-of-violent-gangs-as-three-republican-led-states-sends-national-guard-to-dc-article-152479967","image":"https://images.timesnownews.com/thumb/msid-152479993,thumbsize-116886,width-1280,height-720,resizemode-75/152479993.jpg","video":null,"publish_date":"2025-08-17 20:15:23","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.17},{"id":351906958,"title":"Ex-Washington Post fact checker hits ‘absentee owner’ Bezos, tells him to commit to saving paper or sell it","text":"The Washington Post is a sinking ship with a captain missing in action. And according to its now-former fact-checker, that missing captain is its billionaire owner, Jeff Bezos. \"He has to be committed to it. If he's not committed to it, he should find someone else to own it,\" Glenn Kessler told Fox News Digital. \"I feel like he was kind of committed to it. And then he's kind of an absentee owner, and he shouldn't be because it's, you know, one of the prime assets of American journalism.\" Kessler left the Post in July after more than 27 years at the paper — and his final years there were not the best. \"What's so saddening is that five years ago, I would not have imagined The Washington Post would be in this state,\" Kessler said. WASHINGTON POST'S EFFORTS TO COURT CONSERVATIVES COULD DRIVE AWAY ITS LIBERAL READERS, EX-FACT CHECKER WARNS Kessler never considered leaving the Post until he was presented with the buyout offer, which he accepted. The Post has been financially bleeding, so much so that it reportedly was on pace to lose at least $77 million in 2024. The buyouts had targeted the most veteran staffers, aiming to cut costs and ward off layoffs for the time being. The famed fact-checker was among several high-profile journalists and columnists who have left the paper in recent months, many of whom took issue with decisions and editorial changes Bezos himself had ordered. Kessler compared the Post to \"being on the Titanic after it struck an iceberg — drifting aimlessly as it sank, with not enough lifeboats for everyone\" in a piece he wrote on his newly-launched Substack account. \"They have to have a vision of where they want to go. And I've not seen that vision yet. Or if there is a vision, it's not been clearly articulated,\" Kessler said. \"It's gonna be a really rocky period in the news business in the next five to ten years. And the Post needs to be prepared for that. And I kind of feel like they've lost a lot of, you know, important sailors and captains to keep the ship going. So they're gonna have to make do with less.\" Before hitting the iceberg Bezos has been the target of intense blowback by liberals, who've accused him of bending the knee to President Donald Trump based on actions that have rocked the paper. First was his decision in October to halt the planned endorsement of then-Vice President Kamala Harris just days before the presidential election. Then, in February, he launched a new mission for the editorial pages to promote \"personal liberties and free markets,\" vowing to not publish any pieces that go against those principles. Both instances sparked rebellion among the paper's liberal readers, leading to the cancellation of hundreds of thousands of subscriptions. Several staffers also resigned in protest. But Kessler wasn't always a Bezos critic. He credited the Amazon founder for saving the Post when he bought it in 2013. \"Before Bezos bought the newspaper, it was in really bad shape,\" he told Fox News Digital. \"People forget how, you know, because the Graham family didn't really have the resources to keep it going in the new era. And there had been a bunch of buyouts and people were asked to leave. So it had been a pretty grim period then.\" WASHINGTON POST BOMBARDED WITH ‘CAKE’ PARTIES FOR DEPARTING STAFFERS Things at the Post were souring so much so that Kessler himself had been interviewing for a different job outside the paper. That was until he was offered The Fact Checker stint in 2011, which he accepted, thinking that if the ship went down, he himself could stay afloat with his own \"brand.\" \"But then Bezos bought the paper, and he invested a lot of money in the paper,\" Kessler said. \"So the size of the staff doubled. The number of foreign bureaus probably went up [by] at least a third. The resources devoted to engineering support surged, so the web pages started loading faster, and we could do fantastic graphics. There was investment in video… And you really felt like the Post was going places, and it was actually producing better journalism at any point in the time I had worked at the Post.\" \"And now it is just… it's like it hit an iceberg, and it's kind of drifting there, and I don't think there's a plan to rescue it. Or at least a plan to, you know, turn the ship around and get it moving in the direction it was.\" ‘The Avis Problem’ Kessler blamed management for being \"a little dazzled\" by the traffic spike that came during the first Trump administration, reaching levels \"almost equal\" to the Post's top rival, The New York Times. But then, unlike the Times, the Post failed to capitalize on its new readers by not expanding its portfolio. \"I've sat in many meetings and had many discussions and heard lots of speeches. I still have no idea what they're trying to do,\" Kessler said of his former bosses. \"It vaguely seems to say we're gonna appeal [to] the people… who don't really care about the news. And we're gonna provide products that would allow them to read The Washington Post and find out information they need to know,\" he said. \"And the problem, as I wrote in my piece, is that that's what The New York Times has been doing for ten years. They have 10 million subscribers, but a large chunk of that are people that don't get the core news product,\" Kessler continued. \"They get the recipes, they get The Athletic — the sports section, they get product recommendations, they get the games, they play Wordle.\" WASHINGTON POST REELING FROM BUYOUT EXODUS AS BOSSES HOPE TO TURN THE PAGE AT EMBATTLED PAPER He said the Post is stuck with \"the Avis problem,\" citing the car rental company's old ads that claimed \"We try harder,\" alluding to the reality it was always in the shadow of Hertz, a dynamic similar to the Gray Lady. \"The Washington Post has always been No. 2. It's never had the same size circulation as the Times. I would argue news coverage was better, but maybe I was biased about that,\" Kessler conceded to Fox News Digital. \"But now in this fragmented marketplace, people have to make a choice. What Substacks am I going to subscribe to? What newsletters am I gonna get? What networks am I going to watch? ‘Oh, I need one newspaper. I'll be willing to spend money on one newspaper,' and the default is always going to be, unfortunately, The New York Times.\" He continued, \"It's a broader product. It has better arts coverage, theater coverage. I've never gotten an understanding of how the Post was going to combat that problem. And it sounded like the solution was, 'Oh, we're going to be like a mini-me New York Times with things to appeal to people that don't follow news.' Well, they already get that in The New York Times.\" The Post has scrapped an initiative launched last year dubbed \"WP Ventures,\" meant to attract social media users. However, the paper appears to already be pivoting with Tuesday's announcement of former Axios executive editor and former Post reporter, Sara Kehaulani Goo, returning as its president of Creator Network — a new position Goo says will be \"creating personality-driven content\" and help provide advertisers \"access\" to a new audience driven by creators. The ‘meteorite’ wiping off the remaining dinosaurs The Times and the rise of new media weren't the only obstacles facing the Post. \"Midway through my journalism career, I started saying, 'I'm working for a dinosaur.' And AI is quite possibly the meteorite that will kill off the last of the dinosaurs,\" Kessler said to Fox News Digital. \"I'm greatly concerned about what AI is gonna do, because AI is gonna kill search. And search was how people often found our news articles.\" \"The statistics I had seen was that four or five years ago, every 100 searches on Google yielded six clicks on a news site. Now it's about every 100 searches yields two clicks on the news site. When people use AI, a thousand searches result in one click,\" he continued. \"So it's a dramatic difference. And if I were running a news organization, at this point, I don't know quite what I would do about that. So it's a bad time to be running a new organization. I do have sympathy for the situation that [Washington Post publisher and CEO] Will Lewis and [Washington Post executive editor] Matt Murray find themselves in right now. I just question whether or not they really have figured out what to do.\" Goo said in her announcement that \"we're going to be infusing AI with everything that we do to help us maximize efficiency and scale.\" But the buck ultimately stops with Bezos, according to Kessler. \"The Post was really at its high point [after Bezos' purchase]— the amount of stories we're producing, the quality of the stories was really significant. And then, traffic surged when Trump got elected and there was so much hunger and interest in the news we were producing. We kind of lost our way after that,\" Kessler said. \"And not only lost our way, we started losing oodles of money. A hundred million dollars one year, I think the last number I saw [in] 2023 was $77 million… I think even for a person as rich as Jeff Bezos, that counts as real money.\" \"And I have gotten the sense that he's a bit of an absentee owner. He's had other distractions, and he's committed more to some of his other enterprises, such as a space company, than he is to The Washington Post, which is really just a tiny part of his business investments. And maybe, I don't know, I hate to speculate, maybe you thought he gave us his best shot, and we blew it, and now we've got it muddled through,\" he added. A spokesperson for The Washington Post told Fox News Digital, \"The Washington Post is reinventing itself to be a trusted news source for all Americans. That means working hard each day to publish the most accurate news, alongside opinions that resonate across the nation.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"In an interview with Fox News Digital, former Washington Post fact checker Glenn Kessler called out Jeff Bezos and the paper&apos;s top management as he says the news outlet &quot;lost its way.&quot;","url":"https://www.foxnews.com/media/ex-washington-post-fact-checker-hits-absentee-owner-bezos-tells-him-commit-saving-paper-sell","image":"https://static.foxnews.com/foxnews.com/content/uploads/2023/10/bezos-washington-post.png","video":"https://www.foxnews.com/video/6376935375112","publish_date":"2025-08-17 20:00:19","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.282},{"id":351927664,"title":"Three Republican-led states to send National Guard troops to DC","text":"Agents from several federal law enforcement agencies have spent the week patrolling Washington's most populous and touristed areas alongside the National Guard troops.\n\nMany in Washington DC, where 92% of residents voted for Vice President Kamala Harris in the 2024 election, have expressed frustration with Trump's enforcement policy.\n\nResidents have taken to filming federal officers as they patrol and over the weekend, the frustration expanded into peaceful protests against the administration.\n\nMarchers congregated in Dupont Circle, a central hub in the city, and marched through the streets chanting \"Free DC!\" Some banged drums and rang bells as they marched.\n\nResidents in Washington, DC have expressed concerns about crime in surveys, and a former employee of the Trump administration's Department of Government Efficiency (Doge) was attacked and beaten in the city recently.\n\nTrump has painted a portrait of the nation's capital as beset by \"violent gangs and bloodthirsty criminals.\"\n\nBut Mayor Muriel Bowser has rejected Trump's claims about rampant crime in the city. She acknowledged there had been a spike in crime in 2023 that has since dropped off.\n\nMetropolitan Police Department (MPD) data shows homicides dropped by 32% between 2023 and 2024 and reached their lowest level since 2019.\n\nPreliminary data shows violent crime overall is down 26% so far in 2025, compared to the same point in 2024, according to MPD data. Robbery is down 28%, BBC Verify reports.\n\nThe Trump administration initially tried to take command of the city's Metropolitan Police Department using the District of Columbia Home Rule Act, but rescinded the order after city officials took them to court.\n\nHowever, Judge Ana Reyes said that Mayor Bowser was required to follow White House directives.","summary":"Washington residents have protested against Trump's deployment of troops in the city.","url":"https://www.bbc.com/news/articles/cvgv1pmypdyo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/d467/live/f0cd8730-7b8a-11f0-9835-7fcb9fda4fa6.jpg","video":null,"publish_date":"2025-08-17 18:12:56","author":"Kayla Epstein","authors":["Kayla Epstein"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.026},{"id":351903392,"title":"Minneapolis socialism is directing the Democratic Party","text":"Frey tried to do exactly that. He attended Floyd’s funeral and made sure to leave it with a photo of him sobbing while kneeling before Floyd’s coffin. He turned his focus to “institutional racism.” When Black Lives Matter rioters began burning down the city, which resulted in 1,500 businesses being damaged to the tune of $500 million, Frey claimed that out-of-state agitators were responsible. But records showed that most of those arrested were from Minnesota.\n\nFrey also refused to call for the abolition of the Minneapolis Police Department, which led to him being heckled outside his own home by a crowd of protesters, even as he promised reforms.\n\nFrey soon learned that his party feels the same way as those protesters. The Minnesota Democratic-Farmer-Labor Party, which is Minnesota’s Democratic Party, decided in July to hand out an endorsement in the Minneapolis mayoral race for the first time in 16 years. The endorsement was not for Frey, the twice-elected incumbent, but for Omar Fateh, who has served as a state senator since 2021.\n\nFateh supported the 2021 ballot measure to abolish the Minneapolis Police Department and replace it with a “Department of Public Safety.” Fateh is a self-professed socialist, endorsed by the Democratic Socialists of America. Fateh is touting his DSA credentials while also claiming he does not support the DSA position of abolishing the police (the same rhetorical walk back that Zohran Mamdani is going through in New York City).\n\nThat ballot measure failed in 2021 by a vote of 56%-44%. It is entirely possible that Fateh’s candidacy fails as well if voter sentiment is not where the Minnesota DFL is. But there is no denying that the Minnesota Democratic apparatus is backing the socialist, including the state party, five of the 13 city council members (including the council’s president and vice president), and several of Fateh’s colleagues in the state legislature. Even if voters don’t end up going in that direction, Minnesota and Minneapolis Democrats have made it clear that they are all in favor of a new socialist direction.\n\nThis story didn’t start with Jacob Frey, nor does it end with Omar Fateh. Robin Wonsley sits on the city council as an independent socialist, and multiple DFL members of the council have DSA ties. That includes Aisha Chugtai, who previously served as Rep. Ilhan Omar’s campaign manager.\n\nOmar is another key part of this Minneapolis socialist craze. She took office in 2019, and her congressional district includes parts of Minneapolis. She has become a close ally of the most prominent socialists in Congress, Sen. Bernie Sanders (I-VT) and Rep. Alexandria Ocasio-Cortez (D-NY). Sanders even campaigned for Omar in her primary race last year against a former Minneapolis City Councilman who nearly defeated her in 2022. With Sanders’s help, Omar cruised to a double-digit victory.\n\nOmar was the driving force behind the “defund the police” movement, and she supported eliminating the Minneapolis Police Department in the 2021 ballot measure. Omar represents every grotesque aspect of Minneapolis’s rising socialism, from the anti-police sentiment to the rampant antisemitism (which Fateh is also guilty of) to, of course, the actual socialist policies. In 2021, Omar pushed a bill that would funnel federal taxpayer dollars to localities to experiment with “universal basic income,” and then transition the country to a universal basic income program over the following decade.\n\nOmar is not just some backbench congresswoman, either. Since her election in 2018, Omar has become a quasi-celebrity, a member of a group of lawmakers given the silly nickname of “the Squad” by liberal media. Omar appeared on the cover of Time Magazine, Rolling Stone, and New York Magazine, the former two before she was even sworn into Congress, and the latter two featuring her alongside then Democratic House leader Nancy Pelosi. Omar was being propped up by Democrats as a key piece in the future of the party, and Democrats have repeatedly rallied around her to whitewash her antisemitic comments.\n\nFeaturing Omar and her like-minded socialist antisemites has already had an electoral effect on the Democratic Party. In 2024, Kamala Harris needed to select a strong running mate for her expedited presidential campaign. The obvious choice to everyone was Josh Shapiro, the popular governor of Pennsylvania, the largest swing state in the country. Shapiro was an electoral asset in Pennsylvania and in other swing states, a progressive who could convincingly portray himself as a moderate even as he dragged nuns to court to force them to pay for birth control.\n\nShapiro’s big problem was that he was Jewish, which made him unacceptable to the antisemitic socialists taking over the party, regardless of his views on Israel and Gaza. So Harris pivoted to Minnesota Gov. Tim Walz, to the cheers of the Democratic Socialists of America. According to the DSA, “Harris choosing Walz as a running mate has shown the world that DSA and our allies on the left are a force that cannot be ignored.”\n\nHere is what Walz thinks of antisemitic socialist Ilhan Omar: “When I’m having a tough day or I’m out on about mile five of my run and I’m feeling kind of down, and the world is pressing on me, I think ‘Ilhan Omar is a congresswoman.’ And it just brightens you up.” Walz, meanwhile, was Omar’s top pick to be Harris’s running mate.\n\nWalz was a disaster, getting mopped up in the vice presidential debate by JD Vance and serving as Harris’s leader in male outreach for a campaign that alienated male voters. It isn’t even clear that the Harris campaign vetted him. Walz was a terrible pick, and Shapiro was the obviously correct one. It would be hard to argue with the Democratic Socialists of America, then, that they are the “force” that the Democratic Party can’t ignore.\n\nThe rise of socialism in Minneapolis can be thanked for that. Minneapolis has laid the groundwork for the rise of socialism in New York City and throughout the rest of the Democratic Party. Minneapolis has dictated the direction of the national Democratic Party, and the consequences will be felt outside the Twin Cities for years to come.","summary":"Minneapolis reshaped the country for the worse in the aftermath of the death of George Floyd and the birth of the “defund the police” movement. It appears the city is doing the same to the&#160;Democratic Party&#160;by leading its efforts to embrace&#160;socialism. Jacob Frey was in his third year as mayor of Minneapolis when Floyd was [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3501720/minneapolis-socialism-is-directing-the-democratic-party/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/ilhan-omar-minnesota-primary.webp?w=696","video":null,"publish_date":"2025-08-17 18:00:00","author":"Zachary Faria","authors":["Zachary Faria"],"language":"en","category":"politics","source_country":"US","sentiment":-0.47},{"id":351882716,"title":"Newsom Vows to Pack California’s Conservative Outposts With Dem Voters, New Map Shows","text":"THE DAILY CALLER NEWS FOUNDATION—California Democrats released a new gerrymandered House map on Friday night that, if implemented, would carve up deep red areas of the state that have been under Republican representation for decades.\n\nThe proposed California House district map—which was redrawn by the Democratic-dominated state legislature—aims to flip five currently Republican districts blue, in addition to making currently competitive Democratic-held seats safer. Democratic California Gov. Gavin Newsom called for mid-decade redistricting in the state after it was reported that Texas would redraw its House lines with the intention of flipping five House seats from blue to red.\n\nIf enacted, the map would likely result in a California House delegation of 48 Democrats and only four Republicans—meaning the GOP would only control 8% of seats. Meanwhile, Texas’ new proposed map would likely result in a House delegation of 30 Republicans and eight Democrats — with Democrats likely controlling 21% of seats—still a higher percentage than the 17% of current California House seats held by Republicans.\n\n“We anticipate that these maps will completely neuter and neutralize what is happening in Texas,” Newsom told reporters Thursday after announcing a November special election for Californians to vote on the gerrymandered map. California unlike Texas requires a ballot initiative to pass its proposed mid-decade map.\n\nThe Republican incumbents the proposed California map targets are California Reps. Doug LaMalfa, Ken Calvert, Darrell Issa, Kevin Kiley and David Valadao.\n\nLaMalfa and Calvert’s districts have both been in Republican hands for decades. The gerrymandered map seeks to replace both of their seats with safely Democratic ones.\n\nLaMalfa has since 2013 represented California’s 1st congressional district, which currently covers a sprawling rural area stretching from the state’s Oregon and Nevada state lines to just north of Sacramento. The seat has been held by Republicans since 1981 and LaMalfa won the 2024 election by a landslide margin of 30 percentage points.\n\nIn California Democrats’ newly proposed map, the 1st district would be reconfigured to stretch into Sonoma County’s wine country. Failed Democratic nominee Kamala Harris won the deep blue county with over 70% of the vote in 2024.\n\nCalvert, who was first elected to Congress in 1993, represents the 41st district in Southern California, stretching from Palm Springs to Corona. Calvert won reelection in 2024 by 3.4 points in a previously safe Republican district that was redrawn to be competitive following the 2020 census.However, under the new map, Calvert’s current seat would be eliminated and replaced with a heavily Democratic district just east of Los Angeles.\n\n“I strongly oppose the scheme being orchestrated behind closed doors by Sacramento politicians to take constitutionally afforded power away from the Independent Citizens Redistricting Commission and replace it with a process that would allow legislators to draw district maps that are gerrymandered to benefit themselves and their political allies,” Calvert told the Daily Caller News Foundation. “A partisan political gerrymander is not what the voters of California want as they clearly stated when they passed the VOTERS FIRST Act and participated in the Independent Citizens Redistricting Commission process.”\n\nIssa, who was elected to Congress in 2001, represents the 48th district that reaches from California’s southern border to just east of San Clemente. While Issa easily won his 2024 reelection bid by 18.6 points, the new map would shift his district from being strongly Republican to being Democratic leaning.\n\nKiley, who is in his second term representing California’s 3rd district spanning from the Sacramento suburbs to the California-Nevada border, defeated former Newsom appointee Jessica Morse in 2024 by 11 points. The Democrats’ new map seeks to add more Democratic areas by the state capital to Kiley’s district, effectively putting reelection out of reach for the incumbent.\n\nKiley is also spearheading a bill to ban mid-decade redistricting nationwide and has called for California to preserve its Citizens Redistricting Commission.\n\n“It was the voters themselves that said, ‘We want to take the politics and the politicians out of redistricting and have this done by an independent citizens commission,’ and the voters stand by that judgment,” Kiley said during a Thursday night appearance on MSNBC. “Democrats, Republicans, Independents all overwhelmingly favor keeping the Independent Commission because they know that when politicians are in charge of drawing district lines, that’s an inherent conflict of interests, because they’re then going to go and run in those districts.”\n\nThe Central Valley-based 22nd district represented by Valadao will be redrawn to be slightly more Democratic under the new map. Valadao’s current seat, which voted for former President Joe Biden by double digits, notably swung nearly 20 points to the right in the 2024 presidential election.Furthermore, California Democrats’ new proposed map also seeks to add more Democratic voters to the seats represented by California’s half dozen vulnerable Democratic incumbents, Reps. Adam Gray, Josh Harder, Mike Levin, Dave Min, Derek Tran and George Whitesides.\n\nThe nine members of the California Republican House Delegation released a joint statement Thursday on a recent poll revealing Californians greatly disapprove of the motion to override the independent redistricting commission.\n\n“Governor Newsom is trying to grab power away from the citizens on the commission and give it to Sacramento politicians to gerrymander their own districts,” the legislators wrote in the statement. “Our delegation will stand with the citizens of California and defend their rights as they stand today in our state constitution by opposing Newsom’s ballot measure. All Californians, regardless of their political affiliation, should vote NO on this attempt to eliminate the Independent Citizens Redistricting Commission’s ability to draw fair congressional districts.”\n\nOriginally published by The Daily Caller News Foundation.","summary":"THE DAILY CALLER NEWS FOUNDATION—California Democrats released a new gerrymandered House map on Friday night that, if implemented, would carve up deep red areas of... Read More\n\n\nThe post Newsom Vows to Pack California’s Conservative Outposts With Dem Voters, New Map Shows appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/08/17/newsom-vows-to-pack-californias-conservative-outposts-with-dem-voters-new-map-shows/","image":"https://www.dailysignal.com/wp-content/uploads/2025/08/250817_Gavin_Newsom_Yelling.jpg","video":null,"publish_date":"2025-08-17 18:00:00","author":"Andi Shae Napier,Andi Shae Napier | August 17, 2025 | Share This Page Facebook X Linkedin Email Print","authors":["Andi Shae Napier","Andi Shae Napier | August 17, 2025 | Share This Page Facebook X Linkedin Email Print"],"language":"en","category":"politics","source_country":"us","sentiment":0.065},{"id":351876362,"title":"Disturbing video shows lawmaker stuffing ballots in swing state that Trump only won by 80,000 votes","text":"A chilling video has allegedly shown a lawmaker accompanying a friend who stuffed ballots in a swing state that Donald Trump only won by just over 80,000 votes.\n\nAbu Musa, a city council member of Hamtramck, Michigan, was in the passenger seat handing several bundles of what appear to be absentee ballots to the driver.\n\nMusa then watches the driver deposit three stacks of ballots into a drop box.\n\nMichigan State Police confirmed the authenticity of the clip, which was filmed on August 1. It is part of an investigation into council members’ residency requirements.\n\nThe alleged ballot box stuffing incident took place just before the city's latest primary election on August 5 - which Musa won with more than 1,129 votes. \n\nThe video comes days after two of Musa's councilmen colleagues, Muhtasin Sadman and Mohammed Hassan, were charged over forging ballots in the city's tightly fought 2023 election.\n\nMusa was previously named as 'under investigation' in the same conspiracy - but was not charged at the time.\n\nAccording to a document by Attorney General Dana Nessel requesting a special prosecutor in the 2023 case, Musa's colleagues 'conspired to receive unvoted absentee ballots that had been signed by recently naturalized citizens.' \n\nThe accused then allegedly proceeded to 'fill in the candidates of their choosing' during the city's 2023 elections, according to the document issued in April. \n\nMusa received the most votes in the August 5 primary election, per unofficial election results released on August 6 - receiving 12.5 percent of total votes in a field of 12 candidates.\n\nOf the total 1,129 votes received by Musa, 843 were cast by absentee ballot. The 286 total of election day votes received by Musa is only the fifth-highest tally. \n\nHamtramck's council was embroiled in the election forgery scandal earlier this year - and Sadman and Hassan were charged on August 11. Musa and another council member, Mohammed Alsomiri, were not charged at the time. \n\nThe drama was ramped up when Attorney General Nessel then decided to recuse herself from the investigation because of criticism she had faced in the past.\n\nNessel, a Jewish lesbian, previously criticized policy positions taken by the Muslim-majority council to ban Pride flags from being flown on city-owned property. \n\nThe Michigan Attorney General had also faced harsh scrutiny for her prosecutions of pro-Palestinian protestors at the University of Michigan in the wake of October 7.\n\nNessel was additionally accused of prosecuting the campus protestors due to 'bias against Muslims and/or people of Arab descent.' \n\nShe foresaw similar criticisms coming her way in this ballot forgery case, as five of the defendants 'are of Arab descent' - therefore she removed herself. \n\nHamtamack, a city in Metro Detroit, has a population just over 28,000 residents, which is over 70 percent Muslim. The city became the first in America to be governed by an all-Muslim council in 2022. \n\nDetroit's Local 4 News reported that the initial investigation began 'after the city clerk noticed unusual patterns with absentee ballots - including identical handwriting on multiple envelopes and large bundles of ballots submitted at once.'\n\nHamtramck City Clerk Rana Faraj told Votebeat that 'state laws are clear that your ballot should only be handled by you or a family member,' adding that 'everyone’s cousins around here.'\n\nThe council is made up of six members, and three slots are up for election every two years. Members serve four-year terms. \n\nDonald Trump won Michigan's 15 electoral votes in 2024 with 49.7 percent of the votes to Kamala Harris' 48.3 percent.\n\nHamtramck's Mayor Amer Ghalib made waves last year after endorsing Trump for President as the mayor of America's first Muslim-majority city.\n\nTrump later nominated Ghalib to be the Ambassador to the State of Kuwait.\n\nDaily Mail have contacted Musa for comment.","summary":"Abu Musa, city councilmember of Hamtramck, Michigan, was seen in the passenger seat of a car, watching another man deposit three stacks of ballots into a drop box.","url":"https://www.dailymail.co.uk/news/article-15008401/abu-musa-michigan-detroit-video-ballot-box-trump.html","image":"https://i.dailymail.co.uk/1s/2025/08/17/17/101300505-0-image-m-50_1755449547628.jpg","video":null,"publish_date":"2025-08-17 17:31:27","author":"Editor,Victoria Churchill","authors":["Editor","Victoria Churchill"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.3},{"id":351904382,"title":"Arnold Schwarzenegger Is Ready To Take On Gavin Newsom","text":"For months now, Trump’s team has been lobbying GOP lawmakers and governors to redraw state maps to ensure a Republican House majority in the 2026 midterm elections. In Indiana, for example, Trump asked Gov. Mike Braun to call for a special legislative session to redistrict the Hoosier state, even sending Vice President JD Vance to implore leaders to convene.\nBraun—who Trump relegated to the kids’ table during his star-studded inauguration—has yet to make a decision on the matter, but his counterpart in Texas, Greg Abbott, is all in on the plan, with a special redistricting session planned for this week that could net the GOP five more House seats.\nIn response, Newsom announced his own redistricting proposal Thursday, saying via X that he will call a special election “to redraw our Congressional maps and defend fair representation.” At a press conference on Thursday to promote the November 4 vote, Newsom explained that redrawing California’s electoral map would generate five Democratic house seats, effectively negating any Texas gains. It’s a move that the state must make “in reaction to a president of the United States that called a sitting governor of the state of Texas and said ‘find me five seats,’” Newsom said.\n“I know they say don’t mess with Texas. Well, don’t mess with the great Golden State,” Newsom said, even as Trump appeared to do just that: Armed and masked ICE agents assembled just outside Newsom’s press event to promote the redistricting effort, a show of force that LA Mayor Karen Bass described as “completely unacceptable” and Newsom pointed to as proof that California’s redistricting is the only way forward. The ICE agents’ presence was “pretty sick and pathetic,” Newsom told reporters, describing it as everything one needs to know “about Donald Trump’s America.”\nThat scene must have sent chills down the spine of Newsom’s fellow Californian, Arnold Schwarzenegger. The Terminator star, who had Newsom’s current job from November 17, 2003, to January 3, 2011, was born shortly after World War II to a member of the Nazi party—a group that, under Trump, has experienced a significant revival. “My father was, and so many other millions of men were, sucked into a hate system through lies and deceit. And so, we have seen where that leads,” Schwarzenegger said in a 2023 interview.\nThe former governor was so disgusted by Trump that he endorsed Kamala Harris for president in 2024, saying the convicted felon “will divide, he will insult, he will find new ways to be more un-American than he already has been, and we, the people, will get nothing but more anger.”\nBut in a somewhat cryptic Instagram post on Friday, Schwarzenegger suggested his willingness to oppose Trump only goes so far. In a photo taken at a gym, the former governor is seated at what appears to be an iso-lateral front lat pulldown machine, wearing a t-shirt that reads “F*** the politicians. Terminate gerrymandering.” Schwarzenegger’s chief of staff Daniel Ketchell tells Vanity Fair that the post was intended to communicate his distaste for any effort to redistrict, regardless of motive.\n“Governor Schwarzenegger has a 20 year history of battling gerrymandering, taking power from the politicians and returning it to the people where it belongs, and he believes gerrymandering is evil no matter who does it,” Ketchell said via email.\n“He still stands by the rule we learn in pre-school: two wrongs don’t make a right … He will continue to be on the side of the people and not politicians—from either party—on this issue.”\nIt’s a stance that Newsom’s camp finds deeply disappointing. “We agree with the former governor on the urgent need for national independent redistricting,” Courtni Pugh, an advisor to the California redistricting campaign, tells Vanity Fair via written statement. “But [we] fundamentally disagree on this moment of crisis.”\n“Trump and his Texas cronies are trying to rig the 2026 election before a single person has voted,” Pugh continued. “This is a five alarm fire for our democracy.”\nIt’s unclear how hard Schwarzenegger will fight Newsom, or what form that opposition will take. Speaking with the New York Times, Schwarzenegger says that he won’t be aligning himself with the GOP as he moves forward against the current governor’s plan. “He was kind enough to let me know what he’s up to and how he feels,” the FUBAR star says of Newsom. “I told him: ‘I totally get it. I understand it.’ I said, ‘There’s no effect on our relationship.’”\nBut on this one issue, Schwarzenegger says, he must stand up to both his party and his state’s leader. “I hate the idea of the Republicans redrawing the district lines in Texas, as much as I hate what the Californians are trying to do,” he says. “But I’m thinking now about California, and about the people of California. I promised them that we are going to create a commission that would be independent of the politicians, and there will be an independent citizens’ commission drawing the lines. So I’m not going to go back on my promise. I’m going to fight for my promise.”","summary":"The Terminator star prepares to battle his gubernatorial successor over California's redistricting plans.","url":"https://www.vanityfair.com/hollywood/story/gavin-newsom-arnold-schwarzenegger-california-gerrymandering","image":"https://media.vanityfair.com/photos/68a1ee65684abe128b4cd77c/16:9/w_2752,h_1548,c_limit/2100331670","video":null,"publish_date":"2025-08-17 17:23:36","author":"Eve Batey","authors":["Eve Batey"],"language":"en","source_country":"US","sentiment":-0.382},{"id":351874694,"title":"Who’s REALLY ‘destroying democracy’ — after failing to win voters legitimately?","text":"“Destroying democracy” — the latest theme of the left — can be defined in many ways.\n\nHow about attempting to destroy constitutional, ancient and hallowed institutions simply to suit short-term political gains?\n\nSo, who in 2020, and now once again, has boasted about packing the 156-year-old, nine-justice Supreme Court?\n\nWho talks frequently about destroying the 187-year-old Senate filibuster — though only when they hold a Senate majority?\n\nWho wants to bring in an insolvent left-wing Puerto Rico and redefine the 235-year-old District of Columbia — by altering the Constitution — as two new states solely to obtain four additional liberal senators?\n\nWho is trying to destroy the constitutionally mandated 235-year Electoral College by circumventing it with the surrogate “The National Popular Vote Interstate Compact?”\n\nDoes destroying democracy also entail weaponizing federal bureaucracies, turning them into rogue partisan arms of a president?\n\nSo who ordered the CIA to concoct bogus charges of “collusion” to sabotage Donald Trump’s 2016 campaign, the 2016-2017 transition, and the first 22 months of Trump’s first term?\n\nWho prompted a cabal of “51 former intelligence officials” to lie to the American people on the eve of the last debate of the 2020 election that the FBI-authenticated Hunter Biden laptop was instead the work of a “Russian intelligence operation?”\n\nWho ordered the FBI to connive and partner with social-media conglomerates to censor accurate news deemed unhelpful to the 2020 Biden campaign?\n\nWho pulled off the greatest presidential coup in history by using surrogates in the shadows to run the cognitively debilitated Biden presidency, then by fiat canceled his reelection effort and finally anointed as his replacement the new nominee Kamala Harris, who had never won a single primary delegate?\n\nWho ordered FBI SWAT teams to invade the home of a former president because of a classification dispute over 102 files out of some 13,000 stored there?\n\nWho tried to remove an ex-president and leader of his party from at least 25 state ballots to deprive millions of Americans of the opportunity to vote for or against him?\n\nWho coordinated four local, state and federal prosecutors to destroy a former and future president by charging him with fantasy crimes that were never before, and will never again be, lodged against anyone else?\n\nWho appointed a federal prosecutor to go after the ex-president, who arranged for a high-ranking Justice Department official to step down to join a New York prosecutor’s efforts to destroy an ex-president, and who met in the White House with a Georgia county prosecutor seeking to destroy an ex-president — all on the same day — a mere 72 hours after Trump announced his 2024 reelection bid?\n\nWho but the current Democrats ever impeached a president twice?\n\nHas any party ever tried an ex-president in the Senate when he was out of office and a mere private citizen?\n\nWhen have there ever been two near-miss assassination attempts on a major party presidential candidate during a single presidential campaign?\n\nWho destroyed the southern border and broke federal law to allow in, without criminal or health background audits, some 10 million to 12 million illegal aliens?\n\nWho created 600 “sanctuary jurisdictions” for the sole purpose of nullifying federal immigration law, in the eerie spirit of the renegade old Confederacy?\n\nWho allowed tens of thousands of rioters, arsonists and violent protesters over four months in 2020 to destroy over $2 billion in property, kill some 35 people, injure 1,500 police officers and torch a federal courthouse, a police precinct and a historic church — all with de facto legal impunity?\n\nHow do the purported destroyers of democracy find themselves winning 60% to 70% approval on most of the key issues of our times, while the supposed saviors of democracy are on the losing side of popular opinion?\n\nHow does a president “destroy democracy” by his party winning the White House by both the popular and Electoral College vote, winning majorities in both the Senate and House by popular votes and enjoying a 6-3 edge in the Supreme Court through judges appointed by popularly elected presidents?\n\nSo what is behind these absurd charges?\n\nThree catalysts: One, the new anguished elitist Democratic Party alienated the middle classes through its Jacobin agenda and therefore lost the Congress, the presidency and the Supreme Court, and now has no federal political power.\n\nTwo, the Democratic Party is polling at record lows and yet remains hellbent on alienating the traditional sources of its power — minorities, youth and Independents.\n\nThree, Democrats cannot find any issues that the people support, nor any leaders to convince the people to embrace them.\n\nSo it is no surprise that the panicked Democrats bark at the shadows — given that they know their revolutionary, neo-socialist agenda is destroying them.\n\nAnd yet, like all addicts, they choose destruction over abandoning their self-destructive fixations.\n\nVictor Davis Hanson is a distinguished fellow of the Center for American Greatness.","summary":"Does destroying democracy also entail weaponizing federal bureaucracies, turning them into rogue partisan arms of a president?","url":"https://nypost.com/2025/08/17/opinion/whos-really-destroying-democracy-after-failing-to-win-voters-legitimately/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/american-flag-flies-front-white-108603239.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-08-17 16:14:03","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.158},{"id":352003964,"title":"“South Park” and the high price of free speech","text":"It’s been amply established that “South Park” creators Trey Parker and Matt Stone are maestros of phallic humor. No subject is too lofty for a joke related to male genitalia, even if the punchline amounts to little more than a penis’ presence.\n\nWhat makes these moments count isn’t the exposure but who’s getting pantsed. In 2023’s “South Park (Not Suitable for Children),” Stan Marsh’s father Randy makes balls-out OnlyFans videos as part of a plot satirizing influencer culture. Rewinding to 2016, its “Wieners Out” episode is named for an incel movement that “Butters” Stotch launches by Winnie-the-Poohing it at school.\n\nBut it took CBS ousting Stephen Colbert and its parent company Paramount’s $16 million payoff to settle Donald Trump’s ludicrous $20 billion lawsuit to inspire what might be Parker and Stone’s equivalent to Michelangelo’s David, sans fig leaf. “Sermon on the ‘Mount,” the long-awaited 27th season premiere of “South Park,” reproaches the religious right’s interference in public education; MAGA voters’ gullibility; Paramount’s cave-in to Trump over its “60 Minutes” Kamala Harris interview; and Trump’s unconfirmed claim that the company promised him millions of dollars in public service announcements.\n\nNevertheless, “South Park” ensured that the part nobody will soon forget is the show’s renderings of Trump’s “teeny tiny” manhood. The president’s staff wilts in a series of ridiculous portraits hanging on the White House’s walls. It limply dangles between his legs as he slides into the sheets next to a very turned-off Satan, who dumped Saddam Hussein only to fall for someone who sounds and acts exactly like him. When Trump shows off supposed evidence of his arousal, the Prince of Darkness rolls his eyes and says, “I can’t even see anything; it’s so small.”\n\nSaving the pièce de resistance for last, “Sermon” closes with a deepfake of an obese, pasty Trump collapsing in the desert as his micropeen, festooned with googly eyes, rises to bleat, “I’m Donald J. Trump, and I endorse this message.”\n\nThe White House responded by claiming the show “hasn’t been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention.” That was before Comedy Central shared its ratings. The premiere drew nearly 5.9 million viewers on Paramount+ and Comedy Central, and was the No. 1 telecast on cable on July 23. The second episode, which debuted Aug. 6, pulled in 6.2 million viewers on Comedy Central and Paramount+ in its first three days. Now more than ev– um, recently, “South Park” is a can’t-miss show.\n\nPraise poured forth from entertainment journalists of every stripe, with some highlighting satire’s importance in fighting fascism. The “small penis rule,” explained in layman’s terms in a 1998 New York Times story, floated into conversation again. This questionable strategy suggests that giving a character a small penis might shield creators from being sued by the people they might be based on, since claiming that such a depiction is slanderous requires the would-be plaintiff to confirm that he possesses the world’s smallest trouser dowser.\n\nAll this glee misses the real measuring contest that’s going on, which is about who has enough wealth and will to fend off this administration’s efforts to muzzle criticism.\n\nHours before the premiere’s debut, Paramount Global locked down a five-year extension of its overall deal with Parker and Stone’s Park County and South Park Digital Studios, for a reported $1.5 billion, according to the Los Angeles Times. The agreement includes 50 new episodes that will be exclusive to Comedy Central and Paramount+ and grants both the right to stream the previous 26 seasons.\n\nAs The Wrap explains, this follows a 2019 streaming rights deal with WarnerMedia (which became Warner Bros. Discovery) worth a reported $500 million, which, according to Bloomberg, expired in June. Then, a $900 million deal in 2021 gave ViacomCBS (Paramount’s former incarnation) 14 specials exclusive to Paramount+ while renewing “South Park” for multiple seasons.\n\nSince Parker and Stone signed a deal in 2007 securing a 50-50 split with Comedy Central on all digital revenue, they reap half of the money generated by all these streaming deals. Park County and Paramount Global run South Park Digital Studios as a joint venture.\n\nAll to illustrate the point here, which is that the “South Park” creators have very deep pockets and a nearly three-decade track record of not respecting any Cartman-esque claims to authori-tah. If the notoriously thin-skinned Trump sends his lawyers against them, he may be chagrinned to find that what he’s really threatened this politically agnostic duo with (and, vicariously, everyone who can’t stand this president) is a very good time.\n\nIt isn’t wrong to celebrate the show’s skewering of a president hellbent on diminishing our First Amendment rights. When Trump is turning the military on blue cities to stifle protest and suing major news organizations over coverage he doesn’t like, watching his “South Park” incarnation flapping his shortcoming in the wind confirms theories about his dictatorial behavior.\n\nInstead, we might take note of how high the price of unfettered free speech has become. Trump’s lawsuits against major media outlets, including social media giants Facebook and X, have gained him tens of millions in settlement cash. For ABC’s parent company Disney and CBS’ Paramount Global, forking over $15 million and $16 million, respectively, to make their legal headaches disappear quickly was worth more than defending their journalists’ integrity in court.\n\nParamount Global’s recently finalized merger with Skydance Media required approval by the Federal Communications Commission, which is currently headed by Trump appointee Brendan Carr. Trump knew this when he sued CBS. The payout, then, was viewed by many – including the Writers Guild of America and Colbert – as the equivalent of “a big fat bribe.”\n\nNeither cable nor any streaming service falls under the FCC’s jurisdiction, which keeps “South Park” out of its reach and grants Parker and Stone more latitude than their broadcast peers. In fact, they are among the few media figures who can afford to go toe-to-toe with Trump in court – and may even relish the opportunity to subject him to a different kind of indecent exposure.\n\nAnother is Rupert Murdoch — against whom Trump filed a defamation lawsuit along with the Wall Street Journal, which Murdoch owns —and reporters Khadeeja Safdar and Joseph Palazzolo. Safdar and Palazzolo share a byline on the Journal’s July 17 scoop alleging that Trump sent a “bawdy” birthday greeting to Jeffrey Epstein that included a drawing of a naked woman, with his signature serving as the woman’s pubic hair.\n\nTrump insists the letter is a fake and probably thought Murdoch would kill the story, claiming as much in a Truth Social post. A reasonable interpretation of why he didn’t is that Murdoch saw no reason to prevent reporters from his most legitimate American media outlet from leading the charge on a scandal that has dominated the news cycle for weeks.\n\nMurdoch’s net worth is estimated by Forbes to be somewhere between $23 and $24 billion, which, as we saw with Fox’s $787.5 million settlement with Dominion Voting Systems in 2023, is gigantic enough to belch up a substantial bag without choking on it. While that also means he wouldn’t miss anything in the range of the $10 million X paid to settle with Trump and the $25 million payout that Meta forked over, Murdoch is also proud and demonstrably petty. If you’re in for that much, why not fork over a few million more to take Trump to court and compel the administration to hand over documentation clarifying the extent of Trump’s ties to Epstein?\n\nYes indeed, wealth will buy you plenty of free speech. Murdoch’s cable news propaganda machine has proven that for years. As for what a lack of funding costs our democracy, take a look at what’s happening to Trump, Fox News, and Elon Musk’s common adversary, Media Matters for America.\n\nIn May, Trump’s Federal Trade Commission initiated a probe into the progressive research organization to determine whether Media Matters had illegally worked with other groups to negatively impact X’s advertising revenue.\n\nMedia Matters described the FTC action to Status newsletter founder Oliver Darcy as a political hit job. A month later, Media Matters filed a civil complaint against the FTC, accusing it of launching a “government campaign of retaliation.”\n\n“Now the Federal Trade Commission seeks to punish Media Matters for its journalism and speech in exposing matters of substantial public concern — including how X.com has enabled and profited from extremist content that proliferated after Elon Musk took over the platform formerly known as Twitter,” the complaint reads. “The campaign of retribution against Media Matters must stop.”\n\nThis follows a string of lawsuits Musk’s attorneys launched against Media Matters in the wake of a November 2023 report about ads appearing on X next to antisemitic and pro-Nazi content.\n\nAdvertisers fled shortly thereafter, although Musk’s endorsement of an antisemitic conspiracy theory that same month didn’t help his case. Neither did it stop him from waging lawfare against the organization, including encouraging investigations into Media Matters by the Republican attorneys general of Texas and Missouri. A Federal Court blocked the Texas investigation, citing First Amendment rights infringement. The Missouri attorney general’s office dropped its investigation.\n\nA July 25 New York Times article enumerates these details. It also says that defending against Musk’s lawsuits as well as investigations by those states’ attorneys general and the FTC have saddled Media Matters with $15 million in legal fees.","summary":"With our First Amendment rights under attack, those in the best position to defend them also happen to be rich","url":"https://www.salon.com/2025/08/17/south-park-and-the-high-price-of-free-speech/","image":"https://www.salon.com/app/uploads/2025/08/South-Park-002-150x150.jpg","video":null,"publish_date":"2025-08-17 16:00:48","author":"Melanie McFarland","authors":["Melanie McFarland"],"language":"en","source_country":"US","sentiment":-0.455},{"id":351874716,"title":"The rizz kid: How a campus Communist turned conservative kingmaker put the ‘social’ in ‘social movement’","text":"Gen Z calls it “rizz.”\n\nConservative theorist Frank Meyer radiated it.\n\nRizz is what Donald Trump exudes and Kamala Harris lacks, and this je ne sais quoi quality, at least to all who came before Gen Z brilliantly put a name on it, explains not just one’s success on Hinge but whether a political figure can pull a crowd.\n\nMarble-mouthed mumblers and shoegazers take note: It turns out people follow the very individuals in mass movements they follow around in social situations.\n\nFrank Meyer’s 3D, pops-off-the-page life illustrates this truth.\n\nAfter the Newark-born Meyer acted as the pied piper of campus Communism in 1930s England, he remarkably became in America during the 1960s, as the title of my new biography puts it, the man who invented conservatism.\n\nBritish intelligence conducted a black-bag job on his apartment, placed a mail cover on his correspondence and noted the bars he frequented, the tweed he wore and the frequent female company he kept as they tailed him. \n\nNowhere in the 161 pages of the declassified Meyer files do agents memorialize on paper that the revolutionary they followed — described therein as “the founder” of the student Communist movement — dated the big boss’ daughter.\n\nThe most Frank Meyer thing Frank Meyer ever did was enter into a relationship with Prime Minister Ramsay MacDonald’s youngest child as he conspicuously called for the violent overthrow of the British government the man led. \n\nChe, Lenin and Mao never pulled off such a brash caper.\n\n“Come here at 7.0 — or if you don’t like the idea of Downing Street — even though I am the sole occupant at the moment — fix any other place you like,” Sheila MacDonald wrote Meyer in one of their letters I discovered in an Altoona, Penn., warehouse during research for “The Man Who Invented Conservatism: The Unlikely Life of Frank S. Meyer,” out Aug. 19.\n\nPredictably, the British government sought to deport Meyer (and, predictably, Miss MacDonald volunteered to intervene). \n\nThe same rizz that placed the prime minister’s daughter in his arms brought a phalanx of famous Brits to his defense.\n\nClement Attlee, future prime minister, pleaded his case in Parliament. \n\nA petition signed by philosopher Bertrand Russell, “Howards End” and “A Passage to India” author E.M. Forster and Labour Party leader (and Angela Lansbury’s grandfather) George Lansbury called the deportation “discrimination” prompted by the cause célèbre’s “left-wing politics.” \n\nStudents marched about London chanting, “Free Frank Meyer!”\n\nWomen desired his romantic attention. Rizz meant men wanted his company, too.\n\nIn 1930, an unknown Pottstown, Penn., prep-school teacher plaintively petitioned Meyer for more “scintillating conversations” and “provocative” letters. \n\nHe wished to again drink with Meyer and “to take a Cook’s Tour of this particular part of the world with you.” Without Meyer’s company, he confessed, he inhabited an “intellectual desert.”\n\nThe sycophantic missive came from the typewriter of James A. Michener long before he won a Pulitzer Prize for “Tales of the South Pacific.”\n\nBy 1949, when Meyer testified against former comrades in the Foley Square trial — the longest, most expensive court case in US history to that point — he had witnessed much evil.\n\nHe knew that Prince Mirsky, the force who pushed him to join the Communist Party, had disappeared in a Soviet gulag; his protégé, Charles Darwin’s great-grandson John Cornford, had died fighting in the Spanish Civil War; his boss on “peace” activism, Walter Ulbricht (who later built the Berlin Wall), went about making the lives of East Germans hell; and his American idol, longtime party chief Earl Browder, had transformed overnight in Communist rhetoric from a brilliant, courageous leader into a perfidious enemy of the people.\n\nSlowly, he embraced a very different outlook. Quickly, and characteristically, the conservative convert became conservative pope.\n\nPresent at the creation of National Review, the Conservative Party of New York, the Philadelphia Society, the American Conservative Union and Young Americans for Freedom, Meyer helped erect the skeletal structure of the conservative movement.\n\nGoing to Woodstock meant something very different for 1960s young conservatives. Those making the obligatory pilgrimage to his farmhouse there included Joan Didion, who credited him as the editor who first published her freelance work, Garry Wills, who said he spent more time with this mentor in the late 1950s and early 1960s than anyone outside his family, and Heritage Foundation founder Ed Feulner.\n\nHis philosophy, fusionism, became the default outlook of the American right from Barry Goldwater well through Ronald Reagan, who cheered that Meyer had “fashioned a vigorous new synthesis of traditional and libertarian thought — a synthesis that is today recognized by many as modern conservatism.”\n\nWhat made conservatives so easily follow a former Communist? Rizz.\n\nThose doubting the power of rizz may wish to apply this test to every presidential election in their lifetimes: Did the winning candidate also win the rizz contest?\n\nUndertaker-face John Kerry lost to George W. Bush in 2004. John McCain, who looked like he walked off the set of a black-and-white television show, lost to Technicolor Barack Obama in 2008. Monotone Gerald Ford lost to Jimmy Carter with his ear-to-ear grin and mellifluous diction in 1976. \n\nAnd a fist-in-the-air, “Fight”-shouting Donald Trump — far from the cranky, complaining COVID case of 2020 — triumphed over word-salad chef Kamala Harris in 2024.\n\nFrank Meyer understood the power of rizz long before Twitch streamer Kai Cenat popularized the term.\n\nThey don’t call them social movements for nothing.\n\nDaniel J. Flynn is the author of “The Man Who Invented Conservatism: The Unlikely Life of Frank S. Meyer” (Encounter/ISI Books), an American Spectator senior editor and Hoover Institution visiting fellow.","summary":"Gen Z calls it “rizz.”","url":"https://nypost.com/2025/08/17/opinion/the-rizz-kid-how-frank-meyer-a-campus-communist-turned-conservative-kingmaker-put-the-social-in-social-movement/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-lf57rr4n6-1755265896873.jpg?quality=75&strip=all&1755251591&w=1200","video":"https://cdn.jwplayer.com/videos/VWeKgrjq-RyIcpnTz.mp4","publish_date":"2025-08-17 16:00:08","author":"Daniel J. Flynn","authors":["Daniel J. Flynn"],"language":"en","category":"politics","source_country":"us","sentiment":0.305},{"id":351874684,"title":"Gal Gadot clarifies why she blamed anti-Israel sentiments in Hollywood for ‘Snow White’ flop: ‘Very personal’","text":"Gal Gadot clarified her remarks about how celebrities being pressured to speak against Israel played a role in “Snow White” flopping at the box office.\n\n“I was honored to join an extraordinary interview with inspiring interviewers, whose questions go straight to the heart,” the Israeli actress shared via her Instagram Stories Sunday. \n\n“Sometimes we respond to questions from an emotional place. When the film came out, I felt that those who are against Israel criticized me in a very personal, almost visceral way,” she added.\n\n“They saw me, first and foremost, as an Israeli, not as an actress. That’s the perspective I spoke from when I answered the question.”\n\nGadot, 40, wrote that the live-action Disney remake didn’t “fail solely because of external pressures.”\n\n“There are many factors that determine why a film succeeds or fails, and success is never guaranteed!” she concluded.\n\nDuring a recent appearance on Israeli TV show “The A Talks,” the “Wonder Woman” actress revealed why she believed “Snow White” was considered a “major flop.”\n\n“I was sure this movie was going to be a huge hit. And then it happened,” she said, referencing the Oct. 7 attacks in which Hamas terrorists launched a brutal attack on Israel.\n\n“And what followed, as you know, what happened a lot in various industries, including Hollywood, there’s pressure on celebrities to speak against Israel,” Gadot continued.\n\n“I can always explain and try to give context about what’s happening here and I always do that. But, in the end, people make their own decisions.”\n\nThe “Red Notice” star said she was “disappointed the movie was so affected and it didn’t succeed at the box office.” \n\n“That’s how it goes. You win some, you lose some,” she said.\n\nGadot, who played the Evil Queen, and Rachel Zegler, who portrayed Snow White, were both involved in controversies while filming and promoting the movie, which grossed $205.6 million worldwide against a production budget of $240 to $270 million.\n\nFans initially criticized Disney for casting a Latina as Snow White.\n\nZegler, 24, then faced backlash for saying the plot of the animated “Snow White” film was “dated” because the prince “literally stalks Snow White.”\n\nThe “West Side Story” star was also slammed for voicing her support for Palestine and sharing an anti-President Donald Trump Instagram post after he defeated Kamala Harris in the 2024 election last November.\n\nAfter people called for Zegler to be fired from the live-action film, she issued an apology, saying she had let her “emotions get the best of” her when she spoke about the election.\n\nMeanwhile, Gadot, who is Jewish, has been an outspoken supporter of Israel on social media, which has garnered some backlash from fans.\n\nIn March, the mom of four’s Hollywood Walk of Fame ceremony was interrupted by pro-Israel and pro-Palestinian protesters.\n\nAdditionally, Gadot had to beef up security after she received death threats about her views. \n\nIt was reported that the co-stars clashed while making the Disney film due to them having “nothing in common.”","summary":"“They saw me, first and foremost, as an Israeli, not as an actress. That’s the perspective I spoke from when I answered the question,\" she wrote.","url":"https://pagesix.com/2025/08/17/celebrity-news/gal-gadot-clarifies-why-she-blamed-anti-israel-sentiments-in-hollywood-for-snow-white-flop/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/08/109732761.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/667oIAPd-guILbWnz.mp4","publish_date":"2025-08-17 15:37:34","author":"mliss1578,Tamantha Ryan","authors":["mliss1578","Tamantha Ryan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.04},{"id":352060684,"title":"Palantir is Colorado’s highest-valued company — and at center of controversy — five years after move to Denver","text":"It’s been five years since the budding tech giant Palantir Technologies uprooted the company’s headquarters from Silicon Valley to Denver, hoping to plant itself in the emerging tech hub and escape protests that had erupted both within the company and outside its doors.\n\nImmigrant-rights advocacy groups had organized protests outside the company’s Palo Alto and New York offices, as well as at the home of its CEO, Alexander Karp, who criticized the California coast’s “monoculture.” A University of California, Berkeley conference on privacy law dropped Palantir as a sponsor. More than 200 employees sent a letter to Karp expressing their concern over the company’s contract with U.S. Immigration and Customs Enforcement, which ostensibly focused on the agency’s investigative arm but which activists alleged facilitated raids and deportation efforts.\n\nAmid the upheaval, company leaders shifted their eyes to the east, where state economic officials pitched Colorado as a fast-growing and highly educated purple state with a bubbling startup culture and pro-business policies.\n\n“Colorado is a very sane and pleasant place,” Karp said in 2022, according to the Denver Business Journal. “It’s very likable, very pragmatic, and (there are) a lot of industrious, smart people that also want to live in Colorado. It’s great.”\n\nIn the years since settling downtown, Palantir has been catapulted into the ranks of the most valuable tech companies in the country. A leading data analysis firm, it is now decisively the most valuable company headquartered in Colorado, with a valuation of $437.2 billion as of Wednesday — worth more than the combined totals of the 57 other Colorado-based public companies tracked by The Denver Post.\n\nWhen it moved to the state, it had never turned a profit. Last quarter, Palantir surpassed $1 billion in revenue. Karp lives in New Hampshire, but if he lived in Colorado, he would trail only Phil Anschutz as the state’s wealthiest resident.\n\nThe company’s valuation has drawn literal “wows” from Wall Street analysts. It’s also prompted some skepticism. Last week, the Economist ran a story headlined: “Palantir might be the most over-valued firm of all time.”\n\nAs the company’s profile has risen, the customers that played a part in that growth have drawn increasing national — and local — scrutiny to the company. Its expanding contracts with ICE, its work with the American and Israeli militaries, and national reporting about its ties to billionaire Elon Musk’s “Department of Government Efficiency” under the new Trump administration have prompted national protests and near-weekly headlines.\n\nSuch concerns sparked an open letter from several ex-employees and criticism from a United Nations official, and they led Democratic senators and members of Congress to send Karp a recent letter demanding answers. WIRED recently referred to the company as “arguably one of the most notorious corporations in contemporary America.”\n\nThe company, which did not respond to interview requests from The Post last week, uses artificial intelligence to process and analyze vast amounts of data, offering everything from better efficiency for airlines to targeting assistance for the Ukrainian military.\n\nPalantir has managed to marry two technological obsessions of the 21st century — mass data collection and the emergence of artificial intelligence — with ever-growing desires for efficiency and security.\n\n“Palantir has been arguably among the — if not the most successful company, really, at applying these (artificial intelligence) technologies, at scale, to large-scale data,” said James Evans, a University of Chicago professor and director of the school’s Knowledge Lab. He also works on AI technology for Google.\n\n“And this is why they’ve also come under scrutiny and controversy — because of what kind of data the government has in its possession.”\n\nIn an earnings call earlier this month, Karp, who has sought to frame the company as pro-democracy and antiauthoritarian, reiterated its ethos: “America is the leader of the free world, that the West is superior, that we have to fight for these values.”\n\nWhat does Palantir do?\n\nPalantir takes its name from the crystal ball-like “seeing stones” from “The Lord of the Rings” series, and the word itself translates, from author J.R.R. Tolkien’s own Elvish language, to “those that watch from afar.”\n\nFounded as a sort of security-focused offshoot of billionaire Peter Thiel‘s PayPal, Palantir fills a demand created by companies’ and governments’ massive data collections amassed over the past 20-odd years, Evans said.\n\nTo government and commercial clients awash in information about customers, products and citizens, Palantir offers a solution. For a hefty fee, it can take huge, distinct datasets, blend them together and offer solutions to problems or “use cases” for what its customers can do with that data.\n\nFor an airplane manufacturer like Airbus, the company’s work meant merging 400 datasets to more quickly fix production mistakes, saving hundreds of millions of dollars.\n\nFor health officials rushing out vaccines during the pandemic, Palantir meant close monitoring of distribution.\n\nNebraska Medicine hired Palantir to make staffing recommendations and predict hospital bed availability.\n\nThe U.S. Department of Defense tapped the company to identify likely trouble spots for soldiers and to use AI to quickly identify targets, and the Ukrainian military has used it for targeting, too.\n\nPalantir has taken credit for preventing terror attacks, and it has gained admirers in the military for its ability to steer U.S. troops clear of ambushes. It received initial funding from the Central Intelligence Agency, and a number of media outlets have linked the company — without confirmation — to the successful search for Osama Bin Laden, the mastermind of the Sept. 11 attacks.\n\nUsing Palantir’s flagship program, law enforcement can centralize what they know about a person in one place and search for them using characteristics like their immigration status, their tattoos or their location, according to reports by WIRED and BuzzFeed.\n\nThat work is important, Evans said: As tech capabilities expand, the government should have access to AI software of its own. It’s impossible, otherwise, to monitor for certain financial collusion and crimes, he said.\n\nThe company’s government work has spanned presidential administrations, and Karp, the CEO, has previously criticized now-President Donald Trump. But according to the New York Times, the company has received more than $113 million in federal government spending since Trump took office, including additional money from established contracts as well as new contracts with the Department of Homeland Security and the Pentagon.\n\nThe Times also reported that the company was hired to “compile data on Americans” by merging information from different federal agencies in one location.\n\nThe company said in a blog post that the Times’ reporting about its government contracts was replete with “falsehoods and misleading statements” and that it began pursuing some of its new contracts under the Biden administration. It said it was not building a “master database project” and to do so would be “fundamentally at odds with Palantir’s values and our commitment to work in support of liberal democracies.”\n\nThough Evans noted that its ties to federal contracting are a core and longstanding part of its business, Palantir’s recent work has drawn more scrutiny. Indeed, Trump thanked the company at a July AI summit.\n\n“We buy a lot of things from Palantir,” he said.\n\nProtests target company\n\nControversy has followed Palantir’s work. Five years after its ICE collaboration brought protests to its doors, Palantir has expanded its work with the agency, agreeing to build “ImmigrationOS” to track the movement of immigrants in the country.\n\nAccording to CNN, the company was tasked with helping Trump’s DOGE initiative to build a “massive repository of data” that, among other things, would help identify people with civil immigration violations. Initially a project of Musk’s, DOGE moved through several government agencies in the winter and fall in an effort to reduce spending and limit government initiatives like foreign aid.\n\nThe company’s work with the Trump administration prompted a group of former Palantir employees in the spring to write an open letter criticizing the company.\n\nPalantir also has drawn scrutiny for its ties with Israel, to which it agreed to provide new battlefield technology in early 2024. Last month, the United Nations’ special rapporteur on the Palestinian territories included Palantir on a list of companies that “profit freely” from Israel’s military campaign in the Gaza Strip and occupation of the West Bank.\n\nThe company has said it’s proud of its work with Israel, according to the Guardian. It held a board meeting in Israel’s capital in early 2024, and the company’s work in Gaza and the West Bank prompted one of the largest Norwegian investors to dump its stock last year, Reuters reported.\n\nKarp, the CEO, is a self-described progressive who’s donated primarily to Democrats, including to former Vice President Kamala Harris last year and to Colorado’s U.S. Sen. John Hickenlooper and U.S. Rep. Jason Crow.\n\nIn a letter he wrote when the company went public, Karp framed Palantir as an active defender of the West. He said it wouldn’t work with customers company leaders considered “inconsistent with our mission to support Western liberal democracy and its strategic allies.” Though the company previously turned down a contract with Saudi Arabia over its human rights record, it announced that it would “deepen its ties” with the country in May.\n\nIn his letter, Karp reaffirmed that the company’s software “is used to target terrorists and to keep soldiers safe.”\n\n“We have chosen sides,” he wrote, shortly after moving to Denver.\n\nThe company has devoted a growing pile of money to federal lobbying, according to the Wall Street Journal. But lawmakers of both parties have raised concerns: In mid-June, a group of Democratic lawmakers wrote to Karp, alarmed by the New York Times’ reporting about Palantir’s alleged work to create a “government-wide, searchable ‘mega-database’ “ of taxpayer records. Several Republicans expressed similar concerns to Semafor.\n\nThe company’s efforts have sparked criticism among former employees, too. Juan Sebastián Pinto moved to Denver in 2021, looking for a change from the work he did for advertising and architecture firms. Then he got a job offer from Palantir as a content strategist, to “help the sales and technical teams express these complex ideas and messaging,” he said.\n\nHe worked with the company’s automotive teams — meaning work with car companies — and on defense.\n\nPinto said he was concerned about the “automated warfare” that Palantir was working on, as well as the amount of data car companies were gathering about their clients. He left and was one of the former employees who signed the open letter criticizing the company earlier this year.\n\nHe’s also part of a nascent protest effort to call attention to Palantir in Denver and — as Hatem Teirelbar of Denver Anti-War Action put it — to replicate what protesters in California achieved five years ago. Last month, a small group of protesters marched through downtown, accusing Karp and Thiel of being child-killers and handing out fliers urging people to “get Palantir out of Denver.”\n\nThey ended at the company’s headquarters, which is in the Tabor Center on 17th Street. The building had already been closed and its courtyard cordoned off.\n\nTeirelbar said the goal was to force the company’s landlord to stop leasing to Palantir. Anecdotally, he said, more people seem to know about the company now than at the start of the year or in years past.\n\n“I can tell you name recognition is much higher,” he said. “We’ve gone from telling people who Palantir is and where they are, to just saying ‘Palantir’ — (and that) just gets their interest.”\n\nA growing workforce\n\nPinto linked the company’s presence in the state to deeper questions about Colorado’s identity and economic focus.\n\n“We have to recognize what kind of legacy we leave behind as a state as we’re developing our identity,” Pinto said. “And things are happening right now that will affect the rest of the world — not only emerging AI weapons and targeting technologies, but also the integration of these technologies with the federal government, which is exactly why Palantir is here.”\n\nSince the company’s move to Denver, Palantir’s global, full-time workforce has jumped to 4,164 as of June, up from roughly 2,400 in 2020, according to federal security filings. In addition to Denver, the company has offices in political and cultural capitals across the world, including Paris, Tokyo, London and Washington, D.C.\n\nIt’s also become part of the state’s growing tech ecosystem, which includes offices for Google, Salesforce and Slack. In a June 2020 letter to Karp that urged a move to Denver, Gov. Jared Polis — whose wealth is also a product of the early tech boom — highlighted the state’s emergence as “one of the top science and technology hubs in the United States.”\n\nThe governor’s office declined an interview request this week. In a statement, spokesman Conor Cahill said the state is “always open to attracting more companies.”\n\n“There are companies in our state that some people like and others don’t,” he said, “and that is their right.”\n\nDenver Post staff writer Aldo Svaldi, the Associated Press and the New York Times contributed to this story.\n\nStay up-to-date with Colorado Politics by signing up for our weekly newsletter, The Spot.","summary":"Denver-based Palantir has worked with ICE and U.S. and Israeli militaries. \"This is why they've also come under scrutiny and controversy -- because of what kind of data the government has in its possession.\"","url":"https://www.denverpost.com/2025/08/17/palantir-denver-headquarters-immigration-trump-administration/","image":"https://www.denverpost.com/wp-content/uploads/2025/07/TDP-L-Palantir-protest-RJS-43694.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-17 12:00:19","author":"Seth Klamann","authors":["Seth Klamann"],"language":"en","source_country":"US","sentiment":0.31},{"id":351806138,"title":"Warning sign for GOP as Trump’s approval rating among millennials plummets","text":"President Donald Trump's approval among millennials has taken a steep dive, reaching its lowest point of the year in August, Newsweek reports.\n\nAccording to YouGov/Economist polling, in June, 40 percent of millennials supported Trump’s job performance while 53 percent disapproved — a net rating of -13 points.\n\n In July, that figure dropped to 41-57 (-16), before plummeting to 33-56 (-23) in August. That’s a 10‑point decline over just two months, reflecting growing dissatisfaction among millennials as the 2025 political season heats up.\n\nREAD MORE: 'Gloom' over Trump economy hits worst levels 'since the Great Recession': report\n\nTrump now faces slipping approval ratings that could weaken his influence and hurt Republican prospects in the 2026 midterms. After returning to the White House in January with solid numbers, his support has eroded amid economic concerns, tariff backlash and political discontent. \n\nTrump and former Vice President Kamala Harris had turned to podcasts and digital outreach to court millennials, a generation wary of legacy media and traditional messaging.\n\nMillennials are defined generally as people born from 1981 to 1996. The generation has overtaken baby boomers as the largest age demographic, according to the Pew Research Center.\n\nThe poll shows that Trump’s declining popularity among millennials is being driven by worsening views on the economy and inflation. On the economy, Trump’s approval among millennials slipped from 36 percent approval and 52 percent disapproval in June to 38 percent approval and 54 percent disapproval in August, reflecting a parallel rise in approval and disapproval. \n\nInflation also appears to be a particular weak spot. Approval in this area dropped from 33 percent in June to 27 percent in August, while disapproval rose from 58 percent to 60 percent. \n\nThe shift highlights a growing concern among younger voters about persistent price pressures.","summary":"President Donald Trump's approval among millennials has taken a steep dive, reaching its lowest point of the year in August, Newsweek reports.\n\nAccording to YouGov/Economist polling, in June, 40 percent of millennials supported Trump’s job performance while 53 percent disapproved — a net rating of -13 points.\n\n In July, that figure dropped to 41-57 (-16), before plummeting to 33-56 (-23) in August. That’s a 10‑point decline over just two months, reflecting growing dissatisfaction among millennials as the 2025 political season heats up.\n\nREAD MORE: 'Gloom' over Trump economy hits worst levels 'since the Great Recession': report\n\nTrump now faces slipping approval ratings that could weaken his influence and hurt Republican prospects in the 2026 midterms. After returning to the White House in January with solid numbers, his support has eroded amid economic concerns, tariff backlash and political discontent. \n\nTrump and former Vice President Kamala Harris had turned to podcasts and digital outreach to court millen","url":"https://www.alternet.org/send/trump-rating-young-voters/","image":"https://www.alternet.org/media-library/image.jpg?id=54534776&width=1200&height=600&coordinates=0%2C454%2C0%2C454","video":null,"publish_date":"2025-08-17 11:16:08","author":"Ailia Zehra","authors":["Ailia Zehra"],"language":"en","category":"politics","source_country":"us","sentiment":0.005},{"id":352003962,"title":"Trump’s DC occupation scratches an old itch","text":"In 1989, Donald Trump purchased full-page ads in four New York newspapers, including the New York Times, calling for the return of the death penalty after a white jogger was brutally attacked in Central Park. Five Black and Latino teens were arrested for the assault, and after confessions later determined to have been coerced by the police, they were convicted — even though there was no physical evidence linking any of them to the crime. \n\nAfter the five young men had spent years in prison for a crime they did not commit, their convictions were vacated in 2002 when DNA evidence implicated Matías Reyes, a serial rapist. (In 2022, a sixth teenager who was convicted on a related charge was also exonerated.) Reyes ultimately confessed and provided an accounting of the crime that matched details prosecutors already knew about the case; forensics confirmed he had acted alone. \n\nAfter the case was finally solved, it became symbolic for systemic injustice, police brutality and racial profiling. Trump never apologized to the five men, and he has never acknowledged what would have happened to them had his death penalty campaign succeeded. In October 2024, they filed suit against Trump for allegedly defaming them in his presidential debate against then-Vice President Kamala Harris, and in late June, a federal judge rejected the president’s efforts to have the case dismissed. \n\nTrump’s vitriol has percolated in the intervening decades since his campaign against Central Park Five. After his full-page ads claimed that “roving bands of wild criminals” were controlling New York City streets in 1989, this week he claimed that “roving mobs of wild youth” are terrorizing the streets of Washington, D.C.\n\nTrump once again used inaccurate claims to portray a city overwhelmed with soaring violence when he announced on Monday that he was deploying 800 members of the D.C. National Guard and taking over the Metropolitan Police Department to rein in “complete and total lawlessness.” His misleading charts, which featured selectively outdated crime statistics, were so patently wrong that he was fact-checked live by CNN, MSNBC, PBS, NPR and the BBC. Even the Justice Department’s data shows that violent crime in Washington is at a 30-year low. \n\nOn Thursday night, he followed up his actions by having U.S. Attorney General Pam Bondi name Terrance C. Cole, head of the Drug Enforcement Administration, as “emergency police commissioner.” Hours later, D.C. Attorney General Brian Schwalb filed a lawsuit against the administration for its “unlawful actions” in violating the Home Rule Act of 1973, which granted the city partial autonomy. On Saturday night, it was reported that three Republican-led states — West Virginia, Ohio and South Carolina — would be sending 750 National Guard members to Washington. Some of the troops will now be carrying firearms.\n\nThe president’s addiction to hate and division, promoted through blatant and unabashed falsehoods, has persisted since the days of the attack in Central Park. When then-New York City Mayor Ed Koch called for public healing, seeking to unite rather than divide the city, Trump refused to have it. His ad shot back: “Maybe hate is what we need…I want to hate these muggers and murderers…They should be forced to suffer…Yes, Mayor Koch, I want to hate these murderers and I always will.”\n\nAt least on this front, Trump has been true to his word. He has continued ratcheting up false portrayals of dystopian urban hellscapes riddled with crime, even as experts track the link between his language, trickle-down racism and an increase in hate crimes. \n\nThe infamous death penalty ads also revealed his thirst for police brutality. He argued in them that police should be “unshackled” from the constant threat of being called to account for “police brutality,” a sentiment he has echoed ever since. In a 2017 speech, Trump said police should not have to be “nice” to suspects and encouraged arresting officers to not shield suspects’ heads as they were loaded into squad cars. Three years later, he appeared to celebrate the killing of Michael Reinoehl, a community activist who was suspected of fatally shooting a member of a pro-Trump group at a protest in Portland, Ore. That same year, in response to protests over police brutality in the George Floyd case, he reportedly asked his staff if the protestors couldn’t “just be shot. In 2023, during a speech to California Republicans, he called for police to respond to shoplifters by shooting them. At a campaign rally in 2024, Trump said that one day of “violent policing” would end crime, suggesting that if police were free to brutalize the population, crime would disappear. In April, he issued an executive order that promoted aggressive police tactics and made it more difficult to punish brutality. \n\nWant more sharp takes on politics? Sign up for our free newsletter, Standing Room Only, written by Amanda Marcotte, now also a weekly show on YouTube or wherever you get your podcasts.\n\nOn Monday, as he detailed his “federal takeover” of Washington, the president said that police and military forces could “do whatever the hell they want” to people on the streets, expressly encouraging violent force.\n\nThe obvious problem with getting “tougher” on crime without addressing community needs is that it doesn’t work — and it often leads to an increase in crime. Trump’s ineptitude also undermines police accountability efforts, further eroding trust between police and communities. By encouraging law enforcement to use excessive force, he spreads distrust of the police among the public, needlessly endangering the lives of both citizens and police.\n\nIt is widely assumed that Trump is using D.C. as a test run for the federal occupation of other Democratic-led cities. During the George Floyd protests in the summer of 2020, when Trump still had adults in the room to advise him, he voiced interest in taking over Washington, but officials warned that such a heavy-handed approach could backfire. Now, in the absence of more competent advisors, the president is indulging his most dangerous authoritarian impulses.\n\nThe Pentagon is also developing a National Guard “reaction force” to confront and quell protests, demonstrations and civil unrest. The plan calls for troops to be on constant standby for rapid deployment and looks to be targeted to Democratic-run cities.\n\nSetting aside the glaring unconstitutionality of his plan, military service members aren’t trained to de-escalate tensions, manage crowds or solve crimes. They are trained to kill. That is why the Posse Comitatus Act forbids using military forces against civilian populations, except in cases of insurrection. \n\nThe purpose of Trump’s actions in Washington isn’t to address escalating crime — because the city’s crime isn’t escalating. And it isn’t to deal with potholes, beautification or anything else Trump mentioned in his incoherent press conference. \n\nJust like he did in Los Angeles, the president is “taking over” D.C. to normalize an expanded police state for an extended period of time — and to take his 1989 declaration of hate, control and brutality nationwide.","summary":"He's running the Central Park Five playbook on a massive scale","url":"https://www.salon.com/2025/08/17/trumps-dc-occupation-scratches-an-old-itch/","image":"https://www.salon.com/app/uploads/2025/08/Washington-DC-National-Guard-2230168612-150x150.jpg","video":null,"publish_date":"2025-08-17 10:45:31","author":"Sabrina Haake","authors":["Sabrina Haake"],"language":"en","category":"politics","source_country":"US","sentiment":-0.373},{"id":351801674,"title":"Jeremy Clarkson reveals his very on-brand response to security after getting caught up in JD Vance's no-fly zone during his trip to the Cotswolds","text":"Jeremy Clarkson has revealed his response to a security man after his drone got caught up in JD Vance's no-fly zone during the US Vice President's trip to the Cotswolds. \n\nThe zone was set up for security reasons during Mr Vance's residence in the hamlet of Dean this August. \n\nBut Clarkson revealed the restriction interrupted the filming of his hit television programme, Clarkson's Farm, as he uses a drone to shoot certain scenes. \n\nDetailing his frustration in The Times, the presenter revealed his brief conversation with one of Mr Vance's security guards, who asked him: 'Is that your drone?'\n\nClarkson replied, 'Yes', to which the security man responded: 'You aren't allowed to fly that today.'\n\nIn a very brief and on-brand response, Clarkson replied: 'F*** off' - to which the guard said: 'OK.' \n\nClarkson previously posted a picture on Instagram showing the no-fly zone, including his own farm, Curdle Hill Farm - also known as Diddly Squat.\n\nThe TV star captioned the map: 'The JD Vance no-fly zone. We are the pin. So on the downside, no drone shots today. On the upside, no annoying light aircraft.'\n\nThe Vice President's visit to the Cotswolds with his family has attracted mass criticism among locals, who complained of disruption - while left–leaning protesters flocked to the area. \n\nClarkson's right hand man Kaleb Cooper complained that the extra security assisting Mr Vance had derailed him from his own farming duties.\n\nThe farmhand – who has his own land and has spun out a successful entertainment career of his own – said his wheat transportation was held up by the convoy as it passed through Chipping Norton.\n\nHe also slammed Mr Vance for his conspicuous presence in the area, writing on Instagram: 'My wheat got wet in the trailer last night as the convo stopped me in the rain in Chippy.\n\n'I could easily have went on my way and got it in the shed without getting in the way.'\n\nAdding several laughing emojis, he noted: '(If) he had just drove around in a VW Polo nobody would know who he was.'\n\nThe Daily Mail revealed the close proximity of Mr Vance's manor house rental to Clarkson's farm last week.\n\nThe enormous property, Dean Manor, is located in a tiny hamlet of just 12 houses in Oxfordshire, and was picked out by US secret service personnel because of its remote secure location.\n\nStone walls 15ft tall protect its immaculately manicured six–acre gardens.\n\nThe house, which was built 1702 in the reign of Queen Anne, has been surrounded by teams of US secret service operatives dressed in regulation navy blue sports jackets and khaki chino trousers who have been guarding the property around the clock.\n\nMr Vance is understood to have been forced to cancel a dinner reservation at a trendy Cotswolds gastro-pub after woke staff threatened to walk out if he showed up.\n\nThe fashionable Bull pub – which last month entertained former US presidential Democrat candidate Kamala Harris – had to cancel a reservation Vance made because staff refused to serve him.\n\nThe suggestion that woke staff had refused to wait on the right-wing Republican swept local communities earlier this week - before being run by gossip site Popbitch. \n\nThe pub previously declined to comment in response to media queries to confirm or deny that they had cancelled the VP's planned dinner.","summary":"The no-fly zone was set up for security reasons during JD Vance's residence in the hamlet of Dean this August.","url":"https://www.dailymail.co.uk/news/article-15007943/Jeremy-Clarkson-response-security-JD-Vance-no-fly-zone-Cotswolds.html","image":"https://i.dailymail.co.uk/1s/2025/08/17/10/101140203-0-image-m-40_1755423520844.jpg","video":null,"publish_date":"2025-08-17 10:10:11","author":"Editor,Katherine Lawton","authors":["Editor","Katherine Lawton"],"language":"en","source_country":"gb","sentiment":0.021},{"id":351886548,"title":"Jena Friedman: Motherf*cker review – political zingers and all-too-raw grief","text":"Standup shows about losing a parent – “dead dad shows”, they get called – have become a genre unto themselves in recent times, and nowadays tend to arrive couched in self-awareness and alertness to cliche. No such irony attends Jena Friedman’s show about (among other things) the death of her mother, which – three years on from that event – is palpably raw and vulnerable. The parallels Friedman draws between loss of a parent and the decline of American democracy are lucid. But elsewhere her material on bereavement feels insufficiently processed and too painful, frankly, dissipating the energy of the 42-year-old’s big-hitting opening half.\n\nThe jaundiced tone of Motherf*cker is established from the off, as Friedman enters the stage flag-waving in a Maga cap to the strains – and it is a strain – of patriotic country music. “I look like a Republican’s wife,” she says, before launching one satirical hand-grenade after another, about abortion in the US, how the Democrats should have run Kamala Harris’s campaign, and how her unborn baby resembles Jeffrey Epstein. The in-your-face material is greeted variously with startled laughter, sometimes dazed silence (“you can’t rape a foetus”), and nonplussedness – see one routine sharing the home addresses of Republican lawmakers, which might be more worthwhile for an American audience.\n\nAll this is just buildup to the tale of Friedman’s overlapping pregnancy and bereavement. She’s anxious about becoming a parent, turning to her mother for support – only for mum to be given a cancer diagnosis and weeks to live. There’s some meconium-black comedy on how these processes mirror one another (on her son’s difficult birth: “I didn’t want to leave my mum either”) and a could-be-fun closer about her mum intervening (or is she?) from beyond the grave. But their humour is undermined by Friedman’s emphasis on how damaged she was, and still is, by her loss. There’s some awkward crowdwork, too, which includes repeated apologies for the “gross” venue and her miming, apropos of not much, the mass-shooting of her audience. Motherf*cker makes an impact, politically and personally, but not always a comic one.\n\n At Monkey Barrel at the Hive, Edinburgh, until 24 August","summary":"Monkey Barrel at The Hive, Edinburgh\nThe standup follows a first half of in-your-face jokes about American democracy with a palpably painful account of the loss of her mother\n\nStandup shows about losing a parent – “dead dad shows”, they get called – have become a genre unto themselves in recent times, and nowadays tend to arrive couched in self-awareness and alertness to cliche. No such irony attends Jena Friedman’s show about (among other things) the death of her mother, which – three years on from that event – is palpably raw and vulnerable. The parallels Friedman draws between loss of a parent and the decline of American democracy are lucid. But elsewhere her material on bereavement feels insufficiently processed and too painful, frankly, dissipating the energy of the 42-year-old’s big-hitting opening half.\n\nThe jaundiced tone of Motherf*cker is established from the off, as Friedman enters the stage flag-waving in a Maga cap to the strains – and it is a strain – of patriotic country music. “I look like a R","url":"https://www.theguardian.com/stage/2025/aug/17/jena-friedman-motherfcker-review-monkey-barrel-at-the-hive-edinburgh","image":"https://i.guim.co.uk/img/media/d632c17d996f84d6637338c8c54088868da21154/0_945_4016_3209/master/4016.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-08-17 10:00:27","author":"Brian Logan","authors":["Brian Logan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.341},{"id":351784584,"title":"Sorority Girls Are the Right's Latest Obsession","text":"If you've taken a quick glance at social media over the last few weeks, you'll likely have spotted two things. The first, viral posts of sorority girls dancing, part of the #RushTok trend that's been picking up steam as university life kicks off in August. The second, equally viral posts that the left is mad about it.Social media is inundated with posts claiming that the videos of sorority girls are proof that America is \"back,\" a return prompted by the election of President Donald Trump and a cultural shift toward conservatism.If the narrative online is to be believed, the comeback has come much to the dismay of the left. But how mad is the left really? While posts outlining their outrage in response to sorority girls receive millions of views online, the outrage itself is harder to find.As the right zeros in on sorority girls as evidence of a changing political culture, they are ushered into the echelons of the conservative hot girl, a new-age political pin-up, that this time comes complete with choreographed dances and coordinated outfits.But are these videos actually having a political impact outside of the right, or is the idea that they are an invented issue to fan the flames of a culture war? Newsweek spoke with experts to find out more.The Viral Phenomenon of the Sorority GirlStanding in front of red, brick buildings, adorned by circular columns and Greek lettering, sorority girls dance in unison. The movements are synchronized, the smiles are wide, and the energy is infectious.And millions of pairs of eyes fall upon the videos. Sororities and fraternities have been a cornerstone of pop culture for decades, in part thanks to movies like Legally Blonde, The House Bunny and Neighbors. Videos like this have been going viral over the past few years, but they have largely been divorced from political conversations, until now.This interest, though, isn't surprising, according to Diana Z. O'Brien, a professor of political science at Washington University in St. Louis.\"For years, there's been extensive media coverage of how both universities and young women tend to lean left politically,\" O'Brien said. \"Against that backdrop, young women at universities participating in activities perceived as more conservative—such as joining certain sororities—is going to spark the interest of some observers.\"The direct response to these videos is often positive. The comment sections are filled with fire emojis, compliments on their outfits and replies like \"go girls!\"But with great virality comes great visibility, and there is a significant amount of negativity in response to this trend. According to a recent report from The Independent, some sorority girls have stepped away from posting, and some sororities have advised against posting, or, speaking to the press.Some sororities regularly going viral include Alpha Chi Omega, University of South Carolina; Kappa Kappa Gamma, Oklahoma State University; Alpha Chi Omega, University of Tennessee; Delta Gamma, University of Tennessee; and Delta Zeta, University of Georgia. Newsweek has contacted these sororities for comment via social media message.Looking at the content, it appears there is little either tangentially or tangibly political about it. But that hasn't stopped it from becoming a political symbol.Joe Kinsey, of the outlet Outkick, wrote in a post on X: \"The purple hair lesbians have to be furious that SEC sororities ARE BACK.\" As of press time, that post has been viewed 37 million times.In an email shared with Newsweek, Kinsey said: \"After years of being told that biological males should be in the pool winning national championships over U.S. Olympic female swimmers, and that it was the fair thing to do, this country is back to a place where sorority girls & Sydney Sweeney now run the show, and a huge swath of America seems to love that cultural shift.\"He continued: \"Have sorority girls always been doing their thing since TikTok was invented? Sure, but pop culture narratives were being run by fanatics on the coasts with the help of their sympathetic friends in the left-wing media. This country has clearly experienced a shift in the dominant voices with sororities and Sweeney appearing ready to lead the way.\"Kinsey's comments reference first the discourse over trans women competing in women's sports, something that has been a hot button issue in online culture wars for years. In February, Trump signed an executive order blocking trans women from participating in women's sports, which has been condemned and criticized by advocacy groups and the LGBTQ+ community.A post on X from Fox News about the phenomenon reads in part: \"The viral 'RushTok' trend is making waves once more, with some calling it proof that \"America is back,\" describing sorority girls as \"warriors on the frontline of TikTok\" pushing back on lockdown-era culture and showing renewed Gen Z patriotism.\" The post has been viewed more than 450,000 times as of reporting.On the other side of the coin, though, are people arguing that there isn't a real political connection here. One post shared a video of the sorority Texas Aephi, University of Austin, and was captioned \"MAGA Texas girls are beautiful.\" The post was shared by an account that highlighted that the sorority is in Austin, which is in Travis County, which voted for then-Vice President Kamala Harris in 2024.Generally speaking, when it comes to politics, young women tend to identify as liberal. Polling from Gallup shows that an average of 40 percent of young women identified as liberal between 2017 and 2024, an increase from 32 percent for 2008 to 2016, and from 28 percent for 2001 to 2007.Newsweek spoke with pop culture content creator Morgan Harris, aka @Yaptrapped, about this trend.\"The schools that are famous in Rushtok and really gave rise to it are mostly located in the South, I think these sorts of videos can act as a sort of advertisement for who conservative young women are even though in reality you have no idea of the political leanings of everyone that is in that video,\" Harris said.O'Brien echoed this, telling Newsweek that the conversations should center on the sorority members themselves, rather than \"just the political meanings outsiders attach to them.\"New Chapter in the Culture Wars PlaybookAmid the disparate online discourse about the trend lies a question: Why are social media trends like this used in online culture wars, and what role do they play?Dr. Mary Anne Franks, Eugene L. and Barbara A. Bernard professor in intellectual property, technology and civil rights law at George Washington University Law School, told Newsweek via email: \"Fabricated controversies are the currency of the online culture wars, and that is why the right tends to win them.\"\"Outrage bait like \"liberals HATE this new trend!\" doesn't just activate tired stereotypes and trigger negative emotional responses, it also serves to distract us from true outrages and exhaust the psychological resources we need to process and respond to them,\" Franks said.Newsweek also spoke with Dr. Stacey Kerr, an independent researcher, and Mardi Schmeichel, an associate professor in the College of Education and Human Sciences at the University of Nebraska-Lincoln, who shared joint responses about the trend.\"The political right's framing of sorority videos as \"making the left mad,\" despite no evidence of widespread outrage, is a classic right-wing tactic: manufacturing a fake conflict as a way to signal dominance,\" they said.\"The truth of the claim doesn't matter; in fact, the falsity is part of the point. By claiming that feminists and liberals are furious, right-wing commentators get to perform a win on two fronts: they cast themselves as lighthearted defenders of \"fun\" and \"tradition\" and they invite their audience to savor the imagined spectacle of their opponents seething.\"\"Part of why this works so well in the context of RushTok is its sheer popularity: the videos draw huge audiences and have become an easy cultural reference point,\" they added.Newsweek also spoke with Deen Freelon, a professor at the Annenberg School for Communication, University of Pennsylvania, about the trend.\"This seems to be the latest iteration of a broader phenomenon in which conservative individuals accuse left-leaning people of holding views the latter deny holding,\" Freelon said.\"I think it shows how little the right understands the left [although the opposite may be true as well], and how much popularity and money there is to be gained in stoking division around even the most trivial of matters,\" Freelon added.Pom-poms, Pep, and PoliticsThe online obsession with sorority girls comes at a time when conservative politics has become obsessed more generally with women. Whether it's the rise of the conservative hot girl, the proliferation of the trad wife, or the conservative female influencer, the face of right-wing politics is changing. There's a new political poster girl in town, and she's putting on her MAGA cap with a manicured hand.While the actual politics of sorority girls is blurry, the aesthetic plays into the shift and new gendered era of politics that has been unfolding online in recent years. This may be playing a part in why conservatives have latched onto this content.Catherine Rottenberg of Goldsmiths, University of London, told Newsweek: \"These images of sorority girls dancing and ostensibly celebrating 'America'—are part of a larger MAGA gendered aesthetic.\"Rottenberg said that the celebration of these clubs and organizations, and the way they are framed, reinforces a gender binary: \"The idea that we need women to be women and men to be men.\"Rottenberg added that while distraction might be \"part of the strategy,\" with this trend, it is also indicative of a wider promotion of \"ideas of gender and femininity.\"Kerr and Schmeichel echoed this, telling Newsweek: \"Women's bodies and choices have always been a political battleground, and the women participating in these hyper-feminized sorority performances are primed to serve as avatars for a \"victorious\" traditional America, with young, white, conventionally attractive women joyfully embracing old-school femininity in open defiance of what the right paints as liberal efforts to stamp it out.\"The content creator @yaptrapped highlighted a similar theme, telling Newsweek: \"Conservatives need beautiful young conservative women to sell the dream of the traditional family to young conservative men and so I can see how those videos would be a powerful advertisement for that, even though it is a false advertisement based on details you couldn't possibly know about people in an internet video.\"","summary":"The newest political pin-up has choreographed dances and coordinated outfits, and may be a symbol of the latest chapter in a series of online culture wars.","url":"https://www.newsweek.com/college-sorority-girl-rush-tok-conservative-left-liberal-america-politcs-2114120","image":"https://d.newsweek.com/en/full/2702705/sorority-girls-are-rights-latest-obsession.png?w=1600&h=900&q=88&f=59a3f99ed08e4ce41e3a27f279d4d0a3","video":null,"publish_date":"2025-08-17 09:00:03","author":"Marni Rose McFall","authors":["Marni Rose McFall"],"language":"en","source_country":"US","sentiment":-0.085},{"id":351784576,"title":"Donald Trump's Approval Rating Plummets With Millennials","text":"President Donald Trump's approval rating has plummeted with millennials, hitting its lowest level of the year in August, according to new polling.According to YouGov/Economist polling, in June, 40 percent of millennials approved of Trump's job performance while 53 percent disapproved—a net rating of -13 points. That slid to 41-57 (-16) in July before plunging to 33-56 (-23) in August.The figures show a 10-point drop in net approval in just two months, underscoring growing dissatisfaction among millennials as the 2025 political season intensifies.Why It MattersTrump, who has long highlighted strong polling at rallies and press events, now faces slipping approval ratings that could weaken his influence and hurt Republican prospects in the 2026 midterms.After returning to the White House in January with solid numbers, his support has eroded amid economic concerns, tariff backlash and political discontent. Trump and former Vice President Kamala Harris have turned to podcasts and digital outreach to court millennials, a generation wary of legacy media and traditional messaging.Millennials are defined generally as people born from 1981 to 1996. The generation has overtaken baby boomers as the largest age demographic, according to the Pew Research Center.What To KnowThe poll shows that Trump's declining popularity among millennials is being driven by worsening views on the economy and inflation.\"Millennials have yet to see the sweeping national renewal Trump promised,\" Thomas Gift, an associate professor of political science and director of the Centre on US Politics at University College London, told Newsweek.On the economy, Trump's approval among millennials slipped from 36 percent approval and 52 percent disapproval in June to 38 percent approval and 54 percent disapproval in August, showing that approval and disapproval has edged up the same.Inflation also appears to be a particular weak spot. Approval in this area dropped from 33 percent in June to 27 percent in August, while disapproval rose from 58 percent to 60 percent. The shift suggests heightened concern among younger voters about persistent price pressures.That comes as inflation rose to 2.7 percent in June despite Trump's previous promise to end inflation on day one of his second term.\"Starting on day one, we will end inflation and make America affordable again, to bring down the prices of all goods,\" he said during a rally in Bozeman, Montana, in August 2024.Meanwhile, job growth slowed sharply in July, with just 73,000 new jobs added—down from 147,000 the previous month, according to the U.S. Bureau of Labor Statistics. After last month's jobs report was published, Trump fired BLS Commissioner Erika McEntarfer. In a post, Trump accused McEntarfer—without offering evidence—of rigging the numbers to harm his administration. But that move by Trump was not popular among millennial voters, with only 16 percent saying the decision was justified.There are also concerns about Trump's tariff program. Commerce Secretary Howard Lutnick predicted $50 billion in monthly revenue from the new import taxes, which came into effect this month. But JPMorgan warned that 60 percent of the increased costs are expected to be passed on to American consumers through higher prices.\"On the consumer side, many remain burdened by rising prices under his tariffs, while housing in particular continues to be out of reach for a generation still struggling to get a foothold on the economic ladder,\" said Gift. According to Federal Reserve data, millennials own less than two-thirds of the real estate that baby boomers owned at the same age.But it's not all bad news for Trump. His handling of immigration remains a relative bright spot with this age group. Approval rose from 33 percent to 41 percent over the same period, while disapproval fell from 58 percent to 50 percent, marking an 8-point net improvement.Throughout his second term, Trump has aggressively expanded immigration enforcement—launching mass deportation operations, increasing raids in sanctuary cities and reviving thousands of old deportation cases.His administration has also dramatically scaled up detention capacity, allocating $45 billion to expand ICE facilities and construct large-scale temporary camps, including a facility in Florida nicknamed \"Alligator Alcatraz.\"But while Trump has continued to push the hardline immigration agenda that helped him win support in 2024, polls indicate that backing for those policies is fading across other demographic groups.Gallup polling from last month showed that 30 percent of Americans now say immigration levels should be reduced, down from 55 percent in 2024. Support for maintaining or increasing immigration has risen across the board, including among Republicans.More broadly, the number of Americans who view immigration as a \"good thing\" has reached an all-time high of 79 percent, the same poll shows, reversing a steady decline during Joe Biden's presidency and surpassing levels from Trump's first term.What Happens NextTrump's new nominee to run the BLS, E.J. Antoni, chief economist at the conservative Heritage Foundation, hinted at suspending the monthly release of jobs data. August's numbers are due to be published the first week of September.","summary":"In June, 40 percent of millennials approved of his job performance while 53 percent disapproved, according to YouGov/Economist.","url":"https://www.newsweek.com/donald-trump-approval-rating-polls-millennials-2113610","image":"https://d.newsweek.com/en/full/2702460/donald-trumps-approval-rating-plummets-millennials.png?w=1600&h=900&q=88&f=71bcf227838a56f5e692be33ecdcc2b7","video":null,"publish_date":"2025-08-17 09:00:02","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","category":"politics","source_country":"US","sentiment":-0.261},{"id":351781834,"title":"Howie Carr: Stuck in the news spin cycle","text":"Nobody asked me but:\n\nI’d have more confidence in new MSP Col. Geoffrey Noble if he hadn’t gone native and embraced the cone head look.\n\nIs that his own personal homage to all the Canton cone heads – Michael Proctor, Brian Tully, Joseph Paul, Jailbird Chris Albert etc. – not to mention the drunkard sheriff of Hampden County, Nick Cocchi?\n\nThe latest illegal-alien sob story is that the ICE round-ups mean they can’t go to church.\n\nThis is quite the new phenomenon for all the gangbangers, fentanyl dealers, girlfriend-beaters, drunk drivers and pedophiles — going to church.\n\nKinda like all the thugs who get sent to prison and suddenly find Jesus, or Allah, or somebody and then invariably become role models for the younger jailbirds, or so they claim to the parole board.\n\nI actually saw a photo in regime-controlled media this week of a foreign freeloader posing in front of a picture of Jesus – what malarkey, as Joe Biden would say.\n\nWhenever you read about somebody’s final message before death, it’s always either “chilling” or “eerie.”\n\nIs there anything sadder than a politician being described as a “perennial candidate?”\n\nCurtis Sliwa, I’m talking to you.\n\nIf you’re a politician so corrupt that you’re called “embattled,” at least theoretically you’ll get a chance at trial to prove your innocence.\n\nJust ask runaway sheriff Steve Tompkins.\n\nJust don’t go to Maine for the weekend, Sheriff. It didn’t end well for another embattled top hat-wearing sheriff by the name of DiPaola.\n\nWhen Democrats talk about saving “democracy,” what they really mean is saving “bureaucracy.”\n\nHeadline: “Kamala Harris Says System is ‘Broken.’”\n\nTranslation: I lost the last election, even though I had a billion dollars.\n\nHeadline: “Schiff Complains Democracy is Under Attack.”\n\nTranslation: That mortgage-fraud grand jury has got me cold.\n\nA word that no longer means to readers what regime-controlled media think it does:\n\nExperts, as in “experts say….”\n\nThe experts quoted by the press always have the same solutions: higher taxes and energy prices, mandatory lockdowns and racist policies across the board, among other insane suggestions, but never more freedom or real equality.\n\nAnother word that no longer has any real meaning: “restitution.”\n\nWhen was the last time any of these thieves ever paid back even a dime of the money they stole?\n\nWhatever happened to the Bartley-Fox gun law in Massachusetts?\n\nOr the even older Sullivan Act in New York?\n\nThey were supposed to lock up thugs using illegal firearms, but somehow, the Democrats lost interest in jailing violent criminals – at least the ones from the protected classes.\n\nWhenever I see one of those “No Kings” demonstrations with all the geriatric mask-wearing fugitives on walkers from assisted-living facilities, I remember what the late City Councilor Dapper O’Neil used to say whenever some old bats were railing against him:\n\n“They oughta be home, prayin’ for a happy death.”\n\nGov. Gavin Newsom apparently never saw the old Brylcreem ad on TV:\n\n“A little dab’ll do ya.”\n\nDid you notice the deer-in-the-headlights look that Pamela Smith, DC’s DEI Metro police chief, got when a reporter asked her about the “chain of command” in her department?\n\nNow that she’s been demoted by AG Pam Bondi, maybe “Chief” Smith will be able to figure out what a chain of command is.\n\nSpeaking of which, as bad as he is, is it possible that BPD Commissioner Michael Cox is the last male police chief of a major US city?\n\nSen. Bernie Sanders can’t stop yapping about the “working class,” but he has about as much hands-on experience with real jobs as Gov. J.B. Pritzker has with salad bars.\n\nIs it Beto O’Rourke, or Beta?\n\nDo you kiss your mother with that filthy mouth of yours, Beta, and when are you going to personally start trying to take away the AR-15’s and AK-47’s of real Texans who in fact own them?\n\nOf Market Basket boss Arthur T. DeMoulas’ three sisters, Frances is 75, Glorianne is 73 and Caren is 66.\n\nEven as Artie T. was paying down the $1.5-billion loan he used to buy out the other side of the family, each of the Golden Girls was reportedly getting $40 million a year in dividends, for doing nothing.\n\nWhy kill the golden goose, Golden Girls, especially when you’re on the back nine?\n\nInstead, they’re behaving like the three witches in Macbeth, stirring the pot.\n\n“Double, double toil and trouble/Fire burn, and cauldron bubble/Fair is foul, and foul is fair.”\n\nWinning: Far-left PBS is cutting their budget 20%, as the $500 million cuts are having a “negative rippling effect” on their agitprop distribution.\n\nWait, didn’t these tax-funded hyenas tell us for decades that they only got 1% or 8% of their budget from the filthy taxpayers in pickup trucks with MAGA hats that they despise so much?\n\nThat “negative rippling effect” on NPR is giving me a positive chuckling effect.\n\nSuggestion for the state Republican party: introduce a bill to make Harvard pay its “fair share,” say, an annual 2% wealth tax on their $53-billion endowment, you know, for the children, the infrastructure, the investments in the future blah-blah-blah….\n\nIsn’t 2% the same number that the fake Indian and Bernie wanted to assess on Americans who, unlike themselves, work for a living?\n\nOn the top of the Sagamore Bridge, there’s a sign that says it was built in 1933-34 – two years.\n\nHow long do you think it will take to construct the replacement Sagamore Bridge?\n\nAnyone who believes the hacks’ eight-year estimate obviously doesn’t remember the Big Dig, and compared to Maura Healey’s box-checking blow-in crew, the Big Dig was managed by engineering geniuses.\n\nWho could have ever predicted that New Orleans Mayor LaToya Cantrell would be indicted before NY Attorney General Leticia James?","summary":"When Democrats talk about saving “democracy,” what they really mean is saving “bureaucracy.”","url":"https://www.bostonherald.com/2025/08/17/howie-carr-stuck-in-the-news-spin-cycle/","image":"https://www.bostonherald.com/wp-content/uploads/2025/08/Bald2.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-17 07:40:17","author":"Howie Carr","authors":["Howie Carr"],"language":"en","source_country":"us","sentiment":-0.422},{"id":351721576,"title":"Bill Maher Blasts Dems He Voted For Who Are 'Afraid' to Do His Show, Credits GOPers","text":"On Friday night's Real Time, HBO host Bill Maher called out Democrats like former Vice President Kamala Harris and Bill and Hillary Clinton for refusing to appear on his show despite the fact that he voted for them. Just before the scolding he was making fun of how Donald Trump had an employee nicknamed \"Big Balls,\" and said it's like Gov. Gavin Newsom had an aide named \"Perfect Hair.\"\n\nThen he added: \"Hey, at least Gavin comes here. People ask me all the time: Why haven't you ever had Hillary or Bill Clinton on? Why didn't you have Kamala on during the last campaign? You think we don't ask? We ask these people every week. They say no,\" he said. \"It took eight years and a petition to get Obama on.\" Maher gave $1 million to support Obama's re-election in 2012.\n\n\"And these are people — all people I voted for. Think about that. They're afraid to come on the show of a guy who voted for them,\" he jeered. \"The Republicans, they show up and when they do, they take their beating like a man.\"\n\nThe late-night host then played a montage of conservatives appearing on Real Time and taking his rhetorical beating. He showed none of their answers, just the beatdowns. He displayed former Speaker of the House Kevin McCarthy, former Attorney General Bill Barr, Florida Governor Ron DeSantis, Senator Ted Cruz, and MAGA podcaster Steve Bannon.\n\nMaher also showed pictures of Republican Reps. Nancy Mace and Dan Crenshaw.\n\nAfter this clip package, he returned to the Democrats. \"Look, I would love to have AOC on the show, and [Zohran] Mamdani and Elizabeth Warren, but I can't subpoena the guests and I can't fix that,\" Maher lamented. Then he joked: \"What the Democrats are scared of more than anything else. I mean, obviously, besides gluten, is being primaried from the far left, even though most Democrats are not far left, they're mild-mannered and moderate. At least at my bath house.\"\n\nMaher concluded with a lecture: \n\nIf there is one practical thing that Democrats can do right now that would help them regain power it's never speak to Donald Trump in person -- no, I'm kidding, that's stupid -- no, it's this: Inspire your moderates to vote in the primaries. Get that base excited -- you have the numbers. After Congressman [Seth] Moulton made his comment about his daughter not getting run over [competing with male athletes], he added \"but as a Democrat I'm supposed to be afraid to say that.\" Well then, change what you're supposed to be afraid of.","summary":"On Friday night's Real Time, HBO host Bill Maher called out Democrats like former Vice President Kamala Harris and Bill and Hillary Clinton for refusing to appear on his show despite the fact that he voted for them. Just before the scolding he was making fun of how Donald Trump had an employee nicknamed \"Big Balls,\" and said it's like Gov. Gavin Newsom had an aide named \"Perfect Hair.\"\n\nThen he added: \"Hey, at least Gavin comes here. People ask me all the time: Why haven't you ever had Hillary or Bill Clinton on? Why didn't you have Kamala on during the last campaign? You think we don't ask? We ask these people every week. They say no,\" he said. \"It took eight years and a petition to get Obama on.\" Maher gave $1 million to support Obama's re-election in 2012.\n\n\"And these are people — all people I voted for. Think about that. They're afraid to come on the show of a guy who voted for them,\" he jeered. \"The Republicans, they show up and when they do, they take their beating like a man.\"\n\nThe late-night host then","url":"https://www.newsbusters.org/blogs/nb/tim-graham/2025/08/16/bill-maher-blasts-dems-he-voted-who-are-afraid-do-his-show-credits","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-08/Real%20Time%20With%20Bill%20Maher-10_56_46%20pm-2025-08-15-0.jpg?itok=3B_ImPp3","video":null,"publish_date":"2025-08-16 22:34:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.435},{"id":351786578,"title":"'Unforgiving': Experts explain why Gen-Z moving is moving to the right","text":"During his 2024 presidential campaign, Donald Trump not only rallied his hardcore MAGA base — he also reached out to independents, swing voters, Latinos, the Manosphere and Generation Z. And it worked. Trump won the popular vote for the first time — not by a landslide, but defeating Democratic nominee Kamala Harris by roughly 1.5 percent nationally was enough to get him past the finish line.\n\nThe inroads Trump made with Gen-Z in 2024 has been a major source of frustration among Democratic strategists. During an appearance on The Bulwark's vodcast posted on Saturday afternoon, August 16, Laksha Jain — co-founder of the elections analysis website Split Ticket — offered reasons why some members of Gen-Z have been moving right.\n\nJain, himself a member of Gen-Z, told hosts Tim Miller and Cameron Kasky that Gen-Zers are interested in \"results,\" not rhetoric.\n\nREAD MORE: MAGA found a new way to 'own the libs' — and it bombed\n\n\"Eventually,\" Jain told Miller and Kasky, \"policymakers respond to reality…. Eventually, the electorate makes it clear: They want to see results. And if they don't get it, they aren't hesitant about throwing you out.\" \n\nJain stressed, however, that Democrats haven't necessarily lost Gen-Z voters for good, but they need a strong message. \n\nMiller, a Never Trump conservative and ex-GOP strategist, asked Jain to discuss Gen-Z's relationship with the \"woke\" movement and complaints from Gen-Zers who find \"woke\" politics \"shrill,\" \"thin-skinned\" and \"unforgiving.\"\n\n\"The attitude that people have had has definitely taken a shift against woke,\" Jain told Miller and Kasky. \"That is true; you can look at any number of surveys and see that….. (But) I don't think this was something that was the driving factor behind why a lot of young men turned against the Democratic Party. Honestly, if you're looking at progressive overreach, you might want to start with COVID. Because that was what closed their schools down.\"\n\nREAD MORE: 'Trolling the president': How the myth of Trump's mental fitness has finally been revealed\n\nJain continued, \"That was what made their go home from college….. I don't think the woke itself was the key driver why these people turned away. I think if you want to blame progressive overreach, you should probably look at COVID and then, the governance of the Biden Administration.\"\n\nREAD MORE: 'Pathetic and utterly irresponsible': Melania Trump slammed for 'weak performative stunt'\n\nWatch the full video below or at this link.\n\n - YouTube www.youtube.com","summary":"During his 2024 presidential campaign, Donald Trump not only rallied his hardcore MAGA base — he also reached out to independents, swing voters, Latinos, the Manosphere and Generation Z. And it worked. Trump won the popular vote for the first time — not by a landslide, but defeating Democratic nominee Kamala Harris by roughly 1.5 percent nationally was enough to get him past the finish line.\n\nThe inroads Trump made with Gen-Z in 2024 has been a major source of frustration among Democratic strategists. During an appearance on The Bulwark's vodcast posted on Saturday afternoon, August 16, Laksha Jain — co-founder of the elections analysis website Split Ticket — offered reasons why some members of Gen-Z have been moving right.\n\nJain, himself a member of Gen-Z, told hosts Tim Miller and Cameron Kasky that Gen-Zers are interested in \"results,\" not rhetoric.\n\nREAD MORE: MAGA found a new way to 'own the libs' — and it bombed\n\n\"Eventually,\" Jain told Miller and Kasky, \"policymakers respond to reality…. Eventually, th","url":"https://www.alternet.org/they-want-results-elections-analyst-details-reasons-for-gen-z-moving-right/","image":"https://www.alternet.org/media-library/image.jpg?id=54534776&width=1200&height=600&coordinates=0%2C454%2C0%2C454","video":null,"publish_date":"2025-08-16 21:03:04","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.167}]}