{"offset":0,"number":50,"available":467,"news":[{"id":308376294,"title":"Mark Cuban admits he only supported Kamala Harris because ‘she wasn’t Donald Trump’","text":"Smith then asked if Cuban would have voted differently if the Republican Party’s presidential nominee was someone other than Trump, such as former U.N. Ambassador Nikki Haley or Gov. Ron DeSantis (R-FL). In response, Cuban pointed to how he voted for Haley in the Texas primary, adding that while he did not see eye-to-eye with Haley on everything, he would have “considered” supporting her if she were the nominee for president. \n\nCuban also said he did not want to throw Harris “under the bus,” contending that she is “smarter than what people give her credit for.” However, he criticized her campaign staff, arguing they held her back from doing “basic things that would have made a lot of difference.”\n\nGoing forward, Cuban said he has spoken to the Trump administration about healthcare and the cost of pharmacy, citing his success with CostPlus, his online pharmacy company. He added that he is “all about Team USA,” and expressed a desire to help the country regardless of who is president.\n\nIF TRUMP WANTS TARIFF RECIPROCITY, HE MUST REJECT LUTNICK AND NAVARRO\n\n“If I can help cut the cost of healthcare in the United States of America, it doesn’t matter who the president is, whether I like him or dislike him, I’m going to do what I can,” Cuban said.\n\nFollowing Election Day, Cuban congratulated both Trump and Elon Musk on the election results, stating that Trump won the election “fair and square.”","summary":"Billionaire Mark Cuban revealed that his support for former Vice President Kamala Harris stemmed from how “she wasn’t Donald Trump” when asked in a new interview why he campaigned for Harris in 2024. Cuban was one of several celebrities to support Harris in her presidential campaign bid against then-presidential candidate Donald Trump, which included an [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3371760/mark-cuban-only-supported-harris-was-not-trump/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/Mark-Cuban-on-Harris-support.webp","video":null,"publish_date":"2025-04-06 23:44:14","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.217},{"id":308369046,"title":"Report: Doug Emhoff Blasts His Law Firm for Making Deal with President Trump","text":"Former Vice President Kamala Harris’s (D) husband, Doug Emhoff, reportedly criticized his own law firm Thursday for its recent dealings with President Donald Trump.\n\nA CNN report on Saturday cited sources who said Emhoff was speaking during a charity gala dinner in Los Angeles, California.\n\nThe article said, “Emhoff condemned the decision by his law firm to preemptively come to an arrangement with the Trump administration to avoid an executive order targeting the firm,” noting Emhoff is a partner at Willkie Farr & Gallagher LLP.\n\n“Emhoff told the crowd at the Annual Dinner Gala for the legal aid group Bet Tzedek he had told the firm he wanted to fight the threat of an executive order he found unconstitutional but had been overruled, the sources said,” According to CNN.\n\nTrump has been fighting back against “Big Law,” or huge law firms that “indirectly subsidized the Democrats’ ‘lawfare’ campaign against him, and that have encouraged lawyers to provide pro bono (free) work for the left,” Breitbart News reported March 28.\n\nThe outlet continued\n\n“Big Law” sits at the apex of a political pyramid that has served, until now, to institutionalize the power of the Democratic Party in American society.\n\nCritics of the president claim that he is abusing his power to target his political opponents. The opposite is true: he is restoring balance and justice, allowing conservative attorneys and clients — as well as conservative law students — the same rights and opportunities that liberals have enjoyed.\n\nIn Trump’s post regarding the agreement with Willkie Farr & Gallagher LLP, the president detailed some of the actions to be taken by the firm.\n\n“Willkie will provide a total of at least $100 Million Dollars in pro bono Legal Services, during the Trump Administration, and beyond, to causes that President Trump and Willkie both support, in relation to the following areas: Assisting Veterans and other Public Servants including, among others, members of the Military, Gold Star families, Law Enforcement, and First Responders; Ensuring fairness in our Justice System; and Combatting Antisemitism,” his Truth Social post read.\n\n“Willkie’s pro bono Committee will ensure that new pro bono matters are consistent with these objectives, and that pro bono activities represent the full political spectrum, including Conservative ideals,” it continued.\n\nTrump also said the firm will not engage in illegal diversity, equity, and inclusion (DEI) discrimination and preferences.","summary":"Former Vice President Kamala Harris's (D) husband, Doug Emhoff, reportedly criticized his own law firm Thursday for its recent dealings with President Donald Trump.\n\n\nThe post Report: Doug Emhoff Blasts His Law Firm for Making Deal with President Trump appeared first on Breitbart.","url":"https://www.breitbart.com/law-and-order/2025/04/06/report-doug-emhoff-blasts-his-law-firm-for-making-deal-with-president-trump/","image":"https://media.breitbart.com/media/2025/04/GettyImages-2176517780-640x335.jpg","video":null,"publish_date":"2025-04-06 21:17:30","author":"Amy Furr","authors":["Amy Furr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.11},{"id":308359006,"title":"If Kamala Harris had beaten Donald Trump in the election, how do you think the United States would be doing today?","text":"You've been blocked by network security.\n\nTo continue, log in to your Reddit account or use your developer tokenIf you think you've been blocked by mistake, file a ticket below and we'll look into it.Log in File a ticket","url":"https://www.reddit.com/r/AskReddit/comments/1jt4my4/if_kamala_harris_had_beaten_donald_trump_in_the/","image":null,"video":null,"publish_date":"2025-04-06 21:11:30","author":"u/Piki18","authors":["u/Piki18"],"language":"en","category":"politics","source_country":"US","sentiment":-1},{"id":308343968,"title":"Ex-VP candidate Tim Walz forced to admit it ‘could be the case’ Dems’ denials about Biden hurt party in 2024","text":"Minnesota Gov. Tim Walz conceded Sunday that history may judge Democrats for failing to acknowledge that former President Joe Biden wasn’t up to the grueling task of running the country for another four years. \n\nInitially, the former Democratic vice presidential nominee tried to evade questions about whether Dems made a mistake by failing to acknowledge Biden wasn’t up to the job, before ultimately admitting that may have been the case. \n\n“He made that decision,” Walz told CNN’s “State of the Union” Sunday when pressed by host Jake Tapper, who has written a book on Biden’s decline. \n\n“Look, history will tell us to go back on that. That very well could be the case, Jake,” Waltz later conceded when pressed again. \n\nThroughout his later years in office, Biden had been dogged by questions about his mental acuity, given his penchant for verbal flubs and perceived aloofness. Nonetheless, he decided to vie for reelection.\n\nThen came his disastrous debate against President Trump last June, which sparked a Democratic mutiny against him after he appeared tired and at times distracted. Walz emerged as a defender of Biden during the initial aftermath.\n\n“Yes, he’s fit for office,” Walz insisted to reporters days after the alarming debt and following a meeting he had with Biden.\n\n“None of us are denying Thursday night was a bad performance,” Walz added at the time. “It was a bad get, if you will on that. But it doesn’t impact what I believe — he’s delivering.” \n\nBiden dropped out of the 2024 race just shy of three weeks later as a growing chorus of Democrats publicly urged him to step aside. \n\n“What I’m concerned about is learning from those lessons. I would hope we would never do it again, make a mistake,” Walz added. “Make sure we go through and get someone. But I don’t know where it helps us going forward.”\n\nWalz, who turned 61 on Sunday, has been attending town halls in Republican strongholds across the country, railing against Trump in sharp contrast to former Vice President Kamala Harris, who has largely avoided the limelight\n\n“I’m certainly thinking about running again in Minnesota, if that’s what they want. I am not thinking about running in 2028,” Waltz said when asked if he is eyeing a presidential run. “In this moment you’re planning for 2028, you’re going to get rolled by the people in the streets.”\n\nThe Minnesota gubernatorial election will take place next year.\n\n“When I criticize, I’m criticizing myself. I own this. I’m part of the ticket,” Walz said about criticisms that the Harris-Walz campaign message didn’t resonate with enough people. \n\n“It should have been a slam dunk for us to say, we’re the party that cares about that,” he argued of working class plights. “We’re the party that’s going to protect Social Security and Medicare. We’re the party that thinks the ACA is a good start, but we need to do more on health care. And we didn’t do that.”\n\nDuring his recent tour of the country, Walz turned heads by defending woke policies as well as diversity, equity and inclusion (DEI) initiatives. \n\n“I think what we allowed ourselves to do is, we got timid,” Walz explained. “That’s the point that I’m saying is Fox News will [criticize], oh, he’s for DEI — not your definition of DEI.\n\n“My definition is rule of law that’s fair, that everybody gets an opportunity. And that’s the point I think we have to make.”","summary":"Minnesota Gov. Tim Walz conceded Sunday that history may judge Democrats poorly for failing to acknowledge that former President Joe Biden wasn't up to the grueling task of running the country for another four years.","url":"https://nypost.com/2025/04/06/us-news/ex-vp-candidate-tim-walz-forced-to-admit-it-could-be-the-case-dems-denials-about-biden-hurt-party-in-2024/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/101887368.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/nUUr6hZq-RyIcpnTz.mp4","publish_date":"2025-04-06 20:14:57","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.334},{"id":308332734,"title":"How Musk ushered 4chan into US politics","text":"Ayman Makarem\n\nIn the past few days, US media have been reporting that billionaire Elon Musk will step back from his leading role in President Donald Trump’s administration. This is after his highly publicised stint as unofficial head of the nongovernmental agency DOGE (Department of Government Efficiency) and various political initiatives – most recently, his campaign for the election of a conservative judge to a vacated Supreme Court seat in the state of Wisconsin – backfired.\n\nHow and when Musk will make his exit remains to be seen, but one thing is for sure: He will leave behind lasting damage that goes way beyond the disruptive work of his invention, DOGE. Through his behaviour online and offline, Musk has introduced incredibly toxic and cynical politics from the obscure fringes of the internet into the chambers of power in the world’s foremost superpower.\n\nHis Nazi gesture at an event following Trump’s inauguration on January 20 was a perfect illustration. Musk immediately weighed in on the accusation that he made a Nazi salute with a mix of denial and humour, making a slew of Nazi-themed jokes on his X account.\n\nDoing something outrageous and then denying the obvious is a clear case of “trolling” – a favourite practice in fringe internet spaces where toxic and cynical political views dominate. Among them is an infamous website called 4chan, which Musk is believed to frequent. Just at the start of this year, he decided to change his X account name to “Kekius Maximus” and his profile picture to a Pepe the Frog image – memes taken straight from 4chan. He has also openly referred to the site on his X account.\n\nAlthough many have heard of the website 4chan, there is still very little public understanding of what it is and how it is connected to the rise of the far right in the US.\n\nSimply put, it is a website where people can share text and image messages anonymously with no registration or login for users. It is a space for discussions, humour and the creation of an online community. Founded in 2003, 4chan reached 8.2 million visitors monthly in 2010 and 22 million in 2021.\n\nDue to the anonymous cover afforded by the website’s structure, users feel confident to express problematic and fringe political views usually mixed with a veil of humour. This irony-laden form of political expression has come to define the website. Often you would see racist, sexist and/or homophobic slurs posed as jokes. Anyone who calls these out is mocked even further for their naivety or sincerity.\n\nThe disclaimer under the main forum on 4Chan, /b/, states: “The stories and information posted here are artistic works of fiction and falsehood. Only a fool would take anything posted here as fact.”\n\nThis is exactly why journalists and commentators who took Musk’s denial of his Nazi salute at face value completely missed the point. To those far-right fans of Musk, the appeal of his actions was in fact reinforced by the very denial, by the fact that he did a fascist gesture so brazenly and then “got away with it”.\n\nMusk engaged in a transgressive act against what he describes as the “woke mind virus” or more traditionally “PC [political correctness] culture”. By adding humour to the equation, Musk and his fans were able to further obfuscate and derail any serious discussion about the implications of normalising Nazi symbols.\n\nAll of this is the primary function of “trolling”. Posed as merely a form of play, a way of pushing people’s buttons “for the lolz” (laughs), far-right actors are able to use this technique to shift the Overton window – or the range of acceptable terms or opinions – to the right.\n\nImmediately after Musk’s salute, far-right figures such as Nick Fuentes and Andrew Tate, mimicked the same salute and used the same distancing excuses that Musk employed. These are people who have gained tremendous amounts of social and political capital through online subcultures.\n\nHowever, it is not only the far right that employs memes and other expressions developed online to further its political goals. In fact, some may argue that these subcultures emerged as a response to what is described as the “memefication” of politics.\n\nIn her book Kill All Normies: Online Culture Wars from 4chan and Tumblr to Trump and the Alt-Right, Angela Nagle traces the origins of these subcultures to the US election cycle of 2008. Many will remember the “Hope” posters of Barack Obama’s presidential election campaign, which went viral across the internet. To Nagle, this was a crucial turning point in the use of memes, which at that point were a fresh and exciting new medium, in US politics.\n\nDespite the rhetoric of hope and change, the Obama administration did not deliver on its vague, utopian promises. This mismatch between the messaging and the reality spurred online debates that promoted mistrust as a healthy response to the insincerity of the political class.\n\nThereafter, on 4chan and other platforms, anyone who expressed strong support for any one party, cause or movement became the object of ridicule. This essentially formed a type of cynical, nihilistic view of the world and our place in it.\n\nFast forward to the 2024 election cycle, these dynamics were very much present again. Kamala Harris’s campaign relied on a rebranding of the Obama campaign and used the same empty memes, instead of focusing on policy or anything else rooted in reality. Not only did she rely heavily on celebrity endorsements, but also had her X account banner written with the same font and colour as the “brat” meme, a trend inspired by pop star Charli XCX’s Brat album cover.\n\nThe liberal political establishment in the US, which has further revealed its deep flaws over the past year and a half with its disregard for the struggles of poor Americans and triumphalist support for Israel’s genocidal war in Gaza, has not learned the lessons of the past decade and a half. Relying on hollow messaging while issues compound for most Americans – from skyrocketing inflation to growing inequality to climate collapse – does not invigorate voters.\n\nPolitics is not simply a meme battle. This is a lesson that should also be heeded by the wider public, especially those who re-shared the infamous Musk salute as a form of satire or ridicule. Even though many may have believed they were disparaging him by adding insults or jokes to it, in fact, they helped spread and legitimise the act itself as a spectacle.\n\nIt is time to acknowledge that we cannot meme our way out of fascism. The only way to defeat fascist trolls is to refuse to enter the arena, to refuse to play on their terms. That is, to insist on grounding discussions and actions in reality, to reject any of their obfuscations and to build actual (offline) power to resist the rise of the far right.\n\nIt is definitely no easy task, especially when the far right has entered the highest chambers of power in the US and has made strong gains in South America and Europe. The marriage of far-right discourse and symbolism matched with an unprecedented capture of wealth by the billionaire class and the rising authoritarianism within these countries has thrown many into hopelessness and despair.\n\nIn response to the rise of the likes of Musk, we need a kind of repoliticised hope to combat the intentional despair feeding the far right. We need a sincere hope that is rooted in an acknowledgement that we cannot afford to do nothing and that there is a way to resist through collective action, to build new alternatives and to embrace new visions of the future.\n\nCourtesy: aljazeera","summary":"Ayman Makarem In the past few days, US media have been reporting that billionaire Elon Musk will step back from his leading role in President Donald Trump’s administration. This is after his highly publicised stint as unofficial head of the nongovernmental agency DOGE (Department of Government Efficiency) and various political initiatives – most recently, his [&#8230;]","url":"https://thefrontierpost.com/how-musk-ushered-4chan-into-us-politics/","image":"https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvdGhlZnJvbnRpZXJwb3N0LmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDRcL0EtNS53ZWJwIiwidHh0IjoiSG93IE11c2sgdXNoZXJlZCA0Y2hhbiBpbnRvIFVTIHBvbGl0aWNzIiwidGVtcGxhdGUiOiJoaWdod2F5I","video":null,"publish_date":"2025-04-06 18:59:17","author":"The Frontier Post","authors":["The Frontier Post"],"language":"en","category":"politics","source_country":"pk","sentiment":0.032},{"id":308337056,"title":"Legacy media, DC journos come around to investigating Dem scandals years after conservatives sounded alarm","text":"Legacy media and longtime politics reporters are increasingly reporting on scandals that rocked the Democratic Party ahead of the November election, shining additional light on political issues that Republicans had long spotlighted and railed against. \"A full 4½ years after The Post’s bombshell series on Hunter Biden’s influence-peddling schemes, The New York Times has deigned to take an interest in the former First Son’s corruption,\" the New York Post's editorial board wrote in a piece last week slamming the New York Times for reporting on Biden corruption allegations years after other outlets had already uncovered reported details. \"We’d say the Times’ willingness to at long last cover this comes better late than never, but it only published the story now that it doesn’t remotely matter anymore,\" the editorial board continued. The New York Times declared in an article published on Friday that former first son Hunter Biden \"sought support from the State Department\" to aid his former employer, Ukrainian energy company Burisma, while his father served as vice president. Hunter Biden allegedly leveraging his last name and father's political status in the U.S. has long been criticized by conservatives, who have alleged that Hunter and his father engaged in influence-peddling through Burisma. BIDEN'S CLAIM TO HAVE NO KNOWLEDGE OF HUNTER'S BUSINESS DEALINGS IS BECOMING HARDER TO MAINTAIN Hunter Biden was paid millions of dollars while serving on the board of Burisma after joining the company as legal counsel in the spring of 2014 before being elevated to the Board of Directors later that year. The Bidens were accused by Republicans of having \"coerced\" the Burisma CEO into paying them millions of dollars in exchange for their help in getting the Ukrainian prosecutor investigating the company fired during the Obama administration. The 46th president denied any involvement in his son's business dealings. Biden issued his son a sweeping 10-year pardon before exiting the Oval Office in January that protects Hunter Biden from offenses he \"has committed or may have committed\" from Jan. 1, 2014, to Dec. 1, 2024. Alleged Biden family influence-peddling has echoed from the halls of Congress to social media channels on X, but legacy outlets and left-wing media outlets often didn't give a platform to the allegations. CNN'S JAKE TAPPER GETS RIPPED ON SOCIAL MEDIA FOR 'TRYING TO REWRITE HISTORY' WITH NEW BOOK ON BIDEN'S DECLINE Jonathan Turley, Fox News' contributor and Shapiro Professor of Public Interest Law at George Washington University, published an op-ed for Fox News Digital on Sunday remarking on the NYT's piece that was published years after other outlets and experts investigated alleged Biden family influence-peddling. \"For years, some of us have written about the Biden family’s multimillion-dollar influence-peddling operation and the Justice Department’s refusal to charge Hunter Biden with being an unregistered foreign agent. Now, years later, The New York Times has found evidence suggesting that the former president's son was acting as a foreign agent as early as the Obama administration, when his father was vice president,\" Turley wrote. Media veterans and legacy outlets have leaned into reporting on and investigating a handful of other scandals and political news that conservatives had long sounded the alarm on, including that the coronavirus likely originated out of a lab in China, as well as on President Biden's mental decline in the lead-up to the election last year. PUBLIC WAS MISLED BY THE SCIENTIFIC COMMUNITY ABOUT COVID ORIGINS, NY TIMES COLUMNIST ARGUES The New York Times ran a column last month claiming the scientific community \"badly misled\" the public in an effort to suppress the theory that COVID-19 originated in a lab in Wuhan, China, even after the paper's own science writer called the theory \"racist.\" \"We Were Badly Misled About the Event That Changed Our Lives,\" the March 16 piece published by NYT columnist and Princeton sociology professor Zeynep Tufekci, argued that the scientific community long suspected COVID-19 originated in a Wuhan lab, but purposefully \"hid or understated crucial facts,\" to mislead the public about the lab’s \"terrifyingly lax\" safety precautions. 'MOST DAMNING EVIDENCE': HUNTER BIDEN'S FULL PARDON RESURFACES DECADE OF CONTROVERSIES, 'INFLUENCE-PEDDLING' \"We have since learned, however, that to promote the appearance of consensus, some officials and scientists hid or understated crucial facts, misled at least one reporter, orchestrated campaigns of supposedly independent voices and even compared notes about how to hide their communications in order to keep the public from hearing the whole story,\" Tufekci wrote. The Trump administration's CIA reported earlier this year that the lab leak was the likely origin of the COVID-19 virus, which had previously been passed off by media outlets and scientists as a likely conspiracy theory. The New York Times defended that it had reported on the lab leak theory multiple times across the years, including in 2021, when approached for comment by Fox News Digital on the recent articles on both Hunter Biden and the lab leak theory. \"The New York Times has intensely pursued every theory and lead on the origins of Covid-19, documented the political debate, funding, influence, and shifts in thinking among the scientific community, and reported on China’s censorship campaign that has stifled the search for truth. The Times has helped readers navigate the coronavirus pandemic through independent, verified reporting, and any insinuation that we have not thoroughly pursued leads is false,\" a NYT spokesperson said. And a newly released book by longtime D.C. reporters Jonathan Allen and Amie Parnes, \"Fight: Inside the Wildest Battle for the White House,\" investigates Biden's mental decline in the lead-up to the general election, calling him a \"shell of himself.\" \"All of them,\" Parnes told Vanity Fair of who in Biden's inner circle is most to blame for covering up his mental decline when he was in office. \"It’s pretty remarkable how they kept him very closed off. He was a shell of himself. When he entered the White House, he was so, so different from the man who I covered as vice president, a guy who would hold court in the Naval Observatory with reporters until the wee hours.\" \"We’d been watching Biden’s decline for a long period of time and, honestly, thought he had lost his fastball some when he was running in 2020. And it was still so shocking to see the leader of the free world so bereft of coherent thought,\" Allen added of Biden's mental decline. Biden's mental acuity had been under conservatives' microscope since before the 2020 election, with concerns heightening in February 2024 when Special Counsel Robert Hur, who was investigating Biden’s alleged mishandling of classified documents as vice president, announced he would not recommend criminal charges against Biden for possessing classified materials after his vice presidency, calling Biden \"a sympathetic, well-meaning, elderly man with a poor memory.\" JONATHAN TURLEY: BIDEN DOJ BEHIND EVEN THE TIMES IN PURSUING ALLEGED HUNTER CORRUPTION The report renewed scrutiny over Biden’s mental fitness, which rose to a fever pitch in June 2024 after the president’s first and only presidential debate against Trump. Biden's debate performance was seen as an abject failure, with traditional allies soon joining conservatives in their concern over the president's health in the context of encouraging Biden to pass the mantle to a younger generation of U.S. leaders. Biden dropped out of the race in July, and shortly thereafter endorsed Vice President Kamala Harris as the party's presidential candidate. Harris ultimately failed to rally enough support to defeat Trump at the polls in November. CLICK HERE TO GET THE FOX NEWS APP Jake Tapper, a CNN anchor and longtime Trump critic, has also touted his upcoming book, \"Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again,\" which is also anticipated to detail Biden’s mental decline and the alleged cover-up by members of the Democratic Party. Fox News Digital reached out to Biden's post-presidential office but did not immediately receive a reply. Fox News Digital's Andrew Mark Miller, Gabriel Hays, and David Spector contributed to this report.","summary":"Media outlets and reporters are increasingly investigating scandals and political news, such as Biden&apos;s health, years after conservatives outlets sounded the alarm.","url":"https://www.foxnews.com/politics/legacy-media-dc-journos-come-around-investigating-dem-scandals-years-after-conservatives-sounded-alarm","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/trump-biden-collage.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-06 18:55:14","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.115},{"id":308341588,"title":"Michael Douglas' daughter Carys shares unexpected photos with brother Dylan worlds away from red carpet glamor","text":"It's not always glitz and glamor for Catherine Zeta-Jones and Michael Douglas' kids!\n\nThe two proved as much in their latest social media post, as Carys, the youngest, shared a round of photos of her latest adventure with her older brother Dylan.\n\nThe No Reservations actress and the Basic Instinct actor have been married since 2000, and in addition to Dylan, 24, and Carys, 21, Michael is also a dad to son Cameron, 46, who he shares with ex-wife Diandra Luker, to whom he was married from 1977 to 2000.\n\nOver the weekend, Carys took to Instagram and posted several photos of a hiking trip with her brother, starting off with one of her sitting on a rock in the middle of the mountains, taking a quick snooze on her hiking gear.\n\nNext up was a glimpse of the hike's impressive views — the photos appear to be from the siblings' trip to Patagonia late last year — followed by a selfie of Carys and Dylan taking a break on the ground.\n\nMore photos followed of the stunning views, and Carys ended her carousel with a photo of Dylan at a rest stop, and another of herself hiking.\n\n\"More moments from this magical place,\" she wrote in her caption, and fans were quick to take to the comments section under the post and rave over it, though first her older brother Cameron wrote: \"WOW…gorgeous…so cool.\"\n\nOthers followed suit with: \"You guys are too cool,\" and: \"This is so cute, looks so fun,\" as well as: \"How cool! On my bucket list!\" plus another one of her followers also commented: \"Looks like Patagonia. Beautiful place, love it!!!\"\n\nCarys is currently a student at Brown University, from where Dylan graduated. She is a budding actress, having appeared in a short film titled F*ck That Guy featuring You star Victoria Pedretti, and she has also showcased her singing abilities on her Instagram. See a video of it below.\n\nMeanwhile, her older brother, who has also dabbled in acting, launched a podcast with SiriusXM last year, Young American, through which he intended to both inform and motivate his generation when it comes to the political issues impacting their future. The show launched in September for a limited run, in time for the election between former Vice President Kamala Harris and Donald Trump.\n\nIn an Instagram post at the time announcing the new venture, Dylan wrote: \"It's been a wild ride the last couple of years. From the start of forever wars, the first Black president, culture wars, and now a second chance at a first female president, my generation has lived through some of the most transformative and tumultuous times in our history; and it's only gonna get crazier.\"\n\n\"I wanna take you through it,\" he then declared, and detailed: \"On my show, I won't just talk you through the news of the day but underscore the larger issues spinning our country out of control.\"","summary":"Michael Douglas and Catherine Zeta-Jones' daughter Carys shared impressive photos of a hiking adventure with her brother Dylan","url":"https://www.hellomagazine.com/healthandbeauty/mother-and-baby/824683/michael-douglas-daughter-carys-unexpected-photos-brother-dylan/","image":"https://images.hellomagazine.com/horizon/landscape/4804de0cd810-gettyimages-1192190573.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-04-06 18:40:00","author":"Beatriz Colon","authors":["Beatriz Colon"],"language":"en","source_country":"gb","sentiment":0.315},{"id":308328644,"title":"Globalizimi, një divorc alla amerikan","text":"Nga Federico Rampini, Corriere della Sera\n\nDivorci midis Amerikës dhe globalizimit duket i paprecedentë: shumë rregulla të lojës së ekonomisë botërore kanë lindur në Uashington. Megjithatë, vizioni globalist i establishmentit është një gjë; bota e punës është tjetër gjë. Për dekada të tëra, konsensusi drejt kufijve të hapur – ndaj tregtisë apo emigracionit – ka qenë i dobët në kombin më të pasur në botë.\n\nVitet 1980: Ronald Reagan, i pari republikan që fitoi votën e klasës punëtore, nis një ofensivë kundër Japonisë, fajtor për pushtimin e tregut amerikan për pajisje shtëpiake dhe makina. 1992: Industrialisti Teksan Ross Perot kandidon si një kandidat i pavarur për Shtëpinë e Bardhë, duke kapur frikën e punëtorëve nga marrëveshjet e tregtisë së lirë me Kanadanë dhe Meksikën. Populist dhe proteksionist i krahut të djathtë, Perot i hoqi votat Bush seniorit dhe bëri që të fitonte demokrati Bill Clinton. Kjo e fundit shpik Rrugën e Tretë: e majta neoliberale përqafon vizionin optimist të globalizimit, do Kinën në OBT (Organizata Botërore e Tregtisë). 1999: e majta anti-globale del në rrugë pikërisht kundër një samiti të OBT-së në Seattle. Sindikatat dhe ambientalistët bashkohen për të paralizuar atë samit. 2008: me rënien e hipotekës, kostot sociale të krizës kaluan në shtresat e mesme të ulëta.\n\nGara për të përfaqësuar kategoritë me frikë nga globalizimi përfshin dy palët. E djathta populiste ka Lëvizjen Tea Party, pararendësin e Trump. Majtas: Occupy Wall Street, Bernie Sanders, Elizabeth Warren, së fundmi Alexandria Ocasio-Cortez.\n\nE djathta sociale dhe e majta marksiste argumentojnë se njerëzit janë tradhtuar nga kapitalistët dhe teknokratët, se shumëkombëshet kanë shkatërruar industrinë amerikane për të rritur marzhet e fitimit duke u zhvendosur në Kinë ose Meksikë. JD Vance është emblematik. Ai vjen nga bota e “plehrave të bardha”, e “kodrinjve”: klasa punëtore e kalbur dhe e varfër, një mjedis i shkatërruar nga droga, alkoolizmi, sëmundjet mendore, vetëvrasjet. Mes këtyre të bardhëve të varfër, fituesi i Nobelit për ekonominë, Angus Deaton mat rritjen e “vdekjeve të dëshpërimit”.\n\nKëto histori janë thelbësore për të kuptuar sfondin e lashtë të proteksionizmit të Trump. Shumë punëtorë amerikanë dyshojnë se akademia dhe teknokratët – të cilët sot shpjegojnë dëmin e tarifave – u shërbejnë interesave të Wall Street dhe Big Tech, sepse integrimi ekonomik SHBA-Kinë për tridhjetë vjet rriti fitimet e shumëkombëseve. Konsensusi dypartiak i establishmentit globalist në epokën Clinton-Bush-Obama ka gjeneruar idenë se ekziston një komplot i elitave kundër klasës punëtore. Sidomos meqenëse globalizimi ka qenë vërtet bujar për profesionet e reja të botës dixhitale, ndarja ndërkombëtare e punës u buzëqeshi inxhinierëve kompjuterikë të Silicon Valley.\n\nNdërgjegjësimi për pabarazitë është rritur ndërsa Kina është bërë më e pasur. Në kohën e negociatave të anëtarësimit në OBT (1999-2001), asaj iu dhanë trajtime të veçanta: autorizimi i proteksionizmit sistematik. Të njëjtat barriera kineze mbeten tani që ajo është një superfuqi teknologjike, që eksporton makina elektrike me cilësi të barabartë me Tesla dhe çmime më të ulëta. Në Uashington, vendimi për të kthyer faqen e globalizimit ishte tashmë dypartiak, duke bashkuar demokratët dhe republikanët. Joe Biden mbajti tarifat e para të Trump-it, shtoi të tijat dhe praktikoi një tjetër proteksionizëm me një politikë industriale të bazuar në subvencionet për kompanitë e huaja që prodhojnë në Amerikë. Këshilltari kryesor i Bidenit për sigurinë kombëtare, Jake Sullivan, kishte teorizuar “një politikë tregtare të përshtatur për klasën punëtore”: me atë shprehje ai pranoi se epoka e marrëveshjeve të mëdha të liberalizimit të tregtisë kishte tradhtuar interesat e punëtorëve amerikanë dhe ishte urgjente të ndryshohej drejtimi. Biden dhe Kamala Harris mburreshin se kishin filluar të zhvendosnin industritë në atdheun e tyre, duke sjellë mbi dy milionë vende pune nga jashtë.\n\nKonteksti historik\n\nKëtu është konteksti historik i Ditës së Çlirimit. Shumë Amerika, shumë të ndryshme nga njëra-tjetra, tani ishin të pakënaqur nga globalizimi. Disa nostalgjikë për izolacionizmin e krahut të djathtë. Të tjerë nostalgjikë për New Deal të Franklin Roosevelt, një eksperiment socialist i cili në vitet 1930 u ndërtua nën strehën e barrierave të forta, kundër konkurrencës së huaj dhe kundër imigracionit. Kur Trump duhet të zgjedhë midis interesave të aleatëve të tij kapitalistë (të ashtuquajturit oligarkë) dhe atyre të bazës së klasës punëtore, deri tani ai zgjedh populizmin. Kostot që mund t’i shkaktojë Amerikës dhe botës janë shqetësuese. Rënia e bursave varfëron jo vetëm Musk dhe Bezos, por fondet e pensioneve të klasës së e mesme. Në origjinën e gjithçkaje ka një thyerje të lashtë mes elitës dhe popullit, një zinxhir premtimesh të tradhtuara, një depozitë pakënaqësish që është karburanti politik i këtij eksperimenti radikal.","summary":"Nga Federico Rampini, Corriere della Sera Divorci midis Amerikës dhe globalizimit duket i paprecedentë: shumë rregulla të lojës së ekonomisë botërore kanë lindur në Uashington. Megjithatë, vizioni globalist i establishmentit është një gjë; bota e punës është tjetër gjë. Për dekada të tëra, konsensusi drejt kufijve të hapur – ndaj tregtisë apo emigracionit – ka [&#8230;]","url":"https://www.epokaere.com/globalizimi-nje-divorc-alla-amerikan/","image":"https://www.epokaere.com/wp-content/uploads/2025/04/640-0-1743960407xglobalizimi-nje-divorc-705.jpeg","video":null,"publish_date":"2025-04-06 18:04:53","author":"Krasniqi","authors":["Krasniqi"],"language":"en","source_country":"xk","sentiment":0.578},{"id":308321054,"title":"Trump’s MAGA brand may be nontransferable to rest of GOP","text":"Crime was rampant in cities run by Democratic mayors, with mass exoduses occurring from San Francisco, Chicago, and New York to red states such as Florida, Texas, and Tennessee.\n\nAs a result, two words dominated the cable news landscape heading into the November 2022 midterm elections: red wave.\n\nPolls supported this sentiment of a Republican takeover of the House in overwhelming fashion. Many pundits had the GOP gaining anywhere from 30 to 40 seats while also taking back the Senate. At the time, President Joe Biden was 16 points underwater, according to Gallup, with just 40% supporting and 56% disapproving of his performance. His vice president, Kamala Harris, was somehow polling even lower.\n\nSo what happened? Republicans only netted nine seats in the House while failing to win back the Senate against profoundly subpar Democratic opponents in traditional red states, including Georgia and Arizona.\n\nThis wasn’t a red wave, but a ripple.\n\nFast forward to 2024: Trump, defying the weaponization of the justice system via lawfare, a perpetually hostile and dishonest media, and two assassination attempts, wins back the presidency. Republicans took back the Senate with a 53-47 majority. The party also held the House, albeit narrowly.\n\nPostinauguration polls showed Trump scoring higher with the public than at any time during his first presidency, with approval comfortably above 50%. A solid majority agreed with his policies as well, especially on mass deportation, the border, and the Department of Government Efficiency’s mission to cut government waste, fraud, and abuse.\n\nWe’re now just nine weeks into the second Trump presidency, and his numbers are holding for the most part. His average approval in the RealClearPolitics average sits at about 48%. For context, Trump was at 37% at this time back in 2017.\n\nSo with that backdrop, why are Republicans struggling as much as they are in special elections thus far? In Pennsylvania last month, East Petersburg Mayor James Malone defeated Commissioner Josh Parsons in a special state Senate election, a major upset considering that Trump had crushed Harris in the same State Senate District 36 by more than 15 points. Fact: no Democrat had won there since the 1980s.\n\nIn Florida, two GOP candidates did win special House elections last week, but the margins were decidedly smaller than they were for Trump in 2024. In Florida’s 1st and 6th congressional districts, for example, Trump ran away with both by at least 30 points, but in Tuesday’s special elections, Democrats cut those margins in half.\n\nIn Florida’s 6th Congressional District, Rep. Randy Fine (R-FL) won by fewer than 14 points while being outraised 10-to-1 by Democratic opponent Josh Weil, a school teacher. And in Florida’s 1st Congressional District, Rep. Jimmy Patronis (R-FL) defeated Democrat Gay Valimont, also by fewer than 15 points, despite being in a decided Trump stronghold.\n\nIn Wisconsin, a race for a seat on the state Supreme Court took on special meaning because the liberal judge in the race, Susan Crawford, ran on a promise to redo the state’s congressional seats to create two Democrat-friendly districts that could result in two more Democrats in the House.\n\nIf that happens, we could be looking at House Speaker Hakeem Jeffries, which would mean the third impeachment of Trump over the crime of being an existential threat to democracy.\n\nOr something.\n\nCrawford won over conservative candidate Brad Schimel by more than 10 points in a state Trump won by a small margin in 2024.\n\nAdd it all up, and we may be looking at a 2022 repeat in 2026 in the midterm elections. Which begs the question: Is the Trump brand transferable?\n\nThe answer appears to be, well, not really. His endorsement record overall is more solid than other politicians. Former President Barack Obama is a good example of someone who was seen as perpetually popular with the base, but just look at his track record on the endorsement front.\n\nOne could even make the argument that it was Obama’s decision to shame young black voters to cast their ballots for Harris, simply due to her race and gender, that only helped repel them away from her and to Trump.\n\nGoing into 2026, Democrats who may have been hesitant to run in solidly red districts may be emboldened by two things they witnessed this week: First, the Florida special election results, which showed that 15-point drop from Trump’s 2024 support, and second, Trump’s trade war through tariffs, which have rattled the markets and will likely bring his approval rating down a few notches, particularly on the question of how he’s handling the economy.\n\nIn the long run, these tariffs may lead to far better trade deals, lower tariffs on U.S. goods, more domestic production, and more jobs here at home, but in the short term, there will be pain. Products will be more expensive, at least for now. 401(k)s will be affected. And as we witnessed during the Biden era, a president’s handling of the economy decides his fate and that of the party. If Trump is relatively unpopular as he was before the 2018 midterm elections — he was at 38% — Democrats will surely win back the House, essentially making Trump a lame duck while facing Seinfeld impeachment hearings — a show about nothing.\n\nSuch a scenario could also play a role in the 2028 presidential election. As of now, according to a recent YouGov survey, JD Vance is the front-runner for the nomination, clocking in with 40% of Republican voters saying the vice president is their first choice. Donald Trump Jr. is second with 10%, followed by Secretary of State Marco Rubio at 4%, and former South Carolina Gov. Nikki Haley, Secretary of Health and Human Services Robert F. Kennedy Jr., and Ohio gubernatorial candidate Vivek Ramaswamy tied at 3%.\n\nOn the blue side, Harris clocks in at 25%, followed by former Transportation Secretary Pete Buttigieg at 12%, Gov. Gavin Newsom (D-CA) and Rep. Alexandria Ocasio-Cortez tied at 9%, and Sen. Bernie Sanders (I-VT) at 7%. Not exactly the ’98 Yankees lineup, but consider this: While Trump won the popular vote and every swing state, this was still a very close election. Trump’s margins in Pennsylvania and Michigan were less than 2 points. In Wisconsin, it was less than 1 point. If those states go the other way, Harris wins 270-268 in the Electoral College.\n\nSo while Harris is the worst presidential candidate of our lifetimes, Buttigieg sounds like the human version of a ChatGPT bot, Newsom is as authentic as a $6 bill, and Ocasio-Cortez is a self-described socialist who still advocates spending trillions on the Green New Deal, all could win in 2028 if the economy is in peril. Yes, even Ocasio-Cortez.\n\nPresident George H.W. Bush once had an 89% approval rating following the first Gulf War and seemed unbeatable going into the 1992 election. That approval dropped to 34% heading into Election Day. Then-Arkansas Gov. Bill Clinton, with some help from third-party candidate Ross Perot, won with just 43% of the vote, so anything is possible.\n\nTrump is betting his presidency on winning a trade war against friends and foes alike. In the short term, the pain will be real.\n\nThe question is: Will the golden age of prosperity Trump has promised materialize before the next elections in 2026?\n\nBecause if it doesn’t, the two words we’ll hear going into that day could be a very real possibility with turnout already down when Trump isn’t on the ballot: blue wave.","summary":"The year was 2022. Democrats were in a panic heading into the midterm elections, all thanks to an unpopular president pushing unpopular spending that led to the highest inflation the country had seen since E.T. was in theaters 40 years ago. The southern border was a full-blown crisis, with nearly 2.8 million people entering the [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3370799/trump-maga-brand-nontransferrable-rest-of-gop/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Trump-MAGA-Hat.webp","video":null,"publish_date":"2025-04-06 18:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","source_country":"US","sentiment":0.085},{"id":308313992,"title":"Governor Tim Walz grilled on ‘major mistake’ of Biden seeking re-election","text":"Gov. Tim Walz, D-Minn., was grilled by CNN's Jake Tapper on Sunday about whether members of the Democratic Party needed to acknowledge that former President Biden wasn't up to running for re-election. \"Don‘t you think your party needs to acknowledge that President Biden was not up for the job of running for reelection, and that this was a major mistake?\" Tapper asked, as Walz argued that Biden made the decision to drop out. \"You all went along with the idea that he was up for it and he wasn‘t, and everybody saw it. And the country rejected it.\" Walz, who was former Vice President Kamala Harris's 2024 running mate, also told Tapper that the Democratic Party needed to do some soul-searching in the wake of their loss to President Donald Trump. \"History will tell us to go back on that. That very well could be the case, Jake. What I‘m concerned about is learning from those lessons. I would hope we would never do it again, make a mistake, make sure we go through and get someone. But I don‘t know where it helps us going forward,\" Walz said, before pivoting to Trump. KAMALA HARRIS WAS ‘VERY ANNOYED’ WITH OBAMA AS SHE SOUGHT HIS ENDORSEMENT, BOOK REVEALS Tapper also pressed Walz on Harris' recent remarks, during which she said, \"I’m not here to say I told you so,\" during a speech in California on Thursday. \"What does ‘I told you so’ really mean here? I mean, people heard her message. They did not vote for her. She lost every battleground state. You yourself have criticized the Harris-Walz campaign for being too cautious. She may have told the American people, you know, she may have warned the American people, but she didn‘t do it compellingly enough to win,\" the CNN host said. Walz said he owned the loss and criticized himself for it. However, he said Harris tried to warn people of what Trump was planning to do. \"I do think the challenge for Democrats, and this is, I think, a structural problem that’s going to take a lot more thinking. Why, with all of that out there, did they not think we were any better than that? And they didn‘t, and I’m very concerned with the folks who stayed home,\" he said, acknowledging that Trump did a good job identifying voters' anxieties. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The CNN host also asked about criticisms that the Democratic Party was gaslighting Americans about inflation, the border, and Biden's fitness. \"And then, fundamentally, this idea that President Biden was up for another four years of the job while Americans in poll after poll, for year after year, were saying, ‘he‘s too old to do the job,’ your party stood against all of those things,\" Tapper said. CLICK HERE TO GET THE FOX NEWS APP Walz argued that Biden led the country out of the COVID-19 pandemic and that he did a good job, but that the Democratic Party failed to message correctly on issues such as immigration.","summary":"CNN&apos;s Jake Tapper grilled Gov. Tim Walz on Sunday over whether the Democratic Party needed to acknowledge it was a major mistake for Joe Biden to seek re-election.","url":"https://www.foxnews.com/media/governor-tim-walz-grilled-major-mistake-biden-seeking-re-election","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/jake-tapper-tim-walz.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-06 17:35:40","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.285},{"id":308300040,"title":"Walz Slams Harris’ ‘Told You So’ After Election Loss","text":"Minnesota Gov. Tim Walz responded on Sunday to his former running mate Kamala Harris’s “told you so” quip, saying he would save his criticism for the campaign the two ran.\n\nWalz agreed with State of the Union host Jake Tapper on Sunday that Democrats’ 2024 message did not resonate with voters. Instead, he said, the party needed to band together to find an effective way of pushing back against President Donald Trump.\n\nFormer Vice President Harris told a crowd at the Leading Women Defined Summit last week that she could see a lot of Trump’s actions coming. “I’m not gonna say ‘I told you so,‘” she quipped to the crowd. “I swore I wasn’t going to say that!”\n\nHarris’s response wasn’t the best fit for the moment, Walz suggested.\n\n“When I criticize, I’m criticizing myself,” Walz said. “I own this. I’m part of the ticket, and somebody has to come up with a strategy.”\n\nWalz said the former vice president likely meant that it was “pretty self-evident” that Trump was going to do what he promised. Still, Walz said, Democrats needed to figure out how to redefine themselves beyond the elitist image Republicans have created for them.\n\n“I do think the challenge for Democrats—and this is, I think, a structural problem that’s going to take a lot more thinking—why, with all of that out there, did they not think we were any better than that?\" Walz said. “And I’m very concerned with the folks who stayed home, and these are folks that I’ll say once again—Donald Trump has identified their angst.\"\n\nTapper also asked Walz if Democrats should have recognized former President Joe Biden’s decline earlier and acted on a candidate switch sooner. Tapper and Axios reporter Alex Thompson are set to publish Original Sin, a book that promises to reveal the “cover-up” of Biden’s decline, next month.\n\n“Don’t you think your party needs to acknowledge that President Biden was not up for the job of running for reelection, that this was a major mistake?” Tapper asked. \n\n“Well, look, history will tell us to go back on that,” Walz said. “That very well could be the case, Jake. What I’m concerned about is learning from those lessons. I would hope we would never do it again. Make a mistake. Make sure we go through get someone—I don’t know where it helps us going forward.\"\n\nInstead, Walz said, Democrats should focus on establishing a unified opposition to Trump’s policies if they aim to win in future elections.\n\n“If there is not a royal opposition, if there’s not some soul searching on our side, if there’s not reaching out to—those folks who are in the streets, they’re leading right now,\" Walz said.","summary":"CNNMinnesota Gov. Tim Walz responded on Sunday to his former running mate Kamala Harris’s “told you so” quip, saying he would save his criticism for the campaign the two ran.\n\nWalz agreed with State of the Union host Jake Tapper on Sunday that Democrats’ 2024 message did not resonate with voters. Instead, he said, the party needed to band together to find an effective way of pushing back against President Donald Trump.\n\nFormer Vice President Harris told a crowd at the Leading Women Defined Summit last week that she could see a lot of Trump’s actions coming. “I’m not gonna say ‘I told you so,‘” she quipped to the crowd. “I swore I wasn’t going to say that!”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/walz-breaks-from-harris-when-i-criticize-im-criticizing-myself/","image":"https://www.thedailybeast.com/resizer/v2/ACTCSRBNIVGAHIBIBK7WPU6BQU.png?smart=true&auth=30f43adc9736c32cdd275a198f7600ad4cd50c6b487987f183939327cf0b46ce&width=1440&height=1080","video":null,"publish_date":"2025-04-06 15:25:32","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","category":"politics","source_country":"us","sentiment":-0.1},{"id":308286316,"title":"How 'Hands Off!' Protest Placards Mocked Donald Trump, Elon Musk","text":"Huge numbers of people took to the streets to protest President Donald Trump's administration at more than 1,300 \"Hands Off!\" gatherings held across all 50 states in the U.S.Many of the placards have been gaining attention for their messages—Newsweek has a roundup.The ContextHands Off!, a grassroots movement supported by civil rights groups, labor unions, and advocacy organizations, organized multiple demonstrations on Saturday.People took aim at Trump and Elon Musk, criticizing mass federal layoffs, immigration crackdowns, and U.S. involvement in the conflicts in Ukraine and Gaza.What To KnowWhile many of the signs were typical of what would be expected at these marches, with words such as \"resist\" and \"hands off our rights,\" others were more targeted.Several people nodded to the fact that some of Trump's tariffs apply to a collection of remote islands that are only inhabited by colonies of wildlife.The volcanic Heard and McDonald Islands, a remote territory populated only by penguins, seals and seabirds, were included because they are Australian territory, Axios reported, citing a White House official.One sign read, \"Penguins against fascism,\" with the messages, \"No tariffs,\" \"No tyrants,\" and \"Just krill.\"Another asked rhetorically: \"We tariffed penguins, but not Russia?\"The White House explained that it did not impose tariffs on Russia because \"sanctions from the Ukraine war have already rendered trade between the two countries as zero.\"Another sign referenced Trump's demand that Colorado officials take down a portrait of him in the state capitol after he claimed the image was \"purposefully distorted.\"The sign showed a picture of the portrait with sad clown makeup painted onto Trump's face.\"There. I fixed your portrait,\" it read.House Democrats said last month that the oil painting would be taken down at the request of Republican legislative leaders.One placard took aim at Trump's Cabinet with the message: \"Ikea has better cabinets.\"Some of Trump's Cabinet picks faced an uphill battle during the confirmation process, with multiple claims surfacing about several of them.For example, Pete Hegseth, Trump's pick for defense secretary, faced a sexual assault allegation—which he has denied—and reports about excessive drinking and his work conduct.Other signs targeted Musk, who heads the Department of Government Efficiency (DOGE), with one saying \"Send Musk to Mars.\"But the \"s\" in the word \"Musk\" was doubled in the style of Nazi Germany's SS insignia, seemingly in reference to accusations that Musk made a Nazi salute at a Trump inauguration event.Another sign read \"Dogs against DOGE,\" while another played on the name of the Black Lives Matter movement with the words: \"Orange Lies Matter.\"One person dressed up as the Statue of Liberty held a sign which read: \"Help.\"What People Are SayingThe White House said in a statement: \"President Trump's position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries. Meanwhile, the Democrats' stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.\"Hands Off! executive director Rahna Epting said in a statement: \"What we witnessed today was nothing short of extraordinary. Across the country and around the world, people came together to say: we will not be silent while our rights, our futures, and our democracy are under attack.\"This peaceful movement is powered by everyday people—nurses, teachers, students, parents—who are rising up to protect what matters most. We are united, we are relentless, and we are just getting started.\"Former Vice President Kamala Harris responded to the protests, saying: \"Americans are standing up to the administration as they implement Project 2025 at full speed.\"Project 2025, spearheaded by The Heritage Foundation and drawing inspiration from the Ronald Reagan era's \"Mandate for Leadership,\" was a set of plans that presented a framework for a future conservative administration to overhaul the U.S. government.Trump has distanced himself from Project 2025 and previously called parts of the 900-page guideline \"ridiculous and abysmal.\" However, he has brought on some individuals associated with it into his administration.What Happens NextOrganizers hope the nationwide protests will sway lawmakers on certain issues.","summary":"Huge numbers of people took to the streets in the United States to protest President Donald Trump's administration.","url":"https://www.newsweek.com/donald-trump-elon-musk-protest-placards-2055988","image":"https://d.newsweek.com/en/full/2621859/protest-sign-1.jpg","video":null,"publish_date":"2025-04-06 15:10:10","author":"Jordan King","authors":["Jordan King"],"language":"en","category":"politics","source_country":"US","sentiment":-0.179},{"id":308315362,"title":"Musk must pay, DOGE steals a building, and Big Law bends another knee","text":"Injustice for All is a weekly series about how the Trump administration is trying to weaponize the justice system—and the people who are fighting back.\n\nWasn’t it a delight to see Elon Musk face-plant in his attempt to buy a Wisconsin Supreme Court seat? It has to irk Musk that there’s an election he couldn’t buy, even after being allowed to try to bribe Wisconsin voters with cold hard cash. \n\nMusk’s humiliation shouldn’t stop there, though. Just because Musk’s preferred candidate didn’t prevail shouldn’t insulate him from criminal prosecution in the state. \n\nBefore the election, Wisconsin Attorney General Josh Kaul brought a lawsuit against Musk, asking the court for an emergency injunction. After the Wisconsin Court of Appeals upheld the lower court’s denial of that injunction, Musk was allowed to continue his blatant vote buying. \n\nThe important thing here is that Kaul’s lawsuit was civil, not criminal. The goal was to stop Musk from handing out money so he couldn’t continue to try to influence the election. Although that request for emergency relief was unsuccessful, that isn’t the same thing as a ruling that Musk broke no laws. \n\nWisconsin election law classifies giving someone anything of value to induce them to vote or not to vote as election bribery. A violation is a Class 1 felony. There’s no reason not to pursue criminal charges. Musk is going to keep doing this until he’s stopped. He did it in Pennsylvania with no consequences, although he now faces a lawsuit over his failure to pay a canvasser $20,000 for all the petition signatures—at $100 a pop—he obtained. \n\nMusk bought the presidential election. Federal courts are either cowed by Donald Trump or in thrall to him. But that’s not the case with state courts. And since Musk failed to tip the Wisconsin Supreme Court back to conservative control, it isn’t a situation where he might be convicted at a lower court but the state’s highest court would come through and do him a solid. Anyone who wasn’t Musk couldn’t get away with this, and he shouldn’t either. \n\nHabeas games: Heads the administration wins, tails immigrants lose\n\nThe Trump administration has admitted it mistakenly deported someone to Venezuela but now claims it has no power to get him back because he’s outside the jurisdiction of the United States. It’s all thanks to this One Weird Habeas Trick.\n\nThe government is arguing the only way Kilmar Armando Abrego Garcia could obtain relief from being illegally deported is to file a writ of habeas corpus. That’s the traditional way for immigrants to fight being unlawfully detained by the government—a much nicer way of saying “illegally imprisoned.” At the same time, the government is arguing that no United States court could now hear Garcia’s habeas claim, even if he had filed one, because Garcia is no longer in United States custody. \n\nIf it looks like a catch-22, and walks like a catch-22, it’s a catch-22. Let’s say an unlawfully detained immigrant challenges their detention by filing a habeas claim while still stateside. Then, let’s say the government does exactly what it did when it ignored U.S. Judge James Boasberg’s order in a different immigration case and sends that immigrant to El Salvador illegally anyway while the case is pending. \n\nThen, according to the government, even if they acknowledge that person shouldn’t have been deported and even if they acknowledge that person had a habeas claim pending, it doesn’t matter. The right to pursue that habeas claim vanishes because the immigrant isn’t here any longer. \n\nThere’s no way to read this bit of cynical subterfuge as anything but an assertion by the government that it can disappear whoever it wants, and there is no real recourse once it does so. Trump has made clear he thinks he can act like a king, and what’s more king-like than being able to banish someone? \n\nLate Friday, a lower court declined to entertain the administration’s novel legal theory that disappearing Garcia in error, without due process, should just be treated as an unfortunate event that sadly cannot be fixed.\n\nInstead, U.S. Judge Paula Xinis ordered the government to return Garcia no later than April 7, at 11:59 PM. The big question now, of course, is whether the Trump administration will defy the court’s order anyway.\n\nA federal judge is cool with DOGE straight-up stealing a building \n\nApparently, demolishing the U.S. Institute for Peace’s work wasn’t enough, so the Department of Government Efficency took their building too. And thanks to how they did it, a federal judge won’t stop it. \n\nEarlier this week, Judge Beryl Howell declined to block the government from just taking the USIP building and sliding possession of it over to the Government Services Administration. Yes, even though USIP is not an agency, but is instead a private, nonprofit corporation created and funded directly by Congress. And yes, this is even though USIP’s building is worth $500 million. \n\nThe judge’s decision was partly based on the fact that the government had already transferred the building and everything in it last weekend, before the court hearing. So, Howell concluded, nothing was left to transfer, so any relief requested by the USIP plaintiffs was moot.\n\nSo the government has gotten away with what feels a lot like robbery by force. Really, really terrific system we’ve got here. \n\nBig Law watch: Who bent the knee this week? \n\nIt’s getting hard to keep track of which law firms have agreed to pay off the president in the hopes he will leave them alone.\n\nLast week, Skadden, Arps, Slate, Meagher & Flom agreed to give the administration $100 million in pro bono work so that he wouldn’t target the firm with an executive order. \n\nApparently, Skadden has now set the going rate. This week, the law firm Milbank gave Trump another $100 million in free legal services and the now-customary promises to axe diversity efforts. The firm was likely in Trump’s crosshairs for hiring Neal Katyal, a big Trump critic and an acting solicitor general under President Barack Obama.\n\nWillkie, Farr & Gallagher also raced to give the administration money. Worried they’d be targeted over hiring Doug Emhoff, the husband of former Vice President Kamala Harris, Willkie also cut basically the same deal as Skadden and Milbank. It’s all complying in advance and it’s all terrible and it’s not going to stop.","summary":"Injustice for All is a weekly series about how the Trump administration is trying to weaponize the justice system—and the people who are fighting back.\n\n\n\n\nWasn’t it a delight to see Elon Musk face-plant in his attempt to buy a Wisconsin Supreme Court seat? It has to irk Musk that there’s an election he couldn’t buy, even after being allowed to try to bribe Wisconsin voters with cold hard cash. \n\n\n\nMusk’s humiliation shouldn’t stop there, though. Just because Musk’s preferred candidate didn’t prevail shouldn’t insulate him from criminal prosecution in the state. \n\n\n\nBefore the election, Wisconsin Attorney General Josh Kaul brought a lawsuit against Musk, asking the court for an emergency injunction. After the Wisconsin Court of Appeals upheld the lower court’s denial of that injunction, Musk was allowed to continue his blatant vote buying. \n\n\n\n\nMusk speaks at a town hall holding a check on March 30, in Green Bay, Wisconsin.\n\n\nThe important thing here is that Kaul’s lawsuit was civil, not criminal. The goal wa","url":"https://www.dailykos.com/story/2025/4/6/2314330/-Musk-must-pay-DOGE-steals-a-building-and-Big-Law-bends-another-knee?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1416925/story_image/Injustice_4.4.png?1743798262","video":null,"publish_date":"2025-04-06 15:00:01","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","source_country":"US","sentiment":-0.288},{"id":308276374,"title":"Laura Loomer speaks out after Trump firings - and clandestine Oval Office meet","text":"Laura Loomer has spoken out following speculation about her involvement in the firings of at least a half dozen government officials said to be involved with last month's Signalgate slip-up.\n\nThe far-right conspiracy theorist - and well-known Trump stan - responded to a tweet touting her involvement in the prospective talks Saturday, despite the president saying she did not play a part.\n\nLoomer, 31, met with Trump in the White House and reportedly brought a list of national security officials whom she believed could not be trusted Wednesday - days after publicly complaining that she had still not received a White House press pass.\n\nThe purge of officials in the Pentagon’s National Security Agency and the White House's National Security Council occurred the following day, sparking scrutiny as to whether Loomer had been the one pulling the strings.\n\nOn X, conservative media account 'Diligent Denizen' perpetuated that theory, leading to Loomer's response. \n\n'CONGRATS: After meeting with @LauraLoomer, President Trump fired 6, SIX, Mike Waltz staffers involved with the Signalgate debacle,' the account insisted. 'Loomer proves that citizen journalists & independent media CAN MAKE A DIFFERENCE. \n\n'Congratulations on your vindication Laura, you've earned it.'\n\nWithin two hours, Loomer - a self-admitted 'white nationalist' - had offered a response, one that seemingly took credit for the firings and contradicted a direct statement from the commander-in-chief.\n\n'Thank you! I appreciate all of the kind messages and support! FIGHT FIGHT FIGHT!' Loomer, an independent podcaster and journalist, wrote. \n\n'The truth always comes to light!'\n\n'Keep going Laura!' the well-followed account responded, as the post continued to rack up views.\n\n'She brought the receipts and he responded accordingly,' it added of the podcaster and president, respectively. 'This is why he's a man of the People.'\n\nA host of onlookers appeared to agree, even though Trump seemingly put such theories to bed on Thursday afternoon.\n\nWhen asked by reporters whether Loomer had influenced his decision to fire the officials who had worked under National Security Advisor Mike Waltz, he simply said, 'no.' \n\n'Laura Loomer is a great patriot. She's a very strong person,' Trump added during a flight to Miami on board Air Force One. 'She's been in the party a long time, she's done a good job,' he later added.\n\nInstead of being behind the firings, the president said that Loomer met with him Wednesday and gave him recommendations as people he could hire - hailing her as 'a great patriot' and a 'strong person.'\n\n'She's been in the party a long time, she's done a good job,' Trump said of the podcaster he proudly touted on last year's campaign trail. \n\n'Sometimes I listen to [her] recommendations, like I do with everybody,' he said of their meeting. 'I listen to everybody, and then I make a decision.\n\n'But I saw her yesterday,' he added, hours after other officials who work under Walz were fired.\n\nThey include Thomas Boodry, senior director of legislative affairs for Waltz's National Security Council; and David Feith, senior director of technology and national security.\n\nMaggie Dougherty, the senior director for international organizations for the NSC; Gen. Timothy D. Haugh, of the NSA and U.S. Cyber Command; as well as Haugh's deputy, Wendy Noble, were also let go for reasons yet to be disclosed.\n\nWaltz - despite finding himself at the center of pushback from both sides of the aisle as a result of the scandal he himself started - avoided the axe.\n\nHe's facing heat for accidentally adding Atlantic editor Jeffrey Goldberg into the supposedly clandestine chat. \n\nWhen asked about their meeting Thursday, Loomer told DailyMail.com directly: 'Out of respect for President Trump and the privacy of the Oval Office, I’m going to decline on divulging any details.\n\n'It was an honor to meet with [him] and present him with my research findings,' she went on.\n\n'I will continue working hard to support his agenda, and I will continue reiterating the importance of strong vetting, for the sake of protecting the President and our national security.'\n\nWaltz sat in on the meeting and defended members of his team, The New York Times reported. \n\nLoomer is best known celebrating the deaths of migrants who drowned in the Mediterranean Sea last year, and pedaling conspiracy theories such as one surrounding Kamala Harris not being black.\n\nShe gained prominence after being suspended from Barry University in Florida for attempting to create the 'Sympathetic Students in Support of the Islamic State of Iraq and Syria' club, after which she offered theories that the 2018 Parkland school shooting - where 17 people were killed - was staged.\n\nIt was reported in April 2023 that Trump was intent on offering Loomer a job only for the proposition to be met with dismay from his aides - after which she appeared repeatedly with him over the course of his campaign.\n\nMonths later, Loomer said she was coming for the role Karoline Leavitt currently holds - another bid that has seemingly failed to come to fruition.\n\n'Someday I will be his [Trump’s] Press Secretary,' she wrote at the time. 'I will protect him from all of his enemies and haters. \n\n'They will meet their match in me,' she concluded. '#Trump2024.","summary":"The far-right conspiracy theorist responded to a tweet touting her involvement in the prospective talks Saturday, despite the president saying she did not play a part.","url":"https://www.dailymail.co.uk/news/article-14576841/laura-loomer-donald-trump-fired-officials.html","image":"https://i.dailymail.co.uk/1s/2025/04/06/14/96883693-0-When_asked_whether_Loomer_s_word_had_influenced_his_decision_to_-a-41_1743946716717.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/25/8049403287952996941/1024x576_MP4_8049403287952996941.mp4","publish_date":"2025-04-06 14:44:28","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.177},{"id":308278288,"title":"Laura Loomer Responds to Trump Dismissals Following Secret Oval Office Meeting","text":"Laura Loomer has spoken out following speculation about her involvement in the firings of at least a half dozen government officials said to be involved with last month’s Signalgate slip-up.\n\nThe far-right conspiracy theorist – and well-known Trump stan – responded to a tweet touting her involvement in the prospective talks Saturday, despite the president saying she did not play a part.\n\nLoomer, 31, met with Trump in the White House and reportedly brought a list of national security officials whom she believed could not be trusted Wednesday – days after publicly complaining that she had still not received a White House press pass.\n\nThe purge of officials in the Pentagon’s National Security Agency and the White House’s National Security Council occurred the following day, sparking scrutiny as to whether Loomer had been the one pulling the strings.\n\nOn X, conservative media account ‘Diligent Denizen’ perpetuated that theory, leading to Loomer’s response. \n\n‘CONGRATS: After meeting with @LauraLoomer, President Trump fired 6, SIX, Mike Waltz staffers involved with the Signalgate debacle,’ the account insisted. ‘Loomer proves that citizen journalists & independent media CAN MAKE A DIFFERENCE. \n\n‘Congratulations on your vindication Laura, you’ve earned it.’\n\nWithin two hours, Loomer – a self-admitted ‘white nationalist’ – had offered a response, one that seemingly took credit for the firings and contradicted a direct statement from the commander-in-chief.\n\n‘Thank you! I appreciate all of the kind messages and support! FIGHT FIGHT FIGHT!’ Loomer, an independent podcaster and journalist, wrote. \n\n‘The truth always comes to light!’\n\n‘Keep going Laura!’ the well-followed account responded, as the post continued to rack up views.\n\n‘She brought the receipts and he responded accordingly,’ it added of the podcaster and president, respectively. ‘This is why he’s a man of the People.’\n\nA host of onlookers appeared to agree, even though Trump seemingly put such theories to bed on Thursday afternoon.\n\nWhen asked by reporters whether Loomer had influenced his decision to fire the officials who had worked under National Security Advisor Mike Waltz, he simply said, ‘no.’ \n\n‘Laura Loomer is a great patriot. She’s a very strong person,’ Trump added during a flight to Miami on board Air Force One. ‘She’s been in the party a long time, she’s done a good job,’ he later added.\n\nInstead of being behind the firings, the president said that Loomer met with him Wednesday and gave him recommendations as people he could hire – hailing her as ‘a great patriot’ and a ‘strong person.’\n\n‘She’s been in the party a long time, she’s done a good job,’ Trump said of the podcaster he proudly touted on last year’s campaign trail. \n\n‘Sometimes I listen to [her] recommendations, like I do with everybody,’ he said of their meeting. ‘I listen to everybody, and then I make a decision.\n\n‘But I saw her yesterday,’ he added, hours after other officials who work under Walz were fired.\n\nThey include Thomas Boodry, senior director of legislative affairs for Waltz’s National Security Council; and David Feith, senior director of technology and national security.\n\nMaggie Dougherty, the senior director for international organizations for the NSC; Gen. Timothy D. Haugh, of the NSA and U.S. Cyber Command; as well as Haugh’s deputy, Wendy Noble, were also let go for reasons yet to be disclosed.\n\nWaltz – despite finding himself at the center of pushback from both sides of the aisle as a result of the scandal he himself started – avoided the axe.\n\nHe’s facing heat for accidentally adding Atlantic editor Jeffrey Goldberg into the supposedly clandestine chat. \n\nWhen asked about their meeting Thursday, Loomer told DailyMail.com directly: ‘Out of respect for President Trump and the privacy of the Oval Office, I’m going to decline on divulging any details.\n\n‘It was an honor to meet with [him] and present him with my research findings,’ she went on.\n\n‘I will continue working hard to support his agenda, and I will continue reiterating the importance of strong vetting, for the sake of protecting the President and our national security.’\n\nWaltz sat in on the meeting and defended members of his team, The New York Times reported. \n\nLoomer is best known celebrating the deaths of migrants who drowned in the Mediterranean Sea last year, and pedaling conspiracy theories such as one surrounding Kamala Harris not being black.\n\nShe gained prominence after being suspended from Barry University in Florida for attempting to create the ‘Sympathetic Students in Support of the Islamic State of Iraq and Syria’ club, after which she offered theories that the 2018 Parkland school shooting – where 17 people were killed – was staged.\n\nIt was reported in April 2023 that Trump was intent on offering Loomer a job only for the proposition to be met with dismay from his aides – after which she appeared repeatedly with him over the course of his campaign.\n\nMonths later, Loomer said she was coming for the role Karoline Leavitt currently holds – another bid that has seemingly failed to come to fruition.\n\n‘Someday I will be his [Trump’s] Press Secretary,’ she wrote at the time. ‘I will protect him from all of his enemies and haters. \n\n‘They will meet their match in me,’ she concluded. ‘#Trump2024.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nLaura Loomer has spoken out following speculation about her involvement in the&#8230;\n\n\nThis Post: Laura Loomer Responds to Trump Dismissals Following Secret Oval Office Meeting first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/laura-loomer-responds-to-trump-dismissals-following-secret-oval-office-meeting/","image":"https://i.dailymail.co.uk/1s/2025/04/06/14/96678039-14576841-Trump_ally_Laura_Loomer_31_has_not_yet_been_able_to_convince_mem-a-2_1743944980163.jpg","video":null,"publish_date":"2025-04-06 14:43:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.177},{"id":308277920,"title":"How Musk ushered 4chan into US politics","text":"In the past few days, US media have been reporting that billionaire Elon Musk will step back from his leading role in President Donald Trump’s administration. This is after his highly publicised stint as unofficial head of the nongovernmental agency DOGE (Department of Government Efficiency) and various political initiatives – most recently, his campaign for the election of a conservative judge to a vacated Supreme Court seat in the state of Wisconsin – backfired.\n\nHow and when Musk will make his exit remains to be seen, but one thing is for sure: He will leave behind lasting damage that goes way beyond the disruptive work of his invention, DOGE. Through his behaviour online and offline, Musk has introduced incredibly toxic and cynical politics from the obscure fringes of the internet into the chambers of power in the world’s foremost superpower.\n\nHis Nazi gesture at an event following Trump’s inauguration on January 20 was a perfect illustration. Musk immediately weighed in on the accusation that he made a Nazi salute with a mix of denial and humour, making a slew of Nazi-themed jokes on his X account.\n\nDoing something outrageous and then denying the obvious is a clear case of “trolling” – a favourite practice in fringe internet spaces where toxic and cynical political views dominate. Among them is an infamous website called 4chan, which Musk is believed to frequent. Just at the start of this year, he decided to change his X account name to “Kekius Maximus” and his profile picture to a Pepe the Frog image – memes taken straight from 4chan. He has also openly referred to the site on his X account.\n\nAlthough many have heard of the website 4chan, there is still very little public understanding of what it is and how it is connected to the rise of the far right in the US.\n\nSimply put, it is a website where people can share text and image messages anonymously with no registration or login for users. It is a space for discussions, humour and the creation of an online community. Founded in 2003, 4chan reached 8.2 million visitors monthly in 2010 and 22 million in 2021.\n\nDue to the anonymous cover afforded by the website’s structure, users feel confident to express problematic and fringe political views usually mixed with a veil of humour. This irony-laden form of political expression has come to define the website. Often you would see racist, sexist and/or homophobic slurs posed as jokes. Anyone who calls these out is mocked even further for their naivety or sincerity.\n\nThe disclaimer under the main forum on 4Chan, /b/, states: “The stories and information posted here are artistic works of fiction and falsehood. Only a fool would take anything posted here as fact.”\n\nThis is exactly why journalists and commentators who took Musk’s denial of his Nazi salute at face value completely missed the point. To those far-right fans of Musk, the appeal of his actions was in fact reinforced by the very denial, by the fact that he did a fascist gesture so brazenly and then “got away with it”.\n\nMusk engaged in a transgressive act against what he describes as the “woke mind virus” or more traditionally “PC [political correctness] culture”. By adding humour to the equation, Musk and his fans were able to further obfuscate and derail any serious discussion about the implications of normalising Nazi symbols.\n\nAll of this is the primary function of “trolling”. Posed as merely a form of play, a way of pushing people’s buttons “for the lolz” (laughs), far-right actors are able to use this technique to shift the Overton window – or the range of acceptable terms or opinions – to the right.\n\nImmediately after Musk’s salute, far-right figures such as Nick Fuentes and Andrew Tate, mimicked the same salute and used the same distancing excuses that Musk employed. These are people who have gained tremendous amounts of social and political capital through online subcultures.\n\nHowever, it is not only the far right that employs memes and other expressions developed online to further its political goals. In fact, some may argue that these subcultures emerged as a response to what is described as the “memefication” of politics.\n\nIn her book Kill All Normies: Online Culture Wars from 4chan and Tumblr to Trump and the Alt-Right, Angela Nagle traces the origins of these subcultures to the US election cycle of 2008. Many will remember the “Hope” posters of Barack Obama’s presidential election campaign, which went viral across the internet. To Nagle, this was a crucial turning point in the use of memes, which at that point were a fresh and exciting new medium, in US politics.\n\nDespite the rhetoric of hope and change, the Obama administration did not deliver on its vague, utopian promises. This mismatch between the messaging and the reality spurred online debates that promoted mistrust as a healthy response to the insincerity of the political class.\n\nThereafter, on 4chan and other platforms, anyone who expressed strong support for any one party, cause or movement became the object of ridicule. This essentially formed a type of cynical, nihilistic view of the world and our place in it.\n\nFast forward to the 2024 election cycle, these dynamics were very much present again. Kamala Harris’s campaign relied on a rebranding of the Obama campaign and used the same empty memes, instead of focusing on policy or anything else rooted in reality. Not only did she rely heavily on celebrity endorsements, but also had her X account banner written with the same font and colour as the “brat” meme, a trend inspired by pop star Charli XCX’s Brat album cover.\n\nThe liberal political establishment in the US, which has further revealed its deep flaws over the past year and a half with its disregard for the struggles of poor Americans and triumphalist support for Israel’s genocidal war in Gaza, has not learned the lessons of the past decade and a half. Relying on hollow messaging while issues compound for most Americans – from skyrocketing inflation to growing inequality to climate collapse – does not invigorate voters.\n\nPolitics is not simply a meme battle. This is a lesson that should also be heeded by the wider public, especially those who re-shared the infamous Musk salute as a form of satire or ridicule. Even though many may have believed they were disparaging him by adding insults or jokes to it, in fact, they helped spread and legitimise the act itself as a spectacle.\n\nIt is time to acknowledge that we cannot meme our way out of fascism. The only way to defeat fascist trolls is to refuse to enter the arena, to refuse to play on their terms. That is, to insist on grounding discussions and actions in reality, to reject any of their obfuscations and to build actual (offline) power to resist the rise of the far right.\n\nIt is definitely no easy task, especially when the far right has entered the highest chambers of power in the US and has made strong gains in South America and Europe. The marriage of far-right discourse and symbolism matched with an unprecedented capture of wealth by the billionaire class and the rising authoritarianism within these countries has thrown many into hopelessness and despair.\n\nIn response to the rise of the likes of Musk, we need a kind of repoliticised hope to combat the intentional despair feeding the far right. We need a sincere hope that is rooted in an acknowledgement that we cannot afford to do nothing and that there is a way to resist through collective action, to build new alternatives and to embrace new visions of the future.","summary":"Trump&#039;s billionaire ally has helped normalise toxic cynical political views that had lurked on online fringes for years.","url":"https://www.aljazeera.com/opinions/2025/4/6/how-musk-ushered-4chan-into-us-politics?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/04/2025-03-31T011404Z_411457092_RC2ZNDASRAEY_RTRMADP_3_USA-ELECTION-WISCONSIN-MUSK-1-1743943485.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-04-06 13:59:22","author":"Apps Support,Ayman Makarem","authors":["Apps Support","Ayman Makarem"],"language":"en","category":"politics","source_country":"QA","sentiment":0.019},{"id":308273560,"title":"Latest line: A good week for Bill Essayli, a bad week for Elon Musk","text":"Bill Essayli\n\nHigh-octane Republican Assemblyman from Riverside County is named by Trump administration to be U.S. attorney in Los Angeles, where he will lead 500 lawyers, agents and staff enforcing federal criminal law\n\nAs polls show his favorability rating dropping, billionaire Tesla CEO dumps $25 million into race for control of Wisconsin State Supreme Court, only to see the Republican candidate he backed lose by 11 points.\n\nXavier Becerra\n\nFormer California attorney general and Biden health secretary announces governor run in 2026. He has experience. But does he have a chance against better-known Kamala Harris or Katie Porter?","summary":"Republican Assemblyman gets top cop job as Wisconsin voters reject tech mogul's pitch","url":"https://www.mercurynews.com/2025/04/06/latest-line-a-good-week-for-bill-essayli-a-bad-week-for-elon-musk/","image":"https://www.mercurynews.com/wp-content/uploads/2025/04/SJM-L-US-Wisconsin-Supreme-Court_225226779.jpg?w=1024&h=755","video":null,"publish_date":"2025-04-06 13:30:16","author":"Bay Area News Group","authors":["Bay Area News Group"],"language":"en","source_country":"us","sentiment":-0.045},{"id":308260810,"title":"Kamala Harris Reacts to 'Hands Off!' Protests Against Trump's Admin","text":"Kamala Harris has reacted to the \"Hands Off!\" protest, saying \"the voices of working people will always be louder than the unelected billionaires.\"Protests against President Donald Trump's administration, including key adviser Elon Musk, were planned for all 50 states on Saturday.Harris, who Trump defeated in the 2024 presidential election, wrote on social media that, \"Americans are standing up to the administration as they implement Project 2025 at full speed.\"Thank you for using your voices and the power of protest to stand for Social Security, Medicare, and Medicaid; for the Department of Education and programs like Head Start; for clean air and water; for the right to make decisions about your own body without government interference. The voices of working people will always be louder than the unelected billionaires.\"This breaking news article will be updated.","summary":"Donald Trump's 2024 rival sent a message to \"hands off!\" protesters.","url":"https://www.newsweek.com/kamala-harris-reacts-hands-off-protests-donald-trump-project-2025-2055981","image":"https://d.newsweek.com/en/full/2358686/newsweek-breaking-news-card.jpg","video":null,"publish_date":"2025-04-06 12:50:09","author":"Jordan King","authors":["Jordan King"],"language":"en","category":"politics","source_country":"us","sentiment":0.242},{"id":308285328,"title":"Fight Club Knockout Stories: Wall Street Mourns '2-Day Bloodbath' After Ignoring 40 Years of Bloodbaths","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters \n\n BREITBART\n\nTrump Tariffs\nDeportation Battle\nJust DOGE It!\nUkraine Peace Push\nRussell Brand\n\nFight Club Knockout Stories: Wall Street Mourns ‘2-Day Bloodbath’ After Ignoring 40 Years of Bloodbaths\n\n iStock/Getty Images; BNN\n\nRebecca Mansour6 Apr 2025 \n\nEntertainment\n\nTransgender Athletes\nWall Street\nWalt Disney\nWalt Disney Company \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nStephen Colbert Begs The ‘Deep State’ To Stop Trump: 'We're F**king Dying'\nKamala Harris Claims Vindication After Election Loss: 'I Told You So'\n'Violent' UC Davis Protestors 'Completely Destroy' Turning Pont USA Event\nBryson DeChambeau Praises Trump as 'Great Ambassador' for Golf\nJudge Orders Deported Migrant, 'Leader' of MS-13 Gang, Be Returned to U.S.\nPregnant Woman Seriously Injured by Rock Thrown Through Tesla Windshield\nGov. Hochul Signs Bill Allowing Credit Cards to Track Ammo Purchases\nNeil Young, Joan Baez Destined for L.A. Anti-'Oligarchy' Rally\nChina Imposes 34% Tariff on All U.S. Imports\nTrump Raises Logging Quota 25% to Harvest Timber, Prevent Fires\n\nFROM THE HOMEPAGE\n\nAg Sec. Rollins: 50 Countries Already Coming to the Table on Tariffs\nAt Least 16 Dead as Storms, Flooding Race From Texas to Ohio\nGov. Hochul Signs Bill Allowing Credit Cards to Track Ammo Purchases\nLabour MP Arrested on Suspicion of Child Sex Offences and Rape, Suspended From Party\nIran rejects Trump call for direct nuclear talks\nNeil Young, Joan Baez Teaming with Bernie Sanders, Alexandria Ocasio-Cortez for Anti-‘Oligarchy’ Rally\nFight Club Knockout Stories: Wall Street Mourns ‘2-Day Bloodbath’ After Ignoring 40 Years of Bloodbaths\nPope in Surprise Appearance at St. Peter’s Square 2 Weeks After Hospital Discharge\nGermany: AfD Surges to Tie for First Place as Establishment Party ‘Crashes’ After Election Win\nTrump and Netanyahu Will Meet Again Monday with Gaza, Tariffs and More on the Table\nU.S. Revokes All Visas for South Sudanese over Repatriation Dispute\nTrump Raises Logging Quota 25% to Harvest Timber, Prevent Fires \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters\n\nCopyright © 2025 Breitbart","summary":"For Breitbart Fight Club Members only, every week we reveal our top five articles based on reader engagement. These are the stories that our readers were talking about for the past week.\n\n\nThe post Fight Club Knockout Stories: Wall Street Mourns &#8216;2-Day Bloodbath&#8217; After Ignoring 40 Years of Bloodbaths appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/04/06/fight-club-knockout-stories-wall-street-mourns-2-day-bloodbath-after-ignoring-40-years-of-bloodbaths/","image":"https://media.breitbart.com/media/2000/01/knockout-getty-640x335.png","video":null,"publish_date":"2025-04-06 10:30:07","author":"Rebecca Mansour","authors":["Rebecca Mansour"],"language":"en","source_country":"US","sentiment":-0.127},{"id":308232444,"title":"Stunning Visuals From Anti-Trump Protests, Kamala Harris Backs Movement","text":"United States' former Vice President Kamala Harris has come out in support of the ongoing \"Hands Off\" demonstrations against President Donald Trump and his billionaire advisor, Elon Musk. Harris, who lost the 2024 presidential race against the Republican, lauded Americans for standing up against Trump's administration's policies and said their voices would be louder than the 'unelected billionaires.'\"Today in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed,\" she wrote in a post on X.\"Thank you for using your voices and the power of protest to stand for Social Security, Medicare, and Medicaid; for the Department of Education and programs like Head Start; for clean air and water; for the right to make decisions about your own body without government interference. The voices of working people will always be louder than the unelected billionaires,\" Harris added.Today in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed.Thank you for using your voices and the power of protest to stand for Social Security, Medicare, and Medicaid; for the Department of Education…— Kamala Harris (@KamalaHarris) April 5, 2025Tens and thousands of Americans, angry about the way President Trump is running the country, marched and rallied in scores of cities across the United States on Saturday in the biggest day of demonstrations yet by an opposition movement trying to regain its momentum after the shock of the Republicans' first weeks in office.The so-called \"Hands Off\" protests were organized for more than 1,200 locations in all 50 states by more than 150 groups, including civil rights organizations, labor unions, LGBTQ+ advocates, veterans and election activists. The rallies appeared peaceful, with no immediate reports of arrests.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");HAPPENING NOW: A sea of protesters gather in Southern California for the “Hands Off!” protests against Elon Musk and Donald Trump pic.twitter.com/hkzzDfWWOL— Marco Foster (@MarcoFoster_) April 6, 2025Satellite protests were also organised in several other countries, including the United Kingdom, Belgium, France, the Netherlands, Germany, Portugal, Mexico, and American territories like Puerto Rico and American Samoa.In America, protesters in cities dotting from Midtown Manhattan in New York to Anchorage, Alaska, and Washington assailed Trump and billionaire Elon Musk's actions on government downsizing, the economy, immigration and human rights.MASSIVE Anti-Trump uprising in NYC!! #HandsOff pic.twitter.com/Gb91kaPTKr— Our Revolution (@OurRevolution) April 5, 2025Musk, a Trump adviser who runs Tesla, SpaceX and the social media platform X, has played a key role in the downsizing as the head of the newly created Department of Government Efficiency. He says he is saving taxpayers billions of dollars.On the West Coast, in the shadow of Seattle's iconic Space Needle, protesters held signs with slogans like \"Fight the oligarchy.\" This is the biggest crowd I've ever seen in Minnesota at today's Hands Off rally pic.twitter.com/R5CfDHVPYY— Nicole Neri (@nicolehneri) April 5, 2025Protesters chanted as they took to the streets in Portland, Oregon, and Los Angeles, where they marched from Pershing Square to City Hall.A new video shows just how massive today's protest on Boston Common really is.Bussed-in activists are demanding an end to deportations and ICE raids as well as cutting federal spending—sending a message to President Trump and Elon Musk.Watch belowpic.twitter.com/9C1ATR7vfx— Bostonians Against Mayor Wu (@AntiWuCoalition) April 5, 2025Asked about the protests, the White House said in a statement that \"President Trump's position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries. Meanwhile, the Democrats' stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.\"","summary":"United States' former Vice President Kamala Harris has come out in support of the ongoing \"Hands Off\" demonstrations against President Donald Trump and his billionaire advisor, Elon Musk.","url":"https://www.ndtv.com/world-news/stunning-visuals-from-anti-trump-protests-kamala-harris-backs-movement-against-donald-trump-elon-musk-8100472","image":"https://c.ndtvimg.com/2025-04/i45d7gso_trump-protest-afp_625x300_06_April_25.jpeg","video":null,"publish_date":"2025-04-06 10:25:00","author":"Sanstuti Nath","authors":["Sanstuti Nath"],"language":"en","category":"politics","source_country":"in","sentiment":0.236},{"id":308221388,"title":"Kamala Harris takes aim at ‘unelected billionaires’ in honest message on nationwide protests against Donald Trump","text":"Former Vice President Kamala Harris has issued a scathing statement amid nationwide protests against sitting US President Donald Trump and Tesla CEO Elon Musk.\n\nLast November, 60-year-old Harris conceded to Trump, 78, in the 2024 Presidential Election after failing to secure enough votes to take charge of the White House.\n\nThe Democrat politician, who was confirmed as the presidential nominee just a few months before the election when former US President Joe Biden dropped out, has remained relatively tight-lipped following her loss.\n\nEarlier this week, she spoke out about how the Trump administration could cause further issues to US citizens at a summit in California.\n\nNow, amid state-wide protests against the President and Elon Musk—who spearheads the Department of Government Efficiency (DOGE)—Harris has aimed a barb at the ‘unelected billionaires’ running the country.\n\nYesterday (April 5), she took to Twitter and wrote: “Today in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed.\n\n“Thank you for using your voices and the power of protest to stand for Social Security, Medicare, and Medicaid; for the Department of Education and programs like Head Start; for clean air and water; for the right to make decisions about your own body without government interference.”\n\nShe added: “The voices of working people will always be louder than the unelected billionaires.”\n\nThousands of planned demonstrations denouncing Trump took place in all 50 states yesterday.\n\nThese ‘Hands Off!’ protests saw citizens pouring into New York, Washington DC, Boston and more major cities across the US to rally against the Republican government.\n\nCampaigners cited various grievances with the Trump administration, which include the recent mass layoffs at the Department of Health and Human Services (HHS), where 10,000 scientists, doctors and other essential workers lost their jobs.\n\nThe BBC reports that protestors were also motivated to stand against immigration raids on US university students and some were against Musk's influence.\n\nMusk’s DOGE is driving recent cuts to DEI (diversity, equity, and inclusion) programs, mass federal workers being fired, and defunding climate change initiatives.\n\nThe 53-year-old has also been tasked with reducing the United States’ total federal debt, which stands at $36.22 trillion, according to US Treasury Fiscal Data.\n\nMeanwhile, others attending the ‘Hands Off!’ rallies took aim at Trump’s newly-introduced tariffs.\n\nThe duties see a ‘baseline’ 10 percent levy added to all goods imported into America. 60 countries, including Thailand and Vietnam, also face higher, customised tariffs that come into effect on April 9.\n\nFlorida Congressman Maxwell Frost echoed Harris’ words during an appearance at a ‘Hands Off!’ protest in the Sunshine State.\n\nHe denounced the ‘billionaire takeover of our government’, adding (via the BBC): \"When you steal from the people, expect the people to rise up. At the ballot box and in the streets.”\n\nEarlier this week, former US President Barack Obama delivered scathing remarks regarding the state of America.\n\nDuring an interview at Hamilton College, the 63-year-old claimed Trump’s ‘Liberation Day’ announcements wouldn’t be ‘good for America’.\n\n“Imagine if I had done any of this,” Obama said, later adding: “It’s unimaginable that the same parties that are silent now would have tolerated behavior like that from me, or a whole bunch of my predecessors.”","summary":"![CDATA[Every State saw thousands turning out to rally against the Trump administration on Saturday (April 5)]]","url":"https://www.unilad.com/news/politics/kamala-harris-donald-trump-protests-statement-924728-20250406","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/bltb77bcc86a4aa5773/67f23fb4e6ef2e7e247236dd/kamala-harris-message-protests-trump.jpeg","video":null,"publish_date":"2025-04-06 09:15:16","author":"Ella Scott","authors":["Ella Scott"],"language":"en","category":"politics","source_country":"gb","sentiment":0.145},{"id":308213678,"title":"Democrats tighten their grip on social media strategy amid negative feedback","text":"The Democratic National Committee, whose social media strategy was giving fodder to Republicans for “out of touch” messaging, marked the new change on March 12.\n\nThe party updated its social media profile picture to the donkey logo and started to tighten up its messaging.\n\nDemocratic National Committee Digital Content and Creative Director Paulina Mangubat noted on X this week the change in response to a post noting the difference in the social approach.\n\n“You’re right that there was a shift! After we posted The GraphicTM (you know the one), I hosted a weeklong strategy retreat with the full DNC social team—where we rebuilt not just our content priorities, but our mindset/approach to approvals,” she wrote.\n\n“We received over 135M impressions across accounts during the month of March, and we’re going to do more—and better—in April and the months to come,” Mangubat continued.\n\nShe is not the only staffer from the DNC noting a vibe shift.\n\n“I manage the supporter feedback inbox for @TheDemocrats and when I tell y’all the vibes haven’t been this good in a minute,” wrote another staffer on X. “Dems are inspired! Dems are hopeful!”\n\nThe updates come after a failed “Here’s what Democrats did in February” graphic that contained 32 bullet points of long sentences that instantly received backlash.\n\nThe post on X hit 2.6 million views. The comment section took off as hundreds of people slammed the social media team saying “no one is going to read that” or “who the f*** gets paid to do this.”\n\nThe DNC is not the only Democratic account that has received flack. Congressional Democrats pretending to be video game characters in “choose your fighter” parody videos were slammed by the right, saying they were “out of touch” and “missed the mark” with the trend.\n\nSammy Kanter, a Democratic consultant and influencer, noted the DNC is being transparent with the public on its changes. \n\nThe new donkey profile picture “marked a turning point of seeing where their strategy was going to go,” Kanter told the Washington Examiner. “I think that tweet was interesting of them sharing that they get feedback from every corner of the internet, which I’m glad that they’re doing social listening and seeing what some of that feedback is.”\n\nKanter noted the party previously kept their socials “corporate,” but now they are “experimenting with strategy.” Kanter pointed out the success of the Kamala HQ account with its “funny and relatable” nature.\n\nIn light of this sentiment, the DNC poached veterans of the Kamala HQ account in their latest effort to push rapid response, Axios reported. \n\nThe new account @FactPostNews is the latest push for the party to combat misinformation while responding to the Trump administration in an entertaining way. Those running this account are many of the same people who ran Harris’s popular social media accounts in 2024.\n\n“I think Dems need to cut the safety rope,” Kanter continued. “This is, as per usual, unprecedented times, but I just think that sort of safety approach clearly hasn’t been working, so you might as well be yourself or say what you think.”\n\nCutting the safety rope and posting quick-witted responses has proven to work for the account last month, with one post in response to a Tesla Cybertruck reaching 11 million views merely noting “ugly a** truck.” \n\nRight-wing media has thrived in taking the “cutting the safety rope” approach. From podcasts like Joe Rogan to accounts such as @libsoftiktok, these accounts amplify the punchy approach. Aside from right-wing content creators, Elon Musk’s ownership of X and whopping following of 218 million helps spread the president’s agenda. \n\nAlong with tightening up their social strategy to meet the moment and gain traction, Democrats celebrated wins across the country this week.\n\nSen. Cory Booker (D-NJ) broke the record Tuesday for the longest floor speech at 25 hours and four minutes where he protested Trump and Musk’s agenda to reach those in the party who feel like Democrats are not pushing back. \n\nThe senator did not eat or use the bathroom for the entirety of the speech and was only alleviated from speaking when other Democratic senators asked questions. He broke the record for the late Sen. Strom Thurmond’s filibuster of the Civil Rights Act of 1957. \n\nFollowing breaking the record, Booker appeared on MSNBC with Rachel Maddow but was also interviewed by liberal internet star Aaron Parnas, further reflecting Democrats’ new strategy of lawmakers meeting with content creators.\n\nAnother win for Democrats came when the Senate passed Sen. Tim Kaine’s (D-VA) resolution, with some GOP support, to halt Trump’s ability to impose tariffs on Canada just mere hours after the president unveiled his “liberation day” tariffs. Although the resolution will go nowhere in the House, the passage with GOP support marked the first signs of a legislative success in pushing back against Trump’s agenda. \n\nPerhaps the biggest win for the party this week was when Judge Susan Crawford prevailed in Wisconsin for the state Supreme Court race, cementing the liberal majority of the court after Musk poured tens of millions into this race against Crawford. \n\nWhile voter turnout was small on Tuesday compared to a presidential election, more than half a million more voters turned out for this Supreme Court race than the state’s last one in 2023, indicating that voters are engaged and ready to participate. \n\nAOC TAKES EARLY LEAD OVER SCHUMER IN NEW YORK SENATE DEMOCRATIC PRIMARY: POLL\n\nWhile the Democratic Party has a long way to go leading up to the 2026 midterm elections, social media strategy will be crucial in elections moving forward. \n\n“I think TV is now going to the wayside in the new frontier of politics and social media and Trump dominates on social media, and so now he’s dominating the political space,” Gen Z Rep. Maxwell Frost (D-FL) told the Washington Examiner earlier this year. “I think we’ve got to do the same thing.”","summary":"Democrats are revamping their social media strategy and testing new messaging to counter President Donald Trump&#8216;s second-term agenda and his dominance in the news cycle. Out of power throughout Washington, Democrats are hiring new teams, consulting with influencers, and conducting training to try to find more creative ways to break through. The Democratic National Committee, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3371085/democrats-tighten-their-grip-on-social-media-strategy-amid-negative-feedback/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/cory-booker-dnc.webp","video":null,"publish_date":"2025-04-06 09:00:00","author":"Lauren Green","authors":["Lauren Green"],"language":"en","category":"politics","source_country":"US","sentiment":-0.159},{"id":308164690,"title":"Call for Australia to tackle ‘Big Mac Tax’","text":"Appearing on ABC Insiders, Mr Littleproud says Australia has a global responsibility to lead the world to work on getting President Trump to overturn the “reciprocal” tariffs he announced last Thursday AEDT.\n\n“This is a Big Mac tax that the people of the United States will feel it in a very lived experience in the next three to six months, because they are still going to have to import beef,” Mr Littleproud said.\n\nThat was a reference to the impost McDonald’s would have to pay on the Australian meat it imports for its hamburger patties after President Trump slapped 10 per cent tariff on Australia.\n\nMr Littleproud said Australia should be leading the talks with the US over the tariff plans.\n\n“It’s not just thing Brand Australia but taking a leadership role globally, being able to demonstrate to that this is bad policy for the United States, bad for Australia but bad policy for the world,” he said.\n\n“We have an international responsibility to lead that. Because we have that relationship, we should be able to lean in.”\n\nPresident Trump’s announcement came on day six of the May 3 federal election with an immediate response from the Prime Minister who described the 10 per cent tariff – the lowest rate imposed – as “unwarranted”.\n\nAnthony Albanese said Australia would not apply retaliatory tariffs, but would continue to negotiate with the US while ruling out backing down on key areas.\n\nOn Sunday, he again reiterated his government would not compromise to get a more favourable trade deal on the PBS or beef, which are front and centre of the US tariffs on Australia. \n\n“We cannot choose what challenges will arise, but we can determine how we respond,” Mr Albanese said.\n\n“That’s why we made it clear to the United States that our Pharmaceutical Benefits Scheme is not up for negotiation.”\n\n“That’s why we spelled out the fact we will not compromise biosecurity standards for Queensland beef.”\n\nMr Littleproud accused the Australian government of being placid with their response to the tariffs, pointing to the exemption Australia received last time the President Trump put tariffs on imports. \n\n“We should be making sure we leverage every position, as we did in 2018, but we have also got a global responsibility, to lead the world, because we do have that unique relationship with the United States,” Mr Littleproud said. \n\nForeign Minister Penny Wong disputed these claims. \n\n“One of the things that struck me when I was listening to (Mr Littleproud) was (the Coalition) don’t understand the extent to which the world has changed,” she said.\n\nLast week, President Trump singled out Australian beef as part of a wide ranging speech on tariffs, touted as Liberation Day for the United States.\n\n“Australia bans – and they’re wonderful people, and wonderful everything – but they ban American beef,” President Trump said.\n\n“Yet we imported $3bn of Australian beef from them just last year alone.\n\n“They won’t take any of our beef. They don’t want it because they don’t want it to affect their farmers. And you know, I don’t blame them.”\n\nHousehold names including McDonald’s, Burger King and Costco source around $3bn worth of Australian beef, which the US claims is unfair as Australia does not import fresh beef.\n\nAustralia has disputed these claims, highlighting biosecurity concerns of importing cattle. \n\nMr Littleproud said the world “will try to trade around the US as much as it can” and there will be perverse outcomes for US farmers in the long term.\n\nThe likely increasing cost of a Big Mac even for President Trump, a noted supporter of the fast food chain. \n\nAhead of the 2024 election, Mr Trump campaigned from a McDonald’s restaurant, donning an apron and getting in front of a fryer, in an election stunt aimed at opponent Kamala Harris, after casting doubts she ever worked for the fast food chain. \n\nHe was also photographed on a plane with a photo of Elon Musk, Robert F Kennedy Jr and Donald Trump Jr going viral for the spread of McDonald’s food laid out in front of the group.\n\nIn 2023, Mr Trump told workers at a McDonald’s store in Ohio: “I know this menu better than you do.”","summary":"Nationals leader David Littleproud Australia should use its relationship with the United States to help lobby against Donald Trump’s global tariffs.","url":"https://www.news.com.au/finance/economy/australian-economy/unique-relationship-calls-for-australia-to-stop-trumps-tariffs/news-story/39198554fe9d5601ad7db3533b956ab0?from=rss-basic","image":"https://content.api.news/v3/images/bin/d5fabd70ddfdcb652e2fee07de596ab2","video":null,"publish_date":"2025-04-06 06:21:07","author":"Cameron Micallef","authors":["Cameron Micallef"],"language":"en","category":"sports","source_country":"au","sentiment":-0.262},{"id":308126724,"title":"The party of hate","text":"A 2018 Axios poll found that 61% of Democrats consider Republicans “racist/bigoted/sexist” versus 31% of Republicans who feel likewise about Democrats. One wonders whether “only” 61% of Democrats still think this way about Republicans.\n\nRep. Jasmine Crockett (D-Texas), for example, appears to represent the preferred approach of many Democrats in “fighting back” and “standing up against” President Donald Trump and “MAGA Republicans.” Yes, President Joe Biden, at an August 2022 fundraiser, said: “What we’re seeing now is the beginning or the death knell of an extreme MAGA philosophy. It’s not just Trump, it’s the entire philosophy that underpins the – I’m going to say something, it’s like semi-fascism.”\n\nAnd, when CNN’s Anderson Cooper asked 2024 candidate Vice President Kamala Harris whether she considers Trump “a fascist,” Harris said, “Yes, I do,” later adding, if elected again, Trump would be “a president who admires dictators and is a fascist.”\n\nBut Crockett, other elected Democrats and a slew of cable TV hosts, pundits and guests have long abandoned self-restraint by frequently and casually resorting to insults and profanity. Crockett said, “All I want to see happen on my birthday is for Elon (Musk) to be taken down.” About Sen. Ted Cruz (R-Texas), she said, “It’s Ted Cruz. I mean, like this dude has to be knocked over the head, like hard, right? Like there is (sic) no niceties with him, like at all. Like you go clean off on him.”\n\nThen there is Crockett’s June 2024 verbal attack on Rep. Byron Donalds (R-Fla.), who, like Crockett, is black. On the popular radio show hosted by Charlamagne tha God, she said: “The fact that (you’re) sitting around talking about life was better under Jim Crow, like, is this because you don’t understand history or literally it’s because you married a white woman? And so you think that that whitewashed you?”\n\nThe Donalds “Jim Crow” comment pertained to the decline in the percentage of black children born to two married parents. Donalds merely pointed out that during Jim Crow, an era of virulent racism, the nuclear black family was more prevalent than now. Does Crockett consider Harris and Supreme Court Associate Justice Ketanji Brown Jackson examples of “whitewashed” blacks because of the race of their spouses?\n\nAnd just days ago, Crockett mocked Texas Republican Gov. Greg Abbott, who, after an accident in his 20s, has been paralyzed from the waist down and uses a wheelchair. At a March Human Rights Campaign banquet in Los Angeles, Crockett evoked laughter when she said: “You all know we got Gov. Hot Wheels down there. Come on, now. And the only thing hot about him is that he is a hot-a– mess, honey.”\n\nCrockett refuses to apologize. As of now, the Democratic Party leadership has said nothing. Neither former House Speaker Nancy Pelosi, House Minority Leader Hakeem Jeffries, Senate Minority Leader Chuck Schumer, former President Joe Biden, former Vice President Kamala Harris nor former President Barack Obama issued a statement condemning Crockett’s cruelty.\n\nBut during the 2016 presidential campaign when Trump allegedly mocked a disabled reporter, he faced widespread condemnation. But Trump did no such thing. Trump “mocked” what he perceived as reporter Serge Kovaleski’s backpedaling from an article after Trump had referred to it. Kovaleski himself never accused Trump of “mocking him.” Yet NBC News in August 2016 published an article with this headline: “Donald Trump’s Worst Offense? Mocking Disabled Reporter, Poll Finds.” The subheadline read: “Likely voters balked most at Trump mocking a reporter’s disability. What does it say about how Americans think about disability?” The article quoted Tom Harkin, “a prominent voice on disability policy,” who said: “Democrats believe in working together and bringing people with disabilities in to develop policy. Donald Trump? He makes fun of people with disabilities. That’s a throwback to a half a century ago.”\n\nFormer President Bill Clinton, addressing the 2016 Democratic National Convention, said Hillary Clinton, Trump’s challenger, “never made fun of people with disabilities. She tried to empower them based on their ability.”\n\nCrockett’s smears are just some short-list, rabid, vicious comments from the Trump-hating left as they scramble to find a message that resonates. What is their message on the economy, inflation, the borders and whether biological men should compete in sports against women? Simple: Trump, and his supporters, are “Nazis.”","summary":"'Smears are just some rabid, vicious comments from the Trump-hating left'","url":"https://www.wnd.com/2025/04/the-party-of-hate/","image":"https://www.wnd.com/wp-content/uploads/2024/08/jasmine-crockett-dnc-jpg.jpg","video":null,"publish_date":"2025-04-06 02:24:58","author":"Larry Elder","authors":["Larry Elder"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.431},{"id":308127960,"title":"Kamala Harris Praises ‘Hands Off!’ Protestors for Standing Up to Trump","text":"Following fiery protests across the country this weekend, former vice president Kamala Harris took to X to thank protestors for standing up to the Trump administration.\n\nThe Hands Off! demonstrations took place in more than 1,200 locations across all 50 states, and were organized by a coalition that included more than 150 organizations, including civil rights groups, LGBTQIA+ rights organizations, veterans, environmental groups, and labor unions. Protestors voiced their frustrations at countless acts Trump has carried out since assuming office, including deporting immigrants, firing thousands of federal employees, closing Social Security offices, cutting health funding, scaling back protections for transgender people, and ongoing American support for Israel in its war on Gaza.\n\nSatellite protests were also planned around the world, in the United Kingdom, France, Germany, Belgium, the Netherlands, Portugal, Mexico, and American territories like Puerto Rico and American Samoa. \n\nLate Saturday afternoon, Harris tweeted, “Today in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed.” \n\nThe tweet continued, “Thank you for using your voices and the power of protest to stand for Social Security, Medicare, and Medicaid; for the Department of Education and programs like Head Start; for clean air and water; for the right to make decisions about your own body without government interference.”\n\nShe closed with, “The voices of working people will always be louder than the unelected billionaires.”\n\nWhen asked about the protests, the White House responded, “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries. Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.”\n\nHarris had maintained a relatively low public profile since Trump’s inauguration, making just a select few appearances at public events since January, including at the NAACP Awards, where she received the NAACP Chairman’s Award. She will also be heading to Australia next month to headline a real estate conference. \n\nDespite keeping public appearances to a minimum, she has continued to post to social media, including words of encouragement for Senator Cory Booker following his record-breaking 25-hour-long speech on the senate floor earlier this week, thanking him for his leadership. \n\nShe also tweeted about Susan Crawford’s victory in the Wisconsin State Supreme Court election against her Musk-backed opponent, Brad Schimel, calling her win a “victory for working people in Wisconsin.”","summary":"Big Event Media/Getty ImagesFollowing fiery protests across the country this weekend, former vice president Kamala Harris took to X to thank protestors for standing up to the Trump administration.\n\nThe Hands Off! demonstrations took place in more than 1,200 locations across all 50 states, and were organized by a coalition that included more than 150 organizations, including civil rights groups, LGBTQIA+ rights organizations, veterans, environmental groups, and labor unions. Protestors voiced their frustrations at countless acts Trump has carried out since assuming office, including deporting immigrants, firing thousands of federal employees, closing Social Security offices, cutting health funding, scaling back protections for transgender people, and ongoing American support for Israel in its war on Gaza.\n\nSatellite protests were also planned around the world, in the United Kingdom, France, Germany, Belgium, the Netherlands, Portugal, Mexico, and American territories like Puerto Rico and American Samoa. \n\nRead","url":"https://www.thedailybeast.com/kamala-harris-praises-hands-off-protestors-for-standing-up-to-trump/","image":"https://www.thedailybeast.com/resizer/v2/TCQUOJ2O3VEQVGLYNL3ZO73XZY.jpg?smart=true&auth=e93131f236a08847b3de50562182d25f80489ff0f992feedbd23abf895a883a7&width=1440&height=1080","video":null,"publish_date":"2025-04-06 02:20:26","author":"Catherine Bouris","authors":["Catherine Bouris"],"language":"en","source_country":"us","sentiment":0.265},{"id":308134084,"title":"'Hands Off': Thousands Protest Against Trump Across US","text":"Thousands of people gathered in Washington DC's National Mall and other cities across the United States to protest against President Donald Trump's policies. \nThe \"Hands Off!\" protests were organised at over 1,200 locations in all 50 states across the country by more than 150 groups including civil rights organisations, labour unions, LGBTQ+ advocates, veterans and election activists. Associated Press reported that there were no immediate arrests and the demonstrations seemed peaceful. \nThe demonstrators protested against various policies of Trump and Elon Musk including government downsizing, the economy, immigration and human rights. On the West Coast, protestors held signs with slogans reading \"Fight the oligarchy.\" \nThousands are walking down 5th Avenue in New York City. Trump protest. pic.twitter.com/hnS76IuElg\n— NewYorkCityKopp (@newyorkcitykopp) April 5, 2025\nBREAKING: 100,000 people are gathering on the National Mall in DC to protest Donald Trump and Elon Musk. Over 1,200 of these rallies are being held today by patriotic Americans who are fed up with MAGA chaos and lawlessness. pic.twitter.com/pJ95mimP5a\n— Trump’s Lies (Commentary) (@MAGALieTracker) April 5, 2025\nALSO READ | 'China Hit Much Harder Than USA, Not Even Close': Trump Defends Tariffs As Beijing Retaliates\n'Not My President'\nPeople voiced their anger over the Trump's administration moves to fire thousands of federal workers, close Social Security Administration field offices, effectively shutter entire agencies, deport immigrants, scale back protections for transgender people and cut funding for health programs.\nProtestors held signs that read \"Not My President!\", \"Fascism has Arrived,\" \"Stop Evil,\" and \"Hands Off Our Social Security,\" reported AFP. \nGatherings were also held in other international capitals including Paris, London, and Berlin against the Trump administration's decision to impose import tariffs on most countries around the world. \nDemocratic lawmakers also took part in the protests in Washington DC. Their remarks focused on the role played by wealthy donors in the Trump administration, most notably by Musk. Florida Congressman Maxwell Frost denounced the \"billionaire takeover of our government\".\nALSO READ | 'Afraid To Say Russian': Zelenskyy Slams US Embassy’s ‘Weak’ Reaction As 18 Dead In Strike On His Hometown\n'Hands Off Canada, Greenland, Ukraine'\n\"When you steal from the people, expect the people to rise. At the ballot box and in the streets,\" he shouted.\nIn London, the protestors raised signs reading, \"WTAF America?\", \"Stop hurting people\" and \"He's an idiot\".\nThey shouted slogans \"Hands off Canada\", \"Hands off Greenland\" and \"Hands off Ukraine\". The slogans referred to Trump's changes to US foreign policy and his repeated interest in annexing Canada and Greenland. \nFormer Vice President Kamala Harris thanked the protestors for using their voice to stand against the policies of Trump. \n\"Today in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed,\" she said in a post on X. \n\"Thank you for using your voices and the power of protest to stand for Social Security, Medicare, and Medicaid; for the Department of Education and programs like Head Start; for clean air and water; for the right to make decisions about your own body without government interference. The voices of working people will always be louder than the unelected billionaires,\" she added.","summary":"&lt;p&gt;Thousands of people gathered in Washington DC's National Mall and other cities across the United States to protest against President Donald Trump's policies.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;The &quot;Hands Off!&quot; protests were organised at over 1,200 locations in all 50 states across the country by more than 150 groups including civil rights organisations, labour unions, LGBTQ+ advocates, veterans and election activists. Associated Press reported that there were no immediate arrests and the demonstrations seemed peaceful.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;The demonstrators protested against various policies of Trump and Elon Musk including government downsizing, the economy, immigration and human rights. On the West Coast, protestors held signs with slogans reading &quot;Fight the oligarchy.&quot;&amp;nbsp;&lt;/p&gt;\n&lt;blockquote class=&quot;twitter-tweet&quot; data-media-max-width=&quot;560&quot;&gt;\n&lt;p dir=&quot;ltr&quot; lang=&quot;en&quot;&gt;Thousands are walking down 5th Avenue in New York Cit","url":"https://news.abplive.com/news/world/us-protests-hands-off-thousands-protest-against-trump-policies-elon-musk-1763203","image":"https://feeds.abplive.com/onecms/images/uploaded-images/2025/04/06/56665e4f0a7d8c46bd265bfe7bd844151743904595688272_original.jpg?impolicy=abp_cdn&imwidth=1200&height=675","video":null,"publish_date":"2025-04-06 01:59:49","author":"ABP Live News","authors":["ABP Live News"],"language":"en","category":"politics","source_country":"in","sentiment":-0.024},{"id":308123848,"title":"Thousands protest Trump, Musk across Michigan - Detroit Free Press","text":"Protesters of various ages gathered across Michigan, from Detroit to Lansing, to express their outrage over the Trump administration's actions and policies.The groups included activists for reproductive rights, immigrant rights, government workers and foreign policy issues like the Gaza War and support for Ukraine.\n\nThousands of people in Michigan, like many more across the nation, rallied Saturday to protest the policies of President Donald Trump.\n\nThe groups that spearheaded the effort — dubbed the \"Hands Off! Day of Action\" — accuse Trump and his adviser Elon Musk of \"taking everything they can get their hands on — our health care, our data, our jobs, our services.\"\n\nProtesters gathered in Detroit, Novi, Troy, Ferndale and Lansing — among 55 planned demonstrations in Michigan.\n\nDetroit’s rally drew enough people to blanket the sidewalks on both sides of Woodward Avenue from the Detroit Institute of Arts in Midtown to Little Caesars Arena in Foxtown. In Lansing, thousands more filled the lawn surrounding the state Capitol, where former U.S. Sen. Debbie Stabenow, Michigan Lt. Gov. Garlin Gilchrist II and Michigan Attorney General Dana Nessel spoke.\n\nThe groups included activists for reproductive rights, immigrant rights, government workers and foreign policy issues like the Gaza War and support for Ukraine.\n\nThousands rally in Detroit despite rain\n\nLight rain didn’t dampen the enthusiasm in Detroit, where protesters boarded the QLINE and made their way to the Detroit Institute of Arts amid a relentless blast of car horns from traffic on Woodward.\n\nFor Kathy Cassar, 65, it was a family affair. She, her sister and her brother-in-law walked up to the DIA to find hundreds of people, signs in tow, covering the front steps.\n\n“Congress do your job,” one sign read. \n\nAnother: “Hands off free speech.” \n\nCassar drove more than an hour from Hartland to Detroit to express her outrage over the Trump administration, which she described as “reprehensible.” \n\n“I have never been so afraid for my country in my entire lifetime,\" she said. \"What is happening now is terrifying.\" \n\nThe firing of federal workers and changes to the U.S. Centers for Disease Control and Prevention would affect everyone, she said. \n\nMore: Live updates: Anti-Trump protesters set to gather at hundreds of locations nationwide\n\n“We need federal workers. These are Americans. These are our neighbors,” Cassar, who identifies as an independent but voted for Kamala Harris last November, said.\n\nWynonia McGee, a Black woman who lived through the Jim Crow era, said she feels as though the country is slipping back to that time. She showed up Saturday to do her part to make sure the country doesn't go backward.\n\n“I am determined to make sure I do my part, to make sure that doesn’t happen. I have grandchildren, great grandchildren to fight for,” the 75-year-old retired business owner and casino worker said. “My parents and ancestors, they fought for me, and we're not going back. It’s very personal to me. That’s why I’m out here, and I continue to be out here. We’ve got to get rid of this administration, from the top to the bottom.”\n\nThere's so much division in the country, across race, religion and ethnicity, said McGee, who lives in Canton, but grew up in Detroit.\n\nAs she walked with her cane, carrying her sign alongside other demonstrators, she protested to send a message, not to Trump, but to the lawmakers backing him who \"don't have a spine,\" she said. \n\n\"We mean business,\" she said. \"We're not sitting still.\"\n\nMary-Kate Deneau protested, in part, for her daughter's future.\n\n\"I don't want her to grow up in a world where she has less rights than me,\" the 35-year-old said as her 3½-year-old daughter, Carson, sat in her wagon with her snacks and sign in hand.\n\nDeneau worries about her children's education and the environment they may grow up in. \n\n\"I think about the curriculum, the things that maybe aren't allowed to be taught and then I think about, as they get older, are they going to be able to visit the national parks, are they going to be told who they can love, or their friends are less than because they look a certain way, or they can't live a certain lifestyle? I worry that she won't have choices if something would ever happen to her, that it's up to the government to decide,\" she said. \n\nDespite the rain, joining Saturday's protest with her parents and child was a \"no-brainer,\" she said. \n\n\"This is our history, this is her future,\" Deneau said.\n\nWayne State University students Cameron Smith and Keegan Kopp learned about the protest that same morning and felt compelled to join to make their voices heard and stand up for others.\n\n\"I don't want to live my life in a closet. I had enough years of that,\" Smith, a 19-year-old freshman who is gay, said. \n\nHis partner, Kopp, who is also a freshman, said he feels as though the country is a lot more politically divided than ever before and the current administration is moving the nation backward instead of forward. The pair worried about threats to gay marriage but felt as though there's still a fight to be fought. \n\nAnd so joining the demonstration was an opportunity to speak out. It was a moment of gratitude, reflection and joy. \n\n\"I'm just so happy to see that this is beyond people on their phones and on TikTok, like we're actually here,\" Smith said. \n\nFerndale protesters 'fed up' with Trump, Musk\n\nOver at a protest in Ferndale, Ron Smith and Maureen Moons said they have so many issues with Trump and his policies it’s hard to pick just one to rally around. \n\n“We’re all getting flooded,” Smith, 75, of Rochester, said. “We got it up to our waist. It started at our ankles, and it's up to our waist.”\n\nSmith said as an Air Force veteran, he took an oath to support and defend the Constitution.\n\n“It’s beyond my comprehension how anyone who is a veteran could support Trump,” he said.\n\nFerndale resident Emily Mandziara said she opposes Trump’s actions and the hate she feels the administration is spreading.\n\n“We the people are fed up with every single one of his policies,” Mandziara said. “Someone that claims to be a man of faith, a Christian, goes directly against everything that Jesus taught. I'm a Catholic myself. Anybody that is truly of faith would be against them (Trump and his administration).”\n\nKile Telas, of Ferndale, is a union steward for United Commercial and Food Workers Local 876. He said he is concerned about workers benefits, Medicare and Medicaid. \n\n“I’m here protesting against oligarchs going to Washington that are trying to take over the government and basically circumvent democracy in Washington,” Telas said. “And to fight against fascism that seems to be creeping up in the U.S. government and the fight for democracy and freedom. Nobody elected Elon Musk.” \n\nThousands protest at state Capitol\n\nIn Lansing, participants filled the state Capitol lawn, waving handmade signs opposing Trump and Musk and urging Congress to act. \n\nKim Winchell, 70, of Freeland, and Denise Lennon, of Bay City, traveled to the protest together after meeting each other online through the group Women of Michigan Action Network.\n\n\"We're feisty grandmas,\" Winchell said. \"We care about our grandchildren's future. This is not how government is supposed to work. Trump is just ruining the government, the country. It's ridiculous.\"\n\nToo many people are suffering because of Trump's actions and democracy is at stake, Lennon said.\n\n\"It's a 250-year-old democracy that could be over,\" she said. \"We've never had a president who has said not only did he not need votes but that people wouldn't have to vote again.\"\n\nParker Perez, 16, came with his grandmother Sherri Bible, of Oakland County. Potential cuts to public education worry him, he said. \"It's going to have a large impact on everyone.\"\n\nGilchrist II, who announced his intention to run for governor last month, stood on the Capitol steps and urged people to take action.\n\n\"I want the whole country to hear us from Lansing, from the Capitol, because you have the power to make this country exactly what it can be,\" he said. \"When we fight, when we work, when we vote, when we organize and when we say not just no, but hell no, to the people who hurt people, who broke the system.\"\n\nMeanwhile, Stabenow said citizens need to stand up for themselves, their families and their country.\n\n\"I may not be in an elected office but I have not lost my voice and neither have you,\" she said. \"We are here to say hands off our democratic freedoms and hands off our American way of life.\"\n\nProtests will continue, rally organizer says\n\nBack in Detroit, as the protest wound down, Audrey Bourriaud, who helped plan the march, was pleased with the turnout. She said the movement wouldn’t stop with Saturday’s demonstration. \n\nBourriaud’s organization, We The People Dissent, and other local activist groups — The Indivisible Project, Macomb Defenders Rising and the Michigan Resistance Coalition — plan to continue rallying and protesting into the summer. \n\n“Once you trigger a movement, you may know where it starts, but you do not know where it ends,” Bourriaud, 41, of Bloomfield Hills, said. “And this is unstoppable.”'\n\nThe Lansing State Journal contributed to this report.\n\nContact John Wisely: jwisely@freepress.com. On X: @jwisely","summary":"Thousands protest Trump, Musk across Michigan  Detroit Free Press","url":"https://www.freep.com/story/news/local/michigan/detroit/2025/04/05/hands-off-day-protest-detroit-trump-musk/82950001007/","image":"https://www.freep.com/gcdn/authoring/authoring-images/2025/04/05/PDTF/82955976007-main-nb.JPG?crop=1956,1101,x0,y208&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2025-04-06 00:29:54","author":"John Wisely,Liam Rappleye,Natalie Davies,Nushrat Rahman","authors":["John Wisely","Liam Rappleye","Natalie Davies","Nushrat Rahman"],"language":"en","category":"politics","source_country":"us","sentiment":0.103},{"id":308112116,"title":"Mark Cuban weighs in on transgender athletes in women's sports: 'People just aren't ready'","text":"Dallas Mavericks minority owner and \"Shark Tank\" host Mark Cuban gave his take on transgender athletes in women's sports this week. During an interview on \"The Stephen A. Smith Show\" Friday, Cuban suggested trans inclusion should not be \"pushed down people's throats.\" \"To make it a national issue so that if you weren’t supporting the fewer than 10 trans athletes in the NCAA, then you weren’t a good person. People just aren’t ready for that yet. You've got to meet people where they are,\" Cuban said. \"It takes time, you can’t just force it down people’s throats.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Cuban also suggested people affected by transgender inclusion policies in sports should not be used in political campaigns. \"Instead of trying to get where the people who are being disadvantaged and being discriminated against are helped, they wanted to make it a campaign issue,\" Cuban said. \"Focus on helping the people, not using them to campaign.\" A national exit poll conducted by the Concerned Women for America legislative action committee found that 70% of moderate voters saw the issue of \"Donald Trump’s opposition to transgender boys and men playing girls' and women’s sports and of transgender boys and men using girls' and women’s bathrooms\" as important to them. WHO IS STEPHANIE TURNER? WOMEN'S FENCER WHO KNELT TO PROTEST TRANS OPPONENT AND IGNITED GLOBAL AWARENESS Additionally, 6% said it was the most important issue of all, while 44% said it was \"very important.\" Cuban also suggested he supports women athletes who choose not to compete against transgender competitors, saying the decision of whether to compete against trans athletes should be left up to the athletes themselves. \"My attitude is if there’s a trans athlete, no matter what side, you let the opponent — whether it’s an individual sport or a team sport — you let them decide if they want to compete against them or not,\" Cuban said. CLICK HERE TO GET THE FOX NEWS APP Cuban, a staunch supporter of former President Joe Biden and former Vice President Kamala Harris and an impassioned critic of President Donald Trump, is one of the many prominent left-wing figures who have spoken out against the Democratic Party's stance on trans athlete inclusion. Smith has repeatedly called out the Democratic Party for its stance on trans athletes, suggesting it played heavily into its defeat in the November election. HBO host Bill Maher has also criticized Democratic support for trans inclusion in women's sports. Even Democratic lawmakers like Rep. Seth Moulton, D-Mass, and former Montana Sen. Jon Tester have spoken out against the party's current stance. A New York Times/Ipsos survey found the vast majority of Americans, including a majority of Democrats, don't think transgender athletes should be permitted to compete in women's sports. Of the 2,128 people who participated, 79% said biological males who identify as women should not be allowed to participate in women's sports. Of the 1,025 people who identified as Democrats or leaning Democrat, 67% said that transgender athletes should not be allowed to compete against women. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Dallas Mavericks minority owner Mark Cuban gave his take on the issue of trans athletes in women&apos;s sports in an interview on &quot;The Stephen A. Smith Show.&quot;","url":"https://www.foxnews.com/sports/mark-cuban-weighs-trans-athletes-womens-sports-people-just-arent-ready","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/mark-cuban-campaigning.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-06 00:23:07","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":-0.166},{"id":308104618,"title":"'Hands Off!' Protesters on Why They Are Rallying Against Trump and Musk","text":"Thousands of protesters packed Manhattan's Fifth Avenue on Saturday in a sweeping show of opposition to the Trump administration, joining the nationwide \"Hands Off!\" movement targeting President Donald Trump and billionaire Elon Musk.Why It MattersThe protests were among more than 1,200 coordinated across the United States on Saturday, organized by \"Hands Off!\" a grassroots movement supported by civil rights groups, labor unions, and advocacy organizations.Protesters primarily targeted the president and Musk for actions taken during the early months of the second Trump administration, criticizing mass federal layoffs, immigration crackdowns, and U.S. involvement in the conflicts in Ukraine and Gaza.In addition, hundreds of people in European cities—including Frankfurt, Berlin, London, Lisbon and Paris—took to the streets in solidarity with American protests.What To KnowFifth Avenue became a river of protest on Saturday, as thousands marched through Midtown Manhattan in one of the largest coordinated demonstrations of the year. Chanting, waving flags, and holding handmade signs, the crowd stretched nearly 20 blocks.Organizers said more than 600,000 people had signed up to participate in protests across the country. In New York City, the rally began at Bryant Park around noon, with demonstrators marching down Fifth Avenue through Madison Square Park.Protesters carried signs opposing cuts to Social Security and Medicare, demanding protections for immigrants and civil rights, and condemning federal downsizing efforts led by Musk's Department of Government Efficiency (DOGE).Some demonstrators waved American flags and held cardboard signs with clever slogans. One read, \"Billionaires are attacking fed workers for protecting you.\" Another declared, \"This is what democracy looks like.\"Early in the protest, many participants hesitated to speak on the record out of fear of retaliation. But as the afternoon continued, people began to open up.\"This is what we're standing out here in the cold for,\" Frank Hickey, a former police officer who lives in Manhattan, said. \"This is what we're getting fallen arches and stiff backs for—and I think it's important.\"Hickey, who previously volunteered in Ukraine teaching self-defense and leading a book club, called the protest \"an extension of the lawlessness of the Trump regime.\"Some protesters focused on single issues—such as defending Medicare or Social Security—while others voiced broader opposition to the Trump administration and the Make America Great Again (MAGA) movement. Musk was also a frequent target. Several signs demanded his \"deportation,\" while others denounced the influence he's had on the Trump administration since the campaign.Musk, who was born in South Africa, moved to the U.S. in 1992 to attend college. He initially entered the country on an Exchange Visitor Visa before transitioning to a work visa and eventually gaining citizenship.Kailani, a 26-year-old graduate student from the Bronx, said she feared the collapse of constitutional safeguards. \"The most concerning thing is the blatant disregard of the court orders that have been issued,\" she said. \"The checks and balances are not working and are being actively destroyed.\"Though largely peaceful, the protest saw a brief confrontation in Madison Square Park between an anti-Trump marcher and a Trump supporter. Police quickly stepped in. The pro-Trump counterdemonstration remained small.One of the Trump supporters involved in the altercation, Brian, said he attended the protest to push back against what he described as cultural confusion and societal decline.\"You've got people with cat litter boxes in schools. It's a bunch of brain syndrome,\" he said. \"Life isn't about grown men's feelings. If nobody ever gave a s*** about my part of life, why should I care about yours?\"He added: \"No politician is good, but there are politicians that are worse than the other ones. At some point you got to take a stand.\"The New York protest wound down by 6 p.m., with some groups staying behind to chant and speak out against what they described as \"the destruction of our government and our economy for the benefit of Trump and his billionaire allies,\" as one protester told Newsweek.Earlier this week, Trump announced global sweeping tariffs that have rattled global and domestic markets, with Wall Street tanking over the past few days, marking the worst days for the U.S. stock markets since 2020.What People Are SayingThe Hands Off! mission statement articulates specific grievances: \"They're dismantling Social Security and Medicare—forcing seniors and disabled Americans to jump through hoops to access the benefits they've already paid into. They're handing trillions to billionaires—while forcing the rest of us to pay higher prices for food, rent, and healthcare.\"President Donald Trump told Fox News in February: \"Social Security won't be touched, other than if there's fraud or something... It's going to be strengthened... Medicare, Medicaid, none of that stuff is going to be touched.\"Former Vice President Kamala Harris wrote on X, formerly Twitter, on Saturday: \"Today, in every state across our nation, Americans are standing up to the administration as they implement Project 2025 at full speed.\"Trump has distanced himself from Project 2025 and previously called parts of the 900-page guideline spearheaded by The Heritage Foundation \"ridiculous and abysmal.\" However, he has brought on some individuals associated with it into his administration.What Happens Next?Organizers hope the nationwide protests will sway lawmakers on issues such as voting rights, social services, and economic policy.","summary":"Protesters targeted Trump and Musk over federal layoffs, immigration crackdowns, and U.S. involvement in Ukraine and Gaza, among other issues.","url":"https://www.newsweek.com/hands-off-protesters-why-they-are-rallying-against-trump-musk-2055931","image":"https://d.newsweek.com/en/full/2621809/new-york-city-hands-off.jpg","video":null,"publish_date":"2025-04-05 23:25:42","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.054},{"id":308137544,"title":"My Trump-Loving Massachusetts Hometown Just Showed The Hell Up","text":"Massachusetts may be a reliably blue state, but my hometown of Marshfield is not.\n\nIn 2016, then-Democratic nominee Hillary Clinton decisively won the state in her face-off against President Donald Trump, earning nearly 61 percent of the vote. But in Marshfield—a suburb of 25,000 people, located about 30 miles south of Boston, where I spent my childhood before moving to New York City about a decade ago—the race went almost exactly down the middle.\n\nClinton won 47.5 percent of the town, and Trump won about 47 percent. Marshfield has followed a similar pattern since then, with the town’s inhabitants voting for Trump at a higher proportion than Massachusetts voters overall. \n\nWhile Trump’s popularity in Marshfield dipped slightly in 2020, he regained his 2016 levels of support in 2024, when 47 percent of the town voted for him and 51 percent supported Vice President Kamala Harris.\n\nNonetheless, a massive crowd turned out in Marshfield on Saturday to protest Trump’s second term and Elon Musk‘s takeover of the federal government. It was one of the thousands of such protests happening in big cities and small towns across the country. The energy of the opposition to Trump was apparent as I drove downtown, into the heart of the protest, past the town hall and a strip mall with pizza and burger joints. Cheering locals lined the street in front of a Dollar Tree and CVS Pharmacy, holding signs and American flags as passing cars honked.\n\n\"I came because I don't want them to take away the Social Security,\" #HandsOff rally-goer Jim Carson told our reporter @JulianneMcShane. \"That's stealing it—we all paid already!\" Julianne returned to her small hometown of Marshfield (pop. 25,000) which votes more red than… pic.twitter.com/KPr4uX5yjw— Mother Jones (@MotherJones) April 5, 2025\n\nAmongst the locals I talked to, the scale of the support—especially in a town like Marshfield—was indicative of the growing opposition to Trump and Musk. “I’m so heartened, because it’s just so upsetting how many people are hurting,” Patty Drogue, a resident of the nearby town of Norwell, told me.\n\nFor Drogue, the hurt is personal. A retired federal worker, she worked for more than 20 years with Head Start programs, which support low-income children. Project 2025 recommends eliminating and alleges the program is “fraught with scandal and abuse” and offers “little or no long-term academic value for children”—despite ample research that shows otherwise. The future of Head Start is even more uncertain after Tuesday’s mass layoffs at the Department of Health and Human Services (HHS), which houses the Administration for Children and Families (ACF), the office that administers the program. As a result of cutting Head Start, Drogue said, “there’s going to be a lot of kids and families going hungry; there’s going to be a lot of people that don’t make it through high school and can’t earn a living.”\n\n“The Head Start programs in the New England region now have no one to go to help them get the money that was promised to them. There’s no one there—they just fired everybody,” she added. The Boston Head Start office is one of five that will be closed following Tuesday’s layoffs, according to the National Head Start Association.\n\nMore from Patty & Sue on why they came out today:[image or embed]— Julianne McShane (@juliannemcshane.bsky.social) April 5, 2025 at 3:41 PM\n\nIndeed, the impact of the chaos Trump and Musk are unleashing across the federal government was what drove several protesters out into the rain, they told me.\n\nDrogue’s friend, Sue Fitzgerald, said her daughter will soon graduate college with a biomedical engineering degree. She’s concerned about RFK Jr.’s dismantling of HHS, which has also included cuts to some of the offices that work on reproductive health and disability issues, as my colleagues and I have reported. “We need to save healthcare, but also scientific research,” said Fitzgerald, who lives in the bordering (and slightly redder) town of Pembroke.\n\nPeter Brown, who said he is a retired OB-GYN and lives in Norwell, is most worried about the attacks on the health system, including RFK’s boosting of anti-vaccination viewpoints; slashing of National Institutes of Health (NIH) funding for critical research; undermining of efforts to support maternal health; and gutting of the FDA, among others. “I’m horrified that our country used to lead the world in research, and now it’s decimated,” Brown said.\n\nPeter Brown, a retired OBGYN from the nearby town of Norwell, on why he came out:[image or embed]— Julianne McShane (@juliannemcshane.bsky.social) April 5, 2025 at 4:41 PM\n\nProtesters said they are also disturbed by Trump and Musk’s dismantling of USAID, the agency that provided foreign humanitarian aid and would have helped the recovery effort following the recent devastating earthquake in Myanmar, as I recently reported. “I’m a humanitarian,” Fitzgerald said. “That’s more important to me than money.” Gutting USAID, in her view, was “terrible.” \n\n“Government is not a business—it is here to work for and with the people,” added Christine, a protester from Marshfield who declined to provide her last name. “We’ve taken away any good that America has done.” She works in the medical field and, like many American consumers, expects Trump’s tariffs will affect her wallet.\n\n“The cost of my supplies will definitely go up because gloves and masks are made in China,” Christine said. “I tried to prepare for it, but I don’t think I even ordered enough in advance.”\n\nAnother economic concern for protesters: cuts to their safety nets. “I don’t want them to take away the Social Security that we already paid—that’s stealing,” said Jim Carson, who said he retired after nearly 50 years working in the newspaper business. Trump, Carson added, “promised he wouldn’t touch it—but he’s going to let Musk cut it, so he can say, ‘it wasn’t me.'” \n\nMusk’s so-called Department of Government Efficiency, or DOGE, spearheaded the firing of about 7,000 workers at the Social Security Administration, and plans to fire potentially thousands more in the coming weeks, the Washington Post reports. Musk has also repeatedly spread disinformation about the program, including calling it a “Ponzi scheme.”\n\nJim Carson’s worried about Social Security being cut. “I was happy until Trump and Musk came along,” he says, “and now, we gotta stand up and fight.”[image or embed]— Julianne McShane (@juliannemcshane.bsky.social) April 5, 2025 at 5:57 PM\n\nSeveral protesters said they want members of Congress to be as fired up in opposition to Trump’s agenda as they are. “I would like our Republican senators to show up and do their job and remember that they were put in that place by us—not Donald Trump,” said Terri, a Marshfield resident who declined to gave her last name. Terri described herself as a “lifelong independent” who has historically leaned conservative, but Trump and Musk’s antics led her to register as a Democrat on Friday, she said. “It’s disturbing how much we are not taking care of our people and how much we’re going to lose if we don’t stop this.”\n\nChristine, the protester who worked in the medical field, and Terri’s friend, said she wishes Republican members of Congress voted against Trump’s unqualified cabinet members. But she’s finding hope in how some Democrat members are openly resisting: “Look at what Cory Booker just did; look at what Bernie Sanders and AOC are doing,” she said.\n\n“Where are the Republicans? Where’s the outrage?” asked Erin Herman, a resident of the nearby town of Cohasset, who works in sales. “Right now we just have to hold him to basic standards—that’s really what we’re asking for. Follow the Constitution, follow the law, and quit trouncing on our rights.”\n\nThe crowd cheered at honking cars even as the rain got heavier and the air got colder; by about 2:30 p.m. EST, they dispersed. Deborah Cornwall, one of the protest’s organizers, saw the success of the event as a sign of a shift. “Marshfield has been very red,” she told me, “but attendees today may be changing that in coming elections.”\n\nThe protesters I spoke to were pushed out into the dreary afternoon because, like Carson, the retired newspaper worker worried about cuts to Social Security, they felt they had no choice. “I was happy until Trump and Musk came along,” he said, “and now, we gotta stand up and fight.”","summary":"Massachusetts may be a reliably blue state, but my hometown of Marshfield is not. In 2016, then-Democratic nominee Hillary Clinton decisively won the state in her face-off against President Donald Trump, earning nearly 61 percent of the vote. But in Marshfield—a suburb of 25,000 people, located about 30 miles south of Boston, where I spent [&#8230;]","url":"https://www.motherjones.com/politics/2025/04/my-trump-loving-massachusetts-hometown-just-showed-the-hell-up/","image":"https://www.motherjones.com/wp-content/uploads/2025/04/2025_04_05_mcshanema.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-04-05 22:34:02","author":"Julianne McShane,Tim Murphy","authors":["Julianne McShane","Tim Murphy"],"language":"en","category":"politics","source_country":"US","sentiment":0.046},{"id":308095798,"title":"Trump-Stronghold The Villages in Florida Holds Large 'Hands Off!' Rally","text":"Nearly 2,000 residents of the retirement community known as The Villages, 20 miles south of Ocala, Florida, joined thousands across the United States in a \"Hands Off!\" protest against President Donald Trump and one of his top advisers, billionaire Elon Musk, a spokesperson for the mobilizing coalition told Newsweek on Saturday.Why It Matters \"Hands Off!\" is a grassroots movement and coalition of hundreds of organizations and mobilizers who want the Trump administration, including Musk, who heads the Department of Government Efficiency (DOGE) to take their \"hands off\" of Social Security, federal jobs, Medicaid, and more. Trump said in a February Fox News interview that Social Security, Medicare, and Medicaid benefits, will not be \"touched\" unless \"there's fraud or something.\"The protests are taking place just days after Trump's global sweeping tariffs which have rattled global and domestic markets, with Wall Street tanking over the past few days, marking the worst days for the U.S. stock markets since 2020.The Villages, located in Central Florida, is a Republican stronghold, making it notable that demonstrations are taking place there against the GOP president, who has deep ties to Florida through real estate investments and political allies.The Villages is primarily represented by Republican Representative Daniel Webster of Florida's 11th Congressional District. Newsweek has reached out to Webster's press team for comment via email on Saturday.What To Know The Villages is a predominantly white retirement community for residents aged 55 and older that spans three Central Florida counties, Lake, Sumter, and Marion. All three counties voted comfortably for Trump in 2024: Marion at 65 percent, Lake at 62 percent, and Sumter at 68 percent.A spokesperson for \"Hands Off!\" estimated that approximately 2,000 people in The Villages participated in the nationwide protests on Saturday. Democratic congressional candidate Barbie Harden Hall, who is running to represent Florida's 11th congressional district, which includes The Villages posted video of protests, writing that \"more than 1,500 came out today,\" with clips showing dozens of residents in golf carts lined up with signs protesting the president and Musk.More than 1,200 \"Hands Off!\" demonstrations across all 50 states were planned for Saturday, with a handful taking place in Europe as well. Local protests are being organized by advocacy groups, civil rights groups, labor unions, and various election and democracy activists, among others. Large crowds of protesters filled the streets in major cities across the country, including Boston, New York, Chicago and Washington, D.C., with many demonstrating despite the rain.The organization calls upon local advocacy groups and organizers to mobilize people to speak up against the administration, writing: \"Donald Trump and Elon Musk think this country belongs to them. They're taking everything they can get their hands on and daring the world to stop them. On Saturday, April 5th, we're taking to the streets nationwide to fight back with a clear message: Hands off!\"The website notes that a \"core principle\" of the protests is \"nonviolent action,\" and urges protesters to \"act lawfully\" at the events.During the 2024 presidential campaign, then-Vice President Kamala Harris, the Democratic nominee, campaigned in The Villages, where videos showed dozens of golf carts displaying support for her campaign.A handful of Trump-supporting cities held \"Hands Off!\" protests on Saturday, including Rome, Georgia, where 70 percent of county voters backed Trump's 2024 presidential bid, Midland, Michigan, where 56 percent supported him at the polls last November, and Little Rock, Arkansas, located in a county where 70 percent voted for Trump.Protests also took place across Florida, where Trump is a resident and frequently visits his golf course and Mar-a-Lago estate.What People Are Saying A \"Hands Off!\" spokesperson told Newsweek in a phone interview on April 5: \"The goal is hands off. You don't see this kind of turn out from folks unless people are frustrated, upset about what their government is doing...Hands off all the things that they [the government] is trying to take away in order to give billionaires tax cuts.\"Roxey Nelson, 1199SEIU Florida Executive Vice President, told Newsweek in a Saturday email: \"When hundreds of thousands turn out in top GOP stronghold areas across the country, it's not just a rally—it's a reckoning. The base is shifting, and the Administration should take notice.\"President Donald Trump told Fox News in February: \"Social Security won't be touched, other than if there's fraud or something...It's going to be strengthened... Medicare, Medicaid, none of that stuff is going to be touched.\"What Happens Next A \"Hands Off!\" spokesperson told Newsweek that the coalition anticipates upwards of 1 million people to partake in events across the world.","summary":"The Villages, a Republican-leaning community in Florida, joined more than 1,200 protests against Trump and Musk on Saturday.","url":"https://www.newsweek.com/trump-stronghold-villages-florida-holds-large-hands-off-rally-2055912","image":"https://d.newsweek.com/en/full/2621783/florida-protests.jpg","video":null,"publish_date":"2025-04-05 22:08:32","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"US","sentiment":0.062},{"id":308099724,"title":"We went to the anti-Trump protests. Here's what surprised us the most.","text":"Last week, nationwide protests targeted Elon Musk for his role in dismantling government agencies and firing federal workers through the White House DOGE Office.This week, they are targeting the man who gave him that role: President Donald Trump.In coordinated demonstrations that organizers said took place across all 50 states, the \"Hands Off!\" protest accused Trump and his administration of championing policies that benefit the rich while making life harder for everyone else.Business Insider sent reporters to protests in different parts of the country to hear from them directly. Many said they were most worried about the economy and their retirement investments, which have dwindled in tandem with Trump's tariff announcements. The crowds also skewed older compared to protests during Trump's first term.Here's what they told us and what surprised us the most.As I rode the train from Brooklyn to Midtown Manhattan, the subway car filled with protesters, their cardboard signs bumping up against umbrellas on a rainy Saturday in New York.By 1 p.m., the 42nd Street station was even more crowded than usual. Older people clutched slippery canes, and young kids clutched their parents' hands. One man wore a once trendy Harris Walz camo hat. Another waved a small American flag, an unusual display of patriotism at anti-Trump rallies.The damp horde of protesters shuffled toward Bryant Park, and in some ways, it all felt familiar. There were chants about abortion, signs featuring the face of now-deceased Supreme Court Justice Ruth Bader Ginsburg, a progressive icon, and a steady cacophony of car horns.But some things were different this time.For one, the crowd looked older, with middle-aged Americans seeming to outnumber the 20-somethings that dominated rallies during the pandemic. It makes sense since many Americans are watching their retirement savings dwindle in the face of crashing markets and worry that staff cuts to the Social Security Administration could impact the crucial safety net.While the anti-government protests held during Trump's first term focused on social issues — like abortion and civil rights issues — many of the signs today targeted the economy.Most of the people I spoke to didn't want to share their last names because they worried about their privacy in the current political environment. Yet they weren't shy about their rage and despair.Dorothy Auer, 62, told me she wished people would get angrier.\"I've been working for over 40 years, and I looked at my investments yesterday — my retirement plan — and I literally don't think I'll ever be able to retire,\" she said, starting to choke up.Wiping her eyes with her free hand — the other held a black and white sign bashing Musk — Auer told me it's distressing to see a man of such wealth \"turn around and crap on us.\"Jian, 33, held a sign that read, \"Tariffs are killing my 401(k),\" but he told me he's most upset about what's happening to his retired father.\"My dad just lost about 25% of his savings in the last three days because of the tariffs,\" he said.It's not just the economy, of course, that brought thousands of people out to Midtown Manhattan.Penny, 54, said the Trump administration affected virtually every issue she cares about. Even so, we ended up talking about Musk.\"I'm horrified that a person who wasn't born here, wasn't elected, seems to be getting carte blanche to do whatever he wants in our government,\" she said. \"How did he get a security clearance?\"Most of those I talked to as they slowly trudged toward Madison Square Park didn't think the protest would change Trump's mind.A few said they hoped Congress would pay attention, but more than that, people said they felt they needed to do something.\"Even if it's sort of hopeless right now, at least it's showing people that we're here,\" Pyare, 49, told me. \"And that we don't like it.\"Another week, another protest.On Saturday, I attended the Hands Off! rally in Novi, Michigan, a suburb of Detroit where 55% of the vote went to Kamala Harris during the election. Thousands of people showed up.The crowd was emotionally charged and united by the spirit of collective action. Many attendees said they were first-time protesters. The Tesla Takedown protests I attended last weekend seemed somber by comparison. Protesters here got loud.\"Call me Old Lady Army Fighting for Democracy,\" one 66-year-old woman, who didn't want to give her real name, told me. She held up a sign she had made. It was a charcoal drawing of the Statue of Liberty, whose hands covered her eyes in shame.\"I just copied this off of Facebook,\" she said. But to her it symbolized that \"everything that our country stands for is being destroyed, and the world is looking at us.\"Liana Gettel, 58, said she was outraged for several reasons, including the administration's stance on abortion. She said she had an abortion 29 years ago.\"I had lost a child. The child would not come out on its own. So I had to have a procedure. Had I not had that procedure, I wouldn't be here,\" she said. \"And that's what they want to block, is things like that?\"Protesters targeted many different issues, including abortion, trans, and minority rights. One protester holding up a sign for trans rights said, \"Trans people are just the appetizer, but everyone will be on the menu now.\"The line echoed remarks made by human rights advocate Channyn Lynne Parker at the Rally for Trans Visibility in Chicago last weekend.Unlike protests during Trump's first term, which focused on social issues, however, many people today were also worried about the president's economic policies.Matt Watts said he was protesting Musk's takeover of Social Security and Trump's tariffs on \"countries that don't deserve it.\" After the stock market began to take a hit from all the talk of tariffs, Watts said he took his money out of his 401(k) and invested it into a more stable fund. \"I'm getting ready to retire pretty soon. I've got to count on that savings,\" he said.The majority of protesters were middle-aged or older, but they managed to capture some younger activists with their energy.Yajat Verma, 18, said he hadn't known about the protest but was driving by with a friend when he saw the crowd. He decided to join in and started handing out water bottles to protesters.\"Everyone should be protesting,\" he said.","summary":"Coordinated nationwide protests against the Trump administration drew large crowds. Business Insider was there.","url":"https://www.businessinsider.com/anti-trump-protests-hands-off-2025-4","image":"https://i.insider.com/67f18ae05d203112923e3351?width=1200&format=jpeg","video":null,"publish_date":"2025-04-05 21:50:13","author":"Alice Tecotzky,Lakshmi Varanasi","authors":["Alice Tecotzky","Lakshmi Varanasi"],"language":"en","category":"politics","source_country":"us","sentiment":0.388},{"id":308117942,"title":"Climate change driving California’s Golden Road to decline","text":"California’s economic, academic, media, and political establishment still embraces the notion of the state’s inevitable supremacy. “The future depends on us,” Gov. Gavin Newsom said at his first inauguration, “and we will seize this moment.” Others see California as deserving and capable of nationhood, a topic that has resurfaced with Trump’s presidency as it reflects, as a New York Times column put it, “the shared values of our increasingly tolerant and pluralistic society.”\n\nCritics say this vision is at odds with the facts on the ground. Rather than the exemplar of a new “progressive capitalism” and a model for social justice, California both accommodates the highest number of billionaires and the highest cost-adjusted poverty rate. It has the third highest gap, behind just Washington, D.C., and Louisiana, between middle- and upper-middle-income earners of any state. Nearly one in five Californians – many working – lives in poverty (using a cost-of-living adjusted poverty rate); the Public Policy Institute of California (PPIC) estimates another one-fifth live in near-poverty – roughly 15 million people in total.\n\n“California” is a model that no longer delivers. To be sure, California has a huge GDP, paced largely by high real estate prices and the stock value of a handful of huge tech firms. It retains the inertia from its glory days, particularly in technology and entertainment, but that edge is evaporating as tech firms flee the state and Hollywood productions are shot around the world. For all its strengths, California has the nation’s second-highest rate of unemployment with lagging job growth, particularly in comparison to its neighbors and chief rivals, notably Texas, Arizona, and Nevada.\n\nThe signs of failure are evident on the streets. Roughly half the nation’s homeless population lives in the Golden State, many concentrated in disease- and crime-ridden tent cities in Los Angeles or San Francisco. Barely one in three state residents – and only one in four younger voters – now considers California a good place to achieve the American dream. Increasingly, California is where this dream goes to die.\n\n‘San Francisco Gentry Liberalism’\nThe roots of California are long and deep. In August, for example, the New York Times reported how its development into a one-party state controlled by progressive Democrats has made it the country’s center of political corruption. “Over the last 10 years,” the Times reported, “576 public officials in California have been convicted on federal corruption charges, according to Justice Department reports, exceeding the number of cases in states better known for public corruption, including New York, New Jersey and Illinois.”\n\nIronically, the state’s corruption and decline have been expressed through policies long touted as symbols of progressive enlightenment and virtue – the odd marriage of oligarchal wealth and woke political consciousness some describe as “San Francisco gentry liberalism.”\n\nUnder this regime, epitomized by Gov. Gavin Newsom and former Vice President Kamala Harris, progressivism has lost its historic embrace of upward mobility and replaced it with an ideology obsessed with race, gender, and climate. It has produced a political leadership class that, for the most part, is largely made up of long-time government or union operatives. In the legislature, the vast majority of Democrats have little to no experience in the private sector. The failure may have been accelerated by the secular decline of the once-powerful Republican Party over the past two decades. This decline removed the incentives for Democrats to concern themselves with moderate voters of either party.\n\nThis development represents a distinct break even with California’s pro-growth progressive past, which helped make the Golden State a symbol of American opportunity, innovation, and prosperity. The late historian and one-time state librarian Kevin Starr observed that, under the governorship of Democrat Pat Brown in the late fifties and early sixties, California enjoyed “a golden age of consensus and achievement, a founding era in which California fashioned and celebrated itself as an emergent nation-state.” In 1971, the economist John Kenneth Galbraith described the state government as run by “a proud, competent civil service,” enjoying some of “the best school systems in the country.”\n\nThis may seem something like ancient mythology to most Californians today. If the builder Pat Brown was an exemplar of “Responsible Liberalism,” California’s government today has been ranked by Wallet Hub as the least efficient in delivering services relative to the tax burden. Pat Brown’s son Jerry – who was governor from 1975-1983 and then again from 2011-2019 – and his successor, Newsom, epitomize the triumph of ideology over effectiveness. Theirs is a kind of performative progressivism that shrugs about things like roads that are now among the nation’s worst, a high-speed bullet train plagued with endless delays and massive cost overruns, and a failure to boost critical water systems in a perennially drought-threatened state.\n\nIn exchange for all this, the progressive regime has stuck ordinary Californians and businesses with some of the nation’s highest taxes and greatest regulatory burdens. California’s business climate is rated at or near the bottom in most business surveys. The Tax Foundation’s 2019 State Business Tax Climate Index, which evaluates taxes in five categories, also lists California at number 49, with only New Jersey trailing.\n\nThese policies have made California exceptionally expensive for both businesses and households. Indeed, according to current estimates, only Hawaii and Massachusetts have a higher cost of living. California has the highest average housing, second highest transportation, and third highest food expenses in the country. Much of this is invisible to the top 20% and 5% of California households, who enjoy median incomes of $72,500 and $129,000 greater than their national counterparts, but is widely felt in the state’s less affluent areas.\n\nPell-Mell Into Climatism\nCalifornia progressivism today embraces many causes – undocumented immigrants, transgender kids, reparations for slavery – but nothing has shaped the state’s contemporary politics more in recent years than a commitment to what Newsom described in 2018 as “climate leadership.”\n\nIn embracing the catastrophism that defines climate change as an existential threat to life on the planet, Newsom has left behind the old progressive notion of focusing on materially improving people’s lives by embracing inherently uncertain computer models predicting danger.\n\nIn California, experts from what Bjorn Lomborg, a leading skeptic of climate catastrophism, calls “the climate industrial complex” provide the justification for staggeringly expensive, socially regressive mandates based on the conjured models; the state mandates GHG reductions but leaves implementation in the hands of state agencies closely aligned with the green lobby.\n\nThis allows the legislature to look the other way as state climate policies knowingly increase poor and working family costs and shift billions of dollars to the wealthy in the relentless pursuit of unilaterally modeled carbon emission targets that even advocates admit cannot possibly “fix” the global climate. Indeed, in 2023, the California Air Resources Board belatedly disclosed current state climate policies would disproportionately harm households earning less than $100,000 per year while boosting incomes for those above this threshold.\n\nNewsom’s dogged emphasis on climate change – and achieving “carbon neutrality” by 2045 – has meant massive subsidies for wind and solar, mandates to reduce personal car use by nearly three times the temporary cuts caused by pandemic lockdowns, electrification of home appliances at a cost of many thousands of dollars per household, and even cuts to dairy and livestock emissions with technology mandates, accelerating the relocation of these food producers to other states and increasing food prices.\n\nTo justify the pain, state regulators estimated that paying for these changes today would prevent future climate damage, all of which depend on highly uncertain projections spanning, in some cases, hundreds of years in the future. The problem is that even if damage projections are remotely accurate, California’s climate law recognizes that the state cannot affect the global climate unless everyone else in the world follows suit. In fact, global emissions are rising, especially from China, which exported over $120 billion in goods and services, notably manufactured goods, often produced with coal, to California in 2023.\n\nAlso based on “expert” opinion, the state has embraced a policy to force people to buy electric vehicles by 2035, a policy increasingly questionable amidst slowing demand for these vehicles. Once again, state officials relying on speculative projections proclaim that the policy will benefit the state’s consumers and the environment, although this seems questionable, given, as Volvo suggests, the energy demands of building such cars may take years to have a positive impact.\n\nFires: The Price of Climate Delusion\nThe recent fires that incinerated a swath of Los Angeles revealed the shortcomings of the current climate-obsessed regime. To be sure, President Trump’s claim that water policies created the conflagration is largely false, but the lack of attention to water delivery and forest maintenance, a consistent aspect of the Jerry Brown-Newsom era, clearly contributed to the intensity of the blaze.\n\nIn 2014, California voters overwhelmingly approved a ballot measure allocating $2.7 billion to increase state water storage capacity, including the building of new reservoirs. These facilities would not only improve an aging water system neglected for decades but also capture and store precipitation that may occur in less frequent, more intense storms. Yet, even government apologists concede that, 10 years later, progress has been too slow, with deeply entrenched bureaucracies issuing permits only at a “glacial” pace.\n\nRather than building on the achievements of Pat Brown, state officials spent a quarter of a billion dollars helping environmental groups destroy dams and hydroelectric generation along the Klamath River in northern California. While this effort may yet improve fish habitat as intended, its initial results are sobering. Most of the river’s existing fish, crustaceans, and other organisms were killed by toxic sediment as the dams were removed, and unanticipated tar-pit-like mud exposure trapped large mammals, including protected wild horses. In March 2024, fish that state biologists confidently released into the restored river perished in a mass “die-off” within two days.\n\nThese misplaced priorities are also mirrored in Los Angeles, where reservoirs were left empty, leaving water unavailable and water hydrants without pressure. Both the state and local governments have failed to sufficiently fund fire-fighting operations, except for approving lavish pensions.\n\nThe climate catastrophists may promote fires as a sign of the coming apocalypse, but still consistently oppose effective fire management, as the Little Hoover Commission found as far back as 2018, discouraging such things as controlled burns and brush clearance. Policies of controlled burns, practiced by Native Americans and in areas like Western Australia, have been largely ignored.\n\nEven as he rails against “misinformation,” Newsom blamed the recent LA fires, as he has earlier blazes, on climate change. This claim has been widely debunked by scientists like Steve Koonin and Roger Pielke and the U.S. Geological Service. Undaunted, Newsom’s neat solution appears to be to sue the oil companies for fires made far worse by Newsom’s own policies.\n\nThe Greening of Decline\nCharred landscapes and burnt houses reflect one legacy of California’s progressive obsessions. More widespread has been the impact of taxes and climate regulations on the overall economy, particularly for minorities and working- and middle-class households, who were once the focus of traditional liberalism.\n\nThis shift has been bolstered by the ascendancy of public employee unions and the remarkable growth of the state bureaucracy. California, under Pat Brown, largely avoided public employee unions, but his son Jerry and other governors reversed this policy. Since 2022, even with budget shortfalls, California has among the highest rate of government sector growth in the country. Today, they are widely seen as a dominant force in Sacramento. Particularly powerful has been the 310,000-member California Teachers Association. Their numbers have continued to swell, even amidst budget shortfalls, at a faster rate than private-sector employment.\n\nPublic employees, or their union representatives, constitute a powerful part of California’s emerging class hierarchy. Increasingly, their livelihoods are tied to an agenda of ever more regulation and taxes. Public workers, of course, also share these costs, but more regulation also engenders more jobs for the bureaucracy.\n\nUnfortunately, the vast majority of Californians, particularly the working class, do not enjoy such benefits. In assessing the impacts of climate policies, environmental and civil rights attorney Jennifer Hernandez has dubbed these policies “the Green Jim Crow,” linking the state’s climate regulatory effort to the impoverishment of millions. California has the highest energy prices in the continental U.S., double the national average, which has exacerbated “energy poverty,” particularly among the poor and those in the less temperate interior.\n\nIn 2023, Chapman University researcher Bheki Mahalo found that the tech and information sector accounted for close to two-thirds of state GDP, compared to 8.5% in 1985. Virtually every sector associated with blue-collar employment – manufacturing, construction, transportation, and agriculture – has declined while most others have stagnated.\n\nConsider California’s once vibrant fossil fuel industry. The state’s last major oil firm, Chevron, recently moved to Houston. In 1996, California imported less than 10% of its crude oil from foreign sources. In 2023, foreign suppliers such as Iraq and Saudi Arabia accounted for over 60% of the state’s supplies. This continued shuttering of the state’s fossil fuel industry will cost California as many as 300,000 generally high-paying jobs, roughly half held by minorities, and will devastate, in particular, the San Joaquin Valley, where 40,000 jobs depend on the oil industry.\n\nOther blue-collar industries – construction, manufacturing, logistics, and agriculture – are also suffering under California’s climate policies. Over the past decade, it has fallen into the bottom half of states in manufacturing sector employment, ranking 44th in 2023; its industrial new job creation has paled in comparison to gains from competitors such as Nevada, Kentucky, Michigan, and Florida. Even without adjusting for costs, no California metro area ranks in the U.S. top 10 in terms of well-paying, blue-collar jobs. But four – Ventura, Los Angeles, San Jose, and San Diego – sit among the bottom ten.\n\nBut not all the damage has been limited to “the carbon economy.” Progressive climate, labor, and tax policies have chased a broad range of companies out of the state, including an array of leading companies tied to professional services and engineering: Jacobs Engineering, Parsons, Bechtel, Toyota, Mitsubishi, Nissan, Charles Schwab, and McKesson. Even Hollywood is hemorrhaging jobs, and recently, In and Out Burger, the state’s widely beloved fast food chain, announced it is planning a move to Tennessee. California is increasingly losing ground both in tech and high-end business services to sprawling, low-density metro areas like Austin, Nashville, Orlando, Charlotte, Salt Lake City, and Raleigh.\n\nCalifornia, once the land of opportunity, is the single worst state in the nation when it comes to creating jobs that pay above average, while it is at the top of the heap in creating below-average and low-paying jobs. The state hemorrhaged 1.6 million above-average-paying jobs in the past decade, more than twice as many as any other state. Since 2008, the state has created five times as many low-wage jobs as high-wage jobs. In the past three years, the situation worsened, with 78.1% of all jobs added in California from lower-than-average paying industries versus 61% for the nation as a whole.\n\nThe only sector that has seen a big growth in higher-wage jobs has been the government, which is funded by tax receipts from the struggling private sector. Public sector employment is growing at about the same pace as jobs overall in California, but over the decade at twice the national pace. The average annual pay for those public sector government jobs is now almost double that of private sector jobs.\n\nThe Housing Crisis: Middle-Class Kill Shot\nThe lack of well-paying jobs meshes poorly with high living costs, notably in terms of housing. Here again, climate politics play a critical role in driving high housing prices in California. In the late 1960s, the value of the typical California home was more than four times the average household’s income. Today, it’s worth more than 11 times. The median California home is priced nearly 2.5 times higher than the median national home, according to 2022 Census data.\n\nA key driver of this price hike is climate policy restraints on suburban development and single-family housing, supposedly to cut residential emissions. These restrictions push putting new housing close to transit in a state where barely 3% of employees use it to get to work, according to the American Community Survey. Perhaps more to the point, these policies are not what most Californians want. One recent PPIC survey has found that 70% of Californians prefer single-family residences, according to a poll by former Obama campaign pollster David Binder, and oppose legislation, written by Democratic Senator Scott Wiener, that banned single-family zoning in much of the state.\n\nThe state has tried to sell its density dream as a means to boost production as well as lower prices. It has not worked out. From 2010 to 2023, California’s housing stock rose by just 7.9% over this period, lower than the national increase (10.3%), and well below housing growth in Arizona (13.8%), Nevada (14.7%), Texas (24%), and Florida (16.2%). These states are also the primary beneficiaries of California’s outmigration. An unusually large pool of affluent households is “stuck” and bids up prices in urban rental markets.\n\nToday, homeownership is becoming rarer among California residents. The state now has the nation’s second lowest homeownership rate, at 55.9%, slightly above New York (55.4%). High prices impact young people, particularly on the homeownership rate.\n\nHomeownership for Californians under 35 has fallen by more than half since 1980 and is plummeting even among people in their 40s and 50s. Minorities are particularly impacted by these initiatives. Based on census data analyzed by demographer Wendell Cox, the state’s African American homeownership rate is 35.5% – well below the national rate of 44% – and the state’s Latino homeownership rate ranked 41st nationwide.\n\nFrom Surfboard to Walker? \nIf you think of California’s wealth-creation machine as a conveyor belt, continually providing generations with a stake in society through their homes, that belt has now stalled. Reduced economic opportunity and lack of affordable housing have created something once thought impossible – population growth well below the national average. In virtually every survey exploring why residents are leaving the state, housing costs are at the top of the list.\n\nIncreasingly, California’s demographics resemble the pattern of out-migration long associated with northeastern and midwestern states. Since 2000, more than 4 million net domestic migrants, a population about the same as the Seattle metropolitan area, have moved to other parts of the nation from California. Since 2020, the pace has picked up, with almost 1. 5 million domestic migrants in just four years.\n\nMany leaving the state are in their 30s and 40s, precisely the group that tends to buy houses and start businesses. In 2022, California lost over 200,000 net migrants older than 25, the bulk of whom had either four-year or associate degrees. The groups showing the biggest tendency to leave, according to IRS numbers, are those in their late 30s to late 50s, which includes people who tend to have families.\n\nAt the same time, international migration, long a source of demographic vitality, has lagged behind other key states, notably Texas. As the Brookings Institution has noted, from 2010 to 2018, the foreign-born population of Houston, Dallas-Fort Worth, Austin, Columbus, Charlotte, Nashville, and Orlando increased by more than 20%, while San Francisco’s foreign-born population grew only 11%, and New York’s grew by 5%.\n\nThe state retains by far the nation’s largest foreign-born population, but even the massive movement allowed under Biden’s open border policy since 2021 failed to reverse population declines in big California cities. With the border now effectively closed, this last source of population growth is likely to decline.\n\nBy losing immigrants and younger people, the state is effectively consuming its “seed corn.” The state’s total fertility rate, long above the national average, is now the nation’s 10th lowest and falling faster than the national average as well as among its key competitors. Los Angeles and San Francisco rank last and second-to-last in birthrates among the 53 major U.S. metropolitan areas. In California, only Riverside/San Bernardino exceeds the national average for births among women aged between 15 and 50, according to the American Community Survey.\n\nUltimately California, the birthplace of youth culture, is getting old, in some places more resembling Hawaii than the entrepreneurial powerhouse of the past. From 2010 to 2018, California aged 50% more rapidly than the rest of the country, according to the American Community Survey. As of 2022, 21%, or 8.3 million people, were over the age of 60 in California, and according to the California Department of Aging, this population is expected to grow by 40% in the next 10 years. By 2036, seniors will be a larger share of the population than kids under the age of 18. California is gradually ditching the surfboard and adopting the walker.\n\nNeeded: A New California Agenda\nGavin Newsom’s response to the state’s decline has been not to call for major reform but for “Trump proofing” the state, spending tens of millions on lawsuits. Such gestures do not address how California can maintain its status as the epicenter of “the new economy” and address the vast divides between the elite and highly educated, and the vast mass of our residents.\n\nRather than fight the president at every turn, California can find ways to take advantage of the new regime. After all, hanging on to the climate agenda is doing very little good for Californians or the planet. California has reduced its emissions since 2006 at roughly the same rate as the rest of the country. The fires have largely erased even these gains, as does the fact that when people or companies flee the state, their carbon signature tends to increase.\n\nOddly, Trump could force needed policy changes in order to bring in federal help, something Newsom has already done in regard to water policy. The notion that California has a better model – the rationale for the Newsom-led “resistance” – does not sell in the rest of the country, much less at the White House. In a national 2024 survey conducted for the Los Angeles Times, only 15% of respondents felt that California is a model other states should copy; 39% said the state was not a model and should not be emulated; 87% said the state was too expensive; and 77% would not consider moving to California.\n\nYet, for all its problems, California is far from hopeless, and its promise is not extinguished. It remains uniquely gifted in terms of climate, innovation, and entrepreneurial verve. Sitting at the juncture of Asia, Latin America, and North America, it can once again become, as Kevin Starr noted, America’s “final frontier: of geography and of expectation.”","summary":"State is a 'model that no longer delivers'","url":"https://www.wnd.com/2025/04/climate-change-driving-californias-golden-road-to-decline/","image":"https://www.wnd.com/wp-content/uploads/2025/01/fires-los-angeles-pacific-palisades-landscape-jpg.jpg","video":null,"publish_date":"2025-04-05 21:47:24","author":"Realclear Wire,RealClearWire","authors":["Realclear Wire","RealClearWire"],"language":"en","source_country":"us","sentiment":0.316},{"id":308097078,"title":"Anti-Trump protests erupt in all 50 US states","text":"Crowds of demonstrators gathered across all 50 US states on Saturday in what was expected to be the largest nationwide protest of Donald Trump’s second term.\n\nTens of thousands of protesters marched through Washington DC, New York and Boston as part of the more than 1,200 “Hands Off!” demonstrations planned across the country to denounce Mr Trump and Elon Musk’s “hostile” attack on Americans’ rights.\n\nThe “mass mobilisation day” is a protest against Mr Trump’s economic agenda and the aggressive government cuts led by his billionaire “first buddy” Mr Musk.\n\nNearly 600,000 people signed up to attend the protests, which included demonstrations in Canada and Mexico, against the string of controversial executive orders Mr Trump signed on his first day in office.\n\nIt comes days after Mr Trump announced hundreds of billions of dollars of “reciprocal” tariffs on America’s trading partners on Wednesday, triggering a global stock market meltdown.\n\nAs an estimated 20,000 anti-Trump protesters spilled out beneath the Washington Monument, Mr Trump was in Florida playing golf at his club in Jupiter, before returning to his Mar-a-Lago estate in the afternoon.Protesters waved signs accusing Mr Musk of being a “fascist”, portrayed Mr Trump with a swastika on his forehead and vowed to “fight the oligarchy”.\n\nSome carried Ukrainian flags and others wore Palestinian keffiyeh scarves and carried “Free Palestine” signs, while Democrats from the US House of Representatives criticised Mr Trump’s policies on stage.\n\nThe protests follow a wave of demonstrations at Tesla facilities across the country in the wake of Mr Musk’s Department of Government Efficiency (DOGE) team slashing 200,000 federal jobs. Mr Trump denounced the protests, which at times descended into vandalism, as domestic terrorism.\n\nMuch of the president’s agenda has been restrained by lawsuits contending he has overstepped his authority with attempts to fire civil servants, deport immigrants and reverse transgender rights.\n\nHours before Saturday’s US protests were due to start, hundreds of anti-Trump Americans living in Europe gathered in Berlin, Frankfurt, Paris and London to voice their opposition to Mr Trump’s sweeping US foreign and domestic policies.\n\n“This is an enormous demonstration that is sending a very clear message to Musk and Trump and congressional Republicans and all the goose-stepping allies of MAGA that we don’t want their hands on our democracy, on our communities, on our schools and our friends and our neighbours,” said Ezra Levin, co-founder of Indivisible, one of the groups organising Saturday’s events.\n\nAt the start of Mr Trump’s first term in 2017, hundreds of thousands of protesters joined the Women’s March on Washington to demonstrate against his presidency.\n\nWhile stars including Madonna, Helen Mirren and Whoopi Goldberg joined grassroots protesters the day after Mr Trump’s first inauguration, celebrities were notably absent from Saturday’s protests.\n\nIt comes after critics claimed Kamala Harris’s campaign, which included a carousel of the world’s biggest stars, made her appear out of touch with voters.\n\nTerry Klein, a retired biomedical scientist from Princeton, New Jersey, was among those who gathered by the stage beneath the Washington Monument on Saturday.\n\nShe said she drove down to attend the rally to protest Mr Trump’s policies on “everything from immigration to the DOGE stuff to the tariffs this week, to education. I mean, our whole country is under attack, all of our institutions, all the things that make America what it is.”\n\nSpeaking at the Washington demonstration, Jamie Raskin, a Maryland congressman, accused Mr Trump of having “the politics of Mussolini and the economics of Herbert Hoover.”\n\nThe Democrat politician told the crowd:“Our founders wrote a Constitution that does not begin with ‘We the dictators,’ the preamble says ‘We the people,’... No moral person wants an economy-crashing dictator who knows the price of everything and the value of nothing.”\n\nAcross the country in Los Angeles one protester dressed up as Marie Antonette and held a sign reading: “Musk & Trump say: let them eat cake”.\n\nWhite House assistant press secretary Liz Huston said: “President Trump’s position is clear: he will always protect Social Security, Medicare, and Medicaid for eligible beneficiaries.\n\n“Meanwhile, the Democrats’ stance is giving Social Security, Medicaid, and Medicare benefits to illegal aliens, which will bankrupt these programs and crush American seniors.”","url":"https://uk.news.yahoo.com/anti-trump-protests-erupt-50-212156112.html","image":"https://s.yimg.com/ny/api/res/1.2/8PDS2bPo8ZGMyY8g9JsMgQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_telegraph_818/0f4b38f3c4877c761410dcd0cb4210bd","video":null,"publish_date":"2025-04-05 21:21:56","author":"Susie Coen","authors":["Susie Coen"],"language":"en","category":"politics","source_country":"gb","sentiment":0.128},{"id":308143778,"title":"Anti-Trump protesters gathered at hundreds of locations nationwide - USA Today","text":"Thousands protested across the U.S. on Saturday against President Trump's policies and actions.Protesters voiced concerns over cuts to education, social security, tariffs and potential threats to democracy.Protesters also objected to the role billionaire Elon Musk has played in Trump's government.\n\nWASHINGTON, D.C. ‒ Tens of thousands of people are gathering Saturday at rallies across the country to voice concerns over President Donald Trump's actions since taking office.\n\nThe \"Hands Off\" protests are expected to be the largest and most numerous protests since Trump's second term began. Nationwide more than 500,000 people have RSVP'd to attend one of 1,000 rallies marches or protests organized by grassroots groups. The biggest protest was expected to be in D.C..\n\nBy 1 p.m. Eastern, protesters stretched as far as the eye could see along the National Mall and the crowd had been flowing toward the base of the Washington monument for hours. Metro Police were forced to shut down 14th street, a major road across the National Mall, because so many pedestrians were crossing.\n\nPeople were waving American flags and Ukrainian flags. They carried signs protesting cuts to the Education Department and Social Security, supporting trans rights and urging people to vote and defend the Constitution. Some played drums and shouted from bull horns. Toddlers rode tricycles or their parents' shoulders. Dogs wore shirts declaring themselves \"dogs against DOGE.\"\n\nThe White House had earlier dismissed the protests, with Press Secretary Karoline Leavitt telling USA TODAY this week that \"protests, lawsuits, and lawfare\" will not sway Trump \"from delivering on the promises he made to make our federal government more efficient and more accountable.\" Trump was not in D.C. Saturday, though protests were expected near his estate in Mar-a-Lago, Florida.\n\nLuella Jaslowski, 59, of Twin Lakes, Wisc. said she and her sister jumped to buy plane tickets to Washington when they learned about the Hands Off protest two weeks ago. She said it was important to be there in person, even if Trump is not in Washington.\n\n\"I want to be here. I know he's not here, but I want to be here because this is where democracy starts,\" she told USA TODAY.\n\nShe said she hopes people see the size of the opposition to Trump and opposition to Elon Musk, who has led the Department of Government Efficiency, which has cut tends of thousands of federal jobs.\n\nBut Lee Eiden, 72, works at the National Institutes of Health and said it was time to stand up and say something.\n\n\"The reductions in force have been so indiscriminate and clumsily laid out that we're actually endangering health and safety and the protection of federal property,\" he said.\n\nRenée Beaver, 45, of Washington, DC had friends come down from Philadelphia for the protest.\n\n\"I don't know how much an actual protest can change Donald Trump's mind about anything, but getting out with people and engaging in solidarity activities, I think, is good for everyone's spirit, and also shows that there is an opposition, that there are people that don't like what's going on,\" she said.\n\nAcross the country ‒ and the world\n\nMore than 1,200 other protests were planned across the country. Organizers said they wanted to have protests that are not only accessible for people wherever they are in the country, but also highly visible to show that opposition exists in every part of the country.\n\nIn Erie, Pennsylania, for instance, a crowd estimated by organizers to number more than 700 gathered in the city's Perry Square. About 200 stood on the Roosevelt Bridge in Stuart, Florida, roughly an hour's drive north of Mar-a-Lago. In Sedona, Arizona, well over 500 protesters marched through downtown with chants of “Deport Musk.” In Providence, Rhode Island, a crowd estimated at 6,000 met at Hope High School at noon and then marched down Thayer Street and Angell Street to Burnside Park, joined by brass bands.\n\nIn York, Pennsylvania, well over 700 people stood on the four quadrants of the square named in honor of the Continental Congress’ nine-month stay in York during the Revolutionary War. The peaceful protesters waved signs targeting Trump and Musk.\n\nAnd some even wore costumes. Caro Stowell of Thomasville was dressed up like a clown.\n\n“I came out because we have elected a clown, and now we have a circus,” she said as cars drove past beeping their horns in support of the rally.\n\nStowell said she believes the administration is destroying education and health care. “You can see all the people here who are not happy with what’s happening to our Constitution,” she said motioning toward the crowd.\n\nThousands of protesters also gathered Saturday in Berlin, Paris and London to rally against Trump and Musk.\n\nIn February alone, more than 2,085 protests took place nationwide, according to the Crowd Counting Consortium, a joint project of Harvard Kennedy School and the University of Connecticut.\n\nThat's an increase from 937 protests in February 2017, the first full month of the first Trump administration. But many of the protests in the early months of Trump's first term were much larger than the nation has seen so far in 2025, and there has been less frequent media coverage of protests this year.\n\nMoveOn Executive Director Rahna Epting said the goal was to concentrate all of those protests into one day to show how many Americans oppose cuts to critical services and benefits they've earned like Medicare.\n\n\"Hands Off is like hands off on all these things, not just our services and benefits, but our rights and our freedoms, all of which are being threatened right now, and we're seeing it every single day,” she said. \n\nAll of Saturday's protests were reported to be peaceful with almost no counter-protesters and only a small number of arrests.\n\nIn downtown Appleton, Wisconsin, a man was arrested just moments after the protest began.\n\nAccording to bystanders, the man pulled a Tesla driver, Matt Simon, out of his car and punched him in the face while protesters nearby chanted “Peaceful! Peaceful!” The Tesla driver’s wife, Edie Simon, who was there to protest, said her husband bought the Tesla three years ago and was driving it for Uber because he was out of work.\n\n“We’re anti-Trump, anti-Musk in every way,” she said.\n\nThe issues: Standing up for democracy\n\nCC Kay of Silver Spring, MD said she came to the Washington monument protest because \"either I do this or I stay in bed depressed.\"\n\nThe issue she was there to raise was voting rights.\n\n\"Protesting is the way I can scream. And I just feel that voting underscores everything. Everything. Without the vote, we get nothing. We have to make voting the number one priority,\" she said.\n\nEd Jeffries, 74, of Poland, Ohio said he feels like Trump is robbing America of its democracy.\n\n\"We're losing it in this country, and we need to start fighting back. He has too many people that are just siding with him,\" Jeffries said. \"Somebody has to stand up, and that's what we're here for.\"\n\nAnn Berger, 78, of Stuart, Florida, who lives half the year in Wisconsin, said she was protesting at the Roosevelt Bridge over the recent Wisconsin Supreme Court election in which a candidate backed by Musk lost.\n\n“Elon Musk came in and put $28 million in, and offered millions of dollars for votes, and I think that’s wrong,” Berger said. “We are not for sale. That’s not the way our government should run.”\n\nShe felt a \"duty\" to attend Saturday’s protest in Stuart.\n\n“We all should be speaking out; we all should be speaking our piece,” she said. “We should be respectful and listen to each other, but we need to speak the truth. There’s too much fear going on.”\n\nJoan Kelly, 60, of Port St. Lucie, who also attended the Florida protest, felt similarly.\n\n“Today I am standing up for myself, my daughters, my grandchildren, all of our rights,” Kelly said as she grabbed a chair from her car. “I just think what's going on in America today is so sad and it's confusing. It's just scary and confusing, to be honest.”\n\nHer friend, Amy Morgan, 61, also of Port St. Lucie, nodded her head as Kelly spoke.\n\n“It’s just terrifying. I'm just scared and upset and angry and I just feel like I’ve got to do something,” Morgan said. “Sitting back and hoping isn't working.”\n\nProtesting federal cutbacks\n\nFormer federal employee Lisa Gibbon used to work in HR and said Trump violated proper procedures for laying off federal employees.\n\n\"I know the right way to do these things and the wrong way, and this was the wrong way,\" she said.\n\nShe traveled into the D.C. from Frederick County, Maryland,, for the protest.\n\n\"I'm here to do my little part, because I don't have a lot of power, but I want to join those who do to save our country from those who are trying to destroy it,\" she said.\n\nSam Lau of Dover sat in a wheelchair in York, Pennsylvania, wearing a mask and holding a sign that said “Hands off Medicaid.” She said she feels the administration is targeting the federal program designed to cover medical costs for people with limited income and resources.\n\n“I’m on Medicaid. This is not me being dramatic here. I will die without it,” she said, noting that she needs “thousands of dollars of medications and treatments each month that keep me alive. Without Medicaid, it’s just going to be a quick death.”\n\nMark Askew, 67, said the workforce cuts at the Department of Veterans Affairs and Trump's firing of Air Force Gen. CQ Brown, the chairman of the Joint Chiefs of Staff, are what motivated him to attend Saturday's event in his hometown of Cincinnati. It marked his first time at a protest.\n\nAskew, a Navy veteran, described Trump's removal of Gen. Brown as \"basically racist.\"\n\n\"I don't like the fact that he feels that all veterans are suckers,\" Askew continued. \"He's cutting VA benefits and reducing government workers who are veterans … I just think that somebody needs to do something, that's why I'm here.\"\n\nHe added that he loved experiencing his first protest.\n\n\"The rain is probably going to have me sneezing tomorrow, but I enjoy it,\" Askew said before adjusting the grip on his sign, which read \"Trump hates veterans because they are brave and he is a coward.\"\n\nIt's the economy\n\nIn Boca Raton, Matthew Kass, a former Republican town council member from Chester, N.J., carried a sign reading “TARIFFS KILL JOBS!” on one side, and the other, “END THE TRADE WAR! NO MORE DOGE! FIRE MUSK! DUMP TRUMP!”\n\nMusk is canceling federal contracts with companies, with Trump’s approval, and giving his own company that money. “It’s corruption before our very eyes,” said the retired bonds trader.\n\nWhat keeps him optimistic, Kass, 67, of Boynton Beach said, is seeing the protesting crowds and Republicans losing at the ballot box in smaller elections since November. \n\nKaren Shernit 57, and her sister Susan, 64, attended the rally in Detroit in part to mark the fifth anniversary of their mother's death from COVID-19.\n\nKaren Shernit said she protested to fight her own feelings of helplessness, in addition to her many complaints about Trump,\n\n\"You could name anything, from the economy, tariffs, health insurance, Elon Musk, who is not elected to any office, just taking jobs away from people and just dismantling our entire federal government leaves me terrified,\" she said.\n\nConcerned about cruelty\n\nOutside the Indiana capitol building in Indianapolis, Gwyn Skrobul, 62, worried that cuts to Social Security and Medicare would harm her 95-year-old mother.\n\nThe retired history teacher said she's concerned the past could be repeating itself.\n\n\"The whole targeting minorities and polarizing the community – it's looking very Nazi-esque to me, which is frightening. I don't want to leave this kind of a world to my children, grandchildren,\" Skrobul said.\n\nHer husband, Guy Skrobul, 62, spent his career as a special education teacher.\n\n\"The minute that he mocked a reporter with a physical handicap – that was it. The hateful rhetoric. The injustice. Relishing in cruelty toward other people is wrong.\"\n\nCarla Greenfield, 67, who joined a protest in Rochester, New York said she felt the need to express her frustration Saturday.“I feel like we need to take control and let them know how we're feeling,” said Greenfield, who voted for Democrat Kamala Harris in last fall's election because she was concerned about Trump's apparent lack of empathy. “I have friends that are veterans that are in VA hospitals and they're lacking services. I've had family members with cancer, that is losing the research that's necessary for them,\" she said. \"I was in education for my whole career and it kills me to see them potentially taking services away from children and affecting civil rights, especially children special needs.”\n\nMelissa Holsman contributed to this report from Stuart, Florida, Chris Persaud from Boca Raton, Florida, Scott Fisher from York, Pennsylvania, Antonia Noori Farzan from Providence, Rhode Island, Ryan Murphy from Indianapolis, Kerria Weaver from Rochester, New York, Grace Tucker from Cincinnati, Rebecca Loroff from Appleton, Wisconsin, John Wisely in Detroit, and Laura Gersony and Ronald J. Hansen from Arizona.\n\n(This story has been updated to add new information.)","summary":"Anti-Trump protesters gathered at hundreds of locations nationwide  USA Today","url":"https://www.usatoday.com/story/news/politics/2025/04/05/trump-protest-rallies-hands-off/82868543007/","image":"https://www.usatoday.com/gcdn/authoring/authoring-images/2025/04/05/USAT/82953220007-xxx-04052025-south-bend-hands-off-protest-10.JPG?crop=2763,1555,x0,y144&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2025-04-05 20:45:37","author":"Sarah D. Wire","authors":["Sarah D. Wire"],"language":"en","category":"politics","source_country":"us","sentiment":-0.033},{"id":308107406,"title":"Kamala Harris Claims Vindication After Crushing Election Loss: 'I Told You So'","text":"Former Vice President Kamala Harris joked “I told you so” in a public appearance this week, suggesting that she prophetically warned President Donald Trump’s second term would bring disastrous consequences during her presidential campaign that ended in humiliating defeat.\n\nHarris claimed that what she allegedly warned about is coming to pass during a speaking engagement this Thursday at the Leading Women Defined Summit in Dana Point, California.\n\n“We are seeing organizations stay quiet. We are seeing those who are capitulating to clearly unconstitutional threats. And these are the things we are witnessing,” she said. “Each day in the last few months in our country. And it understandably creates a great sense of fear. Because you know there were many things we knew would happen.”\n\n“I’m not here to say I told you so … I swear, I wasn’t going to say that,” the former vice president continued, effectively saying it.\n\nIt remains unclear how Harris can take a victory lap, given that Trump has already started delivering on the agenda items that the American people tasked him with. On his first day in office alone, the president signed 118 executive orders, actions, and memoranda. These measures rescinded dozens of executive orders issued by former President Joe Biden. They further aim to tackle issues including the weaponization of the federal government against political opposition, addressing the southern border crisis by declaring it a national emergency, the need to re-establish the immutable biological reality of sex, and so much more.\n\nTrump has also committed a team — the Department of Government Efficiency (DOGE) — to weed out government waste. The organization says it has already saved taxpayers an estimated $140 billion despite leftists throwing a collective fit about its halts to USAID and more.\n\nEmployment statistics under Trump’s second administration have also exceeded expectations, according to data from the Labor Department. Further, the president did as he said he would do and announced reciprocal tariffs on “Liberation Day” earlier this week. The ground-breaking action is part of an effort to even the playing field for America by fighting against unfair trading practices and brining manufacturing back to U.S. soil.\n\n“So for 40 years, America has been the piggy bank of the world,” Vice President JD Vance told Breitbart News regarding Trump’s historic announcement on tariffs this week.\n\n“We absorb all of the ridiculous trade practices and economic practices of friend and foe alike. For the first time in probably 40 years, we have an American president who’s saying, ‘No more.’ That it’s not going to work. That he’s not going to allow America to be taken advantage of anymore. This decision is going to cause incredible benefits for American workers,” Vance said.\n\nMonths after her loss, Harris made it clear that she is not exiting politics and intends to stay “in this fight” — potentially with a run for the California governorship, according to reports.","summary":"Former Vice President Kamala Harris joked \"I told you so\" in a public appearance this week, suggesting that she prophetically warned President Donald Trump's second term would bring disastrous consequences during her presidential campaign that ended in humiliating defeat.\n\n\nThe post Kamala Harris Claims Vindication After Crushing Election Loss: &#8216;I Told You So&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/pre-viral/2025/04/05/kamala-harris-claims-vindication-after-crushing-election-loss-i-told-you-so/","image":"https://media.breitbart.com/media/2025/04/AP25054124799899-640x335.jpg","video":null,"publish_date":"2025-04-05 20:41:56","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","category":"politics","source_country":"US","sentiment":0.033},{"id":308084618,"title":"Lawmaker Discloses Congress to Question Biden’s White House Physician on ‘Cognitive Decline’","text":"A Republican lawmaker revealed Joe Biden’s White House doctor will be grilled by Congress over the former president’s cognitive health. \n\nRepublicans and some Democrats have long called for the truth behind what they claim is a cognitive decline in the 82-year-old during his presidency. \n\nNow, Texas Representative Ronny Jackson, who has a medical degree, said Dr. Kevin O’Connor will have to speak for the Democrat leader’s health. \n\n‘Dr. Kevin O’Connor will absolutely, positively be implicated in the cover-up of this,’ Jackson told the New York Post. ‘I guarantee you Kevin O’Connor has medical information that the American people don’t have. \n\n‘I’ve known him for a long time; he’s part of the Biden family. He would do or say anything to cover up and protect that family, regardless of what it meant professionally for him,’ the GOP representative accused. \n\n‘This could not have been covered up without him – and Jill Biden – in particular.’ \n\nO’Connor had previously said the then-president’s health was ‘excellent’ and there was nothing to worry about just days before Biden dropped out of the 2024 race. \n\nMany Americans and lawmakers, like Jackson, were also suspicious of Dr. Kevin Cannard eight visits to the White House between July 2023 and March 2024. Cannard specializes in Parkinson’s at Walter Reed National Military Medical Center. \n\nO’Connor, at the time, said only three of those visits had been for Biden’s yearly physical. \n\nBiden’s doctor – who the politician affectionally calls ‘doc’ – said the Delaware native didn’t need a cognitive test last year, despite many calling for one ahead of the big election. \n\nConcerns grew as Biden appeared confused on stage multiple times, was falling up the stairs of Air Force One and mixed up names and as his gait changed to a stiff walk. \n\n‘He was probably putting President Biden on lots of medications that we have no clue of – in efforts to try to treat his cognitive decline,’ Jackson speculated to The Post. \n\nJackson said a House panel will investigate if a ‘shadow presidency’ was happening during Biden’s term. \n\nThe House of Representatives have not officially announced a probe into Biden’s presidency. \n\nJackson also wants to bring in other doctors and experts who evaluated Biden during his re-election campaign. \n\nSeveral doctors – including Jackson – had outwardly speculated that Biden was suffering from cognitive decline through the Democrat’s campaign. \n\n‘I said that over and over and over and God knows how many times I was on TV,’ the Republican lawmaker told The Post. ‘I was saying that this man was not fit to be president when he was candidate Joe Biden in 2020.’ \n\nHe accuses O’Connor and others of knowing ‘two or three years ago’ that Biden’s health was declining, but ‘these people are cashing in on, you know, telling the truth now and writing these books and stuff that’s coming out of the woodwork.’ \n\nNeurologist Dr. Tim Pitts told NBC News in July that he ‘could’ve diagnosed [Biden] from across the Mall’ with a Parkinson’s diagnosis. \n\nThe Biden Administration has denied the politician was facing health issues. \n\nDailyMail.com has reached out to O’Connor for comment. \n\nIn fact, during his re-election campaign, his team released a 2.5-minute video showing moments Trump, who is 78, appeared to be confused. \n\n‘Here is a montage of Donald Trump getting confused, lost, wandering off, and waving to nobody,’ the Biden campaign countered.\n\nThe clips show Trump, during his presidency, departing events before he’s supposed to, or awkwardly standing in place when he’s supposed to be exiting.\n\nDespite the denial, Jackson said those who covered up Biden’s suspected health problems by ‘purposely lying to the American people’ will be held responsible. \n\nKamala Harris succeed him in the Democratic race for the top spot in the nation. She narrowly missed the popular vote by 2 million votes.\n\nBiden was blamed by senior Harris advisor David Plouffe for refusing to drop out earlier in the race after his June debate disaster.\n\nPlouffe claimed no Democratic candidate could have won without a proper primary process — what he called ‘the cardinal sin’ of this race.\n\nAnd he said he was shocked by the internal polling numbers when he finally joined the team after Joe Biden dropped out with less than four months to go, a situation he described as ‘catastrophic.’\n\n‘When I got in, it was the first time I saw the actual numbers under the hood. They were pretty gruesome,’ he told The Atlantic.\n\n‘The Sun Belt was worse than the Blue Wall, but the Blue Wall was bad. And, demographically, young voters across the board—Hispanic voters, Black voters, Asian voters—were in really terrible shape.\n\n‘When the switch happened, some of that stuff got a little bit better, but nowhere near where we ended up or where we needed to be. This was a rescue mission.\n\n‘It was catastrophic in terms of where it was.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nA Republican lawmaker revealed Joe Biden&#8217;s White House doctor will be grilled&#8230;\n\n\nThis Post: Lawmaker Discloses Congress to Question Biden&#8217;s White House Physician on &#8216;Cognitive Decline&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/lawmaker-discloses-congress-to-question-bidens-white-house-physician-on-cognitive-decline/","image":"https://i.dailymail.co.uk/1s/2025/04/05/20/96957667-14575329-image-m-18_1743879906758.jpg","video":null,"publish_date":"2025-04-05 20:18:52","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.493},{"id":308083212,"title":"Trump is shaking up the stock market — and can still prove naysayers wrong","text":"Wall Street’s Trump supporters — and they are legion — were riding high.\n\nThey cheered a completely sentient president who took office promising to enact a bold agenda of tax cuts, deregulation and un-woking college campuses, including Ivy League institutions many of them attended.\n\nThen came the trade war. Trump is not only blowing up the markets (aka their livelihoods), they fear, but the economy and probably his presidency along with GOP control of Congress when the midterms come next year.\n\nHe could even be paving the way for the word-salad queen, Kamala Harris to re-emerge in 2028.\n\nI’m not saying I subscribe to this doom and gloom. I hold out hope that The Donald will live up to his wheeler-dealer rep and make sure those very stiff tariffs on every trading partner in the world really are “reciprocal,” as he said they would be when announcing the move this past week.\n\nThe hope is they will be modified downward amid a flurry of negotiation with countries that should have as much to lose as we do. Markets will rebound as fast as they’ve been tanking. The economy will solidify around his tax cuts and deregulation.\n\nBut here’s what the naysayers keep reminding me: China could suck it up for a while. They’ve hit us with their own sanctions, hoping to crater our economy while it plays a long game. After all, their “president for life,” Xi Jinping, isn’t exactly -going anywhere.\n\nEurope might do the same, as could Canada and Mexico. They might think they can get more out of Trump if he has a severely compromised economy to work with.\n\nEven scarier, say these tariffs aren’t a “reciprocal” negotiating tool for Trump to take down our perpetually large trade deficits. He really believes they’re great for the economy.\n\nRigid adviser\n\nTheir nightmare scenario has Trump firmly in the camp of his ideologically rigid economic adviser Peter Navarro, a tariff evangelist, who for years has been predicting how the levies will magically restore all those lost factory jobs and remake the economy of 2025 into one that resembles the 1960s.\n\nHe’s totally aligned with Howard Lutnick, his voluble (and increasingly annoying) protectionist commerce secretary. Lutnick is an odd duck; he’s a former brokerage chief who wasn’t on the tariff soap box until he started vying for a job with Team Trump.\n\nNow he’s trying to convince markets how the federal government can somehow plug a $2 trillion budget deficit and grow an economy with tariffs.\n\nIt’s not a good look, or the markets wouldn’t be going haywire. How can you plug a budget deficit with tariffs if those tariffs even momentarily weaken economic growth and tax receipts decline? Note to Howie: Simple logic says you can’t.\n\nAnother layer added to their world of worries: They say Trump doesn’t appear to want to listen to Scott Bessent, his erudite treasury secretary. Bessent spent years gauging the intricacies of the global markets as a hedge fund trader. He certainly understands capital flows. He knows what happens when countries stop trading with each other and adjust violently to price shocks in the form of trade barriers: Less money flows into their economies, and you get inflation because foreign goods will immediately cost more.\n\nLast I checked, that’s called “stagflation,” and if you grew up in the 1970s like I did, you know it’s no fun.\n\nBessent is watching the bond market and how the yield on the 10-year bond is falling below 4%, a sure sign that some smart people think this trade stuff will crush growth. I hear he’s quietly trying to outflank -Navarro and Lutnick before the price shocks turn into inflation.\n\nWhatever he’s doing obviously isn’t working, the cynics remind me. Bessent is either in the doghouse, or has been reduced to Trump’s in-house lap dog.\n\nKeep in mind the Wall Street crowd misread Trump before so they might not be the best predictor here. They thought he was all bluster on trade; he would leave tariffs for last, maybe when the economy was humming.\n\nHe didn’t — as we’re now all so painfully aware.\n\nThat’s why I still think Trump will make a deal when he sees many more 1,000-plus-point declines in the Dow (or 2,000-plus drops like on Friday) and companies ramping up layoffs. Going cold turkey on trade will do that. The logical thing to do is negotiate and declare victory, and Trump loves to win.\n\nPragmatic dealmaker?\n\nA caveat to my optimism was provided by a friend of mine who knows Trump well. This mutual friend recently explained to me that yes, Trump is the ultimate pragmatist and dealmaker, except maybe when it comes to curing our trade deficits. He hates that countries screwed us for so long, and over the years he’s come to believe that tariffs can work economic miracles.\n\nThat’s why he didn’t negotiate and instead opted for the tariff sledgehammer last week. He doesn’t see tariffs as a tax on goods that will be passed on to the American people and cause inflation, but a way to make US goods cheaper over time as we produce more here.\n\nHe sees the American people being consumers of our own cooking. In other words, he might not be so keen on negotiating trade peace.\n\nGod help us if I’m wrong and my pal is right.","summary":"Wall Street’s Trump supporters — and they are legion — were riding high.","url":"https://nypost.com/2025/04/05/business/trump-is-shaking-up-the-stock-market-and-can-still-prove-naysayers-wrong/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/u-s-president-donald-trump-101686350.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/oesjOgCt-RyIcpnTz.mp4","publish_date":"2025-04-05 20:18:50","author":"Charles Gasparino","authors":["Charles Gasparino"],"language":"en","source_country":"us","sentiment":-0.168},{"id":308077300,"title":"Biden's White House doctor will be grilled by Congress over 'cognitive decline,' reveals lawmaker","text":"A Republican lawmaker revealed Joe Biden's White House doctor will be grilled by Congress over the former president's cognitive health. \n\nRepublicans and some Democrats have long called for the truth behind what they claim is a cognitive decline in the 82-year-old during his presidency. \n\nNow, Texas Representative Ronny Jackson, who has a medical degree, said Dr. Kevin O'Connor will have to speak for the Democrat leader's health. \n\n'Dr. Kevin O’Connor will absolutely, positively be implicated in the cover-up of this,' Jackson told the New York Post. 'I guarantee you Kevin O’Connor has medical information that the American people don’t have. \n\n'I’ve known him for a long time; he’s part of the Biden family. He would do or say anything to cover up and protect that family, regardless of what it meant professionally for him,' the GOP representative accused. \n\n'This could not have been covered up without him - and Jill Biden - in particular.' \n\nO'Connor had previously said the then-president's health was 'excellent' and there was nothing to worry about just days before Biden dropped out of the 2024 race. \n\nMany Americans and lawmakers, like Jackson, were also suspicious of Dr. Kevin Cannard eight visits to the White House between July 2023 and March 2024. Cannard specializes in Parkinson's at Walter Reed National Military Medical Center. \n\nO'Connor, at the time, said only three of those visits had been for Biden's yearly physical. \n\nBiden's doctor - who the politician affectionally calls 'doc' - said the Delaware native didn't need a cognitive test last year, despite many calling for one ahead of the big election. \n\nConcerns grew as Biden appeared confused on stage multiple times, was falling up the stairs of Air Force One and mixed up names and as his gait changed to a stiff walk. \n\n'He was probably putting President Biden on lots of medications that we have no clue of - in efforts to try to treat his cognitive decline,' Jackson speculated to The Post. \n\nJackson said a House panel will investigate if a 'shadow presidency' was happening during Biden's term. \n\nThe House of Representatives have not officially announced a probe into Biden's presidency. \n\nJackson also wants to bring in other doctors and experts who evaluated Biden during his re-election campaign. \n\nSeveral doctors - including Jackson - had outwardly speculated that Biden was suffering from cognitive decline through the Democrat's campaign. \n\n'I said that over and over and over and God knows how many times I was on TV,' the Republican lawmaker told The Post. 'I was saying that this man was not fit to be president when he was candidate Joe Biden in 2020.' \n\nHe accuses O'Connor and others of knowing 'two or three years ago' that Biden's health was declining, but 'these people are cashing in on, you know, telling the truth now and writing these books and stuff that's coming out of the woodwork.' \n\nNeurologist Dr. Tim Pitts told NBC News in July that he 'could've diagnosed [Biden] from across the Mall' with a Parkinson's diagnosis. \n\nThe Biden Administration has denied the politician was facing health issues. \n\nDailyMail.com has reached out to O'Connor for comment. \n\nIn fact, during his re-election campaign, his team released a 2.5-minute video showing moments Trump, who is 78, appeared to be confused. \n\n'Here is a montage of Donald Trump getting confused, lost, wandering off, and waving to nobody,' the Biden campaign countered.\n\nThe clips show Trump, during his presidency, departing events before he's supposed to, or awkwardly standing in place when he's supposed to be exiting.\n\nDespite the denial, Jackson said those who covered up Biden's suspected health problems by 'purposely lying to the American people' will be held responsible. \n\nKamala Harris succeed him in the Democratic race for the top spot in the nation. She narrowly missed the popular vote by 2 million votes.\n\nBiden was blamed by senior Harris advisor David Plouffe for refusing to drop out earlier in the race after his June debate disaster.\n\nPlouffe claimed no Democratic candidate could have won without a proper primary process — what he called 'the cardinal sin' of this race.\n\nAnd he said he was shocked by the internal polling numbers when he finally joined the team after Joe Biden dropped out with less than four months to go, a situation he described as 'catastrophic.'\n\n'When I got in, it was the first time I saw the actual numbers under the hood. They were pretty gruesome,' he told The Atlantic.\n\n'The Sun Belt was worse than the Blue Wall, but the Blue Wall was bad. And, demographically, young voters across the board—Hispanic voters, Black voters, Asian voters—were in really terrible shape.\n\n'When the switch happened, some of that stuff got a little bit better, but nowhere near where we ended up or where we needed to be. This was a rescue mission.\n\n'It was catastrophic in terms of where it was.","summary":"Republicans and some Democrats have long called for the truth behind what they claim is a cognitive decline in the 82-year-old during his presidency.","url":"https://www.dailymail.co.uk/news/article-14575329/biden-cognitive-decline-white-house-doctor-grilled-congress.html","image":"https://i.dailymail.co.uk/1s/2025/04/05/19/96957665-0-image-m-11_1743878257799.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/02/20/2906867431612170348/1024x576_MP4_2906867431612170348.mp4","publish_date":"2025-04-05 19:49:09","author":"Alyssa Guzman,Editor","authors":["Alyssa Guzman","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.493},{"id":308075104,"title":"Kamala Harris’s concession call to Donald Trump was awkward; here’s what they said to each other","text":"The day after the 2024 election was over, the then vice president Kamala Harris made the tough phone call to president-elect Donald Trump to concede the election. As expected, the call was tense and awkward, but new information from Chris Whipple's upcoming new book 'Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History', highlighted just how uncomfortable the conversation actually was, as per a report.The call was arranged from her Naval Observatory residence in Washington D.C., with her campaign Chief of Staff Sheila Nix and White House Chief of Staff Lorraine Voles, reported Daily Mail. According to Whipple's book, Nix called the president-elect on her cell phone - but for some reason couldn't merge the call with the vice president's phone. So Voles called Harris on hers - and she and Nix pressed the phones together, quoted Daily Mail. After Trump picked up the call, Voles told Trump that, The vice president is on the line, as quoted in the report. Kamala Harris Concedes with RespectDespite their competitive relationship during the campaign, Harris addressed the President-elect with respect, saying, I'm calling to concede. It was a fair election. The peaceful transfer of power is important. It's important to the country, quoted Daily Mail. She also added that, I hope you're a president for all Americans, according to Whipple.Donald Trump’s ResponseSurprisingly Trump's response to Harris was not how many expected it would be. Whipple mentioned, If Trump detected any edge to that remark he didn't show it. In fact, the president-elect was weirdly cordial and complimentary - bantering as though he were on the golf course, quoted Daily Mail.Whipple claimed that Trump complimented Harris and told her that she was great, as per the report. He went on to say that, You're a tough cookie. You were really great. And that Doug - what a character! I love that guy, quoted Daily Mail. Trump referred to Harris' husband Doug Emhoff. Harris Aide Calls Trump a Sociopath However, one of Harris' supporters found this odd and inappropriate, wrote Whipple. Harris' aide claimed, I was like, what? Honestly, I felt like, what is this? It's so manipulative. He's a sociopath, quoted Daily Mail. FAQsWho set up the concession call?The call was arranged by Harris’s campaign Chief of Staff Sheila Nix and White House Chief of Staff Lorraine Voles.What did Trump say about Doug Emhoff?Trump said, “What a character! I love that guy,” referring to Harris’s husband, Doug Emhoff.","summary":"Vice President Kamala Harris called President-elect Donald Trump to concede the 2024 election. Despite the tension, they had a cordial conversation. Trump congratulated Harris and complimented her husband. One of Harris’s aides found Trump's response manipulative and inappropriate, calling Trump a sociopath. The call was arranged by Harris’s staff using an unconventional method.","url":"https://economictimes.indiatimes.com/news/international/us/kamala-harriss-concession-call-to-donald-trump-was-awkward-heres-what-they-said-to-each-other/articleshow/120023035.cms","image":"https://img.etimg.com/thumb/msid-120023014,resizemode-4,width-1200,height-900,imgsize-212462,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 19:02:01","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.279},{"id":308067214,"title":"Jillian Michaels: The Alarming Reality Behind the High Number of Transgender Children Among Hollywood Celebrities That All Parents Should Be Aware Of","text":"Progressive leaders are quietly tiptoeing away from the radical reaches of the transgender movement, but don’t be fooled.\n\nThey haven’t yet reversed course on one of their most shameful positions.\n\nThe brutal political reality for Democrats is that more than 70 percent of Americans simply don’t support their extreme positions, like taxpayer-funded gender surgeries and the medicalization of gender dysphoria for minors with off-label cancer drugs (puberty blockers), cross-sex hormones and irreversible surgeries.\n\nBut the Left had to learn that the hard way in the 2024 elections, when liberal and moderate voters — many of them exasperated parents — handed Kamala Harris a devastating electoral defeat.\n\nNow the message is unmistakable: enough is enough.\n\nEven California Governor Gavin Newsom — once one of the loudest champions of ‘gender-affirming care’ — is beginning to course-correct.\n\nHe has pulled back from his full-throated support for the right of biological males to compete in women’s sports. And he’s softened his rhetoric around the state’s role in subsidizing gender transitions for minors.\n\nThese, however, are political concessions, not moral awakenings.\n\nDon’t mistake this for a full reckoning.\n\nFor Newsom and others like him still refuse to give way on the issue that drove so many parents, like me, to conclude that the Democratic Party had abandoned us: the issue of parental rights.\n\nOn Real Time with Bill Maher last weekend, Newsom doubled down on his support for California’s ‘Safety Act,’ which he signed into law in July.\n\nThe law prohibits schools from requiring their staff to inform parents if their child requests to socially transition at school.\n\nA social transition is the process by which a person – in this case a minor – requests to be addressed by a name or set of pronouns that they believe more accurately aligns with their ‘gender identity.’\n\nSocial transitions in school settings may also include a child asking to use bathroom facilities that are typically associated with the opposite sex.\n\nWhy does this matter?\n\nBecause social transition may be a step toward medical transition – and life-alerting consequences.\n\nPuberty blockers — originally developed to treat prostate and breast cancer — are used off-label to halt natural development in children, with long-term effects that are not fully understood.\n\nThe risks that we do know of are alarming: impaired brain and bone development and the inability to ever experience sexual function or orgasm.\n\nCross-sex hormones carry similar risks, including cardiovascular problems and sterility.\n\nThere are dangers of deep psychological pain should regret set in—something ‘detransitioners’ – those who feel remorseful over their transitions – are now speaking out about in growing numbers.\n\nAnd these aren’t fringe cases. These are often young women who carry scars from a medical system that – many claim – fast-tracked them into irreversible procedures without fully exploring the root causes of their distress.\n\nBut here’s what Newsom said Maher asked him if he still backs the ‘Safety Act.’\n\n‘I think teachers should teach. I don’t think they should be required to turn in kids.’\n\nI’m sorry, Governor? ‘Turn in Kids’\n\nTo be clear: California’s ‘Safety Act’ isn’t about protecting children from abusive homes, as many of its supporters claim. There are already mandatory reporting laws in public schools to help children trapped in those tragic situations.\n\nLet’s call this law what it is: progressive ideological overreach that undermines family unity, parental responsibility, and healthy child development. And it should be a dealbreaker for any parent, regardless of political affiliation.\n\nAs a mother, and as someone who believes the family is the bedrock of a stable society, I find the notion of cutting parents out of the equation not only mindboggling, but outrageous and completely unacceptable.\n\nIf a child is contemplating a gender transition, then I’d say that is the moment that a parent’s attention is most important. Secretly validating a child’s gender dysphoria isn’t giving them space — it’s potentially robbing them of the guidance that they may need to figure things out.\n\nAnd here’s where Newsom’s stance becomes particularly maddening.\n\nHe knows the tide is turning. He’s seen the lawsuits. He’s heard the story of ‘detransitioners.’ And he knows the majority of the country is no longer on board.\n\nBut when it comes to rethinking ‘transgenderism’ in schools, he’s immovable.\n\nLet’s be honest: transgenderism – especially among the most privileged is seemingly prized. It was made to be fashionable. And far too many kids, and frankly parents – enabled by politicians eager to cash in on the craze – treated the phenomenon with shocking naivety.\n\nThose are the people that Governor Newsom was catering to when he signed the ‘Safety Act’ into law.\n\nIt seems to me that transgender identity — especially among kids — was allowed to spread through social contagion in many progressive circles. And, indeed, transgenderism among children is concerningly prevalent in Hollywood.\n\nNow, I am not suggesting that every trans-identifying youth is faking it. But I do believe that parents should be deeply skeptical of the sudden surge in gender dysphoria among children, particularly among adolescent girls, who are more prone to social mimicry, identity struggles, and emotional distress than boys.\n\nThere have been similar waves of social contagion in the past involving eating disorders and self-harm. Like past waves, this one comes with severe medical consequences — and it also comes a built-in ideological defense: question it, and you’re labeled a bigot.\n\nConfronting this appears to be a bridge too far for suddenly moderate Gavin. So, don’t allow his strategic shift to fool you.\n\nIf he, or any politician like him, wants to be seen as a credible, principled leader rather than just a slippery opportunist, he needs to do far more than recalibrate his rhetoric.\n\nHe needs to confront a dangerous ideology that has taken hold on the left that many people now feel deeply committed to and one that involves our children.\n\nThere’s still time — for Newsom, for Democrats, for anyone complicit in this betrayal — to reverse course. But it will require more than optics and spin. It demands moral courage. It demands they face the parents they misled and admit: we were wrong. \n\nUntil then, the message to parents is loud and clear: your role is optional, your voice is disposable and your children are political pawns. And that is unforgivable.","summary":"Internewscast Journal\n\nInternewscast\n\n\nProgressive leaders are quietly tiptoeing away from the radical reaches of the&#8230;\n\n\nThis Post: Jillian Michaels: The Alarming Reality Behind the High Number of Transgender Children Among Hollywood Celebrities That All Parents Should Be Aware Of first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/jillian-michaels-the-alarming-reality-behind-the-high-number-of-transgender-children-among-hollywood-celebrities-that-all-parents-should-be-aware-of/","image":"https://internewscast.com/wp-content/uploads/2025/04/rewrite-this-title-JILLIAN-MICHAELS-Terrifying-truth-about-why-so.jpg","video":null,"publish_date":"2025-04-05 18:48:54","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.411},{"id":308071800,"title":"House GOP to Probe if Aides ‘Covered Up’ Biden’s Mental Decline","text":"Texas GOP Rep. Ronny Jackson said a House panel will probe whether former White House doctor Kevin O’Connor concealed former President Joe Biden’s mental decline.\n\nJackson, the chair of the House Intelligence Committee’s subcommittee on Oversight and Investigations, told the New York Post in a story published Friday that the GOP “will look into whether or not we actually had a shadow presidency for a large part of [Biden’s] term” and that O’Connor “will absolutely, positively be implicated in the cover-up of this. He is a massive, massive part.”\n\n“He was probably putting President Biden on lots of medications that we have no clue of—in efforts to try to treat his cognitive decline,” he alleged. The subcommittee has yet to formally announce any investigation.\n\nJackson is a physician and served in the White House Medical Unit under former Presidents George W. Bush, Barack Obama, and Donald Trump before he was elected to Congress in 2020. \n\nJackson alleged O’Connor, whom he said he’s known for a long time, “would do or say anything to cover up and protect [the Biden family], regardless of what it meant professionally.” \n\nBiden, the oldest president in U.S. history when he left office at 82, faced growing questions about his fitness for office as his term wore on. O’Connor wrote in a February 2024 memo that the president “continues to be fit for duty and fully executes all of his responsibilities without any exemptions or accommodations.”\n\nBy avoiding sit-down interviews and large press conferences, the president’s apparent mental decline only became fully obvious during his catastrophic performance in the televised debate with Trump last June. He relinquished the Democratic nomination to former Vice President Kamala Harris on July 21. \n\nThe move spurred Republicans to question whether his team had concealed signs of his supposed mental decline and were doing the president’s job for him.\n\nIn July, the Republican-led House Oversight Committee issued subpoenas for White House aides, including O’Connor, to discuss Biden’s cognitive state, but it is not clear if he responded to the voluntary request.","summary":"Anna Moneymaker / Anna Moneymaker/Getty ImagesTexas GOP Rep. Ronny Jackson said a House panel will probe whether former White House doctor Kevin O’Connor concealed former President Joe Biden’s mental decline.\n\nJackson, the chair of the House Intelligence Committee’s subcommittee on Oversight and Investigations, told the New York Post in a story published Friday that the GOP “will look into whether or not we actually had a shadow presidency for a large part of [Biden’s] term” and that O’Connor “will absolutely, positively be implicated in the cover-up of this. He is a massive, massive part.”\n\n“He was probably putting President Biden on lots of medications that we have no clue of—in efforts to try to treat his cognitive decline,” he alleged. The subcommittee has yet to formally announce any investigation.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/house-to-probe-if-aides-concealed-bidens-mental-decline/","image":"https://www.thedailybeast.com/resizer/v2/73ISGLEI6ZBKDMDEIA33PKYQWU.jpg?smart=true&auth=f0fb1ed94cf8a99a0a2f989588160ec558c9a624078ac7448e8b83c7cbc48bb5&width=1440&height=1080","video":null,"publish_date":"2025-04-05 18:40:43","author":"Erkki Forster","authors":["Erkki Forster"],"language":"en","category":"politics","source_country":"us","sentiment":0.046},{"id":308248808,"title":"Whew Child! Barack Obama Went There, Regarding President Trump","text":"President Obama calls out what we already know: double standards are inevitable, even on the presidential level. It’s clear that when Black leaders lead boldly, they’re labeled dangerous; when white leaders sow chaos, it’s business as usual. If you are Black, you know there are unforeseen rules governing decisions, and with all the acts emerging from Trump’s Administration, Obama could never.\n\nThe former president didn’t hold back in criticizing the Trump Administration’s latest actions, while the Republican Party’s deafening—yet unsurprising—silence is creating immense uncertainty about our position as a country. Obama expressed deep concern regarding the state of American democracy and questioned whether the nation still upholds its founded principles.\n\n“Imagine if I had done any of this,” Obama’s statement met with laughter while masked in deep frustration. “I just want to be clear about this.” Referencing a saying among the younger generation, “It’s cool when they do it, but it’s a problem when I do it,” encapsulates former President Obama’s speech, reminding Black leaders don’t get the same grace. Although this isn’t the first time Obama has called out Trump, it exemplifies the roadblock Black individuals often face in intense public scrutiny when attempting to make impactful decisions.\n\nObama dug deeper by referencing Trump’s unjustifiable actions toward certain law firms, weaponizing financial support for universities by restricting free speech, and the most alarming act—removing press credentials to the White House, a gut punch to the role of the media in the presidential administration. Obama shared his deepest concerns and added, “That behavior is contrary to the basic compact we have as Americans.”\n\nIn a parallel moment, Former Vice President Kamala Harris addresses her concerns about the decisions from Trump’s administration. Humbly basking in her “I told you so” moment, she analyzes how the president’s rhetoric and actions have created a national unease. “Fear has been weaponized,” Harris said, articulating the emotional toll this administration has placed on people of color and marginalized communities across the nation.\n\nThe takeaway? It’s not just about Trump—it’s about the system that allows certain leaders to act without consequence while punishing others for far less. Obama and Harris laid it bare: the rules aren’t the same for us. If we do not take action, this double standard will continue to deter the progress we’ve fought to achieve. So, it’s not about “where are we?”—it’s “what will we do to fix what is happening?”","summary":"President Obama calls out what we already know: double standards are inevitable, even on the presidential level. It’s clear that when Black leaders lead boldly, they’re labeled dangerous; when white leaders sow chaos, it’s business as usual. If you are Black, you know there are unforeseen rules governing decisions,…\n\nRead more...","url":"https://www.theroot.com/whew-obama-went-there-reminding-us-black-presidents-d-1851774956","image":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/90461212df68ecf6d3db372a1dc9cf18.jpg","video":null,"publish_date":"2025-04-05 18:29:00","author":"B. Kadijat Towolawi","authors":["B. Kadijat Towolawi"],"language":"en","category":"politics","source_country":"US","sentiment":0.15},{"id":308061288,"title":"JILLIAN MICHAELS: Terrifying truth about why so many children of Hollywood stars are trans that every parent must read","text":"Progressive leaders are quietly tiptoeing away from the radical reaches of the transgender movement, but don't be fooled.\n\nThey haven't yet reversed course on one of their most shameful positions.\n\nThe brutal political reality for Democrats is that more than 70 percent of Americans simply don't support their extreme positions, like taxpayer-funded gender surgeries and the medicalization of gender dysphoria for minors with off-label cancer drugs (puberty blockers), cross-sex hormones and irreversible surgeries.\n\nBut the Left had to learn that the hard way in the 2024 elections, when liberal and moderate voters — many of them exasperated parents — handed Kamala Harris a devastating electoral defeat.\n\nNow the message is unmistakable: enough is enough.\n\nEven California Governor Gavin Newsom — once one of the loudest champions of 'gender-affirming care' — is beginning to course-correct.\n\nHe has pulled back from his full-throated support for the right of biological males to compete in women's sports. And he's softened his rhetoric around the state's role in subsidizing gender transitions for minors.\n\nThese, however, are political concessions, not moral awakenings.\n\nDon't mistake this for a full reckoning.\n\nFor Newsom and others like him still refuse to give way on the issue that drove so many parents, like me, to conclude that the Democratic Party had abandoned us: the issue of parental rights.\n\nOn Real Time with Bill Maher last weekend, Newsom doubled down on his support for California's 'Safety Act,' which he signed into law in July.\n\nThe law prohibits schools from requiring their staff to inform parents if their child requests to socially transition at school.\n\nA social transition is the process by which a person – in this case a minor – requests to be addressed by a name or set of pronouns that they believe more accurately aligns with their 'gender identity.'\n\nSocial transitions in school settings may also include a child asking to use bathroom facilities that are typically associated with the opposite sex.\n\nWhy does this matter?\n\nBecause social transition may be a step toward medical transition – and life-alerting consequences.\n\nPuberty blockers — originally developed to treat prostate and breast cancer — are used off-label to halt natural development in children, with long-term effects that are not fully understood.\n\nThe risks that we do know of are alarming: impaired brain and bone development and the inability to ever experience sexual function or orgasm.\n\nCross-sex hormones carry similar risks, including cardiovascular problems and sterility.\n\nThere are dangers of deep psychological pain should regret set in—something 'detransitioners' – those who feel remorseful over their transitions - are now speaking out about in growing numbers.\n\nAnd these aren't fringe cases. These are often young women who carry scars from a medical system that – many claim – fast-tracked them into irreversible procedures without fully exploring the root causes of their distress.\n\nBut here's what Newsom said Maher asked him if he still backs the 'Safety Act.'\n\n'I think teachers should teach. I don't think they should be required to turn in kids.'\n\nI'm sorry, Governor? 'Turn in Kids'\n\nTo be clear: California's 'Safety Act' isn't about protecting children from abusive homes, as many of its supporters claim. There are already mandatory reporting laws in public schools to help children trapped in those tragic situations.\n\nLet's call this law what it is: progressive ideological overreach that undermines family unity, parental responsibility, and healthy child development. And it should be a dealbreaker for any parent, regardless of political affiliation.\n\nAs a mother, and as someone who believes the family is the bedrock of a stable society, I find the notion of cutting parents out of the equation not only mindboggling, but outrageous and completely unacceptable.\n\nIf a child is contemplating a gender transition, then I'd say that is the moment that a parent's attention is most important. Secretly validating a child's gender dysphoria isn't giving them space — it's potentially robbing them of the guidance that they may need to figure things out.\n\nAnd here's where Newsom's stance becomes particularly maddening.\n\nHe knows the tide is turning. He's seen the lawsuits. He's heard the story of 'detransitioners.' And he knows the majority of the country is no longer on board.\n\nBut when it comes to rethinking 'transgenderism' in schools, he's immovable.\n\nLet's be honest: transgenderism – especially among the most privileged is seemingly prized. It was made to be fashionable. And far too many kids, and frankly parents – enabled by politicians eager to cash in on the craze – treated the phenomenon with shocking naivety.\n\nThose are the people that Governor Newsom was catering to when he signed the 'Safety Act' into law.\n\nIt seems to me that transgender identity — especially among kids — was allowed to spread through social contagion in many progressive circles. And, indeed, transgenderism among children is concerningly prevalent in Hollywood.\n\nNow, I am not suggesting that every trans-identifying youth is faking it. But I do believe that parents should be deeply skeptical of the sudden surge in gender dysphoria among children, particularly among adolescent girls, who are more prone to social mimicry, identity struggles, and emotional distress than boys.\n\nThere have been similar waves of social contagion in the past involving eating disorders and self-harm. Like past waves, this one comes with severe medical consequences — and it also comes a built-in ideological defense: question it, and you're labeled a bigot.\n\nConfronting this appears to be a bridge too far for suddenly moderate Gavin. So, don't allow his strategic shift to fool you.\n\nIf he, or any politician like him, wants to be seen as a credible, principled leader rather than just a slippery opportunist, he needs to do far more than recalibrate his rhetoric.\n\nHe needs to confront a dangerous ideology that has taken hold on the left that many people now feel deeply committed to and one that involves our children.\n\nThere's still time — for Newsom, for Democrats, for anyone complicit in this betrayal — to reverse course. But it will require more than optics and spin. It demands moral courage. It demands they face the parents they misled and admit: we were wrong. \n\nUntil then, the message to parents is loud and clear: your role is optional, your voice is disposable and your children are political pawns. And that is unforgivable.","summary":"Progressive leaders are quietly tiptoeing away from the radical reaches of the transgender movement, but don't be fooled.","url":"https://www.dailymail.co.uk/news/article-14572945/transgender-hollywood-stars-children-JILLIAN-MICHAELS.html","image":"https://i.dailymail.co.uk/1s/2025/04/04/20/96932077-0-image-m-41_1743794073149.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/21/4555230140548792634/1024x576_MP4_4555230140548792634.mp4","publish_date":"2025-04-05 18:20:37","author":"Editor,Jillian Michaels","authors":["Editor","Jillian Michaels"],"language":"en","source_country":"gb","sentiment":-0.411},{"id":308123668,"title":"Kamala Harris Finally Speaks Regarding 2024 Election Loss—Admits Shock Over Trump Win","text":"Kamala Harris was in utter shock after her election loss to Donald Trump in the 2024 US elections. The presidential race proved Kamala was not the people’s choice despite the constant efforts. After Biden stepped down from the race, Kamala got a chance to take part in the elections. She had the support of Barack Obama. However, that was not enough for her to win the election.\n\nRecently, Harris broke her silence and spoke at the Leading Women Defined Summit in California this week. She was optimistic and stated the importance of being courageous. She said, “When one person, when a few stand with the courage, that is the courage exhibited by the leaders in this room every day.”\n\nBREAKING: In a stunning appearance , Kamala Harris just spoke out for the first time against Donald Trump in his second term. This is amazing. pic.twitter.com/kTf1CJKdQ5\n— Democratic Wins Media (@DemocraticWins) April 4, 2025\n\nShe further says if one has courage, then fear is also present. The acknowledgment of fear is courage in itself. Harris stated, “The courage to say what is happening is wrong, the courage to say that there is a way that we must chart to get through this.\n\nHowever, she reiterated the importance of understanding how powerful democracy is and everyone should hold on to it. Thus, this courage is contagious. She sounded hopeful and expected that people would be resilient in their fight to maintain democracy. After her temporary absence, Kamala assures everyone that she isn’t going anywhere; she will be active politically.\n\nKamala’s shock at losing the election is real as her crowd size and support were huge. People were feeling they had better fundraising and more people in the field to ensure her victory. However, that didn’t happen when Trump won the elections.\n\nDonald Trump is out for unchecked power. He wants a military like Adolf Hitler had, who will be loyal to him, not our Constitution.\nHe is unhinged, unstable, and given a second term, there would be no one to stop him from pursuing his worst impulses. https://t.co/v4f8HbhmGU\n— Kamala Harris (@KamalaHarris) October 23, 2024\n\nKamala could not have imagined her defeat after warning everyone about Trump’s tariff hike. Her video with a warning to Americans about the imposition of sales tax is going viral even now. Everyone is starting to believe what she is saying. Many netizens are saying the video is relevant now that Trump has put a 10-60% tariff on goods.\n\nWith a loss of $2 trillion in the stock market, the American economy is already in crisis. Trump’s tariffs have also resulted in other countries retaliating with their increase in the tariffs. This trade war will not end if the Trump administration implements the hike.\n\nAmie Parnes who is a co-author on a book that’s about the 2024 election, says how shocked the whole Harris was. She wrote the FIGHT: Inside the Wildest Battle for the White House to bring certain inside scoops to light. It covers the Biden, Kamala, and Trump campaigns in detail during the elections. Parnes also appeared on the Somebody’s Gotta Win with Tara Palmer podcast and said, “She was completely shocked, and Tim Walz was shocked.\n\nAccording to Parnes, they must have thought their victory was right around the corner. However, now they are seen saying we did not have a chance. The loss has made them truly humble.\n\nAnother co-author of the book, Jonathan Allen, chimed in saying how reluctant Barack Obama was to support Harris. Maybe he already knew that she couldn’t win against Trump and his supporters. Looking at the election results, she may not have been the best Democratic choice; therefore, the faith in her victory was not much.","summary":"Harris speaks after being silent for months, she isn't going anywhere.","url":"https://www.inquisitr.com/kamala-harris-finally-speaks-regarding-2024-election-loss-admits-shock-over-trump-win","image":"https://www.inquisitr.com/wp-content/uploads/2025/04/Kamala-Harris-breaks-silence.jpg","video":null,"publish_date":"2025-04-05 18:02:02","author":"Diksha","authors":["Diksha"],"language":"en","category":"politics","source_country":"us","sentiment":-0.219},{"id":308058342,"title":"With \"Lazarus,\" the creative force behind \"Cowboy Bebop\" soothes our present vibe with his own","text":"“Cowboy Bebop” debuted on Adult Swim on an unsuspecting Sunday in September 2001, nine days before one Tuesday would shatter our sense of security forever: 9/11.\n\nThe rest of the shows on the mature animation block were comedies while “Cowboy Bebop” was anime, although unlike nearly anything else the genre’s American aficionados were accustomed to. Shinichirō Watanabe's vision marries futuristic visuals with realism, with the series' jazz score treated as something to be felt and then absorbed, like dry skin lathered in shea butter. Thus, the auteur shaped the Adult Swim brand’s lasting association with a vibe – that indescribable impression that made “Cowboy” character Spike Spiegel as much of a blue romantic as an ace bounty hunter.\n\nWatanabe's latest, “Lazarus,” calls on familiar hints while transporting us to a future near enough to feel like the present, anxieties included. In his version of 2052, the cause of the world’s problems is its presumed cure: a drug called Hapna designed by a celebrated neuroscientist named Dr. Skinner and promoted as a panacea for suffering — as in, all somatic and psychic ills.\n\nHapna’s affordability and touted lack of side effects led to its global usage, followed by Skinner’s sudden disappearance. Three years after its launch, however, he resurfaces to announce that the drug was designed to be fatal three years after its ingestion, even if someone only took it once. And, surprise, only he has the antidote, giving the public 30 days to find him before the first Hapna users start dropping.\n\n“Lazarus” is named for the underground team assembled to find Skinner, and “Cowboy Bebop” aficionados may not be able to ignore surface parallels between this and Watanabe’s late ‘90s jam session.\n\nThere’s a kid hacker, a former agent who shoots straight and loves starring in honey traps, and in the fore is Axel Gilberto, an acrobatic parkour nut and escape artist recruited straight out of the clink where he’s serving an 888-year sentence. (Which, he explains, isn’t due to a horrific crime but legal math; each failed escape doubles a person’s sentence.)\n\nAxel even resembles Spike, although he fights like John Wick, whose creator, Chad Stahelski,​ designs the action sequences. But those intersperse a plot that takes the team through wild cityscapes where we witness firsthand how people respond to knowing a countdown clock to their end is already in motion.\n\nSome keep living as they were. Others, including a hedonistic club owner fond of abusing women, receive their just desserts, late though the hour may be. As with “Cowboy Bebop,\" the action in \"Lazarus\" matches a sonic quilt connecting Kamasi Washington’s jazz sensibilities with electronic landscapes by Bonobo and Floating Point. Familiarity with these names or their musical styles isn't essential. What matters is that the whole melds into an undeniable vibe.\n\nVibes, as a concept, have been maligned recently in the popular imagination. Pundits use the term disparagingly as a catch-all to describe a mode of thinking that’s entirely detached from hard data. The doom and gloom about an economy that was, until recently, described by The Economist as “the envy of the world” was dubbed a “vibe-cession.”\n\nThe frenzied excitement generated by Vice President Kamala Harris’ 11th-hour entry into the 2024 presidential race was questioned, if not dismissed, as a “campaign powered by vibes” by a “vibes candidate.”\n\nMost of us consider vibes to be positive or neutral, a way of giving form to gut sensations or the buzz in your skin. Vibes, good ones, dominate Watanabe’s oeuvre via the curated playlists that bounce or glide behind his imagery. Whether the music adds extra flavor to his raging action scenes or amplifies an episode’s lazy backstroke through existential loneliness, you feel his work’s best moments in your bones.\n\nThat specialness makes “Cowboy Bebop” the prescription for sleepless nights, whether it’s because you can’t or don’t want to. The same is true of 2004's “Samurai Champloo” and its throbbing hip-hop heartbeat. The soundtrack to Watanabe’s 2014 fantasy “Space Dandy” is more upbeat compared to the music coloring “Lazarus.”\n\n\"Lazarus\" (Courtesy of Adult Swim )Out of all those cited shows, “Lazarus” most directly plugs into current anxieties, beginning with its voiceover narrations opening each episode. “I wonder why is it that life always requires us to overcome so much grief, suffering and all that other cr*p?” a woman’s voice asks.\n\nShe goes on to say she jumped at the chance to take Hapna because it cured the pain of heartbreak. “I thought, ‘That's weird. How can a broken heart ever be painless? Isn't this too good to be true? What if I'm just being duped?’ Those thoughts did cross my mind.”\n\nThe last five years have given us a fresh appreciation for calm, and Calm. But long before the pandemic moved us to take up meditation or practice our breathing techniques, there was Adult Swim’s late-night block, a loopy feast for the head merging absurdist comedy and art and mainstreaming anime.\n\nWhile celebrity-voiced ASMR videos trended during the pandemic, Adult Swim quietly added Ambient Swim to Max, the streaming service owned by its parent company, Warner Bros. Discovery. Nearly every episode of Ambient Swim is a continuous loop of animated images growing and dissolving into each other, separated by style and theme. (One episode features pixelated “Rick & Morty” scenescapes; another is a long, mostly live-action sequence montage of aquarium outdoor shots goofily narrated by the star of “Joe Pera Talks with You.”)\n\nThese are meant to be the anesthetizing accompaniment to playlists featuring purveyors of sonic wallpaper made to help your whole body chill out — a vibe-fest, on demand.\n\nWant a daily wrap-up of all the news and commentary Salon has to offer? Subscribe to our morning newsletter, Crash Course.\n\n“Lazarus” arrives in the wake of “Common Side Effects,” another series casting the pharmaceutical industry as its own plague on the human condition. At the heart of both stories are questions asking whether pain is a necessary part of being human and, more pointedly, whether our carelessly destructive species deserves to exist. “Some folks are happy to hear the world is ending,” a woman in “Lazarus” admits.\n\nShe says this in a tone lacking emotional spikiness, accepting that truth as it is. This evenly delivered sobriety amid massive uncertainty is its own kind of narcotic, much in the same way that the trippy sequences in “Common Side Effects” wouldn’t be out of place on a hash bar’s video screen.\n\nLike the space cowboys and ronin searching for purpose in his past series, the personalities populating “Lazarus” are anguished people navigating a broken world, refusing to resign themselves to the long dark but not beyond relaxing into the reality in front of it. Sometimes vibes are all we’ve got, and it's OK to be good with that feeling.\n\n\"Lazarus\" premieres at midnight on Saturday, April 5, on Adult Swim.","summary":"If this is the end of the world as we know it, Shinichirō Watanabe's may help you feel a bit closer to fine","url":"https://www.salon.com/2025/04/05/with-lazarus-the-creative-force-behind-cowboy-bebop-soothes-our-present-vibe-with-his-own/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2025/04/lazarus_1jpg.jpg ?>","video":null,"publish_date":"2025-04-05 17:30:06","author":"Melanie McFarland","authors":["Melanie McFarland"],"language":"en","source_country":"us","sentiment":0.222},{"id":308044010,"title":"What Trump shockingly told Kamala Harris when she called him to concede the 2024 election","text":"Donald Trump caught former Vice President Kamala Harris and her aides off guard when the typically abrasive president politely praised her as a “tough cookie” and congratulated her on running a “great” campaign when she called him to concede his victory in the 2024 election, according to a new book.\n\n“I’m calling to concede. It was a fair election. The peaceful transfer of power is important. It’s important to the country,” Harris reportedly told Trump on the phone the day after the election, according to author Chris Whipple’s new book “Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History.”\n\nHowever, she could not help but take a light jab at the divisive president-elect at the time, adding “I hope you’re president for all Americans.”\n\nInstead of taking that comment personally and snapping back, however, Trump was cordial and even praised Harris’ late-entry campaign as he basked in his historic win, according to Whipple.\n\n“You’re a tough cookie. You were really great. And that Doug — what a character! I love that guy,” the now-president said, referring to Harris’ husband, Doug Emhoff.\n\nOne of Harris’ aides, however, found the president’s tone — a complete change from his campaign rhetoric — “odd and inappropriate.”\n\n“I was like, what?” the unidentified aide barked. “Honestly, I felt like, what is this? It’s so manipulative. He’s a sociopath.”\n\nThe traditional concession call almost never happened, however, due to technical difficulties — adding to the awkwardness of the moment, Whipple said in the book, according to an excerpt obtained by the Daily Mail.\n\nHarris’ campaign Chief of Staff Sheila Nix and her White House Chief of Staff Lorraine Voles set up the call from Harris’ Naval Observatory home in Washington, DC — but when she phoned Trump, the calls wouldn’t merge with Harris’ phone.\n\nInstead, the Voles called Harris from her phone, and she and Nix “pressed the phones together,” Whipple wrote.\n\nAs Harris heard Trump’s voice come through, she “felt the weight of the crushing defeat,” according to Whipple.\n\nWhipple’s new book will hit the shelves Tuesday.","summary":"Trump was cordial and even praised Harris' late-entry campaign as he basked in his historic win, according to a new book.","url":"https://nypost.com/2025/04/05/us-news/what-trump-shockingly-told-kamala-harris-when-she-called-him-to-concede-the-2024-election/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/2024-washington-dc-americans-cast-101776131.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/U83Lqc1t-RyIcpnTz.mp4","publish_date":"2025-04-05 16:51:00","author":"Patrick Reilly","authors":["Patrick Reilly"],"language":"en","category":"politics","source_country":"us","sentiment":-0.139},{"id":308123682,"title":"“Imagine If I Had Done Any of This!”—Barack Obama Slams Trump’s Power Grab","text":"Former President Barack Obama took a dig at Donald Trump. In his second term, Trump has taken the so-called economic reform into his hands. From increasing tariffs, causing trade war, and issuing executive orders targeting law firms. His target here is the law firms that are representing people who worked against him. But Trump cleverly put it as these firms are working against American interests, and he can’t see that happening.\n\nDue to this, former President came after him and his tyrannical actions.\n\nObama said, “Imagine if I had done any of this,” in his conversation with Hamilton College President Steven Tepper this Thursday. The former president was chuckling while saying this, considering how comical this is from an American President. Even the crowd was cheering with laughter. To this, Obama responds to the crowd, saying you might be laughing right now, but this is what is happening for real.\n\nThe current political scenario in America involves the president accusing the law firms of being too liberal. What does that even mean? Do they not have freedom of speech or freedom to represent who they want to? Trump has released official executive threats to such law firms who are opening up against him. He’s ensuring that more such law firms pledge to serve him and remain in his good grace to survive. Obama addressed the crowd saying can you imagine any other president following such actions?\n\nJust because Donald Trump acts goofy doesn’t mean his presidency wouldn’t be dangerous. And you don’t have to take my word for it. Lately, some of the people who know Trump the best have been saying in no uncertain terms that he should not be president again. pic.twitter.com/fIaTKykSf5\n— Barack Obama (@BarackObama) October 25, 2024\n\nObama still remains positive and encourages the crowd, stating, “It is up to all of us to fix this. “It’s not going to be because somebody comes and saves you. The most important office in this democracy is the citizen, the ordinary person who says, no, that’s not right.”\n\nMoreover, the Trump administration is threatening federal funding from institutions that support DEI efforts. To this, several administrations have spoken out. Both Kamala Harris and Barack Obama have slammed Trump over his presidency. No one has seen any president doing this before and expects better. \n\nIn his conversation, Obama clarified that he could not have said such a thing to law firms during his tenure. During Obama’s tenure, parties and firms upset with his policies were allowed to speak up. According to Obama, he could not tell the firms that represented other parties not to be present in government buildings. Their administration did not punish such firms with the Affordable Care Act. Or the Iran deal.”\n\nFormer President Barack Obama criticized President Donald Trump’s actions targeting law firms and universities Thursday, encouraging them to fight back.\n“It is up to all of us to fix this,” Obama said during a speech at Hamilton College. “It’s not going to be because somebody… pic.twitter.com/YrD1DhjhYW\n— PBS News (@NewsHour) April 4, 2025\n\nIf he had done that during his tenure, he would have had an unimaginable reaction from the opposition parties. The party in power is silent now, but they would have been the biggest critics had Obama done the same. So, how is Trump’s current behavior acceptable?\n\nAll the Obama supporters agreed to his speech. However, we have Trump supporters on social media. One netizen reminded the internet how Obama tried to stop Fox News from covering the White House. Moreover, he pulled them from the front-row seats in the briefing room. So, Obama did use his power at times for his benefit.","summary":"Obama laughs at Trump, \"What if I did what he's doing!\"","url":"https://www.inquisitr.com/imagine-if-i-had-done-any-of-this-barack-obama-slams-trumps-power-grab","image":"https://www.inquisitr.com/wp-content/uploads/2025/04/Obama-Rips-Trump-for-Targeting-Law-Firms-DEI-Programs.jpg","video":null,"publish_date":"2025-04-05 16:32:33","author":"Diksha","authors":["Diksha"],"language":"en","category":"politics","source_country":"us","sentiment":-0.212},{"id":308044064,"title":"I could have won: Kamala Harris blames Biden for 2024 loss, tells friends she could've beaten Donald Trump if Joe hadn't delayed his exit until July","text":"After former vice president Kamala Harris' defeat to US president Donald Trump in the 2024 election, she reportedly told her friends that she would have won the election if former US president Joe Biden had quit running for re-election earlier, as per the author of a new book on the 2024 presidential election, reported the New York Post.Kamala Harris Believes Joe Biden’s Delay Cost Her the 2024 Election In the biography titled 'FIGHT: Inside the Wildest Battle for the White House', written by The Hill reporter Amie Parnes and co-author Jonathan Allen, Harris believed Biden's delay in exiting the race until July of 2024 deprived her of valuable campaign time and an opportunity to win the Democratic nomination, according to the report.Harris, who had been confident of her prospects on the eve of Election Day, was said to be floored by the results, reported the New York Post. Both she and Minnesota Governor Tim Walz were said to be shocked when the results weren't favourable to them. Parnes narrated during the podcast 'Somebody’s Gotta Win with Tara Palmeri' that Walz, the evening he returned to his hotel room, was so stunned by the outcome that he could not even able to speak, as per the report.While Harris even asked staffers who were explaining the situation to her, Are you sure? Have we done a recount? Should we do a recount?”, Parnes shared in the podcast.Parnes also claimed that, “They thought that they were going to win. And so, you know, when they come back now and say, ‘Oh no, we didn’t really have a chance.’ No, that’s not what they were thinking. They thought they were going to win,” quoted the New York Post.Afterwards, Harris and some of her staff members were said to have felt duped by top campaign officials who believed that the campaign was going great, according to the report. Harris bought the hype and thought she was on a path to victory, as indicated by Parnes. The anger within Harris' team intensified as they felt they had been gaslit by insiders who had underplayed the problems facing them, as per New York Times. Parnes and Allen wrote in their book, “She could have won, she told friends, if only the election was later in the calendar — or she got in earlier. In other words, Joe Biden was to blame,” quoted Fox News.Barack Obama Did Not Support HarrisThe book also disclosed that some Democrats, including former president Barack Obama, doubted whether Harris would win the election, reported the New York Post. During an interview with MSNBC, Allen said that Obama didn’t think that she was the best choice for Democrats, and he worked really behind the scenes for a long time to try to have a mini-primary, or an open convention, or a mini-primary leading to an open convention, did not have faith in her ability to win the election,” quoted the New York Post.FAQsHow did Kamala Harris react to her defeat? Harris was floored by her loss and was in disbelief, even asking if a recount could be done as she was shocked with the results, as per the report.Did Kamala Harris blame Joe Biden for her loss? Yes, Harris reportedly blamed Biden for waiting too long to exit the race, which, in her view, gave her less time to prepare for the election.","summary":"Kamala Harris attributed her 2024 presidential election loss to Joe Biden's delayed exit from the race. A new book suggests Harris felt deprived of crucial campaign time. The book claims Harris and her team were confident of winning until the results were unexpected. It also reports that Barack Obama doubted her chances of securing victory.","url":"https://economictimes.indiatimes.com/news/international/us/i-could-have-won-kamala-harris-blames-biden-for-2024-loss-tells-friends-she-couldve-beaten-donald-trump-if-joe-hadnt-delayed-his-exit-until-july/articleshow/120019910.cms","image":"https://img.etimg.com/thumb/msid-120019962,resizemode-4,width-1200,height-900,imgsize-22446,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-04-05 15:58:55","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.465},{"id":308076108,"title":"The View’s Ana Navarro Goes Hardcore: 'I Would Prefer Joe Biden In a Coma Over Trump'","text":"ABC’s The View\n\nJOY BEHAR: The 2024 presidential campaign was even more of a mess for Democrats than we even saw. According to several new books about the last few months of the election, that’s- they're writing books about it now- In one book, Biden adviser Ron Klain claimed there was a lot of concern that Biden couldn't keep up with the debate prep, and he would fall asleep by the pool.\n\nSARA HAINES: Me, too.\n\nALYSSA FARAH GRIFFIN: The same.\n\nBEHAR: Me too. \n\nAnother book claims President Obama didn't want VP Harris to take Biden's place, his choice was Governor Gretchen Whitmer. \n\nNow, these are books that people are writing so we have to take a lot of this, I think, with a bit of a grain of salt. I mean, if any of this is true, what can Democrats do about it now? I mean, it seems to me this ship is sailed. What's the point?\n\nSUNNY HOSTIN: I'd rather- read a book- about what Trump did to us-- when he was president, and what he's doing to us now.\n\nBEHAR: Yeah.\n\nHOSTIN: I’m much more interested in that. I'm not interested in- in looking back. I mean, we’re in the- we’re in a constitutional crisis right now.\n\nBEHAR: And do we really believe that Trump is not falling asleep in the chair at Mar-a-Lago?\n\nFARAH GRIFFIN: Yeah, respectfully, there were more books about Trump than I feel like anyone ever needed to read.\n\nANA NAVARRO: I wish he did.\n\nHAINES: You wrote one.\n\nBEHAR: I did. I did.\n\nFARAH GRIFFIN: You did. We’re in a moment we’re in [sic.] where a lot of people are scared, they're nervous, they’re worried that we're seeing America fundamentally changed. \n\nAnd, a reason for that, not just the little asterisk, is that Joe Biden did not win, did not step aside in time to allow someone else to win-\n\nBEHAR: Right.\n\nFARAH GRIFFIN: And I do think it is a story that warrants some reflection because even beyond the electoral consequences of Trump winning and what we're going to experience the next four years, I think there is also- what I'm struck by- and I think highly of Biden- \n\nBEHAR: Yeah.\n\nFARAH GRIFFIN: People always think I'm, like, so critical just cause I think he needed to step aside and give someone else a chance- he does start to come off the more we're learning like ‘I alone can fix it.’ It almost comes off Trumpian.\n\nBEHAR: And it was late, also. He was late.\n\nFARAH GRIFFIN: Well, he should have done it sooner. \n\nBEHAR: Right. Right.\n\nFARAH GRIFFIN: If he had, after the debate, that would have given someone enough runway to actually run a winning campaign.\n\nHAINES: Well, I would say the learning lesson here is ‘listen to the voters,’ because one thing that really pissed me off, as an independent- and I was one of the people that sat here and said, after seeing President Biden, ‘I voted for Biden, I really liked Biden.’ \n\nFARAH GRIFFIN: Yeah.\n\nHAINES: I actually had been happy with him and I would have voted for him if he continued to run. \n\nBut I did look at him and think, ‘I think maybe you do need to step aside,’ and now the rumors that we're hearing- starting to make sense. And what happened is, everyone said, ‘You're disloyal if you say that, shut up and fall in line,’ and that's why people want to be independents these days. Because, partisan politics- they lie. \n\nIt was the Democratic Party that made that choice, that said, ‘To be- you're betraying him if you call it like you see it.’ And the point here was is [sic.], he wasn't necessarily fit to run for another four years.\n\nBEHAR: Okay, okay.\n\nNAVARRO: Look, I know Ron Klain. I was- texting with him yesterday. He's one of the longest advisers and very, very close to Biden, so this is probably very painful to them both.\n\nBEHAR: So why say it- or write it? What’s- It's kind of mean.\n\nHOSTIN: He’s saying that the framing’s wrong.\n\nNAVARRO: Because they- you know what? Folks get caught up talking about post mortems of campaigns-\n\nBEHAR: Oh, they want to sell books.\n\nNAVARRO: And talking to reporters who- are their friends. And usually I like these books, usually I like the- campaign gossip- of- Primary Colors after Clinton, or O after Obama, or Game Change after McCain. \n\nBut, these are not normal times, so I'm just not interested in palace gossip from a year and a half ago because I'm more- more interested about the children who are losing food, because this government is cutting off their program, and the federal workers who are losing their jobs, and I'm interested about the deportation people who have no due process and I'm- you know- interested in the fact that we are at war with -- a trade war with- the rest of the world, and threatening allies like Panama and- you know- and Greenland.\n\nFARAH GRIFFIN: Some of us warned that- some of us warned that all of this, specifically, was coming. You know, there were people beating the drum, explaining explicitly what a second Trump term would be. \n\nHOSTIN: Project 2025, everyone.\n\nNAVARRO: Right.\n\nFARAH GRIFFIN: They were saying it but the Democrats could not put up something formidable enough to beat it.\n\nHAINES: Well, and two things can be- two things can be true at once, you can despise Trump, and everything the Republicans stand for, and still be able to see straight about what happened here, and denying it and telling people you're not seeing what you're seeing is never going to win voters. Ever.\n\nHOSTIN: I bet you every single person that voted- for- for Kamala Harris wishes that Kamala Harris won right now.\n\nHAINES: I do.\n\nHOSTIN: I- I bet you that- and I bet you, there are a lot of people that voted for Trump, that wish that Kamala Harris was in the White house.\n\nNAVARRO: You know, there are probably a lot of people who didn't vote, who are probably regretting it now.\n\nHOSTIN: Yes.\n\nBEHAR: To me this is- to me this is-\n\nNAVARRO: You know, I always said I would prefer- you know- the- Joe Biden in a coma, over Trump, and I maintain that.\n\nBEHAR: We’ll be right back.","summary":"As the books tumble out exposing the Democrats hiding the mental decline of Biden -- and that includes the press -- some hardcore partisans are going to trash the trend. Who needs these books? \n\nOn ABC’s The View Friday, during the usual shrieking against President Trump, they mentioned former Biden chief of staff Ron Klain telling author Chris Whipple that by debate time in 2024, Biden was in no shape to run for president, but Ana Navarro still maintained that she would rather “have Joe Biden in a coma over Trump.”\n\nJoy Behar raised the subject, saying that Klain “claimed there was a lot of concern that Biden couldn’t keep up with the debate prep, and he would fall asleep by the pool.”\n\n \n\n\n\n\n\n \n\nThe idea of theoretically the most powerful man in the world being in that health would have alarmed many people. Sarah Haines quipped “me too,” while Alyssa Farah Griffin agreed. \n\nBehar tried to brush the allegations off with the comment, “If any of this is true, what can Democrats do now? I mean, it seems to me t","url":"https://www.newsbusters.org/blogs/nb/david-milliken/2025/04/05/views-ana-navarro-goes-hardcore-i-would-prefer-joe-biden-coma","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-04/The%20View-11_20_26%20am-2025-04-04-0.jpg?itok=LJjHu5ui","video":null,"publish_date":"2025-04-05 15:37:00","author":"David Milliken","authors":["David Milliken"],"language":"en","source_country":"US","sentiment":-0.708}]}