{"offset":0,"number":50,"available":4753,"news":[{"id":258837354,"title":"Heart-breaking memorials from Tel Aviv to Central Park for Oct. 7 victims: ‘One unending day of terror’","text":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday. \n\nThe somber day was filled with tears, comforting words and somber gestures in remembrance of the roughly 1,200 Israelis killed and the 250 kidnapped during the shocking display of depravity last year that sparked the current destructive conflict in Gaza.\n\nCeremonies in Israel started around 6:29 a.m. local time to mark the hour when Hamas launched rockets into the Jewish state at the start of their attack.\n\nFamily and friends of victims gathered for a ceremony on the grounds of the Nova Festival, where hundreds of innocent music revelers were killed. The event got under way to the sounds of the final track that was played at the fest last year.\n\n“We will remember always who kidnapped, who murdered, who raped, who slaughtered,” Israeli President Isaac Herzog said. “At the same time, we have also seen extraordinary fortitude. We have a wonderful people and on this day we strengthen it and call for unity.”\n\nOther ceremonies occurred in kibbutz villages and towns near Israel’s border throughout the day.\n\n“The memory of our citizens who were killed in the terrorist attack and the memory of all the fallen heroes from the IDF and security forces will be cherished forever,” Israeli Prime Minister Benjamin Netanyahu said in videotaped message.\n\n“On October 7th, we were all hurled into a critical battle, but we were not defeated. On the contrary, it is we who are acting to defeat and deter our enemies.”\n\nOutside the controversial PM’s residence in Jerusalem, about 300 people led by loved ones of the hostages held up photos of the captives and observed a minute of silence for the fallen as an air siren sounded.\n\n“We’re still stuck in Oct. 7, 2023, in one unending day of terror, of fear, of anger, of despair,” said Yuval Baron, whose father-in-law Keith Siegel was abducted.\n\n“We wanted to start this day together to remind ourselves, our prime minister, the public of Israel that even though it is a day of grief, there is still a holy mission to bring back the hostages,” Baron said.\n\nDuring a ceremony in Tel Aviv, Nitza Korngold, who had seven relatives that were kidnapped, delivered a message to her son Tal Shoham, who is still a hostage, the New York Times reported.\n\n“My dear Tal, if you can see or hear me, we all miss you so much,” she said. “We are doing everything to bring you and all the hostages home soon. We will not give up on you.”\n\nA large ceremony at Central Park was held Monday evening and included a speech by a Nova survivor, Natalie Sanandaji. \n\n“Our community, in Israel, in New York — around the world — will never forget the hundreds murdered, the hundreds kidnapped and taken hostage. The rape. The unspeakable acts of violence against mothers and fathers, children and babies. So many ordinary people,” the victim said.\n\nA woman who did want to be named told The Post, “We’re really, really injured and hurting and sad and shocked and depressed. It’s just a very, very difficult time.”\n\nThe Manhattan gathering also drew hordes of politicians — everyone from Gov. Kathy Hochul to Mayor Eric Adams to Sens. Chuck Schumer and Kirsten Gillibrand.\n\nAdams drew cheers from the crowd, but did not appear to interact with any of his fellow Democrats on stage during the somber ceremony.\n\nAdams directed all city flags be lowered to half-staff, while City Hall and five additional government buildings were lit yellow Monday evening in honor of the hostages. \n\n“One year ago today, people of all faiths and creeds gathered at the Nova Music Festival in Israel to sing songs of peace and coexistence,” Adams said in a statement.\n\n“With the brutal murder of more than 1,200 innocent men, women, and children by cowardly terrorists, a part of all of us died that day. Hundreds more were taken hostage in the aftermath, and many still remain in captivity today.\n\n“And as we see the devastation wrought on innocent people in the Middle East in the aftermath of this unprovoked attack, the thought of peace becomes even more distant,” Hizzoner said.\n\n“But that is exactly why we must continue to strive for peace — for the safe return of all of the hostages, for the defeat of Hamas, and for an end to this deadly conflict.”\n\nPresident Biden stood next to first lady Jill Biden while lighting a yahrzeit candle in DC and observing a moment of silence after Rabbi Aaron Alexander of Washington’s Adas Israel Congregation read the Jewish prayer for Oct. 7 victims at the White House.\n\nEarlier in the day, Biden and Israeli President Herzog spoke, according to the White House.\n\nCandidates running to succeed Biden — Vice President Kamala Harris and former President Donald Trump — also marked the solemn day.\n\nTrump paid a visit to the gravesite of Rabbi Menachem Mendel Schneerson, who was the leader of the Chabad-Lubavitch movement of Orthodox Judaism from 1951 until his death in 1994, in Queens. Video showed the Republican nominee wearing a black yarmulke as he unfolded and read a piece of paper.\n\nHe also took a moment of silence and placed a small rock on the rabbi’s tombstone before he left, which is a traditional Jewish custom.\n\nTrump was later expected to fly down to Florida to host an event with Jewish community leaders at his resort in Doral, the Times reported.\n\nHarris, the Democratic nominee, called Hamas’ deadly Oct. 7 assault “an act of pure evil” and cited the Kaddish, a Jewish prayer in mourning, to talk about “our enduring belief in God, even in our darkest moments.”\n\nShe and second gentleman Doug Emhoff planted a pomegranate tree at their official residence in memory of the victims, the Times of Israel reported.\n\nThe ceremonies came as thousands of protesters both in support and against Israel took to the streets throughout the day Monday.\n\nThe one-year mark also comes as the Middle East faces the threat of a larger regional conflict.\n\nAdditional reporting by Dorian Geiger and Post Wires","summary":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday. The somber day was filled with tears, comforting words and somber gestures in remembrance of the roughly 1,200 Israelis killed and the 250 kidnapped during the shocking display of depravity last year that sparked &#8230;\n\n\nThe post Heart-breaking memorials from Tel Aviv to Central Park for Oct. 7 victims: ‘One unending day of terror’ appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/heart-breaking-memorials-from-tel-aviv-to-central-park-for-oct-7-victims-one-unending-day-of-terror/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/families-leaders-commemorate-vics-oct-91204213.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-08 00:21:00","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.013},{"id":258837126,"title":"GOP combat vet Sam Brown calls in ground support for Nevada Senate bid","text":"LAS VEGAS — Sam Brown, the combat veteran who survived massive burn injuries in Afghanistan in 2008, called in some high-powered ground support for his quest to unseat first-term Democratic Sen. Jacky Rosen.\n\nSen. John Kennedy (R-La.) joined Brown at a campaign office here Thursday to rally some three dozen volunteers in crucial get-out-the-vote efforts. In 2022, Democratic Nevada Sen. Catherine Cortez Masto beat former state Attorney General Adam Laxalt by just 8,000 votes, an average of four ballots per precinct.\n\nThe Louisiana lawmaker lauded Brown as someone who’d fight for Silver State residents while pursuing fiscal responsibility.\n\n“Sam Brown is tougher than a three-hour steak,” Kennedy declared.\n\nBrown is in a heated battle with Rosen. Her campaign accuses him of favoring an “extreme MAGA agenda.” In turn, the Reno-based Army vet says Rosen’s vote for the Biden-Harris administration’s spending bills substantially created the 5.2% unemployment here and hikes in rent, groceries and gas.\n\nHe said President Biden and Vice President Kamala Harris “introduced to us Bidenomics, and what that’s resulted in is that Nevadans, on average, are paying $1,200 or more a month now than they were four years ago.”\n\nKennedy agreed, saying, “The people of Nevada do not deserve to have to sell blood plasma to go to the grocery store, and they don’t deserve to have to cash in their retirement account to pay their rent or to make their mortgage paid, and they’re scared.”\n\nDespite one recent poll showing an 11-point gap with Rosen, Brown — who former President Donald Trump has also endorsed — believes he will win.\n\n“Nevadans are stressed. As you’ve seen and heard from across the state, people are driven to a point of desperation,” he said. “You will see a high turnout in this election, and when I’m across this state from city to city, town to town, mile after mile, people are furious with what has happened with this government and what it’s done to them.”\n\nBrown said another poll shows “only a 1.5-point race, so that feels much more like what we’re seeing on the ground.”\n\nKennedy said polling is less reliable in the current cycle than in earlier years.\n\n“People on both sides are so angry right now, particularly about inflation, that I think a small number, but a meaningful number of people, instead of just not taking the call from the pollster, they take the call, and they just screw with the pollster,” he said.\n\n“I’m not an expert in many things, if any, but I’ve been polling for 30 years, and if you get 4% to 6% of the people, even 3% who lie to a pollster just to screw with him, you can throw that thing away,” he said.\n\nDespite Kennedy spurring on the troops, one Brown supporter conceded it’s a difficult contest.\n\n“I think this is a tough seat,” Joanna Gorman of Summerlin told The Post. “I would not be surprised if it did not go our way, but we are trying by getting the vote out.”\n\nThe retired dietitian and diabetic educator said she and others are working to boost Republican turnout.\n\n“We are knocking, we are calling, we are sending out so much information that we need to get those voters who did not come out four years ago out, and that’s our main focus, Republicans who didn’t show up and independents,” Gorman said. “So, I think the polls underestimate the Republicans in general, but in this particular race, it is going to be an uphill battle.”\n\nA day after the Brown-Kennedy event, Nevada Independent publisher Jon Ralston tweeted that the National Republican Senatorial Committee — the GOP’s campaign arm funding Senate races — had canceled ad buys in Nevada through Election Day. \n\nBut an NRSC spokesman directed The Post to a Politico report in which the group said it’s shifting expenditures to “hybrid” ads that attack an issue and boost a candidate, claiming such expenditures yield more advertising bang for the buck.","summary":"LAS VEGAS — Sam Brown, the combat veteran who survived massive burn injuries in Afghanistan in 2008, called in some high-powered ground support for his quest to unseat first-term Democratic Sen. Jacky Rosen. Sen. John Kennedy (R-La.) joined Brown at a campaign office here Thursday to rally some three dozen volunteers in crucial get-out-the-vote efforts....","url":"https://nypost.com/2024/10/07/us-news/gop-combat-vet-sam-brown-calls-in-ground-support-for-nevada-senate-bid/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/sen-john-kennedy-r-la-91012087.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-08 00:19:06","author":"Mark A. Kellner","authors":["Mark A. Kellner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.466},{"id":258836878,"title":"Heart-breaking memorials from Tel Aviv to Central Park for Oct. 7 victims: ‘One unending day of terror’","text":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday. \n\nThe somber day was filled with tears, comforting words and somber gestures in remembrance of the roughly 1,200 Israelis killed and the 250 kidnapped during the shocking display of depravity last year that sparked the current destructive conflict in Gaza.\n\nCeremonies in Israel started around 6:29 a.m. local time to mark the hour when Hamas launched rockets into the Jewish state at the start of their attack.\n\nFamily and friends of victims gathered for a ceremony on the grounds of the Nova Festival, where hundreds of innocent music revelers were killed. The event got under way to the sounds of the final track that was played at the fest last year.\n\n“We will remember always who kidnapped, who murdered, who raped, who slaughtered,” Israeli President Isaac Herzog said. “At the same time, we have also seen extraordinary fortitude. We have a wonderful people and on this day we strengthen it and call for unity.”\n\nOther ceremonies occurred in kibbutz villages and towns near Israel’s border throughout the day.\n\n“The memory of our citizens who were killed in the terrorist attack and the memory of all the fallen heroes from the IDF and security forces will be cherished forever,” Israeli Prime Minister Benjamin Netanyahu said in videotaped message.\n\n“On October 7th, we were all hurled into a critical battle, but we were not defeated. On the contrary, it is we who are acting to defeat and deter our enemies.”\n\nOutside the controversial PM’s residence in Jerusalem, about 300 people led by loved ones of the hostages held up photos of the captives and observed a minute of silence for the fallen as an air siren sounded.\n\n“We’re still stuck in Oct. 7, 2023, in one unending day of terror, of fear, of anger, of despair,” said Yuval Baron, whose father-in-law Keith Siegel was abducted.\n\n“We wanted to start this day together to remind ourselves, our prime minister, the public of Israel that even though it is a day of grief, there is still a holy mission to bring back the hostages,” Baron said.\n\nDuring a ceremony in Tel Aviv, Nitza Korngold, who had seven relatives that were kidnapped, delivered a message to her son Tal Shoham, who is still a hostage, the New York Times reported.\n\n“My dear Tal, if you can see or hear me, we all miss you so much,” she said. “We are doing everything to bring you and all the hostages home soon. We will not give up on you.”\n\nA large ceremony at Central Park was held Monday evening and included a speech by a Nova survivor, Natalie Sanandaji. \n\n“Our community, in Israel, in New York — around the world — will never forget the hundreds murdered, the hundreds kidnapped and taken hostage. The rape. The unspeakable acts of violence against mothers and fathers, children and babies. So many ordinary people,” the victim said.\n\nA woman who did want to be named told The Post, “We’re really, really injured and hurting and sad and shocked and depressed. It’s just a very, very difficult time.”\n\nThe Manhattan gathering also drew hordes of politicians — everyone from Gov. Kathy Hochul to Mayor Eric Adams to Sens. Chuck Schumer and Kirsten Gillibrand.\n\nAdams drew cheers from the crowd, but did not appear to interact with any of his fellow Democrats on stage during the somber ceremony.\n\nAdams directed all city flags be lowered to half-staff, while City Hall and five additional government buildings were lit yellow Monday evening in honor of the hostages. \n\n“One year ago today, people of all faiths and creeds gathered at the Nova Music Festival in Israel to sing songs of peace and coexistence,” Adams said in a statement.\n\n“With the brutal murder of more than 1,200 innocent men, women, and children by cowardly terrorists, a part of all of us died that day. Hundreds more were taken hostage in the aftermath, and many still remain in captivity today.\n\n“And as we see the devastation wrought on innocent people in the Middle East in the aftermath of this unprovoked attack, the thought of peace becomes even more distant,” Hizzoner said.\n\n“But that is exactly why we must continue to strive for peace — for the safe return of all of the hostages, for the defeat of Hamas, and for an end to this deadly conflict.”\n\nPresident Biden stood next to first lady Jill Biden while lighting a yahrzeit candle in DC and observing a moment of silence after Rabbi Aaron Alexander of Washington’s Adas Israel Congregation read the Jewish prayer for Oct. 7 victims at the White House.\n\nEarlier in the day, Biden and Israeli President Herzog spoke, according to the White House.\n\nCandidates running to succeed Biden — Vice President Kamala Harris and former President Donald Trump — also marked the solemn day.\n\nTrump paid a visit to the gravesite of Rabbi Menachem Mendel Schneerson, who was the leader of the Chabad-Lubavitch movement of Orthodox Judaism from 1951 until his death in 1994, in Queens. Video showed the Republican nominee wearing a black yarmulke as he unfolded and read a piece of paper.\n\nHe also took a moment of silence and placed a small rock on the rabbi’s tombstone before he left, which is a traditional Jewish custom.\n\nTrump was later expected to fly down to Florida to host an event with Jewish community leaders at his resort in Doral, the Times reported.\n\nHarris, the Democratic nominee, called Hamas’ deadly Oct. 7 assault “an act of pure evil” and cited the Kaddish, a Jewish prayer in mourning, to talk about “our enduring belief in God, even in our darkest moments.”\n\nShe and second gentleman Doug Emhoff planted a pomegranate tree at their official residence in memory of the victims, the Times of Israel reported.\n\nThe ceremonies came as thousands of protesters both in support and against Israel took to the streets throughout the day Monday.\n\nThe one-year mark also comes as the Middle East faces the threat of a larger regional conflict.\n\nAdditional reporting by Dorian Geiger and Post Wires","summary":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday.","url":"https://nypost.com/2024/10/07/us-news/heart-breaking-memorials-from-tel-aviv-to-central-park-for-oct-7-victims-one-unending-day-of-terror/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/families-leaders-commemorate-vics-oct-91204213.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/KOS0Ahym-RyIcpnTz.mp4","publish_date":"2024-10-08 00:12:40","author":"David Propper","authors":["David Propper"],"language":"en","category":"politics","source_country":"us","sentiment":0.013},{"id":258836344,"title":"New analysis suggests national debt could increase under Harris, but it would surge under Trump","text":"No one is likely to be happy with the projected higher deficits laid out in a new analysis of Kamala Harris’ and Donald Trump’s economic plans.\n\nThe analysis released yesterday by the nonpartisan Committee for a Responsible Federal Budget suggests a Harris presidency could increase the national debt over 10 years by $3.5 trillion.\n\nThat’s even though the vice president’s campaign insists her proposed investments in the middle class and housing would be fully offset by higher taxes on corporations and the wealthy.\n\nHer campaign policy guide states that Harris is “committed to fiscal responsibility — making investments that will support our economy, while paying for them and reducing the deficit at the same time.”\n\nThe same analysis says former President Trump’s ideas could heap another $7.5 trillion onto the debt and possibly as much as $15.2 trillion. That’s even though he suggests growth would be so strong under his watch that no one would need to worry about deficits.\n\nThe 34-page report released by the fiscal watchdog group puts a spotlight on the issue of government borrowing that will confront the winner of November’s election.","summary":"No one is likely to be happy with the projected higher deficits laid out in a new analysis of Kamala Harris’ and Donald Trump’s economic plans. The analysis released yesterday by the nonpartisan Committee for a Responsible Federal Budget suggests a Harris presidency could increase the national debt over 10 years by $3.5 trillion. That’s [&#8230;]\n\n\nThe post New analysis suggests national debt could increase under Harris, but it would surge under Trump appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/new-analysis-suggests-national-debt-could-increase-under-harris-but-it-would-surge-under-trump.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2017/10/mdtimes-300x200.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2024-10-08 00:04:05","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.026},{"id":258837154,"title":"Vice President Harris appears on \"Call Her Daddy\" podcast","text":"Vice President Harris appears on \"Call Her Daddy\" podcast\n Both candidates in the 2024 presidential race have gone beyond the traditional airwaves to reach voters. That includes Vice President Kamala Harris' interview with the \"Call Her Daddy\" podcast. Molly Ball, senior political correspondent at The Wall Street Journal, and Robert Costa, CBS News chief election and campaign correspondent, examine what Harris hopes to accomplish with the appearance.","summary":"Both candidates in the 2024 presidential race have gone beyond the traditional airwaves to reach voters. That includes Vice President Kamala Harris' interview with the \"Call Her Daddy\" podcast. Molly Ball, senior political correspondent at The Wall Street Journal, and Robert Costa, CBS News chief election and campaign correspondent, examine what Harris hopes to accomplish with the appearance.","url":"https://www.cbsnews.com/video/vice-president-harris-appears-call-her-daddy-podcast/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/08/e079f875-8211-4791-878b-4f6c9e12609f/thumbnail/1200x630/4870c8d06c7e15fe4e96c588edd9c98e/cbsn-fusion-vice-president-harris-appears-call-her-daddy-podcast-thumbnail.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-08 00:04:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.407},{"id":258836656,"title":"VP Kamala Harris makes the case for why she should be president","text":"Kamala Harris has been a candidate for president for just two-and-a-half months and the post convention \"honeymoon\" is over. With the election just 29 days away, Harris and her running mate Minnesota Gov. Tim Walz face unrelenting attacks from Donald Trump, and the race remains extremely close.We met the 59-year-old vice president this past week on the campaign trail and later at the vice president's residence in Washington, DC. We spoke about the economy and immigration, Ukraine, and China, but we began with the escalating war in the Middle East. one year after the Hamas terror attack on IsraelBill Whitaker: The events of the past few weeks have pushed us to the brink, if—if not into an all-out regional war in the Middle East. What can the U.S. do at this point to stop this from spinning out of control?Vice President Kamala Harris: Well, let's start with October 7. 1,200 people were massacred, 250 hostages were taken, including Americans, women were brutally raped, and as I said then, I maintain Israel has a right to defend itself. We would. And how it does so matters. Far too many innocent Palestinians have been killed. This war has to end.Vice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsBill Whitaker: We supply Israel with billions of dollars in military aid, and yet Prime Minister Netanyahu seems to be charting his own course. The Biden-Harris administration has pressed him to agree to a ceasefire. He's resisted. You urged him not to go into Lebanon. He went in anyway. Does the U.S. have no sway over Prime Minister Netanyahu?Vice President Kamala Harris: The work that we do diplomatically with the leadership of Israel is an ongoing pursuit around making clear our principles.Bill Whitaker: But it seems that Prime Minister Netanyahu is not listening.Vice President Kamala Harris: We are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.Bill Whitaker: Do we have a--a real close ally in Prime Minister Netanyahu?Vice President Kamala Harris: I think, with all due respect, the better question is do we have an important alliance between the American people and the Israeli people. And the answer to that question is yes.While the war in the Middle East has dominated recent headlines, it's the economy that most concerns American voters this election year, as always.Bill Whitaker: There are lots of signs that the American economy is doing very well, better than most countries, I think. But the American people don't seem to be feeling it. Groceries are 25% higher and people are blaming you and Joe Biden for that. Are they wrong?Vice President Kamala Harris: We now have historic low unemployment in America among all groups of people. We now have an economy that is thriving by all macroeconomic measures. And, to your point, prices are still too high. And I know that, and we need to deal with it, which is why part of my plan—you mentioned groceries. Part of my plan is what we must do to bring down the price of groceries.Harris says she'll press Congress to pass a federal ban on price gouging for food and groceries, but details are yet to be defined.Bill Whitaker: You want to expand– the child tax credit.Vice President Kamala Harris: Yes, I do.Bill Whitaker: You want to give tax breaks to first-time home buyers.Vice President Kamala Harris: Yes.Bill Whitaker: And people starting small businesses.Vice President Kamala Harris: Correct.Bill Whitaker: But it is estimated by the Nonpartisan Committee for Responsible Federal Budget that your economic plan would add $3 trillion to the federal deficit over the next decade. How are you gonna pay for that?Vice President Kamala Harris: OK, so the other econ- economists that have reviewed my plan versus my opponent and determined that my economic plan would strengthen America's economy. His would weaken it. Bill Whitaker: But--Vice President Kamala Harris: My plan, Bill, if you don't mind, my plan is about saying that when you invest in small businesses, you invest in the middle class, and you strengthen America's economy. Small businesses are part of the backbone of America's economy.Bill Whitaker: But—but pardon me, Madame Vice President, I-- the-- the question was, how are you going to pay for it?Vice President Kamala Harris: Well, one of the things is I'm gonna make sure that the richest among us, who can afford it, pay their fair share in taxes. It is not right that teachers and nurses and firefighters are paying a har-- a higher tax rate than billionaires and the biggest corporations.Bill Whitaker: But—butVice President Kamala Harris: And I plan on making that fair.Bill Whitaker: But we're dealing with the real world here.Vice President Kamala Harris: But the real world includes—Bill Whitaker: How are you gonna get this through Congress?Vice President Kamala Harris: You know, when you talk quietly with a lot of folks in Congress, they know exactly what I'm talking about, 'cause their constituents know exactly what I'm talking about. Their constituents are those firefighters and teachers and nurses. Their constituents are middle-class, hard-working folk.Bill Whitaker: And Congress has shown no inclination to move in your direction.Vice President Kamala Harris: I-- I disagree with you. There are plenty of leaders in Congress who understand and know that the Trump tax cuts blew up our federal deficit. None of us, and certainly I cannot afford to be myopic in terms of how I think about strengthening America's economy. Lemme tell you something. I am a devout public servant. You know that. I am also a capitalist. And I know the limitations of government.Kamala Harris has been in government for decades; she was first elected San Francisco district attorney in 2003, then California attorney general, she went on to the U.S. Senate, and now vice president.Bill Whitaker: A quarter of registered voters still say they don't know you. They don't know what makes you tick. And-- and why do you think that is? What–what's the disconnect?Vice President Kamala Harris: It's an election, Bill. And I take-- it seriously that I have to earn everyone's vote. This is an election for president of the United States. No one should be able to take for granted that they can just declare themselves a candidate and automatically receive support. You have to earn it. And that's what I intend to do.Bill Whitaker: Lemme tell you what your critics and the columnists say.Vice President Kamala Harris: OK.Bill Whitaker: They say that the reason so many voters don't know you is that you have changed your position on so many things. You were against fracking, now you're for it. You supported looser immigration policies, now you're tightening them up. You were for Medicare for all, now you're not. So many that people don't truly know what you believe or what you stand for. And I know you've heard that. Vice President Kamala Harris: In the last four years I have been vice president of the United States. And I have been traveling our country. And I have been listening to folks and seeking what is possible in terms of common ground. I believe in building consensus. We are a diverse people. Geographically, regionally, in terms of where we are in our backgrounds. And what the American people do want is that we have leaders who can build consensus. Where we can figure out compromise and understand it's not a bad thing, as long as you don't compromise your values, to find common-sense solutions. And that has been my approach.But one issue that has proven impervious to compromise is immigration. Over the past four years, the Biden/Harris approach has been inconsistent, and Republicans are convinced immigration is the vice president's achilles heel.Bill Whitaker: You recently visited the southern border and-- embraced President Biden's recent crackdown on asylum seekers. And that crackdown produced an almost immediate and dramatic decrease in the number of border crossings. If that's the right answer now, why didn't your administration take those steps in 2021?Vice President Kamala Harris: The first bill we proposed to Congress was to fix our broken immigration system, knowing that if you want to actually fix it, we need Congress to act. It was not taken up. Fast forward to a moment when a bipartisan group of members of the United States Senate, including one of the most conservative members of the United States Senate, got together, came up with the border security bill. Well, guess what happened? Donald Trump got word that this bill was afoot and could be passed and he wants to run on a problem instead of fixing a problem, so he told his buddies in Congress, \"Kill the bill. Don't let it move forward.\"Bill Whitaker: But I've been covering the border for-- for years. And so I know this is not a problem that started with your administration.Vice President Kamala Harris: Correct. Correct.Bill Whitaker: But there was an historic flood of undocumented immigrants coming across the border the first three years of your administration. As a matter of fact, arrivals quadrupled from the last year of President Trump. Was it a mistake to loosen the immigration policies as much as you did?Vice President Kamala Harris: It's a longstanding problem. And solutions are at hand. And from day one, literally, we have been offering solutions.Bill Whitaker: What I was asking was, was it a mistake to kind of allow that flood to happen in the first place?Vice President Kamala Harris: I think-- the policies that we have been proposing are about fixing a problem, not promoting a problem, okay? But the--Bill Whitaker: But the numbers did quadruple under your--Vice President Kamala Harris: And the numbers today--Bill Whitaker: --under your watch--Vice President Kamala Harris: --because of what we have done-- we have cut the flow of illegal immigration by half. We have cut the--Bill Whitaker: But should you have done that--Vice President Kamala Harris: --flow of fentanyl--Bill Whitaker: --should you have done that-- Vice President Kamala Harris: --by half. But we need Congress to be able to act to actually fix the problem. Bill Whitaker: You have accused Donald Trump of using racist tropes when it comes to Haitian immigrants in Springfield, Ohio, when it comes to birtherism, when it comes to Charlottesville. In fact, you have called him a racist and divisive. Yet Donald Trump has the support of millions and millions of Americans. How do you explain that?Vice President Kamala Harris: I am glad you're pointing these comments out that he has made, that have resulted in a response by most reasonable people to say, \"It's just wrong. It's just wrong.\"Bill Whitaker: With so many people supporting Donald Trump, a man you have called a racist. How do you bridge that seemingly unbridgeable gap?Vice President Kamala Harris: I believe that the people of America want a leader who's not tryin' to divide us and demean. I believe that the American people recognize that the true measure of the strength of a leader is not based on who you beat down, it's based on who you lift up. The Harris campaign has been hopscotching the country and with less than a month to go, the pace is picking up. The vice president told us, she's lost track of how many states she's visited. Vice President Kamala Harris: How are you doing?Bill Whitaker: I'm doing well.Vice President Kamala Harris: You well?We joined her on the trail late last week, in the crucial swing state of Wisconsin, in the town of Ripon, the birthplace in 1854 of the Republican Party. And at a rally plastered with \"country over party\" banners, Harris appeared with staunch conservative Liz Cheney. As vice chair of the House January 6th Committee, Cheney became one of Donald Trump's fiercest critics. Liz Cheney: I have never voted for a Democrat, but this year, I am proudly casting my vote for Vice President Kamala Harris (applause)That proclamation spurred a chant of approval from the crowd…Bill Whitaker: Four years ago if someone had told you that you would be campaigning with Liz Cheney, what would you have said to them?Vice President Kamala Harris: That'd be great. (laughter)Liz Cheney: She's really diplomatic. (laughter)Bill Whitaker: Would you ever have thought that you'd be campaigning with Kamala Harris?Liz Cheney: I hope that if you had said to me four years ago, \"Our constitution is going to be under threat and it's gonna be crucial for the parties to come together-- and to support Vice President Harris because she'll defend the rule of law\"-- I know I would've said, \"That's exactly what I'll do.\"Whoever wins the presidency will take on a host of daunting challenges, especially beyond our borders. Back in Washington, Vice President Harris told us she's determined the U.S must win the economic competition with China for the 21st century. And as for the war between Russia and Ukraine?Bill Whitaker: What does success look like in ending the war in Ukraine?Vice President Kamala Harris: There will be no success in ending that war without Ukraine and the UN charter participating in what that success looks like.Bill Whitaker: Would you meet with President Vladimir Putin to negotiate a solution to the war in Ukraine?Vice President Kamala Harris: Not bilaterally without Ukraine, no. Ukraine must have a say in the future of Ukraine. Bill Whitaker: As president, would you support the effort to expand NATO to include Ukraine?Vice President Kamala Harris: Those are all issues that we will deal with if and when it arrives at that point. Right now, we are supporting Ukraine's ability to defend itself against Russia's unprovoked aggression. Donald Trump, if he were president, Putin would be sitting in Kyiv right now. He talks about, \"Oh, he can end it on day one.\" You know what that is? It's about surrender. Bill Whitaker: A hard left turn here. But-- you recently surprised people when you said that you are a gun owner and that if someone came into your house--Vice President Kamala Harris: That was not the first time I've-- I've--Bill Whitaker: --they would get shot.Vice President Kamala Harris: --talked about it. That's not the first time I've talked about it.Bill Whitaker: So what kind of gun do you own, and when and why did you get it?Vice President Kamala Harris: I have a Glock, and-- I've had it for quite some time. And-- I mean, look, Bill, my background is in law enforcement. And-- so there you go. Bill Whitaker: Have you-- ever fired it?Vice President Kamala Harris: Yes. (laugh) Of course I have. At a shooting range. Yes, of course I have.Democratic vice-presidential candidate Tim Walz was little-known outside Minnesota just two months ago. He didn't exactly come from nowhere. He was a six-term congressman and now is governor of Minnesota, where he has championed abortion rights, gun control, and other progressive ideas. But it was calling former President Trump and Sen. JD Vance \"weird\" that may have landed him on the ticket.Bill Whitaker: Two months ago, you and Kamala Harris barely knew each other. Now, you're running together, vying for the top offices in the land. It's not possible that you agree on everything.Gov. Tim Walz: Yeah.Bill Whitaker: What have been some disagreements you've had since you became a team?Gov. Tim Walz: Well—I—she'd probably disagreed with—she said, \"Tim, you know, you need to be a little more careful on how you say (laugh) things,\" whatever it might be. Whatever it might be, Walz has been criticized for embellishing or telling outright falsehoods about his military record, and about his travels to Asia in the 1980s.Bill Whitaker: In your debate with JD Vance, you said, \"I'm a knucklehead (laugh) at times.\" And I think you were referring to the time that you said that you were in Hong Kong during the Tiananmen Square unrest when you were not.Gov. Tim Walz: Yeah.Bill Whitaker: Is that kind of misrepresentation, isn't that more than just being a knucklehead?Gov. Tim Walz: I think folks know who I am. And I think they know the difference between someone expressing emotion, telling a story, getting a date wrong by--you--rather than a pathological liar like Donald Trump.Bill Whitaker: But I think it comes down to the question of whether—whether you can be trusted to tell the truth.Gov. Tim Walz: Yeah. Well-- I can-- I think I can. I will own up to being a knucklehead at times, but the folks closest to me know that I keep my word. Walz proudly touts his record as governor of Minnesota, but it also has opened him up to criticism from his Republican opponents.Bill Whitaker: Former President Trump says that you and your administration here in Minnesota has been dangerously liberal. Radical left, he calls it. So, what do you say to that criticism, that rather than leading the way, you and Minnesota are actually out of step with the rest of the country?Gov. Tim Walz: President Trump may be referring to that – that our children get breakfast and lunch in school so that they can learn. He may be talkin' about we have a paid family medical leave policy that was promoted by the business community. Donald Trump spends his time tearing down states rather than lifting up the things we do, the best of it. Donald Trump's critiques of that, not only are they wrong, but I'm waiting for, \"What—what is his solution? Here in Minnesota, we're so optimistic, we walk on water half the year (laugh).It was that kind of humor and candor that helped land Tim Walz the job as Kamala Harris's running mate.Bill Whitaker: Before you joined the– ticket, you called Republicans \"weird.\" And that's sort of become a rallying cry for Democrats. Why do you think that label stuck?Gov. Tim Walz: I was really talking about the behaviors. Being obsessed with people's personal lives in their bedrooms and their reproductive rights, making up stories about legal –folks legally here eating cats and dogs, they're dehumanizing. They go beyond weird because I said this: it becomes almost dangerous. Let's debate policy in a real way and let's try and find an objective truth again.Kamala Harris and Tim Walz are in a full sprint to November 5th, hoping their arguments will give them a chance to cross the line ahead of Donald Trump and JD Vance.Bill Whitaker: You are sitting here with us. The Trump campaign canceled an interview that they had agreed to, to participate in this broadcast. What do you make of that?Vice President Kamala Harris: If he is not gonna give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies. You're gonna hear conversations that are about himself and all of his personal grievances. And what you will not hear is anything about you, the listener. You will not hear about how he is gonna try to bring the country together, find common ground. And, Bill, that is why I believe in my soul and heart, the American people are ready to turn the page.Produced by Marc Lieberman and Rome Hartman. Associate producers: Cassidy McDonald, Matthew Riley and LaCrai Scott. Broadcast associates: Mariah Johnson and Georgia Rosenberg. Edited by Warren Lustig and Craig Crawford.","summary":"In a 2024 election interview, Vice President Kamala Harris discusses the economy, immigration, the ongoing Ukraine and Mideast wars, and the differences between herself and former President Trump.","url":"https://www.cbsnews.com/news/kamala-harris-2024-election-interview-60-minutes-transcript/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/07/746904a9-b05c-479e-ac29-14669055f254/thumbnail/1200x630/75a9f3edbd6cae6eac24164eb8f84f52/harris-video-whitaker.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:01:00","author":"Bill Whitaker","authors":["Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.15},{"id":258836624,"title":"How 60 Minutes found out Trump would not participate in election special","text":"It's been a tradition for more than half a century that the major party candidates for president sit down with 60 Minutes in October. In 1968, it was Richard Nixon and Hubert Humphrey. This year, Vice President Kamala Harris and former President Donald Trump accepted invitations. Unfortunately, last week, Trump canceled. The Trump campaign had said that the interview would be this past Thursday at Mar-A-Lago, Trump's Florida home. It also asked whether 60 Minutes would meet 78-year-old Trump in Butler, Pennsylvania, where the Republican candidate for president was grazed by a bullet in an assassination attempt. 60 Minutes agreed. On Sept. 9, Trump communications director Steven Cheung sent a text that read: \"I'm working with our advance team to see logistically if Butler would work in addition to the sit down.\"Days later, Cheung called to say \"the president said yes.\"Then, a week ago, Trump backed out. The campaign offered shifting explanations. First, it complained that 60 Minutes would fact check the interview. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsKamala Harris and Tim Walz: More from their 60 Minutes interviews\"There were initial discussions, but nothing was ever scheduled or locked in,\" Cheung said in a post on X, formerly Twitter. \"They also insisted on doing live fact checking, which is unprecedented.\"60 Minutes fact checks every story it broadcasts. Later, Trump said he needed an apology for his interview in 2020. Trump claims correspondent Lesley Stahl said, in that interview, that Hunter Biden's controversial laptop came from Russia. She never said that. \"Where's my apology? They should apologize,\" Trump said on Tuesday night at a Milwaukee press conference. \"They were wrong on everything. So I'd like to get an apology. So I've asked them for an apology.\"Trump has said Harris doesn't do interviews because she can't handle them. He has declined to participate in a second debate with Harris. So the Monday night election special may have been the last opportunity between now and Election Day for a national audience to hear from both candidates on a range of issues, including the economy, immigration, reproductive rights and the wars in the Middle East and Europe. Both campaigns understood this special would go ahead if either candidate backed out. Harris, who participated in an interview with 60 Minutes, addressed the issue.\"If he is not going to give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies,\" Harris said. \"You're going to hear conversations that are about himself and all of his personal grievances.\"","summary":"Voters will not hear directly from former President Donald Trump during the 60 Minutes election special. Trump, after initially accepting, later declined to participate.","url":"https://www.cbsnews.com/news/donald-trump-2024-60-minutes-interview-what-happened/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/f5c45c3c-d4de-4358-8a9e-9d819ada225a/thumbnail/1200x630/a932cf4983dff3ef33612866d57ca9fd/gettyimages-2176516555.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378477635890/3248187_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":null,"language":"en","source_country":"US","sentiment":-0.308},{"id":258836628,"title":"Tim Walz, after misspeaking on his record, says \"folks know who I am\"","text":"Unlike his running mate, who has been on the national stage for many years, Democratic Gov. Tim Walz was little-known outside Minnesota just two months ago.He's been on a much bigger stage and facing more intense scrutiny since Vice President Kamala Harris chose him as her running mate in August. The six-term congressman and current governor of Minnesota has championed abortion rights, gun control and family and medical leave in his state. On the campaign trail, he is working to win over voters in other states.Walz' background and recordWalz promoted his background as having worked as a bipartisan member of Congress while representing a Republican district before being elected as governor.\"That sense of service fits with what I think people think this job is. This is not about you. This is about the American people,\" he said. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsTwo months ago, Walz and Harris barely knew each other. Now they're running together for the top office in the land. If elected, he says he knows what his role will be. \"I'm part of this team, but it will be President Harris,\" Walz said. Walz proudly touts his record as governor of Minnesota, but it also has opened him up to criticism from his Republican opponents. Former President Donald Trump has said that Walz and his administration have been dangerously liberal. \"Donald Trump spends his time tearing down states rather than lifting up the things we do, the best of it. Donald Trump's critiques of that, not only are they wrong, but I'm waiting for, 'what is his solution,'\" Walz said.Republicans question Walz' backgroundWalz has been criticized for misstating some facts about his military record and his travels to Asia in the 1980s. He recently referred to himself as a \"knucklehead,\" referencing a time that he said that he was in Hong Kong during the Tiananmen Square crackdown when he wasn't. Walz has said he \"misspoke on this.\"60 Minutes correspondent Bill Whitaker asked about any disagreements Walz and Harris have had since they became a team.\"Well, I, she'd probably disagreed with – she said, 'Tim, you know, you need to be a little more careful on how you say things,' whatever it might be.'\"Walz said those closest to him know he keeps his word and that people know who he is. \"And I think they know the difference between someone expressing emotion, telling a story, getting a date wrong, rather than a pathological liar like Donald Trump,\" he said.Where \"weird\" came fromBefore he joined the ticket, Walz became known for his folksy criticism of Donald Trump and JD Vance. He called the GOP standard-bearers \"weird\", and it quickly became a rallying cry for Democrats.\"I was really talking about the behaviors: being obsessed with people's personal lives in their bedrooms and their reproductive rights, making up stories about legal folks, legally here eating cats and dogs, they're dehumanizing. They go beyond weird because I said this: it becomes almost dangerous,\" Walz said. \"Let's debate policy in a real way. And let's try and find an objective truth again.\"","summary":"Kamala Harris running mate Tim Walz has been criticized for embellishing or telling outright falsehoods about his military record and his travels to Asia","url":"https://www.cbsnews.com/news/tim-walz-2024-election-60-minutes/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/71a6208d-ed6f-4f08-b6f7-5259abbc1d60/thumbnail/1200x630/dc22d59f914b123db5fb039c62221057/tim-walz-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.043},{"id":258836630,"title":"What Kamala Harris says her tax plans mean for voters","text":"Vice President Harris is proposing a tax increase on the wealthiest Americans to help fund an expansion of the child tax credit, along with tax breaks for first-time home buyers and people starting small businesses. The nonpartisan Committee for a Responsible Federal Budget estimates that Harris' economic plan would add more than $3 trillion to the federal deficit over the next decade, while Trump's plan would increase the debt by $7.5 trillion. Harris has defended her plan, arguing that economists who've reviewed it say it would strengthen America's economy.\"My plan is about saying that when you invest in small businesses, you invest in the middle class, and you strengthen America's economy,\" Harris said. \"Small businesses are part of the backbone of America's economy.\"Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsTo pay for her plan, Harris would raise taxes on high-income earners.\"It is not right that teachers and nurses and firefighters are paying a higher tax rate than billionaires and the biggest corporations,\" Harris said. She'll also need to get her plan through Congress.\"There are plenty of leaders in Congress who understand and know that the Trump tax cuts blew up our federal deficit,\" Harris said.Harris' plan to increase the corporate tax rate from 21% to 28% would raise revenue by about $900 billion through 2035.What Americans are experiencing in their day-to-day livesThere are many signs that the American economy is doing well. America's employers added 254,000 jobs in September and the unemployment rate dropped for a second straight month, from 4.2% in August to 4.1% in September. The Federal Reserve last month cut its benchmark interest rate for the first time in more than four years.Despite all that, many Americans don't seem to be feeling it. Some voters blame the Biden-Harris administration for the high cost of groceries.\"We now have historic low unemployment in America among all groups of people. We now have an economy that is thriving by all macroeconomic measures,\" Harris said. \"And, to your point, prices are still too high.\"Part of Harris' plan to target high prices is a federal ban on price gouging for food and groceries.","summary":"The economy has weighed heavily on voters' minds as the Nov. 5 presidential election nears. Vice President Kamala Harris shares her plans.","url":"https://www.cbsnews.com/news/kamala-harris-economy-tax-plan-60-minutes/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/07/08fbb741-f996-4fb4-806a-9853a048fa5c/thumbnail/1200x630/265400c70c6eeeed7710773b7ab16a40/harris-tax-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.341},{"id":258836634,"title":"Kamala Harris on whether Israel's Netanyahu is a close U.S. ally","text":"aOne year after Hamas launched a deadly cross-border attack into Israel on Oct. 7, Vice President Kamala Harris reiterated her call for the war to end as the death toll climbs. The Biden-Harris administration has pushed for a cease-fire, but the White House's relationship with Israeli Prime Minister Benjamin Netanyahu has been tested as he charts his own course -- sometimes against the urging of the president and vice president.\"We're not going to stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end,\" Harris said. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsShe maintained that Israel, which is still working to recover hostages taken into Gaza, has a right to defend itself, but said that \"far too many innocent Palestinians have been killed.\"While the bulk of Israel's focus has been on Hamas in Gaza, Israel in late September began increasingly targeting the operations of the Iran-backed militant group Hezbollah in Lebanon. For months, the group has been firing rockets into Israel from southern Lebanon. Now Israel is responding with airstrikes and, what it calls a limited ground operation into Lebanon, fueling fears of a broader war in the Middle East.President Biden has called for a cease-fire in Lebanon, raising more questions about the relationship between Mr. Biden and Netanyahu. \"I think, with all due respect, the better question is, do we have an important alliance between the American people and the Israeli people,\" Harris said. \"And the answer to that question is yes.\"","summary":"One year after Oct. 7, Harris answers questions about the U.S. relationship with Israeli Prime Minister Benjamin Netanyahu as war in the Middle East continues.","url":"https://www.cbsnews.com/news/kamala-harris-israel-war-one-year-60-minutes/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/7f5a88ee-4d6e-496e-80bf-15cd0be3cddd/thumbnail/1200x630/f763c531de543e44b38439c7a7e5246c/harris-israel-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.402},{"id":258836638,"title":"Kamala Harris defends record on immigration: \"Solutions are at hand'","text":"Vice President Kamala Harris is campaigning on a pledge to toughen border restrictions as Republicans hammer her over the Biden-Harris administration's record on immigration.Harris in late September visited the U.S.-Mexico border for the first time as the Democratic presidential nominee and embraced President Biden's recent crackdown on asylum seekers, which produced an almost immediate and dramatic decrease in the number of border crossings. Harris said she would take it even further. Immigration problems are nothing new, but there was a record number of undocumented immigrants coming across the border during the first three years of the Biden-Harris administration after pandemic-era immigration policies and other restrictions were loosened.\"Solutions are at hand. And from Day One, literally, we have been offering solutions,\" Harris said.Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsShe pointed to the recent decrease in illegal immigration: Border crossings plunged this year, with illegal crossings at the southern border reaching the lowest point of President Biden's administration in September, according to internal Department of Homeland Security statistics obtained by CBS News.Earlier this year, bipartisan legislation aiming to overhaul the immigration system failed in Congress after Trump urged Republicans to oppose it.\"We need Congress to be able to act to actually fix the problem,\" Harris said. As vice president, Harris' responsibilities on the immigration issue have often been mischaracterized by her political opponents. Mr. Biden in 2021 tasked Harris with leading the administration's diplomatic efforts to address the \"root causes\" of migration from Central America's Northern Triangle — Guatemala, Honduras and El Salvador. Trump has wrongly called Harris the administration's \"border czar.\"","summary":"Republicans have pounded Vice President Kamala Harris on immigration. She's announced plans to enact tougher border restrictions and has called on Congress to act on long-term solutions.","url":"https://www.cbsnews.com/news/kamala-harris-immigration-border-60-minutes/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/eb166293-3ab4-4662-8454-0fa1053e20f7/thumbnail/1200x630/652732bb0a50f8761d5a57d7af0231b2/harris-immigration-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.496},{"id":258836640,"title":"Vice President Harris, Gov. Walz 60 Minutes' interview highlights","text":"Vice President Kamala Harris has been the Democratic candidate for president for less than three months. In that time, she's dealt with unrelenting attacks from former President Donald Trump as she's defended her record and pitched herself and her plans to the American public.This week on 60 Minutes, correspondent Bill Whitaker interviewed Harris and running mate Gov. Tim Walz to learn more about the Democratic ticket's plans on the economy, immigration, foreign affairs and more.It is the third time Whitaker has interviewed Harris and his first sit-down with Walz. The interviews were conducted with less than a month to go before the Nov. 5 election, when Harris and Walz will face off against former President Donald Trump and his running mate, Sen. JD Vance.One year after the Hamas terror attack on Israel, Harris discusses war in the Middle East Whitaker asked Harris if the U.S. lacks influence over Israeli Prime Minister Benjamin Netanyahu and whether he is a close ally. President Biden's White House has called for a cease-fire in Gaza, but Israel has pressed on with the war. The administration also called for a cease-fire in Lebanon, before Israel expanded its bombardment there. \"I think, with all due respect, the better question is do we have an important alliance between the American people and the Israeli people,\" Harris said. \"And the answer to that question is yes.\"How Harris says she'll handle Putin, the Ukraine warWhile the Israel-Hamas war has dominated headlines over the last year since Hamas launched the Oct. 7 terror attack, the Ukraine-Russia war has been grinding on for more than two years. Harris said she would not meet with Russian President Vladimir Putin to negotiate an end to the war without Ukraine's involvement. \"Ukraine must have a say in the future of Ukraine,\" she said. \"Donald Trump, if he were president, Putin would be sitting in Kyiv right now. Let's be clear about that. He talks about, 'Oh, he can end it on Day One.' You know what that is? It's about surrender.\"Harris responds to Trump's decision not to sit down with 60 MinutesVoters will not hear directly from former President Donald Trump during the 60 Minutes election special. Trump, after initially accepting, later declined to participate.\"If he is not going to give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies,\" Harris said. \"You're going to hear conversations that are about himself and all of his personal grievances.\"Voters' top concern: the economyThe economy tops voters' concerns as Election Day nears, but Harris defended the Biden administration's record, pointing to low unemployment numbers. She also touted her campaign proposals to institute a federal ban on price gouging on food and groceries, expand the child tax credit and give tax breaks to first-time home buyers and people starting small businesses.Whitaker asked how she intends to pay for her plans and get them through Congress.\"One of the things is I'm going to make sure that the richest among us who can afford it pay their fair share in taxes,\" Harris said. \"It is not right that teachers and nurses and firefighters are paying a higher tax rate than billionaires and the biggest corporations.\"Harris defends immigration record, shares plans for the futureHarris recently visited the southern border and embraced President Biden's recent crackdown on asylum seekers. \"It's a longstanding problem,\" Harris said. \"And solutions are at hand. And from Day One, literally, we have been offering solutions.\"Longer-term, Harris said, \"We need Congress to be able to act to actually fix the problem.\" Earlier this year, bipartisan border security legislation failed after Trump urged Republicans to oppose it.\"Donald Trump got word that this bill was afoot and could be passed,\" she said, \"...and he wants to run on a problem instead of fixing a problem, so he told his buddies in Congress, 'Kill the bill. Don't let it move forward.'\"Gov. Tim Walz on the national stageUnlike his running mate, who has been on the national stage for many years, Democratic vice presidential candidate Gov. Tim Walz was little-known outside Minnesota just two months ago. Since Harris chose him as her running mate in August, he's been on a much bigger stage, and facing more scrutiny than ever before. He's been criticized for misstatements about his military record and about his travels to Asia in the 1980s.In his debate with Trump running mate Sen. JD Vance, Walz said, \"I'm a knucklehead at times.\" \"I think folks know who I am,\" Walz told Whitaker, adding that he believes people know the difference between someone like him and a \"pathological liar like Donald Trump.\"","summary":"60 Minutes correspondent Bill Whitaker interviewed Vice President Kamala Harris and Gov. Tim Walz ahead of the 2024 election.","url":"https://www.cbsnews.com/news/kamala-harris-tim-walz-60-minutes-interview-highlights-2024-election/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/73e72b4e-6c5d-4f09-992c-ce7a81445378/thumbnail/1200x630/27466c16acb311985a56a4da15a780f9/60-minutes-full-episode-10-7-24.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.072},{"id":258836646,"title":"Kamala Harris fighting to \"earn everyone's vote\" in leadup to Nov. 5 election","text":"In the final countdown to the election, Vice President Kamala Harris is defending her record and making her case for the presidency while dealing with unrelenting attacks from former President Donald Trump. The Democratic Party rallied around Harris and her running mate, Minnesota Gov. Tim Walz, after President Biden dropped his reelection bid in July. Supporters across the country responded with relief and optimism in the early days of Harris' candidacy, but the race remains extremely close. \"I take it seriously that I have to earn everyone's vote,\" Harris said. \"This is an election for president of the United States. No one should be able to take for granted that they can just declare themselves a candidate and automatically receive support. You have to earn it. And that's what I intend to do.\"A quarter of registered voters in a recent poll said they need to learn more about Harris, even though she's been vice president for nearly four years and has been on the national stage for even longer. Critics say the reason so many voters don't have a clear picture of Harris is because she's changed her position on so many issues. She was against fracking, but now supports it; she supported looser immigration policies, but is now in favor of tougher restrictions; she was for Medicare for all, but now she's not. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsHarris defended her evolution, saying it reflects her experience as vice president seeking common ground.\"What the American people do want is that we have leaders who can build consensus,\" she said. \"Where we can figure out compromise and understand it's not a bad thing, as long as you don't compromise your values, to find common-sense solutions. And that has been my approach.\"Building that consensus also involves bridging the gap in a politically divided America. \"I believe that the people of America want a leader who's not trying to divide us and demean,\" Harris said. \"I believe that the American people recognize that the true measure of the strength of a leader is not based on who you beat down, it's based on who you lift up.\"Late last week, Harris was in Ripon, Wisconsin — the 1854 birthplace of the Republican Party. She was joined by staunch conservative and former U.S. Rep. Liz Cheney at a rally plastered with \"country over party\" banners.\"I have never voted for a Democrat, but this year, I am proudly casting my vote for Vice President Kamala Harris,\" Cheney said to applause at the rally. As vice chair of the House January 6th committee, Cheney became one of Trump's fiercest critics.\"I hope that if you had said to me four years ago, 'Our constitution is going to be under threat and it's going to be crucial for the parties to come together and to support Vice President Harris because she'll defend the rule of law,' I know I would've said, 'That's exactly what I'll do,'\" Cheney said.","summary":"Vice President Kamala Harris is in the midst of a whirlwind campaign as she works to sway undecided voters before the Nov. 5 election.","url":"https://www.cbsnews.com/news/kamala-harris-election-support-60-minutes/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/07/4b33ba70-5d59-4c18-877a-51263c6f762b/thumbnail/1200x630/5e8a8341a136820ab75351857bf45a36/harris-votes-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.089},{"id":258836654,"title":"More from Vice President Harris and Gov. Walz","text":"This week on 60 Minutes, correspondent Bill Whitaker followed the Democratic ticket for president and vice president, both in Washington DC and on the campaign trail in Wisconsin.With only four weeks to go until election day and mail-in ballots already being marked, 60 Minutes watched as Vice President Kamala Harris and Gov. Tim Walz campaigned in the battleground state, making their appeal to voters Harris otherwise could have met months ago during a more traditional election cycle.Here is more of Whitaker's interviews with Harris and Walz.Was democracy best served without a Democratic primary?When President Joe Biden stepped out of the race for reelection in July, he immediately endorsed Harris, who assumed the role of presidential hopeful a year later than candidates ordinarily do in modern American elections. In addition to a truncated timeline for campaigning, Harris won the nomination without having to fight fellow Democrats in a primary. Whitaker wanted to know: Was democracy best served by side-stepping the traditional primary process? \"I am proud to have earned the support of the vast majority of delegates, and to have been elected the Democratic nominee,\" Harris answered. \"I am honored to have received the endorsement of leaders around this country from every background and walk of life, to fight in this election over the next month for our democracy.\"Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviews Ordinarily, a lengthy primary process gives candidates enough time to get to know voters â and be known by them. Because she did not spend months speaking to reporters and debating other candidates, Harris has had to make up for lost time with undecided voters who say they simply do not know who she is.\"It is, without any question, a short period of time,\" Harris acknowledged. \"There's no question about that. Which is why I'm traveling around our country from one state to the next, to the next. It is my responsibility to earn the vote, and I'm going to work to do that.\"The fear of election-related violenceAmid a deeply polarizing election that has seen two assassination attempts against former President Donald Trump, three-quarters of likely American voters say they are concerned about the possibility of election violence. What role does Harris think she should play in lowering the temperature?The vice president told Whitaker she was \"deeply disturbed, shocked, and shaken\" by the potential assassinations and said she called Trump for a quick conversation after the second attempt in August.\"It is really important that all of us speak loudly, regardless of who we're voting for, to say, 'Our differences have to be settled at the ballot box and not through violence,'\" Harris said. \"We cannot lose our soul in terms of who we are as Americans by resorting to violence to settle our differences, much less to make a decision about who's going to be the next President of the United States.\"On Iran and China Whoever wins in November will have a full slate of foreign policy issues to tackle. Whitaker asked Harris which foreign country she considers America's greatest adversary.Iran, Harris responded, is an obvious one.\"Iran has American blood on their hands,\" she said. \"And what we saw in terms of just this attack on Israel, 200 ballistic missiles, what we need to do to ensure that Iran never achieves the ability to be a nuclear power, that is one of my highest priorities.\"Harris stopped short of answering whether the U.S. would take military action if the administration found proof that Iran is building a nuclear weapon.On China, Harris said the U.S. \"should not seek conflict,\" but instead protect American business interests. She would not answer whether the U.S. would use military force to support Taiwan.\"I'm not going to get into hypotheticals,\" Harris said. \"But listen, we need to make sure that we maintain a 'One China' policy, but that includes supporting Taiwan's ability to defend itself, including what we need to do to ensure the freedom of the Taiwan Strait.\"The role Tim Walz would play as vice presidentWhether the issue is foreign policy, the economy, immigration, or any of the other critical decisions that will come from the Oval Office, Whitaker asked Minnesota Gov. Tim Walz what role he might play, should he and Harris get elected. Walz said he views his role as an advisor, noting that Harris understands he has different lived experiences that he can draw on, including serving as governor of Minnesota and spending 24 years in the National Guard.\"My job is to give that experience,\" Walz said.When asked how he might handle times that he and Harris disagree, Walz said he would draw on his experience as an enlisted soldier.\"Many times the officers who were higher ranking had much less time. My job was to be their lead advisor, and I would give my best advice to them, and they would make their decision,\" he explained. \"If it was not the advice I gave, I turned around to our troops, and I said, 'Here's what we're going to do. Here's the mission. Here's how it's going be executed.' The commander's plan was clear.\"Walz went on to offer that Harris would be a leader who seeks that input. \"She doesn't believe she has all the answers,\" Walz said. \"That's what the president should do.\"The video above was produced by Brit McCandless Farmer and edited by Scott Rosann.","summary":"More from Bill Whitaker's 60 Minutes interview with Vice President Kamala Harris and Gov. Tim Walz, the Democratic ticket in the 2024 presidential election.","url":"https://www.cbsnews.com/news/kamala-harris-and-tim-walz-more-from-their-60-minutes-interviews/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/fceb0341-600b-4421-a9fc-0b0bbb0313ea/thumbnail/1200x630/bd15219f80483d3bfc7ce2832f7390c5/ot-whitakerthedemocaticticket.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378495043971/3248450_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Brit McCandless Farmer","authors":["Brit McCandless Farmer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.218},{"id":258837770,"title":"Harris calls Trump 'irresponsible' for spreading disinformation about hurricane aid","text":"Vice President Kamala Harris criticized former President Donald Trump on Monday over false claims he has made talking about disaster relief for victims of Hurricane Helene. Harris told reporters that there's a lot of \"disinformation being pushed out there by the former president about what is available, in particular to the survivors of Helene,\" from the Federal Emergency Management Agency. \"It’s extraordinarily irresponsible. It’s about him; it’s not about you,\" Harris said. \"And the reality is that FEMA has so many resources that are available to folks who desperately need them now and resources that are about helping people get back on their feet and rebuild and have places to go.\" A Trump campaign spokesperson didn’t immediately respond to a request for comment Monday night. Trump last week amplified a false claim about FEMA's disaster funds, saying they were being distributed to migrants who entered the U.S. illegally. “They stole the FEMA money, just like they stole it from a bank, so they could give it to their illegal immigrants that they want to have vote for them this season,” Trump said at a rally in Saginaw, Michigan. NBC News has reported that Trump and his allies were conflating a more than $20 billion fund exclusively set aside for disaster relief and a separate program established under direction from Congress in 2022 to distribute funds from Customs and Border Protection to help U.S. communities provide services to migrants released by the Department of Homeland Security. FEMA has also responded, saying its emergency response money \"has not been diverted to other, non-disaster related efforts.” Trump spread false claims about the agency at a rally in Butler, Pennsylvania, where he said the federal government was providing disaster victims only $750, a claim FEMA has disputed, describing the initial sum as a payment to help cover essentials and emergency supplies while it reviews survivors' eligibility for more funds. FEMA Administrator Deanne Criswell referred to Trump’s comments as “just plain false” and “a truly dangerous narrative” in an interview Sunday with ABC News. “It’s really a shame that we’re putting politics ahead of helping people, and that’s what we’re here to do,” Criswell said. The storm, which made landfall in Florida on Sept. 26, became the deadliest on record since Hurricane Katrina in 2005 as the death toll rose to 230.","summary":"Harris criticized Trump for amplifying a false claim about the distribution of Federal Emergency Management Agency funds to victims of Hurricane Helene.","url":"https://www.nbcnews.com/politics/2024-election/kamala-harris-calls-trump-irresponsible-disinformation-helene-aid-rcna174402","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241007-kamala-harris-hurricane-ew-552p-56aaa0.jpg","video":null,"publish_date":"2024-10-07 23:58:39","author":"Nnamdi Egwuonwu,Zoë Richards","authors":["Nnamdi Egwuonwu","Zoë Richards"],"language":"en","source_country":"us","sentiment":-0.415},{"id":258836644,"title":"Kamala Harris and Tim Walz: More from their 60 Minutes interviews","text":"Kamala Harris and Tim Walz: More from their 60 Minutes interviews\n More from Bill Whitaker's 60 Minutes interview with Vice President Kamala Harris and Gov. Tim Walz, the Democratic ticket in the 2024 presidential election.","summary":"More from Bill Whitaker's 60 Minutes interview with Vice President Kamala Harris and Gov. Tim Walz, the Democratic ticket in the 2024 presidential election.","url":"https://www.cbsnews.com/video/kamala-harris-and-tim-walz-more-from-their-60-minutes-interviews/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/4aa81a59-e108-4c17-8c51-ffc9c38813b1/thumbnail/1200x630/392c0e5a016693a79917a1cc4eed0b3d/ot-whitakerthedemocaticticket-3248453-640x360.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-07 23:55:32","author":null,"language":"en","source_country":"US","sentiment":-0.351},{"id":258836912,"title":"Former Democratic lawmaker hoping for ‘world peace’ rolls out Trump endorsement","text":"Former Florida Rep. Peter Deutsch is a Jewish American Democrat who was a lawmaker in the Sunshine State from 1993 to 2005. On Monday, which is the first anniversary of Hamas’s attack on Israel, Deutsch announced he would not be supporting the top of his party’s ticket on Election Day. \n\n“I think that Kamala Harris and the Harris-Biden administration in terms of what they have done and are doing … [and] their policies toward Iran make the world a dramatically less safe place,” Deutsch said. \n\nInstead, he decided to endorse Trump during a press call organized by the former president’s campaign to commemorate the Hamas attacks on Israel. \n\nDeutsch said that the “driving force for me to make this decision is what I believe is the most important factor in being president, which is really world peace.”\n\n“I feel very comfortable today publicly announcing that I’m endorsing Donald Trump to be reelected as president,” Deutsch added. \n\nHamas, which is a terrorist group backed by Iran, killed 1,200 civilians during its attacks. The year since the attack has seen tensions continue to boil over in the Middle East, with Iran launching a direct missile attack on Israel last week. \n\nDeutsch said during the call Monday that he believes another Trump term will restore stability in the region. \n\n“For what I believe is the most important job of the President of the United States, which is trying to retain peace in the world, there is an extraordinarily clear choice that I think every American hopefully will come to the same conclusion that I have: that President Trump should become the next president of the United States,” he said. \n\nDeutsch is the latest of a slew of current and former Democrats, including longtime environmental lawyer and former presidential candidate Robert F. Kennedy Jr., former Rep. Tulsi Gabbard, Tesla and SpaceX CEO Elon Musk, and Arab American Michigan Mayor Amer Ghalib, who have decided to back Trump. \n\nMany of them have cited Trump’s foreign policy stances as their decision to back the former president this November. \n\n“He not only didn’t start any new wars, he took action to de-escalate and prevent wars,” Gabbard said when she endorsed Trump in September. \n\nClaiming Trump views war “as a last resort,” she hoped he would “walk us back from the brink of nuclear war.” \n\nTrump has often touted his work in brokering the Abraham Accords in 2020, which normalized relations between Israel and the United Arab Emirates and between Israel and Bahrain. \n\nThroughout the course of his 2024 presidential campaign against Vice President Kamala Harris, he has often accused her of fueling foreign policies, such as unfreezing billions in sanctions against Iran, that have destabilized Israel and unleashed terror in the Middle East. \n\n“It is no surprise that Iran desperately wants Kamala Harris to be President because they know as long as she is in power, they can take advantage of America,” Trump said in a statement last week. “When I was President, Iran was in total check. They were starved for cash, fully contained, and desperate to make a deal.”\n\nWhile Trump says the Biden administration’s policies have empowered Iran to wreak terror against Israel, Harris has argued that she has “my entire career and life supported Israel and the Israeli people.”\n\n“He knows that,” she said during her presidential debate against Trump last month. “He’s trying to again divide and distract from the reality, which is it is very well known that Donald Trump is weak and wrong on national security and foreign policy.”","summary":"A six-term Democratic lawmaker expressed faith that putting former President Donald Trump back in the White House would make the world a safer place as the United States reflects on the deadly Oct. 7 Hamas attack that unleashed turmoil in the Middle East. Former Florida Rep. Peter Deutsch is a Jewish American Democrat who was [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3180409/former-democratic-lawmaker-hoping-world-peace-rolls-out-trump-endorsement/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Deutsch.webp","video":null,"publish_date":"2024-10-07 23:55:07","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","category":"politics","source_country":"US","sentiment":-0.171},{"id":258835922,"title":"Harris and Trump mark Oct. 7 on campaign trail","text":"Harris and Trump mark Oct. 7 on campaign trail\n Former President Donald Trump marked Oct. 7 at a memorial in Queens, New York, while in Washington, Vice President Kamala Harris planted a pomegranate tree, a symbol of a hope. Nancy Cordes has more on how Israel's war with Hamas is unavoidably a factor in the U.S. presidential election.","summary":"Former President Donald Trump marked Oct. 7 at a memorial in Queens, New York, while in Washington, Vice President Kamala Harris planted a pomegranate tree, a symbol of a hope. Nancy Cordes has more on how Israel's war with Hamas is unavoidably a factor in the U.S. presidential election.","url":"https://www.cbsnews.com/video/harris-and-trump-mark-oct-7-on-campaign-trail/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/dc274d69-5064-4662-a58e-ebb9479e56f9/thumbnail/1200x630/567ce7f812c38b899324f4d253948cf0/1007-en-cordes.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-07 23:50:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.221},{"id":258836564,"title":"Exclusive -- Faith & Freedom Coalition's Ralph Reed: Galvanizing Evangelical, Catholic Swing-State Voters Could Deliver Trump Victory","text":"The Faith & Freedom Coalition has been working to galvanize low propensity Evangelical and Catholic voters for former President Donald Trump, in what founder and chairman Ralph Reed is calling “the best ground game” he has ever seen.\n\n“We’re hitting ten million doors, just Faith & Freedom [Coalition]. That’s half of all the doors that were knocked on by the entire Republican Party four years ago,” Reed said during an interview on Breitbart News Saturday. “That doesn’t count what Trump does. It doesn’t count Turning Point or SBA [Pro-Life America]. It doesn’t count what Elon Musk is doing through his PAC.”\n\n“I can tell you right now, this is the best ground game that I have ever seen…I’m not talking about robocalls and computer-generated text messages. I’m talking about people at the door or phone calls from volunteers,” he added. “This is more than we have ever delivered as a movement.”\n\nIn the interview with Breitbart D.C. Bureau Chief Matthew Boyle, Reed specifically broke down the numbers he is seeing from voters of faith in swing states, what percentage supports Trump, and how boosting voter turnout by a few percentage points could potentially gain Trump thousands of more votes to secure his victory in November. \n\n“We are focused primarily on low propensity self-identified evangelical voters, modeled pro-life, social conservatives who have voted in one or fewer of the last three elections,” he said. \n\nFrom the Faith & Freedom Coalition’s estimation, between 25 percent and 27 percent of electorate are self-identified Evangelical conservative Christians, while devout, mass-attending Catholic comprise another 10 percent to 11 percent, Reed said.\n\n“So you’re talking about 37 percent to 38 percent of the electorate. It’s bigger than the Hispanic vote, the African American vote, and the union vote combined,” he said. \n\n“Today, as you and I talk, Donald Trump is already winning 82 percent of that Evangelical vote. I think he’s on his way…to matching his 2020 margin, which was 84 percent, and I think there’s a chance he could go higher,” he continued. \n\n“Then you turn to the Roman Catholic vote, which is going to be so critical, particularly in the upper Midwest states like Pennsylvania, Wisconsin, Michigan. He’s already winning the Catholic vote today, 52 to 47 percent,” he said, citing Pew Research data which he noted was taken before Vice President Kamala Harris became the first nominee for president since the 1980s to decline attending the Al Smith Dinner. \n\nThe organization’s after-action analysis in 2022 and 2024 primaries astoundingly revealed that if these low-propensity voters of faith are visited with at least two door-knocks, backed with vote checks and phone calls, the turnout among them can increase between 5 and 11 percent, Reed said.\n\n“No poll is going to pick that up when those people come and they come in bigger numbers than they did in 2020 or in 2016,” he said. “It’s going to be a big surprise to a lot of people, including all of these media pollsters.”\n\nBoyle pointed out that increasing voter turnout by those percentages in swing states like Pennsylvania, Michigan, or Wisconsin, could mean “possibly tens of thousands, hundreds of thousands” more votes for Trump than in previous elections. \n\n“It’s definitely a game changer,” Reed replied:\n\nSo let’s just take an example. Let’s take the state of Georgia where we have 1.9 million modeled social conservative voters, and 535,000 of them are low propensity voters. Now look, we can’t deliver a door knock to every one of them because some of them are in rural areas where it’s just not efficient. So let’s say we get 400,000 of them where we deliver two door knocks and we bump that turn out — let’s be conservative and say 5 percent. That’s 20,000 votes. If it goes up 10 percent, it’s 40,000 votes that [other pollsters] are not counting because they’re modeling these polls based on 2020 turnouts.”\n\n“I’m telling you, these people are coming and they’re coming in bigger numbers. I think the margin in the Catholic vote, which is gonna be critical in a state like Pennsylvania, Wisconsin, or Michigan, I think his margin is going to be bigger than it was against Hillary Clinton,” he said. \n\nReed opined that while Democrats “had to dump Biden,” Catholics who “held their nose and voted for Joe Biden because he was one of them” are “not going to do that for Kamala Harris.” \n\n“I think we’re also getting a pull, and that is the pull of these voters who are expressing, as all voters are by a margin of three to one, that they’re unhappy with the direction of the country — that they don’t like Biden’s policy,” he said. “[Harris] cannot disentangle herself from those policies and their deleterious effects on the American people, whether it’s the economy, inflation, all of this runaway spending, an open border with a humanitarian and national security and crime crisis, and wars on virtually every continent on the globe.” \n\nReed said he believes left-leaning media and Democrats are downplaying conservative ground game ahead of the election to distract from their long list of policy failures. \n\n“I think they’re up to their usual shenanigans — the same reason why they spent two weeks talking about childless cat ladies and three weeks talking about Haitian immigrants in Springfield,” he said.\n\n“I mean, let’s be honest, [the media are] joined at the hip with the Democratic Party and the left at this point. And it’s the same reason why Kamala Harris, Tim Walz, and all these Democratic Senate candidates only want to talk about two things: Project 2025 and abortion. Because they don’t want to talk about the issues that voters care about, which is the economy, inflation, crime, and the border.”\n\n“Those issues are losers for them,” he added. “They’re trying to change the subject. I just don’t think it’s going to work.”\n\nBreitbart News Saturday airs on SiriusXM Patriot 125 from 10:00 a.m. to 1:00 p.m. Eastern.","summary":"Reed broke down how boosting voter turnout by a few percentage points could potentially gain Trump thousands more votes.\n\n\nThe post Exclusive &#8212; Faith &#038; Freedom Coalition&#8217;s Ralph Reed: Galvanizing Evangelical, Catholic Swing-State Voters Could Deliver Trump Victory appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/10/07/exclusive-faith-freedom-coalitions-ralph-reed-galvanizing-evangelical-catholic-swing-state-voters-could-deliver-trump-victory/","image":"https://media.breitbart.com/media/2024/10/AP23164790420526-640x335.jpg","video":null,"publish_date":"2024-10-07 23:49:49","author":"Katherine Hamilton","authors":["Katherine Hamilton"],"language":"en","source_country":"US","sentiment":-0.293},{"id":258836784,"title":"Karine Jean-Pierre Dismisses Fox Reporter’s ‘Misinformation’","text":"White House Press Secretary Karine Jean-Pierre sparred with Fox News correspondent Peter Doocy during Monday’s daily briefing after he raised a question based on a false claim about hurricane relief that has been kicked around by Republicans in recent days.\n\n“President Biden is fond of saying, ‘Show me your budget and I will tell you what you value,’” Doocy said. “If he’s got money for people in Lebanon right now, without Congress having to come back [and approve it], what does it say about his values if there is not enough money for people in North Carolina?”\n\n“His values?” Jean-Pierre asked in disbelief.\n\n“That’s not misinformation,” Doocy quickly added, although nobody had claimed otherwise.\n\nThe funds flowing to Lebanon—$157 million pledged by the U.S. last week to help with humanitarian assistance—come from the State Department. \n\nDomestic disaster relief funding comes from a different agency entirely, the Federal Emergency Management Agency, which is part of the Homeland Security Department.\n\nJean-Pierre broke in as Doocy tried to keep going. “Wait. No, that is—Your whole premise of your question is misinformation, sir,” she said. \n\nThen, as Doocy tried to talk over her, she continued, “Yes, yes, it’s misinformation. I just mentioned to you that we provided more than $200 million to folks who are impacted in the area.”\n\nThe press secretary was referring to money in the Small Business Administration’s disaster loan program, which has been doled out to impacted residents of the six states ravaged by Hurricane Helene.\n\nThe SBA’s coffers are in danger of running dry in a matter of weeks, however, as President Joe Biden said in a letter to congressional leadership late Friday. He urged the chambers to reconvene from recess to replenish the agency’s emergency funding.\n\nCongress’ next session isn’t scheduled until after the November presidential election. An administration official familiar with the matter told CBS News that there was not enough money to tide the SBA over until that point.\n\nBack in the briefing room, Doocy brought up Biden’s letter, asking if it was “misinformation, would you agree?”\n\n“No, the way you’re asking me the question is misinformation,” Jean-Pierre retorted. “There is money we are allocating to the impacted areas. And there’s money there to help people who truly need it. There are survivors who need the funding.”\n\n“You can’t call a question you don’t like misinformation,” Doocy said. “That’s very unfair.”\n\n“I actually said we have the money available to help survivors of Hurricane Helene and Hurricane Milton,” Jean-Pierre replied. “Now, there’s going to be a shortfall, right? Because we don’t know how bad Hurricane Milton is going to be. So we’re going to need additional funding.”\n\n“That’s exactly what I just asked about,” Doocy whined. “And you said it was misinformation.”\n\n“No, what you’re asking me is why Congress needs to come back and do their job,” Jean-Pierre said, closing her binder. “That’s what Congress needs to do, and we’re going to continue to urge that. You may not want that. But that’s OK. That’s what this president wants, and that’s what this vice president wants.”\n\nShe then thanked the reporters in the room and left the podium.\n\nHouse Speaker Mike Johnson has said that he won’t call Congress back early to consider increasing disaster funding. “We wouldn’t even conceivably have the request ready before we get back in November,” he told The New York Times last week. “There’s no necessity for Congress to come back.”\n\nIn addition to outrage over funds earmarked for Lebanon, prominent Republicans, including former President Donald Trump, have circulated false claims that the federal government has diverted FEMA funds from hurricane victims to illegal immigrants in the U.S.\n\n“Kamala spent all her FEMA money, billions of dollars, on housing for illegal migrants, many of whom should not be in our country,” Trump blustered at a Michigan rally last week. “The Harris-Biden administration says they don’t have any money, they’ve spent it all on—they spent all of their money, they have almost no money—because they spent it all on illegal migrants.”\n\nJean-Pierre dismissed such allegations as “categorically false” on Friday. The grant funding issued by FEMA to states to handle immigration comes from its Shelter and Services Program, an entirely separate pot of money from the agency’s disaster relief funds.\n\nBut although FEMA is meeting its “immediate needs,” Homeland Security Secretary Alejandro Mayorkas warned on Thursday that it does not have the funding to make it through the rest of hurricane season, which is set to run until late November.\n\nHurricane Helene made landfall in Florida as a Category 4 storm a little over a week ago and has killed at least 215 people since. Milton is expected to hit the Gulf Coast late this Wednesday as a Category 5 hurricane.","summary":"Kevin Dietsch/Getty ImagesWhite House Press Secretary Karine Jean-Pierre sparred with Fox News correspondent Peter Doocy during Monday’s daily briefing after he raised a question based on a false claim about hurricane relief that has been kicked around by Republicans in recent days.\n\n“President Biden is fond of saying, ‘Show me your budget and I will tell you what you value,’” Doocy said. “If he’s got money for people in Lebanon right now, without Congress having to come back [and approve it], what does it say about his values if there is not enough money for people in North Carolina?”\n\n“His values?” Jean-Pierre asked in disbelief.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/karine-jean-pierre-clashes-with-fox-reporter-peter-doocy-over-federal-hurricane-response","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1576,w_2801,x_0,y_424/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1728342786/GettyImages-2177304074_ukhkuy","video":null,"publish_date":"2024-10-07 23:47:24","author":"Aj McDougall","authors":["Aj McDougall"],"language":"en","source_country":"US","sentiment":-0.295},{"id":258836528,"title":"Taylor Swift is back to watch Travis Kelce and the Chiefs with Eras Tour soon to resume - The Associated Press","text":"KANSAS CITY, Mo. (AP) — Taylor Swift was back at Arrowhead Stadium on Monday night to see her boyfriend, Travis Kelce, and the Kansas City Chiefs play the New Orleans Saints after the pop superstar had missed the team’s previous two games on the road.\n\nSwift is in the final days of a break from her record-setting Eras Tour, which resumes with the first of three shows Friday night at Hard Rock Stadium in Miami. The tour’s North American leg continues in New Orleans and Indianapolis before heading to Toronto and Vancouver in November and December. The final show is scheduled for Dec. 8.\n\nSwift also missed Kelce’s annual Kelce Car Jam over the weekend, a charity car show that raises money for his 87 and Running foundation, which helps underserved youth in the areas around Kansas City and Cleveland. There was still plenty of star power with Patrick Mahomes and his wife, Brittany, joining Kelce’s parents his brother, retired Eagles center Jason Kelce.\n\nSwift began her high-profile romance with Kelce last season, when he invited the “Anti-Hero” singer to watch him in a September matchup with the Bears. Since then, the two have spent plenty of time together, often with cameras following every move. \n\nSwift has stayed out of the spotlight the past couple of weeks, though. That after a particularly headline-grabbing week in which she endorsed Kamala Harris for president, took home seven trophies from the MTV Video Music Awards, and show up to see the Chiefs beat the visiting Cincinnati Bengals.\n\nSwift has become close friends with the Mahomes family over the past year. That created some controversy when the 14-time Grammy winner said she supported Harris over Donald Trump in the November election; Trump has referenced the quarterback’s wife after she had liked — and then unliked — an Instagram post by the Republican presidential nominee.\n\nPatrick Mahomes has declined to endorse anyone in the election, instead urging people to register to vote.\n\n“I don’t want my place and my platform to be used to endorse a candidate,” Mahomes said. “My place is to inform people to get registered to vote. It’s to inform people to do their own research and then make the best decision for them and their family.”\n\nAP NFL: https://apnews.com/hub/nfl","summary":"Taylor Swift is back to watch Travis Kelce and the Chiefs with Eras Tour soon to resume  The Associated Press","url":"https://apnews.com/article/chiefs-taylor-swift-travis-kelce-arrowhead-b386bd5deb5b6588f255d62068417cae","image":"https://dims.apnews.com/dims4/default/ae653d6/2147483647/strip/true/crop/5818x3273+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F5e%2F92c22d812dd241608e817cc44cf7%2Fc28b6a7ca6a9479fa06a59100cfd85a0","video":null,"publish_date":"2024-10-07 23:47:00","author":"Dave Skretta","authors":["Dave Skretta"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.467},{"id":258835742,"title":"Biden, Harris, Trump each commemorate anniversary of Oct. 7 attack on Israel","text":"Oct. 7 (UPI) -- President Joe Biden and Vice President Kamala Harris on Monday observed the one-year anniversary of the Oct. 7 terrorist attacks against Israel at separate events in Washington while former President Donald Trump marked the event in New York.\n\nThe president and first lady Jill Biden honored the victims of the surprise attack launched by the Palestinian militant group Hamas with a candle lighting ceremony in the Blue Room of the White House, accompanied by Rabbi Aaron Alexander of Adas Israel Congregation in Washington, D.C.\n\nAn estimated an 1,200 men, women, and children of all ages were slain in the cross-border Hamas strike, while more than 250 others taken hostage. Some 97 of the abductees are still believed to be in captivity a year later.\n\nThe attack prompted Israel's strongest response actions against its foes in decades, as the Israel Defense Forces launched airstrikes and a ground invasion of Gaza aimed at dismantling Hamas that continue to this day, resulting in 42,000 Palestinian deaths in the enclave.\n\nAt the White House, Alexander recited the El Malei Rachamim prayer, a traditional Jewish prayer often heard at funerals and on the anniversary of a death, conducing a brief service in Hebrew and English.\n\nThe president lit a yahrzeit candle in memory of the Jewish victims of Oct. 7, which was followed by a moment of silence.\n\nBiden didn't speak or take questions during the candle lighting ceremony but issued a statement earlier marking the occasion.\n\n\"On this day last year, the sun rose on what was supposed to be a joyous Jewish holiday. By sunset, October 7 had become the deadliest day for the Jewish people since the Holocaust,\" he said.\n\n\"Today marks one year of mourning for the more than 1,200 innocent people of all ages, including 46 Americans, massacred in southern Israel by the terrorist group Hamas. One year since Hamas committed horrific acts of sexual violence. One year since more than 250 innocents were taken hostage, including 12 Americans. One year for the survivors carrying wounds, seen and unseen, who will never be the same. And one year of a devastating war.\n\n\"On this solemn anniversary, let us bear witness to the unspeakable brutality of the October 7th attacks but also to the beauty of the lives that were stolen that day,\" he said.\n\nThe president also marked the solemn occasion by speaking with Israeli President Isaac Herzog in a phone conversation, during which he \"expressed his deepest condolences to the people of Israel and to the families of the 1,200 innocent people -- including 46 Americans -- massacred by the terrorist group Hamas on a day of unspeakable brutality,\" according to a White House readout.\n\nBiden also \"expressed deep sadness for the loss of innocent life in Gaza and the ongoing suffering of Palestinian civilians as a result of the war that Hamas unleashed.\"\n\nMeanwhile, Harris and second gentlemen Doug Emhoff commemorated Oct. 7 at the vice president's official residence on the grounds of the U.S. Naval Observatory, planting a tree and dedicating it to \"the 1,200 innocent souls, in an act of pure evil on October 7, 2023, who were massacred by Hamas terrorists.\"\n\n\"Forty-six of our fellow Americans were killed in this brutal terrorist attack, including a singer from Missouri who died shielding her son from bullets, an academic and peace activist who studied in Seattle and who was the grandson of Holocaust survivors, and a dancer from California who was killed alongside her fiancé while attending the Nova Music Festival,\" the vice president said.\n\nShe urged Americans to not \"lose faith\" as the they \"reflect on the horrors of October 7\" and promised \"to always ensure that Israel has what it needs to defend itself and that I will always work to ensure the safety and security of the Jewish people here and around the world.\"\n\nTrump marked Oct. 7 on Monday with a visit to Ohel Chabad Lubavitch in New York City, the resting place of \"the Rebbe,\" Rabbi Menachem Mendel Schneerson, leader of the Chabad-Lubavitch movement.\n\nThere, he placed a note praying for the release of the Gaza hostages near the Rebbe's grave and read from the Jewish book of Psalms while accompanied by the parents of American-Israeli hostage Idan Alexander.\n\nTrump was also accompanied by Rabbi Abba Refson, director of the visitor's center at the Ohel, and Rabbi Motti Seligson, a spokesman for the Chabad-Lubavitch movement.\n\nAuschwitz death camp survivor Jerry Wartski and two Jewish college students \"currently speaking out against antisemitism on campus\" were also present, the Chabad organization said.\n\nThe GOP nominee later took part in an event held by Jewish leaders in Doral, Fla.\n\nThe Oct. 7 anniversary, meanwhile, prompted protests and vigils in various locales across the United States, both supporting Israel's actions in Gaza and others denouncing the deaths of tens of thousands of Palestinian civilians during Israel's year-long Gaza campaign.\n\nA pro-Israel demonstration staged by the Christian Philos Project near the Washington Monument was attended by Trump's running mate, Sen. JD Vance, R-Ohio, who promised that if elected his administration would target the accreditation of universities deemed to be \"using federal money to harass Jewish students,\" the Washington Post reported.\n\nOn the National Mall in Washington, an empty Shabbat table was set up, displaying one chair and one place setting for each of the remaining hostages in Gaza as flags for each of the nationalities of the hostages flew beside them.\n\nIn New York, thousands of pro-Palestinian protesters marched through parts of the city to mark the first anniversary of the onset of the Israel-Hamas war. Social media video posted by the advocacy group Within Our Lifetime showed demonstrators waving Palestinian flags in Madison Square Park and in the city's Fashion District on Seventh Avenue.\n\nHowever, due to what the group called \"several violent threats from Zionists,\" the planned marches to Times Square and Columbus Circle were called off.","summary":"President Joe Biden, Vice President Kamala Harris and former President Donald Trump on Monday each observed the anniversary of the Oct. 7 terrorist attacks against Israel at separate events.","url":"https://www.upi.com/Top_News/US/2024/10/07/Biden-Harris-Trump-each-commemorate-anniversary-Oct-7-attack-Israel/8401728337028/","image":"https://cdnph.upi.com/ph/st/th/8401728337028/2024/upi/8da4fbbe4424b84607f443c1ad2d69f3/v1.2/Biden-Harris-Trump-each-commemorate-anniversary-of-Oct-7-attack-on-Israel.jpg","video":null,"publish_date":"2024-10-07 23:46:25","author":"Don Jacobson","authors":["Don Jacobson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.107},{"id":258836636,"title":"Harris, Trump mark 1 year since Hamas' Oct. 7 attack on Israel","text":"Harris, Trump mark 1 year since Hamas' Oct. 7 attack on Israel\n Monday marks one year since the deadliest massacre in Israel's history, when Hamas launched a surprise attack killing 1,200 people and taking more than 250 hostages. Vice President Kamala Harris marked Oct. 7 in Washington, D.C., by planting a memorial tree, while former President Donald Trump visited a Jewish holy site in New York. CBS News' Chris Livesay and Nancy Cordes have more.","summary":"Monday marks one year since the deadliest massacre in Israel's history, when Hamas launched a surprise attack killing 1,200 people and taking more than 250 hostages. Vice President Kamala Harris marked Oct. 7 in Washington, D.C., by planting a memorial tree, while former President Donald Trump visited a Jewish holy site in New York. CBS News' Chris Livesay and Nancy Cordes have more.","url":"https://www.cbsnews.com/video/harris-trump-mark-1-year-since-hamas-oct-7-attack-israel/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/cadf3d3f-be37-4dff-a186-3c01a6b97a4b/thumbnail/1200x630/3f87a2f450c16e2f501905f73f6a397f/cbsn-fusion-harris-trump-mark-1-year-since-hamas-oct-7-attack-israel-thumbnail.jpg?v=3a0e65dbe151135b3f2e1627f423","video":null,"publish_date":"2024-10-07 23:45:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.372},{"id":258835502,"title":"What a joke: Kamala Harris avoids substantive interviews in favor of a podcast known for sex revelations","text":"Kamala Harris’s team has realized that “brat” vibes and coconut emojis alone would not carry her over the finish line in November. \n\nAfter making avoiding interviews a cornerstone of her campaign, she is finally scheduled to make the rounds. To speak not with a teleprompter, but a real human. \n\nTo talk about substantive issues.\n\nShe’ll be tested on her nearly four years in the Biden White House, her record on the border and how she plans to bring down the cost of living.\n\nHarris is gearing up for a softball tour, visiting the right-hating ladies of “The View,” Stephen “dancing vaccine needle” Colbert and Howard Stern: all people ready to throw her a parade because she’s not the bad orange man.\n\nOn Sunday, she was on Alex Cooper’s “Call Her Daddy” podcast, which is a home for celebrities to talk about copulation in such a tawdry way that it would make Samantha Jones blush. It’s where Katy Perry boasted of rewarding her fiance Orlando Bloom with oral sex if he’s done housework and Brazilian pop star Anitta and comedian Heather McMahan shared their fellatio tips. Christina Aguilera once referred to herself as a “promoter of the swallow” on the show.\n\nNot exactly an incisive political forum.\n\nBut it is a safe spot for Harris — who has been showered with soft-focus media features and fawning takes on her cooking and clothing — to once again be treated like a glittering celebrity.\n\nI’ve seen many Republicans dismiss the podcast, saying they’ve never heard of it. It’s dishonest to claim Cooper’s audience isn’t passionate, engaged or massive; “Call Her Daddy” was the fourth most listened-to podcast in the country in the second quarter of this year, according to Edison Research.\n\nBut how does that move the needle for Harris, who was preaching to her choir of Gen Z woman? (Although even they didn’t want it. Some listeners immediately took to social media to voice displeasure at having politics creep into their escapist space.)\n\nYesterday on “Meet the Press,” Andrea Mitchell said Harris needed to do tougher interviews, expose herself to harsher elements. “She’s got such a big problem with men … big problem. But also the business world, they don’t think she’s serious. They don’t think she’s a heavyweight.”\n\nSo naturally, the veep went on “Call Her Daddy” — “to talk about the things that people really care about,” she said. \n\nFor a show that deals in lurid revelations, it was relatively boring and Harris played the old hits: her empty platitudes about possibility and ambition — as if the American people think of ourselves as do-nothing slobs in the absence of her affirmation.\n\nAbortion took up a large part of the conversation. Cooper repeated fear-mongering lies about Georgia woman Amber Thurman’s tragic death from a septic infection, saying the 28-year-old died because doctors in the state were hesitant to treat her due to a six-week abortion ban, as Harris nodded along. (Thurman’s family blames the doctors, not the law.) Cooper then asked Harris if there is “any law that gives the government the power to make a decision about a man’s body.”\n\nHarris giggled. “No. No. No. No. No. It’s, no.”\n\nPerhaps a producer should have chimed in, “Hey, what about the military draft?” \n\nThe vice-president also spoke of her advocacy for victims of sexual assault and domestic violence: “So the point being that abuse of anyone is something we should all take seriously as opposed to saying, it’s none of our business.”\n\nExcept, that is, if her own husband, Doug Emhoff, has been accused of slapping an ex-girlfriend in 2012, knocking up his kid’s nanny and allegedly paying her $80,000. (A spokesperson for Emhoff said of the slap allegation, “The report is untrue.”)\n\nThe one bright spot was a response to Sarah Huckabee Sanders stupidly mocking Harris because she doesn’t have biological children. Harris defended the value of being a step-parent. It was humanizing, but did little to convince me that she could be commander-in-chief as the world is on fire.\n\nThe media landscape has experienced a seismic change even since the 2020 race — and a wise candidate will sit with a variety of legacy and independent media outlets. Podcasters and influencers.\n\nThey’re excellent vehicles to have a free-ranging chat with nuance. And it doesn’t always have to be combative. \n\nBut it should be led by someone with expertise. In her intro, Cooper says she doesn’t get involved in politics and doesn’t interview politicians, which was clearly a draw for team Harris. No pressure. No deep knowledge of the issues. No pushback.\n\nIt was a venue for Harris to treat women like one-dimensional creatures sated by pro-abortion rhetoric — an insult to our intelligence. \n\nBut the Harris strategy is to create an illusion that she’s digging in. And all of these friendly, airy chats provide cover and drown out her lack of depth. We need her on more shows like “60 Minutes,” where Bill Whitaker pressed the VP on her economic plan, saying what we’re all thinking:\n\n“But we’re dealing with the real world here.”","summary":"\"Call Her Daddy\" was a safe spot for Harris — who has been showered with soft-focus media features and fawning takes on her cooking and clothing — to once again be treated like a glittering celebrity.","url":"https://nypost.com/2024/10/07/opinion/kamala-harris-avoids-substance-in-favor-of-call-her-daddy/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/screenshot_2024-10-07_at_5.37.17___pm_720.png?w=720","video":null,"publish_date":"2024-10-07 23:44:51","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","source_country":"us","sentiment":0.01},{"id":258837302,"title":"Harris calls Trump 'incredibly irresponsible' for spreading misinformation about Helene response - The Associated Press","text":"WASHINGTON (AP) — Vice President Kamala Harris on Monday called former President Donald Trump “incredibly irresponsible” for spreading falsehoods about the federal response to Hurricane Helene ‘s destruction, offering especially sharp words as a new storm bears down on Florida with just weeks until Election Day. \n\n“There’s a lot of mis- and disinformation being pushed out there by the former president about what is available, particularly to the survivors of Helene,” Harris told reporters before boarding Air Force Two to fly to New York. “It’s extraordinarily irresponsible. It’s about him. It’s not about you.”\n\nHelene has killed more than 220 people in six states, and Category 5 Hurricane Milton is on a path toward Florida’s Gulf Coast. \n\nTrump has made a series of false claims in the wake of Helene, including saying incorrectly that the federal government is intentionally withholding aid to Republican disaster victims. He also falsely claimed the Federal Emergency Management Agency had run out of money because all of it had gone to programs for immigrants in the country illegally. \n\nHarris said “the reality is that FEMA has so many resources that are available to folks who desperately need them now, and resources that are about helping people get back on their feet and rebuild and have places to go.”\n\n“People are entitled to these resources, and it is critically important that people apply for the help that is there to support,” the vice president added. “All those resources were created for just these types of moments, in an emergency situation, knowing that folks are entitled to have the relief that they so rightly need.”\n\nTrump also said during a visit Valdosta, Georgia, last week that President Joe Biden was “sleeping” and not responding to calls from Georgia Gov. Brian Kemp. Biden had, in fact, spoken with Kemp and said of Trump, “He’s lying, and the governor told him he was lying.” \n\nHarris also criticized another high-profile Republican, Florida Gov. Ron DeSantis, suggesting he’s “playing political games” and engaging in “political gamesmanship” in Helene’s wake. \n\nHarris office says the vice president reached out to DeSantis last week in the storm’s aftermath. DeSantis said Monday that he “didn’t know that she had called” and “they didn’t call me.”\n\n“It wasn’t anything anybody in my office did in saying that it was political,” DeSantis said. \n\nBut Harris, asked about DeSantis, said “people are in desperate need of support right now and playing political games at this moment in these crisis situations … is utterly irresponsible.”\n\n“It is selfish and it is about political gamesmanship instead of doing the job that you took an oath to do, which is to put the people first,” Harris said without naming DeSantis. \n\nWhite House press secretary Karine Jean-Pierre, at her briefing with reporters Monday, noted that DeSantis was invited to tour Helene damage in Florida with Biden but didn’t join him. \n\n“If you have the president, and you have the vice president, reaching out to offer up assistance — providing to your constituents, the people who live in your state, to make sure we are doing everything that we need to do from the federal response,” Jean-Pierre said. “It’s up to the governor, it’s up to him if he wants to respond to us or not.”","summary":"Harris calls Trump 'incredibly irresponsible' for spreading misinformation about Helene response  The Associated Press","url":"https://apnews.com/article/trump-harris-hurricane-helene-misinformation-552e413dfb6c1b3e37eca0d2114668ea","image":"https://dims.apnews.com/dims4/default/d89e4aa/2147483647/strip/true/crop/6739x3791+0+353/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Fb0%2F4e683ff6da44060ba1420b326452%2F99bf1ca386eb4001bb4e89e902ba5547","video":null,"publish_date":"2024-10-07 23:42:00","author":"Will Weissert","authors":["Will Weissert"],"language":"en","source_country":"us","sentiment":-0.292},{"id":258837622,"title":"The more the fighting spreads in the Middle East, the fewer the thoughts of peace","text":"After weeks of stunning tactical success, Israel’s prime minister seems to harbour grand ambitions.\n\nIn a direct address to the Iranian people, he hinted that regime change was coming in Tehran. “When Iran is finally free, and that moment will come a lot sooner than people think, everything will be different,” he said.\n\nFor some observers, his rhetoric carried uncomfortable echoes of the case made by American neoconservatives in the run up to the US-led invasion of Iraq in 2003.\n\nBut for all the danger of the moment, fragile guardrails do still exist.\n\nThe Iranian regime may dream of a world without Israel, but it knows that it’s far too weak to take on the region’s only superpower, especially at a time when Hezbollah and Hamas - its allies and proxies in the so-called “axis of resistance” - are being crushed.\n\nAnd Israel, which would dearly like to get rid of the threat posed by Iran, also knows that it cannot do this alone, despite its recent successes.\n\nRegime change is not on Joe Biden’s agenda, nor that of his vice president, Kamala Harris.\n\nAs for Donald Trump, the one time he seemed poised to attack Iran - after Tehran shot down a US surveillance drone in June 2019 - the former president backed down at the last moment (although he did order the assassination of a top Iranian general, Qasem Soleimani, seven months later).\n\nFew would have imagined, a year ago, that the Middle East was heading for its most perilous moment in decades.\n\nBut looked at through that same juggernaut’s rear view mirror, the past 12 months seem to have followed a terrible logic.\n\nWith so much wreckage now strewn all across the road, and events still unfolding at an alarming pace, policy makers - and the rest of us - are struggling to keep up.\n\nAs the conflict that erupted in Gaza grinds on into a second year, all talk of the “day after” – how Gaza will be rehabilitated and governed when the fighting finally ends – has ceased, or been drowned out by the din of a wider war.\n\nSo too has any meaningful discussion of a resolution of Israel’s conflict with the Palestinians, the conflict which got us here in the first place.\n\nAt some point, when Israel feels it has done enough damage to Hamas and Hezbollah, Israel and Iran have both had their say - assuming this doesn’t plunge the region into an even deeper crisis - and the US presidential election is over, diplomacy may get another chance.\n\nBut right now, that all feels a very long way off.","summary":"Talk of how the Israel-Palestine conflict could be resolved has been drowned out amid the increased fighting.","url":"https://www.bbc.com/news/articles/c2ek1ejj11ko","image":"https://ichef.bbci.co.uk/news/1024/branded_news/a4f8/live/fac3f6c0-84d2-11ef-83dd-fbf1b9732cf0.png","video":null,"publish_date":"2024-10-07 23:41:31","author":"Paul Adams","authors":["Paul Adams"],"language":"en","source_country":"gb","sentiment":-0.252},{"id":258835760,"title":"Elon Musk tells Tucker Carslon he's f***ed if Trump loses election: 'How long do you think my prison sentence is going to be?'","text":"Elon Musk told Tucker Carlson that if Kamala Harris wins the election, 'I'm f***ed' and predicts the vice president will send him to prison.\n\nThe Tesla CEO, 50, sat down with the ex-Fox News host for a 90-minute interview on the Musk-owned social media app X. \n\nThe chat began with Carlson wondering what would happen to Musk if Trump loses, with both beginning to cackle. \n\n'If Trump loses, you're f***ed, dude,' Carlson said, with Elon laughing along and agreeing. \n\n'If he loses, I'm f***ed,' he affirmed. 'How long do you think my prison sentence is going to be? Will I see my children? I don't know.'\n\nMusk and Carlson both said that if Harris beats Trump in November, it will be the last election.\n\nHowever, Musk confirmed that he will continue to support the former president even if he loses.\n\nBoth joked that Harris and Joe Biden are figureheads for a movement rather than substantial politicians.\n\n'Kamala is gonna say whatever the teleprompter is gonna say,' Musk claimed.\n\nHe also told Carlson of his concerns that religion has been replaced in society with the 'woke mind virus.'\n\nThe interview comes on the back of Musk's appearance at a Trump rally on Saturday in Pennsylvania.\n\nMusk jumped wildly with his fists in air as he joined Donald Trump on stage for the first time.\n\nThe dramatic appearance by the Tesla and SpaceX boss came as Trump returned to the Butler Farm Show grounds in Pennsylvania, where he survived an attempted assassination three months ago.\n\nAfter leaping up and down, Musk told the huge crowd: 'America is the home of the brave and the true test of someone’s character is how they behave under fire.\n\n'We had one president who couldn’t climb a flight of stairs and another who was fist-pumping after getting shot! FIGHT, FIGHT, FIGHT!'\n\nMusk, wearing a black baseball hat, urged supporters to vote, and register to vote, and to get others to 'vote right now'.\n\n'I'm being repetitive for a reason,' he said. 'Honestly you want to be a pest. Fight, fight, fight! Vote, vote, vote!'\n\nMusk's appearance at Trump's rally in Butler was the first time he has taken the stage at a political rally. \n\nThe billionaire was inspired to endorse Trump publicly after the failed assassination attempt of the former president at Butler on July 13. \n\nAs the two men were on stage Trump praised Musk for donating Starlink systems to victims of hurricane Helene, joking he did not understand what the space satellite internet system was.\n\n'I didn't know what the hell Starlink was,' Trump admitted.\n\nThe crowds shouted 'Elon! Elon! Elon!' In response","summary":"Elon Musk told Tucker Carlson that if Kamala Harris wins the election, 'I'm f***ed' and predicts the vice president will send him to prison.","url":"https://www.dailymail.co.uk/news/article-13934743/Elon-Musk-tells-Tucker-Carslon-hes-f-ed-Trump-loses-election-long-think-prison-sentence-going-be.html","image":"https://i.dailymail.co.uk/1s/2024/10/08/00/90570167-0-image-a-12_1728342700292.jpg","video":null,"publish_date":"2024-10-07 23:34:55","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.307},{"id":258834744,"title":"Lawmakers mark one year since Oct. 7 terrorist attack on Israel, issue calls for peace","text":"It’s been a full year since Hamas-backed terrorists stormed into Israel and slaughtered more than 1,200 civilians before taking hundreds more hostage, and politicians of all stripes used the day to call for the release of those still held captive and an end to the ongoing violence.\n\nPresident Joe Biden issued a statement of support for Israel to mark the anniversary of an atrocity which “brought to the surface painful memories left by millennia of hatred and violence against the Jewish people.”\n\n“On this solemn anniversary, let us bear witness to the unspeakable brutality of the October 7th attacks but also to the beauty of the lives that were stolen that day,” Biden said.\n\nThe President also pointed to Gaza, where Hamas has ruled for nearly two decades, and where Israel’s swift and violent response to the horror visited on them on October 7 has led to tens of thousands of civilian deaths.\n\n“I believe that history will also remember October 7th as a dark day for the Palestinian people because of the conflict that Hamas unleashed that day,” Biden said.\n\nVice President Kamala Harris said in a statement that a Harris Administration would stand firm with Israel, adding she is “heartbroken over the scale of death and destruction in Gaza over the past year.”\n\n“It is past time for a hostage and ceasefire deal to end the suffering of those innocent people,” Harris said.\n\nFormer President Donald Trump’s campaign declared that a second Trump term could have prevented the attack and that the Biden Administration’s response has not helped.\n\n“The Biden-Harris Administration continues to criticize Israel’s defense efforts, appease Hamas’ puppet master — Iran, and pander to Hamas’ sympathizers and anti-Semites,” the campaign wrote.\n\nThe Bay State’s senior senator, U.S. Sen. Elizabeth Warren, said via the social media platform formerly known as Twitter that Israeli Prime Minister Benjamin Netanyahu “has unleashed unthinkable violence on innocent civilians in Gaza.”\n\n“We urgently need a ceasefire, release of the hostages, massive humanitarian relief in Gaza, and diplomatic efforts towards a two-state solution,” she wrote.\n\nU.S. Rep. Katherine Clark, the House Minority Whip, said in a statement that Israel’s “right to defeat Hamas” has nevertheless “caused unfathomable devastation” in Gaza.\n\n“We need a lasting ceasefire in the region. That is the only path to security for both the Israeli and Palestinian people,” she said.\n\nMassachusetts Gov. Maura Healey ordered flags at government buildings flown at half staff to mark a year since Hamas launched their “horrific, indefensible attack.”\n\n“Since that day, terror, grief and trauma have continued to reverberate throughout the Jewish community, coupled with a rise in antisemitism and hate both here in Massachusetts and across the globe,” she said.","summary":"“I believe that history will also remember October 7th as a dark day for the Palestinian people because of the conflict that Hamas unleashed that day,” Biden said.","url":"https://www.bostonherald.com/2024/10/07/lawmakers-mark-one-year-since-oct-7-terrorist-attack-on-israel-issue-calls-for-peace/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/AP24281691011041.jpg?w=1024","video":null,"publish_date":"2024-10-07 23:32:57","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","category":"politics","source_country":"US","sentiment":-0.151},{"id":258834866,"title":"Democrats tout Harris endorsement from Hispanic radio host who went on racist rant about black tourists in Puerto Rico","text":"BETHLEHEM, Pa. — A recent mailer from the Pennsylvania Democratic Party features a Kamala Harris endorsement from a local Hispanic radio host who has a history of making wildly racist comments.\n\nThe host is also the star of a Harris campaign ad running in Philadelphia, Allentown and Reading. \n\nThe mailer shows Victor Martinez, owner of La Mega radio in the majority-Latino city of Allentown, offering his support for Harris as a candidate who “listens.”\n\nBut Martinez’s own listeners will remember his May 2021 on-air tirade about black tourists visiting Puerto Rico.\n\nSpeaking in Spanish to his audience on the El Relajo de la Mañana morning show, Martinez claimed a “wave of African Americans” had descended on the island.\n\n“When I got [on] the plane, I thought I was flying to Jamaica,” Martinez said, suggesting the tourists also must have thought they were going to Jamaica or New Orleans. “The plane was full of African [Americans]!”\n\nMartinez’s rant — which reached thousands in Pennsylvania’s Latino belt of Allentown, Reading and Hazleton — decried female tourists for “acting up” in various ways.\n\nAccording to Martinez, the women’s behavior included: “walking almost naked,” “fighting with police,” “jumping [on] the roof of cars,” “destroying the [hotel] rooms” and smoking marijuana and drinking Hennessy in the street.\n\n“[It] is not like is a cheap vacation for them,” he continued. “Then they buy the Hennessy, put it in their purse, and in the street they start drinking.”\n\n“They rent a car with a sunroof, and three or four of them out the sunroof that don’t even fit,” Martinez added.\n\nThe conversation took a darker turn when Martinez’s co-host, Luis “Diamond Boy” Torres, implied black tourists are apes.\n\n“We should be thanking them since the last monkey we had was Yuyo,” Torres responded to Martinez’s sunroof comments — prompting both men to laugh loudly. (Yuyo was a chimpanzee, not a monkey, who escaped from a Puerto Rico zoo in the 1980s, becoming a folk hero and even garnering election write-in votes.)\n\nWhen Torres suggested the women engaging in unruly behavior were “not pretty to look at,” Martinez responded creepily: “If they looked good, I would [have] recorded them.”\n\nTorres proceeded to mock the tourists’ supposed support for the Black Lives Matter movement, leading to more boisterous laughter.\n\n“I think they started a new protest called Black Ass Matters,” Torres quipped.\n\nAs he notes in the mailer, Martinez has interviewed many Democratic candidates — including Tim Walz during the vice-presidential nominee’s trip to eastern Pennsylvania last month.\n\nDuring their interview, Walz slammed the Trump administration’s response to Hurricane Maria in 2017 — arguing the former prez didn’t “even recognize” Puerto Ricans are actually American citizens.\n\nMartinez also interviewed Rep. Susan Wild — a vulnerable House Democrat from the area with a history of controversies — on his show last month.","summary":"BETHLEHEM, Pa. — A recent mailer from the Pennsylvania Democratic Party features a Kamala Harris endorsement from a local Hispanic radio host who has a history of making wildly racist comments. The host is also the star of a Harris campaign ad running in Philadelphia, Allentown and Reading. La Mega radio host and owner Martinez...","url":"https://nypost.com/2024/10/07/us-news/democrats-tout-kamala-harris-endorsement-from-hispanic-radio-host-who-went-on-racist-rant-about-black-tourists-in-puerto-rico/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/2024-recently-something-national-figure-91196412_227ef8.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/w1FbLZlq-RyIcpnTz.mp4","publish_date":"2024-10-07 23:32:57","author":"Carson Swick","authors":["Carson Swick"],"language":"en","source_country":"us","sentiment":-0.087},{"id":258834588,"title":"Kamala Harris’ mystery media ‘blitz’: Who’s she trying to win over?","text":"As Vice President Kamala Harris enters the last month of the 2024 race for the White House, she’s proving she either won’t or can’t reach out to any persuadable voters. \n\nIn her Monday night CBS interview, it looked like “can’t”: Bill Whittaker asks a series of perfectly reasonable questions, and she delivered gibberish.\n\nIs Israel’s Benjamin Netanyahu just ignoring the White House? Harris offered a convoluted statement on “our advocacy” that brought some results she and President Biden wanted, without naming one.\n\nHow’s she going to pay for her spending plans? Tax the rich, she says; Whittaker retorts: “In the real world,” how will she get that through Congress? “Firefighters and teachers and nurses” will demand it! \n\nWhittaker didn’t look convinced, and it’s hard to imagine who would be.\n\nAnd that interview at least aimed at a general audience; what swing voter does she expect to reach with softball interviews on popular sex podcast “Call Her Daddy,” has-been Howard Stern’s radio show or Stephen Colbert and “The View”?\n\nThe “Call Her Daddy” audience is almost entirely young women — a demographic Democrats have been crushing it with for years. And even then, some listeners felt insulted by the “propaganda.”\n\nFine, she got to talk more about abortion, but she sure should have those voters already. \n\nIt’s also hard to see how she’ll gain any more among the rich white dudes (average household income $160,000!) who still listen to Stern. \n\nAnd anyone tuning into “The View” or Colbert these days is already on her side: Is she just trying to get them to actually bother showing up to vote?\n\nHarris needs to win undecideds in the Sun Belt and Blue Wall swing states, but nothing she says even seems intended to convince them. \n\nThey want some sign of a difference from the Biden-Harris years: How will she help families get back what they lost to Bidenflation? Why won’t her megaspending plans bring Kamalaflation? \n\nWhat will she do to stop the millions jumping the border? \n\nDemocrats won’t win by simply insisting they care about the little guys they’ve punished for the past four years; they need to show a new vision — but whenever Harris talks, she struggles to show any vision at all. \n\nGoing through the motions is a bizarre strategy in the final weeks of an election — but maybe it’s the best Kamala Harris can do.","summary":"From \"Call Her Daddy\" to \"The View,\" Kamala Harris is getting the message out to liberal voters and ignoring the people her terrible policies have hurt.","url":"https://nypost.com/2024/10/07/opinion/kamala-harris-media-blitz-proves-she-doesnt-give-a-damn-about-average-americans/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-x9291hpo0-1728341401955.jpg?quality=75&strip=all&1728327023&w=1200","video":"https://cdn.jwplayer.com/videos/8OIPtgIL-RyIcpnTz.mp4","publish_date":"2024-10-07 23:29:18","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.205},{"id":258834570,"title":"US intelligence still sees no attempts to meddle with US election from abroad","text":"WASHINGTON, October 8. /TASS/. So far, the US intelligence has registered no attempts by foreign players to interfere into the upcoming November 5 presidential election in the United States, a spokesperson for the US Office of the Director of National Intelligence said at a briefing for foreign journalists.\n\n\"As far as the safety of voting systems and procedures, what I would say there is we have not seen foreign efforts to date to attack the integrity of voting systems. A lot of the activity we're seeing so far is influence influence operations, or information operations,\" the spokesperson said.\n\nA similar statement was made by a spokesperson for the US Office of the Director of National Intelligence in early September.\n\nThe United States presidential election will be held on November 5. Incumbent US President Joe Biden was expected to run on the Democratic Party ticket, but after his disastrous performance at the June debate with former US President Trump, he decided to quit the race and instead supported the nomination of his Vice President Kamala Harris. Her candidacy was later formally endorsed at the Democratic National Convention.","summary":"A similar statement was made by a spokesperson for the US Office of the Director of National Intelligence in early September","url":"https://tass.com/world/1853275","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2024-10-07 23:28:30","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.026},{"id":258834108,"title":"Israel-Hezbollah conflict live updates","text":"More than a hundred aircraft were involved in the strikes, according to the Israeli Defence Forces (IDF).\n\n“These targets belonged to various units of the Hezbollah terrorist organisation, including regional units of Hezbollah’s southern front, the Radwan Forces, the Missiles and Rockets Force, and the Intelligence Directorate,” the IDF said.\n\n“This operation follows a series of strikes aimed at degrading Hezbollah’s command, control, and firing capabilities, as well as assisting ground forces in achieving their goals.”\n\nEarlier on Monday, local time, Israeli Prime Minister Benjamin Netanyahu marked the anniversary of last year’s October 7 attack by Hamas by vowing that his country would “continue to fight”.\n\n“As long as there are kidnapped in Gaza, we will continue to fight. We will not give up any of them. I will not give up,” said Mr Netanyahu.\n\n“As long as our citizens do not return to their homes safely, we will continue to fight.”\n\nMore than 1200 Israelis were murdered in the October 7 attack, most of them civilians, and hundreds more were kidnapped.\n\nAccording to the health ministry in Hamas-run Gaza, about 42,000 people have been killed in Israel’s retaliatory strikes over the past year.\n\nRead on for the latest updates from the conflict in the Middle East\n\n‘A nightmare’: Agony of hostage’s mother\n\nThe mother of Romi Gonen, one of the Israeli hostages who still remains in Gaza, has spoken to CNN about her year of torment.\n\nRomi, who’s now 24 years old, was one of the people kidnapped from the Nova music festival during the Hamas attack on October 7.\n\n“I cannot even explain how you feel when you wake up in the morning, and for the first moments you hope this is only a nightmare, a dream, a bad dream. But then you are waking up to a reality,” Meirav Gonen told CNN.\n\n“This is so agonizing, it’s so difficult.”\n\nMs Gonen revealed that some other hostages who were with her daughter in Gaza have since been returned to Israel.\n\n“They came back with stories. Funny stories, and some disturbing also stories. She’s holding up. She was saying she’s holding up for me. And I want her to see me and I want her to see that I’m strong. I’m strong for her. I’m strong for her brothers and sisters,” she said.\n\nRomi’s hand was injured by a gunshot during the attack.\n\n“The color in her fingers was changing, her hand is not functioning,” Ms Gonen said.\n\n“Today I’m saying, it doesn’t matter if she lost her hand. We just have to bring her back alive.”\n\nUnited States condemns ‘unspeakable brutality’\n\nIn the United States, President Joe Biden, Vice President Kamala Harris and Republican presidential nominee Donald Trump have all marked the anniversary of October 7.\n\nIn a solemn Jewish ceremony of mourning at the White House, Mr Biden lit a candle while a rabbi chanted a prayer for the victims. Ms Harris, the Democratic Party’s nominee, planted a memorial tree at her residence in Washington. Meanwhile Mr Trump met Jewish leaders at a sacred gravesite in New York.\n\n“Far too many civilians have suffered far too much during this year of conflict,” Mr Biden said in a statement.\n\nThe President lashed out at the “unspeakable brutality” of the Hamas attacks and said he and Ms Harris were “fully committed” to Israel’s security against Iran and its regional allies.\n\nBut he also described October 7 as a “dark day for the Palestinian people”, and said he and Ms Harris “will not stop working to achieve a ceasefire deal in Gaza.”\n\nThe Vice President told reporters that a Gaza ceasefire deal was the best hope to “bring any type of stability to the region”.\n\n“We’re not giving up. We’re doing everything we can possibly do to get the ceasefire hostage deal done,” she said.\n\nMr Trump’s campaign issued a statement saying: “It’s imperative that President Trump is re-elected so he can end the bloodshed.”\n\nMore strikes in suburbs of Beirut\n\nSmoke can still be seen rising above the suburbs of the Lebanese capital, Beirut, as Israel continues to strike against Hezbollah targets.\n\nLebanese state media said late on Monday that a pair of strikes from “enemy war planes” had hit the city’s southern suburbs.\n\nThe IDF had given residents warning to clear the area ahead of time.\n\nThose strikes followed the earlier flurry involving a hundred aircraft, which bombarded 120 different targets across southern Lebanon.\n\nIsrael warned against hitting airport\n\nThe United States has warned Israel not to attack Beirut’s airport or the roads leading to it.\n\n“We think it’s very important that not only the airport be open, but that the roads to the airport be open, so that American citizens who want to leave can get out, but also citizens of other countries,” said Matthew Miller a spokesman for the US State Department.\n\nFor the past week, the United States has been chartering near-daily flights to get its citizens and their families out of the country as the conflict between Israel and Iran-backed Lebanese terror group Hezbollah escalates.\n\nSome 900 people have taken the flights so far, Miller said, though he added that none of them were fully booked.\n\nThe US is also reserving seats on commercial flights that continue to operate. Some 8500 Americans have contacted the State Department to inquire about departure conditions, but this does not mean they all wish to leave, he added.\n\nThe spokesman refused to comment on Israeli strikes in Lebanon – Beirut in particular – and whether or not they respected international law.\n\n“I don’t have a characterisation of them one way or the other,” he said.\n\n“But of course, we expect them to target Hezbollah in a way that complies with international humanitarian law and minimises civilian casualties.”\n\nMr Miller stressed that, while the US supports Israel in its fight against Hezbollah, “we are very cognisant of the many times in the past where Israel has gone in on what looked like limited operations and has stayed for months or for years”.\n\n“Ultimately, that is not the outcome that we want to see.”","summary":"Israel has launched a new flurry of air strikes across southern Lebanon, targeting approximately 120 different sites within a single hour.","url":"https://www.news.com.au/world/middle-east/israelhezbollah-conflict-live-updates-israelis-mark-anniversary-of-october-7-hamas-attack/news-story/0ddfe3e4b7befbb29521f73af43675c0?from=rss-basic","image":"https://content.api.news/v3/images/bin/7e99a53b7a85f48baa447484c7c22ef3","video":null,"publish_date":"2024-10-07 23:22:36","author":"Samuel Clench","authors":["Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.353},{"id":258835492,"title":"North Carolina families mourn loved ones by burying them in yards amid criticism towards FEMA for hurricane ‘concealment’","text":"Grieving families in North Carolina have been forced to bury their dead in their backyards – and are accusing authorities of downplaying the damage caused by Hurricane Helene.\n\nThe official death toll rose to 227 over the weekend – half of whom were from North Carolina – but state and federal officials told The Spectator that this number is woefully inaccurate. \n\nMany bodies haven’t even been recovered amid debris and flooding. There are also piles of deceased people who have yet to be identified. They are being transported all over the state in hopes of finding open morgue space.\n\n‘According to folks on the ground – fire, medical, law enforcement officials – they’re way underreporting the numbers. All the morgues are full and they’ve hauled a ton [of bodies] to Greensboro,’ the state official said. ‘People are starting to bury them in their yards because they have no place to put them.’\n\nOne individual who was in Asheville when Helene hit told The Spectator: ‘It’s so much worse than they’re saying…I think there’s a massive cover-up.’\n\nThe destruction from Helene, and the immense multi-state death toll, comes just days before Category 5 Hurricane Milton is set to barrel into Florida’s coastline. \n\nHelene made landfall in the Big Bend region of Florida at night on September 26 before laying waste to Georgia and the Carolinas with record storm surges and tornados.\n\nNorth Carolina alone had six confirmed tornados on the morning of September 27, two days before 500 members of state’s national guard were deployed to help with rescue efforts.\n\nLocals say they are ‘pissed’ at General Major Todd Hunt, director of the North Carolina National Guard, for waiting a whole 48 hours to get boots on the ground.\n\nThere were 5,500 national guardsmen deployed around this time, some of them from other states such as Florida. \n\n‘That’s why you saw the Florida National Guard and other units out there – and why private citizens stepped in, even as state and federal officials tried to shut down their efforts,’ an anonymous source familiar with the situation in North Carolina told The Spectator.\n\nBefore North Carolina national guardsmen were deployed, a four-year-old girl was killed in a car crash in Claremont, a town around 40 miles north of Charlotte.\n\nAnother person died after a tree fell on their Charlotte home.\n\nIn North Carolina’s Buncombe County, 40 people have died, the county manager has stated. \n\nAsheville, a popular tourist destination in Buncombe County, was one of the hardest hit towns, where scenes of complete devastation are all too common.\n\nThe small mountain town of Swannanoa dealt with flood levels not seen since 1791, and locals have said their community was ‘entirely erased.’\n\nThis comes days after a whistleblower wrote a letter to Rep. Matt Gaetz, R-Fla., that details how the Federal Emergency Management Agency (FEMA) has wasted and misappropriated funds in the wake of Helene and is now ‘exacerbating the emergency.’\n\nThe letter to Gaetz also alleges ‘hundreds if not thousands’ of first responders and service members have been ‘without deployment orders’ with some waiting around in hotels while others ‘have sat idle’ as Americans throughout the southeast are in dire need.\n\nLast week, Department of Homeland Security Secretary Alejandro Mayorkas admitted that FEMA ran out of money to make it through the hurricane season, after it handed out more than $1 billion in taxpayer dollars to give housing assistance to illegal migrants over the last two years. \n\nJoe Gabriel Simonson, a reporter for the Washington Free Beacon, snapped a picture of Mayorkas shopping in a luxury department store in Washington D.C. allegedly on October 5, which would have been during the peak of the Helene rescue efforts.\n\n‘So, suffice to say, the guy isn’t working around the clock,’ Simonson wrote on X.\n\nDailyMail.com approached Homeland Security for comment.\n\nPresident Joe Biden also came under fire for his response to the disaster because he spent the weekend of the hurricane hit at his Rehoboth Beach vacation home.\n\n‘I was commanding, I was on the phone for at least two hours yesterday, and the day before, as well. I commanded, it’s called a telephone,’ he told reporters. \n\nFollowing this criticism, Biden deployed 1,000 active duty soldiers to North Carolina. He also took an aerial tour with Governor Roy Cooper to witness the damage before giving a news conference.\n\nVice President Kamala Harris, the Democratic nominee for president, has also visited the designated hurricane disaster zone twice.\n\nHer opponent, former President Donald Trump, has slammed both her and Biden for what he called ‘the worst response in the history of hurricanes’ during a rally last Thursday in battleground Michigan. \n\n‘A certain president, I will not name him, destroyed his reputation with Katrina,’ Trump said, referring to former President George W. Bush. ‘And this is going even worse. She’s doing even worse than he did.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nGrieving families in North Carolina have been forced to bury their dead in their&#8230;\n\n\nThis Post: North Carolina families mourn loved ones by burying them in yards amid criticism towards FEMA for hurricane &#8216;concealment&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/north-carolina-families-mourn-loved-ones-by-burying-them-in-yards-amid-criticism-towards-fema-for-hurricane-concealment/","image":"https://i.dailymail.co.uk/1s/2024/10/07/21/90564327-13934059-A_drone_view_shows_a_damaged_area_in_Swannanoa_North_Carolina_on-a-186_1728332219044.jpg","video":null,"publish_date":"2024-10-07 23:19:49","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.479},{"id":258835916,"title":"Elon Musk to Tucker Carlson on his Trump support: ‘If he loses, I’m f***ed’","text":"“If he loses, I’m f***ed,” he said with a laugh in a sit-down interview with Tucker Carlson on Monday.\n\n“How long do you think my prison sentence is going to be?” he asked Carlson and the off-camera producers, adding, “Will I see my children? I don’t know.”\n\nThe billionaire admits that he has been “trashing Kamala nonstop” and “the machine that she represents” as he likened her to being the “Kamala puppet.”\n\n“Nobody tries to assassinate a puppet,” Musk quipped, suggesting the vice president was a facade of a larger “machine” running the government and Democratic Party.\n\nThen Carlson is heard telling his producers, “OK, we gotta tape this.”\n\nA producer is heard yelling back, “Yeah, we’re good.”\n\nMusk then calmly answered Carlson’s following questions without as many blunt jokes, making it unclear whether he knew he was being taped during his earlier comments.\n\nMusk has been a vocal critic of Vice President Kamala Harris, the Democratic presidential nominee, and President Joe Biden. He came out with his endorsement of Trump in July following the first assassination attempt in Butler, Pennsylvania.\n\n“In my view, if Trump doesn’t win this election, this is the last election we’re going to have,” Musk said.\n\nHe added, “The Dem machine has been importing so many people. … They’re transferring illegals to swing states. … In some cases, it’s 700% in the last three years.”\n\n“Swing states margins are 10, maybe 20,000 votes. So what happens when you import hundreds of thousands of people into each swing state?” he said, noting that this leads to getting a green card and often them voting “overwhelmingly Democrat” because of social handouts and programs.\n\n“If there are four more years of another Dem administration, they will legalize so many illegals that are there, the next election there won’t be any swing states,” he said to Carlson.\n\nThe SpaceX and Tesla CEO did praise Biden Transportation Secretary Pete Buttigieg, who recently called Musk after the Starlink executive accused the Federal Aviation Administration of blocking pilots who were helping get Starlink equipment into storm-ravaged parts of North Carolina.\n\n“How was Buttigieg?” Carlson asked Musk.\n\n“I want to give Buttigieg some credit here,” Musk responded. “When I complained about it, he acted about it in a very levelheaded way and reached out to me. He called me. We discussed the issue, got to the bottom of it, and he fixed it. So credit to Buttigieg. … As soon as he was aware of the problem, then he fixed it.”\n\nThe Carlson interview went almost two hours on various topics including Jeffrey Epstein, P. Diddy, California, the declining birth rate, vaccines, religion, the “woke mind virus,” and his view of a Trump administration’s future agenda.","summary":"Tech billionaire Elon Musk admits that he&#8217;s risking a lot in his support for former President Donald Trump and said that he is &#8220;f***ed&#8221; if the Republican nominee does not win in the 2024 election, which he says could be &#8220;the last election.&#8221; &#8220;If he loses, I&#8217;m f***ed,&#8221; he said with a laugh in a [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3180381/elon-musk-tucker-carlson-trump-support-if-he-loses/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Musk-and-Trump.webp","video":null,"publish_date":"2024-10-07 23:16:22","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","category":"politics","source_country":"US","sentiment":-0.458},{"id":258837502,"title":"Vance reveals Trump’s plan for abortion: reports","text":"2024 GOP vice presidential nominee JD Vance revealed that Donald Trump plans to completely gut Planned Parenthood if he defeats Kamala Harris next month, The Daily Beast reports.\n\nWith a history of flip-flopping on the issue of abortion, Trump successfully reversed Roe v. Wade by appointing conservative justices to the Supreme Court in 2022, and just last month submitted that Florida’s six week abortion ban was too strict. \n\nThe former president even said last month that his administration would be \"great for women and their reproductive rights.\"\n\nREAD MORE: Melania Trump defends reproductive rights in new memoir: reports\n\nVance suggested the opposite over the weekend.\n\n\"On the question of defunding Planned Parenthood, look, I mean our view is we don’t think that taxpayers should fund late-term abortions,\" the Ohio senator JD Vance said, according to NBC News. \"That has been a consistent view of the Trump campaign the first time around. It will remain a consistent view.\"\n\nThe Beast notes that Vance's assertion drew criticism from Harris' spokesperson, Lauren Hitt, said Vance's comment proved that \"a second Trump term is too big a risk for American women and their families.\"\n\nHitt added, \"The only way to stop an unchecked Trump and his MAGA allies from ripping away freedoms from American women is to elect Vice President Harris, who will defend women’s access to health care and reproductive freedom.\"\n\nREAD MORE: 'He is not done': Harris responds to Trump’s latest flip-flop on Florida ballot measure\n\nVance's comment also comes after The Guardian revealed last week that Trump's wife, Melania Trump, confirms in her new memoir that she's an advocate for abortion rights.","summary":"2024 GOP vice presidential nominee JD Vance revealed that Donald Trump plans to completely gut Planned Parenthood if he defeats Kamala Harris next month, The Daily Beast reports.\n\nWith a history of flip-flopping on the issue of abortion, Trump successfully reversed Roe v. Wade by appointing conservative justices to the Supreme Court in 2022, and just last month submitted that Florida’s six week abortion ban was too strict.  \n\nThe former president even said last month that his administration would be \"great for women and their reproductive rights.\"\n\nREAD MORE: Melania Trump defends reproductive rights in new memoir: reports\n\nVance suggested the opposite over the weekend.\n\n\"On the question of defunding Planned Parenthood, look, I mean our view is we don’t think that taxpayers should fund late-term abortions,\" the Ohio senator JD Vance said, according to NBC News. \"That has been a consistent view of the Trump campaign the first time around. It will remain a consistent view.\"\n\nThe Beast notes that Vance's asserti","url":"https://www.alternet.org/trump-abortion-vance/","image":"https://www.alternet.org/media-library/image.jpg?id=26955354&width=1200&height=600&coordinates=0%2C18%2C0%2C19","video":null,"publish_date":"2024-10-07 23:15:03","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.069},{"id":258833058,"title":"Donald Trump leads US tributes for the first anniversary of Oct. 7 terror attack: photos","text":"Donald Trump places a rock on a tombstone at Ohel Chabad Lubavitch, the final resting place of Rabbi Menachem M. Schneerson the Rebbe, in Queens, NYC, on Monday, October 7, 2024. Stephen Yang for NY Post\n\n 2 of 18\n\nDonald Trump prays at Ohel Chabad Lubavitch, the final resting place of Rabbi Menachem M. Schneerson the Rebbe, in Queens, NYC, on Monday, October 7, 2024. Stephen Yang for NY Post\n\n 3 of 18\n\nIsrael supporters in Times Square commemorate the October 7 attacks. REUTERS\n\n 4 of 18\n\nA memorial installation inside Columbia University in NYC, to commemorate the one year anniversary of the attacks in Israel. Matthew McDermott for NY Post\n\n 5 of 18\n\nJoe Biden and First Lady Jill Biden standing with Rabbi Aaron Alexander at a remembrance ceremony in the Blue Room of the White House. Getty Images\n\n 6 of 18\n\nJoe Biden lights a candle during a remembrance ceremony on the one-year anniversary of the Hamas attack on Israel in the Blue Room at the White House on October 07, 2024 in Washington, DC. Getty Images\n\n 7 of 18\n\nPeople attend a pro-Israel rally in Times Square in New York, New York, USA, 07 October 2024. SARAH YENESEL/EPA-EFE/Shutterstock\n\n 8 of 18\n\nVice President Kamala Harris and Second Gentleman Doug Emhoff plant a tree to mark the one year anniversary of the Oct. 7 Hamas attacks on Israel, at the U.S. Vice President’s residence at the U.S. Naval Observatory in Washington, U.S., October 7, 2024. REUTERS\n\n 9 of 18\n\nIsrael supporters in Times Square commemorate the October 7 attacks. REUTERS\n\n 10 of 18\n\nRepublican Vice Presidential Nominee J.D. Vance speaks at the Philos Stand with Israel rally on the anniversary of the Israel-Hamas war near the Washington Monument in Washington, U.S., October 7, 2024. REUTERS\n\n 11 of 18\n\nJ.D. Vance (R-OH) wears a necklace that reads “Bring Them Home Now!” as he speaks during a Philos Project October 7th Memorial Rally at the Washington Monument on October 7, 2024 in Washington, DC. Getty Images\n\n 12 of 18\n\nPeople attend a vigil at Union Square to mark the first anniversary of the October 7th attacks on October 07, 2024 in New York City. Getty Images\n\n 13 of 18\n\nA group of Pro-Israeli supporters gathered outside of Columbia University on Monday, October 7, 2024. Matthew McDermott\n\n 14 of 18\n\nSupporters attend an event by the Washington Monument on the Washington Mall, in DC. Shutterstock\n\n 15 of 18\n\nA memorial installation inside Columbia University in NYC, to commemorate the one year anniversary of the attacks in Israel. Matthew McDermott\n\n 16 of 18\n\nVice President Kamala Harris speaks as second gentleman Doug Emhoff looks on before planting a memorial tree on the grounds of the Vice President’s residence in Washington on Monday, Oct. 7, 2024. AP\n\n 17 of 18\n\nSara Vasquez, center, and her mother Elizabeth Vasquez, right, carry signs in support of Israel during a rally marking one year since the Oct. 7 Hamas terror attack on Israel, in Washington, Monday, Oct. 7, 2024. AP\n\n 18 of 18\n\nVice Presidential candidate, Minnesota Gov. Tim Walz, visits the Nova Music Festival Exhibition on the first anniversary of the Oct. 7 Hamas attack on Israel, in Culver City, Calif., Monday, Oct. 7, 2024. AP","summary":"Supporters of Israel gather across the country to express solidarity in response to the October 7 terror attack.","url":"https://nypost.com/2024/10/07/us-news/donald-trump-leads-us-tributes-for-the-first-anniversary-of-oct-7-terror-attack-photos/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-bcbtz74jv-1728341776719.jpg?quality=90&strip=all&1728327853&w=1200","video":null,"publish_date":"2024-10-07 23:08:02","author":"Alex Mead","authors":["Alex Mead"],"language":"en","category":"politics","source_country":"us","sentiment":0.289},{"id":258833730,"title":"Reporter's Notebook: All about the politics of disaster relief","text":"Welcome to the politics of disaster relief. Republicans are excoriating the Biden/Harris administration for how it responded to Hurricane Helene in North Carolina, Tennessee and other parts of the South. This is now about to be a double whammy as Hurricane Milton bears down on Florida. It unfolds amid a tight presidential election. So the disaster response is now infused with politics in swing states like North Carolina and Georgia. There is also a competitive but not top-tier Senate race in Florida. Storms can disrupt the typical electorate. The usual people who vote might not make it to the polls. It’s hard to care about voting if you’re low on food, lack electricity and can’t even make it out of the holler in western North Carolina because Helene wrecked the road. 'IMMEDIATELY RECONVENE': SCOTT URGES SCHUMER TO RECALL SENATE AMID HELENE'S DEVASTATION Pray tell, where should you vote in Tampa or Sarasota if your basement is swamped by Milton – after getting drenched when Helene spun through a few weeks ago? You were going to vote at the school down the street. But now it lacks power. You’re now living at your sister’s house inland. But you’re not registered to vote there … You see what we’re getting at. Republicans are hammering the Biden/Harris administration for its response to the storm. \"It’s like the DMV at industrial scale,\" said Republican vice presidential nominee and Sen. JD Vance, R-Ohio, on Fox. \"It is incompetence of the highest order.\" \"At the federal level, this has been a massive failure,\" said House Speaker Mike Johnson, R-La. \"When you talk to the people who are directly affected, they will tell you that this has been an abject failure. FEMA has lost sight of its core mission. The administration has not shown that they were prepared for this eventuality in this terrible disaster.\" \"Kamala Harris has left them stranded. This is the worst response to a storm or a catastrophe or a hurricane that we've ever seen. Probably worse than Katrina. And that's hard to beat, right?\" asked former President Trump. Storm responses are challenging. Hurricane Andrew was a powerful Category 5 storm that swept through Florida in August 1992. Former President George H.W. Bush's tepid response to Andrew slashed his support in Florida. \"Bush 41\" wound up narrowly winning Florida, besting former President Clinton by less than 2%. Bush won Florida by 22 points four years earlier. Moreover, the response to Hurricane Andrew raised questions about the competence of the administration weeks before the election. It’s believed that cost Bush a few points nationwide. When Clinton took office, he immediately beefed up FEMA to prepare and respond to other natural disasters. BIDEN GETS DEFENSIVE WHEN PUSHED ON WHO'S COMMANDING' HURRICANE HELENE RESPONSE So, part of this tactic is the natural extension of Republicans to undercut the Biden/Harris administration at nearly every turn. This is another component of the GOP narrative that the administration can’t handle the economy. Can’t handle foreign policy. Can’t handle the border. Did someone say the border? \"We give $20 billion a year to FEMA. And unfortunately, they have drained everything dry,\" said Sen. Tommy Tuberville, R-Ala., on Fox Business. \"We spent $200 billion in Ukraine. We spent $220-$500 a month on our illegal aliens.\" This is where things get tricky. FEMA is under the aegis of the Department of Homeland Security. DHS runs a program that sends money to cities besieged by the illegal migrant crisis. Some of the money goes for food and shelter for those in the country illegally. But it also helps those towns cope by addressing strains on their medical systems and other services. Money for disaster recovery and migrant assistance constitute two separate line items in the DHS budget. Congress approved money for both these programs. In fact, some Republicans would prefer to spend more to help their communities grapple with an infusion of illegal immigration. SPEAKER JOHNSON ADDRESSES CLAIMS FEMA DIVERTED FUNDS TO IMMIGRATION EFFORTS: ‘AMERICAN PEOPLE ARE DISGUSTED' About $640 million currently goes to assist these towns beset by an influx of illegal migrants. But some lawmakers would like that to spike to as much as $3 billion next year. Rep. Nancy Mace, R-S.C., introduced legislation to halt the migrant assistance program. And Johnson blurred the line between FEMA disaster aid and migrants and the border. \"FEMA should be involved and the Federal Emergency Management Association. Their mission is to help people in times like this of natural disaster. Not to be engaged in using any pool of funding from any account for resettling illegal aliens who have come across the border,\" said Johnson on Fox. Other Republicans believe this may be an opportunity to recalibrate spending overall. Keep in mind that many Republicans look askance at foreign aid to Ukraine. \"As an elected official, it's our responsibility to put Americans first. Whether you're in Florida, in my district or you're anywhere in the union, I think that it's important for us to prioritize Americans and restore hope and let them know they're not forgotten,\" said Rep. Cory Mills, R-Fla., on Fox. But some Republicans compared issues with FEMA’s response to how the administration addresses other subjects. KJP SLAMMED AFTER HURRICANE HELENE OVER MIXED MESSAGES ON WHETHER FEMA RESOURCES USED FOR MIGRANTS \"This administration seems to have no problem finding money when they want to spend it on their priorities. When they need hundreds of billions of dollars to pay off student loans for graduate students and gender studies programs, they somehow find it. When it's trying to get helicopters to deliver food and water and cellular service and lifesaving medicine into these mountain valleys, they somehow can't seem to find the money,\" declared Sen. Tom Cotton, R-Ark., on NBC. FEMA Administrator Deanne Criswell castigated Republicans for suggesting FEMA was focused on other issues rather than the storms. \"It's frankly ridiculous and just plain false. This kind of rhetoric is not helpful to people,\" said Criswell on ABC. Before leaving Washington, Congress green-lighted $20 billion for FEMA’s Disaster Relief Fund (DRF) as part of the interim spending plan to avoid a government shutdown. But Homeland Security Secretary Alejandro Mayorkas muddled matters when he said FEMA had enough funds to respond to Helene for \"immediate needs\" but not enough to get through \"the season.\" The \"season\" to which Mayorkas refers is the annual hurricane \"season.\" It stretches through Nov. 30. Note that Mayorkas made this remark when there was the potential for another storm, but Milton hadn’t yet formed in the Gulf of Mexico. Some Republicans pounced on Mayorkas. But after considering the severity of Helene, it will likely draw down the DRF for \"immediate needs.\" The key phrase here is \"immediate needs.\" Milton will probably do the same. That’s why Congress must likely tackle disaster relief in at least two tranches when it returns to session in November. Lawmakers will need to refill the DRF. And the price tags will start to roll in for Helene and Milton. That’s to say nothing of outstanding disasters like Hurricane Beryl in Texas, tornadoes in Iowa, a typhoon on Guam and wildfires in Hawaii. FEMA HAS FUNDS NEEDED FOR 'IMMEDIATE RESPONSE AND RECOVERY,' DESPITE MAYORKAS' WARNING However, Johnson is unwilling to summon lawmakers back to Washington to grapple with disasters. \"You don't just send estimates to the federal government. You send specific needs and requests based upon the actual damages. And that takes some time, especially with storms of this magnitude. So Congress will do its job,\" said Johnson on Fox. So, lawmakers must first reload the DRF for future immediate needs, then mete out bigger chunks of change for Americans to cope with the impacts of Helene and Milton. The government funding deadline is Dec. 20. It’s possible that the latter chunk of funding is folded into spending measures around Christmas. CLICK HERE TO GET THE FOX NEWS APP But as for the politics? The election is fast approaching. The storms could impact voting this fall. And while Helene and Milton will certainly leave a mark meteorologically, they will probably leave a mark electorally, too.","summary":"Republicans are castigating the Biden administration for its response to Hurricane Helene – and, like rote, are bringing to the forefront the ugly politics of disaster response.","url":"https://www.foxnews.com/politics/politics-disaster-relief","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/milton-prep.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-07 23:07:27","author":"Chad Pergram","authors":["Chad Pergram"],"language":"en","category":"politics","source_country":"US","sentiment":-0.42},{"id":258832964,"title":"Jack Smith Holding Key Argument in His 'Pocket': Ex-FBI Deputy Director","text":"Special Counsel Jack Smith may be holding onto a key legal argument in former President Donald Trump's federal election subversion case, according to former FBI Deputy Director Andrew McCabe.Smith outlined a plethora of new evidence against the former president in a 165-page briefing filed late last month related to accusations that Trump attempted to overturn his 2020 election loss. The document, which was unsealed last Wednesday, homes in on actions Trump took as a private citizen, rather than as part of his official duties, in the aftermath of the 2020 election, which culminated in the U.S. Capitol attacks on January 6, 2021.Trump, the GOP nominee for president, has pleaded not guilty to the four felony counts included in Smith's indictment and claims that the charges are politically motivated. He has also previously argued that his challenges of the 2020 election results were a form of protected free speech, an argument that Smith has pushed back on in past court filings.But as legal analyst Allison Gill pointed out in an episode of her podcast JACK posted on Saturday, which she co-hosts with McCabe, Smith left out his rebuttal to the former president's free speech claims in his latest filing.Gill, the creator of the Mueller, She Wrote podcast, added that with Smith's other arguments included in the briefing, \"I don't think he needs that one\" regarding free speech.McCabe added in the conversation, \"I think it's one of those things that he probably keeps in his pocket to see what Trump throws back at him in Trump's response, which could be in four weeks or nine weeks, apparently.\"Trump's defense team first hinted that it may use a free speech defense shortly after the former president was charged in August 2023. At the time, Trump lawyer John Lauro accused the DOJ of having \"criminalized\" the First Amendment.A few months later, after Trump's team first motioned to dismiss the federal election case in its entirety, Smith adamantly rejected that First Amendment protections applied to the charges against the former president, writing in a filing in November 2023, \"The First Amendment does not protect fraudulent speech or speech otherwise integral to criminal conduct, particularly crimes that attack the integrity and proper function of government processes.\"In recent months, both the defense and prosecutors have pivoted to arguing over how the presidential immunity clause of the U.S. Constitution impacts Trump's charges. After an appeal from Trump of a lower court's ruling, the U.S. Supreme Court ruled in July that the former president cannot face criminal charges for any actions he made as part of his official duties under the immunity clause.Smith filed a superseding indictment last month in reaction to the Supreme Court's ruling, laying out that Trump's actions in the aftermath of the 2020 election were made as a private citizen and a presidential candidate, not as president of the United States.Prosecutors' opening brief focused on the same issue, emphasizing that Trump's actions went beyond his official duties. Smith dedicated one section of the filing to establishing \"that nothing the Government intends to present to the jury is protected by presidential immunity.\"Trump has characterized the brief as a \"hit job\" and claims that Smith is hoping to influence voters ahead of the November 5 election to boost his Democratic opponent, Vice President Kamala Harris.\"Deranged Jack Smith, the hand picked Prosecutor of the Harris-Biden DOJ, and Washington, D.C. based Radical Left Democrats, are HELL BENT on continuing to Weaponize the Justice Department in an attempt to cling to power,\" Trump wrote in a post to Truth Social last week.Newsweek has reached out to legal experts for additional comment.","summary":"Smith's latest filing in Trump's federal election case left out arguments over how free speech protections apply to Trump's charges.","url":"https://www.newsweek.com/jack-smith-key-argument-pocket-ex-fbi-deputy-director-1965319","image":"https://d.newsweek.com/en/full/2489646/jack-smith-holding-key-argument-hispocket.jpg","video":null,"publish_date":"2024-10-07 23:06:42","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.286},{"id":258833160,"title":"Shane Gillis Declines Offer to Portray Donald Trump on ‘SNL’ 50th Season","text":"Saturday Night Live apparently nearly had a new Donald Trump impersonator for its 50th season.\n\nShane Gillis claimed over the weekend that he was asked to play the former President for the entirety of season 50 but turned it down.\n\nAt Skankfest, a comedy festival in Las Vegas, it emerged that Gillis, who did spoof Trump when he hosted SNL last season, was asked by Lorne Michaels to do it again.\n\n“Nobody thought [Gillis] was coming to this festival this year,” podcaster Luis J. Gomez said.\n\n“Explain why,” Gillis replied. “Because he was offered to play Trump on the entire season of SNL and he turned it down to f*cking be here, folks,” Gomez added. Gillis said, “They said, ‘Are you serious? You’re going to say no?’ I said, ‘Lorne, I’ve got to go to Coke Magic.’”\n\nThe idea of a new Trump impersonator gained steam after Lorne Michaels gave an interview, where he said that the show would have to “reinvent it again” following the Presidential debate.\n\nIn the end, James Austin Johnson, who has recently portrayed Trump on the show, returned to play the Republican nominee alongside Maya Rudolph as Vice President Kamala Harris, Jim Gaffigan as Tim Walz, Dana Carvey as President Joe Biden and Andy Samberg as Doug Emhoff.\n\nBefore Johnson, Alec Baldwin previously portrayed Trump on the NBC show. The Rust actor started his impression in 2016 when Trump was running for President and continued through to Trump’s defeat in the 2020 election. He also won an Emmy for Outstanding Supporting Actor in a Comedy Series for the role in 2017.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSaturday Night Live apparently nearly had a new Donald Trump impersonator for&#8230;\n\n\nThis Post: Shane Gillis Declines Offer to Portray Donald Trump on &#8216;SNL&#8217; 50th Season first appeared on Internewscast Journal","url":"https://internewscast.com/news/shane-gillis-declines-offer-to-portray-donald-trump-on-snl-50th-season/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Shane-Gillis-Says-He-Turned-Down-Playing.jpg","video":null,"publish_date":"2024-10-07 23:06:35","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.007},{"id":258832710,"title":"Harris claims Ron DeSantis snubbed her call, Florida gov says he ‘didn’t know’ about it","text":"Vice President Kamala Harris alleged Monday that Florida Gov. Ron DeSantis spurned a recent call from her, while the Republican insisted he had no knowledge of the Democrat’s attempt to communicate following the landfall of Hurricane Helene and ahead of the arrival of Hurricane Milton.\n\nABC News and NBC News reported Monday that DeSantis’ staff turned down the Harris overture, feeling that it was politically motivated.\n\n“Kamala was trying to reach out, and we didn’t answer,” a gubernatorial aide told NBC.\n\n“No. I didn’t know she called me,” DeSantis, 46, told reporters during a press conference Monday discussing the arrival of Category 5 Milton. \n\n“I saw that [media report] but I was not aware of that,” the governor added.\n\nHarris’ White House press team confirmed to The Post that an attempt was made to contact DeSantis early last week after Helene made landfall Sept. 26.\n\nThe veep also reached out to a handful of officials in the Sunshine State, including Florida’s two senators and at least half a dozen GOP congressmen, per the White House.\n\nHarris took a swipe at DeSantis — without mentioning his name — as she left Washington for the start of a New York media tour Monday evening.\n\n“You know, moments of crisis, if nothing else, should really be the moment that anyone who calls themselves a leader says they’re going to put politics aside and put the people first,” the vice president said.\n\n“People are in desperate need of support right now and playing political games at this moment in these crisis situations — these are the height of emergency situations — is utterly irresponsible and it is selfish.”\n\nConservatives fired back at Harris, accusing her of trying to cosplay as a leader and boost her presidential campaign.\n\n“There is a Category 5 hurricane making landfall in Florida in less than 48 hours. Taking a call from a Vice President who wants to pretend she’s President is not (and should not) be high on the to-do list,” Ben Williamson, chief of staff for Rep. Michael Cloud (R-Texas), wrote on X. “Sorry.”\n\n“She’s attacking the governor of a state about to be hit by its second hurricane in two weeks because he didn’t make time to let her cosplay as president during a contentious election,” wrote another critic. “Utterly shameful.”\n\nLast week, Biden, 81, surveyed Helene damage in Florida but did not meet up with DeSantis, who was holding a press conference about 300 miles away at the time. \n\nDeSantis dodged a question Monday about whether he connected with Biden directly about the arrival of Milton.\n\n“The president has approved what we asked for. We’re thankful for that. If there’s something we need that they don’t approve, I will not hesitate to call him,” he said.\n\n“Everything we’ve asked for from President Biden, he has approved, and we do think we’ll get more approvals for some of the individual assistance and the debris removal after landfall.”\n\nThe governor also said that Biden had called last week, but DeSantis was traveling and unable to take the call.\n\nHurricane Helene ravaged the Southeast late last month, killing at least 232 people.\n\nMilton is currently forecast to make landfall as a Category 3 storm Wednesday evening in the Tampa area.","summary":"“Kamala was trying to reach out, and we didn’t answer,” a DeSantis aide was quoted as telling NBC News.","url":"https://nypost.com/2024/10/07/us-news/harris-claims-ron-desantis-snubbed-her-call-florida-gov-says-he-didnt-know-about-it/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/91202193.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/zU4gP7eG-RyIcpnTz.mp4","publish_date":"2024-10-07 23:02:26","author":"Ryan King","authors":["Ryan King"],"language":"en","source_country":"us","sentiment":-0.404},{"id":258833704,"title":"Letters: People’s vote | Remove states | College trustee","text":"Biden is economic\nwinner for the U.S.\n\nRe: “Trump and Vance will set nation on right track” (Page A6, Sept. 26).\n\nIrene McGovern complains about gaslighting by Democrats over Kamala Harris’ qualifications while ignoring Harris’ 30 years of government experience, as a prosecutor, state attorney general, U.S. senator and vice president.\n\nOn the other hand, Donald Trump was never qualified, had no experience, and engaged in criminal behavior that culminated in an attempted coup to stay in power after losing the 2020 election. For the record, 45 U.S. troops died fighting in Afghanistan during Trump’s presidency, while Biden’s order to withdraw from Afghanistan resulted in 13 deaths.\n\nOil production is now higher than it has ever been, exceeding 13 million barrels per day, and if Biden’s creation of 15 million jobs, compared to the more than 2 million Trump lost, qualifies as a tailspin, then please keep it coming.\n\nWarren Seifert\n\nVoting franchise belongs\nto people, not states\n\nRe: “Electoral College keeps us from one-party rule” (Page A6, Oct. 4).\n\nIn Ed Kahl’s recent letter, he refers to states electing presidents and says that he doesn’t want California to have too much influence. In a democracy, the voting franchise belongs to the people, not the states.\n\nThis game of allocating rights to states instead of to people was played out for a long time, partly in order to perpetuate the institution of slavery. One of the results of that game is that there are many sparsely populated Western states, whose senators have a disproportionate power over our politics.\n\nWhy should a vote in Pennsylvania, Nevada or Arizona be more important than my vote? Parties and candidates should have to make a case to each of us for winning our vote. A nationwide popular vote might have been difficult to manage in 1789, but we can manage it quite well today, and it would be more democratic, not necessarily more Democrat.\n\nJim Von De Bur\n\nRemove the states\nfrom national elections\n\nRe: “Electoral College keeps us from one-party rule” (Page A6, Oct. 4).\n\nEd Kahl’s assertion that the Electoral College keeps New York, California and a few other Democratic states from determining the outcome of every presidential election is flawed because replacing it with a popular vote system would actually remove all states from the equation.\n\nThe fact is, the vote of each individual voter in the country, regardless of which state they live in, would then count. Case in point, in 2016 more Americans voted for Hillary Clinton than any other losing presidential candidate in U.S. history. She outpaced Donald Trump by nearly 3 million votes. Due to the Electoral College, however, the votes from California and New York for either candidate did not contribute to Trump’s victory or to Clinton’s loss. Simply, votes tallied in those states did not count.\n\nIf you believe in “one person – one vote” with every vote weighing equally, the Electoral College is obsolete.\n\nCliff Wells\n\nVote for Bernald\nfor WVMC trustee\n\nI fully endorse Mary-Lynne Bernald for the Area 5 West Valley-Mission Community College District Board of Trustees because her commitment to the community reflects values I deeply admire.\n\nAs president of the Associated Student Government at Mission College, I have seen firsthand the importance of dedicated leadership in education. After one of our meetings, Mary-Lynne took the time to speak with me and truly listen to my story. Her genuine interest in the challenges I’ve faced as a first-generation college student left a lasting impression. This kind of empathy and attentiveness is rare and speaks volumes about her commitment to supporting students. With her extensive experience in public service, I know she will ensure that all voices, especially those from underrepresented communities, are heard.\n\nMary-Lynne has the vision and heart needed to continue advocating for student success and creating meaningful change across the district.\n\nPriscila Moreira","summary":"Mercury News Letters to the Editor for Oct. 8, 2024","url":"https://www.mercurynews.com/2024/10/07/letters-1894/","image":"https://www.mercurynews.com/wp-content/uploads/2016/12/electoral-college-how-it-wo.jpg?w=1024","video":null,"publish_date":"2024-10-07 23:00:00","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.037},{"id":258832432,"title":"Trump’s Election Odds Spike On Polymarket As Musk Touts Election Betting Site","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nOdds on one notable presidential election betting platform shifted majorly in former President Donald Trump’s favor Monday, much to the delight of the world’s richest man Elon Musk, though odd movements on other sites offering wagers were far less drastic.\n\nTesla CEO Elon Musk, right, joins Donald Trump during a campaign rally Saturday.\nAFP via Getty Images\n\nTrump’s lead on Vice President Kamala Harris expanded rapidly Monday on the blockchain-based Polymarket, which allows users to place unconventional wagers on events like the presidential election.\n\nPolymarket priced in a 53.3% chance of a Trump win and 46.1% of a Harris victory shortly after 6 p.m. EDT, up from 50.9% to 48.2% split in Trump’s favor as recently as 9:30 a.m., extending Trump’s Polymarket odds to their highest level since early August—shortly after Harris took over the Democratic nomination from President Joe Biden.\n\nThe Polymarket shift caused Trump to advance past Harris as the favored candidate by betting markets for the first time since Sept. 10, according to Election Betting Odds, which aggregates victory probabilities implied by presidential election betting platforms including Polymarket.\n\nBut Polymarket competitors moved far less Monday, as PredictIt favored Harris over Trump at what equates to a 51.4% to 48.6% margin, roughly flat over the last 24 hours, and Kalshi odds sat flat at 51% to 49% in Harris’ favor.\n\nWhat We Don’t Know\n\nWhat caused the swing in Trump’s favor on Polymarket. Some social media users noted the movement came as one anonymous user by the name “Fredi9999” upped his bets on a Trump win to over $4 million. Polymarket does not limit individual bettors like PredictIt ($850 limit) or Kalshi ($25,000) as it operates as an “offshore” book and does not face the same federal regulations. So, it’s possible that Trump’s odds shifted on Polymarket as it was the result of buying activity from one or a handful of big-ticket bettors rather than a material shift in the election landscape.\n\nMusk, who endorsed Trump in July and appeared at a rally with the Republican candidate Saturday, shared several posts on his X social media platform touting the Polymarket shift. Musk shared a post connecting the jump to his appearance at Trump’s Pennsylvania rally, wrote betting odds are “more accurate than polls as actual money is on the line” and reposted a screenshot touting the “collapse” of Harris’ election odds.\n\nNational polls show Harris holds a slight lead over Trump, and FiveThirtyEight puts Harris’ odds of securing enough electoral votes for a victory at 55%.\n\nCrucial Quote\n\n“Polymarket effectively takes what otherwise would be an Internet yelling match and turns that into a market where the person who's right wins,” Polymarket founder Shayne Coplan told Forbes in July.\n\nFurther Reading\nForbesMeet The 26-Year-Old Building A Billion Dollar Prediction MarketplaceBy Nina Bambysheva\n\nForbesTrump Vs. Harris 2024 Polls: Harris Leads In 4 New National Surveys—Amid Virtual Tie In Swing StatesBy Sara Dorn\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nEditorial Standards\n\nForbes Accolades","summary":"The Election Betting Odds tracker, which aggregates implied election odds across several platforms, favors Trump to prevail next month for the first time in four weeks.","url":"https://www.forbes.com/sites/dereksaul/2024/10/07/trumps-election-odds-spike-on-polymarket-as-musk-touts-election-betting-site/","image":"https://imageio.forbes.com/specials-images/imageserve/670465ebe0c4a4226375cb06/0x0.jpg?format=jpg&crop=4184,2353,x0,y108,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-10-07 22:55:17","author":"Derek Saul,Forbes Staff","authors":["Derek Saul","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":0.038},{"id":258837672,"title":"Trump and Harris mark somber anniversary of Hamas’ Oct. 7 attack on Israel","text":"FORT LAUDERDALE, Fla. — Former President Donald Trump and Vice President Kamala Harris are marking the first anniversary of the deadliest attack on Jews since the Holocaust as the presidential candidates approach the final weeks of the campaign during a widening conflict in the Middle East.\n\nPolitical leaders across the spectrum were marking the killing of about 1,200 people, including 46 U.S. citizens, by Hamas-led militants in the Oct. 7 attack last year, and the taking of about 250 hostages. A year later, about 100 people, including several Americans, remain in captivity, as U.S.-led efforts to negotiate a cease-fire and hostage release deal have sputtered out.\n\nTrump visited the New York City gravesite of Rabbi Menachem Mendel Schneerson, who led the Chabad-Lubavitch movement of Orthodox Judaism from 1951 until his death in 1994. Schneerson was the movement’s seventh leader, known as Lubavitcher Rebbe. Trump then will speak before Jewish community leaders at one of his Florida resorts in the Miami suburb of Doral.\n\nHarris and her husband planted a pomegranate tree on the grounds of the vice president’s residence in honor of the those killed a year ago.\n\nEarlier Monday, Harris’ husband, Doug Emhoff, who is Jewish, recited a prayer for peace at an event to commemorate the anniversary hosted by the American Jewish Committee in Washington.\n\nPresident Joe Biden and first lady Jill Biden also hosted a somber memorial ceremony at the White House Monday to mark the one-year anniversary of the attack. The Bidens looked on as Rabbi Aaron Alexander of Washington’s Adas Israel Congregation recited the Jewish remembrance prayer for the more than 1,200 people, including dozens of Americans, killed that day, listing the towns, villages and festival site that were the scenes of the deadliest day for Jews since the Holocaust. The president then lit a lone memorial candle placed on a small table at the center of the Blue Room, before they observed a moment of silence.\n\nEarlier in the day, Biden spoke with Israeli President Isaac Herzog, the White House said.\n\nThe attack sparked a deadly war in Gaza, as Israel moved to root out Hamas’ control over the territory and try to return those taken captive. Israel’s military campaign has killed more than 41,000 Palestinians, including many women and children, according to the Hamas-run health ministry, which does not distinguish between militants and civilians.\n\nAnother Iran-backed group, Hezbollah, has fired thousands of rockets at Israeli territory in the same period from Lebanon, and Israel last month expanded a campaign of sabotage and assassination and launched a ground incursion into Lebanon to combat the threat from the group.\n\nIran, meanwhile, has fired large missile salvos at Israel, most recently a week ago, as the U.S. maintains troops and weaponry in the region to help Israel shoot them down.\n\nTrump has blamed both Harris and Biden for the war, arguing their administration empowered Iran, and he has tried to take advantage of some of the divisions within the Democratic Party with progressives protesting Israel’s war.\n\nSome of Trump’s statements on Israel overlook his association with people who spew antisemitic rhetoric such as far-right activist Nick Fuentes and rapper Ye, formerly known as Kanye West.\n\nTrump has repeatedly said that Jewish voters who vote for Democrats “should have their head examined” and recently said that if he loses the presidential election to Harris on Nov. 5 “the Jewish people would really have a lot to do with that.”\n\n“I did more for Israel than anybody. I did more for the Jewish people than anybody. And it’s not a reciprocal, as they say,” Trump said Monday in a radio interview with conservative host Hugh Hewitt. He also said developers could make Gaza “better than Monaco” because it has “the best location in the Middle East, the best water, the best everything.”\n\nIn a ballroom where the former president was scheduled to appear at the Trump National Doral hotel, banners hung with the images of the hundreds who were killed on Oct. 7. Rows of empty chairs arranged to the sides of the stage with the photo and name of those who are still held hostage by Hamas and a yellow rose on each seat.\n\nIn an excerpt released from an interview with CBS’ “60 Minutes” that will air Monday night, Harris appeared to avoid answering a question about whether Israeli Prime Minister Benjamin Netanyahu is considered “a real close ally,” and said: “The better question is, Do we have an important alliance between the American people and the Israeli people? And the answer to that question is yes.”\n\nTrump’s own relations with Netanyahu have been rocky. They soured after the Israeli prime minister became one of the first world leaders to congratulate Biden for his 2020 victory, which Trump continues to deny. A few days after the Oct. 7 attack last year, Trump publicly criticized Netanyahu and said he “was not prepared” for the deadly incursion from Gaza. Trump said Netanyahu had let the U.S. down just before the U.S. killed top Iranian general Qassem Soleimani in 2020.\n\nSince then, the two have met to talk about a cease-fire deal for Gaza.\n\nHalie Soifer, head of the Jewish Democratic Council of America, said the conflict in the Middle East — including fighting with Hezbollah and Iran — has left Jewish voters “with a sense of vulnerability and concern for Israel’s future.” Soifer previously advised Harris on national security issues.\n\nShe said Harris has been consistent with a message of commitment to Israel’s defense for the last year, and said Harris and Biden have directed U.S. forces to shoot down Iranian missiles targeting Israel on multiple occasions.","summary":"President Biden and Jill Biden also hosted a memorial ceremony at the White House.","url":"https://www.centralmaine.com/2024/10/07/trump-and-harris-mark-somber-anniversary-of-hamas-oct-7-attack-on-israel/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/10/APTOPIX_Harris_25003.jpg?w=1000","video":null,"publish_date":"2024-10-07 22:54:33","author":"Adriana Gomez Licon And Chris Megerian,ADRIANA GOMEZ LICON and CHRIS MEGERIAN - Associated Press","authors":["Adriana Gomez Licon And Chris Megerian","ADRIANA GOMEZ LICON and CHRIS MEGERIAN - Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.021},{"id":258832276,"title":"US adversaries spreading disinformation targeted at congressional races, according to intelligence officials","text":"WASHINGTON – It’s not just the presidential election: Foreign governments are targeting House and Senate races around the country in their effort to meddle with American democracy this election year, intelligence officials warned Monday.\n\nRussia, China and Cuba have all launched influence operations designed to help or hurt candidates in specific congressional races. Without giving specifics about the number of affected races, an official from the Office of the Director of National Intelligence said Monday that all three countries have zeroed in on races where they believe they have a national security interest at stake.\n\nThe warning from intelligence officials comes during a particularly tight battle for the House and Senate, where control could be decided by just a handful of races. While much of the attention has focused on attempts by foreign adversaries to influence the presidential race, Monday’s warning underscores the threat that online disinformation also poses in state and local contests.\n\nLeaders in Russia, China and Cuba understand the American political system well enough to recognize that this year’s close elections create good conditions for the use and spread of disinformation, said the official, who briefed reporters on condition of anonymity under rules set by the office of the director.\n\nForeign adversaries have also targeted some races even further down the ballot, including statewide offices and state legislative campaigns, the official said.\n\nMoscow’s goal is to erode support for congressional candidates who favor assisting Ukraine in its war with Russia. Officials wouldn’t say which candidates were targeted, but it’s likely that the Kremlin’s effort is intended to hurt Democrats and centrist Republicans who have supported Ukraine.\n\nChina has targeted candidates from both parties based on their stance on issues of key importance to Beijing, including support for Taiwan. Officials said they have observed Chinese disinformation agencies focusing on candidates in “tens” of races.\n\nCuba’s government has mounted a narrower operation aimed at boosting candidates it believes would favor better relations with the island, such as reduced economic sanctions.\n\nInfluence operations can include false or exaggerated claims and propaganda designed to mislead voters about specific candidates, issues or races. It can also include social media posts or other digital content that seeks to suppress the vote through intimidation or by giving voters false information about election procedures.\n\nAlong with cyberattacks on election systems, influence operations that stoke distrust and divisiveness are a critical threat facing the 2024 election, national security officials have said.\n\nState and local authorities have invested heavily in securing the vote that last week, Jen Easterly, director of the U.S. Cybersecurity and Infrastructure Security Agency, told The Associated Press there is no way a foreign adversary could alter the overall results.\n\nDisinformation can be a harder threat to quantify. Foreign adversaries create networks of fake websites and social media accounts mimicking Americans, and then work to amplify divisive and incendiary claims about contentious debates like immigration, the economy or the federal government’s response to disasters.\n\nOfficials in Russia, China, Iran and Cuba have all rejected accusations that their governments are trying to interfere with the U.S. election, despite indications that the use of disinformation designed to influence the outcome of this year’s elections is increasing.\n\nWhen foreign governments target a specific candidate, office or organization with election information they are often given what’s called a defensive briefing by intelligence officials. While ODNI won’t say how many defensive briefings they have delivered so far this election cycle, they say the number is three times higher than the previous cycle.\n\nIn the presidential race, intelligence officials have concluded that Russia supports Trump, who has criticized Ukraine and the NATO alliance while praising Russian President Vladimir Putin. They have assessed that China is taking a neutral stance in the race between the Republican former president and Vice President Kamala Harris, a Democrat.\n\nIran opposes Trump’s reelection, intelligence officials have said, seeing him as more likely to increase tension between Washington and Tehran. Trump’s administration ended a nuclear deal with Iran, reimposed sanctions and ordered the killing of Iranian Gen. Qassem Soleimani, an act that prompted Iran’s leaders to vow revenge.\n\nLast month federal authorities charged three Iranian men for their alleged involvement in Iran’s hacking of Trump’s campaign. Iran later offered the material to Trump’s Democratic opponent, but no one replied.\n\nOfficials said Monday they have seen no indications that Iranian disinformation is targeting down ballot races so far in 2024.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – It&#8217;s not just the presidential election: Foreign governments are targeting&#8230;\n\n\nThis Post: US adversaries spreading disinformation targeted at congressional races, according to intelligence officials first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/us-adversaries-spreading-disinformation-targeted-at-congressional-races-according-to-intelligence-officials/","image":"https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/WWO3PGMSYRH7HF53PF35MQXREY.jpg","video":null,"publish_date":"2024-10-07 22:51:07","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.019},{"id":258832324,"title":"What does the next year hold for the Middle East?","text":"No matter what political or military changes we see in the Middle East by 7 October 2025, it will certainly be a more fragmented region.\n\nNo individual power will create more coherence than the current state of affairs.\n\nThis level of conflict won’t last at this level of intensity for another year.\n\nIf Israel can’t win a short war, it can’t fight a long one. Its economy is too small, and the leadership’s hubris may prove to be a danger.\n\nFollow latest: Israeli jets hitting Lebanon with ‘extensive strikes’\n\nThe conflict will most likely resolve itself into a grumbling, open-ended war on three or four different fronts.\n\nThe only big change that might occur is if there is a significant upsurge of violence on the West Bank.\n\nIn the present atmosphere, a lot of Israeli fundamentalists would use that as an excuse to grab the whole area and expel the Palestinians who live there now.\n\nIsrael probably calculates, especially the right wing in the country, that this would be the moment when they could do that and the world would not be able to stop them.\n\nBut it may well be that Benjamin Netanyahu’s government will not survive another year, even though he’s on a high at the moment.\n\nAnd while it’s difficult to imagine any regime change in Iran that may alter the course of the conflict, Ayatollah Khamenei is in trouble.\n\n👉 Click to subscribe to the Sky News Daily wherever you get your podcasts 👈\n\nHis bluff has been called pretty thoroughly, with his strategy of manoeuvring through low-risk proxies in order to pressurise Israel and the West. Those proxies are being effectively dismantled by Israel.\n\nThis has left the regime losing face with its supporters, while the country is in great difficulty economically and socially.\n\nAnd they’ve got a leadership problem – Mr Khamenei is 85 years old.\n\nHe’s not going to be around for much longer and Pezeshkian, the new, reformist president, is being sidelined.\n\nBut repressive regimes can last an awfully long time by increasing the repression – which is what they’re doing. However, eventually all repressive regimes either collapse or change radically.\n\nThe other major factor in the future of the Middle East in the coming year is the outcome of the US presidential election in November.\n\nWe knew that US power over events in the region was declining, and has been declining for some years.\n\nBut it’s certainly declined at a much more rapid pace this year than expected.\n\nRead more:What life is like in a ‘city under siege’Timeline of events since 7 October\n\nNevertheless, if Kamala Harris wins the election, she’ll follow the basic Biden line, but will probably be tougher on Netanyahu and other Israeli politicians.\n\nShe would likely try to adjust American policy in favour of something more critical of Israel.\n\nIf Trump wins the election, the general belief is he will effectively give Netanyahu almost a free hand to pursue whatever policy he thinks is best.\n\nAnd he will certainly line up behind Netanyahu to exert maximum pressure on Iran.\n\nThe Democrats need this conflict like a hole in the head.\n\nMichigan, one of the seven key swing states, has a significant Arab population.\n\nAnd the Democratic vote is in danger of collapsing there as a result.\n\nHarris may lose the election thanks to Netanyahu, but Bibi may not mind that.","summary":"No matter what political or military changes we see in the Middle East by 7 October 2025, it will certainly be a more fragmented region. No individual power will create more coherence than the current state of affairs. This level of conflict won&#8217;t last at this level of intensity for another year. If Israel can&#8217;t &#8230;\n\n\nThe post What does the next year hold for the Middle East? appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/what-does-the-next-year-hold-for-the-middle-east/","image":"https://e3.365dm.com/24/10/1600x900/skynews-beirut-lebanon-explosion_6705519.jpg?20241003230258","video":null,"publish_date":"2024-10-07 22:48:01","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.286},{"id":258832348,"title":"Trump says immigrants commit crimes because ‘it’s in their genes’","text":"Former President Donald Trump on Monday said that ‘we got a lot of bad genes in our country right now’. (Picture: AP)\n\nEx-President Donald Trump in his latest scathing attack on immigrants has claimed that they commit crimes in the US due to their ‘genes’.\n\nTrump did not hold back in criticizing migrants with less than a month until the presidential election. \n\n‘How about allowing people to come to an open border, 13,000 of which were murderers, many of them murdered far more than one person, and they’re now happily living in the United States,’ Trump said on The Hugh Hewitt Show on Monday.\n\n‘You know now a murder, I believe this, it’s in their genes. And we got a lot of bad genes in our country right now.’\n\nRepublican presidential nominee Donald Trump has criticized immigrants on various occasions on the campaign trail (Picture: Reuters)\n\nTrump added that his 2024 opponent, Vice President Kamala Harris, wants to ‘feed people governmentally’ by going into a ‘Communist Party-type system’.\n\nThe former president also accused President Joe Biden’s administration of letting ‘425,000 people come into our country that shouldn’t be here, that are criminals’.\n\nAfter Trump’s comment, his campaign spokesperson Karoline Leavitt sought to clarify what he meant. She said Trump was ‘referring to murderers, not migrants’.\n\n‘It’s pretty disgusting the media is always so quick to defend murderers, rapists and illegal criminals if it means writing a bad headline about President Trump,’ stated Leavitt. \n\nFormer President Donald Trump claimed that his opponent Kamala Harris wants to ‘feed people governmentally’ by going into a ‘Communist Party-type system’. (Picture: Getty Images)\n\nThe White House called Trump’s remarks ‘echoing the grotesque rhetoric of fascists and violent white supremacists’.\n\nJust last week, Trump vowed that if elected, he will deport Haitian immigrants in Springfield, Ohio, which has received national attention after he pushed the baseless claim that they’re eating residents’ cats and dogs. \n\nAnd in December, Trump accused migrants of ‘poisoning the blood of our country’. The Biden campaigned likened that to the words of the late Nazi leader Adolf Hitler.\n\nThe number of border crossings decreased this year, according to US officials. \n\nTrump led Harris 53% to 42% on immigration in a New York Times/Siena poll in September.\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"Ex-President Donald Trump said 'we got a lot of bad genes in our country right now'.","url":"https://metro.co.uk/2024/10/07/donald-trump-immigrants-bad-genes-21752837/","image":"https://metro.co.uk/wp-content/uploads/2024/10/SEC_224832603-25f9.jpg?quality=90&strip=all","video":null,"publish_date":"2024-10-07 22:47:03","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.034},{"id":258832572,"title":"Hurricane Milton Grows Into Category 5 as Florida Prepares for Massive Evacuations and Storm Surge | Capitol Report","text":"Oct-07-2024\n\nVice President Kamala Harris leads in campaign funding. Is it enough to market her way to victory? Political marketing expert Peter Anthony Wynn joins us to assess the impact funding has on this election.\n\nFlorida is bracing for Hurricane Milton. How fast is the storm traveling now, how are residents preparing, and what does Flo...","summary":"Vice President Kamala Harris leads in campaign funding. Is it enough to market her way to victory? Political marketing expert Peter Anthony Wynn joins us to assess the impact funding has on this election. Florida is bracing for Hurricane Milton. How fast is the storm traveling now, how are residents preparing, and what does Florida [&#8230;]","url":"https://www.theepochtimes.com/epochtv/hurricane-milton-grows-into-category-5-as-florida-prepares-for-massive-evacuations-and-storm-surge-capitol-report-5737068","image":"https://img.theepochtimes.com/assets/uploads/2024/10/07/id5737201-CR_241007_HDtn_EN.jpg","video":null,"publish_date":"2024-10-07 22:46:49","author":"Steve Lance","authors":["Steve Lance"],"language":"en","source_country":"us","sentiment":0.392},{"id":258832510,"title":"Behind the music: Latino celebrities and presidential politics in the 2024 election","text":"The outreach to Latino voters by Republican and Democratic campaigns this year is especially noticeable in key battleground states where the Latino vote could be decisive for either party, and one of those states is Pennsylvania. It's the biggest of the battleground states, with 19 electoral votes at stake, and it's home to a sizable Latino community: 53% are Puerto Rican. The campaigns of both Vice President Kamala Harris and former President Donald Trump have been trying to connect with prominent Puerto Rican voices in the culture as a way to court a community that could prove decisive in November. In August, Puerto Rican reggaeton artists Anuel AA and Justin Quiles joined Trump on the campaign trail at a Pennsylvania rally in late August. Anuel AA endorsed Trump and slammed President Biden before speaking directly to Puerto Rican voters. \"So, all my Puerto Ricans, let's stay united — let's vote for Trump,\" he told the crowd, adding, \"he wants to help Puerto Rico grow and succeed as a country.\" Anuel AA has four albums that have hit No. 1 on Billboard's Latin albums chart, and has had sold-out tours in the U.S., South America and Europe, and Quiles has his own string of hit songs. But for those outside of the Latin music world, their names are relatively unknown, a point Trump himself made when introducing the two. \"I don't know if these people know who the hell you are, but it's good for the Puerto Rican vote. Every Puerto Rican is going to vote for Trump right now.\" And a few weeks later, at a rally in Las Vegas, his unfamiliarity with another Puerto Rican artist, Nicky Jam, was evident. Trump exclaimed, \"Do you know Nicky? She's hot!\" Nicky Jam is a man. Undeterred, Nicky Jam joined him on at the mic and told the crowd, \"We need Donald Trump as president again.\" This sparked an immediate backlash on social media among fans and fellow Latino artists who were both upset by the endorsement and who felt Nicky Jam had been insulted by the former president. Among those who criticized the artist was Mana, a Mexican rock band that removed a 2016 song with Nicky Jam and explained in a social media post that it \"does not work with racists.\" Nicky Jam ultimately took down his endorsement from Instagram. Democrats have also been courting the bloc, deploying Puerto Rican actors who support Harris to a rally in Bethlehem, Pennsylvania, in September. Liza Colon-Zayas, known for her role in the series \"The Bear\" and Anthony Ramos, who was part of the original Broadway cast of \"Hamilton,\" both campaigned for Harris on the seventh anniversary of Hurricane Maria's devastation of Puerto Rico. At the rally, Colon-Zayas reminded the crowd of the Trump administration's response to the hurricane. \"We remember after Hurricane Maria devastated the island, Trump blocked billions of dollars in hurricane relief,\" she said, adding, \"He disrespected us — how he called Puerto Rico 'dirty and poor' and tossed paper towels at us.\" As president, Trump withheld $20 billion in hurricane aid for three years, arguing the money would just be funneled into paying off the island's debt. A former Trump aide said that at one point, he even joked about a trade with Denmark: Puerto Rico for Greenland. In 2020, six weeks before the election, Trump released the aid.Those slights against Puerto Rico are a major part of the criticism being leveled against the artists who endorsed Trump. Nicky Jam, Anuel AA and Quiles have seen their social media pages have been flooded with comments calling them sellouts or out of touch with their own community. Ray Callazos, the Executive Director of UNIDOSUS, told CBS News, \"Issues related to the island of Puerto Rico and the Puerto Rican community still resonate strongly with Puerto Ricans in Pennsylvania.\" Callazos observed that the types of Latino surrogates backing each campaign are \"indicative of their target audience within the Latino community.\" He adds that while Harris has \"very mainstream Latino figures that appeal to an assimilated, English-speaking Latino,\" Trump's surrogates have \"a more street brand, a very macho man brand that's appealing to younger Latino men.\" It's been noted that the dream endorsement would be Bad Bunny, a global superstar who not only enjoys support from those younger Latino men, but also has crossover appeal as a mainstream cultural icon. Bad Bunny, a native of Puerto Rico, is no stranger to politics. He recently bought several billboards that heavily criticize the New Progressive Party currently in power on the island, saying a vote for them is a vote for corruption.Many of his song lyrics criticize the ineffective response by the government in Puerto Rico to crises like the major hurricanes that have pummeled the island in the last few years. While it's unclear who Bad Bunny would support in the presidential election, in 2017, during an interview with Billboard, he wore a shirt that seemed to take aim at then-President Trump. It read, \"Are you a tweeter or a president?\" Trump has offered scant detail about what he would do for the Puerto Rican community if elected, but polling shows his wider message is resonating with Latinos. A recent NBC/Telemundo poll of Latino voters found 40% of Latinos back Trump, an improvement from 2020, when he only received 32% of the Hispanic vote. Callazo says that Trump is likely winning more support among Latinos by \"targeting persuadable Latino voters on the margin,\" like younger Latinos. He also says the campaign has also focused on conservative religious communities around social issues. For her part, Harris has not articulated specific plans for Puerto Rico, either, and the Biden administration has faced its own challenges in addressing the island's needs. In February, a government accountability report found that of the $23 billion in FEMA funding allocated to rebuilt Puerto Rico after a series of hurricanes and earthquakes beginning with Hurricane Maria in 2017, just $1.8 billion had been spent, and $11.3 billion still requires FEMA approval before it can be disbursed. Puerto Ricans also want the government to crack down on wealthy American tax dodgers who have been speculating in real estate in Puerto Rico and are driving up housing costs for islanders, well beyond what they're able to afford. Problems like these have driven complaints in the Latino community that politicians on both sides of the aisle only seem to care about Latinos when they need a vote, only to be forgotten until the next election cycle. It's impossible to say whether any of the artists weighing in on the 2024 election will make a difference at the polls this fall, but they are an indication of the different kinds of outreach the parties are trying to move Latinos to the polls.Callazo says Puerto Rican voters he's spoken to in Pennsylvania \"want to be engaged authentically\" and that they are \"yearning for more outreach.\" He added that both campaigns \"need to invest more in direct voter contact that's culturally competent that resonates with this particular kind of Latino voter in Pennsylvania.\"","summary":"The Harris and Trump campaigns have been trying to connect with prominent Puerto Rican musicians and artists to help court voters who could be decisive in states like Pennsylvania.","url":"https://www.cbsnews.com/news/latino-musicians-trump-harris-2024-presidential-election/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/3d073722-a81c-4ff0-99d4-90b6da5d0d1c/thumbnail/1200x630g2/9c5a2d982e5a1cfea3401aa2c04d2fd2/gettyimages-2172286249.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3247815_hls/master.m3u8","publish_date":"2024-10-07 22:45:13","author":"Alexander Hunter","authors":["Alexander Hunter"],"language":"en","category":"politics","source_country":"US","sentiment":-0.287},{"id":258831852,"title":"Millions of Christians Not Voting Becomes 'Five-Alarm Fire' for Trump","text":"Conservative commentator Charlie Kirk warned that millions of born-again and mainline Christians choosing not to vote in the upcoming election could pose a serious threat to Donald Trump's reelection efforts.Citing survey data from pollster George Barna, Kirk described the situation as a \"five-alarm fire\" for Trump, noting that 41 million born-again Christians and 32 million mainline Christians are not planning to vote.\"The local church must be activated to explain why voting is critical,\" Kirk wrote in a post on X, formerly Twitter, urging Christian leaders to rally their congregations to the polls.\"We cannot expect President Trump to have a more Christian ethos if the Church refuses to vote. We cannot expect President Trump to be more pro-life if our own people don't back him up at the ballot box. The local church MUST be activated,\" Kirk said.Trump has heavily courted white conservative evangelicals since entering politics nearly a decade ago. He is now selling Trump-themed Bibles, touting the overturning of Roe v. Wade, and encouraging Christians to vote for him.According to AP VoteCast, a broad survey of voters, about 8 in 10 white evangelical voters cast a ballot for Trump in 2020.However, the potential voter shortfall comes at a time when Trump is facing challenges in maintaining support among Christian pastors.A recent Lifeway Research poll revealed a shift in his support among evangelical pastors since 2020. In the new poll, 61 percent of evangelical pastors said they plan to vote for Trump, down from 68 percent in September 2020.In the broader race, Trump held a 32-point lead over President Joe Biden in 2020 (53 percent to 21 percent), while the current poll shows him with a 26-point lead over Democratic nominee and Vice President Kamala Harris (50 percent to 24 percent).The decline in Trump's support among Christian and evangelical groups comes as the former president faces widespread criticism from these movements for his wavering stance on abortion during this campaign. Trump has repeatedly downplayed the importance of abortion, stating that it is no longer a \"big factor\" in elections and predicting it will become \"a very small issue\" in this year's vote.Moreover, Trump recently criticized Florida's six-week abortion ban, calling it \"too short\" and suggesting more time should be allowed before restricting abortion access, igniting backlash from anti-abortion advocates.Although Trump later reversed his stance, the damage to his reputation among staunch anti-abortion supporters, such as Southern Baptist leader Albert Mohler, had already been done. Mohler, a prominent figure in conservative Christian politics, warned that Trump's inconsistent positions might lead conservative Christian voters to either stay home or reconsider their choices in November.Meanwhile, grassroots efforts like Evangelicals for Harris are working to persuade disillusioned evangelical voters to support Harris or sit out the election altogether. Reverand Jim Ball, the group's president, said its focus is on mobilizing evangelical voters in swing states who may no longer feel comfortable supporting Trump but are hesitant to back a Democrat.","summary":"Charlie Kirk warned that millions of born-again and mainline Christians not voting could seriously threaten Trump's reelection.","url":"https://www.newsweek.com/christians-not-voting-five-alarm-fire-trump-1965304","image":"https://d.newsweek.com/en/full/2489629/trump-christians.jpg","video":null,"publish_date":"2024-10-07 22:43:41","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"US","sentiment":-0.245},{"id":258832290,"title":"'Traitor' Liz Cheney walloped by Wyoming voters for Harris endorsement, break with GOP","text":"Former Wyoming Republican Rep. Liz Cheney officially endorsed Vice President Harris for the Oval Office, breaking from the GOP to hit the campaign trail with the Democrat ticket in the key battleground state of Wisconsin last week. Fox News Digital traveled to Casper, Wyoming, over the weekend to speak to voters about their thoughts on the upcoming election and Cheney snubbing the Republican presidential ticket in favor of endorsing Harris this cycle. Voters in the Cowboy State overwhelmingly admonished Cheney for the endorsement, with some slamming her as a \"traitor\" and \"turncoat.\" \"I'm not impressed with that at all,\" Clark Johnson told Fox News Digital when asked about his thoughts on Cheney campaigning with Harris last week in Wisconsin. \"I think it's ridiculous. I think she's a traitor to the country,\" another Wyomingite, Gunner Berg, said of the campaign event. KAMALA HARRIS TEAMS UP WITH LIZ CHENEY IN BIRTHPLACE OF REPUBLICAN PARTY Cheney, who is the daughter of former Vice President Dick Cheney, is a vocal critic of former President Trump, putting her at odds with the Republican Party and her former constituents, who overwhelmingly supported Trump in his 2016 and 2020 elections. Wyoming is again expected to vote red this election. The vast majority of voters who spoke to Fox Digital from Casper said they are no fan of Cheney’s and that she would unlikely hold another elected office in Wyoming due to her politics. \"I'm definitely not a fan, and it definitely kind of turned some tables there,\" Dillon Sigman said, adding that he does not believe Cheney could again successfully run for office in Wyoming. \"I think Liz Cheney, who originally was a Wyoming person that moved to Connecticut and then returned to Wyoming wearing cowboy blue jeans and a cowboy rodeo belt buckle and seated herself, completely flipped and became a turncoat. Liz has gone totally Democratic and appears to be down the road of the DEI inclusion and all the other dysfunctional things that are going on in her government,\" said a Wyoming resident who identified himself as \"Ralph.\" \"I support her decision to campaign for whoever she chooses. However, I do not think that she is a voice for the Wyoming people. The majority of people I know do not back Kamala Harris or that campaign,\" Alicia Kellch told Fox Digital. NIKKI HALEY DEFENDS TRUMP SUPPORT AFTER BEING CALLED OUT BY LIZ CHENEY: 'THIS IS ABOUT AMERICA' Kellch said it is unlikely Cheney would be re-elected in Wyoming if she were to pursue such an avenue, adding that she believes many people who initially voted for Cheney feel \"sold out once they got her in office and realized what her true intentions were.\" Chuck Kucera added in an interview that Cheney is a \"backstabber,\" quipping that a Harris campaign event is \"probably a good place for her.\" John Shelton said Cheney could \"never\" run for office again in Wyoming and that he wouldn’t vote for her even \"if she's the last one to be voted for.\" One Wyoming resident told Fox Digital that Cheney teaming up with Harris didn’t \"bother\" him and didn't view it as an issue, while noting that \"most folks in Wyoming don't agree with\" Cheney endorsing Harris. JAN 6 COMMITTEE ALLEGEDLY SUPPRESSED TESTIMONY SHOWING TRUMP ADMIN PUSHED FOR NATIONAL GUARD PRESENCE: REPORT Two Wyoming residents told Fox News Digital they support Cheney teaming with Harris, with Jennifer Dillinger saying it was \"absolutely amazing.\" \"It's amazing how somebody who is extremely conservative, has been Republican her entire life but will support the Constitution and the country and not be specific for the party,\" Dillinger said, adding that it’s unlikely Cheney would make a successful return to Wyoming politics as the state is \"too conservative.\" TRUMP CALLS LIZ CHENEY A 'LOW IQ WAR HAWK' AFTER APPEARANCE IN SUPPORT OF HARRIS Another woman, Randi Chepke, said she’s \"thrilled that Liz Cheney is supporting Kamala Harris,\" arguing that Cheney is \"putting our country above her party.\" Chepke added that Cheney’s endorsement of Harris will \"absolutely\" encourage some Republican voters to cast ballots for Harris next month. \"I think that she is a die-hard conservative and that she is stating her case about why she thinks it's important to put democracy first. And, you know, frankly, democracy is much more important than the cost of a loaf of bread or a gallon of gas at this point in our lives,\" Chepke said. Cheney joined Harris in Ripon, Wisconsin, which bills itself as the birthplace of the GOP, on Thursday, and formally endorsed Harris for president. \"I have never voted for a Democrat, but this year I am proudly casting my vote for Vice President Kamala Harris,\" Cheney told the audience. \"As a conservative, as a patriot, as a mother, as someone who reveres our Constitution, I am honored to join her in this urgent cause.\" LIZ CHENEY CALLS SPEAKER JOHNSON ‘DANGEROUS’ FOR HELPING TRUMP ‘UNDERMINE OUR REPUBLIC' Harris praised Cheney as a leader who \"puts country above party and above self, a true patriot.\" Cheney was the third-most powerful Republican in Congress from 2019 to 2021 but saw her rising star fade in the party as she launched repeated attacks against Trump after the Jan. 6, 2021, riot at the Capitol. \"What is important is to recognize we just had a violent mob assault the U.S. Capitol in an attempt to prevent us from carrying out our constitutional duty,\" Cheney said on Jan. 6 after Trump supporters stormed into the Capitol. \"There is no question that the president formed the mob. The president incited the mob, the president addressed the mob. This is what America is not.\" HOUSE JAN 6 COMMITTEE DELETED MORE THAN 100 ENCRYPTED FILES DAYS BEFORE GOP TOOK MAJORITY: SOURCES Cheney went on to vote to impeach Trump on a charge of inciting an insurrection, sat on the House Select Committee on the January 6 Attack to investigate the protest and has continued leveling attacks on Trump this year. \"I ask you to stand in truth. To reject the depraved cruelty of Donald Trump,\" Cheney told the Harris supporters in Wisconsin last week. Trump has meanwhile slammed Cheney as \"a low IQ War Hawk\" who suffers \"gravely from Trump Derangement Syndrome.\" CLICK TO GET THE FOX NEWS APP Cheney lost her GOP congressional primary in Wyoming to Harriet Hageman in 2022, a candidate backed by Trump. She has not announced another run for political office, but Cheney has fueled speculation since leaving the House that she could one day run for president. Fox News Digital's Paul Steinhauser contributed to this report. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"An overwhelming amount of Wyoming voters who spoke to Fox News Digital lambasted former Republican Rep. Liz Cheney for endorsing Vice President Harris for the Oval Office.","url":"https://www.foxnews.com/politics/traitor-liz-cheney-walloped-wyoming-voters-harris-endorsement-break-gop","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/4-split-photo-2.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-07 22:42:20","author":"Emma Colton","authors":["Emma Colton"],"language":"en","source_country":"us","sentiment":-0.072}]}