{"offset":0,"number":50,"available":680,"news":[{"id":377360006,"title":"AI giant Anthropic’s ties to cult-like Effective Altruism movement, Democrat megadonors are on Trump admin’s ‘radar’","text":"Anthropic has been fighting to convince the Trump administration it isn’t “woke” – but that could be an uphill battle thanks to the AI giant’s ties to the bizarre, cult-like “Effective Altruism” movement, The Post has learned.\n\nPopular with Silicon Valley bigwigs, Effective Altruism urges devotees to funnel their cash to causes they believe will most benefit humanity in the future. Dubbed “long-termism” by followers, those causes include climate change, preventing pandemics — and a near-obsession with heavily regulating artificial intelligence.\n\n“They believe that only a handful of people can control access – that AI, if not in their hands, will be leveraged to destroy the world,” said Nathan Leamer, a former FCC policy adviser and CEO of Fixed Gear Strategies. \n\n“Truly, they have a fully ‘doomer’ apocalypse worldview,” Learner added. “Effective altruism is a governing philosophy that is entirely built on godless progressive ideas.”\n\nCritics note that EA’s crusade to save humanity hasn’t put a crimp on the extravagant lifestyles of its adherents — among them Sam Bankman-Fried. The disgraced FTX kingpin known as “SBF” built a luxury Bahamas beach condo with stolen customer funds, offering staff free massages while he rubbed elbows with celebrities. Elsewhere, EA leaders have drawn flak over their taste for private jets and medieval English manors.\n\nAnthropic — the firm behind the Claude chatbot — is led by CEO Dario Amodei, a 42-year-old, Princeton-trained physicist who once called Trump a “feudal warlord” in a now-deleted social media post and who backed Kamala Harris to be president in 2024.\n\nThe San Francisco company has relied heavily on cash from left-wing EA leaders and Democratic megadonors like SBF since its founding – a fact that hasn’t escaped the notice of key figures in Trumpworld, sources close to the situation told The Post.\n\nThe firm’s lefty ties are “certainly on the radar” of key decision makers and have hampered Anthropic’s ability to gain traction with the administration — whether it’s pushing AI policies or vying to win big federal contracts, a source close to the White House said.\n\n“The government is not going to want to contract with companies that do not have the nation’s best interests at heart,” the source added.\n\nThe White House press office didn’t return a request for comment.\n\nWhile Amodei has seldom been spotted alongside other tech executives at White House events, he has recently stepped up efforts to build relations with Trump. The Anthropic boss jetted off to Tokyo in late October for a dinner with President Trump and other business leaders, another source close to the situation said.\n\nAnthropic officials have also been briefing White House officials in recent weeks about their plans to roll out a privately funded compute and energy strategy to support AI development, the source added.\n\nMeanwhile, an Anthropic spokesperson pushed back on the notion that the firm has a rift with the White House, asserting that the company is aligned with the Trump administration’s views on a number of policies. \n\nAmodei has said on several occasions that he doesn’t identify as part of the EA community, the spokesperson added.\n\n“As Dario said in his statement, Anthropic is committed to constructive engagement on matters of public policy,” a company spokesperson said in a statement. “We fully believe that Anthropic, the administration, and leaders across the political spectrum want the same thing: to ensure that powerful AI technology benefits the American people and that America advances and secures its lead in AI development.” \n\nIn September, Semafor reported that Anthropic irked White House officials by barring federal contractors from using its tools for some law enforcement purposes, raising concerns that Anthropic could be “selectively enforcing its policies” over politics. \n\nAnthropic pushed back, noting that multiple federal agencies were currently using its models without issue. The firm’s policies bar the use of its AI tools for direct domestic surveillance and data collection, which is in line with rivals like OpenAI, Meta and Microsoft.\n\n“Anthropic is trying to smuggle ideology into federal rule-making under the banner of ‘safety’ and that is exactly what makes Trumpworld view them as hostile,” a former Trump administration official said. “It feels less like corporate engagement and more like political warfare.”\n\nSBF briefly became Anthropic’s biggest investor in April 2022 when he bought a $500 million stake using FTX customer funds. Prosecutors later blasted the now-jailed crypto fraudster for trying to float Effective Altruism as a justification for his misdeeds.\n\nAnthropic’s earliest backers included billionaire Facebook cofounder Dustin Moskovitz, who enjoyed influence with the Biden White House while bankrolling Democratic causes and various AI safety initiatives. Moskovitz has since transferred his stake in Anthropic into a nonprofit vehicle to avoid the appearance of conflicts of interests.\n\n“The EAs and Anthropic were killing it during the Biden years. Any official that Biden brought in as an adviser, either official or unofficial, was from this effective altruist worldview,” said Leamer. “They were living large for the four years from 2021 to 2024, and it’s been a total game change for them.”\n\nMoskovitz also launched Open Philanthropy, an EA-focused charity that in 2023 alone poured $15 million into Rand Corporation. The think tank reportedly played a key role in crafting President Biden’s executive order imposing guardrails on AI – which was revoked by Trump on his first day in office.\n\n“We believe that technology and scientific progress have drastically improved human well-being, which is why so much of our work focuses on these areas,” an Open Philanthropy spokesperson said. “AI has enormous potential to accelerate science, fuel economic growth, and expand human knowledge, but it also poses some unprecedented risks — a view shared by leaders across the political spectrum.”\n\n“We support thoughtful nonpartisan work to help manage those risks and realize the huge potential upsides of AI,” the spokesperson added.\n\nDario Amodei’s sister, Daniela, is married to Holden Karnofsky, who is widely credited as a leader of the EA movement. He served as CEO of Open Philanthropy before stepping down to take a role at Anthropic last year.\n\nDaniela Amodei tried to distance herself from the EA movement as recently as March, when she told Wired that she was “not an expert on effective altruism” and called it a “bit of an outdated term.”\n\nMeanwhile, Dario Amodei’s frequent warnings about potential AI doom, such as his claim of a 25% chance that things go “really, really badly” for humanity, have put Anthropic at odds with Trump officials who argue that an overemphasis on AI safety risks stifling innovation.\n\nLast month, Amodei – once blasted by White House AI czar David Sacks as an AI “doomer” and “committed leftist” – published a blog post that slammed “a recent uptick in inaccurate claims” about Anthropic’s politics, insisting the company was aligned with the Trump administration on “key areas of AI policy.”\n\nAmodei said in his blog post that Anthropic has “publicly praised President Trump’s AI Action Plan” and recently secured a $200 million contract with the US War Department.\n\n“Our longstanding position is that managing the societal impacts of AI should be a matter of policy over politics,” Amodei wrote.\n\nOutside of the EA movement, Netflix co-founder Reed Hastings, a deep-pocketed Democrat, sits on Anthropic’s board of directors. Other big backers include LinkedIn cofounder Reid Hoffman, a major antagonist to the GOP. \n\nSacks ripped Anthropic’s association with Hoffman while alleging on Oct. 14 that Anthropic wanted to “backdoor Woke AI and other AI regulations through Blue states like California.”\n\nAs The Post reported, Anthropic’s investors also include the Ford Foundation, a left-wing group recently blasted by Vice President JD Vance for being part of what he called an “NGO network that foments, facilitates and engages in violence” following the assassination of conservative activist Charlie Kirk.\n\nThe Ford Foundation acquired the minor stake during FTX’s bankruptcy proceedings.","summary":"Anthropic’s recent scramble to convince Trump administration it isn’t “woke” could be an impossible task – thanks in large part to the artificial intelligence firm’s close ties to the cult-like “Effective Altruism” movement, sources told The Post.","url":"https://nypost.com/2025/11/09/business/ai-giant-anthropics-ties-to-cult-like-effective-altruism-democrat-megadonors-on-trump-admins-radar/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/114983163.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/LcpCCRfe-RyIcpnTz.mp4","publish_date":"2025-11-09 21:35:37","author":"Thomas Barrabi","authors":["Thomas Barrabi"],"language":"en","category":"politics","source_country":"zm","sentiment":0.195},{"id":377357684,"title":"ELDER: Governor Gavin Newsom: I ‘hate’ politicians who lie (except Biden)","text":"— Accused ex-staffer Tara Reade of lying when she claimed that he sexually assaulted her. Kamala Harris, before becoming Biden’s running mate, sided with Reade.\n\n— Lied about his house almost burning down when there was a small, quickly extinguished fire in the kitchen.\n\n— Lied/misled about his mental decline and the use of the autopen.\n\n— Lied about Afghanistan, claiming no one advised him against the abrupt pullout when two generals testified to the contrary.\n\n— Had his administration claim the southern border was “not open” and later attributed the inability to close the borders to the lack of “comprehensive immigration reform.”\n\n— Misled the public about the efficacy of the COVID vaccine.\n\n— Lied about “not knowing” about Hunter Biden’s overseas businesses.\n\n— Lied about not pardoning Hunter.\n\n— Lied about the Hunter Biden laptop.\n\n— Omits what Trump said in his speech before the Jan. 6 “insurrection.”\n\nShall I keep going?\n\nRECOMMENDED VIDEO","summary":"California politician ignores Joe Biden's shameful record of prevarications, big and small.","url":"https://torontosun.com/opinion/columnists/governor-gavin-newsom-i-hate-politicians-who-lie","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/08/Gavin-Newsom.jpg?quality=100&strip=all","video":null,"publish_date":"2025-11-09 21:00:19","author":"Ian Shantz,Larry Elder","authors":["Ian Shantz","Larry Elder"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.394},{"id":377349638,"title":"Moore says \"we're not going to sit on our hands\" on redistricting","text":"Maryland Gov. Wes Moore on Sunday defended the creation of a redistricting committee to edge out the single Republican-held seat in his state, saying he's \"not sure why we should be playing by a different set of rules than Texas, or than Florida, or than Ohio or all these other places.\" \"I want this bipartisan commission to be able to actually speak with the people and to be able to go through their process and just simply say that if other states are going to go through this process, that we're not just going to sit on our hands because Donald Trump tells us to,\" Moore said on \"Face the Nation with Margaret Brennan. \"That's not the way this process is going to work.\" Last week, Moore announced he had formed a commission to explore mid-decade redistricting in the state, following the lead of President Trump's push to redraw districts in GOP-led states Texas, Missouri and North Carolina to net more seats for Republicans. While Democrats initially decried Mr. Trump's efforts as an attempt to create an unfair advantage for Republicans, California's Democratic Gov. Gavin Newsom pushed a ballot measure to redraw the state's congressional districts to gain up to five seats for Democrats. The measure, known as Prop 50, passed Tuesday with more than 60% of the vote, and an energized Newsom held a rally in Houston on Saturday, where he said Texas had \"woke us up.\" Eight of Maryland's nine House seats are already occupied by Democrats, a state former Vice President Kamala Harris won by more than 28 points in 2024. A redistricting effort would target the single Republican-held seat in the eastern part of the state. Maryland's commission is chaired by U.S. Sen. Angela Alsobrooks, a close ally of Moore's, and is comprised of Senate President Bill Ferguson, Maryland House Speaker Adrienne A. Jones, former Attorney General Brian Frosh and Cumberland Mayor Raymond Morriss. Maryland law dictates congressional maps are drawn by the state Assembly, where Democrats have a supermajority. Moore would have to call a special session of the Assembly to move forward with the effort. But Ferguson, a Democrat, has opposed the redistricting effort, writing in a letter last month that \"mid-cycle redistricting for Maryland presents a reality where the legal risks are too high, the timeline for action is dangerous, the downside risk to Democrats is catastrophic, and the certainty of our existing map would be undermined.\"Ferguson said last week the Democrats' election victories \"shows we don't need to rig the system to win.\"But Moore insisted Sunday that \"fighting for democracy is never risky.\" He noted that he and Ferguson agree that there is a \"crisis that Donald Trump has put us in.\"\"Where we differ is the urgency that this moment requires, the fight that this moment requires,\" Moore said. \"And I personally am someone who is not going to allow Donald Trump to determine whether or not Maryland follows this idea of saying, are we going to do everything we can to make sure we're preserving our democracy.\"","summary":"Maryland Gov. Wes Moore, a Democrat, announced last week the creation of a commission to look at mid-decade redistricting.","url":"https://www.cbsnews.com/news/wes-moore-maryland-redistricting-face-the-nation/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/11/09/f8f8fce7-6a0c-4d9e-9cf1-2ce2e6d1c313/thumbnail/1200x630/451b58b55ab7730fcb7515b70adebf3a/1762708613267.png","video":null,"publish_date":"2025-11-09 20:43:10","author":"Caroline Linton","authors":["Caroline Linton"],"language":"en","source_country":"US","sentiment":-0.455},{"id":377337352,"title":"Newsom digs at Biden, says Democrats no longer ‘old’ after Tuesday’s Republican rout","text":"Gov. Gavin Newsom portrayed himself and members of his party’s leadership in Congress as heralding a new era for Democrats on Sunday, while declaring that the past was behind them.\n\nIn doing so, he took a clear shot at the buttoned-up “concern” and failure to meet the urgency of the moment that seemed to define his party’s leaders through the Biden era, which much of the American left now looks upon with frustration as it plans for 2026 and 2028.\n\nNewsom gave an extended interview to CNN’s Jake Tapper, which aired Sunday on State of the Union. It’s the governor’s third domination of Washington’s Sunday news cycle in a row, as clear a sign as any that the two-term Californian plans to pursue national ambitions after his term ends in 2026. During it, he once again stated that he’d make considerations about running for president in 2027, once the midterm election cycle was over.\n\nBut he was clear on one point regarding his party’s future: The California redistricting push, he said, exemplified the new “fight fire with fire” attitude that Democrats would carry into the next elections.\n\n“I think Donald Trump did not expect what Californians did. He thought we would just try to win an argument by writing an op-ed. Maybe express disdain and concern,” Newsom said, calling those a representation of “the Democratic Party of old”.\n\nHe added that Tuesday’s election victories, including in California where a ballot measure to grant state officials the authority to redraw congressional maps ahead of the midterms, were signs that voters were clearly on their side.\n\n“What happened on Tuesday represents a new moment of clarity, conviction, purpose, energy on our toes, not on our heels, a resurgent Democratic Party,” he said. “That kind of momentum and direction is, I think, really going to enliven people in the next year.”\n\nThe governor’s jab at the former president was indirect, but not subtle. The former members of the Biden White House and their associated allies throughout the Democratic Party continue to face questions not about the party’s future, but its past: Namely, regarding why they didn’t raise concerns about the toll the president’s age and diminished capacities were taking not just on Biden himself, as he ran for re-election, but the party as a whole. Before the president dropped out of the race in the summer of 2024, Democrats like Tommy Vietor (formerly of the Obama White House, now a Pod Save America host) were reporting internal polling that indicated their party was on track for a nationwide bloodbath that would purge Democrats from government up and down the ballot.\n\nBut they also face questions about Biden’s actual time in the White House off the campaign trail, too; many remain furious that the Department of Justice, under Biden, waited until 2022 to take any serious action aimed at holding Donald Trump and his cronies accountable for the January 6 attack and the efforts to overturn the 2024 election. That lack of urgency, many Democrats argue, persists today as congressional leaders like House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer have faced criticisms from their base over whether they are presenting an adequate opposition front against the president’s right-wing agenda.\n\nOn Tuesday, when Democrats swept the GOP in a number of highly-watched statewide elections, a feeling of anger on the left was palpable. Gov.-elect Mikie Sherrill, in New Jersey, used language very similar to Newsom’s in interviews after her victory, telling CBS’s Margaret Brennan about her plan to address cost of living issues: \"I'm not writing a strongly worded letter. I'm not doing a 10-year plan. I'm on Day 1 declaring a state of emergency.”\n\nNewsom, however, credited the two Democratic leaders in his interview with Tapper for capitalizing on the anger felt by Democrats and independents alike, many of the latter of which broke for Trump over Kamala Harris in 2024 amid the Democratic collapse. He pointed to their strategy in dealing with Republicans under the ongoing federal government shutdown as reason why.\n\n\"I give Jeffries and Schumer tremendous credit,” said Newsom. “They've galvanized people of all political stripes — rural, urban, suburban — on the issue that defines so many problems in so many ways, and that's healthcare, and the anxiety people are about to feel with 100% to 388% increase in premiums.\"\n\nUnmentioned by the governor was Schumer’s public opposition to refusing Democratic votes for legislation to prevent a shutdown in March, when Democrats pressed him to use leverage against the White House to halt the DOGE-led slashing and burning of federal agencies including USAID.\n\nThe governor went on to identify Trump as the main obstacle preventing the re-opening of the government, arguing that the president going back on his position that the White House should lead negotiations with Congress (which Trump expressed publicly in a 2011 tweet) to avert or end a shutdown was evidence that Trump simply didn’t care enough to work to end this one.\n\n“He went golfing that weekend before the shutdown...He had no interest or energy into avoiding this government shutdown. He has no interest or energy to end it today; he’s the president of the United States!” exclaimed the governor. “You have a responsibility to convene, to bring people together...full stop.”\n\nTrump has spent this latest weekend on Truth Social complaining about the Democrats’ demands for their votes. Schumer, alongside some Senate Democrats, is floating a one-year extension of Affordable Care Act subsidies (which are necessary to prevent huge premium spikes for millions of Americans) as his party’s demand for enough votes to end a shutdown; Republicans continue to refuse, publicly, to negotiate and the various involved lawmakers haven’t been to the White House a single time to discuss the matter with the president or his team.\n\nAs the shutdown approaches the end of its 40th day, the president is now raising the issue, once again, of scrapping the Affordable Care Act altogether — this time with the added enticement of suggesting that the money the federal government supposedly saved would go right back into Americans’ pockets. This almost certainly won’t happen; during Trump’s first term Republicans tried and failed to repeal the Affordable Care Act and replace it, only to discover that the party had no unified vision of what that replacement should be. The vote failed in a major defeat that defined Trump’s first year as president in 2017.\n\nWith the president now openly spitballing on social media on the topic once again, Republicans are being forced to confront a reality that some in their own party, like the rebel GOP congresswoman of Georgia, Marjorie Taylor Greene, have pointed out: that there still is no health care plan or Obamacare alternative with the endorsement of Republican leadership or a majority of their caucuses in Washington.\n\n“We don’t have a formal [health care] proposal,” Treasury Secretary Scott Bessent admitted Sunday on ABC’s This Week.\n\nHe added: “The president's posting about it, but we have got to get the government reopened before we do this.”","summary":"‘He thought we would just try to win an argument by writing an op-ed,’ Newsom says of Trump as states war over redrawing midterm maps","url":"https://www.independent.co.uk/news/world/americas/us-politics/newsom-biden-old-democrats-2028-b2861785.html","image":"https://static.independent.co.uk/2025/11/09/19/37/newsom_cnn_1125.jpg?crop=426,284,x0,y0&trim=0,77,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/HK3HW82O-4VHSaSK0.mp4","publish_date":"2025-11-09 19:21:54","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.277},{"id":377310850,"title":"Anthony Kim blames \"climate anxiety\" for his 'shitty' chipping and putting in recent golf events","text":"Anthony Kim hasn't been in his top form in recent weeks, and the golfer recently pointed out why. On November 9, he uploaded a video of Kamala Harris' stepdaughter, who was expressing how recent climate changes have caused her climate anxiety. While reposting this video on X, Kim included a small caption of his own, implying that climate fear may have also had an impact on his game.The former LIV Golfer explained in his post that while he is quite good at putting and chipping, he has recently been struggling with it, which can be due to the climate. In addition to his comments, the golfer also added a laughing emoji. Anthony Kim also included the 1% better and sober is dope sentence in his X post to support the same movement.The X post by Anthony Kim read,\"Ball striking has finally shown up in tournament golf. Strongest part of my game is chipping and putting, & it has been total &#128169; the last two weeks, but I think it maybe climate anxiety&#129318;‍♂️&#128514; 1% BETTER SOBER is DOPE&#128293;\"Anthony Kim @AnthonyKim_GolfLINKBall striking has finally shown up in tournament golf. Strongest part of my game is chipping and putting & it has been total &#128169; the last two weeks but I think it maybe climate anxiety&#129318;‍♂️&#128514; 1% BETTER SOBER is DOPE&#128293;The last tournament Anthony Kim competed in was the Moutai Singapore Open, which was hosted by the Singapore Island Country Club. The tournament is regarded as one of the most important on the Asian Tour, and Anthony Kim was one of the biggest participants in this event. The former LIV Golfer fared well, finishing in the top 50.Anthony Kim finished the tournament with a total score of 8 under par, tied for 43rd place. He was fairly steady throughout the competition, recording rounds of 68, 69, 72, and 71.What was Anthony Kim's scorecard throughout the Moutai Singapore Open?Anthony Kim at the Moutai Singapore Open - Final Round - Source: GettyTalking more about Anthony Kim's scorecard in the Moutai Singapore Open, here's a detailed look at it:Round 1Hole 1 (Par 4): 4 Hole 2 (Par 4): 5 (Bogey)Hole 3 (Par 4): 3 (Birdie)Hole 4 (Par 5): 4 (Birdie)Hole 5 (Par 3): 3 Hole 6 (Par 4): 3 (Birdie)Hole 7 (Par 5): 4 (Birdie)Hole 8 (Par 3): 3 Hole 9 (Par 4): 4 Out: 33 (-3)Hole 10 (Par 4): 4 Hole 11 (Par 3): 3 Hole 12 (Par 5): 5 Hole 13 (Par 3): 3 Hole 14 (Par 4): 3 (Birdie)Hole 15 (Par 4): 5 (Bogey)Hole 16 (Par 4): 4 Hole 17 (Par 4): 4 Hole 18 (Par 5): 4 (Birdie)In: 35 (-1)Total: 68 (-4)Round 2Hole 1 (Par 4): 4 Hole 2 (Par 4): 4 Hole 3 (Par 4): 4 Hole 4 (Par 5): 3 (Eagle)Hole 5 (Par 3): 2 (Birdie)Hole 6 (Par 4): 4 Hole 7 (Par 5): 4 (Birdie)Hole 8 (Par 3): 2 (Birdie)Hole 9 (Par 4): 5 (Bogey)Out: 32 (-4)Hole 10 (Par 4): 4 Hole 11 (Par 3): 4 (Bogey)Hole 12 (Par 5): 6 (Bogey)Hole 13 (Par 3): 3 Hole 14 (Par 4): 4Hole 15 (Par 4): 4 Hole 16 (Par 4): 4 Hole 17 (Par 4): 4 Hole 18 (Par 5): 4 (Birdie)In: 37 (+1)Total: 69 (-3)Round 3Hole 1 (Par 4): 4 Hole 2 (Par 4): 4 Hole 3 (Par 4): 4 Hole 4 (Par 5): 4 (Birdie)Hole 5 (Par 3): 4 (Bogey)Hole 6 (Par 4): 4 Hole 7 (Par 5): 5 Hole 8 (Par 3): 3 Hole 9 (Par 4): 3 (Birdie)Out: 35 (-1)Hole 10 (Par 4): 5 (Bogey)Hole 11 (Par 3): 3 Hole 12 (Par 5): 5 Hole 13 (Par 3): 3 Hole 14 (Par 4): 5 (Bogey)Hole 15 (Par 4): 4 Hole 16 (Par 4): 4 Hole 17 (Par 4): 3 (Birdie)Hole 18 (Par 5): 5 In: 37 (+1)Total: 72 (par)Round 4Hole 1 (Par 4): 4 Hole 2 (Par 4): 4 Hole 3 (Par 4): 4 Hole 4 (Par 5): 5Hole 5 (Par 3): 3Hole 6 (Par 4): 5 (Bogey)Hole 7 (Par 5): 4 (Birdie)Hole 8 (Par 3): 2 (Birdie)Hole 9 (Par 4): 4Out: 35 (-1)Hole 10 (Par 4): 4Hole 11 (Par 3): 4 (Bogey)Hole 12 (Par 5): 4 (Birdie)Hole 13 (Par 3): 3Hole 14 (Par 4): 5 (Bogey)Hole 15 (Par 4): 4Hole 16 (Par 4): 3 (Birdie)Hole 17 (Par 4): 4 Hole 18 (Par 5): 5 In: 36 (par)Total: 71 (-1)","summary":"Anthony Kim hasn't been in his top form in recent weeks, and the golfer recently pointed out why.","url":"https://www.sportskeeda.com/golf/news-anthony-kim-blames-climate-anxiety-shitty-chipping-putting-recent-golf-events","image":"https://staticg.sportskeeda.com/editor/2025/11/29e4d-17627027490512-1920.jpg","video":null,"publish_date":"2025-11-09 17:40:32","author":"Anurag Bhardwaj","authors":["Anurag Bhardwaj"],"language":"en","source_country":"in","sentiment":0.274},{"id":377308896,"title":"Schiff dismisses Trump's call to send Obamacare subsidies directly to people","text":"Sen. Adam Schiff, D-Calif., on Sunday dismissed President Donald Trump's call this weekend for senators to redirect Affordable Care Act funds away from insurance companies and instead be sent \"directly to the people,\" telling ABC \"This Week\" anchor George Stephanopoulos that the proposal would undermine the ACA's protections for preexisting conditions. \n\n\"We have no idea what the president means by that, except it sounds like what he means is the same old, tired proposal of repealing the Affordable Care Act, giving people a benefit in the form of a health savings account, but allowing insurance companies once again to cancel policies and refuse to write policies for people who have preexisting health conditions,\" Schiff said. \n\nOn Saturday, Trump claimed on social media that Americans could purchase their own, \"much better healthcare,\" and have money \"left over\" if funds weren't allocated to \"money sucking Insurance Companies\" through the ACA.\n\n \"So the same insurance companies he's railing against in those tweets, he is saying 'I'm going to give you more power to cancel people's policies and not cover them if they have a pre-existing condition,' -- that was one of the main problems the ACA helped address,\" Schiff said. \n\nThe California Democrat said Trump's new proposal reveals the absence of a real health care plan from Republicans. He referenced a moment during Trump's general election debate against Democratic presidential nominee Kamala Harris in September 2024, when he was asked if he had a replacement plan for the ACA and said he had the \"concepts of a plan.\"\n\n\"So, no, I think what the president is revealing, once again, you know, more than eight years after he came down that golden escalator, they still don't have a health care plan. They're still back to what Trump once called 'the concept of a plan,'\" Schiff said. \n\n\"In the middle of a shutdown, when people are really hurting, we need more than concepts of a plan,\" Schiff said. \"Let's just extend the ACA for a year, reopen the government, and then we can negotiate a more permanent fix to this crisis,\" he concluded. \n\nSchiff suggested on Sunday that Republicans would \"cheat\" on any agreement Democrats ultimately reach with them in order to end the shutdown. \n\nFollowing the Democratic proposal made on Friday by Senate Minority Leader Chuck Schumer that asks for a one-year extension of Affordable Care Act subsidies in order to reopen the government -- an offer that Republicans have called a non-starter, maintaining that any health care negotiations would need to still come after the government opens back up, Schiff said that any agreement Democrats eventually reach to end the stalemate would require \"really solid guarantees\" in legislation that wouldn't be able to be defaulted on.\n\n\"We have the president telling us now, Republicans telling us now: they're not going to honor any agreement we reach with them. They're telling us 'We'll put money in whatever, money we agree on for a continued resolution to fund the government. But we're telling you in advance, we are going to rescind the funding you want,'\" Schiff said. \n\n\"They're telling us they're going to cheat on an agreement, and we need in whatever agreement we reach, to have some really solid guarantees in that legislation that they simply can't go and renege after it's done,\" he added, noting that there have been \"some talks\" in the Senate between members of both parties on a possible compromise. \n\nOn the 40th day of the shutdown, Schiff blasted Trump for his refusal to negotiate with Democrats in order to end the standoff, claiming too that Republicans are unable to make any deals without his approval.\n\nTrump said as recently as Sunday morning on his social media platform that he \"stands ready\" to work with both parties to solve the issue of health care \"once the government is open.\" \n\n\"[An end to the shutdown is] not going to happen until the president gets off the golf course, gets out of his ballroom planning, and sits down and negotiates,\" Schiff said. \"Otherwise, I think this is going to go on because Senate Republicans are going to do anything without the president's agreement and approval, and House Republicans are just content to stay away while people suffer.\" \n\nSchiff, who has been a proponent in the past of ending the Senate filibuster, said he'd still be \"happy\" for the rule to be eliminated -- but questioned the motives for Trump, and some other Republicans, pushing to see it go. \n\n\"I have continued to oppose the filibuster, and would be happy to do away with the filibuster, but the question is…for what reason?\" Schiff said. \n\nSchiff didn't say outright whether he'd now vote to oppose the filibuster.\n\n\"I would do away with it so that we can expand and protect people's freedoms and their rights. The Republicans and the president right now are talking about doing away with a filibuster so they can raise people's health care costs. That is the wrong reason to do away with a filibuster. And ultimately, what's going to protect American people?\"","summary":"Schiff suggests Republicans would \"cheat\" on any agreement Democrats ultimately reach with them in order to end the government shutdown.","url":"https://abcnews.go.com/Politics/schiff-republicans-cheat-shutdown-compromise/story?id=127350538","image":"https://i.abcnewsfe.com/a/8452853e-c439-4ce6-bcef-248a22762423/TW-SCHIFF-20251109-ABC-JH_1762698531479_hpMain_16x9.jpeg?w=1600","video":null,"publish_date":"2025-11-09 17:08:00","author":"Isabella Murray","authors":["Isabella Murray"],"language":"en","category":"politics","source_country":"us","sentiment":-0.485},{"id":377305338,"title":"How is race for California governor shaking out?","text":"Californians hoping for Sen. Alex Padilla to save them from the prospect of Gov. Katie Porter were certainly disappointed on Tuesday.\n\nDuring a news conference, the senator made official his decision to sit-out the 2026 gubernatorial race and to stay focused on his responsibilities in the United States Senate.\n\n“And so it is with a full heart and even more commitment than ever that I am choosing to not run for a governor of California next year,” Padilla said. “I choose not just to stay in the Senate, I choose to stay in this fight. Because the Constitution is worth fighting for. Our fundamental rights are worth fighting for. Our core values are worth fighting for. The American dream is worth fighting for.”\n\nPadilla, who previously served on the Los Angeles City Council, as a state senator in Sacramento and as secretary of state of California, was widely seen as a potential field-clearer if he chose to jump into the race for governor. But considering he was just elected to a full six-year Senate term in 2022, Padilla no doubt realized being a senator is much less of a headache than being governor of California. Who could blame him?\n\nWith Padilla and former Vice President Kamala Harris out, that leaves us with the current crop of candidates and a couple of lingering maybes.\n\nOn Friday, Nov. 7, polling from the Institute of Governmental Studies at the University of California, Berkeley confirmed that former Orange County Rep. and failed U.S. Senate candidate Katie Porter did serious damage to her political prospects with her recent outburst during an interview with CBS News reporter Julie Watts.\n\nWhile the Berkeley IGS poll found Porter in the lead in August with 17% of the vote, her support has now plummeted to 11%, putting her in second place.\n\nIn first place is Riverside County Sheriff Chad Bianco, a Republican, with 13%, up from 10% in August.\n\nFormer United States secretary of health and human services Xavier Becerra stood at 8% along with Republican pundit Steve Hilton.\n\nFormer Los Angeles Mayor Antonio Villaraigosa came in at 5%. Everyone else, from former Controller Betty Yee, current state Superintendent Tony Thurmond and the unannounced potential candidates Rick Caruso and Tom Steyer got 3% or less support.\n\nWith Caruso and Steyer choosing to throw their own money in support of the Proposition 50 campaign, it seems obvious they are angling for something. But neither of them have announced anything yet and it’s not obvious either of them could clear the field if they did choose to run.\n\nIn the meantime, the Villaraigosa campaign has launched attacks on both Porter and Becerra. His most recent ad on Becerra took aim at his handling of the child migrant crisis under President Biden and calls him “not fit to be governor.”\n\nMeanwhile, the Becerra campaign has declared him “the most viable Democratic alternative to embattled Katie Porter” and touts his record “holding the Trump Administration accountable.”\n\nYee, meanwhile, has chosen to tack left, saying in a recent interview, “I think transgender athletes are women athletes and they should be able to compete.”\n\nNeedless to say, this editorial board isn’t particularly impressed with the field of candidates so far.\n\nKatie Porter can’t handle a follow-up question.\n\nBianco is a deputy union puppet with the worst crime-solving rate among sheriffs in the state.\n\nHilton is a talking head with no record to speak of.\n\nBecerra covered for dirty cops in California as state AG and then fumbled in the Biden Cabinet.\n\nVillaraigosa gets kudos for sticking up for school choice, but even he thinks the bullet train is a good idea.\n\nYee dragged her feet on fiscal transparency as controller.\n\nThurmond supports gutting taxpayer protections and was nowhere to be seen during the coronavirus pandemic as kids suffered learning loss.\n\nNot exactly an inspiring field. Tom Steyer will certainly be a dud even with Democratic voters. Which leaves Rick Caruso, who has annoyed many with his strategy of burning money in an act of forgiveness for having been a Republican. But even so, he’s probably the most compelling potential option.","summary":"Californians hoping for Sen. Alex Padilla to save them from the prospect of Gov. Katie Porter were certainly disappointed on Tuesday.","url":"https://www.ocregister.com/2025/11/09/how-is-race-for-california-governor-shaking-out/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/sut-l-padilla-court-005.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-09 16:00:52","author":"The Editorial Board","authors":["The Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.155},{"id":377316230,"title":"Mainstream media is now mainly leaning right","text":"Most traditional media have long held a more left-leaning tone, but that’s changing. \n\nFrom on the ground reporting to the top executives, more conservative voices are making their way into the long-established outlets. Major changes may not be felt yet from those less involved in the media landscape, but let’s take a look at how these outlets might be making a shift to the right—and why.\n\nOne of the biggest changes began when the family of Larry Ellison, a billionaire buddy of President Donald Trump, took control of Paramount and, in turn, CBS News. It didn’t take long for top-down changes to begin. First, they tapped Kenneth Weinstein, the former head of conservative think tank Hudson Institute, to oversee public complaints as CBS News’ ombudsman. \n\nSoon after, Bari Weiss, the controversial creator of The Free Press—decribed as a “less shrill version of the anti-woke alarmism that permeates the right-wing media”—was brought on as CBS News’ editor-in-chief. \n\nAnd while it's all still hearsay, Weiss and her team are reportedly considering a move to bring Fox News on-air talent to CBS News should “CBS Mornings” anchor Gayle King make her primetime exit when her contract runs out next year.\n\nOver at the Jeff Bezos-owned Washington Post, though, matters have been moving more right for quite some time. \n\nIn February, the billionaire Amazon founder axed the Post’s balanced opinion section, informing readers and staff that they would only be publishing op-eds that address “personal liberties and free markets.” According to Bezos, the internet did enough supplying of other viewpoints. \n\nBut months later, Bezos passed the editorial mic to MAGA’s administration. One of the many former Fox News hosts who has turned into a Trump lackey, Jeanine Pirro, defended the president’s decision to invade Washington with the National Guard. \n\nNational Institutes of Health Director Jay Bhattacharya also took a spot on the Post’s homepage to argue in favor of ending research on the mRNA vaccine. To give you an idea where his loyalties lie, Bhattacharya’s wedding was officiated by Vice President JD Vance.\n\nThe New York Times has also faced plenty of criticism for its apparent softening on the Trump administration, both during his first and current administration. But if that wasn’t enough, the Times also has columnist Ezra Klein platforming far right conspiracy theorists like Ben Shapiro.\n\nAnd Time Magazine caved to the president after his role in securing a flimsy peace deal between Israel and Hamas. When Trump wasn’t satisfied with how he looked on the cover, the magazine changed its entire cover photo to appease him. \n\nCNN may be next, it seems. As the network is heading toward the buyers market, the Ellison family reportedly has the traditionally liberal outlet in their crosshairs. \n\nNow, the solemn, or comforting, fact of all of this is that legacy media doesn’t have the same editorial sway that it used to, especially now that social media and independent reporting has a seat at the table. \n\nHowever, these behemoth media outlets do control one aspect of news—what the world is focusing on. So as opinions and angles may differ across markets, an Ellison-controlled conservative media machine might be able to decide what they’re talking about.\n\nAs for why this shift is happening, there are a few possibilities. \n\nGiven Trump’s many multimillion dollar lawsuits against media outlets, a softer approach may just be the way to avoid lofty legal fees. \n\nAfter all, the president managed to squeeze $16 million out of Paramount, the parent company of CBS, while also coming after The New York Times and Rupert Murdoch’s Wall Street Journal for its reporting on the Epstein files.\n\nIn an unsurprising turn of events, Trump even appeared on the very show he clawed millions out of for editing an interview with former Vice President Kamala Harris. On Nov. 2, the president spent a whopping 90 minutes on “60 Minutes,” where he was even given the gift of an edited interview.\n\n“Actually, ‘60 Minutes’ paid me a lot of money, and you don’t have to put this on, because I don’t want to embarrass you, and I’m sure you’re not,” Trump said during the “60 Minutes” interview. \n\nIn what critics said was an attempt to avoid said embarrassment, CBS cut that part of Trump’s segment. However, the full version made its way out of CBS later anyway.\n\nThen again, these companies—and their millionaire or billionaire owners—might just be looking at what they perceive as a conservative call for news representation. \n\nIn recent years, there has been a growing demand for conservative media as well. This need was ultimately cornered by Fox News’ sensationalized conservative sway that changed broadcast journalism into the sexualized entertainment network it is today, especially for its female Fox News hosts. \n\nAnd with more conservatives abandoning more left-leaning media outlets, a change of political values might be on their fiscal table.\n\nBut no matter the way you spin it, the underlying message stands true: Legacy media is just another business, and they will always protect their bottom line.","summary":"Most traditional media have long held a more left-leaning tone, but that’s changing. \n\n\n\nFrom on the ground reporting to the top executives, more conservative voices are making their way into the long-established outlets. Major changes may not be felt yet from those less involved in the media landscape, but let’s take a look at how these outlets might be making a shift to the right—and why.\n\n\n\nOne of the biggest changes began when the family of Larry Ellison, a billionaire buddy of President Donald Trump, took control of Paramount and, in turn, CBS News. It didn’t take long for top-down changes to begin. First, they tapped Kenneth Weinstein, the former head of conservative think tank Hudson Institute, to oversee public complaints as CBS News’ ombudsman. \n\n\n\n\nLarry Ellison, chairman and chief technology officer of Oracle Corporation and now Paramount.\n\n\nSoon after, Bari Weiss, the controversial creator of The Free Press—decribed as a “less shrill version of the anti-woke alarmism that permeates the right-wing ","url":"https://www.dailykos.com/story/2025/11/9/2352105/-Mainstream-media-is-now-mainly-leaning-right?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1485519/story_image/AP19323500567770.jpg?1759779445","video":null,"publish_date":"2025-11-09 16:00:22","author":"Alix Breeden","authors":["Alix Breeden"],"language":"en","source_country":"US","sentiment":0.064},{"id":377367514,"title":"MSNBC 'MVP of the Week' Segment Salutes Anti-ICE Sandwich-Tosser, Mamdani, Dick Cheney","text":"MSNBC's The 11th Hour\n\nNovember 7, 2025\n\n11:51 p.m. Eastern\n\nSTEPHANIE RUHLE: It is time now for everybody's \"MVP of the Week,\" and it's been a big one. Who's yours?\n\nSAMI SAGE, CO-FOUNDER OF BETCHES: The D.C. sandwich guy who was found not guilty of assaulting an ICE officer, and I just think it's a lovely, you know, non-violent type of resistance.\n\nRUHLE: Throwing a -- what -- throwing a sandwich?\n\nSAGE: Yeah, why not?\n\nRUHLE: All right, who's your guy?\n\nSTEVE LIESMAN, CNBC SENIOR ECONOMICS REPORTER: Guys, and girls, I picked the jurors in the trial.\n\nRUHLE: Oh, in the -- in the sandwich trial?\n\nLIESMAN: In the sandwich guy. I was, like, standing up for, you know, against sort of stupidity.\n\nRUHLE: Well, complete stupidity. If you think about the amount of time and the money (inaudible) the Department of Justice --\n\nLIESMAN: To come to court on a misdemeanor? Are you kidding me? I like the fact that the jurors stand up. They're my MVPs of the week.\n\nSAGE: Did you read the reporting about how the officer was like, \"I could smell the pickles and the onions --\"\n\nCHRISTINA GREER, FORDHAM UNIVERSITY POLITICAL SCIENCE PROFESSOR: The mustard\n\nSAGE: The mustard. He was very dramatic.\n\nRUHLE: Okay, okay, okay, while people are being thrown to the ground.\n\nGREER: Kidnapped -- broad daylight.\n\nSAGE: He was hit with bread.\n\nLIESMAN: I don't advocate throwing sandwiches.\n\nSAGE: No, it's --\n\nLIESMAN: Especially if they're good sandwiches.\n\nSAGE: But it's not assault.\n\nGREER: I chose Zohran Kwame Mamdani.\n\nRUHLE (laughing): You're kidding -- I can't believe it.\n\nGREER: I know -- the 111th mayor of New York City to be. I'm just -- I'm optimistic by the coalition that he's built -- by the conversation that he's started. And I'm going to read about Laguardia and Lindsey and Dinkins and Bloomberg to sort of help me contextualize this moment.\n\nLIESMAN: You just wanted something for your next book.\n\nGREER: Yeah, well, yeah.\n\nLIESMAN: It's a heck of a topic, right?\n\nRUHLE: Do you think -- do you think -- I remember the day after Mike Bloomberg whom I used to work for Mike Bloomberg -- the day after Mike Bloomberg won, some of the first people he met with was Randi Weingarten from the -- from -- from -- from the teacher's union who was certainly not a fan. Met with Reverend Al (Sharpton) who was definitely not on his team and said, \"I'm the mayor of New York, I'm going to be the mayor for everyone.\" Do you believe that's the route that he's going to take?\n\nGREER: Absolutely. We are in a transition period. The beauty of New York is that our mayor gets sworn in on January 1. He's got the rest of November and all of December to meet with a lot of groups that he did not have time to meet with to have hard conversations. And he's putting people in place to figure out the best commissioners to help him work with. The business community does matter to New York. Nobody is going to say it doesn't. But you know what? Poor people actually matter to New York, too.\n\nRUHLE: Absolutely. And in his defense, didn't necessarily have to be he didn't have time to meet with them. There was a lot of people that weren't in his corner, and now he's the mayor, and all those big stakeholders in this city can say, \"We all love New York -- how do we help it thrive?\"\n\nTOM ROGERS, CNBC FOUNDER: I might be a little surprising because he was a Darth Vader for much of MSNBC's history, but Dick Cheney, former Vice President of the United States who died this week, who said -- courageously I think -- that Donald Trump should never be near the presidency again, and came out publicly and said he was voting for Kamala Harris.\n\nAnd I think it's just proof that no matter how partisan you are, when it comes to a red line and our democratic values that some people are willing to stand up, be counted, and show that they stand for what the United States is all about, and Dick Cheney did that.\n\nRUHLE: You could dislike his politics, but he certainly stood up for democracy.","summary":"On Friday's The 11th Hour on MSNBC, panelists all went left in their choices for MVP of the week with praise going to the man who threw a sandwich at an ICE agent in D.C., the jury that acquitted him, and socialist Mayor-elect Zohran Mamdani (D-New  York).\n\nHost Stephanie Ruhle first went to Betches co-founder Sami Sage who oozed: \"The D.C. sandwich guy who was found not guilty of assaulting an ICE officer, and I just think it's a lovely, you know, non-violent type of resistance.\" If someone threw a sandwich at Sage, would she find it \"nonviolent\"?\n\nAfter Ruhle responded, \"Throwing a sandwich?\" Sage added: \"Yeah, why not?\"\n\nAs CNBC economics reporter Steve Liesman was second to go, he was thinking along the same lines, appreciating Resistance-backing DC juries, leading to agreement from Ruhle:\n\n\n\n\nSTEVE LIESMAN: Guys, and girls, I picked the jurors in the trial.\n\nRUHLE: Oh, in the -- in the sandwich trial?\n\nLIESMAN: In the sandwich guy. I was, like, standing up for, you know, against sort of stupidity.\n\nRUHLE","url":"https://www.newsbusters.org/blogs/nb/brad-wilmouth/2025/11/09/msnbc-mvp-week-segment-salutes-anti-ice-sandwich-tosser-mamdani","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-11/The%2011th%20Hour%20With%20Stephanie%20Ruhle-ruhle-2025-11-07-0.jpg?itok=YsNgiqt7","video":null,"publish_date":"2025-11-09 14:55:00","author":"Brad Wilmouth","authors":["Brad Wilmouth"],"language":"en","category":"politics","source_country":"US","sentiment":-0.225},{"id":377274920,"title":"Dick Cheney’s Ghost Haunts Donald Trump—Inside Their Bitter, Unfinished Feud","text":"It’s the showdown no one saw coming. Twenty years ago, Dick Cheney defined conservatism, yet he wound up railing against his own party’s leader. While many Republicans paid tribute to Cheney’s decades of public service (Wyoming’s John Barrasso calling him a “towering figure” and George W. Bush hailing him as “decent and honorable”), Donald Trump was silent.\n\nWhile Trump embodies the Republican Party’s populist revolution, Cheney was the maker of the old guard who called out Trump’s leadership style. “In our nation’s 248-year history, there has never been an individual who is a greater threat to our republic than Donald Trump,” Cheney declared in an endorsement. And he also backed Democratic candidate Kamala Harris before the 2024 election.\n\nRELATED: Kamala Harris Might Be Gearing up For 2028 Presidential Run, Here Are The Signs\n\nBut then again, Dick Cheney wasn’t new to roasting Donald Trump. In 2022, he was in an ad for his daughter Liz’s doomed re-election campaign, where he called Trump “a coward.” Cheney’s line, “a real man wouldn’t lie to his supporters,” was aimed at MAGA nation and was also a wink to Liz’s work on the January 6 committee. In another lifetime, Dick Cheney’s brand of “cowboy diplomacy” used to be protested. But now, in an odd twist, liberals found themselves nodding along.\n\nThis is the only thing liberals are talking about regarding Dick Cheney right now. How he “stood up to Trump”\nYou do not hate liberals enough pic.twitter.com/bqUtEgGfjX\n— Nick Cruse 🥋 (@SocialistMMA) November 4, 2025\n\nThis wasn’t a late-life mellowing, either. Dick Cheney’s disgust for Trump dates back at least to 2015, which was when he rejected the then-candidate’s call to ban Muslims in general. Cheney had said that it was an insult to American values.\n\nDick Cheney’s death reignited debates across the aisle. Some conservatives remembered his devotion to American “strength and founding values,” while critics (on both the left and the right) stuck to their narrative. Progressive troublemakers labeled him “one of the most evil people to exist in modern history.” Alex Jones declared, “He’s burning in hell”.\n\nDick Cheney’s firm opposition to Donald Trump and MAGA politics defined his later years, even though his past left bruises in Iraq, surveillance programs, and the GOP’s own culture. Many think that the fact that Mr. “Axis of Evil” himself became a champion for constitutional values speaks volumne about the changing basis for American political conservatism.\n\nDick Cheney’s life should not be celebrated.\n4,419 United States Military members died for him under false pretenses.\n210,000 innocent Iraqi civilians killed under his false pretenses. pic.twitter.com/lloAsAyYoO\n— Trump Tracker (@trackingdonald) November 4, 2025\n\nAfter Dick Cheney supported Harris, Donald Trump commented, “Dick Cheney is an irrelevant RINO, along with his daughter.” Despite Cheney’s fierceness, Trump’s insulting electoral strategy is still undefeated, at least on social media.\n\nDick Cheney may have caused as much outrage as awe, but his final message was a warning. With a shot pointed at the man who was acting like the bar’s owner, the cowboy walked out of the saloon. Whether you liked him or not, Cheney sure delivered the punchline.\n\nNEXT UP: Former Vice President Dick Cheney, Vocal Anti-Trump Republican, Dies at 84","summary":"Cheney's final stand was rather surprising.","url":"https://www.inquisitr.com/dick-cheneys-ghost-haunts-donald-trump-inside-their-bitter-unfinished-feud","image":"https://www.inquisitr.com/wp-content/uploads/2025/11/Dick-Cheney-warned-America-about-Donald-Trump.jpg","video":null,"publish_date":"2025-11-09 14:30:49","author":"Sohini Sengupta","authors":["Sohini Sengupta"],"language":"en","category":"politics","source_country":"US","sentiment":-0.171},{"id":377302998,"title":"Mamdani’s win reshapes Jewish Democrats as Israel-Gaza divide upends New York politics","text":"Zohran Mamdani’s election as New York’s next mayor exposed a deepening rift between traditional Democratic Jewish voters and younger progressives — one that could reshape politics for years in the metropolitan area with the world’s largest Jewish population outside Israel. Mamdani, a 34-year-old democratic socialist, handily defeated Andrew Cuomo, the Democratic former governor of New York who ran as an independent, while beating back accusations of antisemitism over his support of Palestinians in the conflict in Gaza. A Muslim immigrant, Mamdani benefited from a wave of anger over Israel’s conduct in Gaza among some Democrats and Jewish Americans who had initially supported it but grew disillusioned. That shift manifested itself in spring protests at Columbia University last year that Mamdani supported and politically benefited from. A Pew Research Center poll last year found that just half of Jewish Americans under 35 said the way Israel has carried out the war has been acceptable, while 68% of Jews ages 50 and older said it was acceptable. In New York, about one-third of Jewish voters in Tuesday's election supported Mamdani, exit polls showed, powering a victory that alarmed his Jewish opponents, unaccustomed to backing the losing candidate. “The morning after the election, many members of our community woke up with a sense of unease,” said Hindy Poupko, a senior vice president at the UJA-Federation of New York, a major Jewish nonprofit. “There's a lot of uncertainty about how Mayor Mamdani might act once in City Hall.” Mamdani was tested quickly. When, in the hours after his election, antisemitic graffiti was scrawled on a Brooklyn Jewish Day School, the mayor-elect condemned the act. “As Mayor, I will always stand steadfast with our Jewish neighbors to root the scourge of antisemitism out of our city,” he posted on X. 'Globalize the Intifada' Jewish opponents of Mamdani expressed concern about his refusal to condemn the phrase \"globalize the intifada,\" a slogan of support for Palestinians that some interpret as a call to violence against Jewish people. After his nomination, Mamdani privately told a group of business leaders that he would not use the phrase and would discourage others from using it, according to a July New York Times report. He has said he supports the Boycott, Divestment, Sanctions, or BDS, movement, which calls for the economic and cultural boycott of Israel. The Anti-Defamation League last week launched a “Mamdani Monitor” to track his executive appointments and other actions for potential harm to the Jewish community. It also established a tip line for New York residents to report incidents of antisemitism. “Our job is quite simple - to protect the Jewish people,” said Jonathan Greenblatt, the group's chief executive. Courting voters Amidst the Democratic divisions over Israel's conduct in Gaza, Republican President Donald Trump, an ardent backer of Israeli Prime Minister Benjamin Netanyahu, has made the case to Jewish voters that his party is a better home. That appeal came despite the fact that Trump's 2024 rival, Democrat Kamala Harris, won 79% of the white, Jewish vote in 2024, according to exit polls. Trump said on Tuesday any Jewish voter who supported Mamdani was a \"stupid person.” The Republican Party was rocked by accusations of antisemitism after right-wing pundit Tucker Carlson hosted white nationalist Nick Fuentes last month for a sympathetic interview on his podcast. Carlson, a former Fox News Channel personality, was denounced by Republican lawmakers including U.S. Senator Ted Cruz of Texas, who this week said, “a handful of voices are spreading this garbage, and it is giving everyone of us a time for choosing.” Republicans plan to seize on Mamdani’s election to court more Jewish support in next year’s midterms, when control of Congress is at stake. That backing could prove pivotal in swing districts like the one north of New York City held by Republican Mike Lawler. “Mamdani’s ascent to Gracie Mansion could rewrite the playbook for Republicans, tightening their hold on the U.S. House,” said Ford O’Connell, a Republican strategist, referring to the New York mayor's official residence. Mamdani also promises to be a factor in next year's race for New York governor. Elise Stefanik, a top Trump ally, said last week she will seek the Republican nomination and assailed Democratic Governor Kathy Hochul for endorsing Mamdani. A splintering block The city's expense and high cost of living were central to Mamdani's campaign, fueling a surge of support among young progressive voters. Even some of Mamdani’s detractors, like Greenblatt, credit his victory to his relentless focus on pocketbook issues. Mamdani’s Jewish supporters said the election proves that the Jewish vote is far from monolithic. “I support Mamdani not in spite of his views on Israel and Palestine but because of them,” said Roni Zahavi-Brunner, 26, an Israeli who canvassed for the candidate. “I don’t think that speaking out against genocide is that big of a risk.” Others rallied to Cuomo, 67, because of his support for Israel. “I feel deflated,” said Alison Devlin, 50, a Jewish resident of Manhattan's Upper East Side who voted for Cuomo. “I definitely feel concerned because I am openly Jewish, I am openly Zionist.” She added, “I don't know what is going to happen. I don't know if I'm staying in the city after this.” Corinne Greenblatt, 27, who works in higher education in the city, said she appreciated the way Mamdani was “interested in reaching out to a really broad range of the Jewish community, not just those who are completely in political agreement with him, because the Jewish community is very politically diverse.” The war in Gaza, Corinne Greenblatt said, has brought a “sea change in Jewish politics now, where it's very clear that there are pro-Palestine Jews, there are pro-Israel Jews. There are Jews who have no relationship to Israel.” Andrue Kahn, a Brooklyn rabbi, said that Mamdani has repeatedly affirmed his commitment to fight antisemitism and criticized groups such as the ADL for “deepening division by using Jewish fear as a reason for surveillance.” “Let's give him a chance to show that his commitment to fighting antisemitism is legitimate, and work with him to build the kinds of cross-community solidarity that make all New Yorkers safer,” Kahn said.","summary":"Progressive Muslim Zohran Mamdani’s mayoral win over Andrew Cuomo exposes deep divisions among New York’s Jewish voters and reshapes the city’s political landscape amid tensions over Israel’s war in Gaza","url":"https://www.ynetnews.com/article/h1pb2zryzg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/11/09/r1NPwfCybg/r1NPwfCybg_0_0_3000_1688_0_large.jpg","video":null,"publish_date":"2025-11-09 14:30:35","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"il","sentiment":0.113},{"id":377278662,"title":"‘Wicked’ director says movie theaters are ‘a space that we have to protect’","text":"‘Wicked’ director says movie theaters are ‘a space that we have to protect’\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\n‘Wicked’ director says movie theaters are ‘a space that we have to protect’\n\nNov. 9, 202508:22\n\nHakeem Jeffries says ‘I hope’ shutdown ends before Thanksgiving: Full interview\n\nHakeem Jeffries says Democrats will 'definitely' win back the House in 2026 after election sweep\n\nSen. Lankford says claims that GOP ‘weaponizing hunger’ over SNAP is ‘painful spin’: Full interview\n\nGOP Sen. Lankford bucks Trump, says ‘we should not get rid of the filibuster’\n\nNow Playing\n\n‘Wicked’ director says movie theaters are ‘a space that we have to protect’\n\nJon M. Chu on ‘Wicked,’ A.I. and Asian representation in Hollywood: Full interview\n\nICE considers retrofitting warehouses for immigrant detention centers\n\nRepublicans need to stop ‘my way or the highway’ negotiating strategy on shutdown: House Democrat\n\n'The pressure will have to continue' on Israel to let aid to Gaza in, fmr. Biden adviser says\n\nAir traffic controllers union chief says it will ‘take months’ to recover from shutdown\n\nGOP 'playing politics with hunger' as judge orders SNAP funding, Rep. Debbie Dingell says\n\nSupreme Court appears skeptical of Trump's tariffs argument\n\nElection results show voters 'want leaders focused on their problems,' says Virginia Democrat\n\nKornacki: How Mikie Sherrill swept New Jersey despite Trump’s 2024 gains\n\nKornacki: Cuomo ‘needs Republicans’ if he has ‘any chance’ in NYC mayor’s race\n\nGraham Platner 'vigorously' making the case against establishment candidates for Maine Senate seat\n\nSNAP contingency fund ‘isn’t enough,’ says Illinois Gov. Pritzker\n\nKornacki: NBC News poll shows Democrats ‘opening up a lead’ over Republicans on generic ballot\n\nSteve Kornacki: Most voters blame Republicans for shutdown in new NBC News poll\n\nGavin Newsom defends sticking by Biden, addresses Kamala Harris’ 2024 loss\n\nMeet the Press\n\n‘Wicked’ director says movie theaters are ‘a space that we have to protect’\n\n“Wicked: For Good” director Jon M. Chu tells Kristen Welker that movie theaters are “one of our last analog spaces” as he reflects on the return of big-screen musicals and the communal power of shared storytelling.Nov. 9, 2025\n\nGet more newsLiveon\n\nHakeem Jeffries says ‘I hope’ shutdown ends before Thanksgiving: Full interview\n\nHakeem Jeffries says Democrats will 'definitely' win back the House in 2026 after election sweep\n\nSen. Lankford says claims that GOP ‘weaponizing hunger’ over SNAP is ‘painful spin’: Full interview\n\nGOP Sen. Lankford bucks Trump, says ‘we should not get rid of the filibuster’\n\nNow Playing\n\n‘Wicked’ director says movie theaters are ‘a space that we have to protect’\n\nJon M. Chu on ‘Wicked,’ A.I. and Asian representation in Hollywood: Full interview\n\nGet more newsLiveon\n\nBest of NBC News\n\nMeet the Press\n\n‘Wicked’ director says movie theaters are ‘a space that we have to protect’\n\nMeet the Press\n\nGOP Sen. Lankford bucks Trump, says ‘we should not get rid of the filibuster’\n\nMeet the Press\n\nJon M. Chu on ‘Wicked,’ A.I. and Asian representation in Hollywood: Full interview\n\nMeet the Press\n\nSen. Lankford says claims that GOP ‘weaponizing hunger’ over SNAP is ‘painful spin’: Full interview\n\nMeet the Press\n\nHakeem Jeffries says ‘I hope’ shutdown ends before Thanksgiving: Full interview\n\nMeet the Press\n\nHakeem Jeffries says Democrats will 'definitely' win back the House in 2026 after election sweep","summary":"“Wicked: For Good” director Jon M. Chu tells Kristen Welker that movie theaters are “one of our last analog spaces” as he reflects on the return of big-screen musicals and the communal power of shared storytelling.","url":"https://www.nbcnews.com/meet-the-press/video/-wicked-director-says-movie-theaters-are-a-space-that-we-have-to-protect-251637317807","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_11/1762697250804_mtp_clip_chushowcut_251109_1920x1080-4fq9fr.jpg","video":null,"publish_date":"2025-11-09 14:07:37","author":null,"language":"en","source_country":"na","sentiment":-0.287},{"id":377274130,"title":"CEO boasts his booming firm that 'powers ICE' is the first 'completely anti-woke' company","text":"Palantir founder and CEO Alex Karp claimed on an earnings call this week that his company is the first to be 'completely anti-woke.'\n\nHe repeatedly said Palantir, a surveillance software firm that builds tools to help governments and corporations work with large data sets, is supporting the 'American warfighter' and is committed to free speech.\n\nHe told investors that they are 'fighting for the right side of what should work in this country,' which included 'lethal technology' and products that enrich working class men and women.\n\nPalantir raked in nearly $1.2 billion in the third quarter ending in September, a 63 percent year over year increase. \n\nKarp, who is worth $18.4 billion largely thanks to Palantir's stock appreciation over the last several years, boasted about how his company powers Immigration and Customs Enforcement (ICE) and other war efforts around the world.\n\n'We power efforts to defend America and Ukraine,' he said. 'We're on the front line of all adversaries, including vis-a-vis China... and we've supported Israel.'\n\n'I don't know why this is all controversial, but many people find that controversial,' he added.\n\nNot everyone at the company is on board with its move toward supporting the Trump administration's domestic and foreign policy objectives.\n\nPalantir's communications chief, Lisa Gordon, called the company's political shift 'concerning' in an interview at a summit hosted by tech news site The Information in late October.\n\n'I think it’s going to be challenging, as a lot of the company is moving pro-Trump, you know, is moving in a certain direction,' she said at the women-focused panel.\n\nShe also described Karp as 'very progressive' but 'frustration with the Democrats has moved him in a certain direction.'\n\nKarp supported former Vice President Kamala Harris, who lost to Trump last November.\n\nKarp recently said he supports Trump's posture on immigration and national security.\n\nThe pivot came after Palantir was awarded a $30 million contract in April to build 'ImmigrationOS', which helps ICE decide who to deport and track those who are self deporting.\n\nThe Department of Homeland Security (DHS) began using it in late September, despite lawsuits from privacy advocates who say the system tramples on people's civil rights.\n\nPalantir has defended itself by saying it is only providing a tool and is not actively deciding who gets deported.\n\nThe company has had a close relationship with ICE and elements of DHS since at least 2010, when it first supplied the Homeland Security Investigations division with FALCON.\n\nThis system, which is still used, allows ICE agents to perform detailed searches for criminal suspects using phone records, driver's licenses, employment history, financial transactions and more.\n\nPalantir has also worked with large city police forces, most notably the Los Angeles Police Department (LAPD).\n\nThe LAPD's Operation Laser used Palantir software to predict where crime was the most likely to happen. \n\nThis so-called predictive policing was based on where gun-related crimes, arrests and 911 calls most often originated.\n\nThe LAPD shut down Operation Laser in April 2019 after critics said it was a new form of discrimination against minority communities.\n\nPalantir had a similar arrangement with the New Orleans Police Department from 2012 to 2018, unbeknownst to the city council members. Again, the program was shuttered once the public became aware.","summary":"The chief executive and founder of one of America's biggest data analytics firms has said his company is 'completely anti-woke' as it continues to help Immigration and Customs Enforcement.","url":"https://www.dailymail.co.uk/news/article-15265263/ceo-palantir-anti-woke-ICE-arrests-alex-karp.html","image":"https://i.dailymail.co.uk/1s/2025/11/06/16/103649841-0-image-m-24_1762448270343.jpg","video":null,"publish_date":"2025-11-09 13:14:39","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","source_country":"gb","sentiment":0.027},{"id":377269350,"title":"CLAY TRAVIS: The GOP's 2026 Challenge — Holding Trump's Base When He's Not On The Ballot","text":"One year ago, Donald Trump won a transformative election victory, sweeping all seven swing states, the popular vote and moving all 50 states redder than they were in 2020. How did he do it? By motivating men, young men in particular, and sports fans who were fed up with the insanity of men winning women's sports championships. I wrote about the victory in my new book, \"Balls,\" which was released on Tuesday. The book addresses the landslide Trump victory, but it also asks an important question when looking forward prospectively: Now that Trump, unfortunately, isn't able to run for re-election, how do Republicans ensure that the Trump MAGA coalition extends, and even grows, beyond his own presidency? In 2024, the two most conservative voting groups in America were male senior citizens and young men under the age of 30. This has never happened before in any of our lives. It was a cultural transformation overnight. Trump also won record support among White, Black, Asian and Hispanic men as well, but that same momentum didn't extend to 2025. Indeed, Tuesday's voting results paint an ominous picture of what 2026 and 2028 could look like if young men aren't motivated to show up and vote like they did in 2024. Consider the numbers: in 2024, Trump received 1.968 million votes in New Jersey and 2.075 million votes in Virginia. While he lost both states by narrow margins to Kamala Harris — by roughly 5 percent — he received more votes than the Virginia Democrat candidate for governor, Abigail Spanberger — who won Virginia with 1.961 million votes — and the New Jersey Democrat candidate for governor, Mikie Sherrill — who won New Jersey with 1.792 million votes. So how did both Democratic gubernatorial candidates win election comfortably despite receiving fewer votes than Trump did in their states a year ago? Yes, partly because it was an off-year cycle and overall turnout trended down, but they won comfortably because roughly 600,000 Trump voters didn't show up to vote in 2025 who did show up to vote in 2024. Who are these voters? Young men, sports fans, blue collar workers, the Trump MAGA base that will come out to support Trump when he's on the ballot, but won't show up when he's not on the ballot. So will these voters return in 2026 and in 2028 when Trump isn't on the ballot? That depends on how well future Republican candidates speak to these voters. Some of y'all will think I'm crazy for telling you this, but as soon as the 2026 mid-term elections are over, expect a pivot so rapid it will make your head spin — Democrats in 2027 will all argue that Trump's unique political gifts end with him, that MAGA is over without Trump as its leader. Yep, from \"He's Hitler!\" to \"He's the most talented Republican president in any of our lifetimes,\" almost overnight. I'm telling you, it's coming. Because Democrats are going to bank on Trump as a political unicorn, a candidate so talented that only he could power a coalition as substantial as he won in 2024. So what do Republicans need to do to extend and even grow Trump's appeal with young men? I think it's a combination of three things, wed the policy and the personal together, as Trump has been uniquely talented at doing. 1. On the policy front, the 2024 election was about the economy, the border and crime It was as easy as EBC. Trump won the arguments on all three of these fronts. So far, Trump 2.0 has ended the border as an issue by ending illegal immigration and driven crime down to record lows in many states and cities. His challenge on the economy is that Biden was so bad, it's taking time to clean up his mess. With record-high stock prices and record-low gas prices, Trump is delivering for all of us with stock market assets and all of us who have to fill up our tanks. But there's a lingering anger over how much goods cost. Even I feel it each time I buy a Chick-fil-A meal for my family, and it costs over $50. For fast-food, really! Prices went up so fast under President Joe Biden that the sticker shock is still real even in 2025. Trump has stopped the rapid price increases and, in the case of some purchases like gas, has actually brought them back lower than they were during Biden, but that bitter aftertaste of inflation takes time to wear off. So far it hasn't. 2. Focus on men in women's sports Is it the most important issue in the country? No. But it crystallizes the absurdity of Democrat policies for young men and sports fans, who provided the fuel to Trump's record win in 2024. If you believe a man should be able to win a women's sports championship, how can I trust your opinion on anything? As I wrote in \"Balls,\" this issue, combined with EBC, won Trump the election in 2024. I think that will still be the message in 2026, too, because, amazingly, Democrats have doubled and tripled down on defending men in women's sports all over the country. This issue isn't going away. 3. HAVE FUN and BE ENTERTAINING. My two favorite moments of the 2024 campaign were when Trump dressed up as a McDonald's employee and as a garbage man and rode around in a garbage truck. Was it absurd and ridiculous? Of course. But the number one gift Trump has that he receives zero credit for is this: HE'S FUNNY! Yes, politics are serious. But they should also be fun. Trump is a happy warrior and happy warriors win. The two most successful Republican presidents of my life were Ronald Reagan and Donald Trump. Both were, in many respects, professional entertainers. They knew how to cut through the noise and were authentic in the way they did so. Trump isn't perfect, none of us are, but he's the most comfortable president in his own skin that any of us have ever seen, and he has tremendous political instincts. You can spend a hundred million on an ad campaign and not get the free media attention that Trump did, scooping out fries and talking with voters at the drive-thru in Pennsylvania. That style of politicking is unbeatable. Heck, I would argue the best version of Trump is the one you get in fast-food restaurants. He genuinely loves getting out and interacting with people. That's a skill that can't be taught, but it can be emulated. We used to ask the question, which candidate would you rather have a beer with? While Trump doesn't drink — as he's jokingly said, can you imagine what he'd say if he drank? — he's authentic and real. As artificial intelligence takes over much of the country, I believe authenticity will become the most important political key to the realm. Young people in particular, who are steeped in social media artificiality fed to them constantly on their phones, have an innate sense of when they're being poll-tested and marketed to, they sniff it out better than older voters. If you want them to show up and support you, you have to win their trust. Which is why I truly believe the election was over when it came to male voters when Trump was shot in Butler, Pennsylvania. In that moment, having escaped death by half an inch, Trump, whose critics had labeled him a phony, rose up and screamed, \"Fight, fight, fight!\" three times. At that instant, the election was over for male voters. It was the bravest presidential moment of my life. But it was also one of the most authentic. In times of great peril, your own personal character is revealed. In those perilous milliseconds, Trump became a legend and won the election. He proved once and for all he had \"Balls.\" And so far, no Democrat has proven that they do. So long as that remains the case, Republicans aren't going to lose men. Which is why the best example of an oxymoron in America today isn't \"jumbo shrimp,\" it's \"masculine Democrat.\" Because after all, there are certainly big shrimp, but there are still no masculine democrats. Clay Travis is the author of the new book, \"Balls: How Trump, Young Men and Sports Fans Saved America.\" Buy it here. CLICK HERE TO READ MORE FROM CLAY TRAVIS","summary":"How did Trump win in 2024? By motivating men, young men in particular, and sports fans who were fed up with the insanity of men winning women&apos;s sports championships.","url":"https://www.outkick.com/analysis/clay-travis-gops-2026-challenge-holding-trumps-base-when-hes-not-ballot","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/05/gettyimages-2210242606.jpg","video":null,"publish_date":"2025-11-09 13:00:29","author":"Saul Loeb","authors":["Saul Loeb"],"language":"en","category":"politics","source_country":"us","sentiment":-0.117},{"id":377252248,"title":"Gavin Newsom thanks Texas in Prop. 50 victory lap: 'You woke us up'","text":"HOUSTON — California Gov. Gavin Newsom’s victory lap over passage of Proposition 50 reached Texas on Saturday, days after his state greenlit his plan to blunt Gov. Greg Abbott’s redistricting effort to get more Texas Republicans in Congress. \n\nBefore Newsom could start speaking during his brief stop at a rally in Houston, the crowd of around 800 Democrats took the chance to yell out “thank you,” and he returned the sentiment. \n\n“You woke us up,” Newsom said, referring to Democrats’ resistance to redistricting. “You didn't just have your back here, you had our back in the state of California.“\n\nAfter Abbott signed a new congressional map in August that was redrawn to maximize the state’s Republican representation in Washington D.C., amid pressure from President Donald Trump, Newsom pitched an idea to voters to offset Texas’ GOP gains with additional Democratic seats in California. \n\nCalifornia voters overwhelmingly supported Proposition 50 on Tuesday, a plan Newsom crafted to directly target Texas’ new congressional map. The ballot measure cleared the way for Newsom to allow the legislature to approve the Golden State’s redrawn congressional districts to carve out five more Democratic seats. Abbott bypassed that step, putting it up to the state’s lawmakers to decide on a new map without voter’s permission. \n\nThe California ballot measure passed with nearly 64% of the vote, and its decisive approval is a big win for Newsom, who is considering a presidential bid in 2028. If the new maps pass as planned, nearly all of California’s congressional representatives will be Democrats. California currently has 43 Democratic House members and nine Republicans — the new maps would secure 48 blue seats. And Newsom took to Texas, the very state Prop 50 targets, to celebrate. \n\nSaturday’s crowd celebrated with him, including 18-year-old Ben Webb of Cypress, a northwest suburb of Houston.\n\n“He did it with voter approval, which Greg Abbott didn't do,” said Webb, who recently became a registered voter. “So I would say that's an even bigger political win.” \n\nWebb’s friend, Thomas Mitschke, who is also 18, echoed that sentiment. \n\n“He took it to the voters instead of just doing it like Greg Abbott and kind of just jamming it in without voter approval,” Mitschke said. “That's how democracy is supposed to work.”\n\nAbbott’s office has not responded to a request for comment.\n\nTexas’ new congressional district lines have the potential to boost the GOP’s footing in Congress by squeezing more Democratic voters in Houston and Dallas into districts the minority party already controls — a strategy known as “packing.” It also “cracks” left-leaning communities by splitting voters who supported Democrat Kamala Harris in 2024 into Republican districts, according to an analysis by The Texas Tribune.\n\nFor example, the 9th Congressional District in Southwest Houston, represented by Congressman Al Green, went from voting for Kamala Harris in 2024 by 44 percentage points to one that Trump would have carried by a 20-point margin under the new lines. Much of the 9th District was merged into the 18th, where Green, who spoke at the rally, will now be seeking reelection. He would now face the winner of the upcoming special election runoff for the seat in the March primary. \n\nThe maps, along with a list of other reasons, is why both Webb and Mitschke said they will be casting some of their first votes to replace Abbott with a Democratic governor. They also said if Newsroom ran for president, he would have their vote.\n\nTexas’ maps have been caught in a web of legal challenges since 2021 when the current districts were approved. Lawsuits claim that the mid-decade redistricting process was flawed from the start, and that effort came at the cost of Latino and Black communities, which have largely supported Democratic candidates. \n\nNewsom’s rally drew a range of Democratic leaders across Harris County and the state, including Harris County Commissioners Adrian Garcia and Rodney Ellis, Congresswomen Lizzie Fletcher and Jasmine Crockett, and gubernatorial candidate and state Rep. Gina Hinojosa. \n\nNewsom’s plan to blunt Abbott’s effort was a long shot. Bob Shrum, a veteran Democratic consultant who leads the Center for the Political Future at the University of Southern California, told the Guardian that Newsom took a big gamble on Prop 50 — and it paid off.\n\n“But more than that is the fact that he fought back — that he dared to do this, that people said it was dangerous for him, and he forged ahead with it anyway,” he said. \n\nKathleen Davies, a reverend at a Presbyterian church in Southwest Houston who was born and raised in California, said Newsom’s visit reminded her that despite being a Democrat in a deeply red state, she still has a voice. \n\n“We're a big state, and he's in a big state, and I think it's important for us to know that we still are all connected as Americans,” said Davies, who moved to Texas about three decades ago. “Even though there's so much talk about, like, keep California out of Texas or whatever, I mean, we're all Americans who want to be represented and the gerrymandering has got to stop.”\n\nNewsom isn’t stopping with California. He’s encouraging other governors in blue states, such as Illinois and New York, to follow his lead and push back against Trump’s effort to hold onto a Republican-controlled Congress.\n\n“We cannot rest,” Newsom said on Saturday before heading to Brazil for a conference, “until we take back the House of Representatives.”\n\nThis article first appeared on The Texas Tribune.","summary":"HOUSTON — California Gov. Gavin Newsom’s victory lap over passage of Proposition 50 reached Texas on Saturday, days after his state greenlit his plan to blunt Gov. Greg Abbott’s redistricting effort to get more Texas Republicans in Congress. \n\nBefore Newsom could start speaking during his brief stop at a rally in Houston, the crowd of around 800 Democrats took the chance to yell out “thank you,” and he returned the sentiment. \n\n“You woke us up,” Newsom said, referring to Democrats’ resistance to redistricting. “You didn't just have your back here, you had our back in the state of California.“\n\nAfter Abbott signed a new congressional map in August that was redrawn to maximize the state’s Republican representation in Washington D.C., amid pressure from President Donald Trump, Newsom pitched an idea to voters to offset Texas’ GOP gains with additional Democratic seats in California. \n\nCalifornia voters overwhelmingly supported Proposition 50 on Tuesday, a plan Newsom crafted to directly target Texas’ new congres","url":"https://www.alternet.org/newsom-texas/","image":"https://www.alternet.org/media-library/image.jpg?id=61489351&width=1200&height=600&coordinates=0%2C458%2C0%2C459","video":null,"publish_date":"2025-11-09 11:58:03","author":"Texas Tribune","authors":["Texas Tribune"],"language":"en","source_country":"us","sentiment":-0.093},{"id":377279818,"title":"Skeptics to ask Legislature to ban mail-in voting in Hawaii","text":"The state Legislature will be asked to ban wildly popular mail-in voting and return to one-day, in-person voting as a majority of Hawaii Elections Commission members continue to echo election doubts repeated by President Donald Trump and his MAGA supporters since his 2020 reelection defeat.\n\nThe panel has spent hours in meetings debating the findings of two “permitted interactive groups” that a majority of commissioners believe cast enough doubt on Hawaii’s ballot security to call for the Legislature to ban mail-in voting across the state.\n\nThe agenda of the Elections Commission’s Oct. 1 meeting included discussion of whether to ask lawmakers to order an audit of Hawaii’s elections. But Commissioner Ralph Cushnie, who was appointed by the House Republican caucus leader and has repeatedly unsuccessfully sued elections chief Scott Nago, made a motion to instead ask the Legislature to go back to a single day of in-person voting.\n\nCushnie’s motion passed by a 5-3 vote with Commission Chair Michael Curtis abstaining.\n\nThe commission voted to request that the Legislature require all in-person voters to produce identification; however, military members and people with special needs would still be allowed to cast absentee ballots.\n\nCushnie argued that U.S. Postal Service expenses charged to the state for delivering mail-in ballots do not match official state election results.\n\nCommissioners have spent multiple meetings debating whether that’s enough suspicion to call for an audit, which morphed Oct. 1 into Cushnie’s proposal to reverse how Hawaii voters would cast their ballots.\n\nAt the same meeting, Cushnie was unsuccessful in getting the commission to fire Nago — an issue that also was not on the agenda but was previously proposed by Cushnie.\n\nIn the 2024 presidential election, which ultimately pitted Trump against Vice President Kamala Harris, 69.6% of registered Hawaii voters cast ballots for total turnout of 579,784.\n\nSome 551,036 of them — or 95% — voted by mail. Only 28,748 voted in person, representing just 5% of all votes cast.\n\nOn Oahu only 17,204 \nvoters — or 3.1% — voted \n\nTrump beat former first lady Hillary Clinton in 2016 and planted no seeds of doubt about his election victory. But since his 2020 loss to Joe Biden, Trump has repeated claims that the election was rigged and “stolen.”\n\nSince 2020, Hawaii’s first Election Day results have represented all mail-in ballots, which has made it easier to identify voting trends early in the night, before the release of final results, which typically aren’t released until early the following morning.\n\nAlthough small in numbers, those who vote in person across Hawaii have disrupted the timely release of election returns since 2020 because Hawaii election law prohibits the release of any results until the last person waiting in line by 7 p.m. has voted.\n\nAny eligible voter also can register on Election Day and vote, further holding up lines at polling places.\n\nIn 2020 and again in the 2022 midterm elections, long lines of in-person voters wrapped around Honolulu Hale and Kapolei Hale.\n\nCombined with similar long lines of voters across the state, the release of election results was delayed until the last person voted.\n\nOVER THE last several Elections Commission meetings, online viewership has increased as both supporters and skeptics of mail-in voting have logged in to track the commission’s debates, said Janet Mason of the Hawaii chapter of the League of Women Voters.\n\nMason told the commission that her organization supports mail-in voting and trusts its security.\n\n“I don’t think people understand the damage that could be done,” Mason told the Honolulu Star-Advertiser. “Misinformation can undermine confidence in elections. I hope it doesn’t happen. The league is going to keep working on this, for sure.”\n\nIn a November letter to the editor to the Star-Advertiser, Chair Patricia Morrissey and Vice Chair James Gashel of the Statewide Elections Accessibility Needs Advisory Committee wrote that mail-in voting “is convenient for many voters — and for seniors and people with disabilities, it is a lifeline to civic participation.\n\n“We do not want civic participation to be diminished by an unnecessary decision to alter how we vote. The so-called ‘chain of custody’ argument is false. Voting by mail is as safe — and likely safer — than voting in person.\n\n“The commission’s inclination to reduce our voting options flies in the face of common sense and is an affront to democracy itself. Voting by mail has never been associated with fraud.”\n\nIn response to the permitted interactive groups’ reports, Nago wrote in a 26-page response that, “This finding of the PIG Report attempts to relitigate the previous court cases brought forth by Commissioner Cushnie without providing new evidence and seeks to continue a debate, dismissing what has already been stated.”\n\nThe groups, Nago said, found “no evidence of systemic error or fraud. … The election processes, to compile these records, are methodical and multi-layered for transparency, accuracy, integrity, and security.”\n\nAS TRUMP and his supporters continue to press his unsubstantiated claims of election fraud, unpaid volunteer Hawaii Republican election observers have consistently told the Star-Advertiser over each of the last several election cycles that they have not seen any evidence of election interference or fraud as mail-in ballots are opened and counted at the state Capitol.\n\nIn his response to the permitted interactive groups’ reports, Nago wrote that “the public is invited to volunteer as a counting center official or official observer to experience the electoral process and the care and time involved in opening the valid return identification envelopes then scanning and securing the voted ballots.”\n\n“Further still, voters can verify for themselves that the ballot they voted and secured in their personalized return identification envelope has been accepted to be counted.”\n\nNago also said that Hawaii’s elections results are federally certified by the U.S. Election Assistance Commission, which establishes testing system guidelines and authorizes test laboratories. “These test laboratories are independent and review the hardware, software, and audit logs of the system,” he said.\n\nPolitical analyst Neal Milner was surprised by what he called the Elections Commission’s “lopsided” 5-3 vote that he said “reflects the major superstition that Trump has pushed.”\n\nElection skepticism, Milner said, has “moved from a crank idea to a Republican Party idea.”\n\nShould the Legislature decide to require in-person voting for the 2026 mid-term elections, Milner said it could discourage voter turnout, especially among voters with ethnic backgrounds who may be intimidated by federal immigration enforcement tactics to detain anyone they believe may be in the country illegally, even U.S. citizens and sometimes with no probable cause.\n\nDuring the ongoing Immigration and Customs Enforcement crackdown, Milner said calls to 911 in Chicago are already down “because people are afraid of the possibility that ICE is going to show up.”\n\nHe called the odds of the Democratic-dominated Hawaii Legislature banning mail-in ballots during the 2026 legislative session that begins in January “slim to none — more on the none side.”\n\nThe Elections Commission needs either a state senator or House representative to introduce a bill on its behalf.\n\nNeither Senate President Ron Kouchi nor House Speaker Nadine Nakamura, both Democrats, responded to requests for comment about whether they expect a bill to be introduced in next year’s session.","summary":"The state Legislature will be asked to ban wildly popular mail-in voting and return to one-day, in-person voting as a majority of Hawaii Elections Commission members continue to echo election doubts repeated by President Donald Trump and his MAGA supporters since his 2020 reelection defeat.","url":"https://www.staradvertiser.com/2025/11/09/hawaii-news/skeptics-to-ask-legislature-to-ban-mail-in-voting-in-hawaii/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/11/web1_CTY-hnl-hale-line-7.jpg","video":null,"publish_date":"2025-11-09 10:05:00","author":"Dan Nakaso","authors":["Dan Nakaso"],"language":"en","category":"politics","source_country":"US","sentiment":-0.138},{"id":377191654,"title":"Divided Dems fear rise of New York's socialist mayor will split voters across America and play into Trump's hands","text":"The Democrats had a strong night at the polls on Tuesday, reclaiming two governors' mansions and winning a major redistricting battle in California that could give them five additional seats in Congress.\n\n However, Zohran Mamdani's defeat of former political scion Andrew Cuomo to become New York City's first Muslim and democratic socialist mayor has divided the party.\n\nThe 34-year-old state assemblyman, from Queens, spent the majority of his campaign harping on about how unaffordable America's largest city has been and continues to be.\n\nHis overtures to help halal cart operators dealing with exorbitantly priced food permits and promises to expand childcare do not generally irk moderates, especially state-level Democrats.\n\nTheir reservations lie with his plans to freeze rent costs for stabilized tenants, establish city-owned grocery stores and make city buses fare-free. \n\nThey also fear that the socialist label will open the Democratic party up to more effective attacks from Republicans.\n\nSo far, moderates have dealt with Mamdani either by ignoring his existence entirely or by dodging questions about him for months. \n\nNew York Senator Chuck Schumer did not make any public statement addressing Mamdani's campaign. Since his election, he has spoken with the mayor-elect and said their conversation was 'very, very good.' Schumer, a Brooklyn resident, declined to say whether he voted for Mamdani.\n\nMeanwhile, House Democratic Leader Hakeem Jeffries avoided questions about him for months before eventually giving a lukewarm endorsement.\n\nIn a statement on October 24, he said: 'As with any mayor, there will be areas of agreement and areas of principled disagreement... I support him and the entire citywide Democratic ticket in the general election.'\n\nDespite his support, Jeffries also said on November 2 that he believed Mamdani was not the future of the Democratic Party. \n\nFormer vice-president Kamala Harris has taken a similar tact. When asked in late September by MSNBC host Rachel Maddow about Mamdani, she responded, 'Look, as far as I'm concerned, he's the Democratic nominee and he should be supported.'\n\nWhen Maddow pressed again on whether she was endorsing him, Harris said, 'I support the Democrat in the race, sure. But let me just say this, he's not the only star.'\n\nAbigail Spanberger, who won the Virginia governor's race by 15 points, shares Jeffries's and Harris's skepticism of Mamdani, though she was more specific.\n\nShe told CNN ahead of Election Day that she doesn't have a Mamdani-like proposal for government-run grocery stores 'because I couldn’t ever pass it.'\n\n'People do want us to be aspirational and dream big. They also don’t want us to lie to them,' she said in an interview with the network.\n\n'When you have a party that makes promise after promise, and then say, \"Oh, we passed it in the House, it’s not our fault\" - vulnerable people believed you. Maybe he is going to get Albany on board with totally refinancing public transportation. But there’s a lot of people who believe him,' she continued. \n\nSpanberger's rebuke of Mamdani is in stark contrast to how New York Governor Kathy Hochul has spoken about him.\n\nHochul, another moderate Democrat, was initially reluctant to endorse Mamdani but gave him the nod on September 14, almost six weeks before Jeffries.\n\nWhat separates Hochul from the rest of these Democrats is that she'll have to work with Mamdani day in and day out.\n\nThe two may find themselves at odds right away, given that Hochul and the state legislature will need to approve Mamdani's proposed tax hikes on corporations and individuals earning over $1 million.\n\nHochul has signaled she was against both, partly because she worried about wealthy people fleeing the city.\n\nNonetheless, Hochul, who describes herself as a 'staunch capitalist', showed up to one of Mamdani's raucous rallies in late October to enthusiastically throw her support behind him.\n\n'We need a fighter in City Hall who wakes up every day ready to punch and fight for the working people of the city and that person is Zohran Mamdani,' she said in her speech.\n\nPerhaps spawned by the varying responses among top Democrats to Mamdani's rise, a dynamic of cautious acceptance has emerged in the party. \n\nThe influential centrist think-tank, Third Way, published a memo the day after Mamdani's win that praises what it believes are his best qualities, while also downplaying his success.\n\nThe memo argued Mamdani is too extreme and polarizing a figure to be a model for electoral success around the country, especially in red or purple congressional districts.\n\nYet, in the next breath, Third Way told Democrats to emulate his swagger on the campaign trail, his likable persona and his use of sound-bite-worthy slogans to rally the progressive base. \n\nThe memo claimed Mamdani and his ilk simply want to 'make blue places bluer' while the center-left's goal is to 'win seats away from Republicans and put a check on Trump and MAGA'.\n\nThe think-tank is also concerned that Mamdani's association with the Democratic Socialists of America will prove 'politically lethal' and help President Donald Trump and the GOP in the midterms next year.\n\nJim Kessler, Third Way's executive vice-president for policy, pointed out that Spanberger and New Jersey Governor-elect Mikie Sherrill both won their respective elections by greater margins than Mamdani did. \n\nSpanberger and Sherrill also kept their states from flipping red, whereas if Mamdani lost, it would have been to Cuomo, a lifelong Democrat who was running as an independent in the mayor's race.\n\nOthers say Mamdani will be a lightning rod for Republican attacks over his prior, more extreme views, thereby weakening and dividing the party further.\n\n'If we’re focused on playing defense on Mamdani, that will be a…major distraction, Rep Josh Gottheimer, a New Jersey Democrat, told The Washington Post in late October.\n\nFor example, in December 2020, Mamdani came out in support of defunding and dismantling the New York Police Department, a stance he has since entirely walked back.\n\nSome have taken away a different lesson; the affordability message is a winner, whether it is adopted by Spanberger, Sherrill, Mamdani, or even Trump.\n\nDan Kanninen, the battleground state director for Harris's presidential campaign, said this week that it has been 'clarifying for our party to get back to that home base of costs and connecting with voters'.","summary":"Major figures in the Democratic party are being forced to reckon with Zohran Mamdani, who will be the first democratic socialist mayor of New York City. Here's how they've responded so far.","url":"https://www.dailymail.co.uk/news/article-15261793/divided-democrats-zohran-mamdani-trump-new-york.html","image":"https://i.dailymail.co.uk/1s/2025/11/06/13/103622813-0-image-a-5_1762436934431.jpg","video":null,"publish_date":"2025-11-09 07:00:23","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.36},{"id":377191648,"title":"Trumpworld fumes at Democrats' affordability 'con job' as insiders rush to save sinking presidency","text":"Trumpworld is enraged. \n\nDemocrats just pulled off what many in the president's inner circle thought was impossible - coopting affordability as their winning issue. \n\n'Democrats' affordability issue is a crock of s***. It's an absolute 100 percent crock of s***,' one national Republican operative fumed.\n\nAnd yet the blue wave that washed over the country on Tuesday now imperils President Donald Trump's entire agenda - barring a dramatic course correction ahead of the 2026 midterms.\n\nOn Tuesday night, Democratic candidates cruised to easy victories in New Jersey and Virginia's gubernatorial races, with the Garden State result particularly galling to those in Trump's orbit who expected a much tighter contest.\n\nBy Thursday, an increasingly frustrated president was complaining publicly that Democrats were attempting to steal the cost-of-living message - the very issue that, along with immigration, propelled him back to the White House.\n\n'We are the ones that have done a great job with affordability, not the Democrats, and yet we lost a couple of elections in Democrat areas,' Trump fumed, before adding: 'They weren't very Democrat when I ran a year ago.'\n\n'But we just lost an election, they said, based on affordability,' he continued. 'It's a con job by the Democrats.'\n\nBehind the scenes, Axios reported that Trump spent this week obsessively poring over polling data, growing increasingly alarmed about public perception of food prices.\n\nThe White House's response? A hastily-assembled press release on Thursday boasting that 'Americans Are Paying Less This Thanksgiving' - using cherry-picked price points from Walmart and Target.\n\nBut even the Wells Fargo report the White House cited acknowledged an inconvenient truth: the Consumer Price Index for food at home was still up 2.7 percent from last year under President Joe Biden.\n\nThe stakes couldn't be higher. If Trump can't bring costs down - or at least convince voters he's making meaningful progress - Republicans risk losing their House majority in just 14 months. And without the House, the entire MAGA legislative agenda dies.\n\n'We can de facto end Donald Trump's presidency, as we know it, the minute Speaker Jeffries gets sworn in,' California Governor Gavin Newsom gleefully teased on election night, celebrating another Democratic victory - a ballot initiative allowing California to draw more Democrat-friendly House districts.\n\nRepublicans interviewed by the Daily Mail agreed that messaging was a problem, but pointed to other factors behind Tuesday's devastating losses.\n\nTrump adviser Alex Bruesewitz didn't mince words about Virginia's Republican gubernatorial candidate, Lieutenant Governor Winsome Earle-Sears.\n\n'Total dud,' he declared bluntly.\n\n'I honestly think that sitting and watching paint dry or grass grow or listening to Kamala Harris' audiobook is more exciting than Winsome Sears,' Bruesewitz told the Daily Mail in a phone interview.\n\n'I don't know how many more case studies we need for people like her before the Republican Party totally stops running these stale candidates who are relics of the George Bush era, an era that brought Republicans nothing but loss.'\n\nBruesewitz pointed to a critical moment: days before Trump launched his 2024 presidential campaign, Earle-Sears announced she 'could not support' him.\n\n'And in that moment, not only did she lose me, she lost all of the MAGA support and MAGA voters will never forget that,' he said.\n\nJack Ciattarelli, who lost New Jersey's gubernatorial race, similarly failed to 'excite people the way that they need to be excited,' according to Bruesewitz, who also noted Democrats' superior ground game in the Garden State.\n\nBut perhaps the most ominous assessment came from John McLaughlin, a veteran pollster for Trump and other Republican candidates. \n\n'Hundreds of thousands of Trump voters stayed home in both Virginia and New Jersey,' McLaughlin warned, his concern palpable.\n\nDemocrats have weaponized social media to portray Trump as a modern-day Marie Antoinette - more interested in building a White House ballroom and attending Great Gatsby-themed parties at Mar-a-Lago than providing SNAP benefits amid a government shutdown or lowering costs for struggling families.\n\n'If there's not a clear contrast on the right issues, the Trump voters will stay home, and that would be a disaster for the Republicans next year, for Congress, in the Senate,' McLaughlin told the Daily Mail.\n\nHe acknowledged that while most Americans believe the country is on the wrong track and worry the economy could deteriorate further, when Trump's policies are directly compared with Democrats', 'all of a sudden, like we did last year when President Trump was running, we look a lot better.'\n\nSome Republicans told the Daily Mail there's a dangerous hesitancy to trumpet economic improvements because things aren't yet back to Trump's first-term levels.\n\n'I think that Republicans are spooked to talk about anything that would need to get fixed regarding the economy because they're afraid that it therefore reflects poorly on President Trump,' the national Republican operative admitted. 'It does not.'\n\nBoth the operative and former White House press secretary Sean Spicer argued Trump is still cleaning up the inflationary mess created by Biden's COVID-19 spending spree - and voters will understand that.\n\n'The Biden problem was this: they were trying to tell us, \"don't believe your lying eyes.\" Prices were up during the Biden administration, and they were like, \"Oh, it's no big deal,\"' Spicer explained in a phone interview.\n\nHe offered a simple analogy: something that cost $3 rose to $5 under Biden, and is now back to $4 under Trump.\n\n'Where Trump needs to step it up is to say \"Hey guys, it went from $5 to $4, I want to get it to $3, we're not there yet, and we're going to keep fighting for it,\"' Spicer advised.\n\nRepublicans facing voters in 2026 can point to tangible wins: lower gas prices, tax cuts in the Big Beautiful Bill, Trump's push to reduce prescription drug costs, and any progress on bringing down food prices.\n\nBruesewitz, who at 28 represents the younger generation of MAGA operatives, also urged Republicans to develop a coherent answer on student loan debt.\n\n'And so his messaging should be like, \"Hey guys, we're moving in the right direction, it's better, but we're not done yet,\"' Spicer counseled.\n\nIronically, Republicans could borrow a page from Biden's 2024 playbook - before he dropped out and handed the baton to Vice President Kamala Harris.\n\nHis campaign slogan? 'Let's finish the job.'\n\nFor Trump and the Republican Party, those words have never been more relevant - or more urgent.","summary":"Trumpworld is enraged. Democrats just pulled off what many in the president's inner circle thought was impossible - coopting affordability as their winning issue.","url":"https://www.dailymail.co.uk/news/article-15266131/trumpworld-fumes-democrats-affordability-election.html","image":"https://i.dailymail.co.uk/1s/2025/11/07/22/103698755-0-image-a-64_1762553771124.jpg","video":null,"publish_date":"2025-11-09 06:57:27","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.291},{"id":377182748,"title":"Minneapolis Mayor Jacob Frey facing backlash for giving victory speech in Somali: ‘Humiliating’","text":"Newly re-elected Minneapolis Democratic Mayor Jacob Frey is facing backlash from conservatives for giving a victory speech in Somali and saying that Minneapolis welcomes Somalians.\n\nIn a video of the speech posted online, Frey can be seen leading chants in Somali as the crowd responds and applauds.\n\nPopular conservative influencer Paul Szypula ripped into the progressive mayor, writing, “The pandering here is insane.”\n\n“Mayor Jacob Frey, as he won reelection, spoke almost a minute in Somalia then said Minneapolis belongs to Somalia,” said Szypula.\n\nIn a second round of nonpartisan ranked-choice voting, Frey narrowly defeated a challenge from socialist Minneapolis state Sen. Omar Fateh.\n\nFateh is the first Somali American and first Muslim to serve in the state Senate.\n\nFateh had the backing of the Twin Cities’ chapter of the Democratic Socialists of America and “Squad” member Rep. Ilhan Omar, D-Minn., who represents Minneapolis in the US House of Representatives.\n\nMinnesota Gov. Tim Walz, former Vice President Kamala Harris’ running mate last year who is up for re-election next year, and Sen. Amy Klobuchar, D-Minn., endorsed Frey’s campaign this year.\n\nWhile speaking with a crowd of Somali residents after his victory, Frey repeatedly thanked the crowd in Somali.\n\n“To the great people of Minneapolis, and I say that very intentionally, because no matter where you are from, Minneapolis should be a place where you are proud to call home,” he said.\n\nHe then proceeded to list a number of Somalian regions, saying, “Whether you are from Bosaso or Mogadishu, whether you are from Hargeisa or Garowe, whether you are from Beledweyne or southwest, Minneapolis is a place where you come to seek prosperity, where you come to raise your family.”\n\n“Here is what this election means. This election means this is a moment for unity, where the entire Somali community can come together and say, ‘This is our people. This is our city. We are united behind each other,” he said.\n\nConservative pundit Gerry Callahan slammed Frey’s speech, saying, “This is an American politician, raised in America, educated in America, ostensibly representing Americans, prostrating himself in front of bunch of foreigners. Could be the most humiliating thing I’ve ever seen.” \n\nPodcaster Matt Walsh also chimed in, writing, “As I have said many times now, politicians in this country should be required by law to speak English when addressing the public in an official capacity. There should never be a time when Americans can’t understand what their elected leaders are saying.”\n\nNick Sortor wrote, “I don’t know how large ICE’s presence in Minneapolis is, but it needs to be much, MUCH larger.” \n\nFox News Digital reached out to Frey’s team for comment but did not immediately receive a response.\n\nThis is not the first time Frey has garnered criticism over Somali language political messaging. He was also widely criticized in September for releasing a campaign ad in Somali. \n\nRep. Chip Roy, R-Texas, commented on the ad, saying, “This must be stopped.” \n\nRep. Mike Collins, R-Ga., also reacted to the ad, posting a disapproving gif. \n\nKari Lake simply wrote, “WTAF?” That’s an acronym for “what the actual f—?”\n\nHaving entered office in 2018, Frey was elected to his third term as Minneapolis mayor on Tuesday.\n\nHe is best known for marching with protesters during the 2020 Black Lives Matter riots, which were particularly destructive in Minneapolis, the city where George Floyd died.\n\nFrey was also seen kneeling and weeping by Floyd’s casket at a memorial service.","summary":"Newly re-elected Minneapolis Democratic Mayor Jacob Frey is facing backlash from conservatives for giving a victory speech in Somali and saying that Minneapolis welcomes Somalians.","url":"https://nypost.com/2025/11/09/us-news/minneapolis-mayor-jacob-frey-under-fire-for-speaking-somali-in-victory-speech/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/115077302.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/TyjXOQat-RyIcpnTz.mp4","publish_date":"2025-11-09 06:46:55","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":0.014},{"id":377178424,"title":"Defiant Joe Biden goes scorched earth on Donald Trump over White House demolition: 'Who in the hell does he think he is?'","text":"Former president Joe Biden tore into Donald Trump, accusing his successor of defacing the White House with a $300 million vanity project. \n\nThe 82-year-old Democrat was speaking at the Nebraska Democratic Party's Ben Nelson Gala on Friday night when he went after Trump's new ballroom. \n\nBiden said: 'Anyone seen what he's done to the East Wing of the People's House?' Biden asked, his voice rising over roars from the audience. \n\n'It's a perfect symbol of his presidency. Trump is taking a wrecking ball not only to the People's House but to the Constitution, to the rule of law, to our very democracy. Who in the hell does he think he is?'\n\nThe speech marked a joyful but defiant comeback for Biden who has been undergoing treatment for an aggressive form of prostate cancer but showed flashes of his old energy and righteous anger. \n\nThough his voice occasionally faltered, the crowd was on its feet throughout the 30-minute address, cheering as he spoke about repairing America's divisions and defending democratic norms.\n\n'What we have to do is repair our faults, and that's what we began to do on Tuesday,' he shouted, referencing this week's Democratic victories in key races across the country.\n\nIt was Biden's second public appearance in a week, and his first purely political event since Labor Day 2024, when he appeared alongside then Vice President Kamala Harris at a union rally in Pittsburgh, two months before the presidential election that saw Trump reclaim the Oval Office.\n\nFriday's rally, however, was not about Biden's own comeback bid but about rallying his party's base.\n\nBiden's remarks came amid a growing furor over Trump's decision to demolish the entire East Wing of the White House, a move that shocked historians, preservationists, and political opponents alike.\n\nTrump began the teardown last month to make way for a giant 90,000-square-foot ballroom, nearly twice the size of the White House itself.\n\nThe Republican president has long insisted the 1,000-seat ballroom is necessary for large state dinners and events that currently require temporary tents on the South Lawn. \n\nBut the destruction of the East Wing, which housed offices for First Ladies, a family theater, and Jacqueline Kennedy's memorial garden, has been condemned as a symbol of excess and disregard for tradition.\n\nThe public learned of the project on October 20, when photos of construction crews ripping into the building began circulating online. \n\nWithin days, the East Wing was reduced to rubble including the covered walkway and historic garden.\n\nTrump, a billionaire real-estate developer before entering politics, defended the move as part of his vision to 'modernize' the Executive Mansion. \n\nHe said he had decided, after consulting with architects, that 'really knocking it down' was preferable to a partial renovation.\n\n'It won't interfere with the current building,' Trump insisted in July. 'It'll be near it but not touching it.'\n\nBy October, he changed course. 'Really knocking it down,' he said Wednesday, was 'the better option.'\n\nWhite House Press Secretary Karoline Leavitt later confirmed that the ballroom's cost had ballooned from $200 million to $300 million, but claimed taxpayers would not be paying for it.","summary":"The 82-year-old Democrat was speaking at the Nebraska Democratic Party's Ben Nelson Gala on Friday night when he went after Trump's new ballroom.","url":"https://www.dailymail.co.uk/news/article-15273155/Joe-Biden-Donald-Trump-White-House-demolition.html","image":"https://i.dailymail.co.uk/1s/2025/11/09/03/103719603-0-image-m-86_1762659825808.jpg","video":null,"publish_date":"2025-11-09 05:54:38","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","category":"politics","source_country":"gb","sentiment":0.08},{"id":377150750,"title":"Book Review: Kamala Harris’s '107 Days' — A Candid Look At Her 2024 Presidential Run","text":"In her candid new memoir, Harris revisits the whirlwind 2024 campaign that tested her resolve and redefined her public image, revealing the emotional and political toll behind the pursuit of leadership","summary":"","url":"https://www.freepressjournal.in/weekend/book-review-kamala-harriss-107-days-a-candid-look-at-her-2024-presidential-run","image":"https://media.assettype.com/freepressjournal/2025-11-08/soqy3dvl/KAMALA.jpg","video":null,"publish_date":"2025-11-09 01:15:00","author":"Ketan Narottam Tanna","authors":["Ketan Narottam Tanna"],"language":"en","category":"politics","source_country":"in","sentiment":-0.237},{"id":377171906,"title":"“You woke us up”: California Gov. Gavin Newsom, energized by Prop 50 redistricting win, thanks Texas","text":"HOUSTON — California Gov. Gavin Newsom’s victory lap over passage of Proposition 50 reached Texas on Saturday, days after his state greenlit his plan to blunt Gov. Greg Abbott’s redistricting effort to get more Texas Republicans in Congress. \n\nBefore Newsom could start speaking during his brief stop at a rally in Houston, the crowd of around 800 Democrats took the chance to yell out “thank you,” and he returned the sentiment. \n\n“You woke us up,” Newsom said, referring to Democrats’ resistance to redistricting. “You didn’t just have your back here, you had our back in the state of California.“\n\nAfter Abbott signed a new congressional map in August that was redrawn to maximize the state’s Republican representation in Washington D.C., amid pressure from President Donald Trump, Newsom pitched an idea to voters to offset Texas’ GOP gains with additional Democratic seats in California. \n\nCalifornia voters overwhelmingly supported Proposition 50 on Tuesday, a plan Newsom crafted to directly target Texas’ new congressional map. The ballot measure cleared the way for Newsom to allow the legislature to approve the Golden State’s redrawn congressional districts to carve out five more Democratic seats. Abbott bypassed that step, putting it up to the state’s lawmakers to decide on a new map without voter’s permission. \n\nThe California ballot measure passed with nearly 64% of the vote, and its decisive approval is a big win for Newsom, who is considering a presidential bid in 2028. If the new maps pass as planned, nearly all of California’s congressional representatives will be Democrats. California currently has 43 Democratic House members and nine Republicans — the new maps would secure 48 blue seats. And Newsom took to Texas, the very state Prop 50 targets, to celebrate. \n\nSaturday’s crowd celebrated with him, including 18-year-old Ben Webb of Cypress, a northwest suburb of Houston.\n\n“He did it with voter approval, which Greg Abbott didn’t do,” said Webb, who recently became a registered voter. “So I would say that’s an even bigger political win.” \n\nWebb’s friend, Thomas Mitschke, who is also 18, echoed that sentiment. \n\n“He took it to the voters instead of just doing it like Greg Abbott and kind of just jamming it in without voter approval,” Mitschke said. “That’s how democracy is supposed to work.”\n\nAbbott’s office has not responded to a request for comment.\n\nTexas’ new congressional district lines have the potential to boost the GOP’s footing in Congress by squeezing more Democratic voters in Houston and Dallas into districts the minority party already controls — a strategy known as “packing.” It also “cracks” left-leaning communities by splitting voters who supported Democrat Kamala Harris in 2024 into Republican districts, according to an analysis by The Texas Tribune.\n\nFor example, the 9th Congressional District in Southwest Houston, represented by Congressman Al Green, went from voting for Kamala Harris in 2024 by 44 percentage points to one that Trump would have carried by a 20-point margin under the new lines. Much of the 9th District was merged into the 18th, where Green, who spoke at the rally, will now be seeking reelection. He would now face the winner of the upcoming special election runoff for the seat in the March primary. \n\nThe maps, along with a list of other reasons, is why both Webb and Mitschke said they will be casting some of their first votes to replace Abbott with a Democratic governor. They also said if Newsroom ran for president, he would have their vote.\n\nTexas’ maps have been caught in a web of legal challenges since 2021 when the current districts were approved. Lawsuits claim that the mid-decade redistricting process was flawed from the start, and that effort came at the cost of Latino and Black communities, which have largely supported Democratic candidates. \n\nNewsom’s rally drew a range of Democratic leaders across Harris County and the state, including Harris County Commissioners Adrian Garcia and Rodney Ellis, Congresswomen Lizzie Fletcher and Jasmine Crockett, and gubernatorial candidate and state Rep. Gina Hinojosa. \n\nNewsom’s plan to blunt Abbott’s effort was a long shot. Bob Shrum, a veteran Democratic consultant who leads the Center for the Political Future at the University of Southern California, told the Guardian that Newsom took a big gamble on Prop 50 — and it paid off.\n\n“But more than that is the fact that he fought back — that he dared to do this, that people said it was dangerous for him, and he forged ahead with it anyway,” he said. \n\nKathleen Davies, a reverend at a Presbyterian church in Southwest Houston who was born and raised in California, said Newsom’s visit reminded her that despite being a Democrat in a deeply red state, she still has a voice. \n\n“We’re a big state, and he’s in a big state, and I think it’s important for us to know that we still are all connected as Americans,” said Davies, who moved to Texas about three decades ago. “Even though there’s so much talk about, like, keep California out of Texas or whatever, I mean, we’re all Americans who want to be represented and the gerrymandering has got to stop.”\n\nNewsom isn’t stopping with California. He’s encouraging other governors in blue states, such as Illinois and New York, to follow his lead and push back against Trump’s effort to hold onto a Republican-controlled Congress.\n\n“We cannot rest,” Newsom said on Saturday before heading to Brazil for a conference, “until we take back the House of Representatives.”","summary":"The Democrat took a victory lap on rival Gov. Greg Abbott’s home turf Saturday and called on other blue states to push back on a GOP effort to retain control of the U.S. House.","url":"https://www.texastribune.org/2025/11/08/texas-california-gavin-newsom-congress-redistricting-map/","image":"https://www.texastribune.org/wp-content/uploads/2025/11/2025108-Newsom-Rally-AT-05-scaled.jpg","video":null,"publish_date":"2025-11-08 22:28:25","author":"Colleen DeGuzman","authors":["Colleen DeGuzman"],"language":"en","source_country":"us","sentiment":-0.093},{"id":377126510,"title":"College’s student government reverses block on TPUSA chapter","text":"A Colorado college student government reversed its decision to block a Turning Point USA (TPUSA) chapter during an emergency meeting on Friday night.\n\nThe Associated Students of Fort Lewis College (ASFLC) voted to approve the TPUSA chapter after previously rejecting senior Jonah Flynn’s proposal to register the group with the university.\n\n“It was strange. They put us in a tiny room, with at least 100 people being forced to wait outside. Tons of local conservatives, students and community members. Inside the meeting, we got to speak briefly, and they immediately voted and unanimously approved it,” Flynn told Fox News Digital.\n\nFlynn planned to appeal the decision to the student court because the vote to block the chapter seemed to be a violation of his constitutional rights.\n\nA spokesperson for Fort Lewis College told Fox News Digital Friday that the institution “is committed to fostering an inclusive, student-centered learning environment that values both free expression and responsible leadership.”\n\n“Following a review and rescission of its earlier decision, the Associated Students of Fort Lewis College voted to approve Turning Point USA as a Registered Student Organization (RSO) during an emergency meeting on Friday night,” Public Information Officer Nardy Baeza Bickel told Fox News Digital.\n\n“This outcome reflects ASFLC’s commitment to fair governance, educational growth, and consistent policy application. Recognition does not imply endorsement of any organization’s viewpoints; all RSOs are expected to follow college policies and uphold community standards,” Bickel explained further.\n\n“Fort Lewis College appreciates ASFLC’s leadership in addressing a complex issue and continues to support students in developing their understanding of free expression, inclusion, and civic responsibility,” she added.\n\nThe benefits of registering the TPUSA chapter on FLC’s campus is that organizers have access to the school’s facilities for events. \n\nFlynn hopes to host a larger event than the one he held before through TPUSA. \n\nFlynn was at the center of controversy when he sought to start a TPUSA chapter, prompting a petition that accused TPUSA of causing harm to students. \n\nCritics alleged that Flynn’s plan mirrored TPUSA’s national “professor watchlist,” which has faced backlash. \n\nThe Herald reported that only three people supported Flynn’s proposal to start a chapter.\n\nOn Oct. 17, a petition which was launched by the Fort Lewis College community garnered over 400 signatures, arguing that TPUSA “has engaged in actions that directly harm our community.” \n\n“At a college where many students identify as Indigenous, students of color, LGBTQ+, or from other underrepresented backgrounds, this harm cannot be ignored,” the petition reads. \n\n“We are calling on Fort Lewis College to take action that prioritizes student safety and well-being by refusing to recognize the TPUSA chapter as an RSO.”\n\nShortly after the chapter was denied, a counter-petition launched backing TPUSA, garnering over 1,000 signatures so far.\n\nFlynn stood before the ASFLC board as it voted against establishing a TPUSA chapter in front of a crowded room last week. The seven elected senators on the board blocked the chapter.\n\n“Many of our morals and interests must be pushed to the side,” said Asa Worthington, the student body president of the Associated Students of Fort Lewis College. \n\n“The safety of our student body and the FLC community has always been and always will be ASFLC’s top priority.”\n\nKirk’s debating style inspired Flynn, a Philosophy major, to start a TPUSA chapter. \n\nHis campus is located in La Plata County, which went heavily for Kamala Harris in 2024. \n\nKirk was assassinated on Sept. 10 while speaking at Utah Valley University, which has sparked a huge interest across the country to start new TPUSA chapters in high schools and colleges.\n\n“I was really upset by what happened to Charlie. I was just sort of mourning and emotional and upset about it. Then I decided that what we need to do is not sort of back down,” Flynn told Fox News Digital.","summary":"The Associated Students of Fort Lewis College (ASFLC) voted to approve the TPUSA chapter after previously rejecting senior Jonah Flynn’s proposal to register the group with the university.","url":"https://nypost.com/2025/11/08/media/colleges-student-government-reverses-block-on-tpusa-chapter/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/115040835.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/TyjXOQat-RyIcpnTz.mp4","publish_date":"2025-11-08 21:23:39","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.312},{"id":377113872,"title":"Joe Biden warns of a 'very, very dark moment' as he hits out at Trump","text":"NYT News ServiceJoe Biden speaks at the Nebraska Democratic Party Ben Nelson Gala at the Hilton Omaha in Omaha, Neb., Friday, Nov. 7, 2025. (Christopher Smith/The New York Times)\n\nFormer President Joe Biden lashed out Friday at his successor, delivering an impassioned address in which he warned that the country was in a \"very, very dark moment\" and said President Donald Trump had acted \"in a way that embarrasses us as a nation.\" Biden, speaking at a Nebraska Democratic Party fundraising dinner in Omaha, condemned Trump for \"deliberately making hunger worse for America\" and accused him of taking a \"wrecking ball\" to the White House, the Constitution and the rule of law while enriching his own family. \"The American people are sending a message, are sending the message -- message to Trump and to his crowd,\" Biden said, at times shouting or meandering as he often did during the later years of his presidency. \"I just want you to know, you work for us, Mr. President. We don't work for you.\" In his first overtly political speech since leaving office, Biden warned that the nation had slipped into difficult times -- but said this week's elections were a reason for optimism. \"Folks, look, this isn't a golden age,\" Biden said. \"The fact of the matter is that it is a very, very dark moment. But you know, the fact of the matter is, we're in a situation where we had something very special happen just last Tuesday.\"Live Events A White House official did not immediately respond to a request for comment. Since Biden left office, many Democrats have appeared eager to move on from him. He was absent from the recent campaigns for governor in New Jersey and Virginia, even as former President Barack Obama was invited to appear at arena rallies last weekend in those states. A handful of Democrats have visited his homes in Delaware, but few have chosen to publicize their meetings. Gov. Bob Ferguson of Washington state stopped to play chess with Biden last month, and Ken Martin, the chair of the Democratic National Committee, visited the former president the day after winning an election to lead the party apparatus. In his 30-minute remarks in Omaha, Biden, 82, cycled through some of his greatest hits. He spoke about how unions had helped build the middle class, exaggerated (\"I was on the Foreign Relations Committee when I was 24 years old\") and sprinkled a dozen instances of \"folks\" throughout his remarks. He called for reopening the federal government and ending the shutdown and spoke movingly about his experience battling prostate cancer. He saved his harshest criticisms of Trump for his cuts to funding for cancer research and other health care. \"I think it's immoral, it's un-American, it's flat out wrong,\" Biden said. \"You have to ask yourself: Why? Why in God's name are they doing this? Why? Well, I'll tell you why. They give away an additional $4 trillion in tax breaks to the benefit of the wealthiest people in America.\" Biden has not been a regular on the party's chicken-dinner or fundraising circuit, where donors are far more likely to be attracted by Obama or members of the vast field of potential 2028 presidential candidates. Nebraska is a rare spot where Biden is welcome, and he received a warm reception from the local Democrats, who waved \"Jomaha\" signs from the crowd. After he finished his speech, Biden remained onstage and was wrapped in a blanket by Native American tribal leaders from Nebraska. While Vice President Kamala Harris lost the seven battleground states, she carried Nebraska's competitive 2nd Congressional District, which includes Omaha. Before Biden spoke, Nebraska Democrats played a clip in which cable networks called him as the winner of the district's electoral vote from his 2020 election night. Nebraska is one of two states that award their presidential electoral votes by congressional district. While the former president has been spotted on occasion riding Amtrak, he has had few announced public appearances in recent months. In May, he sat for a poorly received interview on ABC's \"The View\" as he sought to beat back book revelations about his mental and physical decline while in office. The same month, Biden's aides announced that he had an aggressive form of prostate cancer. In September, he had surgery to remove skin cancer lesions from his forehead and began undergoing radiation therapy at Penn Medicine Radiation Oncology in Philadelphia.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onBiden speech 2023Trump criticismNebraska Democratic Partycancer research cutsprostate cancer fundingBiden warns of dark momentDemocratic National Committeefundraising dinner Omaha2028 presidential candidates\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onBiden speech 2023Trump criticismNebraska Democratic Partycancer research cutsprostate cancer fundingBiden warns of dark momentDemocratic National Committeefundraising dinner Omaha2028 presidential candidates(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"Former President Joe Biden delivered a strong speech in Nebraska. He criticized President Donald Trump's policies and actions. Biden stated the nation is in a \"dark moment\". He also highlighted recent election results as a reason for optimism. The former president's remarks touched on his past achievements and policy stances.","url":"https://economictimes.indiatimes.com/news/international/global-trends/joe-biden-warns-of-a-very-very-dark-moment-as-he-hits-out-at-trump/articleshow/125192173.cms","image":"https://img.etimg.com/thumb/msid-125192320,width-1200,height-630,imgsize-121168,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-08 19:26:08","author":"Reid J Epstein","authors":["Reid J Epstein"],"language":"en","source_country":"in","sentiment":-0.164},{"id":377126802,"title":"Bad News for Republicans, Warnings for Both Parties","text":"Virginia and New Jersey, the two states that voted for governor in 2025, both voted for then-Vice President Kamala Harris over then-candidate Donald Trump by 52%-46% margins in 2024. Democrats ran significantly better in both states on Tuesday. One reason is that Trump Republicans, as an increasingly downscale party, see their turnout sag in off years than when the presidency is up. But that wasn’t their only problem this time.\n\nIn Virginia, Democrat Abigail Spanberger, a former CIA officer and congresswoman, won 58%-42%, well ahead of her standing in most polls. Republicans who dismiss this result as reflecting the weakness of nominee Winsome Earle-Sears should note that Democrat Jay Jones beat incumbent Attorney General Jason Miyares 53%-47%, despite the Oct. 3 revelation of Jones’ text messages that he’d like to murder a colleague and see his children die in their mother’s arms.\n\nSome 46% of Virginia voters said this was disqualifying, but even some of them voted for Jones. Its evidence that hatred of Trump’s party runs deep among many Democrats.\n\nThe most significant swing from 2024 was in northern Virginia, part of metropolitan Washington, which cast 33% of the state’s votes. That’s a highly educated, upscale community with a high percentage of federal and government contractor employees, but Republicans would be unwise to dismiss the Democrat gains as just a response to the government shutdown. It could be a forecast of what’s in store for them in Montgomery County, Pennsylvania; Oakland County, Michigan; and Waukesha County, Wisconsin.\n\nIn New Jersey, Rep. Mikie Sherrill, D-New Jersey, a Navy veteran, beat Republican Jack Ciatarelli 56%-43%, a big improvement on incumbent Gov. Phil Murphy’s, D-New Jersey, 51%-48% squeaker against Ciatarelli four years ago. Sherrill’s majority looked much like the 57%-41% Democrat advantage in the 2012, 2016 and 2020 presidential elections, which caused it to seem a solid blue state.\n\nThe big difference is that Ciatarelli was unable to duplicate the big gains that Trump made among Hispanic voters. Trump carried heavily Hispanic Passaic County with 50%—it voted only 42% Republican this year. Similarly, in Virginia, even Miyares, despite his Hispanic ancestry, won only 37% in heavily Hispanic Prince William County.\n\nNew Jersey and Virginia also have large Asian populations. But Ciatarelli won only 37% in heavily South Asian Middlesex County, behind Trump’s 44%, and in heavily Asian Loudoun County, Virginia, Republican Winsome Earle-Sears’ 35% was below Trump’s 40%.\n\nHas the Trump administration’s rough-and-ready immigration enforcement hurt his fellow Republicans? Or are we just seeing sags in turnout from low-propensity voters in low-propensity constituencies, as we have in previous contests a year after their side wins, as Republican pollster Patrick Ruffini suggests?\n\nA possible crosscurrent: The Republican percentages held up pretty closely to Trump’s 2024 percentage in Monmouth and Ocean counties on the Jersey Shore, whose demographics are similar to much of Florida’s, and in rural Southside and southwest Virginia.\n\nThen there is New York City, similarly sized (8 million-plus) to New Jersey and Virginia, whose record (since 1969) turnout of 2 million-plus was nonetheless lower than each of those states’ 3 million-plus.\n\nSince he won the June primary, the young socialist Zohran Mamdani—he turned 34 last month—has held wide leads in polls. His cheerful demeanor and clever ads, plus his emphasis on cost-of-living issues (free buses, city-owned grocery stores), have naturally produced sympathetic coverage from most media.\n\nThese media outlets have been happy to gloss over his positive attitudes toward terrorist-sponsoring Hamas and his immediate reaction to its Oct. 7, 2023, attack on Israel. They weren’t bothered by his protracted stubbornness in renouncing the “globalize the intifada” slogan, which means kill Jews everywhere, he once embraced. For months, he had wide leads in the polls thanks to split opposition from widely disliked former Gov. Andrew Cuomo and Republican nominee Curtis Sliwa.\n\nBut the results, with 93% of the votes in, have been somewhat different. In a city that voted 68%-30% for Harris over Trump, Mamdani is leading Cuomo by a decisive but far from overwhelming 50%-42%, with just 7% for Sliwa.\n\nWhile Democrats improved on Harris’ performance in Virginia and New Jersey, Mamdani far underperformed Harris in New York City. One-quarter of New York’s Harris voters supported the Republican or the candidate endorsed by Trump. Mamdani’s core constituency is highly educated, lower-income singles who congregate in central cities and university towns—what I’ve called the barista proletariat—a large bloc in New York City and decisive in the 2023 mayoral race in Chicago, but a small segment of the electorate in most of America.\n\nAs the Democrat nominee, Mamdani ran better among black people in central Brooklyn and southeast Queens than he had in the primary, and ran well below but still carried Puerto Rican and Dominican neighborhoods in the Bronx and northern Manhattan and, narrowly, heavily Mexican Corona. And he lost heavily Asian parts of Queens, though not quite as lopsidedly as Italian neighborhoods in Staten Island and Orthodox Jewish communities in Brooklyn.\n\nMamdani’s weakness among some Democrat constituencies does not represent a danger for the party across the country generally. But it does suggest that the socialist wing of the party, and those Democrats whose antipathy to Israel can verge on antisemitism, are far from a majority force nationally. It underlines the importance, in my view, for conservatives to follow the example of Ronald Reagan and William Buckley in denouncing those such as Tucker Carlson who have provided a friendly forum for the Nazi sympathizer Nick Fuentes.\n\nIn the meantime, Trump faces a tough constituency today: the Supreme Court. Will the justices, including those he appointed, accept his claim that the gauzy language of a 1977 law gives him the power to raise and lower his beloved tariffs singlehandedly? There’s a serious chance the majority-Republican-appointed court may reject that claim, as a totally Democrat-appointed court in 1952 rejected Harry Truman’s claim that he could seize the steel mills in wartime.\n\nA Supreme Court rebuff to Trump could turn out to be a political gift to the Trump Republican Party. Trump’s “Liberation Day” tariffs in April thrust his job approval downward, and 3% inflation, which, though low, can be plausibly linked to continuing tariffs, provides a basis, as Mamdani has shown, for Democrat campaigns. Also, should Trump acquiesce to an adverse Supreme Court decision, as Truman did 73 years ago, voters’ fears of an authoritarian presidency will be mitigated.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Virginia and New Jersey, the two states that voted for governor in 2025, both voted for then-Vice President Kamala Harris over then-candidate Donald Trump by... Read More\n\n\nThe post Bad News for Republicans, Warnings for Both Parties appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/08/bad-news-for-republicans-warnings-for-both-parties/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/20251107spanberger.jpg","video":null,"publish_date":"2025-11-08 19:00:00","author":"Michael Barone","authors":["Michael Barone"],"language":"en","category":"politics","source_country":"us","sentiment":-0.035},{"id":377098802,"title":"Conservatives beware: Socialism isn’t to be mocked, but feared","text":"CNN to Sen. Bernie Sanders (I-VT): “Do you think Zohran Mamdani is the leader of the Democratic Party?”\n\nSanders: “Well, of course he is.” \n\nFOR CONSERVATIVES, IT’S A TIME FOR CHOOSING\n\nThe Mamdani coalition that led him to be the leader of the Democratic Party, according to its most senior elected senator, is one that doesn’t remotely align with those of the past. In an election where the 34-year-old member of the Democratic Socialists of America beat the establishment Democrat (and hopelessly listless and entitled) Andrew Cuomo, along with Republican Curtis Sliwa, in a city with few actual Republicans even left living in it, Mamdani excelled with two groups:\n\nA) Under 30 voters: According to several exit polls, on average, almost 80% of those under 30 voted for Mamdani. \n\nB) Transplants: According to an NBC News exit poll, Mamdani won 83% of voters who have only lived in New York City for less than five years. Of those who were born and raised in New York City, that number of support drops to just 34%. \n\nYoung, college-educated voters went strong for Mamdani because his policies may have little impact on them, and because, like the future mayor, they see themselves as victims of a system that is so bad in their eyes that they suffer from mental illnesses as a result. This recent Presidential Election survey, released in October, will absolutely blow your mind: Among males in the baby boomer generation, 73% say that “no matter what psychological challenges I face, I will not let them define me.”\n\nBut when asking Generation Z (18-to-29 year old females) the same question about mental illness, a whopping 72% say that “mental illness is an important part of my identity.” Overall, according to Pew Research, 56% of young white liberal women have been diagnosed with a mental health condition. \n\nNow let’s connect the dots back to Mamdani’s victory: 81% of young women under 30 voted for him. His campaign of victimhood, of a system working against the people (despite Democrats being in complete control of New York City for the past 12 years), resonated with those who largely feel their problems are someone else’s fault, so they turned to a child and adult of privilege, a man who has never held a real job in his entire life, to fix their problems. \n\n“Here, we believe in standing up for those we love, whether you are an immigrant, a member of the trans community, one of the many black women that Donald Trump has fired from a federal job, a single mom still waiting for the cost of groceries to go down, or anyone else with their back against the wall. Your struggle is ours, too,” Mamdani declared Tuesday night. \n\nAh, the struggle. Mamdani lives in a rent-controlled apartment despite having no right to do so. He got married to a million-dollar compound in otherwise-poor Uganda earlier this year. His mother is a successful producer. His father is a tenured professor at Columbia. Yes, if anyone understands the struggle, it’s Zohran. \n\nAs for Gen Z also seeing themselves as struggling against a corrupt society despite many having a college education, this comes down to family formation. \n\nPer the U.S. Census, the average age to get married in the United States was 25 among men in 1980 and 22 among women. Today, that age has risen to over 30 for men and nearly 29 for women. As a result, according to Bloomberg, 45% of people 18-29 still live at home with their parents, marking the highest figure since the 1940s. \n\nAs for priorities, among young women who voted for Kamala Harris one year ago, they rank getting married 11th on their list of priorities as a personal definition of success. As for having children, that clocks in at 12th. \n\nBut when asking young males who voted for Trump, it’s a much different result: Having children ranks first, while getting married is close behind at fourth. \n\nSo if Mamdani comes into New York and raises taxes the way he wants to, will these young adults simply not care if the city bankrupts itself with all the tax revenue (individuals, businesses) escaping for Florida, Tennessee and Texas, because A) Mom and Dad will feel the pain, and B) there isn’t a spouse or kids to think of, only themselves as they suffer from a (fill in the blank) mental condition. \n\nWhat do these Democratic victories on Tuesday mean in blue states in 2026 and 2028? For starters, it depends on economic conditions. If Trump’s tariffs survive and pay off, Republicans are in a decent position in the swing districts that matter outside of major cities. If the economy goes south, Democrats get the same blue wave we saw in Trump’s first term in 2018. \n\nBut in the end, we’re quickly heading towards a country of two landscapes: From New York to Chicago to Minneapolis to Seattle to Los Angeles, these impossibly-blue cities will double down on socialism or the closest thing to it while attempting to protect illegals in the hopes of converting them into voters one day. In the rest of the country outside of most major cities, which if looking at the 2024 election map is almost entirely red, those places will remain right and right-of-center. \n\nThe political split between American cities and everywhere else is only getting wider. \n\nDemocrats will continue to bear-hug socialism, thinking they’ve tapped into some kind of secret potion that’s been under their noses all along. \n\nLet’s end this with this disturbing nugget: Per Gallup, 66% of Democrats now view socialism more favorably than capitalism (42%), while nearly 80% of Republicans view capitalism favorably. \n\nDON’T LET TUCKER CARLSON’S DEFENDERS GASLIGHT YOU ABOUT FREE SPEECH\n\nThis is the new battleground. And it isn’t going away. Just ask entrepreneur and conservative activist Peter Thiel. “When 70% of Millennials say they are pro-socialist, we need to do better than simply dismiss them by saying that they are stupid or entitled or brainwashed; we should try and understand why,” Thiel wrote in January 2020. \n\nHe’s right. And the right needs a counterargument to this, because the socialist bug isn’t going to drift away, but become a political hurricane.","summary":"In Focus delivers deeper coverage of the political, cultural, and ideological issues shaping America. Published daily by senior writers and experts, these in-depth pieces go beyond the headlines to give readers the full picture. You can find our full list of In Focus pieces here. “We will prove that there is no problem too large [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3880209/conservatives-beware-socialism-isnt-to-be-mocked-but-feared/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/11/zohran-mamdani.jpg?w=696","video":null,"publish_date":"2025-11-08 19:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","category":"politics","source_country":"US","sentiment":-0.068},{"id":377114252,"title":"Biden claims 'Democratic Party is back' after election, says late son 'should have been the president, not me'","text":"Former President Joe Biden told Nebraska Democrats on Friday that their party \"is back\" after a series of sweeping election wins last week and also accused President Donald Trump of destroying the Constitution and cutting health care and food assistance for millions of Americans. Biden, 82, speaking at the Nebraska Democratic Party’s \"Ben Nelson Gala\" in Omaha, also urged Republicans to end the ongoing government shutdown and said his late son, Beau Biden, should have been president, not himself. \"The Democratic Party is back. That's not hyperbole,\" Biden said. \"Did you see the election results?\" CHUCK TODD SAYS BIDEN'S PRESIDENCY WAS SO 'WEAK AND INEFFECTIVE' IT MADE PEOPLE GO BACK TO TRUMP Rep. Mikie Sherrill, D-N.J. and former Rep. Abigail Spanberger, D-Va., won gubernatorial races in their respective states, while Democratic socialist candidate Zohran Mamdani scored a stunning victory to become New York City’s next mayor. The wins came a year after former Vice President Kamala Harris suffered a stinging defeat to Trump. Harris was propelled to the top of the 2024 Democratic presidential ticket after Biden backed out of the race following a blistering debate performance against Trump. \"Well, the American people are sending a message, a message to Trump and to his crowd,\" Biden said, accusing the president of trampling on democracy and working for the rich. \"I just want you to know you work for us, Mr. President. We don't work for you,\" Biden said. \"You work for us, not just billionaires and millionaires. You know, this is democracy. And the fact of the matter is that there are no kings in democracies. None. None. But you act in a way that embarrasses the nation.\" Biden said Trump and the GOP were cutting health care programs and driving up costs, adding that more than 300 rural hospitals in America, including two in Nebraska, are expected to shut down. BIDEN PRAISES LATE-NIGHT HOSTS SPEAKING OUT AGAINST TRUMP 'KNOWING THEIR CAREERS ARE ON THE LINE' \"Folks, I've never said this my whole career. I think it's immoral. It's un-American. It's flat-out wrong,\" Biden said. Biden, who had a bandage on his head, referred to his own battle with cancer and praised the health care workers who have been treating him. He was diagnosed with stage four prostate cancer earlier this year. \"I know what cancer research means. Cancer. It’s every family. It hit my family hard, just as so many of yours,\" Biden said. \"When the love of my life, my oldest son, the attorney general of the state of Delaware, who should have been the president, not me, volunteered to go to Iraq for a year, didn’t have to, came back with stage four glioblastoma because he lived in a burn pit just like those guys did on 9/11, and he died.\" Biden also took aim at Trump’s plans to build a new ballroom at the White House after bulldozing the East Wing, calling it \"the perfect symbol of his presidency.\" \"When I left the presidency, President Trump was going to take a wrecking ball to the country, but I had no idea it would be an actual wrecking ball,\" Biden said. \"Anyone see what he's done to the East Wing of the people’s house? Trump has taken a wrecking ball not only to the people’s house, but to the Constitution, to the rule of law, to our very democracy.\" He also accused Trump of \"deliberately making hunger worse\" and claimed \"one in five children go to bed hungry every night.\" He mocked Trump for holding a \"Great Gatsby\" themed Halloween party at Mar-a-Lago while cutting food aid for millions, saying it showed \"who he is.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"On Friday, everyone dressed up like the rich folks they are from the Roaring Twenties and on Saturday he cut assistance to 40 million Americans,\" Biden said. The White House did not immediately respond to a Fox News Digital request for comment.","summary":"Former President Joe Biden said in a post-election speech in Nebraska the &quot;Democratic Party is back&quot; and accused Donald Trump of wrecking the Constitution.","url":"https://www.foxnews.com/politics/biden-claims-democratic-party-back-after-election-says-late-son-should-have-been-president-not-me","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/joe-biden.jpg","video":null,"publish_date":"2025-11-08 18:43:49","author":"Michael Dorgan","authors":["Michael Dorgan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.328},{"id":377253072,"title":"Trump Supporters Willing To Take Tax Hit For MAGA-Endorsed Policy, Poll Finds","text":"Supporters of President Donald Trump would be willing to take a tax hit if it was the effect of a policy endorsed by the president, according to polling by Politico and Public First released Saturday.\n\nThe commissioners of the poll offered variations of two hypothetical laws to thousands of poll respondents, only altering the endorsements of the law in each variation. While the typical MAGA voter would not support legislation granting them a tax break if Trump and Republicans opposed it, they would support a bill imposing extra tax burdens if it was endorsed by them, according to the findings.\n\nAdditionally, laws only supposed by the GOP but not Trump performed much worse among poll respondents, with Trump supporters, on average, then only expressing a willing to take a much smaller tax hit. (RELATED: Trump Orders DOJ To Probe Meatpacking Industry, Slams ‘Illegal Monopolies’)\n\nConversely, the average poll respondents supporting former Vice President Kamala Harris would not embrace tax cuts if the hypothetical policy responsible for them was supported by Trump, unless the tax breaks exceeded $33 a month or more. The same respondents would also sacrifice the creation of more than 1,000 jobs in their state and a 40-cent cut to egg prices if Trump supported the hypothetical legislation.\n\nTrump successfully channeled the loyalty and priorities of his coalition of supporters in both his presidential runs to reshape the political order, including the Republican Party. Trump, however, remains a divisive figure across party lines, with Democrats widely disapproving Trump’s presidency while also broadly disapproving of Democratic officials perceived as not doing enough to stifle his agenda.\n\nTrump’s endorsement power had more than double the effect on respondents than that of Republican lawmakers alone, according to the polling experiment.\n\nThe White House did not immediately respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"The commissioners of the poll offered variations of two hypothetical laws to thousands of poll respondents, only altering the endorsements of the law in each variation","url":"https://dailycaller.com/2025/11/08/donald-trump-supporters-accept-tax-hit-maga-endorsed-policy-politico-public-first-poll-finds/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F11%2FGettyImages-2217152580-scaled-e1762620371342.jpg","video":null,"publish_date":"2025-11-08 18:33:54","author":"Wallace White","authors":["Wallace White"],"language":"en","category":"politics","source_country":"US","sentiment":-0.276},{"id":377121560,"title":"Gone Too Far? Controversial Comic Bill Maher Sparks Liberal Meltdown With Sick Joke About Ex-Veep Dick Cheney's Death","text":"Blowhard Bill Maher got a taste of how his ultra-liberal Real Time audience truly felt about former right-wing Vice President Dick Cheney when a joke about his death completely bombed.\n\nThe comedian, 69, misread his heavily left-leaning audience's opinion about the Republican who, despite his reputation as a war-monger while in office, gained new Democrat fans by bashing Donald Trump in his later years.\n\nCheney died at the age of 84 on November 3 due to complications from pneumonia and cardiac and vascular disease.One Dead Joke WorkedMaher lined up the Cheney joke by making fun of how some New York City voters likely weren't aware that Guardian Angels founder and Republican mayoral candidate Curtis Sliwa was still alive.\n\nSliwa, 71, became a popular Big Apple figure in the 1980s as his community safety group patrolled the subways and other public areas to fight crime. \n\nMaher joked that Sliwa \"was dogged by accusations of: we thought you were dead,\" while running against eventual winner, Democratic Socialist Zohran Mamdani, who rode to victory in a landslide.No Laughs Over Cheney\"Speaking of we didn't know you were dead, Dick Cheney died,\" Maher deadpanned as a transition, about another Republican, to which the audience fell silent except for a few groans.\n\nThe host appeared shocked and took a few beats before reacting as he very much misjudged his liberal audience.\n\n\"How many people thought he was dead? C'mon,\" the stunned funnyman snarked as his joke brought zero laughs. \n\nMaher tried to move on, seeking humor in the former Halliburton CEO's longtime career in the oil and gas industry. \n\n\"Anyway, the most powerful vice president ever, many people have said, and also a simple man who had a simple burial wish,\" Maher claimed. \"He said he wanted to be put in the ground to live his dream of slowly turning into oil.\"Maybe a Trump Joke?Maher then attempted to get laughs out of Trump sending National Guard troops into several crime-ridden U.S. cities. \n\nHe noted how Cheney and Trump \"were very different kinds of Republicans.\"\n\n\"Cheney used to send troops to occupy other countries,\" the New York native joked about the architect of the post 9/11 wars with Iraq and Afghanistan, which Cheney masterminded for his boss, then-President George W. Bush.Voted For Kamala HarrisWhile Cheney was loathed by Democrats during his two terms in office with Bush, 79, he gained a new following among left-wing voters by refusing to endorse Trump for president in 2024 and openly bashing him.\n\n\"There has never been an individual who is a greater threat to our republic than Donald Trump,\" Cheney warned while announcing he was making the rare move of casting his vote for Democratic presidential candidate Kamala Harris.\n\n\"He tried to steal the last election using lies and violence to keep himself in power after the voters had rejected him,\" the former veep sneered about the January 6, 2020, U.S. Capitol insurrection after Trump lost to Joe Biden.\n\nCheney added, \"He can never be trusted with power again. As citizens, we each have a duty to put country above partisanship to defend our Constitution.\"\n\nHis endorsement of Harris angered Republicans, and Trump went on to secure a second term as president.","summary":"Bill Maher tried to joke about former Republican Vice President Dick Cheney's death, but his left-wing audience found no humor in it.","url":"https://radaronline.com/p/bill-maher-angers-liberals-dick-cheney-death-joke-real-time/","image":"https://media.radaronline.com/brand-img/N2LBfr1b6/0x0/bill-maher-angers-liberals-dick-cheney-joke-1762624913523.jpg","video":null,"publish_date":"2025-11-08 18:29:09","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":0.002},{"id":377089608,"title":"Colorado college student government reverses course on TPUSA chapter after emergency meeting","text":"A Colorado college student government reversed its decision to block a Turning Point USA (TPUSA) chapter during an emergency meeting on Friday night. The Associated Students of Fort Lewis College (ASFLC) voted to approve the TPUSA chapter after previously rejecting senior Jonah Flynn’s proposal to register the group with the university. \"It was strange. They put us in a tiny room, with at least 100 people being forced to wait outside. Tons of local conservatives, students and community members. Inside the meeting, we got to speak briefly, and they immediately voted and unanimously approved it,\" Flynn told Fox News Digital. Flynn planned to appeal the decision to the student court because the vote to block the chapter seemed to be a violation of his constitutional rights. MICHIGAN COMMUNITY COLLEGE APPROVES TPUSA CHAPTER AFTER STUDENT GOVERNMENT REJECTION A spokesperson for Fort Lewis College told Fox News Digital Friday that the institution \"is committed to fostering an inclusive, student-centered learning environment that values both free expression and responsible leadership.\" \"Following a review and rescission of its earlier decision, the Associated Students of Fort Lewis College voted to approve Turning Point USA as a Registered Student Organization (RSO) during an emergency meeting on Friday night,\" Public Information Officer Nardy Baeza Bickel told Fox News Digital. \"This outcome reflects ASFLC’s commitment to fair governance, educational growth, and consistent policy application. Recognition does not imply endorsement of any organization’s viewpoints; all RSOs are expected to follow college policies and uphold community standards,\" Bickel explained further. \"Fort Lewis College appreciates ASFLC’s leadership in addressing a complex issue and continues to support students in developing their understanding of free expression, inclusion, and civic responsibility,\" she added. The benefits of registering the TPUSA chapter on FLC’s campus is that organizers have access to the school’s facilities for events. Flynn hopes to host a larger event than the one he held before through TPUSA. LOUISIANA GOP THROWS WEIGHT BEHIND TURNING POINT USA CHAPTER REJECTED BY NEW ORLEANS UNIVERSITY: 'INJUSTICE' Flynn was at the center of controversy when he sought to start a TPUSA chapter, prompting a petition that accused TPUSA of causing harm to students. Critics alleged that Flynn’s plan mirrored TPUSA’s national \"professor watchlist,\" which has faced backlash. The Herald reported that only three people supported Flynn’s proposal to start a chapter. On Oct. 17, a petition which was launched by the Fort Lewis College community garnered over 400 signatures, arguing that TPUSA \"has engaged in actions that directly harm our community.\" \"At a college where many students identify as Indigenous, students of color, LGBTQ+, or from other underrepresented backgrounds, this harm cannot be ignored,\" the petition reads. \"We are calling on Fort Lewis College to take action that prioritizes student safety and well-being by refusing to recognize the TPUSA chapter as an RSO.\" Shortly after the chapter was denied, a counter-petition launched backing TPUSA, garnering over 1,000 signatures so far. Flynn stood before the ASFLC board as it voted against establishing a TPUSA chapter in front of a crowded room last week. The seven elected senators on the board blocked the chapter. TURNING POINT USA CHAPTER DENIED OFFICIAL STATUS BY LOYOLA UNIVERSITY NEW ORLEANS STUDENT GOVERNMENT \"Many of our morals and interests must be pushed to the side,\" said Asa Worthington, the student body president of the Associated Students of Fort Lewis College. \"The safety of our student body and the FLC community has always been and always will be ASFLC’s top priority.\" Kirk’s debating style inspired Flynn, a Philosophy major, to start a TPUSA chapter. His campus is located in La Plata County, which went heavily for Kamala Harris in 2024. Kirk was assassinated on Sept. 10 while speaking at Utah Valley University, which has sparked a huge interest across the country to start new TPUSA chapters in high schools and colleges. \"I was really upset by what happened to Charlie. I was just sort of mourning and emotional and upset about it. Then I decided that what we need to do is not sort of back down,\" Flynn told Fox News Digital. CLICK HERE TO GET THE FOX NEWS APP","summary":"Colorado college student government unanimously approved Turning Point USA chapter after senior Jonah Flynn cited constitutional rights violations in the initial rejection.","url":"https://www.foxnews.com/media/colorado-college-student-government-rescinds-vote-denying-tpusa-chapter-emergency-meeting","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/flynn1-1.jpg","video":null,"publish_date":"2025-11-08 17:10:54","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.252},{"id":377087304,"title":"Social media erupts after far-left mayor gives victory speech in foreign language: 'Humiliating'","text":"Newly re-elected Minneapolis Democratic Mayor Jacob Frey is facing backlash from conservatives for giving a victory speech in Somali and saying that Minneapolis welcomes Somalians. In a video of the speech posted online, Frey can be seen leading chants in Somali as the crowd responds and applauds. Popular conservative influencer Paul Szypula ripped into the progressive mayor, writing, \"The pandering here is insane.\" \"Mayor Jacob Frey, as he won reelection, spoke almost a minute in Somalia then said Minneapolis belongs to Somalia,\" said Szypula. MINNEAPOLIS MAYOR’S RACE ADVANCES TO RANKED CHOICE VOTING AFTER NO CANDIDATE REACHES 50% In a second round of nonpartisan ranked-choice voting, Frey narrowly defeated a challenge from socialist Minneapolis state Sen. Omar Fateh. Fateh is the first Somali American and first Muslim to serve in the state senate. Fateh had the backing of the Twin Cities' chapter of the Democratic Socialists of America and \"Squad\" member Rep. Ilhan Omar, D-Minn., who represents Minneapolis in the U.S. House of Representatives. Meanwhile, Gov. Tim Walz, D-Minn., who was former Vice President Kamala Harris' running mate last year and is up for re-election next year, and Sen. Amy Klobuchar, D-Minn., endorsed Frey's campaign this year. While speaking with a crowd of Somali residents after his victory, Frey repeatedly thanked the crowd in Somali. ILHAN OMAR ERUPTS AT OWN PARTY FOR RENEGING ON SOCIALIST CANDIDATE'S ENDORSEMENT: 'INEXCUSABLE' \"To the great people of Minneapolis, and I say that very intentionally, because no matter where you are from, Minneapolis should be a place where you are proud to call home,\" he said. He then proceeded to list off a number of Somalian regions, saying, \"Whether you are from Bosaso or Mogadishu, whether you are from Hargeisa or Garowe, whether you are from Beledweyne or southwest, Minneapolis is a place where you come to seek prosperity, where you come to raise your family.\" \"Here is what this election means, this election means this is a moment for unity, where the entire Somali community can come together and say, ‘This is our people, this is our city, we are united behind each other,\" he said. Conservative pundit Gerry Callahan slammed Frey's speech, saying, \"This is an American politician, raised in America, educated in America, ostensibly representing Americans, prostrating himself in front of bunch of foreigners. Could be the most humiliating thing I’ve ever seen.\" Podcaster Matt Walsh also chimed in, writing, \"As I have said many times now, politicians in this country should be required by law to speak English when addressing the public in an official capacity. There should never be a time when Americans can’t understand what their elected leaders are saying.\" MINNEAPOLIS BECOMES FIRST MAJOR US CITY TO ALLOW MUSLIM CALLS TO PRAYER AT ALL HOURS Nick Sortor wrote, \"I don’t know how large ICE’s presence in Minneapolis is, but it needs to be much, MUCH larger.\" Fox News Digital reached out to Frey’s team for comment, but did not immediately receive a response. CLICK HERE TO DOWNLOAD THE FOX NEWS APP This is not the first time Frey has garnered criticism over Somali-language political messaging. He was also widely criticized in September for releasing a campaign ad in Somali. Rep. Chip Roy, R-Texas, commented on the ad, saying, \"This must be stopped.\" Rep. Mike Collins, R-Ga., also reacted to the ad, posting a disapproving gif. Kari Lake simply wrote, \"WTAF?\" which is an acronym for \"what the actual f---.\" Having entered office in 2018, Frey was elected to his third term as Minneapolis mayor on Tuesday. He is best known for marching with protesters during the 2020 Black Lives Matter riots, which were particularly destructive in Minneapolis, the city in which George Floyd died. Frey was also seen kneeling and weeping by Floyd’s casket at a memorial service.","summary":"Newly re-elected Minneapolis Democratic Mayor Jacob Frey is taking criticism for giving a victory speech in Somali and saying that Minneapolis belongs to Somalia.","url":"https://www.foxnews.com/politics/social-media-erupts-after-far-left-mayor-gives-victory-speech-foreign-language","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/jacob-frey.png","video":null,"publish_date":"2025-11-08 16:30:50","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":377091818,"title":"Obamacare Insurers Bet $400 Billion on Shutdown Democrats","text":"The following content is sponsored by American Resolve.\n\nHealth insurers have never had it so good. Their stocks are up more than 1,000 percent since Obamacare passed, and they now receive roughly a trillion dollars per year in federal subsidies.\n\nWith that much taxpayer money at stake, politics inevitably follows the cash—and lately, the industry has taken a hard-left turn.\n\nIn the last presidential campaign, insurers gave five times more to Kamala Harris than to Donald Trump. Blue Shield of California donated $500,000 and UnitedHealth donated $75,000 to Gov. Gavin Newsom’s ballot measure effort, Prop. 50, which could hand Democrats, and health insurers, as many as five additional seats in Congress. Newsom’s Prop. 50 won last week, increasing the chances of Democrats retaking the House and enacting their radical agenda, which includes impeaching President Donald Trump.\n\nThe strategy appears to be paying off. Democrats in Congress are repaying the favor by shutting down the government in order to keep $400 billion in Obamacare subsidies flowing from the American taxpayer to the insurance companies—and thus back to Democrats.\n\nThese are temporary COVID-era enhanced subsidies that the Democrats and their insurance company benefactors want to make permanent. Insurers have been surreptitiously enrolling people who aren’t even aware they have coverage and don’t use the policies, thus pouring more federal cash into insurance company coffers without requiring any outlays on the insurers’ part. This is a scam whose scale and duplicity is only achievable at the intersection of corporate cronyism and a bloated federal budget.\n\nAnd the political patronage doesn’t stop there. Health insurers are already paying back the Democrats. This year, they’re hiking Obamacare premiums by 26 percent, even though overall U.S. health care costs are up only about 6 percent.\n\nThat’s a sharp contrast to last year, when insurers held premium hikes to just 4 percent as Joe Biden and Kamala Harris ran for re-election. Did insurance companies simply defer their losses into this year, or are they actively punishing Republicans who face mid-term elections next year? This ploy achieves both goals.\n\nFurthermore, this health insurance company-led government shutdown has the effect of supporting Democrats’ other controversial shutdown goals, such as keeping nearly $200 billion in free health care benefits flowing to illegal immigrants.\n\nMeanwhile, health insurers are not putting federal subsidies to use for the benefit of ratepayers and taxpayers. In fact, like with much of the federal budget, our money is going down the drain.\n\nFederal auditors project that Medicare Advantage overbilling will exceed $1 trillion this decade. This year, the Trump Administration increased Medicare payments by $25 billion, of which UnitedHealthcare alone may receive about $7 billion.\n\nSoon after, The Wall Street Journal reported that UnitedHealthcare, the biggest Obamacare insurer, paid $9 billion to AARP—essentially to stamp its name on the company’s Medicare plans. That comes as United faces a federal investigation into Medicare overbilling, a risk that could threaten its long-term solvency.\n\nImagine if that $9 billion had gone to patients instead. How any of this helps seniors is unclear.\n\nIf Republicans agree to extend the Obamacare subsidies, it should come with a condition: make insurers pay for the privilege. One option is to pass the bipartisan NO UPCODE Act, which would curb the industry’s Medicare Advantage overbilling. It would help put an end to the practice of using inaccurate or exaggerated diagnoses to inflate claims.\n\nThe Congressional Budget Office estimates the measure would save taxpayers $124 billion. Half could extend Obamacare subsidies for two years; the rest could reduce the deficit.\n\nAfter raising premiums, cutting benefits, and facing federal investigations for overbilling Medicare, insurers need to rebuild public confidence, not test it.\n\nBacking a government shutdown to get $400 billion is the wrong approach—and a sure way to invite political backlash.","summary":"Health insurers have never had it so good. Their stocks are up more than 1,000 percent since Obamacare passed, and they now receive roughly a trillion dollars per year in federal subsidies.\n\n\nThe post Obamacare Insurers Bet $400 Billion on Shutdown Democrats appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/11/08/obamacare-insurers-bet-400-billion-on-shutdown-democrats/","image":"https://media.breitbart.com/media/2025/11/spc-ar-11-8-25-640x335.png","video":null,"publish_date":"2025-11-08 16:26:18","author":"American Resolve","authors":["American Resolve"],"language":"en","category":"politics","source_country":"US","sentiment":-0.515},{"id":377109470,"title":"Pop Singer Olivia Rodrigo Lashes Out at DHS Video Using Her Song: 'Racist, Hateful Propaganda'","text":"Pop star Olivia Rodrigo left an angry comment on a social media post from the Department of Homeland Security (DHS) scolding the federal agency for using one of her songs in a video about deportations.\n\nView this post on Instagram\n\nIn a brief meme that was also shared to the official White House Instagram account, the DHS clip tells illegal immigrants that they will be pursued and roughly apprehended “IF ICE FINDS YOU,” but they will receive gentle and respectful treatment “IF YOU SELF-DEPORT.” The soundtrack of the two segments flips from a chaotic punk breakdown to a calm vocal interlude, both taken from Rodrigo’s 2023 song “All-American Bitch.”\n\nThe ad then directs viewers to a site with information about the CBP Home app, which illegal aliens can use to arrange federal assistance to return to their home countries.\n\nRodrigo showed up in the comments of the post, writing: “don’t ever use my songs to promote your racist, hateful propaganda.”\n\nA DHS representative rebuked the 22-year-old former Disney Channel actress in a statement to TMZ: “America is grateful all the time for our federal law enforcement officers who keep us safe. We suggest Ms. Rodrigo thank them for their service, not belittle their sacrifice.”\n\nAfter her instant rise to pop superstardom at age 17, Rodrigo has dutifully promoted partisan left-wing causes, from baby sacrifice to experimental mRNA injections to Kamala Harris’s doomed presidential campaign. And, beyond just supporting these causes, the “Drivers License” singer has spewed a fair amount of venom at those who don’t share her views.\n\nAfter the Supreme Court overturned Roe v. Wade in the landmark case Dobbs v. Jackson Women’s Health Organization, Rodrigo dedicated a song titled “Fuck You” to the conservative justices who ruled states have a right to punish gestational infanticide. “They truly don’t give a shit about freedom,” she said from the stage.\n\n“This song goes out to the justices Samuel Alito, Clarence Thomas, Neil Gorsuch, Amy Coney Barrett, and Brett Kavanaugh,” she continued. “We hate you.”\n\nIn June of 2025, Rodrigo denounced Immigration and Customs Enforcement (ICE) operations in Los Angeles, writing on social media: “I’m deeply upset about these violent deportations of my neighbors under the current administration.”\n\n“LA simply wouldn’t exist without immigrants,” she asserted. “Treating hardworking community members with such little respect, empathy, and due process is awful. I stand with the beautiful, diverse community of Los Angeles and with immigrants all across America.”","summary":"Pop star Olivia Rodrigo left an angry comment on a social media post from the DHS scolding the federal agency for using one of her songs in a video about deportations.\n\n\nThe post Pop Singer Olivia Rodrigo Lashes Out at DHS Video Using Her Song: &#8216;Racist, Hateful Propaganda&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/11/08/pop-singer-olivia-rodrigo-lashes-out-at-dhs-video-using-her-song-racist-hateful-propaganda/","image":"https://media.breitbart.com/media/2025/11/GettyImages-2228151150-640x335.jpg","video":null,"publish_date":"2025-11-08 16:24:02","author":"Ezra Dulis","authors":["Ezra Dulis"],"language":"en","source_country":"US","sentiment":0.205},{"id":377096588,"title":"Trump wants to make the same mistake Biden did","text":"In the wake of the GOP’s electoral drubbing this past Tuesday, President Donald Trump had thoughts. After insisting it wasn’t his fault, he offered a prescription: Republicans need to talk more about their economic record. \n\n“These are the things you have to talk about,” he said. “If people don’t talk about them, then you can do not so well in elections.”\n\nThinking that was the problem is exactly the mistake President Joe Biden and Vice President Kamala Harris made.\n\nThe economy under Biden was the envy of the world—low unemployment, solid growth, and inflation well below that of peer nations. Democrats talked about it endlessly. I talked about it endlessly. But for a second America—crushed by rising costs, stuck in low-wage jobs, and left with little chance of upward mobility—it didn’t feel like prosperity. To them, life was getting harder.\n\nThat America looked at its options. Trump said the economy was “a disaster.” He wasn’t right in the macro sense, but for people taking items out of their grocery carts, it sure felt like one. Democrats, meanwhile, kept insisting things weren’t just fine—they were amazing. World-class economy! Record jobs! Historic growth! But no statistic can convince someone living a hard reality that things are okay.\n\nSo, in 2024, they rewarded the guy who said the economy was a disaster. Trump won voters making under $50,000 a year, 50% to Harris’ 48%, according to exit polls.\n\nThat flipped back on Tuesday, as lower-income voters snapped hard to the Democrats.\n\nAnd Trump’s takeaway? That voters just don’t understand how good they have it. On Thursday he even said, “I don’t want to hear about the affordability, because right now we’re much less. If you look at energy, we’re getting close to $2 a gallon gasoline.”\n\nExcept we’re not. Gas prices are higher on average now than a year ago, and everyone who counts their dollars at the pump knows it. The same thing happened earlier this fall, when he claimed prices were “WAY DOWN,” and even his biggest fans didn’t buy it.\n\nTrump is trying to spin away people’s real pain. The difference is that Biden could at least point to genuine accomplishments. Trump has none beyond a strong stock market that mainly benefits people making over $100,000 a year—voters who now lean Democratic.\n\nTuesday’s results suggest that poorer voters know they screwed up by voting Republican in 2024. They didn’t make that mistake in 2025. And unless Trump finds something real to offer them—beyond bigger and bolder lies—they won’t in 2026, either.\n\nYou can’t tell people who are struggling to make ends meet that everything’s fine. Trump’s about to learn the same lesson.","summary":"In the wake of the GOP’s electoral drubbing this past Tuesday, President Donald Trump had thoughts. After insisting it wasn’t his fault, he offered a prescription: Republicans need to talk more about their economic record. \n\n\n\n“These are the things you have to talk about,” he said. “If people don’t talk about them, then you can do not so well in elections.”\n\n\n\nThinking that was the problem is exactly the mistake President Joe Biden and Vice President Kamala Harris made.\n\n\n\nThe economy under Biden was the envy of the world—low unemployment, solid growth, and inflation well below that of peer nations. Democrats talked about it endlessly. I talked about it endlessly. But for a second America—crushed by rising costs, stuck in low-wage jobs, and left with little chance of upward mobility—it didn’t feel like prosperity. To them, life was getting harder.\n\n\n\nThat America looked at its options. Trump said the economy was “a disaster.” He wasn’t right in the macro sense, but for people taking items out of their grocery","url":"https://www.dailykos.com/story/2025/11/8/2352658/-Trump-wants-to-make-the-same-mistake-Biden-did?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1246406/story_image/AP23315572079441.jpg?1699809495","video":null,"publish_date":"2025-11-08 16:00:05","author":"kos","authors":["kos"],"language":"en","category":"politics","source_country":"US","sentiment":-0.549},{"id":377109482,"title":"VIDEO: James Carville Wants to Run a 'Convicted Pedophile' Against a Republican Candidate","text":"Democrat strategist James Carville is apparently not above running a criminal in a political campaign just to see if that person could win against a Republican candidate.\n\nCarville made his statement during a recent podcast episode of Politics War Room when he responded to a statement about Virginia.\n\n“By the way, if we won the attorney general’s race, I’m personally going to find a convicted pedophile and run him in a race just to see if he could beat a Republican. I’m not sure. I’m not going to say they’re convicted, a convicted pedophile. And by the way, the guy that was running against him ran a pretty good campaign,” Carville said:\n\nOn Election Day Tuesday, Democrat Jay Jones narrowly won the Virginia Attorney General race against incumbent Republican Jason Miyares, per Breitbart News:\n\nJones’s projected victory comes after a race largely characterized by a scandal involving text messages from 2022 showing Jones fantasizing about Virginia House Speaker Todd Gilbert and his children being gunned down.\nThe texts were a major flashpoint, as Republicans pressured Democrats to revoke their endorsements of Jones and disavow his violent rhetoric, especially in the wake of the assassination of Turning Point USA founder Charlie Kirk.\n\nPresident Donald Trump had endorsed Miyares in the race. At the time of his endorsement, Trump called on Jones to “drop out of the race” over his violent text messages.\n\nIn addition, Democrat gubernatorial candidate Abigail Spanberger won her race after refusing to revoke her endorsement of Jones when the text message scandal erupted.\n\nPrior to President Donald Trump’s victory over former Vice President Kamala Harris (D) in November 2024, Carville said he was “scared to death” about the election and “very concerned.”\n\nHe has since suggested a split in the Democrat Party was necessary for it to survive, saying “[M]aybe we need to have a schism,” Breitbart News reported in April.","summary":"Democrat strategist James Carville is apparently not above running a criminal in a political campaign just to see if that person could win against a Republican candidate.\n\n\nThe post VIDEO: James Carville Wants to Run a &#8216;Convicted Pedophile&#8217; Against a Republican Candidate appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/11/08/video-james-carville-wants-run-convicted-pedophile-against-republican-candidate/","image":"https://media.breitbart.com/media/2025/11/James-Carville-640x335.jpg","video":null,"publish_date":"2025-11-08 15:46:05","author":"Amy Furr","authors":["Amy Furr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.273},{"id":377061166,"title":"Patriot or 'Pathetic RINO'? Maverick Republican Thomas Massie trades 'America First' label for 'America only'","text":"Rep. Thomas Massie — a Republican fiscal hawk facing a President Donald Trump-backed primary challenger in Kentucky — has previously described himself as \"America First,\" but now he says he thinks that he's \"America only.\" \"I am tired of sending money overseas,\" he told Fox News Digital during an interview on Thursday. \"I am tired of favoring foreign beef over U.S.A.-grown beef,\" he continued. \"I'm ready to be America only. And I think all congressmen should be that way.\" Massie gave Trump a mixed review, saying that the president is America First on \"some\" fronts. REP THOMAS MASSIE REMARRIES AFTER WIFE'S DEATH LAST YEAR: ‘PLEASE PRAY FOR US’ \"But when it comes to the beef, he is not America first. When it comes to sending money overseas to Ukraine and Israel,\" Massie said, \"I think he needs to get back to his campaign promises and put America first. Because we're not gonna make America great again by sending our money overseas.\" Massie noted that his \"biggest disagreement\" with both the Trump administration and House Speaker Mike Johnson, R-La., is the increase in spending. \"I mean, I thought we were conservatives. Why are we spending more this year than Joe Biden spent in his last year? Actually, we're spending about $200 billion dollars more,\" he said, adding that the consequence \"is inflation and higher interest rates.\" \"And people are feeling that. You can't gaslight them,\" Massie added. \"You can't tell them that things are getting cheaper when they're not getting cheaper.\" In a statement to Fox News Digital, White House spokesman Kush Desai accused Massie of \"Fake Math.\" TRUMP SAYS MASSIE IS ‘GONNA BE HISTORY’ AS ‘BIG, BEAUTIFUL BILL’ JUMPS FINAL HURDLES TO PASSAGE \"Here are the facts: President Trump’s Working Families Tax Cut Act cut mandatory spending by $1.5 trillion over the next 10 years, and the budget deficit from April to September of this year is down a staggering 40% compared to last year, when Joe Biden was president,\" Desai declared in the statement. \"Instead of Fake Math, Thomas Massie should reflect on how he betrayed his voters and hardworking Americans when he voted with every Democrat against the biggest tax cut for working families in American history, including no tax on tips, no tax on Social Security, no tax on overtime pay, increased child tax credits, and permanence for the 2017 Trump Tax Cuts,\" he added. Massie said his other disagreements with what has been happening in D.C. are \"secondary\" to the spending issue. \"I would say, we need to follow through on some of our campaign promises. For instance, release the Epstein files,\" he said. MAVERICK HOUSE REPUBLICAN IN TRUMP'S CROSSHAIRS TOUTS RECORD CAMPAIGN CASH HAUL Massie and Rep. Ro Khanna, D-Calif., have been spearheading a bid to force a House vote on a proposal that would compel the release of materials pertaining to Jeffrey Epstein. Their discharge petition has amassed 217 of the 218 signatures needed to force the vote, but Democratic Rep.-elect Adelita Grijalva, who has said she will sign on, has still not yet been sworn in to office more than six weeks after winning a special election in Arizona. Johnson \"has tried every which way he can to avoid this vote,\" Massie claimed, asserting that the speaker has not sworn in the Democrat because she \"represents the 218th signature I need to force a vote on releasing the Epstein files.\" Fox News Digital reached out to Johnson's office for comment. RAND PAUL PLEDGES SUPPORT FOR MASSIE AGAINST TRUMP-BACKED CHALLENGER: ‘I’M GOING TO HELP HIM' Massie, who owns cattle himself, said the president has \"sort of gut punched the cattle ranchers and… livestock farmers\" in the U.S. During remarks aboard Air Force One last month, Trump indicated the U.S. was considering buying beef from Argentina to drive down prices. Days later Reuters reported that a White House official indicated that the administration was quadrupling the nation's low-tariff imports of beef from the South American nation. Increasing the tariff rate quota to 80,000 metric tons will allow Argentina to send greater quantities of the product to America at a lower rate of duty, according to the outlet. The president has Massie in his political crosshairs — he has repeatedly reviled the congressman on Truth Social. In a post on Monday, Trump referred to Massie as \"a Weak and Pathetic RINO\" — a pejorative acronymn that stands for \"Republican in name only.\" He also called the congressman \"a totally ineffective LOSER,\" while expressing his support for primary challenger Ed Gallrein, who Trump is backing in the race. SCOOP: TRUMP-BACKED FORMER NAVY SEAL LAUNCHES GOP PRIMARY CHALLENGE AGAINST MASSIE Even as the president tries to convince voters in Kentucky's 4th Congressional District to reject Massie, the lawmaker said that he does not regret endorsing Trump ahead of the 2024 election, noting that former Vice President Kamala Harris would have been a total \"disaster.\" Massie initially backed Florida Gov. Ron DeSantis in the GOP presidential primary, but DeSantis dropped out and backed Trump, and Massie later endorsed the Republican juggernaut as well. CLICK HERE TO GET THE FOX NEWS APP \"And I'm glad that President Trump won,\" he said. Trump has \"done a lot of good things,\" he said, adding that many of them have been carried out via executive order, and he thinks Congress should vote on more of the issues so that the president's moves are not simply \"temporary actions.\" Asked whether he'd have any interest in potentially running for president himself, Massie said that he is not interested.","summary":"Rep. Thomas Massie, who is being primaried by a Trump-backed challenger, said that he now considers himself to be &quot;America only,&quot; not &quot;America First.&quot;","url":"https://www.foxnews.com/politics/patriot-pathetic-rino-maverick-republican-thomas-massie-trades-america-first-label-america-only","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/rep-thomas-massie-sept-2025.jpg","video":null,"publish_date":"2025-11-08 14:52:28","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","source_country":"us","sentiment":-0.474},{"id":377045362,"title":"Former Press Secretary Karine Jean-Pierre Left the Democrat Party to Become an Independent. Cue the Sound of One Hand Clapping.","text":"WASHINGTON—In case you hadn’t noticed, former White House press secretary Karine Jean-Pierre is a black woman, as she repeatedly reminds readers in her memoir “Independent: A Look Inside a Broken White House, Outside the Party Lines.”\n\nJean-Pierre also is “openly queer”—her words, not mine, scattered like breadcrumbs throughout her 177-page treatment of her two-plus years as former President Joe Biden’s top spokesperson.\n\nIf it weren’t for identity politics, Jean-Pierre wouldn’t have any identity at all. She tosses around labels, not arguments.\n\nJean-Pierre told The New Yorker that the “broken” White House in her book title refers not to the White House of her former boss, but that of current President Donald Trump.\n\nAnd yet, by her own account, KJP’s defection from the Democratic Party was a reaction to serving in an administration that was burdened with “racism, misogyny, and double standards.”\n\nIf you want to know what it was like to work inside the Biden White House, prepare to be disappointed. The book is light on policy and heavy on score-settling.\n\nJean-Pierre lashes out at the occasional in-house rival, and she never identifies by name then-national security communications adviser John Kirby, who often shared the podium with her. That snub only makes Kirby look better. Again.\n\n“Some of my resentful colleagues,” KJP wrote, thought she was not “fit for the job.” And then there was the “belligerent press corps.”\n\nI’ve read a lot of so-called tell-all books from former political staffers. Everyone has an ax to grind somewhere, but it’s the pros who know how to land a blow and move on.\n\nIn her book, “107 Days,” about the high-speed 2024 campaign, former Vice President Kamala Harris writes that on the Sunday before Election Day, “I still believed our campaign of joy would triumph in two days.” Harris also revealed that she and husband Doug Emhoff were “so traumatized” by the reversal of fortune they faced on election night that the couple did not discuss that evening until she started to write her book.\n\nHarris also wrote about stronger answers she should have given during interviews, and other missed opportunities.\n\nNot KJP, who blames the world for things Team Biden could have handled better. Hunter Biden? Jean-Pierre writes he “had been a punching bag for the GOP for years as its members exploited his history of drug addiction, harped on his business relationships, and accused his father of unethically helping him land lucrative deals overseas.”\n\nJean-Pierre conveniently forgets that Biden’s surviving son peddled his access to his then-vice president father, who was in charge of White House policy on Ukraine.\n\nJean-Pierre should realize that the Yale law graduate walked away from a plea agreement on charges involving a gun purchase while addicted to drugs because he thought he could win, even though he was guilty.\n\nThe former press secretary also neglects to mention that Hunter Biden’s legal problems could have been eliminated if Biden had pardoned his son—which candidate Biden promised he would not do but ended up doing anyway. After the election.\n\nI understand the pardon. Still, I’d love to get some insight into the former president’s oft-uttered claim, “My son did nothing wrong.”\n\nTo Jean-Pierre, the worst offense is the Democrats’ “betrayal” of Biden. She does not seem to have figured out that Biden betrayed Democrats when he announced he would run for reelection for an office he probably would not have won in 2020 if he revealed he planned to run again in 2024.\n\nBiden didn’t make it to Election Day, so KJP decided to switch parties. Now she calls herself an Independent. But she’s not. She’s a political animal who picked the wrong horse and wound up in a ditch. And now she’s digging the hole deeper.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"WASHINGTON—In case you hadn&#8217;t noticed, former White House press secretary Karine Jean-Pierre is a black woman, as she repeatedly reminds readers in her memoir &#8220;Independent:... Read More\n\n\nThe post Former Press Secretary Karine Jean-Pierre Left the Democrat Party to Become an Independent. Cue the Sound of One Hand Clapping. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/08/former-press-secretary-karine-jean-pierre-left-the-democratic-party-to-become-an-independent-cue-the-sound-of-one-hand-clapping/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/GettyImages-2242405200.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-11-08 14:00:00","author":"Debra Saunders","authors":["Debra Saunders"],"language":"en","category":"politics","source_country":"us","sentiment":-0.209},{"id":377030112,"title":"“Big artists like taylor should take notes!!”: Netizens react as Olivia Rodrigo slams the White House for using her song to promote ICE","text":"Olivia Rodrigo has sharply criticized the White House and the Department of Homeland Security (DHS) after her 2023 song All-American Bitch was used in a social media video promoting immigration enforcement. As reported by Deadline on November 7, 2025, the Guts singer took to Instagram to condemn the use of her music in what she called “racist, hateful propaganda,” following the release of a video urging undocumented immigrants to “self-deport.” The clip, posted on November 4, 2025, in collaboration between the White House and DHS, featured footage of Immigration and Customs Enforcement (ICE) agents detaining people of color while Rodrigo’s song played in the background. In a direct reply under the post, the singer wrote,\"Don’t ever use my songs to promote your racist, hateful propaganda\"Fans have praised Rodrigo's public stance and said that other artists should follow suit, especially the big names like Taylor Swift.sammy @sammywthebodiLINKbig artists like taylor should take notes!!Slate Truck @Slate_TruckLINKtaylor for the love of god please do what you did with imgonnagetyouback and copy olivia again &#128557;Saysosis @MileyissosLINKNicki Minaj and Taylor swift don’t say anything about the White House using their music btwMore about the DHS video and the use of Olivia Rodrigo's musicAs reported by Deadline, the DHS video encouraged undocumented residents to “LEAVE NOW and self-deport using the CBP Home app,” warning of “consequences” if they failed to do so. The use of Olivia Rodrigo’s track, which features the lyrics “All the time, I’m grateful, all the time, I’m sexy and I’m kind, I’m pretty when I cry”, reportedly prompted widespread criticism online. The 22-year-old artist, known for her outspoken political stance, made clear that she did not authorize the song’s inclusion. Other artists have echoed her frustration. British singer Jess Glynne condemned a similar deportation-themed post using her song “Hold My Hand,” calling it “sick” and saying that her music \"is about love, unity, and spreading positivity, never about division or hate\"Comedian Theo Von also demanded that the DHS remove a video quoting him out of context, accusing the department of misrepresenting his stance on immigration before the clip was taken down.More about Olivia Rodrigo’s opposition to Donald Trump’s use of her musicThis is not the first time Olivia Rodrigo has objected to her songs being used for political messaging. In November 2024, The Independent reported that she had her 2021 hit deja vu removed from TikTok after Donald Trump’s campaign used it in a victory video celebrating his reelection.In a now-deleted comment that led to the platform taking the song down from the clip, Olivia Rodrigo reportedly wrote, “Ew don’t use my sound ever again ty\"Olivia Rodrigo performing at the 2025 Lollapalooza Festival (Image via Getty)Rodrigo, who publicly endorsed Kamala Harris in the 2024 U.S. presidential election, has reportedly long positioned herself as an advocate for reproductive rights and youth engagement. In 2021, she visited the White House to promote COVID-19 vaccinations for young Americans, praising former President Biden and Dr. Anthony Fauci for their public health efforts. Her latest criticism marks a sharp turn from that earlier collaboration, underscoring her frustration with the Trump administration’s immigration policies and the use of her work in government propaganda campaigns.The incident adds to a broader pattern of artists pushing back against political use of their work without consent. Under President Trump’s renewed administration, the DHS has faced mounting criticism for aggressive deportation measures, including the January 2025 decision to lift restrictions on ICE arrests at schools, hospitals, and places of worship, as reported by Deadline on November 7, 2025.Olivia Rodrigo’s latest criticism amplifies a growing chorus of entertainers distancing themselves from government messaging perceived as discriminatory.","summary":"Olivia Rodrigo has sharply criticized the White House and the Department of Homeland Security (DHS) after her 2023 song All-American Bitch was used in a social media video promoting immigration enforc","url":"https://www.sportskeeda.com/us/music/big-artists-like-taylor-take-notes-netizens-react-olivia-rodrigo-slams-white-house-using-song-promote-ice","image":"https://staticg.sportskeeda.com/editor/2025/11/ea334-17626018187316-1920.jpg","video":null,"publish_date":"2025-11-08 13:11:25","author":"Devangee","authors":["Devangee"],"language":"en","source_country":"in","sentiment":-0.034},{"id":377034732,"title":"BROADCAST BIAS: From Camelot to Whine-a-Lot, Michelle Obama claims she’s mistreated","text":"No first couple has been more adored by the national media in modern times than Barack and Michelle Obama. From their first campaign for the White House in 2008, they were compared to John and Jackie Kennedy for their style and grace. But Mrs. Obama still claims she’s been mistreated in her latest three-network love-bomb book tour. Her new book is titled \"The Look,\" a coffee-table book chock-full of fashion photos (list price $50). You can wallow in her \"intimate and candid stories\" about what she wore. It all sounds very self-impressed. The tour began with an ABC Sunday night \"20/20\" special on Nov. 2 titled: \"Michelle Obama: The Style, The Power, The Look.\" Robin Roberts was gushing from the get-go: \"As First Lady, you shot out of a cannon, any every eyeball in the world is gonna be on you.\" Roberts read some complaints from her book: \"We were all too aware that as a first Black couple, we couldn’t afford any missteps. And that as a Black woman, I was under a particularly white hot glare.\" She added a prompt: \"Did you feel that?\" Well, she wrote it! MELANIA TRUMP LAUGHED OFF VANITY FAIR COVER OFFER: REPORT Michelle answered: \"Making a mistake in a political environment where you're the first and people are – where your opponents are using your race as a fear-based strategy to make you seem like the other, then everything matters.\" This is a weird flex, because the entire Obama strategy was about how wonderfully different they were, the brilliant high-achieving two-lawyer couple. But she kept kvetching: \"You couldn’t afford to get anything wrong, because you didn’t get the – at least until the country came to know us, we didn’t get the grace that I think some other families have gotten.\" This is flat-out false. From the minute the Obamas came onto the national scene in 2004 – the media were in love. Grace overflowed like Niagara Falls. Conservatives may have harshly criticized them, but those comments were dismissed – as she wanted it -- as a \"fear-based strategy.\" MICHELLE OBAMA TELLS COLBERT SHE FEELS 'LOST' ABOUT CURRENT WHITE HOUSE NORMS AND STANDARDS UNDER TRUMP This special may have been like other prime-time Michelle-ogling specials, like the CBS-aired Oprah Winfrey interview in December 2016, where Oprah touted her as both a \"pop-culture icon\" and \"the coolest First Lady in U.S. history.\" But it’s a dramatic contrast with what happened to First Lady Melania Trump on an ABC \"20/20\" special in October 2018. ABC’s Tom Llamas – now NBC’s evening anchorman – asked a series of rude and personal questions, not the kind Hillary Clinton would get: \"You're not the first First Lady to have to deal with her husband's alleged infidelities. Has this put a strain on your marriage?\" KAMALA HARRIS MENTIONS MICHELLE OBAMA ONLY THREE TIMES IN 300-PAGE BOOK. HERE'S WHAT SHE SAID \"During the ‘Access Hollywood’ incident during the campaign, your husband apologized to you. Has your husband apologized to you since you've been in the White House?\" And in closing: \"You mentioned you still have a good marriage. Do you love your husband?\" The tour began with an ABC Sunday night \"20/20\" special on Nov. 2 titled: \"Michelle Obama: The Style, The Power, The Look.\" Robin Roberts was gushing from the get-go: \"As First Lady, you shot out of a cannon, any every eyeball in the world is gonna be on you.\" So, who was not receiving grace? MICHELLE OBAMA TAKES SWIPE AT TRUMP’S DEMOLITION OF WHITE HOUSE EAST WING Mrs. Obama also appeared on CBS, on \"The Late Show with Stephen Colbert,\" a show dominated by the host fawning over Democrat leaders. Colbert threw softballs: \"When did you realize that [fashion] was something to wield? That it actually was a power?\" KAMALA HARRIS' BOOK, MEDIA TOUR SLAMMED BY LIBERAL CRITICS AS 'EMBARRASSING' AND 'UNHELPFUL' She replied: \"I knew very quickly that I had to control every aspect of how I showed up in the world. It was a race to let the country learn me for me before they learn this other crazy woman that they were talking about, the angry bitter Black woman that was a terrorist and a danger to her country, and didn’t love her country.\" Honk if you remember Republicans calling Michelle Obama a dangerous terrorist. \"Angry and bitter\" is a plausible description, as you can hear in these comments. That's just as it came across in February 2008, after most states had voted, when she at least drew conservative notice for saying, \"For the first time in my adult lifetime, I am really proud of my country.\" National Review's Jim Geraghty called the remark \"strikingly ungracious.\" CLICK HERE FOR MORE FOX NEWS OPINION She concluded the latest interview: \"And how I showed up in the world played a huge role in just reminding people that we're normal people. Yes, we’re Black. But we bleed red, and we love red, white and blue.\" That’s a campaign answer. They are not \"normal people.\" Their first post-presidential book deal was for an estimated $65 million. She also highlighted how she showed the First Lady can be \"sexy\": \"I wanted to take advantage of the fact that as the First Lady, yes, you can be smart and educated and beautiful, and sexy and interesting and all those things. And yes, you can be a Black woman, a tall 5-foot-11 Black woman.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP NBC paired Mrs. Obama with Jenna Bush Hager, because the Bushes adore the Obamas just like the media do. Michelle kept pitching the racism stuff: \"The light was a little bit brighter because politics created an otherness. There were some people who tried to paint everything we did as a sign that we weren't ready, that we weren't suited, that we weren't American enough,\" she claimed. She was also asked to drop rhetorical bombs on President Donald Trump demolishing the East Wing to build a grand new ballroom for future generations. The whole TV tour felt like the latest 21-softball salute. CLICK HERE TO READ MORE FROM TIM GRAHAM","summary":"Michelle Obama claims media mistreatment during book tour for &apos;The Look&apos; despite receiving favorable coverage, contrasting sharply with Melania Trump&apos;s harsh questioning.","url":"https://www.foxnews.com/opinion/broadcast-bias-from-camelot-whine-a-lot-michelle-obama-claims-shes-mistreated","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/03/broadcast-bias-image.jpg","video":null,"publish_date":"2025-11-08 13:00:53","author":"Tim Graham","authors":["Tim Graham"],"language":"en","source_country":"US","sentiment":0.034},{"id":377032586,"title":"Elias: Newsom’s 2028 presidential star rising after state’s Prop. 50 win","text":"Ever since the Sept. 30 deadline for filing quarterly campaign fundraising reports, it’s been obvious that Gov. Gavin Newsom’s pet ballot measure, Proposition 50, was going to win by a landslide.\n\nNow it’s become clear that the big margin by which the anti-Donald Trump redistricting plan passed (almost 64% as of Friday) will give Newsom a big leg up on the 2028 presidential campaign he has finally admitted he’s considering.\n\nThe win became obvious when the finance reports showed Democrats had donated more than twice as much to pass Prop. 50 as Republicans had donated against it. That was a sure-fire sign the Republicans had pretty much given up on defeating the proposition.\n\nIt also meant an end to former Gov. Arnold Schwarzenegger’s persuasive TV ads against Prop. 50 and caused Republicans to concentrate their efforts on other states where they hope to redistrict to create enough newly Republican districts to guarantee continued GOP control of the House of Representatives.\n\nThis worked for them in Missouri and North Carolina, gaining one GOP-oriented seat in each, but has failed so far in Kansas and Indiana. There are also the five former Democratic-oriented seats in Texas whose gerrymandering into GOP majorities started this whole thing.\n\nWithout controlling the U.S. House of Representatives, Trump would lack the freedom of movement he’s enjoyed so far in his second term as president, a freedom he has sometimes believed might even give him the ability to run for a third term, despite the Constitutional ban on running more than twice.\n\nThat was why Trump began his effort by pressuring Texas Gov. Greg Abbott and its Legislature to redraw those five congressional seats. Newsom became the first national Democrat to fight back strongly, calling the Trump effort “election rigging” and getting those words into the title of his measure.\n\nThe changes it makes, canceling districts drawn by California’s nonpartisan citizens redistricting commission and substituting a plan figured to give Democrats five new seats to match those the party will likely lose in Texas, are temporary. In 2031, when new districts will be drawn anyhow, the job will revert to the citizens’ commission.\n\nThat contradicts Schwarzenegger’s often-repeated claim that Prop. 50 means the end for that commission, whose membership is reconstituted every 10 years. For Newsom, it’s the first time he’s taken an action that directly hits back at a Trump effort, which can only bolster his standing among Democrats nationally.\n\nPolls show they’re disappointed at their party’s passivity in the face of Trump actions like sending troops into Democratic-run cities, trying to force colleges to buy into his education philosophy no matter how their students, faculty and state legislature might feel and his defiance of some court orders.\n\nWhile the results on Prop. 50 came as no surprise to anyone who read the Sept. 30 financial reports, the early count also suggested final totals might closely match a late October CBS News poll that showed 62 percent of likely special election voters would vote for the redistricting.\n\nThis was apparently enough to push Newsom into admitting at long last that he is “considering” a 2028 presidential run. He’s betting Trump will not try to forestall that election by declaring a national emergency of some kind, and that whichever Republican is nominated will therefore be someone else.\n\nThat would run somewhat counter to longtime Trump advisor and former chief strategist Steve Bannon, now back in favor after serving jail time for three convictions of criminal contempt of Congress and fraud.\n\nBannon predicted the other day that Trump “will be president in 2028.” No one actually questions that; a new president is not due to be sworn in until early 2029. But did Bannon really mean 2029?\n\nNewsom plainly wants to become the next president in 2029, in part to undo a lot of what Trump has done. Things like his prophetic prediction of artillery products falling on Interstate 5 in Camp Pendleton during a celebration of the Marine Corps’ 250th anniversary despite Corps denials that it could happen, can only help him.\n\nNewsom’s closure of that highway, where shrapnel actually fell on police vehicles, probably saved both lives and plenty of property damage. His triumph with Prop. 50, coming soon afterward, will amplify the ground he gained on I-5.\n\nFor sure, his recent performances give him a leg up on other potential Democratic candidates like Illinois Gov. JB Pritzker, Pennsylvania Gov. Josh Shapiro, Kentucky Gov. Andy Beshears and former Vice President Kamala Harris.\n\nEmail Thomas Elias at tdelias@aol.com, and read more of his columns online at californiafocus.net.","summary":"The big margin by which the anti-Trump redistricting plan passed will boost the campaign the governor finally admits considering.","url":"https://www.mercurynews.com/2025/11/08/elias-newsoms-2028-presidential-star-rising-after-states-prop-50-win/","image":"https://www.mercurynews.com/wp-content/uploads/2025/11/SJM-L-NEWSOM50-1105.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-08 13:00:16","author":"Thomas Elias","authors":["Thomas Elias"],"language":"en","category":"politics","source_country":"us","sentiment":-0.257},{"id":377040448,"title":"Drowning the 'lazy' media with Trump's lies is the point","text":"It was another example of how Trump’s shifting policy positions, racially inflammatory statements and threats frequently fuel a flurry of headlines, reflecting what some psychologists are calling “media saturation overload” or “Trump stress disorder.” \n\nThis barrage of information may seem like overcommunication from a hyperactive administration. But it is much more than that.\n\nScholars have found that the constant, often conflicting and at times false information coming out of the White House and shared via social media posts and the conventional news media causes members of the public to see truth and fact as relative and makes them more likely to dismiss those who disagree with them as untruthful. This leaves doubt about what’s real and what isn’t. \n\nThis citizen paralysis creates what philosopher Hannah Arendt described in “The Origins of Totalitarianism” as a general public “for whom the distinction between fact and fiction … no longer exist.” When lies are truth and truth is derided as lies, Arendt wrote, ordinary people lose their bearings and can be manipulated for totalitarian objectives. \n\nMeanwhile, many journalists have openly acknowledged fatigue with the pace and nature of the Trump administrations’ news cycles, amid frequent newsroom layoffs, mergers and closures. \n\nI am a longtime journalist and now scholar of journalism and race, trained to see the methods and aims behind political leaders’ press operations. And as I show in my forthcoming book, the Trump administration’s rhetorical strategies echo the playbooks of authoritarian and white supremacist organizations such as the Third Reich and some factions of the modern alt-right movement. They are intended to narrow the scope of who belongs as an American.\n\nHeadlines at ‘muzzle velocity’\n\nThe Trump administration’s rhetorical strategies include claiming victim status while often laying blame on immigrants or other scapegoats in ways that I believe betray racist intent. At the same time it has overwhelmed journalists and the public with breaking news. \n\nThis strategy was laid out by Steve Bannon, an influential Trump supporter and strategist in his first administration, during a 2019 PBS “Frontline” interview, when he described the media as “the opposition party.”\n\n“They’re dumb and they’re lazy, they can only focus on one thing at a time,” he said. “All we have to do is flood the zone. … Bang, bang, bang. These guys will never – will never be able to recover. But we’ve got to start with muzzle velocity.”\n\nBannon has long been associated with the alt-right, a movement known for rhetorical tactics that minimize and obfuscate its true aims.\n\nA strategy forged in Trump’s first term\n\nAs I detail in my book, “American Otherness in Journalism: News Media Representations of Identity and Belonging,” Trump and his key advisers have been developing, refining and ramping up their news media manipulation for a long time. \n\nAn early example of this is the way the administration used these tactics through Trump’s public responses to the fatal violence at the August 2017 Unite the Right protest in Charlottesville, Virginia. \n\nThe two-day rally was organized by a white nationalist blogger and attended by members of neo-Nazi, white supremacist and far-right militias protesting the removal of a statue of Confederate Gen. Robert E. Lee from a Charlottesville park. They marched with tiki torches, flew Confederate and Nazi flags and chanted antisemitic and racist slogans. \n\nAmid violent clashes with counterprotesters on the second day, a neo-Nazi sympathizer drove into a crowd, killing a 32-year-old woman and injuring many others. \n\nMy study of television news coverage of Unite the Right found that the majority of news reports focused on the contradictory and inflammatory statements that Trump made about the antisemitic and racist protesters. Trump’s Aug. 15, 2017, press conference remark about blame on both sides after what happened garnered the most news media attention: “I think there is blame on both sides,” he said. “You had some very bad people in that group. You also had some very fine people on both sides.”\n\nExploiting chaos\n\nThe uncertainty surrounding what he meant created a cycle of news stories implying and denying that he sympathizes with white supremacists.\n\nThis is-he-or-isn’t-he intrigue spurred a surge of what fits the description of Bannon’s “muzzle-velocity” news headlines: “Trump declares ‘racism is evil’ amid pressure over Charlottesville” followed closely by “Trump defends White-nationalist protesters” and “Why Trump can’t get his story straight on Charlottesville.” \n\nWith the focus on Trump’s comments and what he might have really meant, the news media ultimately missed covering at the time the long-term threat posed by these white supremacist and other extremist groups.\n\nEchoing a playbook from the past\n\nScholars have identified the fascist roots of these “post-truth” strategies: strongmen leaders uninterested in establishing leadership through honesty and transparency. \n\nA recent scholarly analysis of Trump’s leadership concludes that the second-term president is overwhelming the public into “organized despair” by pitting races against each other while targeting minority groups as scapegoats, a tactic that hearkens back to 1930s Germany. \n\nA 2019 analysis of Trump’s narrative style describes how he presents himself as a “strongman” fighting invisible forces of censorship and suppression. It also points out that this was part of the appeal of fascist leaders such as Mussolini and Hitler. \n\nResearchers of Nazi propaganda identified key tactics in the German press such as name-calling and lumping together groups seen as opposition – communists, liberals and Jews – until public understanding of those groups blur into phrases like “enemies of Germany.” The messaging was constant and immersive, carried in local and national newspapers, radio, film and posters.\n\nA key part of Trump’s rhetorical strategy is using race without directly referring to it. For example, Trump has described cities with large nonwhite populations such as Washington, D.C., and Chicago as “out of control” or “dirty,” contrary to actual crime statistics. He’s also questioned Kamala Harris’ racial identity, suggesting she “happened to turn Black.” And referring to Black football players who had been protesting systemic racism by kneeling during the national anthem, Trump said, “Get that son of a bitch off the field right now,” which many observers interpreted as racist because he was insulting people of color for the act of protesting racism. \n\nThis racial coding has been used by white supremacist groups to mask their true intent. They also use less overt labels such as “alt-right” or “pro-white” as a “rhetorical bridge” to the mainstream public.\n\nIn the case of the NFL protesters, the plausible deniability became an actual denial. Trump perfected this move when, during a 2020 debate with Joe Biden, he said, “Proud Boys – stand back and stand by,” referencing another group accused of thinly veiled racism. \n\nDrowning in headlines\n\nI believe that the endgame for this strategy is authoritarian power that greatly narrows the scope of who truly belongs and has rights in this country as an American.\n\nThis media saturation – drowning the public with a thousand Trump-generated headlines – allows his administration to keep dominating and controlling national attention.\n\nBut the media-consuming public can use the tools they have to encourage news outlets to better inform the public by identifying the media saturation strategy and reporting on why leaders are using it.\n\nOtherwise, if news consumers let the headline overload do what it’s intended to do, and become overwhelmed and paralyzed, they become pawns in what I consider a ploy to make America less egalitarian and less democratic.\n\nAngie Chuang, Associate Professor of Journalism, University of Colorado Boulder\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.","summary":"The headlines documenting President Donald Trump’s plan to send federal troops to San Francisco followed a familiar arc. “Trump claims ‘unquestioned power’ in vow to send troops to San Francisco,” The Guardian reported on Oct. 20, 2025. The next day, the San Francisco Chronicle blared: “S.F. threatens to sue if Trump brings in National Guard.” Then, on Oct. 23, “Trump reverses his decision to send troops to San Francisco,” as ABC News put it, after Trump posted that conversations with the city’s mayor and tech moguls had swayed him.\n\nIt was another example of how Trump’s shifting policy positions, racially inflammatory statements and threats frequently fuel a flurry of headlines, reflecting what some psychologists are calling “media saturation overload” or “Trump stress disorder.” \n\nThis barrage of information may seem like overcommunication from a hyperactive administration. But it is much more than that.\n\nScholars have found that the constant, often conflicting and at times false information coming out of t","url":"https://www.alternet.org/overwhelm-the-public-with-muzzle-velocity-headlines-a-strategy-rooted-in-racism-and-authoritarianism/","image":"https://www.alternet.org/media-library/image.jpg?id=61691810&width=1200&height=600&coordinates=0%2C459%2C0%2C459","video":null,"publish_date":"2025-11-08 12:18:09","author":"The Conversation","authors":["The Conversation"],"language":"en","category":"politics","source_country":"US","sentiment":0.01},{"id":377164196,"title":"A year after devastating Trump loss, have the Democrats begun to find their way back?","text":"It has been a year of soul-searching, hand-wringing, and self-flagellation for Democrats after a ballot-box rejection so thorough that some had come to believe that the party had lost not only the White House and Congress but the culture itself.\n\nShell-shocked, Democrats entered Donald Trump’s second term in a political stupor – unsure of who they were or what they stood for. Their base had lost faith in its aging leadership class, and their brand, in Democrats’ own words, had become “toxic”: a party increasingly confined to coastal states, big cities and college towns. And even there, warning signs were flashing.\n\nThen came Tuesday night – a coast-to-coast romp in the first major elections of Trump’s turbulent return to the White House that exceeded even the party’s most optimistic projections.\n\n“What a night for the Democratic party,” California governor Gavin Newsom marveled, after news networks projected the redistricting ballot measure he spearheaded had passed so decisively that some voters were still in line to cast ballots. “A party that is in its ascendancy,” he continued, “a party that’s on its toes, no longer on its heels.”\n\nAbigail Spanberger, a congresswoman and former CIA agent, stormed to victory in Virginia, becoming the first woman elected governor of the state, an office currently held by a Republican. In New Jersey, Mikie Sherrill, another congresswoman and former Navy pilot, turned what was expected to be a close race into a rout. And in New York, Zohran Mamdani, the 34-year-old democratic socialist, made history by vanquishing the former three-term Democratic governor Andrew Cuomo to become the city’s first Muslim mayor, in a race that drew the highest turnout in decades.\n\n“Virginia chose pragmatism over partisanship,” Spanberger proclaimed in her victory speech, while in New York, Mamdani celebrated “a new era of leadership” and declared that “no longer will we have to open a history book for proof that Democrats can dare to be great”.\n\nTheir wins did little to resolve the big, existential questions of whether Democrats’ future lay in a full-throated adoption of leftwing populism or a tactical turn to pragmatic centrism. The night offered ammunition for either path, or perhaps both.\n\nYet a year after Kamala Harris’s concession to Trump, Democrats have repeatedly found success not by picking a single ideological lane, but by embracing the forces of disruption that have dominated Trump-era politics. Their victories, while strikingly different in style and approach, point to a party less bound by orthodoxy and old notions of decorum – a recognition that the times have changed, and so must they.\n\n“This is not your grandfather’s Democratic party,” Ken Martin, chair of the Democratic National Committee, said the next morning. “We are not going to play with one hand behind our back. We’re not going to roll over. We’re going to meet you, fire with fire.”\n\nFor much of the past decade, Democrats cast themselves as guardians of the system – defenders of the democratic institutions under siege by a “wrecking ball” former builder who bulldozed his way into the White House and then clawed his way back.\n\nAfter the tumult of Trump’s first term, Democrats turned to Joe Biden, a consensus-builder and institutionalist who once predicted that history would view his adversary “as an aberrant moment in time”. In office, Biden dedicated his presidency to restoring domestic political norms while preserving the liberal international order abroad. But with his legacy now framed by Trump’s re-election, many Democrats have abandoned Biden’s return-to-normalcy appeal, seeing it as ill-suited to the politcal moment.\n\nInstead, as Trump moves aggressively to consolidate power and tilt the electoral map in his favor, the party’s instincts have shifted sharply away from caution, yet many progressives felt they had been too slow to adapt. Shortly before the 2024 election, a survey found that the overwhelming majority of voters valued a candidate who could deliver “change that improves people’s lives” rather than one who was committed to preserving institutions.\n\nTensions built earlier this year, when angry Democrats began calling on their leaders in Washington and in state capitols around the country to do something – anything – to stop Trump’s attacks on the federal government, the rule of law and his political opponents. Those fears grew into the No Kings protest movement, which saw an estimated 7 million people in all 50 states take to the streets last month.\n\nEzra Levin, co-founder of Indivisible, argued that Tuesday’s wins, following mass days of protest, were proof that a more combative and less deferential politics was the way to defeat Trumpism. “The No Kings era is here to stay,” he wrote.\n\nThat assertive posture extended to Capitol Hill, where Senate Democrats are refusing to lend the votes needed to reopen the government – now the longest federal shutdown in US history - unless Republicans extend healthcare subsidies: a bare-knuckle approach they had resisted as recently as few months ago.\n\nMeanwhile, in the redistricting battles unfolding across the states, party leaders and longtime champions of fair maps including Barack Obama campaigned for California’s retaliatory gerrymander, as Newsom called on other Democratic governors to follow suit.\n\n“Politics has changed. The world has changed,” Newsom, a likely 2028 presidential contender, told NBC earlier this month. “The rules of the game have changed.”\n\nIn nearly every election held this year, Democrats improved on their 2024 showing. Exit polls in Virginia and New Jersey show that both governors-elect not only held their base but peeled off Trump voters, while re-engaging young men and Latino voters who defected in 2024. In New York, Mamdani saw enormous youth turnout for his candidacy.\n\n“On Tuesday night, we saw a lot of different kinds of Democrats win – and that’s kind of the point,” said veteran strategist Rebecca Katz, a veteran political strategist whose political firm, Fight, worked for Mamdani’s campaign. “To win big, we need a big tent.”\n\nVoters, she said, sent a clear message that a back-to-basics formula – a relentless focus on improving affordability and a campaign built around authentic and visible candidates – resonates.\n\nKatz, who also advised the successful swing-state Senate campaigns of John Fetterman in 2022 and Ruben Gallego in 2024, argued that the central divide in the party was no longer where a candidate falls on the moderate to liberal spectrum but a choice between boldness and caution: “Playing it safe is the riskiest thing Democrats could do right now.”\n\nWinning has given the wounded party a much-needed morale boost. In a fundraising appeal this week, Democrats told supporters to “remember this feeling”. Yet beneath the celebration, the old fault lines – over age, ideology, tactics, and style – still run deep.\n\nSeveral seasoned House Democrats are facing contentious primary challenges, fueled by generational impatience and a desire for the party to take a more combative approach to Trump. Democrats’ prospects in 2026 may hinge on whether progressives and moderates can unite behind a message that addresses both economic anxiety and the fears of Trump’s presidency.\n\nIn 2028, Democrats say they need a nominee who can articulate a vision beyond their opposition to Trump, the glue that has held together a Bernie Sanders-to-Liz Cheney coalition.\n\nAppearing at a live taping of the podcast Pod Save America this week, Obama said it was exhilarating to see progressives “get off the mat”. But, he added, “we’ve got a lot of work to do” and cautioned progressives in the audience against pushing ideological “litmus tests”.\n\n“We had Abigail Spanberger win and we had Zohran Mamdani win,” the former president said, “and they are all part of a vision for the future.”\n\nSanders, the progressive Vermont senator who campaigned for Mamdani, told reporters this week that ideological divisions in the party were “no great secret”.\n\nBut he sensed a party-wide shift: “I think there is a growing understanding that leadership and defending the status quo and the inequalities that exist in America is not where the American people are.”\n\nRepublicans have sought to downplay Democrats’ string of victories this year. Since 2016, Democrats have tended to perform better when Trump was not on the ballot, their coalition proving more reliable in off-year and special elections.\n\n“They say that I wasn’t on the ballot and was the biggest factor,” Trump said this week. “I don’t know about that. But I was honored that they said that.”\n\nHistorically, the party out of power typically fares well in the midterm elections. But redistricting efforts are expected to tilt the 2026 House map toward Republicans. In the Senate, the task is even more daunting for Democrats, who will have to win in states Trump carried by double digits. While Trump’s plunging popularity has Republicans worried, Americans hold markedly negative views of the Democratic party as well.\n\nStill, Democrats see momentum building in parts of the country where they haven’t been competitive for years.\n\nThis summer, Catelin Drey, a Democrat and first-time candidate, won a special election for a state senate seat in Iowa, breaking the Republican supermajority by flipping a district that backed Trump in the 2024 election. It was a consequential victory and one that gave Democrats a jolt of hope.\n\nFor weeks after her election, she kept getting the same question: how did she pull it off?\n\n“I knocked on thousands of doors,” said Drey, 38, a mother whose campaign centered on affordability, especially the rising cost of childcare. “I had people tell me, ‘I’ve never had a candidate come to my door before,’” she said. “Seeing that kind of work ethic – having someone show up and say, ‘Yeah, life is really tough right now. What’s the hardest thing for you? How can I help? What would make things better?’ That type of attention is not what we’re seeing across the board right now.”\n\nSince Harris’s defeat last November, Democrats have produced a glut of election postmortems, polling memos and policy white papers offering theories about why they lost — and how to win again. Drey thinks the answer might be surprisingly simple.\n\n“Show up and work for the people you serve,” she said. “It’s not rocket science.”","summary":"Party was shell-shocked after 2024 defeat but Tuesday night’s coast-to-coast romp signals brighter times ahead\n\nIt has been a year of soul-searching, hand-wringing, and self-flagellation for Democrats after a ballot-box rejection so thorough that some had come to believe that the party had lost not only the White House and Congress but the culture itself.\n\nShell-shocked, Democrats entered Donald Trump’s second term in a political stupor – unsure of who they were or what they stood for. Their base had lost faith in its aging leadership class, and their brand, in Democrats’ own words, had become “toxic”: a party increasingly confined to coastal states, big cities and college towns. And even there, warning signs were flashing.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/nov/08/democrats-trump-elections","image":"https://i.guim.co.uk/img/media/5e82ee6406877735509900fc89e149c759953c60/1_0_3200_2562/master/3200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2","video":null,"publish_date":"2025-11-08 12:00:04","author":"Lauren Gambino","authors":["Lauren Gambino"],"language":"en","category":"politics","source_country":"us","sentiment":0.053},{"id":377224496,"title":"‘I Had a Concern About His Ability’ – Kamala Harris Reveals Regret Over Biden’s Re-election Decision Before He Dropped Out","text":"Kamala Harris recently released her memoir, 107 Days, recounting her 2024 presidential campaign. The Vice President faced a devastating loss to Donald Trump, which she attributes to having only a few months to prepare after Joe Biden’s sudden withdrawal from the race. However, her tell-all memoir, which was released in September, didn’t really sit well with the Bidens, further solidifying her feud with the camp.\n\nBiden’s decision to withdraw was reportedly tied to worries over his age and fitness. The former President instead endorsed Kamala Harris as his replacement. However, in her book, the former VP says that she was skeptical about Biden’s re-election decision from the very beginning. According to CBS News, in her memoir, Harris penned, “Was it grace, or was it recklessness? In retrospect, I think it was recklessness. The stakes were simply too high. This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition.”\n\nA month after releasing 107 Days, Harris told the BBC that she now regrets not being open about her feelings at that time. “I do reflect on whether I should have had a conversation with him, urging him not to run,” Harris said in the interview. However, in her book, she suggested what might have stopped her from voicing her opinion in the early days of Biden’s re-election decision. She noted that she was afraid it would be seen as her trying to further her own political career, rather than a genuine concern.\n\nIn her interview with the BBC, Harris further delved into that point, finally revealing why she felt that Joe Biden needed to withdraw from the 2024 presidential race. Harris said she had confidence in Biden’s ability to govern but doubted his stamina for a re-election campaign. “[I had a] concern about his [Biden’s] ability, with the level of endurance, energy, that it requires, especially running against the current president,” Harris told the BBC.\n\nThe election loss was surely a setback for the 61-year-old. However, she is “not done” yet. “I have lived my entire career as a life of service, and it’s in my bones,” she said, sparking curiosity about whether she would join the 2028 race. Earlier this year, there was speculation she might run for California governor. In July, she clearly ruled it out, stating that she would share more details about her plans soon.\n\nWhile she hasn’t confirmed anything about running for President again, she might just throw her hat in the ring.","summary":"Kamala Harris has revealed how she felt when Joe Biden decided to re-run for the presidency.","url":"https://www.inquisitr.com/i-had-a-concern-about-his-ability-kamala-harris-reveals-regret-over-bidens-re-election-decision-before-he-dropped-out","image":"https://www.inquisitr.com/wp-content/uploads/2025/11/Kamala-Harris-Drops-the-Bomb-on-Biden-Re-election-Campaign.jpg","video":null,"publish_date":"2025-11-08 11:23:43","author":"Moupriya","authors":["Moupriya"],"language":"en","category":"politics","source_country":"us","sentiment":-0.247},{"id":377008852,"title":"Tucker Carlson Says He Would 'Consider Suicide' If He Raised a Daughter Like Liz Cheney ","text":"Tucker Carlson said he would \"consider\" suicide if his daughters were like former Wyoming Rep. Liz Cheney.\n\n When Carlson, 65, appeared on Megyn Kelly's SiriusXM show Megyn Kelly LIVE, she raised the topic of the former Vice President Dick Cheney's death. The Republican lawmaker died at 84 on Monday, Nov. 3, according to a statement from his family.\n\n \"He raised a really repulsive daughter,\" Carlson said of Dick. \"Just on the downside, I’ve got a bunch of daughters that are just fine people, and I’m more proud of them than of anything in my life. And, if I had a daughter, you know, like Liz Cheney, I don’t believe in suicide, but I would consider it.\"\n\n “Oh wow,” Kelly said before laughing during the live taping of her Sirius XM show.\n\n In 2020, Liz broke from her party to urge President Donald Trump to respect the electoral process before leading the House investigation into the Jan. 6, 2021, Capitol riot. She later lost her seat in Congress and campaigned for the 2024 Democratic presidential nominee, Vice President Kamala Harris, last year. Liz was also one of the Trump targets to receive a preemptive pardon from former President Biden earlier this year, which the current President has since said are void.\n\n Carlson shares daughters Lillie, Hopie and Dorothy and son Buckley with his wife Susan Andrews.\n\n Before the statement on the former Wyoming lawmaker, Carlson said that he knew Dick \"well\" and had gone hunting and fishing with him.\n\n \"I just don’t really criticize people when they die,\" the former Fox News host said of Dick, who served as President George W. Bush's Vice President.\n\n Cheney died \"due to complications of pneumonia and cardiac and vascular disease,\" his family said.\n\n \"For decades, Dick Cheney served our nation, including as White House Chief of Staff, Wyoming's Congressman, Secretary of Defense, and Vice President of the United States,\" the Cheney family statement continued. \"Dick Cheney was a great and good man who taught his children and grandchildren to love our country, and to live lives of courage, honor, love, kindness, and fly fishing. We are grateful beyond measure for all Dick Cheney did for our country. And we are blessed beyond measure to have loved and been loved by this noble giant of a man.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer.\n\n Dick is survived by his wife of 61 years, Lynne. In addition to Liz, the couple shares daughter Mary and seven grandchildren.\n\n If you or someone you know is struggling with mental health challenges, emotional distress, substance use problems, or just needs to talk, call or text 988, or chat at 988lifeline.org 24/7.","summary":"The former Fox News host made the remarks on 'Megan Kelly LIVE'","url":"https://people.com/tucker-carlson-would-consider-suicide-if-daughter-like-liz-cheney-11846277","image":"https://people.com/thmb/X8jX6d348oQkdmvdkzTIrm9iNQc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(742x278:744x280)/Tucker-Carlson-Liz-Cheney-110725-98e7415f1fe14305a7fde2bdc423edb9.jpg","video":null,"publish_date":"2025-11-08 10:47:34","author":"Madison E. Goldberg","authors":["Madison E. Goldberg"],"language":"en","category":"politics","source_country":"US","sentiment":0.23},{"id":377076290,"title":"Britons Say Country 'Changing Too Fast', Detect 'Tension' Between Migrants and UK-Born, Research Finds","text":"A large academic study of attitudes among those living in the United Kingdom found the vast majority believe the country is “divided”, with many saying the culture is changing too fast and that they want “my country to be the way it used to be”.\n\nA massive majority of 86 per cent of people living in the United Kingdom believe there is either a “great deal” or a “fair amount” of tension between “immigrants and people born in the UK”, research by the Policy Institute at King’s College London claims to have found. This sentiment has increased perceptibly since the last time the question was asked in 2023, when it stood at a very robust 74 per cent.\n\nRemarkably, majorities seeing tension in British society between immigrants and Britons are dominant and evident across the political spectrum. While Nigel Farage’s Reform UK and Conservative voters are most convinced — with up to three-quarters of Reform voters saying there is a “great deal” of tension — even the left-wing parties exhibit the same views.\n\nThe Liberal Democrats and Greens, for instance, see agreement for the proposition hovering in the early-80s, while just 15 per cent disagree.\n\nDrawing on an uncommonly large sample size for British surveys, the University’s Institute states there are increasing notions of division in the country. Supporters of every political party and ethnic group agree that the country feels divided, and the proportion of those who support this idea has steadily risen throughout the 2020s.\n\nContributing to the idea that the United Kingdom is one that is ill at ease with itself, half of voters say the nation’s culture is “changing too fast”, with just a fifth disagreeing. This notion is gaining momentum as the two camps diverge: just five years ago, the for-and-against camps enjoyed a third of support each; now those opposing change dominate by two-to-one.\n\nConcomitant with concern of change running away, a strong plurality also agrees they “would like my country to be the way it used to be” at 48 per cent. This too is rapidly accelerating: just five years ago, Britons were more likely to say they were happy with the way the country is than not.\n\nThe King’s College London study particularly noted that this change is being overwhelmingly driven by changes of opinion among white people. In 2020, both white and “ethnic minority” people living in the United Kingdom were very much in parity, agreeing that the country wasn’t changing too quickly and didn’t need to be returned to a previous state.\n\nWhile there was slight movement in “Ethnic minority” agreement in the results — going from 32 to 35 per cent on the UK changing too fast in five years, for instance — white Britons soared ahead in that time. White respondents, for instance, shot up from that third of people in agreement in 2020 to a majority saying so now, and being twice as likely to agree with the need to stop change than being happy with it.\n\nReform and Conservative voters are, again, most likely to agree with these ideas. But despite an interpretation that could cast this as a high feeling of dissatisfaction with the United Kingdom, voters for those parties are also most likely to express patriotic ideas like “I am proud of my country”.\n\nThe research also drew in a wide range of other areas of interest. Feeling that there is a Brexit divide in the country is fading with time, with Leave and Remain voters more likely to see eye-to-eye. There has been a surge in people saying they believe transgender rights have gone too far, and Britons now perceive the word “woke” to be an insult, which they didn’t five years ago. Some 67 per cent agree there is a “culture war” going on.\n\nCuriously, practically the only metric in the whole study that has shown remarkable resilience to change are sentiments towards the history of the British Empire. While the predominant position is not having an opinion on it at all, of those who feel conviction, feeling the British Empire is “something to be proud of” beats out “something to be ashamed of” by about ten points, something which hasn’t changed in the past five years.\n\nThis study follows only by days another such piece of research which, again presented the British public as surprisingly conservative on matters of immigration compared to the perception of the UK as presented by its politics and political class, which remain in the whole overwhelmingly pro-open-borders. That study, by the National Centre for Social Research found that British voters are to the right of even their American cousins, with British Reform UK or Conservative voters to the right of U.S. Donald Trump voters, and British Labour supporters to the left of Kamala Harris voters.\n\nAsked to state whether they agree with the statement “We risk losing our national identity if we are too open to people from all over the world”, 81 per cent of right-wing British voters said they agreed, ahead of just 65 per cent of Trump voters. Again with the statement “It is bad for society if white people decline as a share of the population”, 70 per cent of the British camp agrees, compared to 43 per cent of Trump voters.","summary":"Vast majority believe the country is \"divided\", with many saying they want \"my country to be the way it used to be\", says study.\n\n\nThe post Britons Say Country &#8216;Changing Too Fast&#8217;, Detect &#8216;Tension&#8217; Between Migrants and UK-Born, Research Finds appeared first on Breitbart.","url":"https://www.breitbart.com/europe/2025/11/08/britons-say-country-changing-too-fast-detect-tension-between-migrants-and-uk-born-research-finds/","image":"https://media.breitbart.com/media/2025/11/GettyImages-2243275010-e1762597210667-640x335.jpg","video":null,"publish_date":"2025-11-08 10:21:42","author":"Oliver JJ Lane","authors":["Oliver JJ Lane"],"language":"en","category":"politics","source_country":"US","sentiment":0.179},{"id":376990718,"title":"Victor Davis Hanson: The Obamas Have Nothing to Complain About","text":"On today’s episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc react to Michelle Obama’s book tour for her new book “The Look.”\n\nThis transcript has been slightly edited for clarity. \n\nSami Winc: For having said that, which was very strange because you would think somebody on a show like that would be interested in the truth. And the second thing, Michelle Obama, of course, is on her whining tour. I guess we could say that. And she said that while she was in that White House, she was under a particularly white hot glare.\n\nAnd those were her words that they were so stressful on the White House to be watched by everybody, I thought. Wondering your thoughts on either of those two?\n\nVictor Davis Hanson: I’ll start with the second. First, Michelle, who was on the cover of Vogue repeatedly and who wasn’t as first lady? Oh, you were on the cover. And Melania never was.\n\nMelania was a professional international model. I know Barack Obama said yesterday you were fine. But I think most people would say that Melania is as pretty or prettier than you are and more elegantly dressed—not reflection on you, just that’s what models are. But she wasn’t on once. And let me ask you another question.\n\nWho was treated more unfairly? Donald Trump and Melania Trump by the media—I’m talking now NPR, PBS, NBC, CBS, ABC, New York Times, Washington Post. I could go on or you. Hmm. You. When Donald Trump made the cover of a magazine like The New Republic, he had a Hitler mustache. When you [had] Barack [in the magazine], he was dressed like FDR and said the new socialism was back. You were—everybody bent over backwards to accommodate you. I know there were people on the fringe right, that had sort of a Candace Owens proto you were a transsexual, all that crazy stuff. But by and large, in the midstream of the country, you—your memoir was a bestselling book.\n\nYou were treated with kid gloves. So when you said you’d never been proud of the country, you said until Barack was a figure. You said it was a downright mean country, you said they always raised the bar on people like us. You were given a pass. You were given a pass, and your whole life was, you were, came out of Harvard Law School.\n\nAnd you were in a Chicago law firm. You did, you wanted a sneaker account right away. And then when he was elected senator, they gave you a non-job for what? A third of the million dollars basically at the University of Chicago Medical School to direct people away from the medical school who couldn’t pay. You were always given either equitable treatment or exemplary treatment, and if you want to go Google and say, make fun of first lady, see how many things come up under Melania versus you, and it will be much more. And nobody put a gun to your head and said, you have to run for president. You use that bully pulpit to push all of your issues. As far as altering the White House, you made a special little kind of nice organic garden.\n\nYou did whatever you wanted, and yet now you [complain] and now you’re worth probably over a hundred million dollars. And no offense, but I don’t think that you and Barack had any reputation, history, CV [curriculum vitae], resume of being particularly accomplished Netflix content thinkers, creators. That’s what they gave you. What, $20 million? So you walked out of the White House, remember Barack had said, I’m going to run a president. I’m going to transform the country. I’m not, I’m not going to do it just to cash in. That’s what you did. So can’t you just say, this is an amazing country that a black man and woman were elected president with the majority, with a greater white vote than the previous white candidate, and we were—but that didn’t happen. Almost immediately, when you came in, you gave the typical Michelle chip on your shoulder. Well, I was in a Target and a shorter woman wanted me to reach and didn’t know who I was, so I had to reach for a package to give to her.\n\nIt happens to all of us, Michelle, happens to all of us all the time. And I was in local supermarket two weeks ago and I pulled out a shopping cart and the woman next to me pulled out a shopping cart. She didn’t speak English and it was full of what many of them are—trash, right? And then she said to me in Spanish, can I have your shopping cart?\n\nI felt so offended just because I’m white and I speak English. You think you can just take my shopping cart when I didn’t put trash in it? And you don’t want to clean it ’cause you don’t want to touch the trash. But I gave it to her. And I have never mentioned that incident until today. I didn’t digest it and get angry, that Sue, who is this person who’s probably here illegally and doesn’t speak [English], and she comes up to me, you know, bring this over to me.\n\nThings happen in life and you can’t think that way, and life is so hard on you because you have a beach estate in Hawaii that you built. Contrary to many environmental regulations, you have a abode on Martha’s Vineyard on the seashore cliff, I think it’s 20 acres. I think you have 2,000 gallons worth of propane on that.\n\nI only have 150. I have a three acre little house yard and we only have 150 gallons of propane and you get 2,000. It’s not fair. And my family at one time was bigger than yours. And then you’ve got your Kalorama mansion. You still have your Chicago nice thing, and your Tony Rezko acquired big yard, and yet that’s not enough.\n\nAll you do, we had to pay for food. We had to pay for food when we were in the White House. Well, most America, I really doubt that they sent you a bill for a ham sandwich. No offense, but it’s all complaint. And she grew up with middle class parents, and then she’s now onto the DEI [diversity, equity, and inclusion]. And you know, Barack said the other day, he’s trying to whip up the racial sentiment, he said, and you know, they just confused, they just see a black eye and they say, you got the job at DEI. Well, get rid of DEI. And you won’t think that. And in your case, Barack, you came with a mediocre record after two years from what we can ascertain from anecdotal evidence. Since you wouldn’t release your student records and you went to Columbia.\n\nAnd then you didn’t release your Columbian grades and then somebody got you into the Harvard Law School. Would you please release your Harvard Law School admissions LSAT, and GPA from Columbia, and then we will know whether you got in on DEI or not. Because you didn’t really cut a wide swath as an impressive law student when you graduated and you were going to be a constitutional lawyer and you were going to work on contractual law for a year.\n\nAnd from what people tell us in anecdotal information when you were given a year with no teaching abilities and a fellowship to write a book—on what contractual or constitutional law? You wrote about yourself, if you did write about yourself—there was accusations that Bill Ayers wrote it, and there were certain things in his memoir, anecdotes that were strikingly similar to yours.\n\nBut let’s not judge you. And it was the best seller, and you were on your way to the races. So both of you have nothing to complain about. There are millions of people in America—Indian, Hispanic, black, white, who would die to have the opportunities that you have. But you could never let it alone—till the moment you go to the grave, you’re going to be complaining about this country.\n\nAnd you know, it’s—it would be like me saying, wow. My mom was a very strong Democrat. My dad was a very strong Democrat. They had to go to an Oakland conference once, and my mom was shocked because they pulled into a parking lot at a judicial conference, and five large black males surrounded them and threatened them, and then my father, who’s very big, was well willing to, but you know, they were probably armed, so he pulled out his wallet and gave him a couple of $20, said please, my wife is a judge, and I’m not going to let you do this. Gosh, is that what black people do? I’ve never gotten over that trauma. I’ve never gotten over it, Michelle. And when I was at Stanford University, at the time my wife worked at the VA and we were walking down the street and she had a mental patient who saw her and her job was to take mental patients on bus tours and she saw one of her favorite people who actually had Down Syndrome and he, she was attending to him and an African American couple, two males came up, got right in her face and started emulating the way that that patient was talking, making fun of them. And I said, don’t do that to these two nice people. And the next thing they knew, they were pushing me and everything went downhill.\n\nAnd I have never thought of that until right now, but I am obsessed with it, what happened to me? So, you know, go to East Palestine, Ohio and live there for a year, and then tell me that you’re the only oppressed person in the world. I get so tired of that, of all of these elite people, of any, any race that keep complaining about how bad they’ve had it.\n\nYou know what I mean? Oh, it’s been so bad. I could do that too. Oh yeah. I had another sinus operation. It wasn’t fair. I’ve had nine operations in my life. Now that I’m looking at a beautiful little studio, I’m looking at an orchard, I think I’m blessed beyond comprehension. I have these wonderful people listening to me, but it’s so unfair that my operation didn’t work.\n\nWell, that’s what we get. I don’t know why she does it. Same thing with Whoopi Goldberg. She gets her new name. She gets all of this. She was a good actor in “Ghost”, and she was in “The Color Purple,” she takes off. Was it Ted Danson was her boyfriend. She was—and then she got Barbara Walters, created “The View.”\n\nShe had certain rules of decorum. It was very popular. There was, if there were politics, there were two sides. It boomed. She died. The next generation took over and wrecked it. Everybody has been sued for lying for the first time, and some judges now consider that libel. So when somebody hands you a paper from your producer who’s paying you millions of dollars and you spout off anything that comes into your mind and they say, don’t say that Donald Trump used the autopen unless you have evidence, and she had none.\n\nAnd she said, well, it was just a joke. Well, people get sued for that. I don’t know if he would sue them. I doubt it. But he has sued George Stephanopoulos for lying that he was a rapist 11 times when he was never convicted of that. And the same thing with the doctor and the Kamala Harris. So there is a lot of executives that are saying about “The View,” you guys are really controversial. You’ve not got very good audience share anymore, and you’ve got a lot of criticism and we’re all under scrutiny, so just be very careful. Instead, she tears it up and, and then, you know, and she said so many crazy things about the Holocaust and Jews, and it just, it’s all these people.\n\nI don’t know what it is. They’re all privileged, they’re all millionaires and they all whine, whine, whine, whine.\n\nSami Winc: Yeah, I think that’s what your audience thinks too. They listen to their complaints and the audience and I both probably think, you know, human life is like that. There are ups and there are downs, and we’ve all suffered ups and downs.\n\nVictor Davis Hanson: DEI—that’s why it’s such a pernicious ideology, because you can translate any personal unhappiness into a cosmic ism or ology against you, on this Marxist binary you’re on the 30% victims, you know, …. the problem is, everybody, there’s not enough victimizers for all the victims.\n\nSo you have to say it’s, well, I can’t find racism, but it’s systemic. It’s everywhere. It’s insidious. You need, you need a racist detector in your foundation of your home to find it. It’s in everywhere. So then of course you can’t see it. You can’t smell it, but it’s deadly. But only me, Professor Kendi, can find it—if you buy my book.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"On today’s episode of “Victor Davis&#160;Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc&#160;react to Michelle Obama’s book tour for her new book... Read More\n\n\nThe post Victor Davis Hanson: The Obamas Have Nothing to Complain About appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/08/victor-davis-hanson-obamas-have-nothing-complain-about/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/20251107TheObamas.jpg","video":null,"publish_date":"2025-11-08 10:00:00","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":-0.015},{"id":376987878,"title":"Lucas: Kamala’s book tour trumps 2024 race","text":"If Kamala Harris campaigned for president the way she is storming the country selling her book, she might have become president.\n\nHad she been more open with the media the way she is now — instead of hiding out from the press throughout the campaign — she might have prevailed.\n\nThe vice president had some $1.5 billion in campaign funds to burn through. And burn through those funds, she did,\n\nSo, things maybe could have been different,\n\nNot really. She was going to lose anyway.\n\nBut it is something to think about.\n\nIt is hard to imagine a President Harris dealing with dictators like Communist China’s Xi Jinping, war criminal Vladimir Putin of Russia or defiant Chuck Schumer of New York.\n\nIt is doubtful that she would have sent the B-2 bombers to wipe out the nuclear facilities in Iran or done much to free the Israelis held hostage by the Hamas terrorists in Gaza.\n\nWith Harris in the White House, John Kerry would have been back as climate czar, Maura Healey would be U.S. attorney general, and Elizabeth Warren would be Secretary of State.\n\nThe border would be open with Gavin Newsom in charge, people being deported would be Republicans, and Venezuelan dictator Nicolas Maduro would be bombing U.S vessels and not the other way around.\n\nUnder President Donald Trump, however, Maduro, if he is lucky, will soon be back driving a bus or die in prison, like fellow drug kingpin Manuel Noriega of Panama after the U.S. invaded and arrested him.\n\nAnd the East Wing of the White House that Trump is turning into a ballroom?\n\nForget about it. President Harris would have turned it into a Washington food pantry.\n\nIf you think not, consider her quote about the ballroom last week. She said, “Are you f—–g kidding me? The guy wants to create a ballroom for his rich friends while turning a blind eye to the fact that babies are going to starve when the SNAP benefits end hours from now. Come on.”\n\nNobody is going to starve in the U.S., and everybody knows it.\n\nAnd can you imagine President Harris ending wars around the globe the way Trump has done?\n\nTrump has settled so many wars between countries that he has lost count. He has even brought peace to countries that did not even know they were at war.\n\nSo, with the defeat of Harris, the country dodged a bullet.\n\nStill, Harris is hanging in there hoping that lightning will strike twice and that she will once again be the Democrat Party nominee for president in 2028. Fat chance.\n\nThe difference now is that this time she will have to fight for the Democrat nomination instead of being crowned by the party as she was in 2024 after Joe Biden melted down.\n\nHarris, however, will now face a wave of new, ambitious, young radical leftists like Andrea Ocasio-Cortez (AOC) or Zohran Mamdani (ZM) for instance, who have taken over the leadership of the Democrat Party\n\nMeanwhile, Harris still has old Joe Biden hanging around her neck like an ex-husband who won’t leave the house.\n\nStill, Harris is trying, and says she is not finished with politics, which is interpreted as that she will run again, or at least try.\n\nAnd she has remained in the spotlight not by campaigning for any candidate the way Barack Obama did, but by peddling her book.\n\nWhile stiffing the media in 2024 — and paying the price for it — Harris has now done interviews with more reporters promoting her book “107 Days” than she did during the entire 107 days of her presidential campaign.\n\nAnd she’s only been on her book-selling tour for 40 days.\n\nShe apparently thought that the $1.5 billion she spent on her campaign would do the trick. It did not\n\nHarris spent the entire 107 days of her 2024 presidential campaign without holding a single official press conference, which must be something of a record.\n\nNow she loves the media, and reporters have to beat her off with a stick.\n\nVeteran political reporter Peter Lucas can be reached at: peter.lucas@bostonherald.com","summary":"If Kamala Harris campaigned for president the way she is storming the country selling her book, she might have become president.","url":"https://www.bostonherald.com/2025/11/08/lucas-kamalas-book-tour-trumps-2024-race/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/BHR-Z-GRAHAM-01.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-08 08:34:55","author":"Peter Lucas","authors":["Peter Lucas"],"language":"en","source_country":"US","sentiment":-0.331},{"id":377027136,"title":"Top five takeaways from Tuesday&#39;s elections","text":"Democrats had a big night Tuesday. What did we learn from the voters?\n\nHistory repeats itself\n\nThe historical trend in New Jersey and Virginia is that the party opposite the incumbent president wins the gubernatorial race. With voters electing a Democrat for governor while Republican President Trump is in office, the trend continues.\n\nThat said, Republicans should not brush off the results as a routine trend. One, the margins of victory were larger than most expected them to be in the final results. Republican Glenn Youngkin won four years ago when Democrat Joseph R. Biden was president, but he polled just above 50%. Democrat Abigail Spanberger won with more than 57% of the vote. That helped other Democrats win close elections throughout the commonwealth.\n\nAlthough the party opposite the White House typically wins the gubernatorial races in Virginia and New Jersey, it can often serve as a bellwether for the midterm elections.\n\nVoters elected Republican Christine Todd Whitman as governor a year after Democrat Bill Clinton was elected president. The following year, a wave of Republicans retook the House and Senate as well as many other governorships across the country. The same thing happened the year after Republican Chris Christie was elected governor in New Jersey, when Barack Obama was in his first year as president.\n\nIt also goes the other way. In 2017, Democrat Phil Murphy was elected governor of New Jersey when Republican Donald Trump was president. During the 2018 Democratic wave, Republicans lost the House and many gubernatorial races. The same thing happened after Democrat Jon Corzine was elected governor in 2005 while Republican George W. Bush was president. Voters in swing states seem to want to counter what they perceive as overreach by either party.\n\nTDS is high in Democratic strongholds\n\nProposition 50 is the California ballot initiative that suspends the maps for congressional districts drawn by an independent commission and replaces them with a gerrymandered map adopted by the state Legislature, which Democrats control. It passed overwhelmingly Tuesday and will cost Republicans House seats from California.\n\nAn exit poll conducted by The Associated Press showed that roughly 7 in 10 voters in California said party control of Congress was “very important” to them. Those voters overwhelmingly supported Proposition 50. The exit poll also showed that approximately 80% of voters who supported the measure said it was necessary to counter changes made by Republicans in other states. Only 20% said it was the best way to draw maps.\n\nCalifornia Gov. Gavin Newsom made his intentions clear before the vote when he said that if Democrats take the House majority in 2026, it will “end Donald Trump’s presidency as we know it.” This is just the latest phase in Trump derangement syndrome.\n\nThis phenomenon was also a clear factor in Northern Virginia. The voters in the suburbs of Washington not only gave a clear victory to Ms. Spanberger but also helped elect a Democrat who said he fantasized about putting two bullets in the head of a Republican House speaker. Usually, that would be a disqualification for a candidate seeking to be the state’s top prosecutor. Not in Northern Virginia. These people hate President Trump so much that they voted for Democrats across the board.\n\nHouse majority is in jeopardy\n\nMidterm elections are historically tough for the party of the incumbent president. That got much harder after Tuesday. New maps in California will likely cost the Republican Party several seats in the House. The massive blue wave in Virginia also will fuel the move to redraw boundaries there in a way that will make it very difficult for Republicans to hold on to several seats.\n\nPersonality matters\n\nZohran Mamdani is a charismatic candidate. His social media campaign was outstanding. He comes across as likable and was discussing issues that many voters care about.\n\nAfter the 2024 elections, I warned that many of the inroads made with younger voters were based on personality, not policy. Authenticity is a big deal, and they viewed Mr. Trump as genuine and Vice President Kamala Harris as a fraud. Mayor-elect Mamdani embraced his personality-driven brand of socialism, and younger voters liked it.\n\nThat said, New York City is a liberal place. Ms. Harris received two-thirds of the vote there last November. Overall, the rest of the mayoral vote was split between a Republican and a disgraced former governor who was running under a third-party banner. Conservatives need to recruit charismatic candidates.\n\nWages and prices are the big issues\n\nJames Carville famously said during the 1992 presidential campaign, “It’s the economy, stupid.” He was right. Now it’s all about higher wages and lower prices.\n\nTo avoid a blue wave next fall, Republicans must focus on wages and prices. People are genuinely concerned about these issues. They must see results as well as plans for the future. Thankfully, conservatives have answers. Let’s get to work!\n\n• Scott Walker is president of Young America’s Foundation. He served as the 45th governor of Wisconsin.","summary":"Top five takeaways from Tuesday&#39;s elections","url":"https://www.washingtontimes.com/news/2025/nov/6/top-five-takeaways-tuesdays-elections/","image":"https://media.washtimes.com/media/image/2025/11/05/Election_2025_55203.jpg","video":null,"publish_date":"2025-11-08 08:33:33","author":"Scott Walker","authors":["Scott Walker"],"language":"en","category":"sports","source_country":"ie","sentiment":-0.022},{"id":377027142,"title":"Debra Saunders- Trumps biggest election loss happened in California","text":"WASHINGTON — How did Proposition 50, the California redistricting ballot measure, pass handily this week when Golden State voters initially disapproved of the measure?\n\n“There were any number of people who were not paying any damned attention,” former Republican Gov. Pete Wilson told me over the phone Wednesday.\n\nMoney-wise, the campaign to fight Gov. Gavin Newsom’s pet measure was running on empty, Wilson explained, while the “yes” campaign was rolling in other people’s money. “The Democrats did not only have the money, but they spent it,” Wilson offered, as he touched upon conservative discontent about the weak “No on 50” campaign.\n\nLike everything in American politics today, this episode starts with President Donald Trump, who pushed Texas and other red states to adopt new district maps mid-decade to stack the House deck in the GOP’s favor. The general practice is to redistrict after the decennial census.\n\nIn short, Trump invited the Golden State’s backlash.\n\nNearly 64% of voters supported Newsom’s “Election Rigging Response Act.” Many were especially ready to go to war against Trump because they believed the ICE raids he sanctioned were too aggressive. (But really, many progressives do not believe federal immigration law should be enforced at all.)\n\nThe problem is, Newsom doubled down on an already rigged setup — one tilted in his party’s favor.\n\nThe California system disproportionately favors Democrats, despite a 2010 reform measure that transferred the drawing of district maps to an independent citizens commission.\n\nUnder the pre-Proposition 50 system, California’s delegation in the House of Representatives consists of 43 Democrats and nine Republicans. That ratio doesn’t come close to matching statewide partisan makeup. In 2024, 58% of Golden State voters supported Vice President Kamala Harris and 38% voted for Trump.\n\nSoon, Newsom and those who supported Prop 50 will be able to boast that they moved the divide to 48 or 49 Ds versus four or five Rs. That would leave the GOP with less than 10 percent of the delegation.\n\nDouble-rigging, that’s Newsom’s idea of the outcome of “fair and free” elections.\n\nIt would be wrong to leave out Newsom’s most infamous act of having his cake and eating it too.\n\nReaders may recall that in 2020, while he was telling his constituents to avoid Thanksgiving get-togethers to prevent the spread of COVID-19, Gov. Handsome dined with fellow big shots at the tony French Laundry. Because he could.\n\nWilson is especially mindful of the disparity of campaign funding for and against Proposition 50. “All told, proponents spent roughly $99 million on advertising online and on television compared with nearly $39 million in opposition, according to data from AdImpact, an ad-tracking service,” The New York Times reported.\n\nAll that talk about big money favoring the right. Not in California.\n\n“The business community are the biggest wimps in the world,” political strategist and Wilson whisperer Sean T. Walsh noted, “and they can so easily be intimidated.”\n\nThat’s another way Newsom is so very much like Trump.\n\nDitto Gavin Newsom. Trump’s maneuver backfired completely. And now Newsom — not former Vice President and California Sen. Kamala Harris — is the likely Democratic front-runner in the 2028 race for the White House.\n\nSure, the next Republican nominee can slam Newsom for California’s dysfunction: The High-Speed Rail project, also known as the Train to Nowhere. The lack of affordability and the huge number of illegal immigrants who think that ICE has no right to arrest them for breaking immigration laws.\n\nNewsom will make a big target. But he’ll be cushioned by all the millions he is likely to draw thanks to Trump’s blunder. And he’ll be able to tell the country that he went up against Trump and won.\n\nContact Review-Journal Washington columnist Debra J. Saunders at dsaunders@reviewjournal.com. Follow @debrajsaunders on X.","summary":"Debra Saunders- Trumps biggest election loss happened in California","url":"https://www.presstelegram.com/2025/11/07/debra-saunders-trumps-biggest-election-loss-happened-in-california/","image":"https://www.presstelegram.com/wp-content/uploads/2025/08/OCR-L-CALAWSUITS-0813.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-08 08:32:59","author":"Gqlshare","authors":["Gqlshare"],"language":"en","source_country":"ie","sentiment":-0.22},{"id":376960504,"title":"JFK's grandson Jack Schlossberg looks to continue family dynasty with Congressional run: 'It's happening'","text":"President John F. Kennedy's grandson Jack Schlossberg looks to continue his family's political dynasty as he gears up to run for Congress. \n\nThe 32-year old social media personality looks set to announce his bid to take the open House seat in New York's 12th Congressional District.\n\nSchlossberg announced he was forming an exploratory committee in September and will announce his bid next week, Politico reported. \n\n'It's happening,' a source told the outlet, with another adding that he's already begun hiring campaign staffers and discussed the run with at least one elected official. \n\nThe Daily Mail has reached out to Schlossberg for comment. \n\nSchlossberg rose to TikTok and Instagram fame as a liberal heartthrob by sharing hunky shirtless photos and quirky clips of himself practicing ballet, hoverboarding while reciting poetry and even opening a coconut in Hawaii with his bare hands. \n\nHe would enter what is expected to be a crowded race to replace 78-year-old Jerrold Nadler, one of the oldest members in the Democratic caucus, who is retiring after 34 years in office.\n\nThe Democrats set to run in a district Kamala Harris beat Donald Trump in by 64 points include two members of the state assembly, a city council member and 26-year-old Rhodes Scholar Liam Elkind.\n\nAnti-gun activist Cameron Kasky, former Trump attorney Michael Cohen and actress and former candidate for governor Cynthia Nixon are also rumored to be jumping in, while Chelsea Clinton declined a run despite rumors to the contrary. \n\nThe 32-year-old is a graduate of both Harvard and Yale, and has been active in progressive politics, as well as the media. Schlossberg is the son of JFK's daughter Caroline Kennedy.\n\nSchlossberg spoke at the 2024 Democratic National Convention, and frequently criticizes his cousin Robert F. Kennedy Jr., who presently serves as President Donald Trump's Health and Human Services secretary. \n\nHis critiques are part of an active social media life, as Schlossberg has over 171,000 followers on X, 721,000 on Instagram and 835,000 on TikTok. \n\nHe has also been appointed to the America 250 Commission by Senate Minority Leader Chuck Schumer. \n\nNadler said last month of his potential successor that 'there's nothing particularly good or bad about a Kennedy holding my seat. \n\n'But the Kennedy, unlike Schlossberg, should be somebody with a record of public service, a record of public accomplishment, and he doesn't have one.' \n\nThe future of the historically safe seat for Democrats will likely be set in the Democratic primary scheduled for June 23, 2026. \n\nNadler, 78, has represented New York City's Upper West Side for over three decades, and his decision comes as the Big Apple has been steadily swinging towards younger socialist leaders such as Congresswoman Alexandria Ocasio-Cortez and New York City Mayor-Elect Zohran Mamdani. \n\nIn an interview with The New York Times, Nadler cited the spectacle made of former President Joe Biden's cognitive decline as a key reason for his decision to announce his departure from Congress.\n\nBiden's disastrous performance in last year's presidential debate escalated the scrutiny of the age and health of top leaders in the Democrat party.\n\n'Watching the Biden thing really said something about the necessity for generational change in the party, and I think I want to respect that,' Nadler noted to the New York Times. \n\nHe added that a younger successor 'can maybe do better, can maybe help us more.' \n\n'This decision has not been easy. But I know in my heart it is the right one and that it is the right time to pass the torch to a new generation,' Nadler noted in a statement issued by his office Tuesday announcing the end of his political career.\n\nSchlossberg is the son of Caroline Kennedy, the only daughter of Jackie Kennedy Onassis and JFK - who was five years old when her father was assassinated in 1963.\n\nHe has long shown an interest in politics, mingling with top officials at a young age alongside his famous mom and delivering numerous politically-driven speeches over the years.\n\nHe gained attention in June 2023 when he went on a harsh rant against RFK Jr. after the now-Health Secretary announced he was running for president.","summary":"The 32-year old social media personality and only grandson of President John F Kennedy appears set to announce his bid to take the open House seat in New York's 12th Congressional District.","url":"https://www.dailymail.co.uk/news/article-15271085/Kennedy-heir-Jack-Schlossberg-bid-NYC-seat.html","image":"https://i.dailymail.co.uk/1s/2025/11/08/02/103702407-0-image-m-13_1762569473696.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/18/5159222992184167759/1024x576_MP4_5159222992184167759.mp4","publish_date":"2025-11-08 07:03:49","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":0.339}]}