{"offset":0,"number":50,"available":344,"news":[{"id":355332146,"title":"Democrats Again Try to Shift Blame for Inflation That Mostly Occurred Under Biden","text":"DAILY CALLER NEWS FOUNDATION—Democrats are attempting to draw negative attention to the U.S. economy under Republican leadership, but cite price increases that began in the middle of former President Joe Biden’s sole White House term.\n\nThe Democratic Congressional Campaign Committee (DCCC) in July launched HouseRepublicanPriceHike.com, an interactive tool aiming to highlight how the cost of some grocery store items have increased under House Republicans’ watch. The DCCC claims on its webpage that “under Republicans, costs have soared, and Americans are paying more than ever.”\n\nHowever, the DCCC’s interactive tool notably states that the grocery prices it lists, which cite data from the Bureau of Labor Statistics (BLS) and the Federal Reserve Bank of St. Louis, are since 2022, when Biden and former Vice President Kamala Harris were still in office. Democrats controlled the House for the entirety of 2022, with the GOP taking control of the chamber in January 2023. The Democratic Party also held the Senate until January of this year.\n\n(Screenshot/Media Research Center)\n\nThe DCCC wrote in a Thursday post on the social media platform X that “Republicans are ruining everyone’s Labor Day cookouts by making everything more expensive—and Americans deserve to know the truth.” On Thursday, the DCCC also launched an ad campaign aiming to slam Republicans over inflation ahead of Labor Day, CBS News first reported.\n\n“Labor Day is supposed to be a time to celebrate the contributions of the American worker and to relax with neighbors and families over a grill enjoying burgers and beer,” DCCC spokesperson Viet Shelton told CBS News. “But House Republicans are ruining everyone’s cookouts by making the trip to the grocery store more expensive. The DCCC is going to make sure voters know House Republicans are responsible.”\n\nIn late July, the Democratic Party was widely panned after its official X account posted a graphic showing massive upticks in grocery prices from 2021 to 2024 featuring the caption “Trump’s America,” despite the fact that Biden was still in the White House during that time period.\n\n(Screenshot/Fox News Channel)\n\nInflation notably soared to record highs under Biden’s watch, peaking at 9.1% in July 2022. Many American households also faced grocery affordability headaches during his time in office.\n\nAdditionally, energy prices also rose significantly during Biden’s sole term. Despite this, Biden has defended his economy since leaving office.\n\nThe Consumer Price Index (CPI), a broad measure of the cost of everyday goods and a key indicator of inflation, increased a seasonally adjusted 0.2% in July, which was less than expected. Still, wholesale prices rose 0.9% in July, which was higher than expected, the BLS reported on Aug. 14.\n\n“Democrats spent four years torching the economy, and they can’t even pretend to hide it,” National Republican Congressional Committee spokesman Mike Marinella told the Daily Caller News Foundation in a statement. “If reminding voters how miserable Biden and Democrats made their lives is the plan, we’ll take it every day of the week.”\n\nThe DCCC did not respond to the DCNF’s request for comment.\n\nOriginally published by the Daily Caller News Foundation","summary":"DAILY CALLER NEWS FOUNDATION—Democrats are attempting to draw negative attention to the U.S. economy under Republican leadership, but cite price increases that began in the... Read More\n\n\nThe post Democrats Again Try to Shift Blame for Inflation That Mostly Occurred Under Biden appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/08/28/democrats-again-try-to-shift-blame-for-inflation-that-mostly-occurred-under-biden/","image":"https://www.dailysignal.com/wp-content/uploads/2025/08/20250828_GroceryReceipt.jpg","video":null,"publish_date":"2025-08-28 23:51:16","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"us","sentiment":-0.21},{"id":355331592,"title":"LATIKA M BOURKE: It’s time to start listening to the Democrats again, and this one in particular","text":"One of the biggest surprises of the second Trump Administration is not MAGA’s assault on the institutions and the abuse of the military to assert domestic control, but the lack of resistance to America’s slide towards illiberalism, if not authoritarianism.\n\nUS President Donald Trump is doing much of what he said. “Promises made, promises kept,” is one of his Administration’s catchphrases.\n\nHe was open about politicising the Department of Justice after being on the receiving end of legal pursuits during the Biden Administration.\n\nAnd it’s looking like payback time. Vice President JD Vance barely concealed that the pursuit of John Bolton, one of Mr Trump’s fiercest critics after serving as his national security adviser during the first term, was political.\n\n“There’s a broad concern about Ambassador Bolton,” Mr Vance told Meet the Press.\n\n“They’re going to look into it and like I said, if there’s no crime here, we’re not going to prosecute it.”\n\nNote the use of “we’re.”\n\nMr Trump has begun fusing his crackdown on illegal immigration and crime with the use of the National Guard and military to enforce it.\n\nHe deployed troops to Los Angeles to support the forcible deportations of immigrants being carried out by Immigration and Customs Enforcement (ICE) agents, who are often wearing masks and have been filmed snatching people, and in some cases — US citizens and not illegal migrants — from the streets.\n\nThey are chilling and horrifying scenes that should appear in documentaries about living in dictatorships, not the country of liberty.\n\nAnd he has deployed the National Guard to Washington DC, usually called up to respond to natural disasters, to clean up the capital and rid it of crime.\n\nHis next target is the city of Chicago, the most populous city in the Democrat-governed state of Illinois and run by the black Democratic Mayor Brandon Johnson.\n\n“Unlawfully deploying the National Guard to Chicago has the potential to inflame tensions between residents and law enforcement when we know that trust between police and residents is foundational to building safer communities,” the Mayor said.\n\nUnless, of course, this is the plan. Civil unrest would give Mr Trump another pretext to deepen and extend the use of law enforcement and the military against the American people.\n\nAnd yet the Democrats have failed to land a punch on these alarming tendencies, except one.\n\nOutraged by the deployment of troops to LA, the Democratic Governor of California, Gavin Newsom, has finally found a way to attack Mr Trump — by mimicking him.\n\nIt began with equally childish tweets issued by his official press account, written in the same style as Mr Trump’s social media posts and calling the US President “Little Hands,” an insult that has annoyed Mr Trump.\n\n“WOW !! PRESIDENT TRUMP SAYS ABOUT ME, GAVIN C. NEWSOM: “HE’S A NICE GUY, LOOKS GOOD.” THANK YOU FOR THE KIND WORDS, LITTLE HANDS. EVERYONE SEEMS TO BE TALKING ABOUT ME (AMERICA’S FAVORITE GOVERNOR!). —GCN” he wrote on X, in one example.\n\nIn another post, he used Elon Musk’s AI bot on X, Grok, to troll Mr Trump’s mental state.\n\n“Do people with dementia repeat false things over and over again?” his post asked Grok.\n\n“Yes, people with dementia can repeat false statements or beliefs, a behaviour often linked to memory impairments and cognitive changes,” Musk’s chatbot responded.\n\nMercifully, someone has finally departed from Michelle Obama’s sanctimonious decree: “When they go low, we go high.”\n\nLike many of Mr Trump’s brutal and jaw-dropping but often also downright funny attacks, Mr Newsom’s similarly land, because they hit at a kernel of truth and are wrapped in humour.\n\nNot that he is laughing so much. When Mr Newsom sat down with Politico in Sacramento this week, he was serious and fired up and showed a Trump-like talent to talk at length, without a single note but with emotion and charisma.\n\nMr Newsom has understood that whatever the reign of Trump 2.0 brings, this is not the climate for business as usual; it is time to take risks.\n\n“I’m on the other side of any kind of hesitancy that I had prior,” Mr Newsom said.\n\n“I’m on the other side of giving a damn about people’s feelings about this moment because I see the threats in very vivid terms.”\n\nMr Newsom said seeing firsthand the effects of the ICE raids on his community had changed him and his approach to politics.\n\n“In every way, shape or way I have changed … and when I’m done, I have to meet this moment, so yeah, this has been very clarifying, this has been very sobering,” he said.\n\nHe is unequivocal about what America faces — in his view, a US President displaying authoritarian tendencies, preparing to rig elections through the use of a “private police force”.\n\nMr Trump has repeatedly flirted with the idea of seeking a third term, something he is constitutionally barred from seeking.\n\nWhen he hosted Ukraine’s President Volodymr Zelensky and European leaders at the White House last week, presidential assistant Margo Martin posted a photo on social media of the President showing Mr Zelensky and France’s Emmanuel Macron his “4 More years hat.”\n\nMs Martin included a crying with laughter emoji and the American flag alongside her caption.\n\nEarlier, Mr Trump had joked with Mr Zelensky about using martial law, as is imposed in Ukraine, to avoid holding elections.\n\n“So let me just say, three and a half years from now, so you mean if we happen to be in a war with somebody, no more elections?” Mr Trump joked.\n\n“I wonder what the fake news would say about that.”\n\nMr Zelensky, who was doing his best to avoid another Oval Office humiliation, laughed in response and noted: “You like this idea?”\n\nDuring that encounter, Mr Trump also floated his opposition to mail-in voting after being advised on the matter by Russian President Vladimir Putin during their meeting in Alaska, Anchorage.\n\nMr Newsom sees no jokes.\n\n“He tried to steal the last election, he’s trying to rig it in plain sight this time,” Newsom said.\n\n“You think he’s joking about 2028? You think when he brings foreign leaders to the Oval Office and he goes to the White House store and he shows them the 2028 hats, he’s not being serious?\n\n“Who spends $200 million on a ballroom at their house and then leaves?\n\n“Pay attention, folks, this guy is not screwing around. Wake up, we’re losing this country in real-time.\n\n“This is not bloviation, this is not an exaggeration, it’s happening.\n\n“The rule of law is being replaced by the rule of Don, period, full stop.”\n\nMr Newsom said Democrats had to assert themselves with clarity and conviction.\n\n“I’m sick and tired of Democrats being on the losing end in this country and our democracy being on the losing end,” he said.\n\n“We have got to fight fire with fire.”\n\nThere are other promising signs that the left is beginning to grasp the magnitude of its failures.\n\nThis week, the centre-left think tank Third Way issued a plea to fellow travellers, urging all Democrats and their supporters to ditch immediately 45 words that make them sound “extreme, divisive, elitist, and obfuscatory, enforcers of wokeness.”\n\nIncluded in the list are: Privilege, patriarchy, LGBTQIA+, intersectionality, cisgender, chest feeding, pregnant people, stakeholders, barriers to participation, food insecurity, critical theory, systems of oppression and many other words this author was not even aware existed, let alone would be used by anyone normal in regular conversation.\n\nAnd that’s the point. Mr Newsom is actively meeting Mr Trump where he’s at — using simple language, plain-speaking and getting personal in the attacks.\n\nAnd it’s retail.\n\n“This is the guy that’s going to ruin Christmas with the tax on all the toys that’s coming in the next few months with all these illegal tariffs,” Mr Newsom warned.\n\nAnd the response from Mr Trump and his acolytes suggests Mr Newsom’s attacks are having an impact.\n\nMr Trump has reverted to calling the Governor “Newscum” and claimed he is “way down in the polls.”\n\nMr Newsom is also a regular topic on Fox News, the right-wing news channel that the Democrat regularly fact-checks.\n\nSean Hannity, a commentator supportive of Mr Trump, blasted Mr Newsom was embarrassing himself with his posts and copycat stunts. That Mr Newsom is imitating Mr Trump was evidently lost on the Fox News host.\n\nFor beleaguered, shell-shocked Democrats who have struggled to find their feet ever since an ailing Joe Biden froze on national television, the irony will be as delicious as it is bittersweet.\n\nMr Newsom’s performance makes it all the more painfully obvious that he would have been a better choice than Kamala Harris, although no one may have ultimately stopped Mr Trump’s return to the White House.\n\nMr Newsom is an obvious contender for the Democratic primary and may well get his go. A central challenge will be reframing patriotism, as Mr Trump continues to morph the demand of loyalty to the country to himself.\n\nMr Newsom is prepared for the fight, however ugly it may get.\n\n“I’m not calm and I’m not going to submit myself to niceties, not when this guy is trying to wreck our goddamn country,” he said.\n\n“This is a real and serious moment in US history, and by the way I say that as an American, not as a Democrat.\n\n“Every Republican should be ashamed about this and scared to death about not just about these authoritarian tendencies but these authoritarian actions by the President.\n\n“He is weak, he is weakness masquerading as strength and that makes him more dangerous than most people believe.”\n\nMr Newsom would be the first to hope that his predictions do not come true. But whether he and his fellow Democrats can meet that moment if they do could redefine America.","summary":"LATIKA M BOURKE: Outraged by the forcible deportations of immigrants, the Democratic Governor of California, Gavin Newsom, has finally found a way to attack Donald Trump.","url":"https://thewest.com.au/politics/world-politics/latika-m-bourke-its-time-to-start-listening-to-the-democrats-again-and-this-one-in-particular-c-19841574","image":"https://images.thewest.com.au/publication/C-19841574/4bb4bbbe0c6bd6f49f27e5cb1e7371306169ac10-16x9-x1y0w2446h1376.jpg?imwidth=1200","video":null,"publish_date":"2025-08-28 23:12:27","author":"Amy Lee","authors":["Amy Lee"],"language":"en","category":"politics","source_country":"au","sentiment":-0.029},{"id":355323702,"title":"Midterm tea leaves say Trump can  upend political history — again","text":"It is a failsafe and oft-repeated line, one we’ve all heard uttered each election cycle as a friend (or a TV talker) proclaims his undergraduate knowledge of political patterns: “The president’s party loses seats in the midterm elections.”\n\nIt’s about as profound as the trailblazing financial advice “buy low, sell high,” or hearing your overweight, armchair-quarterback pal explaining “if the offense puts more points on the board, the Jets can win.”\n\nThanks, coach!\n\nUnfortunately for both the GOP and Gang Green, these clichés almost always hold true.\n\nBut while the Jets might struggle to score this Sunday, the Republican Party under President Donald Trump is charging downfield, routinely stretching past its first-down markers.\n\nAnd fresh data this month — funding totals, handicappers’ forecasts and more — make the GOP seem better positioned for the 2026 midterms than any party in the White House since George W. Bush in 2002.\n\nApparently Democrats across the country already see the writing on the wall: They’re more eager to perform the political equivalent of taking their ball and going home than to actually play the game.\n\nTexas Republicans’ redistricting efforts got all the blame from legacy media, but it wasn’t the Lone Star State that set the example in the national tit-for-tat gerrymandering fight, nor even California’s Gavin Newsom or Illinois’ JD Pritzker, but New York’s own Gov. Kathy Hochul.\n\nIn 2022, Hochul’s own party’s appointees on the Court of Appeals squashed her efforts at reimagining New York’s district maps as an unconstitutional splatter of Picasso-shaped contours.\n\nTheir push to rearrange the deck chairs should come as no surprise.\n\nDemocrats are rudderless, routinely falling into the trap of standing up to Trump by defending fan favorites like carjackers in Washington, DC, antisemitic protesters at Columbia and a howling illegal immigrant accused of human trafficking.\n\nNow they’re paying the price, embattled on two fronts: voter registration and political donations.\n\nBoth indicate the 2026 midterms won’t be like 2018’s, when Nancy Pelosi flipped 41 seats to take back the House.\n\nLast week we learned that Joe Biden’s presidency saw the largest-ever mass Democratic exodus: 2.1 million voters fled its ranks over four years as Biden’s missteps on inflation and immigration were matched only by his stumblings on staircases.\n\nAt the same time, the GOP gained 2.4 million votes.\n\nBut the greater cause of fear in Democratic hearts is becoming more evident with every campaign-finance filing: The GOP’s outside fundraising arms are moving and shaking, while the Dems’ are struggling to find a spark.\n\nThe Senate Leadership Fund and its affiliate One Nation recently released its first set of filings under the stewardship of Majority Leader John Thune.\n\nTogether, the two raised a whopping $85 million — double their previous record for the first half of an off-election year.\n\nAnd while the Senate Leadership Fund is already spending heavily in five battleground states, its $29 million cash on hand is three times more than it reported at the same point in 2023, and five times what it had in 2021.\n\nOn the House side, it’s a similar story. The Congressional Leadership Fund and its affiliated American Action Network have raised a combined $60 million during the first half of 2025 — a record high, and nearly double the $35 million they brought in during the first half of 2023.\n\nAnd the House Republican-aligned groups have far outpaced their cross-aisle rivals: The House Democratic-aligned House Majority PAC and the nonprofit House Majority Forward have managed to scrounge up just $40 million this year.\n\nParty accounts show a widening divide as well.\n\nThe Democratic National Committee raised a paltry $8.5 million in July and is sitting on just $14 million in the bank — after shelling out more than $20 million to settle up bills racked up by Kamala Harris in her disastrous $1.5 billion presidential campaign.\n\nCan’t blame DNC donors for feeling gun-shy.\n\nMeanwhile, the Republican National Committee raised $13 million last month and holds $84 million on hand.\n\nThe fundraising figures indicate across-the-board GOP momentum that polling numbers and prediction models are starting to reflect.\n\nThe Cook Report, a respected political handicapper, now places 10 vulnerable Dem seats in their toss-up column, to just 8 on the GOP side; nonpartisan election-map website 270 To Win shades a two-seat advantage to Republicans.\n\nAll this, of course, must be seen in the context of Trump, the unstoppable force driving the entire spectrum of political opinion over the last 10 years. \n\nMuch to Democrats’ chagrin, Trump’s job-approval numbers are about 8 percentage points higher today than they were in August 2017.\n\nIn his time on the national stage, Trump has broken conventional political wisdom to bits.\n\nShattering the notion that his party faces certain midterm doom may just be the next move in his playbook. \n\nJoe Borelli is a managing director at Chartwell Strategy Group and former minority leader of the New York City Council.","summary":"Rudderless Democrats are embattled on two key fronts, indicating that the 2026 midterm elections won’t be like those of the past.","url":"https://nypost.com/2025/08/28/opinion/midterm-tea-leaves-trump-can-upend-political-history-again/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-42lvmrjl9-1756417950079.jpg?quality=75&strip=all&1756403917&w=1200","video":null,"publish_date":"2025-08-28 22:39:34","author":"Joe Borelli","authors":["Joe Borelli"],"language":"en","category":"politics","source_country":"us","sentiment":0.022},{"id":355335018,"title":"Former DNC chair says Biden universe dismissed his ideas for Democratic brand study, YouTube channel","text":"Former Democratic National Committee (DNC) Chair Jaime Harrison said Wednesday that members of former President Joe Biden's inner circle dismissed Harrison's ideas for a Democratic brand study during a podcast interview. \"Now, some of the people in his universe at the White House did not always make it easy in terms of doing the things that I thought we should have been doing in order to strengthen the party, to rebuild the party's brand, to really engage in the social media aspect,\" Harrison told Democratic California Gov. Gavin Newsom during his podcast, \"This is Gavin Newsom.\" Harrison called Biden one of the most \"pro-party\" presidents the Democratic Party has ever had and credited him for helping to invest in state parties across the country. DEMOCRATS ARE STILL LOST BUT ONE YEAR AFTER BIDEN'S EXIT, THEY'RE STARTING TO FOLLOW A RIVAL'S ROADMAP \"I wanted to create a YouTube channel that I call ‘DTV’ that would have been focused on the Democratic Party and having us tell our own story, highlighting our successes, getting different people that showcase the diversity of the party out there on social media, where people are getting their information from. But I was told, ‘That's not a big priority right now,'\" he continued. Harrison explained he wanted to do a brand study for the Democratic Party because he felt it was broken. He said he hoped to get people from nonprofit and corporate spaces to look at the Democratic Party as a political brand. \"I was told, 'No, we're not going to spend time on that.' So, it wasn't from the president. It's some of the people, sometimes in the president's bubble, who think they know better but, in essence, probably should just listen to some of us that are on the ground. But I'll leave that for another day,\" Harrison claimed. EX-DNC CHAIR COMPLAINS DEMOCRATS EXPECTED HIM TO 'JUST RUBBER-STAMP' PLANS DURING 2024 CAMPAIGN The former DNC chair decided not to seek re-election this year. Ken Martin, former chair of the Minnesota Democratic–Farmer–Labor Party, was elected as the new DNC chair in February. Harrison argued that the Democratic Party should have stood by Biden in an interview with The Associated Press after former Vice President Kamala Harris' loss to President Donald Trump in the 2024 election. Harris replaced Biden at the top of the Democratic ticket after he exited the race. After the interview was released in January, Harrison objected to a headline that said, \"The DNC’s outgoing chair says Democrats should have stuck with Joe Biden in 2024.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"This headline isn't right. Stuck ‘by’ and stuck ‘with’ are two different things,\" he wrote on X. \"Yes, I believed we should have stuck by and defended President Joe Biden when he was our nominee, and at the same time when Joe Biden stepped down I was damn proud to fight for Vice President Harris to be our next POTUS.\" Biden's office and the DNC did not immediately return a request for comment. CLICK HERE TO GET THE FOX NEWS APP","summary":"Ex-DNC Chair Jaime Harrison said former President Joe Biden&apos;s bubble made it difficult to move forward on ideas he had to strengthen the Democratic Party&apos;s brand.","url":"https://www.foxnews.com/media/former-dnc-chair-says-biden-universe-dismissed-his-ideas-democratic-brand-study-youtube-channel","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/jaime-harrison-joe-biden-pod.jpg","video":"https://www.foxnews.com/video/6377584493112","publish_date":"2025-08-28 22:30:18","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.293},{"id":355331554,"title":"Joe Biden's Sad Last Days: Former Prez, 82, Sparks Major Health Concern After He 'Cancels' His Upcoming 'Speaking Tour' as He Battles Cancer","text":"Joe Biden had several speaking engagements scheduled for 2025, but now they have all reportedly been axed, RadarOnline.com can reveal.\n\nBefore the 82-year-old dropped out of the 2024 election and made way for Kamala Harris, speaking arrangements were made for him at numerous locations, but that has now gone down the tubes.Why Was His Speaking Tour Axed?According to reports, Biden would have made up to $300,000 a time per engagement, less than what his pal, and former president, Barack Obama, made for his appearances.\n\nIn July 2023, Biden was also slated to speak at the National Security Multi-Mission Vessel while touring a Philadelphia shipyard; however, White House officials nixed that idea after learning how much of a physical strain it would put on the politician's body, especially since there would be \"lots of steps\" to get on board.\n\n\"No visit to the NSMV vessel is planned after the White House realized how many steps were involved to get on the ship,\" a MARAD official told members of the Office of the Secretary of Transportation (OST), quoting a contact the agency had at that shipyard, in previously revealed emails.\n\nJust one week before Biden was supposed to head to Philly, he attended the Air Force Academy graduation ceremony in Colorado Springs, where he took a spill on stage. \n\nAt the time, the White House claimed Biden had tripped over a sandbag.A Bad Decision RevealedIt seems Biden's team was all about protecting him; however, earlier this year, a document revealed his senior advisers pushed for him to debate Donald Trump much earlier than the Commission on Presidential Debates had proposed, a decision that led Biden to exit the race.\n\nIn the memo, obtained by journalists Josh Dawsey, Tyler Pager, and Isaac Arnsdorf, for their book, 2024: How Trump Retook the White House and the Democrats Lost America, Biden was encouraged by his trusted staff to go head-to-head with Trump way before the autumn dates that were recommended.\n\n\"By holding the first debate in the spring, YOU will be able to reach the widest audience possible,\" the document, dated April 15, 2024, stated. \"Before we are deep in the summer months with the conventions, Olympics, and family vacations taking precedence.\"\n\nIt added: \"In addition, the earlier YOU are able to debate the better, so that the American people can see YOU standing next to Trump and showing the strength of YOUR leadership, compared to Trump’s weakness and chaos.\"Biden's Cancer DetailsBiden and Trump, 79, did end up battling it out on CNN on June 27, but the Democratic candidate flunked the assignment in an embarrassing display.\n\nAll eyes have been on Biden ever since he revealed he was diagnosed with prostate cancer, which was characterized by a \"Gleason score of 9,\" meaning the condition is \"aggressive.\"\n\nTop oncologist Dr. Zeke Emanuel, who served as an advisor for health policy under Obama, claimed Biden likely had the cancer \"while he was president.\"\n\n\"He probably had it at the start of his presidency, in 2021,\" Dr. Zeke said on Morning Joe on May 19. \"Yes, I don't think there's any disagreement about that.\"While Biden has stayed out of the spotlight since bowing out of the election, earlier this month he was seen enjoying dessert at the Double Dippers ice cream shop in Rehoboth Beach, Delaware.\n\nWhile he put forth a happy front, users in the comments section were worried that the sick former leader was looking unhealthily thin.\n\n\"Joe Biden has lost a lot of weight,\" one stated, as another added: \"Man looks like a literal skeleton.\"\n\nBiden has been spending his post-presidency at his Delaware home as he battles his aggressive cancer.","summary":"Joe Biden will continue to stay out of the spotlight after bowing out of the election, as his upcoming speaking tour is said to have been canceled.","url":"https://radaronline.com/p/joe-biden-speaking-tour-canceled-health-cancer/","image":"https://media.radaronline.com/brand-img/N6XcRCa6F/0x0/biden-speaking-tour-canceled5-1756411894362.jpg","video":null,"publish_date":"2025-08-28 21:00:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","source_country":"us","sentiment":-0.417},{"id":355307342,"title":"Marilyn Monroe’s Brentwood home faces demolition in battle over landmarks","text":"By John Gittelsohn | Bloomberg\n\nMarilyn Monroe’s last home faces the wrecking ball if its owners get their way this week in a court bid to overturn its designation as a historic landmark.\n\nBrinah Milstein, the daughter of a prominent Cleveland real estate developer, and Roy Bank, a reality TV producer, paid $8.35 million in 2023 for the Brentwood area property where the screen goddess known for Some Like it Hot and Gentlemen Prefer Blondes spent her final six months.\n\nALSO SEE: LA City Council saves Marilyn Monroe’s Brentwood home from demolition\n\nShortly after the couple received a demolition permit, preservationists persuaded the city of Los Angeles to designate the house as a historic-cultural monument, sparing it from destruction. Milstein and Bank planned to combine the site with an adjacent lot, their residence since 2016, “to improve the property,” Peter Sheridan, their attorney, said in an email.\n\n“LA has thousands of celebrities who live and die here,” Sheridan said. “Is every house that those good folks lived in a ‘historic monument’? Not in the least.”\n\nCelebrity homes are one of LA’s major tourist attractions, with star-tour buses clogging streets from Hollywood to the Pacific shores. Stopping places in Brentwood include the gates of the manors of Arnold Schwarzenegger, Kamala Harris and Harrison Ford.\n\nFew stars match the allure and tragic glamor of Marilyn Monroe, but the historical value of her former home is dismissed by its current owners.\n\n“There is not a single piece of the house that includes any physical evidence that Ms. Monroe ever spent a day at the house, not a piece of furniture, not a paint chip, not a carpet, nothing,” according to the lawsuit in Los Angeles County Superior Court.\n\nThe suit claims the city unconstitutionally abused its power by conspiring with for-profit tour operators and biased conservationists to deprive the owners’ vested rights.\n\nAttorneys for the city argued they followed proper procedures, including gathering evidence of the property’s significance in the life of a notable historical figure.\n\n“Mere disagreement is not enough to overcome the city’s lawfully-taken action that petitioners opposed at every hearing of the proceedings,” a team led by LA City Attorney Hydee Feldstein Soto wrote in a response to the lawsuit.\n\nMonroe paid $75,000 for the home six months before her death, the first residence she bought on her own after marriages to baseball star Joe DiMaggio and playwright Arthur Miller.\n\nAn inscription in tile near the home’s front door threshold reads Cursum Perficio, Latin for “The Journey Ends Here.” It likely predates Monroe’s purchase, said Heather Goers, a preservationist who prepared a report for the city Cultural Heritage Commission, but adds a poignant note to her death at age 36.\n\n“Marilyn Monroe was quite possibly the most influential female entertainer of the 20th century,” Goers said. “Less than 3% of the 1,300 historic properties in Los Angeles are dedicated to women’s history. If you can’t commemorate the history of Marilyn Monroe, what’s that tell us?”\n\nOriginally built in 1929, the two-bedroom, two-bathroom single-story stucco house was designed in Spanish Hacienda-style by an unknown architect.\n\n“This house is unique and important to telling her story as an artist, celebrity, and iconic figure in Hollywood,” Andrew Salimian, director of advocacy for the Los Angeles Conservancy, a historical preservation group, said in an email. “It’s the only house she owned by herself as a single woman.”\n\nThe property has had 14 owners since Monroe’s death and undergone numerous renovations and additions including a detached recreation room and studio, the lawsuit says. The house, on a cul-de-sac of four properties, is enclosed by a wall and dense foliage and inaccessible to the public, unless they trespass, Sheridan said.\n\n“In this particular case, it’s too little too late,” because the property has been so extensively changed since Monroe died there, Aaron Kirman, chief executive of Christie’s International Real Estate, Southern California, said in an interview. “The city should’ve designated this as a historical site long ago.”\n\nBank and Milstein have suggested saving the structure by relocating it to a more public site, so Monroe devotees can have access. Since the property dispute first made news two years ago, tour groups and fans have swarmed their quiet cul-de-sac, invading their privacy, Milstein said in testimony to the city last year.\n\n“Our children have been buzzed by low-flying drones while playing in the backyard, running inside, crying in fear,” she said, choking back tears.\n\nThe brief period of Monroe’s life at the home is documented on an almost daily basis by her correspondences, checkbook payments and other records, according to Goers’ presentation. In the months she lived there, Monroe won a Golden Globe Award, sang Happy Birthday, Mr. President at a gala for John F. Kennedy, was fired by 20th Century-Fox for missing shooting days on a movie and posed for photographer Bert Stern in what became the basis of his book, The Last Sitting.\n\nSome of the most revealing documents are crime scene photographs taken for the coroner after Monroe’s death by a sleeping pill overdose, showing the house exterior much as it looks today, Goers said.\n\nIn July 1962, Monroe sat for an interview with Life magazine reporter Richard Meryman that was published the week she died. She took pride showing the largely unfurnished home, though she declined to allow photos, saying she didn’t want “everybody to see exactly where I live.” He described a profusion of flowers in the yard and construction underway of a side unit where her friends could stay in privacy.\n\n“She exulted in it,” Meryman wrote. “On a special trip to Mexico she had carefully searched in roadside stands and shops and even factories to find just the right things to put in it. The large items had not arrived — nor was she ever to see them installed. As she led me through the rooms, bare and makeshift, as though someone lived there only temporarily, she described with loving excitement each couch and table and dresser, where it would go and what was special about it.”\n\nMore stories like this are available on bloomberg.com\n\n©2025 Bloomberg L.P.","summary":"The movie star’s last home faces the wrecking ball if its owners get their way in a court bid to overturn its designation as a historic landmark. ","url":"https://www.ocregister.com/2025/08/28/marilyn-monroes-home-faces-demolition-in-battle-over-landmarks/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/LDN-Z-MONROE-HOUSE-0-16x9-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-08-28 20:20:35","author":"Bloomberg,Gqlshare","authors":["Bloomberg","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":0.058},{"id":355303910,"title":"Democrats in damage control crisis as Gaza famine worsens and public turns on party support for Israeli offensive","text":"The Democratic Party is at a crossroads over its stance on Israel, with elected officials, now untethered from a White House leader directing policy, forced to take sole ownership of their stances.\n\nThat came into sharp focus as the reaction to a pair of interviews Wednesday played out online.\n\nThe famine in Gaza continues to worsen after being officially recognized by the World Health Organization (WHO). With only its closest allies denying the existence of efforts by the Israeli government and citizens to restrict food and water aid into the besieged Gaza Strip, public support for Israel is plunging in the U.S. and has utterly collapsed within the Democratic Party.\n\nA new survey this week from Quinnipiac University found that more than 7 in 10 Democrats now believe that Israel is committing genocide in Gaza. There’s no question which way the winds are blowing: in July, the party’s rising stars like Elissa Slotkin, Ruben Gallego and Jon Ossoff backed a resolution to block arms sales to Israel, and high-ranking members of the former Biden administration are now openly trashing the Netanyahu government in interviews.\n\nOn Wednesday, two Democrats inescapably linked to the war in Gaza and the party’s stance on that conflict discussed the topic on camera. The reception their respective interviews received in Democratic circles couldn’t have been much worse.\n\nIn Congress, Rep. Ritchie Torres of New York is one of Israel’s most passionate defenders, at least on the left. The issue has caused major rifts between Torres and progressive members of his party like Alexandria Ocasio-Cortez, and has come to be his defining issue in a way it has for few others. Torres sat down this week with comedian and “dirtbag left” podcaster Adam Friedland, and the two battled over the ongoing siege.\n\nFriedland relentlessly hammered Torres during the conversation and pressed the congressman to explain whether he believed that Palestinians bore historical blame and responsibility for acts committed against Jews by other Arab states around the Middle East and Africa. \n\n“I think hatred of Jewish people has exploded in this country, and I think it’s because of our support of what looks to be an absolute brutality [in Gaza],” the host told Torres, as he passionately spoke about his experience in Israel and how the disparity of Israeli-Palestinian life affected his view of an issue he’d been taught was central to Jewish identity. \n\nTorres responded by pushing Friedland, who is Jewish (Torres is not) and previously lived in Israel, on whether he was “justifying antisemitism” in the United States.\n\n“Are you crazy right now?” Friedland shot back, his mouth open. \n\nThe backlash online was relentless. \n\nTorres was called a “sociopath” by progressives and a “shill” for the Israel lobby. Still, the labels are nothing new for the congressman, who has made no secret of his own strong dislike of his party’s left wing.\n\nTorres is known to be popular within his district; it’s unclear if he’ll face a primary challenge from a Democratic Socialists of America-backed candidate or another progressive next year. In July, he claimed to CNN that he wasn’t afraid of “Mickey Mouse” primary challenges, while calling out DSA by name. \n\nBut his proximity to House Minority Leader Hakeem Jeffries (D-NY), both geographically and politically, could still make one an inevitable prospect if real momentum builds behind progressive bids to shake up the New York congressional delegation.\n\nThe other Democrat to take a beating on Israel this week was Jake Sullivan, former national security adviser to the Biden administration. \n\nSullivan, still a respected voice among the center-left on issues of foreign policy, revealed in an interview that he’d spoken with multiple members of Congress and advised them that support for blocking arms sales to Israel after the breakdown of ceasefire talks was a “credible” position.\n\n“Following the breakdown of the ceasefire in March, [it] means that a vote to withhold weapons in Israel is a totally credible position that I’d support,” said the former senior White House official.\n\nHe’d go on to assert that “political change” within Israel and the end of right-wing control over Israel’s government (referring to Benjamin Netanyahu’s administration) would be the only way to avert Israel from permanently changing into something unrecognizable to the U.S., which he said would impact the relationship between the U.S. and Israel going forward.\n\nSullivan was torched for those remarks. \n\nMatt Duss, a former advise to Sen. Bernie Sanders, tweeted that he “wasn’t buying” Sullivan’s change of heart, given that the Biden White House was “sending out talking points that voting against weapons to Israel was ‘aiding Hamas.’”\n\nThe Hill’s White House columnist Niall Stanage resurfaced Sullivan’s remarks from a White House briefing in May of 2024 as a response; the national security adviser, at the time, claimed that Israel was not restricting aid into Gaza as a matter of policy.\n\n“This is immensely frustrating to watch. Nothing Jake points to here is materially different than when he actually had power,” insisted Jeremy Konyndyk of Refugees International. “Yet there is zero self-reflection about that.”\n\n“Less than a year ago when Jake Sullivan worked in the White House, he lobbied against Senators voting to block weapons. But now he’s come up with an arbitrary cutoff for when voting to block weapons is good,” added Hamid Bendaas, spokesman for the IMEU Policy Project.\n\nThe question no longer seems to be whether there will be blowback within the Democratic Party for Joe Biden’s year-plus-long embrace of Benjamin Netanyahu, and Kamala Harris’ refusal to back away from it. Now, the question seems to be how far it will spread, and how many party prospects will see their future ambitions wilt on the vine as a result.\n\nGavin Newsom, the California governor emerging as the left’s champion on redistricting, hasn’t commented on the war in months from his personal social media account. \n\nPete Buttigieg, once seen as one of the party’s most effective advocates in front of a camera, is back on the sidelines and being overtaken by Newsom in 2028 polling after being forced to do his own Gaza-related damage control following an interview on what should have been his home turf, Pod Save America. \n\nHarris has methodically avoided interviews since leaving office, and isn’t likely to change that tactic any time soon.\n\nWill Democrats find a unifying position on Gaza? It seems far off on the horizon, after party leaders failed to do so in a policy session this week. DNC officials are headed back to the drawing board after pulling two resolutions on the issue, including one supported by embattled chair Ken Martin.\n\nMoreso than Biden’s age and frailty, the party’s civil war over support for Israel threatens to shake up the 2028 field in a way that could be devastating for the DNC establishment and those Biden-world alums with future dreams of office. \n\nAs the war drags on and Democrats have the power to do little besides self-reflect, many on the left could be hoping that Donald Trump succeeds in inking a permanent ceasefire before 2028 — even if it finally wins the GOP president the label of peacemaker he’s long sought.","summary":"The response to two very different interviews with Democrats linked to the party’s unpopular 2024 position on Gaza reveals much about 2028, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrats-gaza-israel-public-support-b2816044.html","image":"https://static.independent.co.uk/2025/08/28/16/53/GettyImages-2130138117.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/WDGH5Nfs-OhrQWqOm.mp4","publish_date":"2025-08-28 20:00:27","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.301},{"id":355274668,"title":"Lisa Cook Suit Says Her Firing By Trump Puts US Economy At Risk","text":"Federal Reserve Governor Lisa Cook’s lawsuit against President Donald Trump portrays his attempt to fire her as a power grab that could cause “irreparable harm” to the US economy.The suit disputed Trump’s allegation of mortgage fraud and described it as mere pretext to justify firing her and trying to seize control of the Fed. The move is part of a pattern by Trump, Cook says, following his earlier attempt to force out Fed Chair Jerome Powell and pressure the central bank into lowering interest rates.Cook asked US District Judge Jia Cobb in Washington to issue a temporary restraining order barring Trump’s firing of her from taking effect as the lawsuit begins. The order is necessary, according to the filing, to preserve the status quo at the Fed and protect the public interests.“The short-term political interests of a president often clash with sound monetary policy,” Cook’s lawyer, Abbe Lowell, wrote in the filing. “A politically insulated Board of Governors can make appropriate, albeit unpopular, decisions — such as raising interest rates to combat inflation — that are crucial for the nation’s long-term financial health.”Cobb, an appointee of former President Joe Biden, set an emergency hearing for Friday morning.The lawsuit is a major escalation in the growing clash between the White House and the Fed, which has resisted Trump’s demands to lower interest rates..Lisa Cook Sues Trump Over Move To Oust Her From Fed Board.Trump insists that he has “cause” to fire Cook and said the allegations against her were sufficient because she’d been previously accused of lying in financial documents.“The President determined there was cause to remove a governor who was credibly accused of lying in financial documents from a highly sensitive position overseeing financial institutions,” White House spokesman Kush Desai said in the statement. “The removal of a governor for cause improves the Federal Reserve Board’s accountability and credibility for both the markets and American people.” Cook’s lawsuit does not explicitly deny the mortgage fraud claim, but it does highlight a potential defense. The filing suggests that parts of the mortgage applications at issue could have been mislabeled unintentionally.Regardless, Cook argues, the alleged conduct doesn’t amount to “cause” to fire her under the Federal Reserve Act because it hasn’t been proven and allegedly took place before her Senate confirmation and isn’t relevant to her job..Who Is Lisa Cook And Why Has She Sued Donald Trump?.Cook’s complaint describes Trump’s move against her as “unprecedented and illegal,” arguing that her firing, if allowed to take place, “would be the first of its kind in the Board’s history” and “would jeopardize the independence of the Federal Reserve, and ultimately, the stability of our nation’s financial system.” Cook’s filing follows through her vow earlier this week to fight to finish her term that expires in 2038. She asked a judge to immediately issue an order blocking Trump’s effort to remove her and barring the Fed from taking any actions to carry out the president’s demand. Representatives for Cook’s lawyers and the Fed declined to comment.Rulings in the case in the coming days and weeks could add to investors’ concerns that the president’s efforts will undermine the independence of the central bank — a bedrock assumption of US markets that underpins the nation’s credit ratings.Cook said that the market’s negative reaction to Trump’s attempt to fire her is evidence that the public has a strong interest in Fed independence.“Shortly after President Trump announced his purported firing of Governor Cook, the dollar weakened against major currencies,” according to her filing.Cook sued days after Trump wrote a letter to her, which he posted on social media, saying that he was removing her immediately in light of her “deceitful and potentially criminal conduct in a financial matter.”Trump’s post followed a claim on social media by Federal Housing Finance Agency Director Bill Pulte that Cook lied on 2021 loan applications for two properties — in Michigan and Georgia — by claiming she would use each property as her primary residence to secure more favorable loan terms. He said the applications were filed two weeks apart.The suit says Cook wasn’t given an opportunity to respond to the allegations before Pulte referred the matter for a criminal investigation. Cook hasn’t been charged with wrongdoing..Fed’s Lisa Cook Warns Non-Bank Risks Could Exacerbate Market Stress.The case will likely hinge on whether a judge agrees that Trump has “cause” under US law to fire Cook. Section 10 of the Federal Reserve Act, the 1913 law that governs the central bank, says members of the Fed’s Board of Governors can be “removed for cause,” although the statute doesn’t specify exactly what “cause” means.Laws that do describe “for cause” generally define the term as encompassing three possibilities: inefficiency; neglect of duty; and malfeasance, meaning wrongdoing, in office. It’s far from clear that the mortgage allegations against Cook are enough to meet that bar.Cook became the first Black woman to serve on the Fed’s Board of Governors in Washington when she was appointed by President Joe Biden in 2022. During her initial confirmation process, Cook faced intense scrutiny from Republican lawmakers who accused her of misrepresenting parts of her resume and tried to use that to sink her nomination. She strongly denied the claims and was confirmed on a party-line vote in the Senate, with then-Vice President Kamala Harris stepping in to break the 50-50 tie.Her departure would give Trump an opportunity to secure a four-person majority on the seven-member board after another Biden appointee, Adriana Kugler, announced Aug. 1 she would vacate her position early. Kugler’s term was set to expire in January. Two other governors, Christopher Waller and Michelle Bowman, were appointed during Trump’s first term. .Trump Tariffs To Have Limited Impact On Listed Universe But Could Hit Consumption, Says This Analyst","summary":"The suit disputed Trump's allegation of mortgage fraud and described it as mere pretext to justify firing her and trying to seize control of the Fed.","url":"https://www.ndtvprofit.com/global-economics/lisa-cook-suit-says-her-firing-by-trump-puts-us-economy-at-risk","image":"https://media.assettype.com/bloombergquint/2025-08-28/bcq8o22i/438970968.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-08-28 17:50:27","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.165},{"id":355268764,"title":"Teachers’ unions dump more than $43.5M into liberal advocacy, Dem PACs","text":"WASHINGTON — The two largest teacher unions in America gave more than $43.5 million to liberal advocacy groups since 2022 — including several massive payouts to Democratic political action committees (PACs) during the 2024 election cycle, according to a new report from a conservative education watchdog group.\n\nThe American Federation of Teachers (AFT) and the National Education Association (NEA) shelled out $43,524,123 between mid-2022 and mid-2024, per a Defending Education report based largely on union disclosures to the Department of Labor.\n\nThe cash windfall went to lefty groups that back gun control measures, support racial “equity” and gender transitions for minors as well as abortion access.\n\nSarah Parshall Perry, vice president and legal fellow at Defending Education, said in a statement the audit “sheds much needed light on exactly what the NEA and the AFT prioritize — and it isn’t America’s schoolkids.”\n\n“Teachers unions don’t educate kids,” Perry added. “They seemingly exist for no other reason than to spend money, complain about parental involvement in their children’s education, and advance left-wing causes wholly unrelated to improving educational outcomes in American schools.”\n\nThe contributions included $9.3 million from both AFT and NEA to the left-wing For Our Future Action Fund PAC, which operated primarily in 2024 battleground states.\n\nAnother $1.6 million also was funneled from AFT to the House Majority PAC, $1.25 million to the Senate Majority PAC and $250,000 to Future Forward, the primary super PAC backing Kamala Harris’ campaign last year.\n\nA big backer of former President Joe Biden’s 2020 campaign as well, AFT President Randi Weingarten caught flak in the early years of the 46th president’s administration for pressuring public health officials to keep schools closed amid the COVID-19 pandemic.\n\nBoth the AFT and NEA also pushed the Biden White House and administration health officials to delay the re-opening of in-person learning in Spring 2021, bombshell emails and records obtained by other watchdog groups and congressional investigations showed in 2023.\n\nWeingarten also misrepresented scientific studies demonstrating it was safe for kids to be back in classrooms when testifying about COVID to Congress, according to the scientific authors of that research.\n\nOnly in early 2022 did the Biden administration announce that 95% of US public schools had returned to full-time, in-person learning.\n\nAnother $500,000 went to the Sixteen Thirty Fund, a nonprofit managed by the dark money network Arabella Advisors and sometimes portrayed as the left’s answer to the right-of-center Koch network.\n\nPresident Trump on Wednesday called for liberal billionaire George Soros and his son Alex to face racketeering charges for their affiliation with dark money organizations — including Sixteen Thirty — that contributed more than $20 million to groups funding protests against this month’s DC crime crackdown.\n\nAdditionally, the NEA gave $100,000 to the Trevor Project, a transgender youth organization that some moms have accused of pushing their pre-teen children toward gender transitions.\n\n“It’s long been the case that teachers’ unions have been hyper-political and given 99% of their donations to Democrats,” added Erika Sanzi, Defending Education’s director of outreach.\n\n“What this report reveals is that they are also giving massive amounts of money to far-left organizations and causes that fight against academic excellence and inject harmful ideology into everything they touch. Students and school staff deserve to be shielded from these entities.”\n\nNearly 40% of the NEA’s budget goes toward political advocacy, Freedom Foundation CEO Aaron Withe told Fox News, which first reported on the Defending Education document.\n\n“You’d think in light of the decline in union membership in recent years, that they’d start providing value to members that outweighs the cost of membership,” Withe told the outlet. “Instead, they are appeasing the radical base of union members by advocating for men in women’s sports, transitioning minors, antisemitism and other radical ideological stances.”\n\nIn 2020, AFT gave more than $2.6 million to Democratic candidates, according to the political donation tracking website OpenSecrets. The NEA contributed more than $2.4 million to Dems over the same period.","summary":"The cash windfall went to lefty groups that back gun control measures, support racial \"equity\" and gender transitions for minors as well as abortion access.","url":"https://nypost.com/2025/08/28/us-news/teachers-unions-dump-more-than-43-5m-into-liberal-advocacy-dem-pacs/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/president-american-federation-teachers-randi-110225534.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/JP6WLUlJ-RyIcpnTz.mp4","publish_date":"2025-08-28 17:49:00","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","category":"politics","source_country":"us","sentiment":0.002},{"id":355249740,"title":"Janet Mills Chances of Beating Susan Collins as She Shares Update on Plans","text":"Maine Governor Janet Mills, a Democrat, has offered an updated timeline as to when she may announce whether she will challenge Republican Senator Susan Collins in the 2026 midterm elections.Newsweek reached out to Collins and Mills for comment via email.Why It MattersMaine, a state that voted for former Vice President Kamala Harris by 7 percentage points last November, is viewed as one of Democrats' best opportunities to flip a GOP-held seat in the midterms and is likely a must-win for their efforts to win a majority in the chamber.Collins, a moderate Republican who has broken from her party on some high-profile votes, has proven to be a formidable candidate in the past, handily winning reelection despite the state's consistent Democratic voting record. Mills is seen as a potentially strong candidate against Collins because she enjoys high name recognition and has won statewide by comfortable margins in the past.But Mills hasn't said for sure whether she plans to run, and her candidacy remains a question mark on what could become one of the most competitive elections next year.What To KnowMills told reporters she is \"seriously considering the run\" and could make a decision by November, reported The Portland Press Herald.\"I'm not in any rush to make a decision. [I have] a lot to do with my present day job, so I'm seriously considering it,\" she said.Polling on the Maine Senate race remains limited. But recent surveys do reveal how Collins and Mills stack up in terms of popularity.A University of New Hampshire poll from June found that 14 percent of Mainers view Collins favorably, while 57 percent view her unfavorably; 26 percent were neutral. On the other hand, it found that 51 percent of Mainers view Mills favorably and 41 percent unfavorably. Only seven percent were neutral on Mills.It surveyed 846 Mainers between June 19 and June 23 and had a margin of error of plus or minus 3.4 percentage points.A Pan Atlantic Research poll yielded better results for Collins.It found that 49 percent of Mainers view the senator favorably, while 45 percent view her unfavorably. Meanwhile, 52 percent of respondents viewed Mills favorably, while 44 percent viewed her unfavorably. It surveyed 840 likely voters from May 12 to May 26, 2025, and had a margin of error of plus or minus 3.5 percentage points.A recent Morning Consult poll found that Collins' approval reached a record low of 38 percent, while 54 percent of Mainers disapproved of her.Meanwhile, Morning Consult has also found that Mills has an approval rating of +2, making her the least popular Democratic governor in the country and \"one of the only to lose popularity since the last quarter of 2024.\" The Morning Consult polling was completed from April to June, 2025, and the sample sizes varied by state.Kalshi betting odds have been split throughout August—on Thursday, Democrats had a 51 percent chance of winning the Senate race, while Republicans had a 49 percent chance of winning.With Mills still undeclared, other Democrats such as Graham Platner and Jordan Wood have jumped into the race and have begun traveling across the state to make early inroads with voters.Other than Maine, Democrats view North Carolina, where Democratic former Governor Roy Cooper announced a bid for the seat vacated by retiring GOP Senator Thom Tillis, as a top pickup opportunity in a difficult map. The state backed Trump by about three points last November.Beyond those two states, Democrats are defending seats in Trump-won Michigan and Georgia. They are also eyeing GOP-held seats in double-digit Trump states like Alaska, Iowa, Ohio and Texas. They would need to defend their seats and pick up at least two of the double-digit Trump backers to flip the Senate, where Republicans currently have a 53-47 majority.What People Are SayingMills told Maine Public Radio in July: \"\"I mean, look, I wasn't born with a burning desire to be in Washington, D.C. — any month of the year. And what's going on there is a bit chaotic. It's not something anybody would want to jump into and be a part of automatically.\"NRSC spokesperson Nick Puglia wrote in a statement in June: \"No one fights harder for Maine than Senator Susan Collins. Her ability to pass serious legislation that genuinely improves the lives of Mainers is why she is the only choice to keep fighting for them in the U.S. Senate.\"What Happens NextCollins had not made a formal announcement about her reelection bid, but told CNN in May it is her \"inclination to run\" and that she is \"preparing to do so.\"The Cook Political Report classifies the race as \"Lean Republican,\" meaning it is \"considered competitive,\" but that Collins \"has an advantage.\" Sabato's Crystal Ball also classifies the race as leaning toward Republicans.","summary":"The Democratic governor gave an updated timeline about when she may announce whether she will run for Susan Collins' Senate seat.","url":"https://www.newsweek.com/janet-mills-update-plans-chances-beating-susan-collins-2120969","image":"https://d.newsweek.com/en/full/2711410/maine-governor-janet-mills.jpg?w=1600&h=900&q=88&f=d44b1ca1dd67d61713ec880ad09a02c3","video":null,"publish_date":"2025-08-28 16:49:20","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.125},{"id":355242420,"title":"Trump fans fire back at Gavin Newsom by sending him free merch with a sinister message","text":"California Governor Gavin Newsom revealed that Donald Trump supporters are bombarding him with merchandise all emblazoned with the same message. \n\nLong before his recent jab at the president’s mental acuity this week, Newsom emerged as the Trump administration’s chief troll. \n\nAlong with countering misinformation emanating from the White House and firing back insults from the president in his own sharp style, Newsom had set up an online “Patriot Shop” selling red “REAL PATRIOT” caps and “TRUMP IS NOT HOT” tank tops. \n\nMAGA is now getting its own back. The Democrat revealed on Wednesday at Politico’s Sacramento summit that he received a stack of merchandise seemingly purchased from the Trump Store. \n\n“I have two dozen Trump 2028 hats his folks keep sending me,” Newsom, who is himself viewed as a top contender in the 2028 presidential race, said on stage to host Christopher Cadelago. \n\nNewsom stood firm that he believes Trump would attempt to run for a constitutionally barred third term, claiming that the “guy doesn’t believe in free, fair elections.” \n\n“You think he’s joking about 2028?,” the governor asked the audience, along with highlighting Trump’s plans to build a gilded, 90,000 square foot state ballroom off the East Wing of the White House. \n\n“Who spends $200m on a ballroom at their home and then leaves the house?,” he continued to chuckles from the audience, before urging the seriousness of the situation. “This guy doesn’t believe in free and fair elections. He tried to wreck this country... He tried to light democracy on fire.” \n\nNewsom has previously cautioned that the president wouldn’t relinquish the Oval Office, pointing to the January 6, 2021, riots at the U.S. Capitol, where a MAGA mob tried to overturn Joe Biden’s 2020 election victory after Trump decried election interference. \n\nOn stage in California on Wednesday, Newsom pointed to fresh evidence: a February White House meeting, during which he pressed the administration for federal disaster aid after the Los Angeles wildfires.\n\nIn the meeting, which the governor said lasted 90 minutes, Trump allegedly pointed to a portrait of Franklin D Roosevelt, the only U.S. president to serve more than two terms in office.\n\n“I said, ‘I know exactly what you mean,’” Newsom said. “And then he went on and on about the third term.”\n\nTrump teased finding “methods” to run for a third term earlier this year and began hawking his infamous Trump 2028 hats from his store, before he eventually conceded that he would “probably not” buck constitutional guardrails. \n\nNewsom’s popularity has grown among Democratic voters since his viral Trump trolling, according to a Morning Consult poll published Tuesday. \n\nThe governor’s support among Democrats and Democratic-leaning independents has increased by 8 points, going from 11 percent in June to 19 percent in late August. \n\nFormer Vice President Kamala Harris, who lost to Trump at the ballot box in November, still topped the list at 29 percent support.","summary":"Newsom says that he’s received ‘two dozen’ of the items from the Trump Store","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-newsom-maga-free-merch-b2815945.html","image":"https://static.independent.co.uk/2025/08/14/22/54/GettyImages-2230173576.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/uBFYwPDh-OhrQWqOm.mp4","publish_date":"2025-08-28 15:56:54","author":"James Liddell","authors":["James Liddell"],"language":"en","source_country":"gb","sentiment":-0.343},{"id":355261126,"title":"Newsom Flatly Admits Democrats Have Become The Milquetoast Party","text":"Democratic California Gov. Gavin Newsom conceded Wednesday that his party is facing a “weakness” problem.\n\nNewsom told Politico during an interview at an event in Sacramento, California that the “essence of the challenge to the party is weakness.” The California governor’s comments come amid growing rumors that he is preparing to launch a bid for the presidency in 2028.\n\nNewsom said the Democratic Party’s current struggles were summarized well by former President Bill Clinton after the party was defeated in the 2002 midterms, when Clinton suggested that “uncertain” American voters would choose “strong and wrong” leaders over “weak and right” ones. (RELATED: California Cities Rank Among Dirtiest In America Despite Gavin Newsom’s Green Energy Largesse)\n\n“Our party needs to wake up to that,” Newsom told Politico. \n\nNewsom added that members of his party need to do a better job of proving themselves to Americans.\n\n“We have to use every tool at our disposal to not only assert ourselves, but prove ourselves to the American people,” Newsom said during the interview.\n\nNewsom’s comments come after the Democratic Party’s popularity among Americans has plummeted to historic lows in 2025. Some Democrats have called for their party to return to more center-left politics in the wake of the GOP’s wins in the 2024 election cycle.\n\nDemocrats lost a huge swath of registered voters between the 2020 and 2024 elections, while Republicans gained voters during the same time period.\n\nAnother rumored 2028 presidential hopeful, former Democratic Chicago mayor Rahm Emanuel, said in May that he thinks the party’s current brand is “weak,” “woke” and “toxic.”\n\nSome early polls have shown Newsom leading former Vice President Kamala Harris in a hypothetical 2028 presidential primary battle featuring both California politicians. A UC Berkeley/Los Angeles Times poll released Tuesday found that about 45% of California’s registered voters said they were “very” or “somewhat” enthusiastic about the prospect of a Newsom White House bid, while just 36% said the same about Harris.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Our party needs to wake up to that'","url":"https://dailycaller.com/2025/08/28/gavin-newsom-democratic-party-weakness/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/GettyImages-2231379855-scaled-e1756387453265.jpg","video":null,"publish_date":"2025-08-28 15:43:43","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":355271672,"title":"US Fed governor Lisa Cook sues Trump over attempt to fire her","text":"“This case challenges President Trump’s unprecedented and illegal attempt to remove Governor Cook from her position which, if allowed to occur, would the first of its kind in the Board’s history,” her lawyer, Abbe Lowell, wrote in the suit in Washington federal court.\n\nThe lawsuit is a major escalation of the growing clash between the White House and the Fed, which has resisted Mr Trump’s demands to lower interest rates even as he has repeatedly attacked Fed chair Jerome Powell. The Fed chair has also resisted the president’s demands to resign. In her suit, Ms Cook suggested the attempts to remove both her and Ms Powell are part of an effort to seize control of the Fed.\n\nMs Cook’s filing follows through her vow earlier this week to fight to finish her term that expires in 2038. She asked a judge to immediately issue an order blocking Mr Trump’s effort to remove her and barring the Fed from taking any actions to carry out the president’s demand.\n\nMs Cook requested an emergency hearing on her motion for a temporary order. The case was assigned to US District Judge Jia Cobb, who was appointed by former US president Joe Biden.\n\n“The mortgage allegations against her are pretextual, in order to effectuate her prompt removal and vacate a seat for President Trump to fill and forward his agenda to undermine the independence of the Federal Reserve,” according to the complaint.\n\nAfter the lawsuit was filed, the White House said that Trump was acting lawfully. “The president determined there was cause to remove a governor who was credibly accused of lying in financial documents from a highly sensitive position overseeing financial institutions,” White House spokesman Kush Desai said in a statement. “The removal of a governor for cause improves the Federal Reserve Board’s accountability and credibility for both the markets and American people.” \n\nRepresentatives for Ms Cook’s lawyers and the Fed declined to comment.\n\nIn the complaint, Ms Cook says that a policy dispute doesn’t constitute “cause” for removal, nor does “a specious assertion that a one ‘potentially’ committed a crime — one which is unproven, uncharged, and unrelated to official conduct.” Mr Trump’s claims that there is a reason for removing Ms Cook “does not magically make such a basis grounds for a ‘for cause’ removal,” according to the suit.\n\nRulings in the case in the coming days and weeks could add to investors’ concerns that the president’s efforts will undermine the independence of the central bank — a bedrock assumption of US markets that underpins the nation’s credit ratings.\n\nMs Cook sued days after Mr Trump wrote a letter to her, which he posted on social media, saying that he was removing her immediately in light of her “deceitful and potentially criminal conduct in a financial matter”. Mr Trump’s post followed a claim on social media by US Federal Housing Finance Agency director Bill Pulte that Cook lied on 2021 loan applications for two properties — in Michigan and Georgia — by claiming she would use each property as her primary residence to secure more favourable loan terms. He said the applications were filed two weeks apart.\n\nThe suit says the alleged mortgage fraud occurred before Ms Cook’s Senate confirmation and that she wasn’t given an opportunity to respond to the allegations before Mr Pulte referred the matter for a criminal investigation. Ms Cook hasn’t been charged with wrongdoing.\n\nThe case will likely hinge on whether a judge agrees that Mr Trump has “cause” under US law to fire Ms Cook. Section 10 of the US Federal Reserve Act, the 1913 law that governs the central bank, says members of the Fed’s Board of Governors can be “removed for cause,” although the statute doesn’t specify exactly what “cause” means.\n\nLaws that do describe “for cause” generally define the term as encompassing three possibilities: inefficiency; neglect of duty; and malfeasance, meaning wrongdoing, in office. It’s far from clear that the mortgage allegations against Ms Cook are enough to meet that bar.\n\nIn seeking a temporary restraining order, Ms Cook’s lawyers outlined a potential defence to the fraud allegations relating to mortgages she took in 2021. Both mortgages say that each would be her “principal” residence.\n\nThe potential that she “mislabeled a home’s purpose on a mortgage application well before her board appointment without any allegation of its intentionality or materiality would not be the type of ‘offense’ that would constitute ‘cause,”’ her lawyers wrote.\n\nMr Trump’s move against Cook is the latest in a series of efforts by his administration to increase legal scrutiny of Democratic Party figures, in addition to pressuring the central bank. Similar mortgage fraud claims have been made against California Senator Adam Schiff and New York Attorney General Letitia James, two high-profile critics of the president.\n\nMs Cook became the first black woman to serve on the Fed’s Board of Governors in Washington when she was appointed by President Joe Biden in 2022. During her initial confirmation process, she faced intense scrutiny from Republican lawmakers who accused her of misrepresenting parts of her resume and tried to use that to sink her nomination. She strongly denied the claims and was confirmed on a party-line vote in the Senate, with then-vice president Kamala Harris stepping in to break the 50-50 tie.\n\nMs Cook has expressed worry over inflation and tariffs this year, but also said in early August that the July jobs report was “concerning” and could indicate a potential turning point for the US economy. Her departure would give Mr Trump an opportunity to secure a four-person majority on the seven-member board after another Biden appointee, Adriana Kugler, announced on August 1 that she would vacate her position early. Ms Kugler’s term was set to expire in January. Two other governors, Christopher Waller and Michelle Bowman, were appointed during Trump’s first term.","summary":"Lawsuit is a major escalation of the growing clash between the White House and the Fed","url":"https://www.irishexaminer.com/business/economy/arid-41695487.html","image":"https://www.irishexaminer.com/cms_media/module_img/9520/4760027_4_seoimage1x1_bf09d936711b40d49bd68f0b484543b6.jpg.jpg","video":null,"publish_date":"2025-08-28 15:16:00","author":"Erik Larson, David Voreacos And Zoe Tillman,Irishexaminer.com","authors":["Erik Larson, David Voreacos And Zoe Tillman","Irishexaminer.com"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.415},{"id":355226878,"title":"Marilyn Monroe’s California home faces demolition in battle over landmarks","text":"By John Gittelsohn, Bloomberg\n\nMarilyn Monroe’s last home faces the wrecking ball if its owners get their way this week in a court bid to overturn its designation as a historic landmark.\n\nBrinah Milstein, the daughter of a prominent Cleveland real estate developer, and Roy Bank, a reality TV producer, paid $8.35 million in 2023 for the Brentwood area property where the screen goddess known for Some Like it Hot and Gentlemen Prefer Blondes spent her final six months.\n\nRELATED: Katy Perry testifies that she’s seeking ‘justice’ at trial over $15 million California mansion\n\nShortly after the couple received a demolition permit, preservationists persuaded the city of Los Angeles to designate the house as a historic-cultural monument, sparing it from destruction. Milstein and Bank planned to combine the site with an adjacent lot, their residence since 2016, “to improve the property,” Peter Sheridan, their attorney, said in an email.\n\n“LA has thousands of celebrities who live and die here,” Sheridan said. “Is every house that those good folks lived in a ‘historic monument’? Not in the least.”\n\nCelebrity homes are one of LA’s major tourist attractions, with star-tour buses clogging streets from Hollywood to the Pacific shores. Stopping places in Brentwood include the gates of the manors of Arnold Schwarzenegger, Kamala Harris and Harrison Ford.\n\nFew stars match the allure and tragic glamor of Marilyn Monroe, but the historical value of her former home is dismissed by its current owners.\n\n“There is not a single piece of the house that includes any physical evidence that Ms. Monroe ever spent a day at the house, not a piece of furniture, not a paint chip, not a carpet, nothing,” according to the lawsuit in Los Angeles County Superior Court.\n\nThe suit claims the city unconstitutionally abused its power by conspiring with for-profit tour operators and biased conservationists to deprive the owners’ vested rights.\n\nAttorneys for the city argued they followed proper procedures, including gathering evidence of the property’s significance in the life of a notable historical figure.\n\n“Mere disagreement is not enough to overcome the city’s lawfully-taken action that petitioners opposed at every hearing of the proceedings,” a team led by LA City Attorney Hydee Feldstein Soto wrote in a response to the lawsuit.\n\nMonroe paid $75,000 for the home six months before her death, the first residence she bought on her own after marriages to baseball star Joe DiMaggio and playwright Arthur Miller.\n\nAn inscription in tile near the home’s front door threshold reads Cursum Perficio, Latin for “The Journey Ends Here.” It likely predates Monroe’s purchase, said Heather Goers, a preservationist who prepared a report for the city Cultural Heritage Commission, but adds a poignant note to her death at age 36.\n\n“Marilyn Monroe was quite possibly the most influential female entertainer of the 20th century,” Goers said. “Less than 3% of the 1,300 historic properties in Los Angeles are dedicated to women’s history. If you can’t commemorate the history of Marilyn Monroe, what’s that tell us?”\n\nOriginally built in 1929, the two-bedroom, two-bathroom single-story stucco house was designed in Spanish Hacienda-style by an unknown architect.\n\n“This house is unique and important to telling her story as an artist, celebrity, and iconic figure in Hollywood,” Andrew Salimian, director of advocacy for the Los Angeles Conservancy, a historical preservation group, said in an email. “It’s the only house she owned by herself as a single woman.”\n\nThe property has had 14 owners since Monroe’s death and undergone numerous renovations and additions including a detached recreation room and studio, the lawsuit says. The house, on a cul-de-sac of four properties, is enclosed by a wall and dense foliage and inaccessible to the public, unless they trespass, Sheridan said.\n\n“In this particular case, it’s too little too late,” because the property has been so extensively changed since Monroe died there, Aaron Kirman, chief executive of Christie’s International Real Estate, Southern California, said in an interview. “The city should’ve designated this as a historical site long ago.”\n\nBank and Milstein have suggested saving the structure by relocating it to a more public site, so Monroe devotees can have access. Since the property dispute first made news two years ago, tour groups and fans have swarmed their quiet cul-de-sac, invading their privacy, Milstein said in testimony to the city last year.\n\n“Our children have been buzzed by low-flying drones while playing in the backyard, running inside, crying in fear,” she said, choking back tears.\n\nThe brief period of Monroe’s life at the home is documented on an almost daily basis by her correspondences, checkbook payments and other records, according to Goers’ presentation. In the months she lived there, Monroe won a Golden Globe Award, sang Happy Birthday, Mr. President at a gala for John F. Kennedy, was fired by 20th Century-Fox for missing shooting days on a movie and posed for photographer Bert Stern in what became the basis of his book, The Last Sitting.\n\nSome of the most revealing documents are crime scene photographs taken for the coroner after Monroe’s death by a sleeping pill overdose, showing the house exterior much as it looks today, Goers said.\n\nIn July 1962, Monroe sat for an interview with Life magazine reporter Richard Meryman that was published the week she died. She took pride showing the largely unfurnished home, though she declined to allow photos, saying she didn’t want “everybody to see exactly where I live.” He described a profusion of flowers in the yard and construction underway of a side unit where her friends could stay in privacy.\n\n“She exulted in it,” Meryman wrote. “On a special trip to Mexico she had carefully searched in roadside stands and shops and even factories to find just the right things to put in it. The large items had not arrived — nor was she ever to see them installed. As she led me through the rooms, bare and makeshift, as though someone lived there only temporarily, she described with loving excitement each couch and table and dresser, where it would go and what was special about it.”\n\nMore stories like this are available on bloomberg.com\n\n©2025 Bloomberg L.P.","summary":"Marilyn Monroe’s last home faces the wrecking ball if its owners get their way this week in a court bid to overturn its designation as a historic landmark. ","url":"https://www.mercurynews.com/2025/08/28/marilyn-monroes-home-faces-demolition-in-battle-over-landmarks/","image":"https://www.mercurynews.com/wp-content/uploads/2025/08/mmhome.webp?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-28 14:59:33","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"us","sentiment":0.061},{"id":355201132,"title":"Being funny helps populist politicians create bonds and get voters on board","text":"Humour has become one of the most potent weapons in the populist politician’s playbook. Comedic populists like Donald Trump, Boris Johnson, Nigel Farage and Argentinian president Javier Milei use ridicule, absurdity and sarcasm not just to entertain, but to deflect criticism, confuse opponents and present themselves as relatable outsiders. Their tomfoolery and comedic stunts often dominate headlines and capture attention online. \n\nThese uses of humour have been widely discussed in this context. But one key function of populist humour still receives too little attention: its power to mobilise disaffected voters.\n\nMy own research has examined how humour functions as a means of speaking truth to power. But I now believe that comedy, long mobilised as a subversive tool, is being appropriated by populists as a strategy for building political loyalty.\n\nBeyond softening rhetoric or mocking political opponents, humour helps politicians create emotional bonds, build group identity and energise voters who feel let down by traditional politics and politicians. It isn’t just comic relief – it’s a call to action. \n\nThe appeal of comedic populists is often invisible to their critics. Dislike and distaste can blind people to the way these figures connect with large audiences – especially disaffected voters. This blind spot prevents understanding how humour fuels political support.\n\nTake this New York Times guest essay from August 2024, titled Trump is losing the humor war. While it concedes that “Donald Trump is funny”, it argues his humour had lost its edge. That assessment was premature.\n\nThroughout the 2024 campaign, Trump remained humorous – from working in a McDonald’s drive-through, to driving around as a bin man at a rally to mock Joe Biden, he deployed several humorous stunts to amplify his message and entertain supporters. \n\nThese stunts gained widespread coverage and went viral on platforms like TikTok – where, according to Pew Research, nearly half of US users under 30 now follow political news. Humour, in this context, becomes both strategy and spectacle.\n\nTrump recognises this. On one Joe Rogan podcast – viewed over 60 million times – Rogan praises Trump’s comedic instincts. Trump replies: “You need at least the attitude of a comedian when you’re doing this business”. Considering Trump and other comedic populists’ success in the previous decade, it’s hard to disagree.\n\nWho is mobilised by humour?\n\nPopulist humour resonates most strongly with disaffected voters – people who feel ignored or betrayed by traditional politics – and research shows that disenfranchised voters often vote for radically different candidates. In an era of declining trust in political institutions in many western nations, it’s unsurprising that voters should turn to political alternatives who break the conventional mould. \n\nSome of these figures were comedians before they were politicians. Others cultivated humorous personas over time. Many have successfully capitalised on this situation. The best known is Ukraine’s Volodymyr Zelenskyy a former comedian who once played a fictional president on Ukrainian TV.\n\nOther former comedians who have gone on to win national or regional office include Guatemala’s Jimmy Morales, Slovenia’s Marjan Šarec, and Iceland’s Jón Gnarr. Italy’s Beppe Grillo, a stand-up comic, co-founded the Five Star Movement which went on to enter government, though Grillo himself never held elected office.\n\nBoris Johnson, Donald Trump, and Javier Milei all cultivated entertaining personalities through TV appearances and a variety of stunts. A consistent pattern emerges: these leaders tend to rise in contexts of low political trust, where their humour grabs attention and appeals to disaffected voters. \n\nBut another trend is equally clear: the sustainability of support for comedic populism often diminishes once in office. The performative and oppositional strengths that fuel electoral success often translate poorly into the demands of serious governance. \n\nZelenskyy appears to be an exception, although recent legislation threatens his approval ratings. Nevertheless, he remains popular due to the Russian invasion, and his shift from comic performer to a serious leader of resolve and emotional authenticity.\n\nPopulist humour in the media\n\nPopulist humour thrives on public attention. Social media rewards wit over substance; jokes, memes and soundbites travel fast. In a media environment driven by anger, disinformation and tribalism, comedy is a perfect vehicle of delivery. Humour creates sharable content, frames opponents as humourless and signals in-group identity. \n\nA striking example came during Trump’s 2024 presidential campaign when he claimed that Haitian migrants were eating pets in a town in Ohio. The statement, though baseless and inflammatory, went viral. Critics expressed outrage, supporters laughed, and Kamala Harris scoffed at the absurdity. Yet, the allegation provided an effective means of communicating anti-migrant, racist rhetoric across news outlets and social media platforms.\n\nIt even inspired a parody song called Eating the Cats ft. Donald Trump, by the South African musician The Kiffness, which has racked up millions of views across social media. \n\nThis is the paradox of populist humour: it doesn’t need to be factual, tasteful or substantive. It just needs to resonate with its intended audience and spread across media platforms.\n\nIf we want to understand modern populism, we need to take its humour seriously. It’s not a distraction from politics; it’s a vital tool in the populist toolkit. Humour builds community, projects authenticity and drives participation and feelings of inclusion. For disaffected voters, it offers something traditional politics often doesn’t: a reason to laugh, and a reason to listen.","summary":"Humour helps politicians create emotional connections and energise voters who feel let down by traditional politics.","url":"https://theconversation.com/being-funny-helps-populist-politicians-create-bonds-and-get-voters-on-board-260343","image":"https://images.theconversation.com/files/686927/original/file-20250822-56-dybf9d.jpg?ixlib=rb-4.1.0&rect=0%2C519%2C6928%2C3464&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-08-28 12:00:54","author":"Adam R. North,Early Career Researcher,Religions and Theology Department,University of Manchester","authors":["Adam R. North","Early Career Researcher","Religions and Theology Department","University of Manchester"],"language":"en","category":"politics","source_country":"AU","sentiment":0.142},{"id":355147642,"title":"Taylor Swift and Donald Trump are the same","text":"When Donald Trump called Taylor Swift a “terrific person” this week, following the news of her engagement to NFL player Travis Kelce, it was not a gesture of reconciliation but of recognition. The President, who in May last year posted “I HATE TAYLOR SWIFT” on Truth Social and derided her as a “woke singer,” is not known for revising his opinions.\n\nHis turn tells us less about Trump and more about Swift, who has, with startling efficiency, recast herself into a figure even the President can admire. She is playing the same game that he mastered.\n\nTaylor’s management strategy has grown with the times. The things that usually define a pop star’s fame have become meaningless for the her: she hasn’t done an interview with the mainstream media in two years; she avoided all journalists throughout the Eras tour. She has evolved past the need for traditional channels. Trump has the same impulses, and similar circumstances. He invented his own social media platform rather than answer to the rules or owners of any existing ones. New York Times interviews are for Kamala Harris – not for Trump or Taylor.\n\nThe Trump camp might have learned a thing or two from the sharp tactics of Swift’s publicist, Tree Paine, who has won enough reflective fame to have her own dedicated fanbase. Paine would have had her hand in Swift’s appearance on Kelce’s New Heights podcast, where she announced her new album. It was her Joe Rogan moment; a pivotal turn towards the MAGA-coded podcast bros that have come to define Trump’s America. (Trump’s appearance on Rogan still beats Taylor’s appearance on New Heights, 59 million YouTube views to 21 million). That Kelce chose the day after the engagement to announce a partnership with American Eagle, the clothing brand in hot water over their controversial Sydney Sweeney ad, only further clarifies the ideological terrain Swift is orienting herself towards: one shaped by conservatism and mainstream cultural dominance.\n\nBut the “Swiftonomics” of her brand already resembled “Trumponomics”. Both saturate the media without engaging with it. Both trade in the idea of individual destiny shaped by genius. They make their followers feel like insiders to something historic. And both, crucially, are treated less like celebrities and more like movements.\n\nTrump’s brand is inseparable from his pageantry. This was nowhere clearer than his Miss Universe pageants, which promised that sexuality, when properly packaged and judged, could be a legitimate path to power. Swift’s earlier image resisted this particular fusion. Her girl-next-door innocence, carefully preserved throughout her country debut and early pop records, served the conservative structures of Nashville. And then she pivoted, keeping up to date with the Buzzfeed liberalism of the 2010s and the attendant mainstream ideals of millennial white feminism. The styling of 1989 (2014) was sleek, cosmopolitan, girl power incarnate. And, curiously, sexless.\n\nBut when she held up her new album cover, The Life of a Showgirl, during her appearance on New Heights, and Kelce clapped in frame, it was clear something had changed. Gone was the lib-ambivalence; her sexuality was no longer coded or abstracted, but front and centre. Swift of 1989 (an aesthetic era marked by a refusal to ever expose her belly button) was gone; Swift of folklore (her 2020 pivot to baggy linen dresses and big tartan coats) nowhere to be seen. This is Swift as a showgirl – legs, decolletage and, yes, belly button on show.\n\nHer impending marriage to Kelce might act as a shield for now, girding her “good girl” image even as her performances lean further into eroticism. Like the Miss Universe contestants, she can be desirable now she’s domesticated, a consumable fantasy with patriotic sparkle.\n\nThere’s also the matter of Kelce himself, a walking PR miracle. Years before he even appeared on Swift’s radar, he’d hired a publicity team who planned to make him “as famous as the Rock”. Even the most devoted Swiftie might easily wonder whether their courtship was organic or something shadier. However genuine their romance, it is also a marriage of cosmic brand convenience. Kelce offers Swift a masculine inroad to the demographic, perhaps the last one, that has remained immune to her charms: beer-drinking, NFL-watching American men. She, in turn, elevates him into the billionaire class. It is not marriage for love nor money but for power, or perhaps its more elusive cousin: reach.\n\nThe opening line of Trump’s guide to business is a statement of his motivating force: “I don’t do it for the money. I’ve got enough, much more than I’ll ever need. I do it to do it.” It’s Swiftian poetry really. She performs not because she must, but because she can, and because we keep watching. Like Trump, Swift understands that the game isn’t won with subtlety or talent, it’s about volume. Her marriage to Kelce will amplify her. Trump’s grudging praise is less an endorsement than a recognition of a shared instinct to play the game, to be “The Man”. The question then is no longer who Taylor Swift is but what she represents. And now, she represents totality: a figure who transcends ideology, genre and even sincerity. She doesn’t speak to the moment; she engulfs it, just like Trump. They aren’t just playing the game, they have become the game, and made it impossible to imagine anything outside it.\n\n[See more: Taylor Swift’s triumphant incoherence]","summary":"Reach, power, mythos and with no need for traditional media – the two blondes have it all.","url":"https://www.newstatesman.com/politics/media/2025/08/taylor-swift-and-donald-trump-are-the-same","image":"https://dl6pgk4f88hky.cloudfront.net/2025/08/28/GettyImages-2196122888.jpg","video":null,"publish_date":"2025-08-28 11:20:52","author":"Lily Isaacs","authors":["Lily Isaacs"],"language":"en","category":"politics","source_country":"gb","sentiment":0.011},{"id":355148898,"title":"Gunman who opened fire on Catholic school Mass identified and more top headlines","text":"Good morning and welcome to Fox News’ morning newsletter, Fox News First. And here's what you need to know to start your day ... TOP 3 1. Gunman who opened fire on Catholic school Mass identified 2. Governor warns Trump of 'response' if Trump deploys troops to Chicago 3. CDC director refuses to leave post after Trump admin announces her removal MAJOR HEADLINES BORDER BATTLE ABROAD – American tourist wounded in Germany condemns Europe’s ‘immigration problem.’ Continue reading … TONE DEAF – Former Biden official faces backlash for attacking prayer after kids gunned down at Mass. Continue reading … VISA OVERHAUL – Trump moves to end 'forever students' as foreign visa holders face new time limits. Continue reading … HERO'S FINAL MISSION – Army sergeant who helped thousands of wounded warriors passes away at 40. Continue reading … ROLL BACK – Cracker Barrel takes down pride website after pressure from activists. Continue reading … -- POLITICS CONTINENTAL SHIFT – Trump's bold Africa play could push back on China, Russia and Islamic terrorists. Continue reading … FUNDING SHOWDOWN – Biden-appointed judge orders Trump to pay billions as legal battle heats up. Continue reading … UNION PUSH BACK – Striking workers demand company block federal agents from entering without warrant. Continue reading … ‘SHAME!’ – Protesters drown out Collins as Democrat challenger gains traction. Continue reading … Click here for more cartoons… MEDIA TOTAL 180 – DC mayor changes tune, credits Trump's crackdown for sharp drop in city crime. Continue reading … SAFETY FIRST – Trump has 'upper hand' on Democrats in crime debate, MSNBC guest admits. Continue reading … PRESIDENTIAL PUPPET – Democratic senator admits he was 'naive' about Biden, says staff controlled him. Continue reading … CASH CRISIS – Kamala Harris fundraising events have reportedly been a flop to help raise money for DNC. Continue reading … OPINION HUGH HEWITT – Morning Glory: President Trump and the Posse Comitatus Act. Continue reading … CLAY TRAVIS – NFL end zones go woke but something else belongs there instead. Continue reading … -- IN OTHER NEWS SHOWSTOPPER – Country star walks off stage after fans cross the line at concert. Continue reading … UNEXPECTED RELIEF – Weight-loss drugs could reduce symptoms of painful skin condition. Continue reading … AMERICAN CULTURE QUIZ – Test yourself on melon meccas and revolutionary roots. Take the quiz here … STONE SECRET – 'Very unusual' ancient head with eerie smile unearthed by archaeology student. Continue reading … HIGH RISK – FDA approves new COVID shot for one group only. See video … WATCH SCOTT BROWN – The Democratic Party is just an anti-Trump movement. See video … SAGE STEELE – While the Left blames guns, let's focus on this. See video … LISTEN Tune in to the FOX NEWS RUNDOWN PODCAST for today's in-depth reporting on the news that impacts you. Check it out ... FOX WEATHER What’s it looking like in your neighborhood? Continue reading… FOLLOW FOX NEWS ON SOCIAL MEDIA Facebook Instagram YouTube Twitter LinkedIn SIGN UP FOR OUR NEWSLETTERS Fox News First Fox News Opinion Fox News Lifestyle Fox News Entertainment (FOX411) Fox News Sports Huddle DOWNLOAD OUR APPS Fox News Fox Business Fox Weather Fox Sports Tubi WATCH FOX NEWS ONLINE Fox News Go Thank you for making us your first choice in the morning! We’ll see you in your inbox first thing Friday.","summary":"Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.","url":"https://www.foxnews.com/us/gunman-who-opened-fire-catholic-school-mass-identified-more-top-headlines","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/school-shooting-minneapolis-fox-news-132.jpg","video":null,"publish_date":"2025-08-28 11:19:21","author":null,"language":"en","source_country":"us","sentiment":0.183},{"id":355154284,"title":"Lewis: Newsom’s knives-out memes show plausible strategy against Trump","text":"Just when you thought it was safe to go back on TikTok, viral Gavin Newsom memes are taking over social media.\n\nThere’s Newsom Photoshopped into a classic black-and-white Calvin Klein ad (faux ripped abs and all). Newsom on the cover of a pretend romance novel (Fabio “bodice ripper” vibes abound). Newsom in a T-shirt declaring, “This is my real hair” (an unsubtle jab at President Trump). And my personal favorite: an AI-generated image of Hulk Hogan, Kid Rock and Tucker Carlson praying over him.\n\nThe most audacious? A parody of Trump’s iconic post-assassination-attempt photo — except Newsom isn’t raising a fist. He’s holding a bottle of ketchup (presumably referencing fake blood).\n\nThen there’s Newsom sipping from a mug labeled “MAGA Tears.” Newsom as Superman. Newsom as Mel Gibson in “The Patriot.” Newsom with Jesus behind him, hands on his shoulders.\n\nUnseemly? Yes. Effective? Probably.\n\nWe’d like to think we’re too sophisticated to fall for this nonsense. But memes work because they bypass the rational brain and target our subconscious. See someone enough times in a cape, glowing halo overhead and American flags flying, all while mounting a lion — and eventually part of you absorbs the message: This person is larger than life.\n\nAnd here’s the genius part: There’s plausible deniability for the purveyor. Memes are propaganda posing as parody. They can always be brushed off as a joke. You get to inject iconography into the bloodstream (either for your candidate or against your opposition), and then shrug and say you’re just trolling, lol. In the case of Newsom, this is doubly so, since his memes are parodies, illustrating the absurdity of Trump’s.\n\nFor years, Trump monopolized this childish, if devious, game. That’s partly because it takes considerable audacity to promote an image of yourself as a ripped Marvel superhero (or as the pope) when you’re visibly … not.\n\nAbsurd but effective\n\nBut shamelessness is Trump’s superpower.\n\nNow Newsom wants in.\n\nHe’s borrowing the Trump playbook: daring federal officials to “ arrest me,” vowing to “ fight like hell” against the Trump administration’s efforts to extract $1 billion from UCLA and even slapping a Trump-style title on a bill (the “Election Rigging Response Act”) to counter Texas’ attempt to create five new Republican congressional seats.\n\nAnd now, with his press shop blasting ALL CAPS taunts (“DONALD IS FINISHED — HE IS NO LONGER ‘HOT’ ”) and the proliferation of these viral images, Newsom has fully joined the Trump meme wars.\n\nSometimes the trolling is clever — like pasting JD Vance’s face on an Australian breakdancer (Newsom’s punny nickname for the veep is “Just Dance Vance”). Other times it’s a bit cruel — like retweeting a picture of a suave, young Newsom juxtaposed with an awkward teenage Vance.\n\nEither way, the point lands the same. Newsom is taller, cooler and better looking. And he has better hair than Trump or Vance ever will. Once upon a time, we might have expected such gloating to backfire and repel Joe and Jane Sixpack. But in the Trump era of flashy braggadocio and chest-thumping one-upmanship, Newsom is fighting fire with fire.\n\nIn this bizarre new Trumpian phase of American politics, California’s governor isn’t sitting back. He’s hitting back. He’s fighting on Trump’s turf (TikTok, X, Bluesky and Instagram) and in the same meme economy.\n\nActually plausible\n\nAnd it just might work. Remember the 2016 primary? Republican voters skipped over the “serious” candidates and went with Trump, largely because “he fights.”\n\nTo be sure, Democrats are not Republicans. Their base has different priorities. But don’t rule out the possibility that toughness — and a willingness to throw elbows online — could resonate with voters who watched Trump roll over Kamala Harris.\n\nNow, none of this means Newsom is destined to be the Democratic nominee. He comes across as a little too slick, a little too ambitious — think Ted Cruz. His governing record is hardly a selling point, especially at a time when the cost of living has become a top national concern. And let’s be honest: Winning elections in one of the bluest states in the union isn’t exactly a résumé that screams “broad appeal.”\n\nThis brings us to the California problem.\n\nHarris, the Democratic nominee in the last cycle, hails from the Golden State, and Democrats may think twice before doubling down with another “left coast” liberal. Add to that Newsom’s stint as mayor of San Francisco — a city conservatives love to hold up as a cautionary tale — and you can see why some strategists might think he’s radioactive in the swing state suburbs.\n\nStill, politics today is less about political accomplishments and more about combat skills. In a perpetual cage match, Democrats may decide that Newsom’s sharp elbows, media savvy and willingness to mix it up make him their best bet in 2028. In short, his saving grace may be this: He fights!\n\nMatt K. Lewis is the author of “ Filthy Rich Politicians” and “ Too Dumb to Fail.” ©2025 Los Angeles Times. Distributed by Tribune Content Agency.","summary":"Politics today is about combat skills not accomplishments. Democrats may decide the California governor's sharp elbows make him their best bet.","url":"https://www.mercurynews.com/2025/08/28/lewis-newsoms-knives-out-memes-show-plausible-strategy-against-trump/","image":"https://www.mercurynews.com/wp-content/uploads/2025/08/SJM-Z-OPED-LEWIS-0828-3.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-28 10:15:04","author":"Matt K. Lewis","authors":["Matt K. Lewis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.211},{"id":355127604,"title":"EXCLUSIVE: Hunter Biden's Plan to Take Down George Clooney – Joe Biden's Disgraced Son 'Digging Up Dirt' to Launch More Attacks on Hollywood Actor for Turning His Back on Ex-Prez","text":"Former first son Hunter Biden has torn into George Clooney in a rambling, hate-filled interview, and RadarOnline.com can reveal he's plotting to double down with more attacks, which has the Hollywood superstar worried about which secrets may come to light.\n\nHunter, 55, took offense when Clooney, 64, called upon his dad to drop out of the 2024 presidential race in a New York Times op-ed piece titled, I Love Joe Biden. But We Need a New Nominee.\n\nIn it, Clooney questioned Joe's ability to win and govern for a second term, claiming he was not the same Joe anymore because of cognitive decline, which was on full display in the then-president's televised debate with Donald Trump.George's Involvement In Joe Stepping DownJoe finally did drop out of the race, leaving then-Vice President Kamala Harris to lose to Trump.\n\nIn an angry, expletive-filled interview, Hunter said Clooney \"attempted to cut the knees out from a sitting president.\"\n\nHe went on to rage: \"Why do I have to ... listen to you?\"\n\n\"Hunter considers George a misinformed interloper who kicked Joe while he was down and sabotaged the Democratic Party,\" reveals an insider. \n\n\"He feels the world would be a better place if Joe was in office, and he's saying George wrecked everything. \n\n\"Now he's planning on delving deep into George's history and shining a light on anything that looks remotely suspicious – from past relationships to business practices and even his marriage to Amal [Clooney].\"Hunter Is Looking For 'Skeletons' In George's Closet\"Everyone has skeletons in the closet, especially a Playboy turned political bigmouth!\"\n\nClooney admitted in 2012 his sketchy past prevents him from running for political office: \"I didn't live my life in the right way for politics, you know ... I f----- too many chicks and did too many drugs.\"\n\nHowever, sources said Hunter intends to keep digging for dirt.\n\n\"George is nervous about what Hunter could spill, and he should be,\" said a source. \"If any story that's remotely unsavory gets out, he'll have a hot mess on his hands.\"Still, insiders said the Oscar winner will not stand down to a former drug addict.\n\n\"George doesn't take kindly to being lectured by someone who's known to be a trainwreck,\" claimed the source.","summary":"Hunter Biden's plan to take down George Clooney includes digging up dirt and launching more attacks.","url":"https://radaronline.com/p/hunter-biden-plan-take-down-george-clooney-dirt-attacks/","image":"https://media.radaronline.com/brand-img/cjJOf2ewJ/0x0/hunter-biden-plan-take-down-george-clooney-dirt-attacks-1755518529383.jpg","video":null,"publish_date":"2025-08-28 10:00:00","author":"Aaron Johnson","authors":["Aaron Johnson"],"language":"en","source_country":"us","sentiment":-0.141},{"id":355153778,"title":"Politicians keep using songs on social media. What if an artist doesn't like it?","text":"It became the inescapable soundtrack of the summer: the uplifting melody of Jess Glynne's 2015 dance-pop hit \"Hold My Hand,\" followed by a chirpy voice declaring that nothing beats a Jet2 holiday.\n\nOver the last few months, the British travel agency's advertisement has become a viral TikTok sound, serving as the ironic backdrop for millions of things-gone-terribly-wrong style disaster videos. The clips range from rainwater flooding the New York City subway to elephants attacking tourists in Thailand. A decade after its release, Glynne's song has found a new life as a meme meant to capture a universal feeling of chaos and unruliness despite all good intentions.\n\nIn July, the White House joined the trend, posting a video of the viral sound synced to footage of handcuffed men being escorted onto a plane. \"When ICE books you a one-way Jet2 holiday to deportation. ✈️🎶,\" reads the caption. \"Nothing beats it!\"\n\nThe backlash was swift. Within days, both Glynne and voice actress Zoe Lister, who narrates the advertisement, condemned the White House's video. \"This post honestly makes me sick,\" Glynne wrote on social media. Representatives for Glynne did not respond to NPR's request for comment. Since then, the Jet2 audio has been disabled from the White House's Instagram post, though it remains active on X. Having a song go viral is usually good news for an artist, but as politicians become more social media savvy and jump in on viral trends, how can musicians respond if they don't like the way a party or administration uses their song online?\n\nMusic and politics have changed \n\nThe relationship between music and politics goes back to the early days of American democracy. When George Washington was running for office, his supporters changed the lyrics of popular songs into campaign jingles. Dozens of candidates have relied on songs at rallies and in television advertisements, both of which tend to require special licenses for usage. But Jennifer Jenkins, a professor at Duke University specializing in intellectual property law and cultural production, says politics and music have changed a lot in the 21st century. Both, she says, have become increasingly commercialized.\n\nWhereas Franklin Delano Roosevelt used \"Happy Days Are Here Again\" to promote a message of hope and unity during the Great Depression, Jenkins says today's song usage by politicians tends to be less straightforward — especially on social media.\n\n\"That's a very different message than now, when a politician is using music in connection with consultants to build their brand and to cultivate a particular image,\" Jenkins says. \"[Musicians] themselves are also brands and they don't want to see themselves connected with something that they find objectionable, offensive, abhorrent.\"\n\nIn many European countries, authors' rights include not only financial protections for the reproduction of their work, but also \"moral rights.\" In France, for example, moral rights are perpetual and allow musicians the right to object to modifications that challenge the integrity of their work. In the U.S., copyright law operates primarily within an economic framework. The question is more about when musicians should be paid for their work than whether or not their values align with said usage.\n\nCopyright infringement and fair use\n\nIf a politician uses a song without permission, the first step artists can take is to request that the post be taken down, says Jenkins. Under the Digital Millennium Copyright Act (DMCA), social media platforms are obligated to remove content infringing on copyright — though there are exceptions for fair use on a case-by-case basis, such as for criticism or educational purposes.\n\n\"Just like the First Amendment, fair use doesn't just protect speech that we like,\" says Jenkins. \"One of the key things about fair use is that we don't get to make rules that only favor commentary that we like or commentary that aligns with our political values. The law is supposed to be agnostic about the particular commentary.\"\n\nIn July, the Department of Homeland Security posted a video on Instagram of Homeland Security Director Kristi Noem on an aerial patrol with Customs and Border Protection agents. The clip included text of a Bible scripture and featured Black Rebel Motorcycle Club's cover of the folk song \"God's Gonna Cut You Down\" playing in the background. Within days, the rock band responded with their own post.\n\n\"It's obvious that you don't respect Copyright Law and Artist Rights any more than you respect Habeas Corpus and Due Process rights, not to mention the separation of Church and State per the US Constitution,\" BRMC wrote. \"For the record, we hereby order @dhsgov to cease and desist the use of our recording and demand that you immediately pull down your video.\"\n\nThe audio has since been disabled on the DHS Instagram post. Jenkins says cease and desist letters are often one of the first avenues to address unauthorized song usage on social media — but if the offending party doesn't comply, artists may have grounds for further legal action.\n\nIn 2020, singer Eddy Grant filed a copyright lawsuit against Donald Trump for sharing a video on X that included his song \"Electric Avenue.\" The animated clip featured a \"Trump-Pence 2020\" train speeding past a slow-moving trolley being hand-pumped by Joe Biden. Trump's attorneys tried to argue the video qualified for \"transformative\" fair use, suggesting it significantly altered the meaning of the original song. But Judge John Koeltl rejected the fair use claim, saying \"Electric Avenue\" did not play a major role in the video's satirical message. Trump and Grant settled the lawsuit last year for an undisclosed amount.\n\nLicensing on social media \n\nIf an artist doesn't own the copyright to their song — or if the song is used via properly licensed channels — their options are more limited. Platforms like Meta and TikTok often reach agreements with rightsholders in order to curate music libraries of already-licensed songs for personal use. On Instagram, commercial accounts must use Meta's Sound Collection, which includes thousands of royalty-free songs. On TikTok, business and creator accounts can access the Commercial Music Library for any songs and sounds they'd like to play over ads or branded content. But TikTok places additional restrictions on government, politician and political party accounts, often requiring them to obtain permission from the original copyright holder. (TikTok's copyright infringement policy also encourages rightsholders to try to resolve the matter directly with the user before filing a DMCA compliant notification).\n\nLegal recourse in these cases is trickier. Jeanne Fromer, a professor of intellectual property law at New York University, says musicians often resort to the court of public opinion.\n\n\"Sometimes just bringing this up will shame a politician to stop using it,\" Fromer says. \"They won't want the negative press associated with it, or that the musician doesn't support them.\"\n\nLast year, the official Team Trump TikTok account celebrated Trump's election victory with a photo carousel soundtracked by Olivia Rodrigo's song \"deja vu,\" which TikTok users can use via the Commercial Music Library. Rodrigo, who had endorsed Kamala Harris, allegedly commented on the post and temporarily removed the song from the platform following Trump's usage. (At the time of publication, the song \"deja vu\" is available on TikTok and remains on the Team Trump post, and neither TikTok or representatives for Rodrigo responded to NPR's requests for comment.)\n\nRegardless of what actually transpired, fans quickly praised Rodrigo for the alleged comment. Jenkins and Fromer say oftentimes, an artist's public image can benefit simply from taking a stance against the politician's usage. But in the case of Jess Glynne and the Jet2 advertisement, the meme of it all makes the copyright applications more complicated.\n\nMemes fundamentally turn copyright law on its head, says Fromer; instead of trying to prevent unauthorized copies, the entire point is to decentralize the original creator and repeat the format with as many new applications as possible. Under the law, memes could potentially make an argument for \"transformative\" fair use, and they also make selective enforcement against politicians more challenging.\n\n\"It's the currency of the way we talk now,\" Fromer says. \"If you're the only one excluded from that currency, that feels really hard in terms of speech. So there are weighty interests on both sides.\"","summary":"Having a song go viral is usually good news for an artist. But as politicians become more social media savvy and jump in on viral trends, how can musicians respond if they don't like the way a party or administration uses their song?","url":"https://www.npr.org/2025/08/28/nx-s1-5506215/politicians-using-music-memes-issues","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5400x3037+0+0/resize/5400x3037!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F20%2Fbb%2Fe4ffe68e42a1ad4c2e90e64e9cc7%2Fcomposite.jpg","video":null,"publish_date":"2025-08-28 09:00:00","author":"Isabella Gomez Sarmiento","authors":["Isabella Gomez Sarmiento"],"language":"en","category":"politics","source_country":"us","sentiment":0.26},{"id":355097964,"title":"Dwayne 'The Rock' Johnson Leads Kamala Harris as 2028 Democratic Presidential Hopeful on Polymarket","text":"Dwayne \"The Rock\" Johnson, the WWE wrestler-turned-actor, has surpassed former U.S. Vice President Kamala Harris as the leading Democratic contender for the 2028 presidential race on the decentralized betting platform Polymarket.\n\nAs of now, shares betting \"yes\" on Johnson's victory are trading at 7 cents, implying a 7% chance of the multi-millionaire actor winning the nomination. This places him fourth in the race, behind Gavin Newsom, Alexandria Ocasio-Cortez, and Pete Buttigieg.\n\nMeanwhile, traders priced in a 5% probability of Harris winning the bid, placing her in the 5th spot alongside Andy Beshear. Traders also see 1% chance of Tim Waltz, Michelle Obama and Mark Cuban emerging victorious.\n\nPolymarket is a decentralized prediction market platform that enables users to speculate on the outcome of real-world events, such as elections and asset price movements, by trading shares representing different outcomes.\n\nThe betting platform announced Tuesday that it has secured an investment from venture capital firm 1789 Capital and Donald Trump Jr, son of the U.S. President, as a member of its advisory board.\n\nI was asked to run for President\n\nIn 2023, Johnson disclosed that multiple parties approached him too see if he would run for U.S. President after a poll showed that 46% of Americans would support his run in the White House.\n\n\"That was an interesting poll that happened and I was really moved by that,\" Johnson said. \"I was really blown away and I was really honored. I'll share this little bit with you: at the end of the year in 2022, I got a visit from the parties asking me if I was going to run, and if I could run,\" Johnson said on Trevor Noah's new Spotify podcast, What Now?\n\nThe Rock, who has described himself as a centrist and political independent, endorsed Joe Biden in the lead-up to the 2020 election but refused to do the same last year.\n\nThe actor is not only a Hollywood superstar but also a social media marketing powerhouse, boasting 392 million followers on Instagram. His pro-wrestling career showcased unmatched \"promo skills,\" which could come in handy if he decides to pursue a political campaign.\n\nRead more: Donald Trump Jr.'s 1789 Capital Takes Stake in Prediction Market Polymarket","summary":"Traders on Polymarket see a 7% chance of Johnson winning the bid.","url":"https://www.coindesk.com/markets/2025/08/28/dwayne-the-rock-johnson-leads-kamala-harris-as-2028-democratic-presidential-hopeful-on-polymarket","image":"https://cdn.sanity.io/images/s3y3vcno/production/1f878f031d6a56fc360f212f367fa1e4fd7f0c5b-3772x2515.jpg?auto=format","video":null,"publish_date":"2025-08-28 07:33:31","author":"Ai Boost,Omkar Godbole","authors":["Ai Boost","Omkar Godbole"],"language":"en","category":"politics","source_country":"in","sentiment":0.507},{"id":355059740,"title":"How the Trump-Modi friendship came undone in five episodes","text":"ReutersTrump meets with Modi at the White House in Washington, D.C., (February 13, 2025 photo).\n\nThe friendship between US President Donald Trump and Indian Prime Minister Narendra Modi - dubbed a bromance by the media - began to come unstuck late in Trump's first term, and continued to fray despite efforts to rekindle it in the US president's second term, according to multiple accounts from White House insiders and current and former officials and diplomats pieced together by TOI. There has been no official confirmation of the reports from either the Indian or the American side.Officials who served in the White House during Trump 1.0 traced mutual misgivings to July 22, 2019, when the US president, a novice in issues relating to the subcontinent, told Pakistan's then Prime Minister Imran Khan during his visit to the White House that he was willing to mediate in the Kashmir issue if both countries agreed, claiming that Modi had asked him to play a role. The remark shocked New Delhi, which said there was no such request from Modi in keeping with India's long-held stand that it is a bilateral issue that brooks no third-party mediation.According to White House insiders, Trump's flub came despite a 45-minute briefing by senior officials well-versed in the region in which they explained the intricacies - for which he apparently had no bandwidth. His mediation offer could also have been based on a misunderstanding of a private phone conversation with Modi in which the Indian PM may have suggested he temper Pakistan's approach to the issue. In either case, Trump was nonplussed why anyone would reject his offer for mediation, the sources said.A rousing visit to India for the Namaste Trump rally, just days before the Covid shutdown, papered over this glitch. The second snafu came in Sept 2024 when Modi was visiting the US to attend the UN General Assembly and the Quad summit hosted by President Biden. Indian interlocutors reached out to Trump, who was campaigning for a second term, to set up a meeting, while also reaching out to his rival Kamala Harris. While Trump readily agreed to see the Indian PM and even announced at a campaign event in Michigan that he was meeting Modi, Harris' campaign balked.The Indian side backed out of the Trump meeting since it did not want to meet only one candidate. This did not go down well with Trump, since he had already announced he was meeting Modi.Live EventsStill, the two principals appeared to have overcome the wrinkles when Modi became one of the first foreign leaders to meet Trump in the White House after he won a second term, the US president hosting him for a working visit on Feb 13 this year. But by this time Trump had worked himself into a rage over the tariff issue, not just at India (although he had begun to call it the tariff king), but the world at large. Although officials from both sides put together a grand COMPACT (\"Catalysing Opportunities for Military Partnership, Accelerated Commerce & Technology) for the 21st Century\"), Trump had little bandwidth for pages and pages of factsheets and joint statements loaded with Modi's favoured acronyms. He wanted headline-making big ticket announcements. He got little for his MAGA faithful beyond projections and promises on the trade front. Moreover, when Trump spoke of MAGA, Modi responded that it could co-exist with his own idea of MIGA, aka Viksit Bharat. And then there was the small matter of Elon Musk calling on Modi at Blair House before the Oval Office meeting. By then Trump had begun to sour on Tesla and Apple's plans in India.The fourth episode came during the four-day India-Pakistan conflict, which Trump fervently believes he brought to an end. While New Delhi says there was no phone conversation between Trump and Modi during the clash, in the US president's mind he got Vance to make the call (after possibly failing to reach Modi). Modi himself has said he missed several calls from Vance before he could be reached.Trump's latest comments - sketchy and disjointed - suggests he talked the Pakistani leadership (not clear who) and warned them they would not get a trade deal if they did not stop the fighting. India says it only responded to the Pakistani overtures for a truce, which New Delhi agreed to. Repudiating his role in dousing a war that he believes would have gone nuclear has clearly miffed Trump, who has been fairly transparent in his quest for a Nobel Peace Prize.The final straw came when Modi declined Trump's invitation to stop by at the White House, on his way back from the G-7 in Canada, on the same day the US president had invited Pakistan's de facto military ruler Asim Munir. The Indian side feared a photo-op ambush. By this time, bilateral negotiations on trade were drawing to a conclusion with negotiating teams from both sides so close to a deal that top US officials said it was imminent. But peeved over what he possibly saw as multiple slights, Trump torpedoed it, using India's Russian oil purchase as a ruse.(TOI correspondent from Washington)(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump Modi bromanceUS India relationsKashmir mediation TrumpTrump Modi relationshipModi Trump White House meetingIndia Pakistan conflict TrumpTrump Modi trade negotiationsMAGA and MIGATrump tariff kingElon Musk Modi meeting\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump Modi bromanceUS India relationsKashmir mediation TrumpTrump Modi relationshipModi Trump White House meetingIndia Pakistan conflict TrumpTrump Modi trade negotiationsMAGA and MIGATrump tariff kingElon Musk Modi meeting(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"The much-touted friendship between Donald Trump and Narendra Modi reportedly soured over several missteps and misunderstandings. Key incidents included Trump's offer to mediate on Kashmir, a missed meeting during the 2024 US elections, and disagreements over trade and India's relationship with Russia. Ultimately, a planned White House visit by Modi was canceled, signaling a significant strain in the relationship.","url":"https://economictimes.indiatimes.com/news/india/how-the-trump-modi-friendship-came-undone-in-five-episodes/articleshow/123558206.cms","image":"https://img.etimg.com/thumb/msid-123558452,width-1200,height-630,imgsize-237448,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-28 06:48:00","author":"Sectionshow Trump","authors":["Sectionshow Trump"],"language":"en","source_country":"in","sentiment":-0.166},{"id":355030866,"title":"Trump Demands Criminal Charges Against George Soros: Who's The Billionaire & Why Is He A Target?","text":"US President Donald Trump has accused billionaire George Soros and his son Alex of supporting violent protests across America, demanding that they be prosecuted under a federal racketeering law commonly used against organised crime. The explosive statement, made on his social media platform, follows years of tension between Trump and the Soros family, a major donor to liberal causes and Democratic candidates.\nWhile the Soros-backed Open Society Foundations has categorically denied the allegations, the political backdrop and the intensity of Trump’s rhetoric have reignited debate around a man often treated as a lightning rod in global politics.\nWhat Exactly Did Trump Say?\nOn August 27, Trump posted on Truth Social: “George Soros, and his wonderful Radical Left son, should be charged with RICO because of their support of Violent Protests, and much more… Soros, and his group of psychopaths, have caused great damage to our Country! That includes his Crazy, West Coast friends… Be careful, we’re watching you!”\n\nThe post appeared to respond to reports in right-wing media outlets alleging that organisations linked to the Soros-funded Open Society Foundations (OSF) were indirectly supporting protests, particularly against Trump’s deployment of troops in Democratic cities such as Washington DC and Los Angeles. These claims have not been substantiated.\nIn a statement to AFP, a spokesperson for OSF said: “These accusations are outrageous and false. The Open Society Foundations do not support or fund violent protests. Our mission is to advance human rights, justice and democratic principles at home and around the world.”\nWhat Is The RICO Act That Trump Is Referring To?\nRICO stands for the Racketeer Influenced and Corrupt Organizations Act, a US federal law enacted in 1970. Originally designed to target mafia-style organised crime, the law allows prosecutors to charge individuals if they participate in a criminal enterprise and commit at least two related offences within a 10-year span.\nRICO has been used against drug cartels, financial fraud rings, and corrupt public officials. In this context, Trump is suggesting, without evidence, that the Soros family has engaged in a coordinated pattern of criminal activity through their funding of protest-related initiatives.\nAs of now, no formal investigation or legal action has been announced in response to Trump’s claims.\nWho Is George Soros?\nBorn György Soros in Budapest on August 12, 1930, he survived Nazi occupation during World War II by going into hiding with his family in 1944. In 1947, he left Hungary for the United Kingdom and graduated from the London School of Economics in 1952.\nSoros immigrated to the United States in 1956. After working at several financial firms, he launched his own hedge fund in 1973, which later became the Quantum Fund. His most famous financial move came in 1992, when he bet against the British pound and made over $1 billion in a single day, a trade that earned him the nickname “The Man Who Broke the Bank of England.”\nSoros’s investment philosophy is built on the idea of “reflexivity,” which argues that market participants’ perceptions can shape market reality, creating feedback loops that drive prices away from fundamentals. His firm, Soros Fund Management, currently oversees $28 billion in assets. His personal net worth is estimated to be around $7.2 billion, per Economic Times.\nWhy Does Trump Keep Targeting George Soros?\nGeorge Soros, 95, has long been a vocal supporter of liberal and Democratic causes. His philanthropic organisation, the Open Society Foundations, operates in over 100 countries and supports work in public health, education, human rights, and democratic governance.\nSoros and his son Alex were among the largest donors to former Vice President Kamala Harris’s 2024 presidential campaign, contributing more than $85 million, according to a report in the Financial Times.\nTrump has often linked Soros to prosecutors, politicians, and protest movements he opposes. During his own 2024 hush money trial in New York, Trump claimed that Manhattan District Attorney Alvin Bragg was “controlled” by Soros, a claim Soros has denied. He was awarded the Presidential Medal of Freedom by former US President Joe Biden in January 2025.\nHas Soros Faced Legal Action Before?\nYes. Soros has been involved in several financial regulatory cases:\n\nIn 1977, he was charged with stock manipulation in the US and settled without admitting guilt.\nIn 2002, a French court convicted him of insider trading in a deal involving the bank Société Générale. He was fined $2.25 million.\nIn 2009, Hungary’s financial regulator fined Soros Fund Management $2.2 million for attempting to manipulate the stock of OTP Bank.\n\nWhat Role Does Alex Soros Play Now?\nIn 2023, George Soros officially handed over control of the Open Society Foundations to his son Alexander Soros. Alex has taken a more public-facing role, including active support for the Democratic Party and Vice President Kamala Harris’s 2024 campaign.\nHe co-chairs the foundation’s national finance council and also oversaw OSF’s decision to lay off a significant portion of its staff in 2023 as part of a strategic realignment.\nBroader Context Behind The Accusation\nAccording to AFP, conspiracy theories involving the Soros family resurfaced in June 2025, when protests erupted in Los Angeles during immigration enforcement actions. Some viral posts falsely claimed that Soros-backed groups had placed bricks on the streets, images that were debunked by fact-checkers.\nTrump’s comments are part of a wider pattern in which he has threatened legal action against perceived opponents. In recent months, he has suggested investigations into Kamala Harris, Joe Biden, and Chris Christie, and the FBI recently searched the home of John Bolton, Trump’s former national security adviser.\nAt the same time, Trump himself has faced RICO charges in Georgia for his alleged attempts to overturn the 2020 election. That case has stalled after the lead prosecutor was removed, as noted by the Financial Times.\nIs There Any Action Being Taken Against Soros Based On Trump’s Claim?\nAs of now, no law enforcement agency has announced an investigation into George Soros or Alex Soros based on President Trump’s RICO allegation. The OSF continues to reject the accusations, and no court has entertained a case on these grounds.\nThe statement remains a political one, without any official legal development at this stage.","summary":"US President Donald Trump is seeking federal charges against billionaire George Soros and his son Alex, accusing them of fuelling anti-government protests","url":"https://www.news18.com/explainers/trump-demands-criminal-charges-against-george-soros-whos-the-billionaire-why-is-he-a-target-ws-l-9533100.html","image":"https://images.news18.com/ibnlive/uploads/2025/08/Donald-Trump-George-Soros-2025-08-c545874aa00786906e3e271a5d27fb5b.jpg","video":null,"publish_date":"2025-08-28 05:14:38","author":"Karishma Jain,News18","authors":["Karishma Jain","News18"],"language":"en","source_country":"in","sentiment":0.095},{"id":355262280,"title":"The Democratic Party is disintegrating before our very eyes","text":"The Democratic Party just might spend the next 20 years in the wilderness, and it has only itself to blame.\n\nThings have never been this bad for the party of hope and change. They hope they can change, but they’re face-to-face with a three-headed beast that threatens to push them off a cliff: Millions of voters are abandoning the party, approval ratings have hit a 30-year low and fundraising is in the dumper.\n\nLet’s break down those three. Between the 2020 and 2024 elections, Democrats lost ground to Republicans in all 30 states that track voter registration by political party, as reported by The New York Times last week. The exodus represents a staggering 4.5-million-voter swing toward Republicans, and the political chasm could take years, even decades, to bridge.\n\nDemocrats lost more than 2 million registered voters during the period, while Republicans gained 2.4 million, according to the paper’s analysis. Last year, for the first time since 2018, more new voters nationwide chose to register as Republicans than Democrats. The voter flight occurred across the political spectrum: in battleground states, deep-blue strongholds and red states alike.\n\nThe party’s struggles extend beyond voter registration. A recent CNBC survey shows the Democratic Party’s net favorability has plummeted to a near three-decade low of -32 among registered voters. The party now holds just a 24% positive rating, compared with a 56% negative rating. “The -32 rating appeared to be the lowest rating for either party going back to at least 1996,” CNBC reported.\n\nThe party’s financial situation mirrors its other serious troubles. After its devastating 2024 elections, the Democratic National Committee trails the Republican National Committee by nearly every fundraising metric. By June’s end, the RNC held $80 million; the Democrats, just $15 million.\n\nMajor Democratic donors have withheld contributions amid uncertainty about the party’s direction, while small-dollar donations, traditionally a Democratic strength, have failed to compensate for the shortfall, Politico reports. The party has quickly burned through available funds, including more than $15 million spent this year to settle remaining expenses from Vice President Kamala Harris’ disastrous presidential campaign.\n\nInternal tensions over the party’s direction are percolating just under the surface. Some Democrats continue to advocate for far-left positions (think AOC as presidential nominee) despite electoral setbacks, while others are pushing for moderation (think, well, no one; the bench is just that weak).\n\nThe center-left think tank Third Way has one simple suggestion: Lose the woke. The group urges Democrats to ban 42 words and phrases that just don’t go over well with average Americans, among them “privilege,” “microaggression,” “body shaming,” “systems of oppression,” “the unhoused,” “birthing person,” “deadnaming” and “incarcerated people.”\n\nIn a memorandum addressed to “All Who Wish to Stop Donald Trump and MAGA,” Third Way says that “much of the language above is a red flag for a sizable segment of the American public.”\n\nSo what did the Democrats do in the summer meeting this week in Minneapolis, the first since President Trump beat the snot out of them? You guessed it: They doubled down on the woke and then made a hard-left turn.\n\nThe Democratic National Committee’s meeting opened with a “land acknowledgment” statement. “In many ways, we still live in a system built to suppress Indigenous peoples’ cultural and spiritual history,” said an Indigenous woman who took the podium, wearing what appeared to be a Pride scarf.\n\nThe group meeting then moved on to a presentation from the Vera Institute, a think tank that supports defunding the police, the Daily Caller reported. The presenter told the crowd that being “tough on crime” is “authoritarian” and said, “Migrant crime and carjackings are things that don’t matter to many Americans.”\n\nWhere next? Transgender teens, of course. Minnesota Attorney General Keith Ellison boasted about filing a lawsuit against the Trump administration for prohibiting minors from getting sex change operations. Oakland Mayor Barbara Lee then bragged about how her city’s law enforcement is refusing to cooperate with U.S. Immigration and Customs Enforcement.\n\nTo show just how out of touch the Democrats are right now, DNC Chair Ken Martin took the podium and tried to describe the situation the Democrats find themselves in right now, but he botched the metaphor.\n\n“I’m sick and tired of this Democratic Party bringing a pencil to a knife fight,” Mr. Martin said.\n\nNot even close. The saying is “bringing a knife to a gunfight.” They’re both good weapons; you’re just outgunned if you’re the one holding the knife.\n\nBut a pencil? Well, then, you’re not even really in the fight, are you? And that’s just where the Democrats find themselves right now: not in the fight.\n\n• Joseph Curl covered the White House and politics for a decade for The Washington Times. He can be reached at josephcurl@gmail.com and on Twitter @josephcurl.","summary":"The Democratic Party is disintegrating before our very eyes","url":"https://www.washingtontimes.com/news/2025/aug/27/democratic-party-disintegrating-eyes/","image":"https://media.washtimes.com/media/image/2025/08/27/Curl_AH.jpg","video":null,"publish_date":"2025-08-28 05:02:42","author":"Joseph Curl","authors":["Joseph Curl"],"language":"en","category":"politics","source_country":"au","sentiment":-0.375},{"id":354990092,"title":"Deadly Minnesota school shooting reflects tragic cost of a disordered society — including Dem leaders who lost the plot","text":"If ever there were an example of the perils of the Democrat approach to crime and social disorder, it is Minneapolis, ground zero of the George Floyd/defund-the-police movement that roiled the country five years ago, and a “sanctuary transgender state.”\n\nThe deadly mass shooting of small children at Mass at Annunciation Catholic School Wednesday brings home the tragic cost of a disordered society, where evil rampages unchecked and those who would protect the vulnerable are handcuffed and pushed away.\n\nIt’s too early to say exactly how, or even if, the tragedy could have been prevented. Yet Minnesota Democrats already have reached for their lazy gun-control mantra, in a state that has among the strictest gun laws in the country.\n\nOf course, they remain silent about the anti-Christian radical gender ideology that appears to have driven the latest spate of school shootings, from the murders at the Covenant School in Nashville, Tenn., in November 2023, and at the Abundant Life Christian School in Madison, Wis., in December 2024, to Wednesday’s rampage.\n\nAt least we now have an FBI that tells the truth about the motivating hatreds so that we can try to understand the pathology and stop its spread.\n\n“The FBI is investigating this shooting as an act of domestic terrorism and hate crime targeting Catholics,” FBI Director Kash Patel said in a statement on X after the Annunciation murders Wednesday, adding that the killer has been identified as “Robin Westman, a male born as Robert Westman.”\n\nName change\n\nRobin Westman, 23, had his mother apply to the Minnesota District Court to legally change his name from Robert in January 2020.\n\n“Minor child identifies as a female and wants her name to reflect that identification,” says the court order “Granting Name Change of a Minor.”\n\nThere is no indication of what medications Westman was taking, but mental illness combined with hormone treatment and antidepressants are a recipe for rage. A YouTube “manifesto” speaks of depression and suicidal thoughts, as well as anti-Christian, anti-Jewish demonic ravings adorned with pride flags. He wrote “Kill Trump” along with anti-Israel racist messages and the names of other mass killers on his weapons and ammunition.\n\nThe increasingly violent rhetoric of the trans movement has been embraced by Minnesota’s politicians.\n\nMinnesota Lt. Gov. Peggy Flanagan wore a T-shirt emblazoned with a hunting knife and the slogan “Protect Trans Kids” during a 2023 press conference celebrating an executive order signed by Gov. Tim Walz to make Minnesota a “trans refuge state” for “gender-affirming” care, aka surgical and chemical castration of children. She’s now running for the US Senate.\n\nWoke Walz earned the nickname “Tampon Tim” during his ill-fated VP run with Kamala Harris last year after he signed legislation requiring free menstrual products be provided in boys’ bathrooms for grades 4–12.\n\nHere is the latest on the mass shooting at a Minneapolis Catholic school:\n\nMinneapolis Catholic school shooter ID’d as trans woman Robin Westman— while possible manifesto shows psychotic obsession with mass shooters\n\nMom of Minneapolis mass shooter Robin Westman worked at Catholic school where he opened fire, killing 2 kids: police\n\nMinneapolis shooting live updates: 5th grader recounts terrifying moment hero classmate was shot — while shielding him\n\nMinneapolis gunman kills 2 Catholic school kids, wounds 14 after barricading doors as they prayed in back-to-school Mass\n\nJust two days ago at a DNC meeting in Minneapolis, radical left Minnesota AG Keith Ellison boasted to a cheering audience: “We have sued Trump for gender-affirming care.”\n\nMinneapolis Mayor Jacob Frey hijacked a police press conference about the Annunciation shooting Wednesday to blast the public for what he claimed was a “whole lot of hate being directed at our trans community.”\n\nHe also sneered at anyone praying for the victims: “Don’t just say this is about thoughts and prayers right now. These kids were literally praying.”\n\nTo say these public officials have lost the plot is an understatement.\n\nGasoline on the fire\n\nIf Walz, Frey and Ellison are familiar names to you, it’s because they played a central role in the calamity that struck a pandemic-crazed country in the summer of 2020 — the deadly BLM-Antifa riots that raged after the death of Floyd, a black drug-affected criminal, at the hands of Minnesota police.\n\nInstead of behaving responsibly after the tragedy, these Democrat leaders poured gasoline on the fire and seemed to revel in the mayhem. Walz delayed calling out the National Guard for at least 20 hours. His wife, Gwen, weirdly spoke of keeping “the windows open as long as I could” to smell the aroma of “burning tires . . . because I felt like that was such a touchstone of what washappening.”\n\nFrey ordered the Third Precinct to surrender its police station to the mob as a sort of ritual sacrifice.\n\nEllison railroaded Derek Chauvin and three other cops for Floyd’s death and lied that President Trump supporters were to blame for the riots.\n\nThese are people who find political profit in chaos and disorder.\n\nIt is incredible that they paid no price for the death and destruction they unleashed — which continues to this day in the form of undermanned and demoralized police forces around the country.\n\nThe Minneapolis police force has been so beaten down that it now has just 350 street cops compared to 900 before Floyd, according to former Twin Cities TV news anchor Liz Collin, who was taken off air during the 2020 riots because her husband was the police union chief.\n\n“These cops are already really stretched to the limits,” Collin told Megyn Kelly, pointing out the Annunciation school massacre was the fourth shooting incident in Minneapolis in less than 24 hours.\n\nIf Democrats wonder why their political stock is spiraling into the death zone, they need look no further than their willful failures on urban crime and border protection.\n\nJoe Biden, who once posed as a tough-on-crime moderate, came into the White House and immediately dismantled all the Trump-era border protections, allowing millions of illegal aliens, including rapists, child molesters, murderers and assorted gangbangers to roam free along with our homegrown criminals.\n\nHe turned a blind eye to urban crime while prioritizing the fake crises of climate change and “equity.”\n\nIn place of police, now taxpayer money was being wasted on social workers and “violence interrupters.”\n\nAll less safe\n\nThe upshot is that we all became less safe, even while Dems gaslit us about the wonderful crime stats we knew they’d faked.\n\nInstead of admitting fault and embracing commonsense policies like more cops on the beat, Democrats are siding with criminals. New York is about to sign our own death warrant if Zohran “No Misdemeanors” Mamdani gets his way and wins the mayoralty.\n\nBut Trump’s successful DC crime crackdown puts the lie to their claims that law and order is too complex to solve with policing.\n\nHe has saved the lives of at least half a dozen people in a city that sees a murder every other day.\n\nThe capital’s almost unprecedented 12-day homicide free-streak ended early Wednesday, sadly, but there is no doubt that the streets are safer, and the most affected residents are grateful.\n\nSince most, if not all, of the lives saved are the young black men who usually fill mortuary slabs, it’s a rich irony that the loudest critics of Trump’s law-and-order push are the same Democrats who weaponized “Black Lives Matter” into an insane movement to defund the police.\n\nIn Chicago, where Trump threatens to send the National Guard next, six people were killed last weekend alone, including a 5-year-old boy.\n\nDon’t their lives matter?","summary":"If ever there were an example of the perils of the Democrat approach to crime and social disorder, it is Minneapolis.","url":"https://nypost.com/2025/08/27/opinion/dem-led-minnesota-has-been-at-the-center-of-social-disorder/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-5kw8wf8uw-1756344936245.jpg?quality=75&strip=all&1756330569&w=1200","video":null,"publish_date":"2025-08-28 02:00:53","author":"Miranda Devine","authors":["Miranda Devine"],"language":"en","source_country":"us","sentiment":-0.062},{"id":354987920,"title":"Marilyn Monroe's Home Faces Demolition In Battle Over Landmarks","text":"Marilyn Monroe's last home faces the wrecking ball if its owners get their way this week in a court bid to overturn its designation as a historic landmark.Brinah Milstein, the daughter of a prominent Cleveland real estate developer, and Roy Bank, a reality TV producer, paid $8.35 million in 2023 for the Brentwood area property where the screen goddess known for Some Like it Hot and Gentlemen Prefer Blondes spent her final six months.Shortly after the couple received a demolition permit, preservationists persuaded the city of Los Angeles to designate the house as a historic-cultural monument, sparing it from destruction. Milstein and Bank planned to combine the site with an adjacent lot, their residence since 2016, \"to improve the property,\" Peter Sheridan, their attorney, said in an email.\"LA has thousands of celebrities who live and die here,\" Sheridan said. \"Is every house that those good folks lived in a 'historic monument'? Not in the least.\"Celebrity homes are one of LA's major tourist attractions, with star-tour buses clogging streets from Hollywood to the Pacific shores. Stopping places in Brentwood include the gates of the manors of Arnold Schwarzenegger, Kamala Harris and Harrison Ford.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Few stars match the allure and tragic glamor of Marilyn Monroe, but the historical value of her former home is dismissed by its current owners.\"There is not a single piece of the house that includes any physical evidence that Ms. Monroe ever spent a day at the house, not a piece of furniture, not a paint chip, not a carpet, nothing,\" according to the lawsuit in Los Angeles County Superior Court.The suit claims the city unconstitutionally abused its power by conspiring with for-profit tour operators and biased conservationists to deprive the owners' vested rights.Attorneys for the city argued they followed proper procedures, including gathering evidence of the property's significance in the life of a notable historical figure.\"Mere disagreement is not enough to overcome the city's lawfully-taken action that petitioners opposed at every hearing of the proceedings,\" a team led by LA City Attorney Hydee Feldstein Soto wrote in a response to the lawsuit.Monroe paid $75,000 for the home six months before her death, the first residence she bought on her own after marriages to baseball star Joe DiMaggio and playwright Arthur Miller.An inscription in tile near the home's front door threshold reads Cursum Perficio, Latin for \"The Journey Ends Here.\" It likely predates Monroe's purchase, said Heather Goers, a preservationist who prepared a report for the city Cultural Heritage Commission, but adds a poignant note to her death at age 36.\"Marilyn Monroe was quite possibly the most influential female entertainer of the 20th century,\" Goers said. \"Less than 3% of the 1,300 historic properties in Los Angeles are dedicated to women's history. If you can't commemorate the history of Marilyn Monroe, what's that tell us?\"Originally built in 1929, the two-bedroom, two-bathroom single-story stucco house was designed in Spanish Hacienda-style by an unknown architect.\"This house is unique and important to telling her story as an artist, celebrity, and iconic figure in Hollywood,\" Andrew Salimian, director of advocacy for the Los Angeles Conservancy, a historical preservation group, said in an email. \"It's the only house she owned by herself as a single woman.\"The property has had 14 owners since Monroe's death and undergone numerous renovations and additions including a detached recreation room and studio, the lawsuit says. The house, on a cul-de-sac of four properties, is enclosed by a wall and dense foliage and inaccessible to the public, unless they trespass, Sheridan said.\"In this particular case, it's too little too late,\" because the property has been so extensively changed since Monroe died there, Aaron Kirman, chief executive of Christie's International Real Estate, Southern California, said in an interview. \"The city should've designated this as a historical site long ago.\"Bank and Milstein have suggested saving the structure by relocating it to a more public site, so Monroe devotees can have access. Since the property dispute first made news two years ago, tour groups and fans have swarmed their quiet cul-de-sac, invading their privacy, Milstein said in testimony to the city last year.\"Our children have been buzzed by low-flying drones while playing in the backyard, running inside, crying in fear,\" she said, choking back tears.The brief period of Monroe's life at the home is documented on an almost daily basis by her correspondences, checkbook payments and other records, according to Goers' presentation. In the months she lived there, Monroe won a Golden Globe Award, sang Happy Birthday, Mr. President at a gala for John F. Kennedy, was fired by 20th Century-Fox for missing shooting days on a movie and posed for photographer Bert Stern in what became the basis of his book, The Last Sitting.Some of the most revealing documents are crime scene photographs taken for the coroner after Monroe's death by a sleeping pill overdose, showing the house exterior much as it looks today, Goers said.In July 1962, Monroe sat for an interview with Life magazine reporter Richard Meryman that was published the week she died. She took pride showing the largely unfurnished home, though she declined to allow photos, saying she didn't want \"everybody to see exactly where I live.\" He described a profusion of flowers in the yard and construction underway of a side unit where her friends could stay in privacy.\"She exulted in it,\" Meryman wrote. \"On a special trip to Mexico she had carefully searched in roadside stands and shops and even factories to find just the right things to put in it. The large items had not arrived — nor was she ever to see them installed. As she led me through the rooms, bare and makeshift, as though someone lived there only temporarily, she described with loving excitement each couch and table and dresser, where it would go and what was special about it.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Marilyn Monroe's last home faces the wrecking ball if its owners get their way this week in a court bid to overturn its designation as a historic landmark.","url":"https://www.ndtv.com/world-news/marilyn-monroes-home-faces-demolition-in-battle-over-landmarks-9171625","image":"https://c.ndtvimg.com/2025-08/qsacb5ik_monroe-home_625x300_28_August_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-08-28 00:54:07","author":"John Gittelsohn","authors":["John Gittelsohn"],"language":"en","category":"politics","source_country":"in","sentiment":-0.003},{"id":354978842,"title":"Iowa Democrats Celebrate Special Election Victory, While Republicans Stay Optimistic","text":"Iowa Democrats have faced tough times recently. However, a series of impressive results in special legislative elections this year — significantly surpassing the performance of the 2024 Democratic presidential nominee Kamala Harris in each — has sparked hope that the party might secure some significant Republican-held offices in the upcoming midterm elections.\n\nExcitement was already brewing among Democrats about their chances in the forthcoming governor’s race, the U.S. Senate, and a couple of competitive House contests.\n\nIn the meantime, Democratic contenders in four off-cycle, special legislative contests demonstrated double-digit improvements compared to Harris’ 2024 vote share, the latest political benchmarks in those areas. As of Tuesday night, this streak includes a victory that transformed a Republican seat and disrupted the GOP supermajority in the Iowa Senate. Party members are keen to link the stretch to public sentiment regarding President Donald Trump and their general prospects in what was once a swing state but has leaned decidedly red during the Trump era.\n\n“Iowa voters have seen Trump’s tariff tax blunders negatively impact farmers, and the GOP’s Medicaid cuts threaten their local hospitals — all while Iowa Republicans remain oblivious,” Heather Williams, president of the Democratic Legislative Campaign Committee, shared with NBC News. “Working families across the Hawkeye state recognize they deserve more, which is why they’re gravitating towards state Democrats ready to oppose Trump’s disastrous policies, even in red districts he captured by large margins last November.”\n\nRepublicans argue that these predictions are easily dismissible, pointing to the very low turnout in these quiet off-year, down-ballot special elections.\n\nThey also highlighted how much effort and investment Democrats made in these races — and how strongly Republican the state has become over the past two decades, evidenced during regular campaigns when full electorates turn out to vote.\n\n“I think it’s a mistake to read too much into these special elections, because the turnout is so low — and when the Democrats are particularly motivated,” said David Kochel, a Republican strategist in Iowa. “I would caution anyone who tries to read too much into any of these special elections. They’re so poorly representative of what the overall vote in Iowa might look like in 2026.\n\n“Iowa is still a Republican state. It’s going to be a Republican state,” he added.\n\nIn Tuesday’s special election victory, Democrat Catelin Drey won a Sioux City-area district with 55% of the vote to Republican Christopher Prosch’s 45%, according to unofficial results with all precincts reporting. That’s a 22-point shift from the margin the presidential election last year, when Harris lost the district by 12 percentage points, according to data crunched by The Downballot, a left-leaning political site.\n\nDemocrats recorded double-digit improvements in three other special legislative elections in Iowa earlier this year. In April, Democrats held a seat in a special legislative election in a reliably blue Cedar Rapids district but expanded on Harris’ margin of victory by 26 percentage points, according to The Downballot’s analysis. \n\nIn March, Democrats lost a special legislative race in a safe GOP district in southeastern Iowa — but by only 3 percentage points in a district that Trump carried by 27 percentage points last year, that analysis showed.\n\nAnd in a January special Senate election, Democrats flipped an eastern Iowa district by 4 points, after Trump won it by 21 percentage points, according to The Downballot.\n\nThe special elections precede a busy midterm year in 2026. Next year, there is an open race for governor, with Republican Gov. Kim Reynolds not seeking a third full term. The nonpartisan Cook Political Report with Amy Walter rates the contest “Lean Republican.”\n\nMultiple candidates are running in the primaries on both sides. Iowa Auditor of State Rob Sand is seen as the Democratic front-runner. On the Republican side, U.S. Rep. Randy Feenstra is seen as the front-runner, having outraised all of his opponents in the first half of the year. Feenstra hasn’t formally launched his campaign, but he has formed an exploratory committee and said he would formally announce in September.\n\nIowans haven’t elected a Democratic governor since 2006.\n\nThere are also two House races that are expected to be competitive. \n\nIn the 1st Congressional District, which encompasses a southeastern chunk of the state, Republican Rep. Mariannette Miller-Meeks faces a competitive road to re-election. Miller-Meeks won her 2024 race over Democrat Christina Bohannan by just under 800 votes, and Bohannan is among the Democrats running for the seat next year. Cook rates the 2026 race as a “toss-up.”\n\nIn the 3rd Congressional District, centered on Des Moines, Republican Rep. Zach Nunn could also face a competitive race. Nunn won his race last year by 3.8 percentage points after having flipped the seat in the 2022 midterms. Several Democrats have already jumped into the race or have signaled they will. Cook rates the 2026 race as “Lean Republican.”\n\nSen. Joni Ernst, R-Iowa, is up for re-election next year, too, though she hasn’t yet announced whether she is running again. Cook rates her race as “Likely Republican.” \n\nIowa hasn’t sent a Democrat to the Senate since 2008.\n\nTrump won Iowa last year by more than 13 percentage points and by more than 8 percentage points in 2020. \n\nDespite that recent record, several Democratic candidates were eager to say their gains in the recent slate of special elections were part of a broader trend in the state that they said was feeding their optimism.\n\n“It really confirms what we’ve been seeing and feeling on the ground here for the last couple of months,” Bohannan said. “Iowans are ready for change. They are absolutely fed up with the status quo.”\n\nState Sen. Sarah Trone Garriott, who is running in the 3rd District, said Democrats’ gains are “a really great sign that Iowans are fed up and they’re ready for something better and something different.” \n\nBut only a slice of the voters who participate in national elections showed up for the recent races.\n\nFor example, just 7,600 voters cast ballots in Drey’s race, according to the unofficial results — only 24% of all eligible voters. That’s compared with the more than 14,000 who voted in the last regular general election for the state Senate seat, in November 2022.\n\nRepublicans also pointed to the great lengths — with regard to volunteers and door-knockers — that Democrats went to to help turn out their voters.\n\n“A special election doesn’t necessarily indicate anything for the next election cycle, because voter turnout is so different in a special election,” a national Republican operative familiar with Iowa politics told NBC News. “Democrats spent a ton of money, they flew in volunteers, they rushed the gates on this just to try and make a point.”\n\nJeff Kaufmann, the Iowa GOP chair, said, “National Democrats were so desperate for a win that they activated 30,000 volunteers and a flood of national money to win a state Senate special election by a few hundred votes.”\n\nMany Democrats also acknowledged that they would have to do more to continue their successful streak into the midterms.\n\n“It’s a snapshot in time. I don’t think we should put all of our stock in it,” said Debbie Cox Bultan, the CEO of NewDEAL, a left-leaning political strategy firm. “It’s encouraging, but absolutely we cannot rest on our laurels and think we’re going to get there only by people voting against Trump. We’ve got to give them something to vote for.”\n\nA Democratic strategist in Iowa attributed the party’s gains in recent local special elections to the fact that “people are not happy with the direction that the state is going” while it’s under GOP control — but added that Democrats’ overperformance in recent state legislative elections are “not necessarily indicative of the national environment.” \n\nBut Drey’s win Tuesday “signals the fact that Iowans are looking around” for change, the strategist said. The strategist noted that the recent special election wins were all in places that aren’t traditional Democratic strongholds — and noted the crowds that Sand, the gubernatorial candidate, has been getting.\n\nSand has notched rare statewide wins for his party in recent years. But claiming the governorship — and making other gains in the state — would need another level of shift in Iowa.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIowa Democrats have faced tough times recently. However, a series of impressive&#8230;\n\n\nThis Post: Iowa Democrats Celebrate Special Election Victory, While Republicans Stay Optimistic first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/iowa-democrats-celebrate-special-election-victory-while-republicans-stay-optimistic/","image":"https://internewscast.com/wp-content/uploads/2025/08/Special-election-win-excites-Iowa-Democrats-but-Republicans-remain-confident.jpg","video":null,"publish_date":"2025-08-28 00:19:45","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":354970922,"title":"If Zohran disagrees with the DSA on misdemeanors, he needs to say so","text":"Hey, Zohran Mamdani: If you disagree with the Democratic Socialist of America’s call to end all policing of misdemeanor offenses, better say so — convincingly.\n\nStart with the social-media fury over a recent Post online headline: “Zohran Mamdani wants to end all misdemeanor charges: ‘E-ZPass for criminals.’“\n\nHeadlines, by necessity, are only sketches; and this story’s top two paragraphs explain that it’s about how the national DSA’s most recent platform, adopted in 2021, calls for an end to “the criminalization of working-class survival,” which requires ending “all misdemeanor offenses, accounting for 80% of total court dockets”; readers soon learn that the “E-ZPass” charge comes from one of his opponents.\n\nYet Mamdani’s defenders went ballistic, insisting that it’s not Mamdani who wants to end misdemeanor offenses, it’s just the organization he’s a card-carrying member of.\n\nAnd Mamdani’s campaign, which declined to comment on the original story, on Tuesday wouldn’t say much more on the record, simply assuring us that a Mayor Mamdani’s NYPD will continue to enforce misdemeanors and noting that the no-misdemeanors stuff is from the national DSA, while he’s endorsed by the New York City branch.\n\nIt wouldn’t even go on the record disavowing the national group’s positions. \n\nMind you, Mamdani was a keynote speaker at the DSA’s 2023 national convention, which sure suggests agreement with more than just the NYC crew.\n\nAnd DSA-NYC can’t actually be more moderate: The national outfit calls the policy shots, with local branches obliged to toe the line.\n\nRead the DSA constitution: “Members can be expelled if they are found to be in substantial disagreement with the principles or policies of the organization.”\n\nAnd there’s never been much daylight between the DSA’s radical positions on crime and Mamdani’s, at least not ’til it looked like it might be a problem for his mayoral campaign: He’s supported defunding the police and urged dismantling the “entire carceral system” and called the “police & prison systems in America” one of the “many faces” of “white supremacy.”\n\nEven now, his declared goals include shutting down Rikers, getting rid of police overtime and taking cops’ focus off “non serious crimes.”\n\nExactly which crimes does Mamdani deem unworthy of police attention? Misdemeanors, perhaps? \n\nRemember: The DSA’s not a political party like the Democrats or Republicans — it’s a membership organization of staunch ideologues who require purity tests to remain a member in good standing.\n\nIt unendorsed Rep. Alexandria Ocasio-Cortez last year because, among other things, she signed onto a statement that supported strengthening Israel’s Iron Dome, and DSA members called for Rep. Jamaal Bowman to be booted out for visiting Israel in 2021. \n\nFriendly advice, Zohran: Having staffers simply announce in your name that you no longer hold a position you took publicly just a year or three ago didn’t work for Kamala Harris last year, and it won’t do well for you now.\n\nIf you disagree with the clearly stated positions of an organization you’re a member of, say so yourself — and show you really mean it, by explaining in your own words why that position is wrong, not just inconvenient.\n\nOr are you just hiding your true agenda until you get elected, then it’s DSA-endorsed policies all the way?","summary":"A challenge to mayoral candidate Zohran Mamdani: If you disagree with the Democratic Socialist of America's call to end all misdemeanor offenses, say it.","url":"https://nypost.com/2025/08/27/opinion/if-zohran-disagrees-with-the-dsa-on-misdemeanors-he-needs-to-say-that/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/RC287GAH05DO-1076066810-3-e1756335485645.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-08-27 23:20:36","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.061},{"id":354967490,"title":"Democratic leaders still support arming Israel. Their voters largely do not, citing Gaza ‘genocide’","text":"This past week, the global community largely condemned the Israeli government for a strike on a hospital in Gaza that killed 20 people. Israel’s strike killed five journalists, including Maryam Abu Daqqa, who worked for The Independent’s sister site Independent Arabia. \n\nEver since the Israeli government began its Gaza-based response to the October 7th terrorist attack in Israel — where Hamas invaders killed more than 1,100 people and took some 200 hostages — the issue has threatened to split the Democratic Party. \n\nThis week, the Democratic National Committee’s summer meeting became the latest battleground for the party’s split on Israel. Progressive activists had wanted to put forward a resolution to withhold military aid to Israel, while DNC Chairman Ken Martin put forward a resolution calling for humanitarian aid to Gaza and an end to the war. \n\nMartin's resolution passed while the one put forth by progressives failed. Then Martin did the most Democratic Party thing possible: he retracted his resolution and announced the creation of a task force.\n\nBut if Democratic elected leaders and party officials still remain largely supportive of Israel, their voters are moving away from them on the issue. \n\nOn Wednesday, a Quinnipiac University poll showed that 50 percent of Americans think Israel is committing a genocide in Gaza. \n\nBut the divide is even more stark along party lines: While only 20 percent of Republicans think that Israel is committing a genocide, a whopping 77 percent of Democrats say the Jewish State is. \n\nThe poll also showed that while Americans are roughly split on which side they sympathize more with, 63 percent of Democrats said their sympathies lie more with the Palestinians than Israelis. It also found that 63 percent of Democrats think the United States is too supportive of Israel and 75 percent of Democrats oppose sending more military aid to Israel. \n\nThe numbers paint a fairly clear picture. And even Democratic senators, members of that stodgy old bastion of conventional wisdom and hawkish foreign policy, have had enough. Last month, 26 Democratic senators joined Sen. Bernie Sanders (I-Vt.) to withhold the sales of certain arms to Israel. \n\nEven moderates like Sen. Jeanne Shaheen of New Hampshire, who is the top Democrat on the Foreign Relations Committee, joined the resolution. Sen. Elissa Slotkin (D-Mich.), the freshman former CIA analyst, missed the vote for an appearance on The Late Show with Stephen Colbert. When The Independent asked her about it, she said she put out a statement on the matter.\n\n“I just put out a giant statement, two pages long,” Slotkin said, adding she would have voted for the resolution. When The Independent followed up last month, she again referred to the same “statement.”\n\nLest anyone think the Quinnipiac poll is an outlier, YouGov and The Economist also commissioned a poll and found that U.S. adult citizens’ sympathies are about split between Israelis and Palestinians, a plurality of 44 percent of Democrats sympathize more with the Palestinians. \n\nAnd lest anyone think that number is padded by people who did not turn out last year, 45 percent of people who said they voted for Kamala Harris in 2024 said they sympathized more with the Palestinians. \n\nThe Democratic Party’s relationship with Israel and Palestine reflects its big-tent nature. The party has been the political home of a majority of Jewish Americans since the turn of the 20th century as it championed itself as representing the downtrodden and the excluded. Harry Truman recognized the state of Israel in 1948.\n\nBut many Democratic voters, including many Jews, now see Palestinians as victims of a right-wing ultra-nationalist government in Israel that seeks to remove them from a land they consider their home. And it looks like their sympathies have aligned as much. \n\nMartin’s initial resolution and then subsequent formation of a subcommittee will likely be seen as delaying an inevitable tide shift that occurred in the Democratic Party on guns and abortion. \n\nA perfect example? Prior to his job as DNC chairman, Martin led Minnesota’s state party. And both of his senators, Amy Klobuchar and Tina Smith, joined Sanders’ resolution.","summary":"An internal DNC dispute about withholding weapons sales to Israel reflects a larger truth: Democratic support for Israel is dwindling the longer the war in Gaza goes on, Eric Garcia writes","url":"https://www.independent.co.uk/news/world/americas/us-politics/democratic-leaders-still-support-arming-israel-their-voters-largely-do-not-citing-gaza-genocide-b2815308.html","image":"https://static.independent.co.uk/2025/04/24/22/Democrats_16372.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/qG18CyG5-4VHSaSK0.mp4","publish_date":"2025-08-27 22:35:11","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.173},{"id":354954254,"title":"Fox News Politics Newsletter: DC Crime Crackdown","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Federal judge blocks Abrego Garcia deportation through October, extending court fight -Dem lawmakers call for gun control after Minneapolis school shooting -House Republicans ready slew of DC crime bills as Trump promises end to street violence Trump's DC Crime Crackdown President Donald Trump and his allies in Congress are working to solidify his grip on Washington, D.C. A leadership aide told Fox News Digital on Tuesday that House Republicans are working with the White House on a package of bills \"to fix the many problems with D.C. governance and crime.\" Trump all but confirmed the effort in a late-night Truth Social post at midnight on Wednesday stating that House and Senate leaders \"are working with me, and other Republicans, on a Comprehensive Crime Bill.\"…Read more White House CENTRAL BANK SHAKEUP: Cook’s potential exit hands Trump greater sway over Fed Board shaping US monetary policy 'RALLY': Trump’s cartel crackdown gains ‘powerful political leverage’ with El Mayo guilty plea Across America WITCH HUNT: Jack Smith's lawyers blast Hatch Act probe as ‘imaginary and unfounded’ GOLDEN DIVORCE: \"2 state solution\" -- CA Republicans announce plan to split state to blunt redistricting ASYLUM AT THE PLANT: Chicago Teamsters, backed by mayor, want ICE blocked without warrants in strike fight SUPPORT LIMBO: Socialist candidate Mamdani meets with NY Dems as they withhold endorsements TRAGEDY STRIKES: DNC adjourns Minneapolis meeting as breaking news of deadly school shooting unfolds minutes away SAGA CONTINUES: Abrego Garcia renews push for asylum in US, reveals new country willing to accept him CASH CRISIS: Kamala Harris fundraising events have been a flop to help raise money for DNC: Report Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-august-27th-draft","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/trump-national-guard-dc.jpg","video":null,"publish_date":"2025-08-27 21:47:30","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.195},{"id":354969664,"title":"Padilla sidesteps questions about a possible run for governor, says he is focused on redistricting","text":"U.S. Sen. Alex Padilla (D-Calif.) on Wednesday brushed aside questions about whether he might jump into California's 2026 governor's race, but declined to rule out the idea. Padilla instead said he was wholly focused on promoting the special election in November when voters will be asked to redraw California's congressional districts to counter efforts by President Trump and other GOP leaders to keep Republicans in control of Congress. \"I'm focused and I'd encourage everybody to focus on this Nov. 4 special election,\" Padilla said during an interview at a political summit in Sacramento sponsored by Politico. The 52-year-old added that the effort to redraw congressional districts, championed by Gov. Gavin Newsom in response to similar efforts in GOP-led states, is not solely about the arcane process known as redistricting. \"My Republican colleagues and especially the White House know how unpopular and damaging what they're doing is, from gutting Medicare, nutrition assistance programs, really all these other areas of budget cuts to underwrite tax breaks for billionaires,\" Padilla said. \"So their only hope of staying in power beyond next November is to rig the system.\" In recent days, Padilla's name has emerged as a possible candidate to replace Newsom, who cannot run for another term. The field is unsettled, with independent polling conducted after former Vice President Kamala Harris opted not to run for governor showing large numbers of voters are undecided and with no clear front-runner. Padilla pointed to his more than quarter-century history of serving Californians at every level of government when asked what might be appealing about the job. \"I love California, right?\" he said. \"And I've had the privilege and the honor of serving in so many different capacities.\" In 1999, the then-26-year-old was elected to Los Angeles City Council. At the time, the Massachusetts Institute of Technology grad still lived with his parents — a Mexican-born housekeeper and a short-order cook — in Pacoima. Padilla continued his steady climb through the state's political ranks in the decades that followed, serving in the state Senate and as California secretary of state. Newsom appointed him to fill Harris' Senate seat in 2020, making him the first Latino to represent California in the Senate, and Padilla was elected to fill a full term in 2022. His current Senate term doesn't end until 2029, meaning he wouldn't have to risk his seat to run for governor.","summary":"U.S. Sen. Alex Padilla's name has emerged in recent days as a potential new entry in the 2026 race to replace termed-out Gov. Gavin Newsom. He demurred on Wednesday when asked when he planned to mount a campaign, saying he was solely focused on passing the special election in November.","url":"https://www.latimes.com/california/story/2025-08-27/padilla-governor-special-redistricting-election-newsom-harris-porter-becerra-villaraigosa-thurmond-atkins-yee","image":"https://ca-times.brightspotcdn.com/dims4/default/264df1d/2147483647/strip/false/crop/8192x5464+0+0/resize/1486x991!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2f%2F5c%2Fcbacbdcf407a90e360808b4828b4%2F1373823-la-power-list","video":null,"publish_date":"2025-08-27 21:38:08","author":"Julia Wick,Seema Mehta","authors":["Julia Wick","Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":0.159},{"id":354958748,"title":"Trump urges criminal charges against George Soros, son","text":"U.S. President Donald Trump called Wednesday for billionaire George Soros and his son to face criminal charges over unfounded claims that their family, a favorite right-wing target, is behind \"violent protests\" around the country.\n\nTrump did not specify what prompted his morning outburst, but it comes as his administration pursues multiple criminal investigations against his perceived enemies.\n\n\"George Soros, and his wonderful Radical Left son, should be charged with RICO because of their support of Violent Protests, and much more,\" the president wrote on his Truth Social platform, referring to a law against taking part in a criminal organization.\n\nThe Open Society Foundations, the philanthropic empire founded by Soros, slammed Trump's comments.\n\n\"These accusations are outrageous and false. The Open Society Foundations do not support or fund violent protests,\" a spokesperson for the foundations said in a statement to AFP.\n\nThe foundations support the \"rights to free speech and peaceful protest that are hallmarks of any vibrant democracy,\" the spokesperson added.\n\nLong-standing conspiracy theories involving the Soros family swirled again in June, as street protests broke out in Los Angeles against a ramp up of immigration raids.\n\nTrump used the demonstrations as justification to deploy the National Guard and Marines into the Democratic-run city.\n\nFact-checkers including AFP debunked several images which circulated online at the time, purporting to show that nonprofit groups backed by the Soros family had strategically placed bricks to hurl at police.\n\nHungarian-born Soros, 95, has long been a bogeyman for the far right in Europe and the United States for his financial support of progressive causes and the Democratic Party.\n\nHe has been baselessly blamed for propagating migrant crises in Europe and on the southern border of the United States, and for orchestrating mass protests, including those against police brutality after the 2020 killing of George Floyd.\n\nThe years-long campaign against Soros, who is Jewish, is often accused of being motivated by antisemitism.\n\n\"Soros, and his group of psychopaths, have caused great damage to our Country! That includes his Crazy, West Coast friends,\" Trump wrote Wednesday on Truth Social.\n\n\"We're not going to allow these lunatics to rip apart America any more,\" he added, warning: \"Be careful, we're watching you!\"\n\nTrump previously accused Soros of being behind his 2024 conviction for covering up hush money payments to a porn star, alleging that the financier controlled the public prosecutor who brought the charges.\n\nSoros announced in 2023 that he would hand over control of the Open Society Foundations to his son Alex.\n\nIn the 2024 election, Alex Soros was a vocal supporter of Trump's Democratic opponent, vice president Kamala Harris.\n\nShortly before leaving office in January, Joe Biden awarded the elder Soros the Presidential Medal of Freedom -- America's highest civilian honor -- citing his support for \"projects across the world that strengthen democracy, human rights, education and social justice.\"","summary":"U.S. President Donald Trump called Wednesday for billionaire George Soros and his son to face criminal charges over unfounded claims that their family, a favorite right-wing target, is…","url":"https://japantoday.com/category/world/trump-urges-criminal-charges-against-george-soros-son","image":"https://media.japantoday.com/img/store/d0/88/f13b673365cec6de23f6296d0d4d56bbb589/e9cfe0e9132e3c8e2ff989f428cda5efdd230305/_w1700.jpeg","video":null,"publish_date":"2025-08-27 21:33:48","author":"Daniel Stublen,Japan Today Editor","authors":["Daniel Stublen","Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.096},{"id":355129432,"title":"Reader Opinion: Harris was right, but too many failed her, by Patricia Bentrup","text":"I find it amazing that there has been no recognition that Kamala Harris’s 2024 campaign for president of the United States, which focused on saving our democracy, hit the nail on the head.\n\nMany Democratic leaders, with the help of voters who stayed home on election day, blew it and the whole country is now reaping the whirlwind courtesy of Donald J. Trump.\n\nPATRICIA BENTRUP\n\nWestmoreland","summary":"I find it amazing that there has been no recognition that Kamala Harris’s 2024 campaign for president of the United States, which focused on saving our democracy, hit the nail on the head.","url":"https://www.keenesentinel.com/opinion/letters_to_the_editor/reader-opinion-harris-was-right-but-too-many-failed-her-by-patricia-bentrup/article_6a30cda3-0fcb-41a3-bb5a-68e553807815.html","image":"https://bloximages.chicago2.vip.townnews.com/keenesentinel.com/content/tncms/custom/image/6260defe-c779-11ef-bd8a-c733c01e3345.jpg?resize=600%2C315","video":null,"publish_date":"2025-08-27 21:30:00","author":"Patricia Bentrup","authors":["Patricia Bentrup"],"language":"en","source_country":"us","sentiment":-0.347},{"id":354988390,"title":"A Message to Taylor Swift and Travis Kelce: Get Married and Have a Baby","text":"I’m no fanboy of Taylor Swift. At one point about a year ago, I asked my wife and daughters to alert me when one of her songs started playing, so I could have a vague idea of what the big deal is. Even now, after hearing several of her songs repeatedly, I couldn’t name a damned one of them. They sound mostly the same to me. Yeah, I know. Old fuddy-duddy dads say that about the music of whatever current youth generation. Your old man griped about Elvis and the Beatles sounding alike. Of course, the difference was that that music didn’t sound the same, whereas much of today’s mass-produced junk does.\n\nBut I digress!\n\nI’m also no fan of Ms. Swift’s left-wing politics. Last year, Tay Tay stuck her pretty little nose in the presidential race, dropping an obnoxious, vacuous, pre-scripted endorsement of Kamala Harris minutes after the presidential debate. Swift babbled some adolescent, pelvis-obsessed mumbo-jumbo about “LGBTQ+ rights, IVF, and a woman’s right to her own body.”\n\nWhile I’m at it, I’m also no fan of Swift’s boyfriend, Travis Kelce. I say that mainly because I’m not a fan of the Kansas City Chiefs. They’re simply not my team, having been born and bred in black and gold for my beloved Pittsburgh Steelers. Still, I have great respect for him and his Chiefs (and his quarterback, Patrick Mahomes) for their remarkable accomplishments on the football field. The man is a first-ballot Hall of Famer.\n\nI’m also no fan of Kelce’s stumping for Pfizer, the pharmaceutical company that during COVID gave us the infamous mRNA clot-shot, marketed as a “vaccine” that liberals (big proponents of “my-body-my-choice”) tried to force us all to take, even when we had medical or conscience objections. Travis has become a poster boy for Pfizer, prompting the excellent Aaron Rodgers to dub him “Mr. Pfizer.” (My teenage son has dubbed Kelce “Mr. Swift.”)\n\nBut, with all of that said, I must here confess that I am a big fan of the decision made this past week by Swift and Kelce. They announced to the world and fans everywhere that they are engaged.\n\nI had actually written a piece after the Super Bowl back in February (for another publication), urging Swift and Kelce to get hitched. I had been prompted by the “big news” circulating when a reporter had asked Kelce if he planned to pop the question to the pop star. “Wouldn’t you like to know?” Kelce quipped. Asked if was planning on a ring, he slyly replied: “A Super Bowl ring? Next question.” \n\nMy interest in Kelce’s response was less pop culture than moral culture. From my keyboard, I lectured the Chief that this isn’t something to chuckle at, particularly given the massive influence of his celebrity girlfriend.\n\nTaylor Swift is a gigantic role model to girls. That’s one of the reasons that her pal Kamala was ga-ga over Tay Tay’s political endorsement. And given her influence, it is not good for young girls to observe Swift and her football big-shot prancing all over the planet together. The unmarried gal and guy romp and roll half-naked on beaches and share hotel beds. \n\nIn other words, they do the things that married couples do.\n\nThey also do it with wads of money. Kelce is rich from football — worth tens of millions of dollars. As for Swift, she’s a literal billionaire.\n\nWith that kind of cash, Swift can frolic with her boyfriend carefree. But as for her fans, those girls cannot afford that kind of lifestyle. They need boyfriends who don’t treat them like rich playthings. They need stability and commitment. Swift was raised as a working-class girl in Reading, Pennsylvania (my sister lived there at the time). But as sociologist and longtime friend of The American Spectator Charles Murray has noted in his disturbing book, Coming Apart, it is precisely that working class that has been decimated. That class is plagued by unmarried girls struggling to support kids because the guys who used them for sex had no desire to marry them and treat them as wives and man up to take care of their shared children. These poor girls become “baby mamas.” \n\nWhereas Tay Tay is worth a cool $1.6 bil, those girls are lucky if they can afford daycare.\n\nMy point was that if Swift is going to be a role model for girls, then she should model marriage. She and Kelce should get engaged and get married. \n\nBut honestly, I wasn’t optimistic. I figured this celebrity couple would implode like most of them do, relegating themselves to the ash heap of other sad tabloid romances.\n\nAnd yet, that is apparently not the case. I’m happy to hear of their announcement this week.\n\nNow, if I may go further. \n\nLet’s see Taylor Swift take an even bolder, braver, and more natural-moral step that would really make her a marvel to girldom. Let’s see her and Kelce go through with the marriage plans — full ceremony, in a church, wedding gown, bridesmaids and groomsmen, and walk down that aisle, sooner rather than later, without delays. Moreover, let’s see them have a baby. \n\nYes, a baby. A married man and woman who become one flesh. A child. And to borrow from Sydney Sweeney — one with obviously great genes.\n\nWhy not? The world knows the two are having lots of sex, and they’re obviously contracepting.\n\nWell, let’s see the couple take a most beautiful step together and give the gift of life to a baby girl or boy.\n\nNow that’s something I would really be a fan of.","summary":"I’m no fanboy of Taylor Swift. At one point about a year ago, I asked my wife and daughters to...","url":"https://spectator.org/a-message-to-taylor-swift-and-travis-kelce-get-married-and-have-a-baby/","image":"https://spectator.org/wp-content/uploads/2025/08/Screenshot-2025-08-27-at-5.24.31-PM.png","video":null,"publish_date":"2025-08-27 21:26:26","author":"Paul Kengor","authors":["Paul Kengor"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.152},{"id":354945218,"title":"Gavin Newsom’s wife, Jennifer, raking in as much as $300K a year from political mega-donors and nonprofit: Sources","text":"The wife of California governor Gavin Newsom runs companies stacked with her husband’s former Democratic aides and confidants — while raking in hundreds of thousands of dollars in fees from the state and lobbyists, according to public records.\n\nDocumentary filmmaker Jennifer Siebel Newsom, the self-described “First Partner” of California, also received donations to her Representation Project nonprofit from companies that lobbied her husband, according to reports.\n\nThe Sacramento-based Representation Project, which describes itself as “the leading gender watchdog organization,” pays Siebel Newsom $150,000 a year for a 40-hour work week, according to tax filings. \n\nIts largest independent contractor is Girls Club Entertainment LLC, a for-profit film company which Siebel Newsom also controls.\n\nIn 2024, the nonprofit paid Girls Club $150,000 for “writer/producer/director” services, according to that year’s federal filings.\n\nGovernment watchdogs have blasted the Newsoms for what they describe as conflicts of interest.\n\n“It is no surprise Gavin and Jennifer Newsom have leveraged their business and non-profit endeavors for personal and political gain,” said Caitlin Sutherland, executive director of Americans for Public Trust, a non-partisan watchdog group.\n\n“Backed by left-wing megadonors with ties to the governor, the power couple’s ventures have raked in hundreds of thousands of dollars, pushing a politicized agenda into public schools, all while personally benefiting the Newsoms. \n\n“Profiting from progressive indoctrination is easy when your husband is the governor — a blatant conflict of interest,” Sutherland added.\n\nSiebel Newsom licenses her documentaries, including 2019’s “The Great American Lie,” about economic inequality, and 2015’s “The Mask You Live In,” which analyzes notions of masculinity, to taxpayer funded schools, according to reports. Included are talking points for teachers, with comments on Newsom’s interviews in the films.\n\nHuge companies such as AT&T, Comcast and PG&E have bankrolled Representation Project’s annual Flip the Script fundraising galas in the past, donating up to $25,000 each, according to the Sacramento Bee. \n\nThe companies denied their donations were designed to curry favor with the governor, and the nonprofit then stopped listing its corporate donors on its website.\n\nAT&T has spent more than $2 million lobbying the state on landline phone rules in 2025, and continues its battle against Comcast for market share in California.\n\nWatchdogs are also concerned about the cozy nature between the Newsoms, donors and former staffers.\n\n“These types of connections certainly appear unseemly and raise some serious red flags,” said Michael Chamberlain, director of Protect the Public’s Trust, a Washington-based nonprofit that exposes conflicts of interest in government.\n\nSince 2016, the Representation Project has hosted an annual “Flip the Script” gala.\n\nLast year’s event honored philanthropist Roselyne Swig, whose family once owned the Fairmont Hotel in San Francisco. The Swigs are among Gavin Newsom’s biggest donors, spending more than $100,000 financing his political career.\n\nThe 2024 gala also featured Hilary Newsom, Siebel Newsom’s sister-in-law and the president of the Newsom family’s sprawling Plumpjack Group, which controls the family restaurant and wine empire, as a gala co-chair.\n\nAnother former co-chair, venture capitalist Joanna Rees, launched an unsuccessful bid for mayor of San Francisco in 2011. She was backed by Siebel Newsom and used SCN Strategies, the same firm that ran Newsom’s campaign for Lieutenant Governor in 2010.\n\nOther Representation Project board members include Brian Brokaw, a political advisor to Newsom who managed former vice president Kamala Harris’s campaign for California Attorney General and her super PAC during her first presidential run.\n\n“As was evident during COVID, Governor Newsom seems to enjoy living by the maxim of ‘rules for me, but not for thee,'” Chamberlain said. “It wouldn’t be surprising to see a different set of rules applied to the governor and his team than those that everyone else has to live under.”\n\nIn addition to the Representation Project, Siebel Newsom also sits on the board of the Siebel Family Charitable Foundation, her family charity. \n\nThe charity’s biggest donation in 2023 was $23,000 which went to her Representation Project.\n\nNewsom’s office did not return a request for comment for the governor or his wife.","summary":"\"Profiting from progressive indoctrination is easy when your husband is the governor — a blatant conflict of interest,\" said Caitlin Sutherland, executive director of Americans for Public Trust, a non-partisan watchdog group.","url":"https://nypost.com/2025/08/27/us-news/jennifer-siebel-newsom-making-big-money-from-nonprofit-sources/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-5zbx7qfls-1756324421934_720.jpg?quality=75&strip=all&w=720","video":"https://cdn.jwplayer.com/videos/SVqn1w0R-RyIcpnTz.mp4","publish_date":"2025-08-27 21:07:52","author":"Isabel Vincent","authors":["Isabel Vincent"],"language":"en","category":"politics","source_country":"zm","sentiment":0.305},{"id":354950482,"title":"Wisconsin Democrats use Taylor Swift’s engagement as fundraising opportunity","text":"“In a time we are being bombarded with negative news, we welcome this moment of celebration. You know what will make this day even better?” the email said, per the Milwaukee Journal Sentinel.\n\n“If we got a step closer to FLIPPING the Wisconsin State Senate blue for the first time in a decade. Will you join us in celebrating this moment by rushing $20.26 today and help Taylor’s party win next November?” the email continued.\n\nThe email additionally misquoted one of Swift’s songs, “Long Live” from her album Speak Now. It said, “Long live the walls we crash through,” instead of “long live the walls we crashed through.”\n\nWisconsin Senate Democrats are looking to flip the state legislature’s upper chamber after a new voting map was signed into law by Gov. Tony Evers (D-WI) last year.\n\nSwift and Kelce announced their engagement on Tuesday via Instagram. The social media post garnered more than 30 million likes since it was posted.\n\nSwift has a long history of supporting Democratic politicians. A Tennessee resident, she was heavily critical of now-Sen. Marsha Blackburn (R-TN) in the 2018 Tennessee Senate race. Her political activism in that race was featured in the 2020 documentary on her career, Miss Americana.\n\nShe endorsed former President Joe Biden in the 2020 presidential election and former Vice President Kamala Harris in the 2024 presidential election.","summary":"Wisconsin Democrats harped on the engagement of Taylor Swift and Travis Kelce to fundraise ahead of the 2026 election.  The Wisconsin State Senate Democratic Committee sent an email shortly after the couple announced the engagement, declaring that &#8220;TAYLOR SWIFT AND TRAVIS KELCE ARE ENGAGED!!!&#8221; and asking supporters to donate in the name of the engagement. [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3785044/wisconsin-democrats-taylor-swift-engagement-fundraising/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/ap.jpg?1756313426&#038;w=696","video":null,"publish_date":"2025-08-27 20:58:51","author":"Annabella Rosciglione","authors":["Annabella Rosciglione"],"language":"en","source_country":"US","sentiment":0.297},{"id":354943400,"title":"Gavin Newsom is surging in primary polls as he leans in to role as Trump’s troll","text":"Potential Democratic primary voters are increasingly energized about California Gov. Gavin Newsom, according to a new poll.\n\nThe surge in support comes as the Democrat has adopted a highly confrontational approach towards the Trump administration in recent weeks, mocking and parodying the president online while challenging Trump’s push to increase Republican seats through redistricting.\n\nNewsom now counts 19 percent support among Democrats and Democrat-leaning independent potential primary voters, according to a Morning Consult poll released Tuesday. \n\nThe support represents a notable increase from Newsom’s five percent support among this group in March and 11 percent support in June. \n\nThe California governor, who has taken to ironically using Trump-style rhetoric online — all caps posts, outrageous memes, signature catchphrases like “thank you for your attention to this matter” — still trails a fellow Golden State Democrat, former Vice President Kamala Harris.\n\nHarris, who announced this summer she will not seek the governorship once Newsom leaves office, has 29 percent support among the polled primary voters.\n\nOther potential 2028 candidates trail the pair, with former Biden administration Transportation Secretary Pete Buttigieg and New York Congresswoman Alexandria Ocasio-Cortez at 6 percent support in the poll. \n\nThe findings back up other recent data points suggesting a Newsom surge.\n\nThe governor saw a three percent jump in support over last month in favorability ratings, according to Echelon Insights. \n\nAnother recent poll showed that 75 percent of California Democrats want Newsom to run for president or are excited about him doing so, nearly double the share that reported this opinion in 2023.\n\nThe California governor hasn’t formally announced a campaign, though it’s widely thought he is seeking the 2028 slot for the Democrats.\n\nHis record battling Trump online and otherwise would form a key part of his record in any future campaign.\n\nOutside of trolling social media posts, Newsom helped spearhead a recently passed California redistricting plan that could add five Democratic seats in Congress if approved by voters, a response to a Trump-backed plan in Texas that came after the president said he was “entitled” to as many as five more seats there.\n\nThe Trump administration has said it plans to sue California over the map plan, and the president has threatened to extend his National Guard anti-crime crackdown to San Francisco, Newsom’s home city. \n\nNewsom, meanwhile, sued the administration over its decision to send National Guard troops into Los Angeles over the summer in response to anti-immigration raid protests over the objection of California officials.","summary":"Building support comes as Newsom has mocked Trump online and challenged Republican redistricting plans","url":"https://www.independent.co.uk/news/world/americas/us-politics/gavin-newsom-primary-poll-trump-b2815276.html","image":"https://static.independent.co.uk/2025/08/23/2/48/Screenshot-2025-08-22-at-10-45-40-PM.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/HltqslHV-OhrQWqOm.mp4","publish_date":"2025-08-27 19:51:54","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":0.282},{"id":355152414,"title":"Establishment Reeling After Trump’s 7-Month War Against Deep State","text":"President Donald Trump has issued a slew of executive orders targeting the Washington, D.C., establishment during a seven-month campaign aimed at federal bureaucratic institutions.\n\nThe Trump administration has focused on dismantling the “Deep State” by firing bureaucrats and career politicians Trump has argued are influenced by partisan interests — a promise he highlighted during his presidential campaign.\n\nA February executive order moved all regulatory bodies under White House supervision, erasing decades of autonomy and paving the way for the gutting of agencies like the Consumer Financial Protection Bureau and the U.S. Agency for International Development (USAID). (RELATED: Politics Democratic Party Sues Trump Administration)\n\nTrump has fired or demoted more than 20 inspectors general since he took office, according to a New York Times (NYT) report.\n\nIn his most recent move, Trump fired Federal Reserve Governor Lisa Cook over allegations of mortgage fraud. Cook was nominated to the board by former President Joe Biden.\n\n 🚨 President Donald J. Trump relieves Federal Reserve Governor Lisa Cook of her position pic.twitter.com/tJV8m4mlHW — Rapid Response 47 (@RapidResponse47) August 26, 2025\n\nTrump took to Truth Social to demand Cook’s resignation after Federal Housing Finance Agency Director Bill Pulte announced he would refer her to the Department of Justice (DOJ) over alleged mortgage fraud.\n\nIn a letter posted to X later that day, Trump said he was invoking his authority under the Federal Reserve Act to fire Cook, accusing her of signing documents that listed her as a resident of two different states.\n\nHe has also moved to retake control of the Bureau of Labor Statistics (BLS) by nominating economist E.J. Antoni and instructed his team to remove Labor Statistics Commissioner Erika McEntarfer, following what he called a disappointing July jobs report.\n\nIn the post, Trump accused McEntarfer of “[faking] the jobs numbers” ahead of the 2024 election to allegedly improve former Vice President Kamala Harris’ “chances of victory.”\n\nHis remarks came after the BLS reported the U.S. economy added only 73,000 nonfarm payroll jobs in July.\n\nTrump has also made it a priority to tackle crime in the nation’s capital.\n\nEarlier this month, Trump declared a crime emergency in D.C. and deployed the National Guard to address the crisis. (RELATED: ‘We’re Taking It Back’: Trump Deploying National Guard To Streets Of Nation’s Capital)\n\nHe told reporters Friday that Chicago, Illinois, could be his next focus once the D.C. operation is complete, followed potentially by New York City.\n\n“So I think Chicago will be our next and then we’ll help with New York,” Trump said when discussing his potential plans.\n\nTrump has also referred to himself as the “Chief Law Enforcement Officer,” and the DOJ is now overseeing criminal investigations into Russiagate.\n\nThe Office of Director of National Intelligence (ODNI) released pages of documents regarding the “Russiagate” scandal, or the debunked allegations that Trump’s first campaign colluded with Russia to win the 2016 election.\n\nSince then, Director of National Intelligence (DNI) Tulsi Gabbard has revoked nearly 40 security clearances from former and current intelligence professionals. She accused them of “[abusing] public trust by politicizing” information, and multiple officials were reportedly involved in the Obama DNI James Clapper’s 2017 Intelligence Community Assessment (ICA).\n\nGabbard is also cutting federal government waste, fraud and abuse by dramatically reducing intelligence staff. Just last week, she informed ODNI employees she would slash personnel by 40% and shut down centers she said had politicized intelligence.\n\nIn addition to slashing waste, Trump’s ODNI has made efforts to increase transparency.\n\nThe Trump administration previously released more than 60,000 pages of classified documents related to former President John F. Kennedy’s assassination.\n\n 🚨 President Trump announces that the JFK Files will be released tomorrow: “People have been waiting for decades for this.” pic.twitter.com/VrXDy2saRz — Rapid Response 47 (@RapidResponse47) March 17, 2025\n\nGabbard also released over 10,000 pages of previously classified documents on the assassinations of former Sen. Robert F. Kennedy. The files on Dr. Martin Luther King Jr. alone include more than 230,000 pages, all released under Trump’s January executive order.\n\nFollowing Trump’s lead in rooting out corruption at the Department of Defense (DOD), Secretary Pete Hegseth fired the head of the Defense Intelligence Agency (DIA), Lt. Gen. Jeffrey Kruse, adding to the growing list of officials dismissed since Hegseth took office.\n\nThe move comes after a leaked DIA preliminary assessment from June concluded that U.S. strikes on Iranian nuclear facilities caused no lasting damage — an assessment widely disputed by other agencies and officials.\n\nTrump has also called for an investigation into the Smithsonian museums. The White House released a summary titled “President Trump Is Right About the Smithsonian,” highlighting the institution’s left-wing bias.\n\nIn February, Trump overhauled the board of the prestigious John F. Kennedy Center for the Performing Arts and announced his intention to appoint himself chairman. He criticized the center’s “woke” direction and promised to shape future performances to reflect his vision.\n\nAs part of the takeover, Trump appointed former Ambassador to Germany and conservative Richard Grenell as president, who has publicly committed to programming for the masses saying “everyone is welcome here.” (RELATED: EXCLUSIVE: Trump-Run Kennedy Center Takes The Air Out Of Notorious Broadway Union)\n\nTrump also announced that the draw for the 2026 FIFA World Cup will be held at the Kennedy Center on December 5. Since becoming chairman, he has also unveiled the first five Kennedy Center Honorees — Kiss, Sylvester Stallone, George Strait, Gloria Gaynor and actor Michael Crawford — praising their outstanding accomplishments.\n\n 🇺🇸Watch🇺🇸 It was a special day at the Kennedy Center with a visit from our Chairman, President Donald J. Trump, and the announcement of our five incredible Honorees for the 48th Kennedy Center Honors. pic.twitter.com/MlPRcZaZqJ — The Kennedy Center (@kencen) August 14, 2025\n\nTrump previously told the Daily Caller he was “about 98% involved” in the selection process and “they all” went through him.\n\nThe Kennedy Center announced its 2025–2026 theater season in May, which will feature non-union productions and several shows not affiliated with the Actors’ Equity Association, marking a significant departure from its usual programming.","summary":"Establishment Reeling After Trump's 7-Month War Against Deep State","url":"https://dailycaller.com/2025/08/27/donald-trump-deep-state-establishment-doj-odni-crime-dc-russiagate-kennedy-center/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/GettyImages-2230143735-1-e1756306435424.jpg","video":null,"publish_date":"2025-08-27 18:50:59","author":"Ashley Brasfield","authors":["Ashley Brasfield"],"language":"en","category":"politics","source_country":"us","sentiment":-0.313},{"id":355100510,"title":"You belong with me! Taylor Swift and Travis Kelce – a love story in 11 pictures","text":"It’s a love story; she said yes. Taylor Swift, not long ago hailed as the world’s most famous “childless cat lady”, is tying the knot. She announced her engagement to footballer Travis Kelce, her partner of two years, on Instagram on Tuesday. The post was liked more than 14.5m times in just two hours, and reportedly crashed the platform for many users.\n\nKelce is a tight end for the Kansas City Chiefs. He and Swift publicly debuted their relationship in September 2023, when she attended the Chiefs’ game against the Chicago Bears in Kansas City, Missouri. (The Chiefs won.) The fact she popped up in Kelce’s private suite alongside his mother, Donna, and other friends and family, and left with him for a private afterparty, led fans to speculate that this wasn’t their first date.\n\nSwift and Kelce had in fact been publicly linked since the summer of 2023, but this was no tabloid gossip-mongering – the source of the speculation began with Kelce himself. Attending her Eras concert at Arrowhead Stadium in July 2023, Kelce tried to get backstage to meet Swift and give her a friendship bracelet with his phone number on it. He later told the story on New Heights, the podcast he hosts with his brother Jason, saying he was “disappointed” and “a little butt-hurt” to miss out on the introduction.\n\nKelce’s name-drop on his podcast was quick to reach Team Swift – and clearly piqued her curiosity. Weeks later, news outlets reported that the pair were “hanging out”. He eventually responded to the rumours in mid-September. “I threw the ball in her court, and I told her, ‘I’ve seen you rock the stage at Arrowhead. You might have to come see me rock the stage at Arrowhead’,” he said on The Pat McAfee Show. Swift popped up in his family box days later.\n\nPart of fans’ excitement about the emergent “Tayvis” pairing derived from the fact that Kelce was seen as such a significant departure from Swift’s previous partners. In the past, she has been linked to fellow musicians (including John Mayer, Joe Jonas, Harry Styles, DJ Calvin Harris and the 1975 singer Matty Healy) and actors (Jake Gyllenhaal, Tom Hiddleston and, most recently, Joe Alwyn). Kelce not only bucked the pattern of fellow entertainers, but also captured Swifties’ imagination as being a stand-in for the popular jock Swift often pined for in the songs she wrote as a teenager.\n\nThe frenzy over Swift and Kelce’s relationship peaked on 1 October 2023, when Swift showed up at MetLife Stadium to watch the Chiefs play the New York Jets with a celebrity entourage, including Blake Lively and Ryan Reynolds, Sophie Turner, Sabrina Carpenter, Queer Eye chef Antoni Porowski and Hugh Jackman. The audience for that game peaked at more than 29 million viewers, making it the best-watched game since the February Super Bowl (in large part due to more female viewers) – largely thanks to Swift’s star power.\n\nSwift and Kelce’s highly public appearances together, months after meeting, contrasted significantly with her earlier relationship with British actor Joe Alwyn. They kept a low profile over the six years they were together, based mostly in London. News of their breakup spread in early April 2023, weeks after the start of Swift’s globe-trotting Eras tour. “Tayvis” was born five months later.\n\nThey weren’t just quick to go public with their relationship, but quick to progress. In October, Swift and Kelce were photographed having “a PDA moment” (public display of affection) backstage at Saturday Night Live in New York, having both made surprise appearances on the show. The same month, Kelce was reported to have bought a new home, worth $6m, offering more privacy for his relationship. He later spoke admiringly of Swift’s handling of the attention on her: “The scrutiny she gets, how much she has a magnifying glass on her, every single day, paparazzi outside her house, outside every restaurant she goes to, after every flight she gets off – and she’s just living, enjoying life.”\n\nIn November, Kelce was photographed in the audience of Swift’s Eras Tour show in Argentina. She then amended the lyrics of her song Karma to refer to “the guy on the Chiefs, coming straight home to me”, and was later filmed running off the stage and into his arms, sending fans into another frenzy.\n\nKelce, for his part, joked that Swift is his “good luck charm” on the field. Her frequent appearance at games has certainly been beneficial for the NFL, leading to significant spikes in viewership figures of women and girls. In January 2024, an eight-year-old Swiftie attended the Chiefs’ game against the Buffalo Bills in New York with the sole intention of meeting her idol – and was plucked from the crowd by Jason Kelce.\n\nAfter her shout-out in Argentina, Kelce delighted fans by joining Swift on stage at Wembley for her reworked Eras Tour show, with a revised setlist to include songs from her new album The Tortured Poets Department. He carried her in his arms, fanned her and dusted her face with a makeup brush before she launched into I Can Do It With a Broken Heart. Two songs from that album, The Alchemy and So High School, were both understood by fans to refer to her relationship with Kelce.\n\nSwift and Kelce’s relationship has often been described as a union of entertainment and sporting royalty; in the UK for the Eras Tour in June 2024, they met actual royalty. Swift’s selfie of the pair with Prince William, Prince George and Princess Charlotte also marked her making their relationship “Instagram official”.\n\nIn a barnstorming year for Swift, she broke yet another record at the MTV video music awards in September, where she became the most-awarded artist in the event’s history with her win for video of the year for Fortnite. She thanked Kelce in her acceptance speech: “Everything this man touches turns to happiness and fun and magic, so I want to thank him for adding that to our shoot.”\n\nIn September, weeks before the US presidential election, Swift endorsed Kamala Harris in an Instagram post she signed “childless cat lady” – a reference to Trump running mate JD Vance’s disparaging description of Democrat voters. The endorsement was received with relief by many Swift fans, not least given the support for Trump reported within Kelce’s wider family, but it was not enough to secure a victory for Harris. Swift’s Eras Tour finally concluded on 7 December after 149 shows, breaking numerous records, including for the biggest-selling tour in history.\n\nAttending the Grammys in February this year, Swift incorporated a subtle shout-out to her partner, accessorising her Vivienne Westwood mini-dress with a body chain bearing his initial “T”.\n\nThough known as Kelce’s “good luck charm”, Swift’s appearance in this year’s Super Bowl crowd was no match for the Philadelphia Eagles (her home town team), who defeated the Chiefs 40-22. She was reportedly given a frosty reception, and was booed by thousands in the crowd. With Trump just returned to the White House for a second term, commentators chalked up the heckling to Swift’s endorsement of Harris.\n\nAfter the end of their respective “eras” – Swift’s concert tour and Kelce’s NFL season – the couple retreated from the public eye to enjoy the first quiet patch in their relationship – though not for long. In August, Swift announced a new album: The Life of a Showgirl, penned during the European leg of her Eras tour. She appeared on the Kelces’ podcast New Heights to dish the details, speaking for more than two hours – and affording fans an unprecedented level of access into her private life. She acknowledged the podcast’s part in the start of their relationship, saying of Kelce’s highly public wooing of her: “This is sort of what I’ve been writing songs about wanting to happen to me since I was a teenager.”\n\nKelce, for his part, spoke admiringly of his partner’s athleticism, intelligence and vocabulary. In a profile interview for GQ’s September issue, he swooned over Swift and their relationship: “Whenever I’m with her, it feels like we’re just regular people.”\n\nThe couple’s engagement announcement on Tuesday took some punters by surprise: after the New Heights episode, bets were placed for Swift to be the performer at next year’s Super Bowl and/or for Kelce to propose on the pitch. In fact, the couple got engaged almost two weeks ago, Kelce’s father confirmed to the press.\n\nOne of the five photos posted to Instagram on Tuesday was a closeup of Swift’s ring: a large diamond set in a yellow gold band. Tree Paine, Swift’s infamous publicist, confirmed only that the ring was designed by Kindred Lubeck and the diamond is an “old mine brilliant cut”.\n\nSwift captioned the images with “Your English teacher and your gym teacher are getting married”, a quote from her song So High School. For fans, as well as perhaps Swift herself, it’s nothing short of a fairytale romance – a nerd, pining from the bleachers, finding happy ever after with the homecoming king.","summary":"It began on the 30-yard line and led to the announcement of their engagement on Tuesday. Here’s a look back at their two-year romance\n\nIt’s a love story; she said yes. Taylor Swift, not long ago hailed as the world’s most famous “childless cat lady”, is tying the knot. She announced her engagement to footballer Travis Kelce, her partner of two years, on Instagram on Tuesday. The post was liked more than 14.5m times in just two hours, and reportedly crashed the platform for many users.\n\nKelce is a tight end for the Kansas City Chiefs. He and Swift publicly debuted their relationship in September 2023, when she attended the Chiefs’ game against the Chicago Bears in Kansas City, Missouri. (The Chiefs won.) The fact she popped up in Kelce’s private suite alongside his mother, Donna, and other friends and family, and left with him for a private afterparty, led fans to speculate that this wasn’t their first date.\n\n Continue reading...","url":"https://www.theguardian.com/music/2025/aug/27/you-belong-with-me-taylor-swift-and-travis-kelce-a-love-story-in-11-pictures","image":"https://i.guim.co.uk/img/media/8aff2a83634a0f02c1a5eb1419c4130ba63d2b81/183_282_937_749/master/937.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L","video":null,"publish_date":"2025-08-27 18:01:55","author":"Elle Hunt","authors":["Elle Hunt"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.397},{"id":354907956,"title":"Kamala Harris fundraising events have been a flop to help raise money for DNC: Report","text":"Former Vice President Kamala Harris' fundraising events for the Democratic National Committee (DNC) have fallen short, according to Axios, as the DNC has continued to pay off the former presidential nominee's campaign expenses. Harris allowed the DNC to use her email list to help raise funds, according to Axios. She has also reportedly held a few small fundraising events. \"But the total money raised from the events has been disappointing,\" Axios reported, citing people familiar with the matter. After Harris lost to President Donald Trump in 2024, top Democrats expressed concern about potential campaign debt. HARRIS TAPS DEM EMAILS LISTS TO MARKET NEW BOOK, SPARKING PARTY NEUTRALITY CONCERNS \"How do you raise a historic amount of money and not win a single swing state?\" one Harris aide told Axios in November, following the election loss. \"The honest answer is: I don't know. It seems we lost the national narrative, and that's what we need to diagnose.\" Axios reported that some Democrats are frustrated the campaign spent $1.5 billion during her 107-day election effort. \"The vice president has collaborated closely with the DNC to manage campaign expenses and expand our base of grassroots donors. She remains fully committed to strengthening the party and helping return Democrats to power,\" former Harris campaign chair Jen O'Malley Dillon told Axios. Harris’ office did not immediately respond to a request for comment. REPUBLICAN FUNDRAISING OUTPACES DEMOCRATS BY NEARLY DOUBLE, JUNE NUMBERS SHOW The DNC has spent more than $15 million paying off Harris' 2024 election campaign debt in the first few months of 2025, Axios reported. Some Democratic donors are also hesitant to give to the DNC as they look ahead to the midterms. Over the past six months, the DNC has given $548,050 to a charter flight company, $2.1 million to a media production company and $237,201 to a law firm on behalf of Harris' campaign, according to Axios. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The Democratic National Convention on August 15, 2024, in Chicago, Illinois. CLICK HERE TO GET THE FOX NEWS APP Harris' allies are reportedly placing blame on DNC chair Ken Martin, arguing he is not fully focused on fundraising.","summary":"Former Vice President Kamala Harris&apos; fundraising events for the DNC after her election loss have been disappointing, according to Axios, as the DNC continues to pay off the 2024 campaign debt.","url":"https://www.foxnews.com/media/kamala-harris-fundraising-events-have-been-flop-help-raise-money-dnc-report","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/kamala-harris-dnc-chicago-fundraising.jpg","video":"https://www.foxnews.com/video/6364771985112","publish_date":"2025-08-27 18:00:13","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.349},{"id":355052428,"title":"'Shame, shame!' Angry boos signal Susan Collins should be 'very worried' about reelection","text":"For many years, Sen. Susan Collins (R-Maine) was among the most popular Republicans in New England. First elected to the U.S. Senate in 1996, Collins was reelected by 7 percent in 2002, 23 percent in 2008, and 37 percent in 2014. Conservative-leaning but not far-right, Collins attracted a lot of swing voters, moderates, independents and Democrats.\n\nBut her image suffered when she voted to confirm now-Justice Brett Kavanaugh to the U.S. Supreme Court in 2018 despite warnings that doing so would help to doom Roe v. Wade — which is exactly what happened when the High Court voted to overturn Roe in 2022 and Kavanaugh was among the \"yes\" votes. Collins was reelected by 8 percent in 2020, which was a lot less than her 37 percent victory six years earlier.\n\nCollins was reminded how much her image has suffered when she was booed during a ribbon-cutting ceremony in Maine on Tuesday, August 26.\n\nREAD MORE: Trump's reckoning may be right around the corner — here's why\n\nThe New Republic's Malcolm Ferguson, in an article published the following day, reports, \"This was Collins' first public, press conference-style event in her home state in nearly a decade. Video shows the room erupting in boos as she approached the front of the room to cut the ribbon for a new Main Street in Seaport, Maine. The boos eventually turned into chants of 'Shame! Shame! Shame!' Collins smiled and cut the ribbon as if her angry constituents weren't even there. The crowd continued to shout her down.\"\n\nCollins voted \"no\" on President Donald Trump's \"big, beautiful bill,\" a piece of legislation that some of the attendees were angry about. But other people in the crowd were still angry about her \"yes\" vote on Kavanaugh.\n\nOne of them shouted, \"Your votes destroyed our Supreme Court.\"\n\n\"This all comes as progressive populist Democrat Graham Platner announced his bid to unseat Collins last week in a now viral video,\" Ferguson explains. \"His candidacy serves as a foil to Collins on almost every issue, and Maine residents are starting to notice.\"\n\nREAD MORE: 'It’s a real gut punch': Rural voters 'stunned' by Trump’s damage\n\nCollins is running for reelection in 2026 and is seeking a sixth term. 2026 will be her second reelection campaign since voting \"yes\" on Kavanaugh, but only her first since the High Court overturned Roe in its unpopular Dobbs v. Jackson Women's Health Organization ruling.\n\n\"Collins' chances of winning have been precarious for some time now,\" Collins observes. \"Her dedication to a spineless centrist conservatism has frustrated Maine voters, especially in a state won by Kamala Harris in the 2024 general election. That, combined with Collins' icy reception at her own event, and Platner's current surge, should make the longtime senator very worried.\"\n\nREAD MORE: 'Not joking': Ex-Trump official warns he privately 'waxes poetic' about dictators he admires\n\nWatch video of the August 26 ceremony below or at this link.","summary":"For many years, Sen. Susan Collins (R-Maine) was among the most popular Republicans in New England. First elected to the U.S. Senate in 1996, Collins was reelected by 7 percent in 2002, 23 percent in 2008, and 37 percent in 2014. Conservative-leaning but not far-right, Collins attracted a lot of swing voters, moderates, independents and Democrats.\n\nBut her image suffered when she voted to confirm now-Justice Brett Kavanaugh to the U.S. Supreme Court in 2018 despite warnings that doing so would help to doom Roe v. Wade — which is exactly what happened when the High Court voted to overturn Roe in 2022 and Kavanaugh was among the \"yes\" votes. Collins was reelected by 8 percent in 2020, which was a lot less than her 37 percent victory six years earlier.\n\nCollins was reminded how much her image has suffered when she was booed during a ribbon-cutting ceremony in Maine on Tuesday, August 26.\n\nREAD MORE: Trump's reckoning may be right around the corner — here's why\n\nThe New Republic's Malcolm Ferguson, in an article ","url":"https://www.alternet.org/susan-collins-booed-platner/","image":"https://www.alternet.org/media-library/image.jpg?id=61525424&width=1200&height=600&coordinates=0%2C250%2C0%2C251","video":null,"publish_date":"2025-08-27 17:29:53","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":0.171},{"id":355052408,"title":"'You gonna believe the numbers?' Trump official cornered on pending low jobs report","text":"Kevin Hassett, Trump's appointee for director of the National Economic Council, told CNN host John Berman the administration is not ready to fully trust the next jobs report numbers due next week, possibly indicating the administration's low expectations.\n\n“Jobs report coming out next week, Kevin. You gonna believe the numbers?” asked Berman.\n\n“There's a lot of work that needs to be done to make it so that the numbers are more reliable,” said Hassett. “The extent to which the BLS (Bureau of Labor Statistics) survey response rates hasn't improved and it made the data very unreliable with huge revisions, is something that we need a new team to have a look at. But I think they'll be as good as they can be. But they need to get a lot better.”\n\nREAD MORE: Trump's reckoning may be right around the corner — here's why\n\nTo that, Berman reminded Hassett that it was the revisions to survey responses that drew the wrath of President Donald Trump and prompted him to fire then Bureau of Labor Statistics Commissioner Erika McEntarfer. \n\nAt the time, Trump claimed the commissioner \"RIGGED\" jobs figures \"to make the Republicans, and ME, look bad,” despite economists saying it was Trump’s own tariffs that hurt labor numbers that month.\n\n“Again, obviously the revisions are the ones that have the greater response rate and it was the revisions that showed very weak numbers,” Berman told Hassett.\n\nEarlier Hassett tried to claim Trump’s attempt to fire Fed board member Lisa Cook and install a White House ally was an attempt to make the fed more independent, not less.\n\nREAD MORE: 'He's in there': MAGA congressman caught on hot mic saying Trump is in Epstein files \n\n“I think that the president believes … that this fed hasn't really been independent, that if you look at their movements to let inflation get out of control, to potentially jack up the economy right ahead of the election for Kamala Harris to begin hiking rates the minute President Trump was elected took office in 2017, there was a pretty troubling partisan pattern.”\n\nWatch the video below or at this link.\n\n - YouTube youtu.be","summary":"Kevin Hassett, Trump's appointee for director of the National Economic Council, told CNN host John Berman the administration is not ready to fully trust the next jobs report numbers due next week, possibly indicating the administration's low expectations.\n\n“Jobs report coming out next week, Kevin. You gonna believe the numbers?” asked Berman.\n\n“There's a lot of work that needs to be done to make it so that the numbers are more reliable,” said Hassett. “The extent to which the BLS (Bureau of Labor Statistics) survey response rates hasn't improved and it made the data very unreliable with huge revisions, is something that we need a new team to have a look at. But I think they'll be as good as they can be. But they need to get a lot better.”\n\nREAD MORE: Trump's reckoning may be right around the corner — here's why\n\nTo that, Berman reminded Hassett that it was the revisions to survey responses that drew the wrath of President Donald Trump and prompted him to fire then Bureau of Labor Statistics Commissioner Erika","url":"https://www.alternet.org/trump-jobs-report-fire/","image":"https://www.alternet.org/media-library/image.jpg?id=61524636&width=1200&height=600&coordinates=0%2C427%2C0%2C427","video":null,"publish_date":"2025-08-27 17:23:59","author":"Adam Lynch","authors":["Adam Lynch"],"language":"en","category":"politics","source_country":"us","sentiment":-0.508},{"id":354897708,"title":"Five episodes that soured the Trump-Modi bromance","text":"TOI correspondent from Washington: The friendship between Donald Trump and PM Modi -- dubbed a bromance by the media-- began to come unstuck late in Trump's first term, and continued to fray despite efforts to re-kindle it in the US President's second term, according to multiple accounts from White House insiders and current and former officials and diplomats, pieced together by TOI. There has been no official confirmation of the reports from either the Indian or the American side.Officials who served in the White House during Trump 1.0 traced mutual misgivings to July 22, 2019, when the US President, a novice in issues relating to the subcontinent, told Pakistan's then PM Imran Khan during his visit to the White House that he was willing to mediate in the Kashmir issue if both countries agreed, claiming that Modi had asked him to play a role.The remark shocked New Delhi, which said there was no such request from Modi in keeping with India's long held stand that it is a bilateral issue that brooks no third-party mediation.According to White House insiders, Trump's flub came despite a 45-minute briefing by senior officials well-versed in the region in which they explained the intricacies -- for which he apparently had no bandwidth. His mediation offer could also have been based on a misunderstanding of a private phone conversation with Modi in which the Indian PM may have suggested he temper Pakistan's approach to the issue. In either case, Trump was nonplussed why anyone would reject his offer for mediation, the sources said.A rousing visit to India for the Namaste Trump rally, just days before the Covid shutdown, papered over this glitch. The second snafu came in September 2024 when Modi was visiting the US to attend the UN General Assembly and the Quad summit hosted by President Biden. Indian interlocutors reached out to Trump, who was campaigning for a second term, to set up a meeting, while also reaching out to his rival Kamala Harris. While Trump readily agreed to see the Indian PM and even announced at a campaign event in Michigan that he was meeting Modi, Harris' campaign balked.The Indian side backed out of the Trump meeting since it did not want to meet only one candidate. This did not go down well with Trump, since he had already announced he was meeting Modi.Still, the two principals appeared to have overcome the wrinkles when Modi became one of the first foreign leaders to meet Trump in the White House after he won a second term, the US President hosting him for a working visit on February 13 this year. But by this time, Trump had worked himself into a rage over the tariff issue, not just at India (although he had begun to call it the tariff king), but the world at large. Although officials from both sides put together a grand COMPACT (\"Catalyzing Opportunities for Military Partnership, Accelerated Commerce & Technology) for the 21st Century”), Trump had little bandwidth for pages and pages of fact sheets and joint statement loaded with Modi's favored acronyms. He wanted headline-making big ticket announcements. He got little for his MAGA faithful beyond projections and promises on the trade front.Moreover, when Trump spoke of MAGA, Modi responded that it could co-exist with his own idea of MIGA aka Viksit Bharat. And then there was the small matter of Elon Musk calling on Modi at Blair House before the Oval Office meeting. By then Trump had begun to sour on Tesla and Apple's plans in India.The fourth episode came during the four-day India-Pakistan conflict, which Trump fervently believes he brought to an end. While New Delhi says there was no phone conversation between Trump and Modi during the clash, in the US President's mind, he got Vance to make the call (after possibly failing to reach Modi). Modi himself has said he missed several calls from Vance before he could be reached.Trump's latest comments -- sketchy and disjointed -- suggests he talked the Pakistani leadership (not clear who) and warned them they would not get a trade deal if they did not stop the fighting. India says it only responded to the Pakistani overtures for a truce, which New Delhi agreed to. Repudiating his role in dousing a war that he believes would have gone nuclear has clearly miffed Trump, who has been fairly transparent in his quest for a Nobel Peace Prize.The final straw came when Modi declined Trump's invitation to stop by at the White House on his way back from G-20 in Canada, on the same day the US President had invited Pakistan's de facto military ruler Asim Munir. The Indian side feared a photo-op ambush. By this time, bilateral negotiations on trade were drawing to a conclusion with negotiating teams from both sides so close to a deal that top US officials said it was imminent. But peeved over what he possibly saw as multiple slights, Trump torpedoed it, using India's Russian oil purchase as a ruse.Select The Times of India as your preferred source on Google Search","summary":"The Trump-Modi friendship, once hailed as a 'bromance,' faced several challenges during Trump's presidency. Key disagreements arose from Trump's offer to mediate in Kashmir, misunderstandings during meetings, and trade disputes. Ultimately, the relationship soured due to perceived slights and conflicting priorities, culminating in Trump's rejection of a trade deal.","url":"https://timesofindia.indiatimes.com/world/us/five-episodes-that-soured-the-trump-modi-bromance/articleshow/123548771.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123549558/123549558.jpg","video":null,"publish_date":"2025-08-27 17:17:43","author":"Chidanand Rajghatta","authors":["Chidanand Rajghatta"],"language":"en","source_country":"in","sentiment":-0.228},{"id":354921854,"title":"An upcoming iPhone update has raised alarm among Republican fundraisers in the US. Here's why","text":"The GOP’s Senate campaign arm is warning that a coming update to Apple’s iOS could cost the committee more than $25 million in lost fundraising\n\nAn upcoming iPhone update from Apple has raised an alarm among Republicans fundraisers in the United States, who fear it could block key voter outreach and fundraising messages. Tech giant's new filtration system, due for rollout in September, may disproportionately impact Republican campaigns that rely heavily on text-based outreach, Fox News reported.According to a report in Campaigns and Elections, the GOP’s Senate campaign arm is warning that a coming update to Apple’s iOS could cost the committee more than $25 million in lost fundraising. The National Republican Senatorial Committee sounded an alarm over a July 2024 memo that the new spam filters for text messages which Apple is set to roll out as part of iOS 26. Those filters will send messages from numbers that are not in a users’ contacts to a separate folder for unknown senders. iPhone users will then have the chance to mark the number as known, reply to the message or delete it altogether. That creates a headache for political fundraisers, according to the NRSC’s memo, because iPhone users aren’t likely to check their unknown senders folder. Consequently, it argues, a large swath of political outreach, including GOTV messages to fundraising texts, will go unnoticed. Text messages from known numbers saved on an individual's phone are expected to continue alerting recipients and sending the messages to their typical text app.ALSO READ: 'No murders in North Korea too': CNN brutally bashes Trump claims about DC crime and murder-free streak Live EventsApple's new update is headache for RepublicansSean Dollman, founding partner of American Made Media Company, which was the parent firm of Launchpad Strategies and was the exclusive digital agency for Donald Trump’s 2024 campaign, said that the move was no surprise.\"It’s no surprise that Big Tech wants to stop Donald Trump and other Republicans from communicating with people, because they’ve tried every other method to interfere already,\" Sean Dollman, founding partner of American Made Media Company, the parent company of Launchpad Strategies, which was the exclusive digital firm for Trump 2024, told Fox News Digital. \"Big Tech has suppressed him, suspended him, and banned him outright. And now they’re trying to make it so he can’t text anybody either. But MAGA won’t be stopped, and MAGA will always find a way.\"ALSO READ: Trump targets George Soros in federal racketeering case: How the billionaire made his massive fortuneApple is expected to roll out its latest update, iOS 26, in September. Launchpad Strategies served as the Trump 2024 campaign’s exclusive digital firm, raising $509 million for Trump and a further $18 million from 40 other clients during the election year.In addition to the text filters, the new software is expected to introduce other features like call screening, which will field phone calls from numbers not in a users’ contacts by collecting the caller’s name and the reason for the call. The iPhone user will then be able to choose whether to take the call or decline it.Launchpad Strategies acted as the exclusive digital firm for Trump’s 2024 campaign, managing online advertising and strategic consulting during his decisive victory over former Vice President Kamala Harris. According to its website, the firm continues to operate as a “full-service Republican digital agency committed to helping campaigns win.”Fox Digital reported that Launchpad raised an astonishing $509 million for Trump’s 2024 campaign, alongside an additional $18 million from 40 other clients during the record-breaking election year.ALSO READ: Self-driving cars and automated warehouses? Nvidia's Jetson Thor is powerful robot brain for next-gen AI robots Why is it important?Data from the 2024 election cycle shows that Republicans relied on text messaging twice as much as Democrats, leaving them particularly exposed if Apple’s new filter takes effect this September. The timing is especially crucial with the midterms approaching, as Democrats see an opportunity to regain control of both the House and Senate.Screenshots of recent fundraising texts, reviewed by a US-based news outlet, highlight how central Donald Trump remains to the strategy. Supporters are encouraged to save his number in their contacts or reply directly to build a message history. The texts are crafted to feel personal and interactive: one reads, “From Trump: Did you save my number yet?” Another urges, “Download the Trump Contact Card to add me to your address book.” Some go even further, prompting recipients with messages like, “Trump: If you had 5 minutes with me, what would you say? No links. I just want your reply below.”ALSO READ: US' fastest train is here: Amtrak's NextGen Acela to launch service between DC, Boston and NYC. Check prices and datesRepublicans argue the change, timed months before midterm campaigning heats up, could cost them more than $25 million in fundraising revenue, according to a July memo from the National Republican Senate Committee, cited by Punchbowl News.Republican strategists have pointed to a striking comparison with a previous Gmail controversy. According to a 2022 study by North Carolina State University’s Department of Computer Science, Gmail routinely delivered emails from left-leaning politicians to inboxes, while flagging over two-thirds of Republican messages as spam.Republicans claim this biased filtering cost them billions. Fox News Digital reported that, drawing on data from the Republican National Committee and its congressional affiliates, Gmail’s system contributed to nearly $2 billion in lost fundraising between 2019 and 2022. During the 2020 election cycle alone, GOP candidates raised $737 million through the WinRed platform—but only 32% of their emails reached supporters, leading the party to estimate a staggering $1.5 billion in missed contributions.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onfox newsiPhone updateRepublican fundraisersApple iOS 26text message spam filtersNational Republican Senatorial Committeepolitical fundraisingapple update republican fundraisersapple update IOS 26GOP fundraising apple update\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onfox newsiPhone updateRepublican fundraisersApple iOS 26text message spam filtersNational Republican Senatorial Committeepolitical fundraisingapple update republican fundraisersapple update IOS 26GOP fundraising apple update(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Republican fundraisers are worried about Apple's upcoming iPhone update, fearing it could hinder voter outreach and fundraising efforts. The new filtration system, expected in September, might disproportionately affect Republican campaigns that heavily rely on text-based communication. Concerns are rising that crucial GOTV messages and fundraising texts will go unnoticed, potentially costing the GOP millions.","url":"https://economictimes.indiatimes.com/news/international/global-trends/us-news-an-upcoming-iphone-update-ios-26-has-raised-alarm-among-republican-fundraisers-in-the-us-heres-why/articleshow/123549091.cms","image":"https://img.etimg.com/thumb/msid-123549140,width-1200,height-630,imgsize-1455058,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-27 16:36:06","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.412},{"id":354886984,"title":"Trump makes chilling threat to billionaire Democratic boogeyman for funding 'violent' opposition","text":"Donald Trump wants to toss a Democratic political dynasty in jail for funding his foes.\n\nIn an unprompted outburst on Truth Social Wednesday morning, Trump demanded his administration pursue federal racketeering charges against liberal billionaire George Soros and his family.\n\nThe president claimed the elder Soros and his ‘radical left’ son should be charged under the Racketeer Influenced and Corrupt Organizations Act because of their support for ‘violent protests.’\n\n‘George Soros, and his wonderful Radical Left son, should be charged with RICO because of their support of Violent Protests, and much more, all throughout the United States of America,’ Trump wrote, without providing any evidence or specifying what incidents he was referring to. \n\nRepublicans have long accused Soros of funding violent demonstrations and riots. \n\n‘We’re not going to allow these lunatics to rip apart America any more, never giving it so much as a chance to “BREATHE,” and be FREE. Soros, and his group of psychopaths, have caused great damage to our Country!’\n\nTrump concluded, ‘That includes his Crazy, West Coast friends. Be careful, we’re watching you!'\n\nSoros and his family are seen as a major boogeyman in GOP circles. Over the years, the family has provided hundreds of millions to progressive candidates and organizations via the Open Society Foundations.\n\nIn 2023, Soros, 95, handed control over the philanthropic organization to his youngest son Alex.\n\nDuring the 2024 election, Alex supported and raised money for Trump’s opponent Kamala Harris. The younger Soros is married to Hillary Clinton’s close aide Huma Abedin.\n\nThe Soros organization was a major donor to the campaigns for progressive local prosecutors and attorney generals that have challenged the Trump administration in court.\n\nFollowing Trump’s RICO threat, the Open Society Foundations responded on behalf of the Soros family in a statement to the Daily Mail.\n\n‘These accusations are outrageous and false,’ a spokesperson for the organization told the Daily Mail. ‘The Open Society Foundations do not support or fund violent protests. Our mission is to advance human rights, justice, and democratic principles at home and around the world.’\n\n‘We stand for fundamental freedoms guaranteed by the Constitution, including the rights to free speech and peaceful protest that are hallmarks of any vibrant democracy.’\n\nTrump did not specify an exact reason for why he suddenly called for a prosecution of the Soros family.\n\nHowever, the president’s threats come as his administration pursues criminal investigations into his political enemies.\n\nSince starting his second-term, Trump has called for the arrests of multiple political foes, including New York mayoral candidate Zohran Mamdani and former DHS Secretary Alejandro Mayorkas.\n\nRecently, the FBI raided the home and office of former national security adviser turned Trump critic John Bolton. \n\nThe raid is part of the FBI's investigation into Bolton's use of classified documents while writing his memoir The Room Where It Happened. The 2020 book provides a critical view of Trump during his first-term. \n\nShortly before Joe Biden left office, he awarded the elder Soros with the Presidential Medal of Freedom.","summary":"In an unprompted outburst on Truth Social Wednesday morning, Trump demanded his administration pursue federal racketeering charges against a liberal billionaire","url":"https://www.dailymail.co.uk/news/article-15039761/Trump-makes-chilling-threat-billionaire-Democratic-boogeyman-funding-violent-opposition.html","image":"https://i.dailymail.co.uk/1s/2025/08/27/16/101596473-0-image-a-12_1756308481614.jpg","video":null,"publish_date":"2025-08-27 16:29:10","author":"Editor,Phillip Nieto","authors":["Editor","Phillip Nieto"],"language":"en","category":"politics","source_country":"gb","sentiment":0.021},{"id":354900058,"title":"Nolte: Fascist ‘Vanity Fair’ Staffers Threaten Walkout over Proposed Melania Trump Cover","text":"A bunch of fascist staffers are threatening to walk out if the far-left Vanity Fair puts First Lady Melania Trump on the cover.\n\n“I will walk out the motherf***ing door, and half my staff will follow me,’ a mid–level editor told the Daily Mail about the proposal. This came just after news broke that there was an internal effort at Vanity Fair to convince the first lady to agree to a cover shoot.\n\n“We are not going to normalize this despot and his wife,” the fascist added. “We’re just not going to do it. We’re going to stand for what’s right,” the fascist staffer added. “If I have to work bagging groceries at Trader Joe’s, I’ll do it. If … Melania [is] on the cover, half of the editorial staff will walk out, I guarantee it.”\n\nUnder Anna Wintour, Melania Trump never once appeared on a Vanity Fair cover. Yes, for four years, Vanity Fair snubbed the most beautiful and graceful first lady of my lifetime—a first lady who also happens to be a former supermodel.\n\nMichelle Obama made three appearances during her time as first lady.\n\nEven the bland Jill Biden appeared twice when Joe Biden’s autopen was president.\n\nKamala Harris and Hillary Clinton have appeared on the cover.\n\nThe closest Melania got was the cover of Vanity Fair’s Mexico edition in 2017.\n\nWintour’s hand-picked replacement, Mark Guiducci, is apparently looking to make the publication a little less fascist and expand its appeal with what would be a no-brainer decision in a world not made insane by leftist white women.\n\nIf Guiducci is smart, which I doubt, he’ll use this situation to smoke out and then rid his staff of these insufferable and intolerant bullies.\n\nPersonally, I think these staffers hate Melania Trump because she’s an immigrant. What we’re seeing here is the worst kind of bigotry, xenophobia, and anti-immigrant hate, which should not be tolerated at any place of employment.\n\nVanity Fair obviously has a serious hate problem within its ranks and should waste no time in making the hater’s dream come true about a job at Trader Joe’s.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"A bunch of fascist staffers are threatening to walk out if the far-left Vanity Fair puts First Lady Melania Trump on the cover.\n\n\nThe post Nolte: Fascist ‘Vanity Fair’ Staffers Threaten Walkout over Proposed Melania Trump Cover appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/27/nolte-fascist-vanity-fair-staffers-threaten-walkout-over-proposed-melania-trump-cover/","image":"https://media.breitbart.com/media/2025/08/melaniatrump-640x335.jpg","video":null,"publish_date":"2025-08-27 16:15:38","author":"John Nolte","authors":["John Nolte"],"language":"en","category":"politics","source_country":"US","sentiment":-0.226},{"id":354987692,"title":"Trump gesa George Soros, anak didakwa atas pertuduhan jenayah","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump hari ini menggesa billionair George Soros dan anaknya didakwa atas pertuduhan jenayah.\n\n Ia berhubung dakwaan yang kononnya tidak berasas bahawa keluarga hartawan terkemuka AS itu sering kali menjadi sasaran golongan politik sayap kanan.\n\n Keluarga Soros dikritik kerana didakwa terbabit secara rahsia membiayai protes ganas di seluruh negara.\n\n \"George Soros dan anaknya yang hebat berhaluan radikal kiri, patut dituduh mengikut Akta Pengaruh Pemerasan dan Organisasi Rasuah (RICO) kerana sokongan mereka terhadap protes ganas dan banyak lagi,\" kata Trump di platform Truth Social miliknya.\n\nTrump dilaporkan mahu merujuk keluarga Soros itu kepada undang-undang pembabitan dalam organisasi jenayah. \n\nSoros, kelahiran Hungary yang kini berusia 95 tahun, telah lama menjadi sasaran kebencian golongan sayap kanan di Eropah dan AS kerana sokongannya terhadap perjuangan progresif dan Parti Demokrat.\n\nBeliau sering dipersalahkan atas krisis migran di Eropah dan krisis sempadan selatan Amerika, serta dituduh merancang protes besar-besaran, termasuk demonstrasi terhadap kekejaman polis selepas pembunuhan George Floyd pada 2020.\n\nKempen bertahun-tahun terhadap Soros, yang berketurunan Yahudi, sering dituduh bermotifkan sentimen antisemitisme.\n\n\"Soros dan kumpulan psikopatnya telah menyebabkan kerosakan besar kepada negara kita! Termasuk juga rakan-rakannya yang gila dari Pantai Barat,\" tulis Trump di platform Truth Social.\n\n\"Kita tidak akan benarkan orang-orang gila ini menghancurkan Amerika lagi,\" tambahnya sambil memberi amaran: \"Hati-hati, kami sedang memerhati kamu!\"\n\nTrump sebelum ini menuduh Soros di belakang sabitan ke atasnya pada 2024 kerana menutup pembayaran wang tutup mulut kepada seorang pelakon lucah, dengan mendakwa bahawa Soros mengawal pendakwa awam yang membawa kes itu.\n\nPada 2023, Soros mengumumkan bahawa beliau akan menyerahkan kawalan Open Society Foundations kepada anak lelakinya, Alex.\n\nDalam pilihan raya 2024, Alex Soros secara terbuka menyokong lawan Trump dari Parti Demokrat, iaitu naib presiden Kamala Harris.\n\nTidak lama sebelum meninggalkan jawatan pada Januari, Joe Biden menganugerahkan Soros yang lebih tua dengan Presidential Medal of Freedom — anugerah kehormatan awam tertinggi Amerika — sebagai penghargaan terhadap sokongannya kepada \"projek-projek di seluruh dunia yang mengukuhkan demokrasi, hak asasi manusia, pendidikan dan keadilan sosial.\"","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump hari ini menggesa billionair George Soros dan anaknya didakwa atas pertuduhan jenayah.","url":"https://www.bharian.com.my/dunia/amerika/2025/08/1439014/trump-gesa-george-soros-anak-didakwa-atas-pertuduhan-jenayah","image":"https://assets.bharian.com.my/images/articles/BH27TRUMSOROS-O_BHfield_image_listing_featured.var_1756311570.jpg","video":null,"publish_date":"2025-08-27 15:46:23","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.407},{"id":354875754,"title":"Charge them with RICO! Trump goes after George Soros and son in fiery post over violent protests","text":"AP Donald Trump (AP Photo/Mark Schiefelbein)\n\nGeorge Soros Trump feud: US president Donald Trump launched a personal and pointed attack on billionaire philanthropist George Soros and one of his sons, calling on federal prosecutors to charge them under the RICO Act, a statute typically used to combat organized crime, as per a report.Donald Trump Targets George Soros and His Son with Criminal AllegationsTrump wrote on his social media site Truth Social that, \"George Soros, and his wonderful Radical Left son, should be charged with RICO because of their support of Violent Protests, and much more, all throughout the United States of America. We’re not going to allow these lunatics to rip apart America any more, never giving it so much as a chance to 'BREATHE,' and be FREE,\" as quoted in a report by AA.The US president also added that, \"Soros, and his group of psychopaths, have caused great damage to our Country! That includes his Crazy, West Coast friends. Be careful, we’re watching you!\" as quoted in the report.However, Trump did not say what had prompted his morning outburst on Truth Social, but it comes as his administration pursues multiple criminal investigations against his perceived enemies, according to The Straits Times report.ALSO READ: Orange way - the real Dutch secret: A four-day week that boosts happiness without ruining economic growthLive EventsThe Legal Tool Trump Cited: What Is RICO?AA wrote in its report, \"RICO, or Racketeer Influenced and Corrupt Organizations Act, is one of the government's most powerful tools to crack down on organized crime. It was central to the effort to break up the American mafia by allowing prosecutors to tie together apparently unrelated crimes that were being conducted as part of a criminal endeavor.\"Soros Family at Center of Longstanding AttacksThe conspiracy theories involving the Soros family have been going on for a long time, and also in June, when street protests broke out in Los Angeles against a ramp-up of immigration raids as Trump used the demonstrations as justification to deploy the National Guard and Marines into the Democratic-run city, as per The Straits Times report.The US president has also previously accused Soros of being behind his 2024 conviction for covering up hush money payments to a porn star, accusing the financier of controlling the public prosecutor who brought the charges, as per the report.ALSO READ: Meta offers $250 million retention bonus, but Musk poaches 14 AI stars with purpose — Zuckerberg left stunnedAlex Soros: The Face of Soros Philanthropic LegacyWhile Trump did not specify which son should face prosecution, he might be referring to Alexander, as Soros announced in 2023 that he would hand over control of his philanthropic empire to him, according to The Straits Times report.Alex was also a vocal supporter of Trump’s opponent, the former vice president Kamala Harris, in the 2024 election, as per the report. FAQsHas George Soros responded to Trump’s attack?As of now, George Soros has not issued a public response to Trump’s remarks.Which son was Trump referring to?While not named directly, it is likely that Trump was referring to Alex Soros, who took over his father’s philanthropic operations in 2023.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onGeorge Soros latest newsGeorge Soros Trump feudTrump RICO SorosGeorge Soros protest allegationsRICO Act explanationWhat did Trump say about George Soros?Soros family controversyWhy is Trump targeting Soros and his son?Soros family RICO accusations explainedDonald Trump criminal investigations\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onGeorge Soros latest newsGeorge Soros Trump feudTrump RICO SorosGeorge Soros protest allegationsRICO Act explanationWhat did Trump say about George Soros?Soros family controversyWhy is Trump targeting Soros and his son?Soros family RICO accusations explainedDonald Trump criminal investigations(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless","summary":"George Soros Trump feud: Donald Trump has called for George Soros and his son to be charged under the RICO Act, alleging their support for violent protests across the U.S. Trump accuses the Soros family of causing significant damage to the country, including influencing criminal investigations against him. This attack comes amid longstanding conspiracy theories and previous accusations against Soros.","url":"https://economictimes.indiatimes.com/news/international/us/charge-them-with-rico-trump-goes-after-george-soros-and-son-in-fiery-post-over-violent-protests/articleshow/123547866.cms","image":"https://img.etimg.com/thumb/msid-123548032,width-1200,height-630,imgsize-103646,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-27 15:41:32","author":"Sectionscharge Them With Rico! Trump Goes After George Soros And Son In Fiery Post Over Violent Prot","authors":["Sectionscharge Them With Rico! Trump Goes After George Soros And Son In Fiery Post Over Violent Prot"],"language":"en","category":"politics","source_country":"in","sentiment":0.026},{"id":354943374,"title":"Newsom claps back at Trump’s ‘strange hand action’ remark after large bruising noted on president’s hands","text":"Donald Trump once famously bragged that there was “no problem” with his hands, but one of his Democratic rivals isn’t so sure that’s true anymore.\n\nThe president on Tuesday took a shot at California Gov. Gavin Newsom during a three-hour-plus cabinet meeting, remarking that the telegenic Democrat — for years talked about as a potential presidential candidate — is “nice guy, good-looking” but “has some hand action going on.”\n\n“There’s something going on there,” Trump added of Newsom’s hands.\n\nThe bizarre remark appeared to be an allusion to attacks leveled at Minnesota Gov. Tim Walz during last year’s presidential campaign. After the genial Gopher State executive was tapped as then-vice president Kamala Harris’ running mate, Trump’s campaign and many of his allies used video of Walz waving and gesturing during public appearances to falsely imply that he was secretly gay. \n\nBut Newsom, who in recent weeks has been aggressively using social media to mock and attack the president, hit back on X with a simple question: “You really want to have the conversation about hands?”\n\nThe remark could be a callback to a couple of Trump issues involving his hands — one tied to recent health concerns and another over their size, first raised by a then-rival on the 2016 campaign trail.\n\nDuring the 2016 Republican primary Trump got into a debate stage argument with then-Florida Sen. Marco Rubio — now his secretary of state — over the respective sizes of their hands (a metric often used in popular culture as an indicator of a male’s physical endowment) with Trump telling the Floridian: “I guarantee you there's no problem” after Rubio implied that Trump had diminutive hands.\n\nBut Newsom’s timely clap-back also alluded to recent speculation over the condition of Trump’s hands stemming from a series of appearances during which the president showed either visible bruising or heavy, poorly-applied makeup that was attempting to cover the large black-and-blue marks on his right hand.\n\nThe dark marks have been visible on his hands since last summer, at which point then-campaign spokesperson Karoline Leavitt — now White House press secretary — said they were the result of Trump “constantly working and shaking hands all day, every day” amidst the rigors of a presidential run.\n\nBut last month, after reporters pressed Leavitt about both the bruising and a series of photographs showing Trump’s ankles to be very swollen, she released a memorandum from Physician to the President Dr. Sean Barbabella that attributed the “minor bruising on the back of his hand” to “minor soft tissue irritation from frequent handshaking and the use of aspirin,” a pain reliever and blood thinner that is often taken as a preventative.\n\nBarbabella, a U.S. Navy physician who holds the rank of Captain, also said Trump’s swollen legs were a result of “chronic venous insufficiency,” which he called a “benign and common condition” for someone at the age of the 79-year-old former real estate developer. \n\nYet that explanation hasn’t stopped liberal commentators from suggesting more is afoot.\n\nOn Tuesday, YouTuber Keith Edwards — a former staffer for the anti-Trump Lincoln Project — posted a side-by-side comparison of Trump’s hand during a Monday event and the hand of the late Queen Elizabeth II during an audience with then-prime minister Liz Truss.\n\nEdwards noted that the photograph of the late Queen with Truss was taken just two days before she passed, ending more than 70 years on the British throne.","summary":"Trump has sported a prominent bruise on his right hand for several months and attenpted to cover it up with makeup to no avail","url":"https://www.independent.co.uk/news/world/americas/us-politics/gavin-newsom-trump-hand-bruise-b2815067.html","image":"https://static.independent.co.uk/2025/08/25/17/05/South-Korean-President-Lee-Jae-Myung-visits-Washington-q9cpmaed.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/1qHw7Zg4-OhrQWqOm.mp4","publish_date":"2025-08-27 15:35:31","author":"Andrew Feinberg","authors":["Andrew Feinberg"],"language":"en","category":"politics","source_country":"gb","sentiment":0.036},{"id":354893666,"title":"Of course conservatives are being weird about Taylor Swift’s engagement","text":"Megastar Taylor Swift and NFL tight end Travis Kelce announced their engagement on Tuesday, and conservatives from President Donald Trump on down are being weird about it.\n\nThe couple made their announcement on Instagram, quickly becoming one of the most talked-about entertainment stories. And Trump was asked about the couple during a televised Cabinet meeting in which administration officials constantly kissed up to him.\n\n“I wish them a lot of luck. I think he’s a great player. I think he’s a great guy, and I think that she’s a terrific person,” Trump said.\n\nThe comment flies in the face of years and years of attacks that Trump has directed toward Swift, an advocate of women’s rights and a supporter of multiple Democratic presidential candidates.\n\nIn fact, it was just a little over three weeks ago that Trump proclaimed that he “can’t stand her” and that Swift was “NO LONGER HOT” because she is “WOKE.” He made similar remarks in May despite the overwhelming success of her “Eras Tour.”\n\nTrump was even more explicit in his disdain for Swift last year, posting, “I HATE TAYLOR SWIFT!” after she endorsed the presidential campaign of then-Vice President Kamala Harris. In a post to her hundreds of millions of followers, Swift said she came to her decision due to conservatives’ attacks on abortion rights—Trump installed half of the justices that killed Roe v. Wade—as well as her support for access to in vitro fertilization and LGBTQ+ rights.\n\nSwift’s backing for Harris was underscored after she described herself as a “childless cat lady,” a direct rebuke of now-Vice President JD Vance’s attacks on women who choose not to have children.\n\nRight-wing influencer Charlie Kirk had weird “advice” for the couple, saying, “Submit to your husband, Taylor. You're not in charge.” Kirk, who leads the racism-plagued group Turning Point USA, also insisted that Swift should “have a ton of children.”\n\nIn a 2019 red-carpet appearance, Swift pointed out the sexism in comments like this, noting that while women are often asked about wanting children, “I don't really think men are asked that question when they turn 30, so I'm not going to answer that now.”\n\nIn another strange reaction, conservative influencer Matt Van Swol argued that the engagement announcement was “a huge blow to the woke movement.”\n\nThe bizarre takes from right-wing men to a celebrity engagement announcement makes it clear they need to take Swift’s advice and “calm down.”","summary":"Megastar Taylor Swift and NFL tight end Travis Kelce announced their engagement on Tuesday, and conservatives from President Donald Trump on down are being weird about it.\n\n\n\nThe couple made their announcement on Instagram, quickly becoming one of the most talked-about entertainment stories. And Trump was asked about the couple during a televised Cabinet meeting in which administration officials constantly kissed up to him.\n\n\n\n“I wish them a lot of luck. I think he’s a great player. I think he’s a great guy, and I think that she’s a terrific person,” Trump said.\n\n\n\nThe comment flies in the face of years and years of attacks that Trump has directed toward Swift, an advocate of women’s rights and a supporter of multiple Democratic presidential candidates.\n\n\n\n\nx\n\n\nx\nYouTube Video\n\n\nIn fact, it was just a little over three weeks ago that Trump proclaimed that he “can’t stand her” and that Swift was “NO LONGER HOT” because she is “WOKE.” He made similar remarks in May despite the overwhelming success of her “Eras ","url":"https://www.dailykos.com/story/2025/8/27/2340488/-Of-course-conservatives-are-being-weird-about-Taylor-Swift-s-engagement?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1471988/story_image/AP25238647630663.jpg?1756306106","video":null,"publish_date":"2025-08-27 15:30:09","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","source_country":"US","sentiment":-0.086}]}