{"offset":0,"number":50,"available":481,"news":[{"id":300864654,"title":"Democratic insiders complain Kamala Harris is ‘MIA’ after election: ‘Not the leadership the world needs’","text":"It’s a game of political hide and seek.\n\nDemocratic insiders are still stinging from losing the election to Donald Trump — and view Kamala Harris as a political “Where’s Waldo” who’s gone “MIA,” they say.\n\n“She’s MIA!” groused one Democratic insider to Page Six of Harris. \n\nThe political source added Harris’ husband “Doug [Emhoff] is telling people she’s the leader of the party, but there is a clear lack of leadership.”\n\n“The person you just spent $2 billion on trying to elect? I’m glad she’s having a good time going to a musical, and being repped by CAA,” said the insider, but, “this whole strategy of ‘do not do anything, or say anything,’ that’s not the kind of leadership the world needs right now.”\n\nLast month Harris signed with CAA, and saw “A Wonderful World” and “Gypsy” on Broadway.\n\n(Another source told us of Harris, and Joe Biden who’s also repped by the Hollywood power agency, “I don’t think bookings for them are through the roof.”)\n\nThe first source said they’re not a fan of California Gov. Gavin Newsom, who just launched a podcast, but, “at least he’s out there doing stuff.” With Harris, “It shows how kind of old the thinking is. Like, ‘Well I’m not going to run [for governor] for a year and a half, so I’ll go away.”\n\nThe source said, “One of her problems is that she’s the most risk-averse person on the planet. That’s one of the reasons she lost,” including too few interviews. “There was nothing to peel the onion back for people.”\n\nA new Telegraph opinion piece said of the election, “Another failure was Kamala Harris’ avoidance of new media forms,” and, a donor groused to the San Francisco Standard, “This was such a gut punch of an election for so many Democratic donors — not to mention an expensive gut punch. A number of the people I’ve talked to were just like, ‘What the f–k did I burn all that money for?’”\n\nBut a source familiar with the veep points out she appeared at the NAACP Image Awards, is fund-raising for the DNC and talking to federal and state leaders.\n\n“She’s talking to folks, not running around trying to get press,” said the insider, adding that followers are “eager to support her and they’re giving her space” to make her next move.","summary":"“The person you just spent $2 billion on trying to elect? I’m glad she’s having a good time going to a musical, and being repped by CAA,” said a source.","url":"https://pagesix.com/2025/03/16/society/democratic-insiders-complain-kamala-harris-is-mia-after-election-not-the-leadership-the-world-needs/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/03/100604220.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-16 23:55:42","author":"Ian Mohr","authors":["Ian Mohr"],"language":"en","category":"politics","source_country":"us","sentiment":-0.206},{"id":300855436,"title":"SNP ‘risking UK national security’ with ‘blunders’ over Donald Trump & Putin","text":"SNP chiefs’ foreign policy “blunders” could put national security at risk, Downing Street sources have warned.\n\nJohn Swinney and Stephen Flynn were accused of playing into tyrant Vladimir Putin’s hands by blasting No10 over the US-Ukraine crisis.\n\nIt follows Donald Trump’s fall-out with Volodymyr Zelensky in the White House. \n\nMr Swinney insisted the “disturbing” clash last month made the US leader’s UK state visit “unthinkable”.\n\nAnd Nats’ Commons leader Mr Flynn slammed Sir Keir Starmer “weak” response to the tensions.\n\nNo10 insiders insisted the pair had slipped up by showing the UK as divided.\n\nA source said: “There are real concerns Mr Swinney and Mr Flynn are blundering on foreign policy by seeking to politicise issues around the US President and the Ukraine war.”\n\nThere were also fears that the First Minister risked a “devastating” trade war by upsetting the US. \n\nDowning Street sources told how Mr Trump “keeps a close eye” on interventions from Scots politicians due to his family’s roots and golf resorts here.\n\nMr Swinney previously backed his Democratic presidential rival Kamala Harris. \n\nTory Shadow Scottish Secretary Andrew Bowie said: “Given the need to protect our security in this uncertain world, nationalist politicians should be much more mindful before offering their opinions.”\n\nA Scottish Government spokesman declined to comment.\n\nBut they told how the SNP leader had held talks with Labour Foreign Secretary David Lammy on international issues.","summary":"","url":"https://www.thescottishsun.co.uk/news/14499074/snp-national-security-blunders-donald-trump-putin/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/03/MixCollage-16-Mar-2025-10-59-PM-7467.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-03-16 23:00:06","author":"Conor Matchett","authors":["Conor Matchett"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.17},{"id":300854392,"title":"Trump and recent gains give the California Republican Party hope","text":"A caravan of pickup trucks waving large President Trump flags circled the California Republican Party’s convention this weekend, with drivers occasionally hopping out to dance to the Village People song “Y.M.C.A.,” a favorite tune at the president's rallies. Inside, delegates posed with giant cutouts of Trump, wore glittery gold-sequined jackets emblazoned with “Trump the Golden Era” and snapped up “MAGA” rhinestone jewelry. Once dominated by Reagan-era Republicans who favored traditional conservative policies including opposing the Russia-led Soviet Union and favoring free trade, the California GOP is being reshaped by Trump’s populism. \"Just like Reagan was transformational figure in the political world, Donald Trump is a transformational figure,\" said former state GOP chairman Jim Brulte. For a party that has long been largely irrelevant in California politics — having last elected a statewide candidate nearly two decades ago — there were some bright spots in the November election. Republicans increased their representation in both houses of the state Legislature, the first time the GOP has done so in a presidential election year since 1980. Though Trump lost the state by 20 points to former Vice President Kamala Harris, the Democratic presidential nominee and Californian, the Republican received more votes in November here than he did in the last two presidential elections. Trump also did better with Latinos across the nation, winning 43% of their votes, according to the Associated Press. In California, Republicans increased their support from this voting bloc as well, according to the nonpartisan Cook Political Report as well as GOP officials. \"Here's the secret sauce. You ready for it?\" Rep. Tony Gonzalez (R-Texas) told California Republicans at the party's Saturday luncheon. \"You have to show up. Step one, show up. Show up early. Show up often. Don't speak a little bit of broken Spanish. Don't throw up an ad and then call it good two weeks at the tail end of election.\" Gonzalez, whose district has the most border miles of any congressional district in the nation, said Latino voters care about the same issues as most voters — the economy, safety and the education of their children. \"Be genuine,\" he added. \"You don't have to be perfect. You don't have to tell them what you think they want to hear.\" Assemblywoman Leticia Castillo, a Republican elected in November to represent a Democratic district with that includes swaths of Riverside and San Bernardino counties, said in addition to constant door-knocking, she reached out to Latinos in unconventional ways. She advertised about her parents' immigrant roots and her priorities in popular local Spanish-language magazines that focus on soccer and quinceañeras. \"We're talking about values, and we're talking about what your beliefs are. And it was not that difficult to get people on board. They want the message, but they don't know there's a message that they need until you bring it to them,\" she said. State GOP leaders said such legislative gains were prompted by structural changes, including registering 1 million additional Republican voters over the past six years and focusing on early voting, ballot harvesting and other election day tactics long embraced by Democrats. The party also launched a concerted effort to appeal to Latino voters more consistently and aggressively than prior decades. \"I don't think it happened overnight,\" state Republican Party chairwoman Jessica Millan Patterson, whose tenure just ended, told reporters on Saturday. Describing Latinos as a community that had been previously \"neglected\" by the party, she added: \"In 2019 we started going to farms and talking to farm workers, and we were talking about the things that were important to my community, and that was making sure you have a good job. It was making sure your kids got a great education so they could have a better life than you. It was making sure that you had safe streets.\" Though she argued that Democrats had failed on such issues, she acknowledged that they had long been a presence in Latino communities. \"Democrats showed up, and Democrats made them feel like they cared about their problems,\" Millar Patterson said. Trump also did better among Latino and Black voters than other recent Republican presidential nominees, so it's unclear whether California Republicans improved performance is part of a fundamental realignment of the base of the political parties or if it's specific to Trump and evaporates once he leaves office. Getting Trump voters to turnout in elections when he is not on the ballot can be challenging, Millan Patterson added. That became evident during the failed recall election against Democratic Gov. Gavin Newsom, she said. Over a million more Californians voted for Trump in the 2020 presidential election than voted to recall Newsom in 2021. Trump's influence, and imprint, on the current California Republican Party was clear throughout the three-day convention in Sacramento. Panels during the three-day gathering at the Hyatt Regency and the convention center in Sacramento focused on issues such as “lawfare,” a practice Trump supporters argue weaponized the legal system against him and his goals. Republicans also touted a potential 2026 California ballot measure to require voter ID and proof of citizenship for anyone casting ballots, which Trump demanded the state adopt in exchange for federal disaster relief in the aftermath of the deadly Los Angeles-area wildfires earlier this year. The most prominent speaker was Riley Gaines, a former collegiate swimmer who has railed against transgender athletes competing in women’s sports, a focus during Trump’s second election campaign. \"I do believe the issue of allowing men into women's sports, it was the sleeper issue of the election,\" she told the Republican crowd. \"I believe, of course, that people turned up to the polls to embrace Donald Trump, to embrace the America first agenda ... but more so, I believe that people turned up to the polls to reject absurdity, and that is what the Democratic Party has become.\" The shifting voting dynamics in the state could have ramifications in next year's midterm elections, where Californians are expected to play a major role in deciding which party wins control of the House. The midterm elections are likely to be rocky for Republicans because the party that wins the White House frequently takes a beating in congresssional elections two years later. And in 2024, congressional races were a weakpoint for the GOP even as the party was victorious in House races across much of the country. Millar Patterson said the loss of three Republican congressional incumbents in 2024 was prompted by the competitiveness of their districts and a lack of resources. Former House Speaker Kevin McCarthy (R-Bakersfield), who was one of the most prodigious fundraisers in Congress and lavished money on California Republicans, left office in 2023. This speaks to a broader fundraising problem facing the party. Millan-Patterson was a McCarthy protege. The last party chairman, former legislative leader Brulte, had an Rolodex teeming with donors. The party's future fundraising prospects are uncertain. But the face of the party is clearly changing, as evidenced at a celebration of party leaders Friday evening. Eight former chairs, all older white men, took the stage to Thin Lizzy's \"The Boys Are Back in Town.\" They saluted Millan-Patterson, the party's first Latina, female and millennial leader, who left the stage to Billy Joel's \"Uptown Girl.\" On Sunday, the party elected its new leader, Corrin Rankin. She's the state party's first Black leader. \"Change is coming to California. It's time to end the Democrats one party rule and make California great again,\" she told delegates after winning the leadership post. \"We're going on the offense. We need to expand the battlefield and to take the fight to every corner of our state.\"","summary":"The California Republican Party made slight gains in California, attracting more new voters than the Democrats, but can that continue after Trump","url":"https://www.latimes.com/politics/story/2025-03-16/california-republican-party-convention","image":"https://ca-times.brightspotcdn.com/dims4/default/a47789c/2147483647/strip/true/crop/1140x599+0+76/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff7%2F8e%2F8435bb0b42578c7cda1727331b29%2F20250316-amx-us-news-r","video":null,"publish_date":"2025-03-16 22:40:21","author":"Seema Mehta","authors":["Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":0.189},{"id":300850174,"title":"US Democrats ratings drop to all-time low - CNN poll","text":"The Democratic party’s favorability rating among the American public has hit a record low, a new CNN poll suggests. \n\nThe poll, commissioned by the broadcaster, was conducted by pollster SSRS, between March 6 and 9, sampling opinions of some 1,206 respondents. It indicated the approval rating of the party stands at just 29% - a record low in CNN regular polling carried out since 1992. The Republican party fares better with its rating currently standing at 36%, the poll shows. \n\nThe partisan approval differed for the two parties as well, with just 63% of Democrats and Democrat-learners speaking favorably of their party, while some 79% of Republicans and Republican-leaning independents approved of the GOP. Independents, however, do not regard either of the parties highly, with their favorability ratings hovering around the 20% mark.\n\nThe Democrats have also struggled with consolidating any party leader supposed to “best reflect the core values,” the poll suggested. New York Rep. Alexandria Ocasio-Cortez topped the list, with 10% of Democratic-aligned respondents picking her for such a role. \n\nFormer VP and Democratic presidential runner Kamala Harris got 9% and US Senator Bernie Sanders received 8% support. Only 1% of Democratic-aligned respondents picked former US President Joe Biden, while over 30% gave no option on the matter or opposed all the high-profile Democrats.\n\nThe poll has also suggested the Democratic-aligned Americans have taken an increasingly combative approach towards the Republicans, with some 57% stating the party’s lawmakers should focus on stopping the GOP agenda rather than advancing their own ideas. Only 42% said the lawmakers should cooperate with their GOP counterparts. \n\nThe figures constituted a drastic shift in the sentiment compared to the first tenure of US President Donald Trump - according to a CNN poll conducted in September 2017, some 74% of Democratic respondents said the party should cooperate with the Republicans while only 23% said it should focus on disrupting their agenda.","summary":"The favorability rating of US Democrats has hit an all-time low, a new CNN poll indicates \nRead Full Article at RT.com","url":"https://www.rt.com/news/614325-democrats-ratings-cnn-poll/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67d749ca85f540752a34c0fd.jpg","video":null,"publish_date":"2025-03-16 22:03:49","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.095},{"id":300828598,"title":"‘A Is for Abortion’: Public High School Teaches ABCs for Women’s History Month","text":"America’s public high schools are strange places to find displays of the alphabet. Perhaps with plummeting standardized test scores and a substantial increase in English-as-a-second-language students in sanctuary districts, high school educators feel the need to review kindergarten basics. In Fairfax County, Virginia’s West Springfield High School, located just 17 miles from the White House, school administrators and teachers have decorated the history hallway this month with a special, leftist rendition of the alphabet.\n\nThe display, titled “The ABCs to ME,” is decorated with the school’s colors: a blue background lined with an orange border. Featured in the display is a sign that reads, “A is for Abortion” with an image of a coat hanger with a positive pregnancy test.\n\nA description of the display says that it is being posted for Women’s History Month, which is March, and that “the Women’s History class in celebrating and bringing awareness to what it means to be a young woman today at West Springfield High School and in the world.”\n\n“This is horrible even by Fairfax County Public Schools’ standards,” said a mother with a child who attends the school.\n\nIf the alphabet display ended with “A,” it would still be awful. Not surprisingly though, the activist public educators involved in decorating the taxpayer-funded school’s hallway with propaganda didn’t stop there.\n\nWalking through the hallway, students are alerted that “H is for Hope” and, somehow, Kamala Harris is the image representing “hope” on the sign. This one is particularly confusing. I’m not sure that she ever truly represented hope for anyone, even Democrats.\n\nThe alphabet display further informs that “J is for Justice.” The accompanying image is of the Statue of Liberty holding a female sign in place of a torch, with her other fist in the air. Lady Liberty is surrounded by the Palestinian flag, Ukrainian flag, and transgender flag.\n\nWho could argue with “L is for Leadership”? That is, until you see its associated image featuring Kamala Harris, Alexandria Ocasio-Cortez, and Michelle Obama.\n\nIn honor of Women’s History Month, the high school’s teachers and staff seem to try their best to alienate male students. To that end, “M is for Mansplain,” a derogatory term to indicate when men try to explain things to women.\n\n“N is for NOW,” the National Organization for Women, which is such a silly name for an organization that supports males in women’s sports, bathrooms, and locker rooms.\n\n“Q is for Queer.” The “Queer” in LGBTQ seems to be an umbrella letter to boost numbers and make more people feel as though their identity is special when they don’t think they fit under the L, G, B, or T categories. I guess in the leftist alphabet display, you can’t really make it through without throwing plenty of pork to the alphabet people.\n\nTo that end, West Springfield’s students cannot escape the notoriously liberal history corridor without noting that “T is for Trans Women.” The sign displays a transgender flag heart inside the circle of the symbol for a female.\n\nSchool district policy continues to compel speech by mandating preferred pronouns in the code of conduct, despite such mandates being under investigation by the U.S. Department of Education’s Office of Civil Rights. Fairfax County’s leaders, along with many others across the country, seem to believe their local jurisdictions are not subject to state and national laws or the Constitution.\n\nAnd to cap it all off, “Z is for male gaZe,” just proving to us once again, in case the poor test scores are not enough, that leftist education is more about indoctrination.\n\nThere is simply no defense for this display, which would be expected in the Democratic Party’s National Headquarters but not in a taxpayer-funded public school. It is highly inappropriate, ideologically homogenous, and sadly, representative of our K-12 public education system. This display clearly encapsulates the pervasive rot in the public education system and the pressing need for school choice in America.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"America’s public high schools are strange places to find displays of the alphabet. Perhaps with plummeting standardized test scores and a substantial increase in English-as-a-second-language... Read More\n\n\nThe post ‘A Is for Abortion’: Public High School Teaches ABCs for Women’s History Month appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/03/16/is-abortion-public-high-school-teaches-womens-history-month/","image":"https://www.dailysignal.com/wp-content/uploads/2025/03/march.jpg","video":null,"publish_date":"2025-03-16 19:53:44","author":"Aligning Their Money,Stephanie Lundquist-Arora","authors":["Aligning Their Money","Stephanie Lundquist-Arora"],"language":"en","source_country":"us","sentiment":-0.033},{"id":300824440,"title":"MAGA activists hunt down woman who 'accidentally' hit Donald Trump with her mic: 'A massive hater'","text":"President Donald Trump was recently hit by the mic of a reporter as he was interacting with them at a military airport. Trump did not overlook the situation and gave a 'death stare' to the reporter before lightly commenting that the reporter became a big story tonight. \"Did you see that?\" Trump said reacting to the little accident as he was about the situation in Gaza. \"She just became a big story tonight,\" he said. But the Republicans did not let go of the situation as lightly as Trump did. Colorado Republican Lauren Boebart said former president Joe Biden would have fallen down by that mic hit while others wondered whether it was intentional. \"A blow like that would've laid Biden out!\" Boebart commented. \"President Trump was just smacked in the face by a reporter's boom mic. Unreal these people. Have some respect,\" Conservarcommentator Charlie Kirk said. — LauraLoomer (@LauraLoomer) — TCNetworkFans (@TCNetworkFans) — laurenboebert (@laurenboebert) Laura Loomer went a step ahead and claimed that she identified the reporter who hit Trump as Danielle Kurtzleben. \"She is the newly appointed White House reporter for NPR and a massive Trump hater and LGBTQ advocate who once suggested during the 2024 campaign that Trump only spoke in Howell, Michigan because it has ties to the KKK. Did she hit President Trump in the face on purpose?\" Loomer posted. Loomer, known as a conspiracy theorist, dug out the reporter's comments about the election and pointed out that she is definitely a Democrat and a Kamala Harris supporter as she declared that Trump lost to Kamala Harris in the debate. \"She has a well documented history of being a massive Trump hater and advocate of Trans issues. I don’t think the mic in Trump’s face was an accident,\" Loomer said. MAGA supporters demanded a statement from NPR on the incident and demanded that the reporter's White House clearance be revoked.","summary":"Loomer, known as a conspiracy theorist, dug out the reporter's comments about the election and pointed out that she is definitely a Democrat and a Kamala Harris supporter as she declared that Trump lost to Kamala Harris in the debate.\"She has a well documented history of being a massive Trump hater and advocate of Trans issues. I don’t think the mic in Trump’s face was an accident,\" Loomer said.","url":"https://timesofindia.indiatimes.com/world/us/maga-activists-hunt-down-woman-who-accidentally-hit-donald-trump-with-her-mic-a-massive-hater/articleshow/119086457.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-119086437/119086437.jpg","video":null,"publish_date":"2025-03-16 19:25:32","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.422},{"id":300847710,"title":"‘No pain, no gain’: GOP tells Americans to suck it up as economy worsens","text":"Congressional Cowards is a weekly series highlighting the worst Donald Trump defenders on Capitol Hill, who refuse to criticize him—no matter how disgraceful or lawless his actions.\n\nAs President Donald Trump's pointless trade wars and devastating cuts to federal agencies raise fears of a painful recession, GOP lawmakers took to cable news this week to tell Americans that they need to accept a little hardship to let Trump get his way.\n\nRepublicans have finally given up on lying to Americans about who pays the price for tariffs and have changed their approach by telling Americans to just accept higher prices for a bit while Trump’s trade war plays out.\n\n\"No pain, no gain. That's what we used to tell our football players. There's gonna be some pain with tariffs. But tariffs got us back as a strongest economy in the world when President Trump was in the first time. He knows what he's doing. Democrats get out of the way. Shut up,” Republican Sen. Tommy Tuberville of Alabama said on Fox Business.\n\n Similarly, when presented with statements from companies saying their increased prices are due to Trump's tariffs, GOP Rep. Nicole Malliotakis of New York lied, saying that Trump's tariffs aren't actually in effect. \n\nIn reality, his additional 10% tariff on China is in place, as is the 25% tariff Trump put on all steel and aluminum imports from Canada.\n\n\"The tariffs haven't even gone into effect. They've been postponed,\" Malliotakis said on CNN.\n\nAnd Republican Sen. Markwayne Mullin of Oklahoma made an incoherent argument about why it’s okay that tariffs will cost consumers more.\n\n\"Tariffs is a tax. And it will be passed on to consumers. But it also allows us to have open markets,” Mullin said in an appearance on CNN. \n\nMeanwhile, other Republicans downplayed the stock market’s steep decline from Trump's tariff policy. \n\nThe Dow Jones Industrial Average is down more than 7% over the last month, while the S&P 500 is now in correction, which happens when a stock market falls 10% or more. \n\nMarketWatch reported that the stock markets \"logged their weakest first 50 days of a presidency since 2009—when President Barack Obama assumed the mantle in the midst of the global financial crisis.\"\n\n\"We were probably over-bloated with the stock market here for a while. We went up quite a bit,\" Tuberville said during another appearance on Fox Business.\n\nFreshman GOP Sen. Tim Sheehy of Montana said it's fine that the stock market is tumbling because it was too high when Joe Biden was in office—a new and novel excuse.\n\n\"First of all, the stock market has been on a sugar high a long time. We all love a good stock market, but the reality is that stock market imbalance did not necessarily benefit the smaller, mid-sized companies and average shareholders across the country, and it didn't necessarily benefit main street that much. So I think we are gonna see a correction there. But the reality is the stock market is not the economy, the economy is not the stock market, it's not uncommon for uncertainty to cause disruptions to that,” Sheehy said on CNN. \n\nAnd he made the same argument on Fox Business.\n\n\"Our economy has been on a sugar high for a long time. What we're seeing here from this administration and what you're gonna see from this Congress is re-disciplining to ensure that our economy is based on private investment and free-market growth,” he said.\n\nOther GOP lawmakers said they think it’s fine that Trump crashed the stock market because it would have been worse under former Vice President Kamala Harris.\n\n\"We have to remember that if Kamala Harris had won on November 5, the stock market would be down 50%. This country would be on a path to ruin. What President Trump inherited is a disaster from Biden,” Sen. Bernie Moreno of Ohio said—without evidence.\n\nOthers claim that Americans won't feel the benefits of Trump's economy for some time because Biden left it in a mess. But of course, Biden left Trump with a strong economy with low unemployment and steady growth.\n\n\"He's got a big mess to clean up from the previous administration, and he's only been in office a little more than 50 days,\" Rep. Lisa McClain of Michigan said on CNN.\n\nBut Trump's tariffs and government cuts have left economists predicting that growth may stagnate or even go negative in the first quarter of the year, effectively ruining the strong economy that Biden left behind.\n\nMeanwhile, the GOP’s defense of Trump's economic policies is not likely to appease Americans.\n\nPolling shows that a majority of Americans disapprove of Trump's handling of the economy. A Quinnipiac University survey released Thursday found that just 41% of voters approve of Trump's handling of the economy—the issue that largely got him elected in November.\n\nIn fact, an Axios focus group of Michigan Trump voters showed signs of buyer’s remorse.\n\n“[Trump] campaigned on lowering prices and making things more affordable for working-class people. He's moving in the opposite direction,” a 43-year-old Michigan voter said. \n\nAnd another 31-year-old voter expressed that \"I was voting for him based off of the economy the first time around, and I'm seeing a significant decline.”\n\nAmericans are certainly feeling the pain. So where’s the gain?\n\nThank you to the Daily Kos community who continues to fight so hard with Daily Kos. Your reader support means everything. We will continue to have you covered and keep you informed, so please donate just $3 to help support the work we do.","summary":"Congressional Cowards is a weekly series highlighting the worst Donald Trump defenders on Capitol Hill, who refuse to criticize him—no matter how disgraceful or lawless his actions.\n\n\n\nAs President Donald Trump's pointless trade wars and devastating cuts to federal agencies raise fears of a painful recession, GOP lawmakers took to cable news this week to tell Americans that they need to accept a little hardship to let Trump get his way.\n\n\n\nRepublicans have finally given up on lying to Americans about who pays the price for tariffs and  have changed their approach by telling Americans to just accept higher prices for a bit while Trump’s trade war plays out.\n\n\n\n\"No pain, no gain. That's what we used to tell our football players. There's gonna be some pain with tariffs. But tariffs got us back as a strongest economy in the world when President Trump was in the first time. He knows what he's doing. Democrats get out of the way. Shut up,” Republican Sen. Tommy Tuberville of Alabama said on Fox Business.\n\n\n\n\nx\n\n\nx\n","url":"https://www.dailykos.com/story/2025/3/16/2310195/--No-pain-no-gain-GOP-tells-Americans-to-suck-it-up-as-economy-worsens?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1408795/story_image/CongressionalCowards_3.14.png?1741978640","video":null,"publish_date":"2025-03-16 19:00:06","author":"Emily Singer","authors":["Emily Singer"],"language":"en","category":"business","source_country":"US","sentiment":-0.091},{"id":300807360,"title":"Poll: Democratic Party Favorability Sinks to Historic Low","text":"Almost nobody cares about the Democratic Party anymore, not even its own membership. That is the outcome delivered by a poll released Sunday that shows the party’s favorability rating among Americans has sunk to a historic low thanks in part to underwhelming views from its own frustrated supporters.\n\nA CNN poll conducted by SSRS found with many in the Democratic Party publicly say their meek leaders should do more to challenge President Donald Trump, Democrats and Democratic-aligned independents say, 57 percent to 42 percent, that Democrats should mainly work to stop the Republican agenda, rather than working with the GOP majority to get some Democratic ideas into legislation.\n\nCNN reports that weak, dithering leaders and poor political judgement combine to disillusion former backers of the party which has seen it slide into irrelevance:\n\nThe majority’s desire to fight the GOP marks a significant change in the party’s posture from the start of Trump’s first term. A September 2017 poll found a broad 74% majority of Democrats and Democratic leaners saying their party should work with Republicans in an attempt to advance their own priorities, and just 23% advocating for a more combative approach.\nDemocratic-aligned adults say, 52% to 48%, that the leadership of the Democratic Party is currently taking the party in the wrong direction. That’s another shift from eight years ago, when views on this metric were largely positive.\nAmong the American public overall, the Democratic Party’s favorability rating stands at just 29% – a record low in CNN’s polling dating back to 1992 and a drop of 20 points since January 2021, when Trump exited his first term under the shadow of the January 6 attack at on Capitol. The Republican Party’s rating currently stands at 36%.\n\nOverall Democrats have yet to consolidate around any one-party leader to serve as a counterpoint to a surging and increasingly confident President Donald Trump.\n\nCNN further reports that when asked in an open-ended question to name the Democratic leader they feel “best reflects the core values” of the party, “10% of Democratic-aligned adults name New York Rep. Alexandria Ocasio-Cortez, 9% former vice president Kamala Harris, 8% Vermont Sen. Bernie Sanders and 6% House Minority Leader Hakeem Jeffries. Another 4% each name former president Barack Obama and Texas Rep. Jasmine Crockett, with Schumer joining a handful of others at 2%.”\n\nMore than 30 percent didn’t – or simply couldn’t – offer a name in response. “No one,” one respondent answered. “That’s the problem.”\n\nSurveys were obtained March 6-9, 2025, with a representative sample of n=1,206 respondents. The margin of sampling error for total respondents is +/-3.3 at the 95% confidence level.\n\nFollow Simon Kent on Twitter: Follow @SunSimonKent or e-mail to: skent@breitbart.com","summary":"Almost nobody cares about the Democratic Party anymore, not even its own membership. That is the outcome delivered by a poll released Sunday that shows the party's favorability rating among Americans has sunk to a historic low thanks in part to underwhelming views from its own frustrated supporters.\n\n\nThe post Poll: Democratic Party Favorability Sinks to Historic Low appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/03/16/poll-democratic-party-favorability-sinks-to-historic-low/","image":"https://media.breitbart.com/media/2025/02/AP25035742375162-640x335.jpg","video":null,"publish_date":"2025-03-16 16:19:43","author":"Simon Kent","authors":["Simon Kent"],"language":"en","category":"politics","source_country":"US","sentiment":-0.287},{"id":300758086,"title":"REVEALED: Which Americans will be hit hardest by Trump's trade wars with Canada and China... and it might spark him to change his mind","text":"REVEALED: Which Americans will be hit hardest by Trump's trade wars with Canada and China... and it might spark him to change his mind\n\nPODCAST: Former White House Press Secretary Sean Spicer on Karoline Leavitt and the biggest myth about Trump. Listen to Welcome to MAGAland here\n\nBy RACHEL BOWMAN FOR DAILYMAIL.COM\n\nPublished: 14:01 GMT, 16 March 2025 | Updated: 14:12 GMT, 16 March 2025\n\nDonald Trump's escalating trade war will hit the president's supporters the hardest, according to a new analysis.\n\nThe president has beefed up tariffs as part of his effort to reshape America's trading partnership with the world.\n\nMany of the US trading partners have slapped retaliatory tariffs on American goods in response to the White House's steep levies. \n\nA New York Times analysis found that nearly 8 million Americans, most of whom are Trump voters, work in industries targeted by the retaliation tariffs.\n\nApproximately 4.48 million workers affected are in counties that voted for Trump in the last election, compared with 3.26 million jobs in counties that voted for Kamala Harris. \n\nThe EU is targeting U.S. industrial and farm products from Republican-led states in its counter-tariffs, focusing on American meat, bourbon, motorcycles, peanut butter and jeans. \n\nCanada responded to Trump's new tariffs by announcing $21 billion in new tariffs targeting imports of U.S. computers and sports gear.\n\nThe trade war with China dramatically escalated this month after Trump doubled the tariffs it imposed on Chinese imports to 20 percent. \n\nDonald Trump 's escalating trade war will hit the president's supporters the hardest\n\nApproximately 4.48 million workers affected are in counties that voted for Trump in the last election, including many rural parts of the country that produce agricultural goods\n\nBeijing responded with up to 15 percent reciprocal tariffs on some U.S. farm goods that come from rural areas where workers voted for Trump.\n\nThe industries hit hardest are concentrated in parts of the upper Midwest, South and Southeast, including many rural parts of the country that produce agricultural goods, according to the study.\n\nThe retaliatory tariffs target industries in swing states that employ 9.5 percent of people in Wisconsin, 8.5 percent of people in Indiana and 8.4 percent of people in Iowa. \n\nExperts say industries hit by retaliatory tariffs are likely to sell fewer goods on foreign markets, which could lead to lower profits and job losses.\n\nA new DailyMail.com poll, conducted with J.L. Partners, shows that voters are still unsure about tariffs.\n\nLess than 40 percent support more tariffs on various imported products from foreign countries, although roughly 30 percent of voters remain unclear of how they feel about them.\n\nThirty-nine percent of voters in the poll support more tariffs on precious metals, pearls and stones, 37 percent support them on plastics.\n\nOther tariffs most supported by Americans include vehicles, machinery and iron and steel.\n\nThe EU is targeting U.S. industrial and farm products from Republican-led states in its counter tariffs, focusing on American meat, bourbon and motorcycles\n\nThe tariffs that remain the least popular are on pharmaceutical products, clothing, and furniture.\n\nTrump's tariffs caused the 7th fastest stock market slump on record on Thursday when the S&P 500 dropped below 10 percent.\n\nA 10 percent drop is a big enough deal that professional investors have a name for it - a 'correction' - and the S&P 500´s 1.4 percent slide on Thursday sent the index to its first since 2023.\n\nThe losses came after Trump upped the stakes in his trade war by threatening huge taxes on European wines and alcohol.\n\nThe turbulence is a result of uncertainty about how much pain Trump will let the economy endure through tariffs and other policies in order to reshape the country and world as he wants.\n\nChinaNew York TimesCanadaDonald Trump\n\nShare or comment on this article:\nREVEALED: Which Americans will be hit hardest by Trump's trade wars with Canada and China... and it might spark him to change his mind\n\nAdd comment","summary":"The president has beefed up tariffs as part of his effort to reshape America's trading partnership with the world, sparking a bitter trade war.","url":"https://www.dailymail.co.uk/news/article-14504431/trump-trade-wars-americans-impact-canada-china-tariffs.html","image":"https://i.dailymail.co.uk/1s/2025/03/16/13/96246117-0-image-m-34_1742133271869.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/12/801601651273088708/1024x576_MP4_801601651273088708.mp4","publish_date":"2025-03-16 14:12:08","author":"Editor,Rachel Bowman","authors":["Editor","Rachel Bowman"],"language":"en","category":"politics","source_country":"gb","sentiment":0.291},{"id":300775680,"title":"Democrats' favorable ratings drop to record low in new national poll","text":"The Democratic Party's favorable ratings are falling to new lows, according to two new national polls. Just 29% of those questioned in a CNN poll released on Sunday say they have a favorable view of the party, with 54% holding an unfavorable view. That's a record low in CNN polling dating back more than three decades. The Democrats' favorability has dropped four points since early January, ahead of the start of President Donald Trump's second tour of duty in the White House, and it's a plunge of 20 points from January 2021, just ahead of the start of former President Joe Biden's term in office. NEWSOM, PRITZER, BUTTIGIEG, AMONG THE DEMOCRATS MAKING EARLY 2028 MOVES Just 63% of Democrats and Democratic-leaning independents questioned in the survey said they hold a favorable view of the party, down from 72% in January and down from 81% four years ago, at the start of the Biden administration. It was a similar story in an NBC News national poll also released on Sunday. Just 27% of registered voters said they had a positive view of the Democratic Party, which was the party's lowest rating in NBC News polling dating back to 1990. The NBC News poll was conducted March 7-11. The Democratic Party is in the political wilderness, following last November's election setbacks, when Republicans won back control of the White House and the Senate, and defended their fragile House majority. And Republicans made gains among Black and Hispanic voters, as well as younger voters, all traditional members of the Democratic Party's base. HEAD HERE FOR THE LATEST FOX NEWS POLLING According to the CNN poll - which was conducted March 6-9 by SSRS - the favorable rating for the GOP stands at 36%, with 48% holding an unfavorable view of the Republican Party. The GOP's favorable rating is unchanged from January, with the unfavorable rating up four points. The Republican Party was also underwater in the NBC News poll, with a 39% favorable and 49% unfavorable rating. The new surveys, released Sunday, follow a Quinnipiac University national poll last month that made headlines by indicating the Democrats' favorability had also hit an all-time low in their surveys dating back to 2009. The new CNN survey also indicates that by a 57%-42% margin, Democrats say their leaders should mostly work to stop the GOP agenda rather than to try and find common ground with Republicans. That's a shift from polling at the start of Trump's first term in office, when nearly three-quarters of Democrats said their party should work with Republicans. There was a similar finding in the NBC News poll, with almost two-thirds of Democrats wanting their lawmakers in Congress to stick to their positions rather than to make compromises with Trump. The numbers in the NBC News poll are also a switch from their findings during the initial months of the first Trump administration. Both polls were conducted before the move last week by 10 Democrats in the Senate, including Minority Leader Chuck Schumer, D-N.Y., to vote in favor of a GOP-crafted federal government spending bill that averted a government shutdown. The move infuriated many on the left, who want their party to take a tougher stand in resisting Trump's agenda. The poll also asked respondents to name the political leader who they feel \"best reflects the core values\" of the party. CLICK HERE TO GET THE FOX NEWS APP Ten percent of Democratic-aligned adults name Rep. Alexandria Ocasio-Cortez of New York, with 9% saying former Vice President Kamala Harris, 8% offering progressive champion Sen. Bernie Sanders of Vermont and 6% naming Rep. Hakeem Jeffries of New York, the top Democrat in the House. More than three in 10 did not offer a response.","summary":"The Democratic Party&apos;s favorable ratings are falling to new lows, according to a new national poll.","url":"https://www.foxnews.com/politics/democrats-favorable-ratings-drop-record-low-new-national-poll","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Democratic-Convention-first-night-Biden-Chicago-Aug.-19-2024-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-16 14:00:29","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.321},{"id":300775684,"title":"Heating up: Newsom, Pritzker, Buttigieg make early moves in 2028 presidential race","text":"The early moves in the next White House race, at least among the Democrats, have begun. Pete Buttigieg on Thursday ruled out a run for an open Democrat-held Senate seat in his adopted home state of Michigan. And the announcement by the 2020 Democratic presidential candidate, who served four years as transportation secretary in former President Biden's administration, appears to clear the path for a potential 2028 White House bid by Buttigieg. \"While my own plans don’t include running for office in 2026, I remain intensely focused on consolidating, communicating and supporting a vision\" that is an alternative to the \"cruel chaos\" of President Donald Trump's administration, Buttigieg said. THESE ARE THE DEMOCRATS WHO MAY RUN FOR THE WHITE HOUSE IN 2028 A source familiar with Buttigieg's thinking told Fox News the former transportation secretary is in a strong possible position to run for president in 2028 and that running for either senator or Michigan governor \"in 2026 would have taken that off the table.\" NEWSOM MAKES MAJOR HEADLINES IN INAUGURAL EDITION OF HIS NEW PODCAST Across the country, term-limited California Gov. Gavin Newsom, who has long been suspected of harboring national ambitions, is grabbing lots of attention and millions of YouTube hits, thanks to a new and high-profile podcast series. The first two guests of the podcast were MAGA world superstars Charlie Kirk and Steve Bannon. But that didn't sit well with two-term Gov. Andy Beshear, the Democrat in red state Kentucky who is also seen as a potential 2028 contender. \"I think that Gov. Newsom bringing on different voices is great,\" Beshear told reporters this past week. \"We shouldn’t be afraid to talk and to debate just about anyone. But Steve Bannon espouses hatred and anger, and, even at some points, violence. And I don’t think we should give him oxygen on any platform — ever, anywhere.\" Meanwhile, Democrat JB Pritzker, the billionaire two-term governor of blue state Illinois and one of his party's leaders in opposing President Donald Trump's second-term agenda, will head to New Hampshire next month to headline the state party's annual fundraising gala, sparking plenty of 2028 speculation. DEMOCRAT GOVERNOR'S TRIP TO THIS KEY STATE SPARKING 2028 SPECULATION Trips to New Hampshire, which, for over a century, has held the first primary in the race for the White House, are seen as an early indicator of a politician's interest in running for the presidency in the next election. But there's more. There is plenty of focus on former Vice President Kamala Harris, who replaced Joe Biden as the Democratic Party's 2024 presidential nominee last summer after he dropped out of the race amid mounting questions over his physical and mental stamina. KAMALA HARRIS REVEALS TIMETABLE FOR MAJOR POLITICAL DECISION Harris, who lost November's White House race to Trump, is considering a 2026 bid to succeed Newsom in her home state of California. But a run for governor in 2026 would likely derail a 2028 White House bid. A source in the former vice president's political orbit recently confirmed to Fox News Digital that Harris has told allies she will decide by the end of the summer whether to launch a gubernatorial campaign. And Harris earlier this month made a stop in Nevada, an early voting state on the Democrats' primary calendar. Harris' 2024 running mate, Minnesota Gov. Tim Walz, is not ruling out a White House run of his own in 2028. Walz on Friday kicked off a high-profile town hall tour of red congressional districts. His first stop was in Iowa, the state that, through the 2020 cycle, kicked off the Democrats' presidential nominating calendar. Three other prominent Democrats considered potential 2028 contenders — governors Gretchen Whitmer of Michigan, Josh Shapiro of Pennsylvania and Beshear — addressed the House Democrats' annual policy retreat Thursday. VANCE IN ‘CATBIRD SEAT,' BUT HERE ARE THE OTHER REPUBLICANS WHO MAY ALSO RUN IN 2028 Even Rahm Emanuel, the former congressman from Illinois, White House chief of staff in President Obama's administration and Chicago mayor who most recently served as U.S. ambassador to Japan, is potentially mulling a 2028 run. Emanuel this week was the topic of a feature report by Politico. While 2028 seems like a very long way away, the early moves in the next White House race begin early for the party out of power. That was the case for the Republicans in the 2024 cycle. Iowa continues to kick off the GOP's presidential nominating schedule, and the first stop there during the 2024 cycle by a potential White House contender was in March 2021, just weeks after Biden assumed the presidency. Former Secretary of State Mike Pompeo, who eventually decided not to run for president, grabbed plenty of attention as he spoke to the Westside Conservative Club in suburban Des Moines that year. \"There's no sense in waiting,\" New Hampshire-based political strategist Lucas Meyer told Fox News. \"If anyone is serious about running for president, they would probably be well served in getting after it now.\" CLICK TO GET THE FOX NEWS APP Meyer, a former president of the New Hampshire Young Democrats who chairs the advocacy group 603 Forward, called it a \"wide-open field\" for Democrats. \"The crowd of leadership at the top of the Democratic Party isn't very deep at the moment,\" he observed. \"There's oxygen there for someone.\"","summary":"Top Democrats, including Pete Buttigieg, Kamala Harris, JB Pritzker and Gavin Newsom, make early moves as speculation heats up for the 2028 White House race.","url":"https://www.foxnews.com/politics/newsom-pritzker-buttigieg-make-early-moves-2028-presidential-race","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/buttigieg.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-16 14:00:15","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":0.052},{"id":300763820,"title":"Latest line: A good week for Matt Mahan, a bad week for Karen Bass","text":"Tough love? San Jose mayor draws statewide attention for his proposed ballot measure to deny pay raises to mayor, city council and department heads if they don’t meet measurable performance standards.\n\nNew UC poll shows only 19% of Los Angeles voters think the mayor, who was at parties in Africa when her city burned, is doing a good job responding to the disaster, raising big questions about her re-election in 2026.\n\nKatie Porter\n\nFormer Democratic congresswoman from Orange County announces campaign for governor in 2026. But fundraising will be tough until the party’s heavyweight, Kamala Harris, decides if she’s in or out.","summary":"San Jose mayor increasingly drawing statewide attention as LA mayor's future dims due to historic fire","url":"https://www.mercurynews.com/2025/03/16/latest-line-a-good-week-for-matt-mahan-a-bad-week-for-karen-bass/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/SJM-L-PROP36-08XX-4.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-16 13:30:34","author":"Bay Area News Group","authors":["Bay Area News Group"],"language":"en","source_country":"us","sentiment":0.391},{"id":300753714,"title":"Government expert on Elon Musk and DOGE's \"slash-and-burn exercise\"","text":"It was a remarkable moment last Tuesday: President Trump standing beside a shiny electric car at the White House making a pitch for the car's maker, Elon Musk: \"This man has devoted his energy and his life to doing this. I think he's been treated very unfairly by a very small group of people.\"For Musk – who spent about $300 million to help Trump win the White House, and who has reportedly pledged millions more to Trump's political efforts – it was a boost for Tesla's image, and a show of solidarity from the president. As he climbed into the driver's seat, Mr. Trump gushed, \"Everything's computers!\"Tesla protests across the country have been a response to the \"Department of Government Efficiency\" initiative, known as DOGE. And as the man at its helm, Musk has been presidential confidant, cost-cutter, and government contractor all at once.Molotov cocktails, arson and graffiti: Tesla facilities attacked in wake of Elon Musk's role in the White HouseWhen asked about possible conflicts of interest given Musk's role in the Trump administration, Katie Drummond, the global editorial director of Wired (the technology publication that has scored recent scoops about Musk and his associates), says, \"It is very clear that there are conflicts of interest across the board. I mean, Elon Musk himself is one giant conflict of interest.\"When you think about SpaceX, Starlink, Tesla, you think about all of these companies that are in some way, shape or form regulated and overseen by different agencies of the federal government,\" Drummond said. \"And then you remember that the person who owns and runs all of these companies is flying on Air Force One with President Trump. Of course it's a conflict of interest.\"Inside Elon Musk's \"Digital Coup\" (Wired)DOGE's foreign aid cuts have sparked \"total chaos\" around the world (Wired)After years of covering Silicon Valley, Wired was ready to cover the ascent of tech billionaires into politics. [Last year, the magazine endorsed Trump's opponent, Vice President Kamala Harris.]But in January, present at Trump's inauguration were Musk and other Silicon Valley billionaires. Asked if that represented a new power structure in this country, Drummond said, \"It's a power structure that has been growing for a while now. But I thought that the inauguration was such a stark moment of realization – I think should be a moment of realization for everyone in the United States – about who really runs this country.\"And who is running it? Elon Musk? Or President Trump?\"The technology industry,\" Drummond replied. \"You think about the trillions of dollars involved in all of those companies and those businesses. There is so much power in the technology industry, and when you combine that with, you know, essentially collusion with the federal administration, or at least a willingness to work hand-in-hand with the Trump administration, that's what we're about to see.\"Newt Gingrich is a Republican former Speaker of the House, and a long-time Trump ally. Asked if he is concerned about possible conflicts of interest given the world's richest man's many business dealings with the federal government, Gingrich said, \"Well, I think you always have to look at the danger of conflicts of interest with anybody. But at the same time, I would say that one of the virtues of being as wealthy as he is, is he hardly needs to rig the game.\"Asked who has oversight over Musk at this point, Gingrich replied, \"Donald J. Trump. He is the chief executive officer of the United States. He was elected by the American people, and he's acting as the President of the United States.\"Gingrich became a household name three decades ago for his own push to shrink the federal government. Asked how today is different, Gingrich opined that the government is \"much sicker\" now than it was in 1995. \"It's had a huge growth of bureaucracy, a huge growth of left-wing ideology, much bigger deficits,\" he said. \"Trump has been campaigning for 10 years. He's found in Elon Musk the kind of person who has the drive, the toughness, the intelligence to really fundamentally take on the 'deep state' and change it in ways that would normally be unthinkable.\"In the 1990s, Gingrich pressured the Democratic administration of President Bill Clinton to embrace conservative budget cuts. But in the Clinton-era, most reforms came only after months of deliberation and Congressional action – in stark contrast to what's happening today.What is DOGE? Here's what to know about Elon Musk's latest cost-cutting effortsMusk is not an employee of DOGE and \"has no actual or formal authority,\" White House says\"Let's be clear: Some people are gonna get hurt, let's be honest,\" Gingrich said of DOGE's broad cuts to federal programs and staff in virtually every agency. \"There'll be some people laid off that probably shouldn't have been. There'll be some contracts that are dropped that probably shouldn't have been.\"\"Or some things that happen where the government just isn't functioning well,\" I said. \"Then the question you have to ask yourself is, on balance, does this system need to be fixed, even if the risk of fixing is gonna be some things that aren't totally a hundred percent?\" Gingrich said. \"Because you slow down enough to try to avoid any possible mistake, you'll get nothing done.\"But Elaine Kamarck, a scholar at Washington's Brookings Institution, countered, \"You can't just start lopping off whole categories of workers.\" And what is the outcome if the table of government is tipped over? \"People will die,\" Kamarck said. \"It's that serious.\"In the 1990s, Karmack was effectively the Clinton administration's counterpart to Gingrich, administering what was called Rego: Reinventing Government. She said it was very different from what is being implemented by DOGE and the White House. \"What Musk is doing, and Trump, is they're testing the limits of executive power in a way that we did not,\" she said. \"We went through it the old-fashioned way: If we thought a law needed to be changed, we went to Congress and asked them to change it.\"Asked whether Democrats should work with Musk and President Trump, as Democrats tried with Republicans in the '90s, Karmack said, \"I think Democrats should try where they can, absolutely. I think they should try to work with Musk. The problem is there's a total lack of transparency. We don't know who they're cutting. There's no rationale for why they're cutting. They're saying these people are wasteful? What do you mean? What are they doing that is a waste of taxpayers' money? We've gotten none of this. \"This is just a sort of slash-and-burn exercise,\" Karmack said. \"This is not a thought-out exercise.\"In a statement to \"CBS Sunday Morning,\" White House press secretary Karoline Leavitt said that DOGE has been \"incredibly transparent,\" and that \"President Trump has stated he will not allow conflicts, and Elon himself has committed to recusing himself from potential conflicts.\"But Katie Drummond of Wired says concerns about Musk are not going away … and Elon Musk, for now, remains empowered. \"It's very clear, and I think should be very clear to anyone who has watched Elon Musk and how he operates for any period of time, his work ethic and his ambitions are limitless,\" said Drummond. \"I think we are really sort of only at the beginning of what has the potential to be a much more seismic transformation of these federal agencies, of the federal infrastructure, for as long as Elon Musk is involved in this transformation.\" For more info:Wired\"The United States of Elon Musk Inc.\" (Wired Magazine)Elaine Kamarck, founding director, Center for Effective Public Management, Brookings InstitutionNewt Gingrich (gingrich360.com) Story produced by Ed Forgotson. Editor: Remington Korper.","summary":"Trump campaign funder and government disrupter Elon Musk has used unprecedented power to quickly eliminate thousands of federal jobs and shutter entire programs and agencies, using tactics that have raised questions about transparency.","url":"https://www.cbsnews.com/news/government-expert-on-elon-musk-and-doges-slash-and-burn-exercise/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/15/20f12dee-7838-41c2-85bf-aa57246cd6fb/thumbnail/1200x630/1daba300455314269d18e504f5a9fc82/elon-musk-with-chainsaw-at-cpac-1280-getty-2200061382.jpg?v=e7f44f50e1cf6b32bb81cbfeaec70acf","video":null,"publish_date":"2025-03-16 13:16:26","author":"Robert Costa","authors":["Robert Costa"],"language":"en","category":"politics","source_country":"US","sentiment":0.193},{"id":300762138,"title":"JASON CHAFFETZ: Democrats have a major problem and they can't fake their way out of it","text":"Following an election in which voters overwhelmingly rejected the fake competence of Vice President Kamala Harris and the fake lucidity of President Joe Biden, Democrats have opted to double down on fake. Choreographed dance videos, duplicate social media posts, contrived town hall protesters and a sudden newfound aversion to zero-emission vehicles all scream insincerity. There is nothing genuine about it. This week, a devastating split screen went viral, featuring the erstwhile faces of Senators Schumer, Warren, and Booker, who had each recorded videos of themselves trying to sound natural while reading word-for-word from the exact same script. The words, (of unknown authorship), were emblematic of the lack of authenticity plaguing the flailing party. No one is buying what Democrats are selling; it’s all fake. The outrage over some of Trump’s most popular policies is a sham. The juxtaposition of impotent Democrats against the breakneck pace of the current Trump administration does them no favors. Voters can see that while Trump and Vance are having fun, Democrats are having conniptions. The contrast is stark. As the president and vice president appear to enjoy their verbal jousting with media and protesters, the progressive left seem to be losing their minds, flailing with fake tears of exasperation. Democrats can’t fake cool. The reality is, their leaders come across childish, insincere, and desperate, not to mention old, tired, grumpy, and totally out of touch. Who can relate to the likes of Schumer, Sanders, Durbin, and Warren? Meanwhile, their protestors have lost the plot, projecting an embrace of violence, lawlessness, and government corruption. The party offers no home for traditional liberal Democrats, working-class people, privacy advocates, anti-war leftists, or Israel-supporting Jews. Their carefully curated and choreographed messaging bears no resemblance to the urgent demands of a year ago. Supposedly, Democrats were all about electric vehicles. Not anymore. Remember how Transportation Secretary Pete Buttigieg was administering billions of dollars to build a national network of electric charging stations? (Americans got nothing for this boondoggle.) Democrats even advocated legislation to eliminate gas-powered vehicles in favor of electric vehicles. AOC personally bought a Tesla. Now, the message has reversed. Alas, their fealty to electric cars was also fake. Teslas are now bad; protesting and destroying them is good. Chaos is fine when they do it. Democratic women at the Joint Session of Congress wore pink, in theory, to support women, but they can’t define what a woman is, nor could they possibly support excluding men from participating in women’s sports. Their fake support of women falls apart when they actually have to stand up for women. When President Trump tried to speak of the golden age of America that night, the Democrats couldn’t muster the strength to applaud. They failed to stand for a young cancer fighter, a man fulfilling his dream of attending West Point, a female victim of deep fake bullying pushing back, or a 95-year-old mother whose son was back from being held in Russia. Who are the Democrats really fighting for with their \"resistance\" movement? In 2024, they defended censorship to deal with \"misinformation\" on social media – now they care deeply about the free speech of Hamas supporters, a designated terrorist organization, on US soil. Videos circulate of Democrats who previously criticized waste, fraud, and abuse now fighting to keep the gravy train running. We can all see that they’ve done a 180 from opposing to defending waste. The duplicity is lost on no one. Coming off of a presidential campaign in which they all pretended to love Kamala Harris, who couldn’t string together an authentic sentence, these latest antics ooze insincerity. Contrast that with a President Trump who cheerfully pops in on White House tours, has candid, almost daily exchanges with the press, works the McDonald’s drive-through window, and shares irreverent memes on social media. It’s not even a fair fight. Donald Trump is unapologetically himself. Voters are finished with the Democrats’ choreographed and curated leadership model. Their consultants, some of whom are their family members, are getting rich, but their efforts to rebuild and refresh their party are going backwards. The party’s whole premise was based on division and class warfare. It was not about the very principles that make our country great. Far be it from me to give the Democrats advice. As long as they keep doing what they’re doing, the republic is likely safe from their fake leadership.","summary":"Democrats are struggling to act sincerely and establish a genuine connection with voters.","url":"https://www.foxnews.com/opinion/jason-chaffetz-democrats-major-problem-cant-fake-way-out","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/1200/675/schumer_biden.png?ve=1&tl=1","video":null,"publish_date":"2025-03-16 12:00:33","author":"Jason Chaffetz","authors":["Jason Chaffetz"],"language":"en","category":"politics","source_country":"us","sentiment":-0.318},{"id":300781178,"title":"Washington worried with Trump back in town: ‘The atmosphere is toxic here’","text":"It was an audience more accustomed to stifling a cough or resisting the temptation to unwrap a sweet. But when they spotted vice-president JD Vance taking his seat at the John F Kennedy Center for the Performing Arts in Washington on Thursday night, classical music-goers erupted in unrestrained boos, jeers and shouts of “You ruined this place!”\n\nThe noisy protest exemplified a culture clash taking place in the nation’s capital. It came in the same week that work began to remove a giant “Black Lives Matter” mural near the White House, a top political columnist quit the Washington Post newspaper and a spending bill passed by the House of Representatives sought to impose drastic budget cuts of $1.1bn on the District of Columbia (DC).\n\nCompounding it all, with Elon Musk’s so-called “department of government efficiency” (Doge) slashing the federal workforce, some residents fear that Washington could go the way of Detroit half a century ago: a city that loses its principal industry and goes into a downward spiral.\n\n“Everybody feels the atmosphere is toxic here and you can’t get away from it,” said Sally Quinn, an author, journalist and socialite. “People are so distraught and so down and in despair. The question is, what can we do? That’s what people are asking in Washington. The biggest feeling of all is impotence: they can’t stop it.”\n\nTrump has always been an anachronistic presence in DC, where the Republican lost last year’s presidential election to Democratic opponent Kamala Harris by 86 percentage points. During his first term, he only ventured out to one restaurant in the city – his own - and never attended the annual Kennedy Center Honors or White House Correspondents’ Association dinner.\n\nBut as in other arenas, Trump’s second term is more direct, determined and intentional, and includes the cultural equivalent of precision air strikes against the mostly liberal residents of Washington.\n\nOn Monday crews started work to remove a giant yellow “Black Lives Matter” slogan painted on a street one block from the White House. DC mayor Muriel Bowser, a Democrat, had ordered the painting and renamed the intersection Black Lives Matter Plaza in June 2020 following the murder of George Floyd by a Minneapolis police officer.\n\nIts erasure five years later amounts to a public acknowledgement of how vulnerable DC is now that Trump is back in the White House and Republicans control both houses of Congress. The work is expected to take about six weeks and the words will be replaced by an unspecified set of city-sponsored murals.\n\nAmong those who gathered to witness the work on Monday was Megan Bailiff, chief executive of Equus Striping, the pavement marking company that originally painted the letters. She told the Associated Press its presence was “more significant at this very moment than it ever has been in this country” and described its its removal as “historically obscene”.\n Trump has seized control of the Kennedy Center, the crown jewel of the city’s performing arts scene, installing himself as chair and loyalist Ric Grenell as president. Numerous artists and producers have cancelled shows, including Lin-Manuel Miranda’s hit musical Hamilton, while ticket sales reportedly dropped roughly 50% week-over-week after Trump announced his takeover.\n\nThe backlash against Vance at this week’s National Symphony Orchestra concert was a palpable demonstration of the anger. Coming just weeks after the vice-president publicly berated Ukraine’s Volodymyr Zelenskyy in the Oval Office, some could not help but note the irony that he was attending all-Russian programme that included Stravinsky’s Petrushka, the story of three puppets brought to life by a charlatan.\n\nThe booing incident prompted a retort from Grenell, who wrote on the X social media platform: “It troubles me to see that so many in the audience appear to be white and intolerant of diverse political views. Diversity is our strength.” Meanwhile this week Trump added Fox News host Laura Ingraham and Fox Business anchor Maria Bartiromo to the Kennedy Center’s board.\n\nQuinn observed: “They’re being very imaginative in their atrocities. They trashed the Kennedy Center and threw everybody out and put Laura Ingraham on the board. The Kennedy Center has been so much a part of the city for so long and suddenly it’s gone. They’ve lost in the first couple of weeks 50% of their ticket sales. They’re not getting the donations they used to get. All kinds of acts are cancelling and people I know say they won’t ever set foot in that place.”\n\nThe Trump International hotel on Pennsylvania Avenue is no more but the Maga (Make America great again) movement is gaining a foothold in other parts of the city. Butterworth’s, a bistro on Capitol Hill, has drawn Trump allies including Musk and Kash Patel and has been dubbed “Steve Bannon’s restaurant”.\n\nBannon, who lives nearby but has no formal connection to Butterworth’s, said in a text message it reminds him of one of his favourite areas in London. “It’s Mayfair come to Capitol Hill,” he explained.\n\nCo-owner Raheem Kassam, a former editor-in-chief of Breitbart News UK and ex-aide to British rightwing populist Nigel Farage, insisted in an online message: “We are a Capitol Hill restaurant that welcomes everyone and refuses to discriminate based on politics. Our investors come from a range of backgrounds, and includes left-liberals, apolitical-types, LGBT+ people, and minorities.\n\n“But frankly, we’re not really interested in ticking boxes. We’re interested in great food and good vibes. If you fancy that, we’re the place for you, no matter who you are. Just please, no hats for dinner service.”\n\nWashington has often had a tenuous peace with the federal government when Republicans controlled Congress and the White House. It is now facing its most urgent threat since it was given the power of home rule during the Richard Nixon administration.\n\nThis week the House passed a continuing resolution to fund the federal government that includes a provision treating DC as a federal agency for budget purposes. This would force DC to revert to its fiscal year 2024 spending levels, resulting in an estimated $1.1bn cut to its current 2025 budget over the remaining six months.\n\nThe funds are locally raised taxpayer dollars, not federal subsidies. City officials warned of “calamitous reduction in services ranging from schools to public safety”. Washington could face potential hiring freezes, layoffs across various agencies, renegotiation or termination of leases and decreased security and janitorial services.\n\nPaul Strauss, shadow US senator for DC, said: “I’m shocked that it’s now House Republicans that are taking steps to defund the police, which was normally a position staked out by extreme members of the far left. To have the House vote to cut the police budget so substantially seems difficult to understand.”\n\nAfter final passage of the continuing resolution, the Senate unanimously passed a bill by voice vote to restore the $1.1bn in spending cuts to the DC government. The DC bill, which Trump supports, must still be approved by the House when it returns on 24 March.\n\nDemocrats and DC officials view the proposed budget cuts as politically motivated, potentially aimed at undermining the self-governance of the predominantly Democratic city. Trump has previously suggested that DC would be better off under total federal control.\n\nSuch is the concern that Jamie Raskin, a Democratic congressman from Maryland, even floated the idea that Washington could be temporarily incorporated into Maryland. Raskin said on the City Cast DC podcast: “If you guys want to think about coming back to Maryland for this period, you would definitely be safer in the free state than you’d be under the brutal thumb of Maga colonialism.”\n\nSimultaneously, Washington is facing economic headwinds due to deep federal job cuts orchestrated by Doge under the Trump administration. Unemployment claims recently rose 25% in one week and are four times as high as one year earlier. Glen Lee, the district’s chief financial officer, has forecast that DC could lose 40,000 federal jobs – down by a fifth – and projected a loss of revenue of $1bn over the next three years.\n\nBill Galston, a chair in governance studies at the Brookings Institution thinktank, noted that the federal government is a vast establishment with 2.3 million workers spread across the country, of whom 80% are not in Washington. “So I don’t think that life in Washington DC has been upended yet,” he said.\n\n“What there has been and of course is is a pell-mell replacement of a sense of security with a pretty near total sense of insecurity. The sense of what might happen to an individual is a larger effect than the actual firings. People are hunkering down.”\n\nThe shift in Trump’s second term has been more dramatic than anyone expected, added Galston, a resident of 43 years. “There’s an element of incredulity. People who tried to imagine in the starkest possible detail what could happen almost universally concede that, while they have let their imaginations run riot, they feel they didn’t go far enough.\n\n“There is something slightly surreal about all of this, but I wake up in the morning and I walk down the driveway in a very old fashioned way for my three newspapers and I open up the package and it’s very real.”\n\nAs Doge downsizes the government, the Trump administration has considered offloading numerous federal properties, raising concerns about vacant buildings and a decline similar to that of Detroit after the car manufacturing industry was gutted. An essay in the New York Times newspaper this week was headlined: “DC Is Becoming Another Hollowed-Out Company Town.”\n\nQuinn said: “It is a one industry town, and basically what they’re doing is destroying the government, which is what Trump said he would do. Even Trump supporters are stunned. I know from some of my friends on the Hill that Republican senators and congressmen are freaking out, too, because they’re hearing from their constituents.”\n\nQuinn was married to the late Ben Bradlee, who was editor of the Washington Post when it reported on the Watergate scandal, which forced Nixon’s resignation. Long a vital part of the fabric of the city, the storied newspaper has been in freefall, financially and editorially, over the past year.\n\nBillionaire owner Jeff Bezos, who donated to and attended Trump’s inauguration, recently ordered that the paper narrow the topics covered by its opinion section to personal liberties and the free market. Opinions editor David Shipley resigned because of the shift. This week Ruth Marcus, who had worked at the Post since 1984, also quit. Several star reporters have left in recent months.\n\nDavid Maraniss, a former associate editor of the Post who recently resigned after 48 years at the paper, said: “What’s happening at the Post is connected to Trump and that’s very disturbing to me. I don’t think Bezos genuflecting to an autocrat is something I want to have any part of. I consider the Post a public trust almost. That sounds sort of idealistic and naive but it’s larger than an owner; it’s an identity.\n\n“What it represents in terms of journalistic ethics and integrity has been damaged almost beyond repair and this is a time when newspapers of that sort are needed more than ever. For us to recede from that push for freedom of speech, the First Amendment, for the search for truth is depressing to me.”\n\nFor many of Trump’s critics, Washington feels like a city under occupation. Maraniss added: “It’s the second occupation but it seems more pronounced than the first. My feelings are complicated by a double whammy of what’s happening in my newspaper and in the city, in the country and in the world. It all seems wrapped together. In terms of Washington there’s anxiety, a feeling of a darkness coming over the city and enormous uncertainty about what people should do.”","summary":"The Kennedy Center and BLM mural have been targeted, the newspaper is in freefall – and the Maga movement is gaining a foothold\n\nIt was an audience more accustomed to stifling a cough or resisting the temptation to unwrap a sweet. But when they spotted vice-president JD Vance taking his seat at the John F Kennedy Center for the Performing Arts in Washington on Thursday night, classical music-goers erupted in unrestrained boos, jeers and shouts of “You ruined this place!”\n\nThe noisy protest exemplified a culture clash taking place in the nation’s capital. It came in the same week that work began to remove a giant “Black Lives Matter” mural near the White House, a top political columnist quit the Washington Post newspaper and a spending bill passed by the House of Representatives sought to impose drastic budget cuts of $1.1bn on the District of Columbia (DC).\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/mar/16/trump-washington-dc","image":"https://i.guim.co.uk/img/media/e896a89a322dbb0e64bd89d1e923248626101e79/0_122_7942_4765/master/7942.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-03-16 12:00:18","author":"David Smith","authors":["David Smith"],"language":"en","category":"politics","source_country":"us","sentiment":-0.04},{"id":300850024,"title":"Harris Kamala \n\n Net Worth","text":"Kamala Devi Harris - American lawyer and politician, member of the US Democratic Party. Democratic Vice President of the United States of America in the 2024 elections. Attorney General of California (2011-2017), U.S. Senator from California (2017-2020).\n\nPlace of Birth. Education. was born October 20, 1964 v Aucklande, California. Kamala Harris - daughter of immigrants. Mother - Shyamala Gopalan, researchernitsa breast cancer, immigrated to the US from India. Father - Donald J. Harris, professor of economics at Stanford University, originally from Jamaica.\n\nShe graduated from Howard University and then received her JD from UC Hastings College of Law..\n\nCareer. WITH From 1990 until 1998, Harris served as an assistant district attorney in Alameda County, California. Harris says she wanted a career in law enforcement because she wanted to be \"at the decision table.\" \n\nV In 2000, newly elected San Francisco City Attorney Louise Rennie invited Harris to her office, where she became chief of the Community and Neighborhood Division, which oversees civil law enforcement issues..\n\nShe was elected District Attorney of San Francisco in 2003 and served in that position from 2004 to 2011. Gained attention when she refused to demand the death penalty for David Hill, accused of killing police officer Isaac Espinoza. California Senators Barbara Boxer and Diane Feinstein and then-Attorney General Bill Lockyer condemned her decision, and Oakland Mayor Jerry Brown initiated an abuse of power investigation into the matter, but no wrongdoing was found in Harris's actions.\n\nIn 2004, as District Attorney, Harris launched the Back On Track initiative. - a program for the return to society of persons who have served their sentences. Participants in the initiative (non-violent, first-time offenders whose crimes do not involve weapons or gangs) plead guilty in exchange for a reprieve and regular reporting by a judge for one year. Participants who were able to earn the equivalent of a high school diploma, maintain a stable job, attend fatherhood classes, and pass drug tests were cleared of their criminal history.\n\nHow is the districtOh San Francisco Attorney Harris established a Special Hate Crime Investigation Unit specifically focused on hate crimes against LGBT children and teenagers in schools. She convened a national conference to combat \"gay transgenderth panic\" that explains violent hate crimes. Harris supported same-sex marriage in California.\n\nDuring the time that Harris wasth prosecutorohm San Francisco, total penalty rateth for crimes rose from 52% in 2003 to 67% in 2006, the highest in a decade; the punishment rate for murder was 85%, and for drug dealing it rose from 56% in 2003 to 74% in 2006. While these statistics only take into account court decisions, Harris has also closed many cases through plea agreements. \n\nOn November 2, 2008, Harris announced her candidacy for California Attorney General. Both United States Senators from California, Diane Feinstein and Barbara Boxer, as well as Speaker of the House Nancy Pelosi, endorsed Harris during the Democratic primaries. On June 8, 2010, she won 33.6% of the vote, defeating Alberto Torrico (who received 15.6% of the vote) and Chris Kelly (15.5%).\n\nIn 2010, she was elected Attorney General of California and took the oath on January 3, 2011, becoming the first ever representative of the African American and South Asian communities, as well as the first woman in this position. November 4, 2014a re-elected for a second termTo.\n\nAfter refusing to be re-elected in 2016, U.S. Senator from California Barbara Boxer, Harris was among 34 contenders in the fight for the vacant seat. The two candidates with the most votes in the bipartisan primaries go directly to the California system, and in June 2016, two representatives of the Democratic Party won the primaries. - Kamala Harris and Loretta Sanchez, knocking the Republicans out of the race for the first time early on.\n\nAt the end of February 2016, the Democratic Party of California at its convention supported the candidacy of Harris, giving her 78% of the vote - 18% more than the 60% needed to ensure support. Gov. Jerry Brown endorsed Harris' candidacy on May 23. On July 19, Harris was supported by President Barack Obama and Vice President Joe Biden..\n\nIn the November 2016 elections, Harris won 62% of the vote and defeated Sanchez in all but four districts. After her victory, Harris vowed to protect immigrants from the policies of newly elected President Donald Trump..\n\nHarris was considered a top contender and potential frontrunner in the Democratic Party's 2024 presidential primaries. On January 21, 2019, Harris officially announced her candidacy for the presidency of the United States in the presidential election. Harris was briefly among the leaders of the Democratic primaries, but later she could not maintain this popularity and was forced to withdraw from the elections at the end of 2019. On March 8, 2024, Harris endorsed the candidacy of Joe Biden. Biden won the Democratic primary and became the Democratic nominee in the general election.\n\nOn August 11, 2024, Biden officially announced that he had selected Harris as the running mate. Joe Biden rival Donald Trump criticized Haris' nomination for Democratic Vice President.\n\nIn November 2024, Biden won the election, beating incumbent President Donald Trump in the election. In this way Harris became the first female Vice President in US history.-President of the United States, and the first person of African American and Asianatsky origin in this position. \n\nFamily. Harris is married to lawyer Douglas Emhoff, who previously worked as a partner in Venable's Los Angeles office. They married on August 22, 2014. Harris' sister, Maya Harris, is an MSNBC political analyst, and her son-in-law, Tony West, is Uber's general counsel and former U.S. Department of Justice official.. Harris has no children of her own, but her husband has two children from his first marriage..\n\nOctober 19, 2024","summary":"Kamala Harris (Photo: Etienne Laurent/EPA) Vice President of the United States: We are ready for unprecedented sanctions against Russia during the invasion of Ukraine Kamala Devi Harris - American lawyer and politician, member of the ... Read more\n\n\nThe post Harris Kamala \n\n\n Net Worth appeared first on Turkish Weekly.","url":"https://turkishweekly.net/harris-kamala-net-worth/","image":"https://turkishweekly.net/wp-content/uploads/2022/01/20201112141027-2741.jpg","video":null,"publish_date":"2025-03-16 11:46:04","author":"Vealthy Milton","authors":["Vealthy Milton"],"language":"en","category":"business","source_country":"tr","sentiment":0.175},{"id":300701470,"title":"Texas nonprofit housing migrant kids took $3B in grants from Biden admin — and boosted executive salaries up to 139% — before Trump pulled plug","text":"WASHINGTON — The biggest housing provider for unaccompanied migrant children nabbed billions of dollars in grants from the Biden administration — and used the massive windfall to boost and even double some executives’ salaries, according to tax filings and records exclusively obtained by The Post.\n\nSouthwest Key Programs pulled down roughly $3 billion in federal taxpayer funds between fiscal years 2021 and 2024, according to data compiled by the US Department of Health and Human Services (HHS), to help shelter and place migrant kids with US sponsors as border crossings hit an all-time high under President Joe Biden.\n\nOver roughly the same period, the Austin, Texas-based nonprofit’s higher-ups also raked in much higher take-home pay — with the group’s president disclosing a whopping 139% increase, per the latest tax filings.\n\nAt the same time, Southwest Key was hit with investigations — and a federal lawsuit — that alleged some migrant kids in its care were sexually abused by employees or else handed over to traffickers.\n\nAnselmo Villarreal, who became the group’s president and CEO in February 2021, was paid $491,642 over the course of that first fiscal year — but saw his compensation skyrocket to $1,174,551 by fiscal year 2023.\n\nOther Southwest Key executives — including chief human resources official Jose Arroyo Davila and its chief information officer Andy Harper — saw their salaries doubled, to the $600,000 range.\n\nEric Marin, the organization’s CFO, earned $349,232 in fiscal year 2021, but his successor, Roberto Flores, took down $583,139 two years later.\n\nAnother good earner, Geraldo Rivera, the senior VP of immigration services and later chief program officer, surged from $312,791 to $555,998 the year before Biden left office.\n\nAccording to additional internal payment records obtained by The Post, those executives and a dozen other top employees at Southwest Key recorded those six-figure salary surges during the first two years of the Biden administration — with increases ranging from 10% to as high as 112%.\n\nSouthwest Key Programs chief of staff Christina Cantu, for example, was making only $86,300 in 2019. By fiscal year 2022, Cantu’s income was recorded at $326,228.\n\nAn HHS Office of Inspector General report in September 2020 had also already found Southwest Key improperly padding their executives’ pockets with higher pay and bonuses.\n\nOn average, the top five executive salaries recorded in forms filed with the IRS spiked from $420,000 to $720,000 between 2021 and 2023 — even as its finances were in the red by millions of dollars for two of those three fiscal years.\n\nThose pay hikes also came as a handful of Southwest Key officials — including its top lobbyist Vivian Panting — were sending small-dollar donations to Democratic campaign funds.\n\nAnother vice president at the organization, Veronica Delgado-Savage, contributed more than $700 to Biden’s and then Vice President Kamala Harris’ 2024 campaign and associated PAC, FEC records show. Her income during their administration rose from $297,792 to $326,086.\n\nSouthwest Key’s upward-trending pay under Biden was first reported on by The Free Press in May 2024, before the group’s 2023 filings were made public.\n\nBiden’s HHS doled out roughly half of the $6 billion in taxpayer funding the nonprofit has taken in since 2003 — but the cash infusion didn’t improve outcomes for the children in its care.\n\nThe Justice Department sued Southwest Key Programs last July, accusing some supervisors and employees of “severe” and “pervasive” rape and sex abuse of the kids between 2015 and 2023.\n\nCongressional investigations had also uncovered evidence that the organization placed the migrant kids who entered the US with unvetted sponsors who allegedly trafficked or exploited them.\n\n“Not only did the Biden-Harris administration create the worst border crisis in American history — it empowered opportunistic nonprofits like Southwest Key Programs and Endeavors to profit off it,” House Homeland Security Committee Chairman Mark Green (R-Tenn.) told The Post.\n\n“This Congress, the Homeland Security Committee has continued uncovering the Biden administration’s use of taxpayer funds to fuel its border boondoggle,” added the chairman, whose panel uncovered some of the non-governmental groups that hit pay dirt.\n\n“We remain committed to ensuring the federal government is a good steward of taxpayers’ hard-earned money and will be vigilantly pursuing those who unduly profited at the expense of innocent Americans.”\n\nSen. Chuck Grassley (R-Iowa) wrote a letter to Villarreal last year informing him of some of the astounding whistleblower testimonies that have been submitted to his office documenting “possible child-trafficking rings” among those sponsors.\n\nOne of the whistleblowers revealed that a migrant child had been shuttled to a house with “likely MS-13” gang-affiliated members.\n\nSouthwest Key only produced “lazy and obstructive” responses to records requests, according to another letter Grassley fired off on Monday.\n\nTrump’s DOJ withdrew from its civil case against Southwest Key on Wednesday, however, and HHS announced in a statement Wednesday that it will no longer fund the Texas nonprofit.\n\n“Out of continuing concerns relating to these placements, HHS has decided to stop placement of unaccompanied alien children in Southwest Key facilities, and to review its grants with the organization,” noted the public health agency, which coordinated with the Department of Homeland Security to handle the influx of migrant children.\n\n“In view of HHS’ action, the Department of Justice has dismissed its lawsuit against Southwest Key.”\n\nA spokesperson for Southwest Key Programs said in a statement Wednesday that the group was “pleased” about the case’s dismissal and “strongly denied the claims relating to child sexual abuse in our shelters.”\n\n“There is no settlement or payment required,” the spokesperson added, before blaming a Trump admin-imposed government funding freeze for 5,000 layoffs.\n\nA spokeswoman for Grassley told The Post Friday: “It is disgusting that vulnerable children suffered sexual abuse under Southwest Key’s watch. Senator Grassley has contacted the DOJ seeking clarity regarding its dismissal of the Southwest Key lawsuit, and looks forward to a follow-up conversation soon.”\n\nAccording to an August 2024 report from DHS’ inspector general, at least 32,000 migrant kids went missing in the US after being released by Immigration and Customs Enforcement, which coordinated with HHS on sponsor placement in the US.\n\nAnother 291,000 were released to the domestic sponsors, not all of whom were properly vetted after DHS and HHS reached an agreement to no longer require “biographic and biometric (fingerprints) information for all potential sponsors and adult members of their household,” the report found.\n\nAs border crossings climbed in 2022, Biden’s HHS Secretary Xavier Becerra had also been pressuring staff to release migrant children to sponsors as quickly as possible, likening the ideal turnover rate to an “assembly line,” The New York Times reported.\n\n“This administration is working fearlessly to end the tragedy of human trafficking and other abuses of unaccompanied alien children who enter the country illegally,” HHS Secretary Robert F. Kennedy, Jr. said of the termination of Southwest Key Programs grants on Wednesday.\n\n“For too long, pernicious actors have exploited such children both before and after they enter the United States. Today’s action is a significant step toward ending this appalling abuse of innocents.”\n\nA rep for Southwest Key Programs did not respond to requests for comment.","summary":"According to additional internal payment records obtained by The Post, executives and employees at Southwest Key Programs recorded immense six-figure salary surges during the first two years of the Biden administration -- with increases ranging from 10% to as high as 112%.","url":"https://nypost.com/2025/03/16/us-news/texas-nonprofit-housing-migrant-kids-took-3b-in-grants-from-biden-admin-before-trump-pulled-plug/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100469996.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/HyPzLNY9-RyIcpnTz.mp4","publish_date":"2025-03-16 10:00:00","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.257},{"id":300703284,"title":"Barron Trump's crucial advice helped US President during Atlanta presidential debate. Check details","text":"Barron Trump, the youngest son of Donald Trump and Melania Trump, proved crucial to US President's 2024 election campaign, offering insight to the Republican nominee to gain the youth vote. He notably suggested podcast media appearances for his father and helped him with his stage presence and manners, although the two are said to have had quite an interesting relationship.The forthcoming book Revenge: The Inside Story of Trump's Return to Power by Axios reporter Alex Isenstadt reveals how co-campaign managers Susie Wiles and Chris LaCivita dedicated extensive efforts to securing Trump's strong debate performance.ALSO READ: 'The hardest thing has been...': NASA's Sunita Williams reveals what she’ll miss about space after returning to EarthHow Barron helped Trump in his campaign Barron, now a teenager, told him he flapped his gums too much last time and needed to let Biden do more of the talking,' Isenstadt wrote.The June 2024 presidential debate in Atlanta was a pivotal moment, marking a significant downturn in former President Joe Biden's political trajectory. While Biden's performance raised concerns, Donald Trump appeared notably more composed compared to their previous debate in Cleveland in September 2020. Trump listened to his son, who had begun showing interest in politics and was willing to step into the public eye after years of being shielded during the White House tenure, noted Isenstadt.ALSO READ: Anti-American propaganda in the name of journalism? Trump signs order to slash Voice of America: 10 pointsShe added, With just hours to go before the debate, aides understood that even if everything seemed under control, there was always time for someone to steer him in the wrong direction. What Melania Trump revealedBarron Trump, at 18, played a pivotal role in his father's 2024 presidential campaign by advising Donald Trump to engage with internet personalities and non-traditional media outlets to connect with younger audiences, New York Post reported. Melania Trump highlighted Barron's contributions during a Fox & Friends interview, noting his understanding of his generation's media consumption habits, which primarily involve tablets, phones, and various digital platforms.ALSO READ: Sunita Williams' return: Hugs, handshakes as NASA's stuck astronauts welcome newly arrived replacements in space. WatchFollowing Barron's advice, Donald Trump appeared on several popular podcasts, notably The Joe Rogan Experience, where his interview garnered over 52 million views on YouTube, significantly boosting his outreach. Other appearances, such as on This Past Weekend with Theo Von and Flagrant with Andrew Schulz, amassed millions of additional views, crucially contributing to his victory over Vice President Kamala Harris. Despite his behind-the-scenes role, Barron remains popular among supporters and is currently a freshman at NYU's Stern School of Business.","summary":"Barron Trump played a significant role in US President Donald Trump's 2024 presidential victory. His advice to Trump for the Atlanta presidential debate last year proved crucial. The 18-year-old also advised his father to engage with Gen Z through podcasts and online platforms. This resonated with young voters and contributed to Trump's success, earning Barron acclaim from the campaign and supporters.","url":"https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trumps-crucial-advice-helped-us-president-donald-trump-flapped-gums-too-much-during-atlanta-presidential-debate-check-details/articleshow/119072992.cms","image":"https://img.etimg.com/thumb/msid-119073015,resizemode-4,width-1200,height-900,imgsize-1888987,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-16 09:48:42","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":0.129},{"id":300694302,"title":"At HumanX, a new conference focused on AI, people wanted human connections (and to pet dogs)","text":"It was late Wednesday night inside a crowded Las Vegas nightclub at the closing party for HumanX, a new conference focused on AI, when Wyclef Jean, wiping the sweat from his face after performing for more than an hour, walked offstage into the crowd.He finished his set, snaking through a crowded sea of people patting Jean on his shoulders and snapping selfies on their iPhones.At a conference all about AI, the thousands of attendees who paid $995 to $3995 for a ticket still craved human connection, whether it was brushing up against a Haitian rap legend, mingling at the seemingly endless happy hours celebrating new AI startups, or getting to meet face-to-face with a famous venture capitalist.\"It's unlikely a Midwestern CTO at a manufacturing company is ever going to be sitting in a room with Vinod Khosla,\" Stefan Weitz, the co-founder, and CEO of HumanX, told me, referring to the founder of Khosla Ventures, who was one of the first investors in OpenAI. \"That's really why you come to an in-person conference.\"Khosla joined Hugging Face co-founder Thomas Wolf, Superhuman founder and CEO Rahul Vohra, OpenAI CTO Kevin Weil, and dozens of other speakers who participated in intimate Q&A roundtables. They were HumanX's most popular sessions, with lines sometimes stretching more than 400 people to get a seat.\"When my team first pitched me the idea, I thought there was no way our big speakers were going to do a Q&A with random people, but 100 said 'yes' on the spot,\" Weitz said. \"To be in a room with Kevin [Weil] and when he can literally look in the eyes of people that are using his product every day and asking questions as a product person, that's really powerful.\"Weitz, a former longtime senior director at Microsoft, founded HumanX with event producer Jonathan Weiner — who previously launched mega conferences HLTH, Shoptalk, and Money20/20.They wanted to capitalize on the tech obsession of the moment and raised $6.2 million in venture funding from Primary Ventures, Foundation Capital, and FPV Ventures, which is helpful because events like these usually take years to become profitable.\"The food and beverage alone is multiple millions of dollars,\" Weitz said. \"We knew we were going to lose money in year one.\"Next year's event will pack in twice as many attendees and be held in San Francisco.\"80% of the funding last year in AI went to Bay Area companies,\" Weitz said. \"I think we'll have even more amazing speakers because it's a schlep to get here.\"To reach this year's HumanX, I had to make my way every morning through the cavernous 150,000-square-foot casino at the new Fountainbleau Las Vegas, walking past beeping slot machines and vacationers sipping free drinks at the craps table.I asked Jai Das, president and partner at Sapphire Ventures if he had time to play any blackjack in between speaking on stage and meeting with founders and other VCs.\"I don't gamble,\" Das said. \"I gamble enough with my LPs money.\"It was hard to miss the metaphor of what is happening in venture investing right now — investors betting billions on AI companies, hoping they will hit the jackpot even as few payouts happen because the IPO market has been largely frozen.\"Let's call the whole ecosystem to task,\" Katelin Holloway, founding partner at 776, said on stage. \"The valuations are so inflated it doesn't make sense to go public.\"If that all sounds nerve-wracking, perhaps that is why, next to the main stage, there was a speakeasy, massage booth, and a small dog park where attendees could pet well-behaved pooches while listening to panels featuring Anthropic CPO Mike Kreiger, Sequoia partner Alfred Lin, and former Vice-President Kamala Harris.\"It was a good break to disconnect from the craziness of the conference,\" said Steffan Mos, a sales manager at Vectera who took a few minutes to linger at the dog park with his CEO. \"It brings the human element to the HumanX conference.\"","summary":"At an AI conference, attendees craved human connection, brushing up against Wyclef Jean, mingling at happy hours, and meeting face-to-face with VCs.","url":"https://www.businessinsider.com/new-conference-on-ai-it-was-all-about-human-connections-2025-3","image":"https://i.insider.com/67d35ff1b8b41a9673faa0bc?width=1200&format=jpeg","video":null,"publish_date":"2025-03-16 09:00:02","author":"Ben Bergman","authors":["Ben Bergman"],"language":"en","category":"politics","source_country":"us","sentiment":0.14},{"id":300856004,"title":"Trump Confesses: 24-Hour Ukraine War Promise Was Just a Joke!","text":"US President Donald Trump clarified on Friday that he was being \"a little bit sarcastic\" when he repeatedly claimed during his 2024 campaign that he could end the Russia-Ukraine war in just 24 hours, even before assuming office. Trump made the remark during an interview ahead of the airing of a television episode on Sunday. When asked about his past statement, he said, “What I really mean is I’d like to get it settled, and I think I’ll be successful.”\n\nThis rare acknowledgment from Trump comes after a long history of bold and exaggerated claims. In May 2023, at a CNN town hall, Trump stated, “I’ll have that done — I’ll have that done in 24 hours,” referring to the end of the war between Russia and Ukraine. He made a similar assertion in September during a debate with then-Vice President Kamala Harris, promising that the war would be resolved before he even took office, as he would personally bring both parties to the table.\n\nAlmost two months into his second term, Trump’s administration is still working to negotiate a resolution to the ongoing conflict. Despite this, Trump expressed optimism about the possibility of peace, claiming he is receiving \"good vibes\" from Russian President Vladimir Putin, whom he praised for his desire for peace. Trump’s comments suggest that he believes an agreement could be close, adding that he thinks Putin would agree to a ceasefire.\n\nMeanwhile, Trump’s Special Envoy, Steve Witkoff, traveled to Moscow this week for talks regarding a proposed temporary ceasefire, which Ukraine has reportedly accepted. If the ceasefire proposal fails to gain Putin’s agreement, Trump warned that it would result in “bad news for this world” due to the ongoing loss of life.\n\nTrump also emphasized his familiarity with Putin, expressing confidence that the Russian leader would ultimately agree to a ceasefire. His administration remains focused on efforts to bring a resolution to the conflict, even as the situation persists.","summary":"US President Donald Trump clarified on Friday that he was being \"a little bit sarcastic\" when he repeatedly claimed during his 2024 campaign that he could end the Russia-Ukraine war in just 24 hours, even before assuming office. Trump made the remark during an interview ahead of the airing of a television episode on Sunday. When asked about his past statement, he said, “What I really mean is I’d like to get it settled, and I think I’ll be successful....","url":"https://www.novinite.com/view_news.php?id=231326","image":"https://www.novinite.com/media/images/2025-03/photo_verybig_231326.jpg","video":null,"publish_date":"2025-03-16 07:24:54","author":null,"language":"en","category":"politics","source_country":"bg","sentiment":-0.243},{"id":300730604,"title":"Letters to the editor","text":"Kamala Harris\n\nChris Van Buskirk, in his “Pols & Politics” piece on March 9, suggests that former President Joe Biden should have stepped out of the presidential race “early enough to give Kamala Harris a shot at winning.” In fact, Biden should have stepped out of the race early enough for the Democratic National Convention to nominate a candidate other than Harris. It was a hopeless election. Harris could have campaigned for a year and she would have lost to Donald Trump.\n\nHarvey A. Silverglate\n\nThe same media outlets that at best ignored, at worst suppressed the evidence of a real recession during the Biden years are now yelling “RECESSION!” in a crowded theater. Sane Americans and readers of Thomas Sowell realize these conditions are the market begining a long overdue correction, as tariffs and DOGE start to bring the industrial base back to America, wean our corporations off of inflationary federal subsidies, and stabilize the stock market for a long bull market, .\n\n“Fears of recession,” give us a break.\n\nNick McNulty\n\nWindham N.H.\n\nKudos to Betsy McCaughey for her commentary (“No, Republicans aren’t gutting Medicaid,” Boston Herald, March 7) warning us to be ready for the bombardment of ghoulish ads warning about grandmothers dying and children denied needed cancer treatments “just to make billionaires like Elon Musk even richer.”\n\nThese fundraising ads began running before President Trump even arrived at the Capitol to deliver his address to Congress. During the speech, Democrats held up paddles messaging “Save Medicaid” too. Full demagoguery going forward for Dems combating GOP efforts to tame federal spending on Medicaid and stabilize the nation’s ever-growing debt.\n\nUS Rep. Delia Ramirez, D-Ill shrieked, “People will die.” US Rep. Al Green, D-Texas also stood up in the chamber to yell at the president waving his cane, which by the way earned him House censure the following day. As McCaughey stated in her piece, “These are lies. The needy are not going to lose their health care, and the demagogues know it.”\n\nIt is all theater, just as the display in the House on March 6 when Democrats rushed to the well at the front of the chamber singing “We Shall Overcome” and shutting down House business with their faux moral outrage over the censure that Rep. Green deserved for his antics during the presidential speech.\n\nIf the Democrats don’t get their act together and fast, they will find themselves totally irrelevant in short order. Donald Trump doesn’t want to privatize the US Postal Service, defund PBS, “Sesame Street” or as the latest fundraising pitch from the Democratic Governors Association warns us that Trump “is threatening to withhold federal funding for states that don’t fall in line with his personal demands.” Personal demands? Like following federal law?\n\nSal Giarratani\n\nEast Boston","summary":"Herald readers sound off on Kamala Harris's run for president, fears of a recession, and Democratic reaction to President Trump.","url":"https://www.bostonherald.com/2025/03/16/letters-to-the-editor-682/","image":"https://www.bostonherald.com/wp-content/uploads/2019/05/GettyImages-615608882.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-16 07:24:39","author":"Boston Herald editorial staff","authors":["Boston Herald editorial staff"],"language":"en","source_country":"US","sentiment":-0.368},{"id":300715852,"title":"Vance claims Biden’s spouse ran US","text":"(MENAFN) US Vice President J.D. Vance has implied that former First Lady Jill Biden took charge of cabinet meetings while her husband, then-President Joe Biden, was asleep.Speaking to Fox News on Thursday, Vance addressed reports of tensions within President Donald Trump’s administration, particularly a rumored dispute between Secretary of State Marco Rubio and government efficiency czar Elon Musk. While acknowledging some truth to the reports, Vance dismissed claims of internal division and expressed frustration over leaks from within the cabinet.“We're not going to have an administration where the president sits in cabinet meetings asleep while his wife runs the meeting and no one does anything,” he stated.Trump has frequently mocked Biden as “Sleepy Joe,” referencing his public gaffes and questions about his mental sharpness. Concerns over Biden’s cognitive abilities became a major issue during the 2024 election, especially after his widely criticized CNN debate performance against Trump. Biden struggled to complete sentences, lost his train of thought multiple times, and made several verbal missteps.Following intense pressure, Biden withdrew from the race in July 2024, endorsing his Vice President, Kamala Harris, as the Democratic nominee. However, months before his withdrawal, Jill Biden reportedly presided over a cabinet meeting in his place, sparking speculation among Republicans about who was truly leading the country at the time.","summary":"(MENAFN) US Vice President J.D. Vance has implied that former First Lady Jill Biden took charge of cabinet meetings while her husband, then-President Joe Biden, was asleep.Speaking to Fox News on ...","url":"https://menafn.com/1109319520/Vance-claims-Bidens-spouse-ran-US","image":"https://menafn.com/updates/pr/Menafn_News_Images\\local_politics_1092.jpg","video":null,"publish_date":"2025-03-16 06:36:20","author":"Date,MENAFN","authors":["Date","MENAFN"],"language":"en","category":"politics","source_country":"jo","sentiment":-0.15},{"id":300676688,"title":"SpaceX crew docks at International Space Station to bring stranded astronauts back to Earth","text":"The crew aboard a SpaceX Dragon capsule sent to retrieve two astronauts stranded in space for nine months were greeted by an 'alien' as they docked at the International Space Station (ISS).\n\nNASA astronaut Nick Hague, who was already aboard the ISS, gave the incoming crew an extraterrestrial welcome by donning an alien mask for their arrival.\n\nThe SpaceX Dragon crew successfully reached the station after taking off from NASA's Kennedy Space Center. \n\nTheir mission was to deliver four new astronauts to the ISS and bring home stranded crew member Sunita Williams and Butch Wilmore. \n\nWilmore swung open the space station's hatch and then rang the ship's bell as the new arrivals floated in one by one and were greeted with hugs and handshakes.\n\n\"It was a wonderful day. Great to see our friends arrive,\" Williams told Mission Control after their arrival. \n\nWilliams and Wilmore will spend the next few days helping their incoming colleagues become acclimated with the space station. \n\nThe two astronauts, along with Hague and cosmonauts Aleksandr Gorbunov, can then begin their return to Earth aboard the SpaceX Dragon Capsule as early as Wednesday.\n\nThe pair have been stranded in orbit since June 5, with SpaceX owner Elon Musk and others claiming they were left on the ISS for political reasons, although this has been refuted by the astronauts.\n\nThey have been aboard the ISS with NASA astronauts Hague and Don Pettit and Russian cosmonauts Alexey Ovchinin, Ivan Vagner and Aleksandr Gorbunov.\n\nThe incoming Crew-10 is composed of NASA astronauts Anne McClain and Nichole Ayers, Japan's Takuya Onishi, and Russia's Kirill Pesko. \n\nThe Dragon capsule docked at the ISS just after 12:04am ET after a more than 28 hour journey. \n\nWilliams and Wilmore were only expected to be in orbit for eight days. \n\nBut the Boeing Starliner capsule which delivered them to the ISS encountered so many problems that NASA insisted it come back empty, leaving its test pilots behind to wait for a SpaceX lift.\n\nThe new crew from the SpaceX capsule will spend the next six months at the space station, which is considered the normal stint.\n\nTheir arrival comes after several setbacks for the relief mission, the most recent of which saw the flight scrapped at the eleventh hour on Wednesday, due to a hydraulic system issue with the Falcon 9 rocket.\n\nNASA had moved up the return mission by two weeks after after President Trump told Musk to 'go get' Williams and Wilmore.\n\nBefore the president's request, the astronauts were not coming back earlier than March 26.\n\n'It's been a roller coaster for them, probably a little bit more so than for us,' Williams said of her family.\n\nThe mission became a flashpoint during the election after Trump and Musk claimed the astronauts had been left languishing in space for political reasons.\n\nMusk said he offered to bring the astronauts home eight months ago, but the Biden Administration shot it down because it would've made Trump 'look good' in the presidential race against former vice president Kamala Harris.\n\nDuring a recent press briefing, Ken Bowersox, associate administrator of the NASA's Space Operations Mission Directorate, admitted that there 'may have been conversations' in the Biden White House about delaying the return for political optics of having Trump's most famous donor save the day, but he was not part of the discussions.\n\nThe Crew-10 launch occurred as Wilmore and Williams were asleep in their daily schedule on the station, Dina Contellam deputy manager of NASA's ISS program, told reporters after the launch. \n\nHaving seen their mission turn into a normal NASA rotation to the ISS, Wilmore and Williams have been doing scientific research and conducting routine maintenance with the other five astronauts.\n\nWilliams told reporters earlier this month that she was looking forward to returning home to see her two dogs and family including her husband Michael and mom Bonnie.\n\nWilmore has two teenage daughters who he shares with wife Deanna.\n\n'We've had so many changes and it's a bit mentally exhausting,' his daughter Daryn told E! News about the ongoing saga.","summary":"NASA astronaut Nick Hague, who was already aboard the ISS, gave the incoming crew an extraterrestrial welcome by donning an alien mask for their arrival.","url":"https://www.dailymail.co.uk/sciencetech/article-14503655/NASA-rescue-mission-rocket-docks-space-station-stranded-astronauts.html","image":"https://i.dailymail.co.uk/1s/2025/03/16/05/96240075-0-image-a-98_1742103324452.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/16/4573415043973362629/1024x576_MP4_4573415043973362629.mp4","publish_date":"2025-03-16 06:35:11","author":"Bethan Sexton,Chris Melore Assistant,Editor","authors":["Bethan Sexton","Chris Melore Assistant","Editor"],"language":"en","source_country":"gb","sentiment":-0.363},{"id":300662442,"title":"Trump-Themed Bus Up For Sale For Rs 13 Lakh As New Jersey Store Shuts Down","text":"A pro-Trump store in Toms River, New Jersey, is shutting down, and with it, its signature minibus is up for grabs. The owners of 'Let's Go Brandon', a shop dedicated to Donald Trump merchandise, have listed their 2006 Ford minibus for sale at $14,999 (approximately Rs 13 lakh) or best offer.The vehicle, which once stood as a roadside attraction, is wrapped in a large decal of the US President wearing aviator sunglasses and an American flag-patterned leather jacket and clutching a copy of the US Constitution. Above his head, a phrase reads, \"I'LL BE BACK.\" The minibus, which sports the New Jersey license plate \"TRMPWON,\" has no seats but includes a hydraulic lift gate.\"Bus runs good!\" the store announced in a Facebook post on Thursday. \"No seats. Body needs work.\"Co-owner Vincent Scuzzese said he decided to sell the bus because he already owns a Trump van. While the brick-and-mortar store is closing due to a \"loss of lease,\" Mr Scuzzese confirmed that 'Let's Go Brandon' will continue as an online business and through pop-up sales. A deli is expected to take over the store's location, NJ.com reported.Since its opening in April 2022, 'Let's Go Brandon' has been a hotspot for Trump supporters, selling everything from MAGA hats and flags to novelty items like Trump-shaped honey bottles and Trumpy Bears. The store's name references a viral phrase that originated from a misheard NASCAR crowd chant directed at President Joe Biden in 2021.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");The shop gained attention for its aggressive branding, including its latest merchandise - a T-shirt mocking former Vice President Kamala Harris as the Democratic Party's presidential nominee. Named the \"Let's Go Brenda\" shirt, it features Kamala Harris in clown makeup. According to Mr Scuzzese, the store sold between 50 and 100 shirts in just a few days.The store in Toms River was stocked with a wide range of pro-Trump and anti-Biden merchandise, attracting MAGA supporters with its bold, politically charged items. It sold everything from classic MAGA hats, \"Let's Go Brandon\" T-shirts, and cowboy hats to novelty collectibles like Trumpy Bear, Trump Cotton Candy Hair, and Make Honey Great Again honey in a Trump-shaped squeeze bottle.Customers could also find satirical bumper stickers, mugs, hand puppets, and anti-mainstream media gear.Business had been booming, especially leading up to Trump's Presidential campaign rally in Wildwood. The store even stayed open late on the night of the July 13 assassination attempt in Pennsylvania to accommodate a surge in shoppers.Mr Scuzzese remains optimistic about the future. \"It could be a blessing in disguise,\" he told NJ.com. \"But we'll see how the pop-ups go. I could get a new store tomorrow.\"","summary":"The vehicle is wrapped in a large decal of Donald Trump wearing aviator sunglasses and an American flag-patterned leather jacket, and clutching a copy of the US Constitution.","url":"https://www.ndtv.com/world-news/donald-trump-themed-bus-up-for-sale-for-rs-13-lakh-as-new-jersey-store-shuts-down-7933930","image":"https://c.ndtvimg.com/2025-03/9s7vkbqo_donald-trump-bus_625x300_16_March_25.jpeg","video":null,"publish_date":"2025-03-16 04:54:14","author":null,"language":"en","source_country":"in","sentiment":-0.226},{"id":300632980,"title":"SpaceX team links up with International Space Station to retrieve stranded astronauts and return them to Earth","text":"A SpaceX rocket sent to retrieve two astronauts who have been stranded in space for nine months has finally docked at the International Space Station.\n\nThe SpaceX Falcon 9 rocket successfully took off Friday night from NASA’s Kennedy Space Center, on a mission to deliver four new astronauts to the satellite.\n\nThe arrival of the new crew means that Sunita Williams and Butch Wilmore will finally be able to return to Earth following months in limbo.\n\nThe pair have been stranded in orbit since June 5, with SpaceX owner Elon Musk and others claiming Williams and Wilmore were left on the ISS for political reasons although this has been refuted by the astronauts.\n\nThe arrival of Crew-10, which includes NASA astronauts Anne McClain and Nichole Ayers, Japan’s Takuya Onishi, and Russia’s Kirill Pesko, means they will be allowed to return home.\n\nThe new crew docked at the ISS just after 12:04am ET on Sunday after a more than 28 hour journey.\n\nWilmore is scheduled to open the hatch after carrying out ‘extensive’ pressurizing and leak check procedures which will take around an hour and 30 minutes.\n\nIt is hoped that Williams and Wilmore will be able to begin their return to Earth aboard the SpaceX Dragon Capsule as early as Wednesday. The duo were initially scheduled for an eight day mission.\n\nThey will be joined on their return flight by NASA’s Nick Hague and Russia’s Aleksandr Gorbunov. \n\nThe four newcomers will spend the next few days learning the station’s ins and outs \n\nThe new crew will spend the next six months at the space station, considered the normal stint. \n\nTheir arrival comes after several setbacks for the relief mission, the most recent of which saw the flight scrapped at the eleventh hour on Wednesday due to a hydraulic system issue with the Falcon 9 rocket.\n\nNASA had moved up the return mission by two weeks after after President Trump told Musk to ‘go get’ Williams and Wilmore.\n\nBefore the president’s request, the astronauts were not coming back earlier than March 26.\n\n‘It’s been a roller coaster for them, probably a little bit more so than for us,’ Williams said of her family.\n\nThe mission became a flashpoint during the election after Trump and Musk claimed the astronauts had been left languishing in space for political reasons.\n\nMusk said he offered to bring the astronauts home eight months ago, but the Biden Administration shot it down because it would’ve made Trump ‘look good’ in the presidential race against former vice president Kamala Harris.\n\nDuring a recent press briefing, Ken Bowersox, associate administrator of the NASA’s Space Operations Mission Directorate, admitted that there ‘may have been conversations’ in the Biden White House about delaying the return for political optics of having Trump’s most famous donor save the day, but he was not part of the discussions.\n\nThe Crew-10 launch occurred as Wilmore and Williams were asleep in their daily schedule on the station, Dina Contellam deputy manager of NASA’s ISS program, told reporters after the launch. \n\nHaving seen their mission turn into a normal NASA rotation to the ISS, Wilmore and Williams have been doing scientific research and conducting routine maintenance with the other five astronauts.\n\nWilliams told reporters earlier this month that she was looking forward to returning home to see her two dogs and family including her husband Michael and mom Bonnie.\n\nWilmore has two teenage daughters who he shares with wife Deanna.\n\n‘We’ve had so many changes and it’s a bit mentally exhausting,’ his daughter Daryn told E! News about the ongoing saga.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA SpaceX rocket sent to retrieve two astronauts who have been stranded in&#8230;\n\n\nThis Post: SpaceX team links up with International Space Station to retrieve stranded astronauts and return them to Earth first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/spacex-team-links-up-with-international-space-station-to-retrieve-stranded-astronauts-and-return-them-to-earth/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-SpaceX-crew-docks-at-International-Space-Station.jpg","video":null,"publish_date":"2025-03-16 04:44:58","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.36},{"id":300618220,"title":"5 takeaways from HumanX: Here's how key speakers managed to look past the industry's hype","text":"This week, I attended HumanX, where thousands of startup founders, investors, and tech industry executives gathered in Las Vegas to discuss AI's value proposition to their bottom lines — and the future.The nearly four-day conference opened with remarks from former Vice President Kamala Harris. Harris, who served as \"AI czar\" during the Biden Administration, was one among a handful of lawmakers at the event who called for stronger cooperation between the tech industry and the federal government.In the following days, attendees sat in on panels with veteran investors like Vinod Khosla and Tim Draper alongside rising stars of the AI boom like Hugging Face's Thomas Wolf and Mistral's Arthur Mensch. There was ample time to swerve between the booths on the convention floor where tech giants and startups alike had reps ready to woo customers.AI conferences can feel a bit like a dance. People talk with excitement about the transformative power of this technology, but it's also clear they're gauging where the real value lies.Here are my top takeaways:Conference speakers had some advice on making long-term gains with AI.Glean CEO Arvind Jain cautioned companies to establish an \"AI team\" to create a roadmap for integrating the technology. \"Make small bets. Don't try to actually immediately focus on ROI,\" he said. \"Focus on education first, like, make your workforce trained with AI.\"In the sales landscape, Conviction's Sarah Guo said companies have already made \"high-fructose corn syrup\" gains, reveling in their capacity to send mass emails or spam customers with calls.\"That actually drove a lot of traction,\" she said. However, \"real customers actually churned off that pretty quickly because it doesn't serve a real need. Nobody wants the spam — which is what it is.\"Still, it got people to start \"buying the products\" and she expects that to continue. \"That's what I think we're going to see this year in terms of those real ROI use cases.\"AI startups are fetching wild valuations, but the question is whether they're caught in a bubble that's set to burst.Investors are essentially \"taking a bet\" on the future cash flow of a business, said Tuhin Srivastava, CEO and cofounder of AI inference company Baseten. \"I'm a  beneficiary of that,\" he added.Srivastava pointed to Anysphere, which makes the coding assistant Cursor, and was in talks to raise funding at a valuation of close to $10 billion earlier this month, after hitting $100 million in annualized recurring revenue in a span of 12 months, Bloomberg reported. Coding startup Codeium, is raising funding at a $2.85 billion valuation after hitting $40 million in ARR, TechCrunch reported.At face value, these seem like massive valuations, but Srivastava says he thinks they're reasonable in the context of the venture landscape just a few years ago.\"Companies in 2021, during all that craze were like, you know, a million dollars of ARR, raising a billion dollars. Think about these AI companies, they all have a lot of revenue,\" he said.He joked that valuations — to some extent — are being calculated on \"vibes\" but he believes they're grounded in real growth potential. \"You know, we're probably at 0.1 percent adoption of AI in the enterprise. So we have a thousand x upside there.\"For companies with little to no revenue, talent may be the value metric.A few investors told BI they heard, to their surprise, that companies acquiring AI startups for a strategic advantage were valuing them on a \"per engineer\" basis.Aside from prompt engineers and a beleaguered new set of \"AI heads\" at companies, many are still wondering what \"new jobs\" this technological shift will bring.As AI makes it easier to code, and \"vibe-code,\" we should expect to see a new wave of highly compensated \"product engineers,\" Andrew Filev, CEO of AI coding platform Zencoder said. These are individuals who are versed in product management, a role that typically oversees new products from ideation to launch, and software engineering, which deals with the technical details of new products.AI governance is still a bit of a murky term.\"There's a little bit of a conflation of governance and regulation,\" said Navrina Singh, founder and CEO of AI governance platform Credo.Singh told BI she defines governance with three questions:The most misinformed opinion companies have is that governance will slow them down in adopting AI. Credo's data has shown the opposite. \" We are finding that companies are getting better ROI,\" she said.Dataiku's CEO Florian Douetteau observed a similar anxiety around governance at an \"executive field trip\" the company held for the CEOs of its customer base in September 2024. The company further investigated CEOs' top AI anxieties and published them in a survey. Governance ranked high on the list with 94% of about 500 CEOs surveyed saying they suspect employees are secretly using generative AI tools without official approval.Silicon Valley leaders from Khosla to Sam Altman have expressed concerns that AI will spur deflation. Those fears were echoed by a handful of attendees at HumanX.To be clear, the US is still experiencing inflation with the consumer price index rising about 2.8% for the twelve month period ending in February 2025, according to the US Bureau of Labor Statistics. However, technological shifts are often correlated with deflation, as they boost productivity and lower production costs.\"There is no denying that AI-based technologies are evolving rapidly and being adopted by people and enterprises,\" said Steve Berg, a partner at Lytical Ventures. \"There are inflationary impacts happening as well, which offset the deflationary impacts of technology, but what happens when one side or the other becomes dominant?\"","summary":"I attended HumanX this week. Here are my top takeaways from the conference.","url":"https://www.businessinsider.com/takeaways-from-humanx-ai-conference-2025-3","image":"https://i.insider.com/67d61be1b8b41a9673faca8b?width=1200&format=jpeg","video":null,"publish_date":"2025-03-16 01:51:15","author":"Lakshmi Varanasi","authors":["Lakshmi Varanasi"],"language":"en","category":"sports","source_country":"us","sentiment":-0.322},{"id":300600716,"title":"Why do Republicans now think it’s okay to pay more for everything?","text":"Explaining the Right is a weekly series that looks at what the right wing is currently obsessing over, how it influences politics—and why you need to know.\n\nPresident Donald Trump campaigned in 2024 on the false notion that the policies put in place by President Joe Biden (along with Vice President Kamala Harris) had created economic chaos and out-of-control inflation.\n\nThis was untrue. In fact, economic data showed that conditions improved in most categories under Biden. Unemployment rates improved, especially in contrast to the economic downturn that occurred under Trump’s mishandling of the 2020 coronavirus pandemic. Regardless, Trump promised to fix all of the purported problems—like soaring egg prices—on “Day 1” of his presidency.\n\nThat didn’t happen and in recent weeks, economic conditions have worsened. Trump’s actions since he was sworn in on Jan. 20, from slashing the federal workforce via Elon Musk’s so-called Department of Government Efficiency to his haphazard and widely derided tariff announcements, have led to rising fears of an economic slowdown and possible recession.\n\nThe major stock indices fell for multiple days in a row in response to Trump’s unpredictable actions. But despite his extensive history of pointing to the market as validation or repudiation of economic action, Trump now says the markets are merely experiencing a “period of transition.”\n\nAnd Trump’s not the only one who is shrugging his shoulders.\n\nHis fellow Republican elected officials are downplaying recession fears and making excuses for Trump’s erratic tariff actions. Pro-Trump conservative media outlets like Fox News are all-in as well. On a recent episode of her prime-time show, host Laura Ingraham told viewers to “ignore” news of the market melting down.\n\nWhy is this happening? Because Trump said so and the right’s guiding principle since he was elected in 2016 is simple: Do as he says.\n\nThe party that howled when former President Barack Obama bailed out the auto industry was quiet in 2020, when Trump bailed out farmers suffering as a result of his trade war with China. When the jobs market was rocked during Trump’s first term, the same Republicans who spent nearly a decade chastising Obama for slow job growth didn’t have much to say. \n\nMore recently, after falsely accusing Biden of politicizing the justice system, Trump installed a weird acolyte who authored Trump fan fiction as the head of the FBI—with near-unanimous support from GOP senators.\n\nThe Republican Party is now in thrall to Trump’s cult of personality and has abandoned the few tenuous principles that conservatives once prioritized. \n\nEssentially, if Trump tells his supporters that the Earth is flat, they will turn on a dime and repeat the falsehood. Outlets like Fox News soon amplify the lie and build an echo chamber between themselves, Republican leaders, and Trump, repeating nonsense until it becomes a shared reality.\n\nThe Trump cult is so far gone that Republican voters are now cheering as their own relatives and friends are fired from their federal jobs at the capricious behest of his co-President Musk. But those same MAGA-philes didn’t even blink when the president turned the White House into a car lot and encouraged people to buy his buddy Elon’s $80,000 Teslas.\n\nThe mass delusion has now convinced many of those same supporters that they just have to tolerate rising prices for staple products, even though they likely would’ve rioted against paying more than $9 for a dozen eggs under a Democratic president.\n\nFor decades, conservatives have obliviously voted against their own interests when supporting candidates who cut social services and enact tax policies that hurt red state residents more than the rest of America. But under Trump, voting against their interests has become a point of pride—because as long as they please their cult leader, all is well.","summary":"Explaining the Right is a weekly series that looks at what the right wing is currently obsessing over, how it influences politics—and why you need to know.\n\n\n\n\nPresident Donald Trump campaigned in 2024 on the false notion that the policies put in place by President Joe Biden (along with Vice President Kamala Harris) had created economic chaos and out-of-control inflation.\n\n\n\nThis was untrue. In fact, economic data showed that conditions improved in most categories under Biden. Unemployment rates improved, especially in contrast to the economic downturn that occurred under Trump’s mishandling of the 2020 coronavirus pandemic. Regardless, Trump promised to fix all of the purported problems—like soaring egg prices—on “Day 1” of his presidency.\n\n\n\nThat didn’t happen and in recent weeks, economic conditions have worsened. Trump’s actions since he was sworn in on Jan. 20, from slashing the federal workforce via Elon Musk’s so-called Department of Government Efficiency to his haphazard and widely derided tariff anno","url":"https://www.dailykos.com/story/2025/3/15/2309974/-Why-do-Republicans-now-think-it-s-okay-to-pay-more-for-everything?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1408780/story_image/ETR_3.14.png?1741976299","video":null,"publish_date":"2025-03-15 23:00:08","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.329},{"id":300596984,"title":"Republican Lawmaker Speaks Out After Contentious Town Hall","text":"Representative Chuck Edwards, a North Carolina Republican, has spoken out following a high-profile heckling at his Asheville town hall and addressed the furor around the event.Newsweek reached out to House Speaker Mike Johnson's office for comment by email on Saturday afternoon.Why It MattersSome Republicans have faced nearly relentless heckling at recent town halls as constituents berate lawmakers over federal agency and budget cuts made by the Department of Government Efficiency (DOGE), an unofficial agency created through executive order and nominally led by Elon Musk.President Donald Trump last week dismissed the controversy as the work of \"paid troublemakers,\" and Republican leaders have speculated that Democrats organized the protests. The GOP has advised party members to stop holding the town halls, although some have continued to do so.What To KnowEdwards made headlines this week for a particularly contentious town hall event that included the removal of several attendees as they questioned cuts to veteran assistance and other programs. Videos of hecklers yelling at Edwards have racked up over 1 million views in just days.He finally broke his silence on Saturday with an interview appearance on CNN, during which he addressed the anger of constituents and his own takeaways from the interactions in Asheville.Edwards surprised CNN's Fredricka Whitfield by saying he \"enjoyed the lively conversation,\" stressing that there were \"many people that took time to be there\" and \"took time to put questions in the box that they wanted answered.\"\"I believe it's part of the democratic process, even though it might be uncomfortable from time-to-time, I think town halls are necessary,\" Edwards said.The congressman added: \"I believe that we all need to go back and make sure that we have our facts right. I need to ask of the Trump White House that they provide the facts of the layoffs, for example, that they're making. And I believe that the American people, including those right there in that room, need to not necessarily believe the political talking points that they're seeing on Facebook, but actually get down to the facts.\"Edwards insisted that much of the discussion has centered on \"facts that were not in the bill\" that Congress passed this week in order to avoid a government shutdown, including claims that the bill would make cuts to Social Security, Medicare and Medicaid. He accused news media of repeating the facts without verifying them and that it was \"real easy for people to believe.\"\"There was an allegation that 80,000 people had been laid off that that was included in the budget that I helped pass. Nothing like that happened,\" Edwards said. \"There was an allegation that Medicare and Social Security were being cut. Nothing of the sort has happened.\"The congressman continued: \"I believe that we all need to make sure that we're speaking from the standpoint of what actually has happened and what's taking place, as opposed to listening to this political tripe.\"Edwards promised to have his team \"source and find out exactly what have been the cuts, how might they affect this district, and then I'll make the decision whether or not I feel they're in the best interest of this district or not.\"\"In some cases, the information that we need is just not there, which is one of the things that is important about us having an organization like Elon Musk and DOGE,\" he said.What People Are SayingPresident Donald Trump wrote in a post on Truth Social: \"Paid 'troublemakers' are attending Republican Town Hall Meetings. It is all part of the game for the Democrats, but just like our big LANDSLIDE ELECTION, it's not going to work for them!\"House Speaker Mike Johnson, a Louisiana Republican, told reporters at a news conference: \"We've seen this movie before. They're professional protesters. So why would we give them a forum to do that right now?Democratic Minnesota Governor Tim Walz, who was former Vice President Kamala Harris' running mate in last year's election wrote on Thursday on X, formerly Twitter: \"People want to make their voices heard, but their congressmen are hiding in Washington and refusing to do town halls. I'm going to join Democrats across the country to show up where Republicans aren't.\"What Happens Next?Edwards reiterated his commitment to holding town halls in the face of the backlash, telling CNN that he hit a pace of eight town halls in his first congressional term and would look to maintain a \"similar pace\" in his current term.Meanwhile, Democrats announced a series of town halls in Republican-held districts across the country, with Walz holding two that would start this weekend.","summary":"Republican lawmakers have been cautioned to avoid holding town halls after video of heckling made the rounds on social media.","url":"https://www.newsweek.com/republican-lawmaker-chuck-edwards-speaks-town-hall-2045493","image":"https://d.newsweek.com/en/full/2608175/norht-carolina-asheville-town-hall.jpg","video":null,"publish_date":"2025-03-15 22:42:20","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.139},{"id":300593628,"title":"Kim Kardashian posts photo shoot with a Tesla Cybertruck and Optimus robot","text":"Some celebrities are ditching Elon Musk's Tesla to protest his work with DOGE and President Donald Trump's administration.Not Kim Kardashian, though.Kardashian appeared as the cover star for Perfect Magazine's upcoming issue, which included a Tesla-themed photo spread. One photo showed Kardashian posing in the bed of a Cybertruck, while another featured her cuddling with a Tesla robot near the beach.Kardashian shared a slideshow of the photos, taken by Steven Klein, with her 357 million Instagram followers on Friday. Some Instagram users criticized the post due to Tesla's newfound association with the Trump administration.A post shared by Perfect Magazine said the photos were snapped in Malibu, California, last November. It's been four months since then, and a lot has happened.Musk, Tesla's CEO, has become the target of criticism for his work with the White House DOGE Office, which is tasked with slashing the federal budget. DOGE has sought to reduce the federal workforce and cut numerous departments and agencies, including NASA, USAID, and Veteran's Affairs. Musk also faced ire from politicians in France, Germany, and the United Kingdom, who have britsled at his attempts to influence European politics.In response, Tesla sales are down in several global markets and the company's stock price has cratered. Critics have staged protests against Musk, and some Tesla owners — including Arizona Sen. Mark Kelly — have sold their vehicles.Amid reports of Tesla's struggles, Trump hosted an event at the White House last week where he showed off a Tesla car. Representatives for Tesla did not respond to a request for comment.Kardashian told The Free Press in a 2021 interview that her political ideology is a mix of liberal and conservative. \"I believe in the rights that the Democrats want, but I believe in the taxes that the Republicans want,\" she said.Kardashian has embraced criminal justice reform over the last decade, leading her to meet with Trump at the White House in 2018, 2019, and 2020. She also visited the White House during former President Joe Biden's administration in 2024 to meet Vice President Kamala Harris.","summary":"One photo showed Kim Kardashian posing in the bed of a Cybertruck, while another featured her cuddling with an Optimus robot near the beach.","url":"https://www.businessinsider.com/kim-kardashian-tesla-cybertruck-optimus-robot-2025-3","image":"https://i.insider.com/67d5efaab8b41a9673faca0e?width=1200&format=jpeg","video":null,"publish_date":"2025-03-15 22:39:43","author":"Lauren Edmonds","authors":["Lauren Edmonds"],"language":"en","category":"business","source_country":"us","sentiment":0.073},{"id":300589014,"title":"Donald Trump Invokes Controversial 1700s Wartime Law Used to Justify Japanese Internment Camps","text":"President Donald Trump has invoked a 227-year-old wartime law in order to help carry out mass detainments and deportations in the United States, fulfilling a controversial 2024 campaign promise.\n\n On Saturday, March 15, Trump announced that he will invoke the Alien Enemies Act of 1798, a widely condemned immigration law that gives the president sweeping powers to bypass equal protection and due process while targeting foreign citizens.\n\n When it has been invoked, it has led to human rights crises that history now looks down upon — but the law was never formally repealed by Congress.\n\n The directive specifically targets members of the Venezuelan prison gang Tren de Aragua, and authorizes removal of all Venezuelan citizens ages 14 and older who are not U.S. citizens or \"lawful\" permanent residents.\n\n Trump previously vowed to use the Alien Enemies Act after visiting Aurora, Colo., on Oct. 11, when he delivered a headline-making campaign speech disparaging immigrants.\n\n Following the campaign rally, he posted on social media, \"We are now known, all throughout the world, as OCCUPIED AMERICA...But to everyone here in Colorado and all across our nation, I make you this vow: November 5th, 2024 will be LIBERATION DAY in America.\"\n\n Referencing a few prominent instances where American people were killed by non-citizens, Trump said he \"will put these vicious and bloodthirsty criminals in jail or kick them the hell OUT OF OUR COUNTRY.\"\n\n Without naming any target in particular, the former president continued by saying, \"To expedite removals of this savage gang, I will invoke the Alien Enemies Act of 1798 to target and dismantle every migrant criminal network operating on American Soil.\"\n\n He then vaguely accused his 2024 election opponent, then-Vice President Kamala Harris, of inflicting \"violence and terror,\" falsely painting her as the one responsible for Joe Biden's U.S. border policy and a years-long rise in illegal border crossings.\n\n The Alien Enemies Act of 1798 is best remembered as the law that allowed Democratic President Franklin D. Roosevelt to place Japanese, Italian and German immigrants into internment camps during World War II, whether or not they were affiliated with military actions from their countries of origin.\n\n \"The Alien Enemies Act and complementing authorities have allowed presidents to target people on the basis of their identity, not their conduct or the threat they pose to national security,\" wrote Katherine Yon Ebright, a national security expert for the nonpartisan Brennan Center for Justice, in October.\n\n \"In 1988, when Congress apologized and provided reparations for Japanese internment, it acknowledged that the policy was rooted in 'racial prejudice' and 'wartime hysteria,' not valid security concerns,\" she continued in her article, which centered around the dangers of the overly broad 18th-century law. \"Congress would later describe Italian internment as a 'fundamental injustice,' and the Department of Justice would recognize that German noncitizens had been targeted 'based on their ancestry.' \"\n\n Though the Alien Enemies Act is intended to be used only in wartime, and apply only when official governments have threatened military action, a president could conceivably weaponize the law to apply to people hailing from any country they deem to be \"invading\" the U.S. — which is how Trump has described several nations whose residents have sought refuge in the States.\n\n People familiar with the Trump campaign's early policy deliberations previously told Rolling Stone that he came up with a \"very convoluted and crazy\" theory for how he can abuse the law to justify mass deportations, even if the U.S. is not at war with a foreign government.\n\n Trump has long been known for spouting anti-immigration rhetoric, but his new mass deportation program — helmed by \"border czar\" Tom Homan — has sparked concern about the safety of immigrants and people of color who are perceived to be in the country illegally.\n\n At the Aurora campaign rally in October, local journalist Kyle Clark reported that, while discussing migrant crime, Trump said, \"We have to live with these animals. But we won’t live with them for long.\" Immediately after, a supporter in the crowd shouted, \"Kill them!\"\n\n Also at the event, Trump immigration adviser Stephen Miller — a White nationalist whose organization America First Legal was initially listed on the advisory board of Project 2025 — said that under Trump, the United States will return to being a country of \"only Americans,\" even though the nation is largely composed of immigrants and their descendants.\n\n Miller has since been named Trump's homeland security adviser and the deputy White House chief of staff for policy.","summary":"The Alien Enemies Act of 1798 is a widely condemned detainment law designed to be used in the throes of war. Under Trump, it could be applied to target any non-citizen whom he deems a threat","url":"https://people.com/donald-trump-invokes-alien-enemies-act-mass-deportation-plan-11696920","image":"https://people.com/thmb/yAAOrhT2_jog4VpQh9WO3RGZXGQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x129:755x131)/president-donald-trump-frist-address-congress-executive-order-030425-8714588e61ae4c65a14748eae30b420d.jpg","video":null,"publish_date":"2025-03-15 21:17:17","author":"Kyler Alvord","authors":["Kyler Alvord"],"language":"en","category":"politics","source_country":"US","sentiment":-0.008},{"id":300579750,"title":"Kamala Harris campaign required she only be seated in chairs that ‘met certain specifications’","text":"A new book about the presidential campaign of former Vice President Kamala Harris reports that her campaign demanded she be seated only in chairs that “met certain specifications.”\n\nAn excerpt from “FIGHT: Inside the Wildest Battle for the White House,” by Jonathan Allen and Amie Parnes, published in The Hill, detailed the strict seating arrangements.\n\n“Her team required that she be provided a chair that met certain specifications: ‘Leg height no less than 15 inches; floor to top of seat height no less than 18.9 inches; arms on chairs may not be very high, arms must fall at a natural height; chairs must be firm,” according to the book excerpt.\n\nThe mandated chair specifications came following her first media interview after taking over the top of the Democratic ticket roughly 40 days before.\n\nHarris was joined by her running mate, Minnesota Gov. Tim Walz, for a joint interview with CNN’s Dana Bash on Aug. 29, 2024.\n\nThe pair sat at a table, but the visual of Harris appearing to be lower than Walz prompted her team to issue a new mandate to never let it happen again.\n\n“Sitting next to Walz in a chair that seemed to place her below him and heaping praise on Biden’s record, Harris did not look like a candidate seeking the highest office in the land,” the excerpt read. “The whole scene reinforced the criticism that the vice president was either incapable, or afraid, of answering tough questions on her own.”\n\nBut Allen and Parnes said that regardless of the mandated chair specs, “the question facing Harris was whether she could build a sturdy platform.”\n\nAlso included in the excerpt was news of former President Joe Biden telling Harris to not distance herself from his policies.\n\n“No daylight, kid,” Biden reportedly said.\n\nFox News Digital reached out to the office of the former vice president but did not immediately receive a response.","summary":"Demands came after optics of her first media interview with Democratic running mate Gov. Tim Walz.","url":"https://nypost.com/2025/03/15/media/kamala-harris-campaign-required-she-only-be-seated-in-chairs-that-met-certain-specifications/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100531761.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/HyPzLNY9-RyIcpnTz.mp4","publish_date":"2025-03-15 20:57:03","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":-0.322},{"id":300614436,"title":"'Gutless Republicans': Rep. Bacon bashed at Omaha stop of national town hall tour","text":"OMAHA — Should the Omaha area replace Republican U.S. Rep. Don Bacon with a Democrat and help curb the worst impulses of the Trump administration?\n\n You betcha, Minnesota Gov. Tim Walz said during the second stop of his national tour criticizing House Republicans for avoiding in-person town halls.\n\n Walz, a Nebraska native, made Bacon a focus of his mid-morning Saturday speech at Metropolitan Community College’s Fort Omaha campus to more than 400 people.\n\n He said he was “not here to personally attack the representative” or call him names. But he said Bacon needs to face his voters and their questions.\n\n “Do the damn job and answer the questions,” Walz said.\n\n The former running mate of Vice President Kamala Harris slammed Bacon for following national GOP advice and skipping an in-person town hall this year.\n\n Bacon, who has hosted in-person and telephone town halls in the Omaha-based 2nd Congressional District, is hosting a tele-town hall on March 25.\n\n Bacon told the Examiner recently that he did not like the tone and tenor of recent town halls he had seen and that some people are afraid to attend.\n\n “I’ve been at some of the in-person town halls,” Bacon said. “When you got moms and dads saying we can’t bring our kids to a town hall, there’s a problem.”\n\n He also spent at least two nights this week responding to critics on Elon Musk’s X by saying he would be able to reach more voters on his tele-town hall.\n\nGov. Tim Walz says at Iowa town hall he is ‘soul-searching’ after 2024\n\nBacon ‘terrified’\n\n Jane Kleeb, chair of the Nebraska Democratic Party, said Bacon is “terrified,” one of the “gutless Republicans who are afraid to see their voters.”\n\n She told the standing-room crowd that Nebraska Democrats would create a book of comments from Saturday attendees and deliver it to Bacon.\n\n “All they care about is that government is cut down to the bone,” Kleeb said of Republicans. “Democrats believe government is here to serve the people.”\n\n Walz’s tour is aimed at reviving Democratic voter engagement in competitive House districts served by Republicans not hosting in-person town halls.\n\n He spoke to more than 1,000 people in Des Moines on Friday, where he acknowledged how many Democrats and nonpartisans feel lost under President Donald Trump.\n\n Walz said he understood the feeling of wanting Democratic and independent and non-Trump Republican leaders to “do something.”\n\n He asked the standing room-only crowd to take the time to tell their elected leaders what they need to see them doing. He said Democrats would respond.\n\n Several questioners asked Walz about how to fight feeling unsafe or threatened, from immigrants with legal status to workers worried about the ability to organize and to people with friends and relatives who are LGBTQ. Others expressed concerns about federal programs and grants becoming unpredictable.\n\n “There’s a tendency … to check out,” Walz said. “You didn’t do that … because you love the country, and you know you need to do something about it.”\n\n Maurice Jones, a Democratic candidate for Omaha City Council in North Omaha’s District 2, said Americans are learning with Trump’s “mass firings” that the federal government isn’t going to protect them.\n\n Both Democrats running for mayor, Jasmine Harris and John Ewing, also addressed the crowd, saying cities would need to lead the way back.\n\n State Sen. Ashlei Spivey of Omaha said during the Walz appearance that elected officials need help from the people to let state and federal leaders know that things are not OK.\n\n She said leaders need to know people are not happy with how things are going, including in Nebraska, where she said the governor does Trump’s bidding.\n\n “Our executive branch mirrors and does everything that the Trump administration says,” Spivey said.\n\n Walz credited western Nebraskans for showing up to Gov. Jim Pillen’s town hall in Scottsbluff and pushing back on his effort to end the “blue dot.”\n\n Videos of the appearance circulating online show that many in the crowd booed and said they don’t want to switch to winner-take-all.\n\n “Maybe don’t ask a question if you don’t know the answer,” Walz said.\n\nNebraska Democrats go on offense with Minnesota Gov. Tim Walz’s townhall\n\nBacon responds\n\n Walz said he was proud of Harris winning the 2nd District’s “blue dot.” Nebraska awards some of its Electoral College votes by congressional district.\n\n He said he pushes back on people who say he and Harris failed to win any swing states, because they won a stray electoral vote from Nebraska’s 2nd District.\n\n “We did not,” he said. “We won Omaha. Not by luck. Not by chance. By organizing.”\n\n Walz said people are paying attention to the chaos in Washington.\n\n Veterans services workers being cut matter, he said. Federal grants for cancer research matter, he said. And access to reproductive care matters, too.\n\n He said he believes Bacon, a retired Air Force brigadier general, cares about veterans. But his voting record and fealty to Trump show something else.\n\n “I believe Representative Bacon,” Walz said. “I’m not questioning his character. I’m questioning his judgment and decisions on the job.”\n\n Bacon, in a statement during the Walz rally, called Walz the “most liberal governor in America” and said he didn’t watch or monitor his town hall.\n\n He said recent House GOP town halls where representatives faced vocal opposition reflected political, manufactured anger, not real.\n\n And he criticized Walz for inaccurately describing his own service in the Nebraska and Minnesota National Guard. Bacon invited him to call into his tele-town hall.\n\n Said Bacon: “Whether it’s high taxes, broken borders, abortion … or biological men playing in female sports, Governor Walz is wrong on every major issue.”\n\n Walz, during his speech, said GOP attacks on the handful of trans athletes participating nationally is an attack on every person’s rights, and Democrats need to call out the people peddling it.\n\n Then, he said, they need to get away from social issues and pivot back to the assaults Republicans are making on core governing.\n\n Minnesota First Lady Gwen Walz, wrapping up the event, said the work did not stop because Harris and her husband lost. It got harder, she said, and needs more help.","summary":"OMAHA — Should the Omaha area replace Republican U.S. Rep. Don Bacon with a Democrat and help curb the worst impulses of the Trump administration?\n\n\n\n\tYou betcha, Minnesota Gov. Tim Walz said during the second stop of his national tour criticizing House Republicans for avoiding in-person town halls.\n\n\n\n\tWalz, a Nebraska native, made Bacon a focus of his mid-morning Saturday speech at Metropolitan Community College’s Fort Omaha campus to more than 400 people.\n\n\n\n\tHe said he was “not here to personally attack the representative” or call him names. But he said Bacon needs to face his voters and their questions.\n\n\n\n\t“Do the damn job and answer the questions,” Walz said.\n\n\n\n\tThe former running mate of Vice President Kamala Harris slammed Bacon for following national GOP advice and skipping an in-person town hall this year.\n\n\n\n\tBacon, who has hosted in-person and telephone town halls in the Omaha-based 2nd Congressional District, is hosting a tele-town hall on March 25.\n\n\n\n\tBacon told the Examiner recently that he ","url":"https://www.alternet.org/gutless-republicans/","image":"https://www.alternet.org/media-library/image.jpg?id=57645801&width=1200&height=600&coordinates=0%2C256%2C0%2C256","video":null,"publish_date":"2025-03-15 19:33:26","author":"Aaron Sanderford,Nebraska Examiner","authors":["Aaron Sanderford","Nebraska Examiner"],"language":"en","category":"politics","source_country":"US","sentiment":-0.343},{"id":300574838,"title":"Bill de Blasio argues the 2024 presidential election was 'winnable' for Democrats","text":"Former New York City Mayor Bill de Blasio says the Democratic Party fumbled a \"winnable election\" because they failed to cite former President Joe Biden’s mental decline. \"And instead of us as Democrats wringing our hands and crying, let's just get back on the horse and ride again because we have something to say,\" de Blasio said on \"America's Newsroom\" Thursday. De Blasio explained that Democrats lost an opportunity to address inflation and border issues. He added that Biden and former Vice President Kamala Harris were trying to lower healthcare costs and the price of insulin, a move that could have translated into their campaign messaging. 'ICE' COLD TOM HOMAN CALMLY EATS APPLE IN FACE OF ENRAGED PRO-ILLEGAL IMMIGRATION PROTESTERS \"And those messages just weren't clear. And people had every right to want those answers,\" he said. \"That was good, but it wasn't a full enough answer. So I think what we need to look at this and say, we blew it.\" De Blasio ran for president in the 2020 presidential election when Biden and Harris defeated then-GOP presidential candidate President Donald Trump. Throughout the 2024 presidential race, many media pundits and commentators ran to Biden’s defense when there was speculation about his mental decline, including after Special Counsel Robert Hur's report about him being well-meaning, but forgetful, viral videos of him looking confused, and a Wall Street Journal report about his faltering behind-the-scenes demeanor. ‘SQUAD’ MEMBER RAILS AGAINST ALLEGED TRUMP HEALTHCARE CUTS: ‘WE AIN’T STUPID’ After Biden's poor debate performance against Trump last June, pressure on him to drop out of the White House race grew so strong that he quit weeks later, despite pledging he was staying in the fight. Trump won soundly, securing every swing state and the popular vote. Many Democrats reflected on their loss, highlighting Democratic presidential nominee Harris' inability to connect with working-class voters and address economic woes. CLICK HERE TO GET THE FOX NEWS APP \"Let's just say it out loud: We blew it. People did not feel we understood them and were empathizing enough. That is fixable, by the way,\" de Blasio said. \"Think about those voters. And there are many in this country who voted for Barack Obama twice, Donald Trump, then, then Joe Biden, then Donald Trump again. Those are not voters who couldn't return to the Democratic Party. By definition, those are voters we can win back.\"","summary":"Former New York City Mayor Bill de Blasio said on Thursday that the Democratic Party fumbled a “winnable election&quot; by failing to cite former President Biden’s decline.","url":"https://www.foxnews.com/media/bill-de-blasio-argues-2024-presidential-election-winnable-democrats","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/trump-biden.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-15 19:00:38","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.548},{"id":300557284,"title":"Trump signs executive order targeting 3rd law firm","text":"President Donald Trump signed an executive order on Friday suspending security clearances of Mark Pomerantz and those who work at Paul, Weiss, Rifkind, Wharton & Garrison. The order also restricts government access to lawyers and employees at the New York-based law firm.\n\n\"Today, President Donald J. Trump signed an Executive Order to suspend security clearances held by individuals at Paul, Weiss, Rifkind, Wharton & Garrison LLP (Paul Weiss) pending a review of whether such clearances are consistent with the national interest,\" the White House said in a fact sheet.\n\nPomerantz oversaw the Manhattan District Attorney's Office's investigation into Trump and his business practices.\n\nNotably, the executive order was signed the same day that Trump spoke at the Department of Justice, where he attacked those who prosecuted him.\n\nThe new executive order is the third time Trump has taken action against a law firm. On Wednesday, a federal judge temporarily blocked parts of Trump's executive order targeting Perkins Coie, ruling the order was unconstitutional.\n\nThe language in this executive order mirrors that of the order that targeted Perkins Coie.\n\nJudge Beryl Howell said the actions being taken by the Trump administration targeting these firms are \"terrifying\" to the legal community and noted that the DOJ's arguments in support sent \"chills down my spine.\"\n\nThis firm also has other high-profile Democrats among its ranks, including former Attorney General Loretta Lynch and former Homeland Security Secretary Jey Johnson, and was among the biggest donors to Democrats and former Vice President Kamala Harris during the 2024 election.\n\n\"The executive order is focused on the activities of Mark Pomerantz, who retired from the firm in 2012 and went on to work at the District Attorney’s office nearly a decade later,\" Paul Weiss said in a statement to ABC News. \"Mr. Pomerantz has not been affiliated with the firm for years. The terms of a similar order were enjoined as unconstitutional earlier this week by a federal district court judge.\n\nABC News' Alexander Mallin and Katherine Faulders contributed to this report.","summary":"President Donald Trump signed an executive order suspending security clearances of Mark Pomerantz and those who work at Paul, Weiss, Rifkind, Wharton & Garrison.","url":"https://abcnews.go.com/Politics/trump-targets-law-firm-paul-weiss-restricting-government/story?id=119828394","image":"https://i.abcnewsfe.com/a/a8c2d022-5bc0-4426-9beb-f9cc6155e7b4/donald-trump-12-gty-gmh-250313_1741885583614_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-03-15 18:42:01","author":"Kelsey Walsh","authors":["Kelsey Walsh"],"language":"en","category":"politics","source_country":"US","sentiment":-0.153},{"id":300554694,"title":"President Trump hit in the face during interview - watch video","text":"President Donald Trump was hit in the face by a boom mic on Friday leaving the President raising his eyebrows in disbelief.\n\nThe blunder occurred as the 78-year-old was speaking with reporters at Joint Base Andrews military facility in Maryland.\n\nAs the press gathered around the President, one reporter began asking him a question about Gaza when the boom mic wobbled and hit him in the mouth. Watch the vdeo here:\n\nTrump reared back in surprise and raised his eyebrows as he looked at someone off-camera.I’m so sorry,\" the woman can be heard saying, before Trump looks at someone to his right and responds: \"She just made television tonight.\"\n\n\"She just became a big story tonight, right?” the politician added.\n\nThe mic was at the end of a long pole and a picture from a different angle appeared to show the reporter balancing the pole from the other end.\n\nTrump was sworn in as the 47th President in January 2025 and was joined by his wife Melania Trump, and his children, Barron, Ivanka, Donald Jr., Tiffany, and Eric as he took the oath of office in the U.S. Rotunda of the Capitol. \n\nFormer Presidents Joe Biden, Barack Obama, George W. Bush, and Bill Clinton were in attendance as was Hillary Clinton and Kamala Harris. Sitting front row alongside Trump's family were billionaire tech giants Mark Zuckerberg, Lauren Sanchez, Jeff Bezos, Sundar Pichai and Elon Musk.\n\nHis election win came after two attempts on his life: On July 13 at a rally, multiple shots could be heard and Trump was seen grabbing his ear in confusion before ducking down as Secret Service rushed the stage. \n\nBlood could be seen across his right ear and streaked across his face as the Secret Service rushed him into a car. \n\nButler County District Attorney Richard Goldinger confirmed that two people were dead after the incident, including the shooter, and another was left in \"critical condition\".\n\nTrump was \"fine\" after being \"checked out at a local medical facility\". \n\nMonths later in September multiple \"gunshots\" were fired in the vicinity of the former President when he was golfing at the Trump National Golf Club in West Palm Beach, Florida.\n\nHowever, per a statement from the Trump Campaign's Communications Director Steven Cheung, Trump was safe: \"President Trump is safe following gunshots in his vicinity. No further details at this time.\"","summary":"President Donald Trump was hit in the face by a mic on Friday leaving the President raising his eyebrows in disbelief.","url":"https://www.hellomagazine.com/celebrities/820312/president-trump-hit-in-face-interview-watch-video/","image":"https://images.hellomagazine.com/horizon/landscape/695d35de1296-gettyimages-2204580301.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-03-15 18:30:55","author":"Rebecca Lewis","authors":["Rebecca Lewis"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.444},{"id":300553252,"title":"Why has checking facts become fuel for the culture wars?","text":"Fact checking has been described as cleaning up a sewage spill with a teaspoon. What happens to truth when someone takes the teaspoon away?\n\nWhen Donald Trump fronted his first debate of the US presidential campaign against then-Vice President Kamala Harris, back in September last year, he made what has become a notorious accusation: migrants in a small Ohio town were eating the local pets.\n\n\"A lot of towns don't want to talk about it because they're so embarrassed by it,\" then presidential candidate Trump said. \"In Springfield, they're eating the dogs. The people that came in, they're eating the cats. They're eating — they're eating the pets of the people that live there.\"\n\nThis assertion by now-President Trump, that Haitian immigrants were abducting and eating their neighbour's dogs and cats, was rapidly fact-checked by multiple news outlets and eventually awarded \"Lie of the Year\" for 2024 by PolitiFact, an organisation that ushered in a new era of fact-check journalism when it launched in 2007.\n\nFrom Time magazine's pioneering research department in the 1920s to the New Yorker's renowned and rigorous fact-checking department, verifying facts is as old as journalism itself. The rise of the 24-hour news cycle, ubiquity of social media and subsequent spread of online misinformation and disinformation have since demanded more from journalists and editors. It has forced newsrooms to improve their internal verification processes but has also led to the proliferation of specialised fact-check outfits like AAP FactCheck in Australia or AFP Fact Check, which now has a network of 150 journalists across 26 languages publishing checks on everything from Russia's invasion of Ukraine to COVID-19.\n\nAmong the thousands of fact-checks published in the past year fact-checkers in Australia and abroad have debunked a wealth of manipulated footage in the Israel-Gaza conflict, found Labor misrepresented the Coalition's stance on free GP visits, concluded Opposition Leader Peter Dutton was wrong on tourist visas, discredited the claim Kamala Harris wanted to take away Americans ability to \"eat red meat\" and investigated whether planes are actually crashing more often (they're not).\n\nThe era of 'fake news'\n\nThe political ascendancy of Trump heralded a golden era for fact-checkers. Throughout, Mark Zuckerberg's social media giant Meta played a significant role in the fact-checking industry.\n\nIn 2016, soon after Trump's first election to the US presidency, Meta launched its program paying independent fact-checkers to flag and debunk disinformation on its products, mobilising a global battalion of people fighting falsehood's on the world's most popular platforms.\n\nIt wasn't just Meta's partners who expanded their fact-check operations during this period but legacy media outlets. During the first Trump presidency The Washington Post's fact-checkers declared he had made 30,573 false or misleading claims. By 2017 \"fake news\" was named the word of the year. In August last year the then-presidential candidate almost backed out of an interview once it became clear he would be fact-checked live and then in October cancelled an interview with American 60 Minutes after his campaign complained the program would fact-check the interview.\n\nBetween 2014 and 2021 the number of international third-party fact-checkers grew tenfold but after eight years of continued growth, research from the Reporters' Lab, a centre for journalism research at Duke University, found that the number of active fact-checking projects across 111 countries dropped for the first time in 2023 and then again in 2024.\n\nThen, in the wake of Trump's recent election win, fact-checkers were dealt another blow. Meta, which owns Facebook, Instagram and Threads, promptly scrapped the teams of professional and third party fact-checkers in the United States.\n\n\"It's time to get back to our roots around free expression,\" Meta founder and CEO Zuckerberg declared in January.\n\nAnd with that fact-checkers were replaced with a crowdsourced \"community notes\" system similar to that on Elon Musk's X. Instead of using accredited fact-checkers to debunk and flag misleading or inaccurate content that should be marked with a warning label, this model relies on other social media users to add context or caveats to a post.\n\nRight now, the roll-back applies only to the US but Meta funds more than 100 fact-checking organisations across the world and has not ruled out further partnership terminations. \n\nThe social media giant's most recent report, via Australia's code of practice on misinformation and disinformation, found that in the 2023 calendar year it took action on more than 9,700 pieces of content for violating misinformation policies. Warnings were displayed on more than 9.2 million distinct pieces of content on Facebook based on articles raising concern that were written by its third-party fact-checking partners in Australia at the time: AAP FactCheck, Agence France-Presse and RMIT FactLab.\n\nZuckerberg has promoted the about face as a win for \"free expression\".\n\n\"Governments and legacy media have pushed to censor more and more but now we have the opportunity to restore free expression, and I'm excited to take it,\" Zuckerberg, who once proudly told US congress Meta's fact-checking program was \"industry leading\", said.\n\nMeta's decision was criticised as 'spineless and opportunistic', condemned as a move that will disproportionately harm marginalised communities and described as a change that would encourage the \"exact same surge of hate, disinformation and conspiracy theories that caused January 6\". Critics of the move have said it was made in an effort to curry favour with the incoming US president, who has been routinely fact-checked by multiple third-party outfits and publications.\n\nAsked directly if Zuckerberg's decision was a response to threats Trump had made to him in the past (he once threatened to jail the Meta CEO), the president responded: \"Probably. Yeah. Probably.\"\n\nThe growing politicisation of fact-checkers\n\nIn November Brendan Carr, picked by Trump to head the Federal Communications Commission, sent an email to the CEOs of Meta, Apple, Alphabet (Google's holding company) and Microsoft. He accused them of participating in a \"censorship cartel\" and singled out fact-checking. \n\nThis suspicion of fact-checking is not only shared by members of Trump's administration but by his voter base. A 2019 study found seven in 10 Republicans say fact-checkers tend to favour one side, compared with roughly three in 10 Democrats. In the lead up to the US election those on the left of politics criticised CNN for declining to fact-check Trump in real time during his debate with Joe Biden while those on the right criticised (the American) ABC News moderators for fact-checking that network's debate.\n\nIn the wake of Meta's decision, 130 fact-check organisations wrote an open letter to Zuckerberg reiterating the \"strict non-partisanship standards\" Meta's partners had to attain through verification by the International Fact-Checking Network, which requires annual verification, including independent assessment and peer review. They disputed the tech billionaire's accusations of censorship as Meta never granted fact-checkers the ability or authority to take down content or remove accounts.\n\nThe head of the network, Angie Drobnic Holan, said at the time that Meta's move was made \"in the wake of extreme political pressure from a new administration and its supporters\".\n\nHolan is a former editor-in-chief of PolitiFact — one of the first dedicated fact-checking groups — and was part of the Pulitzer Prize-winning team of journalists who examined claims made by politicians during the 2008 US presidential campaign. She says there has been growing political pressure on fact-checkers, particularly over the past 15 years.\n\n\"The most disturbing trend is that activists, political parties and elected officials have tried to discredit fact-checking as an activity in and of itself because it doesn't align with their preferred narratives,\" she tells the ABC.\n\n\"This includes direct attacks alleging bias or political motives, attempts to discredit fact-checkers as incompetent or as censors and overarching efforts to undermine public trust in independent journalism and verification.\"\n\nWhat's happening in Australia?\n\nFact-check journalists and misinformation experts in Australia have testified that their work feels increasingly politicised while one of three third-party fact-checking outfits here has shut up shop. RMIT FactLab recently confirmed it has ended its third-party fact checking work. In June last year the ABC ended its separate and seven-year collaboration with the university called the RMIT ABC Fact Check unit. AAP FactCheck recently confirmed it will continue to provide checks for Meta for at least another 12 months while international news wire AFP told the ABC the outlet was also committed to the program for this year in Australia. \n\n\"Fact-checkers in Australia and elsewhere have unwillingly become part of the culture wars and a target for people who want to make the claim that free speech is being quashed,\" William Summers, former chief fact-check journalist for AAP FactCheck, says.\n\nDuring the Voice to Parliament referendum campaign RMIT FactLab drew criticism from Sky News Australia, Liberal senator James Paterson and conservative think tank the Institute of Public Affairs during the Voice to Parliament.\n\nAndrea Carson, La Trobe University's professor of political communication, says in 2022 her team did survey experiments on trust in fact-checkers in Australia and found there were \"high levels of trust in Australia for fact-checking\" and, at that time, \"very little difference between the brands\".\n\n\"Fact-checking tends to be more highly regarded by those on the left side of politics than the right in the US and we are seeing some of that politicisation and polarisation of fact-checkers starting to happen in Australia but it became most prominent during the Voice to Parliament referendum,\" Carson tells the ABC.\n\n\"We did another study during the Voice to Parliament referendum, also on fact-checking and asking about trust. We saw a noticeable dive for RMIT FactLab and that came off the back of that concerted campaign against RMIT FactLab. We saw trust had fallen for that brand for those on the right side of politics and particularly those who were consumers of Sky News.\"\n\nCarson stressed that while Australia was experiencing \"elements of politicisation\" when it comes to fact-checking there was still a high level of trust, and it was \"nowhere near the extreme of what is going on in the US\".\n\n\"Also, when trust does fall like it did during that concerted campaign for that particular brand, we don't know how long that lasts unless we go back and study it,\" she says.\n\nThe Conversation conducted research with global media monitoring company Meltwater and found of the most popular posts in Australia about the Voice in a three-month period leading up to the referendum, an article by Sky News Australia accusing RMIT FactLab of working with Meta to \"censor\" the Voice debate came in second.\n\nConcerns about fact-checkers have been raised in Australia's parliament by politicians over the past few years. \n\nGerard Rennick, in 2023 questioned bureaucrats bureaucrats from the Australian Communications and Media Authority about \"who gets to fact check the fact-checkers\" and grilled the ABC chair on a fact-check involving a vaccine death. Malcolm Roberts said all three of Australia’s third-party fact-checking organisations exercised \"consistent bias\" and late last year Matt Canavan accused AAP FactCheck of “effectively silencing political arguments” during the Voice debate.\n\nMeanwhile fact-checkers and misinformation academics have raised their own concerns about the increasing politicisation of their work.\n\n\"During the Voice referendum there was so much misinformation and disinformation being pushed around but because it was a politicised debate, fact-checkers were being accused of bias,\" Summers remembers.\n\nHe says not only did no one in the team embark on a fact-check to make a political point, \"the opposite happened to a certain extent\". He says fact-checkers struggled to find more false claims from the Yes campaign \"because there were so many false claims from the no side it dominated the debate\".\n\nThese false claims included that ticks in the No box would be counted as a Yes; Pauline Hansons's assertion that politicians would have to consult the Voice about private members' bills; former boxing champ Anthony Mundine’s claim that Indigenous people would become British subjects if the Yes vote won at the referendum and and Dutton’s claim that the prime minister had never mentioned the Voice before the election.\n\nA cyber security report by global intelligence research organisation Recorded Future revealed concerted efforts by far-right groups and an army of bots to spread false information undermining the Voice to Parliament. A few months before the vote Meta shut down 9,000 Facebook and Instagram accounts run by a group linked to Chinese authorities that, among other things, had been spreading misinformation on the Voice.\n\nSummers believes most people are unaware that some foreign countries are \"pushing to pollute Australia's information space\". \n\nHe described a fact-check he did last year for AAP in which he looked into posters, claimed to have been created by Amnesty International, protesting Israel's participation in the 2024 Olympics and found in fact Iran's state media had published the computer-generated images of Israeli athletes brutalising Palestinians.\n\n\"A lot of this misinformation and disinformation is not just naively shared, some of it is very intentionally shared by people who don't have Australia's interests at heart,\" he says.\n\nThe removal of fact-checks comes as Meta revamps a program that rewards creators with bonuses based on views and engagement. A former Meta data scientist has warned this could create a welcome environment for those spreading \"viral hoaxes for profit\".\n\nThere were usually two reasons people spread falsehoods, Summers says: for ideological gain or for financial gain.\n\n\"Most social media platforms now pay out for viral content either directly when you get over a certain number of views or indirectly because you are building your own platform and one easy way to do that is to produce content which is surprising but a lot of surprising content either misses context or is just completely untrue,\" he says.\n\n\"We are more likely to share the surprising unverified content over verified facts and uncertainty.\"\n\nIs there a role for fact-checking in 2025?\n\nCarson argues that fact-checking was good at identifying misinformation in the first instance but is not a \"standalone solution\" and has its limits.\n\n\"It is a fairly consistent finding that you can't really use fact-checking to move viewpoints of a political nature, and we found that in our own research,\" she says.\n\n\"When people have a set idea about something and it is fact-checked, it doesn't move their opinion of it because they have motivated reasoning, which is usually politically motivated, for staying with that particular idea.\"\n\nOne of Carson's studies found that even though people trusted a fact-check and \"accepted it had done its job\", it didn't always stop them spreading the political misinformation.\n\n\"A third of our respondents just went ahead and spread it anyway both on the left and the right of politics and they gave different rationales for that,\" she says.\n\nThe study used a video of Scott Morrison that had been falsely labelled to say the former prime minister had blamed flood victims for \"weaponising their trauma\" against the government.\n\n\"What we found is that people on the left would share that, even though they knew it had been fact-checked and they did so because some of them didn't like Scott Morrison,\" Carson says. \n\nShe says they justified their actions because they believed it was the kind of thing that Morrison would say even if he didn't say it in this instance.\n\n\"Those on the right shared it to highlight the kind of things they thought people on the left would spread and to call it out,\" she says.\n\nHolan is clear on what the process does — \"provides people with reliable information\" — and doesn't do.\n\n\"It doesn't promote political agendas, win or lose elections, or convince people to change their political values or beliefs,\" she says.\n\n\"When people disagree, it's not necessarily because they have the wrong facts. Sometimes they need to persuade each other and find compromises. That's a political process that goes beyond fact-checking, but facts can help people make a good start on more honest dialogues.\"\n\nHolan says the priority for fact-checkers in 2025 was to do work that \"preserves reality and resists false narratives\".\n\n\"Fact-checkers need to do the day-to-day work that helps the public understand that facts and evidence do matter, and that reality will eventually assert itself over lies,\" she says.\n\nThe impact of community notes has been mixed.\n\nAs ABC News has reported, a study by University of California researchers published by the American Medical Association found community notes provided entirely accurate information about COVID-19 vaccines 97.5 per cent of the time. Another study found community notes increased the probability that the author deletes the original post by 80 per cent. \n\nIronically, an analysis of almost 1.2 million notes written in 2024 and released earlier this year found users frequently relied on fact-checking organisations when proposing community notes. \n\nHowever, a study from academics in Luxembourg, Melbourne and Germany published late last year found no evidence that the introduction of community notes on X/Twitter significantly reduced engagement with misleading posts on the platform. The authors concluded the system might be \"too slow to effectively reduce engagement with misinformation in the early (and most viral) stage of diffusion\".\n\nCarson says there needs to be more peer-reviewed research on how effective the community notes model is.\n\n\"The benefits of third-party fact-checking was that it was professionals that usually have training in journalism and it had a degree of accountability because the fact-checkers, at least those used by Meta, were registered with the International Fact-Checking Network and had a set of principles that emphasises political neutrality,\" she says.\n\nWhat does the future of fact-checking look like?\n\nSummers describes fact-checking as trying to clean up a sewage spill using a teaspoon.\n\n\"And for every teaspoon of information you pull out and fact-check someone is pouring a full tanker back into the ocean,\" he says.\n\n\"Fact-checkers in Australia and elsewhere have all been making significant moves to address some of the more structural issues around educating where misinformation comes from, who is responsible for it and increasing awareness of AI-generated content, and trying to improve awareness of what a good quality study is compared to a poor study written by someone with skin in the game.\"\n\nSummers says the Meta decision marks a victory in the war against fact-checking but the legacy of fact-checkers will live on in newsrooms as it is now \"ingrained\" in so much of what journalists do every day.\n\n\"Instead of fact-checking teams I think the concept of writing articles with the purpose of checking facts is much more central to what news organisations do now,\" he says.\n\nSummers is also glad to see publications that both deliver stories exposing falsehoods and also \"tell people how to spot misinformation or an AI-generated image\", noting the work of teams like BBC Verify and ABC News Verify.\n\nCarson would also like to see even more in-house fact-checking by journalists and more \"active adjudication\".\n\n\"When a false claim is made by a politician instead of 'he said, she said' coverage and giving equal weight to a known false claim, active adjudication is when the journalist calls it out there and then and gives the reason for it rather than giving false balance,\" she says.\n\nFact-checking offers an important opportunity to communicate verified and credible information which is important for decision making. This is particularly so when it comes to political choices, Carson says. \n\n\"Political choices underpin a healthy democracy and help people make considered informed choices, then they decide who is going to represent them at the ballot box,\" she says.\n\nHolan says Meta's actions are in response to the politics of the day in the United States \"rather than an authentic indictment of fact-checkers' work\". She believes the decision is a \"temporary victory\" for those who want to see fact-checking become extinct.\n\n\"Surveys show that the public wants to have online information moderated and that they don't have a lot of patience for navigating through torrents of false news,\" she says.\n\nShe says social media companies that aren't run simply as political projects, like X, will continue to grapple with the need to provide positive user experiences. That includes cultivating reliable information.\n\n\"Fact-checkers were here before the Meta program, and they'll be here even if the Meta program goes away.\"\n\nWords: Gina Rushton\n\nProduction: Catherine Taylor\n\nImages: Lindsay Dunbar","summary":"Checking facts is as old as journalism and Donald Trump's political rise has underscored its value. So why have media organisations like Meta changed tack?\n ","url":"https://www.abc.net.au/news/2025-03-16/fact-checking-partisan-media-meta-trump-politics/105046680","image":"https://live-production.wcms.abc-cdn.net.au/4881752719546bc1675ffa11a7886d8c?impolicy=wcms_crop_resize&cropH=1688&cropW=3000&xPos=0&yPos=229&width=862&height=485","video":null,"publish_date":"2025-03-15 18:00:00","author":"Gina Rushton","authors":["Gina Rushton"],"language":"en","source_country":"AU","sentiment":-0.122},{"id":300548158,"title":"The Fault Line in Democratic Politics","text":"After Kamala Harris’s loss last year, professional Democrats with moderate politics prepared for their favorite quadrennial sport: recrimination. They wanted to “take back” the party from the self-imagined villains they oppose. They wrote manifestos and donor memos and positioned themselves against “the groups.” Just a couple weeks ago, they organized a retreat where they condemned “ideological purity tests” as their path to a brighter future.\n\nI’m struck by how irrelevant that all sounds, less than two months into Donald Trump’s second term. It feels like these people are arguing about proper salad fork etiquette while their house is on fire. There’s a much more elemental question animating Democratic politics at the moment, if you bother to listen to people who still call themselves Democrats (or even independents): is the party in opposition to Donald Trump going to oppose anything?\n\nWe saw this week what in retrospect was a predictable answer to that question. House Democrats, who face voters every two years, who must pay attention to the public mood, saw the government funding deadline as an early and important moment of defiance against the ransacking of America. They didn’t come to it on the basis of being progressive or moderate, in a safe seat or a swing district. They listened to their voters, who were looking for some sign of life among Democrats, or a plan to staunch the bleeding of an economic and moral collapse.\n\nBut Trump is also a great uniter of his own side, and he was able to pull the Freedom Caucus in on a spending bill for the first time in ages by promising he would continue to impound and delete programs regardless of what the bill said. Happy to outsource the carnage and the responsibility, all Republicans went with it. So it fell to the Senate, where Democratic votes would be needed on the bill for it to pass.\n\nSenate Democrats don’t face voters every two years. They have the luxury of overthinking themselves into oblivion, inventing scenarios to avoid confrontation that they can reverse-engineer into seeming wise. That’s what Chuck Schumer did, retreating from the fight and advancing a bill he called abhorrent to avoid a government shutdown, as if we’re not experiencing that already.\n\nProgressive Caucus chair Greg Casar (D-TX) may have summed it up best: “Today the biggest split among Democrats is between those who want to stand and fight and those who want to play dead.” There’s a Fearless Caucus and a Fear Caucus, a caucus who understands the risk of failure and wants to try to win anyway, and a caucus consumed by failure, straitjacketed by risk, who cowers and bows and shrinks from conflict.\n\nThat’s a split inside Washington. It’s not a close question in the rest of the country. There, the stand and fight faction is dominant, seen in the boiling anger at town hall meetings that caused Republicans to stop holding them. Gov. Tim Walz, who stood in for one of those Republicans at a swing district in Eau Claire, Wisconsin yesterday, went viral for some red meat mocking an “unelected South African nepo baby.” But what he said right before that made the critical point: “There’s a responsibility in this time of chaos where elected officials need to hear what people are irritated about. And I would argue that Democratic officials should hear the primal scream that’s coming from America, (which) is, ‘Do something, dammit! This is wrong!’”\n\nWalz was part of the losing ticket last November, and has the perspective of meeting people from across the country and gauging the national mood. His main takeaway was that the campaign was too cautious, too buttoned-down, too unwilling to take risks. That’s the correct lesson, because it has migrated from a tactical failing to a defining feature of the Democratic Party.\n\nI certainly have views about what policies would bring about shared prosperity in America, and I believe that most of them would prove out as good politics. But I also agree that the Democrats’ major problem, before the election and certainly today, is that they are perceived as weak. Anything that perpetuates that image is poisonous for the party.\n\nThere is white-hot anger across the country right now, and responding to that with cowardice will end your political career. Maybe not today; a theoretical primary challenge for Schumer is three years away, when he would be 77. But his lack of leadership has been exposed. Democrats want a different party, one with a pulse, and eventually they will get it.\n\nThe politicians who understand this are not neatly grouped ideologically or generationally. Bernie Sanders, still out there giving speeches to thousands at age 83, is in the Fearless caucus; on this issue, so was Nancy Pelosi. AOC has led the charge, but this was among the most eloquent statements I’ve seen this week:\n\n“Last night, House Democrats stood united against a bill that would let President Trump and Elon Musk shut down whatever part of the government they want, whenever they want. Now all eyes are on the Senate, the only institution in government where Democrats have true leverage thanks to the filibuster. Leader Schumer and Senate Democrats must use that leverage to fight for Americans facing higher costs, bigger deficits, and an intentional recession. They must use their leverage to bring Republicans to the negotiating table on President Trump’s unconstitutional funding cuts that violate the separation of powers.\n\n“Congress is a co-equal branch of government, and we should take this opportunity to remind President Trump that he is not all-powerful. It’s time to stand up for our country and for Congress’s role as a check and balance on an overzealous President. If not now, when? If not us, then who?”\n\nThat’s from Rep. Scott Peters (D-CA), former vice chair of the New Democrat Coalition and a member of the Problem Solvers Caucus.\n\nFederal employees, who would be at risk of furlough or even termination in a shutdown, are in the Fearless Caucus. The lawyers and state attorneys general taking the Trump administration to court are in the Fearless Caucus. The ordinary people taking time out of their day to picket in front of a Tesla showroom or yell at their representative in Congress are in the Fearless Caucus. Even those who are pissed off by a weakening economy are in the Fearless Caucus, suggesting that the caucus is a majority of the country.\n\nWhen there’s this big a disconnect between a party’s leadership and the voters, it cannot last.","summary":"For the moment, it is not ideological; it’s about whether you’re willing to take a risk.","url":"https://prospect.org/politics/2025-03-15-fault-line-democratic-politics-schumer-AOC-fight/","image":"https://prospect.org/downloads/22608/download/AP25073817539804rs.jpg?cb=b405a75f79192688174dae8e32b1e47e&w=4000","video":null,"publish_date":"2025-03-15 16:40:00","author":"David Dayen","authors":["David Dayen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.175},{"id":300710632,"title":"‘Bunch Of Losers’: Dems’ Emerging 2028 Field May Not Bode Well For Liberals","text":"Political strategists are not yet sold that Democrats rumored to be prospective 2028 presidential candidates have all that it takes to unite the party and retake the White House.\n\nFailed 2024 candidates Kamala Harris and Tim Walz, former Obama White House Chief of Staff Rahm Emmanuel, former Transportation Secretary Pete Buttigieg and a handful of Democrat governors — Gavin Newsom of California, Josh Shapiro of Pennsylvania, Andy Beshear of Kentucky and Wes Moore of Maryland — are all thought to be potentially sizing up runs for the White House in 2028 as Democrats try to fight their way out of the political wilderness. Even though there is still plenty of road to go before the campaign kicks off, the prospective candidates could find it quite difficult to unite the party and appeal to enough of America to win back the presidency, pundits told the Daily Caller News Foundation.\n\n“We are in what has been referred to as the ‘invisible primary’ phase of the election cycle, because it is so early and the public isn’t paying attention to these early machinations,” Len Foxwell, a Maryland-based Democratic strategist, told the DCNF. “The only ones who are participating in the process at this point are the prospective candidates themselves and a relatively small and insular ecosystem of donors and party activists and elected officials who do this sort of thing, either as a passion or as a profession. It’s a very small and limited process right now, but it’s definitely happening.” (RELATED: Tim Walz Appears To Snipe At Any Kamala Harris 2028 Ambitions)\n\nRecent polling generally indicates that Democrat voters are by far most eager to see Harris reprise her role as the party’s standard-bearer, followed distantly by Buttigieg and Newsom while the rest of the field draws lower levels of support, according to Newsweek. While most Democratic politicos may not be quick to highlight flaws or challenges that could inhibit each candidate, Adolph Mongo, a Michigan-based Democratic commentator and consultant, did not pull any punches.\n\n“A bunch of losers,” Mongo told the DCNF in regard to many of the hot names being mentioned in connection to possible 2028 runs. “I’m looking for someone who’s gonna be more realistic, and who’s going to be able to not only dish it out, but be able to take it. The Democrats, they ran a spineless 2024 campaign, they let Republicans create the narrative, and they never responded to it.”\n\n“Harris made the biggest boo-boo, with the pick from Minnesota, good, nice guy, a good governor. But they needed somebody that’s going to be a bulldog that can attract new voters,” Mongo said, referencing Walz. “You know, they just dropped the ball on several issues, one on immigration, two on transgender rights. Three, they took their base for granted, black voters, Hispanic voters, they just did everything wrong. And the biggest boo-boo was they knew that the president, two or three years ago, should have just been a one term guy, and they didn’t do anything and waited too late … they might as well have just left him in.”\n\nBeshear, who was reportedly vetted alongside Whitmer and others as a possible addition to the 2024 Democrat ticket after former President Joe Biden’s candidacy imploded, sniped at Newsom Thursday for having right-wing populist firebreather Steve Bannon on his new program in comments that found their way into reports from liberal media outlets.\n\nWalz, another governor with a left-wing record in his state, is also seemingly feeling out the waters for a run of his own by embarking upon a national town hall tour focusing on vulnerable House Republican districts. Notably, Walz’s first stop will be in Iowa, which happens to be one of the most important primary battleground states. (RELATED: Harris ‘Loved’ Walz’s Record Despite ‘Abject Failure’ On 2020 Riots, Stringent Covid Policies And More)\n\nFoxwell said he believes each of the names floating around as possible contenders would have a path to victory, and that some Democrats — including Newsom — are reorienting themselves on issues like protecting women’s sports and tacking away from hardline positions to potentially broaden their appeal. However, the primary field figures to be “all over the map” given the general state of disarray the party is currently in, Foxwell added.\n\n“Gavin Newsom, for instance, is kind of bucking the the prevalent body of opinion within the Democratic Party establishment on the issue of transgender women playing women’s sports, for instance, and Senator John Fetterman of Pennsylvania is emphasizing cooperation and collaboration on a strategic basis with the White House, so you’re seeing some of that,” Foxwell told the DCNF. “But I don’t think there’s going to be a singular approach within this primary field, because I don’t think there’s a singular approach in the Democratic Party for how we move forward. I think that we, as a party, are still all over the map on what happened in 2024 and how we should position ourselves at the approach of 2028. I think you’re going to see that uncertainty and lack of cohesiveness of opinion in the presidential primary fields.”\n\nNewsom recently launched a podcast program in which he frequently hosts right-of-center guests to discuss life and politics, making waves in an early March episode with Turning Point USA co-founder Charlie Kirk in which Newsom said that allowing biological men to compete in women’s sports — something that most elected Democrats support and defend vigorously — is indeed “deeply unfair.” It remains to be seen whether Newsom’s viral comments about that unfairness will stick with the voting public given that Newsom’s record as California governor is loaded with radical policies on transgender issues, as well as left-wing positions on energy, public health care and more.\n\nMoore could emerge as one candidate to watch to fill the party’s “aspirational lane,” typified by former President Barack Obama’s 2008 run, according to Foxwell, who shared his view that Emmanuel is too closely-linked to an era of American politics that has come and gone. And while Newsom seems to be triangulating to best position himself for 2028, Foxwell personally thinks Newsom would be a bad pick for Democrats because the California governor “embodies every worst negative stereotype of the modern Democratic Party” and “represents the privileged and affluent coastal elite who have virtually no connective tissue to working-class men and women in the battleground states who ultimately determine the outcome of presidential elections.”\n\nButtigieg, for his part, recently opted against running for governor or senate in Michigan in the 2026 cycle, fueling speculation that he is sizing up 2028 after he came up well short in the 2020 Democrat primaries. However, Buttigieg’s highest level of public service was as a member of the highly-unpopular Biden administration, and veteran political journalist Mark Halperin speculated Thursday that Buttigieg’s short stature and sexual orientation may hurt him with voters. (RELATED: Democratic Committees Set To Launch Town Hall Tour Of Republican Districts After Party’s Brutal 2024 Losses)\n\nJon McHenry, vice president of North Star Opinion Research and a GOP polling analyst, said there’s one participant in the “invisible primary” that currently stands out to him as most capable of taking down a Republican in a general election.\n\n“I think Josh Shapiro is the Democrat most likely to beat a Republican in 2028,” McHenry told the DCNF. “The way he’s governed in Pennsylvania, which maybe wouldn’t win him a nomination on the Republican side, has still been pretty effective. He just seems like he has an ear for essentially the middle of the state of Pennsylvania, which is also essentially an ear for the middle of the country, in a way that a lot of Democrats don’t seem to have. You know, Tim Walz is the perfect example. He’s from Minnesota, he looks like your football coach, and he’s just as completely out of touch as you can be, whereas Josh Shapiro actually seems like he gets it.”\n\nThe issue for Shapiro, as McHenry sees it, could be that the very things that would make him a potentially formidable general election opponent may not appeal to Democrat primary voters.\n\n“You can imagine two, three years down the road in early polling, him against J.D. Vance, or whomever Republicans nominate. I think he’s going to be super competitive, but I don’t know that he’s going to be that competitive in a Democratic primary,” McHenry told the DCNF. “In a sense, some of the folks who’ve already run for federal office have an advantage in running to the primary, because they’ve already tacked fairly hard to the left to win that primary, and it’s just a different consideration. If you’re a successful governor, you probably aren’t like the crazy left-wing, pro-Hamas crowd on the Democrat side, and frankly, a lot of the successful governors on the Republican side aren’t like the MAGA folks.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Bunch Of Losers': Dems' Emerging 2028 Field May Not Bode Well For Liberals","url":"https://dailycaller.com/2025/03/15/democrats-emerging-2028-presidential-field-strategists/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/03/GettyImages-2159615518-1-1-scaled-e1741983475554.jpg","video":null,"publish_date":"2025-03-15 16:36:10","author":"Nick Pope","authors":["Nick Pope"],"language":"en","source_country":"us","sentiment":-0.547},{"id":300614424,"title":"'Powerful motivator': Sociologist explains ways 'fear-based messaging' keeps GOP in power","text":"Republican Donald Trump's narrow victory over Democrat Kamala Harris in the United States' 2024 presidential election was far from the \"historic landslide\" that Trump and many of his allies claim it was. Trump, according to the Cook Political Report, defeated Harris by roughly 1.5 percent in the popular vote — which is a close election, not a double-digit landslide by President Ronald Reagan in 1984 or President Franklin Delano Roosevelt in 1932.\n\nNonetheless, the 2024 election results — including the fact that Trump carried key Rust Belt states like Pennsylvania, Wisconsin and Michigan — remain a major source of frustration for Democrats. And for Democratic strategists, a nagging question is: Why do Democrats keep losing races they think they should be winning?\n\nREAD MORE:'Down nearly 40 percent': Musk’s far-right MAGA politics are sinking Tesla\n\nSociologist/author Jessica Calarco addresses that question in an interview with journalist Paul Rosenberg published by Salon on March 15.\n\nRepublicans, Calarco stressed, can be very effective with messaging, while Democrats often drop the ball when it comes to getting their message out.\n\nCalarco told Salon, \"Democrats and people on the left often have very little leeway. You might be able to get one thing through. A lot of political capital has to be spent to pass anything, so there's disagreement about which problems to prioritize first. Do we focus on universal basic income or do we focus on child care? On raising the minimum wage or on health care?\"\n\n The sociologist/author continued, \"I would argue that any one of these in isolation, especially given what we know about the structural roots of social problems, is often not enough on its own to really make a difference…. If we really want to address the biggest challenges that we face as a society, we need not only a single structural solution, but layers of structural solutions.\"\n\nREAD MORE: 'Little to no decision making': Here's who's actually running DOGE\n\nDemocrats, according to Calarco, \"can do a much better job of helping to articulate ways that governments can help people.\"\n\nDuring the interview, Calarco noted that Republicans are great at scaring Americans into voting for them.\n\n\"There is a long history of conservative fear-mongering,\" the sociologist/author told Salon. \"Fear is an incredibly powerful motivator. It is one of the best ways to spark people to action and also one of the best ways to push people to inaction if you don't want them to operate. You have to give them something to fear, and something to do about what they fear, which is sometimes to do nothing.\"\n\nCalarco added, \"Fear-based messaging is incredibly effective, and once you start to see a fear, it becomes very easy to see fear in more places.\"\n\nREAD MORE: 'Sounds like Putin': Trump blasted for declaring top news organizations 'illegal","summary":"Republican Donald Trump's narrow victory over Democrat Kamala Harris in the United States' 2024 presidential election was far from the \"historic landslide\" that Trump and many of his allies claim it was. Trump, according to the Cook Political Report, defeated Harris by roughly 1.5 percent in the popular vote — which is a close election, not a double-digit landslide by President Ronald Reagan in 1984 or President Franklin Delano Roosevelt in 1932.\n\nNonetheless, the 2024 election results — including the fact that Trump carried key Rust Belt states like Pennsylvania, Wisconsin and Michigan — remain a major source of frustration for Democrats. And for Democratic strategists, a nagging question is: Why do Democrats keep losing races they think they should be winning?\n\nREAD MORE: 'Down nearly 40 percent': Musk’s far-right MAGA politics are sinking Tesla\n\nSociologist/author Jessica Calarco addresses that question in an interview with journalist Paul Rosenberg published by Salon on March 15.\n\nRepublicans, Calarco str","url":"https://www.alternet.org/salon-gop-calarco-interview/","image":"https://www.alternet.org/media-library/image.jpg?id=57606452&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-03-15 15:50:46","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":0.152},{"id":300512562,"title":"This group of Trump voters will piss you off—and give you hope","text":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\nAxios gathered 13 Michigan voters who voted for Donald Trump in 2024 after voting for Joe Biden in 2020, and gauged their opinions of the new administration. The results were both encouraging and infuriating—often at the same time. \n\n“Ten of 13 participants from this battleground, auto-industry state bordering Canada said what they're seeing isn't what they thought they were voting for—and they're worried Trump's approach may hurt their pocketbooks,” wrote Axios. \n\nFrom the start, this conclusion is obnoxious. People voted for Trump—even as he openly and repeatedly promised to hurt other people—because they either wanted other people to get hurt, or didn’t care. Either way, that makes them shitty people. \n\n“Another voter, who owns a health and weight loss business, said most of her clients are in the auto industry—if they're hit it could devastate her,” wrote Axios. “One said she works in the auto industry and just got furloughed because ‘we are not building any cars right now.’”\n\nThey loved Trump when he promised to hurt other people, but they don’t like it when they themselves are facing the consequences of their vote. It’s hard to feel sorry for this crowd. But there is also a great deal of dumb, dumb, dumb. \n\n\"I don't feel like he was this aggressive last time because I don't think anyone would've voted for him if they expected to see what we're seeing now,\" said Shannon B., a 27-year-old from Livonia, Michigan.\n\nI’ll give Shannon a little bit of a pass since she was 19 at the start of Trump’s first presidency, with that underdeveloped frontal lobe. But … those of us paying attention can’t fathom why anyone would vote for him given what we saw the first time. \n\n\"He's so erratic, and it's getting to the point where I'm almost scared to watch the news,” said Sheryl M., a 44-year-old from Chesterfield. \"I mean, it's a little bit frightening 'cause each day is something new, so you get a little anxious.\"\n\nThis might be excusable if Trump hadn’t been erratic for his entire first term and then for the entire 2024 campaign cycle. In other words, inexcusable. \n\n\"I mean, Canada? When have we ever had issues with Canada?\" asked Dearborn Height’s Phil L., age 45. \"We barely have a border. You can go in and out of the country and a lot of places, a lot of states. I think we're just barking up the wrong tree with this.\"\n\nGiven that Trump spent his first term making enemies out of our allies, and coddling up to dictators in Russia, North Korea, China, and elsewhere, why would anyone act surprised is beyond me. \n\nTherese L., a 55-year-old from Commerce Township, was disgusted by that creepy AI image of Trump wearing a crown, saying \"long live the king,\" and claiming that \"He who saves his country doesn't violate any law.” \"He is acting like a dictator,\" said Therese L.\n\nAnd who warned her that Trump’s behaviors during his first term and campaign rhetoric were dictatorial? Wasn’t even us liberals! It was the very people who served in his first administration! \n\n\"[Trump] campaigned on lowering prices and making things more affordable for working-class people. He's moving in the opposite direction,\" said Michael L., a 43-year-old also out of Commerce Township. Axios further noted that Michael L. “conceded that Trump had previewed tariffs during the campaign, but said ‘we didn't necessarily think it would be this much, this fast.’\"\n\nAaaargh! I’ve noted before how powerful this feeling is—that Trump ran on lowering prices, and everything he’s done since has raised prices. It’ll be his eventual undoing, practically inevitable in my opinion. That’s why his pathetic Tesla stunt was particularly damaging to him. \n\nStill, a huge group of people who voted for him didn’t understand what tariffs were about. Michael L. apparently did—and still voted for him. It really is amazing how Trump gets people to believe his lies and not believe his truths. Trump is doing exactly what he promised, so why are people surprised if they were paying any attention? \n\n\"[I fear] that this will eventually turn into a dictatorship,” said Malea H., a 34-year-old from Clinton Township. “[I]f the people that we elected to be his checks and balances don't check and balance him, then what are they there for?\" \n\nMaybe don’t vote for wannabe dictators who have already stressed our institution? Yes, Democrats need to put up a fiercer fight. But that doesn’t absolve her of her vote. I don’t dump chemicals into a city’s water supply, then complain that authorities aren’t cleaning it up fast enough. \n\nSo 10 of 13 aren’t happy with Trump, but … “Only one of the 10 Trump voters-turned-critics said they'd choose Kamala Harris for president if they could do it over,” according to Axios.\n\nThat sounds damning, and it is. People don’t like to admit they made wrong choices, so they’ll rationalize their decision until the end of their days. Kamala would’ve been worse is a popular rationale. \n\nHere’s the thing: We will never change the minds of the MAGA cult. The vast majority of Trump voters will stick by their decision to vote for him, and they’ll keep voting for Republicans up and down the ticket. Changing their minds is not our job, however. \n\nOne of 13 Trump voters would’ve switched their vote to Harris, and that’s 7.7% of the whole that might vote differently next time. The story doesn’t say whether the rest would’ve still voted Trump or sat out the election or voted or voted third party or what. Given the fears of “dictatorship” from several of the panelists, presumably many would stay home. In any case, shift the vote in some battleground states by just a few percentage points and Harris would’ve won. \n\nThe core cult won’t shift. But if we can get 7.7% of Trump voters to regret their vote and shift to the Democrats, that would reshape the electoral landscape. That kind of shift would dramatically expand the presidential and Senate maps, and make it impossible for Republicans to win the House. \n\nThat’s our job, reaching those people.","summary":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\n\n\n\nAxios gathered 13 Michigan voters who voted for Donald Trump in 2024 after voting for Joe Biden in 2020, and gauged their opinions of the new administration. The results were both encouraging and infuriating—often at the same time. \n\n\n\n“Ten of 13 participants from this battleground, auto-industry state bordering Canada said what they're seeing isn't what they thought they were voting for—and they're worried Trump's approach may hurt their pocketbooks,” wrote Axios. \n\n\n\nFrom the start, this conclusion is obnoxious. People voted for Trump—even as he openly and repeatedly promised to hurt other people—because they either wanted other people to get hurt, or didn’t care. Either way, that makes them shitty people. \n\n\n\n“Another vote","url":"https://www.dailykos.com/story/2025/3/15/2310217/-This-group-of-Trump-voters-will-piss-you-off-and-give-you-hope?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1364678/story_image/AP24282669450515.jpg?1730765802","video":null,"publish_date":"2025-03-15 15:00:08","author":"kos","authors":["kos"],"language":"en","source_country":"US","sentiment":-0.464},{"id":300510512,"title":"Donald Trump Says His Promise To End Russia-Ukraine War In 24 Hours Was 'A Bit Sarcastic'","text":"US President Donald Trump admitted that his repeated campaign promise to end the Russia-Ukraine war within 24 hours, even before taking office, was “a little bit sarcastic.”\n\nIn an interview for “Full Measure,” Trump, now in his second term, acknowledged his past claims while his administration continues to seek a resolution to the ongoing conflict.\n“Well, I was being a little bit sarcastic when I said that. What I really mean is I’d like to get it settled and…I think I’ll be successful,” he said while he was asked about the vow he repeatedly made on the campaign trail.\nThis admission contradicts Trump’s previous assertions, including his statement at a May 2023 CNN town hall where he insisted on ending the war within 24 hours. “They’re dying, Russians and Ukrainians. I want them to stop dying. And I’ll have that done — I’ll have that done in 24 hours,” Trump had said.\nHe had reiterated the claim during his September debate with then-Vice President Kamala Harris, when he emphasised his plan to mediate between Russia and Ukraine.\n“That is a war that’s dying to be settled. I will get it settled before I even become president. If I win, when I’m president-elect, and what I’ll do is I’ll speak to one, I’ll speak to the other. I’ll get them together,” he had said.\nUS President’s special envoy, Steve Witkoff, recently concluded talks in Moscow regarding a US-proposed ceasefire, which Ukraine has accepted.\nWhen questioned about Russian President Vlaidmir Putin’s potential refusal of the ceasefire, Trump expressed concern for the loss of life and expressed confidence in Putin’s eventual agreement, citing his understanding of the Russian leader.\n“Bad news for this world because so many people are dying. But I think, I think he’s going to agree. I really do. I think I know him pretty well and I think he’s going to agree,” he said.\n\n(With inputs from AP)","summary":"US President Donald Trump in his second term, acknowledged his past claims while his administration continues to seek a resolution to the ongoing conflict.","url":"https://www.news18.com/world/donald-trump-says-his-promise-to-end-russia-ukraine-war-in-24-hours-was-a-bit-sarcastic-ws-d-9262851.html","image":"https://images.news18.com/ibnlive/uploads/2025/03/Untitled-design-2025-03-13T121257.643-2025-03-7271c0a2c2793c3d9dc050965beaeeb6.png","video":null,"publish_date":"2025-03-15 14:57:32","author":"News18,Shobhit Gupta","authors":["News18","Shobhit Gupta"],"language":"en","category":"politics","source_country":"in","sentiment":-0.161},{"id":300596020,"title":"Trump walks back 24-hour Ukraine peace promise: \"I was being a little bit sarcastic\"","text":"President Donald Trump, who repeatedly promised on the campaign trail that he could end the war between Russia and Ukraine in a single day, now says he wasn’t entirely serious about that claim. \n\n“Well, I was being a little bit sarcastic when I said that,” Trump said in an interview for the television program “Full Measure,” a clip of which was released ahead of its Sunday broadcast. “What I really mean is I’d like to get it settled, and I think I’ll be successful.”\n\nAccording to the Associated Press, Trump’s special envoy, Steve Witkoff, was in Moscow this week for talks on a U.S.-proposed agreement that Ukraine has already accepted, though a ceasefire isn’t guaranteed without Russia’s cooperation. When asked what would happen if Russian President Vladminir Putin refused to cooperate, Trump acknowledged that turn would be “bad news for this world because so many people are dying.” \n\n“But I think he’s going to agree,” Trump continued, “I really do. I think I know him pretty well and I think he’s going to agree.” \n\nWhile on the campaign trail, Trump frequently touted his ability to broker peace between Ukraine and Russia, saying during a May 2023 CNN Town Hall that he would “have that done in 24 hours.” Months later, in a debate with then-Vice President Kamala Harris, he went even further, saying he would secure a resolution before even taking office.\n\n“If I win, when I’m president-elect, what I’ll do is I’ll speak to one,” he said. “I’ll speak to the other. I’ll get them together.” \n\nRussia's full-scale invasion of Ukraine began on Feb. 24, 2022.","summary":"“What I really mean is I’d like to get it settled, and I think I’ll be successful\"","url":"https://www.salon.com/2025/03/15/walks-back-24-hour-ukraine-peace-promise-i-was-being-a-little-bit-sarcastic/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2025/02/volodymyr_zelensky_donald_trump_jd_vance_2202530699.jpg ?>","video":null,"publish_date":"2025-03-15 14:55:03","author":"Ashlie D. Stevens","authors":["Ashlie D. Stevens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.394},{"id":300594880,"title":"Western liberalism, Zionism and the wishful thinking of the left’s historical eurocentrism","text":"This piece provides commentary on how Western liberalism has approached the topic of Yahya Sinwar’s autobiography. Specifically, it discusses the political campaign led by the Italian and Zionist establishment in early March, which aimed to prevent the book’s presentation at La Sapienza University. This campaign and its controversy impacted various groups on the left and far-left of the political spectrum. The author’s central argument is that this situation highlights a historical trend of left-wing eurocentrism and how that trend influences the international Palestinian resistance movement, particularly within Western countries.\n\nThe Union of Young Jews of Italy, Italian Radicals, Left for Israel, Jewish Communities in Italy, young socialists, Forza Italia Giovani, other Catholic associations and associations of the Zionist Hasbara, in early March, appealed for the Sapienza University of Rome to revoke the permits granted to the Palestinian Student Movement.\n\nThey aimed to prevent the 5 March presentation of the autobiographical book The Thorns and the Carnation by Sinwar (with the participation of Davide Piccardo of the Islamic-inspired publishing house Editori della Luce, the book’s Italian publisher) from taking place within the Physics Department.\n\nThe appeal, titled “Terrorism out of the University”, stated: “La Sapienza, one of the few universities to have opposed boycotts against Israel and to have positioned itself as a bastion of academic freedom, still has the opportunity to prevent it from turning into a sounding board for terrorism,” immediately became a national political issue. The request in the appeal was supported by major Italian liberal democracy newspapers such as La Repubblica, Il Corriere dello Sera, Il Giornale and Il Messaggero. In turn, the newspapers reported the requests by Giovanni Donzelli and Noemi Di Segni for the Faculty of Physics to backtrack and ban the initiative.\n\nREAD: Tensions rise between Washington, Tel Aviv over US-Hamas Talks\n\nSinwar’s autobiographical book, written during his twenty-two years in Israeli prisons, is currently censored and banned from publication in many Western and European Union countries, but not in Italy, thanks to an Italian publisher who converted to Islam. It is also not banned in Ireland, whose back cover edition says: “Since Al-Sinwar was martyred while bravely fighting against the Israeli genocide in Gaza, the novel emerges as a vital piece of literature for those seeking to understand the ongoing tensions in the Middle East. It is more than just a story… With Al-Sinwar’s martyrdom, his novel represents both a reflection on the past and a prophetic vision of the future of the region.”\n\nThe book advances the reasoning behind the oppressed who resist out of necessity, in a written testament by Sinwar, who died fighting, which becomes the legacy of the living who cannot and do not want to give up.\n\nThe initiative promoted by Palestinian students at the university sparks reflection on a historical, theoretical and political challenge to Western nations, for whom even the written word of a deceased person is frightening. The university, as Western propaganda—well interpreted by Zionist liberalism—writes, is precisely the place that must honour the values of the Western ideology of democracy and freedom, whose myth is crumbling, causing a deep crisis gripping the West and leading Europe towards its decline.\n\nThe editorial operation undertaken by the Italian publisher is influenced by the point of view of Islamism. For Palestinian students, it is the reflection of the need for resistance that did not bow to the genocide in Gaza and is trying not to bow now to an even more bloody ethnic cleansing in the West Bank. Therefore, the revocation of the permits to hold the initiative by the university institutions was given because only the deluded do not understand that at this stage, for the hopes of Western democracy, the genocide of the Palestinian people is a necessary evil, as much of the press writes. Therefore, censorship is a vital reason for democracy. Despite the establishment of political fire and the physical threats received by Zionist groups, the Palestinian students reiterated their will to maintain the initiative.\n\nThe Palestinian students, beyond the usual rhetoric about the denied democratic spaces, found largely silence and indifference from a large part of the left groups and left activists who had initially been active in solidarity with Palestine. A silence broken only by the boycott carried out by so-called antagonistic areas of the “far” left, with the motivation that the publisher—an Italian who converted to Islam—is not a person liked by them. Thus, this reinforced the political conditions for which the Campus Student Collective revoked their support for the initiative that the Palestinian Student Movement was organising at that point.\n\nFrom the rhetorical condemnation of the imposed censorship and the renewed solidarity with the Palestinian resistance, the “far” left student groups have moved on to reiterate: “We would like to point out that despite the ban announced by the university, the decision to postpone the initiative was the result of political considerations linked to the choice, which we consider inadequate, to invite the speaker mentioned above.”\n\nIn essence, some with silence and some with open sabotage, the last epigones of left-wing “extremism” inside and outside the university, have bowed to the will of his majesty the establishment. For what reason? Because Piccardo was invited to participate at the end of November 2024 in a conference on “Palestine and Lebanon, from the clash of civilisations to global civil war” promoted by the right-wing neo-fascist organisation CasaPound, which, being a man of convinced Islamic faith, has the illusion of breaking hearts and democratically saving souls. Meanwhile, the neo-fascist right tries to play cards it does not have in an attempt to exploit for the nationalist purposes of an imperialist country, such as Italy, the competing point of view of certain Islamic currents towards Western liberalism.\n\nWe do not know Piccardo, nor are we interested in his political and ideological reasons because that is not what this is about. If anything, we should reason why, in all of Europe, only one Islamist-inspired publishing house published Sinwar’s autobiography, immediately earning a ban, while in Europe, the same publication has not found any sponsor in the so-called underground and left-wing publishing, and in Ireland, the book has been published through the free press internet and on-demand platforms. It seems clear to us that it is not because of an incident concerning Piccardo that the Palestinian students’ initiative was deemed inadequate. Surely, there was more than one sigh of relief by the left when it found “impeccable” reasons—against the fascist of the moment—and took the thorny issue out of its hands, throwing away the whole carnation.\n\nBLOG: Israel’s use of human shields in Gaza is part of its genocide against Palestinians\n\nIt was, and is, a question of deliberately ignoring a real resistance that isn’t expressed in a way that left-wing “extremism” prefers. We have supported and argued for this need for resistance in several recent articles, a need that Hamas embodies as its unified expression, attracting what remains of the old secular left-wing Palestinian political forces, in contrast to resignation and collaboration with Israel.\n\nThe fact, already serious in itself if we consider the context of general and verbal political aggression suffered by an organisation of young Palestinians by pro-Zionist political and institutional forces, is not limited to the low-level political dialectic that the so-called far-left continues to demonstrate. It recalls historical, material and political factors that are much more general, without which such political stupidity, which in any case abounds, is incomprehensible. We are in the presence of how, in the face of the crisis of the West in a composite and articulated way in Europe and Italy, the reasons for democracy, the idealistic anti-fascism and the individual freedoms achieved are worth more than the reasons for the resistance of the Palestinians called by the left to review their priorities.\n\nThis is a general dynamic that occurs in every Western country depending on the specific cases and in a differentiated manner with respect to the composite and international mobilisation in support of the Palestinian cause. It was the case in the US, whereby the Arab and Palestinian communities there, as well as African Americans, should have overlooked and voted for Kamala Harris against the “worst evil” Donald Trump, who promised and promises to bring hell into Palestine to annihilate Hamas and its resistance and complete the work of the ethnic cleansing—which is the common objective of Israel and jointly of all Western countries.\n\nIt is becoming more pressing in Italy and in Europe, which is struggling with the exhaustion of an ascending historical cycle that has seen it dominate the world for 500 years, so it is a question of supporting all the “non-sovereignist” political forces and the resistance in Ukraine against Russia, defending the democracy in Europe against Trump’s “neo-populism” that attacks it from the outside and European sovereignisms from the inside, counteracting its own fade and continuing to maintain the dividend of colonial and imperialist loot. In essence, the crumbling of Europe, put under pressure, gives impetus to a wave that also propagates to the left in concentric, or rather eurocentric, circles.\n\nAre we exaggerating?\n\nLet’s look at the facts: the left-wing Campus Students’ Collective, instructed by a so-called antagonist far-left group inside and outside the university, decided not to grant Palestinian students the use of the “self-managed” classroom. Left-wing student committees have used this space for decades through an informal agreement between the university and far-left university collectives and the decision was justified by claiming “inadequacy”.\n\nThe final result calls for a straightforward question, the answer to which reveals the historical material relationship: by what prerogative can a collective of left-wing university students use a space for themselves inside the campus and by what prerogative can the same collective, however, not grant it by its own choice to an organisation of young Palestinian students and militants? Is it not precisely because of the unequal and dominating relationship that the West has over the Middle East and Palestine?\n\nREAD: Europe firmly rejects any attempt to change Gaza’s demographics, official says\n\nIntellectual honesty compels us to acknowledge that the judgement of inadequacy effectively summarises an entire cycle of history and the relationship established by a mode of production between Western workers’ class movements towards anti-colonial struggles and the relationship between European and US imperialist nations and the colonised world. We believe history will present (and is already presenting) the final reckoning for this, and Palestine is merely the tip of the iceberg in this historical process.\n\nTo put it briefly: we are at a historical change of phase in the capitalist mode of production where the general development of accumulation of value, even if in a combined and unequal way, grew and maintained a relationship between dominant countries and countries still dominated, and by reflection in the dominant countries tended to consolidate the contradiction between so-called democratic countries and so-called non-democratic countries. For this reason, all the classes of the so-called democratic countries, raised in a cascade thanks to the domination relationship, could rightfully defend “democracy” against the so-called non-democratic countries to be exploited.\n\nToday, that type of relationship is being called into question.\n\nPalestinian resistance cannot have the same forms as Western movements. Therefore, it may not be the type of resistance that “we” like. It doesn’t conform to the material conditions that shaped the workers’ movement and the left in the West. The Western left’s viewpoint, as a social class that exists within the conflictual relationships of a society defined by the commodities market, is expressed through defending the material conditions of democracy in the most powerful nations. These nations have exchanged wealth and resources with the rest of the world, giving in return slavery, racism and war.\n\nMaterial conditions that have defined the oppression of the working classes and their representative parties in the West are linked to 500 years of colonialism, particularly the last 200 years of the turbulent development of liberal and democratic civilisations in European and Western nations. This historical process enabled these classes to gain political influence and the “freedom to fight,” essentially developing class conflict among workers within the democratic sphere.\n\nToday, Palestinian resistance and the rebellion of the peoples of the Sahel seriously challenge the future of peace, freedom and colonialist prosperity in Europe as a historical cycle ends. Simultaneously, the material conditions of the working classes and left-wing parties in Europe and the West are also being challenged.\n\nWhoever in the West refers to communism as an ideal movement must avoid presenting a vision that may have had material reasons before but that vanishes today. This is the historical truth, consequently theoretical, political, and, therefore, practical. This is why corporate parties, thus nationalist and right-wing, are multiplying throughout the West, and the left, as it has developed, is liquefying. It is the same reason why those in the West today are not capable of making a clear and definitive assessment of the historical phase that is something other than the past and are forced to chase the working classes in the West on a nationalist terrain as Sahra Wagenknecht does in Germany, just to name one that seemed in vogue only until a few months ago, and the German workers have preferred the right-wing original of the Alternative for Germany (AfD) to the bad copy of the “left”.\n\nLet’s be clear: it is not about condemning the political will of groups, associations or individual militants for certain behaviours, as, unfortunately, the left was historically accustomed to doing. Instead, it’s about understanding the material reasons for the behaviours of people involved in events such as the episode we are discussing here. We are therefore forced to note that while the mobilisation in support of Palestine to reverse the course of the genocide faces evident difficulty, we also note that the prevention of the presentation of Sinwar’s autobiography by the university is the first real political gain that the Western establishment can claim after 15 months of resistance in Palestine and international mobilisation.\n\nAfter the mobilisations on university campuses failed to hinder universities’ collaboration with Israel and to stop the genocide collaboration, and regardless of whether the reasons for the resistance were silenced and temporarily banned inside one of the most important Italian universities, it means that the reasons for liberal democracy prevailed again, forcing even young, willing leftists to step back.\n\nObviously, we express to the comrades of the Palestinian Student Movement, as well as to the publishing house, our total solidarity against the pro-Zionist political campaign that has also favoured the conditions of their political isolation among the various left-wing and far-left groups. We know well how to distinguish the strength of the dominators, the weakness of the dominated, and the domination of the corruptor over the corrupted. We hope that the Palestinian Student Movement can realise the initiative of presenting the autobiographical book The Thorns and the Carnation by Sinwar, precisely as initially planned with the publishing house and the publisher himself, in any place, if not inside the university, at least in its near vicinity.\n\nWe are prepared to do our part, but not for reasons of democracy or free thought. Instead, we act because addressing the Islamist viewpoint in the resistance against colonialism and the broader crisis of the colonialist system requires fully supporting the needs expressed by this resistance. Therefore, the exact opposite of an opportunistic distancing by alleging idealistic reasons, so that being alongside the Palestinian resistance until victory does not remain as just empty rhetoric and the daughter of a lesser god.\n\nREAD: ‘We’re surprised by the volume of patients in Gaza’\n\nThe views expressed in this article belong to the author and do not necessarily reflect the editorial policy of Middle East Monitor.","summary":"This piece provides commentary on how Western liberalism has approached the topic of Yahya Sinwar’s autobiography. Specifically, it discusses the political campaign led by the Italian and Zionist establishment in early March, which aimed to prevent the book’s presentation at La Sapienza University. This campaign and its controversy impacted various groups on the left and far-left of the political spectrum. The author’s central argument is that this situation highlights a historical trend of left-wing eurocentrism and how that trend influences the international Palestinian resistance movement, particularly within Western countries. The Union of Young Jews of Italy, Italian Radicals, Left for Israel, Jewish Communities in Italy, young socialists, Forza Italia Giovani, other Catholic associations and associations of the Zionist Hasbara, in [&#8230;]","url":"https://www.middleeastmonitor.com/20250315-western-liberalism-zionism-and-the-wishful-thinking-of-the-lefts-historical-eurocentrism/","image":"https://www.middleeastmonitor.com/wp-content/uploads/2024/06/AA-20240617-34901463-34901461-GRAFFITI_IN_KHAN_YUNIS_ON_PALESTINIAN_CHILDREN_DEPRIVED_OF_EDUCATION_BY_ISRAEL.jpg","video":null,"publish_date":"2025-03-15 14:22:19","author":"Middle East Monitor","authors":["Middle East Monitor"],"language":"en","source_country":"gb","sentiment":0.275},{"id":300520100,"title":"Mark Cuban Shares the Dumbest Video Ever Uploaded to Bluesky","text":"Mark Cuban is probably best known as that billionaire on Shark Tank. But did you also know he’s quickly becoming the worst poster on Bluesky? It’s true.\n\nCuban shared an AI-generated video on Friday that may rank as the single worst piece of media ever created for an emerging social media platform. And that’s obviously an extremely high bar.\n\nWhat did Cuban share? Well, it’s kind of hard to explain. Imagine the kind of political video that makes absolutely nobody happy and manages to piss off anyone with two brain cells to rub together. Imagine the kind of video that asks the question, “what if fascists are actually our best friends?” Imagine the kind of video that has Elizabeth Warren and Nancy Pelosi in MAGA hats and Donald Trump hugging Barack Obama.\n\nThe video, was sent out by Cuban with the caption “You have to manifest it first ?” and Cuban himself even makes an AI-appearance next to a poorly rendered versions of Jeff Bezos, Mark Zuckerberg, and Elon Musk. The theme of the video is MAUA, or Make America United Again.\n\nYep, that’s quite a video, isn’t it? Just absolute dogshit wrapped in AI—the aesthetics of fascism at this point. It’s also just not very well made from a technical standpoint.\n\nLike, what the hell is going on here? That’s… Trump?\n\nMark Cuban was embraced by Kamala Harris’s presidential campaign in 2024 as a billionaire who could apparently offer some advice on technology policy, including crypto. And there have been plenty of rumors about how Cuban himself might want to run for president one day. Kara Swisher, the billionaire tech mogul whisperer herself, recently said she thinks it could happen.\n\nBut people who like Cuban as a potential political candidate seem to be living in a very antiquated version of Democratic politics. Cuban is a centrist at a time when extremism has taken root in the Republican Party. So many Democrats seem convinced that Harris’s problem is that she was too extreme, despite the fact that she was campaigning with literal Republicans like Liz Cheney and never shared a stage with the “extreme” lefty candidates like Alexandria Ocasio-Cortez.\n\nCuban has made a transition to Bluesky as some kind of protest against Musk and his connections to Trump, as these guys completely destroy the U.S. government. And yet, Cuban is sharing a video about how it’s great to unite with these fascists. It’s all very confusing.\n\nBut at least some Democrats are joining in the spirit of Cuban’s “Make America United Again” campaign. Chuck Schumer, the Democratic leader in the Senate, helped push forward the Republican spending package that keeps the government open. Schumer’s rationale is that if they didn’t let the Republicans have everything they want, Musk would fire a bunch of federal employees, something he’s already been doing.\n\nNo, Schumer’s logic doesn’t make any sense. But at least the Democrats got absolutely nothing in return for giving Trump everything he wanted. In fact, Trump even praised Schumer Friday morning for his support. Way to go, Chuck. You’re really uniting America.","summary":"Hey kids, want to see something terrible?","url":"https://gizmodo.com/mark-cuban-shares-the-dumbest-video-ever-uploaded-to-bluesky-2000576391","image":"https://gizmodo.com/app/uploads/2025/03/Mark-Cuban-Jeff-Bezos-Mark-Zuckerberg.jpg","video":null,"publish_date":"2025-03-15 14:20:56","author":"Matt Novak","authors":["Matt Novak"],"language":"en","source_country":"us","sentiment":-0.179},{"id":300517348,"title":"Trump baselessly accuses news media of ‘illegal’ behavior and corruption in DOJ speech","text":"President Donald Trump launched some of his harshest attacks yet on the media on Friday, using a speech at the Department of Justice to baselessly accuse outlets including CNN of illegal and corrupt behavior.\nIn his Friday speech, Trump praised Florida district court Judge Aileen Cannon, whom he appointed in 2020 and who sided with him in January, blocking the DOJ from sharing a report on Trump’s alleged mishandling of classified documents with members of Congress.\nBut Trump claimed news publishers had gone after Cannon because of the January ruling, alleging “they do it all the time with judges” and that they “will write whatever these people say,” without offering proof.\n“The Washington Post, The Wall Street Journal and MSDNC, and the fake news, CNN and ABC, CBS and NBC, they’ll write whatever they say,” Trump said. “And what do you do to get rid of it? You convict Trump.”\n“It’s totally illegal what they do,” Trump continued, addressing DOJ employees. “I just hope you can all watch for it, but it’s totally illegal.”\nWhile Trump did not immediately clarify who “they” are, he later claimed that CNN and MSNBC are “political arms of the Democrat Party.”\n“In my opinion, they’re really corrupt,” Trump said.\nCNN and MSNBC declined to comment.\nTrump began his speech on Friday by praising the Justice Department’s legacy of taking on organized crime, saying that, under his administration, the agency would return to its roots of hunting down “killers, kingpins and spies,” tracking down “terrorists and traitors,” and tearing down “corrupt political machines all across America.”\nThe president’s desire to weaponize the Justice Department stems from his belief that the Biden administration used the agency against him. In his speech, he claimed that “they weaponized the vast powers of our intelligence and law enforcement agencies to try and thwart the will of the American people.”\nBut Trump’s claims, as reports have already pointed out, are bogus. The president’s two federal indictments were brought by Jack Smith, a special counsel appointed in November 2022 by then-Attorney General Merrick Garland. While Garland was appointed by President Joe Biden, that does not prove that Biden was in any way involved in the prosecution or that the former president personally ordered the indictments.\nYet in citing examples of the DOJ’s alleged weaponization against Americans, Trump only brought up issues that affected him directly and popular far-right conspiracy theories, many of which were misleading or have been outright debunked.\nTrump’s speech built on and expanded his history of labeling the press an enemy of the people and the state.\nBut what he really means is that news organizations whose reporting he dislikes may face the wrath of a Justice Department weaponized by the president.\nThat Trump is willing to go after news organizations he dislikes should come as no surprise. The president is currently engaged in a civil lawsuit against the Pulitzer Board over its defending the awarding of the 2018 National Reporting Prize to the Washington Post and the New York Times over their coverage of Russian interference in the 2016 election and its alleged connections to the Trump campaign. In December, ABC News settled a defamation case from Trump for $15 million. And Paramount Global, which owns CBS News, is still fending off a Trump lawsuit over its “60 Minutes” sit-down with former Vice President Kamala Harris.\nThis is to say nothing of the president’s indefinite ban of the Associated Press from the Oval Office and Air Force One over the wire service’s continued use of the term “Gulf of Mexico.”\nCertain agencies under the Trump administration have also signaled that they intend to terminate their subscriptions with mainstream outlets the president dislikes. In February, press secretary Karoline Leavitt announced the White House would end $8 million in Politico Pro subscriptions in response to a far-right conspiracy theory. And, on Friday, NPR reported that the US Agency for Global Media had canceled its AP and AFP contracts, noting that it would also allow its Reuters contract to lapse on March 31.\nBut the president’s Friday speech made clear these are not individual decisions from the White House; they are part of a broader attack on the media — one Trump clearly plans to maintain and even intensify.","summary":"CNN  —  President Donald Trump launched some of his harshest attacks yet on the media on Friday, using a speech at the Department of Justice to baselessly accuse outlets including CNN of illegal and corrupt behavior. In his Friday speech, Trump praised Florida district court Judge Aileen Cannon, whom he appointed in 2020 and who &#8230;\n\n\nThe post Trump baselessly accuses news media of ‘illegal’ behavior and corruption in DOJ speech appeared first on Egypt Independent.","url":"https://www.egyptindependent.com/trump-baselessly-accuses-news-media-of-illegal-behavior-and-corruption-in-doj-speech/","image":"https://amayei.nyc3.digitaloceanspaces.com/2025/03/gettyimages-2205127424.webp","video":null,"publish_date":"2025-03-15 13:52:02","author":"CNN","authors":["CNN"],"language":"en","category":"politics","source_country":"eg","sentiment":-0.304},{"id":300519730,"title":"Trump baselessly accuses news media of ‘illegal’ behavior and corruption in DOJ speech","text":"President Donald Trump launched some of his harshest attacks yet on the media on Friday, using a speech at the Department of Justice to baselessly accuse outlets including CNN of illegal and corrupt behavior.\nIn his Friday speech, Trump praised Florida district court Judge Aileen Cannon, whom he appointed in 2020 and who sided with him in January, blocking the DOJ from sharing a report on Trump’s alleged mishandling of classified documents with members of Congress.\nBut Trump claimed news publishers had gone after Cannon because of the January ruling, alleging “they do it all the time with judges” and that they “will write whatever these people say,” without offering proof.\n“The Washington Post, The Wall Street Journal and MSDNC, and the fake news, CNN and ABC, CBS and NBC, they’ll write whatever they say,” Trump said. “And what do you do to get rid of it? You convict Trump.”\n“It’s totally illegal what they do,” Trump continued, addressing DOJ employees. “I just hope you can all watch for it, but it’s totally illegal.”\nWhile Trump did not immediately clarify who “they” are, he later claimed that CNN and MSNBC are “political arms of the Democrat Party.”\n“In my opinion, they’re really corrupt,” Trump said.\nCNN and MSNBC declined to comment.\nTrump began his speech on Friday by praising the Justice Department’s legacy of taking on organized crime, saying that, under his administration, the agency would return to its roots of hunting down “killers, kingpins and spies,” tracking down “terrorists and traitors,” and tearing down “corrupt political machines all across America.”\nThe president’s desire to weaponize the Justice Department stems from his belief that the Biden administration used the agency against him. In his speech, he claimed that “they weaponized the vast powers of our intelligence and law enforcement agencies to try and thwart the will of the American people.”\nBut Trump’s claims, as reports have already pointed out, are bogus. The president’s two federal indictments were brought by Jack Smith, a special counsel appointed in November 2022 by then-Attorney General Merrick Garland. While Garland was appointed by President Joe Biden, that does not prove that Biden was in any way involved in the prosecution or that the former president personally ordered the indictments.\nYet in citing examples of the DOJ’s alleged weaponization against Americans, Trump only brought up issues that affected him directly and popular far-right conspiracy theories, many of which were misleading or have been outright debunked.\nTrump’s speech built on and expanded his history of labeling the press an enemy of the people and the state.\nBut what he really means is that news organizations whose reporting he dislikes may face the wrath of a Justice Department weaponized by the president.\nThat Trump is willing to go after news organizations he dislikes should come as no surprise. The president is currently engaged in a civil lawsuit against the Pulitzer Board over its defending the awarding of the 2018 National Reporting Prize to the Washington Post and the New York Times over their coverage of Russian interference in the 2016 election and its alleged connections to the Trump campaign. In December, ABC News settled a defamation case from Trump for $15 million. And Paramount Global, which owns CBS News, is still fending off a Trump lawsuit over its “60 Minutes” sit-down with former Vice President Kamala Harris.\nThis is to say nothing of the president’s indefinite ban of the Associated Press from the Oval Office and Air Force One over the wire service’s continued use of the term “Gulf of Mexico.”\nCertain agencies under the Trump administration have also signaled that they intend to terminate their subscriptions with mainstream outlets the president dislikes. In February, press secretary Karoline Leavitt announced the White House would end $8 million in Politico Pro subscriptions in response to a far-right conspiracy theory. And, on Friday, NPR reported that the US Agency for Global Media had canceled its AP and AFP contracts, noting that it would also allow its Reuters contract to lapse on March 31.\nBut the president’s Friday speech made clear these are not individual decisions from the White House; they are part of a broader attack on the media — one Trump clearly plans to maintain and even intensify.","summary":"CNN  —  President Donald Trump launched some of his harshest attacks yet on the media on Friday, using a speech at the Department of Justice to baselessly accuse outlets including CNN of illegal and corrupt behavior. In his Friday speech, Trump praised Florida district court Judge Aileen Cannon, whom he appointed in 2020 and who &#8230;\n\n\nThe post Trump baselessly accuses news media of ‘illegal’ behavior and corruption in DOJ speech appeared first on Egypt Independent.","url":"https://egyptindependent.com/trump-baselessly-accuses-news-media-of-illegal-behavior-and-corruption-in-doj-speech/","image":"https://amayei.nyc3.digitaloceanspaces.com/2025/03/gettyimages-2205127424.webp","video":null,"publish_date":"2025-03-15 13:52:02","author":"CNN","authors":["CNN"],"language":"en","category":"politics","source_country":"eg","sentiment":-0.304},{"id":300509416,"title":"Kamala Harris campaign required she only be seated in chairs that ‘met certain specifications': report","text":"A new book about the presidential campaign of former Vice President Kamala Harris reports that her campaign demanded she be seated only in chairs that \"met certain specifications.\" An excerpt from \"FIGHT: Inside the Wildest Battle for the White House,\" by Jonathan Allen and Amie Parnes, published in The Hill, detailed the strict seating arrangements. \"Her team required that she be provided a chair that met certain specifications: 'Leg height no less than 15 inches; floor to top of seat height no less than 18.9 inches; arms on chairs may not be very high, arms must fall at a natural height; chairs must be firm,\" according to the book excerpt. The mandated chair specifications came following her first media interview after taking over the top of the Democratic ticket roughly 40 days before. CNN’S KAMALA HARRIS, TIM WALZ INTERVIEW CAN BE SUMMED UP IN JUST TWO WORDS Harris was joined by her running mate, Minnesota Gov. Tim Walz, for a joint interview with CNN's Dana Bash on Aug. 29, 2024. The pair sat at a table, but the visual of Harris appearing to be lower than Walz prompted her team to issue a new mandate to never let it happen again. \"Sitting next to Walz in a chair that seemed to place her below him and heaping praise on Biden’s record, Harris did not look like a candidate seeking the highest office in the land,\" the excerpt read. \"The whole scene reinforced the criticism that the vice president was either incapable, or afraid, of answering tough questions on her own.\" But Allen and Parnes said that regardless of the mandated chair specs, \"the question facing Harris was whether she could build a sturdy platform.\" BIDEN REPORTEDLY TOLD HARRIS THERE COULD BE ‘NO DAYLIGHT’ BETWEEN THEM ON POLICIES: REPORT Also included in the excerpt was news of former President Joe Biden telling Harris to not distance herself from his policies. \"No daylight, kid,\" Biden reportedly said. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to the office of the former vice president but did not immediately receive a response.","summary":"The campaign of former Vice President Kamala Harris required she be seated only in chairs that “met certain specifications,&quot; according to a new book.","url":"https://www.foxnews.com/media/kamala-harris-campaign-required-she-only-seated-chairs-met-certain-specifications-report","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/harriscnn2.png?ve=1&tl=1","video":null,"publish_date":"2025-03-15 13:43:13","author":"Rachel Del Guidice","authors":["Rachel Del Guidice"],"language":"en","source_country":"us","sentiment":-0.321},{"id":300489748,"title":"Bill Maher Almost Gets Josh Shapiro To Admit He’s Running For POTUS In 2028 On ‘Real Time’","text":"After a week marked by heightened political tensions both at home and abroad due to Donald Trump, Pennsylvania Governor Josh Shapiro appeared on HBO’s Real Time with Bill Maher on Friday night, skillfully avoiding a direct answer to whether he plans to run for president in 2028.\n\n“I’m not an expert in the DC stuff,” Shapiro said, addressing the latest Democratic figure to gain attention on Maher’s show. “I try and stay as far away from that as I can. I live in the real world in Pennsylvania, where we have to balance budgets.”\n\nDespite this, Shapiro, often echoing the tone of former President Barack Obama, was quick to express his frustration with Senate Democrats. Specifically, he criticized Senate Majority Leader Chuck Schumer and other top Democrats for their handling of recent negotiations, particularly regarding the GOP’s proposed six-month spending measure aimed at avoiding a government shutdown.\n\n“I would have liked to see when Chuck Schumer had leverage here, to say we need A, B, C, and D for the Democratic Party, and force the Republicans to meet him halfway on those issues and deliver something for the folks who are worried now,” Shapiro told Maher, advocating for a more assertive strategy in negotiations with the GOP.\n\nShapiro later shared an anecdote from a recent trip to a Dick’s Sporting Goods store, where constituents approached him with concerns about the Democratic Party’s lackluster responses to Trump, Elon Musk, and what they see as the erosion of government protections.\n\nWith Trump’s policies, including trade wars with Canada and Mexico, mass civil service firings, and politically motivated detentions, Shapiro has positioned himself as a strong voice of centrist opposition in a time when former leaders like Barack Obama, Bill Clinton, and Joe Biden seem absent from the political stage.\n\n“They’re worried,” Shapiro said, referring to everyday Pennsylvanians who spoke with him in the store. “They want to see action. There was an opportunity for more action here.”\n\nDuring the interview, Maher, who has been vocal in his criticism of MAGA policies, pressed Shapiro on whether the governor’s faith and identity as a Jewish person played a role in him not being chosen as Kamala Harris’ running mate in 2020.\n\n“Look, I’ll just say one quick thing on that whole vice president thing,” Shapiro responded. “I said all along that Kamala Harris had a deeply personal decision to make in that process. In the end, so did I.”\n\nAfter a dramatic pause, Shapiro, a potential 2028 presidential contender, shifted the conversation to his love for serving as governor. “I love being governor of Pennsylvania, and I love charting my own course and being able to serve the people on my terms,” he stated. “That’s point number one. Point number two is, as it relates to faith, as it relates to my Judaism. I’m damn proud of my faith, and I’m damn proud of the people of Pennsylvania, and how they received that.”\n\nHe continued, “I’m inspired every day by the way my outward expression of my faith is received by the people I serve,” emphasizing his pride in his faith and his leadership.\n\nDespite this compelling display, Shapiro declined to confirm whether he’s planning a presidential run in 2028.\n\nMaher, who won’t be on any ballot himself, also used the Friday night episode to lambast Trump, calling him “the Ozempic of the economy” during his opening monologue. He criticized the loss of $5 trillion in market value due to Trump’s erratic tariff policies and the destabilizing impact of Elon Musk’s corporate decisions. Maher also mocked the Republican Party for its subservience to Trump, comparing it to the totalitarianism of North Korea, and criticized MAGA’s economic and diplomatic failures as the former reality TV star returned to power.\n\nIn addition to Shapiro’s interview, Real Time also featured Sam Stein, managing editor of The Bulwark and MSNBC contributor, and Batya Ungar-Sargon, a self-described “MAGA leftist” and author of Second Class: How the Elites Betrayed America’s Working Men and Women.\n\nYou can watch a clip of Maher’s opening monologue from last night’s episode above.","summary":"He also called Trump \"the Ozempic of the economy\" for causing the recent market downturn.","url":"https://decider.com/2025/03/15/bill-maher-almost-gets-josh-shapiro-to-admit-hes-running-for-potus-in-2028-on-real-time/","image":"https://decider.com/wp-content/uploads/2025/03/bill-maher-031425.jpg?quality=75&strip=all&w=1156","video":null,"publish_date":"2025-03-15 13:02:19","author":"Michael Haskoor,mliss1578","authors":["Michael Haskoor","mliss1578"],"language":"en","source_country":"us","sentiment":0.169},{"id":300494290,"title":"Josh Shapiro tells Maher he's 'damn proud' of being Jewish, dodges whether it factored into VP snub in 2024","text":"Pennsylvania Gov. Josh Shapiro said he's \"damn proud\" of being Jewish but refrained from suggesting his faith played a role in being snubbed as the vice-presidential candidate on the Democratic ticket in 2024. On Friday's installment of \"Real Time with Bill Maher,\" Shapiro was asked about how his religion factors in the current state of the Democratic Party. \"You were on the shortlist for vice president last time. Pennsylvania. And a lot of people said, 'Well, the only reason he didn't get it was because he's Jewish,'\" host Bill Maher told Shapiro. \"And there's a wing in this party that was very anti-Israel now, which is a big change in my lifetime, because the Democrats used to be a very pro-Israel place, and then it all got switched around. Do you think that's true?\" \"If you ran [in 2028], if, wouldn't you- as somebody has to sort of, like, defend the Jews, like, outright?\" Maher continued his question. \"Because I just feel like there's a lot of tiptoeing back away from this issue. Like, 'We just don't want to go near it,' as opposed to saying ‘Well, actually, this is our friend in the Middle East.’\" MAHER PRAISES NEWSOM'S ‘TACK TO THE CENTER’ AS DEM GOV SPEAKS OUT AGAINST TRANS ATHLETES IN WOMEN'S SPORTS \"Look, I'll just say one quick thing on that whole vice president thing,\" Shapiro responded. \"I said all along that Kamala Harris had a deeply personal decision to make in that process. In the end, so did I. I love being governor of Pennsylvania, and I love charting my own course and being able to serve the people on my terms. That's point No. 1.\" \"Point No. 2 is, as it relates to faith, as it relates to my Judaism. I'm damn proud of my faith,\" Shapiro said, sparking applause from the audience. \"And I'm damn proud of the good people of Pennsylvania and how they received that.\" BILL MAHER KNOCKS REP. JASMINE CROCKETT, QUESTIONS HER STATUS AS ‘BIG LEADER’ OF DEMOCRATIC PARTY Shapiro, who is already being seen as a potential Democratic hopeful in 2028, went on to tell Maher that his first campaign ad featured him and his family at the Shabbat dinner table. \"We did that because every Friday night, that's where we find ourselves, together as a family, celebrating our faith. We're proud of that,\" Shapiro said. \"You know what happened, Bill, after we ran that ad? I'd show up in some of these rural communities where I might increase the Jewish population by 100% when I showed up there, folks would come over to me and they'd say, 'Hey, I saw your ad. Let me tell you what it's like on Sunday afternoon when I come home from church.' 'Let me tell you what it's like on Christmas Eve.' 'Let me tell you about our Iftar dinners that we have during Ramadan.'\" He continued, \"Folks were more open about it because I showed them truly who I am. I think the American people are a warm people. They are a loving people. I represent the Commonwealth of Pennsylvania, founded by William Penn, who literally founded our Commonwealth on the promise of it being warm and welcoming to people of all faiths. I have a responsibility to carry that out, and I'm inspired every day by the way my outward expression of my faith is received by the people I serve.\" CLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS CLICK HERE TO GET THE FOX NEWS APP As Maher referenced, Shapiro was among the final contenders in the veepstakes, but then-Vice President Kamala Harris chose Minnesota Gov. Tim Walz as her running mate. Many critics suspected Shapiro, a popular governor in a pivotal swing state, was snubbed because he was Jewish as the progressive base of the Democratic Party fueled anti-Israel protests across the country following the Oct. 7 terrorist attack by Hamas. Shapiro said at the time \"Antisemitism played absolutely no role in my dialogue with the vice president.\" Harris ultimately lost Pennsylvania to President Trump, fueling speculation that she may have won the commonwealth if Shapiro had been on the ticket.","summary":"Pennsylvania Gov. Josh Shapiro told HBO&apos;s Bill Maher he&apos;s &quot;damn proud&quot; of being Jewish but sidestepped whether his faith played a role in the VP snub during the 2024 election.","url":"https://www.foxnews.com/media/josh-shapiro-tells-maher-hes-damn-proud-being-jewish-dodges-whether-factored-vp-snub-2024","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/shapiromaher.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-15 12:57:06","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.136},{"id":300479996,"title":"Trump Says He Was Being \"Sarcastic\" About Ending Russia-Ukraine War In A Day","text":"President Donald Trump has clarified his previous statements on resolving the Russia-Ukraine conflict, admitting that his claims of solving the issue within 24 hours were made in a sarcastic tone.This acknowledgment came during an interview for the \"Full Measure\" television program, where Trump was asked about his campaign trail promises.Trump's initial statements, made during his presidential campaign, were quite bold. He claimed that he would resolve the conflict before even taking office, stating, \"They're dying, Russians and Ukrainians. I want them to stop dying. And I'll have that done - I'll have that done in 24 hours\".He reiterated this claim during a debate with then-Vice President Kamala Harris, saying, \"That is a war that's dying to be settled. I will get it settled before I even become president\".However, Trump's tone has shifted since taking office. He now acknowledges that his previous statements were sarcastic, saying, \"Well, I was being a little bit sarcastic when I said that... What I really mean is I'd like to get it settled and, I'll, I think, I think I'll be successful\".(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");The situation remains complex, with Trump's special envoy, Steve Witkoff, engaging in talks with Russian officials on a proposed ceasefire. Ukraine has accepted the proposal, but its not yet certain whether Russia will follow suit.When asked about the potential consequences if Putin refuses to agree to a ceasefire, Trump expressed concern, saying, \"Bad news for this world because so many people are dying\". However, he remains optimistic, stating, \"But I think, I think he's going to agree. I really do. I think I know him pretty well and I think he's going to agree\".&nbsp","summary":"He now acknowledges that his previous statements were sarcastic, saying, \"Well, I was being a little bit sarcastic when I said that... What I really mean is I'd like to get it settled and, I'll, I...","url":"https://www.ndtv.com/world-news/donald-trump-says-he-was-being-sarcastic-about-ending-the-russia-ukraine-war-in-24-hours-7929719","image":"https://c.ndtvimg.com/2025-03/ukb8fs3_trump-reuters_625x300_15_March_25.jpeg","video":null,"publish_date":"2025-03-15 12:04:25","author":"Anushree Jonko","authors":["Anushree Jonko"],"language":"en","category":"politics","source_country":"in","sentiment":-0.617}]}