{"offset":0,"number":50,"available":537,"news":[{"id":290933832,"title":"Why conservatives are obsessed with phony masculinity","text":"Explaining the Right is a weekly series that looks at what the right wing is currently obsessing over, how it influences politics—and why you need to know.\n\nSecretary of Defense Pete Hegseth has been a leading voice within the Trump administration for purported masculinity. \n\nHegseth, who was chosen by Donald Trump to lead the entire U.S. armed forces because he talked tough as a Fox News pundit, has used his new position to extol the virtues of “warfighters” over soft power as the U.S. military’s approach.\n\nThis principle might have best been demonstrated when Hegseth threw an axe during an episode of “Fox & Friends,” nearly killing a musician.\n\nHegseth has attacked military leadership’s efforts to diversify the ranks, recently saying that the notion that “diversity is our strength” is the “single dumbest phrase in military history.” \n\nHe returned to this theme during his recent trip to the NATO summit in Brussels, telling reporters that “we can talk all we want about values. Values are important. But you can't shoot values.”\n\nTrump has also embraced this “tough guy” ethos for much of his time in the public sphere, from his recently released glowering official portrait—compared to the traditional portraits of former Presidents Barack Obama, Joe Biden, and even George W. Bush—to his repeated arguments that Americans need to be “tough.” \n\nTrump even derided the purported weakness of the entire country with the ableist title of his 2015 book, “Crippled America: How To Make America Great Again.”\n\nWhile campaigning for former Vice President Kamala Harris in 2024, Obama poked fun at Trump and other Republicans for embracing “the fake macho thing.”\n\nBut this has been an issue among Republicans predating Trump. \n\nBush infamously dressed up in a flight suit and landed an aircraft carrier to prematurely—and incorrectly—declare victory in the Iraq War while his father, George H.W. Bush, claimed that victory in the first Gulf War meant that the United States “kicked the Vietnam syndrome.”\n\nBut that isn’t how modern superpowers win wars. Rather, it’s intelligence, coalition building, and strategic planning that end conflicts. \n\nIn World War II, the Allied nations did not simply throw military might at the Axis powers in a pure test of “manly” strength. In fact, until the Allies put together a coherent plan of attack in response to German and Japanese aggression, it was the Axis that had more raw firepower.\n\nOne of the most vital breakthroughs of that conflict didn’t come from the “warfighters” that Hegseth goes on about, but by a team of dedicated codebreakers at Bletchley Park in England.\n\nMathematician Alan Turing led the team that cracked the German “Enigma” code, which then allowed the forces on the ground to engage in a strategic fashion, leading to the liberation of Europe and victory in the war. Turing was gay and later persecuted by the British government for his sexual orientation despite his heroism, echoing the attacks on LGBTQ+ military service members that have been renewed by the Trump administration.\n\nModern military experts—not Fox News pundits—have studied the benefits of diversity in the armed forces, and unlike Hegseth, they know that it’s important. \n\nDartmouth College professor Jason Lyall analyzed the issue, which he wrote about in a 2020 article for the Washington Post.\n\n“My research shows that inclusive armies fight harder, suffer lower rates of desertion and defection, and exhibit more creative problem-solving on complex battlefields than armies drawn from marginalized or repressed groups,” he wrote. “Victory on the battlefield over the past 200 years has usually gone to the most inclusive armies, not the largest or best-equipped ones. Inclusion, in other words, is good for military effectiveness.”\n\nAnd despite Hegseth and Trump’s rhetoric, some of the most significant recent U.S. military victories and security advances have come under the leaders the right has attacked for insufficient masculinity.\n\nOsama bin Laden, mastermind of the 9/11 attacks, wasn’t caught because Bush donned his flight suit. Rather, he was apprehended and killed following Obama’s order in 2011.\n\nMany believed that Ukraine would quickly fold when Russia invaded, but Biden stood behind Ukraine and President Volodymyr Zelenskyy, and Russia has been unable to triumph—though Trump is now pivoting away from that stance.\n\nConservatives like to talk tough, particularly when bolstering the image of straight, white men over women and ethnic minorities. But modern power is more often than not backed by strategic planning, diplomacy, and soft power. It’s what has been used by the United States and other nations in avoiding another calamity like the World Wars, which were tied to the notion that international conflicts were solely the domain of “warfighters.”\n\nBut figures like Hegseth and Trump are locked into the worldview that only people who look like them are legitimate, and everyone else must fall to the wayside. That has historically been the path that leads to unwinnable quagmires, claiming the lives of millions of innocent people.\n\nHistory tells us that this time won’t be any different.","summary":"Explaining the Right is a weekly series that looks at what the right wing is currently obsessing over, how it influences politics—and why you need to know.\n\n\n\n\nSecretary of Defense Pete Hegseth has been a leading voice within the Trump administration for purported masculinity. \n\n\n\nHegseth, who was chosen by Donald Trump to lead the entire U.S. armed forces because he talked tough as a Fox News pundit, has used his new position to extol the virtues of “warfighters” over soft power as the U.S. military’s approach.\n\n\n\nThis principle might have best been demonstrated when Hegseth threw an axe during an episode of “Fox &amp; Friends,” nearly killing a musician.\n\n\n\nxHegseth had his first real test on the world stage yesterday. \n\nIt went about as well as his axe throwing career.\n\n— Pat Ryan (@pkryan.bsky.social) 2025-02-13T17:50:58.064Z\n\nHegseth has attacked military leadership’s efforts to diversify the ranks, recently saying that the notion that “diversity is our strength” is the “single dumbest phrase in military","url":"https://www.dailykos.com/story/2025/2/15/2303779/-Why-conservatives-are-obsessed-with-phony-masculinity?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1398594/story_image/ETR_2.14.png?1739563791","video":null,"publish_date":"2025-02-16 00:00:06","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.243},{"id":290914034,"title":"UK must change defence priorities before it is too late – we can’t hide behind US military anymore","text":"FROM now on, the special relationship looks like it is going to be the one between the United States of America and Russia.\n\nPresident Trump is drawing up plans to meet Russia’s chief thug Vladimir Putin in Saudi Arabia, while our own Prime Minister waits anxiously for his first visit to the MAGA White House.\n\nFor this was the week when an alliance that has endured for 75 years came to a bitter end.\n\nTrump and his flunkies did not simply tell Europe that the USA is no longer going to bankroll European national security.\n\nIt was far worse than that.\n\nThe brutal subtext of all the soundbites about Uncle Sam not being taken for Uncle Sucker was this — Trump is just not that into you, Europe.\n\nIt is undeniable that Europe has been hiding behind America’s military might for a lifetime.\n\nAnd it is true that nobody has spent more on aid to Ukraine than the United States — £73billion, compared with £13billion from Germany, £12billion from the UK and £7billion from Japan.\n\nJapan? Tokyo is more than 5,000 miles from Kyiv!\n\nWhy should Japan pay more for Ukraine’s protection than most of the nations of Europe?\n\nNot good enough\n\nThe freeloading Euros are going to have to start defending their continent. And paying for it.\n\nAnd for all British warm words and big promises to Ukraine — Starmer has promised that the UK will support Ukraine for “100 years” — that includes this country.\n\nFor all his wistful wittering about the Royal Family, Donald Trump doesn’t give a damn about us.\n\nThe UK has to be the military force we were in the 20th century.\n\nTrump wants his allies — something tells me that should be “allies” in inverted commas — to spend five per cent of our national wealth on it.\n\nOur defence spending is currently a paltry 2.3 per cent of national income, although Labour say they might be able to manage 2.5 per cent.\n\nAlthough they don’t say when! Not good enough. Nowhere near good enough. \n\nNot when Trump just emboldened the nuclear-armed warmonger in Moscow.\n\nIt feels like we have no choice.\n\nRussia spends more on defence than all of Europe combined.\n\nSo our priorities have just changed for ever.\n\nAllowed to rust and rot\n\nNothing can be considered more crucial than protecting our way of life.\n\nNothing is of greater importance than defending our nation.\n\nBut this Labour Government has allocated £13.3billion in foreign aid for 2024/25 and £13.7billion for 2025/26.\n\nAnd we can’t afford that kind of virtue-signalling largesse any more.\n\nIt is total madness when Putin is waving nuclear weapons at us and expanding the Red Army.\n\nAnd Labour can forget blowing £1.4trillion to achieve net zero emissions by 2050.\n\nWe can’t afford it. And £18.8trillion to Caribbean countries for reparations for slavery?\n\nI think possibly not. We can’t afford it!\n\nAnd our Armed Forces can no longer be allowed to rust and rot. We can’t afford it.\n\nIt feels like a golden age of freedom is coming to an end.\n\nFrom the Western Front to Normandy, Iraq to Afghanistan, the British have fought alongside our American allies for more than a century.\n\nNo longer. \n\nMr President, your historic break with the past cuts both ways. \n\nThe British do not want a Cold War with China.\n\nWe never want another Iraq or Afghanistan.\n\nSo the next time America wants to wage a war, the Yanks can do it alone.\n\nIt's fur real, Stella\n\nWHEN Labour MP Stella Creasy coos that the late Queen having tea and marmalade with Paddington Bear was “a beautiful British moment that everyone celebrated”, I agree with every word.\n\nWhere Stella and I part company is when she says that our policies on illegal immigration should be shaped by our warm feelings about that little marmalade sarnie munching mammal from Peru.\n\nSlamming the Government’s plans to block illegal migrants from ever becoming British citizens, Stella seethes: “It would deny, frankly, Paddington. He did the same thing! He came by an irregular route – we gave him sanctuary.”\n\nEagle-eyed readers will have spotted the flaw in Stella’s argument.\n\nPaddington Bear is not real.\n\nPaddington will never need housing.\n\nHe will never need health care.\n\nHe will never produce lots of little baby bears who will need to be watched over from the cradle to the grave.\n\nI agree with Stella Creasy that, “We have to have strong border controls – but also decency”.\n\nLet’s keep our humanity when discussing immigration.\n\nBut last year another 728,000 came here.\n\nThey were all flesh and blood, Stella.\n\nNot fur, fantasy and marmalade sandwiches.\n\nAsteroid panic\n\nTHE odds of an asteroid hitting Earth three days before Christmas 2032 just halved.\n\nThe space rock is the size of a football pitch, moving at 38,000 miles per hour, and would strike our planet with the force of 100 nuclear bombs.\n\nNASA’s Planetary Defense Team currently has no plan.\n\nApparently getting out a Bruce Willis in a grubby vest to save the planet is not an option.\n\nWe will probably be fine.\n\nMind you, that is exactly what the dinosaurs said.\n\nBad year? I bet Taylor can Shake It Off\n\nTAYLOR SWIFT left the Grammys without a gong, got booed at the Super Bowl and was mocked on social media by Donald Trump – because those same “football” fans in New Orleans cheered for him.\n\nSome say that an era of unpopularity is coming Taylor’s way.\n\nOh, I don’t know. \n\nSwift’s Eras tour grossed $2BILLION – the highest-grossing concert tour in music history.\n\nThe last time I looked, Taylor was young, rich, beautiful – and after all those years of dating skinny British boys, seems blissfully loved up with her lumberjack-looking NFL boyfriend, Kansas City Chiefs’ Travis Kelce.\n\nShe got booed at the Super Bowl – so what? \n\nDo we expect fans of the Philadelphia Eagles to cheer her?\n\nShe left the Grammys without an award – but she already has 14 Grammys on her mantelpiece.\n\nAnd as for “The Donald” mocking her on social media, that’s the price she pays for supporting Kamala Harris.\n\nTaylor Swift, 35, has her health, those radiant looks, more than $1billion in the bank and she is dating the love of her life.\n\nIf this is a bad year for Taylor Swift, then I would love to see what a good one looks like.\n\nBank on fun times\n\nA BBC investigation reports that Rachel Reeves and two colleagues were the subject of an expenses probe when the Chancellor was a senior manager at Halifax Bank of Scotland in the late 2000s.\n\nA whistle-blower complained that the three were using company expense accounts to “fund a lifestyle” – something Reeves says she was unaware of.\n\nAllegations include Reeves buying a £152 handbag on expenses as a Christmas present for her boss at HBOS, while her boss reportedly bought her a £55 wine gift that same Yuletide.\n\nOther alleged expenses claims included dinners, gifts and taxis.\n\nDoesn’t HBOS sound like a wonderful place to work?\n\nI was at the NME for three years at the peak of sex and drugs and rock and roll.\n\nBut I don’t think I had as much fun as Rachel Reeves did at HBOS.\n\nA bald move\n\nSAM McKNIGHT, hairdresser to the stars, advises Prince Harry to remove the few remaining tufts of fur on top of his thinning bonce and have a hair transplant.\n\n“You’re in California, where they have the best!” insists Sam, who was Princess Diana’s hairdresser and cut William and Harry’s hair when they were children.\n\n“That fluff on top of his head is like a new-born chick and it is just horrible,” Sam, 69, posted on Instagram.\n\n“If I was his age, I would have a hair transplant because they are so great nowadays.”\n\nHarry will probably never have a hair transplant.\n\nHe is too self-consciously English and would recoil at such a brazen act of vanity.\n\nBut his former barber is right. Harry lives in the home of the hair transplant.\n\nWhich is why you never see a film star with a comb-over like Harry.","summary":"","url":"https://www.thesun.co.uk/news/33396830/donald-trump-putin-ukraine-war/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/02/newspress-collage-y0b4nx2th-1739640409285.jpg?1739640445&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-02-15 22:00:00","author":"Matt Rayson,Tony Parsons","authors":["Matt Rayson","Tony Parsons"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.193},{"id":290914594,"title":"At least one billionaire sure seems to regret backing Trump","text":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\nToday, we shine spotlights on the most opposite spectrums of American society—one of the poorest countries in the country—Prentiss County, Mississippi—and billionaire Ken Griffin. And then we’ll end with a disabled veteran.\n\nLet’s start with Prentiss County. On their Facebook page, the county’s sheriff’s department announced, “Our Food giveaway is suspended until further notice. We have been notified by MidSouth Foodbank that funding has been suspended and we won’t receive any deliveries until otherwise notified.”\n\nThe letter attached to the Facebook post further clarified that the funding shortfall came, in part, from an end to COVID-19-era food assistance. Republicans have taken aim at such programs for the last couple of years, and they are as good as dead now that their party holds total control in Washington. \n\nIt is obviously distressing for a community and its poor to lose something as invaluable as food assistance. Yet the county’s voters have done everything possible to worsen their situation. \n\nThe county’s annual per-capita income is $29,000, according to the U.S. Census Bureau. Nearly 18% of its residents live in poverty, similar to the state at large. The national poverty rate was 11% in 2023, the most recent year of complete data. \n\nPrentiss is 81% non-Hispanic white and 15% Black. Given that this is Mississippi, among the most racially politically polarized states in the country, it shouldn’t be surprising that President Donald Trump won the county with 82.7% of the vote to Democrat Kamala Harris’ 16.6%—almost identical to the racial makeup.\n\nNow, thanks in part to the county’s votes, federal food-assistance programs have dried up, with zero chance of them being revived—and it could soon get worse for them. Nearly 18% of Mississippi residents are enrolled in Medicaid, a program currently on the GOP’s chopping block. Also in the crosshairs are subsidized school lunches for needy kids and food stamps. \n\nTrump and billionaire Elon Musk’s assault on assistance programs is in full swing, and it will harm America’s poor more than anyone—and Prentiss is a poor county in the poorest state in the union. \n\nBut I’m sure they’ll console themselves knowing that a handful of transgender women won’t be able to compete in college sports. They really stuck it to those coastal elites! \n\nSpeaking of coastal elites, not all of them are Democrats. \n\nTake Miami-based Ken Griffin, for example. The hedge-fund CEO of Citadel LLC is No. 33 in Forbes’ list of the world’s richest people, with a net worth of $44.3 billion as of Friday. Griffin, a major donor to the Republican Party, told The New York Times in December that he voted for Trump and wasn’t worried about tariffs:\n\nMr. Griffin downplayed one of the biggest concerns about Trumponomics—that tariffs could dent growth and accelerate inflation. He said it remained unclear whether Mr. Trump’s threats to slap tariffs on Mexico, Canada and China would materialize, adding that the talk of tariffs imposed by the United States was “small ball compared to the role that the world is looking to us for.” He said he didn’t see tariffs as the most important business issue.\n\nFast forward just a month and a half later:\n\n“Ken Griffin, founder of investment firm Citadel, warned Tuesday that President Donald Trump's tariff policies pose a serious risk to America's economic growth,” reported the Daily Mail, a tabloid based in the United Kingdom. “He said they may force other countries to find new trade alliances, as he criticized Trump's 'bombastic rhetoric.'”\n\n“The uncertainty and chaos created by the tariff dynamics between us and our allies is an impediment to growth,” he said at a conference. \n\nSuddenly, it seems Griffin sees tariffs as absolutely “the most important business issue.” \n\nBut don’t feel sorry for him, he still thinks Musk is wonderful and doing the right thing destroying our government. He’s a horrible person, and the best we can hope for is that Trump’s actions decimate his business. \n\nThis is from a now-deleted post on a subreddit for federal workers: \n\nA Betrayal of Sacrifice: A Veteran's Plea for Dignity\n\nThese past four weeks have been devastating.\n\nLast week, I sat in my car, waiting for my little girl to get out of school, and I cried. I served this country in Iraq, Afghanistan, and East Africa. When I came home, I struggled to make ends meet. No one was hiring a gunner. Eventually, I decided to use my GI Bill-not just for an education, but because I needed the extra cash. During that time, I earned my degree and landed a federal job. I was the first in my family to earn a degree and the first to work for the federal government.\n\nI loved my job. It was advertised as remote work, which made it possible for me to do my job well.\n\nGetting in and out of my car with a wheelchair is exhausting, and parking is always a hassle.\n\nWorking from home gave me some relief in a life that has been anything but easy.\n\nThen I saw the Return to Office Executive Order, and I knew it was going to get worse. I was right. The past few weeks have been nothing short of terrifying. I fear for my family. I fear for myself. I'd be lying if I said I hadn't had dark thoughts-thoughts I don't want to have. I was told I had to return to the office. I was told my reasonable accommodation would no longer be authorized. I feel betrayed-by this country, by this government. I gave everything, and now I feel like I have nothing left to give.\n\nThis, I pray.\n\nIn a subsequent post, the user noted that he was fired, a victim of Elon Musk’s purge. Heartbreaking, for sure. I take no joy in someone losing their job or the difficulties they suffer from a service-related disability. I was a soldier; my son is a soldier. I feel kindred spirits with all service members and veterans. I know the toll it can take on oneself and one’s family. \n\nBut in other posts, this guy also wrote: \n\nI love orange man now he defines a true American with his flaws and all as no one is perfect but it's not about being perfect it's about ones love of the country and doing your best to help your country first then focus on others instead of focusing on others and then your country\n\nIn another thread, when a user asked for gay-bar recommendations around the University of Maryland campus, he responded with a “ewwwwwww.” When called out on it by other users, he answered with “it’s an opinion don’t like it move to China.” \n\nIn yet another post, he wrote, “How did everyone celebrate the historic Gulf of America Day? It's rough out there but at least we got Gulf of America Day. How did you all celebrate this day, a day bugger [sic] than the Super bowl?”\n\nHe hates the foreigners and the gays and he voted for Trump to hurt those people. But Trump also hates wounded veterans, the disabled, and anyone working in the government. And you know what else? Being a disabled veteran made him a beneficiary of diversity, equity, and includes programs, or DEI. \n\nThis vet let his hatred of others blind him to how Trump wouldn’t hurt just them. And now his vote cost him and his family dearly. \n\nMaybe this guy is reachable, maybe not. Once challenged on his Trump support and posting history, he deleted both the post and his account. \n\nBut we don’t have to reach all of them. If we can swing 10% of Trump voters our way, that’s nearly 8 million voters. Heck, a 5% swing would make it hard for Republicans to keep the White House in 2028. \n\nIt’s a long way to go, and there’s plenty of time for people to become disillusioned and disenchanted.","summary":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\n\n\n \nToday, we shine spotlights on the most opposite spectrums of American society—one of the poorest countries in the country—Prentiss County, Mississippi—and billionaire Ken Griffin. And then we’ll end with a disabled veteran.\n\n\n\nLet’s start with Prentiss County. On their Facebook page, the county’s sheriff’s department announced, “Our Food giveaway is suspended until further notice. We have been notified by MidSouth Foodbank that funding has been suspended and we won’t receive any deliveries until otherwise notified.”\n\n\n\n\n\n\n\n\n\nThe letter attached to the Facebook post further clarified that the funding shortfall came, in part, from an end to COVID-19-era food assistance. Republicans have taken aim at such programs for the last ","url":"https://www.dailykos.com/stories/2025/2/15/2303742/-At-least-one-billionaire-sure-seems-to-regret-backing-Trump?pm_campaign=blog&pm_medium=rss&pm_source=Climate Hawks","image":"https://cdn.prod.dailykos.com/images/1364395/story_image/AP24306858861373.jpg?1730737845","video":null,"publish_date":"2025-02-15 21:04:00","author":"kos,Midsouth Foodbank","authors":["kos","Midsouth Foodbank"],"language":"en","category":"politics","source_country":"us","sentiment":-0.275},{"id":290900330,"title":"Cute video hides ‘fundamentally rotten’ truth","text":"In 1963, a nearly three-year-old John F. Kennedy Jnr was photographed monkeying around under the Resolute Desk in the Oval Office. \n\nAhh, the symbolism. Sweet innocence, the naivety of pure youth in the crucible of absolute power.\n\nThis week, when it happened again, there was some high-level nose picking.\n\nOn Wednesday, Elon Musk brought his four-year-old son X Æ A-Xii, who goes by Lil X, to the White House to give a press briefing about how he is totally not leading a less-than-covert government takeover. \n\nThroughout this, Lil X looked, by turns, bored, bewildered, on the cusp of a full-blown tanty and darn tootin’ ready for snack time. So did President Donald Trump, who was sitting inches away. Another Go-Gurt, Don-Don?\n\nIt’s the perfect image to sum up something fundamentally rotten about Trump 2.0: It’s the bro-pocalypse. The dude-mageddon is here. \n\nThis month it was revealed that when Mr Musk went to Washington in January, he did not go alone, taking with him a posse of young men ranging in ages from 19 to 25 – interns and engineers who are, with chilling velocity, dismantling the very foundations of US government while slopping sticky Monster energy drink into the gears of state and getting pizza grease all over the Constitution.\n\nIt might be Mr Trump who gets to doodle on the back of the nuclear codes when he is dead bored on the phone with the Secretary of the Treasury – yap, yap, yap about inflation – but it’s Elon Musk and his pack of boy wonders who have been given the highest level of clearance to gut US institutions.\n\nThe billionaire’s Department of Government Efficiency (DOGE), tasked by Mr Trump with slashing spending and gutting federal bureaucracies, has already begun decimating the US government - but let us consider just a couple of Mr Musk’s kidults in his sideways coup, the boyos who sound less like masterful Oz-ish winged monkeys and more like red-pillers in need of a decent Neutrogena face wash. \n\nDon’t think skilled political operatives, think a laser tag team who are really into pick-up artistry.\n\nThere is 19-year-old Edward Coristine who is known online, charmingly, as “Big Balls”.\n\nSwoony, no?\n\nOr Marko Elez, who only temporarily found himself unemployed after the Wall Street Journal linked the 25-year-old with a social media account that had posted such choice titbits as “I was racist before it was cool”. In September last year, the account also shared, “You could not pay me to marry outside of my ethnicity”. \n\nMr Elez briefly resigned, only for Mr Musk to come out swinging and say he would rehire him. (The posts have now been deleted).\n\nTurns out the road to hell is paved with high fives. (Or should that be, heil fives?)\n\nOr take Gavin Kliger. \n\nThis week, just before 1am on Monday, the Washington office employees of the United States Agency for International Development (USAid), the world’s biggest aid agency, were sent an email telling them to work from home that day. It was sent by Mr Kliger, 25 who until last month was, according to LinkedIn, a senior software engineer in San Francisco who had logged a stint as an intern at Twitter prior to Mr Musk’s takeover.\n\nAccording to Reuters, between October last year and last month, Mr Kliger reposted social media content from white supremacist Nick Fuentes, who has become known for the heinous aphorism, “Your body, my choice”, and from self-described misogynist Andrew Tate, who is being investigated by Romanian prosecutors for human trafficking and rape charges.\n\n(He denies any wrongdoing).\n\nMr Kliger, per Reuters, also used the term “huzz”, a highly offensive term for women, online.\n\nLadies, form an orderly queue now. And please BYO white hood.\n\nWhat that Lil X photo op, what the installation of these bro-tenants in the highest levels of Washington spell out, is that Trump 2.0 isn’t just about the execrable abuse of power for personal gain, but it’s about the surging of a poisonous, horrifyingly regressive masculinity.\n\nThe revolution will smell like Lynx Africa.\n\nAnd it goes beyond Mr Musk’s braggadocious bro-squad.\n\nWhen Mr Trump picked a running mate last year it was JD Vance, who used one of his first major interviews to take aim at “childless cat ladies”.\n\nWhen Mr Trump was inaugurated on January 20, the scene inside the US Capitol building was like a real life revenge of the billionaire-creatine-chugging nerds. Jeff Bezos, Mark Zuckerberg, Apple CEO Tim Cook, Google CEO Sundar Pichai, Google co-founder Sergey Brin, TikTok chief executive Shou Zi Chew, Sam Altman of OpenAI and Dara Khosrowshahi of Uber all got primo seats. \n\nThe geeks who could never get dates in high school had officially inherited the earth.\n\n(This is not just about political expediency or keeping the big boys in Washington sweet. In January, Zuckerberg, the formerly hoodie-clad boy genius, was a guest on Joe Rogan’s testosterone-oozing podcast and said, “Masculine energy, I think, is good”).\n\nAlso prominently featured at Mr Trump’s coronation last month – all that was missing were some Beckham-esque gold thrones borrowed from a Floridian prop rental firm – were YouTuber turned boxer Jake Paul and his brother Logan, who it turns out is a wrestler and, of course, an influencer too; mixed martial arts fighter Conor McGregor, who days earlier was accused in civil court of trying to rape a woman (McGregor denies the claim), and the Ultimate Fighting Championship chief executive Dana White.\n\nWhat this scene inside Washington’s Rotunda made explicitly clear was that this bulked up, corrosive brand of hyper masculinity is no longer just something that lives in the corners of the internet, a nesting ground for disenfranchised Lonely Boys, but has long since oozed into the political mainstream.\n\nMAGAland, in case it was not perfectly clear, and Trump Two: More Fast, More Furious, More Fake Tan, is all about men.\n\nEvery political pundit worth their New Yorker subscription has, since Kamala Harris’ loss last year, eagerly pointed out that it was the manosphere that got Mr Trump elected.\n\nConsider what was happening this time around in 2017. The 500,000 women who marched on Washington, the sea of pink pussycat hats, the Resistance always spelt with a capital ‘R’.\n\nFormer President Joe Biden named the most women ever to his cabinet; Mr Trump has four – out of 24.\n\nMr Musk taking Lil X to the White House wasn’t just about using his child as a prop to perhaps soften his image and to humanise him, but it was also deeply symbolic. \n\nThe Tesla founder has daughters too, but where were they? \n\nIt is Lil X and his brothers who will inherit the earth that Trumpism is trying to wreak.\n\nDaniela Elser is a writer, editor and a commentator with more than 15 years’ experience working with a number of Australia’s leading media titles","summary":"At first glance, it seemed like a sweet moment - “First Buddy” Elon Musk taking his young son to work. But it masked a twisted truth.","url":"https://www.news.com.au/world/north-america/us-politics/all-about-men-elon-musks-latest-white-house-video-reveals-trump-20s-bropocalypse/news-story/9836eb9ce2e0d8f11afe4165a8d6c933?from=rss-basic","image":"https://content.api.news/v3/images/bin/d885708f86c9b066e0d490addf31e141","video":null,"publish_date":"2025-02-15 20:37:55","author":"Daniela Elser","authors":["Daniela Elser"],"language":"en","source_country":"au","sentiment":-0.376},{"id":290901658,"title":"Anthony Mackie and Director Julius Onah Discuss the Desire to Bring Politics into the Marvel Movie “Captain America: Brave New World”","text":"SPOILERS: This post contains details about Captain America: Brave New World\n\nAlthough Captain America: Brave New World has hit theaters during a particularly divisive time for the United States, those behind the MCU sequel would ask fans not to read too much into it.\n\nDuring Tuesday’s world premiere in Hollywood, star Anthony Mackie and director Julius Onah spoke to Deadline about offering audiences an “escape” with the fourth Captain America film, which sees Mackie’s Sam Wilson achieve the “American Dream” in taking over the shield from Steve Rogers (Chris Evans).\n\n“I think the great thing about this movie is, Marvel gave us the best script with the best cast, with the best team, to make the best movie we could. And I’m proud of it,” said Mackie. “I’m proud of who Sam Wilson has become in this universe, and watching him grow from a guy who just went to take a jog to Captain America is honestly the American Dream.”\n\nOnah added, “This is the first big fat movie of 2025. Telling the story was about creating something that the audience can have a blast with across the world. We’ve got a guy flying around with Vibranium wings against a guy who’s the Red Hulk. This is meant to be two hours where you get to escape from everything else. So, I really wanted to have fun telling this story. I really wanted this story to have heart, and that’s really what I leaned into with this cast and crew.”\n\nIt’s hard not to find some cinematic parallels to the current state of politics in our country. After his past crimes are exposed, the president turns into a big red monster who ultimately destroys the White House before gracefully accepting his fate behind bars.\n\nDespite the unfortunate imagery, the movie was filmed in 2023, more than a year before President Donald Trump was elected for a second term.\n\nTaking over the role of President Thaddeus ‘Thunderbolt’ Ross (aka Red Hulk) from the late William Hurt, Harrison Ford refused to politicize the character after announcing his endorsement for Kamala Harris in November.\n\n“The other guy, he spent four years turning us against each other while embracing dictators and tyrants around the world,” said Ford at the time. “That’s not who we are. We don’t need to ‘make America great again.’ Come on, we are great. What we need is to work together again. What we need is a president who works for all of us again.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nSPOILERS: This post contains details about Captain America: Brave New World Although&#8230;\n\n\nThis Post: Anthony Mackie and Director Julius Onah Discuss the Desire to Bring Politics into the Marvel Movie &#8220;Captain America: Brave New World&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/anthony-mackie-and-director-julius-onah-discuss-the-desire-to-bring-politics-into-the-marvel-movie-captain-america-brave-new-world/","image":"https://internewscast.com/wp-content/uploads/2025/02/rewrite-this-title-Anthony-Mackie-amp-‘Captain-America-Brave-New.jpg","video":null,"publish_date":"2025-02-15 20:20:53","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.491},{"id":290899716,"title":"Trump and Musk connect with working-class voters because they 'understand the consumer,' Sen. Ruben Gallego says","text":"President Donald Trump and Tesla CEO Elon Musk have found a way to connect with working-class voters because they are \"engaged every day\" with them, Democratic Sen. Ruben Gallego of Arizona said in a recent New York Times interview.\"They actually understand the consumer,\" Gallego said. \"They are engaged every day, one way or the other, in trying to talk to the consumer, and in this case it's the voter.\"Gallego said the 2024 general election results \"proved\" the strength of Trump's appeal with the working-class voters Democrats have also sought to win over.When Gallego was asked why many voters concerned about the economy seemingly had little issue with an administration filled with the ultrawealthy, the Arizona lawmaker said personal wealth is aspirational for many voters.\"People that are working class, poor, don't necessarily look at the ultrarich as their competitors,\" he said. \"They want to be rich someday.\"He said those voters would give Trump, Musk, and their allies the benefit of the doubt until they were personally impacted by governmental actions.Gallego also predicted that Trump would face political backlash over the GOP's long-sought tax bill, which could include $4.5 trillion in tax cuts and potential spending reductions for programs like Medicaid and the Supplemental Nutrition Assistance Program.\"That's when you're going to see people saying, 'No, no, no, that's not what I want,'\" he said.Gallego has only been in the Senate for a few weeks, but he's no stranger to Washington. He served in the House for a decade, representing a Democratic-heavy district anchored in Phoenix.When Gallego jumped into his state's Senate race, it was unclear whether then-Independent Sen. Kyrsten Sinema would also run. This had the potential to create a three-way race, which could have made it easier for the GOP to win the seat. However, Sinema eventually declined a reelection bid, and Gallego faced Republican Kari Lake, a staunch Trump political ally.Gallego defeated Lake last November even as Trump flipped Arizona red in his victory over then-Vice President Kamala Harris in the key swing state.The first Latino to represent Arizona in the Senate, Gallego outpaced Harris with Latino voters and male voters. The lawmaker attributed his success to his work to engage with voters everywhere, especially as it related to their economic concerns.","summary":"Gallego told The New York Times that voters would give Trump and Musk the \"benefit of the doubt\" until certain decisions affect them.","url":"https://www.businessinsider.com/trump-musk-gallego-working-class-voters-appeal-2025-2","image":"https://i.insider.com/67b0eba7eb4be2fff9a4ccad?width=1200&format=jpeg","video":null,"publish_date":"2025-02-15 20:00:49","author":"John L. Dorman","authors":["John L. Dorman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.156},{"id":290893620,"title":"Sheryl Crow sells Tesla in protest of ‘President Musk,’ vows to donate cash to NPR","text":"If it makes her happy.\n\nSheryl Crow dramatically bid adieu to her black Tesla in protest of “President Musk.”\n\nThe Rock and Roll Hall of Famer took to Instagram Friday to reveal she had sold the electric car and is donating the money to NPR, which Musk has repeatedly called to defund as his Department of Government Efficiency looks to slash federal funding.\n\n“My parents always said… you are who you hang out with,” Crow, 63, wrote along with the viral clip.\n\n“There comes a time when you have to decide who you are willing to align with. So long Tesla.”\n\nCrow didn’t appear heartbroken about the separation — and even smiled as a tow truck drove away with the Tesla.\n\nSome of Crow’s followers weren’t thrilled with the stunt, calling her “elite” and accusing her of supporting “wasteful government spending.”\n\nThe “Soak Up the Sun” singer didn’t say how much she raked in by pawning off the Tesla — the least expensive of which start at $42,000 — but promised to give all the cash to NPR.\n\n“Money donated to @npr, which is under threat by President Musk, in hopes that the truth will continue to find its way to those willing to know the truth,” she continued, adding in a slew of hashtags, including #PresidentMusk, #PresidentTrump, and #ProtectTheConstitution.\n\nMusk renewed calls last week to strip NPR of all federal funding as DOGE makes cuts across numerous government agencies. The media organization receives about 1% of its funding from the federal government.\n\nThe Telsa CEO alleged that NPR has biased news coverage, a claim reiterated by Rep. Marjorie Taylor Greene (R-GA) on Monday upon announcing she would conduct a hearing to examine whether NPR and PBS ignored stories unfavorable to the Biden administration.\n\n“Defund NPR. It should survive on its own,” Musk wrote on X Tuesday.\n\nCrow has not shied away from voicing her disapproval of President Trump, his administration and his conservative policies.\n\nOn Election Day, she revealed she had cast her vote for Kamala Harris, saying she picked the candidate that represented “empathy, compassion, a heart for community and for those underserved, Not hate and division, bigotry, or racism.”","summary":"This seems to make her happy.","url":"https://nypost.com/2025/02/15/us-news/sheryl-crow-sells-tesla-in-protest-of-president-musk/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/98614165.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/bnKuJQUj-RyIcpnTz.mp4","publish_date":"2025-02-15 19:38:32","author":"Katherine Donlevy","authors":["Katherine Donlevy"],"language":"en","category":"politics","source_country":"us","sentiment":0.089},{"id":290894032,"title":"From Screen Legend to Oval Office Contender?  Robert De Niro’s Netflix role ignites talk of White House bid, will he take the plunge?","text":"Hollywood legend Robert De Niro is at the center of a political debate after his role as a former U.S. president in Netflix’s upcoming series Zero Day fueled speculation about his potential real-life bid for the Oval Office. The 81-year-old, known for his commanding screen presence, has been backed by co-star Jesse Plemons as someone with the ‘command and presence’ to lead the nation.Why is Robert De Niro being considered for the White House?De Niro portrays ex-president George Mullen in Zero Day, which premieres on February 20. In the series, his character is called back to investigate global cyberattacks. His co-star, Jesse Plemons—known for The Irishman, Killers of the Flower Moon, and Fargo—expressed confidence in De Niro’s leadership qualities. Speaking to The Times on February 14, Plemons said, “Command and presence, that’s built in (to De Niro).” When asked whether De Niro should run for office, Plemons acknowledged the difficulty of the job but supported the idea.Also Read : Speculations rife as U.S Air Force plane lands in Moscow; was it on a secret mission carrying high-ranking officials? Here's what reports are sayingHollywood stars and politics – A growing trend?While actors entering politics is rare, history shows it is not impossible. Ronald Reagan, a former Hollywood actor, served as the U.S. President from 1981 to 1989. Donald Trump, despite his real estate and television background, also had film cameos, including in Home Alone 2: Lost in New York and Zoolander.De Niro, however, has been an outspoken critic of Trump. He actively supported Joe Biden’s re-election campaign and has called Trump a “buffoon” and a potential “vicious dictator.” With Zero Day putting him back in the political spotlight, the idea of his candidacy, while speculative, has gained traction.Could Robert De Niro actually run for President?There is no official statement from De Niro regarding a political run. However, his strong political views and influence in Hollywood make him a prominent public figure in American politics. With Jesse Plemons backing him and his history of supporting Democratic candidates, discussions about his political future continue to circulate.Also Read : Donald Trump will not let Kamala Harris go away easily; if she plans to contest for California governor, this is what he has lined up for herFAQs:What is Zero Day about?It’s a Netflix series where De Niro plays an ex-president investigating cyberattacks.Has any actor become a U.S. president before?Yes, Ronald Reagan served as the U.S. president from 1981 to 1989.","summary":"Robert De Niro’s portrayal of a former U.S. president in Netflix’s Zero Day has ignited discussions about his potential political future. With his commanding presence and history of political activism, co-star Jesse Plemons believes De Niro has what it takes to lead the nation. The 81-year-old actor has been a vocal critic of Donald Trump and a supporter of Joe Biden.","url":"https://economictimes.indiatimes.com/news/international/us/from-screen-legend-to-oval-office-contender-robert-de-niros-netflix-role-ignites-talk-of-white-house-bid-will-he-take-the-plunge/articleshow/118284509.cms","image":"https://img.etimg.com/thumb/msid-118285113,resizemode-4,width-1200,height-900,imgsize-8774,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-15 19:31:23","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":0.166},{"id":290891868,"title":"From The Muppets to Wayne's World — SNL changed comedy over 50 years","text":"For the past half-century, US sketch show Saturday Night Live has defied the odds, delivering weekly live shows and lifting up some of the most famous comedy creators in history.\n\nThis Sunday, the show will celebrate its 50th anniversary with a big blow-out party set to feature former \"Not Ready For Primetime Players\" from across the decades.\n\nIt's almost impossible to honour a full five decades of one show, and each devoted viewer will have their own favourite moments. But, as massive comedy nerds, we thought we'd look back at the sketches that have stayed with us as fans, and the moments that influenced comedy and culture worldwide.\n\nBefore anyone says \"won't someone think of the musical guests?\" Yes, the 50 years of SNL has been littered with groundbreaking performances, from Sinead O'Connor ripping up a picture of Pope John Paul II (and receiving a lifetime ban), or Ashlee Simpson tanking her own career.\n\nBut for today, it's all about the comedy.\n\nThe Muppets — 1975\n\nI was somewhat surprised to discover childhood fave The Muppets were once foul-mouthed characters on Saturday Night Live.\n\nAfter creating a series of delightful fuzzy characters for Sesame Street, Jim Henson was determined not to be pigeonholed as just a children's entertainer. So he came up with something a little more… grown-up.\n\nThe Land of Gorch was a series of sketches across the very first season of SNL, in 1975. It followed the lives of a Muppet royal family in a faraway land but, in keeping with the late-night vibes, they were foul-mouthed and made frequent references to drugs and alcohol.\n\nThe segment was a notorious flop. As well as audience skepticism about puppet humour, Writers Guild of America rules meant only SNL staff writers could contribute to scripts. This meant Henson wasn't able to execute his vision, and also bred resentment among the staff who didn't want to \"write for felt\".\n\nThe Land of Gorch didn't live past the first season, but it provided inspiration and momentum for The Muppet Show, which was picked up in 1976 and introduced the world to Miss Piggy and Kermit.\n\n— Katherine Smyrk\n\nEddie Murphy's Celebrity Hot Tub Party — 1983\n\nBeloved actor and comedian Eddie Murphy is often credited with saving SNL during a rough ratings patch that followed the brief departure of creator Lorne Michaels in the early 1980s (he returned in 1985).\n\nGetting his start on the program at just 19 years old, Murphy's highlights include the light-fingered Mr Robinson — his twist on the beloved children’s TV host Mr Rogers — and his mockumentary-style video sketch Mr White, where he dressed up in whiteface and playfully explored white privilege.\n\nBut he's perhaps most remembered for impersonating comedy legend James Brown.\n\nSeason 9, in 1983, featured a sketch called Celebrity Hot Tub Party, where Murphy gives his all in an energetic impression of the iconic 60s musician and dancer, stripping right down to his golden speedos.\n\nMurphy's recurring impression of the singer was so uncanny that Brown even suggested he should play him in a biopic.\n\n— Rachel Rasker\n\nWayne's World — 1989\n\nIn my family, the first Wayne's World movie is a sacred text. We couldn't tell you any lines from an actual sacred text like The Bible, but we can recite Wayne's gun rack quote like scripture. Ahem…\n\n\"A gun rack. I don't even own a gun, let alone many guns that would necessitate an entire rack. What am I gonna do with a gun rack?\" Amen.\n\nLike the Blues Brothers before it, the origins of Garth and Wayne go all the way back to Studio 8H, when they debuted on SNL's 14th season in 1989. The bones of the movie are there: two hip SoCal stoner types have a lo-fi public access show. In their debut sketch they interview a local business owner who turns out to be Garth's dad. Party on.\n\nThe idea of extrapolating an entire low-budget comedy film from a series of six-minute sketches feels like a relic of a bygone era, but Lorne Michaels and co did it twice with a 50/50 hit rate. Not bad. Most excellent.\n\n— James Brennan\n\nThe Chanukah Song — 1994\n\nOne of the great things about SNL is looking back at the many, many, MANY stars that got their first leg-up in studio 8H.\n\nAnd one of those rising stars (for better or worse) was Adam Sandler, who was an official featured player in his early 20s. While his impressions were nothing to write home about, he really excelled behind the weekend update desk, first as the dramatic Opera Man and then with his iconic 1994 performance of 'The Chanukah Song'.\n\nI was born a year after Sandler first performed this on SNL, so my first introduction to it was through my Dad's crackly car speakers as Sandler rattled off the names of people who I did not know who also happened to be Jewish. But the tune and Sandler's playful delivery had me so hooked I still frequently revisit the song to this day (I know most of the name-checked people now, not to brag).\n\nSure, he might have created some of the worst comedy films around but, thanks to SNL, we can always revisit a brighter time when Adam Sandler was young, upcoming and, yeah, I'm gonna say it, hot.\n\n— Velvet Winter\n\nMore Cowbell — (2000)\n\nEven with a revered acting career that spans more than seven decades, Christopher Walken has said on many occasions that no performance of his has followed him around more than the SNL Cowbell sketch.\n\nOn Late Night with Conan O'Brien in 2020 he recalled being at a restaurant in Singapore when a couple called out to him \"I think my salad needs more cowbell!\"\n\nThe sketch, written by Will Ferrell, sees Walken play fictional 70s music producer Bruce Dickinson, who has been called upon to record hit song '(Don't Fear) The Reaper' by (real) rock band Blue Oyster Cult. Ferrell plays Gene, the band's overzealous cowbell player (also fictional), who disrupts the recording several times.\n\nBut what truly makes the sketch is Walken's brilliant delivery of iconic lines, such as the immortal \"I've got a fever. And the only prescription is more cowbell!\" Ferrell really steers things off the rails, causing the cast (most notably Jimmy Fallon) to break character and laugh several times.\n\nYou can watch this sketch over and over and it'll never stop being funny. And it will never stop haunting poor Christopher Walken.\n\nGotta have more cowbell, baby!\n\n— Christian Harimanow\n\nPoliticians in SNL — 2000-present\n\nImpersonating political figures of the day is very standard and important fare for any comedy show worth their salt, and SNL has embraced it wholeheartedly over the years.\n\nWill Ferrell's impersonation of George W Bush in 2000 had the former US President convinced he had actually said the word \"strategery\" while debating with Al Gore.\n\nWe've had Fred Armisen as Barack Obama and Larry David as Bernie Sanders. Maya Rudolph perfectly embodied Kamala Harris, with Andy Samberg at her side as a simpering Doug.\n\nTina Fey's impersonation of Alaskan senator and 2008 vice-presidential candidate Sarah Palin won the actor and comedian a Primetime Emmy (Amy Poehler as an enraged Hillary Clinton is also worthy imo).\n\nKate McKinnon — who was also the first out lesbian in the SNL cast — is a particular master at transforming herself. The MVP of the Barbie film is not only an effortless Elizabeth Warren, she has also morphed into former attorney-general Jeff Sessions and, most hysterically, Rudy Giuliani.\n\nA special shout-out must go to Melissa McCarthy as Trump's former White House press secretary, Sean Spicer, and Sarah Saltman as former congressman and alleged statutory rapist Matt Gaetz — both of these jump-scares still haunt my dreams.\n\n— Katherine Smyrk\n\nThe Lonely Island — 2005\n\nFrom Dick in a Box to Jizz In My Pants and I'm On A Boat, the music of comedy troupe The Lonely Island (SNL cast member Andy Samberg and writers Jorma Taccone and Akiva Schaffer) was on the lips of every young person in the late 2000s/early 2010s.\n\nBut beyond giving teens grotty things to yell out in class, did you know that The Lonely Island changed the internet forever with their second digital short?\n\nBack in 2005, The Lonely Island boys wrote and performed a skit called Lazy Sunday, which featured Samberg and SNL cast mate Chris Parnell rapping about their perfect Sabbath day, including cupcakes and catching a screening of The Chronicles of Narnia.\n\nThe sketch just happened to debut on broadcast TV the same week a brand new video-sharing website was launched: YouTube, maybe you've heard of it?\n\nSNL fans jumped on the clip, uploading multiple unofficial versions that clocked a cumulative 5 million views in just a few days, making it one of the very first examples of a viral video.\n\nSo, next time you're enjoying a Vine or cute cat compilation. throw some thanks to the three boys and multiple internet pirates that made it possible.\n\n— Velvet Winter\n\nStefon on Weekend Update — 2010\n\nOn Saturday Night Live, there are three constants: a celebrity host, a musical guest and Weekend Update. The latter is extremely fertile ground for oddball freaks to look down the barrel of the camera and flourish. Enter Stefon, created by Bill Hader and then writing partner John Mulaney.\n\nStefon is the type of character that could only really find its footing in the pressure cooker environment of a weekly live sketch show. Having originally appeared in a failed sketch alongside Ben Affleck in 2008, the weirdo \"club kid\" was then plonked on Update two years later as a way to fill time.\n\nStefon segments go as follows: Weekend Update host Seth Meyers brings him out to introduce \"family-friendly\" events for tourists in New York. Stefon then describes completely absurd and hedonistic watering holes that would probably make tourists either cry or puke.\n\nBut there's a meta element in every Stefon sketch that takes the segment from good to classic. Between dress rehearsal and air, then staff writer Mulaney would swap out lines with new jokes that Hader hadn't seen. Hader has described himself as a \"light touch\" when it comes to breaking live on air, and Mulaney knew exactly how to push his buttons in the best ways possible.\n\n— James Brennan\n\nLiza Minnelli Tries to Turn Off a Lamp — 2012\n\nKristen Wiig is among SNL's all-time best physical comedians, with an elasticity that lets her scrunch her face and body to suit any impersonation or original oddball. Her Liza Minnelli — a broad brushstroke that's all jittery energy, slurred words and absurd poses, but clearly made with love for Liza — is a perfect show of her talents.\n\nIn this sketch, Liza and a friend are off to a Broadway production of Cats — but first, Liza has to turn off a lamp at her apartment. Cue the jazz drums, as Wiig slinks around trying various dance moves to turn it off while offering nonsensical one-liners punctuated by sharp horns and jazz hands.\n\nHost Jonah Hill plays a perfect straight man to Wiig, suggesting Minnelli's absurd behaviour is part and parcel of being her friend. He's never irritated as he repeatedly, across the four minutes, suggests she simply find the switch.\n\nWarning: Once you watch this, there's a high chance that \"Will a Fosse neck do it?\" will enter your regular lexicon.\n\n– Jared Richards\n\nThe arrival of Sarah Sherman — 2021\n\nEvery now and then, a new player lands on the show and immediately enriches it with a fresh brand of unhinged comedy. The most recent example of this is Sarah Sherman, who was performing under the moniker Sarah Squirm before landing SNL.\n\nAs her stage name would suggest, this lady is the ruler of gross-out humour. Her on-air sketches have included sentient, singing meatballs that grow out of her skin, an impromptu infomercial for the \"Glamgina\" make-up kit at a gynaecology check-up, and a business meeting where she reveals she has replaced her eyes with plastic googly ones.\n\nMuch like Hader's Stefon, Sherman shines brightest when she's brought to the Weekend Update desk to unleash chaos on the unsuspecting host. Her first Update feature had her laying verbal traps for Colin Jost in an attempt to \"gotcha\" him with unflattering headlines. These poked fun at his Hamptons home, his famous wife and overall \"white Harvard guy\" vibe.\n\nThis angle has pretty much become a staple of Colin Jost's stint as Weekend Update host, with writers and other cast members expanding the premise to hilarious heights.\n\n— James Brennan","summary":"For the past half-century, US sketch show Saturday Night Live has defied the odds, delivering weekly live shows and lifting up some of the most famous comedy creators in history.","url":"https://www.abc.net.au/news/2025-02-16/saturday-night-live-turns-50/104937364","image":"https://live-production.wcms.abc-cdn.net.au/7b81786356c09f4ff7b16baf99f1cd34?impolicy=wcms_crop_resize&cropH=692&cropW=1230&xPos=0&yPos=66&width=862&height=485","video":null,"publish_date":"2025-02-15 19:25:48","author":"Jared Richards","authors":["Jared Richards"],"language":"en","source_country":"AU","sentiment":0.567},{"id":290890478,"title":"What would a Harris-Walz administration be doing right now?","text":"“With this mandate, I’m here to ensure the hopes, dreams, and aspirations of the American people!” the president-elect ensured during her victory speech. \n\nFULL LIST OF EXECUTIVE ORDERS, ACTIONS, AND PROCLAMATIONS TRUMP HAS MADE AS PRESIDENT\n\nFor many pundits and pollsters, this hypothetical was a very real possibility going into Election Day. Forecasters from Nate Silver to Larry Sabato to FiveThirtyEight, and pundits from Bill Kristol to James Carville to Joe Scarborough all had Harris winning. \n\nIn the end, 48.4% of America actually did vote for Harris, while Trump clinched the race by less than two points in Pennsylvania, about 1.6 points in Michigan, and less than one point in Wisconsin. It was that close, just as it was in 2016 and 2020. \n\nOne can’t help wondering what the world would look like heading into President’s Day Weekend 2025 if the former vice president and her goofy running mate, Tim Walz, were actually elected. \n\nHere’s a glimpse into this alternate reality. \n\nJanuary 20, 2025: After being sworn in, President Harris signs several executive orders, including one giving transgender athletes the right to dominate, er, compete against biological women in sports. She also signs one that declared Twitter/X would now be monitored under the government’s new “Hate Speech Task Force” in an effort to thwart white nationalism and misinformation. \n\nAs for her Cabinet, Kamala declares that the Senate, “must put Democracy over party” and confirm all her nominees to “ensure the smooth transition of government.”\n\nHer team includes: \n\nChief of Staff: Alex Soros\n\nSecretary of State: Susan Rice \n\nDefense Secretary: Liz Cheney \n\nPress Secretary: Don Lemon \n\nAttorney General: Letitia James \n\nFEMA Director: Gavin Newsom \n\nDHS Secretary: Beto O’Rourke \n\nLabor Secretary: Bernie Sanders \n\nTreasury Secretary: Elizabeth Warren \n\nVeterans Affairs: Richard Blumenthal \n\nHealth and Human Services (HHS) Director: Dr. Anthony Fauci\n\nSecretary of Education: Randi Weingarten\n\nDirector of National Intelligence: Adam Kinzinger\n\nHate Speech Task Force Czar: Alexandria Ocasio-Cortez \n\nFor the first three weeks of the Harris presidency, the goal, despite running as the change candidate, is to continue as much of the Biden agenda as possible. Status quo and “play it safe” is the unwritten mantra. \n\nAid to Ukraine continues to go unabated and without any accountability on how exactly the money was being spent. \n\n“We must continue to do whatever it takes to keep the fight against Russian aggression going, unburdened by what has been,” Harris declares in pre-written remarks before hurrying from the podium without taking questions from reporters. \n\nIn fact, Kamala’s handlers advise her not to do a press conference or take any questions outside of controlled environments in any capacity. \n\n“Why President Harris Doesn’t Have to Take Questions From the Press,” is the “news analysis” piece that runs on the front page of the New York Times on Groundhog Day 2025, ironically. \n\nIn Gaza, Hamas continues to hold all hostages. \n\nOn the U.S. Southern Border, illegal migrants begin pouring into the country after Harris signs an Executive Order lifting Joe Biden’s order from June 2024 that limited asylum eligibility. \n\n“The Statue of Liberty has always been a beacon of hope to the world for people to send their people to this country,” deputy White House press secretary Jim Acosta explains. It isn’t clear exactly what the legal immigration process has to do with the illegal variety, but that’s what the White House goes with, driving Sunny Hostin to tears on The View. \n\nMeanwhile, violent gangs of illegals from Central and South America continue to expand their caliphate from New York to Chicago to Aurora, Colorado. “Just a few apartment complexes,” in the infamous words of ABC’s Martha Raddatz, become block after block, all while exhausted police forces with shrinking budgets (due to perpetually housing and feeding illegals in their cities). \n\nOn the economic front, one of President Harris’s big campaign promises is kept after she signs an Executive Order to end “price gouging” at grocery stores. Of course, the average profit margin at almost every grocery store is less than two percent, and sure … this gambit has failed miserably from everywhere from Cuba to Venezuela to the old Soviet Union, but thanks to the urging of Elizabeth Warren and Bernie Sanders, it becomes a reality. \n\nSeveral months later, however, an actual price gouging bill fails to even make it to the floor of the House, with several Democrats and multiple Republicans opposing it. This becomes a common theme throughout President Harris’s first term. \n\nEfforts to expand the U.S. to 52 states by adding DC and Puerto Rico as U.S. states fail.\n\nA plan to tax unrealized capital gains also gets shot down, with the effort led by a rogue Nancy Pelosi. \n\nOther lowlights include:\n\nFormer President Trump is sentenced in his so-called hush money case in New York and sent to a minimum-security prison, making the country even more hopelessly divided. \n\nGovernment waste and corruption continue to go not only unabated, but actually expand.\n\nAmerica is declared a “sanctuary country.” \n\nEV mandates become federalized. \n\nVoting laws are federalized. The 2028 presidential election isn’t called until after Christmas as a result. \n\nCRT is federally mandated to be taught in public schools, per Education Secretary Randi Weingarten. \n\nBiological men posing as women post topless videos on social media during an LGBTQ+ Pride party on the South Lawn of the White House. (Wait, that already happened under Biden-Harris). \n\nAnd at Vice President Walz’s direction, both tampons and condom machines are made available in all schools in girls’ and boys’ bathrooms across the U.S.\n\nThankfully, in the name of common sense, this alternate universe never left the fiction aisle. \n\nDonald Trump won for two reasons: (1) Most of his policy positions are all in lockstep with what the majority of the American people want, namely on taxes, spending, cutting government waste, crime, immigration and foreign policy. Trump also had a track record that made enough voters believe his campaign promises would come to fruition (and thus far, they are); and (2) Kamala Harris simply came across as an inauthentic person who would say just about anything to get elected and therefore wasn’t believable. \n\nA Harris presidency would have also posed the same question that dogged the Biden presidency: Who exactly is running the country? Is it Obama? Ron Klain? Susan Rice? The Soros family? Or someone we aren’t even considering?\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nLooking ahead, polls show she’s the front-runner to be the Democratic nominee in an attempt to become the nation’s 48th president. \n\nIf you’re a Republican, that’s a non-fictional scenario absolutely worth rooting for.","summary":"The final swing state had come in for Kamala Harris in the early morning of Nov. 6. With Pennsylvania’s 19 electoral votes, along with victories in Michigan and Wisconsin, the country&#8217;s first female president-elect pulled off an improbable victory over Donald Trump, winning the Electoral College 271-267.  “With this mandate, I’m here to ensure the [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3320673/what-would-a-harris-walz-administration-be-doing-right-now/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/harris-walz-republicans-scaled.webp","video":null,"publish_date":"2025-02-15 19:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","source_country":"US","sentiment":-0.116},{"id":290894028,"title":"Speculations rife as U.S Air Force plane lands in Moscow; was it on a secret mission carrying high-ranking officials? Here's what reports are saying","text":"A U.S. Air Force aircraft landing in Moscow has stirred intense speculation, with many questioning whether it was part of a secret diplomatic mission. The unexpected arrival comes amid ongoing discussions between Washington and Moscow on key global issues, including the Ukraine war.Why did the U.S. Air Force plane land in Moscow?The aircraft in question, a Gulfstream C-37B with tail number 09-0525, landed at Moscow's Vnukovo Airport at approximately 10:50 PM local time on February 13. Flight data from Flightradar24 showed that the plane took off from a U.S. Department of Defense facility in Camp Springs, Maryland, made a brief stop in Rotterdam, and then proceeded to Moscow. The plane remained on the ground for less than an hour before departing for Warsaw, Poland.This aircraft model is typically used for transporting high-ranking officials and conducting sensitive missions. However, no official statement has been released regarding the passengers on board or the purpose of the visit.Also Read : Donald Trump will not let Kamala Harris go away easily; if she plans to contest for California governor, this is what he has lined up for herWhat are the possible reasons behind this visit?Several theories have emerged regarding the motive behind this flight:Diplomatic Negotiations – Some analysts believe the flight could be linked to high-level discussions between the U.S. and Russia on diplomatic or security matters.Prisoner Swap Talks – Similar high-profile visits in the past have been associated with negotiations for the release of American or Russian prisoners.Ukraine War Discussions – Given the ongoing conflict in Ukraine, this visit could be a step toward negotiations on peace talks or other security concerns.Preparations for Future U.S.-Russia Engagements – The timing of the flight aligns with recent diplomatic developments between President Vladimir Putin and former U.S. President Donald Trump.Putin’s invitation to Trump raises further questionsThis event coincides with Russian President Vladimir Putin extending an invitation to Donald Trump to attend Russia’s Victory Day celebrations. This follows a phone call between the two leaders on January 12, during which they reportedly discussed Ukraine, energy, artificial intelligence, and global economic matters.Russian Presidential Press Secretary Dmitry Peskov commented, stating, If large countries want to share the victory celebration with Russia, they will be welcomed in Moscow, this also applies to Trump. However, there has been no official confirmation from Trump regarding his attendance.Also Read: Is Cristiano Ronaldo joining Manchester United for a shock third stint? His private jet was spotted at the airport as fans speculate on social mediaThe sighting of a U.S. military aircraft in Moscow has fueled widespread discussions on social media, with thousands tracking its journey online. Despite the heightened interest, both Washington and Moscow have remained silent on the details of the visit.FAQs:Why did the U.S. Air Force plane land in Moscow?It is unclear, but possible reasons include diplomatic talks, prisoner swaps, or discussions on Ukraine.What did Putin and Trump discuss in their phone call?They talked about Ukraine, energy, artificial intelligence, and global economic matters.","summary":"US Air Force plane lands in Moscow, creating buzz over a possible secret diplomatic mission. The Gulfstream C-37B aircraft, tracked online, landed at Vnukovo Airport for less than an hour before leaving for Warsaw. This comes just after Russian President Vladimir Putin invited Donald Trump for Victory Day celebrations.","url":"https://economictimes.indiatimes.com/news/international/us/speculations-rife-as-u-s-air-force-plane-lands-in-moscow-was-it-on-a-secret-mission-carrying-high-ranking-officials-heres-what-reports-are-saying/articleshow/118284362.cms","image":"https://img.etimg.com/thumb/msid-118284421,resizemode-4,width-1200,height-900,imgsize-131286,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-15 18:57:32","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":-0.02},{"id":290885184,"title":"Donald Trump will not let Kamala Harris go away easily; if she plans to contest for California governor, this is what he has lined up for her","text":"Donald Trump is not ready to let Kamala Harris regain political ground without a fight. If Harris decides to run for California governor in 2026, Trump is reportedly preparing a counter-strategy, setting the stage for another political battle between them.Kamala Harris’ potential return to California politicsAfter losing the 2024 presidential election to Trump, Kamala Harris has moved back to California. With Governor Gavin Newsom being term-limited in 2026, speculation is growing about her possible candidacy. According to internal polling reported by The Hollywood Reporter (THR), Harris would be the frontrunner in a California governor's race. Despite her national defeat, she remains widely popular in the state.Other contenders are also eyeing the race. Billionaire Rick Caruso, who lost the 2022 Los Angeles mayoral election to Karen Bass despite spending $104 million of his own funds, is seen as a potential challenger. However, political experts suggest that Harris would have a significant advantage due to her strong name recognition and past electoral success in California.Also Read: Is Cristiano Ronaldo joining Manchester United for a shock third stint? His private jet was spotted at the airport as fans speculate on social mediaTrump's strategy to stop HarrisRichard Grenell, a key Trump ally and former acting Director of National Intelligence, is expected to play a crucial role in countering Harris if she runs. Grenell has experience in California politics, having worked as a spokesman for former San Diego Mayor Susan Golding and advising local campaigns. His connections could help the Republican Party put up a strong fight.The political landscape in California has also shifted slightly. The handling of the Los Angeles wildfires in January has hurt the reputation of state Democrats, including Mayor Karen Bass. This has opened the door for challengers like Caruso and other Trump-backed candidates to gain traction.Kamala Harris’ 2028 Presidential prospectsWhile Harris has not officially announced her candidacy for governor, Democratic insiders expect her to run for president again in 2028. A January poll from McLaughlin & Associates showed Harris leading the Democratic primary race with 33%, ahead of Transportation Secretary Pete Buttigieg at 9% and Governor Gavin Newsom at 7%.If Harris wins the California governorship, it could strengthen her position for a 2028 presidential run, following a path similar to Richard Nixon. Nixon lost the 1960 presidential election to John F. Kennedy but later ran for governor of California in 1962 before successfully winning the presidency in 1968.Will Kamala Harris run for California Governor?Despite her strong polling numbers, Harris faces a difficult decision. Running for governor could be seen as a political step backward after serving as vice president. However, it could also provide a platform for her to rebuild support for a future presidential run.Also Read : Donald Trump credits Elon Musk with tens of billions in savings, but DOGE’s social media has other ideas; here's the breakdownFor now, Harris and her husband, Doug Emhoff, have been active in California, visiting firefighters and assisting wildfire evacuees after leaving the vice presidency in January. As 2026 approaches, all eyes will be on her next move—and how Trump’s camp will respond.FAQs:Will Kamala Harris run for California governor in 2026?She hasn’t announced yet, but she is seen as the top contender.What is Donald Trump’s plan against Kamala Harris?Trump may back a strong Republican challenger, possibly Richard Grenell.","summary":"Donald Trump is preparing to challenge Kamala Harris if she runs for California governor in 2026. With Governor Gavin Newsom term-limited, Harris is the frontrunner, backed by strong name recognition. However, Trump’s close ally Richard Grenell is expected to lead a counter-strategy, making it a high-stakes political battle. Billionaire Rick Caruso is also considering entering the race, while recent issues like California’s wildfire mismanagement have weakened state Democrats.","url":"https://economictimes.indiatimes.com/news/international/us/donald-trump-will-not-let-kamala-harris-go-away-easily-if-she-plans-to-contest-for-california-governor-this-is-what-he-has-lined-up-for-her/articleshow/118281895.cms","image":"https://img.etimg.com/thumb/msid-118284226,resizemode-4,width-1200,height-900,imgsize-128526,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-15 18:20:48","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":0.138},{"id":290882716,"title":"Paramount Settlement With Trump Would Set ‘Dangerous Precedent,’ But Likely Wouldn’t Draw Bribery Charge, Experts Say","text":"Most legal observers regard President Trump’s lawsuit over the editing of a “60 Minutes” interview with Kamala Harris as frivolous. Nevertheless, parent company Paramount Global has been angling to settle the case, given that the administration has the power to stall or block its merger with Skydance. Doing so would likely generate backlash from CBS […]","summary":"Most legal observers regard President Trump&#8217;s lawsuit over the editing of a &#8220;60 Minutes&#8221; interview with Kamala Harris as frivolous. Nevertheless, parent company Paramount Global has been angling to settle the case, given that the administration has the power to stall or block its merger with Skydance. Doing so would likely generate backlash from CBS [&#8230;]","url":"https://variety.com/2025/tv/news/paramount-trump-cbs-settlement-shari-redstone-experts-1236307036/","image":"https://variety.com/wp-content/uploads/2024/06/Shari-Redstone-Paramount.jpg","video":null,"publish_date":"2025-02-15 18:17:37","author":"Gene Maddaus,Gmaddaus","authors":["Gene Maddaus","Gmaddaus"],"language":"en","category":"politics","source_country":"us","sentiment":-0.076},{"id":290872050,"title":"RFK Jr.'s School Lunch Plans Spark Michelle Obama Comparisons","text":"Robert F. Kennedy Jr.'s plans to make school lunches healthier has been compared to former first lady Michelle Obama's initiative to combat childhood obesity.The newly confirmed Health and Human Services (HHS) secretary's \"Make America Healthy Again\" (MAHA) movement was likened to the former first lady's \"Let's Move\" initiative, which drew criticism from some conservatives at the time, with \"Michelle Obama\" trending on X on Friday.Newsweek has contacted the U.S. Department of Health via email for comment.Why It MattersDespite pushback from critics, RFK Jr. has been confirmed by the Senate and will lead the newly established Make America Healthy Again Commission.Its focus will be on reversing chronic disease, which will include working with farmers and expanding health care and treatment options \"for beneficial lifestyle changes and disease prevention.\"What To KnowRFK Jr. spoke to Fox News host Laura Ingraham on Thursday about his priorities as health secretary when he said: \"We want to do a number of things but not take away choice from people. The one place that I would say that we need to really change policies is the snap program and food stamps and in school lunches - because there the federal government is, in many cases, paying for it and we shouldn't be subsidizing people to eat poison.\"This snippet of the interview has been shared multiple times on X, formerly Twitter, with some people, often supporters of the Democratic Party, referencing Obama's campaign and the criticism it attracted.These people include CNN's chief media correspondent Dr. Sanjay Gupta, who said Thursday that the MAHA movement \"frankly had a lot of echoes of what we've heard in the past from the Let's Move campaign, from Michelle Obama, for example, but that had broad support - trying to make people healthier.\"\"We spend a lot of money on healthcare, we don't see enough in return for those dollars,\" he added.Progressive writer and commentator Matthew Sheffield wrote on X on Friday: \"Republicans hated Michelle Obama for improving school lunches as the 'nanny state.'\"Former Minnesota GOP Representative Michele Bachmann accused Obama of trying to implement a \"nanny state\" in 2011, after a push to get mothers to breastfeed their babies as part of her campaign. Bachmann told The Laura Ingraham Show at the time: \"For them, government is the answer to every problem.\"In 2010, the year that the \"Let's Move\" campaign was launched, conservative media personality Glenn Beck responded to Obama's appeal to the National Restaurant Association to \"create healthier versions of the foods that we all love\" and offer \"healthy sides\" so that fries are \"something customers have to request.\"\"Get your damn hands off my fries, lady. If I want to be a fat, fat, fatty and shovel French fries all day long, that is my choice...,\" he said.Ingraham put this issue to RFK Jr. this week when he spoke about reducing the number of legal additives in the U.S., asking: \"Is that not a nanny state? I'm saying what the critics are going to say—that RFK Jr. is just a new Bloomberg nanny state...President Trump likes Big Macs—we're not going to take those away are we?\"\"That's what I'm saying. If you wanna eat a Big Mac, you ought to, but McDonald's ought to be incentivized to use beef tallow fat when it's cooking its Big Macs so that they're good for people, rather than using seed oils or some other cooking oils that are actually gonna probably make you sicker,\" the HHS secretary responded.Meanwhile, Democratic strategist and former senior adviser to Kamala Harris, Mike Nellis, shared an X post from former Republican presidential candidate Vivek Ramaswamy, which said: \"Bring back the presidential fitness test in schools. Serve healthier food in the cafeteria & start physical education earlier in school. The best way to save on health costs in the long run is to create a healthier population in the first place.\"Nellis captioned the post: \"Yeah, no s***—Michelle Obama tried to do this and Republicans called her a radical communist.\"What People Are SayingRobert F. Kennedy Jr. told Fox News on Thursday: \"I believe in freedom of choice. If you wanna eat Twinkies, you ought to be able to eat 'em, but you ought to know what's in them. So, a lot of what I'm gonna do is about radical transparency.He added: \"About making people understand - allowing people to understand and empower them with understanding that if you eat that, it may seem cheap, but it's gonna cost you in the long run.\"What Happens NextAfter President Donald Trump used an executive order to set up the Make America Healthy Again Commission on February 13, RFK Jr. will now be tasked with trying to prolong the life expectancy of Americans.One of the areas of focus will be children, with a portion of the order saying that \"an estimated 30 million children (40.7 percent) had at least one health condition, such as allergies, asthma, or an autoimmune disease.\"","summary":"\"Republicans hated Michelle Obama for improving school lunches as the 'nanny state,'\" one commentator said.","url":"https://www.newsweek.com/rfk-jr-school-lunches-michele-obama-2031209","image":"https://d.newsweek.com/en/full/2588623/rfk-jr.jpg","video":null,"publish_date":"2025-02-15 18:07:08","author":"Jordan King","authors":["Jordan King"],"language":"en","source_country":"US","sentiment":0.025},{"id":290862400,"title":"DAVID MARCUS: At 50, SNL should drop the woke, get back to the joke","text":"\"Saturday Night Live\" and I have something in common. We are both, somehow, now 50 years old. On Sunday night, the Not Ready For Prime Time Players are throwing a birthday party (for the show, sadly not for me), live from New York. With five decades of circling the sun comes the desire to reflect upon the past, what worked and what didn’t. For SNL, and late night comedy TV writ large, what absolutely has not worked is their relatively recent, hackneyed obsequience to wokeness. JOE PISCOPO ADMITS TRUMP SUPPORT WAS ‘THE NAIL IN MY COFFIN IN HOLLYWOOD’ The problem began around the turn of the century when the flexible social strictures of political correctness were metastasizing into the cold hard rules of wokeness. Put another way, the age of \"That’s not funny,\" was ushered in. What this meant for SNL, as well as \"The Tonight Show\" and others was a kind of self-censorship that is completely anathema to comedy as well as the bizarre notion that the primary goal of a joke is not to provoke laughter, but to make society better, or something. In the case of SNL, not only has the show censored itself in the 21st Century, it has censored its own past. The best example of this is that NBC Universal has banned video of a classic skit from 1977 featuring original black cast member Garret Morris and the lighter-skinned black activist and guest host Julian Bond. In the bit, Bond plays himself on a talk show talking about how IQ tests are racially biased. Asked for an example of a biased question, Bond says, \"Question one: You have been invited over for cocktails by the officer of your trust fund. Cocktails begin at 4:30, but you must make an appearance at a 6 o'clock formal dinner at the Yacht Club. What do you do about dress?\" The whole thing is hilarious, but the reason it has been scrubbed from existence is the final punchline, in which Morris asks where the idea of black intellectual inferiority comes from, and Bond, deadpan, says it is because light-skinned blacks are smarter than dark-skinned blacks. Decades later, Bond would say the sketch made him feel uneasy, adding, \"I believed it treaded dangerously on the fine line between comedy and poor taste,\" but honestly, so what? The obvious point of the punchline is that it is ludicrous to judge a person’s intelligence based on skin color. CLICK HERE FOR MORE FOX NEWS OPINION This is a perfect example of the woke attitude that has choked most of the laughs out of late night TV comedy. Instead of searing and sometimes abrasive comedic insight, they just rehash progressive shibboleths about Orange Man bad and vaccines good. When we look at the funniest and most successful comedians of the past 25 years, they tend to be the very people willing to transgress on supposed good taste. Guys like Dave Chappelle, Norm MacDonald, Ricky Gervais, and more recently, Shane Gillis, have all been in hot water over so-called offensive material. In \"Saturday Night Live’s\" case, there have been some signs that things are changing, notwithstanding producer Lorne Michaels’ boneheaded decision to go back on his word and give Kamala Harris an appearance just days before the election, a Hail Mary that didn’t even make it across the line of scrimmage. CLICK HERE TO GET THE FOX NEWS APP A recent sketch in which President Donald Trump is depicted mocking Hamilton superstar Lin Manuel Miranda is a good example of a playful touch that would have been all but impossible four years ago, maybe even four months ago. Sadly, the same cannot be said of the Jimmy Kimmels and Seth Meyers of the world whose nocturnal obsession with abusing Trump has become all they do. As Johnny Carson once said while roasting Don Rickles, \"Don is a great comedian. I love his joke.\" CLICK HERE TO READ MORE FROM DAVID MARCUS","summary":"Columnist David Marcus writes that, with the show turning 50, Saturday Night Live&apos;s braintrust ought to rethink how they traded humor for politics and lost their audience.","url":"https://www.foxnews.com/opinion/david-marcus-50-snl-should-drop-woke-get-back-joke","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/john-belushi.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-15 16:32:16","author":"David Marcus","authors":["David Marcus"],"language":"en","source_country":"us","sentiment":-0.165},{"id":290854562,"title":"Mark Warner says Democrats’ brand is ‘really bad’","text":"“I think the Democrats brand is really bad, and I think this one election was based on culture, and the Democrats’s failure to connect on a cultural basis with a wide swath of Americans is hugely problematic,” Warner, the Vice Chairman of the Senate Intelligence Committee, told Politico‘s White House bureau chief Dasha Burns in an interview during the Munich Security Conference.\n\nFULL LIST OF EXECUTIVE ORDERS, ACTIONS, AND PROCLAMATIONS TRUMP HAS MADE AS PRESIDENT\n\nDemocrats were unable to flip control of either the House of Representatives or keep the Senate, and Vice President Kamala Harris lost both the popular vote and the electoral college vote in November’s election, leading the party to do some serious soul searching on how to reconnect with voters. Democrats appear to be divided on whether their policies, or their messaging, is to blame. \n\nWarner criticized the Democrat party for its “over-the-top wokeism” as being a major turn-off for many voters. He also shared how the party struggles to shake off bad branding, whereas Trump can say “virtually anything,” and it doesn’t tarnish the party’s image or branding. \n\n“I don’t think the kind of notion that some in my party say of, well, we just got to turn out more people,” Warner said. “You know, I think they did turn out more people, and folks that we thought were going to go for Democrats aren’t.”\n\nWarner shared that Democrats failed to make a cultural connection, whereas Trump took advantage of the popularity of podcasts as a means to meet the American people with where they are. \n\n“We now live in a world where the number of people who watch a Politico or read a newspaper or do the normal means of communication or the traditional means of communication is less than 50%,” Warner said. “Trump was brilliant. Trump was so ahead of his time on sorting that out with a huge, reinforcing network of supporters, followers, that’s extraordinary, and the Democrats have spent a lot to learn from that.”","summary":"Sen. Mark Warner (D-VA) said the Democratic Party’s branding is “really bad,” and said that his party could learn a thing or two from President Donald Trump when it comes to messaging.  “I think the Democrats brand is really bad, and I think this one election was based on culture, and the Democrats&#8217;s failure to [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3321400/mark-warner-says-democrats-brand-is-really-bad/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/Mark-Warner.webp","video":null,"publish_date":"2025-02-15 16:29:24","author":"Elaine Mallon","authors":["Elaine Mallon"],"language":"en","category":"politics","source_country":"US","sentiment":-0.015},{"id":290851276,"title":"At least one billionaire sure seems to regret backing Trump","text":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\nToday, we shine spotlights on the most opposite spectrums of American society—one of the poorest countries in the country—Prentiss County, Mississippi—and billionaire Ken Griffin. And then we’ll end with a disabled veteran.\n\nLet’s start with Prentiss County. On their Facebook page, the county’s sheriff’s department announced, “Our Food giveaway is suspended until further notice. We have been notified by MidSouth Foodbank that funding has been suspended and we won’t receive any deliveries until otherwise notified.”\n\nThe letter attached to the Facebook post further clarified that the funding shortfall came, in part, from an end to COVID-19-era food assistance. Republicans have taken aim at such programs for the last couple of years, and they are as good as dead now that their party holds total control in Washington. \n\nIt is obviously distressing for a community and its poor to lose something as invaluable as food assistance. Yet the county’s voters have done everything possible to worsen their situation. \n\nThe county’s annual per-capita income is $29,000, according to the U.S. Census Bureau. Nearly 18% of its residents live in poverty, similar to the state at large. The national poverty rate was 11% in 2023, the most recent year of complete data. \n\nPrentiss is 81% non-Hispanic white and 15% Black. Given that this is Mississippi, among the most racially politically polarized states in the country, it shouldn’t be surprising that President Donald Trump won the county with 82.7% of the vote to Democrat Kamala Harris’ 16.6%—almost identical to the racial makeup.\n\nNow, thanks in part to the county’s votes, federal food-assistance programs have dried up, with zero chance of them being revived—and it could soon get worse for them. Nearly 18% of Mississippi residents are enrolled in Medicaid, a program currently on the GOP’s chopping block. Also in the crosshairs are subsidized school lunches for needy kids and food stamps. \n\nTrump and billionaire Elon Musk’s assault on assistance programs is in full swing, and it will harm America’s poor more than anyone—and Prentiss is a poor county in the poorest state in the union. \n\nBut I’m sure they’ll console themselves knowing that a handful of transgender women won’t be able to compete in college sports. They really stuck it to those coastal elites! \n\nSpeaking of coastal elites, not all of them are Democrats. \n\nTake Miami-based Ken Griffin, for example. The hedge-fund CEO of Citadel LLC is No. 33 in Forbes’ list of the world’s richest people, with a net worth of $44.3 billion as of Friday. Griffin, a major donor to the Republican Party, told The New York Times in December that he voted for Trump and wasn’t worried about tariffs:\n\nMr. Griffin downplayed one of the biggest concerns about Trumponomics—that tariffs could dent growth and accelerate inflation. He said it remained unclear whether Mr. Trump’s threats to slap tariffs on Mexico, Canada and China would materialize, adding that the talk of tariffs imposed by the United States was “small ball compared to the role that the world is looking to us for.” He said he didn’t see tariffs as the most important business issue.\n\nFast forward just a month and a half later:\n\n“Ken Griffin, founder of investment firm Citadel, warned Tuesday that President Donald Trump's tariff policies pose a serious risk to America's economic growth,” reported the Daily Mail, a tabloid based in the United Kingdom. “He said they may force other countries to find new trade alliances, as he criticized Trump's 'bombastic rhetoric.'”\n\n“The uncertainty and chaos created by the tariff dynamics between us and our allies is an impediment to growth,” he said at a conference. \n\nSuddenly, it seems Griffin sees tariffs as absolutely “the most important business issue.” \n\nBut don’t feel sorry for him, he still thinks Musk is wonderful and doing the right thing destroying our government. He’s a horrible person, and the best we can hope for is that Trump’s actions decimate his business. \n\nThis is from a now-deleted post on a subreddit for federal workers: \n\nA Betrayal of Sacrifice: A Veteran's Plea for Dignity\n\nThese past four weeks have been devastating.\n\nLast week, I sat in my car, waiting for my little girl to get out of school, and I cried. I served this country in Iraq, Afghanistan, and East Africa. When I came home, I struggled to make ends meet. No one was hiring a gunner. Eventually, I decided to use my GI Bill-not just for an education, but because I needed the extra cash. During that time, I earned my degree and landed a federal job. I was the first in my family to earn a degree and the first to work for the federal government.\n\nI loved my job. It was advertised as remote work, which made it possible for me to do my job well.\n\nGetting in and out of my car with a wheelchair is exhausting, and parking is always a hassle.\n\nWorking from home gave me some relief in a life that has been anything but easy.\n\nThen I saw the Return to Office Executive Order, and I knew it was going to get worse. I was right. The past few weeks have been nothing short of terrifying. I fear for my family. I fear for myself. I'd be lying if I said I hadn't had dark thoughts-thoughts I don't want to have. I was told I had to return to the office. I was told my reasonable accommodation would no longer be authorized. I feel betrayed-by this country, by this government. I gave everything, and now I feel like I have nothing left to give.\n\nThis, I pray.\n\nIn a subsequent post, the user noted that he was fired, a victim of Elon Musk’s purge. Heartbreaking, for sure. I take no joy in someone losing their job or the difficulties they suffer from a service-related disability. I was a soldier; my son is a soldier. I feel kindred spirits with all service members and veterans. I know the toll it can take on oneself and one’s family. \n\nBut in other posts, this guy also wrote: \n\nI love orange man now he defines a true American with his flaws and all as no one is perfect but it's not about being perfect it's about ones love of the country and doing your best to help your country first then focus on others instead of focusing on others and then your country\n\nIn another thread, when a user asked for gay-bar recommendations around the University of Maryland campus, he responded with a “ewwwwwww.” When called out on it by other users, he answered with “it’s an opinion don’t like it move to China.” \n\nIn yet another post, he wrote, “How did everyone celebrate the historic Gulf of America Day? It's rough out there but at least we got Gulf of America Day. How did you all celebrate this day, a day bugger [sic] than the Super bowl?”\n\nHe hates the foreigners and the gays and he voted for Trump to hurt those people. But Trump also hates wounded veterans, the disabled, and anyone working in the government. And you know what else? Being a disabled veteran made him a beneficiary of diversity, equity, and includes programs, or DEI. \n\nThis vet let his hatred of others blind him to how Trump wouldn’t hurt just them. And now his vote cost him and his family dearly. \n\nMaybe this guy is reachable, maybe not. Once challenged on his Trump support and posting history, he deleted both the post and his account. \n\nBut we don’t have to reach all of them. If we can swing 10% of Trump voters our way, that’s nearly 8 million voters. Heck, a 5% swing would make it hard for Republicans to keep the White House in 2028. \n\nIt’s a long way to go, and there’s plenty of time for people to become disillusioned and disenchanted.","summary":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\n\n\n\nToday, we shine spotlights on the most opposite spectrums of American society—one of the poorest countries in the country—Prentiss County, Mississippi—and billionaire Ken Griffin. And then we’ll end with a disabled veteran.\n\n\n\nLet’s start with Prentiss County. On their Facebook page, the county’s sheriff’s department announced, “Our Food giveaway is suspended until further notice. We have been notified by MidSouth Foodbank that funding has been suspended and we won’t receive any deliveries until otherwise notified.”\n\n\n\n\n\n\n\n\n\nThe letter attached to the Facebook post further clarified that the funding shortfall came, in part, from an end to COVID-19-era food assistance. Republicans have taken aim at such programs for the last c","url":"https://www.dailykos.com/story/2025/2/15/2303742/-At-least-one-billionaire-sure-seems-to-regret-backing-Trump?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1364395/story_image/AP24306858861373.jpg?1730737845","video":null,"publish_date":"2025-02-15 16:00:07","author":"kos,Midsouth Foodbank","authors":["kos","Midsouth Foodbank"],"language":"en","category":"politics","source_country":"US","sentiment":-0.275},{"id":290844470,"title":"In purple North Carolina, Democratic prosecutor 4-for-4 challenging Trump","text":"A fourth federal judge has sided with a group of plaintiffs, including the prosecutor who won just 24 of the state’s 100 counties to the president’s 78. Immigration issues have trended partisan from the state’s politicians at the federal and state levels, and the former U.S. House of Representatives member has joined colleagues across the country seeking halts to the administration’s policies.\n\nIn Boston on Thursday, U.S. District Judge Leo Sorokin became the latest to issue preliminary injunctions on immigration issues. In this case, it involves birthright citizenship for children of parents legally in America.\n\nOther rulings on birthright citizenship have come in Concord, N.H., Greenbelt, Md., and Seattle.\n\nJackson joined four lawsuits in 21 days challenging the Trump administration; all were granted initial blocks.\n\nJackson joined this lawsuit filed by New Jersey Attorney General Mathew Platkin on Jan. 21.\n\nIn other moves with opposite policies on behalf of a state that elected both politicians, Jackson on Jan. 28 joined New York Attorney General Letitia James in a suit involving the freeze of federal government grants and funding.\n\nHe’s also with a James litigation trying to block Elon Musk’s Department of Government Efficiency from accessing Treasury Department records. On Monday, he joined the suit of Massachusetts Attorney General Andrea Joy Campbell that challenges the Trump administration of stopping cuts to medical research grants funded by the National Institutes of Health.\n\nOn Nov. 5 in North Carolina, Trump won his election over Democrat Kamala Harris by 183,048 votes of 5,699,141 cast. He won 78 of 100 counties. Jackson won his election that day over Republican Dan Bishop by 159,549 votes of 5,590,371 cast, scoring in urban areas while Bishop won 76 counties.","summary":"(The Center Square) – Jeff Jackson, North Carolina’s attorney general, on Thursday continued his modest winning streak against President Donald Trump, this time involving a 14th Amendment issue. A fourth federal judge has sided with a group of plaintiffs, including the prosecutor who won just 24 of the state’s 100 counties to the president’s 78. [&#8230;]","url":"https://www.washingtonexaminer.com/news/3321382/in-purple-north-carolina-democratic-prosecutor-4-for-4-challenging-trump/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/donald-trump-gaza-netanyahu.webp","video":null,"publish_date":"2025-02-15 15:15:50","author":"Alan Wooten | The Center Square","authors":["Alan Wooten | The Center Square"],"language":"en","category":"politics","source_country":"US","sentiment":0.331},{"id":290843660,"title":"‘Captain America: Brave New World’ Review: Another Marvel Dud","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters \n\n BREITBART\n\nJust DOGE It\n\nL.A. Wildfires Recovery\nDeportations\n\nIsrael-Hamas War\n\n‘Captain America: Brave New World’ Review: Another Marvel Dud\n\n Disney/Marvel Studios\n\nJohn Nolte15 Feb 2025 \n\nEntertainment\nCaptain America\n\nharrison ford\n\nmovie review \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nZelensky Calls for Creation of 'European Armed Forces'\nRussia Claims Capture of Another Village in Ukraine's Donetsk Region\nOne Dead, Another Seriously Injured in Central Dublin Stabbing\nBrennan: Trump's Foreign Policies Creating 'Animosity' Towards the U.S.\nSenate Confirms RFK Jr. as Trump's Health Secretary\nRichard Grenell Weighs Run for California Gov. if Kamala Harris Runs\nTrump Creates National Energy Dominance Council Led by Burgum, Wright\nMX to Expand Lawsuit Against US Gunmakers if Cartels Designated Terrorists\nZelensky: Russia Has to Go to at Least Pre-2022 Invasion Borders\nMaher: Denying Ukraine Pre-2014 Borders Is 'Surrender', Only Path I See\n\nFROM THE HOMEPAGE\n\nZelensky Calls for Creation of ‘European Armed Forces’ at Munich Security Conference\nMaher: It Is ‘Surrender’ to Deny Ukraine Pre-2014 Borders, But Don’t See Any Alternative\nRussia Claims Capture of Another Village in Ukraine’s Donetsk Region\nTulsi Gabbard at Munich Security Conference: Trump Will Be ‘Peacemaker, Unifier’\nOne Dead, Another Seriously Injured in Central Dublin Stabbing\n‘Captain America: Brave New World’ Review: Another Marvel Dud\nReport: ‘Huge Number’ of Federal Probationary Workers Laid Off, Bigger Cuts Loom\nNYT’s Paul: ‘Only Way’ for Dems to Argue Against Trump on Foreign Aid Is to Defend Status Quo\nMaher: We Lose Billions a Year, So the Fired IGs May Not Have Been Doing a Good Job\nMaher: Trump’s Right, ‘Penises Do Not Belong in Women’s Prisons’ or Shelters\nVivek Ramaswamy will kick off his bid for Ohio governor in Cincinnati on Feb. 24\nHamas transfers Israeli hostages to Red Cross in latest Gaza swap \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters\n\nCopyright © 2025 Breitbart","summary":"With Captain America: Brave New World, the Disney Grooming Syndicate’s Marvel division has another stinker on its hands. And unlike those pre-Avengers: Endgame stinkers, there’s no sense that if you miss this one, you will miss a chapter in an over-arching story you’re already invested in.\n\n\nThe post ‘Captain America: Brave New World’ Review: Another Marvel Dud appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/02/15/captain-america-brave-new-world-review-another-marvel-dud/","image":"https://media.breitbart.com/media/2025/01/captainamericabrave2-640x335.jpg","video":null,"publish_date":"2025-02-15 14:07:00","author":"John Nolte","authors":["John Nolte"],"language":"en","source_country":"US","sentiment":0.343},{"id":290811724,"title":"Joe Biden’s 577 vacation days over four-year term tops modern presidents","text":"Joe Biden’s time as president was truly a sleeper.\n\nBiden, 82, took more time off than any other US president in modern history, spending 577 of his 1,463 days in office – or 39% of his presidency — on vacation, according to shocking new data compiled by the Republican National Committee.\n\nThe average American — who gets 11 paid vacation days a year — would have to work 52 years to rack up as much down time as Biden scored in his four years.\n\n“Considering how awful his misguided policies were and the various crises they created, from the border to inflation, imagine the damage he would have done if he worked every day?” quipped Rep. Nicole Malliotakis (R-Staten Island/Brooklyn). “I’m not sure if we should be mad or thankful he worked so little.”\n\nThat staggering tally includes R&R 43 of the 70 days — or 61% — after being pressured by fellow Dems in July 21 to drop his re-election bid.\n\nBiden’s relaxation ratio outstripped the previous Vacationer-in Chief, George H.W. Bush, who spent 37% of his presidency — 543 of 1,461 days – away from the White House.\n\nBiden’s out-of-office ratio far surpasses time off taken by Trump — who spent 26% of his first term away from Washington, D.C. — 381 of his 1,461 days in office, records show.\n\nRonald Reagan and Barack Obama vacationed for just 11% of their two-term presidencies — and workhorse Jimmy Carter took only 79 days of breaks, accounting for 5% of his single term in office.\n\nGeorge W. Bush spent 1,020 – or 35% — of his 2,922 days in office away from DC in his two terms, including plenty of time at his Texas ranch, according to tallies by the Cleveland Plain Dealer.\n\nBiden had already been enjoying massive amounts of time at his vacation home in Rehoboth Beach, DE before former House Speaker Nancy Pelosi and other once-loyal cronies bumped him off the party’s presidential ticket in favor of VP Kamala Harris.\n\nHe then spent most of the next two months vacationing there, California’s wine region in Santa Ynez Valley, the presidential retreat at Camp David, and at his other home in Wilmington, DE, records show.\n\nThis included taking a jaw-dropping 23 straight days off from Aug. 8 to Sept. 2.\n\nBiden took vacations to Nantucket in late November and to St. Croix, Virgin Islands, in late December, he did show up to work most of his last two months in the office.\n\nDuring that time, he issued the most presidential pardons and commutations in U.S. history — including pardoning his son Hunter Biden, who was facing prison sentences on federal felony gun and tax convictions.\n\n“Thanks to the mandate delivered by voters in November, Joe Biden and [former Vice President] Kamala Harris are now on a permanent vacation,” said RNC Communications Director Zach Parkinson. “And thanks to President Trump, our country is back on track.”\n\nBiden’s reps did not return messages.","summary":"Joe Biden took more days off than any other president in a single four-year term in at least the last 50 years, new data shows.","url":"https://nypost.com/2025/02/15/us-news/biden-took-off-577-days-in-4-years-tops-modern-era-presidents/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/ap-photo-manuel-balce-ceneta-98482247.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/ZywDrRVO-RyIcpnTz.mp4","publish_date":"2025-02-15 12:38:05","author":"Rich Calder","authors":["Rich Calder"],"language":"en","category":"politics","source_country":"us","sentiment":-0.283},{"id":290790252,"title":"Ignore Musk’s And Trump’s Wild Claims. Here’s How Federal Officials Really Get Rich.","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nPresident Donald Trump listens as Elon Musk speaks in the Oval Office at the White House.\nAssociated Press Photo/Alex Brandon\n\nOn Tuesday, at a press conference about Elon Musk’s Department of Government Efficiency’s efforts to cut government spending, Musk stood beside President Donald Trump in the Oval Office and claimed without evidence that federal workers were on the take.\n\n“Could you mention some of the things that your team has found, some of the crazy numbers, including the woman that walked away with about $30 million?” Trump asked Musk. “We do find it rather odd that there are quite a few people in the bureaucracy who have, ostensibly, a salary of a few hundred thousand dollars but somehow manage to accrue tens of millions of dollars in net worth while they are in that position,” Musk responded, adding that he believes this is “what happened at USAID,” the U.S.’s foreign aid office. “It just seems to be, mysteriously, they get wealthy, and we don’t know why,” he added. “Where does it come from? And the reality is that they get wealthy at the taxpayer’s expense.”\n\nAs it turns out, there are plenty of ways one can get wealthy with a government salary that are perfectly legal and don’t involve skimming funds for yourself. We would know: Forbes has been tracking the net worth of high-level government officials for years now, including those of the 2020 and 2024 presidential candidates, Cabinet officials in the Biden and first Trump administrations, and the nine justices of the Supreme Court. Sometimes, the wealth comes from someone else—an official inherits it or has a high-earning spouse. Other times, they are already quite rich before they become public servants. (In fact, some might argue that government positions disproportionately attract people who have money from other sources.) And finally, plenty of politicos make money in the private sector between government positions when their party goes out of power, then return when a friendly president is elected. In Washington, that’s what’s frequently called “the revolving door.”\n\nAs for the USAID official to which Musk and Trump appeared to be referring, it is likely Samantha Power, who headed the agency under Biden and has been the subject of conspiracy theories online amplified by Musk. Power, a longtime scholar and journalist who served as President Obama’s United Nations ambassador and who is married to prominent Harvard professor Cass Sunstein, was rich before she took the USAID job in 2021. On her financial disclosure that year, the couple declared between $9.7 million and $26.7 million in assets. On her final disclosure in 2024, she declared a range of about $10.5 million to $28.2 million, a marginal increase. In other words, there’s no evidence whatsoever of a surge in net worth, much less outright fraud.\n\nOf course, Musk acknowledged in the press conference that some of his claims—$50 million for condoms sent to Hamas? Funding Ben Stiller’s trip to Ukraine?—haven’t exactly held up to scrutiny. “Some of the things I say will be incorrect, and should be corrected,” he said. “Nobody’s going to bat a thousand.”\n\nWithout further proof from DOGE that they’ve found clear evidence of bona fide corruption, the reality is that making money and being in politics often go hand in hand, all within the bounds of the law. Here’s a rundown, with examples from previous Forbes reporting, of the ways in which government employees might end up richer than a public servant’s salary would suggest.\n\nUnless otherwise noted, all net worth figures are Forbes estimates.\n\nThe “Revolving Door” (Make Money Between Government Jobs)\n\nTwo of the most recent Democratic presidential nominees followed this option: Leave government to work in the private sector, then return for a new job later on. “Middle Class Joe” Biden became comfortably upper class (2024 net worth: $10 million) a year after leaving the vice presidency, hauling in $11.1 million from books and speeches in 2017. And Hillary Clinton (2015 net worth: $45 million), alongside her husband Bill, hauled in over $240 million from speeches, bookwriting, consulting and more between 2000 (when Bill left the White House) and 2016, when she mounted her presidential bid.\n\nThis strategy was also popular among Obama-era officials who later became Biden cabinet members. Federal Reserve chair-turned-Treasury secretary Janet Yellen (2021 net worth: $20 million) made upwards of $7 million from speeches. Secretary of state Antony Blinken (2021 net worth: $10 million) founded a firm called WestExec Advisors that was hired by clients like Uber, FedEx and Blackstone. Michigan governor-turned-energy secretary Jennifer Granholm (2021 net worth: $8 million) and general-turned-defense secretary Lloyd Austin (2021 net worth: $7 million) joined corporate boards, while homeland security secretary Alejandro Mayorkas (2021 net worth: $8 million) signed up with a lucrative private law firm.\n\nPlenty of Cabinet officials—like Biden's secretary of state, Antony Blinken—can make more money when they're out of office than when they're in it.\nAP Photo/Luis M. Alvarez\n\nThe revolving door is bipartisan, though. Trump’s second attorney general, Bill Barr (2019 net worth: $40 million), spent much of his time between the George H.W. Bush administration and the Trump administration at Verizon, where he worked as general counsel and executive vice president and earned himself a $17 million retirement package plus $10.4 million in severance when he left in 2008. Alex Azar (2019 net worth: $15 million) spent a decade at pharmaceuticals giant Eli Lilly between gigs in the George W. Bush administration and as Trump’s health and human services secretary.\n\nFormer vice president Kamala Harris (2024 net worth: $8 million) had a perfectly solid public sector legal career, but her finances boomed when she, then the attorney general of California, married entertainment lawyer Doug Emhoff. By the time she ran for president in 2019, Emhoff was raking in over $1 million per year. After Harris took office as vice president, Emhoff switched to teaching law, but the couple’s home in Los Angeles—originally Emhoff’s—kept increasing in value. He rejoined a corporate law firm as a partner in January, while she’s reportedly considering a book deal.\n\nFormer second gentleman Doug Emhoff helped boost the fortune of his politician wife, former vice president Kamala Harris.\nKenny Holston/The New York Times via AP, Pool\n\nChief Justice John Roberts and his wife, Jane, both high-powered lawyers, were worth about $5 million when George W. Bush nominated him to the nation’s highest court in 2005, per financial disclosure forms he filed at the time. Today, Forbes estimates they’re worth $25 million because, even though Roberts took a massive pay cut when he transitioned from private practice to public sector work, Jane kept hauling in the big bucks as a legal recruiter. A whistleblower leaked documents to Business Insider showing that she made some $10.3 million in commissions between 2007 and 2014, for example.\n\nInherit Money\n\nThe oldest way to get rich is having rich relatives. Just ask Merrick Garland, the longtime federal judge who served as Joe Biden’s attorney general and was worth an estimated $20 million in 2021. Sure, his legal career brought in plenty of money—but his 1995 financial disclosures show $900,000 in trusts from in-laws, plus millions more in investments owned by him and his wife. That fortune swelled over the years as his wife’s parents kept transferring assets, including New York and Connecticut real estate that the Garlands earned rent on.\n\nThe daughter of Taiwanese immigrants who started a successful shipping company, Elaine Chao, then George W. Bush’s labor secretary, received an estimated $9 million from her parents when her mother died in 2007. That inheritance, supplemented by her subsequent work in the private sector, increased plenty by the time Trump tapped her to be his first transportation secretary. Forbes estimated her fortune, which she shares through marriage with former GOP Senate leader and current Kentucky senator Mitch McConnell, at $20 million in 2019. Chao, whose husband was the only Republican senator to vote no on Robert F. Kennedy Jr. and Tulsi Gabbard for Trump’s new Cabinet, resigned from the billionaire’s first Cabinet after the January 6th attack on the Capitol.\n\nSen. Mitch McConnell, R-Ky., with his wife, former transportation secretary Elaine Chao, who inherited millions from her parents.\nChip Somodevilla/Pool Photo via AP\n\nOther politicians who have benefitted considerably from inheritance include Dean Phillips (2024 net worth: $50 million), the former Minnesota congressman and heir to a brewing fortune who challenged Joe Biden for the Democratic nomination in 2024, and Supreme Court justice Samuel Alito (2024 net worth: $10 million), who saw his assets jump following the deaths of his father-in-law in 2012 and his own mother in 2013.\n\nMake Money Before Taking A Government Job\n\nOne advantage of this approach is that you can use your own money for your campaign: Just ask billionaires Mike Bloomberg, the media and finance mogul who became mayor of New York and later ran for president, and Tom Steyer, a hedge funder who also ran for president in 2020.\n\nDonald Trump (who also inherited plenty, in fairness) built his real estate and brand empire before running for president, too, and has picked plenty of already rich businesspeople for his cabinets. Howard Lutnick, Trump’s current pick for commerce secretary, rebuilt—after the 9/11 attacks destroyed its New York offices and killed 658 of its employees—financial services firm Cantor Fitzgerald, and is worth more than $1.5 billion today. Wilbur Ross, Trump’s secretary of commerce during his first term, was worth $600 million in 2019 primarily thanks to private equity—and fooled the world into thinking he was much richer, until Forbes exposed him.\n\nTrump's first commerce secretary, Wilbur Ross, got rich before entering federal office—but not quite as rich as he'd claimed.\nAP Photo/Manuel Balce Ceneta\n\nBiden picked fewer ultrawealthy people for his Cabinet, but his commerce secretary Gina Raimondo (2021 net worth: $10 million) was a venture capitalist before becoming treasurer and then governor of Rhode Island.\n\nNotably, making money before taking a government job can also help an officeholder’s portfolio grow considerably while in office. Supreme Court justice Neil Gorsuch was worth $3.1 million when he was first confirmed as a circuit court judge in 2005, per disclosures filed at the time, but his fortune has since grown to an estimated $8 million thanks to deferred compensation from his private practice, growth in his investments and a bit of bookwriting. Massachusetts senator Elizabeth Warren (2019 net worth: $12 million) also watched her wealth grow after getting into office, partly from investments and partly thanks to a Cambridge, Mass. real estate boom that drove the value of her home from $450,000 in 1995 to around $3 million in 2019.\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nKyle Khan-Mullins\n\nEditorial Standards\n\nForbes Accolades","summary":"As Forbes has tracked for years, there are plenty of perfectly legal ways for senior government officials to become quite rich despite their government salaries.","url":"https://www.forbes.com/sites/kylemullins/2025/02/15/ignore-musks-and-trumps-wild-claims-heres-how-federal-officials-really-get-rich/","image":"https://imageio.forbes.com/specials-images/imageserve/67afb6cab78e0de5126666bd/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-02-15 11:30:00","author":"Forbes Staff,Kyle Khan-Mullins","authors":["Forbes Staff","Kyle Khan-Mullins"],"language":"en","category":"politics","source_country":"US","sentiment":-0.222},{"id":290796716,"title":"Democrats Have a Plan to Counter Trump at the State Level","text":"At a time when Republicans control all levers of power in Washington and national Democrats are struggling to respond to Donald Trump’s increasingly extreme agenda, Democrats at the state legislative level are targeting ten states in an effort to resist Trump and protect key rights and freedoms.\n\nThe Democratic Legislative Campaign Committee (DLCC) announced this week that its top targets for the 2025-2026 election cycle include defending its one-seat majorities in the state Houses of Virginia and Pennsylvania, and both chambers of the legislature in Alaska, Michigan, Minnesota, and Wisconsin.\n\n“Five of our battleground chambers were each decided in the last election cycle by a single seat, directly impacting the lives of 40 million Americans,” the DLCC wrote in a recent strategy memo. “Majorities in many states will likely come down to just a few districts and hundreds of votes.”\n\nDemocrats are also hoping to chip away at GOP state legislative majorities in Arizona, Georgia, New Hampshire, and North Carolina.\n\nSuch races are often overlooked at the national level, but state legislatures have a tremendous amount of power to decide weighty matters on the economy, healthcare, voting laws, abortion rights, gun control, and much more. The complete absence of Democratic power in Washington magnifies the importance of the states; Democratic attorneys general, for example, are leading the way on challenging Trump’s king-like assertion of executive power on issues like immigration and cuts to federal funding.\n\n“As Trump throws one chaos bomb after another, there’s never been a more important time to watch what’s happening in the states,” DLCC President Heather Williams said in a press call on Friday. “State legislatures are the only ballot level with the power to fight back against Project 2025 and the Republicans’ takeover of Washington. This is also the only place where Democrats are in majorities and can pass any kind of proactive agenda.”\n\nDemocratic state legislative candidates outperformed the party’s dismal performance at the top of the ticket in 2024. Though Trump won 312 Electoral College votes, Republicans gained only 57 seats out of the roughly 6,000 races on the ballot across the country, according to an analysis by Bolts. While Democrats lost control of legislative chambers in Michigan and Minnesota, they held closely contested chambers like the Pennsylvania House and picked up 14 seats in the Wisconsin legislature after previously gerrymandered maps were struck down, rare bright spots for the party in swing states Trump won.\n\nStill, following the 2024 election, Republicans have one-party control of 23 states compared to 15 for Democrats. Democrats want to not only pick up seats in 2026, but continue making gains through 2030, when new redistricting maps will be drawn following the decennial census.\n\nThe unpopularity of Joe Biden and Kamala Harris no doubt hurt Democrats down-ballot in 2024. In 2026, Democrats could benefit from an anti-Trump backlash at the polls, like they did during the first midterm election under Trump in 2018, when the party flipped more than 300 state legislative seats. Some of Trump’s initial actions in his second term, like a freeze on federal grants that states rely on, could be a particularly salient issue for voters. At the same time, local candidates may be better positioned to emphasize bread-and-butter issues like the cost of living that the national party too often ignored in 2024. \n\n“I think by and large Democrats are focused on affordability,” said DLCC political director Jeremy Jansen. “One of the clear lessons learned from the electorate in 2024 is that affordability is a big issue right now. Democrats are doing what they can at the state level to impact the lives of everyday folks and help address issues of affordability and economic opportunity.”\n\nThe Republican advantage at the state level had a major impact on the balance of power in Washington. Republicans in North Carolina drew an aggressive gerrymander of U.S House districts in advance of the 2024 election, which allowed the GOP to pick up three new House seats—just enough to maintain control of the chamber and ensure one-party rule in DC, removing any checks and balances to Trump in Congress.\n\nAs Williams put it, “The future of the country hinges on the balance of power in the states.”","summary":"At a time when Republicans control all levers of power in Washington and national Democrats are struggling to respond to Donald Trump’s increasingly extreme agenda, Democrats at the state legislative level are targeting ten states in an effort to resist Trump and protect key rights and freedoms. The Democratic Legislative Campaign Committee (DLCC) announced this [&#8230;]","url":"https://www.motherjones.com/politics/2025/02/democrats-have-a-plan-to-counter-trump-at-the-state-level/","image":"https://www.motherjones.com/wp-content/uploads/2025/02/AP25037829852407.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-02-15 11:05:00","author":"Ari Berman,Fred Pearce","authors":["Ari Berman","Fred Pearce"],"language":"en","category":"politics","source_country":"US","sentiment":0.008},{"id":290831226,"title":"Why are U.S. banks flying gold from London to New York?","text":"Deep under London’s Threadneedle Street lies an intricate network of tunnels holding the world’s second-largest depository of gold. \n\nThe Bank of England’s nine heavily fortified vaults hold hundreds of tonnes of the precious metal valued at more than £200 billion ($252 billion). \n\nBut now, they are slowly being emptied over fears that President Donald Trump is about to start a global trade war. \n\nMuch of the gold has been shipped to New York City where the commodity is, for the moment, worth substantially more than in the U.K. capital. \n\nThe U.S. bank JPMorgan and the U.K.’s HSBC are two of the biggest names flying the precious metal across the Atlantic to cover losses on short positions, reports the Wall Street Journal. \n\nThe disruption to the gold market, and subsequent movement of bullion from London to Manhattan, appears to be a consequence of Trump’s looming tariff threats against imports from the European Union entering the U.S. \n\nThis week, the president has already announced sweeping 25 percent import taxes on two other metals: steel and aluminum. \n\nTraders are now nervous that Trump will impose tariffs on gold. \n\nDeputy Governor of the BoE Sir Dave Ramsden, told The Telegraph it had been inundated with requests after New York’s futures market prices surged above the London cash price.\n\nGold futures in the Big Apple have risen 11 percent this year, closing Thursday at $2,935 a troy ounce. Some analysts predict they could soon hit a record-high of $3,000 a troy ounce. \n\nRoughly 8,000 bars are believed to have been moved out of the Bank’s vaults over the past few months, equating to about two percent of its total stock. \n\nSome of the world’s biggest financial institutions are now capitalizing on the emerging arbitrage opportunity. \n\nBanks are, in essence, shorting the price of gold. \n\nJPMorgan and HSBC – who have access to huge gold supplies in London – often lend out bullion to borrowers who need to use it as collateral. Interest is charged on the loan, with the banks hedging against price decreases by selling gold futures in New York. \n\nIn February alone, JPMorganChase is estimated to deliver more than $4 billion in gold against futures contracts in New York, according to Comex filings. \n\nAnd, since Election Day when Trump defeated then-Vice President Kamala Harris at the ballot box in November, U.S. gold inventories have doubled. \n\nJetting the gold using the cargo hold of commercial flights is the cheapest way to transport the valuable commodity. \n\nThe gold is first shuttled to the airport in high-strength vans before being sent to Swiss refiners to recast – due to Comex contracts requiring different bar sizing – it before flying on to the U.S.","summary":"About 8,000 gold bars have been moved out of the Bank of England’s vaults in recent months","url":"https://www.independent.co.uk/news/world/americas/us-politics/jpmorgan-gold-banks-trump-tariffs-london-new-york-b2698797.html","image":"https://static.independent.co.uk/2024/08/21/19/Gold_Prices_Explainer_22475.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/rIXPVajk-4VHSaSK0.mp4","publish_date":"2025-02-15 10:54:10","author":"James Liddell","authors":["James Liddell"],"language":"en","source_country":"gb","sentiment":-0.266},{"id":290780688,"title":"Letter: Trump, Musk set poor examples","text":"To the editor: Are Berkshire voters who backed Donald Trump and who still hang Trump flags and signs actually surprised at what he's doing?\n\nDoes it actually surprise them that he's imposed tariffs, likely causing our grocery prices to rise after he expressed disbelief about it at the debate? Does it surprise them that he's frozen federal funds to help the less fortunate? How could Trump's backers choose to vote for this guy? Have they no humanity?\n\nJust wait until your checking account and wallet starts getting eaten alive in less than a month because of these tariffs. Then look in your hearts and see if you were truly wise in the vote you made. Kamala Harris would never have committed such actions.\n\nTrump voters refuse to watch the news and hear the truth. They just want to follow social media and podcasts containing nothing but lies. Is that their purpose in life, to believe higher grocery prices, invading innocent countries like Canada, deporting innocent people who give us help and freezing federal funding makes America great again?\n\nLike Elon Musk, what a despicable example these people set for their children and themselves. Look at the press conference where Elon Musk is holding his 2-year-old little boy on his shoulders while having discussions involving things like condoms. God save that child.\n\nBrian Isaac, Adams","summary":"To the editor: Are Berkshire voters who backed Donald Trump and who still hang Trump flags and signs actually surprised at what he's doing?","url":"https://www.berkshireeagle.com/opinion/letters_to_editor/letter-trump-musk-set-poor-examples/article_abd384f0-e980-11ef-8dbc-632a7597a088.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-02-15 10:00:00","author":"Blox Content Management","authors":["Blox Content Management"],"language":"en","source_country":"us","sentiment":-0.071},{"id":290795258,"title":"Kamala Harris Presidential Campaign Paid Millions to Celebrity Production Companies Despite Denials","text":"Kamala Harris Presidential Campaign\n\nWith concerns over government waste and political funding dominating public discussion, recent revelations show the failed Kamala Harris presidential campaign funneled significant funds into celebrity production companies. Despite denials from some high-profile figures, Federal Election Commission (FEC) records show the Harris campaign paid for appearances by numerous A-list celebrities during its short-lived run.\n\nCelebrities Paid Indirectly for Campaign Appearances\n\nLindy Li, a former Democratic National Committee (DNC) finance committee member and Biden campaign advisor, told “The Shawn Ryan Show” that companies related to multiple celebrities – including Beyoncé and Cardi B – received payments for their presence at Harris campaign events. While the stars themselves said they were not personally compensated, financial records indicate what actually happened.\n\nBeyoncé’s mother, Tina Knowles, previously stated on Instagram that her daughter “did not receive a penny” for speaking at a Harris rally in Houston. The FEC records tell an interesting story, showing that Beyoncé’s production company, Parkwood Entertainment, was paid $165,000. Similarly, Cardi B claimed, “I didn’t get paid a dollar,” but FEC records show her production firm, Washpoppin Inc., received nearly $59,000 from the Harris campaign.\n\nOther high-profile payments included:\n\nLady Gaga’s production company: $132,000\nBarack Obama’s firm, Renegade 44 LLC: $95,000\nR&B artist DJ Khaled’s production company: $98,000\nKaty Perry and Christina Aguilera’s production firms also received payments, though exact amounts were not disclosed.\n\nA closing performance by Alanis Morissette was reportedly cancelled to save money.\n\nThe a-listers could have improved their images by admitting their production companies were paid, to allow paying for their staff and equipment, even though they weren’t paid.\n\nOprah Winfrey’s Harpo Productions Paid Millions\n\nOne of the largest expenditures went to Oprah Winfrey’s Harpo Productions, which initially reported receiving $1 million from the Harris campaign. Later reports from The New York Times confirmed the final amount was $2.5 million. Winfrey denied taking personal compensation, stating that the funds covered the costs of production, including set design, lighting, crew, and logistics.\n\n“I was not paid a dime,” Winfrey wrote on Instagram. “Harpo was asked to bring in set design, lights, cameras, crew, producers and every other item necessary … to put on a live production.”\n\nLegal Gray Area in Campaign Finance\n\nUnder campaign finance laws, direct payments for political endorsements are prohibited. However, campaigns can legally pay for appearances and production costs at rallies and events. The Harris campaign has maintained that it “never paid any artist or performer” directly. Instead, FEC records show payments to entities linked to these celebrities, allowing for a plausible deniability shield.\n\nThe spending didn’t stop at celebrities. The campaign also reportedly funneled nearly $4 million to Village Marketing Agency, a firm specializing in social media influencer partnerships.\n\nHarris Campaign’s $1.5 Billion Spending Scrutinized\n\nOver the course of just 15 weeks, the Kamala Harris campaign burned through an unprecedented $1.5 billion, making it one of the most expensive failed presidential bids in history. Controversial expenditures also included six-figure contributions to radical activist groups.\n\nFox News previously reported that the Harris campaign paid $150,000 to the Black Voters Matter Fund, a group advocating for defunding the police and reparations, and another $150,000 to the Black Church PAC, which has ties to religious leaders supporting controversial figures like Louis Farrakhan.\n\nDespite its record-breaking fundraising efforts, the Kamala Harris campaign ultimately collapsed, leaving behind a trail of financial questions that continue to raise eyebrows across the political spectrum.","summary":"Waste and political funding in focus, revelations show the failed Kamala Harris presidential campaign funneled big funds into celebrity production.","url":"https://newsblaze.com/usnews/politics/kamala-harris-presidential-campaign-paid-millions-to-celebrity-production-companies-despite-denials_201264/","image":"https://newsblaze.com/wp-content/uploads/2018/07/kamala-harris.jpg","video":null,"publish_date":"2025-02-15 08:36:39","author":"Alan Gray","authors":["Alan Gray"],"language":"en","category":"politics","source_country":"in","sentiment":-0.398},{"id":290830270,"title":"Biden Spent 39% of His Presidency On Vacation, Took More Time Off Than Any Modern U.S. President","text":"President Joe Biden, has taken more time off than any other U.S. president in modern history, spending 577 out of his 1,463 days in office—equivalent to 39% of his presidency—on vacation, according to data compiled by the Republican National Committee (RNC).\nTo put this in perspective, the average American worker, who receives 11 paid vacation days per year, would need 52 years to accumulate as much time off as Biden did in his four-year term.\nOnline Mockery and Criticism Over Time Off\nBiden's frequent vacations have not gone unnoticed by the public, with images of him relaxing in Rehoboth Beach, Delaware, in July 2023 becoming widely shared online and inspiring memes and GIFs.\nCriticism also came from Republican lawmakers, including Rep. Nicole Malliotakis (R-Staten Island/Brooklyn), who remarked, \"Considering how awful his misguided policies were and the various crises they created, from the border to inflation, imagine the damage he would have done if he worked every day? I’m not sure if we should be mad or thankful he worked so little.\"\nVacation Time After Biden Dropped Re-Election Bid\nA significant portion of Biden’s vacation time—43 of the 70 days, or 61%—came after July 21, when members of his own party urged him to withdraw from the 2024 re-election race.\nHis time off also eclipsed that of previous presidents, surpassing the record of George H.W. Bush, who spent 37% of his presidency—543 out of 1,461 days—away from the White House.\nBiden’s vacation time significantly exceeded that of former President Donald Trump, who spent 26% of his first term—381 out of 1,461 days—away from Washington, D.C.\nOther past presidents took far fewer breaks. Ronald Reagan and Barack Obama each spent only 11% of their two-term presidencies on vacation, while Jimmy Carter was away for just 79 days, accounting for only 5% of his single term.\nGeorge W. Bush, over two terms, spent 1,020 days—or 35%—of his 2,922 days in office outside Washington, often at his Texas ranch.\nVacation Destinations Biden Chose\nEven before being pushed off the Democratic ticket in favor of Vice President Kamala Harris, Biden had spent considerable time at his vacation home in Rehoboth Beach, Delaware.\nIn September 2023, reports indicated that he was on track to spend nearly 40% of his presidency on vacation. Following this, he continued to take extended breaks, spending much of the next two months in various locations, including:\n Rehoboth Beach, Delaware\n California’s wine region in Santa Ynez Valley\n The presidential retreat at Camp David\n His other home in Wilmington, Delaware\nDuring this period, Biden took a 23-day vacation from August 8 to September 2, one of the longest consecutive breaks of his presidency.\nLater in the year, he vacationed in Nantucket in late November and in St. Croix, U.S. Virgin Islands, in late December. However, he did spend most of his final two months in office working.\nHistoric Presidential Pardons and RNC Reaction\nDuring his last months in office, Biden issued a record number of presidential pardons and commutations, including pardoning his son, Hunter Biden, who had been convicted on federal felony gun and tax charges.\nThe RNC was quick to criticize Biden’s time off and political fate. “Thanks to the mandate delivered by voters in November, Joe Biden and [former Vice President] Kamala Harris are now on a permanent vacation,” said RNC Communications Director Zach Parkinson. “And thanks to President Trump, our country is back on track.”\nAlso Read: Trump’s Mass Firings at Nuclear Weapons Agency Throw America’s Nuclear Security Into Turmoil","summary":"President Joe Biden spent nearly 40% of presidency time away from the White House on vacation, setting a modern record. His frequent getaways have drawn sharp criticism, online mockery, and political attacks, especially in the wake of his decision to step aside from re-election.","url":"https://www.newsx.com/world/biden-spent-39-of-his-presidency-on-vacation-took-more-time-off-than-any-modern-u-s-president/","image":"https://www.newsx.com/wp-content/uploads/2025/02/President-Joe-Biden-US-President-Republican-National-Committee-Biden-vacation-.webp","video":null,"publish_date":"2025-02-15 07:59:00","author":"Zubair Amin","authors":["Zubair Amin"],"language":"en","category":"politics","source_country":"in","sentiment":-0.1},{"id":290738590,"title":"Trump’s hidden strategy to defeat Kamala Harris again","text":"Donald Trump could be setting up one of his most trusted aides for a second round with Kamala Harris.\n\nAfter her flop election performance in November, many have wondered what’s next for the former vice president. \n\nSome have suggested she could return to politics in her home state of California, where Governor Gavin Newsom is term limited in 2026. \n\nBut Trump may yet again be an impediment to her achieving power, as one of his key allies says he’ll run if she does.\n\nRichard Grenell, a former ambassador to Germany during Trump’s first term, is also serving as an envoy for special missions in the president’s administration and helping lead its response to the California wildfires. \n\nHe’s also been involved in Trump’s hostile takeover of the Kennedy Center, serving as interim president before the commander-in-chief was elected to the role himself.\n\nNow, the man who considered running in the recall election of Gavin Newsom in 2021 says he’ll be there to say no to Harris should she try to run for the top job in his home state. \n\n‘If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it’s a new day in California, and that the Republican actually has a shot, and I wouldn’t say no,’ he said Friday.\n\nGrenell was speaking from Munich, where much of the Trump administration has set up shop for an early foreign policy trip. \n\nHarris has not yet declared that she will run but she has moved back to California after Trump’s inauguration.\n\nInternal polling shared with the Hollywood Reporter last week shows the former vice president running away with the race if she ran, even as billionaire Rick Caruso is eying the contest.\n\nIn 2022, Caruso lost a close race for mayor of Los Angeles to Rep. Karen Bass, despite spending $104 million in his campaign, most of it from his own funds.\n\nThe government mismanagement of the Los Angeles wildfires in January has damaged the political reputation of Bass and other state Democrats, giving Caruso a possible opening in the heavy Democratic state.\n\n‘If Kamala gets in the race, it will be hers to lose,’ a political consultant monitoring the former vice president told THR. ‘She may not have performed on the national level, but if you look at her track record in California, she’s done extremely well.’\n\nHarris lost her presidential race in 2024 to Trump but she remains popular in California despite some voters in the state shifting to the right. \n\nIt’s unclear whether Harris wants to run for governor, as going back to California and running for state-wide office could be seen as a step back in her political career after serving as vice president.\n\nThe path is not unheard of. \n\nFormer Vice President Richard Nixon lost his presidential race in 1960 against John F. Kennedy and ran for governor of California two years later. His campaign for California governor failed, but he ran for president again in 1968 and won.\n\nDemocratic insiders fully expect Harris to run for president again in 2028, even though her 106 day presidential campaign came up short against Trump after she replaced Biden.\n\nHarris is already leading the race for the Democratic nomination, largely thanks to her name recognition from the last campaign.\n\nA McLaughlin poll published in January showed Harris leading with 33 percent over second place potential rival Pete Buttigieg at nine percent and Gov. Gavin Newsom in third place with seven percent. \n\nAfter leaving the vice presidency in January, Harris and her husband Doug Emhoff immediately went to Los Angeles and visited firefighters and served food to wildfire evacuees.\n\nGrenell’s California political experience amounts to working as a spokesman for Susan Golding, the former mayor of San Diego and as a consultant for a San Diego City Council campaign.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump could be setting up one of his most trusted aides&#8230;\n\n\nThis Post: Trump&#8217;s hidden strategy to defeat Kamala Harris again first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trumps-hidden-strategy-to-defeat-kamala-harris-again/","image":"https://i.dailymail.co.uk/1s/2025/02/15/06/95233657-14399631-Donald_Trump_could_be_setting_up_one_of_his_most_trusted_aides_f-a-10_1739601618129.jpg","video":null,"publish_date":"2025-02-15 07:20:19","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.023},{"id":290737950,"title":"Sheryl Crow Waves Goodbye to Her Tesla, Pledges Money to NPR","text":"Sheryl Crow has had enough of Elon Musk. The singer shared a new Instagram post on Friday waving goodbye to her Tesla, confirming that she sold her car following Musk and President Donald Trump‘s efforts to gut government programs through the so-called Department of Government Efficiency (DOGE).\n\n “My parents always said… you are who you hang out with,” Crow wrote in her post, accompanied by Andrea Bocelli and Sarah Brightman’s “Time to Say Goodbye.” She added, “There comes a time when you have to decide who you are willing to align with. So long Tesla.”\n\n Crow shared that the money she made selling the car would go to NPR, which she said was “under threat by President Musk.” The singer said she was donating to the radio network “in hopes that the truth will continue to find its way to those willing to know the truth.”\n\n Crow’s support of NPR comes as the Trump administration continues to fight the press, as evidenced by Trump’s move to block the Associated Press from the Oval Office over the news outlet’s refusal to change its editorial style to refer to the Gulf of Mexico as the “Gulf of America.”\n\n Crow’s decision comes as Musk and Trump have spent the first month of the president’s second term dismantling the federal government. DOGE laid off thousands of government workers and in the past two weeks, Musk and DOGE have gone after the U.S. Agency for International Development as well as the Consumer Financial Protection Bureau (CFPB). \n\n Speaking with Rolling Stone earlier this week, Senator Elizabeth Warren, who originally proposed the creation of the CFPB, said the Administration’s actions have put the country on the brink of a “constitutional crisis.”\n\n “Come fight it out here in Congress,” Warren said. “But you have to be willing to stand up and defend your ideas and persuade people to vote for them. You don’t get to slither around in the dark and put a handful of teenage hackers into the middle of [America’s] payments systems, as a way to give yourself control of the functioning of our government. “\n\n Crow has been vocal of her disapproval of Trump and far-right politics for years. On election day, Crow confirmed she’d cast her ballot for Kamala Harris, saying she picked the candidate that represented “empathy, compassion, a heart for community and for those underserved, Not hate and division, bigotry, or racism.”","summary":"Sheryl Crow has had enough of Elon Musk. The singer shared a new Instagram post on Friday waving goodbye to her Tesla, confirming that she sold her car following Musk and President Donald Trump‘s efforts to gut government programs through the so-called Department of Government Efficiency (DOGE). “My parents always said… you are who you &#8230;\n\n\nThe post Sheryl Crow Waves Goodbye to Her Tesla, Pledges Money to NPR appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/entertainment/music-news/sheryl-crow-waves-goodbye-to-her-tesla-pledges-money-to-npr/","image":"https://www.rollingstone.com/wp-content/uploads/2025/02/sheryl-crow-tesla.jpg?w=1600&h=900&crop=1","video":null,"publish_date":"2025-02-15 07:08:04","author":"Ashleigh Durden","authors":["Ashleigh Durden"],"language":"en","source_country":"us","sentiment":-0.438},{"id":290728016,"title":"Richard Grenell Considering Running for California Governor in the Event of Kamala Harris’ Candidacy","text":"Richard Grenell, President Donald Trump’s Envoy for Special Missions, said he would consider a run for governor of California if former Vice President Kamala Harris also ran, adding that he “wouldn’t say no.”\n\nGrenell explained to reporters at the Munich Security Conference in Germany that Harris “has such baggage and hundreds of millions of dollars in educating the voters” on how terrible she is, that the Republican candidate for governor in California would have a chance, according to the New York Post.\n\n“If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it’s a new day in California, and that the Republican actually has a shot,” Grenell explained.\n\nGrenell’s words come as a survey conducted by Emerson College Polling/Inside California Politics/The Hill found that Harris “snagged support for a hypothetical gubernatorial bid from nearly 6 in 10 Democratic primary voters in California, 57 percent.”\n\nThe survey also found that former Democratic Rep. Katie Porter (CA) received nine percent, while former Speaker of the California State Assembly and former Los Angeles Mayor Antonio Villaraigosa received four percent.\n\nCalifornia Lt. Gov. Eleni Kounalakis (D) also received four percent, while 17 percent were undecided.","summary":"Internewscast Journal\n\nInternewscast\n\n\nRichard Grenell, President Donald Trump’s Envoy for Special Missions, said he would&#8230;\n\n\nThis Post: Richard Grenell Considering Running for California Governor in the Event of Kamala Harris&#8217; Candidacy first appeared on Internewscast Journal","url":"https://internewscast.com/news/richard-grenell-considering-running-for-california-governor-in-the-event-of-kamala-harris-candidacy/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-02-15 06:33:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.269},{"id":290725422,"title":"Richard Grenell Considering Run for California Governor if Kamala Harris Runs","text":"Richard Grenell, President Donald Trump’s Envoy for Special Missions, said he would consider a run for governor of California if former Vice President Kamala Harris also ran, adding that he “wouldn’t say no.”\n\nGrenell explained to reporters at the Munich Security Conference in Germany that Harris “has such baggage and hundreds of millions of dollars in educating the voters” on how terrible she is, that the Republican candidate for governor in California would have a chance, according to the New York Post.\n\n“If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it’s a new day in California, and that the Republican actually has a shot,” Grenell explained.\n\nGrenell’s words come as a survey conducted by Emerson College Polling/Inside California Politics/The Hill found that Harris “snagged support for a hypothetical gubernatorial bid from nearly 6 in 10 Democratic primary voters in California, 57 percent.”\n\nThe survey also found that former Democratic Rep. Katie Porter (CA) received nine percent, while former Speaker of the California State Assembly and former Los Angeles Mayor Antonio Villaraigosa received four percent.\n\nCalifornia Lt. Gov. Eleni Kounalakis (D) also received four percent, while 17 percent were undecided.","summary":"Richard Grenell, President Donald Trump's Envoy for Special Missions, said he would consider a run for governor of California if former Vice President Kamala Harris also ran, adding that he \"wouldn't say no.\"\n\n\nThe post Richard Grenell Considering Run for California Governor if Kamala Harris Runs appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/02/14/richard-grenell-considering-run-for-california-governor-if-kamala-harris-runs/","image":"https://media.breitbart.com/media/2025/02/Ric-Grenell-and-Kamala-Harris-640x335.jpeg","video":null,"publish_date":"2025-02-15 05:05:49","author":"Elizabeth Weibel,Emerson College Polling","authors":["Elizabeth Weibel","Emerson College Polling"],"language":"en","category":"politics","source_country":"US","sentiment":-0.269},{"id":290686846,"title":"Joe Rogan explains why he doesn’t see any competitor on the “dishonest” political side","text":"Joe Rogan has defiantly declared there will never be a figure like him ‘on the left’ due to Democrats’ disingenuousness.\n\nThe top-rated podcaster made the proclamation Thursday, during a discussion about the role he played in last year’s election.\n\nHe spoke with internet maven Adam Curry, a former video jockey for MTV who is credited with being on the first celebrities to carve out a presence with podcasts.\n\nSpeaking with the so-called ‘Podfather’ on his show, Rogan explained what he believed was lacking from the other side of the aisle last year – after Curry asserted that what progressives had needed was their own version of the comic.\n\nRogan – three days removed from tearing into Democrats for their attitude after Donald Trump’s win – began by saying the left-leaning party ‘didn’t want’ him.\n\n‘That was the thing. That was the psy-op working against them,’ he explained, before eventually claiming Kamala Harris’s team was too ‘scared’ to appear on his show and lied after the fact.\n\n‘Because in the past they could take someone like me and demonize them and it would be effective,’ he went on, pointing to progressives’ penchant for cancel culture and other ethically questionable practices. \n\n‘They could just remove you from the airwaves…[if] you were not playing by the rules. Now, people say I’m telling the truth.’ Asked whether the left was trying to mimic his success, Rogan simply said: ‘It’s not going to work unless that person’s authentic.’\n\nScroll down for video: \n\nFollowing the full-throated diagnosis, Rogan accused influencers and members of the media of flat-pout pedaling propaganda, saying, ‘I’m wrong all the time, you might not agree with me – that’s all great – but I’m never going to lie.\n\n‘That’s the difference,’ he said on the subject. ‘A lot of these people are just propagandists.’\n\nThe longtime UFC commentator then lamented how members of the more progressive party aren’t willing to ‘look at the other side’ for a fresh perspective like he is. \n\n‘Instantaneously, now I know you’re propagandizing,’ he said of echo chambers seen on shows like The Young Turks and Pod Save America.\n\n‘Now I know you’re bull-sh*tting me.\n\n‘They try to make arguments without looking at the other side,’ he added, after last month describing himself as an ‘American’ when asked which party he belonged to. \n\n‘I always try to look at the other side. It’s an important quality for a person broadcasting to millions of people and also for a human being.’\n\nThe result of such behavior, Rogan said, is that CNN – fresh off one of its worst ratings months ever and a round of layoffs – ‘crashes,’ as does ‘faith in mainstream media.’\n\nLater on, the self-professed libertarian spoke on still-swirling allegations that he had been to blame for the Harris interview falling apart, after the then-candidate’s campaign argued that Rogan’s team made several difficult demands in the buildup.\n\nThis included a refusal to meet on October 25 due to it being Rogan’s ‘personal day,’ before alleging they then found out Rogan had fibbed and sat down with Trump instead on the same day, paving the way for the podcaster’s third-most-viewed episode ever.\n\nRogan, however, put those claims to bed, claiming the Harris team was simply lying to ‘cover their a**.’\n\n“It’s just normal political bullsh*t,’ he said again. ‘They just lie. They cover their a**, and they lie. \n\n‘I would have been very happy to have her on’, he said of Harris, who opted a more safe – and rehearsed – interview with CBS, that led to a yet-to-be settled lawsuit from Trump that alleges bias.\n\n‘And, like I said, the goal was to release both [interviews with the candidates] the same day,’ Rogan reiterated.\n\n‘We have all the receipts, by the way,’ Rogan already said last week. ‘I have a whole list of conversations that took place.\n\n‘They never said she was going to do it. This whole idea that we f*cked her over and we f*cked her over for Trump – incorrect, just not true.’\n\nOn Thursday, Curry – looking to incite a reaction out of his friend – joked, ‘You probably would have voted for her,’ referring to Harris.\n\n‘No, I wouldn’t have done that,’ Rogan replied with a laugh. ‘I wasn’t going to vote for her.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nJoe Rogan has defiantly declared there will never be a figure like&#8230;\n\n\nThis Post: Joe Rogan explains why he doesn&#8217;t see any competitor on the &#8220;dishonest&#8221; political side first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/joe-rogan-explains-why-he-doesnt-see-any-competitor-on-the-dishonest-political-side/","image":"https://internewscast.com/wp-content/uploads/2025/02/rewrite-this-title-Joe-Rogan-breaks-down-why-therell-never.jpg","video":null,"publish_date":"2025-02-15 03:40:58","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.224},{"id":290683164,"title":"Joe Rogan breaks down why there'll never be a rival for him on the 'lying' left","text":"Joe Rogan has defiantly declared there will never be a figure like him 'on the left' due to Democrats' disingenuousness.\n\nThe top-rated podcaster made the proclamation Thursday, during a discussion about the role he played in last year's election.\n\nHe spoke with internet maven Adam Curry, a former video jockey for MTV who is credited with being on the first celebrities to carve out a presence with podcasts.\n\nSpeaking with the so-called 'Podfather' on his show, Rogan explained what he believed was lacking from the other side of the aisle last year - after Curry asserted that what progressives had needed was their own version of the comic.\n\nRogan - three days removed from tearing into Democrats for their attitude after Donald Trump's win - began by saying the left-leaning party 'didn't want' him.\n\n'That was the thing. That was the psy-op working against them,' he explained, before eventually claiming Kamala Harris's team was too 'scared' to appear on his show and lied after the fact.\n\n'Because in the past they could take someone like me and demonize them and it would be effective,' he went on, pointing to progressives' penchant for cancel culture and other ethically questionable practices. \n\n'They could just remove you from the airwaves...[if] you were not playing by the rules. Now, people say I'm telling the truth.' Asked whether the left was trying to mimic his success, Rogan simply said: 'It’s not going to work unless that person’s authentic.'\n\nScroll down for video: \n\nFollowing the full-throated diagnosis, Rogan accused influencers and members of the media of flat-pout pedaling propaganda, saying, 'I’m wrong all the time, you might not agree with me - that’s all great - but I’m never going to lie.\n\n'That’s the difference,' he said on the subject. 'A lot of these people are just propagandists.'\n\nThe longtime UFC commentator then lamented how members of the more progressive party aren’t willing to 'look at the other side' for a fresh perspective like he is. \n\n'Instantaneously, now I know you’re propagandizing,' he said of echo chambers seen on shows like The Young Turks and Pod Save America.\n\n'Now I know you’re bull-sh*tting me.\n\n'They try to make arguments without looking at the other side,' he added, after last month describing himself as an 'American' when asked which party he belonged to. \n\n'I always try to look at the other side. It's an important quality for a person broadcasting to millions of people and also for a human being.'\n\nThe result of such behavior, Rogan said, is that CNN - fresh off one of its worst ratings months ever and a round of layoffs - 'crashes,' as does 'faith in mainstream media.'\n\nLater on, the self-professed libertarian spoke on still-swirling allegations that he had been to blame for the Harris interview falling apart, after the then-candidate's campaign argued that Rogan’s team made several difficult demands in the buildup.\n\nThis included a refusal to meet on October 25 due to it being Rogan’s 'personal day,' before alleging they then found out Rogan had fibbed and sat down with Trump instead on the same day, paving the way for the podcaster's third-most-viewed episode ever.\n\nRogan, however, put those claims to bed, claiming the Harris team was simply lying to 'cover their a**.'\n\n\"It's just normal political bullsh*t,' he said again. 'They just lie. They cover their a**, and they lie. \n\n'I would have been very happy to have her on', he said of Harris, who opted a more safe - and rehearsed - interview with CBS, that led to a yet-to-be settled lawsuit from Trump that alleges bias.\n\n'And, like I said, the goal was to release both [interviews with the candidates] the same day,' Rogan reiterated.\n\n'We have all the receipts, by the way,' Rogan already said last week. 'I have a whole list of conversations that took place.\n\n'They never said she was going to do it. This whole idea that we f*cked her over and we f*cked her over for Trump - incorrect, just not true.'\n\nOn Thursday, Curry - looking to incite a reaction out of his friend - joked, 'You probably would have voted for her,' referring to Harris.\n\n'No, I wouldn't have done that,' Rogan replied with a laugh. 'I wasn't going to vote for her.","summary":"The top-rated podcaster made the proclamation Thursday during a discussion about the role he played in last year's election .","url":"https://www.dailymail.co.uk/media/article-14399329/Joe-Rogan-left-lying-lied-democrats-kamala-harris.html","image":"https://i.dailymail.co.uk/1s/2025/02/14/21/95232091-0-image-a-14_1739569385081.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/10/26/8346231535272215286/1024x576_MP4_8346231535272215286.mp4","publish_date":"2025-02-15 03:26:52","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.211},{"id":290677900,"title":"'Will not make it through': Georgia Republicans urge Trump to reconsider Helene aid denial","text":"Georgia — which was ravaged by Hurricane Helene last fall — is still counting on billions of dollars in federal aid to recover from the disaster. However, President Donald Trump's administration is reportedly stonewalling new requests for assistance.\n\nThe Atlanta Journal-Constitution reported Friday that Trump rebuffed a request from Georgia Republican Governor Brian Kemp to allow cities more time to apply for relief. This despite the Peach State reeling from what the University of Georgia estimates to be roughly $5.5 billion in damage to its agriculture and forestry industries alone. Kemp's request was specifically limited to debris removal and emergency protective measures\n\n\"Based on our review of all the information available, it has been determined that the increased level of funding you have requested ... is not warranted,\" acting Federal Emergency Management Agency (FEMA) administrator Cameron Hamilton wrote in a letter to Kemp.\n\nREAD MORE: 'Radical' GOP trying to disenfranchise NC voters who 'overcame the destruction of Hurricane Helene'\n\nThe request for aid was bipartisan in nature, as both Sens. Jon Ossoff (D-Ga.) and Raphael Warnock (D-Ga.) joined Kemp's request to extend the deadline for municipalities to apply for aid. Ossoff told the Journal-Constitution that FEMA's decision to hold fast to the cutoff date was \"wrong.\"\n\n\"I urge the Trump administration to reverse course and ensure Georgia’s local governments get the vital support they need,\" Ossoff said.\n\nAdditionally, Georgia House Speaker Jon Burns (R-Newington) and Agriculture Commissioner Tyler Harper, who is also a Republican, urged the administration to elaborate when aid promised to the Peach State's farmers would be disbursed. They wrote that \"Georgia’s communities are still facing unprecedented losses and millions of dollars in incurred clean-up costs.\"\n\n\"Right now, the future is uncertain for far too many Georgia farmers, and without assistance, some of them will not make it through this growing season,\" Burns and Harper wrote.\n\nREAD MORE: Damning reports detail Trump's willingness to 'exploit major disasters' for political gain\n\nThroughout the 2024 campaign cycle, Kemp was reluctant to join Trump on the campaign trail despite Georgia's status as a competitive battleground state. In June of last year, Kemp said he didn't vote for Trump in the Peach State's Republican primary, though he ultimately endorsed him in August. \n\nTrump reportedly asked aides \"where the hell is Brian Kemp\" while stumping in Georgia. He added that he had \"helped [Kemp] get elected\" after endorsing him in the 2018 gubernatorial primary. Kemp later rationalized his support for Trump as a \"business decision.\"\n\n“Look, you may not like Donald Trump personally, but you’ll like his policies a lot better than Kamala Harris,” Kemp said in October. “It’s a business decision. You’re making a business decision.”\n\nAfter the news broke of the administration denying Kemp's aid request, Fair Fight Action spokesperson Max Flugrath observed: \"Kemp's 'business decision' is costing Georgia big.\"\n\nREAD MORE: 'Kremlin propaganda': MAGA exploits Helene disaster to attack Biden and Harris\n\nClick here to read the Journal-Constitution's full report (subscription required).","summary":"Georgia — which was ravaged by Hurricane Helene last fall — is still counting on billions of dollars in federal aid to recover from the disaster. However, President Donald Trump's administration is reportedly stonewalling new requests for assistance.\n\nThe Atlanta Journal-Constitution reported Friday that Trump rebuffed a request from Georgia Republican Governor Brian Kemp to allow cities more time to apply for relief. This despite the Peach State reeling from what the University of Georgia estimates to be roughly $5.5 billion in damage to its agriculture and forestry industries alone. Kemp's request was specifically limited to debris removal and emergency protective measures\n\n\"Based on our review of all the information available, it has been determined that the increased level of funding you have requested ... is not warranted,\" acting Federal Emergency Management Agency (FEMA) administrator Cameron Hamilton wrote in a letter to Kemp.\n\nREAD MORE: 'Radical' GOP trying to disenfranchise NC voters who 'overcame ","url":"https://www.alternet.org/georgia-republicans-trump-helene/","image":"https://www.alternet.org/media-library/image.jpg?id=56505369&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-02-15 03:08:18","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.497},{"id":290690668,"title":"Star-Loved Designer Joseph Altuzarra and Victoria’s Secret Just Dropped a Lingerie-Inspired Ready-to-Wear Collection","text":"If you purchase an independently reviewed product or service through a link on our website, The Hollywood Reporter may receive an affiliate commission.\n\n French-American designer Joseph Altuzarra — known for his red carpet-ready power suits and gowns worn by everyone from Hilary Clinton and Kamala Harris to Lana Del Rey and Evan Rachel Wood — is teaming with Victoria’s Secret for a spring collection of lingerie-inspired ready-to-wear.\n\n Priced from $95 to $500, the Atelier Victoria’s Secret x Altuzarra collection marks the fashion retailer’s first-ever designer-in-residence series and will include more releases throughout the year. The designer’s debut line comprises “classic wardrobe styles [that are] effortless and sensual,” he says in a release. That translates to bias-cut satin dresses and skirts that nod to 1930s slip gowns, bodysuits in crisp poplin and satin, tailored wide-leg pants, hook-and-eye knit separates and a sheer paneled mesh dress. \n\n The 18-piece spring capsule also includes outerwear, such as a strong-shouldered black wool blazer and an ivory satin evening coat with a retro rounded collar and built-in crystal-embellished bra straps designed to be seen. \n\n Satin pieces come in neutral hues such as marzipan, black and Spanish moss, while knit tanks, cardigans and skirts are available in sandstone and black; the collection is available in sizes XS to XL. \n\n “I am thrilled to unveil the first capsule collection for Atelier Victoria’s Secret x Altuzarra,” the designer continues. “With this partnership, I wanted to bring my design perspective to a brand known for celebrating femininity and sensuality. The collection reflects the craftsmanship and attention to detail at the heart of my work. I focused on pieces that felt effortless and sensual, and imbued them with subtle elements of discovery — classic wardrobe styles, but always with a twist.“\n\n Altuzarra’s first collab with Victoria’s Secret is showcased in a campaign styled by former Vogue Paris fashion editor Emmanuelle Alt and shot by photographer Lachlan Bailey. The designer’s ready-to-wear is featured with Victoria’s Secret’s Very Sexy line of demi bras, corsets, slips and skirts modeled by Blésnya Minher, Imaan Hammam, Devyn Garcia and Paula Soares.\n\n Select pieces — including the bodysuits, pants, satin and mesh dresses and outerwear — are available to shop online right now, while the hook-and-eye knitwear can be pre-ordered ahead of their Feb. 20 release.\n\n The Atelier Victoria’s Secret collection follows Altuzarra’s Wuthering Heights-inspired Fall/Winter 2025 runway show at New York Fashion Week (attendees were also gifted the Emily Brontë novel). Per the show notes, the collection references 1980s post-punk and Spanish matador style, and represents “a woman who wears her history as armor and is not afraid to display her scars.”\n\n Shop the spring 2025 Altuzarra x Atelier Victoria’s Secret lookbook below, and see the full collection online at victoriassecret.com.","summary":"Worn by everyone from Kamala Harris to Lana Del Rey, the French-American talent is the retailer's first-ever designer-in-residence with his new spring capsule.","url":"https://www.hollywoodreporter.com/lifestyle/shopping/altuzarra-atelier-victorias-secret-designer-collab-pricing-photos-release-date-2025-1236137335/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/02/Altuzarra-x-VS-Atelier-4-PUBLICITY-MAIN-2025.jpg","video":null,"publish_date":"2025-02-15 01:55:20","author":"Danielle Directo-Meston","authors":["Danielle Directo-Meston"],"language":"en","source_country":"US","sentiment":0.939},{"id":290777372,"title":"JD Vance Calls Out European Leaders On Censorship - To Their Faces","text":"JD Vance spoke at the Munich Security Conference on Friday, and demonstrated in one brilliant speech why he's already a more consequential vice president than Kamala Harris ever was. Vance, who has a tremendous advantage over Harris being that he can express complicated ideas clearly, succinctly and without breaking into unjustified laughter, told the gathered elite Europeans exactly what's wrong with their societies and governments. Not that the wrong political parties are receiving support, but that those in charge have, for decades, worked to erode free speech protections while punishing individuals for the crime of wrong-think. During his speech, Vance referenced how Germany's government has conducted raids against individuals posting \"Anti-feminist comments online\" in order to \"combat misogyny online.\" And Sweden, where a Christian individual who participated in Koran burnings that resulted in his friend's murder, because that country's laws that supposedly protect free expression do not allow you to \"risk offending\" those who hold different beliefs. Vance followed those examples up by referencing how the British government charged a man for silently praying for three minutes 50 meters from an abortion clinic. When asked by police why he was praying, that man said it was for the son he and his then girlfriend had aborted years prior. Scotland warned some residents that private prayer, in their own homes, could be punished as a \"thought crime,\" if it came within a \"safe-access zone\" for abortions. As Vance summarized, \"In Britain, and across Europe, free speech, I fear, is in retreat.\" And he's absolutely right. JD Vance Delivers Hard Truths To European Audience It's been clear for decades that Europe does not place the same value on free speech and free expression as America. While maintaining their undeserved superiority complex, governments in the UK, Germany, Sweden and France have cracked down on anyone who violates their sensibilities. Instead of listening to what their people want, they demand compliance with whatever unblinking, unthinking generic left-wing views they happen to hold. Quite literally, at the same conference, a German politician said that X and TikTok must be stopped; prevented from influencing their residents to think for themselves. Or to criticize the insane, absurd policies European governments have enacted. And Vance brought receipts there too, detailing how mass, unvetted immigration has cost the European continent dearly. Elite Europeans are used to being treated with kid gloves, with an omnipresent veneer of \"whatever we do is good because we're the ones doing it.\" Essentially the Barack Obama school of foreign policy. Vance clearly didn't go to that school. And thank God for it. Government-imposed censorship or policing of thought crime and wrong-think is one of the most dangerous, if not the most dangerous, issues facing the global public. A government telling you what you're allowed to think is what leads to authoritarianism. Europe is happily plodding down that road, all to avoid admitting its misguided policies that haven't worked. They sure haven't.","summary":"JD Vance spoke at the Munich Security Conference on Friday, and demonstrated in one brilliant speech why he&apos;s already a more consequential vice president than Kamala Harris ever was.","url":"https://www.outkick.com/analysis/jd-vance-calls-out-european-leaders-censorship-face","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/01/jd-vance.jpg","video":null,"publish_date":"2025-02-15 00:50:25","author":"Ian Miller","authors":["Ian Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.179},{"id":290685882,"title":"Imagine a Kamala Harris Inauguration","text":"Remember the classic song “I Can Only Imagine” by Mercy Me? How about having some fun and fantasize what the Inauguration Day event would have been like if Kamala Harris had become President. Mercy Me, God spared us!\n\nPresident Donald Trump gave God the glory in his inauguration address when he said, “God spared me from that [assassination attempt] for a purpose – to make America great again!” He stated emphatically, “We will not forget our country, we will not forget our Constitution and we will not forget our God!”\n\nThe assassin’s bullet that grazed his head missed killing Donald Trump by less than a centimeter. He dodged a bullet, and that is a prophetic picture of what America dodged through intervention as God responded to our prayers and engagement to reelect President Trump after a four year hiatus (after which he returned more competent, courageous and calm as a statesman and “man on a mission” to passionately pursue the rebuilding of America after being handed a mess by the disastrous Biden/Harris administration).\n\nDaily I pray for President Trump’s protection and for God’s guidance in his administration, and I strongly encourage you to do likewise. I continue savoring this miraculous reset that he called “The Golden Age of America” in the opening sentence of his address.\n\nSeeing a sea change\n\nAfter Biden’s “Barney Fife” ineptitude there’s a new sheriff in town demonstrating real leadership, and it’s leaving leftists in the dust trying to stall and stop Trump’s lightning speed progress in draining the swamp. It’s remarkable to observe the courage and clarity of his leadership that is leaving the entrenched D.C. establishment frightened of being fired! I worked in the D.C. area for 24 years, and I know this subculture is running scared because accountability and Elon Musk’s Department of Government Efficiency (DOGE) is hard at work!\n\nI personally believe this will be one of the most consequential presidencies in America’s history similar to what happened with George Washington, Abraham Lincoln, Franklin D. Roosevelt and Ronald Reagan. Judging by his explosive start with over 100 executive orders; transparency with the press; impressive presentations before the World Economic Forum (spontaneous and authoritative contrasted with Biden’s feeble, teleprompter fumblings of the past) and also before leaders in Los Angeles as he handled the devastating fire disaster with clarity and compassion.\n\nWitnessing history\n\nIt’s obvious even to some of his strongest adversaries that this is a man who is in the right place at the right time for the right reason – turn America around from corruption and its catastrophic downward spiral. We are witnessing history as we honor God and His standards our founders built upon so we recover our position as world leader and “one nation under God.”\n\nI believe God orchestrated the Inauguration to be inside rather than in the spacious outdoor setting to make it more intimate and riveting. I’ve spoken to crowds outdoors in the thousands, and it’s a completely different atmosphere with many distractions, let alone freezing cold. When Carrie Underwood experienced the soundtrack glitch, she belted out “America the Beautiful” a cappella, inviting the participants to sing along in what turned out to be a worship moment in the Rotunda!\n\nWe’re experiencing a sea change and a reform movement prayed for by multitudes: protecting vulnerable children from pornography, filth and LGBTQ propaganda; rescuing confused youth from trans surgeries; upholding only two genders – male and female; stopping DEI mandates across America; closing our borders and arresting criminal, law-breaking aliens; putting an end to obscene spending of taxpayer money on programs such as $70,000 spent on DEI musicals for Ireland, $47,000 spent on trans operas for Colombia and $30,000 spent on transgender comic books for Peru.\n\nImaginary Kamala Inauguration Day\n\nSo pastors, never again stay out of politics, and none of us take for granted the magnitude of what God has done with our reprieve. There is no room for complacency going forward. May this imaginary scenario jolt us as to what could’ve happened and what would’ve been the launch pad for years of radical San Francisco leftist, progressive rule and the ultimate destruction of traditional America. This is not hyperbole but reality!\n\nWith a fawning press and Hollywood “celebs” flanking her, a cackling Kamala would be sworn in as our first female president, followed by Vice President “Tampon Tim” Walz. They would be smiling on the stage with Michelle Obama preparing to be the featured speaker promoting abortion and “women’s reproductive health care” (murdering ready-to-be born babies) at the opening ball along with Robert De Niro, Bernie Sanders, Hillary Clinton and returning border chieftain Alejandro Mayorkas.\n\nAfter being sworn in, Harris would outline her progressive priorities: open borders; taxpayer-funded abortion until birth; new LGBTQ initiatives; transgender agenda promoted in schools and women’s sports; expanded support for CRT, BLM and numerous woke initiatives in schools; removing restrictions to all gay-affirming books and drag shows; expanded promotion of DEI mandates in schools, government, corporations and the military; increased taxation; legalization of drugs and prostitution; raising the national debt past $37 trillion by more government spending on entitlement programs like subsidized health care, child care and supplemental income for illegal immigrants; limited and qualified cooperation with Israel yet alignment with Iran, Hamas and Hezbollah liberation activists; increased financial support for Planned Parenthood; new presidential medals for the likes of George Soros; more pardons for unfairly treated “victims” on death row; increased use of the Department of Justice, FBI and criminal justice system to stop pro-lifers and parents “subverting” clinics and school boards; hiring 75,000 more IRS agents; increased surveillance of suspected “insurrectionists” and “those threatening our democracy.”\n\n[Aside: Shame on my fellow pastors who previously said not to be involved in politics!]\n\nInaugural balls\n\nThe three celebratory balls underwritten by Hollywood A-listers and socialist billionaires honor the contributions of individuals such as Rachel Maddow, Joy Reid, Oprah Winfrey, SNL’s Lorne Michael, George Stephanopoulos, Rev. Al Sharpton, along with political luminaries, like socialist Alexandria Ocasio-Cortez, Hunter Biden, Liz Cheney, Nancy Pelosi, Joy Behar and the ladies of “The View.” Karine Jean Pierre, Bernie Sanders and Howard Stern will be masters of ceremony for the events.\n\nHere’s the deal: The “horror show” above was averted because you and 77.3 million traditional, patriotic Americans refused the lie that Christians should stay out of politics. Pastors repented of complacency and caving to Satan’s subtle deception. Goodbye, Biden, Kamala and what you represent. And now, “May God truly bless the United States of America!” [Pass this along to family, friends and fellow church members.]","summary":"'Trump's 'will be one of the most consequential presidencies in America's history'","url":"https://www.wnd.com/2025/02/imagine-a-kamala-harris-inauguration/","image":"https://www.wnd.com/wp-content/uploads/2025/01/kamala-harris-january-6-anniversary-jpg.jpg","video":null,"publish_date":"2025-02-15 00:46:17","author":"Larry Tomczak","authors":["Larry Tomczak"],"language":"en","source_country":"us","sentiment":0.084},{"id":290660594,"title":"More Than One-Third of Canadians Support Annexing These 3 States: Poll","text":"More than one-third of Canadians support a proposal to allow three U.S. states—California, Oregon and Washington—to join Canada, according to a new poll.Newsweek reached out to Canadian politician Elizabeth May, who suggested the proposal, for comment via the Green Party's press email.Why It MattersPresident Donald Trump has repeatedly suggested the U.S. could annex Canada and make it the 51st state since taking office. His remarks, as well as support for tariffs on Canadian imports, have strained relations with Washington's neighbor to the north.What to KnowMay, who leads the Canadian Green Party, suggested at a press conference in January that those three states could become Canadian provinces, rather than Canada becoming part of the U.S. She said the three states, all of which are viewed as safely Democratic, would receive universal health care and stricter gun laws.\"Hey, Donald, have we got a deal for you? You think we want to be the 51st state huh? But maybe California would like to be the 11th province. How about it? California? Oregon? Washington?\" she said.Although such a change would be highly unlikely to actually happen, the proposal would have the support of 35 percent of Canadians, according to a new poll from YouGov, which surveyed 1,030 Canadian adults from January 22 to January 28 but was published on Friday.Residents of British Columbia, the province located directly north of Washington, were more likely than not to support the proposal—43 percent said they'd support letting the three states join, compared to 41 percent who opposed the idea.Quebec residents were the least likely to support the proposal, with only 25 percent backing it.Americans, including residents of those states, were less likely to back the proposal. Twenty-three percent of Americans said they'd support those three states joining Canada, compared to 29 percent of people who live in the three states.Among Americans, the idea wasn't polarized on partisan lines. Twenty-seven percent of those who voted for Vice President Kamala Harris supported it, while 26 percent of Trump voters said they'd support those three states joining Canada.What People Are SayingCanadian Prime Minister Justin Trudeau, during a press conference on Wednesday: \"Let's be very clear. Conversations around the 51st state are a nonstarter. It's never going to happen. But we have to take seriously what the president is saying and fold that into our thinking as we continue to stand up for Canada.\"Trump, during a press conference on Thursday: \"Canada, their taxes would come down greatly. Their security would go up greatly. Amazing things happened to Canada. Why would we pay $200 billion a year in subsidies to Canada when they're not a state? You do that for a state, but you don't do that for somebody else's country.\"What Happens NextWhile most experts cast doubt that borders will change between the countries either way during the foreseeable future, relations between the two countries are likely to remain chilled amid tariff threats.Trump announced new tariffs on Canadian aluminum and steel last weekend, though the 25 percent tariffs on most Canadian imports went on a 30-day pause starting February 3.","summary":"Americans were less supportive of the three states joining Canada, according to the YouGov poll.","url":"https://www.newsweek.com/canadian-accepting-three-states-poll-2031663","image":"https://d.newsweek.com/en/full/2589157/35-percent-canadians-support-3-states-joining.jpg","video":null,"publish_date":"2025-02-15 00:44:19","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"us","sentiment":-0.336},{"id":290664886,"title":"‘The Realignment’: GOP Sen. Hawley to Introduce Pro-Union Legislation","text":"He was the first president to walk a picket line. And he crowed regularly about being the “most pro-union” president ever. But after four years as president, Joe Biden could not stop a growing working-class coalition, one that increasingly includes rank-and-file union members, from flocking to Donald Trump.\n\nReflecting on election night about the coalition that returned him to the White House, Trump called it “a historic realignment.” John McLaughlin wondered if it would endure.\n\nWhile Republicans celebrated in the weeks after the election, Trump’s longtime pollster looked to the future.\n\n“Right now, these Trump voters—the GOP is just renting them,” McLaughlin told RealClearPolitics. Speaking of the coalition Trump cobbled together consisting of disaffected Democrats and traditionally liberal constituencies, he added that Republicans “need to make a decision if they’re going to make them permanent.”\n\nEnter Sen. Josh Hawley, the Missouri Republican emerging as the right-of-center pro-labor leader.\n\n“Look at what Donald Trump achieved. He achieved victory based on this coalition, and he deserves tremendous credit for making it possible, and he knows it,” Hawley said in an interview before picking up where Trump’s pollster left off. Hawley is asking his Republican colleagues whether they want their new-found working-class support “to begin and end with Donald Trump.”\n\nHis framework for pro-union legislation amounts to something of a downpayment. It is a set of proposals to reform the way businesses interact with organized labor, from requiring worker rights to be displayed on a job site to prohibiting “unsafe work speed quotas.” And soon Hawley will introduce legislation mandating accelerated negotiations between unions and employers.\n\nA 2022 Bloomberg Law analysis found that the average time between workers voting to unionize and reaching their first contract with employers was 465 days. The Hawley bill would mandate that once workers vote to form a union, the employer and employees must begin the negotiations process within 10 days. It is a significant reform, which unions have wanted for years. Two Democrats have already promised to co-sponsor: Sens. Cory Booker of New Jersey and Gary Peters of Michigan. But its author is unusual in that Hawley comes from a party traditionally more favorable to corporations than workers.\n\nHawley has embraced the heterodoxy. Last year he abandoned his support for right-to-work laws, policies which bar unions from requiring workers to pay dues as a condition of employment. Before that, Hawley introduced legislation that could have easily come from the desk of socialist firebrand Bernie Sanders. One was a bill to cap credit card interest rates; another sought to overturn the Supreme Court’s campaign finance decision, Citizens United.\n\nNeither was well-received in traditional conservative precincts. The latter earned Hawley a rebuke from the business-friendly Wall Street Journal editorial page. But Hawley represents a vanguard of a New Right, and while his bill mandating accelerated negotiations between labor and business faces an uphill battle in the Senate, skepticism of corporate power is increasingly in vogue among the GOP because of Trump’s ascendancy.\n\n“As conservatives, who are now benefiting from the support of working people, it’s time we deliver for them and bring into actuality this Trump realignment, this working-class realignment of the Republican Party,” Hawley said of his efforts. “This is my project.”\n\nIn this, the president is sympathetic. Trump delights in bragging about how he peeled union votes away from Democrats. He invited Teamsters President Sean O’Brien to address the Republican Convention in Milwaukee without any preconditions about what the union boss could or couldn’t say on stage. Later when the Teamsters declined to endorse him or former Vice President Kamala Harris, Trump portrayed the non-endorsement as a tacit repudiation of Democrats.\n\nTrump and Hawley have spoken in the days since the inauguration. A source familiar with those calls reports that the president is generally supportive of Hawley’s pro-labor legislation. A senior White House official did not dispute that characterization, telling RealClearPolitics that “the president will never turn his back on union voters.”\n\nThe administration made their commitment explicit on the campaign trail where Vice President JD Vance often bemoaned the “tragedy” of declining union membership in the private sector.\n\n“I think what we see as our job in national policy is to protect as many workers’ jobs as possible, to promote tax and spending and tariff policies that promote large scale economic growth and actually give workers more their take on pay and more jobs to begin with,” Vance told RealClearPolitics last September before adding that the incoming administration would work to make the job of unions “easier, not harder.”\n\nThis was a winning political argument. Now those voters are likely to expect results. Hawley says Republicans must embrace working class voters or, he warns, “we will never be a majority party.”\n\n“The Republican Party right now is defined largely by one very specific personality who’s been quite successful,” said Abigail Ball, executive director of the conservative think tank American Compass. “If we’re going to see this be a long-lasting realignment,” she continued, “where working-class voters take seriously that conservatives want to deliver, we have to do real long-term policy work.”\n\nIf Trump exits the Oval Office in four years without overseeing any such “policy work,” Hawley fears that the GOP is at risk of “reverting to the days where we are a wholly owned subsidiary of these mega-corporations.” That comes with its own familiar result: a return to what Hawley calls “the political wilderness.” There is no majority coalition there, he said, warning his party, “We know this because we’ve lived it for 30 years.”\n\nAn early test comes in the person of Trump’s nominee for labor secretary, Lori Chavez-DeRemer. She is a former member of Congress, a Democrat from Oregon with well-defined, pro-union views. Her support of the PRO Act, which would pre-empt state right-to-work laws, makes her anathema to pro-business Republicans. Kentucky Sen. Rand Paul promised to oppose her and predicted she could lose as many as 15 GOP votes. Democrats like Massachusetts Sen. Elizabeth Warren, meanwhile, seemed pleasantly surprised and signaled a willingness to back her. “I think she’d be terrific,” Hawley said.\n\nIf there is indeed a realignment, it is incomplete. Republicans are not as comfortable as Hawley on a picket line. They are more inclined to side with industry. And while Trump seems eager to keep union voters in the GOP fold, during his first time in office he sided with business. His judicial nominees, as well as his nominees to sit on the National Labor Relations Board, were undoubtedly labor skeptics. Trump even praised Elon Musk’s perceived penchant for firing Tesla workers interested in starting a union.\n\n“You’re the greatest cutter,” Trump told Musk during a live conversation on X. “I look at what you do. You walk in and say, ‘You want to quit?’ I won’t mention the name of the company, but they go on strike, and you say, ‘That’s OK. You’re all gone.’”\n\nThe richest man in the world, Musk is now not just a supporter but a key member of the Trump administration. The second and third richest men in the world, Mark Zuckerberg of Facebook/Meta and Jeff Bezos of Amazon, attended Trump’s second inaugural. All three have, at one time or another, been caught up in lawsuits over their treatment of employees looking to unionize.\n\nThe proximity of that much capital to the president does not worry Hawley. “There’s only one person who runs the Trump administration, and as many who think otherwise, sadly, learn, that one person is Donald J. Trump,” he replied when asked about the new coziness between Silicon Valley elite and the populist president. “So, I have no doubt that Jeff Bezos would love to be in the president’s inner circle,” he added. “Do I think that the president is going to ultimately listen to him? No.”\n\nThe Missouri senator would prefer if the president listened to him and helped get his latest pro-labor legislation into law. So would the Teamsters who support the new bill.\n\n“Legislation gets put forward, oftentimes, as a political chess piece and part of the game, but the ultimate result is that it doesn’t see the light of day,” said Teamsters spokeswoman Kara Deniz. Unions have watched that dynamic play out over and over again across administrations, she said. Led by O’Brien, though, the Teamsters are increasingly open to working across the partisan divide. “The priority is to wherever we can, whether it’s Democrat, Republican, or independent, to work together with any political leader that is going to support workers,” Deniz told RCP.\n\n“Hawley has been that person,” she said.\n\nOriginally published by RealClearWire","summary":"He was the first president to walk a picket line. And he crowed regularly about being the “most pro-union” president ever. But after four years... Read More\n\n\nThe post ‘The Realignment’: GOP Sen. Hawley to Introduce Pro-Union Legislation appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/14/the-realignment-gop-sen-hawley-to-introduce-pro-union-legislation/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/joshhawley.jpg","video":null,"publish_date":"2025-02-15 00:39:46","author":"Philip Wegmann","authors":["Philip Wegmann"],"language":"en","category":"politics","source_country":"us","sentiment":-0.09},{"id":290660938,"title":"Sheryl Crow Waves Goodbye to Her Tesla, Pledges Money to NPR","text":"Sheryl Crow has had enough of Elon Musk. The singer shared a new Instagram post on Friday waving goodbye to her Tesla, confirming that she sold her car following Musk and President Donald Trump‘s efforts to gut government programs through the so-called Department of Government Efficiency (DOGE).\n\n “My parents always said… you are who you hang out with,” Crow wrote in her post, accompanied by Andrea Bocelli and Sarah Brightman’s “Time to Say Goodbye.” She added, “There comes a time when you have to decide who you are willing to align with. So long Tesla.”\n\n Crow shared that the money she made selling the car would go to NPR, which she said was “under threat by President Musk.” The singer said she was donating to the radio network “in hopes that the truth will continue to find its way to those willing to know the truth.”\n\n Crow’s support of NPR comes as the Trump administration continues to fight the press, as evidenced by Trump’s move to block the Associated Press from the Oval Office over the news outlet’s refusal to change its editorial style to refer to the Gulf of Mexico as the “Gulf of America.”\n\n Crow’s decision comes as Musk and Trump have spent the first month of the president’s second term dismantling the federal government. DOGE laid off thousands of government workers and in the past two weeks, Musk and DOGE have gone after the U.S. Agency for International Development as well as the Consumer Financial Protection Bureau (CFPB). \n\n Speaking with Rolling Stone earlier this week, Senator Elizabeth Warren, who originally proposed the creation of the CFPB, said the Administration’s actions have put the country on the brink of a “constitutional crisis.”\n\n “Come fight it out here in Congress,” Warren said. “But you have to be willing to stand up and defend your ideas and persuade people to vote for them. You don’t get to slither around in the dark and put a handful of teenage hackers into the middle of [America’s] payments systems, as a way to give yourself control of the functioning of our government. “\n\n Crow has been vocal of her disapproval of Trump and far-right politics for years. On election day, Crow confirmed she’d cast her ballot for Kamala Harris, saying she picked the candidate that represented “empathy, compassion, a heart for community and for those underserved, Not hate and division, bigotry, or racism.”","summary":"\"There comes a time when you have to decide who you are willing to align with,\" Crow wrote, adding that NPR was \"under threat by President Musk\"","url":"https://www.rollingstone.com/music/music-news/sheryl-crow-tesla-elon-musk-doge-trump-1235268865/","image":"https://www.rollingstone.com/wp-content/uploads/2025/02/sheryl-crow-tesla.jpg","video":null,"publish_date":"2025-02-15 00:25:35","author":"Ethan Millman","authors":["Ethan Millman"],"language":"en","source_country":"us","sentiment":-0.438},{"id":290683182,"title":"Trump's secret plan to destroy Kamala Harris a SECOND time","text":"Trump's secret plan to destroy Kamala Harris a SECOND time\n\nLISTEN: Welcome to MAGAland - Daily Mail’s behind the scenes podcast with White House insiders\n\nBy STEPHEN M. LEPORE FOR DAILYMAIL.COM\n\nPublished: 00:15 GMT, 15 February 2025 | Updated: 00:23 GMT, 15 February 2025\n\nDonald Trump could be setting up one of his most trusted aides for a second round with Kamala Harris. \n\nAfter her flop election performance against Trump in November, many have wondered what's next for the former vice president. \n\nSome have suggested she could return to politics in her home state of California, where Governor Gavin Newsom is term limited in 2026. \n\nHowever, Trump himself may yet again be an impediment to Harris achieving power, as one of his key allies says he'll run if she does.\n\nRichard Grenell, a former ambassador to Germany during Trump's first term, is also serving as an envoy for special missions in the president's administration and helping lead its response to the California wildfires. \n\nHe's also been involved in Trump's hostile takeover of the Kennedy Center, serving as interim president before the commander-in-chief was elected to the role himself.\n\nNow, the man who considered running in the recall election of Gavin Newsom in 2021 says he'll be there to say no to Harris should she try to run for the top job in his home state. \n\n'If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it's a new day in California, and that the Republican actually has a shot, and I wouldn't say no,' he said Friday.\n\nDonald Trump could be setting up one of his most trusted aides for a second round with Kamala Harris\n\nTrump himself may yet again be an impediment to Harris achieving power, as one of his key allies says he'll run if she does\n\nGrenell was speaking from Munich, where much of the Trump administration has set up shop for an early foreign policy trip. \n\nHarris has not yet declared that she will run but she has moved back to California after Trump's inauguration.\n\nInternal polling shared with the Hollywood Reporter last week shows the former vice president running away with the race if she ran, even as billionaire Rick Caruso is eying the contest.\n\nIn 2022, Caruso lost a close race for mayor of Los Angeles to Rep. Karen Bass, despite spending $104 million in his campaign, most of it from his own funds.\n\nThe government mismanagement of the Los Angeles wildfires in January has damaged the political reputation of Bass and other state Democrats, giving Caruso a possible opening in the heavy Democratic state.\n\n'If Kamala gets in the race, it will be hers to lose,' a political consultant monitoring the former vice president told THR. 'She may not have performed on the national level, but if you look at her track record in California, she’s done extremely well.'\n\nHarris lost her presidential race in 2024 to Trump but she remains popular in California despite some voters in the state shifting to the right. \n\nIt's unclear whether Harris wants to run for governor, as going back to California and running for state-wide office could be seen as a step back in her political career after serving as vice president.\n\nRichard Grenell, a former ambassador to Germany during Trump's first term, is also serving as an envoy for special missions in the president's administration and helping lead its response to the California wildfires\n\nGrenell, who considered running in the recall election of Gavin Newsom in 2021 says he'll be there to say no to Harris should she try to run for the top job in his home state\n\nThe path is not unheard of. \n\nFormer Vice President Richard Nixon lost his presidential race in 1960 against John F. Kennedy and ran for governor of California two years later. His campaign for California governor failed, but he ran for president again in 1968 and won.\n\nDemocratic insiders fully expect Harris to run for president again in 2028, even though her 106 day presidential campaign came up short against Trump after she replaced Biden.\n\nHarris is already leading the race for the Democratic nomination, largely thanks to her name recognition from the last campaign.\n\nA McLaughlin poll published in January showed Harris leading with 33 percent over second place potential rival Pete Buttigieg at nine percent and Gov. Gavin Newsom in third place with seven percent. \n\nAfter leaving the vice presidency in January, Harris and her husband Doug Emhoff immediately went to Los Angeles and visited firefighters and served food to wildfire evacuees.\n\nGrenell's California political experience amounts to working as a spokesman for Susan Goldin, the former mayor of San Diego and as a consultant for a San Diego City Council campaign. \n\nKamala HarrisGavin NewsomCalifornia\n\nShare or comment on this article:\nTrump's secret plan to destroy Kamala Harris a SECOND time\n\nAdd comment","summary":"Donald Trump could be setting up one of his most trusted aides for a second round with Kamala Harris.","url":"https://www.dailymail.co.uk/news/article-14399631/trump-secret-plan-destroy-kamala-harris-second-time.html","image":"https://i.dailymail.co.uk/1s/2025/02/15/00/95233829-0-image-a-2_1739577863766.jpg","video":null,"publish_date":"2025-02-15 00:23:59","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":0.076},{"id":290654848,"title":"Can Restaurants Force Customers to Tip? Photo of 'No Tip' Option Resurfaces","text":"Restaurants across the United States frequently add automatic gratuities to bills, particularly for large parties. While some diners appreciate the convenience, others question whether they are legally required to pay these charges. The practice of tipping is deeply ingrained in American dining culture, but its application varies significantly from other parts of the world, where service charges often replace tips entirely.This topic recently gained attention due to a viral Reddit post featuring a photo of a sticker placed over the \"no tip\" option on a digital payment terminal. Using TinEye, a reverse image search, Newsweek traced the image back to May 2024. Even so, the viral post hints at some customers' feelings of frustration that tipping has gotten out of control.Why It MattersTipping is a controversial issue in the U.S., with some customers feeling pressured to pay mandatory service charges while others argue that tipping should remain voluntary. With inflation and \"tipping fatigue\" becoming more prevalent, consumers are increasingly scrutinizing the practice of automatic gratuity.While some believe tipping should be purely voluntary, many service industry workers depend on gratuities as their primary source of income. The debate over tipping resurfaced during the 2024 election campaign when both President Donald Trump and former Vice President Kamala Harris promised \"no taxes on tips,\" bringing renewed attention to the role of gratuity in workers' livelihoods.What To KnowThere is no federal law requiring customers to tip, but automatic service charges added by a restaurant are legally enforceable in many states.\"No, they can't force you to tip if you make it optional,\" Bruce McAdams told Newsweek. McAdams is an associate professor for the School of Hospitality, Food and Tourism Management at the University of Guelph.\"But if you state there is a service charge and add it to the bill, it is legal and the customer is required to pay. Adding a 'service charge' has been common in the industry since the early 2000s for larger parties, usually six or more.\"Service charges are not classified as tips but rather as revenue for the restaurant, meaning the business is not necessarily obligated to pass them on to employees, according to Reader's Digest.The IRS defines a tip as a voluntary payment that the customer decides to give and determine its amount. A mandatory service charge does not meet these criteria and is instead considered a wage that can be taxed accordingly, according to Salon.Automatic gratuity is typically applied to large parties, often six or more guests, as McAdams said, and is usually around 18 percent to 20 percent of the bill. Restaurants must disclose these charges clearly to customers, either on the menu or verbally before the meal is ordered.What People Are SayingMcAdams also told Newsweek: \"In Canada and the USA there is currently no legislation about what companies can ask for tips, and for how much. Additionally, there is no law about placing an automatic 'service charge' on a bill. With an increase in more businesses (non-traditional) asking for tips, and with digital payment machines being set higher, there is a growing sense of fatigue from consumers in regards to tipping. We are now seeing the majority of consumers in Canada wanting to move away from tipping.\"Ryan McCall, principal attorney with McCall Sweeney & Silva, told Newsweek: \"Mandatory tipping is a relative gray area from the standpoint of the federal government. Barring individual state laws saying otherwise, restaurants are well within their power to charge automatic gratuities (which from a consumer perspective is often treated as a tip) for large parties or even solo diners, and this is somewhat common in the United States. With that being said, most states have guidelines that require restaurants to disclose mandatory gratuities as well as service charges prior to someone dining at their establishment.\"Ben Farrow, LegalShield Provider attorney, told Newsweek: \"While it might seem like they are \"forcing\" a tip, the legality is a bit nuanced. There's no law requiring customers to leave a tip. A true tip is defined by the IRS as something optional and determined solely by the customer. What restaurants often do is add a mandatory service charge, sometimes called a \"gratuity,\" to the bill. This is perfectly legal. It's not technically a \"mandatory tip\" because it's not considered a tip at all; it's considered revenue for the restaurant.\"What's NextThe debate over tipping and service charges is likely to continue as more businesses experiment with alternative models, such as increasing base wages and eliminating tips altogether. Some restaurants have tested \"service-included\" pricing, where gratuity is factored into menu prices, but this model has not gained widespread acceptance.","summary":"While legal experts agree that restaurants cannot \"force tips,\" customers may still see automatic gratuity on their bill. Here's why.","url":"https://www.newsweek.com/restaurants-force-tipping-mandatory-photo-reddit-2031639","image":"https://d.newsweek.com/en/full/2589141/waitress-takes-cash-tip.jpg","video":null,"publish_date":"2025-02-14 23:41:49","author":"Jenna Dejong,Suzanne Blake","authors":["Jenna Dejong","Suzanne Blake"],"language":"en","source_country":"us","sentiment":0.12},{"id":290651540,"title":"The Latest: Federal workers face mass layoffs","text":"Federal workers all over the country responded with anger and confusion Friday toward President Donald Trump and his administration’s aggressive effort to shrink the size of the federal workforce by ordering agencies to lay off probationary employees who have yet to qualify for civil service protections.\n\nMeanwhile, Ukrainian President Volodymyr Zelenskyy said he will only agree to meet in person with Russian leader Vladimir Putin after a common plan is negotiated with Trump. Vice President JD Vance will meet with Zelenskyy later on for talks about how to negotiate a settlement to the Russia-Ukraine conflict.\n\nHere's the latest:\n\n Court order pauses any mass layoffs and data deletion at Consumer Financial Protection Bureau \n\nThe Trump administration agreed to halt any plans for mass layoffs, deletion of data or removal of funding from the Consumer Financial Protection Bureau.\n\nThe agreement was ordered by a judge after the employees’ union filed a lawsuit to prevent the agency’s dismantling. Their lawyers argued Friday that fast action was needed to prevent large-scale firings and deletion of its data.\n\nThe order will stay in place at least until March 3, when U.S. District Judge Amy Berman Jackson will hear arguments in the case.\n\nThe administration has already ordered the CFPB to stop nearly all its work and closed its building.\n\nThe agency was created to protect consumers after the 2008 financial crisis and subprime mortgage-lending scandal.\n\n ‘None of this has been done thoughtfully or carefully’ \n\nNicholas Detter had been working in Kansas as a natural resource specialist, helping farmers reduce soil and water erosion, until he was fired by email late Thursday night.\n\nThat’s despite Detter, who had been employed by the Agriculture Department’s Natural Resources Conservation Service, agreeing to the administration’s deferred resignation program, under which he was supposed to be paid until Sept. 30 if he agreed to quit.\n\nDetter responded to the letter accepting the deferred resignation, according to documents shared with The Associated Press. While his response was acknowledged, he never received the official agreement.\n\nHe said when the Trump administration first announced the deferred resignation program, he understood that it was part of an effort to improve the efficiency of the federal government, but he said “that’s not what this has been.”\n\n“None of this has been done thoughtfully or carefully,” he said\n\nDetter said laying off workers like him will create backlogs in the program that was created in the wake of the 1930s Dust Bowl to try keep America’s farmland healthy and productive.\n\n ‘In order to help veterans, you just fired a veteran’ \n\nAmong those impacted by the federal layoffs is Andrew Lennox, a 10-year Marine veteran who was working as a probationary employee at the Veterans Affairs Medical Center in Ann Arbor, Michigan.\n\nHe received an email Thursday evening “out of the blue” informing him that he was being terminated.\n\n“In order to help veterans, you just fired a veteran,” said Lennox, 35, a former USMC infantryman who was deployed to Iraq, Afghanistan and Syria.\n\nLennox had been working as an administrative officer at the VA since mid-December and said he “would love nothing more” than to continue the work.\n\n“This is my family, and I would like to do this forever,” he said.\n\nIn a post on its website, the VA announced the dismissal of more than 1,000 employees, saying the personnel moves “will save the department more than $98 million per year” and be better equipped to help vets.\n\n“I was like: ‘What about this one,’” Lennox said.\n\n Anger, chaos and confusion take hold as federal workers face mass layoffs \n\nFederal workers were responding with anger and confusion Friday as they grappled with the Trump administration’s latest effort to shrink the size of the federal workforce by ordering agencies to lay off probationary employees who have yet to qualify for civil service protections.\n\nAs layoff notices began to go out agency by agency this week, federal employees from Michigan to Florida were left reeling from being told that their services were no longer needed.\n\nMany of those impacted say they had already accepted the administration’s deferred resignation offer, under which they were supposed to be paid until Sept. 30 if they agreed to quit. That left some wondering how many others who signed will nonetheless be fired.\n\nThe White House and Office of Personnel Management, which serves as a human resources department for the federal government, declined to say Friday how many probationary workers, who generally have less than a year on the job, have so far been dismissed.\n\n▶ Read more about the Trump administration’s efforts to slash the government workforce\n\n Victoria Canal to perform as scheduled at Kennedy Center after others canceled \n\nSinger-songwriter Victoria Canal has decided to perform as scheduled at the Kennedy Center on Saturday, but she will donate all of her proceeds to Trans Equality Now.\n\nSince Trump fired the board of directors and was elected board chair of the center, numerous officials and performers have quit or canceled appearances, including the actor Issa Rae.\n\nIn a statement issued Friday through her manager, Canal noted she had been recognized at the Kennedy Center during the Obama administration as a Presidential Scholar in the Arts, a “memory I still cherish.”\n\n“After learning about the changes in leadership at the Kennedy Center, including Trump becoming self-appointed Chairman, I was debating whether or not to perform,” she said.\n\n“I am a proud queer, Latina, disabled woman and ally to the unprotected and vulnerable trans community in the United States,” she added. “I figured if the new guys want to eliminate DEI, I’ll let them decide to cancel the show if they want to — otherwise, see you February 15th.”\n\n North Carolin a State University freezes hiring over ‘uncertain’ federal budget \n\nNCSU is the state’s largest public university by population, with more than 38,400 students as of Fall 2024.\n\n“Given the uncertain impacts of the presidential administration’s Executive Orders and guidance, the potential shut down of the federal government on March 14, and financial challenges that the state government is dealing with, leadership is becoming increasingly concerned with our budgets over the next year or two,” Warwick Arden, the university’s executive vice chancellor, said in a memo to the university’s college deans and vice provosts.\n\nStudent workers, including graduate student appointments, and part-time employees are not a part of the hiring freeze, Arden said.\n\n“I also encourage you to be conservative in the use of all your funds given the challenging financial climate we currently find ourselves in,” Arden added.\n\n Trump and Musk will jointly appear with Sean Hannity \n\nThe president and the billionaire will sit with the Fox News host next week, the network announced on Friday.\n\nIt’s their first televised sit-down together and comes as Musk leads Trump’s effort to slash the size and scope of the government, with efforts to freeze spending and fire federal workers proceeding in earnest.\n\n New VA secretary plans 1,000-plus layoffs, promises no harm to veteran care or benefits \n\nTop Republicans say they trust Doug Collins. Democrats have no such faith that cutting $98 million through dismissals won’t harm veterans.\n\n“I take Secretary Collins at his word when he says there will be no impact to the delivery of care, benefits, and services for veterans with this plan,” said Rep. Mike Bost, the Republican chairman of the House Committee on Veterans’ Affairs.\n\nThe ranking Democrat, Rep. Mark Takano, said the firings show a shocking disregard. The terminated include disabled veterans, military spouses and medical researchers.\n\n Trump spoke to Britain’s prime minister, plans to meet soon \n\nTrump said Keir Starmer asked during their phone call Thursday to visit him in the U.S., which he accepted.\n\n“Friendly meeting, very good. We have a lot of good things going on,” he said.\n\nNo date was set, Trump said, but it could be next week or the week after.\n\n Vance met with German far-right leader during visit to Munich, his office says \n\nAlice Weidel is the co-leader and candidate for chancellor of the far-right and anti-immigrant Alternative for Germany party.\n\nVance met Weidel during a visit to Munich on Friday, nine days before a German election, in which he lectured European leaders about the state of democracy and said there is no place for “firewalls.”\n\nMainstream German parties say they won’t work with the party, which polls put in second place ahead of the Feb. 23 election.\n\n Trump order targets schools and colleges mandating COVID-19 vaccines \n\nSchools, colleges and states that require immunizations against COVID-19 may risk of losing federal money under an executive order President Donald Trump signed Friday.\n\nIt should have little national impact: Most schools have dropped such mandates. And it isn’t clear what money is at risk.\n\nCandidate Trump often said he would “not give one penny to any school that has a vaccine mandate,” but this order applies only to COVID-19 vaccines.\n\nAll states require schoolchildren to be vaccinated against certain diseases including measles, mumps, polio, tetanus, whooping cough and chickenpox. And all allow exemptions for certain medical or religious reasons.\n\n▶ Read more about Trump’s executive order on vaccines\n\n Trump denied knowing about handling of NYC mayor’s case and then opined \n\nThe president was asked by a reporter at the White House about the prosecutors resigning over the Justice Department’s push to drop the criminal case against New York City’s mayor.\n\n“I know nothing about the individual case. I know that they didn’t feel that it was much of a case,” Trump said.\n\n“It looked to me to be very political,” he added, and questioned why the prosecutors didn’t complain weeks earlier, though the prosecutors began raising objections this week when instructed to drop the case.\n\n▶ Read more on Trump and the mayor’s corruption case\n\n Another prosecutor resigns with Justice Department in turmoil over NYC mayor’s case \n\nProsecutor Hagan Scotten is at least the seventh to resign rather than follow Trump administration orders in the corruption case.\n\nScotten told acting deputy U.S. Attorney General Emil Bove on Friday it would take a “fool” or a “coward” to meet his demand to drop the charges.\n\nBove told prosecutors that Mayor Eric Adams is needed to support the administration’s immigration enforcement and that the charges could be reinstated after this year’s mayoral election.\n\nA Special Forces troop commander in Iraq who graduated at the top of his Harvard Law class and clerked for Chief Justice John Roberts, Scotton wrote Bove: “No system of ordered liberty can allow the Government to use the carrot of dismissing charges, or the stick of threatening to bring them again, to induce an elected official to support its policy objectives.”\n\n▶ Read more from Scotten’s letter\n\n The art of the deal? Ukraine’s president says peace with Russia depends on Trump \n\nVolodymyr Zelenskyy appealed to Trump’s dealmaking history in seeking the U.S. president’s leadership to end the Russia-Ukraine conflict.\n\n“He is a strong man. And if he will choose our side, and if he will not be in the middle, I think he will pressure and he will push Putin to stop the war. He can do it,” Zelenskyy said.\n\nU.S. Defense Secretary Pete Hegseth said, “President Trump will be the one at the table with Zelenskyy and Putin,” and he expects Putin to claim victory ”no matter what.”\n\n“I think everyone will try to come out of this situation as winners,” Zelensky acknowledged. “The United States wants victory. The Russians want this victory very much, you understand. And Ukraine — it deserves it, that’s all.”\n\n▶Read more about Trump’s dealmaking with Russia and Ukraine\n\n Second federal judge pauses Trump’s order against gender-affirming care for youth \n\nA second federal judge on Friday paused Trump’s executive order halting federal support for gender-affirming care for transgender youth under 19.\n\nU.S. District Court Judge Lauren King granted a temporary restraining order after the Democratic attorneys general of Washington state, Oregon and Minnesota sued the Trump administration last week. Three doctors joined as plaintiffs in the suit, which was filed in the Western District of Washington.\n\nThe decision came one day after a federal judge in Baltimore temporarily blocked the executive order in response to a separate lawsuit filed on behalf of families with transgender or nonbinary children.\n\nJudge Brendan Hurson’s temporary restraining order will last 14 days but could be extended, and essentially puts Trump’s directive on hold while the case proceeds. Hurston and King were both appointed by former President Joe Biden.\n\n▶ Read more on the Seattle lawsuit and what the ruling means\n\n Veteran budget hawks give mixed reviews on Musk’s progress \n\nThe Associated Press interviewed four such conservatives about Musk’s effort to slash the federal workforce and disfavored programs.\n\nSome point to early successes. Others see DOGE stoking outrage without targeting the biggest spending: defense spending and programs with bipartisan support like Medicare and Social Security.\n\nThe DOGE website claims at least $5.6 billion in savings so far — a tiny fraction of Musk’s initial goal of $2 trillion.\n\n“This thing has paid for itself many times over now,” said Grover Norquist, founder of Americans for Tax Relief.\n\nBut Manhattan Institute senior fellow Jessica Riedl said: “So far, DOGE seems more about looking for symbolic culture war savings than truly reducing the budget deficit in any meaningful way.”\n\n▶ Read more about how budget hawks view DOGE’s progress\n\n New Ag secretary promises layoffs at her agency \n\n“Clearly it’s a new day,” new Agriculture Secretary Brooke Rollins told reporters outside the White House.\n\nShe said Trump’s winning back the presidency shows the American people “believe that government was too big.”\n\nRollins said Elon Musk’s government efficiency team was working at her agency and that it had already canceled some contracts and nearly 1,000 employee trainings related to diversity, equality and inclusion.\n\nRollins also said she’d welcome input from the Department of Government Efficiency on the nation’s food stamp program.\n\n Trump’s government layoffs could affect economic numbers \n\nTrump’s mass layoffs of federal workers and spending freezes could come back to bite him in the economic data.\n\nThe monthly jobs reports could start to show a slowdown in hiring, if not go negative at some point after the February numbers are released. The last time the economy lost jobs during a month was in December 2020, when the United States was still muscling its way out of the coronavirus pandemic.\n\n“Overall, it doesn’t seem that DOGE has managed to actually cut spending substantively yet — instead they’ve just created chaos,” said Martha Gimbel, executive director of the Budget Lab at Yale University. She noted that employers that rely on government grants and contracts would also show declines in hiring, if not worse.\n\n“Given everything that is happening in the federal government, it is very plausible that job growth could turn negative at some point,” Gimbel said. “But it may take a few more reports for the impact to show up.”\n\n Trump’s new tariffs are being felt on Broadway \n\nThe Golden Theatre marquee for the new musical “Operation Mincemeat” is dark because special light bulbs ordered to spell out the show’s title are stuck in China, said Rick Miramontez, president of DKC/O&M and a spokesman for the show.\n\nThousands of the ceramic yellow LED bulbs by Satco were meant to arrive in early February, in time to install them for Saturday’s first preview. Now the show on the Great White Way, named after Broadway’s famous theater lights, will have to welcome theatergoers with a blank space.\n\nOn Feb. 1, Trump announced a 10% tariff on imports from China, which led the country to quickly implement retaliatory tariffs on select American imports.\n\nThe bulbs have apparently been caught in the contest. The ad agency in charge of the marquee was told March would be the earliest they’d arrive.\n\n Ukraine wants ‘security guarantees’ as Trump seeks to end Ukraine-Russia war, Zelenskyy says \n\nZelenskyy made his remarks Friday during a meeting with U.S. Vice President JD Vance. The two met at the Munich Security Conference.\n\nMany observers, particularly in Europe, are hoping Vance will shed at least some light on U.S. President Donald Trump’s ideas for a negotiated settlement to the war.\n\n European ministers hit back against Vance’s complaints about the state of their democracies \n\nGerman defense minister Boris Pistorius said U.S. Vice President JD Vance’s comparison of Europe to “ugly Soviet-era” authoritarianism was unacceptable.\n\nVance lectured European governments about free speech nine days before Germany’s election, accusing them of hostility to the idea that “somebody with an alternative viewpoint might express a different opinion or, God forbid, vote a different way, or even worse, win an election.”\n\nPistorius countered that Germany’s right-wing AfD party can campaign completely normally, and “democracy doesn’t mean that the loud minority is automatically right.”\n\n“Democracy must be able to defend itself against the extremists who want to destroy it,” Pistorius said.\n\n▶ Read more on European reaction to Vance’s lecture on democracy\n\n Democrats tell White House that firing USAID’s top watchdog was illegal \n\nTwo senior Senate Democrats are asking President Donald Trump to reinstate the top watchdog for the U.S. Agency for International Development, calling his firing illegal.\n\nSens. Jeanne Shaheen, the ranking Democrat on the foreign affairs committee, and Gary Peters, the top Democrat on the homeland security committee, wrote Trump saying the firing of Inspector General Paul Martin without justification appeared to be an act of retaliation.\n\nMartin’s office had released a report the day before warning that dismantling USAID had all but eliminated proper oversight for billions of dollars in unspent humanitarian funds.\n\nShaheen and Peters say the law requires 30 days notice to Congress and a reason.\n\n Study: Excluding people in the US illegally from Census results wouldn’t impact party power \n\nRepublicans are trying again to exclude people in the U.S. illegally from the numbers used to portion out congressional seats among the states. But a new study suggests their inclusion has had little impact on presidential elections or control of Congress.\n\nIf residents lacking permanent legal status had been excluded from the apportionment process from 1980 to 2020, no more than two House seats and three Electoral College votes would have shifted between Democrats and Republicans, according to demographers from the University of Minnesota and the Center for Migration Studies of New York.\n\n“This would have had no bearing on party control of the House or the outcome of presidential elections,” they wrote.\n\n▶ Read more about the GOP push to change how Census numbers determine state representation\n\n Viktor Orbán predicts Trump will bring Russia back into Western fold after end of Ukraine war \n\nHungary’s nationalist prime minister said Trump’s administration will reconnect Russia with Europe’s economies and energy networks if the war in Ukraine ends.\n\n“The United States has initiated a change that puts the whole Western world’s system of arguments, value system, and way of thinking on a new track,” Orbán said on Hungary’s state radio. “This process is progressing much faster than many people thought. We call this the Trump tornado.”\n\nHungary, unlike most European countries, continues to rely on Russian oil and gas. Orbán predicted the European Union will “fall apart” if energy prices aren’t brought down.\n\n▶ Read more on the Hungarian leader’s views of Trump\n\n Zelenskyy says he will only agree to meet with Putin after common plan with Trump is negotiated \n\nDuring the Munich Security Conference, Zelenskyy said he would only agree to meet in person with Russian leader Vladimir Putin after a common plan is negotiated with U.S. President Trump.\n\nHe also said he believes Trump is the key to ending the Russia-Ukraine conflict, and that the U.S. president had given him his cellphone number.\n\n Trump envoy Richard Grenell says he might run for California governor if Kamala Harris runs \n\nGrenell, currently working on special projects for Trump, suggested he’d be interested in the 2026 race to succeed Democrat Gavin Newsom if the former vice president throws her hat in the ring.\n\n“If Kamala Harris runs for governor, I believe that she has such baggage … that it’s a new day in California, and that the Republican actually has a shot,” Grenell told reporters. “And I wouldn’t say no.”\n\nGrenell spoke after taking part in Vice President JD Vance’s meetings with world leaders in Munich.\n\nHarris hasn’t publicly expressed an interest in the governor’s race, but would be a heavy favorite to win the Democratic nomination.\n\n Federal workers rally against government-wide layoffs \n\nA large group of federal workers and labor activists rallied in Washington Friday morning against the layoffs.\n\nMany wore masks to protect their identities, for fear of reprisal from the administration. One carried an enormous silver spoon covered in aluminum foil, in reference to the “Fork in the Road” letter informing federal workers of government-wide buyouts.\n\nOne rally-goer who identified himself as Jeff, held a “No One Voted for Elon Musk” sign. He said Democrats should be more forceful, saying “We can’t fight illegality with legality.”\n\n▶ Read more about layoffs of federal workers\n\n Zelenskyy calls for US and Europe to band together to support Ukraine in war against Russia \n\nZelenskyy spoke Friday at the Munich Security Conference, saying that the United States, including the Biden administration, never saw Ukraine as a NATO member.\n\nHe is expected to meet later with U.S. Vice President JD Vance.\n\nTrump has upended years of steadfast U.S. support for Ukraine. Many observers, particularly in Europe, hope Vance will shed at least some light on Trump’s ideas for a negotiated settlement to the war following a phone call between Trump and Russian leader Vladimir Putin this week.\n\n▶ Read more about Zelenskyy and Vance’s comments at the Munich Security Conference\n\n CDC to lose one-tenth of workforce under Trump administration job cuts \n\nNearly 1,300 probationary employees at the Centers for Disease Control and Prevention — roughly one-tenth of the agency’s workforce — are being forced out under the Trump administration’s move to get rid of all probationary employees.\n\nThe Atlanta-based agency’s leadership was notified of the decision on Friday morning. The verbal notice came from the U.S. Department of Health and Human Services in a meeting with CDC leaders, according to a federal official who was at the meeting. The official was not authorized to discuss it and spoke to The Associated Press on condition of anonymity.\n\nThe affected employees are supposed to receive four weeks of paid administrative leave, the official said, adding that it wasn’t clear when individual workers would receive notice.\n\nWith a $9.2 billion core budget, the CDC is charged with protecting Americans from outbreaks and other public health threats. Before the cuts, the agency had about 13,000 employees, including more than 2,000 staff work in other countries.\n\n JD Vance: ‘In Washington, there is a new sheriff in town’ \n\nThe vice president warned Europe’s elected officials that they risk losing public support if they don’t quickly change course.\n\n“If you’re running in fear of your own voters there’s nothing America can do for you,” he told the Munich security conference.\n\nVance’s speech made just a passing mention of the 3-year-old Russia-Ukraine conflict at a time of intense concern and uncertainty over the Trump administration’s foreign policy.\n\n▶ Read more on the Trump administration’s statements in Munich\n\n Treasury watchdog begins audit of Musk DOGE team’s access to federal government’s payment system \n\nThe Treasury Department’s Office of Inspector General said it was launching an audit of the security controls for the federal government’s payment system after Democratic senators raised red flags about the access provided to Trump aide Elon Musk’s Department of Government Efficiency team.\n\nThe audit will also review the past two years of the system’s transactions as it relates to Musk’s assertion of “alleged fraudulent payments,” according to a letter from Loren J. Sciurba, Treasury’s deputy inspector general, that was obtained by The Associated Press.\n\nThe audit marks part of the broader effort led by Democratic lawmakers and federal employee unions to provide transparency and accountability about DOGE’s activities under President Donald Trump’s Republican administration. The Musk team has pushed for access to the government’s computer systems and sought to remove tens of thousands of federal workers.\n\n▶ Read more about the inspector general’s audit of US government payment system security\n\n Education Department cuts over $300 million in contracts to help schools apply best practices \n\nThe Trump administration is cutting $336 million in contracts designed to help schools and states adopt best practices in the classroom.\n\nAn Education Department news release said officials uncovered “wasteful and ideologically driven spending” at 10 regional centers hired to help schools apply research such as “equity audits.”\n\nThe department said it plans to open new contracts to replace the Regional Educational Laboratories. They were ordered by Congress in 1965 and are still required under federal law, with a mission to support school policies that improve student outcomes.\n\nTrump officials also cut four contracts for equity service centers totaling $33 million. Without providing evidence, the department said the centers supported “divisive training in DEI, Critical Race Theory and gender identity.”\n\n ‘Power of Europe and America in the world’ at stake in Russia-Ukraine talks \n\nVance met separately with German President Frank-Walter Steinmeier, NATO Secretary-General Mark Rutte and British Foreign Secretary David Lammy, and said NATO members must spend more on their militaries.\n\nVance told Rutte that the Trump administration wants to ensure “that NATO does a little bit more burden sharing in Europe, so the United States can focus on some of our challenges in East Asia.”\n\nRutte agreed: “We have to grow up in that sense and spend much more.”\n\nSteinmeier told the conference that how exactly the Russia-Ukraine war ends “will have a lasting influence on our security order and on the position of power of Europe and America in the world.”\n\n▶ Read more on developments in Munich","summary":"Federal workers all over the country have responded with anger and confusion Friday toward President Donald Trump's aggressive effort to shrink the size of the federal workforce","url":"https://www.independent.co.uk/news/world/europe/donald-trump-jd-vance-vladimir-putin-elon-musk-consumer-financial-protection-bureau-b2698697.html","image":"https://static.independent.co.uk/2025/02/14/19/APTOPIX_Trump_Modi_48853.jpg?width=1200","video":null,"publish_date":"2025-02-14 23:09:11","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.358},{"id":290646078,"title":"'You're my rock': Politicians trade roses and thorns this Valentine's Day","text":"Political power couples celebrated their love on social media this Valentine's Day — but not without a few jabs from opposing political parties. Several political organizations took to X to post Valentine's Day messages trolling their rivals, including a meme from the White House with a message to illegal immigrants. \"Violets are blue, come here illegally, and we'll deport you,\" the official Trump White House X account posted. Some X users embraced the deportation meme, while others found it insensitive. The top reply on the White House's post says: \"ROSES ARE RED VIOLETS ARE BLUE YOUR ANCESTORS WERE IMMIGRANTS AND SO ARE YOU LET'S EMBRACE OTHERS AND THEIR DREAMS TOO.\" Chris LaCivita, a GOP political strategist and a former advisor to President Donald Trump, posted a photo of Trump with a bandage on his ear from the July 2024 assassination attempt captioned, \"I'd take a bullet for you.\" A Valentine from the Republican National Committee to the Democratic National Committee said: \"Roses are red, violets are blue; We won seven Swing States, what did you do?\" Democrats had some fun with their Valentine's Day message, too, poking fun at the power dynamics at play between Elon Musk and Trump. \"The left can't meme,\" multiple users replied to the Democrats' post on X. Another X user replied with a photo of Trump and former first lady Jill Biden speaking at the reopening of the Notre Dame captioned: \"Will you be my Valentine?\" Former President Barack Obama and former first lady Michelle Obama celebrated 32 years of marriage with matching selfies across their social media accounts amid divorce rumors. \"If there's one person I can always count on, it's you, @BarackObama. You're my rock. Always have been. Always will be. Happy Valentine's Day, honey!\" Michelle said. Former President Joe Biden joined the love fest with a photo of his wife Jill sporting a \"LOVE\" jacket captioned, \"Happy Valentine's Day, Jilly!\" PRINCE WILLIAM STEALS KISS FROM KATE MIDDLETON IN RARE VALENTINE’S DAY PHOTO Former second gentleman Doug Emhoff posted a photo wishing former Vice President Kamala Harris a happy Valentine's Day, saying, \"Grateful to be by your side through it all.\" Robert F. Kennedy, Jr., fresh off being sworn in as Secretary of Health and Human Services, posted a photo on a hike with his wife, actress Cheryl Hines. He thanked her for \"being my partner in this adventure.\" SENATE CONFIRMS ROBERT F KENNEDY JR. TO SERVE AS TRUMP'S HEALTH SECRETARY \"Thanking the love of my life Dina for her incredible support and love during the craziest year of our lives! Happy Valentine's Day!\" Sen. Dave McCormick, R-Pa., said to his wife Dina, who served as deputy national security advisor during President Donald Trump's first term. Sen. Chuck Grassley, R-Iowa, posted a charming photo with his valentine of 70 years. Meanwhile, Sen. Tim Scott, R-S.C., wished his wife Mindy a happy first Valentine's Day as a married couple. The 59-year-old was a longtime bachelor before announcing his engagement to a \"lovely Christian girl\" in January 2024. The couple got married in August at the Seacoast Church in Mount Pleasant, South Carolina. California Gov. Gavin Newsom thanked his wife, Jennifer Siebel Newsom, for championing the rights of Californians. \"Happy Valentine’s Day, Jen. I’m lucky to call my best friend the love of my life. Thank you for all that you do to champion the rights of Californians. I love you,\" Newsom said in a post. Rep. Byron Donalds, R-Fla., posted a throwback photo with his wife of 25 years, calling the life they built in Southwest Florida his \"greatest blessing.\" \"My high school sweetheart, the mother of our four amazing kids, the love of my life, and Pennsylvania's First Lady! Happy Valentine’s Day, Lori,\" Pennsylvania Gov. Josh Shapiro wrote in a post. Speaker of the House Mike Johnson, R-La., wished his wife a happy Valentine's Day with an Audrey Hepburn quote: \"The best thing to hold onto in life is each other. CLICK HERE TO GET THE FOX NEWS APP New York City Mayor Eric Adams opted for a solo photo, holding up heart hands in his Valentine's Day post and telling New Yorkers what he really loves is \"making our city MORE affordable, building even MORE affordable housing, and making sure EVERY New Yorker has a job…so they can treat their boo to a night out.\"","summary":"Political power couples celebrated Valentine&apos;s Day on social media this year — but not without a few jabs from opposing parties.","url":"https://www.foxnews.com/politics/politicians-trade-roses-thorns-valentines-day","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/valentines-day.png?ve=1&tl=1","video":null,"publish_date":"2025-02-14 22:52:51","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","category":"politics","source_country":"US","sentiment":0.363},{"id":290659004,"title":"Jon Stewart slaps down Jen Psaki for claiming Joe Rogan and Theo Von are part of the 'Trump' enterprise","text":"Jon Stewart pushed back against former White House Press Secretary Jen Psaki's remarks that both Joe Rogan and Theo Von are part of the right-wing 'ecosystem' feeding the 'Trump enterprise.'\n\nOn the most recent episode of The Weekly Show Jon Stewart podcast, the 62-year-old comic claimed the left was falling far behind conservatives as he referred to it as 'chaos.'\n\n'I do think there should be some semblance of an idea that, look, they're kicking progressive ass right now,' Stewart said. 'And if progressives don't organize their media, their think tanks, and all that, it's going to continue to happen. It's chaos.'\n\nIn response, Psaki argued that 'there is not a left ecosystem that matches the right ecosystem' as she brought up Von's appearance on The Joe Rogan Show, claiming that those on the right promote what each other and elected officials do.\n\nAfter Stewart disagreed, claiming that both comedians are 'promoting an ideological worldview' and aren't 'part of any machine', the 46-year-old political analyst doubled down. \n\n'No, I would consider them in more probably libertarian comedic complex, you know,' Stewart responded while chuckling. \n\n'If you watch or listen to their shows, a lot of times it's just pure goofing off.'\n\nPsaki then admitted to placing the comedy-pair loosely in the right-wing category. However, she still said that the duo are supportive of the Trump administration. \n\n'I think they are supportive, but they are not relentless in the Trump enterprise,' Stewart argued. 'They are not Charlie Kirk. They are not Ben Shapiro. They are very different animals.'\n\n'They are not invested in,' he added. 'But on balance, that's not what their shows are about.'\n\nRogan has recently been halted back into the spotlight for his politics after he endorsed President Donald Trump last minute.\n\nEarlier this week, the 57-year-old podcaster claimed that former President Joe Biden diverted Americans from noticing 'inappropriate spending,' and that the Department of Government Efficiency (DOGE) is cracking down.\n\nSince Donald Trump returned to the White House on January 20, Elon Musk, who he appointed as the head of DOGE, has been uncovering and dismantling projects that have been funded by billions of US taxpayers' dollars.\n\nRogan's comments came after he sat down with comedian Bridget Phetasy on Monday. During the episode, the pair discussed the 'beach balls' Biden 'tossed around' during his time in office.\n\n'It's not just the money being spent, it's what it's being spent for and what's going on, which is an enormous propaganda machine,' Rogan said. \n\n'This is why Trump won the election. People don't really believe in these things. The amount of people that think that transgender biological males should be competing against your daughter in sports is so f**king small, but yet, our own government was propping it up. \n\n'And why are they propping it up? Because it's a f**king beach ball at a concert, you keep tossing it up in the air and everybody gets distracted,' he explained, referring to social issues like gay marriage, abortion and transgender rights.\n\n'As long as you can keep a few things going. Here's the things you ought to keep going: Abortion, right? Overturning Roe V. Wade is so good for business because now it's like a battle, the battle grounds, and women's rights and their lives are at stake.\n\n'Gay marriage - that's a huge one. They're gonna take away gay marriage, oh my God, bounce that f**king beach ball,' Rogan continued as he raised his hands above his head, simulating a ball being thrown in the air.\n\nRogan also discussed with the comedian that for the past 'eight to 10 years,' the 'left-wing narrative' has been filled with 'propaganda funded by our own government.' \n\n'That's right!' Phetsay said as she laughed.\n\nHe went on to give an example of Biden 'tossing around beach balls every now and again,' in an effort to distract Americans while his administration was 'siphoning billions of dollars.'\n\n'Zelenskyy just said he's missing $100 billion out of the $177 billion that we supposedly sent there [Ukraine],' he said. \n\nVon, who has been a frequent guest on Rogan's podcast, has also become more outwardly political during the 2024 election.\n\nTrump was also a guest on the 44-year-old comedian's podcast ahead of the election, where the pair spoke about addiction battles with substances such as drugs and alcohol.\n\nVon was also seen at the inauguration at the US Capitol last month where he was seated next to 29-year-old Logan Paul.\n\nPaul captured and shared the moment when Von fell backward and broke his chair during the ceremony.\n\nIn the clip Paul shared to X, which was titled MAKE CHAIRS GREAT AGAIN - the Covington, Louisiana-born entertainer's chair buckled out from under him, as Trump could be heard in the background speaking.\n\nPeople nearby asked Von if he was OK after the startling incident, as Paul said he predicted someone's chair would fail earlier.\n\nOne person nearby wisecracked that Von had been sitting in 'one of Kamala's chairs,' in reference to ex-Vice President Kamala Harris, who opposed Trump in the presidential election.\n\nVon, who didn't appear to be injured in the incident, sat back down in a chair alongside Logan Paul and his sibling, Jake Paul.\n\nVon acknowledged the accident on X on Monday, writing in response to Paul's clip, 'Thought we were past the pranks boys.'\n\nSaid Von: 'Got a chance to go to the presidential inauguration today and i just cant believe i got to be at that.\n\n'Some countries don't even let you vote.'\n\nVon said he 'just felt really lucky to see that.'\n\nRogan has since objected the idea that comedians are being lumped into the 'right ecosystem' - claiming that both he and Von's shows rarely touch on politics, Mediaite reported. \n\nThe star podcaster claimed that their episodes are amplified - overall feeding into the public perception that several entertainers are much more political than they actually are.","summary":"Comedian Jon Stewart objected to former White House Press Secretary Jen Psaki's remarks that both Joe Rogan and Theo Von are part of the right-wing 'ecosystem' feeding the 'Trump enterprise.'","url":"https://www.dailymail.co.uk/media/article-14399223/Jon-Stewart-slaps-Jen-Psaki-claiming-Joe-Rogan-Theo-Von-Trump-enterprise.html","image":"https://i.dailymail.co.uk/1s/2025/02/14/21/95230993-0-image-a-43_1739568549711.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/08/7331384654208188952/1024x576_MP4_7331384654208188952.mp4","publish_date":"2025-02-14 22:08:08","author":"Editor,Kelly Garino","authors":["Editor","Kelly Garino"],"language":"en","source_country":"gb","sentiment":-0.26},{"id":290639654,"title":"Trump Official Hints at Potential Governor's Run if Harris Throws Hat In","text":"Richard Grenell, President Donald Trump's envoy for special missions, \"wouldn't say no\" to running for California governor if former Vice President Kamala Harris entered the race, Politico reported on Friday.Newsweek reached out to Grenell at the Kennedy Center and Harris' office via online form.Why It MattersHarris previously served as California's attorney general and in the U.S. Senate. Since losing the 2024 presidential election to Trump, she has not made her next political move explicitly clear.An October poll by UC Berkeley put Harris as the top contender to replace the Golden State's current Democratic Governor Gavin Newsom. The poll showed 72 percent of Democrats being very likely or somewhat likely to support her bid. In a subsequent poll earlier this month among 469 registered voters by Emerson College, Harris garnered the most support of any Democratic candidate.What To KnowWhile speaking to reporters in Munich about the 2026 gubernatorial race, Grenell said, \"If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it's a new day in California, and that the Republican actually has a shot, and I wouldn't say no,\" Politico reported.Grenell lives in the Los Angeles area and after Trump's inauguration he toured areas recently impacted by the deadly wildfires that tore through Southern California. Grenell, a frequent Newsom critic, also voiced on social media that federal aid potentially sent to California should \"have strings.\"\"Without commonsense reforms, @GavinNewsom and his cronies will ensure we have another catastrophic fire without water available to fight it,\" Grenell wrote in part last week on X, formerly Twitter.According to CBS News on Wednesday, Riverside County Sheriff Chad Bianco is also expected to announce his bid for governor next week. Bianco is an avid Trump supporter.The last Republican elected to serve the state as governor was Arnold Schwarzenegger in 2003 and 2006. Voter registration in the state favors Democrats 2-1 over Republicans, according to state data.What People Are SayingX account \"Conservative Brief\" on Thursday, citing polling on Harris: \"Uh Oh - Guess Who's Back. Recent poll shows former Vice-President Kamala Harris leading among voters in California for the 2026 Governor's race with 57% supporting her candidacy. Source: The Hill\"The Steven Hilton Show wrote X on Wednesday: \"Kamala Harris thinks she can walk into the California Governor's race with a win already up her sleeve.\"California Democratic Attorney General Rob Bonta told Politico earlier this month: \"Kamala Harris would be a great governor,\" adding, \"I would support her if she ran, I've always supported her in everything she's done. She would be field-clearing.\"What Happens Next?The deadline for candidates to throw their name in the race is January 22, 2026, the secretary of state's website notes.","summary":"Trump envoy Richard Grenell said a Republican could have a shot at beating Harris if she announced plans to run for California governor.","url":"https://www.newsweek.com/richard-grenell-potential-governor-run-kamala-harris-california-2031605","image":"https://d.newsweek.com/en/full/2589077/kamala-harris.jpg","video":null,"publish_date":"2025-02-14 21:58:16","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"us","sentiment":-0.089},{"id":290644062,"title":"From VP to Governor? Poll shows Kamala Harris as top choice for California 2026 race","text":"Former US Vice President Kamala Harris is actually emerging as the Democratic front runner for the California gubernatorial race of the year 2026, in accordance to a recent Emerson College Polling survey. According to The Hill, the poll indicates that 57% of Democratic primary voters would support former US Vice President Kamala Harris if she actually decides to run that too significantly ahead of her nearest competitor who is former Rep. Katie Porter and also who garnered only 9% support. The other potential candidates which included ex-Speaker Antonio Villaraigosa and current Lt. Gov. Eleni Kounalakis eventually received 4% each while at the same time, 17% of voters remained undecided, reported The Hill.Numerous speculations about the political future of US Vice President Kamala Harris has severely intensified since her unsuccessful US Presidential bid in the year 2024. Now, many people do believe that she could capitalize on the opportunity to succeed term limited Gov. Gavin Newsom who is reportedly anticipated to pursue national ambitions after leaving office, asserted The Hill. Former US Vice President Kamala Harris has severely deep ties to California while having previously served as attorney general and also US senator.In spite of the heavy polling support, former US Vice President Kamala Harris downplayed numerous questions about her gubernatorial aspirations while emphasizing on her commitment to her community in the wake of recent wildfires, noted The Hill. FAQs:Which renowned political personality emerged as a Democratic front runner for the California gubernatorial race in the year 2026?Former US Vice President Kamala Harris is actually emerging as the Democratic front runner for the California gubernatorial race of the year 2026, in accordance to a recent Emerson College Polling survey.How is the relationship of former US Vice President Kamala Harris with California?Former US Vice President Kamala Harris has severely deep ties to California while having previously served as attorney general and also US senator.","summary":"A recent poll has reportedly showed US Vice President Kamala Harris as the actual best choice for the California Gubernatorial race in the year 2026.","url":"https://economictimes.indiatimes.com/news/international/us/from-vp-to-governor-poll-shows-kamala-harris-as-top-choice-for-california-2026-race/articleshow/118259956.cms","image":"https://img.etimg.com/thumb/msid-118259960,resizemode-4,width-1200,height-900,imgsize-1687579,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-14 21:54:50","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":0.047},{"id":290623572,"title":"Joe Rogan Reveals How He Wanted to Handle Kamala Harris Interview","text":"Popular podcaster Joe Rogan said he would have guided former Vice President Kamala Harris through an interview on his podcast if she had come on the show ahead of the election, and he had no intention of being \"antagonistic\" toward the then-presidential candidate.Newsweek filed out an online contact form for comment from Harris on Friday.Why It MattersRogan is one of the most-listened-to media voices, and some strategists have suggested that Harris' decision not to appear on his podcast hurt her 2024 presidential campaign. Then-Republican nominee Donald Trump sat down with Rogan 10 days before the election he went on to win.The comedian and podcaster endorsed Trump the day before the election but had previously spoken favorably of Senator Bernie Sanders and criticized Trump in the past.What To Know Rogan hosts the Joe Rogan Experience podcast, which has around 11 million listeners. During the 2024 presidential campaign, Rogan extended invites to both the Democratic and Republican candidates to sit down on his show. An interview with Harris never materialized, while Trump's was released just under two weeks ahead of the election.A recently published excerpt from Fight: Inside the Wildest Battle for the White House by journalists Jonathan Allen and Amie Parnes details a failed negotiation between Rogan's team and Harris' campaign, alleging obstacles set by Rogan's camp ultimately derailed the interview.According to the book, Harris' campaign had initially sought to have her appear on the podcast in an effort to reach young male voters, a demographic where she was struggling. The negotiations, which began in October 2024, became a logistical struggle between Harris' campaign and Rogan's team.Rogan has denied some claims made in the book, stating that his team never lied about a scheduling conflict, Harris' team never sent a staffer to scout his Austin studio, and that her team never fully committed to the interview.On a Thursday episode of his show, he told guest Adam Curry that Harris' team \"just lie. They cover their a**, and they lie. I would have been very happy to have her on, and like I said, the goal was to release both the same day,\" in reference to his desire to publish episodes from both Harris and Trump on the same day.The host added that Harris' team \"got scared\" and that, he \"would have held her hand, we would have had a conversation. Not that I need to hold, you know, the vice president's hand.\"He continued that had the interview happened, he would have helped her explain her policy platform, \"even if it doesn't make any sense.\" He told Curry, \"I'm not going to be antagonistic. I'm not gonna be a sh**head. I have no desire to turn this into a viral clip thing.\"What People Are Saying Adam Curry said on the show that Harris didn't come on the podcast because: \"We broke the elite messaging system; we broke it because they could not put her into the new system. They couldn't, because they knew that she would fall down.\"Harris campaign adviser Jennifer Palmieri said in November: \"Some of our progressive staff pushed back, not wanting her on the show and worrying about backlash.\"","summary":"Podcaster Joe Rogan says on his latest episode that he would not have been \"antagonistic\" towards Kamala Harris if she came on the show back in October.","url":"https://www.newsweek.com/joe-rogan-reveals-how-wanted-handle-kamala-harris-interview-2031572","image":"https://d.newsweek.com/en/full/2588994/joe-rogan.jpg","video":null,"publish_date":"2025-02-14 20:51:36","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"US","sentiment":-0.397},{"id":290647806,"title":"Ukraine end game: What each side wants from a peace deal","text":"Zelensky has said previous discussions with US President Donald Trump are \"definitely not enough to form a plan\" for peace.\n\nSpeaking as he arrived at the MSC, he said that signals coming from the US were \"strong\" but \"varied\".\n\nHegseth claimed Trump was the \"one man in the world\" capable of bringing both sides together and insisted US attempts to negotiate peace were \"certainly not a betrayal\" of the Ukrainian soldiers fighting invading Russian forces.\n\nMeanwhile, the US vice-president said sending troops to Ukraine is \"still on the table\" should Russia fail to negotiate a peace deal in good faith.\n\n\"The president is not going into this with blinders on,\" JD Vance told the told the Wall Street Journal.\n\nBack in October, Zelensky laid out his victory plan to Ukraine's parliament, which included key points like Nato membership, joint US and EU protection of critical natural resources, and the containment of Russia via a non-nuclear strategic deterrent package deployed on Ukrainian soil.\n\nThe US president at the time, Joe Biden, was given a briefing on this plan - as were then-presidential candidates Kamala Harris and Donald Trump. \n\nIt is unclear whether any part of Zelensky's plans will be taken forward to peace talks, but Hesgeth has warned there would be no US troops on the ground Ukraine in any future security arrangement.\n\nZelensky told the Guardian that he does not believe security guarantees without US involvement will work. \n\nUK defence sources quoted in the Times newspaper claim that the US could provide some form of air defence - possibly Patriot missiles - to a peacekeeping force in Ukraine in return for access to minerals.","summary":"Donald Trump's phone call with Putin has shocked both Ukraine's president Zelensky and allies alike, but is it enough to start peace talks?","url":"https://www.bbc.com/news/articles/crlkypydyn6o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/c5a4/live/c4cd6dc0-eacc-11ef-869d-59d5dc42f7c7.jpg","video":null,"publish_date":"2025-02-14 20:49:32","author":"Tom McArthur","authors":["Tom McArthur"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.248},{"id":290625042,"title":"Kamala Harris gets some good polling news: Will she run for office?","text":"Former Vice President Kamala Harris may not be shutting the door on politics yet. \n\nHarris is emerging as the Democratic frontrunner for governor of California, according to a new Emerson College Polling/Inside California Politics/The Hill survey released Thursday. The poll comes amid speculation that she is gearing up to make a bid in her home state’s gubernatorial race after losing to President Donald Trump in the 2024 election. \n\nThe poll found that a majority of Democratic Primary voters, 57%, would support Harris if she ran for governor of California. Another 9% said they would support former Rep. Katie Porter (D-Calif.) and another 17% are undecided, according to the poll. \n\nThe poll also found that without Harris in the race, there is no clear frontrunner. When Harris is not on the hypothetical ballot, 45% are undecided while another 21% would support Porter.\n\n“Support for Harris is strongest among women (60%), Hispanics (61%), and Black Democratic voters (64%),” Spencer Kimball, executive director of Emerson College Polling, said in a statement. \n\n“If Vice President Harris enters the Democratic Primary, she would start as the clear favorite. Without Harris in the race, the primary is wide open. Former Rep. Porter leads the pack, performing well among voters with college degrees (26%) or postgraduate degrees (25%),” he added.\n\nHarris has been mulling over whether to toss her hat in the ring for the governor’s race. She is reportedly “instructing advisers and allies to keep her options open,” according to a report from Politico after the election.\n\nThe poll found that Newsom has a 42% job approval rating among California voters while 40% disapprove of him. Trump has a 37% job approval rating and a 53% disapproval rating. \n\nThe poll also pressed California voters on whether Trump’s order to open the dams in Central California was a good thing. Trump’s order to open the dams came in the wake of the deadly wildfires that ravaged Southern California last month, but many critics said that his order ended up wasting billions of gallons of water in the state.\n\nThe poll found 52% said opening the dams was a bad thing while 48% said it was a good thing.\n\nThe poll was conducted Feb. 10-11 among 1,000 registered voters in the state. It has a credibility interval of plus or minus 3 percentage points.\n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"Should she make another bid for office after losing to Trump?","url":"https://www.nj.com/politics/2025/02/kamala-harris-gets-some-good-polling-news-will-she-run-for-office.html","image":"https://www.nj.com/resizer/v2/EBWMERXLSVBXPHRWUNJNNUVMR4.jpg?auth=e9654e479a74b755e4b47650d603935cc2e2b0ba5551f77204110025507511d2&width=1280&quality=90","video":null,"publish_date":"2025-02-14 20:32:37","author":"Lauren Sforza","authors":["Lauren Sforza"],"language":"en","category":"politics","source_country":"us","sentiment":-0.288},{"id":290620788,"title":"Joe Rogan is still complaining about Kamala Harris not going on his podcast: ‘I would have held her hand’","text":"Podcaster Joe Rogan is still complaining about former Vice President Kamala Harris not appearing on his show during the 2024 campaign months later. \n\n“They just got scared. They could have put her in. I would have held her hand. We would have had a conversation. Not that I need to hold, you know, the vice president’s hand,” Rogan said on his podcast this week, four months after the scrapped interview.\n\nHe accused the Harris campaign of lying to conceal that they “got scared” of appearing on the podcast, in comments highlighted by Mediaite. \n\nThe podcaster spoke to President Donald Trump not long before the election and talked openly about discussions with Harris’s team going awry. \n\nRogan said he wanted to release the Trump and Harris interviews on the same day but that he was unable to come to terms with the Harris campaign when it came to issues such as scheduling or how long they would speak for. \n\nThis comes as a new book citing Harris officials outlines allegations that Rogan sabotaged his interview with Harris to favor Trump, who appeared for three hours on Rogan’s podcast, The Joe Rogan Experience, on October 26. \n\nAn excerpt from FIGHT: Inside the Wildest Battle for the White House by Jonathan Allen and Amie Parnes outlines the decision by the Harris campaign to hold a rally in Houston in late October: \n\n“Only a few people knew the real reason: the whole Houston rally was built to put her in proximity to Rogan. The ongoing negotiations on that were touch-and-go,” Allen and Parnes write. \n\nHarris deputy campaign manager Rob Flaherty called Rogan’s team on October 18, before the rally was scheduled. \n\n“We could do Friday, the 25th,” said Flaherty, according to the book.\n\n“Wish we had known about this sooner because he has the 25th blocked out as a personal day,” one of Rogan’s people replied. \n\n“What about Saturday morning?” Flaherty responded.\n\n“Only if it’s before 8:30 a.m.,” Rogan’s team member said. \n\n“The tone is different, Flaherty thought. The vice president of the United States is offering to come to your f***ing show, and you keep putting up more hoops. Harris’s team still wanted to make it work, but a new wariness set in,” Allen and Parnes write. “On October 22, the same day the Harris camp announced the rally, the Associated Press reported that Trump would be Rogan’s guest on Friday — the ‘personal day’ Rogan had originally reserved.”\n\n“Mutual friends Elon Musk and Dana White had convinced Trump and Rogan to bury their dispute, according to a Trump aide. There would be no Harris interview,” they add. \n\nRogan again rejected the allegation on his podcast this week that he somehow sabotaged the interview, arguing that the Harris campaign “got scared” and wasn’t telling the truth to “cover their a**.”\n\n“It’s just normal political bullshit. They just lie. They cover their a**, and they lie. I would have been very happy to have her on, and like I said, the goal was to release both the same day,” said Rogan. \n\nThe podcaster said he would have been “nice” and that he would have held her “hand.”\n\n“You probably would have voted for her,” said Adam Curry, Rogan’s guest.\n\n“No, I wouldn’t have done that. I wasn’t going to vote for her,” said Rogan, laughing. \n\nPreviously, Rogan claimed to have made concessions to the Harris campaign about the topics they would discuss, saying that the campaign didn’t want to discuss the possibility of legalizing marijuana.","summary":"New book outlines claim Rogan’s team sabotaged interview with vice president shortly before election","url":"https://www.independent.co.uk/news/world/americas/us-politics/joe-rogan-kamala-harris-podcast-b2698618.html","image":"https://static.independent.co.uk/2025/02/14/19/55/GettyImages-2194398394.jpg?trim=0,0,1,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/Hh5BIDgg-OhrQWqOm.mp4","publish_date":"2025-02-14 20:27:46","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","source_country":"gb","sentiment":-0.323}]}