{"offset":0,"number":50,"available":257,"news":[{"id":351482270,"title":"Laura Loomer and the limits of posting everything","text":"For all the power she wields with the White House’s affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have — the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she’s the influencer responsible for getting Donald Trump to fire over a dozen members of his administration (and counting) for the hazily-defined crime of being disloyal to MAGA. This is something that none of her peers, individually, have been able to do. But to understand how she operates, look no further than Loomer’s latest attempted power play, which, as always, involves a fair amount of self-humiliation (and some disgusting slander).\nEarlier this week, she leaked a private deposition that she’d given in a lawsuit wherein she explained, in her own words, why she’s published some of the most outre takes and allegations against her “enemies” on social media. The deposition was given as part of her defamation suit against HBO host Bill Maher, who claimed on a February 2025 show that Loomer was having a sexual affair with president Donald Trump. But you might have missed that context, since the social media chatter and headlines gravitated toward the sections of the deposition where Loomer was grilled about her most audacious posts: she claimed, among other things, that Sen. Lindsay Graham was secretly gay, that former Vice President Kamala Harris was a “DEI skank”, and her bitter MAGA rival Rep. Marjorie Taylor Greene (R-GA) divorced her husband because of the “Arby’s in her pants” and was a “political prostitute [who was] sucking McCarthy’s dick all day.” \nUnsurprisingly, Loomer defended herself and her statements, both in the deposition (“I’m saying she literally—it’s so ridiculous. I’m saying she literally put Arby’s in her pants”) and in public, after the deposition was reported on by Will Sommer at The Bulwark. “I was asked about Lindsey during my deposition so I had to tell the truth. I was under oath,” Loomer tweeted — along with a screenshot of the section where she explained why she believed Graham was gay. \n[Image: Image: @LauraLoomer on X. https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/Screenshot-2025-08-15-at-6.01.11%E2%80%AFPM.png?quality=90&strip=all]\nHBO’s lawyers immediately argued that Loomer was violating several laws by making the private deposition public, and the document was immediately re-sealed. Loomer, on the other hand, claimed that she was simply trying to showcase that her testimony “went so well that the leftist law firm [representing HBO] wanted to SEAL my deposition.” Whether it went well is somewhat debatable, given the potential legal implications for Loomer violating a court order, as well as the incontrovertibility of Loomer saying some absolutely wild things in a legal deposition, and defending them.\nLoomer described the stunt as another example of “Loomering,” the term that she uses to describe her internet bullying campaigns. At first glance, it’s a tactic honed from her time working as a secret-camera sting operator at Project Veritas, which famously recorded members of the media and academics saying things that could be spun as anti-conservative and amoral. Loomer’s stepped up her game, however, putting herself in front of the camera (and eventually the public eye) to make her point. \nThe fact that she constantly embarrasses herself only enhances the efficacy of “Loomering”: first, shame and embarrassment does not matter in the long term, so long as people are paying attention online. (She said as much the next day: “I wake up everyday to another hit piece. It’s because I am effective and it threatens a lot of people.”) Second: the internet is forever, and even if a judge orders a deposition to be resealed, gawkers will save copies, screenshot the juicy bits, and publish them for posterity. Loomer might have been recorded reading her own tweets out loud and forced to explain the gross bits, but she has also gotten several White House administration officials fired. \nWhile it remains to be seen whether her influence extends beyond Trump’s daily capriciousness, Loomer’s unnerving gift for being an internet bully remains effective as long as she has allies in the administration, who leak her the insider info she publicly uses to humiliate others. (As she said to HBO’s lawyers, her friends in the White House told her that Graham was gay.) And as long as the storm she creates can grab Trump’s attention, he will most likely keep picking up her calls.","summary":"For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she's the influencer responsible for getting Donald [&#8230;]","url":"https://www.theverge.com/politics/760269/laura-loomer-deposition","image":"https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/gettyimages-2172052612.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613","video":null,"publish_date":"2025-08-15 23:36:49","author":"Tina Nguyen","authors":["Tina Nguyen"],"language":"en","source_country":"us","sentiment":-0.14},{"id":351475784,"title":"Tuvalu considers pulling out of Pacific leaders’ summit amid China-linked power struggle","text":"Tuvalu’s prime minister Feletei Teo said his country may pull out of the region’s top political meeting next month, after host nation Solomon Islands moved to block all external partners – including China, US and Taiwan – from attending.\n\nThe Pacific Islands Forum leaders meeting will be held in Honiara in September. On 7 August, Solomon Islands prime minister Jeremiah Manele told parliament that no dialogue partners would be invited to the annual gathering.\n\nCountries outside the Pacific, known as “dialogue partners,” have attended the forum since 1989, to work with Pacific leaders and contribute to discussions around development and regional security. While not an official partner, Taiwan has attended the meetings as a “development partner” for more than three decades.\n\nThe decision by Honiara, a close ally of Beijing, has fuelled speculation the move was aimed at keeping Taiwan out of the meeting. It has raised questions over China’s growing sway in Pacific diplomacy and whether regional unity can hold.\n\nTuvalu, along with the Marshall Islands and Palau, are the only Pacific countries that maintain diplomatic ties with Taiwan, in what Beijing views as an affront to its One China principle.\n\nIn an interview with the Guardian, Teo said he would wait to see how other Pacific leaders respond before deciding whether or not to attend the forum next month, expressing “disappointment” at the last-minute exclusion of external countries.\n\n“The region does not need these kinds of distractions,” Teo said. “We have far more important issues to focus on, rather than letting ourselves be pressured from outside.”\n\nTeo said he had written to Manele outlining concerns around the inconvenient timing of the decision, and his “difficulties supporting the justification” behind the move.\n\n“We’ll … see what the rest of the leaders’ response is to the proposal by the Solomons, and then we’ll make our decision,” he said.\n\n“I’ll wait for the final decision on this arrangement, and then reconsider my participation,” he said.\n\nThe annual forum is the main mechanism through which leaders define region-wide policy agendas.\n\nTeo added he “won’t be surprised” if China was behind the decision to block partners from the forum, saying the unusual move broke with decades of precedent in the region.\n\n“There is no denying that China is trying to extend its footprint in the Pacific, and so is the US,” Teo said.\n\n“My own personal view is that we do need their development assistance, but we do not need the competition and conflict overshadowing our development agenda in the Pacific.”\n\nThe Guardian contacted China’s embassy in Honiara for comment.\n\nA US state department spokesperson said Washington was “disappointed” by the move to exclude partners, and reaffirmed support for the attendance of all partners, including Taiwan, at the forum.\n\n“All [forum] partners, and that includes Taiwan, should be invited to participate … regardless of where it is hosted – just as countries that maintain diplomatic ties with Taiwan invite all dialogue partners, including China,” the spokesperson said.\n\nTaiwan said it “urges that that existing arrangements be maintained”, adding that its participation at the Pacific meetings would “further strengthen cooperation”.\n\nNot all of Taiwan’s Pacific allies have opposed the decision to exlude foreign attenders to the forum.\n\nPalau, which will host the forum in 2026, says it “respects and acknowledges” Solomon Islands’ decision to block all foreign attendees, with the office of the president saying it allows members “to focus on the critical intra-regional issues at this year’s forum”.\n\nSolomon Islands switched diplomatic allegiances from Taiwan to China in 2019 and three years later, the countries signed a controversial security pact . Honiara has also received significant Chinese funding, including a recent $US1m donation to buy 27 cars to transport delegates during the forum.\n\nDr Sarina Theys, senior lecturer in diplomacy and international affairs at the University of the South Pacific, said Solomon Islands’ decision may be an attempt to avoid openly choosing between China and Taiwan.\n\n“The only way to do that is then to just not invite anyone,” Theys said.\n\nNiuone Eliuta, first secretary at the Tuvalu High Commission in New Zealand, said he had “no doubt China is behind this decision” to block external partners from the upcoming forum.\n\n“This day and age China is very much influencing what’s going on in the Pacific,” Eliuta said, adding that excluding donor partners could mean countries miss out on vital support such as climate funding.\n\n“This is a temporary fix, moving development dialogue partners out of the Solomon Islands,” Eliuta said. “I just hope no countries break away from PIF.”\n\nConcerns over Beijing’s influence on the Forum are not new. At last year’s meeting in Tonga, segments of the Pacific leader’s communique that referenced Taiwan were altered, a decision many believe to be an outcome of China’s influence. In 2022, two Chinese defence attaches were ejected from the Forum’s meeting in Suva while caught listening to a visual address given by US vice-president Kamala Harris.","summary":"Exclusive: Prime minister Feletei Teo says Tuvalu may withdraw from crucial meeting after key countries such as Taiwan were barred from attending\n\nTuvalu’s prime minister Feletei Teo said his country may pull out of the region’s top political meeting next month, after host nation Solomon Islands moved to block all external partners – including China, US and Taiwan – from attending.\n\nThe Pacific Islands Forum leaders meeting will be held in Honiara in September. On 7 August, Solomon Islands prime minister Jeremiah Manele told parliament that no dialogue partners would be invited to the annual gathering.\n\n Continue reading...","url":"https://www.theguardian.com/world/2025/aug/16/tuvalu-considers-pulling-out-of-pacific-leaders-summit-amid-china-linked-power-struggle","image":"https://i.guim.co.uk/img/media/84169314a5f8ec3efe99f1f25b7d5f010ad4d330/304_0_1440_1152/master/1440.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-08-15 23:30:45","author":"Prianka Srinivasan","authors":["Prianka Srinivasan"],"language":"en","source_country":"us","sentiment":0.009},{"id":351479728,"title":"Tuvalu considers pulling out of Pacific leaders’ summit amid China-linked power struggle","text":"Tuvalu’s prime minister Feletei Teo said his country may pull out of the region’s top political meeting next month, after host nation Solomon Islands moved to block all external partners – including China, US and Taiwan – from attending.\n\nThe Pacific Islands Forum leaders meeting will be held in Honiara in September. On 7 August, Solomon Islands prime minister Jeremiah Manele told parliament that no dialogue partners would be invited to the annual gathering.\n\nCountries outside the Pacific, known as “dialogue partners,” have attended the forum since 1989, to work with Pacific leaders and contribute to discussions around development and regional security. While not an official partner, Taiwan has attended the meetings as a “development partner” for more than three decades.\n\nThe decision by Honiara, a close ally of Beijing, has fuelled speculation the move was aimed at keeping Taiwan out of the meeting. It has raised questions over China’s growing sway in Pacific diplomacy and whether regional unity can hold.\n\nRelated: Caught in the contest between China and the west, the Cook Islands asks where its future lies\n\nTuvalu, along with the Marshall Islands and Palau, are the only Pacific countries that maintain diplomatic ties with Taiwan, in what Beijing views as an affront to its One China principle.\n\nIn an interview with the Guardian, Teo said he would wait to see how other Pacific leaders respond before deciding whether or not to attend the forum next month, expressing “disappointment” at the last-minute exclusion of external countries.\n\n“The region does not need these kinds of distractions,” Teo said. “We have far more important issues to focus on, rather than letting ourselves be pressured from outside.”\n\nTeo said he had written to Manele outlining concerns around the inconvenient timing of the decision, and his “difficulties supporting the justification” behind the move.\n\n“We’ll … see what the rest of the leaders’ response is to the proposal by the Solomons, and then we’ll make our decision,” he said.\n\n“I’ll wait for the final decision on this arrangement, and then reconsider my participation,” he said.\n\nThe annual forum is the main mechanism through which leaders define region-wide policy agendas.\n\nTeo added he “won’t be surprised” if China was behind the decision to block partners from the forum, saying the unusual move broke with decades of precedent in the region.\n\n“There is no denying that China is trying to extend its footprint in the Pacific, and so is the US,” Teo said.\n\n“My own personal view is that we do need their development assistance, but we do not need the competition and conflict overshadowing our development agenda in the Pacific.”\n\nThe Guardian contacted China’s embassy in Honiara for comment.\n\nA US state department spokesperson said Washington was “disappointed” by the move to exclude partners, and reaffirmed support for the attendance of all partners, including Taiwan, at the forum.\n\nRelated: Trump administration asks tiny Pacific nation of Palau to accept migrants deported from US\n\n“All [forum] partners, and that includes Taiwan, should be invited to participate … regardless of where it is hosted – just as countries that maintain diplomatic ties with Taiwan invite all dialogue partners, including China,” the spokesperson said.\n\nTaiwan said it “urges that that existing arrangements be maintained”, adding that its participation at the Pacific meetings would “further strengthen cooperation”.\n\nNot all of Taiwan’s Pacific allies have opposed the decision to exlude foreign attenders to the forum.\n\nPalau, which will host the forum in 2026, says it “respects and acknowledges” Solomon Islands’ decision to block all foreign attendees, with the office of the president saying it allows members “to focus on the critical intra-regional issues at this year’s forum”.\n\nSolomon Islands switched diplomatic allegiances from Taiwan to China in 2019 and three years later, the countries signed a controversial security pact . Honiara has also received significant Chinese funding, including a recent $US1m donation to buy 27 cars to transport delegates during the forum.\n\nDr Sarina Theys, senior lecturer in diplomacy and international affairs at the University of the South Pacific, said Solomon Islands’ decision may be an attempt to avoid openly choosing between China and Taiwan.\n\n“The only way to do that is then to just not invite anyone,” Theys said.\n\nNiuone Eliuta, first secretary at the Tuvalu High Commission in New Zealand, said he had “no doubt China is behind this decision” to block external partners from the upcoming forum.\n\n“This day and age China is very much influencing what’s going on in the Pacific,” Eliuta said, adding that excluding donor partners could mean countries miss out on vital support such as climate funding.\n\n“This is a temporary fix, moving development dialogue partners out of the Solomon Islands,” Eliuta said. “I just hope no countries break away from PIF.”\n\nConcerns over Beijing’s influence on the Forum are not new. At last year’s meeting in Tonga, segments of the Pacific leader’s communique that referenced Taiwan were altered, a decision many believe to be an outcome of China’s influence. In 2022, two Chinese defence attaches were ejected from the Forum’s meeting in Suva while caught listening to a visual address given by US vice-president Kamala Harris.","url":"https://uk.news.yahoo.com/tuvalu-considers-pulling-pacific-leaders-233045486.html","image":"https://s.yimg.com/ny/api/res/1.2/5dTdJkkW9rDkhERIOKR15Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xOTIwO2NmPXdlYnA-/https://media.zenfs.com/en/theguardian_763/c1944e5a32f21596f0b52dd1ec5cecaf","video":null,"publish_date":"2025-08-15 23:30:45","author":"Prianka Srinivasan","authors":["Prianka Srinivasan"],"language":"en","source_country":"gb","sentiment":-0.025},{"id":351478538,"title":"Republican candidate for governor Steve Hilton visits San Jose homeless camp, bashes Democrats","text":"A leading Republican in the California governor’s race made a recent campaign stop at a sprawling San Jose homeless camp to film a social media video bashing Democrats for allowing “third-world slum conditions” to persist across the state.\n\nIn the video posted this week to X, Steve Hilton, a former Fox News host who recently polled second in a crowded field of candidates behind Democrat Katie Porter, strode through the encampment at Columbus Park near the San Jose airport in a pair of jeans and white sneakers, motioning toward the tents, lived-in RVs and trash scattered across the park and what was once a functioning baseball field.\n\n“This is Gavin Newsom’s California,” Hilton said, using expletives to describe the smell of the camp. “This is Democrat-run California.”\n\nUnder Newsom’s watch, the state’s homeless population has swelled 24% to an estimated 187,000 people, despite his administration spending at least $27 billion to combat homelessness since he took office in 2019. Even so, homelessness experts and service providers say the unprecedented spending likely prevented the crisis from getting even worse.\n\nDan Schnur, a political science professor with UC Berkeley and the University of Southern California, said the video could be an attempt to appeal to deep-pocketed Silicon Valley donors, who are increasingly turning to conservative candidates.\n\n“The campaign may have decided that there is an opportunity for support in the tech community, so they talked about the problem in San Jose rather than Los Angeles or San Francisco,” Schnur said. “On the other hand, they may have just been in the area with an hour to kill.”\n\nSchnur added that with former Vice President Kamala Harris and Lt. Gov. Eleni Kounalakis officially out of the 2026 governor’s race, there isn’t a candidate with “a natural advantage in Silicon Valley.” Porter, who formerly represented Orange County in Congress, has deeper ties to Southern California.\n\nThe Hilton campaign said the candidate was spending time with his family and unavailable to discuss the video.\n\n“We decided to shoot our video at Columbus Park, home to one of the largest encampments in the area,” campaign spokesperson Hector Barajas said in a statement. “Residents have been asking their local and state representatives the same questions: What about us? What about our community?”\n\nWhile Hilton was quick to slam Newsom and California Democrats more broadly, he refrained from calling out San Jose Mayor Matt Mahan, a moderate Democrat, by name.\n\nLike Hilton, Mahan has been critical of the state’s homelessness response and has pursued more forceful approaches to solving the crisis. Earlier this year, San Jose adopted a controversial ordinance that Mahan proposed to cite or arrest homeless people who repeatedly refuse shelter beds.\n\nMahan’s office did not provide a comment in response to questions about criticisms leveled in the video.\n\nNewsom’s office also did not provide a response and directed questions to local officials.\n\nStarting next week, San Jose plans to clear the Columbus Park encampment, which has been the site of multiple recent fires and a fatal stabbing last year. Despite the danger, families with small children have been known to stay at the camp.\n\nAfter clearing the encampment, the city plans to spend $19.5 million on revitalizing the park, including adding soccer fields, horseshoe pits and pickleball courts.\n\nCity officials say they are working to provide shelter beds for the more than 250 people estimated to be living at the park. But even as local officials open new shelters and an outdoor “safe-sleeping” site in the city’s northside neighborhood, it’s unclear how many camp residents will ultimately be moved off the street.\n\nIn the video, Hilton took particular aim at a policy known as “housing first,” which calls for accepting homeless people into permanent housing without preconditions such as getting sober, agreeing to mental health treatment or finding employment. The idea behind the policy — backed by research and embraced by state officials and, until recently, federal officials — is that homeless people are best able to take advantage of services only after they have safe and stable housing.\n\nHilton contends Democrats’ backing of the strategy is preventing homeless people from getting treatment and leading to wasteful spending on affordable housing projects, which can cost as much as $1 million a door in expensive parts of the state like the Bay Area. Mahan, for his part, has made similar arguments to justify shifting city funds from permanent housing to homeless shelters.\n\n“They make it illegal to solve the problem,” Hilton said.\n\nIn an executive order last month, President Donald Trump directed federal officials to end support for housing first programs that “deprioritize accountability and fail to promote treatment.” Trump also demanded that state and local officials move more homeless people with mental health and drug issues into involuntary care or risk losing federal funding.\n\nAt the state level, some California Democrats have pushed legislation to amend the state’s housing first policy to allow more funding for abstinence-only treatment centers and sober living homes. But those bills have so far failed to make it through the Legislature.","summary":"\"This is Gavin Newsom's California,\" Hilton said in a campaign video.","url":"https://www.mercurynews.com/2025/08/15/steve-hilton-governor-san-jose-homeless/","image":"https://www.mercurynews.com/wp-content/uploads/2025/04/SJM-L-ABUNDANCE-04XX-4.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-15 23:00:59","author":"Ethan Varian","authors":["Ethan Varian"],"language":"en","category":"politics","source_country":"us","sentiment":-0.224},{"id":351470394,"title":"Gov. Tim Walz criticized for appointing prominent Democratic donor to U’s Board of Regents","text":"Gov. Tim Walz is facing criticism for appointing two Democratic donors to the University of Minnesota’s Board of Regents this week, including one who gave nearly $20,000 to his campaigns for governor and Congress.\n\nWalz’s appointment of Samuel Heins, a retired U.S. ambassador to Norway, has drawn particular concern from Republicans as well as some regent finalists who weren’t selected for a spot on the U’s governing board.\n\nHeins, a longtime lawyer, human rights advocate and alum of the U’s Law School, has given Democrats hundreds of thousands of dollars over the years. He donated $11,000 to Walz’s gubernatorial campaigns, $8,400 to his past congressional campaigns and $25,000 to the Kamala Harris campaign after Walz joined the national ticket.\n\n“Samuel Heins is obviously a Democrat major donor,” said state Rep. Marion Rarick, the GOP co-chair of the Minnesota House higher education committee. “The optics are terrible. It looks like a pay-to-play.”\n\nAnother one of Walz’s four regent picks, Ellen Luger, donated at least $3,450 to his gubernatorial campaigns, state campaign finance data shows. Luger is a former minister counselor for agriculture at the U.S. Mission to the United Nations, with experience negotiating international agricultural policy. She also previously served as a trustee at Wellesley College in Massachusetts, and is married to former U.S. Attorney of Minnesota Andrew Luger.\n\nWalz’s appointments to the board come at a critical time for Minnesota’s flagship university, which cut some academic programs and hiked undergraduate resident tuition by 6.5% earlier this summer. The U’s 12 regents serve unpaid, six-year terms and are tasked with approving major policies such as tuition increases and a multibillion-dollar annual budget.\n\nA spokesperson for Walz said in a statement Friday that the governor “appointed a highly-qualified, well-respected slate of statewide leaders to the Board of Regents.”\n\n“He has full confidence in their ability to tackle the challenges facing the University of Minnesota with integrity and dedication,” the spokesperson said.","summary":"One of Walz’s regent picks, Samuel Heins, donated $11,000 to his gubernatorial campaigns and $8,400 to his past congressional campaigns.","url":"https://www.startribune.com/gov-tim-walz-criticized-for-appointing-prominent-democratic-donor-to-us-board-of-regents/601455968","image":"https://arc.stimg.co/startribunemedia/2DDVNCK5TFGOHEEQ4CDDRVPVTY.JPG?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2025-08-15 23:00:00","author":"Coast Guard","authors":["Coast Guard"],"language":"en","category":"politics","source_country":"US","sentiment":0.094},{"id":351462256,"title":"RFK Jr. claims 'the swamp' is trying to drive a 'wedge' between him and Trump and announces he's NOT running for president in 2028","text":"Health and Human Services Secretary Robert F. Kennedy Jr. on Friday blasted 'the swamp' for trying to drive a wedge between him and President Donald Trump and announced that he was not running for president in 2028. \n\nKennedy took to X to dispel rumors he was eyeing another presidential bid under the nose of Trump, who appointed him HHS head after Kennedy endorsed the Republican and ended his independent 2024 bid last August. \n\nOn Wednesday, Trump's most controversial outside adviser Laura Loomer told Politico Playbook that she wanted a top Kennedy aide ousted, over concerns the adviser was helping the HHS secretary quietly mount a White House run. \n\n'The swamp is in full panic mode,' Kennedy said on X. 'D.C. lobby shops are laboring fiercely to drive a wedge between President Trump and me, hoping to thwart our team from dismantling the status quo and advancing POTUS' Make America Healthy Again agenda.' \n\n'They're pushing the flat-out lie that I'm running for president in 2028,' Kennedy continued. 'Let me be clear: I am running for president in 2028.' \n\nHe added that 'my loyalty is to President Trump and the mission we've started.' \n\nKennedy then addressed Loomer's call for his principal deputy chief of staff and senior counselor, Stefanie Spear, to be fired. \n\nSpear served as his 2024 campaign press secretary, one of Kennedy's most visible campaign officials. \n\n'Their attacks on my staff, especially Stefanie Spear - a fierce, loyal warrior for MAHA who proudly serves in the Trump Administration and works every day to advance President Trump's vision for a healthier, stronger America - are proof we're over the target,' Kennedy said. \n\nOther conservatives in the MAGA movement took issue with Spear just weeks into the administration. \n\nIn February Axios quoted a number of unnamed sources from conservative organizations who had problems with some of Spear's previous social media posts - which expressed support for Democratic causes.\n\nKennedy started his presidential campaign as a Democrat - the party of his famous family - but switched his affiliation to independent in October 2023 when it was clear he wouldn't be able to beat incumbent President Joe Biden in the 2024 Democratic primary. \n\nA year ago, Kennedy joined forces with the Republican Trump - combining the MAGA movement with MAHA - Make America Healthy Again. \n\nThat coalition aided Trump in winning the election against Democratic nominee, Vice President Kamala Harris in November. \n\nLast month, Axios reported that a call that included hundreds of MAHA supporters, including controversial comedian Russell Brand, appeared to be setting the table for Kennedy to launch another presidential bid. \n\nThat move could ruffle feathers with Trump, who is constitutionally barred from serving a third term, but has already indicated that he wants to play kingmaker in the next presidential election. \n\nThe involvement of Tony Lyons on the call, who had run Kennedy's MAHA PAC, signaled to some attendees that a 2028 bid was in the making. \n\nLyons has protested that interpretation and did so again on Friday. \n\n'The story that Secretary Kennedy was running for president was a made up story. There's no truth to it whatsoever,' he told the Daily Mail. 'Secretary Kennedy never gave any indication that he was planning to run for president.' \n\nLyons said that Kennedy was 'disrupting an entrenched and deeply corrupt system that has allowed a small group of companies to make incredible profits from products that make Americans sick.' \n\n'Those companies are spending millions to attack Secretary Kennedy, Stefanie Spear and the rest of his incredible team,' Lyons continued. 'This is a desperate attempt to protect a revenue stream that is dependent on poisoning the American public.' \n\nKennedy, a prominent vaccine sceptic, was more vague in his post on who was to blame for spreading the 2028 rumors and tarnishing Spear in media reports. \n\n'The president has made himself the answer to my 20-year prayer that God would put me in a position to end the chronic disease epidemic - and that's exactly what my team and I will do until the day he leaves office,' Kennedy said.","summary":"Health and Human Services Secretary Robert F. Kennedy Jr . on Friday blasted 'the swamp' for trying to drive a wedge between him and President Donald Trump.","url":"https://www.dailymail.co.uk/news/article-15005189/robert-kennedy-denies-2028-run-trump.html","image":"https://i.dailymail.co.uk/1s/2025/08/15/22/101272411-0-image-m-105_1755294449202.jpg","video":null,"publish_date":"2025-08-15 22:22:03","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":0.031},{"id":351460596,"title":"Aggressive insults, grabbing all the headlines – Gavin Newsom is trying to be a Democratic version of Trump. Will voters buy it?","text":"On Thursday, Gavin Newsom announced that he would ask the California legislature to vote to put an initiative to redraw the state’s congressional districts on the ballot in November.\n\nThis, of course, came in response to Texas Republicans, acting on behalf of Donald Trump, attempting to redraw their maps to give additional seats to the GOP in the House of Representatives. All the while, Newsom has roundly mocked Trump and, on social media, mimicked the president’s all-caps style of posting. \n\nNewsom is clearly eyeing a run for president. But he’s also offering something unique: between his bombastic tone and his ability to grab headlines, he’s offering Democrats their own version of Trumpism.\n\nWhen Trump first ran for president and then later stepped into the Oval Office, Republicans regularly would say, “At least he fights.” That refrain allowed them to accept Trump calling Mexicans rapists, impugning prisoners of war and his bragging about grabbing women without their consent. \n\n“The guy's a generational talent,” Mike Madrid, a Hispanic political consultant from California who worked for Republicans, told The Independent. “Most people rely on their own skillset. He's able to adjust, see the political terrain and fight on that terrain and win.”\n\nAnd Madrid saw Newsom’s skill up close in person when he worked on the campaign for Newsom’s 2018 opponent, former Los Angeles Democratic mayor Antonio Villaraigosa. That was the case in 2004, when Newsom presided over same-sex marriages during his time as mayor of San Francisco. In 2008, he famously said, “This door's wide open now. It's going to happen, whether you like it or not.”\n\n“He is best in times of tension and conflict,” Madrid said. \n\nIt’s a major change of fortune for Newsom. After Trump’s victory in 2024, he faced severe criticism for his handling of the wildfires in Southern California. \n\nWhen he launched his podcast at the beginning of 2025, he took heat from other Democrats when he agreed with conservative activist Charlie Kirk about transgender athletes in women’s sports. To this day, many Democrats and LGBT+ activists remain salty.\n\nBut many Democrats still find themselves pleased with his actions against Trump. In June, he sued the Trump administration for sending the National Guard into Los Angeles to quell protests against Immigration and Customs Enforcement raids. \n\nNow, he’s taking Trump on directly, and it seems to have appeal. \n\nEarlier this year, Shannon Watts, a Democratic activist who raised $11 million last year for Kamala Harris, had largely refrained from giving money to Democrats in disappointment at the party’s inability to stand up to Trump. \n\nBut this week, she contributed to Newsom’s campaign. \n\n“I have been waiting for Democrats to meet the moment and to show some fight and to stand up to this administration that is so clearly wanting to be authoritarian,” she told The Independent. \n\n“And this is less of me saying with my money, oh, this is the person that I think will be president. It's more of a vote of a thank you so much for doing what is expected of elected officials and politicians in this moment.” \n\nNewsom still has his weaknesses, of course. He famously faced a recall in 2021 after facing backlash for dining indoors at the French Laundry restaurant without a mask during the pandemic. And his policies of banning homeless encampments have also angered progressives. This is to say nothing of the fact that if he runs, he will have the “Liberal San Francisco mayor” label that might put off swing voters. \n\nBut Watts said her contribution was not an endorsement of him as the Democratic nominee in 2028.\n\n“I had people in my thread say when I tweeted that I was donating, ‘You know, he's not the one,’” Watts said. “That's not the point. This is not about in 2025 who is going to be the Democratic nominee. This is about who is leading the pack in fighting in ways that are new and different, inventive and effective.” \n\nPolling consistently shows that Democratic voters increasingly do not like their leaders and see them as rolling over for Trump. That has, in turn, led to Democrats yearning for someone to fill the gap, Lakshya Jain, a co-founder of the politics website Split Ticket, told The Independent. \n\n“There's not really any way for Democrats to fight against Trump right now,” he said. “Because what letters do they have? They don't control any branch of government. They don't control the Supreme Court, but what is true is they do control the state of California, and the state of California has nine Republicans and a lot of blue turf that's kind of wasted on certain incumbents.” \n\nThat allows Newsom to step out in front and say he is the first one to stand against Texas’s actions. Specifically, the Texas Democrats who decamped to blue states said they would return to Texas because California would respond in kind if Texas passed their new maps. \n\n2028 is a long way off and plenty could change. Other candidates might be able to prove Newsom is a paper tiger. But then again, plenty of Republicans waited for Trump to implode and he laid waste to them. \n\nOn Friday, as Trump met with Russian President Vladimir Putin in Alaska, Newsom’s office fired off another Trumpian all-caps tweet. \n\n“MANY PEOPLE ARE SAYING THAT DONALD J. WOULD CONSIDER “GIVING AWAY” THE FREE STATE OF CALIFORNIA TO HIS ‘BEST FRIEND’ VLADIMIR PUTIN — ALL BECAUSE I, GAVIN C. NEWSOM, STOLE THE CAMERAS THIS WEEK WITH ‘THE MAPS,’ he posted.","summary":"Republicans got behind Trump because ‘at least he fights.’ Will Democrats do the same? asks Eric Garcia","url":"https://www.independent.co.uk/news/world/americas/us-politics/gavin-newsom-california-trump-democrats-b2808658.html","image":"https://static.independent.co.uk/2025/08/14/20/22/SEI262148571.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/OwhkekUr-OhrQWqOm.mp4","publish_date":"2025-08-15 22:07:17","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":0.185},{"id":351460598,"title":"Assessing Claims About the Future of Obergefell","text":"“Banning gay marriage was always part of their plan, just like repealing Roe v. Wade,” Mike Nellis, a former senior adviser to Vice President Kamala Harris, wrote in a tweet on Monday. “They want to ban gay marriage now. Is interracial marriage next?” read another tweet by Majid Padellan, a popular left-wing blogger.","summary":"Some claim that the landmark Supreme Court ruling that legalized same-sex marriage will soon be under siege.","url":"https://thedispatch.com/article/assessing-claims-about-the-future-of-obergefell/","image":"https://thedispatch.com/wp-content/uploads/2025/08/GettyImages-504721138.jpg?w=1024","video":null,"publish_date":"2025-08-15 22:06:28","author":"Owen Tilman","authors":["Owen Tilman"],"language":"en","source_country":"us","sentiment":0.084},{"id":351462378,"title":"CBS News boss preps ‘Evening News’ shakeup — even as his own job may be at risk: sources","text":"The president of CBS News is preparing for a sharp-elbowed shakeup of the network’s struggling “Evening News” broadcast — even as his own job appears to be in jeopardy, The Post has learned.\n\nTom Cibrowski — a former top executive at ABC who was lured to CBS in March — is poised as soon as this week to eliminate one of the nightly broadcast’s two anchors, either John Dickerson or Maurice DuBois, sources said.\n\nAt the same time, insiders said Cibrowski looks ready to oust “Evening News” executive producer Guy Campanile — a gruff Yonkers native and veteran of “60 Minutes” who lately has locked horns with his new boss, according to sources.\n\n“Guy thinks he knows better than Tom” — and may soon get kicked back to “60 Minutes” under the show’s newly installed executive producer, Tanya Simon, one source said. \n\nInsiders said Cibrowski appears to making a play to keep his job with a series of bold, 11th-hour moves as CBS parent Paramount closes its merger with the Hollywood studio Skydance. They added, however, that Cibrowski may simply end up as a hatchet man for incoming bosses — before he ends up a casualty himself.\n\nAs previously reported by The Post, Cibrowski has also gotten static from “CBS Mornings” executive producer Shawna Thomas — a close ally of network star Gayle King — and her job could be on the line, too, insiders told The Post.\n\nCBS News declined to comment.\n\nAs reported by The Post, Jeff Shell, the new president of the merged Skydance-Paramount, said last week that he was interviewing news executives for Cibrowski’s job. That comes after rumors that Skydance CEO David Ellison is in talks with journalist Bari Weiss, as well as former CBS News president David Rhodes, to join the network. \n\nAt the “Evening News,” insiders said DuBois looked poised to land the sole anchor spot. A former WCBS New York local anchor, sources said Dubois has appeared better-suited for the job than Dickerson, who is better known for his political reporting chops.\n\nThe co-hosts have “lacked chemistry” and seemed out of their depth covering international news such as the death of Pope Francis. But one high-level exec blamed poor ratings on a leadership vacuum.\n\n“There’s a lack of support, a lack of focus and differing perspectives on what the show should be,” the person said, adding that the “insecurity and lack of confidence shows up on the screen.”\n\nA key issue has been the April exit of longtime “60 Minutes” executive producer Bill Owens — who on his way out aired gripes about the show’s editorial independence as Paramount faced a lawsuit from President Trump over the show’s editing of an interview with Kamala Harris.\n\nBefore his exit, Owens had been tapped by then-CBS News President Wendy McMahon to revamp the “Evening News”. He assigned Campanile to emphasize longer, “60 Minutes”-style features. The strategy flopped amid the rapid-fire news cycles of the early Trump administration.\n\nNevertheless, Campanile — who insiders said is expected to be replaced by “Evening News” senior producer Kim Harvey — has continued to crank out the features despite Cibrowski’s demands for more straight news, sources said.\n\n“Now, the show and the team feel rudderless. If you’re going to do something different, you need to do it with confidence and assurance and this team has none of that,” the source said. “They are alone. They feel it and the viewers feel it.”\n\nThe source pointed to “an idiotic” July 31 piece on the rise in popularity of astrology – a segment that took up a precious 3 minutes – on a newsy day filled with headlines on President Trump’s trade tariffs and deadly flash floods in Texas.\n\n“That was Guy’s arrogance,” a CBS insider said of the astrology report. “The only people who think the show is journalistically great is Guy and the senior producers.”\n\nFeathers likewise got ruffled by an “insulting gift” that Owens and Campanile had given Cibrowski upon his spring arrival — a “Bible of Broadcasting” that was a primer on CBS storytelling and what makes it unique versus the competition. \n\nCibrowski — who spent 30 years at top-ranked ABC News where he oversaw shows including “Good Morning America,” “World News Tonight,” “Nightline” and “20/20” — found the gift “ridiculous,” a third source said.\n\nInside the halls of Tiffany Network, the “Evening News” has been ripped for “how unwatchable it is,” a CBS source said. One former exec was flummoxed by McMahon and Owens’ decision to use two anchors, calling it a “two-headed monstrosity.” \n\nRelaunched under McMahon, who ousted then-anchor Norah O’Donnell, the “Evening News” ratings last year had hovered between 4.5 million and 5 million viewers. After DuBois and Dickerson took over in January, ratings have regularly slumped below 4 million total viewers.","summary":"Insiders said Cibrowski appears to making a play to keep his job with a series of bold, 11th-hour moves as CBS parent Paramount closes its merger with the Hollywood studio Skydance. They added, however, that Cibrowski may simply end up as a hatchet man for incoming bosses -- before he ends up a casualty himself.","url":"https://nypost.com/2025/08/15/media/cbs-news-boss-preps-evening-news-shakeup-even-as-his-own-job-may-be-at-risk-sources/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-jsyjos5cq-1755294985703.jpg?quality=75&strip=all&1755280614&w=1200","video":"https://cdn.jwplayer.com/videos/2Twaffy9-RyIcpnTz.mp4","publish_date":"2025-08-15 21:57:45","author":"Alexandra Steigrad","authors":["Alexandra Steigrad"],"language":"en","source_country":"zm","sentiment":-0.008},{"id":351460652,"title":"Trump&#39;s job approval and views of his personal traits - Pew Research Center","text":"President Donald Trump’s current job approval rating stands at 38%, with 60% of U.S. adults expressing disapproval of his performance. This is a modest decline from two months ago, when 41% approved.\n\nAnd perceptions of some of Trump’s personal traits are more negative than they were following his election victory (or in 2024 preelection polling). For instance, 37% of Americans today say “cares about the needs of ordinary people” describes Trump well. That share is 8 points lower than it was shortly after the November election, and 5 points lower than it was in late-summer preelection polling.\n\nTrump’s job approval\n\nMuch of the change in Trump’s approval rating over the last few months has come among his own 2024 voters and people who did not vote in 2024.\n\nTrump’s 2024 voters continue to overwhelmingly approve of his job performance – 85% do so today. However, this reflects a decline from 88% in June and 95% at the beginning of his term.\n\nTrump’s rating has slipped more among his younger voters than among older adults who cast their ballot for him.\n\nA few weeks into his presidency, Trump’s job approval rating among those who voted for him varied little by age. Nine-in-ten or more Trump voters under 35 approved of his job performance, as did similar shares of those in older age groups.\n\nToday, Trump’s rating remains overwhelmingly high among his voters ages 50 and older. But it has slipped considerably more among his youngest voters: 69% of Trump voters under 35 now approve of his job performance, down 23 points from the start of this term.\n\nTrump has also lost ground among adults who did not cast a ballot in 2024. Around a third (32%) approve of his performance today, down from 36% in June and 45% at the beginning of his term.\n\nNearly all of those who voted for Kamala Harris in 2024 disapprove of Trump’s job performance. Just 2% currently approve, essentially unchanged over the last few months (though slightly lower than the 5% who approved at the very beginning of his term).\n\nAmong demographic groups\n\nToday, 38% of Americans approve of the way Trump is handling his job as president, including 27% who approve very strongly. Six-in-ten disapprove, with nearly half (47%) saying they strongly disapprove.\n\nTrump’s approval is more negative than positive among most demographic groups.\n\nWhite Americans are modestly more likely to disapprove of the president than approve: 47% approve of Trump’s performance, while 52% disapprove. Clear majorities of Black (83%), Hispanic (70%) and Asian (66%) Americans disapprove of Trump’s handling of the job.\n\nOlder adults continue to hold more positive views of Trump’s job performance than younger adults (44% of those ages 50 and older approve, compared with 33% of adults under 50).\n\nAnd while 41% of Americans without a bachelor’s degree approve of Trump’s performance, a smaller share of those with a bachelor’s degree (34%) say the same.\n\nTrump’s personal traits\n\nMost Americans (68%) say the phrase “stands up for what he believes in” describes Trump very or fairly well.\n\nSmaller shares say the same about the phrases “mentally sharp” (48%), “keeps his promises” (43%), “cares about the needs of ordinary people” (37%), “honest” (36%) or “a good role model” (29%).\n\nThe share who sees Trump as someone who stands up for his beliefs and the share who sees him as honest are essentially the same as where they stood throughout the 2024 campaign. But Trump’s ratings on other measures are more negative today than they were throughout the campaign and shortly after his November victory.\n\nFor instance, 48% today say “mentally sharp” describes Trump well. Throughout the 2024 campaign and shortly after the November election, more than half of Americans held this view.\n\nViews by party\n\nAs in the past, there are wide partisan gaps on evaluations of the president’s traits. Republicans overwhelmingly say most of these traits apply to Trump, while few Democrats say the same.\n\nThe partisan gaps are particularly wide(60 points or more) on the following traits:\n\nMentally sharp (85% of Republicans say this describes Trump at least somewhat well, while just 14% of Democrats agree)\n\nKeeps his promises (76% vs. 13%)\n\nCares about the needs of ordinary people (72% vs. 5%)\n\nHonest (69% vs. 7%)\n\nThere are narrower – though still wide – partisan gaps on two other characteristics. Republicans are 43 points more likely than Democrats to say Trump stands up for what he believes in. This gap is narrower than others because Democrats are far more likely to say this characteristic applies to Trump than they are to say this about any of the other traits.\n\nConversely, the relatively narrow 51-point gap on views of Trump as “a good role model” is attributable to the slim majority of Republicans who say this applies to Trump (56% vs. 5% of Democrats).","summary":"Trump&#39;s job approval and views of his personal traits - Pew Research Center","url":"https://www.pewresearch.org/politics/2025/08/14/trumps-job-approval-and-views-of-his-personal-traits/","image":"https://www.pewresearch.org/wp-content/uploads/sites/20/2025/08/PP_25.08.11_TrumpEconFP_feature.jpg?w=1200&h=628&crop=1","video":null,"publish_date":"2025-08-15 21:34:23","author":"Reem Nadeem","authors":["Reem Nadeem"],"language":"en","source_country":"au","sentiment":-0.183},{"id":351453252,"title":"New Poll Shows Top 2028 Democratic, Republican Candidates by Texas Voters","text":"A new poll shows Texas registered voters' favorite candidates for the 2028 presidential election.Why It MattersEarly polls, especially in crucial swing states, have gained significance as potential contenders for the 2028 presidential election begin to emerge.Even with the election still a few years away, polling could offer insight into candidate viability, voter sentiment and evolving party dynamics, particularly after the pivotal 2024 election cycle.What To KnowIn the poll by Emerson College released Friday, the Lone Star State's top contenders for Democrats in the potential primary are former Transportation Secretary Pete Buttigieg with 22 percent, California Governor Gavin Newsom with 20 percent and former Vice President Kamala Harris with 17 percent of the vote. The survey shows 14 percent remain undecided.For Republicans, Vice President JD Vance leads the pack with 45 percent of the vote, followed by Texas Senator Ted Cruz with 9 percent, Florida Governor Ron DeSantis and Secretary of State Marco Rubio with 6 percent apiece and Health and Human Services Secretary Robert F. Kennedy with 5 percent. The poll shows 17 percent are undecided.The survey was conducted on August 11 and August 12 among 1,000 actively registered voters in Texas. The margin of error for the survey is 3 percent.Texas registered voters also say the economy is the top issue, followed by immigration, threats to democracy, health care, crime and education.In a previous poll surveying North Carolina registered voters, Buttigieg led the Democrats, followed by Harris and Newsom. Vance led Republicans, followed by DeSantis and then Rubio.What People Are SayingD. Stephen Voss, a political science professor at the University of Kentucky, told Newsweek: \"The Emerson poll results differ from recent numbers we've seen from other polling organizations. (That's not only true on the Democratic side: Having Paxton behind Cornyn, after a big lead in some previous polls, has been remarkable as well.) While the Emerson results could represent significant shifts in how voters are leaning within both major parties, election watchers should take a wait-and-see approach on these new numbers, until they're reinforced by later polling.\"Voss added: \"Buttigieg performed better than usual nationally in Emerson's June poll as well, compared to other poll results. It's possible Emerson's methodology somehow picks up Buttigieg's support base more strongly than other polling. Still, even if the numbers are somehow inflated, it's a solid showing for a former mayor and former Cabinet member. Buttigieg doesn't have the advantages of a former vice president or a California governor, when it comes to attracting publicity. For him to be holding his own in national polling is a strongly positive sign.\"In a previous comment to Newsweek, Columbia University Professor Robert Y. Shapiro said: \"The Democratic primary polling is much too early and all we are seeing is name recognition for past presidential candidates and ones in the news lately in a visible way. On the Republican side, DeSantis and Rubio are damaged goods as past losers in the past Republican primaries in 2016 and 2024. Vance is on the rise by virtue of being Vice President and visible when he echoes or advocates more strongly Trump's MAGA positions and what Trump—and he—have done. He has not been defeated in any past major election so untarnished in that respect.\"Trump, while answering questions during a news conference on the 2028 Olympics, when directly asked if Vance is the successor to MAGA: \"Well, I think most likely in all fairness, he's the vice president. I think Marco [Rubio] is also somebody that maybe would get together with JD in some form. I also think we have incredible people, some of the people on the stage right here, so it's too early obviously to talk about it but certainly he's doing a great job, and he would be probably favored at this point.\"What Happens NextAdditional polling will continue, especially as midterm election campaigns ramp up.Update 8/15/25, 5:34 p.m. ET: This article was updated with comment from D. Stephen Voss.","summary":"Even with the election still a few years away, polling could offer insight into candidate viability.","url":"https://www.newsweek.com/new-poll-shows-top-2028-democratic-republican-candidates-texas-voters-2114311","image":"https://d.newsweek.com/en/full/2703619/pete-buttigieg.jpg?w=1600&h=900&q=88&f=9fe22661af5d4dbf70be53362e71853f","video":null,"publish_date":"2025-08-15 20:50:54","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"us","sentiment":-0.205},{"id":351459760,"title":"EXCLUSIVE: Biden and Harris at War! Sleepy Joe 'Threatening To Expose Kamala's Dirty Secrets'... as Ex-Vice President Promises To Share Details From Failed Campaign In Upcoming Book","text":"Well-placed sources claimed Joe Biden and his allies have threatened to release dirt exposing Kamala Harris' political incompetence if she shares any more details about the former president's mental decline in the Oval Office, RadarOnline.com can reveal. \n\nWhile former Biden staffers were being subpoenaed to testify on his use of autopen and mental acuity as part of the House Oversight Committee's coverup probe, the former vice president announced she was dropping a tell-all memoir on her 2024 presidential campaign.Expert Says Democratic Party Told Harris to 'Keep Her Mouth Shut'Harris' memoir promises to deliver new insights into her botched bid against Donald Trump last year – and experts believe the replacement candidate is poised to air Biden's dirty laundry because she has an axe to grind over his lackluster support for her campaign. \n\nPresidential expert Leon Wagener said: \"Kamala has a chip on her shoulder and she's been told by everybody in the party to keep her mouth shut or 'we'll bury you.'\n\n\"Everyone knows there is a deep well of dislike and distrust between them – and it's going to be an all-out war if she talks and the Biden team goes after her.\"Biden Team 'Preparing For the Worst'Meanwhile, political reporter Mark Halperin claimed Biden's camp are bracing themselves and preparing for a political battle to preserve the 82-year-old's legacy. \n\nHe said: \"If the Biden people decide that Kamala is coming after Joe Biden, wait till you hear the Palinesque stories about how much they tried to help her be prepared to be vice president and be in a position to run,\" in reference to Republican vice president candidate Sarah Palin.\n\nHalperin continued: \"If the Biden people feel threatened, you will hear stories about Kamala Harris as vice president that will not make her look good.\n\n\"I'm telling you, if Joe Biden feels threatened, if his people feel threatened by her, this is going to escalate in a big way.\"Harris Mocked Over Election Loss MemoirAs RadarOnline.com reported, Harris was brutally mocked after announcing her memoir, 107 Days, in a video shared to social media. \n\nHer memoir promised to deliver a \"behind-the-scenes account\" of her \"intense, high-stakes and deeply personal\" campaign, but social media users laughed at Harris writing a book on her humiliating loss to Trump. \n\nOne X user commented: \"Why would you lose an election and then try to sell everyone a book about how horribly you lost.\"\n\nAnother said: \"Should have titled it 'Luckily Voters Didn’t See More Of Me Or I Would Have Lost By Even More.'\"After Harris announced 107 Days, an insider said Biden has faced a bleak existence since moving out of 1600 Pennsylvania Avenue. \n\nThe former president, who has been diagnosed with an aggressive form of prostate cancer, has isolated himself in his Delaware home. \n\nBiden has apparently done everything he can to distract himself from his legal woes and has buried himself in work for his own memoir between cancer treatments.","summary":"The former vice president said her upcoming memoir reveals all the gritty 'behind-the-scenes' details of her 'high-stakes' campaign.","url":"https://radaronline.com/p/joe-biden-kamala-harris-war-erupts-threatening-expose-secrets-president-mental-decline/","image":"https://media.radaronline.com/brand-img/ND0TK6qF8/0x0/biden-threatens-to-spill-kamala-harris-secrets-after-she-announces-tell-all-4-1755282458659.png","video":null,"publish_date":"2025-08-15 20:25:06","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.43},{"id":351466584,"title":"Dem Abandons Moderate Lane To Campaign With Socialist In Trump District","text":"Democratic congressional candidate Rebecca Cooke is tacking left in her third run for a battleground seat that President Donald Trump has won every time he’s been on the ballot.\n\nCooke, a twice-failed candidate running to unseat Republican Wisconsin Rep. Derrick Van Orden in a rematch contest, will participate in an “intimate” town hall event with independent Vermont Sen. Bernie Sanders as part of his “Fighting Oligarchy” tour on Aug. 23. Cooke’s decision to embrace the 83 year-old democratic socialist comes after she previously cast herself as a moderate during previous runs for the seat. (RELATED: Hakeem Jeffries Can’t Stop Ducking And Dodging When Pressed On Mamdani’s Socialism)\n\nCooke, a former Democratic political strategist, is seeking the Democratic nomination in a purple district that President Donald Trump has carried during three consecutive presidential elections. Van Orden narrowly defeated Cooke by roughly three percentage points last November though the Democrat managed to outperform former Vice President Kamala Harris by nearly 10,000 votes.\n\nThe nonpartisan Cook Political Report rates the contest as one of eight GOP-held seats that are “toss-ups” heading into the midterms. Wisconsin’s 3rd Congressional District, which Van Orden has represented since 2023, boasts a Cook Partisan Voting Index of R+3 — meaning it voted an average of three points more Republican than the national average over the last two presidential elections.\n\nTrump carried the district by over seven percentage points in 2024.\n\nDespite the moderate leanings of the Trump-won seat she is running in, the former Democratic campaign staffer has embraced Sanders’ and his socialist platform during her third run for the seat.\n\nSanders endorsed Cooke’s campaign in June, calling the Democratic candidate a potential “ally” and “partner” to raise the minimum wage and expand Medicare if she were elected to the House.\n\n“Rebecca and I share a common goal – bulding [sic] opportunities for the working class,” Sanders wrote in a statement endorsing Cooke. “I believe as my partner in Congress she will do just that.”\n\n“I am a Blue Dog and a New Dem, but I’m also very progressive where it counts,” Cooke told NBC News following the news of Sanders’ June endorsement, referring to two Democratic groups promoting moderate and center-left views.\n\nThe pinned post on the Cooke campaign’s Instagram page is a photo of the candidate and Sanders.\n\nSanders has also endorsed Michigan Senate candidate Abdul El-Sayed and New York City mayoral candidate Zohran Mamdani — who have both come under criticism for their views on Israel.\n\nThe National Republican Congressional Committee (NRCC), House Republicans’ campaign arm, blasted Cooke for aligning herself with Sanders and suggested voters would reject her at the ballot box for a third time.\n\n“Three-time certified loser and Bernie-backed Democrat political operative Rebecca Cooke isn’t fooling anyone,” NRCC spokesman Zach Bannon said in a statement. “Wisconsin families deserve a representative who’ll stand up to the socialist fringe, not one who’s busy booking their next speaking slot.”\n\nThe Blue Dog PAC, the campaign arm of the Blue Dog Coalition in the House of Representatives working to elect moderate Democrats, is also supporting Cooke’s third run — despite the candidate receiving Sanders’ endorsement. Cooke was the first candidate the group endorsed during the 2026 cycle.\n\nIn addition to being the Democratic nominee for the 3rd district in 2024, Cooke also ran for the same seat in 2022, losing in the Democratic primary by eight points.\n\nSpokespersons for Cooke and Van Orden did not respond to the Daily Caller News Foundation’s request for comment before publication.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"","url":"https://dailycaller.com/2025/08/15/rebecca-cooke-bernie-sanders-wisconsin/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/Bernie-Cooke-e1755287362859.jpg","video":null,"publish_date":"2025-08-15 20:06:52","author":"Adam Pack","authors":["Adam Pack"],"language":"en","category":"politics","source_country":"us","sentiment":0.23},{"id":351422080,"title":"Gavin Newsom reveals Trump's private joke over the phone before launching ICE raids in Los Angeles","text":"California Gov. Gavin Newsom revealed the joke President Donald Trump told him in June as Los Angeles descended into chaos amid mass protests to ICE raids.\n\nSix-months after assuming office, Trump ordered Immigration and Customs Enforcement to increase its deportation efforts in Los Angeles.\n\nAs a result, mass protests broke out across the city with demonstrators overwhelming local police and blocking major city highways.\n\nIn response, Trump, against Newsom's wishes, federalized California's National Guard while doubling-down on ICE immigration raids in Southern California.\n\nA day before the president marshalled the state's National Guard, Newsom and Trump spoke on the phone on a late Friday night.\n\nThe California governor revealed in a Thursday interview with MeidasTouch that Trump joked about his 'Newscum' nickname, bragged about his own MAGA merchandise, and discussed the 2024 election debate with Kamala Harris.\n\n'A day before he was to federalize the National Guard here in Los Angeles, he called me. We talked on a Friday night late at night and all he wanted to brag about the 'Newscum' thing. He said, 'It's pretty funny, isn't it?' He goes, 'Pretty original.' I said, 'Well, it's not original,' Newsom said.\n\nNewsom continues, 'He goes, 'Hey, what about my hats? What do you think? It's pretty good brand, right? MAGA, you know, it's pretty good. I've sold hundreds of thousands.'\n\nThe governor reportedly responded, 'I mean, I'm like, are you serious? Are we seriously having this conversation when you're supposed to be reading me the Riot Act about keeping people safe in Los Angeles? You never once talked about the National Guard.'\n\nNewsom called Trump 'unhinged' and claimed that the president 'is getting weaker' because of the effect his tariffs are having on the U.S. economy.\n\n'You cannot make this stuff up,' Newsom added. The president then went on to talk about his debate with Kamala Harris during the 2024 election cycle.\n\nAccording to Newsom, Trump did not mention during the late-night phone call that he was planning on sending in the National Guard to quell the LA protests.\n\nNewsom's recent comments come after the governor launched a new redistricting push in California following efforts by Texas and other GOP-dominated states.\n\nTexas Democrats recently fled the state Capital to New York and Illinois to block a quorum being called by state Republicans. \n\nGreg Abbott and Texas Republicans are trying to push through a mid-decade redistricting legislation that would benefit the GOP.\n\nNewsom sent a letter to Trump earlier this week promising to eliminate Republican seats in California in order to offset GOP gains in Texas and other red states.\n\nTrump did not respond to Newsom's letter, or the governor's insults over social media. \n\nWhen asked for comment by the Daily Mail, the White House pointed to prior comments made White House communications director Steven Cheung without addressing the veracity of Trump's joke.\n\n'What a Coward and Beta Cuck,' Cheung wrote on X. '@GavinNewsom is too chicken shit to take questions from the press after gives an incoherent speech. He'll never be ready for prime time.","summary":"A day before the president marshalled the state's National Guard, Newsom and Trump spoke on the phone on a late Friday night.","url":"https://www.dailymail.co.uk/news/article-15004317/Gavin-Newsom-reveals-Trumps-private-joke-phone-launching-ICE-raids-Los-Angeles.html","image":"https://i.dailymail.co.uk/1s/2025/08/15/17/101261505-0-image-a-8_1755276396554.jpg","video":null,"publish_date":"2025-08-15 18:31:12","author":"Editor,Phillip Nieto","authors":["Editor","Phillip Nieto"],"language":"en","source_country":"gb","sentiment":-0.342},{"id":351431288,"title":"Hillary Clinton Hops On the MAGA Train? Former First Lady Confesses She Would Happily Nominate Trump for Nobel Peace Prize if Prez Saves Ukraine","text":"Hillary Clinton is in President Trump's corner, at least when it comes to the Nobel Peace Prize, RadarOnline.com can reveal.\n\nThe former first lady confessed she would be more than happy to nominate her rival for the prestigious award on one condition: he ends the war in Ukraine and stops Russian President Vladimir Putin's onslaught.How Trump Can Earn Clinton's Nomination\"Honestly, if he could bring about the end to this terrible war, if he could end it without putting Ukraine in a position where it had to concede its territory to the aggressor, could really stand up to Putin, something we haven't seen, but maybe this is the opportunity, if President Trump were the architect of that, I'd nominate him for a Nobel Peace Prize,\" the 77-year-old told podcast host Jessica Tarlov on Raging Moderates.\n\nShe added: \"Because my goal here is to not allow capitulation to Putin.\"\n\nOn Friday, August 15, Trump is set to meet with Putin in hopes of putting an end to the brutal conflict in Ukraine; however, on the flight to Alaska, the meeting's location, he admitted the two planned on discussing land exchange, but said it was up to Ukraine. \n\n\"I've got to let Ukraine make that decision,\" he told reporters. \"And I think they'll make a proper decision. But I'm not here to negotiate for Ukraine. I'm here to get them at a table.\"Clinton and Trump have been feuding for years, with both making it clear they do not like one another, especially during the 2016 election, where she called his supporters a \"basket of deplorables.\"\n\nClinton also suggested the former reality star was besties with dictators, including Putin. And earlier this year, she ripped Trump's administration after his victory over Kamala Harris.\n\n\"Instead of a strong America using all our strengths to lead the world and confront our adversaries, Mr. Trump's America will be increasingly blind and blundering, feeble and friendless,\" she told the New York Times.\n\nTrump has always been open about his obsession with the award, especially after another one of his rivals, Barack Obama, won it in 2009.Does The Prez 'Deserve' The Award?During his Oval Office meeting with Israeli Prime Minister Benjamin Netanyahu in February, Trump was asked about his odds of winning the coveted award.\n\n\"They will never give me a Nobel Peace Prize. It’s too bad. I deserve it, but they will never give it to me,\" he complained at the time.\n\nThe year before, during a rally in Las Vegas, Trump once again cried over the award and told the crowd: \"They gave Obama the Nobel Prize. He didn’t even know why the hell he got it, right? He still doesn’t. \n\n\"He got elected, and they announced he’s getting the Nobel Prize. I got elected in a much bigger, better, crazier election, but they gave him the Nobel Prize.\"Trump is not alone in his thoughts either, as a member of his loyal MAGA base even nominated the president in March 2025.\n\nRep. Darrell Issa, R-Bonsall gushed over Trump's accomplishments despite only being a few weeks into his second term at the time.\n\n\"Not since Ronald Reagan has an American president better represented the national resolve of peace through strength or the fundamental case for a world without war,\" Issa drooled at the time.\n\nHe added: \"Remarkably, it was the 2024 election of Donald Trump, more than 10 weeks before his swearing in, that tangibly kickstarted the cause of peace in numerous regions of the world, and we are already seeing the benefits...\"Only four presidents, along with Obama, have been given the award: Theodore Roosevelt, Woodrow Wilson, and Jimmy Carter.","summary":"Hillary Clinton admitted she would have no problem nominating Donald Trump for the Nobel Peace Prize is he saves Ukraine from Putin.","url":"https://radaronline.com/p/hillary-clinton-maga-trump-nobel-peace-prize-ukraine-putin/","image":"https://media.radaronline.com/brand-img/jBffd5b9L/0x0/clinton-trump-nobel-peace-prize-1755279208979.jpg","video":null,"publish_date":"2025-08-15 18:30:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","source_country":"us","sentiment":-0.112},{"id":351422904,"title":"Fresh proof the federal workforce is still stuck on #Resisting Trump","text":"For dispelling the myth of a super-competent, nonpartisan federal workforce, let us all thank Sean Charles Dunn.\n\nDunn reportedly worked as an international-affairs specialist in the Justice Department’s criminal division — until Thursday, when he allegedly had a public meltdown at federal agents, finishing up by throwing his Subway sandwich at one of them.\n\nVideo shows him cussing out his fellow law-enforcement professionals, proudly denouncing them as “fascists” before his closing food offensive. \n\nHe apparently objected to President Donald Trump’s intervention to fight DC crime.\n\nThe escapade won Dunn a felony charge that could bring a year behind bars — and, once higher-ups learned what he’d done, cost him his job.\n\nGood: It would be audacious enough if some civilian lunatic did something like that, but a federal employee — who works for the president, and at the nation’s top law-enforcement agency, no less?\n\nNo wonder Trump has sought to “drain the swamp.”\n\nSure, many federal workers are hard-working and carry out their jobs without bias.\n\nBut the rot runs deep: Studies have found support for Dems over GOPers running as high as 2-1 among the federal workforce, and far higher at certain agencies.\n\nPlus, Uncle Sam’s employees gave a whopping 84% of their donations last year to Kamala Harris, Government Executive found; 42% admitted plans to “resist” Trump, including 73% of Democratic managers, per the Napolitan Institute.\n\nSuch #Resistance clearly hobbled Trump during his first term, weighing him down with probes, impeachments, insider leaks, and all manner of “creative noncompliance” with his policies.\n\nIt’s outrageous. Federal workers take an oath to “faithfully discharge the duties” of their office — i.e., without bias against a president or policies they dislike.\n\nThe system can’t function any other way.\n\nIf Dunn is found guilty, he deserves every day he gets in lockup. And should never work for the government again.\n\nNo, that won’t put a major dent in this political scourge, but it might send a message to those workers who care about maintaining a functional democracy.","summary":"For dispelling the myth of a super-competent, nonpartisan federal workforce, let us all thank Sean Charles Dunn.","url":"https://nypost.com/2025/08/15/opinion/fresh-proof-the-federal-workforce-is-still-stuck-on-resisting-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/sean-dunn-trump-opinion-comp.jpg?quality=75&strip=all&1755267908&w=1200","video":null,"publish_date":"2025-08-15 18:25:39","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.229},{"id":351447522,"title":"Kamala Harris's Stepdaughter Vents: 'Everything Does Feel Horrible,' I'm Suffering from 'Climate Anxiety'","text":"Ella Emhoff, the stepdaughter of failed presidential candidate Kamala Harris, said she feels “disgust” by what she is seeing in the world, letting her followers on TikTok know that she is experiencing “a lot of climate anxiety” as well.\n\nEmhoff shared an update on her life Thursday, months after her stepmother handily lost the presidential election against President Donald Trump.\n\nWhile she said she is doing good overall, Emhoff said she has been taking time to process and adapt to life without Secret Service. However, she said she feels “disgust” by what she is seeing in the world.\n\n“I feel disgust at what’s going on in the world around genocides, the loss of rights, the loss of health care, the just general fear that everyone has surrounding affordability, their lives, their livelihood, like everything,” she said. “It’s just it feels so big.”\n\nParticularly, Emhoff said she is very anxious about the state of the climate.\n\n“I think everything with the environment is really fucking getting to me. … I experienced a lot of climate anxiety, like a lot of us do,” she said, making it clear that it is “not funny.”\n\n“It’s one of those things that’s not funny, but you just like nervous laugh about it because it’s scary. It is. It’s all of these things are happening,” she said, telling her followers that “engaging in small politics is really important” and urging people to stay “loud.” She used New York City’s socialist mayoral candidate, Zohran Mamdani, as a point of reference, asserting that his run has given people “hope” that they can get into politics “like that.”\n\n“And it’s really cool. So keep doing that. Keep making your voices loud. I think we’re just entering a time of craziness,” she continued, making it clear that she disagrees with Trump’s crackdown on crime in D.C., calling it “insane.”\n\n“I don’t think that we should normalize any of this. And being loud is — and I’m not saying anything new. People are saying this. Like, yes, I’m echoing what everyone is saying. Like, keep being loud, don’t let things be forgotten,” she continued.\n\n@smellaemhoffLittle check in :)♬ original sound – Ella Emhoff\n\nNotably, Emhoff said in June that she felt “trauma” voting in New York City’s mayoral primary, because it was the same polling station where she voted for her stepmom, who lost to Trump.\n\nHer update coincides with that of Hope Walz, the daughter of failed vice-presidential candidate Tim Walz — Harris’s running mate. She recently went on a rant about book recommendations, using Trump’s crackdown on crime and homelessness in D.C. as her point of inspiration.\n\n“Ok so on the topic of BookTok, as well as Trump’s bitch baby, wussy, scaredy cat behavior in D.C., it got me thinking of a book I read in college,” Hope Walz began, adding:\n\nI think it was when I was at the University of Minnesota. It was “Locking Up Our Own” by James Forman Jr., and it talks about what led to, arguably, you should also read “The New Jim Crow” and then go into this one, along with, like, a million in between. … You kind of get it. But like modern mass incarceration, of like black men, and it talks about D.C. and the war on drugs, and how all of that led up to what we’re now seeing.\n\nBoth of their remarks follow Trump’s action on Monday invoking section 740 of the District of Columbia Home Rule Act, placing the D.C. Metropolitan Police Department under direct federal control, and activating the National Guard to combat crime in D.C.\n\nOn the topic of D.C. crime, former Capitol Police Chief Steven Sund recently explained that it is essential to look at the bigger picture.\n\n“To see these gangs of youth kind of taking it [the Navy Yard] over, it doesn’t surprise me that they’re now going to pull these federal resources together and form… [a] task force,” he said during an appearance on Breitbart News Daily.\n\nWATCH — Trump Invites Media on D.C. Police Ride-Alongs to See Crime Firsthand:\n\n“We did this in the early ’90s, when I was with D.C. police, we were able to drive down homicide rates. When Chief Lanier was chief, think about 2010 to 2014, we had a homicide rate that was maybe right around 100, 170 a year. Now 2023, you got 274 homicides. So you had a significant increase,” he said.\n\n“So when people talk about, ‘Oh, there’s big drop,’ there’s a drop from 2023 to 2024, but it’s still significant — double what we had in around 2010,” the former police chief said, emphasizing that the D.C. homicide rate is “five to six times that of any other major city in the United States.”","summary":"Ella Emhoff, the stepdaughter of failed presidential candidate Kamala Harris, said she feels “disgust” by what she is seeing in the world, letting her followers on TikTok know that she is experiencing “a lot of climate anxiety” as well.\n\n\nThe post Kamala Harris&#8217;s Stepdaughter Vents: &#8216;Everything Does Feel Horrible,&#8217; I&#8217;m Suffering from &#8216;Climate Anxiety&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/08/15/kamala-harris-stepdaughter-vents-everything-does-feel-horrible-im-suffering-from-climate-anxiety/","image":"https://media.breitbart.com/media/2025/08/AP24305059329519-640x335.jpg","video":null,"publish_date":"2025-08-15 17:40:48","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","source_country":"US","sentiment":0.174},{"id":351428176,"title":"Brittany Mahomes sends Taylor Swift a message over viral quote from Travis Kelce podcast appearance","text":"Taylor Swift and Brittany Mahomes' at times rocky friendship appears stronger than ever after the singer's New Heights podcast appearance this week.\n\nThis time last year, the brand new besties appeared to suddenly be at odds after Mahomes endorsed Donald Trump in the upcoming election while Swift, who has a long-running feud with Trump, backed Kamala Harris.\n\nBut earlier this week, as excitement reached fever pitch about Swift joining Travis and Jason Kelce on New Heights, Patrick Mahomes revealed the singer facetimed his wife after finishing recording the show.\n\nAnd her appearance clearly went down well with Brittany, who shared on Instagram what has become a viral quote from Swift when she said on the show: 'Think of your energy as if it's expensive, as if it's a luxury item. \n\n'Not everyone can afford it. Not everyone has invested in you in order to be able for you have the capital to care about this.'\n\nMahomes reposted the clip on Friday morning and wrote, with three applauding emojis: 'That. Is. The. Day.' \n\nSwift also announced her new album on the podcast, with he 12th record 'The Life of a Showgirl' released October 3.\n\nThree-time Super Bowl winnner Patrick revealed Wednesday he had an early heads-up that Swift was finally appearing on the show, telling reporters at practice: I knew before y'all did just because they called me after the podcast was done.'\n\nHe jokingly corrected himself, adding: 'They didn't call me, they called Brittany. I was in the back of the FaceTime.'\n\nSoon enough, Mahomes and Swift will be reunited at Arrowhead Stadium once the Kansas City Chiefs start the new NFL season.\n\nThe Chiefs play their first game in Sao Paulo, Brazil against the Los Angeles Chargers on Friday, September 5.\n\nIn Week 2, it's a Super Bowl rematch against the Philadelphia Eagles at Arrowhead in what is a difficult start for Kelce and Mahomes. They also meet Baltimore Ravens, Detroit Lions, Washington Commanders and Buffalo Bills by November 2.\n\nEarlier this week, Chiefs quarterback Patrick made some eye-opening quotes about Brittany giving birth to their third child, Golden Raye, back in January. \n\n'Brittany crushed it. I was watching playoff games the entire day. She went to labor after one game,' Patrick Mahomes recalled in a clip of 'The Kingdom' which aired on the latest episode of 'Good Morning America.' \n\n'Baby was here before the next game, so I didn't even miss a playoff game. So, she is as locked in as I am as far as football goes.","summary":"This time last year, the brand new besties appeared at odds as Mahomes endorsed Donald Trump in the election while Swift supported Kamala Harris.","url":"https://www.dailymail.co.uk/sport/nfl/article-15004605/Brittany-Mahomes-Taylor-Swift-message-viral-Travis-Kelce-podcast.html","image":"https://i.dailymail.co.uk/1s/2025/08/15/17/101262477-0-image-m-16_1755276919634.jpg","video":null,"publish_date":"2025-08-15 17:23:37","author":"Editor,Jack Bezants","authors":["Editor","Jack Bezants"],"language":"en","category":"entertainment","source_country":"jp","sentiment":-0.031},{"id":351466384,"title":"Even More Latinx Trump Supporters Now Regretting Their Votes","text":"At almost eight months into President Donald Trump’s second term, many of the 46 percent of Latinos who voted for him are expressing buyer’s remorse. Welp, it’s too late to get their money back, but that’s not stopping them from speaking up and out against the guy they helped put in office.\n\nAfter mass deportations, ICE raids and hits to the U.S. economy, many Latinx voters don’t know what to do. On the flip side, Black Americans, who largely voted for former Vice President Kamala Harris, are sitting back like “I told you so!” Now, The Root is taking a look at all the stories of Latinx folks who regret their decision… You may want to pop some popcorn for this!\n\nTrump Couple Allegedly Racially Profiled by Border Patrol \n\nGeorge and Esmeralda Doilez are U.S. citizens, who were on their way to a dentist appointment when they were pulled over by masked Boarder Patrol agents. We didn’t think we had anything to worry about,” Doilez told NBC San Diego. After a brief exchange, which was caught on video, officials ended up searching their car and accusing them of being undocumented. Interestingly, the Doilez couple voted for Trump in 2020 and in 2024. Now, Doilez regrets his vote. “He [Trump] lied to us about going after the worst of the worst,” he said. “He lied on those and he stole our vote.” Esmeralda added, “We can’t let them take our rights. Then we’re nothing.”\n\nTrump Supporter Detained by ICE\n\nThis man thought just because he is a U.S. citizen he wouldn’t have to worry about being profiled by ICE… *spoiler alert* He thought wrong. He and two other men were stopped, and even after he told agents he was a citizen, they didn’t believe him. Eventually, the man was let go, but he said he has no clue what happened to his two friends. “I vote for Trump last election because I thought it was gonna… just go against criminals, not every Hispanic,” he said. “They will assume we are all illegals.”\n\nMAGA Couple’s Son Gets Deported\n\nDébora Rey and her husband Martín Verdi voted for Trump in 2024, but now, they have to visit their son at a detention facility in Georgia after he was detained by ICE. The couple told the Atlanta Journal Constitution they liked Trump’s “get tough on undocumented immigrants” stance, but they didn’t think the president would go after their son, who holds a Green card.\n\nViral TikTok of Trump Supporter\n\n@cynsationall5 on TikTok is getting dragged after she came to the app to tell her followers that her own father has been deported… but here’s the kicker: she voted for Trump back in November. “Blindfolds were ripped off my eyes,” she said. “No one deserves to go through something like this behind bars,” she said while crying. As you can expect, no one had sympathy for her. \n\nBoxer Ryan Garcia Speaks After LA Raids\n\nMexican boxer Ryan Garcia made headlines last year when he shouted “Donald Trump 2024!” Months after endorsing the 47th president, it seems Garcia is having some regrets. He took to X shortly after ICE raids in Los Angeles, where he lives, to condemn the targeted attacks. “I may have voted for Trump, but I can’t stay silent about what’s happening with ICE in LA,” he wrote on X. “Ripping them away from their homes is not just policy, it’s pain. We can have borders without losing our humanity.”\n\nMAGA Cuban Rapper to Be Deported\n\nClearly, it doesn’t matter how many songs you sing for the president or if Secretary of State Marco Rubio likes your music… Cuban rapper El Funky was an avid Trump supporter leading up to his election, according to POLITICO. Now, he faces deportation after he was detained by ICE just last month. And surprise, surprise, Rubio– who once gave Funky a shoutout– is more than silent. \n\nMAGA Voter Crying Online\n\nThis Trump voter took to TikTok to share her fears about the 47th president. “This is so crazy that we voted for Trump. We trusted the words he promised us Latinos,” she said while crying. Now, after Trump promised mass deportations, she said she doesn’t know what to do. “I hate that I voted for him. Now, I’m so scared for my family.”\n\nVenezuelans Feel ‘Betrayed’ by Trump\n\nTrump recently rescinded the Temporary Protected Status for hundreds of thousands of Venezuelan migrants, and in response, Venezuelans who voted for him feel like the president simply took advantage of them. Adelys Ferro, the director of the Venezuelan American Caucus, told NPR he feels “beyond betrayed” by the administration. “They used us,” he said.\n\nPro-Trump Mother Left to Take Care of Kids Alone \n\nCuban mother and Trump voter, Liyian Páez, was devasted when her husband, Alían Méndez Aguilar, 28, was sent back to Cuba in April. She said she feels “betrayed” by Trump. Now, she’s left to take care of their two children, one of which is paraplegic. She also said in an interview with Univision she’s struggling to maintain her job and the household without her husband’s income.\n\nMAGA Voter on Medicaid in Danger\n\n View this post on Instagram \n\nIrma Arredondo was a Democrat since she became a U.S. citizen, but in the last election, she voted for Trump because of his pro-life stance. Now, the 64-year-old woman said Trump is “stabbing us in the back,” after his proposed cuts to Medicaid will directly impact her, her daughter with cerebral palsy and her sister with Turner’s Syndrome. Arredondo also has Type 1 Diabetes, and her entire household is on Medicaid. Trump’s “Big, Beautiful Bill” act promises to cut Medicaid drastically. \n\n‘They Took My Wife’\n\nAn unidentified man expressed his regrets after his wife was one of three detained by ICE and deported. He voted for Trump in November, and now, he keeps a small picture of his wife in his wallet to remember her by. “She already had a court date,” he told reporters. “Everything was good and they just came in and snatched her.” \n\nRep. María Elvira Salazar \n\nRep. María Elvira Salazar, a Trump supporter, said she’s “heartbroken” over the White House’s deportation mandate. “Arrests in immigration courts, including people with I-220A and pending asylum cases, the termination of the CHNV program, which has left thousands exposed to deportation, and other similar measures, all jeopardize our duty to due process that every democracy must guarantee,” she said. \n\nTrump Rally Goer Feels Regrets\n\nShe stood on stage during a Trump rally screaming “We Love Youuu!” Months later, this unidentified woman says she feels “beyond betrayed,” echoing sentiments from within the Latinx community. “They used us,” she continued. \n\n‘Latinas for Trump’ Co-Founder Cries Tears \n\nFla. Sen. Ileana Garcia had a message for the president after she– a longtime Republican and co-founder of “Latinas for Trump”– started feeling the weight of her vote. “As the state senator who represents her district and the daughter of Cuban refugees, who are now just as American, if not more so than Stephen Miller, I am deeply disappointed by these actions. And I will not stand down,” she said. \n\nLatinos for a Trump Economy\n\nA 61-year-old retired Dominican American told Alternet, “We voted for Trump and Trump betrayed us.” The man named Jose continued, “The truth is people voted for one thing: the economy. A good economy. And these tariffs are hiking everything up. … And he’s kicking out hard workers and not touching the people who don’t work, he’s leaving them. How does that make sense?”\n\nTrump-Sign-Holding Cuban Detained by ICE\n\nIn April, Héctor Luis Valdés Cocho was pictured holding up a Trump 2024 sign. Just months later, he was reportedly detained by ICE. It’s unclear what his current detention status is or exactly why he was arrested in the first place. But according to Snopes.com, which was able to verify his identity, Cocho is a journalist and Cuban activist who was forced into exile back in 2022.","summary":"From a woman on Medicaid to families being ripped apart after voting for Trump, the Latinx community is split as some voters are regretting their choice.\n\nRead more...","url":"https://www.theroot.com/even-more-latinx-trump-supporters-now-regretting-their-2000046005","image":"https://assets-server.theroot.com/wp-content/uploads/2025/06/17141312/GettyImages-1284475995-scaled.jpg","video":null,"publish_date":"2025-08-15 17:07:47","author":"Phenix S Halley","authors":["Phenix S Halley"],"language":"en","category":"politics","source_country":"US","sentiment":-0.451},{"id":351402346,"title":"Real reason The Late Show With Stephen Colbert was cancelled","text":"Stephen Colbert announced last month that CBS will be cancelling his late night talk show in May 2026, after 10 years on air. While Stephen and many celebrities shared their dismay over this news, fans were never given the real reason The Late Show was axed.\n\nDuring a taping on July 17, Stephen told a live audience: \"It's not just the end of our show, but it's the end of The Late Show on CBS…I'm not being replaced. This is all just going away.\"\n\nThe same day, Paramount Global and CBS released a joint statement saying that the decision was \"purely…financial against a challenging backdrop in late night\" and it was \"not related in any way to the show's performance, content or other matters happening at Paramount.\"\n\nThe statement continued: \"We are proud that Stephen called CBS home. He and the broadcast will be remembered in the pantheon of greats that graced late night television.\"\n\nAnd while Stephen remained cordial with CBS and even thanked them during his announcement, many of his colleagues, politicians, and fans of the show questioned the timing of the decision.\n\nThe cancellation announcement came just days after Stephen called out his parent company for their $16 million settlement with the White House over a 60 Minutes interview with the then-Vice President Kamala Harris.\n\n\"As someone who has always been a proud employee of this network, I am offended,\" Stephen said in his opening monologue. He continued: \"Now I believe this kind of complicated financial settlement with a sitting government official has a technical name in legal circles. It's a big, fat bribe.\"\n\nA few days after the announcement, the U.S. Federal Communications Commission approved an $8 billion deal, which merged Paramount Global with Skydance Media and placed government conditions on the network's news division.\n\nThe agreement will roll back Paramount's DEI efforts and make \"significant changes\" to the content CBS puts out.\n\nFCC Commissioner Anna Gomez, a Democrat who voted against the merger, called the conditions laid out in the deal a \"never-before-seen form of government control over newsroom decisions and editorial judgment.\"\n\nAll of these incidents felt too suspicious for many Late Show fans. Senator Adam Schiff wrote to social media after the cancellation announcement: \"If Paramount and CBS ended The Late Show for political reasons, the public deserves to know. And deserves better.\"\n\nBut, executives at Paramount insist the decision was not political. During a press conference after the decision, the network's Global CEO, George Cheeks, said The Late Show \"wasn't sustainable to continue,\" but that they are \"huge fans of Colbert\" and they \"love the show.\"\n\nThe Late Show originated in 1993 with the legendary host David Letterman. On July 21, David showed his support for Stephen when he posted a compilation of moments he was critical of CBS while hosting the talk show to his YouTube channel.\n\nDavid captioned the video: \"You can't spell CBS without BS.\"","summary":"Stephen Colbert's Late Show was cancelled by CBS for \"financial\" reasons, but the timing after his criticism of the network has sparked political speculation.","url":"https://www.hellomagazine.com/film/850432/late-show-with-stephen-colbert-real-reason-for-cancellation/","image":"https://images.hellomagazine.com/horizon/landscape/b3617d3cf3e4-gettyimages-1395278830.jpg","video":null,"publish_date":"2025-08-15 16:54:17","author":"Tess Hill","authors":["Tess Hill"],"language":"en","source_country":"gb","sentiment":0.101},{"id":351415966,"title":"Taylor Swift says you should think of your energy like it's an expensive 'luxury item'","text":"Taylor Swift might have worn an $11,400 necklace when announcing her new album, but she spoke more about another luxe commodity: her energy.The pop star explained how she maintains a \"healthy relationship\" with social media during an appearance on her boyfriend Travis Kelce's podcast, saying that she ignores a lot of what's written and posted about her.\"I have so many friends or acquaintances or people where like, they'll see one comment they don't like and it will ruin their day, it will ruin their night,\" Swift said. \"I just want to say to them, you should think of your energy as if it's expensive, as if it's like a luxury item. Not everyone can afford it.\"Kelce's sense of humor about online content has helped Swift get to this point of relative nonchalance, she said. And some of her willful ignorance is by design — she said she's had her Instagram comments disabled for around 10 years and doesn't miss them.Swift is no stranger to online hate — last year, sexually explicit AI-generated images of her went viral on X and Telegram, with one image staying up for 17 hours and getting more than 45 million views. The posts reignited calls for laws to fight deepfakes, and Swift herself turned those and other false images into political fuel. In September, she announced she was endorsing former Vice President Kamala Harris for president in part because of AI-generated images of her that President Donald Trump posted.As one of the world's most successful artists, Swift has to be intentional with how she expends the \"luxury item\" of her energy, which has itself been a topic of controversy. Though she spent a combined 484 hours singing onstage at the Eras tour and was in a state of self-described \"perpetual discomfort,\" fans and critics alike knocked her for taking a break after the concerts ended.As strict RTO mandates are back in full swing and Elon Musk touts 120-hour work weeks, Swift's comments about protecting one's own energy may resonate beyond the social media realm. Gen Z workers are avoiding leadership roles to protect their work-life balance, while employees generally may be experiencing \"quiet cracking\" and struggling to find meaning in the many hours of \"expensive\" energy, to quote Swift, they spend at their jobs.","summary":"Taylor Swift said she maintains a healthy relationship with social media by ignoring a lot of what's written about her.","url":"https://www.businessinsider.com/taylor-swift-travis-kelce-podcast-energy-luxury-item-2025-8","image":"https://i.insider.com/689f5255cfc04e97619b7cfa?width=1200&format=jpeg","video":null,"publish_date":"2025-08-15 16:06:22","author":"Alice Tecotzky","authors":["Alice Tecotzky"],"language":"en","source_country":"US","sentiment":0.032},{"id":351397112,"title":"Jake Tapper, Ronny Chieng, Amber Ruffin and More Explore the Power of Truth in Storytelling at Variety and Rolling Stone’s Truth Seekers Summit","text":"At the 2025 Variety & Rolling Stone Truth Seekers Summit presented by Paramount+, keynote conversations and panel discussions with documentary filmmakers, journalists and cultural trendsetters explored the art and nuances of documentary, investigative and political storytelling across multiple platforms. \n\n The summit took place on Aug. 14 in New York, where conversations hosted by Variety and Rolling Stone contributors included reporting in politics, documentary development and true crime. \n\n Here are some of the highlights throughout this year’s summit:\n\n Close-up on “Bodyguard of Lies” \n\n Moderated by Susan Zirinsky, a conversation about “Bodyguard of Lies” centered around the making of the political documentary focusing on the war in Afghanistan. The panel’s guests included Dan Krauss who served as the director of “Bodyguard of Lies,” and Craig Whitlock, the author of “The Afghanistan Papers,” which served as the inspiration for the documentary. “Bodyguard of Lies” retells the story of the systemic deception that was given to the American public. \n\n “The thing that’s most haunting about this conflict is you don’t get the sense that they’re going to learn the next time around and we’re doomed to repeat history,” Krauss said. “I would like to feel like this film and Craig’s reporting will make a difference.”\n\n Documentary Roundtable \n\n The Documentary Roundtable, hosted by Variety’s chief correspondent Daniel D’addario, included panelists such as R.J. Cutler (“Martha”), Bao Nguyen (“The Greatest Night in Pop,” “The Stringer”), Elegance Bratton (“Move Ya Body: The Birth of House”), Mary Robertson (“The Fall of Diddy”), Jennifer Tiexiera (“Rebecca,” “Speak’) and Dan Krauss (“Bodyguard of Lies”). The panel centered around the importance of truth seeking in documentary filmmaking.\n\n “We imagine before we start making it, but there’s no script. We have no idea what’s gonna happen. We also talk about the fact that we rely on surprises to make the films that we love the most,” Cutler said during the panel. When asked about what advice the documentary filmmakers would give to aspiring filmmakers, Tiexiera revealed what she learned from making her documentary. “It’s such a learning process, but in addition to that, I have to assume that I can’t do it all alone, and none of us really can. We’re not social workers [or] therapists — we’re filmmakers.”\n\n Conversation With Jake Tapper \n\n Jake Tapper sat down with Variety co-editor-in-chief Ramin Setoodeh to discuss CNN’s coverage of President Trump, noting that it’s not always easy to discern what the president truly means. “There is what Trump says publicly. There is what Trump posts on Truth Social. And then there is what Trump and his administration do. And those are three different things,” Tapper said. “I personally think what he does is the most important and what he posts on social media in the middle of the night is the least important.”\n\n The CNN anchor also criticized Trump’s lawsuit against CBS News over a “60 Minutes” segment, which was ultimately settled by Paramount Global with a $16 million payment to Trump. “I will say this proudly under the Paramount+ banner — that lawsuit was bullshit against ’60 Minutes,'” Tapper said. He added that “editing is done all the time” in television news and insisted there was “no bias” in how “60 Minutes” edited its interview with then–Vice President Kamala Harris.\n\n Political Groundbreakers Roundtable \n\n This year’s Political Groundbreakers Roundtable, hosted by Variety’s Brian Steinberg, highlighted the work of Yamiche Alcindor, Zeke Miller, Alex Thompson, Antonia Hylton and Annmarie Hordern, and featured a discussion on political reporting across media. \n\n As the digital media landscape changes in how viewers receive political updates, Hylton explained how to get the audience’s attention to become more informed about what is going on throughout America in this political climate. “We’re not just going to speed through this and quickly show you a graphic or whatever it is. We’re going to take some time to talk about it,” Hylton said. “I think people really start to feel that they better understand the connections between all the stuff that they’re inundated with every week when you give them a moment to do that.”\n\n Conversation With Ronny Chieng \n\n During a conversation with Variety’s Tatiana Siegel, “The Daily Show” senior correspondent Ronny Chieng explained how to blend satire in order to entertain and to inform audiences about the current state of the world. \n\n “We make sure it’s based on reality,” Chieng said. “We see what’s in the news and we pride ourselves on fact checking our jokes.” \n\n With a large platform, Chieng expressed the importance of knowing what the audience wants to hear. “Adding the responsibility is kind of the job of outside of the watchers and audience members and observers inside the show. Comedy’s just making fun of everybody, making fun of institutions. Just go for it. And people get upset. Some people don’t get upset. That’s not for us to figure out.”\n\n Conversation With “Have I Got News For You” \n\n Roy Wood Jr. and Amber Ruffin discussed the evolution of “Have I Got News For You” in a keynote conversation hosted by Asawin “Swin” Suebsaeng, senior political reporter of Rolling Stone. “Comedically you’re either reporting on what you feel or what you saw. I think we’re able to try, find a balance of that,” Wood said. “It’s very difficult, especially as we start transitioning to whatever entertainment’s gonna be in the next couple of years and figuring out how do you have a platform that criticizes people without bringing on the people that you’re criticizing, but without validating the people and the bullshit that they stand for and figuring out that we are balanced.”\n\n Conversation With “Room to Move” \n\n The documentary “Room to Move” follows choreographer and performer Jenn Freeman as she prepares her first solo, evening length work, “Is It Thursday Yet?,” while also receiving a later-in-life diagnosis of Autism Spectrum Disorder. “When all of this happens, it kind of crumbles and shatters the facade of what you thought was real and who you thought you were,” Freeman said. “I was inside of that, like, everything was falling down, it felt like, and I felt far away from dance at that moment in time, which is the thing that throughout my life has really grounded me and showed me who I am.”\n\n Fireside Chat With “Deaf President Now!” \n\n Moderated by Variety film reporter Rebecca Rubin, the Fireside Chat with “Deaf President Now!” featured Nyle DiMarco, who served as the film’s co-director and producer. “When I was growing up, I remember seeing so many deaf characters and any sort of reflection in the media of the deaf experience was just inauthentic,” DiMarco said of the beginning of the documentary’s production. “As a director, you have to swallow a big pill, which is that everything you do must be in service to a beautiful film. You have to sort of find these gems that you can polish and highlight their shine. I’m very, very relieved that the deaf community has given us such a warm reception and have been so excited.”\n\n The State of the Documentary Industry \n\n During a panel about the current state of documentary development, production and distribution, Variety‘s Brent Lang spoke with Dan O’Meara, EVP of nonfiction, Neon; Sylvia Bugg, chief programming executive and GM of general audience programming, PBS; Carrie Lozano, president and CEO, IT VS; Cara Cusumano, festival director and SVP programming, Tribeca; and Karol Martesko-Fenster, CEO and president, Abramorama. \n\n The group brought up why public media is crucial for documentaries, with Lozano saying, “This is why public media matters so much: because we’re not driven by money. We don’t have a profit motive. We’re mission-driven. And for those of us who’ve been making films — say, 25 years ago — today is much like it was 25 years ago. It’s always been hard because, at its core, so many of these films — they’re not really about profit. They’re not commercial in nature. And so, that moment where the nonprofit realities of these films met the commercial possibilities — I always felt like it was a bubble. It just didn’t seem like it could last. But public media is a place where, actually, you do get the largest audience for these types of films, and they’re accessible to people throughout the country.”\n\n Masters of True Crime and Investigative Storytelling \n\n A panel moderated by Rolling Stone’s Brenna Ehrlich focused on the true crime documentary works of Ben McKenzie (“Everyone Is Lying to You for Money”), Julia Willoughby Nason (“American Murder: Gabby Petito”), Joe Berlinger (“Cold Case: The Tylenol Murders,” “Cold Case: Who Killed JonBenét Ramsey”), Lisa Cortés (“Murder Has Two Faces”) and Shannon Evangelista (“The Curious Case of Natalia Grace”). The group discussed such topics as why they’re drawn to making true crime documentaries, how they choose which stories to tell, and the importance of handling those stories in a responsible manner. \n\n “This is somebody’s worst moment in their life that you wouldn’t wish on anybody,” Berlinger said. “So we need to be respectful.” \n\n (Pictured: Ronny Chieng)","summary":"At the 2025 Variety &#38; Rolling Stone Truth Seekers Summit presented by Paramount+, keynote conversations and panel discussions with documentary filmmakers, journalists and cultural trendsetters explored the art and nuances of documentary, investigative and political storytelling across multiple platforms.&#160; The summit took place on Aug. 14 in New York, where conversations hosted by Variety and [&#8230;]","url":"https://variety.com/2025/biz/news/truth-seekers-summit-2025-takeaways-jake-tapper-ronny-chieng-1236490029/","image":"https://variety.com/wp-content/uploads/2025/08/GettyImages-2230123611.jpg?w=1000&h=563&crop=1","video":null,"publish_date":"2025-08-15 16:00:00","author":"Leia Mendoza","authors":["Leia Mendoza"],"language":"en","source_country":"us","sentiment":0.446},{"id":351411676,"title":"Joe Concha challenges moderate Democrats to stand up to party","text":"“If you are [House Minority Leader Hakeem Jeffries (D-NY)], you’re [Senate Minority Leader Chuck Schumer (D-NY)], whoever’s not part of the far, far left in the party, and those numbers are dwindling in terms of who’s in the so-called ‘middle,’ will you stand up for your party?” Concha said. \n\nHe noted that only a few Democrats, such as Sen. John Fetterman (D-PA), have publicly broken with progressive colleagues on certain issues.\n\n“[The left] wing is winning, especially the media war,” Concha said, citing recent polling showing Sen. Bernie Sanders (I-VT) and Rep. Alexandria Ocasio-Cortez (D-NY) as the party’s more popular figures.\n\n“If this party decides to continue to go to the far left, and they end up using a far-left candidate as its nominee, they will lose in a way that will make [former Vice President] Kamala Harris’s loss look respectable,” he said. \n\nConcha questioned whether that momentum would translate into victories in battleground states such as Pennsylvania, Michigan, Wisconsin, Arizona, North Carolina, Georgia, and Nevada, warning that the political landscape in those areas is very different from that of a stronghold like New York. \n\nTurning to Mamdani’s current race, Concha said the candidate would be heavily favored if the crowded field remained intact. “Ninety-nine percent chance he wins if the race stays the way it is right now: four candidates.”\n\nAn Aug. 12 poll from Siena College currently shows Democratic nominee Mamdani holding a strong lead over other candidates.","summary":"Washington Examiner’s Joe Concha said Thursday that the Democratic Party is facing a pivotal moment as its far-left candidates, such as Zohran Mamdani, dominate media attention and polling within the party. Speaking on Fox News&#8217;s Hannity, Concha called on centrist Democrats to “stand up” for their party, pointing to their lack of endorsement for more [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3500854/joe-concha-challenges-moderate-democrats-to-stand-up-to-party/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/nyc-poison-candy-santa.webp","video":null,"publish_date":"2025-08-15 15:50:15","author":"Adisa Hargett-Robinson","authors":["Adisa Hargett-Robinson"],"language":"en","category":"politics","source_country":"US","sentiment":0.333},{"id":351380246,"title":"Judge Halts Central Park 5’s Lawsuit Against Trump","text":"A federal judge in Pennsylvania on Friday paused the Central Park Five’s defamation lawsuit against President Donald Trump until the appellate court decides on his claim of immunity, representing a temporary victory for Trump in terms of postponement.\n\nThe order issued by Chief U.S. District Judge Wendy Beetlestone, an appointee of Barack Obama, was succinctly contained in just one line, yet her rationale was elaborated in a detailed footnote spanning multiple pages.\n\nAccording to Law&Crime, Trump’s personal lawyers contended that although Judge Beetlestone declined to dismiss the case, the president is hindered by “meritless litigation” and deserves a pause on the lawsuit pending his appeal focused on immunity at the 3rd U.S. Circuit Court of Appeals.\n\nJudge Beetlestone had earlier determined that the Commonwealth’s Uniform Public Expression Protection Act (UPEPA) — an anti-Strategic Lawsuit Against Public Participation (anti-SLAPP) law — was not applicable in federal court.\n\nHowever, Trump’s appeal argued that the anti-SLAPP law, intended to protect defendants from being intimidated or hindered by costly and baseless lawsuits, includes an “immunity from suit” clause that he has the right to invoke.\n\nEmphasizing that his “appeal presents a non-frivolous question,” Trump urged Beetlestone to order up an “immediate stay” pending an active appeal at the 3rd Circuit. And that’s what the judge has done, explaining why, again, in a lengthy footnote.\n\n“[W]hen a court determines that a party is not entitled to one of these immunities as a matter of law, and the party claiming the immunity appeals, it is entitled to a stay pending the outcome of the appeal, provided that the claim of immunity is not frivolous,” the judge wrote. “Defendant argues that, because this immunity is akin to absolute and qualified immunity—i.e., that it is an ‘immunity from suit,’—he is entitled to a stay while he litigates his entitlement to that immunity on appeal.”\n\nBeetlestone determined that because “the text of the Anti-SLAPP statute itself suggests that the ‘essence’ of its immunity is indeed ‘a right not to stand trial'” and not merely an “immunity from liability,” Trump won the day.\n\n“These provisions collectively work to insulate immunity-claimants from the burdens of trial until such time as their entitlement to the immunity is conclusively decided,” the judge wrote, granting the stay pending appeal.\n\nAntron Brown, Kevin Richardson, Raymond Santana, Korey Wise and Yusef Salaam filed their defamation suit in October, saying that Trump — during a 2024 debate with then-Vice President Kamala Harris — had “falsely stated that Plaintiffs killed an individual and pled guilty to the crime.”\n\nIn 1989, the then-teenagers were wrongfully accused of raping Trisha Meili as she jogged in Central Park in New York City. The five were also accused of attacking two men that same night.\n\n“While in police custody, Plaintiffs were each separately subjected to hours of coercive interrogation, under duress, with no attorney present and often without a parent or guardian present,” the lawsuit recounted. “Plaintiffs all initially denied having any knowledge of the Central Park assaults. However, after hours of interrogation, four of the Plaintiffs agreed to provide written and videotaped statements in which they falsely admitted to having been present during the assaults.”\n\nThe Central Park Five faced trials, maintained their innocence, were convicted by juries in 1990 and were sent to prison, only to be exonerated decades later after the real attacker, Matias Reyes, admitted to the crime against Meili and DNA “conclusively” proved that Reyes was the “true perpetrator,” court documents said.\n\nNotably, the five did not plead guilty and were not accused of killing anyone — yet, during a nationally televised presidential debate with Harris in Pennsylvania last September, Trump said: “They admitted – they said, they pled guilty. And I said, well, if they pled guilty they badly hurt a person, killed a person ultimately.”\n\nThe remarks were a response to Harris’ statement that, throughout his life and career, Trump has “attempted to use race to divide the American people,” and that an example of this was the “full-page ad” he placed in the New York Times and elsewhere in 1989 “calling for the execution of five young Black and Latino boys who were innocent — the Central Park Five — took out a full-page ad calling for their execution.”\n\nIn the ad at issue, Trump advocated for bringing back the death penalty and alluded to the Central Park Five case:\n\nMany New York families — White, Black, Hispanic and Asian — have had to give up the pleasure of a leisurely stroll in the Park at dusk, the Saturday visit to the playground with their families, the bike ride at dawn, or just sitting on their stoops — given them up as hostages to a world ruled by the law of the streets as roving bands of wild criminals roam our neighborhoods, dispensing their own vicious brand of twisted hatred on whomever they encounter. At what point did we cross the line from the fine and noble pursuit of genuine civil liberties to the reckless and dangerously permissive atmosphere which allows criminals of every age to beat and rape a helpless woman then laugh at her family’s anguish?\n\nThe ensuing lawsuit alleged that Trump engaged in “malicious, intentional and reckless conduct” and should be on the hook for punitive damages to “punish Defendant Trump for his conduct and deter him and others similarly situated from like acts in the future.”\n\nIn June, Beetlestone ruled that Pennsylvania’s anti-SLAPP statute “does not apply here, in federal court,” and that the defamation case could move forward as a result, but Trump’s lawyers with the Dhillon Law Group have since succeeded in arguing that their “not frivolous” immunity claim made a stay necessary and proper while the appeal is pending.\n\n“Without a stay, the damage will already be done as President Trump would have been subjected to the hardships involved in litigation for a matter for which he was immune from suit,” Trump’s motion said previously. “In this scenario, President Trump would have wholly lost the principal benefit of the immunity UPEPA was enacted to confer, and to which he was legally entitled. This constitutes irreparable harm.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresidential candidates Donald Trump and Kamala Harris pictured during a segment of&#8230;\n\n\nThis Post: Judge Halts Central Park 5&#8217;s Lawsuit Against Trump first appeared on Internewscast Journal","url":"https://internewscast.com/crime/judge-halts-central-park-5s-lawsuit-against-trump/","image":"https://internewscast.com/wp-content/uploads/2025/08/Judge-slams-brakes-on-Central-Park-5s-lawsuit-against-Trump.jpg","video":null,"publish_date":"2025-08-15 15:44:19","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.092},{"id":351385768,"title":"Donald Trump's Popularity With Hispanics Plummets: Survey","text":"Donald Trump is facing a sharp decline in support among Hispanic voters, according to new polling.The latest Cygnal survey, conducted August 7–9 among 1,500 likely general election voters, shows Trump's favorability with Hispanics has dropped significantly over the summer. In April, 44 percent viewed him favorably and 51 percent unfavorably. By August, those numbers had shifted to 33 percent favorable and 65 percent unfavorable.Why It MattersSince at least the 1960s, Hispanic voters in the U.S. have generally supported Democratic candidates. For example, according to Pew Research Center, about 71 percent of Hispanic voters supported Barack Obama in 2012, and 66 percent backed Hillary Clinton in 2016. In 2020, 63 percent chose Joe Biden, according to AP VoteCast.In 2024, however, Trump made significant gains. His support among Hispanic voters rose to 43 percent—an 8-point increase from 2020 and the highest level for a Republican presidential candidate since such data has been tracked. Meanwhile, 55 percent supported Kamala Harris, narrowing the Democratic advantage.Yet recent polling suggests Trump's momentum is fading.What To KnowTrump's standing with Hispanic voters has weakened over the summer, as new polling suggests economic pessimism is chipping away at one of his most promising demographic gains of 2024.In April, a Cygnal poll found Hispanics were among Trump's most optimistic supporters. Forty-four percent of Hispanics viewed him favorably — compared with just 21 percent of Black voters — and a majority of Hispanic men (54 percent) approved of his job performance.They were also the most positive group on the direction of the country, registering a 17-point net swing toward optimism since March. At the same time, congressional Republicans were improving their image with Hispanics, even as they lost ground among young and college-educated women.But that optimism has faded. In Cygnal's August poll, Trump's net image slipped slightly, with the decline driven in part by what the pollster described as \"softness\" among Hispanic voters. Twenty-six percent of Hispanics rated the U.S. economy as \"terrible\" — more than double the share of White voters (11 percent) and just behind Black voters (27 percent).And Hispanics were no longer the most optimistic about the country's direction, replaced by older men.The shift comes against a backdrop of mounting economic pressures.Inflation also rose to 2.7 percent in June. That is despite Trump's previous promise to end inflation on day one of his second term. \"Starting on day one, we will end inflation and make America affordable again, to bring down the prices of all goods,\" he said during a rally in Bozeman, Montana, in August 2024.And job growth slowed sharply in July, with just 73,000 new jobs added—down from 147,000 the previous month, according to the U.S. Bureau of Labor Statistics.And Hispanics could be hit especially hard by those pressures.Despite contributing more than 30 percent of U.S. GDP growth since 2019 and commanding an estimated $2.4 trillion in buying power, Hispanic households earn far less than the national average — about $65,500 in median income compared with $93,900 for White households, according to the U.S. Census Bureau. They also face higher rates of income instability, with 17 percent reporting hardship from fluctuating earnings, Federal Reserve data shows.Meanwhile, Hispanics are overrepresented in blue-collar, service, and construction jobs that are sensitive to inflation, high interest rates, and policy shifts.In 2025, immigration enforcement fears and rising costs for essentials have been linked to a pullback in Hispanic consumer spending, according to reports from the Financial Times.Throughout his second term, Trump has aggressively expanded immigration enforcement—launching mass deportation operations, increasing raids in sanctuary citiesand reviving thousands of old deportation cases.His administration has also dramatically scaled up detention capacity, allocating $45 billion to expand ICE facilities and construct large-scale temporary camps, including a facility in Florida nicknamed \"Alligator Alcatraz.\"Pew Research polling from March showed that Hispanics are more worried than other U.S. adults about deportations, with 42 percent of Hispanic adults saying they worry that they or someone close to them could be deported.","summary":"Donald Trump's standing with Hispanic voters has weakened over the summer.","url":"https://www.newsweek.com/donald-trump-approval-rating-polls-hispanics-2114093","image":"https://d.newsweek.com/en/full/2703343/trump.jpg?w=1600&h=900&q=88&f=306841ff6ef472108c34ee4afc3d4410","video":null,"publish_date":"2025-08-15 15:41:19","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.4},{"id":351361498,"title":"'Not welcome here': Staten Island activist arrested after confronting NYC mayoral candidate","text":"Activist Scott Lo Baido was arrested outside New York City Democratic mayoral candidate Zohran Mamdani's anti-Trump event on Staten Island on Wednesday. A viral social media video revealed that Lo Baido told Mamdani, \"This is my f---ing island, you are not welcome here,\" as he was physically held back while approaching the candidate after the event at Istanbul Bay Authentic Mediterranean Restaurant on Staten Island. Lo Baido shouted profanities at Mamdani, telling the candidate that he hates Jews, cops and America. The protester, who shouted into a megaphone during the opening remarks of Mamdani's event, was later arrested by the New York Police Department (NYPD). In an exclusive interview with Fox News Digital on Friday morning, Lo Baido confirmed his arrest and said, \"I suggest that somebody in every single borough every time this man shows his face to do what I did the other day.\" ‘GET OUT OF TOWN!’: STATEN ISLAND CROWD CONFRONTS ZOHRAN MAMDANI AT ANTI-TRUMP RALLY Lo Baido told his followers on X that he received three summonses upon arrest for sound without permit, disorderly conduct and foul language. \"Go back to where you came from. We don't want you on Staten Island,\" a protester wearing a \"Trump girl\" T-shirt and holding an American flag shouted at the 33-year-old self-described socialist as he exited the backdoor of the restaurant. MAMDANI TAKES AIM AT TRUMP'S IMMIGRATION POLICIES IN FIERY STATEN ISLAND SPEECH: 'WE ARE FIGHTING TO KEEP NYC A SANCTUARY CITY' Inside the event, as Mamdani kicked off his third anti-Trump event of the week, protesters outside the restaurant drowned out the introductory speeches with their cowbells, sirens and megaphones. Despite the heat in the crowded restaurant and his detractors outside, Mamdani maintained a smile throughout the event and told reporters, \"It saddens me to hear language of being told to go back to where I came from, and yet, it is not surprising because it is so much of what characterizes President Trump's politics.\" Mamdani was hosting his third \"Five Boroughs Against Trump\" event of the week on Wednesday, reaffirming his commitment to protecting New Yorkers from Trump's crackdown on illegal immigration if he's elected mayor of New York City this November. \"I will not let it dissuade me from continuing to come to Staten Island, from continuing to speak to New Yorkers, no matter where they live, no matter what politics they have,\" Mamdani said in response to the protesters. \"Because I know that just as there are Republicans who feel that way, there are others who are sincere in their questions.\" Several protesters outside the restaurant told Fox News Digital that they planned to vote for Curtis Sliwa, CEO of the Guardian Angels, this November. \"He's the only one that could save our city,\" Ed, a Staten Islander carrying a large American flag, said. Ed told Fox News Digital that he wanted to give Mamdani \"a little surprise party\" and let the socialist candidate know that his values do not represent those of Staten Island. \"This is Trump country,\" said Manny, another protester and Wall Street retiree who said Mamdani's policies are \"anti-Wall Street.\" Trump won Staten Island by 30 points in the 2024 presidential election, according to The New York Times' data. Meanwhile, in neighboring Brooklyn, former Vice President Kamala Harris carried the borough by 44 points. Tommy Banks, a native Staten Islander, said his message to Mamdani on Wednesday was simple. \"Get out of town.\" \"He wants to make everything free. He can't afford that. He's a socialist. He don't live that. We're not socialist,\" Banks said. Banks agreed with the other protesters outside the restaurant, telling Fox News Digital that \"nobody else\" could be mayor but Sliwa. \"He's a true New Yorker. He's been fighting for New York all his life. Give him a chance to get in there,\" Banks said. Another protester, Liz, shouted, \"Mamdani's a commie!\" as the Democratic nominee departed in his SUV. Liz said she doesn't like Mamdani because \"he's not a Democrat, he's a communist.\" She said Mamdani is trying to tempt New Yorkers with campaign promises like free childcare, free bus fare and government-run grocery stores, but Liz said it would be a \"disaster\" if he became mayor. When Mamdani declared victory in the Democratic primary, incumbent Mayor Eric Adams, who is running as an independent, called Mamdani a \"snake-oil salesman\" who would \"say and do anything to get elected.\" Trump has often criticized Mamdani and his policies, calling him a \"100% communist lunatic.\" Staten Islanders who spoke to Fox News Digital outside Mamdani's anti-Trump event on Wednesday seemed to agree with those sentiments, calling him a \"commie\" and criticizing his policies, which include freezing the rent, raising corporate taxes and increasing the minimum wage. However, Shahana Masum, who sported a \"Zohran for Staten Island\" sticker on her purse and attended the event, told Fox News Digital that Mamdani is the person who is representing \"me and my community.\" CLICK HERE TO GET THE FOX NEWS APP Masum said she has also been told to go back to her country. To that, she said, \"You didn't go back to your country, and I came here with dignity and with my visa, so don't tell me to leave.\" Fox News’ Bryan Llenas and Marly Carroll contributed to this report.","summary":"Protesters disrupted Zohran Mamdani&apos;s Staten Island campaign event with megaphones and profanities, leading to activist Scott Lo Baido&apos;s arrest by the NYPD.","url":"https://www.foxnews.com/politics/not-welcome-here-staten-island-activist-arrested-after-confronting-nyc-mayoral-candidate","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/zohran-mamdani-nyc-july-30-2025.png","video":"https://www.foxnews.com/video/6376953030112","publish_date":"2025-08-15 14:21:38","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.132},{"id":351363398,"title":"Mutiny at JD Vance's dinner date: Woke staff at Cotswolds gastro-pub threatened to walk out if US vice president attended - prompting a hasty venue switch","text":"US vice president JD Vance is understood to have been forced to cancel a dinner reservation at a trendy Cotswolds gastro-pub after woke staff threatened to walk out if he showed up.\n\nVance's family holiday with his wife, Usha Chilukuri, 39, and their three children, has sparked controversy this week with locals claiming their lives were 'made hell' by multiple car police convoys and buzzing helicopters.\n\nEven Jeremy Clarkson complained about the US politician's weeklong stay in the village of Dean near Charlbury in Oxford, saying the over-the-top security had affected filming for his show.\n\nNow it has emerged that the fashionable Bull pub – which last month did entertain former US presidential Democrat candidate Kamala Harris – had to cancel a reservation Vance made because staff refused to serve him.\n\nThe suggestion that woke staff had refused to wait on the right-wing Republican swept local communities earlier this week - before last night being run by gossip site Popbitch last night and today being picked up by publications around the world, including Yahoo News and The Daily Beast.\n\nThe pub has doggedly declined to comment in response to media queries to confirm or deny that they had cancelled the VP's planned dinner.\n\nRichard Fairhurst, who runs the local Charlbury community blog, told The Daily Mail today: 'It's very widely believed locally [that staff refused to serve Vance] but The Bull are keeping schtum.'\n\nAnother local, Clare Shakya, told us today: 'I am told by a reliable source that Bull staff did indeed object to JD Vance's visit. And their regulars have been backing them for it.'\n\nThe showbiz blog Popbitch stated: 'The mutinous staff all said they wouldn't come to work if they had to serve Vance and his wife. Facing staff grumbles and a barrage of negative press attention The Bull refused his patronage.'\n\nThe pub does offer private dining for up to 28 guests in the 'secret garden room', and Vance is thought to have earmarked this so he could get away from protestors angry at his stay in the Cotswolds.\n\nThere are links between the country manor where Mr Vance has been staying all week and the Bull pub.\n\nThe Bull is owned by the Bull Charlbury limited, a company who has three directors, one of whom is James Selwyn Gummer.\n\nHis father, Tory peer Peter Selwyn Gummer, aka Lord Chadlington, of Dean, until recently owned Dean Manor - the very country house where Mr Vance has been staying all week.\n\nLord Chadlington recently sold Dean Manor to Pippa and Johnny Hornby, also friends of David and Samantha Cameron, who rented the manor to Mr Vance.\n\nFollowing news of Vance's rejection from The Bull, the pub's Facebook page was flooded with comments by people both welcoming and condemning the decision.\n\nOne said:' Thank you for standing up against fascism, corruption and evil.'\n\nAnother added:' Your staff have excellent values and stood up to a bully an abominable excuse for a human being! We will visit and eat with you asap. Best wishes and treasure your staff.'\n\nHowever, one American replied: 'Glad we broke away from you [sic] worthless country. You are only relevant now because of the United States – you'd all be speaking German if it weren't for us.\n\n'Our country became everything you Brits wanted to be; it took us far less time to do it.'\n\nMeanwhile, it emerged today that the suggestion of The Bull as a dinner venue may have originally been made to Vance by former Chancellor George Osborne\n\nThe Financial Times reported that Osborne had organised much of the VP's Cotswolds itinerary after his old boss, David Cameron, who lives nearby, was contacted for advice on where to go - and he delegated the job.\n\n'George did it all,' one source informed the FT. Another source added: 'David came up with a few ideas, but George did the rest.'\n\nMr Vance and Mr Osborne are friends, with the latter revealing the cross-Atlantic bond on his Political Currency podcast last year.\n\n'He's actually a friend of mine,' said Mr Osborne. 'He was an admirer of the Cameron government and what it had done.'\n\nWhen Vance arrived at his rented farmhouse in the hamlet of Dean, he was greeted with signs telling him to 'go home' and 'you are not welcome', and after staying for a week, he has now left for Scotland, but locals say he is expected back.\n\nThe Bull was named pub of the year by the National Pub and Bar Awards.\n\nThe pub, which dates back to the 16th Century, gets top reviews on and in The Good Food Guide and the staff are described as 'clued up, as well as boundlessly helpful'...unless, it seems, you happen to be the US Vice President.\n\nRenowned for its locally sourced meats and trademark £26 Bull Pie, the pub also offers lip-smacking £98 sirloin steaks, while bar snacks include £120 sweetcorn fritters and £6 pork pies.\n\nA bottle of Blanc de Noirs French champagne costs £100, while a more patriotic Sussex Nutty Vintage Brut is £70, and as you are asking, the most expensive drink on offer is a 1997 Vintage port at £20 a glass or £195 for the bottle.\n\nThe Michelin Guide gives The Bull a 'bib gourmand', saying the venue is of 'good quality with good value food' adding that 'dining here is a hearty, satisfying experience'.\n\nThe Bull would only say:' We have nothing to say.","summary":"Vance's family holiday with his wife, Usha Chilukuri, 39. and their three children, has sparked controversy this week with locals claiming their lives were 'made hell' by police convoys and helicopters.","url":"https://www.dailymail.co.uk/news/article-15003643/Mutiny-JD-Vances-dinner-date-Woke-staff-Cotswolds-gastro-pub-threatened-walk-US-vice-president-attended-prompting-hasty-venue-switch.html","image":"https://i.dailymail.co.uk/1s/2025/08/15/14/101252621-0-image-m-42_1755265656973.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/12/3887726573145811/1024x576_MP4_3887726573145811.mp4","publish_date":"2025-08-15 14:20:47","author":"Editor,Nick Pisa,Richard Simpson","authors":["Editor","Nick Pisa","Richard Simpson"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.106},{"id":351366014,"title":"VICTOR DAVIS HANSON: Who Has Been Busy Destroying Democracy?","text":"“Destroying democracy” — the latest theme of the left — can be defined in many different ways.\n\nHow about attempting to destroy constitutional, ancient, and hallowed institutions simply to suit short-term political gains?\n\nSo, who in 2020, and now once again, has boasted about packing the 156-year-old, nine-justice Supreme Court?\n\nWho talks frequently about destroying the 187-year-old Senate filibuster — though only when they hold a Senate majority?\n\nWho wants to bring in an insolvent left-wing Puerto Rico and redefine the 235-year-old District of Columbia — by altering the Constitution — as two new states solely to obtain four additional liberal senators?\n\nWho is trying to destroy the constitutionally mandated 235-year Electoral College by circumventing it with the surrogate “The National Popular Vote Interstate Compact?”\n\nDoes destroying democracy also entail weaponizing federal bureaucracies, turning them into rogue partisan arms of a president?\n\nSo who ordered the CIA to concoct bogus charges of “collusion” to sabotage Donald Trump’s 2016 campaign, the 2016-2017 transition, and the first 22 months of Trump’s first term?\n\nWho prompted a cabal of “51 former intelligence officials” to lie to the American people on the eve of the last debate of the 2020 election that the FBI-authenticated Hunter Biden laptop was instead the work of a “Russian intelligence operation?”\n\nWho ordered the FBI to connive and partner with social media conglomerates to censor accurate news deemed unhelpful to the 2020 Biden campaign?\n\nWho pulled off the greatest presidential coup in history by using surrogates in the shadows to run the cognitively debilitated Biden presidency, then by fiat canceled his reelection effort, and finally anointed as his replacement the new nominee Kamala Harris, who had never won a single primary delegate?\n\nWho ordered FBI SWAT teams to invade the home of a former president because of a classification dispute over 102 files out of some 13,000 stored there?\n\nWho tried to remove an ex-president and leader of his party from at least 25 state ballots to deprive millions of Americans of the opportunity to vote for or against him?\n\nWho coordinated four local, state, and federal prosecutors to destroy a former and future president by charging him with fantasy crimes that were never before, and will never again be, lodged against anyone else?\n\nWho appointed a federal prosecutor to go after the ex-president, who arranged for a high-ranking Justice Department official to step down to join a New York prosecutor’s efforts to destroy an ex-president, and who met in the White House with a Georgia county prosecutor seeking to destroy an ex-president — all on the same day — a mere 72 hours after Trump announced his 2024 reelection bid?\n\nWho but the current Democrats ever impeached a president twice?\n\nHas any party ever tried an ex-president in the Senate when he was out of office and a mere private citizen?\n\nWhen have there ever been two near-miss assassination attempts on a major party presidential candidate during a single presidential campaign?\n\nWho destroyed the southern border and broke federal law to allow in, without criminal or health background audits, some 10-12 million illegal aliens?\n\nWho created 600 “sanctuary jurisdictions” for the sole purpose of nullifying federal immigration law, in the eerie spirit of the renegade old Confederacy?\n\nWho allowed tens of thousands of rioters, arsonists, and violent protestors over four months in 2020 to destroy over $2 billion in property, kill some 35 people, injure 1,500 police officers, and torch a federal courthouse, a police precinct, and a historic church — all with de facto legal impunity? (RELATED: Police Say Arsonist Attacked Governor’s Residence, Set Mansion On Fire While Family Slept Inside)\n\nHow do the purported destroyers of democracy find themselves winning 60-70 percent approval on most of the key issues of our times, while the supposed saviors of democracy are on the losing side of popular opinion?\n\nHow does a president “destroy democracy” by his party winning the White House by both the popular and Electoral College vote, winning majorities in both the Senate and House by popular votes, and enjoying a 6-3 edge in the Supreme Court through judges appointed by popularly elected presidents?\n\nSo what is behind these absurd charges?\n\nThree catalysts: one, the new anguished elitist Democratic Party alienated the middle classes through its Jacobin agenda and therefore lost the Congress, the presidency, and the Supreme Court, and now has no federal political power.\n\nTwo, the Democratic Party is polling at record lows and yet remains hellbent on alienating the traditional sources of its power — minorities, youth, and Independents.\n\nThree, Democrats cannot find any issues that the people support, nor any leaders to convince the people to embrace them.\n\nSo it is no surprise that the panicked Democrats bark at the shadows — given that they know their revolutionary, neo-socialist agenda is destroying them. And yet, like all addicts, they choose destruction over abandoning their self-destructive fixations.\n\nVictor Davis Hanson is a distinguished fellow of the Center for American Greatness. He is a classicist and historian at the Hoover Institution, Stanford University, and the author of “The Second World Wars: How the First Global Conflict Was Fought and Won,” from Basic Books. You can reach him by e-mailing authorvdh@gmail.com.","summary":"'Destroying democracy' — the latest theme of the left — can be defined in many different ways","url":"https://dailycaller.com/2025/08/15/victor-davis-hanson-democrats-destroy-democracy-trump-election-hunter-laptop-russiagate-filibuster-popular-vote/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/GettyImages-1475052654-scaled-e1755266473406.jpg","video":null,"publish_date":"2025-08-15 14:06:04","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.107},{"id":351358246,"title":"With ‘CBS Mornings’ ratings continuing to shrink, could Gayle King be in trouble?","text":"Since finally closing on the politically tainted and bruising $8 billion merger last week, new Paramount CEO David Ellison has been making big moves left and right.\n\nWith the ratings of CBS Mornings sliding over the past few months and the network’s daily morning show mired in third place, could the network’s new ownership be looking at making another sweeping change? And would that possibly entail getting rid of Gayle King, the program’s most recognizable face?\n\nWell, with Ellison and his senior leadership looking to slice off $2 billion in costs from the new company, and the 70-year-old King making at least $10 million annually on a contract that ends in May, it seems more and more like a possibility, if not a probability.\n\n“There’s always speculation about her inflated salary and entourage,” a network insider said of King. “She’s undoubtedly expensive and not necessarily on the right side of the new political agenda.”\n\nThe Independent has reached out to representatives for Paramount, Gayle King and CBS News for comment.\n\nBased on data from Nielsen Research, the CBS morning show is averaging 1.813 million daily total viewers year to date, through August 12. This marks a 10 percent drop compared to the same period in 2024, and places them well behind NBC’s TODAY (2.405 million) and ABC’s Good Morning America (2.498 million).\n\nThe year-over-year plummet is even worse for the show in the key advertising demographic of viewers aged 25 to 54, where CBS Mornings viewership has sunk to 315,000 daily viewers for the year. This is down 19 percent compared to last year and far behind GMA (426,000) and TODAY (543,000). \n\nThe drop also accounts for the one-day bump that the show received from King’s much-hyped trip – alongside Katy Perry and Lauren Sanchez – aboard Jeff Bezos’ Blue Origin spacecraft for a brief trip above Earth’s atmosphere. That April broadcast brought in 3.9 million viewers, rocketing past ABC and NBC while marking the show’s best performance in four years. \n\nThe viewership for the CBS show, which also features co-hosts Nate Burleson and Tony Dokoupil alongside King, has sunk to such a level that it is nearly getting passed by a cable news morning program. With Fox News seeing a ratings surge this year following Donald Trump’s return to the White House, Fox & Friends is up 24 percent in total viewership (1.602 million) and 17 percent in the key demographic (17 percent) year to date. \n\n“There is serious concern about the ratings slide at [CBS] Mornings,” one network source told The Independent. “In particular, they’ve seen major drops in women.”\n\nBased on an AI-generated study reviewed by The Independent, the network shared with staffers last month that CBS Mornings was perceived as having more “distressing” and “controversial” content than its broadcast rivals, while also having the least “happy” and “celebratory” programming.\n\n“There has been a marked shift in the last few weeks to fluffier stories,” the network source added, noting that Thursday morning included a lengthy segment about Taylor Swift’s new album announcement on boyfriend Travis Kelce’s podcast.\n\nAnother staffer said that the network “wants to do more light stuff” and “less dark/hard news” during the morning. Notably, last fall, CBS Mornings came under fire – and Dokoupil was reprimanded by then-news chief Wendy McMahon – following an interview in which the anchor compared celebrated author Ta-Nehisi Coates to an “extremist” over his position on Gaza. Meanwhile, former Paramount chair Shari Redstone – a well-known supporter of pro-Israeli causes – backed Dokoupil’s pointed questioning of Coates.\n\nWhile CBS has generally been an also-ran in the broadcast morning show wars, the Paramount-Skydance merger and much of the fallout surrounding it have sparked increasing public speculation that King could soon find herself on the chopping block and the program finding itself overhauled.\n\nDays before Skydance officially took over Paramount, the New York Post breathlessly reported that King’s future at the network was “murky” because the ratings for her “woke” morning show had tanked, all while the soon-to-be new owners vowed to the Trump administration to “scrap left-wing bias.”\n\n“The ‘CBS Mornings’ co-host, one of the fading Tiffany Network’s few remaining stars, is part of a culture that has ‘dug in’ against attempts by higher-ups to move away from polarizing coverage, according to sources with knowledge of the situation,” the Post noted, adding that the show’s executive producer Shawna Thomas “set a programming ‘agenda’ that has alienated traditional morning show viewers.”\n\nThat followed a previous New York Post story from May that noted that King’s 13-year career at the network “could finally be coming to an end” after she signed a one-year extension to her contract. \n\nOne network insider, however, told The Independent that the Post article seemed to “come out of nowhere since Gayle is the biggest star.” \n\nIt didn’t take long for the media-obsessed Trump to seize on the story, sharing it on his Truth Social site while taking a personal shot at King. “Gayle King’s career is over. She should have stayed with her belief in TRUMP. She never had the courage to do so. No talent, no ratings, no strength!!!” Trump blared.\n\nOf course, the Post story and Trump’s amplification of it don’t come in a bubble. Following Trump’s election, Paramount’s former chief shareholder Redstone – who desperately needed the merger to be approved so she could clear roughly $2 billion – pushed for the company to settle Trump’s “meritless” lawsuit over a 60 Minutes interview with Kamala Harris.\n\nThe negotiations to settle the suit, which led to accusations of “bribery” due to the pending merger needing the administration’s approval, resulted in several senior news leaders resigning in protest. Following the $16 million payoff to Trump, the old Paramount then announced that it was canceling Trump critic Stephen Colbert’s late-night show, prompting critics – some within the network itself – to allege the move was politically motivated.\n\nMeanwhile, in the days before the administration finally approved the merger, Skydance promised the Federal Communications Commission that it would install an ombudsman to review “complaints of bias” at CBS News and eliminate all diversity policies at the company. \n\nFurthermore, Trump has claimed that on top of the pre-merger settlement from Paramount, he’d reached a secret side deal with Ellison – whose father is Oracle founder and close Trump ally Larry Ellison – for $20 million of pro-Trump PSAs to be aired on CBS once the Skydance deal was finalized. (Ellison has repeatedly sidestepped questions about Trump’s claim.)\n\nSince last week’s merger completion, though, Ellison and his senior executives have gone out of their way to say they don’t want to “politicize anything” surrounding the company or place their thumbs on the scales of CBS News. “He said all the right things and more,” one CBS News staffer told The Independent after Ellison visited the newsroom right after the merger closed.\n\nInstead, it would seem their north star is the same as most major media companies these days – maximize profits while reducing costs. This has seen Ellison make wildly ambitious moves early on, even as Paramount’s new executive leadership has warned there will be “painful” layoffs coming down the pike soon.\n\nDays after Skydance closed on the deal, Paramount announced that it had secured the rights to air UFC events with a massive seven-year, $7.7 billion agreement. This came on the heels of Paramount agreeing to pay the creators of South Park $1.5 billion to continue airing the raunchy hit show’s content for five more years.\n\nWith Ellison also hyping that the studio will be committed to big-budget movies in the near future, such as another Star Trek film and Top Gun 3, it seems increasingly likely that Paramount’s new tech-friendly leadership is going to look towards its linear networks to bear the brunt of the cuts. Especially since Paramount President Jeff Shell recently explained that, unlike other media conglomerates, they won’t be spinning off their cable assets.\n\n“We have less of our economics of the company on cable because they decline so much,” Shell said this week at a media event, suggesting that Paramount will be utilizing brands such as BET, MTV and Comedy Central to be “building blocks” of the company’s streaming strategy.\n\nThat all harks back to CBS Mornings and how the recent ratings drop could potentially lead to significant changes that could include saying goodbye to King.\n\n“We do not want to be a company that has layoffs every quarter,” Shell said this week. “So, it’s going to be painful. It’s always hard, but we don’t want to be a company that every quarter is laying people off… So, it is important for us to get done what we’re doing in one big thing and then be done with it.”\n\nNetwork sources also noted that most people on the program, as well as CBS Evening News, are now waiting for Tom Cibrowski – the ABC News veteran who was brought in as president and executive editor of CBS News this past spring – to make changes to both shows now that the Paramount merger has been finalized.\n\nWhile the morning show has always been profitable for the network, those ad revenues have been decreasing this year due to the falling ratings – though sources tell The Independent that CBS Mornings is still turning a profit. Still, King’s reported $10+ million annual salary would be an easy ledger item to cross off if the network decided not to renew her.\n\nIn fact, amid the shrinking advertising dollars for broadcast and cable television as streaming has boomed, networks have increasingly parted ways with high-profile veteran broadcasters rather than continue to pay their exorbitant salaries. TODAY’s Hoda Kotb, who was making $20 million a year, decided to step down last year after NBC asked her to take a pay cut.\n\n“NBC executives loved Hoda and knew her value to the brand, but also made clear to her agents that such stratospheric contracts were no longer justifiable given the industry’s inexorable decline,” due in part to the steep ratings decline affecting ‘Today’ and competitors like ‘Good Morning America,’” Puck reported at the time.\n\nOn top of that, Paramount is also crossing off not just Colbert’s $15 million salary after The Late Show signs off for good in May, but also the program’s roughly 200 employees and high production costs. Though the program remained the top-rated broadcast late-night show, the overall drop in broadcast viewers and dwindling ad revenues for late-night television resulted in the show losing $40 million a year.\n\n“Late-night has a huge problem right now,” Shell said this week. “The problem is that 80 percent of the viewership and growing is on YouTube.”\n\nIn the end, though, sources at the network stressed that while King may also be viewed by many within the organization as being increasingly “out of touch with the average viewer” due to her close friendship with Oprah Winfrey and luxurious lifestyle, there still isn’t any definitive answer on her fate at this time.\n\n“It’s just speculation at this point,” a CBS staffer noted.","summary":"Exclusive: ‘There’s always speculation about her inflated salary and entourage,’ one network insider told Justin Baragona about Gayle King. ‘She’s undoubtedly expensive and not necessarily on the right side of the new political agenda.’","url":"https://www.independent.co.uk/news/world/americas/with-cbs-mornings-ratings-continuing-to-shrink-could-gayle-king-be-in-trouble-b2808399.html","image":"https://static.independent.co.uk/2025/02/02/23/67th_Annual_Grammy_Awards_-_Arrivals_70386.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/xVhuH5yU-4VHSaSK0.mp4","publish_date":"2025-08-15 14:02:06","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.201},{"id":351476700,"title":"Body for body, gun for gun: How the US Secret Service planned for the Trump-Putin summit in Alaska","text":"The call to Beau Disbrow was unlike any the Anchorage realtor had ever received. His short-term rentals typically house tourists bound for glaciers, or business travellers passing through. This time, the request came from the US Secret Service.“Most of my short-term rentals were booked, but I did manage to put some of them into one home,” he said.It was not the last inquiry connected to the highly anticipated summit between President Donald Trump and Russian President Vladimir Putin set for Friday. Soon after the Secret Service call, the Russian consulate in New York phoned Disbrow with the same request. With no vacancies left, he referred the officials to a friend with furnished homes sitting empty.When Trump announced the Alaska meeting a week ago, the lone agent assigned to the Secret Service’s post in the Last Frontier began preparing to host hundreds of reinforcements in the days ahead. The agency’s mission was unusually complex: to protect both the American and Russian presidents at the same site, each surrounded by a heavily armed security detail..HurdlesFour people familiar with the planning said the operation became an all-out sprint, compressed into a single week. Because the meeting is on American soil, the Secret Service can move weapons, communications equipment and medical gear without foreign restrictions. But the geography presents its own hurdles..Trump and Putin will meet at Alaska military base long used to counter Russia.Anchorage has limited hotel rooms and a small rental-car market, so vehicles and other assets are being flown in or driven from other parts of the state. Motorcade SUVs are arriving from the lower 48 on cargo planes.The summit will take place at Joint Base Elmendorf-Richardson, Alaska’s largest military installation. A Cold War listening post less than 1,600km from Russia, the base offers controlled airspace, fortified gates and instant access to military units - and, as an active base, is closed to the public.“We’re in the height of tourist season, so hotels are tight, cars are tight,” Alaska Governor Mike Dunleavy said on Bloomberg Television on Thursday. “Having this on the base alleviates a lot of issues.” While Anchorage has played host to the Pope and to former President Ronald Reagan in years past, the summit is “one of the biggest things to happen” in the city, said Dunleavy, a Republican..State Department protocolState Department protocol is shaping much of the plan. In a bilateral meeting, officials said, reciprocity rules mean every courtesy extended to one leader must be matched for the other. Russian security will control Putin’s immediate movements while the Secret Service maintains an outer ring. .Trump-Putin meeting: Did Alaska belong to Russia?.Neither side will open the other’s doors or ride in the other’s vehicles. If 10 US agents are posted outside a meeting room, 10 Russian agents will stand on the other side. Everything is matched body for body, gun for gun, one person said.That symmetry will extend from the arrival motorcade to the placement of translators in the room. Both sides will bring their own language teams. Even the number and size of hold rooms - secure waiting areas for each leader - are being negotiated. The Secret Service is still waiting for Russia to formally approve the full security plan, the people said.“The safety of the President is our highest priority,” the Secret Service said in a statement. “In order to maintain operational security, the Secret Service does not discuss the specific means and methods used to conduct our protective operations.” The Alaska deployment lands with the agency also protecting Vice-President JD Vance in the United Kingdom, preparing for the United Nations General Assembly in New York next month and providing protection for former presidents Barack Obama, Joe Biden and George W. Bush and for former Vice-President Kamala Harris. Twenty agents and officers have also been assigned this week to support Trump’s federal takeover of the DC police department..Agents in AnchorageNow, hundreds of agents have descended on Anchorage. Downtown hotels are full. Rental car lots have been cleared for convoys. Agents in suits and earpieces are posted at intersections while others, in plain clothes, blend into coffee shops and parking garages. Alaska state troopers and local police are folded into motorcade routes that have been mapped down to the turn lane. Every movement of both leaders’ vehicles is being choreographed to keep them apart while ensuring each is fully protected.Trump has described the “feel-out” meeting as an effort toward ending Russia’s war in Ukraine, suggesting a territorial swap could be part of a deal. Putin has sought to strengthen his rapport with Trump ahead of their summit, praising the US leader’s efforts to broker an end to the war in Ukraine and dangling the promise of economic cooperation as well as a new arms control treaty.","summary":"","url":"https://gulfnews.com/world/americas/body-for-body-gun-for-gun-how-the-us-secret-service-planned-for-the-trump-putin-summit-in-alaska-1.500234616","image":"https://media.assettype.com/gulfnews/2025-08-14/3cias1ma/newsml_afp_com_20250814T175700Z_doc_69kh69f.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-08-15 14:00:48","author":"Bloomberg","authors":["Bloomberg"],"language":"en","category":"politics","source_country":"ae","sentiment":0.089},{"id":351358096,"title":"Joe Biden vs. Kamala Harris? Expert predicts explosive clash after her new book drops","text":"Global Desk\n\nA political storm may be building in the Democratic Party, with one presidential expert cautioning of an “explosive clash” between President Joe Biden and his former vice president, Kamala Harris. The prediction comes amid anticipation grows surrounding Harris’s forthcoming memoir, 107 Days, which is expected to chronicle her 2024 presidential run and her complicated relationship with Biden’s closest confidants.From Partnership to Potential RivalryFor years, Biden and Harris showed unity standing together through a challenging presidency highlighted by pandemic recovery, foreign crises, and deeply divided political climate at home. Yet political watchers suggest that bonds may now be fraying. According to insider reports, Harris’s book could include candid assessments of Biden’s leadership pattern, decision-making, and campaign direction, painting a less-than-flattering picture of the president.Presidential historian Leon Wagener issued caution: “If Harris names names and Biden’s team feels cornered, this could escalate quickly into all-out political warfare.” Such remarks hint that Biden’s allies are signalling to respond forcefully if the memoir ignites public criticism.The Stakes for Both SidesBiden’s allies are reportedly protective of his legacy, mainly following his withdrawal from the 2024 race after the wake of a lackluster debate performance. For them, any suggestion that the president faltered in his roles could tarnish his historical image.Harris, meanwhile, faces her own political crossroads. Though she retains influence within the party, her national approval ratings have been uneven, and questions about her readiness for higher office have persisted. A revealing memoir could help her reclaim control of her public narrative but it could also widen the existing rifts within the party.Live EventsAll Eyes on 107 DaysWith the release of Harris’s book launch nears, curiosity about its contents is intensifying. Will it be an honest, behind-the-scenes account focused on transparency? Or will it be a political manifesto, setting the stage for her next scenario in public life? The tone and substance of its pages determine whether the weeks ahead bring only a brief flare-up or ignite a drawn-out feud within the party.What is undeniable is that: the alliance between Biden and Harris once held up as a model of Democratic solidarity is on the brink of one of its most toughest trials yet.FAQs:Q1. Who is Kamala Harris?A1. Kamala Harris is the former vice president of the United States, serving under President Joe Biden from 2021 to 2025.Q2. What is 107 Days?A2. 107 Days is Kamala Harris’s upcoming memoir, expected to detail her 2024 presidential campaign and political experiences.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onJoe BidenKamala Harris107 Days2024 presidential campaignDemocratic PartyLeon Wagenerpolitical memoirpartnership to potential rivalryfor yearsDemocratic unity\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onJoe BidenKamala Harris107 Days2024 presidential campaignDemocratic PartyLeon Wagenerpolitical memoirpartnership to potential rivalryfor yearsDemocratic unity(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"A new wave of political drama may soon sweep the Democratic Party with indications pointing to a possible high-stakes confrontation between President Joe Biden and his former vice president, Kamala Harris. According to a presidential historian, who warns that tensions could erupt into an “explosive clash,” with the trigger being Harris’s forthcoming memoir, 107 Days. The book is anticipated to provide an inside look at her 2024 presidential campaign and shed light on her strained relationship with Biden’s inner circle.","url":"https://economictimes.indiatimes.com/news/international/us/joe-biden-vs-kamala-harris-expert-predicts-explosive-clash-after-her-new-book-drops/articleshow/123323227.cms","image":"https://img.etimg.com/thumb/msid-123323227,width-1200,height-630,imgsize-22446,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-15 13:53:12","author":"Sectionsjoe Biden Vs. Kamala Harris? Expert Predicts Explosive Clash After Her New Book Drops Global","authors":["Sectionsjoe Biden Vs. Kamala Harris? Expert Predicts Explosive Clash After Her New Book Drops Global"],"language":"en","source_country":"in","sentiment":0.412},{"id":351352410,"title":"Highest 2 Lowest Review: Spike Lee’s Attempt to Grapple With Rap’s New Gen","text":"Ah, man, Spike Lee is back on his hip-hop conservative shit. He’s been tinkering with this messaging on and off since damn near the start of the century, when his criticism of the genre shifted from the power-holding executives (both white and Black) of the music industry who were profiting off buffoonery, a la Bamboozled, to rap music itself. “I’ve always felt you can feel the progress of African Americans by listening to their music,” Spike said more than two decades ago during a speech at Brown University. “Some of this ‘gangsta rap’ stuff, it’s not doing anybody any good. This stuff is really dangerous.”\nBut I had thought he got it out of his system a decade ago with Chi-Raq, a reaction of sorts to the rise of Chicago drill that seems only to have a surface-level curiosity about the music. (Remember when King Louie responded with “Fuck Spike Lee”? I always like when a rapper disses a non-rapper, most preferably crooked mayors and underperforming NBA players.) Though, to Spike’s credit, the musical satire, based on the Lysistrata, is still incredibly entertaining because it’s so over-the-top in its preachiness. Unafraid of putting his imperfect and contradictory views on Chicago gang violence on screen, Spike’s absurd combination of a lean-sipping Nick Cannon doing drill karaoke, countless fourth-wall-breaking Samuel L. Jackson monologues, and a community sent into disarray by a sex strike, is undeniably full of passion and imagination, even if you’re unconvinced of his point. It’s the exact kind of stuff you can find only in a Spike Lee joint, and why his movies have been steamrolling backlash with style for 40 years.\nThat isn’t the case with Highest 2 Lowest, Spike Lee’s remake of Akira Kurosawa’s 1963 noiristic masterwork, High and Low. It takes place in a world shaped by modern hip-hop, but still looks down on the genre with the satirical wit and nuance of the comment section under a Sexyy Red snippet. The new movie’s premise is that Denzel Washington—reunited with Spike Lee for the first time since their banger 2006 heist film Inside Man—stars as David King, a Bronx-born music mogul who is the longtime boss of Stackin’ Hits records, a Def Jam–like label that isn’t as poppin’ as it used to be. His business partner, Patrick (Michael Potts), wants to sell, but David fears that, if he goes through with that, his life will lose meaning, so he comes up with a plan to buy out Patrick to veto the sale. It’s part thriller and part David going through an existential crisis about making art in a world that doesn’t prioritize art how it used to, finding purpose beyond money, and the generational divide.\nAt home (an extravagant Dumbo penthouse overlooking both the Brooklyn and Manhattan Bridges), David’s wife, Pam (Ilfenesh Hadera), points out that he doesn’t get the joy from music that he once did and his decision to stay in a failing business is strictly to stroke his massive ego. Of course, David ignores Pam’s concerns and prepares to get the money anyway, but, just as that’s happening his teenage son, Trey (Aubrey Joseph), who hilariously wears head-to-toe Amiri and has a Kamala Harris poster on his bedroom wall (the sort of kid who exists only in Spike Lee movies) is kidnapped from his basketball summer camp.\nThe kidnapper is played by A$AP Rocky, who has somehow turned Testing into a lifetime headliner slot at Rolling Loud and a legitimate acting career. He demands David pay him $17.5 million in Swiss Francs—an amount so steep that David will be unable to buy his partner out and stay in the music business—or else he’ll kill his son. This is when there’s a bit of a curveball: The kidnapper nabbed the wrong kid, someone named Kyle whose dad is David’s driver and friend. The crook still wants David to pay up, though, so he has to decide if he’s really willing to give up his dream for a boy who isn’t his own. None of this is as tense as it may sound.\nAnd Denzel is having a good-ass time. Always the coolest guy in the room—rocking a diamond earring and waves, with the walls of his home office lined with images of stars of like Nas, Hendrix, Ali, and Jordan—with jokes for everyone and a hubristic streak that makes me think of his dishonest police chief in Carl Franklin’s heater Out of Time. “You got the chicken?” screams Rocky over the phone. Denzel fires back “How you want it? Baked, fried, or jerk?” dialogue only he could pull off. And, when Spike hits the streets of New York, he still captures the life of the city just as well as anyone. There’s a sequence on a packed 4 train the day of a Yankees–Red Sox game with some 25th Hour energy and a ridiculous Sergio Leone–style stand-off on a subway platform. In one moment, there’s a close-up on a still image of Yankees stud Aaron Judge that is basically erotic.\nThose Spikeisms make Highest 2 Lowest watchable and occasionally fun, but, as the movie becomes more and more of a critique about hip-hop, it feels oddly toothless for Spike. We learn that Rocky’s kidnapper is a vulgar, attention-thirsty struggling Bronx drill–ish rapper named Yung Felon. He wanted all of his life to be discovered by David, a goal that has turned into an obsession. When Yung Felon’s identity is revealed, his music blows up with billions of streams, and new fans flock to support him despite his heinous crimes. He celebrates in a mildly surreal musical sequence that finds him rapping one of his hits in front of twerking BBL asses.\nSure, there’s some truth in Spike’s read of the current hip-hop landscape—the jail, or even death, to rap star pipeline is real; every week on Instagram there’s a new set of characters desperately chasing virality; and there are rappers being used to push right-wing propaganda—but his depiction of Yung Felon is lazy and not an absurd enough parody. If you’re going to skewer the genre, roast the fuck out of it! Call it a CIA psyop! Call it a community poison! Well, anything is better than Spike just parrotting the kind of “hip-hop today is all pussy-rap and gun-talk” messaging that every uncle rants about after seeing a couple of Say Cheese and Akademiks posts on his Instagram feed. What a bore!\nIn the 1980s and 1990s, when Spike’s complicated love of hip-hop pulsed through so many of his best movies, he used the genre as a way to humanize his characters, to reflect the angst of these young—often tragic—Black fuck-ups who had to fight police abuse, racism, and white fragility and exploitation just to survive. It was in the way Radio Raheem rolled around defiantly in Do the Right Thing with Public Enemy’s “Fight the Power” blasting out of his boombox. It was in the way Mekhi Phifer posted up in the middle of the project yard in the opening scene of Clockers, soundtracked by the Premo-produced “Return of the Crooklyn Dodgers.” It was even in his militant and swaggy depiction of Malcolm X. He sympathized with the suffering of the characters in these movies and maybe even felt like if things went a little bit differently for him, he could have been them.\nSpike has no sympathy for Yung Felon. He barely portrays him as a real human, just a scary microcosm of a generation that, with their brains fried by the attention economy of the internet and a hip-hop culture that has lost its way, is unrecognizable to him. Their plight is their own damn fault, he suggests. The one who gets to be redeemed is David, the aging executive, while Yung Felon is a lost cause. I get it: Spike Lee is 68 years old and has been rich for longer than I’ve been alive. He probably doesn’t have much in common with the majority of Black people under 35 years old and might not even interact with any who aren’t blood relatives or professional athletes. He is more David than Raheem. He is the old head. That doesn’t mean we should give him a pass for Highest 2 Lowest feeling as afraid and unforgiving of the complexities of Black youth culture as an op-ed in the New York Post.\n\nWhat I’m listening to","summary":"Alphonse Pierre’s Off the Dome column covers songs, mixtapes, albums, scenes, snippets, movies, Meek Mill tweets, fashion trends—and anything else that catches his attention. This week, Alphonse reviews Highest 2 Lowest, the new Spike Lee movie starring Denzel Washington and A$AP Rocky.","url":"https://pitchfork.com/thepitch/highest-2-lowest-review-spike-lee-new-movie/","image":"https://media.pitchfork.com/photos/689de40a7008a78c0eb175ce/16:9/w_427,h_240,c_limit/P4K25_OffTheDome_2x1.gif","video":null,"publish_date":"2025-08-15 13:00:00","author":"Alphonse Pierre","authors":["Alphonse Pierre"],"language":"en","source_country":"us","sentiment":0.144},{"id":351333424,"title":"Want To Stop Mamdani? It's Time To Get Serious | Opinion","text":"As of right now, Zohran Mamdani is the overwhelming favorite to be elected mayor of New York. Beyond his appeal to many New Yorkers on a variety of issues—most notably his extremely left-leaning policies intended to deal with the issue of affordability—in a race where three other candidates are poised to split the anti-Mamdani vote, his victory is all but assured.Many major interest groups in New York believe a Mamdani victory would be disastrous. It is almost impossible to find a business leader who thinks Mamdani would not be highly destructive to the interests of the city. Similarly, many Jewish leaders think that a city with the biggest Jewish population outside of Tel Aviv shouldn't have a mayor who still cannot disassociate himself completely from slogans supporting a \"global intifada,\" especially during a time of rising antisemitic incidents.Moreover, hardly anyone who has expertise in law enforcement and crime reduction believes Mamdani is the best candidate to protect public safety—and for a large proportion of New Yorkers, that issue is right up there with affordability as a top concern.Unfortunately, incumbent mayor Eric Adams and former governor Andrew Cuomo, Mamdani's two major opponents, are both very flawed candidates. Many New Yorkers believe that Eric Adams' federal indictment, which was subsequently dropped by the Trump Justice Department, is indicative of a corrupt administration. Indeed, given the circumstances under which it was dropped, many now view Adams as being in the pocket of President Donald Trump. Of course, New Yorkers being overwhelmingly Democratic, many believe Trump's policies are antithetical to the city's well-being, and the president himself is extremely unpopular in his native city.Andrew Cuomo, having been forced to resign as governor amid a sexual harassment scandal, not to mention what many consider to be his very abrasive style, ran a horrendous primary campaign. I wrote a column recently suggesting Cuomo did not learn any lessons whatsoever from the failed Kamala Harris presidential campaign, making him absolutely guilty of political malpractice.While the Republican in the race, Curtis Sliwa, has virtually no chance of winning the election, based on previous mayoral elections it is clear a Republican candidate will syphon away 200,000-300,000 votes, which could make all the difference for anybody with a chance of challenging Mamdani.Under these circumstances, one might ask, how can Mamdani possibly lose? The answer is, under these circumstances he can't. So, if one believes that Mamdani's election would be an enormous setback for the city of New York, and many right-thinking people strongly believe that, why aren't these circumstances being changed?Underpinning the intensity of feeling that Mamdani would be a disastrous choice for the city is the impact of his election on national politics. There is no doubt that Trump and the Republican Party would point to Mamdani's election to make the case that an avowed socialist, far to the left of most Americans' political outlook, is what the Democratic Party fundamentally represents. Democrats would have a very difficult time distancing themselves from Mamdani as representative of what their party stands for. The recent fawning endorsement by Senator Elizabeth Warren (D-Mass.) certainly makes it appear that the most progressive members of the Democratic Party believe they should stand behind Mamdani.It is also likely that Senate minority leader Chuck Schumer (D-N.Y.) and House minority leader Hakeem Jeffries (D-N.Y.) will in some form endorse Mamdani. In that case, it will be impossible for Democrats to meaningfully distance themselves from Mamdani's most radical positions and policies. That perception will be extremely politically detrimental to the Democratic Party nationally.So, bad for the nation's largest city, bad for the Democratic Party, and bad for the nation overall given the importance of the Democrats mustering the ability to take back the House next year to counter Trump. If New York's mayoral race does not fundamentally change by Labor Day—meaning the anti-Mamdani candidates consolidating behind a single horse—Mamdani will undoubtedly be the next mayor of New York. So how do these circumstances on the ground change? Answer: with great difficulty.Mayor Adams, as the incumbent, contends that it is hubris for Cuomo to suggest he drop out of the race. Cuomo argues, with substantial polling data to back him up, that he is the only candidate who can beat Mamdani in a one-on-one contest.The fact is that polling clearly suggests both Cuomo and Adams are weak candidates—over 60 percent of voters indicate they would never vote for either. However, the polls do suggest in a one-on-one race there is some chance Cuomo could beat Mamdani, and clearly also suggest Adams could not.Among \"likely\" voters, both Adams and Cuomo lose to Mamdani. However, when it comes to registered voters, which is a much larger group, polls have shown Cuomo to be within the margin of error. However, Cuomo would have to expand voter turnout well beyond typical mayoral elections to really have a shot. Cuomo would also have to demonstrate to the public how detrimental a Mamdani win would be to New York City and the Democratic Party, and deliver a higher level of intensity and passion in his messaging. Moreover, he would need city leaders of all sectors and ethnicities to join the battle cry to get a record voter turnout.So here is a modest proposal. It may sound radical, but a drastic situation calls for drastic measures. Mayor Adams should aim for a future that leverages his expertise and sets him up for a much better outcome than a career-ending loss in this race. He should announce that instead of pursuing public office again, he will set up a consulting firm to provide counseling to cities around the country on how to better provide for public safety. Crime rates in New York City have dropped dramatically in recent years so Adams has insights based on a credible track record to offer. Cuomo has a substantial monied interest behind him, including many donors who care about keeping New York safe. As a show of unity, they should commit resources—even as much as $10 million—to help Adams bring his experience to cities across the nation.I think Sliwa is an easier case to handle. Sliwa siphoning off votes in this race will only lead to the election of a mayor who will undermine all the public safety concerns he has fought for his entire life. That should not be his personal legacy. Cuomo should offer him a position as deputy mayor in his administration—a much better result and a goal to rally Republicans behind.Getting Adams and Sliwa out of the race will not be enough. Cuomo, in deep contrast to his primary performance, will have to campaign his heart out, drive a completely different social media presence, demonstrate incredible sensitivity on the affordability issue especially as it relates to housing, showcase the difference between his law enforcement views and Mamdani's, and continue to rally the Jewish community in opposition to Mamdani's anti-Israel, if not antisemitic, views.I recognize clearing the path for Cuomo to take on Mamdani on a one-on-one race is a tall order. However, the future of New York City and the Democratic Party's midterm election prospects rest on it. Let's get serious. Time is running out. To those Cuomo backers with the money to execute this plan: you need to get going.Tom Rogers is executive chairman of Claigrid, Inc. (the cloud AI grid company), an editor-at-large for Newsweek, the founder of CNBC and a CNBC contributor. He also established MSNBC, is the former CEO of TiVo, a member of Keep Our Republic (an organization dedicated to preserving the nation's democracy). He is also a member of the American Bar Association Task Force on Democracy.The views expressed in this article are the writer's own.","summary":"Incumbent mayor Eric Adams and former governor Andrew Cuomo, Zohran Mamdani's two major opponents, are both very flawed candidates.","url":"https://www.newsweek.com/want-stop-mamdani-its-time-get-serious-opinion-2112244","image":"https://d.newsweek.com/en/full/2703210/zohran-mamdani.jpg?w=1600&h=900&q=88&f=2a8a0cc22d8772ac267e0a2e0d71dd7d","video":null,"publish_date":"2025-08-15 12:21:03","author":"Tom Rogers","authors":["Tom Rogers"],"language":"en","source_country":"US","sentiment":-0.216},{"id":351339732,"title":"Firing BLS Director Over Weak Jobs Report Is 'Banana Republic' Behavior","text":"I grew up in the 1970s in and around one of the \"safest\" big cities in the United States, Philadelphia. That might be news to you given the City of Brotherly Love—now a relatively placid place—was known during that era for its gang-related murders and social dysfunction. It was news to residents, too, given that the streets felt so menacing. But why argue with statistics?\n\nA year after law-and-order populist Mayor Frank Rizzo won his election to clean up Philly, he bragged about the drop in crime. But as news reports made clear at the time, the administration likely gamed the statistics by reclassifying serious crimes as simple assault. \"The chances of being victimized on the street are much greater now than ever before,\" a top criminologist told The New York Times in 1973.\n\nI thought of that experience in the light of Donald Trump—and not just because his divisive style mirrors Rizzo. Last week, Trump fired Erika McEntarfer, the head of the Bureau of Labor Statistics (BLS). It's a statistical job, which oversees the compilation of economic data about jobs, labor costs, and productivity. The BLS reports to the labor secretary, but operates independently.\n\nTrump didn't like the latest jobs report, which showed meager jobs growth as the nation heads toward a tariff-imposed recession. \"I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,\" posted Trump on social media. He called her numbers \"RIGGED.\" Never mind that previous BLS jobs data—released before the November election—offered bad news for Kamala Harris.\n\nAs with any bureaucracy, the agency is fair game for criticism. BLS has plenty of flaws. But we know how Trump and MAGA play the game: Any results that are good for them are the truth—and anything not to their liking is evidence of rigging or conspiracy-. Their take on any news is the one that advances their interests.\n\nI've seen this before, especially when my daughter was playing youth soccer. Honest teams accepted referees' verdicts (even when we thought they got it wrong). Some other teams insisted every call should go their way—and bullied the referees who disagreed. Those teams usually were the ones that had no problem cheating. But it's hard to play the game without ground rules.\n\nLikewise, the feds need an independent body to analyze statistics. The New York Times quoted Federal Reserve Chairman Jerome Powell: \"Good data helps not just the Fed, it helps the government, but it also helps the private sector.\" Trump has indicated he'd like to replace Powell—presumably with someone who will juice interest rates to help his political goals. Any intelligent person, though, can see why good policy flows from an accurate understanding of reality.\n\nThese are banana republic moves, backed by MAGA and the Banana Republican Party. Had any Democratic president tried to so directly politicize these independent agencies, Republicans would be screaming about the coming tyranny. Democrats aren't immune to politicizing independent bodies—consider the troublesome plan to expand the U.S. Supreme Court—but they didn't dare meddle in statistical counting.\n\nConsider how budget matters are handled in Democratic-dominated California. The governor issues his budget and revenue/deficit predictions, which, of course, make the most optimistic projections. The nonpartisan Legislative Analyst's Office (LAO) does its analysis, which typically is less sanguine. The governor might take issue with those results—but he doesn't try to remove the head of the LAO and replace him with a political hack who issues only good news.\n\nIn national or state economies, reality always sets in anyway. That's why it's odd that despots always try so hard to control the economic data. The Times points to other countries that have done this, such as formerly populist Argentina. In that case, \"the international community eventually stopped relying on the government's data,\" which \"drove up the country's borrowing costs, worsening a debt crisis that ultimately led to it defaulting on its international obligations.\"\n\nIronically, Argentina is now run by a free-marketeer who is creating an economic miracle. Meanwhile, the United States—typically the world's beacon of economic freedom—is run by a Peronist who believes only his great, stable genius can dictate the ins and outs of a complex economy. Trump recently claimed he's cut drug prices by 1,500% and lowered gas prices to $1.99 a gallon. Who are you going to believe: the great leader and his sycophants or your own lying eyes?\n\nWe're all used to this administration \"defining deviancy down,\" as we all lower our standards for acceptable presidential behavior (free jet from Qatar, anyone?). So I guess this will be just another deviant action that the Republican Party will eagerly defend. Let's not even worry about it. This is the best economy we've ever seen in the history of the world, and job growth is the greatest. Soon enough, the official statistics will prove it.\n\nThis column was first published in The Orange County Register.","summary":"If a Democratic president tried to so directly politicize an independent agency, Republicans would be screaming about the coming tyranny.","url":"https://reason.com/2025/08/15/firing-bls-director-over-weak-jobs-report-is-banana-republic-behavior/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/08/8-14-25-v2-a.jpg","video":null,"publish_date":"2025-08-15 11:30:09","author":"Steven Greenhut","authors":["Steven Greenhut"],"language":"en","source_country":"us","sentiment":-0.139},{"id":351314152,"title":"Rubio’s latest job: Vance partner","text":"Vance is better positioned than ever to inherit Trump’s political base. He is involved in high-stakes diplomacy, and not just the symbolic variety George H.W. Bush referred to in his quip about representing Ronald Reagan at foreign dignitaries’ funerals — “You die, I fly.” Vance has access to Trump’s fundraising apparatus and has a big lead in the polls. \n\nHowever, the press hasn’t given up on covering a battle royale come 2028, and Trump has given them some encouragement.\n\nTrump has stopped short of endorsing Vance months into his second nonconsecutive term, years away from the start of the 2028 Republican presidential primaries. He has also kept stoking interest in Rubio, one of the 16 major Republican candidates he defeated to become the nominee for the first of three times back in 2016.\n\nThe Wall Street Journal recently noted Trump’s public and private references to Rubio, suggesting the president is keeping his options open. According to this report, Trump asked Rubio and Vance which of them would be on top of the Republican ticket next time around. But a “source close to the White House” told the Daily Mail, “the president loves to tease people.” The Daily Beast preferred to characterize it as Trump pitting the two men against each other in a “battle for the MAGA throne.” \n\nIt is also understandable that Trump might wait to hand out his endorsement, given how things ended with former Vice President Mike Pence in his first term. Rubio was on Trump’s VP short list last year, but Vance got the nod.\n\nNevertheless, Trump came closer than ever before to passing the baton to Vance earlier this month. “Well, I think most likely. In all fairness, he’s the vice president,” he said. Trump hesitated to go that far in the past, although he always complimented Vance’s performance in office and on the campaign trail.\n\n“So it’s too early, obviously, to talk about it. But certainly he’s doing a great job, and he would be probably favored at this point,” Trump added about Vance. \n\nTrump also mentioned Rubio, but seemed to be positioning him for a supporting role behind Vance. “I think Marco is also somebody that maybe would get together with JD in some form,” Trump said. “I also think we have incredible people, some of the people on the stage right here.”\n\nTrump has done more to groom Vance up to this point than Reagan did Bush 41, Bill Clinton did Al Gore, or Joe Biden did Kamala Harris.\n\nRubio recently downplayed his own presidential ambitions and made supportive comments about Vance. “I think JD Vance would be a great nominee if he decides he wants to do that,” Rubio said on a Fox News show hosted by Lara Trump, the president’s daughter-in-law. \n\nThe secretary of state said he “would be satisfied” with success in his current Trump administration roles “as the apex of my career.”\n\nWhen Katie Miller interviewed Vance for her inaugural podcast, she mentioned Trump’s comment about the vice president being his heir apparent. “I saw that,” Vance replied. “Yeah.” \n\n“[Trump] said Marco would be involved, some way, somehow,” Miller continued. “So we’ll go down some Marco questions.” \n\n“Oh God,” Vance replied.\n\nThe following exchange was mainly about Rubio’s fondness for ice cream, which was probably not a veiled attempt to link the secretary of state to Biden, and jokes. \n\nIn June, speaking at the New Right-oriented American Compass gala, Vance and Rubio praised each other effusively. Rubio said his admiration for Vance “has grown tremendously.”\n\n“I admired him in the Senate,” he continued. “I admire him a lot more now as vice president because I think vice presidents are just more impressive than senators.”\n\nVance returned the favor. ”So Marco, I was very fond of him as a Senate colleague, but you learn a lot about somebody when you see them actually operate behind the scenes,” he said. “And Marco is, if anything, more impressive privately than he is publicly, which is very hard to do, but he’s very thoughtful. He actually listens, which is a rare skill in politics.”\n\nThe vice president stressed the intellectual heritage he had in common with Rubio. “I think one of the first times I ever met, maybe the first time I ever met Marco, was in a conference room in a Senate office with [heterodox conservative policy wonks] Mike Needham and Oren Cass talking about some of the very things we’re talking about here tonight and some of the very things American Compass is focusing on,” Vance said. “So it’s amazing to see it come full circle to where we are today.”\n\nThis is all to be expected since Vance and Rubio are currently on the same team, led by Trump. If that were ever to change, Vance might be more inclined to discuss the Gang of Eight immigration bill or George W. Bush’s foreign policy rather than ice cream and clever conversation.\n\nBut the mutual admiration certainly seems genuine, and for now, Rubio looks comfortable wearing many hats, the latest being Vance’s ally.","summary":"There’s a running joke that every time a job in the Trump administration opens up, Secretary of State Marco Rubio will fill it. In addition to his State Department role, he has served as national security adviser, national archivist, and head of what used to be USAID. Now comes the question of Rubio’s next job. Is [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3500617/rubio-latest-job-vance-partner/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/vance_rubio_maga.webp.webp","video":null,"publish_date":"2025-08-15 11:00:00","author":"W. James Antle III","authors":["W. James Antle III"],"language":"en","source_country":"US","sentiment":0.296},{"id":351311868,"title":"Lefty leanings of Goldman economist Jan Hatzius in Trump crosshairs  ","text":"The voluble Goldman Sachs economist who drew President Trump’s fury this week has backed lefty government spending for years – and even once wrote a $2,300 check to fund Barack Obama’s first White House bid, On The Money has learned.\n\nJan Hatzius – a fixture on financial TV and the chief spokesman of the firm’s economic forecasting – was one of the few economists who called the housing bubble that led to the 2008 financial crisis. He has also pushed for progressive policies over the years, say right-of-center Wall Streeters who have studied his economic forecasts.\n\nNow Hatzius is targeting Trump’s tariff war with a research note this week predicting that US consumers will bear the brunt of it. That drew a sharp rebuke from The Donald, who first went after Goldman CEO David Solomon – tweaking him over his controversial DJing hobby.\n\n“I think that David should go out and get himself a new Economist or, maybe, he ought to just focus on being a DJ and not bother running a major Financial Institution,” Trump wrote on Truth Social. “They made a bad prediction a long time ago on both the Market repercussions and the Tariffs themselves, and they were wrong, just like they are wrong about so much else.”\n\nNoting that tariffs could get passed on to consumers isn’t exactly far-fetched economic thinking, of course. On Thursday, the producer price index spiked, though other gauges suggest inflation remains largely in check.\n\nStill, critics maintain that Hatzius has been touting left-of-center economic policies from his influential perch for years. One jaw-dropping example came during the 2024 election, when Hatzius said Kamala Harris’s economic policies – which included socialism in the form of price controls on groceries, tax hikes and open borders – was net-net better than Trump’s, which included deregulation and tax cuts in addition to tariffs.\n\n“He is way to the left in his understanding of the economy,” said one top economist who has followed Hatzius’ work and asked not to be named. “He’s much like a career Fed staffer and worse because he’s partisan.”\n\nHatzius joined Goldman in 1997. Over the years, he championed massive spending edicts during Democratic presidencies of Barack Obama and then Joe Biden, including their moves to ramp up regulations and seek tax increases that hurt job creation.\n\nAnd while some of Hatzius’ calls have been spot on, others have been way off the mark, his detractors say. The Fed missed the inflationary spike during the Biden years because it was too worried about growth and Hatzius wasn’t exactly a critic of the Biden spending blowout. \n\nIn fact, Hatzius has spoken lovingly about printing money, aka quantitative easing, another reason for higher inflation during Sleepy Joe’s reign. He thinks the Fed should be actively managing the economy rather than simply looking to stem the tide of inflation.\n\nOn top of it all, the only time Hatzius appears to have financially supported a presidential candidate over the past two decades was with his $2,300 donation to Obama in 2007, according to campaign finance records.\n\nHe also gave $1,000 to the Democratic Party in 2004, the records show.\n\nIn 2012, Fortune labeled Hatzius “Obama’s Best Friend at Goldman Sachs,” for his cheerleading of the Democrat’s policies. That was when Goldman also gained the nickname “Government Sachs” for the pipeline of talent moving from its boardroom to Cabinet positions in both Republican and Democratic administrations.\n\nA Goldman spokesman declined to comment when fully briefed on this report; through the spokesman Hatzius declined comment. \n\nOthers at the investment bank did push back on the notion that Hatzius is ideological in the way he does his job. They note his research often moves markets, how many of his calls have been prescient, including the prediction of the subprime crisis. They insist he’s bipartisan in analyzing policy, and recently briefed some GOP lawmakers on the economy.\n\n“How progressive can he be if Republicans would want to hear his thoughts?” one executive said.\n\n“Jan’s research is for clients — they make investment decisions based on his research. Year after year he and his team are recognized as the most accurate. This wouldn’t be true if his research was political.”","summary":"\"He's much like a career Fed staffer and worse because he's partisan,\" said one top economist.","url":"https://nypost.com/2025/08/15/business/lefty-leanings-of-goldman-economist-jan-hatzius-in-trump-crosshairs/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/Trump-Jan-Hatzius-ANIMATE-v3_4bf66b.gif?w=950","video":"https://cdn.jwplayer.com/videos/2Twaffy9-RyIcpnTz.mp4","publish_date":"2025-08-15 11:00:00","author":"Charles Gasparino","authors":["Charles Gasparino"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.294},{"id":351314150,"title":"Trump’s vaccine legacy is America’s strategic shield","text":"Those vaccines, most built on the mRNA platform, were available in the U.S. in record time. They ended lockdowns, reopened classrooms and churches, and restarted the economy. That is not spin; it is the lived experience of 2021, when the nation’s trajectory improved almost overnight. We all have the president to thank for that achievement. Patients and families with cancer, Alzheimer’s, cystic fibrosis, or other infectious diseases will also have the president to thank if current promising research using mRNA technology leads to new treatments and cures.\n\nIn the meantime, COVID-19 taught adversaries, such as the Chinese Communist Party, how to weaponize pandemics. The playbook is obvious: design a virus, secretly develop a vaccine, immunize your own forces, and unleash the pathogen abroad. Within weeks, an unprepared America could be militarily and economically incapacitated. The only defense is a rapid-response vaccine platform that can pivot instantly to meet the threat. That is what mRNA offers: mRNA vaccines take less time to manufacture than other platforms. That is why it is confounding that some in the administration now want to undermine the president’s historic success. Abandoning mRNA vaccines now would be like dismantling space-based infrared missile satellites before an air attack.\n\nBiological warfare is not theoretical. It is clear from history that disease influences war. In the Peloponnesian War, the Plague of Athens crippled the city and paved the way for Sparta’s victory. In 1918, influenza tore through armies across Europe, striking German forces especially hard and helping doom their spring offensive, contributing to the rapid collapse of their lines. During the Cold War, the Soviet Union sought to develop biological weapons from deadly diseases such as Ebola, the plague, and anthrax. Epidemics are not background events; they can dictate outcomes.\n\nIt can be deadly when politics and ideology influence public health. During the 2020 election, former Vice President Kamala Harris said she might not trust a vaccine developed under Trump. Once former President Joe Biden was elected and more Americans were dying, she encouraged immunization. We should not wait for people to die to address an issue.\n\nUnfortunately, Secretary of Health and Human Services Robert F. Kennedy Jr. has decided to stop investing in the development of mRNA vaccines. I am concerned this is based on his personal feelings toward the vaccine or his skepticism toward vaccines in general.\n\nThe secretary has contributed positively to the national public health conversation by highlighting the dangers of ultraprocessed food. Similarly, he corrected the record after years of falsely claiming that measles vaccination causes autism. After the West Texas deaths, he encouraged parents to vaccinate their children against measles, admitting that the measles vaccine is safe. He needs to correct himself now regarding mRNA vaccine technology. He must listen to the evidence, not conspiracy theories or faulty scientific reports.\n\nCDC UNION WARNS VACCINE DISINFORMATION PUT STAFF AT RISK FOLLOWING SHOOTING\n\nIf the next pandemic — or worse, a targeted biological strike — occurs during this Trump presidency, abandoning mRNA research now risks destroying a signature Trump achievement, leaving America vulnerable and costing untold lives. \n\nNational defense today includes not only aircraft carriers and missile shields but also defenses against biological, chemical, and radiological weapons to protect both our military and everyday Americans. The only question is whether we will abandon the Herculean effort made by Trump in his first term to develop and deploy mRNA vaccines when they are now an essential tool in our national defense. If we do abandon them, our enemies will be watching.\n\nDr. Bill Cassidy is a U.S. senator from Louisiana.","summary":"In West Texas, falsehoods about the measles vaccine, chief among them the disproven claim it causes autism, persuaded many families to forgo immunization. Then, two children died from a disease modern medicine had conquered decades earlier. It was a tragedy in miniature, but a preview of the scale of loss that can follow when politics [&#8230;]","url":"https://www.washingtonexaminer.com/restoring-america/courage-strength-optimism/3500142/trump-mrna-vaccine-legacy-america-strategic-shield/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/vaccine-mandate.webp","video":null,"publish_date":"2025-08-15 10:00:00","author":"Bill Cassidy","authors":["Bill Cassidy"],"language":"en","category":"politics","source_country":"US","sentiment":0.26},{"id":351357502,"title":"The Curious Symbolism of J. D. Vance’s English Getaway","text":"For this week’s Fault Lines column, Jon Allsop is filling in for Jay Caspian Kang.\n\nLast week, Vance and his travelling circus touched down in the U.K. He visited David Lammy, the country’s Foreign Secretary, at the latter’s residence in Kent, before heading on to the Cotswolds, a scenic area west of London that looks like what an A.I.-image generator might spit out if you asked it to conjure the British countryside. (If you’ve seen the Disney+ adaptation of Jilly Cooper’s steamy book “Rivals,” you get the idea.) Vance and his family reportedly stayed in a lavish Georgian manor owned by a light-bulb magnate, obliging me to ask whose bright idea that was. Residents complained to the British press about the associated inconvenience, recounting road closures (leading to, gasp, wet crops), bad American driving, and an indiscreet Secret Service presence. (One local official likened the profusion of agents to a scene from “Men in Black,” adding, “It was a bit over the top really.”) Jeremy Clarkson—the cantankerous former host of the car program “Top Gear,” who recently called Vance “a bearded God-botherer”—suggested that a no-fly zone had obstructed drone filming for a show about a farm that he owns nearby. This led to headlines claiming that Clarkson had joined, or was even leading, a “backlash” against Vance—though he subsequently mocked the claims of chaos by posting a video of a peaceful pastoral vista.\nCotswoldians are used to celebrity visitors and residents: Clarkson, for starters, but also Piers Morgan, Ellen DeGeneres, and the former British Prime Minister David Cameron, who has a home in the hamlet where Vance posted up. (Kamala Harris also visited, shortly before Vance did.) Nor is Vance the first politician to vacation with an irritating retinue in tow. But his trip was unusually fraught. Protesters rallied in a local park, toting signs with slogans like “COTSWOLD CHILDLESS CAT LADIES SAY GO HOME” (brandished, reportedly, by a woman who does have children and does not have cats), “WAR CRIMINAL,” and (my personal favorite) “JD VANCE CLAPS WHEN THE PLANE LANDS.” A van drove around the area displaying a meme of Vance with a shiny bald head, which went viral after a tourist claimed that he was turned away from the U.S. for having it on his phone. (Homeland Security officials have denied that this happened.) According to reports in the Observer and the Wall Street Journal, police went door to door, asking residents to identify themselves and disclose details of their social-media accounts. In fairness, Vance did recently warn Britain’s government against advancing down a “very dark path” of online censorship. (His office denied any advance knowledge of the social-media questioning; a British police spokesperson said that it had not taken place.)\nIf the otherwise silly story of Vance’s vacation has a serious side, then his choice of destination has curious symbolic connotations, too. The Cotswolds have a rich association with a vein of upper-class establishment conservatism that is in retreat around the world. In many ways, Vance’s rise has been a compelling manifestation of that retreat. Whether Vance has left this sort of politics behind entirely, however, might be another matter.\nIn the British political imagination, the Cotswolds have been most closely linked not with the Farages of the world but with the likes of Cameron, who was part of what came to be known as “the Chipping Norton set”—an élite social circle named for a town that’s a ten-minute drive from Vance’s bolthole (albeit longer with motorcade traffic). The set became infamous in the early twenty-tens, shortly after Cameron took office, when another of its members, Rebekah Brooks, a lieutenant for Rupert Murdoch, was criminally charged in the phone-hacking scandal that engulfed Murdoch’s British newspaper empire. (Brooks was acquitted, and now works again for Murdoch.) Cameron styled himself as a modernizer keen to dispel the hard-edged image of the Conservative Party—in one famous stunt, he went to the Arctic and hugged a husky in order to prove his environmental credentials—and as a committed internationalist. Indeed, he resigned as Prime Minister, in 2016, after voters rejected the case he had made for Britain to stay in the European Union. Around the same time, he criticized Donald Trump’s proposed Muslim travel ban as “divisive, stupid, and wrong.” In a 2019 memoir, Cameron wrote that he had been depressed by Trump’s brand of protectionist, xenophobic politics; that he “couldn’t have agreed more” with a speech in which President Barack Obama warned that Trump’s rhetoric was a slippery slope toward demonizing “whole nations, races and religions”; and that Trump’s references to “Islamic terrorism” were crude and unhelpful.\nCameron’s school of conservatism now appears to be dead—at the hands of Vance, among others. (Last year, Vance described the U.K. as perhaps the world’s first nuclear-armed “Islamist country.”) His trip to the Cotswolds can be read, even if unintentionally, as dancing on the grave of this world view. Not so long ago, however, Vance appeared to be closer to Cameron politically. Shortly after the publication of his 2016 memoir, “Hillbilly Elegy,” Vance dismissed Trump as “cultural heroin.” In the book, he also made the case that post-industrial and rural poverty in largely white, Rust Belt communities was a result, in part, of a deficit of personal and collective responsibility. Such ideas echo rhetoric that Cameron used to indict what he saw as a “broken” British society. In 2016, George Osborne—who, as Cameron’s finance minister, oversaw a program of fiscal austerity that shredded Britain’s social safety net—described “Hillbilly Elegy” as one of his books of the year. After reading it, Osborne has said, he reached out to Vance, who, in turn, apparently complimented the Cameron government. The two men are still friends; according to the Financial Times, it was Osborne who sorted Vance’s accommodation ahead of his Cotswolds trip, and the pair dined together this week.\nAs has been endlessly chronicled, Vance has been on quite a political journey since 2016. Some aspects of his embrace of Trumpism—and, with it, an insistent economic populism and anti-corporate posture—strike me as sincere, and others less so. If there’s one clear through line of Vance’s politics, however, it is how he has, albeit with differing emphases, styled himself (or, at least, allowed himself to be styled) as a voice for the poor and downtrodden masses far from the madding crowds of big coastal cities. Whatever Vance’s real views, this image is hard to square with, say, serving in an Administration that has just passed a huge tax cut for the ultra-rich, or with getting special treatment on a kayaking trip, knowingly or not. It seems hard to square, too, with his Cotswolds visit.\nThis, at least, is true in the sense that the Cotswolds, which have become a playground for London’s élite, is not typically associated with hardscrabble imagery. But there is poverty there, of the rural kind that tends to be less visible—certainly if you stay in your country pile, with its tennis court, gardens, and orangery. “There is real hardship and deprivation behind the media stories of the area whose latest description, apparently, is the ‘Hamptons of England,’ ” one local told the Telegraph, a conservative British newspaper, this week. In 2013, in the wake of the phone-hacking scandal, a reporter from the New York Times visited the area and heard something similar. “This is still a working-class town, and this is a working-class pub,” one man said, over a pint, at least until “these tall people named Giles and Pippa show up.” And, now, J. D. ♦","summary":"The Vice-President built his political brand on bashing élites. Why does he vacation like one?","url":"https://www.newyorker.com/news/fault-lines/the-curious-symbolism-of-j-d-vances-english-getaway","image":"https://media.newyorker.com/photos/689e213e9c8a5602d1b4c51e/16:9/w_2560,h_1440,c_limit/ALLSOP-JD-VANCE---2025-08-08T125143Z_141498491_RC203GA6NFLO_RTRMADP_3_USA-VANCE-BRITAIN.jpg","video":null,"publish_date":"2025-08-15 10:00:00","author":"Jon Allsop","authors":["Jon Allsop"],"language":"en","source_country":"us","sentiment":0.115},{"id":351311890,"title":"Some Republicans are salivating at the possibility of Mamdani winning, but Trump may not be","text":"While some Republicans are salivating over the possibility of a Zohran Mamdani victory in the hopes of painting Democrats as far-left extremists, Donald Trump doesn’t seem to be among them.\n\nAccording to some people who have discussed the NY mayoral race with Trump, the lifelong New Yorker — save for his time in DC — doesn’t want to see his hometown fail under a socialist, even if it’d be a boon to the GOP.\n\nPart of that is because of his real estate interests — his name is still on half a dozen buildings across the city, including Trump Tower, 40 Wall Street, Trump Parc, Trump Palace and Trump International Hotel. While he doesn’t own all of those properties outright, they still represent billions worth of value according to real estate experts.\n\nHe also has an ambitious immigration agenda that relies on local cities cooperating with ICE for deportations. Given New York City is more than double the size of any other city in the US — Gotham has 8.5 million residents while Los Angeles has 3.8 million — a mayor with a vendetta against Trump’s immigration agenda could make things far more challenging.\n\nThen there is the fact that Trump loves the city — there is a reason he made a pilgrimage to solidly blue NYC and held a rally at Madison Square Garden days before the election when Kamala Harris was doubling down on swing states. He also spent years with the people who work at his properties and the employees of the Trump Organization who are still in New York.\n\n“Trump is very motivated to keep Mamdani out — he isn’t interested in proving a point with New York City,” one source who has worked with Trump for years told me. “He still has a lot of real estate and a lot of employees in New York City.”\n\nThe White House maintains that Trump is staying out of the race. \n\nBut, as recently as last month, he posted on Truth Social, “As President of the United States, I’m not going to let this Communist Lunatic destroy New York. Rest assured, I hold all the levers, and have all the cards. I’ll save New York City, and make it ‘Hot’ and ‘Great’ again, just like I did with the Good Ol’ USA!”\n\nAnd Mamdani is clearly betting Trump’s interest in the race can be used as a cudgel to try to woo the Never-Trumpers in New York. Over the last week, Mamdani even launched a five-borough anti-Trump tour in an effort to make the election a referendum on the President.\n\n“We know that there is no borough that will be free from Trump’s cruelty,” he said in a speech on Monday at the Service Employees International Union in Manhattan.\n\nWhile New York is hardly a bastion of conservatism, sources close to Trump are betting that him meddling in the election wouldn’t have the kind of disastrous impact that Mamdani thinks it would.\n\n“He did better in New York City than he has ever done,” one source who has discussed the mayoral race with Trump said. “And there are a lot of people who would never vote for him who are actually happy about the way he is handling antisemitism on campus and Israel.”\n\nWhile he is unlikely to endorse anyone outright, I think we can expect to see Trump using his bully pulpit to bash Mamdani a few more times. Behind-the-scene, he could also potentially pressure other candidates to drop out of the race. \n\nTrump could be involved in offering Republican candidate Curtis Sliwa or current mayor Eric Adams some position that would make it worth their while to leave the race. The Department of Justice could tighten the screws on existing investigations against Adams or Andrew Cuomo.\n\nMeanwhile, others on the right are gunning for a Mamdani victory.\n\n“Honestly … it [would make it] easier for [Elise] Stefanik to become governor and for the Republicans to win the midterms,” one Republican, who spoke on the condition of anonymity, said. “A Mamdani victory big picture may not be so bad.”\n\nSend NYNext a tip: nynextlydia@nypost.com","summary":"“Trump is very motivated to keep Mamdani out — he isn’t interested in proving a point with New York City,” one source who has worked with Trump for years told me.","url":"https://nypost.com/2025/08/15/business/some-republicans-are-salivating-at-the-possibility-of-mamdani-winning-but-trump-may-not-be/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/On-Site-On-Site-Short-Video-9.png?w=1200","video":"https://cdn.jwplayer.com/videos/2gXWcLZi-RyIcpnTz.mp4","publish_date":"2025-08-15 10:00:00","author":"Lydia Moynihan","authors":["Lydia Moynihan"],"language":"en","category":"politics","source_country":"zm","sentiment":0.209},{"id":351330642,"title":"Riding political wins, a once-restrained Gov. Greg Abbott is increasingly steamrolling foes","text":"Sign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\n\nLoaded with $43 million in his campaign coffers and facing no serious electoral threat, Gov. Greg Abbott in 2017 plunged into uncharted waters for a Texas governor: the state House primaries.\n\nThe first-term governor mobilized his support — an arsenal of endorsements, ads and stump speeches — behind three candidates taking on incumbent representatives he had clashed with in the state’s lower chamber. It was, at the time, somewhat remarkable for Texas’ top elected official to enter the trenches against lawmakers from his own party. The House speaker, a Republican, said Abbott was putting one of the seats at risk of falling into Democratic hands.\n\nUltimately only one of the Abbott-backed challengers won. But the anti-incumbent play laid the groundwork for a far more ambitious effort six years later, when the governor responded to the Legislature’s failure to deliver taxpayer dollars for private school tuition — his top priority — by targeting 15 anti-voucher incumbents and unseating 11 of them.\n\nThe strong-arming worked. Earlier this year, the Legislature passed a school voucher package with little GOP defection, and the governor unlocked a new effective strategy to accomplish his goals: playing hardball.\n\nFresh off the political and policy victory, it appears the once-restrained governor is now bolder than ever, loaded with an unmatched abundance of campaign cash and a determination to emerge victorious in any battle — even if it requires dipping into his own party’s legislative primaries. Abbott’s political zeal has been on full display lately as he moves to boot the Texas House Democratic leader from his duly elected office over the ongoing redistricting impasse, sparked by dozens of Democrats who left the state to stall a new GOP congressional map.\n\n“All of this is unprecedented,” Abbott, who was not made available for an interview for this story, told radio host Mark Davis this week. “The Democrats were used to the old fashioned way, where Republicans weren’t going to do anything about it. This time we pulled out every tool in the toolbox.”\n\nAs the quorum-breaking Democrats remain out of state in protest, Abbott has asked the state Supreme Court — an all-Republican body whose nine justices include six of his appointees — to vacate the seat of Houston Rep. Gene Wu. And he initially sparred with Attorney General Ken Paxton over who had the legal standing to bring the suit.\n\nAbbott has vowed to continue calling overtime legislative sessions, which only he has the authority to do, and threatened further retribution by targeting even more Democratic seats and suggesting he could add more conservative priorities to the already ambitious agenda, which he solely controls. The governor already caught some off guard when he rolled out a legislative to-do list that included several unfinished priorities of hardline conservatives, including cracking down on abortion pills, requiring people to use bathrooms that align with the sex they were assigned at birth and allowing the attorney general to prosecute state election crimes.\n\nAlso on the agenda was a call to more firmly regulate THC products, coming after Abbott vetoed the outright THC ban championed by Lt. Gov. Dan Patrick, whom the governor was once reluctant to challenge in head-to-head combat.\n\nPeople who have worked closely with the governor say it’s not that he is bolder now as much as that he has come into his leadership role — and rising national profile, thanks largely to Abbott’s boundary-pushing border initiatives under Operation Lone Star.\n\n“The issues and the environment have changed. He hasn’t changed,” said Matt Hirsch, a former deputy chief of staff to Abbott. “He’s always been someone who I think the best way to describe it is determined. … People underestimate his determination, and every time they do so at their own peril.”\n\nCritics disagree. They see a governor drunk on power looking for more.\n\n“We said we would defeat Abbott’s first corrupt special session, and that’s exactly what we’re doing,” Wu said in a statement this week.\n\nSending a message\n\nShortly after President Joe Biden took office in 2021, Abbott criticized the Democratic administration's immigration policies and accused Biden of leaving the southern border “open” for migrants to cross.\n\nAbbott took matters into his own hands. He launched Operation Lone Star, deploying thousands of Department of Public Safety troopers and National Guard soldiers to the 1,250 miles of border Texas shares with Mexico. He drew the Biden administration into numerous legal battles and infuriated immigrants’ rights advocates, who accused state officials of illegally jailing migrants without charges, among other due process concerns.\n\nBut no aspect of the crackdown elevated Abbott’s clout across the country quite like his busing of asylum-seeking migrants from Texas to northern cities run by Democrats.\n\nThe idea scrambled the politics of immigration across the nation, as Democratic leaders struggled to respond to the influx of migrants needing help, while trying to appear supportive of immigrants’ rights. The number of illegal border crossings spiked during the Biden administration, which failed to respond until months before the 2024 election.\n\nThe governor would later say he “took the border to” Biden and Vice President Kamala Harris.\n\n“What you're seeing is a governor who is probably more popular than he's ever been, a governor who has more political capital than he's ever had, and I think he's looking to push his advantage,” said John Wittman, who worked for Abbott, including as communications director, for seven years until 2021.\n\nWittman was an aide to the governor — whom he described as “the hardest worker that I have ever met in my life” — when Abbott first stepped onto the House primary battlefield in 2017.\n\n“People can judge whether or not, you know, that ended up being successful,” Wittman said. “But the reality is that the governor sent a message that he was serious about his agenda.”\n\nSince then, Abbott has increasingly flexed his power, typically favoring blunt force methods over give-and-take deal-making to drive his agenda through the Legislature.\n\nIn 2021, after state Democrats similarly fled the state to kill GOP voting restrictions, the governor vetoed the part of the state budget that funds the Legislature, declaring that “funding should not be provided for those who quit their job early.” The move threatened to withhold pay for more than 2,100 state employees caught in the middle, but lawmakers approved a stopgap measure extending the funding and Republicans ultimately passed the voting bill.\n\nThe following session, Abbott went to work on his push for a school voucher program — a topic he had broached several years earlier, when he asked lawmakers during the 2017 session to create such a program for children with disabilities.\n\nAs in 2017, Abbott’s renewed push to unlock public funds for private school tuition failed to clear the state House, meeting loud opposition from rural Republicans who argued the policy would reroute funding from public schools that are important pillars in their communities.\n\nBy October, Abbott had returned lawmakers to the Capitol for three emergency legislative sessions following the regular 140-day one. No deal appeared in sight.\n\nThat month, the governor — who would call a fourth overtime session — made a straightforward pitch to his fellow Republicans: You can do this the easy way. Or the hard way.\n\n“We will have everything teed up in a way where we will be giving voters in the primary a choice,” Abbott said during a tele-town hall.\n\nHe followed through. His campaign unleashed ads accusing Republicans — including some he had openly supported in the past — of being soft on border security, even after they had voted to fund his border initiatives and pass a law to let Texas police arrest people suspected of being undocumented.\n\n“The nutshell bottom line is, policy is never divorced from politics,” said John Colyandro, who worked in various capacities for the governor dating back to his time as attorney general. “If you have an issue that you take on — that's a challenging issue like school choice — it was imperative for the governor to take that leadership role.”\n\n“Relic of a softer age”\n\nA prolific fundraiser, Abbott is sitting on an $86 million campaign stash and has already begun deploying it with ads against absent Democrats, knocking them for holding up disaster relief in the wake of Central Texas floods that killed more than 100 Texans.\n\nHe’s also floated the idea of running Republican candidates against the absent Democrats once their seats are vacated, assuming he gets his way. Abbott’s political strategist, Dave Carney, has encouraged GOP candidates to “start thinking about running in the upcoming special elections” and accused Democrats of misreading the moment.\n\n“Watching from the outside its clear the current Texas leadership [ain’t] playing anymore,” Carney wrote on social media. “Past make-up and forget, let bygones, etc. is a relic of a softer age.”\n\nAbbott has also suggested he could apply his more assertive tactics to accomplish other goals. In recent remarks he has credited his primary campaigning for the voucher victory — as well as stiffening the state’s bail laws.\n\nAnd he’s already eyeing his next political push: potentially reducing property taxes by capping local spending.\n\n“I’m just thinking, well, it worked with these two strategies, maybe it’s time to employ the same strategy as it concerns property taxes,” Abbott reportedly said. \"I was not out in the trenches fighting for that in the same way.\"\n\nMore all-star speakers confirmed for The Texas Tribune Festival, Nov. 13–15! This year’s lineup just got even more exciting with the addition of State Rep. Caroline Fairly, R-Amarillo; former United States Attorney General Eric Holder; Abby Phillip, anchor of “CNN NewsNight”; Aaron Reitz, 2026 Republican candidate for Texas Attorney General; and State Rep. James Talarico, D-Austin. Get your tickets today!\n\nTribFest 2025 is presented by JPMorganChase.","summary":"The third-term governor appears determined to win any battle — even if it means scorched-earth primary crusades or trying to boot duly elected legislators from office.","url":"https://www.texastribune.org/2025/08/15/texas-greg-abbott-redistricting-lawsuit-primaries-vouchers-border/","image":"https://thumbnails.texastribune.org/33O8XefyiTm_z6KCuDT8Hp-zl1k=/450x300/https://static.texastribune.org/media/files/d86d9ad5f1accc85bfe9e224c8d6633a/0705%20Hill%20Country%20Flood%20RB%20TT%20113.jpg","video":null,"publish_date":"2025-08-15 10:00:00","author":"Alejandro Serrano","authors":["Alejandro Serrano"],"language":"en","category":"politics","source_country":"us","sentiment":-0.262},{"id":351330640,"title":"Poll finds Cornyn, Paxton in dead heat in Texas’ Senate GOP primary","text":"Sign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\n\nA new poll of Texas’ Senate GOP primary shows Sen. John Cornyn leading Attorney General Ken Paxton by 1 percentage point, breaking a spell of public polling that had found the incumbent trailing by wide margins.\n\nIn a sample of nearly 500 registered Texans planning to vote in the Republican primary, Cornyn garnered 30% of the vote to Paxton’s 29% — well within the poll’s 4.4% margin of error. Much of the Republican electorate is up for grabs, with 37% saying they were undecided.\n\nIf neither candidate wins 50% plus one vote in the March primary, the top two candidates would advance to a May runoff.\n\nThe poll was conducted by Emerson College between Monday and Tuesday — the first public survey of the bitter primary since Cornyn allies began deploying millions in advertising. Paxton and his allies, meanwhile, have largely kept their powder dry, waiting to go up on air until closer to the primary.\n\nGroups affiliated with Senate Republicans have committed enormous resources to Cornyn, arguing that a Paxton candidacy would jeopardize the party’s hold on the seat and cost more money to defend. In a slideshow obtained by Punchbowl News, Senate Leadership Fund, the super PAC linked to Senate GOP leadership, projected that Republicans would need to spend over $200 million on Paxton in a general election.\n\nBut in a broader pool of 1,000 Texas voters, the Emerson poll found both Republicans beating Democrat Colin Allred — the highest-profile declared Democratic candidate — beyond the margin of error. Cornyn garnered 45% to Allred’s 38% in a hypothetical matchup, while Paxton led 46% to 41%.\n\nThe latest findings differ significantly from previous surveys of the primary. The SLF presentation found that Paxton led Cornyn by an average of 17% across 13 polls between January and June. Emerson, like many pollsters, underestimated Republicans in 2024, finding in October that Republican presidential nominee Donald Trump led his Democratic counterpart, Kamala Harris, by 7 percentage points in Texas and that Allred was within 1 point of Sen. Ted Cruz. Ultimately, Trump won by about 13 percentage points and Cruz won by more than 8 points.\n\nBoth Cornyn and Paxton are pursuing an endorsement from Trump, who has yet to weigh in on the contest and has endorsed both men in prior races. The Emerson poll suggests that the Trump endorsement could be the deciding factor for voters unsure of who they plan to support.\n\n“Seven months ahead of the Republican Primary, the contest between the four-term incumbent and the Attorney General is a toss-up,” Emerson executive director Spencer Kimball said in a statement, noting the large share of voters who had yet to make up their minds. “Among these undecided voters, President Trump’s job approval stands at 73%, suggesting his endorsement could be pivotal in such a close race.”\n\nBeyond the Senate race, the poll found Trump’s approval rating remains much higher in Texas than nationally, with 49% approving of the job he’s done as president and 42% disapproving. Gov. Greg Abbott is less popular but still above water, with a net approval rating of 3 percentage points.\n\nTexans continued to rank the economy and immigration as their top issues, but their order has flipped since before the 2024 election, with the economy now taking the top spot at 30%. Amid Trump’s crackdown at the border, illegal crossings — which had already begun to drop under President Joe Biden after spiking earlier in his term — have plummeted to the lowest level in decades.\n\nLooking ahead to 2028, Texas Republicans’ preferred presidential candidate is Vice President JD Vance, the Emerson poll found. Vance stands far ahead of the field at 45%; Cruz, who ran for president in 2016, is second at 9%.\n\nOn the Democratic side, no prospective candidate had a clear lead. Former U.S. Transportation Secretary Pete Buttigieg led the field with 22% support, followed by California Gov. Gavin Newsom at 20% and 2024 nominee Harris at 17%.\n\nFinally, the survey found that voters are paying close attention to state Republicans’ effort to redraw Texas’ congressional map to yield more GOP seats.\n\nNearly 80% of voters said they are following redistricting very or somewhat closely. And they had mixed feelings about it: 36% support the redraw, 38% oppose it and 26% are unsure. But independents are against it by a margin of 19 percentage points.\n\nTexas House Democrats decamped to blue states en masse to freeze the Legislature’s redistricting process, and Republicans have issued arrest warrants to attempt to compel them to return. Again, Texas voters were split — 41% agreed that the fleeing Democrats should be arrested, while 37% did not.\n\nMore all-star speakers confirmed for The Texas Tribune Festival, Nov. 13–15! This year’s lineup just got even more exciting with the addition of State Rep. Caroline Fairly, R-Amarillo; former United States Attorney General Eric Holder; Abby Phillip, anchor of “CNN NewsNight”; Aaron Reitz, 2026 Republican candidate for Texas Attorney General; and State Rep. James Talarico, D-Austin. Get your tickets today!\n\nTribFest 2025 is presented by JPMorganChase.","summary":"Every previous public poll had shown the attorney general with a considerable lead over Texas’ incumbent senator.","url":"https://www.texastribune.org/2025/08/15/paxton-cornyn-texas-senate-poll-august-emerson/","image":"https://thumbnails.texastribune.org/lAtfIdf1A_z_GHrlWzTXaN6RJoc=/450x300/https://static.texastribune.org/media/files/19c2d06731e1384713a2a83470fa5e3b/0814%20Paxton%20and%20Cornyn%20TT%2001.jpg","video":null,"publish_date":"2025-08-15 10:00:00","author":"Gabby Birenbaum","authors":["Gabby Birenbaum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.173},{"id":351287128,"title":"Martina Navratilova celebrates as JD Vance reportedly denied entry to UK club after staff mutiny unlike Kamala Harris","text":"Martina Navratilova reacted to US Vice President JD Vance reportedly being denied entry to a UK Club. The same venue seemingly hosted Kamala Harris a few days ago.Navratilova is one of the most prominent names in the tennis community. She is now known for voicing her opinions on political matters and personalities. On social media, Navratilova is usually seen taking a dig at the US president, Donald Trump, and most recently, she was seen celebrating the incident where Vance was denied entry to a club in the UK.The staff of the British countryside pub, The Bull in Charlbury, Oxfordshire, rebelled against Vance's entry in the club recently after the latter tried to dine there. Reportedly, the staff arranged a mutiny and said they wouldn't work at the restaurant if they accepted his dinner reservation. Just a few weeks before this incident, The Bull hosted Harris.One of the users on X shared this news on the platform, which caught Navratilova's attention, who rejoiced at this incident as she reposted it on her wall and penned a bunch of 'clapping' emoticons.\"&#128077;&#127996;&#128079;&#127996;&#128079;&#127996;&#128079;&#127996;\"Martina Navratilova @MartinaLINK&#128077;&#127996;&#128079;&#127996;&#128079;&#127996;&#128079;&#127996;Martina Navratilova recently dropped a reaction to Trump's wife, Melania Trump's, $1B warning to Hunter Biden for dragging her name into the Jeffrey Epstein controversy.Martina Navratilova slams JD Vance for saying he wants peace amid the Russia-Ukraine conflictThe US Vice President, JD Vance, recently discussed the USA's plan to terminate funding for Ukraine in the conflict situation and emphasized resolving the differences through peaceful settlements. Donald Trump is about to meet with Russia's president, Vladimir Putin, in Alaska on Friday, August 15. Ahead of this, Vance revealed the above-mentioned plan in a conversation with Maria Bartiromo on Fox News.\"We’re willing to use those to bring about peace...I think the president and I certainly think that America, we’re done with the funding of the Ukraine war business. We want to bring about a peaceful settlement to this thing. We want to stop the killing,\" Vance said.This did not sit right with the former tennis player Martina Navratilova, who did not fall short in sharing her honest opinion about Vance's statement. Questioning his position as the vice president, she shared her thoughts on X that read:\"He is vile. And has achieved absolutely nothing before being picked for VP. He is the true DEI hire…\"Shortly ahead of this, Martina Navratilova also bashed Donald Trump for mistakenly describing Russia's second-largest city while he was accusing the media of purposely working together to ruin his reputation.","summary":"Martina Navratilova reacted to US Vice President JD Vance reportedly being denied entry to a UK Club. The same venue seemingly hosted Kamala Harris a few days ago.","url":"https://www.sportskeeda.com/tennis/news-martina-navratilova-celebrates-jd-vance-reportedly-denied-entry-uk-club-staff-mutiny-unlike-kamala-harris","image":"https://staticg.sportskeeda.com/editor/2025/08/248b5-17552464772396-1920.jpg","video":null,"publish_date":"2025-08-15 09:55:11","author":"Nancy Singh","authors":["Nancy Singh"],"language":"en","source_country":"in","sentiment":0.12},{"id":351282982,"title":"Letter: Proportional representation is the answer to gerrymandering","text":"To the editor: Gerrymandering is the creation of voting districts so as to benefit one political party, and it is a hot topic today.\n\nIt is disliked by both Republicans and Democrats, but both parties do it. Elbridge Gerry, one of the Founding Fathers and governor of Massachusetts, created wildly shaped districts, some of which had the appearance of a salamander, hence the name.\n\nGerrymandering can make only small advantage in elections. A much worse situation is a system in which many districts can yield zero representation of one party despite significant statewide support.\n\nOur Massachusetts is one example. Republican President Donald Trump won 36 percent of the vote, while 2.8 percent of voters did not vote for Democratic candidate Kamala Harris. Yet there are no Massachusetts Republicans in Congress or Senate. The breakdown of votes for Congress and the Senate probably resembles the presidential race. Massachusetts is not alone. The unfair representation problem exists to some degree in many states, and both parties suffer. \n\nThere is a better way: proportional representation. Under such a system, election campaigns would take place as they do now. Each party would make a list of its candidates in order of importance. Hopefully, the best people are at the top of both lists, perhaps because of their strong campaigns. The vote is up or down for each party. Parliamentary seats are distributed between parties according to election results, each party drawing down from the top of the list it presented to the voters.\n\nI say “parliamentary” because this was how United Kingdom elections worked when I last studied them.\n\nFrom the UK, we also ought to adopt the tradition of “the loyal opposition.\" It is not useful to the nation for the minority party to simply obstruct every policy of the ruling majority. Serious criticism and helpful suggestions are OK, but don’t sink to blind hate.\n\nEd Dartford, Stockbridge","summary":"To the editor: Gerrymandering is the creation of voting districts so as to benefit one political party, and it is a hot topic today.","url":"https://www.berkshireeagle.com/opinion/letters_to_editor/letter-proportional-representation-is-the-answer-to-gerrymandering/article_343a9701-9783-4403-a767-fc404dbdc931.html","image":"https://bloximages.newyork1.vip.townnews.com/berkshireeagle.com/content/tncms/custom/image/2b802cce-8455-11ec-8935-3f9640429655.jpg?resize=600%2C315","video":null,"publish_date":"2025-08-15 09:15:00","author":"Blox Content Management","authors":["Blox Content Management"],"language":"en","category":"politics","source_country":"us","sentiment":-0.003},{"id":351297946,"title":"In Houston, some worry their problems would be neglected after redistricting","text":"HOUSTON — The neighborhood called \"Denver Harbor,\" is mostly small homes and small businesses. It's a largely Latino area and people are worried about immigration and deportations.\n\n\"Everybody's nervous,\" said Rene Porras, a Vietnam combat veteran and small business owner. \"I have a little local taqueria, Mexican bakery, and business is down for the last three or four weeks. I mean, really down. And I talked to my other friends that have businesses and the same thing. Where did the immigrants go?\"\n\nRita Robles is a community activist in Denver Harbor, who underscored the problem.\n\n\"When they started saying that ICE (Immigration and Customs Enforcement) was going to be in the area, we've spotted them in certain areas where they're huddling together, before they go do a raid, and that has scared the hell out of the people here,\" Robles said.\n\nMass deportations are just one part of President Trump's agenda that the Republican majority in Congress has supported. But their majority is narrow and to help maintain it, Trump has called for Texas lawmakers to redraw the voting maps to help GOP candidates in the election next year. Trump says he wants redistricting in Texas that will create five more Republican-held seats.\n\nDemocrats in the Texas state house have left the state to try to block the chamber from having enough members to hold a vote on the maps. They've indicated they could return soon. Gov. Greg Abbott, a Trump ally, threatened to have them arrested or removed from office if they don't return to the Legislature.\n\nOne reason Democrats say they could return is because Democratic leaders in California plan to ask voters for permission to counter Texas with redistricting there. And Republican-led states, including Missouri and Florida, are considering countering that. Usually states just redistrict early in the decade after the regular census count, a norm that Trump's plan could disrupt.\n\nThis neighborhood could end up in a district that tilts Republican\n\nThe district is currently represented in Congress by Democratic Rep. Sylvia Garcia. Under proposed maps in the Legislature, the Denver Harbor neighborhood would be sliced out of the district it's now in and moved to one that includes suburbs and exurbs. \n\nAn analysis by the Texas Legislative Council, an agency that provides research for state lawmakers, shows that while the current district Denver Harbor is in now voted for Kamala Harris for president last year, voters who would be in the new district went for Donald Trump by a wide margin.\n\nPorras says neighbors don't want the redistricting. \"Since Trump's proposed this,\" Porras said, \"he's so unpopular around here it's incredible. Everything from cutting services and Medicaid, all the things he didn't mention during the election, or said he's not going to cut, that's exactly what he's doing.\"\n\nRobles worries about what the redrawn district will mean for the environmental health of the neighborhood, which sits just a few miles from the Houston Ship Channel.\n\n\"We have a very big problem with air pollution,\" Robles said. \"We already have a large number of people in our area that suffer from health problems, and then on top of that, you suffer from things like asthma, emphysema.\"\n\nRobles said people in Denver Harbor don't make much money compared to the neighborhoods it would be joined with in the new district.\n\n\"They make six figures, you know, anywhere from $50,000, $60,000 and up to six figures,\" Robles said of her prospective neighbors. \"They don't have these types of problems that we do.\"\n\nWhy the GOP is seeking a new district\n\nBut Republicans note that, while Denver Harbor's current district twists and turns across Houston and the surrounding county, its proposed new home is more compact. And it will still be majority Hispanic, even though Democratic leaders might not like how they vote.\n\n\"The way the new maps are drawn is really more indicative of how Harris County has changed demographically,\" said Cindy Siegel, chair of the Harris County Republican Party.\n\nSiegel argued that if Democrats are upset by the proposed new map, it's because they realize that they've taken Hispanic voters for granted, and now they pay a price for it.\n\n\"They know that there has been a shift in the last election that the Hispanic community, more Hispanic voters, in fact, supported President Trump, voted for him,\" Siegel said.\n\nTexas House Majority Leader Tom Oliverson, a Republican who represents Cypress in northwest Harris County, told Houston Public Media that partisan gain was, in fact, the main reason for the redistricting plan.\n\n\"I think it's well within our right to do so,\" Oliverson said. \"There are many, many states where redistricting for partisan performance has been a way of life for 20, 30 years, particularly in Democrat states.\"\n\nBut partisan redistricting can overlap with racial gerrymandering, which is illegal. Michael O. Adams, a political science professor at Texas Southern University, said that the apparent Hispanic majority of the proposed district is deceptive and does not reflect its likely voting majority.\n\n\"I think what we're seeing here, and what we're witnessing in this redistricting proposal and the midterm cycle, is what I would call a master class in demographic manipulation,\" Adams said.\n\nAndrew Schneider is the senior reporter for politics and government at Houston Public Media.","summary":"In one neighborhood of the city, Latinos worry about immigration and urban problems but may soon be grouped in with suburban voters.","url":"https://www.npr.org/2025/08/15/nx-s1-5502654/texas-redistricting-trump-midterm-elections","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2052+0+0/resize/3600x2052!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3c%2Ffb%2F2b4930b94d8380a8ae3b2ab599ad%2Fap25220687557956.jpg","video":null,"publish_date":"2025-08-15 09:00:00","author":"Andrew Schneider","authors":["Andrew Schneider"],"language":"en","category":"politics","source_country":"us","sentiment":-0.423},{"id":351289956,"title":"Highest 2 Lowest review: Spike Lee + Denzel Washington = Pulse-pounding cinema","text":"At his best, Spike Lee keeps his audience on their toes, never totally sure where he might go next. In Highest 2 Lowest, his latest collaboration with Denzel Washington (Mo' Better Blues, Malcolm X, He Got Game, Inside Man), Lee is having an absolute blast keeping us off-balance. Washington headlines this New York City-set thriller as record exec David King, whose wealth, company, family, and legacy are thrown into spin when his son is kidnapped for ransom. Washington has especially been delivering smashing performances as of late in everything from The Tragedy of Macbeth to Gladiator II, but there's something special here. You can feel the trust between him and Lee as the always-exploring filmmaker plays with tone, frequency, film stocks, and continuity to grant Washington the space to experiment and thrive. Rather than a cold ransom drama built on the shoulders of a glowering leading man, Lee trusts Washington to brandish that signature smile as freely as his Academy Award–winning snarl. But the movie star also gets to flex some less tested moves and emotions. This makes for some sequences that play peculiarly on a first watch. But on reflection, what Lee and Washington set up in a discomforting first act lays the groundwork for a climax that hits like a subway train. Highest 2 Lowest delivers a tale of mistaken identity and hard-won justice with Spike Lee flair.\n\n Aubrey Joseph and Elijah Wright plays friends in \"Highest 2 Lowest.\"\n Credit: A24\n\nScreenwriter Alan Fox adapted Highest 2 Lowest from Ed McBain's 1959 novel King's Ransom, which was previously translated to the screen by legendary Japanese filmmaker Akira Kurosawa in 1963 with High or Low. In the opening credits to Lee's film, both are cited as source material. All three versions present a wealthy businessman on the brink of a major professional gamble, who is forced to pivot his focus — and funds — when a kidnapper abducts his son. However, Fox making his businessman a record exec who focuses on developing Black artists gives new dimension to this story. By making King's business one of preserving Black culture and uplifting Black voices, Fox's script gives richer texture to his conflict. Surrendering the money means his business deal is dead, so to save his son, he risks sacrificing his professional legacy — if the cops can't catch the kidnappers. Of course, his son is also his legacy. But what will David do when it turns out that the kidnappers grabbed the wrong kid? Will he pay $17.5 million, potentially going broke and handing over his company in the process, for his godson Kyle (Elijah Wright)?While David, his wife Pam (Ilfenesh Hadera), and his rattled son Trey (Aubrey Joseph) discuss this matter in their lavish high-rise apartment — which suddenly seems less untouchable — they speak with an eerie calm. Speaking in stilted delivery, David and his family seem numb to the gravity of their situation. Maybe they are shocked that something so low and criminal can touch them all the way up here. Or perhaps this composure, strange as it is, is constructed, a presentation for the public — the police — who've invaded their home. Maybe the social pressure to keep cool has even impacted how they react in front of each other.There's little yelling. In fact, when Trey shouts at his father, demanding the ransom be paid for his friend, the teen is scolded for the tone he's taken toward his father. As this goes on, a campaign poster for Kamala Harris hangs on the wall behind them. The reminder to be excellent and smiling even in the face of defeat and indignity is everywhere. Their apartment is elegantly decorated with icons of Black culture, framed copies of books by Maya Angelou and Zora Neale Hurston, paintings, including some of Black pro athletes, and photographs of Stevie Wonder, James Brown, and Aretha Franklin, alongside cover photos of David King himself. The Kings celebrate and represent Black excellence in their work, their charity, and their home. But is that all just talk if David won't risk his wealth to save Kyle? To answer that question, Lee — as the title suggests — will leave the high-rise to go down, down, down, to the subways of New York City. Naturally, the 4 train to the Bronx is where the handoff is supposed to happen. When Highest 2 Lowest cuts to the chase, Lee has us by the throat. \n\n Denzel Washington rides the subway in \"Highest 2 Lowest.\"\n Credit: A24\n\nThe film starts slow, purposefully so. The first act drama is all about contracts and high-minded debates about purpose. But once David straps on a backpack full of millions to pay off the abductors, Lee hits his rhythm with purpose, delivering a street-smart, character-driven journey through New York City. Washington sheds the high-priced suits for an almost incognito look of all-black casual wear topped with a ball cap. As the train fills with Yankees fans, rowdy for game day, the soundtrack becomes diegetic, through the rousing music from the Puerto Rican Day Parade (with a cameo from Do the Right Thing's Rosie Perez as herself!) happening below the now-elevated train. The energy of all this activity is propulsive, driving not only the plot forward, but also pulling audiences to the edge of their seats. When all the carefully laid plans of the Kings and the cops go south, my audience rippled with gasps and even a handful of shouts. Lee had effectively made us bystanders on that train, invested in the drama like it was our own. And everything that comes after is Lee relishing the absolute chokehold he has on his audience — even after the kidnapped teen is recovered.Rather than returning King to business as usual, King is on a quest to reclaim what he lost, and understand why he lost it to begin with. This pulls him out of the facade of control that was his offices, and plunges him onto his old stomping grounds in the Boogie Down Bronx, alongside his friend/driver (a simmering Jeffrey Wright) with a gun on his hip and a showdown with a mysterious rapper called Yung Felon (played by A$AP Rocky) ahead of him. A$AP Rocky and Denzel Washington are fire together. \n\n A$AP Rocky plays Yung Felon in \"Highest 2 Lowest.\"\n Credit: A24\n\nWithout giving too much of the plot away, King and Felon are destined to come face to face. Where one came from the heights of a high-rise, the other's recording in a grimy basement studio. But both are gamblers who made music their biggest risk, and it's ultimately put them at odds. Rocky, who also has a role in this year's If I had Legs I Would Kick You, is mesmerizing as this ferocious rapper, spitting bars with the same confidence he exhibits while slinging insults at Washington's King. Washington meets his intensity, but not his energy. The power dynamic favors the older man, and so Washington leans into a condescending calm, a king on a throne staring down at a fool.Rocky and Washington are extraordinary, channeling passion, rage, and self-righteousness into explosive exchanges both personal and political. These two deliver some of the best scene work in a movie this year. But it wouldn't hit as hard as it does if it weren't for Lee's careful construction of the film's first act. To appreciate where David ends up, you have to understand where he was when we first met him.See, beyond his business, his family, and his legacy, David is at his core struggling to recapture his passion for the music. It's a problem his wife identifies during a scolding on the balcony in act one. But it's a dissonance that Lee sets up with the opening song. Though King's whole career has been dedicated to Black artists in rap and R&B, the song that plays over the movie's first moments — when we first see King high up on his Brooklyn balcony overlooking the Manhattan skyline — is \"Oh, What A Beautiful Mornin',\" the cheerful farmer tune from Rodgers and Hammerstein's Oklahoma! Its folksy attitude clashes with the iconic views of New York City's urban landscape of glass and steel. The jaunty singing of cowboy-hatted Gordon MacRae is willfully jarring against the stony expression of David King in his sharply tailored suit. It's genuinely funny — though not as funny in the deeply NY way as Lee's later swipes at the Celtics and charming dad jokes about \"Jake from State Farm.\" Lee begins by pushing the viewer off-balance with this earnest, out-of-place song, because music mogul David King is so out of touch with his own musical inspirations at this moment. It's not until King is back on the streets that he can reconnect with that passion, that energy of New York that Lee captures so well. And there's a twisted pleasure in Washington's performance, recognizing this thrill even as the hunger for it could ruin King's whole realm. Lee is incredible. With Highest 2 Lowest, he richly reimagines Kurosawa's film within his own lens, showcasing Black pride and New York pride with great joy. With this, Lee grants Washington the room to move, taking big swings as his character does, and delivering one of his best performances in a decade. To that, Rocky and the ensemble bring an intoxicating vibrancy, especially in the film's second half. All of this builds to create an ending that will make you want to stand up and cheer. This is a journey. This is a ride. Highest 2 Lowest is Lee and Washington, reunited and good as ever. Highest 2 Lowest opens in theaters on Aug. 15, debuting on Apple TV+ Sept. 5.","summary":"With \"Highest 2 Lowest,\" Spike Lee plus Denzel Washington equals pulse-pounding cinema. Plus, A$AP Rocky enters his movie star era. Review.","url":"https://mashable.com/article/highest-2-lowest-review","image":"https://helios-i.mashable.com/imagery/articles/00mVqVv6XkrjU4h411KyS5P/hero-image.fill.size_1200x675.v1755201077.jpg","video":null,"publish_date":"2025-08-15 09:00:00","author":"Kristy Puchko","authors":["Kristy Puchko"],"language":"en","category":"politics","source_country":"us","sentiment":0.381},{"id":351274970,"title":"Taylor Swift Breaks A Record Previously Held By Trump, And She Did It In Just An Hour","text":"We’re sure there will be bad blood.\n\nTaylor Swift has broken a record previously held by Donald Trump.\n\nOn Wednesday, the Grammy winner made a much-hyped apperance on the New Heights podcast hand-in-hand with her boyfriend and co-host Travis Kelce, as his older brother, Jason Kelce, interviewed her for a little over two hours.\n\nA day later, the Daily Beast reported that 1.3 million viewers tuned to watch the podcast episode on YouTube within the first hour that it was online, a figure which the outlet noted had been confirmed by reps for the Shake It Off singer.\n\nThis figure trumps the record previously held by Trump. His appearance on the Joe Rogan Experience in October 2024 saw 800,000 people tune in within the first hour, according to CNN data analyst Harry Enten.\n\nCNN host Kate Bolduan also noted Wednesday Taylor’s interview on New Heights is “already on track to become one of the most watched podcasts of all time”.\n\nTrump will likely be pretty peeved about Taylor mopping him up. The president expressed hostility towards the Blank Space singer after she publicly endorsed Kamala Harris in the build-up to the 2024 presidential election. \n\n“I HATE TAYLOR SWIFT,” he wrote in all caps on his Truth Social platform at the time.\n\nIn May, the president proved he was no Swiftie yet again when he published another post on Truth Social that read: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’”\n\nWe suppose that at least 1.3 million people think otherwise...","summary":"President Donald Trump and Taylor Swift.We’re sure there will be bad blood.\n\nTaylor Swift has broken a record previously held by Donald Trump.\n\nOn Wednesday, the Grammy winner made a much-hyped apperance on the New Heights podcast hand-in-hand with her boyfriend and co-host Travis Kelce, as his older brother, Jason Kelce, interviewed her for a little over two hours.\n\nA day later, the Daily Beast reported that 1.3 million viewers tuned to watch the podcast episode on YouTube within the first hour that it was online, a figure which the outlet noted had been confirmed by reps for the Shake It Off singer.\n\nThis figure trumps the record previously held by Trump. His appearance on the Joe Rogan Experience in October 2024 saw 800,000 people tune in within the first hour, according to CNN data analyst Harry Enten.\n\nCNN host Kate Bolduan also noted Wednesday Taylor’s interview on New Heights is “already on track to become one of the most watched podcasts of all time”.\n\nTrump will likely be pretty peeved about Taylor m","url":"https://www.huffingtonpost.co.uk/entry/taylor-swift-breaks-donald-trump-record-podcast_uk_689ee57de4b0df16e32c27ca","image":"https://img.huffingtonpost.com/asset/689e5c001800009a1b8c5712.jpeg?ops=1200_630","video":null,"publish_date":"2025-08-15 07:48:23","author":"Donald Trump,Elyse Wanshel","authors":["Donald Trump","Elyse Wanshel"],"language":"en","source_country":"gb","sentiment":0.033},{"id":351436994,"title":"Time for Democrats to fight fire with fire vs. Republicans","text":"Gee, what’s happened to the “silly season” of U.S. politics?\n\nThat’s what many of us in the daily journalism trade used to call the periods, usually in late summer or near holidays, when news media put an unusually intense focus on lighthearted or frivolous stories due to a shortage of more serious news.\n\nWe currently have no such shortage. Even late-breaking investigations and speculation surrounding the suicide of President Trump’s late friend Jeffrey Epstein have had to compete with a ferocious partisan war within some of the states over redistricting.\n\nConsider Texas, where Republicans in the state legislature are attempting, at President Donald Trump’s urging, to redraw congressional districts in order to flip five more districts to Republican majorities. Democratic legislators have fled the state to deny the legislature a quorum, in hopes of preventing Republicans from carrying out their plan.\n\nSome have taken refuge in Illinois, leading Texas Republicans to call for their arrest by the FBI. Illinois Gov. J.B. Pritzker has vowed to protect them.\n\n“Donald Trump is trying to steal five seats from the people — frankly, of the country, not just the people of Texas — and disenfranchise people,” Pritzker said on “The Late Show with Stephen Colbert.” “We’re talking about violating the Voting Rights Act and the Constitution.”\n\nPritzker also declined to turn away from the possibility of a mid-decade congressional remap in his own state. He told Colbert: “It’s possible. I’ve said everything is on the table. We’ve gotta fight fire with fire.”\n\nAre we starting to see the hardball attitude that many frustrated Democrats have been urging their national party to adopt?\n\nStill smarting from the debacle of Joe Biden’s 2024 candidacy and the subsequent defeat of the Kamala Harris-Tim Walz ticket, Dems appear increasingly ready to face a real threat to their ability to regain power in 2026 and beyond.\n\nFor their part, Republicans are not trying to hide their determination to gerrymander their way out of a midterm backlash in November 2026. Vice President JD Vance visited Indiana to urge lawmakers to redraw their congressional map. It’s already a reliably Republican-voting state, but it appears the GOP wants to leave nothing to chance.\n\nI find it to be no small irony that these battle lines are forming on the 60th anniversary of the 1965 Voting Rights Act. Some of us are old enough to remember the feeling that a new page in American history had been turned when that law was enacted. We believed that it would finally end the denial and dilution of Black voting power.\n\nThat dream, once won, now must be defended once again. Frankly, it’s been a never-ending chore. The last time House Democrats held the majority, they introduced a sweeping package of good-government reforms, including a centerpiece legislation to end partisan gerrymandering.\n\n“The people should choose their politicians,” then-Speaker Nancy Pelosi said in 2021 before the House passed the For the People Act, which would later die in the Senate. “Politicians should not be choosing their voters.”\n\nOf course, choosing their voters is precisely what Trump and Republican legislatures intend to do. Trump’s team has pushed Republicans to redraw maps “wherever redistricting is an option.”\n\nDemocrats can’t afford to respond with anything less. Indeed, some Democrats, such as California Gov. Gavin Newsom, are switching from their past lofty positions in favor of bipartisan redistricting commissions to embracing the idea of fighting fire with fire.\n\nPelosi, who remains a member of the U.S. House, said that while Democrats favor nationwide independent commissions to draw congressional district maps, they “cannot and will not unilaterally disarm.”\n\nRecent polling trends show eroding support for Trump’s actions and policies, which can be aptly summed up as “reverse Robin Hood” with a police-state sideshow. This is especially the case among independents, but is noticeable even among Republicans, many of whom no doubt realize their president is off the chain.\n\nA big opportunity is opening for challengers who can show voters sanity, humanity and the backbone to stand up to the schoolyard bully in the Oval Office. And Democrats have shown before that they can rise from the slough of despond to win an electoral mandate.\n\nThis normally silly season has turned sinister, and the stakes to Democrats are existential. Their first step in winning back voters is showing they’re willing to fight.\n\n— Clarence Page, a Pulitzer Prize winner for commentary, is a syndicated columnist with Tribune Content Agency.","summary":"Gee, what’s happened to the “silly season” of U.S. politics?","url":"https://www.virginislandsdailynews.com/opinion/time-for-democrats-to-fight-fire-with-fire-vs-republicans/article_b0776f9b-1c39-4395-8672-64e9c46891db.html","image":"https://bloximages.newyork1.vip.townnews.com/virginislandsdailynews.com/content/tncms/custom/image/95b63ab2-a8b4-11e5-8204-cfb6801a818b.jpg?resize=600%2C315","video":null,"publish_date":"2025-08-15 07:00:00","author":"Blox Content Management","authors":["Blox Content Management"],"language":"en","category":"politics","source_country":"vi","sentiment":-0.209},{"id":351293772,"title":"Nigel Farage’s Trump-Vance delusion","text":"JD Vance is on holiday, but it looks more like a diplomatic mission to spread Maga cheer deep into the British right. Images of him spending an evening in the Cotswolds with former Apprentice contestant and rumoured Reform candidate for Mayor of London, Thomas Skinner, have struck many as odd.\n\nBut Vance has form here, adding to his Amazon Wishlist all the Brits he would like at his political picnic: Robert Jenrick, Nigel Farage, Danny Kruger, Chris Philp. I wonder if they appreciate just how unpopular Vance and Trump are to their British audiences. \n\nVance is touring a Britain that, were it a US state, would have voted for Kamala Harris by more than California, 68 to 32 per cent. Current British feeling towards the US president is weak. Vance is less well known. But he still has a net favourability score of -44 among Brits.\n\nA more recent YouGov poll puts Trump’s favourables at just 16 per cent. On paper, Farage shouldn’t be anywhere near to someone so unpopular as Trump. You wouldn’t think it wise to peg your movement to one so roundly disliked.\n\nBut I return to the important distinction between voter instincts; the electorate can be broadly split into those of a “shake things up” mentality and those who are better described under the phrase “steady as she goes”. Reform voters unsurprisingly fit into the former distinction. It explains why so few of them (1 per cent) look upon Starmer in a positive light. This also explains why a majority of them like Trump too, even if 41 per cent of them don’t.\n\nMeanwhile, the current Labour government could be making a much bigger deal of this close association. It would deal dividends among their anti-Trump base. \n\nTrump is a reason many voters are reluctant to come out for Reform. And this, it appears, is something the likes of Farage and Skinner are blind to. \n\n[See also: Rachel Reeves’ road to recovery]","summary":"Plenty of Reform voters are put off by the party’s association with the American government.","url":"https://www.newstatesman.com/politics/polling/2025/08/farages-trump-vance-delusion","image":"https://dl6pgk4f88hky.cloudfront.net/2025/08/14/GettyImages-2229011879.jpg","video":null,"publish_date":"2025-08-15 05:00:00","author":"Ben Walker","authors":["Ben Walker"],"language":"en","source_country":"gb","sentiment":0.245},{"id":351218110,"title":"‘Next to go’: Kimmel’s bold move after Trump’s latest attack","text":"The late-night host confirmed the move on The Sarah Silverman Podcast, revealing he secured went down the path of setting up an exit strategy in the wake of Donald Trump’s “unbelievable” re-election.\n\n“I did get Italian citizenship,” Kimmel said. \n\n“What’s going on is as bad as you thought it was gonna be. It’s so much worse - it’s just unbelievable. \n\n“I feel like it’s probably even worse than he would like it to be.”\n\nHis comments come just weeks after Trump publicly celebrated the axing of The Late Show with Stephen Colbert, and not-so-subtly suggested Kimmel would be next.\n\n“I absolutely love that Colbert got fired. His talent was even less than his ratings.\n\n“I hear Jimmy Kimmel is next. Has even less talent than Colbert!” Trump wrote on Truth Social. \n\nHe doubled down days later, adding: “The word is, and it’s a strong word at that, Jimmy Kimmel is NEXT to go in the untalented Late Night Sweepstakes and, shortly thereafter, Fallon will be gone.”\n\nColbert responded by telling Trump to “go f**k yourself”.\n\nThe Late Show will go off the air in May 2026 following a surprise announcement by broadcaster CBS. \n\nThe channel is part ofParamount,which is in the throes of an $US8 billion ($A12.3 billion) takeover that requires approval by the Trump-controlled Federal Communications Commission.\n\nIt pulled the plug three days after Colbert skewered CBS for settling a lawsuit with Trump.\n\nHe accused it of paying what he termed “a big fat bribe” of $US16 million ($A24.6 million) to the president for what he called “deceptive” editing of an interview with his 2024 election opponent, former vice president Kamala Harris.\n\nKimmel, a long-time critic of Trump, hasn’t backed down. \n\nOn the podcast, he spoke about the importance of supporting those who’ve changed their minds about the former president, including previous backers like Joe Rogan.\n\n“Now you see these clips of Joe Rogan saying, ‘Why is he doing this? Why are you deporting people?’ And people go, ‘F**k you! You supported him.’ I don’t buy into that,” Kimmel said.\n\n“The door has to stay open. If you want to change your mind, that’s so hard to do. \n\n“If you want to admit you were wrong, that is so hard and so rare to do. You are welcome.”\n\nItalian news agency ANSA confirmed that Kimmel had acquired citizenship through his ancestral lineage. \n\nSpeaking at an Italian Republic Day event in Los Angeles in June, Kimmel shared more about his roots.\n\n“I have just obtained citizenship, thanks to my beloved grandmother Edith, whose family came from Candida, in the province of Avellino,” he said.\n\n“She used to repeat to me, ‘You have the brain of a hamster’!”\n\nHis grandfather’s family emigrated from the island of Ischia after an 1883 earthquake claimed most of their relatives.\n\nAnd Kimmel’s not alone - other stars are also eyeing an escape route since Trump’s comeback. \n\nRosie O’Donnell relocated to Ireland in January, and Ellen DeGeneres recently confirmed she and her wife, Portia de Rossi, have moved to the UK.\n\n“It’s clean,” DeGeneres said of their new home. \n\n“Everything here is just better - the way animals are treated, people are polite. I just love it here.” \n\nShe also voiced concern about the future of LGBTQ+ rights in the US, adding that she and De Rossi may remarry in the UK if same-sex marriage is overturned.\n\nNot everyone believes Kimmel is serious, and plenty online reactions have criticised his “privileged” decision:\n\n“Jimmy had to make a EUR 500,000 (minimum) investment in real estate or an Italian startup to do this… I think Democrats call this white privilege.”\n\n“Oh, look at Jimmy Kimmel, securing his Italian citizenship like it’s a backstage pass to a gelato festival... another Hollywood hero bravely retreating to a villa.” \n\n“Enjoy that 50 per cent exit tax.”\n\nBut regardless, he’s got a fresh passport, just in case.","summary":"Late-night host Jimmy Kimmel has made a major decision amid rising tensions with US President Donald Trump.","url":"https://www.news.com.au/entertainment/celebrity-life/next-to-go-kimmels-bold-move-after-trumps-latest-attack/news-story/8f4dee34f20c7b75d724573938aaaab0?from=rss-basic","image":"https://content.api.news/v3/images/bin/39d176e31c68018c4456294d879bafde","video":null,"publish_date":"2025-08-15 04:45:43","author":"Carly Wright","authors":["Carly Wright"],"language":"en","category":"politics","source_country":"au","sentiment":-0.071},{"id":351195086,"title":"Virginia Democrat Abigail Spanberger declines CNN's invitation to debate Republican in gubernatorial race","text":"Former Rep. Abigail Spanberger, D-Va., declined CNN's invitation to hold a debate between herself and her GOP rival, Virginia Lt. Gov. Winsome Earle-Sears, for the commonwealth's gubernatorial race. CNN had invited both candidates for a debate to be held in late September or early October. Only Earle-Sears accepted the invitation. According to her campaign, Spanberger wants only local outlets to host debates rather than national ones like CNN. \"We have declined an offer to participate in a debate hosted by CNN in order to prioritize Virginia broadcasters and ensure the focus remains squarely on issues impacting Virginia,\" Spanberger campaign manager Samson Signori said in a statement to CNN. \"We believe that debates about Virginia’s future should be rooted in Virginia, produced by Virginia media, and accessible to Virginians across the Commonwealth — which is especially important after Winsome Earle-Sears declined a debate that featured three Virginia broadcast partners.\" VIRGINIA DEM GUBERNATORIAL CANDIDATE AND EX-CIA OFFICER TOOK $50K FROM CCP-LINKED TYCOON Her campaign said it was in \"active negotiations\" with WAVY-TV and Northfolk State University to host a debate. \"Abigail Spanberger turning down a CNN debate is beyond absurd. It’s proof she’s terrified of facing voters in an unscripted setting,\" Earle-Sears Press Secretary Peyton Vogel told Fox News Digital. \"In 2022, she infamously pulled out at the last minute. Now she’s running from CNN, one of the friendliest stages she could ask for.\" \"If she’s too afraid to show up there, what’s she hiding from? She can either step on that stage with Winsome Earle-Sears and defend her record or admit to Virginians that she can’t,\" Vogel added. TRUMP VOICES SUPPORT FOR GOP GUBERNATORIAL CANDIDATE, ADMITS SHE HAS ‘TOUGH RACE’ Polls have shown Spanberger maintaining a lead against Earle-Sears. The Decision Desk HQ's average of polls has shown the former Democratic lawmaker with 45% support among Virginia voters, while the Republican is behind with 36%. Democrat Kamala Harris won the state by five points in the 2024 presidential contest. In 2021, one debate rocked the Virginia gubernatorial race. Former Democratic Virginia Gov. Terry McAuliffe was pressed by then-Republican challenger and current Gov. Glenn Youngkin over his decision to veto a bill that would have allowed parents to be informed about materials provided in Virginia schools. \"I'm not going to allow parents to come into schools and actually take books out, make their own decision,\" McAuliffe defended the veto. \"Yeah, I stopped the bill that – I don't think parents should be telling schools what they should teach.\" CLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS CLICK HERE FOR THE FOX NEWS APP The exchange lit up social media with critics calling McAuliffe's comment an \"unforced error\" and a costly gaffe. Youngkin went on to triumph in the election, becoming the first Republican to win the Virginia governor's mansion since 2009. He is ineligible to run in 2025 since state law prevents governors from serving consecutive terms.","summary":"Former Rep. Abigail Spanberger, D-Va., declined CNN&apos;s debate invitation as part of Virginia&apos;s gubernatorial race, citing that she believes local outlets should host debates instead.","url":"https://www.foxnews.com/media/virginia-democrat-abigail-spanberger-declines-cnns-invitation-debate-republican-gubernatorial-race","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/earle-sears-spanberger-split-2.jpg","video":"https://www.foxnews.com/video/6371304770112","publish_date":"2025-08-15 02:04:25","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.013}]}