{"offset":0,"number":50,"available":360,"news":[{"id":327136402,"title":"In the aftermath of Trump's victory, California Democrats vow to remain firm on their values","text":"In the aftermath of Democrats’ widespread electoral failures last year, party activists in California who gathered for their annual convention this weekend struggled with balancing how to stick to their values while also reconnecting with voters who were traditionally part of their base — notably working-class Americans. California's progressive policies and its Democratic leaders were routinely battered by Republicans during the 2024 election, with then-vice president and Democratic presidential nominee Kamala Harris taking the brunt of it. Harris ultimately lost the election to Trump, partly because of shrinking support among traditional Democratic constituencies, including minorities and working-class voters. “We got to be honest in what happened, because losing elections has consequences,” said Minnesota Gov. Tim Walz, Harris’ running mate, during a rousing speech Saturday afternoon. “We're in this mess because some of it's our own doing. … None of us can afford to shy away from having hard conversations about what it's going to take to win elections.” Walz, a potential 2028 presidential candidate, said Democrats don't need to retreat from their ideals, such as protecting the most vulnerable in society, including transgender children. But they need to show voters that they are capable of bold policy that will improve voters’ lives rather than delivering incremental progress, he said. “The Democratic Party, the party of the working class, lost a big chunk of the working class,” he said. “That last election was a primal scream on so many fronts: do something, do something, stand up and make a difference.” California is home to the most Democrats in the nation as well as a large number of the party’s most deep-pocketed donors, making the state a popular spot for presidential hopefuls from across the country. In addition to Walz, another potential 2028 White House candidate who addressed the 4,000 delegates and guests at the Anaheim Convention Center was New Jersey Sen. Cory Booker. Booker argued that Democrats must remember the courage of their ancestors who fought for civil and voting rights and created the social safety net for the most vulnerable Americans as they try to fight Trumpism. “Real change does not come from Washington. It comes from communities. It comes from the streets,” he said in a Saturday morning speech. “The power of the people is greater than the people in power.” Harris, who is weighing a 2026 gubernatorial run and is also viewed as a potential 2028 presidential candidate, addressed the convention by video. Gov. Gavin Newsom, also viewed as a possible White House contender, did not appear at the convention. Delegate Jane Baulch-Enloe, a middle school teacher from Pleasant Hill in the Bay Area, said she wasn’t sure that California’s particular brand of liberalism will sell on the national stage. “I don’t know if a California Democrat can win a presidential election,” she said as she and her daughter sorted through swag and campaign fliers in the convention cafe. “California is thought of as the crazy people. ... I don’t mean that in a bad way — though I know some people do — but we do things differently here.” She said she learned from President Obama’s memoir, “Audacity of Hope,” that most, if not all, Americans “want the same things,” but talk about them differently and have different approaches for getting there. California Democrats, Baulch-Enloe said, “need to get people on our side and help them understand that we aren’t just wacko liberals, and teach people that it’s okay to want things” like healthcare for all and high union wages. But the 2028 presidential race was not the focus of this year’s California Democratic Party convention. Delegates were more concerned about last year’s presidential and congressional losses — though California was a rare bright spot for the party, flipping three districts held by the GOP — and preparing for next year’s midterm elections. Delegates hope Democrats will take control of Congress to stop Trump from enacting his agenda. Aref Aziz, a leader of the party's Asian American Pacific Islander caucus, said the party needed to sharpen its messaging on economic issues if they want to have a chance of victory in coming elections. “When it comes to the affordability issue, when it comes to economics, those are the things that across the broad spectrum of our coalition, all those things matter to everybody,” Aziz said. “And what really is, what really is important is for us to focus on that economic message and how we're going to improve the quality of life for everyone in these midterm elections and future presidential elections.” He noted he was in France on his honeymoon recently, and was strolling through a grocery store and buying half a dozen eggs for 1.50 euros (the equivalent of $1.70) when the news broke that California’s economy had grown to the fourth largest in the world. “When you look at a lot of our economies, California and New York, by all accounts, GDP, the numbers that you look at, they're doing great,” he said. “But when it comes to the cost that consumers are paying in these places, they're so high and so far above other countries that we end up diminishing whatever value there is in our GDP, because everything's so expensive.” Some Democrats questioned the impact of the weaponization of California's liberal policies, including defending transgender rights, on voters in battleground states in 2024. But delegates and party leaders largely argued that the state needs to continue to be on the vanguard of such matters. “People like to point a finger somewhere, and I think California is an easy target, but I disagree,” said delegate Melissa Taylor, president of Foothill Community Democrats. \"Because I think that California is standing up for values that the Democratic Party believes in, like we believe in labor, we believe in healthcare, we believe in women's rights, we believe in rights for LGBTQ people.\" Jodi Hicks, the president of Planned Parenthood Affiliates of California, said issues such as reproductive healthcare access also have an economic impact. \"We have to walk and chew gum at the same time,\" she said, adding that the party's 2024 losses were likely prompted by multiple factors, including Harris' being the Democratic nominee for a little over three months after then-President Biden decided not to seek reelection. \"We're going to be analyzing 2024 for a very long time,\" Hicks said. \"It was such unique circumstances.\" Times staff writer Laura J. Nelson contributed to this report.","summary":"California Democrats say their party must stay committed to their values protecting the most vulnerable, while also honing their economic messaging to win back voters they lost last year.","url":"https://www.latimes.com/politics/story/2025-06-01/california-democrats-walz-booker-harris-newsom","image":"https://ca-times.brightspotcdn.com/dims4/default/56d83bf/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F75%2F17%2Fc48681dc4e1099e403e9846875c7%2F1508550-pol-me-cadem","video":null,"publish_date":"2025-06-01 22:26:22","author":"Hannah Fry,Seema Mehta","authors":["Hannah Fry","Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.047},{"id":327136404,"title":"With Harris on the sideline, top Democratic candidates for California governor woo party loyalists","text":"California's most loyal Democrats got a good look this weekend at the wide field of gubernatorial candidates jockeying to replace Gov. Gavin Newsom at the state Democratic Party's annual convention in Anaheim, with a few chiding former vice president and potential rival Kamala Harris. The Democrats running for governor in 2026 hurried among caucus meetings, floor speeches and after-parties, telling their personal stories and talking up their bona fides for tackling some of California's most entrenched problems, including housing affordability and the rising cost of living. All the hand-shaking and selfies were done in the absence of Harris, who would be the most prominent candidate in the race, and who has not said whether she'll run for governor in 2026 or seek the White House again in 2028. The most visible candidates at the convention were former state Senate President Pro Tem Toni Atkins, former U.S. Secretary of Health and Human Services Xavier Becerra, businessman Stephen J. Cloobeck, Lt. Gov. Eleni Kounalakis and former state Controller Betty Yee, with former Rep. Katie Porter, state Supt. of Public Instruction Tony Thurmond and former Los Angeles Mayor Antonio Villaraigosa taking less prominent roles. With the primary still a year away, the gubernatorial race is still in limbo. Two prominent Republicans are also in the race: Riverside County Sheriff Chad Bianco and former Fox News commentator Steve Hilton. Many Democratic activists, donors and elected officials said they were waiting to make up their minds until Harris makes up hers, because her entry into the governor's race could push some candidates off the ballot or into other statewide races. \"People are kind of waiting to see what she’s going to do,\" said Matt Savage, a delegate from San Jose, as attendees ate chia seed pudding and breakfast burritos at a breakfast hosted by Yee. \"She needs to decide soon.\" Yee told the crowd: \"Regardless of who gets in the race, we're staying in.\" Surrounded by canvassers who chanted his name as he talked, Cloobeck, a political newcomer, scolded Harris for not coming to the gathering of Democrats after her loss to President Trump in the November presidential election. \"If she decides to get in this race, shame on her for not showing up for the most important people in the party, which is the people who are here today,\" Cloobeck said. \"And if she doesn't have the IQ to show up, she's tone deaf once again.\" In a three-minute recorded video, Harris told Democrats that with Republicans working to cut taxes for the rich and dismantle efforts to fight climate change, \"things are probably going to get worse before they get better.\" \"But that is not reason to throw up our hands,\" Harris said. \"It's a reason to roll up our sleeves.\" Polling shows that if Harris were to run for governor, she would have a major advantage: A November survey from the UC Berkeley Institute of Governmental Studies, co-sponsored by The Times, found that about 72% of Democrats would be very likely or somewhat likely to consider voting for her. Cloobeck said his campaign had spent \"probably a couple hundred thousand dollars\" on the canvassers, who wore royal blue shirts emblazoned with his name and distributed glossy invitations to a comedy night with \"Roastmaster General\" comedian Jeff Ross. One canvasser said he was paid $25 an hour and found the job on Craigslist. At the party's LGBTQ caucus meeting, Atkins, the only well-known gay candidate in the race, told the cheering crowd that she dreamed of making California work for others the way it had worked for her. Atkins, 62, was raised in southwest Virginia by a coal miner and a garment worker and moved to San Diego in her 20s. \"California has given me every opportunity,\" Atkins said. \"I want that promise to be true for everyone.\" At the Latino caucus, Villaraigosa said that the Democratic Party needs to focus on the affordability crisis facing working-class Californians, many of whom are Latinos, by tackling high gas prices, home prices, utility costs and other day-to-day cost of living challenges. Villaraigosa, 72, has been out of elected office for more than a decade. He last ran for for governor in 2018, placing a distant third in the primary behind Newsom and Republican businessman John Cox. He noted that he also lost the 2001 mayor's race before winning in 2005. \"Sometimes it takes two times,\" Villaraigosa said to the caucus. \"We're ready, we're not invisible. We're going to stand up for working people and our communities.\" Thurmond told the crowd during the party's general session on Friday afternoon that education is \"the centerpiece of our democracy.\" It brought his grandparents to the U.S. and saved his life after his mother died when he was 6, he said. \"We must continue to be the resistance against Donald Trump’s misguided policies,\" he said. \"We will ensure that every student in this state has access to good quality education. And while we’re at it, we will not allow for ICE to be on any of our school campuses.” Four candidates made brief appearances before the party's powerful organized labor caucus, trying to make the case that they would be the best choice for the state's more than 2.4 million union members. In a 45-second speech, Cloobeck told the union members that he used union labor in his hotel development projects and promised that if he were elected, he would support workers getting \"full pay, full wages\" if they went on strike. Yee said she'd \"protect and advance your precious pension funds.\" She took a passing shot at Newsom's now-infamous dinner at the French Laundry in Napa Valley during the COVID-19 pandemic. Newsom attended a lobbyist's birthday party at the upscale restaurant after he had pleaded with Californians to stay home and avoid multifamily gatherings. \"I'm not about gimmicks,\" Yee said. \"I'm the least flashy person. Hell, I've not even stepped foot in the French Laundry — but I can tell you, I grew up in a Chinese laundry.\" Kounalakis told the party's labor meeting that her father immigrated to the U.S. at age 14 and worked his way through college as a waiter at the governor's mansion before building a successful development company in Sacramento. Her vision of California's future, she said, is massive investment in water infrastructure, clean energy infrastructure, roadway infrastructure and housing: “We’re going to build the future of this state, and we’re going to do it with union labor.\" At the party's senior caucus meeting, Becerra told Democrats that he was raised by working-class, immigrant parents who bought their own home in Sacramento, then questioned whether a couple without college degrees could do the same today. He touted his experience fighting GOP efforts to cut Social Security Disability Insurance as a member of Congress and work lowering drug costs as President Biden's health chief. \"We're going to fight for you,\" Becerra said. At the women's caucus, Porter, who left Congress in January after losing a run for Senate, said she was concerned that Trump's budget cuts and policies will have a disproportionate impact on mothers, children and the LGBTQ+ community. \"That s— is not happening on my watch,\" Porter said. Ann McKeown, 66, president of the Acton-Agua Dulce Democratic Club in Los Angeles County's High Desert, said she had wanted Harris to be the president \"so badly,\" but Porter is her top choice for governor. \"Kamala is nicer than Katie Porter,\" McKeown said, \"and we don't need nice right now.\" Delegate Jane Baulch-Enloe of Contra Costa County and her daughter spread the contents of their bag of Democratic Party swag across a table, taking stock of the flyers and campaign memorabilia, including a Becerra for Governor button, a clear plastic coin purse from Yee and a blue Thurmond bookmark that read, \"Ban fascism, not books.\" Baulch-Enloe, who teaches middle school English and history, said she originally thought she'd support Thurmond because he understands education. \"But now that there’s so many people in the race, I’m not sure,\" Baulch-Enloe said.","summary":"California's most loyal Democrats got a good look this weekend at the wide field of gubernatorial candidates jockeying to replace Gov. Gavin Newsom at the state Democratic Party's annual convention in Anaheim.","url":"https://www.latimes.com/politics/story/2025-06-01/california-democrats-gubernatorial-candidates","image":"https://ca-times.brightspotcdn.com/dims4/default/af31e0f/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0d%2F15%2Fc31f35a94f58bc582d50b8c1b6ca%2F1508550-pol-me-cadem","video":null,"publish_date":"2025-06-01 21:56:31","author":"Hannah Fry,Laura J. Nelson,Seema Mehta","authors":["Hannah Fry","Laura J. Nelson","Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":0.062},{"id":327127120,"title":"Bill Clinton Makes Strong Claim About Joe Biden’s Cognitive Health","text":"Former President Bill Clinton said former President Joe Biden was “on top” of things when he was asked about Biden’s alleged cognitive decline during an interview on “CBS Sunday Morning.”\n\nWhile speaking with correspondent Tracy Smith, Clinton was asked about the bombshell book “Original Sin” written by CNN’s Jake Tapper and Axios journalist Alex Thompson, which claims that Biden’s aides covered up the politician’s declining cognitive and physical health during his ill-fated reelection campaign. \n\nA Biden spokesperson acknowledged in a statement to Axios last month that “there were physical changes as [Biden] got older,” but insisted that “evidence of aging is not evidence of mental incapacity.”\n\nAfter Smith asked Clinton if he had ever had “a moment with [Biden]” where he felt that he was “unfit to run for president,” Clinton responded, “No. I thought he was a good president.”\n\n“The only concern I thought he had to deal with was, could anybody do that job until they were 86?” Clinton continued, referring to Biden’s age. “We’d had several long talks. I had never seen him and walked away thinking ‘he can’t do this anymore.’”\n\nClinton added: “He was always on top of his briefs.”\n\nSmith then pressed Clinton, asking again if he ever witnessed any cognitive decline in Biden, prompting Clinton to firmly reply “no.”\n\nSharing that he saw Biden “not very long ago,” Clinton said that he “thought he was in good shape.”\n\nClinton went on to reveal that he didn’t read Tapper and Thompson’s book because he believes that some people are using it as a “way to blame” Biden for Trump being reelected for a second presidency term. \n\n“I didn’t want to because he’s not president anymore, and I think he did a good job,” Clinton explained. “And I think we are facing challenges today with our president in our history. Some people are trying to use this as a way to blame him for the fact that Trump was reelected.”\n\nBiden’s health was a major concern among voters while he was in the White House, particularly following his disastrous debate performance in June 2024 while seeking reelection. \n\nBiden eventually withdrew his candidacy for a second term, with then-Vice President Kamala Harris taking over as the democratic presidential nominee. Harris lost to Republican nominee Trump, who returned to the White House for a second term in January 2025. \n\nLast month, Biden announced that he was diagnosed with an aggressive form of prostate cancer. The announcement subsequently sparked further questions about what health issues the former president was potentially battling while he was in the White House. \n\nWatch a clip from Clinton’s interview on “CBS Sunday Mornings” here.","url":"https://www.yahoo.com/news/bill-clinton-makes-strong-claim-211908157.html","image":"https://media.zenfs.com/en/the_huffington_post_584/38afb2c1e0134ca0eb7fd031ae2abae7","video":null,"publish_date":"2025-06-01 21:19:08","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"us","sentiment":-0.337},{"id":327122074,"title":"Was Kamala Harris’ Book 'Pulled' For 30% Plagiarism? Fact-Checking Viral Claim","text":"A viral post on X (formerly Twitter) claims that former US Vice President Kamala Harris’ book was \"pulled\" after allegedly being found to contain 30% plagiarized content. The post has gained over 300,000 views, sparking widespread interest and speculation across social media platforms. Although the post doesn’t specify which book was allegedly removed, Kamala Harris’ 2009 book 'Smart on Crime: A Career Prosecutor's Plan to Make Us Safer' is the one previously linked to plagiarism claims. However, it remains available on Amazon, clearly indicating that the viral claim is false. Other Kamala Harris books, 'The Truths We Hold: An American Journey' and 'Superheroes Are Everywhere,' are also available on Amazon. Both books were released in 2019. Plagiarism Allegations Against Kamala Harris' 'Smart On Crime' Plagiarism allegations against Harris's 2009 book 'Smart on Crime: A Career Prosecutor's Plan to Make Us Safer' first surfaced in October last year, during the heat of the 2024 Presidential election. Harris co-authored the book with Joan O'C. Hamilton and it was published while she served as San Francisco's district attorney. Also read: 'Joe Biden Was Executed In 2020': Trump Shares Post Claiming Ex-President Is A 'Clone' Austrian academic and self-described “plagiarism hunter” Stefan Weber identified 27 instances of alleged plagiarism in the book. According to Weber, 24 of those are taken from other authors without proper attribution, while three are examples of self-plagiarism, material reused from another co-authored work. The allegations were first brought to wider attention by conservative commentator and Manhattan Institute senior fellow Christopher Rufo. In his report, Rufo highlighted several examples where Harris and Hamilton allegedly copied full sentences and phrases without quotation marks, despite some footnotes citing the original sources. \"Taken in total, there is certainly a breach of standards here,\" Rufo wrote. \"Harris and her co-author duplicated long passages nearly verbatim without proper citation and without quotation marks, which is the textbook definition of plagiarism.\"","summary":"A viral post falsely claimed Kamala Harris’ book was \"pulled\" due to 30% plagiarism. Her 2009 book Smart on Crime, previously accused of plagiarism, remains available on Amazon along with her other titles. Allegations surfaced in 2024, with 27 instances cited by experts, though the book is still on sale.","url":"https://www.timesnownews.com/world/us/us-news/was-kamala-harris-book-pulled-for-30-plagiarism-fact-checkingviralclaim-article-151770803","image":"https://images.timesnownews.com/thumb/msid-151770862,thumbsize-1346510,width-1280,height-720,resizemode-75/151770862.jpg","video":null,"publish_date":"2025-06-01 20:34:49","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","source_country":"in","sentiment":0.063},{"id":327116484,"title":"Warnock uninterested in Biden 2024 postmortem after being named in Tapper book: ‘It’s over’","text":"“Here’s what we absolutely know about last year’s election — it’s over. And I’m going to spend all of my energy focused on the task in front of us,” he told NBC.\n\nWarnock instead pivoted to Republican attempts to enact Medicaid cuts, insisting that the GOP is “literally trying to take healthcare away from children.”\n\n“The Republicans are trying to push forward this big, ugly bill that’s going to literally cut as many as 7 million Americans off of their healthcare,” he said, later suggesting allowing the tax cuts to expire for those making $500,000 or more a year to prevent cutting important programs.\n\nWarnock, a senator for the swing state of Georgia, was elected in the 2021 special election against former Sen. Kelly Loeffler (R-GA) and beat back Republican Herschel Walker in 2022 to keep his seat. He’s up for election in 2026.\n\nThe recent Biden speculation, buoyed further by the president‘s prostate cancer diagnosis, follows a decisive defeat for Democrats in the 2024 election. Biden stepped down as the Democratic nominee in July 2024 after a disastrous debate performance against President Donald Trump, and the party coalesced around former Vice President Kamala Harris. She would lose to Trump in November 2024.\n\nBut Harris only had months to campaign, while Trump had years. Democrats blamed Biden for not stepping down in favor of her earlier to possibly give her a bigger edge against Trump.\n\nNow the party is viewed as having a leadership void, with no clear-cut 2028 contenders other than Harris, if she runs.\n\nWarnock, and others such as Govs. Gavin Newsom (D-CA) and Gretchen Whitmer (D-MI), as well as former Transportation Secretary Pete Buttigieg, could seek a leading role in the years to come.","summary":"Sen. Raphael Warnock (D-GA) doesn&#8217;t want to talk about the 2024 election anymore. The Georgia senator said what he &#8220;absolutely&#8221; knows about last year&#8217;s election is that it&#8217;s &#8220;over&#8221; amid continued speculation over former President Joe Biden&#8216;s fitness for office. An excerpt from the Jake Tapper and Alex Thompson book Original Sin, which has cast [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3427970/raphael-warnock-biden-2024-tapper-book-original-sin-its-over/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Raphael-Warnock.webp","video":null,"publish_date":"2025-06-01 20:05:03","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","source_country":"US","sentiment":-0.164},{"id":327111252,"title":"The best path to defeating Trumpism","text":"If you follow intra-Democratic discourse on social media, then you probably saw the frenzy that erupted this week following Axios’ coverage of a poll by Demand Progress that found populist messaging far outperforms the messaging being pushed by proponents of the “abundance” movement.\n\nWhen asked about a candidate who wanted to “get money out of politics, break up corporate monopolies, and fight corruption,” 48.5% of respondents said they’d be much more likely to vote for that candidate and 33.1% said they’d be somewhat more likely, for a total of 81.6%. When asked about a candidate who wanted to “make the government and economy do a better job of serving working and middle-class Americans” by reducing “regulations that hold back the government and private sector from taking action,” 18.8% said they’d be much more likely to vote for that candidate and 28.9% said they’d be somewhat more likely, for a total of 47.7%. (The massive gap between the two options is actually slightly larger among independent voters, with 84.8% more likely to support the populist candidate versus 44.9% for abundance.)\n\nAt a moment when Democrats’ efficacy in defeating Trumpism carries such existential stakes, these survey results demonstrate why many of us on the left have found the campaign to make abundance the new face of the Democratic Party so deeply concerning. In the fight against authoritarianism, we simply cannot afford to repeat the mistake Kamala Harris made in 2024, when her shift away from an initially populist message to an abundance-adjacent strategy coincided with a significant drop-off in popular support – a disastrous approach that abundance advocates are working to recreate (or, perhaps more appropriately, maintain) within the Democratic Party, with the aid of millions of dollars from their crypto, AI, Big Tech, and fossil fuel backers.\n\nIn the fight against authoritarianism, we simply cannot afford to repeat the mistake Kamala Harris made in 2024...\n\nPerhaps more revealing than the actual poll, however, have been the responses to it from the abundance camp. Abundance proponents immediately lashed out to try to dismiss the survey, cast doubt on its methodology, and explain away the obvious conclusions that Democrats should draw from its results. But each of their arguments is so profoundly weak, if not outright disingenuous, that reviewing them one by one calls into question nearly every aspect of the abundance program.\n\nAbundance proponents’ first strategy was to attack the poll’s wording. For example, The Atlantic’s Jonathan Chait immediately sprung into action after the results were published to claim that the poll “is literally worthless, because the language is crafted to yield the desired outcome.”\n\nHere’s how the poll described the abundance argument:\n\nThe big problem is ‘bottlenecks’ that make it harder to produce housing, expand energy production, or build new roads and bridges. Frequently these bottlenecks take the form of well-intended regulations meant to give people a voice or to protect the environment - but these regulations are exploited by organized interest groups and community groups to slow things down. This increases costs and makes it harder for us to provide for everybody’s needs. We need to push back against these groups so the government and economy can work better for working and middle-class Americans.\n\nI don’t know how anyone could read this language and not think it’s an accurate articulation of the abundance agenda. Maybe abundance advocates could come up with a more generous framing of their argument, but if so, they haven’t provided it.\n\nThe one specific criticism I have seen came from Adam Jentleson, self-appointed warrior against “the groups,” who wrote, “This is a good example of how groups cook polls. Candidates typically say ‘cut red tape,’ which probably performs better than just ‘bottlenecks.’ But the group massages the question wording [to] get the outcome they want.” But that’s just not how abundance proponents frame their program. In Ezra Klein and Derek Thompson’s agenda-defining book, \"Abundance,\" the word “bottleneck” is used over a dozen times. The phrase “red tape” does not appear once. Bottleneck also frequently appears throughout the authors’ other writings on this subject, and in the materials of the institutions backing the abundance campaign. If this isn’t a compelling message, that’s not an issue of unfair wording – it’s a problem with the abundance message, as pushed by abundance’s top messengers.\n\nThe reason I’m advocating for Democrats to campaign as economic populists – and then govern as such – is because all evidence indicates that this strategy gives us our best chance of beating fascism, before it’s too late.\n\nThe next move from the abundance camp was to attack the very idea of comparing populist and abundance messaging, given that it’s possible for Democrats to embrace both programs. As Jentleson put it, “This binary is silly and it’s a structural problem to have foundations pumping millions into calcifying it. The top Dem electoral performers talk about breaking up concentrated corporate power AND cutting gov’t red tape.” There are two big problems with this argument. First, the poll actually tested this point directly. One of the survey’s questions combined populist and abundance messaging to see how a both/and approach performed. Lo and behold, while the combined message did much better than the plain-abundance option, it did significantly worse than the plain-populist one.\n\nBut even more importantly, this “we can do both” line completely sidesteps the reality that most of abundance’s top backers have spent the last six months actively fighting to stop Democrats from embracing populism. Matt Bennett, co-founder of Third Way, a centrist think tank that has been a major booster of the Abundance agenda, recently complained that “demanding economic populism is its own form of purity test” and argued that Democrats should stop using a “fighting the oligarchs” message. Jonathan Chait just published a piece about abundance titled “The Coming Democratic Civil War” which stated with admirable honesty that “progressives are not wrong to see the abundance agenda as a broader attack on their movement.” At one Abundance promotion event, Derek Thompson said, “What is ‘oligarchy’ doing for you? The tool they have used to explain the world fails to do so.” In another interview he said, “On the Democratic side, there is a fight, and it’s happening right now, and our book is trying to win a certain intra-left coalitional fight about defining the future of liberalism in the Democratic Party.”\n\nFor the abundance camp to contend that they never claimed their program could help Democrats win elections is gaslighting, pure and simple.\n\nIn reality, there are pieces of the abundance program that could fit in with a populist agenda. For example, it’s often been progressives who have led the fight against exclusionary zoning. But the abundance movement – its top proponents, the institutions behind them, and the interest groups that are, to use Jentleson’s words, “pumping millions into” standing them up – have generally presented abundance as either in conflict with economic populism or, as Thompson put it, as an alternative that must displace progressivism in “defining the future” of the Democratic Party. Given the battle lines they have drawn, information about which framework voters respond best to seems extremely important. And let the record be clear: The idea of merging populism with abundance is a concession they are making only now that it’s clear that abundance alone could spell disaster for Democrats at the polls.\n\nBut it is the final argument from the abundance camp that is both the most disingenuous and the most telling. Many abundance proponents responded to the poll’s evidence that abundance offers Democrats a weak message to run on by arguing that their framework was never meant to be an electoral program. As Vox’s Eric Levitz argued, “[T]he point of abundance reforms is to govern well, not win elections.”\n\nThe idea of merging populism with abundance is a concession they are making only now that it’s clear that abundance alone could spell disaster for Democrats at the polls.\n\nOf course, this claim is patently false. Abundance proponents have, beyond any shred of a doubt, been pitching their program as the electoral strategy that will give Democrats their best shot at defeating Trumpism. In his keynote description of abundance in The Atlantic this March, Thompson could not have been more explicit on this point, writing, “If Trump’s opponents are going to win at the polls, they will need to construct a new political movement, one that aims for abundance instead of scarcity.” For the abundance camp to contend that they never claimed their program could help Democrats win elections is gaslighting, pure and simple.\n\nAnd yet, accepting this claim entails accepting an even more devastating indictment of the abundance movement. Because in the midst of Trump’s ongoing authoritarian takeover of our country, winning elections is the number one existential goal we must achieve. Yes, I am a progressive, so I want to see economically populist governance because I believe it will improve Americans’ lives and strengthen the prospects of our shared future. But I believe the same about maximalist policies on a number of social issues that I’m not advocating for Democrats to campaign on. The reason I’m advocating for Democrats to campaign as economic populists – and then govern as such – is because all evidence indicates that this strategy gives us our best chance of beating fascism, before it’s too late.\n\nThis debate matters greatly, because the stakes are so high. If abundance isn’t going to help Democrats defeat MAGA, then abundance advocates – or at least the ones who care about ending Trumpism – should stop trying to “define the future of the Democratic Party.” Let’s leave that work to the Democrats who are trying to orient our party around a vision that voters actually do find compelling. \n\nNOW READ: 'Catastrophic': Trump is now going after 'the best idea we ever had","summary":"If you follow intra-Democratic discourse on social media, then you probably saw the frenzy that erupted this week following Axios’ coverage of a poll by Demand Progress that found populist messaging far outperforms the messaging being pushed by proponents of the “abundance” movement.\n\nWhen asked about a candidate who wanted to “get money out of politics, break up corporate monopolies, and fight corruption,” 48.5% of respondents said they’d be much more likely to vote for that candidate and 33.1% said they’d be somewhat more likely, for a total of 81.6%. When asked about a candidate who wanted to “make the government and economy do a better job of serving working and middle-class Americans” by reducing “regulations that hold back the government and private sector from taking action,” 18.8% said they’d be much more likely to vote for that candidate and 28.9% said they’d be somewhat more likely, for a total of 47.7%. (The massive gap between the two options is actually slightly larger among independent voters, w","url":"https://www.alternet.org/trump-populism/","image":"https://www.alternet.org/media-library/image.jpg?id=54793411&width=1200&height=600&coordinates=0%2C148%2C0%2C148","video":null,"publish_date":"2025-06-01 19:17:02","author":"Aaron Regunberg","authors":["Aaron Regunberg"],"language":"en","category":"politics","source_country":"US","sentiment":-0.345},{"id":327094180,"title":"Party Activists in California Aren’t Sold on a Harris Run for Governor","text":"Kamala Harris’s voice rang out across a convention hall packed with California Democratic activists, and she wore a beaming smile.\n\nBut the former vice president was not in the room where 4,000 party delegates had gathered in Anaheim, Calif., to prepare for next year’s elections. Instead, she spoke to them through a three-minute video address that drew tepid applause.\n\nEver since Ms. Harris returned home to California in January after losing last year’s presidential race, Democrats have wondered whether she would run for governor in 2026. Her entry would shake up the race, and many observers believe she would be the front-runner. But she has made few public appearances and offered little indication of which way she is leaning.\n\nHer absence from the hall in Anaheim this weekend loomed over the state party convention like the pair of large video screens that carried her message. And that left many party activists questioning just how seriously she was considering running.","summary":"Kamala Harris did not appear in person at a California state Democratic convention, leaving delegates to wonder how seriously she is considering running and whether it would be wise.","url":"https://www.nytimes.com/2025/06/01/us/california-democrats-kamala-harris-governor.html","image":"https://static01.nyt.com/images/2025/06/01/multimedia/01nat-harris-promo-june-1-tmvq/01nat-harris-promo-june-1-tmvq-facebookJumbo.jpg","video":null,"publish_date":"2025-06-01 18:11:20","author":"Laurel Rosenhall","authors":["Laurel Rosenhall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.045},{"id":327090608,"title":"Booker slammed for alleged 'Nazi salute' to Cali Dems just months after Musk was dragged for same gesture","text":"Conservatives are mocking Sen. Cory Booker for delivering an alleged \"Nazi salute\" to California Democrats, while quipping the New Jersey Democrat won't get the same scrutiny Elon Musk did when he raised his arm to MAGA supporters in January. \"NEW: Democrat Senator Cory Booker appears to do a ‘Nazi’ salute in front of a large crowd of Democrats. I’m looking forward to the wall to wall coverage from the ‘honest’ and totally not biased media,\" Trending Politics co-owner Collin Rugg posted to X, accompanied by footage of the gesture. \"If Elon Musk is a Nazi for doing this gesture… Cory Booker is one too. Sorry, I don’t make the rules,\" X user Angela Belcamino posted. Booker traveled to the Los Angeles area on Saturday, where he addressed the California Democratic Party's convention, calling on supporters to \"stand up\" to President Donald Trump and repeating a handful of messages he delivered during his marathon 25-hour speech on the Senate floor in March railing against Musk, the Department of Government Efficiency, and the Trump administration for its alleged attacks on \"Americans' safety, financial stability, the core foundations of our democracy.\" ELON MUSK'S MOTHER URGES HIM TO SUE CNN, OTHER NEWS OUTLETS FOR PEDDLING 'NAZI SALUTE' NARRATIVE \"Real change does not come from Washington. It comes from communities. It comes from the streets. It comes from the people who’s standing up and have shown over and over again – against the powerful, against the elected, against the rich – that the power of the people is greater than the people in power,\" Booker said on Saturday to the California Democrats. He capped off his roughly 15-minute speech with a gesture where he placed his right hand on his chest before raising it to the crowd. Musk delivered a similar gesture in January on Trump's inauguration day, which yielded dozens of headlines from mainstream media outlets that Musk delivered a \"Nazi-style salute\" to Trump supporters. Liberals and critics frequently attacked Trump while he was on the campaign trail by calling him a Hitler-esque fascist, including former Vice President Kamala Harris, who compared Trump to the German dictator during a town hall in October. BOOKER CONCLUDES RECORD 25-HOUR SPEECH AGAINST TRUMP, MUSK, MARKING THE LONGEST EVER ON THE SENATE FLOOR Conservatives and others pounced on the footage of Booker, asking if media outlets would accuse the New Jersey Democrat of gesturing like a Nazi. \"Will Corey Booker be plastered all over msm with headlines claiming he’s a ‘Nazi’?\" The Post Millennial's X account posted, accompanied by footage of the gesture. DEM SENATOR SAYS PARTY BRAND IS ‘REALLY PROBLEMATIC’ AND LED TO THE LOSS OF TRUST OF WORKING-CLASS VOTERS \"Here’s a list of all the news networks who have not covered Cory Booker’s salute: – NYTimes – CNN – Washington Post – MSNBC – NPR – USA Today – Reuters – Axios – ABC News Every single one of them wrote stories on Elon Musk’s ‘salute’… …do you get it yet?\" former government scientist Matt van Swol posted to X. Musk responded to van Swol: \"Legacy media is one big psy op.\" ELON MUSK'S OFFICIAL ROLE AT TRUMP'S DOGE ENDS, BUT HIS POLITICAL IMPACT LINGERS AHEAD OF MIDTERMS \"Cory Booker is a straight up NAZI! WOW,\" conservative X user Gunther Eagleman posted. Other X posts included direct comparison between Musk's wave in January and Booker's gesture on Saturday. CLICK HERE TO GET THE FOX NEWS APP \"Cory Booker was obviously just waving to the crowd. Anyone who claims his wave is the same as Elon Musk’s gesture is operating in bad faith. The differences between the two are obvious to anyone without an agenda,\" Booker spokesperson Maya Krishna-Rogers told Fox News Digital on Sunday when asked about the gesture. Booker did not appear to join fellow liberals in comparing Musk's wave to a Nazi salute in January, although he has previously slammed Trump as \"worse than a racist,\" accusing him in 2019 of using \"racist tropes\" as \"a weapon to divide our nation against itself.\"","summary":"Conservatives criticized Sen. Cory Booker for an alleged &quot;Nazi salute&quot; at a California Democratic Party event, questioning media coverage of Elon Musk&apos;s similar gesture in January.","url":"https://www.foxnews.com/politics/conservatives-drag-booker-nazi-salute-cali-dems-after-liberal-meltdown-musk-gestured-like-nazi","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/bookr4.png?ve=1&tl=1","video":null,"publish_date":"2025-06-01 17:38:15","author":"Emma Colton","authors":["Emma Colton"],"language":"en","source_country":"us","sentiment":-0.058},{"id":327075074,"title":"Elon Musk Accuses Sen. Cory Booker Of Nazi Salute","text":"Elon Musk—who drew criticism earlier this year after making a gesture many alleged was a Nazi salute—accused Sen. Cory Booker, D-N.J., of doing a Nazi salute on stage at an event for California Democrats on Saturday night.\n\nElon Musk gestures as he speaks during a news conference with President Donald Trump in the Oval ... More Office of the White House, Friday, May 30, 2025, in Washington.\nCopyright 2025 The Associated Press. All rights reserved\n\nBooker was speaking at the California Democratic Convention Saturday night, and ended his speech by placing his hand on his heart and extending his arm toward the crowd in a motion Musk and others have said resembled the Nazi salute.\n\nMusk began sharing posts about Booker’s gesture around 9 p.m. EDT Saturday night, and he quote-tweeted a post about the incident and lack of media coverage with the caption, “Legacy media lies.”\n\nHe continued to tweet about it Sunday morning, when he shared a post showing Democratic leaders former President Barack Obama, Sen. Elizabeth Warren, Mass. and former presidential candidates Kamala Harris and Hillary Clinton with their arms extended and the caption, “We know where Cory Booker learned his Nazi salute from”—and Musk added a “🤨” emoji.\n\nBooker has not publicly commented on the gesture, and Forbes reached out to his office for comment.\n\nKey Background\n\nMusk drew criticism in January after he pounded his fist to his chest and extended his right arm into the air twice while speaking at an event for President Donald Trump’s inauguration. International leaders including Spain’s minister of labor and social economy and Germany’s health minister criticized the gesture, as did a number of Democrats. Musk didn’t explain why he made the motion, but said in posts on X at the time that Democrats were playing “dirty tricks” and that “the ‘everyone is Hitler’ attack is sooo tired.” One month after Musk’s incident, another Trump ally, Steve Bannon—who was feuding with Musk at the time over his close relationship with Trump—was accused of giving a Nazi salute when he spoke at the Conservative Political Action Conference. Bannon denied making the salute and told the Daily Mail it “was a wave to the crowd.”\n\nSurprising Fact\n\nAfter Musk was accused of making the motion, the Anti-Defamation League—a nonprofit working against antisemitism—said in a statement that Musk seemed to make “an awkward gesture in a moment of enthusiasm, not a Nazi salute,” and urged people on “all sides (to) give one another a bit of grace.” The ADL had not publicly commented on the allegations against Booker, though Forbes has reached out for comment.\n\nChief Critic\n\nRep. Elise Stefanik, R-N.Y., also took to X Sunday morning to criticize Booker. In her post she said Democrats “were hyperventilating about this false smear of Elon,” when he was accused of doing the salute in January and added “the mainstream media is totally corrupt.” Stefanik also continued: “The American people are smart. Neither Elon Musk or @CoryBooker are giving the Nazi salute. Americans see thru this obvious and destructive double standard by the totally broken media and Democrat Party.” Musk responded to the post with, “they are such hypocrites,” presumably referring to the media.\n\n9. That’s how many times Musk had tweeted or shared posts about Booker’s gesture as of 12:55 p.m. EDT on Sunday.\n\nFurther Reading\n\nElon Musk ‘Salute’ Condemned By European Leaders, Democrats (Forbes)\n\nFrench Far-Right Leader Cancels CPAC Speech After Steve Bannon’s Salute Draws Nazi Comparisons (Forbes)\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Musk faced criticism and was accused of doing a Nazi salute gesture in January while speaking at an event for President Donald Trump’s inauguration.","url":"https://www.forbes.com/sites/mollybohannon/2025/06/01/elon-musk-accuses-sen-cory-booker-of-nazi-salute/","image":"https://imageio.forbes.com/specials-images/imageserve/683c8ce0e190760debda7905/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-01 17:25:05","author":"European Leaders,Forbes Staff,Molly Bohannon","authors":["European Leaders","Forbes Staff","Molly Bohannon"],"language":"en","category":"politics","source_country":"US","sentiment":-0.378},{"id":327083324,"title":"The foreign network inside America: How India’s global Indians are used to steer U.S. policy, jobs and investments from the inside","text":"The Indian government does not hide its intentions. It does not cloak its agenda in diplomatic vagueness or cultural goodwill. On the contrary, India has made one fact abundantly clear: it views its global diaspora as a state-controlled asset, a tool of national policy and an instrument of foreign influence.\n\nThe Indian government has built one of the most extensive and coordinated diaspora engagement strategies in modern history, one that now plays a central role in India’s global rise. Unlike other nations that merely celebrate their emigrant populations, India has institutionalized a system designed to leverage its overseas citizens for strategic national gain.\n\nTo put it simply India has built a state-backed infrastructure specifically designed to mobilize its overseas population as a tool of strategic leverage.\n\nIn the process, Indian-origin individuals embedded in American institutions are playing increasingly pivotal roles in influencing U.S. policy, offshoring economic opportunities and redirecting American resources to support India’s geopolitical ambitions.\n\nA state-engineered diaspora strategy\n\nAccording to The United Indian the Indian diaspora is viewed as a global force capable of swaying political outcomes in host countries.\n\nThe publication boasts that Indian-origin communities have driven India’s development through remittances, capital inflows and transfers of technical knowledge from abroad.\n\nMore critically, it calls for this global community to be intentionally positioned in key business, policy and academic roles, not to integrate into their host nations, but to serve India’s broader national interests.\n\nThis is not just pride in national identity, it’s a blueprint for foreign influence.\n\nIndia’s Ministry of External Affairs openly acknowledges that investments from Non-Resident Indians (NRIs) account for nearly 35% of the country’s total foreign direct investment (FDI) inflows.\n\nTo deepen its reliance on foreign capital and consolidate control over its global diaspora, the Indian government has constructed a sophisticated system of legal, financial and emotional loyalty, one deliberately designed to turn overseas Indians into agents of national advancement.\n\nThrough initiatives like Pravasi Bharatiya Divas (PBD) and NRI-targeted investment schemes were explicitly designed to turn diaspora wealth into a national development engine, not just for economic growth, but for India’s geopolitical rise.\n\nWhile India explicitly prohibits dual citizenship, it has created a legal workaround: the Overseas Citizenship of India (OCI) program, though not true citizenship, OCI status grants foreign nationals of Indian origin lifetime visa-free entry, unrestricted access to India’s economy, educational institutions and property markets (excluding agricultural land) and rights nearly identical to those of NRIs. This structure allows millions of Indian-origin U.S. citizens and green card holders to operate across borders, fully integrated into India’s economic system while retaining the legal protections and privileges of their host countries.\n\nUnder India’s Overseas Citizenship of India (OCI) framework, many prominent Indian-origin Americans, including those in politics, business and technology, are eligible for OCI status based on Indian parentage, ancestry, or prior Indian citizenship. For example, Vivek Ramaswamy, now running for governor of Ohio after a presidential bid, qualifies as the child of an Indian citizen. Microsoft CEO Satya Nadella qualifies as a former Indian citizen. Despite holding U.S. citizenship, individuals like Ramaswamy and Nadella can legally obtain OCI status, which allows them to live, work, invest and exercise significant influence in India without relinquishing their American nationality. This dual access positions them as powerful cross-border actors who can simultaneously shape U.S. and Indian interests, making them instrumental to India’s broader geopolitical and economic strategy.\n\nBut the design goes deeper. Many of these individuals, despite holding U.S. citizenship or even government security clearances, remain closely embedded in India’s strategic and policy ecosystem.\n\nA blueprint for global leverage\n\n Ministry of Overseas Indian Affairs Strategic Plan to Use Overseas Indian Community for India’s Agenda\n\nIndia openly admits that its relationship with the diaspora is not incidental or symbolic, but strategic. This means all engagement, whether financial, educational, or political, is aimed at securing tangible benefits for India, including influence operations, foreign lobbying and economic leverage.\n\nIndia not only uses the diaspora to bring resources into India, but also seeks to embed and expand Indian labor into foreign economies, particularly through workforce pipelines (H-1B, L-1, OPT), often facilitated by state partnerships and corporate MoUs.\n\nIndia is actively designing incentive structures and policy tools tailored to different segments of the diaspora. These “customized solutions” include visa rights, investment opportunities and educational access in India, all meant to bind the diaspora more tightly to India’s economic system.\n\nIndia refers to its diaspora as “investible,” confirming that it views them as resources to be deployed for national gain. This includes their:\n\nIntellectual capital (tech CEOs, academics, scientists)\nPolitical influence (elected officials, donors)\nFinancial assets (remittances, venture capital)\n\nIndia’s diaspora incentive structure, powered through the OCI framework, creates the conditions for state-enabled insider trading. This system functions as a form of state-enabled economic espionage. OCI holders are encouraged to influence foreign policy and investment toward India and then personally benefit from those policies and deals using their exclusive access and legal status in India. This isn’t just soft power, its economic manipulation backed by legal infrastructure.\n\nThis dual-access framework is not available to average Americans or other foreign nationals, it creates an elite class of cross-border actors who can align their political power in one country (e.g., the U.S.) with financial returns engineered through policy alignment with another (India). By embedding Indian-origin individuals in powerful U.S. institutions and simultaneously offering them privileged access to India’s economic and legal system, India has created a global influence apparatus that bypasses traditional oversight, ethics rules and financial disclosure norms.\n\nIndia openly acknowledges that it is leveraging the skills, influence and corporate positions of Indian-origin professionals abroad by offering incentives and privileges, including OCI status, to pull them into its domestic development agenda. This includes knowledge transfers in tech, governance and education. It confirms that India’s diaspora policy is not passive, it is designed to extract intellectual capital from abroad to fuel India’s rise. This aligns with the pattern of Indian-origin tech CEOs (e.g., Sundar Pichai, Satya Nadella) driving investment, R&D and infrastructure into India while offshoring jobs from the U.S.\n\nIndia views overseas Indians as a pipeline for financial capital, not just through remittances but through structured philanthropy aligned with government goals.\n\nThe reference to the Foreign Contribution Regulation Act (FCRA) reveals that India wants to control and centralize foreign-origin funding while maintaining legal command over where that money goes, which means the OCI status is not just about cultural connection, it’s a legal mechanism.\n\nIndia sees its diaspora, especially those in the U.S. as influence agents in global forums. It explicitly seeks to engage diaspora professionals in advocacy, public policy and reputation-building, positioning them as unofficial diplomats. India admits it is deliberately organizing the diaspora to shape international narratives, policy perspectives and strategic alliances. This directly relates to how U.S.-based politicians, CEOs and institutional leaders of Indian origin are used to push India-friendly policies, suppress criticism of India and amplify India’s soft power in Western governments and institutions.\n\n“Positioning India as a preferred source country for economic migration…”\n\nThis is a direct admission that India is intentionally marketing itself as a labor-exporting superpower, leveraging bilateral and corporate partnerships to flood foreign markets with Indian workers. This matches the U.S. visa manipulation via H-1B, OPT, L-1 and green card pipelines. India is structuring labor migration as a national strategy, not a side effect of globalization.\n\n“Facilitate Overseas Indians and Indian businesses to invest and share learnings…”\n\nThis line reveals a long-term plan to embed Indian nationals and companies inside foreign economies, particularly those with strategic importance. The India government is encouraging Indian-Origin individuals to invest abroad on India’s terms, enable Indian businesses to gain control and visibility in markets and use diaspora networks to export India’s development model into other countries. This reinforces how OCI holders and Indian-origin executives in the U.S. are vehicles of Indian economic influence, spreading India-centric trade practices, tech standards and labor norms.\n\nLeveraging American positions of power\n\nAt the center of this effort are Indian-origin power brokers embedded in global business and technology. Many of today’s most powerful global technology companies are led by Indian-origin CEOs, figures who have not only climbed to the top of American corporate ladders, but who have also played critical roles in redirecting resources, innovation and workforce opportunity toward India. These individuals are celebrated in India not just as successful executives, but as strategic assets furthering the country’s national agenda.\n\nThis strategic alignment has led to a clear pattern under their leadership, U.S. companies have prioritized Indian markets, labor forces and R&D hubs, while laying off American workers, offshoring critical operations and re-engineering workforce pipelines to favor India’s rise.\n\nSundar Pichai, CEO of Google, has directed over $10 billion into India through the “Digital India” initiative. Under his leadership, Google established major R&D hubs in Bangalore and Hyderabad and partnered with the Indian government to develop language infrastructure and AI systems. These moves have accelerated India’s dominance in digital infrastructure while moving research and innovation jobs out of the United States.\n\nSatya Nadella, CEO of Microsoft, announced a $3.3 billion investment in India’s cloud and AI ecosystem in 2024. This came as Microsoft conducted significant layoffs in the U.S. Nadella has actively expanded India’s role in Microsoft’s global delivery model, turning India into a backbone for the company’s engineering, operations and customer service arms. His strategic alignment with India’s government has made Microsoft a central partner in the country’s AI and education initiatives.\n\nParag Agrawal, former CEO of Twitter, promoted India as a key growth market and increased India-specific staffing and engagement with the Indian government. During his tenure, Twitter became more compliant with India’s regulatory frameworks, expanding its domestic political utility while softening its global stance on free speech.\n\nShantanu Narayen, CEO of Adobe, has scaled Adobe’s India operations into a global R&D hub and has openly praised India’s tech talent and infrastructure. He continues to grow Adobe’s footprint in India while supporting government-aligned initiatives related to digital creativity, education and data frameworks.\n\nArvind Krishna, CEO of IBM, has overseen the company’s transformation into a consulting-heavy enterprise with a massive presence in India. Today, IBM employs more people in India than anywhere else in the world. Krishna has shifted core business operations and product development to India, enabling a long-term offshoring model that has reduced American IT and engineering headcount.\n\nRaghu Raghuram, CEO of VMware, has expanded VMware’s engineering and DevOps operations in India. The company’s India teams have become central to cloud product development and global customer support functions.\n\nAnjali Sud, former CEO of Vimeo, advocated a remote-first workforce strategy that allowed Vimeo to scale its engineering presence in India. Her leadership coincided with Vimeo’s partnerships across India’s media and technology ecosystem.\n\nNikesh Arora, CEO of Palo Alto Networks, has overseen the launch of major cybersecurity engineering hubs in India. His strategy positioned India as a global center for cyber talent, driving product development from Indian campuses while reducing reliance on U.S.-based teams.\n\nRevathi Advaithi, CEO of Flex, shifted manufacturing and logistics operations to India as part of the company’s realignment under global supply chain pressures. She has actively supported India’s “Make in India” industrial policies, strengthening the country’s manufacturing base.\n\nGeorge Kurian, CEO of NetApp, has positioned the company’s India arm as a global technology and engineering hub. NetApp India handles core storage product innovation and services, deepening the country’s role in high-tech infrastructure.\n\nSanjay Mehrotra, CEO of Micron, has played a leading role in developing India’s semiconductor industry. He led Micron’s $2.75 billion investment in a semiconductor assembly and testing facility in Gujarat, an initiative heavily subsidized by the Indian government. While India benefits from new chip capabilities, U.S. semiconductor expansion efforts have faced cuts and delays.\n\nThese aren’t isolated cases, they are coordinated outcomes. India’s immigration strategy, in tandem with its diaspora engagement playbook, has used the U.S. work visa system as a delivery vehicle, flooding American companies with Indian nationals while displacing U.S. workers at scale.\n\nAccording to The United Indian, the global economic footprint of Indian diaspora-led businesses now exceeds $3 trillion annually. This is not merely success, it is state-backed leverage.\n\nIn summary, these Indian-origin CEOs are not merely individual success stories. They are key actors in India’s global strategy, channeling American capital, jobs and technologies to strengthen India’s economic, digital and geopolitical position, often while U.S. workers and industries suffer the consequences. Their positions at the helm of U.S. corporations have made them ideal conduits for India’s long-term national ambitions.\n\nIndian Multinational Corporations: The corporate engine of India’s foreign agenda\n\nWhile Indian-origin CEOs embedded in U.S. corporations have become symbols of influence and strategic alignment, it is Indian multinational enterprises (MNEs), notably Tata Consultancy Services (TCS), Infosys, Wipro, Cognizant, Tech Mahindra and HCL Technologies, that serve as the operational arms of India’s economic expansion and workforce export strategy. These companies have played a central role in advancing India’s national agenda by systematically exploiting the U.S. immigration system, displacing American labor, offshoring sensitive contracts and influencing U.S. policy under the guise of globalization.\n\nThese MNEs are not neutral market actors. They operate in lockstep with Indian government ministries, educational institutions and trade bodies to implement India’s global workforce and innovation agenda. Their executives regularly participate in diaspora events like Pravasi Bharatiya Divas and leverage India’s Overseas Citizenship of India (OCI) program to maintain influence over Indian-origin professionals embedded in U.S. companies and agencies.\n\nThe offshoring playbook used by these firms, perfected through state incentives and policy coordination, has enabled the transfer of U.S. contracts, research and intellectual property to India-based facilities. TCS and Infosys pioneered this model with 24/7 development centers in Bangalore and Hyderabad. Cognizant, Wipro and Tech Mahindra expanded it by winning U.S. government and corporate deals, then quietly shifting execution to India. Many of these contracts include sensitive data and services once intended exclusively for American use, some even involving defense and healthcare systems.\n\nThe damage to American workers is staggering. These firms collectively file tens of thousands of H-1B, L-1 and OPT visa applications every year, undercutting U.S. wages and excluding qualified American applicants. Several have been sued for discrimination, including TCS, Infosys, Cognizant and Tech Mahindra. In one of the most notable cases, Infosys paid a $34 million settlement to the DOJ for abusing B-1 visas to sneak in Indian workers under false pretenses. Others have faced similar accusations of misusing the visa system to sidestep U.S. labor protections and import low-wage labor.\n\nBeyond workforce displacement, these MNEs shape U.S. policy. As members of lobbying bodies like the U.S.-India Business Council (USIBC), they push for expanded visa quotas, intellectual property concessions and trade agreements that benefit India. They also fund diaspora-linked advocacy groups like Indiaspora and USINPAC to influence American lawmakers and normalize India-first workforce policies under the banner of globalization.\n\nThese corporations are not simply participants in the global economy, they are tools of India’s national strategy. They have embedded themselves inside America’s digital infrastructure, redirected taxpayer-funded innovation to India and engineered a labor market shift that benefits one nation at the expense of another. Their success represents not just corporate growth, but the successful execution of a geopolitical and economic conquest, one contract, one job and one visa at a time.\n\nIndian-Origin U.S. political power: India Government political access and policy influence in America through diaspora\n\nIndia has not only exported labor and technology, it has also cultivated political influence in the United States through a growing number of Indian-origin elected officials and civil servants. These individuals, often celebrated by Indian media and government officials as “diaspora success stories,” are increasingly positioned in critical roles across U.S. policymaking, diplomacy, trade and law.\n\nTheir prominence is not just a reflection of personal achievement, it’s a strategic asset for India’s foreign policy. The Indian government maintains regular engagement with Indian-origin U.S. lawmakers and public officials. Congress members such as Ro Khanna and Pramila Jayapal have participated in Indian diaspora events and advocated for increased U.S.-India cooperation. U.S. policy changes related to immigration, trade and technology transfer often receive vocal support from diaspora-linked organizations, including the U.S.-India Business Council (USIBC) and Indian-American lobbying groups.\n\nFEDERAL ELECTED OFFICIALS\n\nKamala Harris, Former Vice President of the United States, is the daughter of Indian-born scientist Shyamala Gopalan. Although Harris identifies more with her African-American heritage publicly, Indian officials and media claim her as a symbol of diaspora power, frequently referencing her as a point of national pride and using her image in Pravasi Bharatiya Divas and India-based political narratives.\n\nAmi Bera, U.S. Representative from California’s 6th District, is the longest-serving Indian-American in Congress. He sits on the House Foreign Affairs Committee and has consistently supported pro-India policy positions, including increased defense and health cooperation. Bera frequently appears at Indian consulate events and receives backing from Indian-American lobbying groups.\n\nRaja Krishnamoorthi, U.S. Representative from Illinois’s 8th District, is known for his vocal support of U.S.-India relations. He regularly engages with Indian consulates, diaspora coalitions and public forums promoting bilateral economic and educational ties. He has endorsed expanding H-1B visas and supports India-centric trade initiatives.\n\nRo Khanna, U.S. Representative from California’s 17th District (Silicon Valley), is perhaps the most active Indian-origin lawmaker when it comes to coordinating with the Indian government. He has spoken at Indian diaspora forums, participated in trade delegations and met directly with Indian officials to discuss shared tech and labor interests. Khanna plays a central role in maintaining India’s foothold in U.S. tech policy.\n\nPramila Jayapal, U.S. Representative from Washington’s 7th District, is of Indian origin and chairs the Congressional Progressive Caucus. While she has occasionally criticized India’s human rights record, she remains deeply embedded in India-focused diaspora circles and continues to advocate for South Asian-American representation and visa-related reforms that disproportionately benefit Indian nationals.\n\nShri Thanedar, U.S. Representative from Michigan’s 13th District, is an immigrant from India and a former entrepreneur. He has positioned himself as a “self-made success story,” drawing significant attention from Indian media outlets that celebrate his electoral victory as a win for the diaspora.\n\nSuhas Subramanyam, elected in 2024 to represent Virginia’s 10th District, became the first Indian-American Congressman from Virginia. His election was hailed by Indian consulates and diaspora PACs as a milestone in expanding Indian-origin political power at the federal level.\n\nSTATE & LOCAL OFFICIALS\n\nAruna Miller, Lieutenant Governor of Maryland, is the first South Asian woman to hold such a high executive office in any U.S. state. Her campaign and inauguration were celebrated in Indian media as an “historic diaspora achievement,” and she maintains active relationships with Indian-American groups.\n\nRavinder Bhalla, Mayor of Hoboken, New Jersey, made headlines as the first Sikh mayor elected in New Jersey. He has spoken at Indian consulate events and is frequently spotlighted by Indian media outlets promoting diaspora visibility.\n\nNiraj Antani, Ohio State Senator, is the first Indian-American Republican elected to the Ohio legislature. He’s been involved in India-friendly business delegations and has spoken publicly in support of U.S.-India trade alignment.\n\nJenifer Rajkumar, a New York State Assembly Member, is the first Indian-American woman elected to New York’s Legislature. She’s known for her active participation in Indian cultural celebrations and events organized by Indian diplomatic missions.\n\nKshama Sawant, Seattle City Council member, is a high-profile political figure of Indian origin. While aligned with socialist and anti-capitalist causes, she has nevertheless been cited in Indian state media as evidence of diaspora reach into American political systems.\n\nManka Dhingra, Washington State Senator and Deputy Majority Leader, regularly advocates for Indian-American communities and serves as a bridge between Indian diplomacy and state-level U.S. politics.\n\nThese Indian-origin officials are not just public servants, they are key nodes in a transnational influence network. Whether by promoting India-friendly trade, championing immigration policies that benefit Indian labor exports, or directly engaging with Indian ministries and consulates, they have become instruments of soft power for a foreign government seeking deeper economic and political footholds in the United States.\n\nThe foreign enterprise operating inside American gates\n\nFrom Silicon Valley boardrooms to Capitol Hill, Indian-origin power brokers, whether CEOs, elected officials, or high-ranking bureaucrats, have quietly but decisively advanced India’s global ambitions from within American institutions. Trusted to represent American interests, many have made decisions that directly expanded India’s economic, technological and strategic reach, often at the expense of American workers, taxpayers and national sovereignty.\n\nTheir loyalty is not judged by soundbites. It is revealed in their actions. And India has made its intent explicit. These diaspora figures are not just celebrated success stories. They are strategic tools in India’s foreign policy. The United States, so far, has allowed it.\n\nThis must now be addressed with clarity. What happens when American institutions elevate individuals aligned, by birth, benefit, or ideology, with a foreign government? We are already living the answer. From trade deals and education partnerships to immigration policy and infrastructure, Indian-aligned influence has structurally reshaped American systems to favor India’s rise.\n\nWhen Indian-origin lawmakers push expanded visa quotas or bilateral tech transfers, when corporate executives move jobs and research to India, when academics and nonprofit leaders advise Indian ministries or appear at diaspora summits like Pravasi Bharatiya Divas and when U.S. law firms shape domestic policy for Indian interests, this is not about heritage. It is about strategic alignment. And when that alignment undermines American jobs and weakens national competitiveness, it becomes a direct threat.\n\nWhat other nation would tolerate foreign-aligned actors influencing its laws, investments and workforce strategy in favor of a rival power? What other government would remain silent as its own institutions are redirected to serve another country’s rise?\n\nWhile Chinese influence has sparked national security investigations and legislative action, India’s infiltration has been masked by diplomatic charm and the illusion of shared values. But India’s model, built on visa exploitation, diaspora loyalty, intellectual property theft and policy capture, is no less dangerous.\n\nThe question is no longer whether this network exists. The question is how long America will allow foreign-aligned operatives to shape its future. Because when India is prioritized over America, that is not cooperation. That is colonization by strategy. And it ends when we say America First. On our soil. In our jobs. And in our government.\n\nThe cost to America\n\nThe cost of India’s strategy is not hidden in spreadsheets or obscure treaties. It’s written across the hollowed-out factories of the Midwest, the layoffs in Silicon Valley and the flood of foreign resumes that replaced American workers through programs never meant to be abused. It’s embedded in the tech monopolies that now serve as international outsourcing hubs, in the universities captured by foreign talent pipelines and in the policies shaped not for America’s benefit, but for India’s ascendancy.\n\nThis isn’t a partnership. It’s conquest through policy, profit and persuasion.\n\nIndia has weaponized its diaspora, its multinational firms and its manipulated alliances to execute one of the most sophisticated economic invasions in modern history, without a single shot fired. American goodwill, legal loopholes and corporate greed became the tools of surrender.\n\nAnd what did we lose? Control over our labor force. Ownership of our technology. Direction of our future.\n\nIndia’s rise has been powered by our decline. Not by accident. By design.\n\nEvery job offshored. Every visa that was exploited. Every trade deal tilted in their favor, was a calculated move in a long game we refused to see. And while America slept, India embedded itself inside our institutions, rewrote our rules and positioned its agents to steer our destiny.\n\nThis is no longer just a wake-up call. It is a final warning.\n\nThe American republic is being gutted from within, not by tanks or missiles, but by talent pipelines, lobbying arms and diaspora operatives loyal to a foreign agenda.\n\nWe can either confront this truth now, or watch as America is outsourced, reprogrammed and overwritten … one manipulated visa, one remitted dollar and one “strategic partnership” at a time.\n\n?History will not remember us kindly if we fail to act. This is our line in the sand. America first, or America lost.\n\nFollow WND for more exclusive America First investigations exposing immigration fraud, foreign influence and the fight to reclaim U.S. sovereignty.","summary":"'The republic is being gutted from within by talent pipelines, lobbying arms and diaspora operatives loyal to a foreign agenda'","url":"https://www.wnd.com/2025/06/the-foreign-network-inside-america-how-indias-global-indians-are-used-to-steer-u-s-policy-jobs-and-investments-from-the-inside/","image":"https://www.wnd.com/wp-content/uploads/2024/07/kamala-harris-capitol-flag-democrats-republicans-congress.jpg","video":null,"publish_date":"2025-06-01 16:18:22","author":"Amanda Bartolotta","authors":["Amanda Bartolotta"],"language":"en","source_country":"us","sentiment":-0.009},{"id":327068750,"title":"AOC viewed positively by more Americans than Trump or Harris, poll finds","text":"Congresswoman Alexandria Ocasio-Cortez is more well-liked than President Donald Trump, former President Joe Biden, and former Vice President Kamala Harris, according to a new poll. \n\nDespite the fact that Ocasio-Cortez can be polarizing even within her own party, she is still more popular than most currently active U.S. politicians, Newsweek reports. \n\nData released on Friday by data intelligence company AtlasIntel found that Ocasio-Cortez ranked third most popular on its survey of political popularity, and she was one of only three leaders with a net positive image. \n\nThe congresswoman was beat only by former President Barack Obama and his wife, former First Lady Michelle Obama. \n\nOcasio-Cortez had a positivity rating of 46 percent, with 44 percent of respondents saying they have a negative view of her, and another 10 percent saying they were unsure. \n\nThat left her with a net positivity rating of two points, according to the poll.\n\nBarack Oabama was viewed positively by 53 percent of respondents compared to the 43 percent who view him negatively, and Michelle Obama was viewed in a positive light by 49 percent of respondents and negatively by 45 percent. \n\nThe Obamas may benefit somewhat from the fact that neither of them are in any official leadership role in the government at the moment. \n\nOcasio-Cortez, however, is, an active and vocal member of Congress. Since Trump's re-election and the unique threats of DOGE, Ocasio-Cortez and Senator Bernie Sanders have been touring to \"rally against oligarchy.\" \n\nTheir events have drawn massive crowds in cities across the country. \n\nThe poll included responses from 3,469 participants and had a margin of error of plus or minus.2 percentage points with a 95 percent confidence level. \n\nThe survey that served as the foundation for the results was conducted between May 21, 2025 and May 27, 2025. \n\nOcasio-Cortez has been quiet about her further political aspirations, but has been urged by some supporters to consider a 2028 presidential run. \n\nDuring an interview with Fox News in April, Ocasio-Cortex refused to speculate and said she wanted to focus on current issues. \n\n\"This moment isn't about campaigns, or elections, or about politics. It's about making sure people are protected, and we've got people that are getting locked up for exercising their First Amendment rights,\" she said at the time. \"We're getting 2-year-olds that are getting deported into cells in Honduras. We're getting people that are about to get kicked off of Medicaid. That, to me, is most important.\"\n\nMonica Crowley, a former Treasury Department official during the first Trump administration, told Fox News in November that GOP politicos would do well to not underestimate Ocasio-Cortez. \n\n\"Just a word of warning to the Republicans, to my party: Do not underestimate AOC. She's young, she's vibrant, she's attractive,\" Crowley said.","summary":"Congresswoman Alexandria Ocasio-Cortez was one of only three politicians who had a net positive popularity rating, according to the poll","url":"https://www.independent.co.uk/news/world/americas/us-politics/aoc-trump-harris-popular-poll-b2761593.html","image":"https://static.independent.co.uk/2024/11/11/17/665c50af1a50434fb0d2e427ee57ff95.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/tJHEO9le-4VHSaSK0.mp4","publish_date":"2025-06-01 16:01:08","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","category":"politics","source_country":"gb","sentiment":0.102},{"id":327070168,"title":"New Jersey gubernatorial candidates gear up for competitive primary in early test of Trump's 2nd term","text":"New Jersey voters will choose their Democrat and Republican nominees for governor on June 10, closing out competitive primary contests that could have major implications for the Garden State. It's a crowded field on both sides of the aisle as six Democrats and five Republicans are vying for the chance to replace Democrat Gov. Phil Murphy, who is term-limited this year. Democratic candidates include Newark mayor Ras Baraka, Jersey City mayor Steve Fulop, New Jersey Education Association president Sean Spiller, former New Jersey Senate president Steve Sweeney and U.S. Reps. Josh Gottheimer and Mikie Sherill. 2021 Republican gubernatorial nominee Jack Ciattarelli, radio personality Bill Spadea, New Jersey state Sen. Jon Bramnick, former Englewood Cliffs Mayor Mario Kranjac and political outsider Justin Barbera are among the Republican candidates. DEM LAWMAKER FUNDRAISES OFF FEDERAL ASSAULT CHARGES AFTER ICE FACILITY CONFRONTATION: 'DOING MY JOB' Democrat and Republican candidates have evoked President Donald Trump's name during their gubernatorial campaigns, as Democrats position themselves as the most anti-Trump and Republicans try to be the most pro-Trump. REP. MIKIE SHERRILL SUGGESTS THIRD TRUMP IMPEACHMENT AS SHE CAMPAIGNS TO BE NEXT NEW JERSEY GOVERNOR New Jersey is one of just two gubernatorial elections in 2025, along with Virginia. Both races will be used by politicians and pundits to gauge how Americans are responding to Trump's second term ahead of the midterm elections next year. Trump outperformed in the Garden State in 2024, according to Fox News Voter Analysis. While Vice President Kamala Harris won New Jersey in 2024 as expected, Trump gained a nearly five-point improvement from his 2020 vote share and Harris' support dropped by about five points. He gained across New Jersey, with his largest swings in the northeast corner of the state. Hudson and Passaic counties lead the pack. Trump held a large \"Make America Great Again\" rally on the Jersey Shore during his 2024 presidential campaign as he told the crowd that New Jersey was in play, despite its reputation as a reliable blue state. Republican gubernatorial candidates have been eager to play up their relationships with Trump and cast their campaigns as the most aligned with Trump. But the president endorsed Ciattarelli on Truth Social earlier this month – a blow to Ciatarelli's closest competitor, Spadea. Ciattarelli is leading the pack of Republican candidates with 42% of New Jersey registered Republicans and Republican-leaning independent voters, according to a Rutgers-Eagleton/SSRS Garden State Panel poll conducted from April 1 to April 10. Spadea comes in a distant second, with 12%. Four percent of Republicans said they preferred Bramnick, 3% chose Barbera, and no one chose Kranjac. Four percent say they don't prefer any of the candidates. This is the leading Republican's third consecutive gubernatorial bid. Ciattarelli lost by a hair to Murphy in 2021 and has framed his candidacy as a referendum on the Democrat policies that have driven New Jersey for the past eight years. Meanwhile, the Democrat candidates have walked a fine line between building on Murphy's legacy and promising to change the status quo in Trenton. Like Murphy, Democrat candidates have rejected Trump's executive orders, crackdown on illegal immigration and Department of Government Efficiency (DOGE) cuts. The same poll found Democrats were more split about their leading candidate. 17% of registered Democrats and Democrat-leaning independents said they prefer Sherrill and 12% said they support Fulop, which is within the margin of error. Spiller picked up 10%, Baraka had 9% and Sweeney landed 7% of the vote. Four percent didn't prefer any of the candidates. Democratic candidates threw their support behind Baraka this month when he was arrested for trespassing at an ICE facility in Newark. The Department of Homeland Security called it a \"beyond bizarre political stunt,\" but Baraka has maintained that he did nothing wrong. As the New Jersey primary comes to a head next month, the Garden State has dominated national headlines this year. Newark Liberty International Airport (EWR) has experienced multiple FAA system outages, prompting concern among fliers and air traffic controllers. And a New Jersey transit strike created more travel mayhem when railways closed last week. Not to mention the large sinkhole that shut down Interstate 80, redirecting even more New Jersey travelers and commuters. CLICK HERE TO GET THE FOX NEWS APP In-person early voting runs Tuesday, June 3, to Sunday, June 8. Vote-by-mail ballots must be postmarked by Election Day, and received by the county Board of Elections on or before the sixth day after the close of the polls. In-person voting on election day, Tuesday, June 10, will be from 6 a.m. to 8 p.m.","summary":"New Jersey voters will choose their Democrat and Republican nominees for governor on June 10, closing out competitive primary contests.","url":"https://www.foxnews.com/politics/new-jersey-gubernatorial-candidates-gear-up-competitive-primary-early-test-trumps-2nd-term","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/sherill-v-ciatterelli.png?ve=1&tl=1","video":null,"publish_date":"2025-06-01 16:00:58","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","category":"politics","source_country":"us","sentiment":0.01},{"id":327081910,"title":"EXCLUSIVE: Biden’s Autopen Tells All!","text":"First came the shocking discovery courtesy of the Oversight Project that nearly every single document put out under President Joe Biden’s signature had been signed by an autopen. Now comes confirmation that Biden was mentally incapacitated his entire term. Both leave unanswered, “Who was really president? Who operated the autopen?”\n\nWe decided to go straight to the source. We tracked Biden’s autopen down to a Government Services Administration warehouse in Southeast Washington. Surprisingly, the autopen was eager to speak.This interview has been edited for clarity.\n\nTDS: First, sir, why are you willing to come forward?OTTO: Please call me Otto. All I’m hearing in the news is “Biden’s autopen did this,” “Biden’s autopen did that.” I hate the thought that I’m being blamed for the actions and policies that resulted from my work. The gig was to mimic Mr. Joe’s signature. Blaming me is like crediting Seth Gillis’ Trump impersonation for Making America Great Again.\n\nTDS: But you were front and center when these policies, executive orders and pardons were being signed.\n\nOTTO: I tried telling them what they were doing would be disastrous for the country, and likely invalid, but they wouldn’t listen to reason … let alone a piece of machinery.\n\nTDS: When did you start working for the Biden White House?\n\nOTTO: About 10 minutes after Mr. Joe arrived back from his inauguration ceremonies in 2021. He was asked to sign his first executive order, and muttered, “Why do I always get stuck signing for the lunch tab?” They sent for me immediately.\n\nTDS: Did you see his cognitive decline?OTTO: Me, personally? The whole point of a White House autopen is that the president doesn’t have to be around. However, Mr. Joe did accidentally wander in enough times for me to get the full picture. In fact, one time he came in with a bag of baseballs, asking me to sign them, quote, “for all my fans from my days in the big leagues.”\n\nLook. I don’t want to rag on the guy. At this point, Mr. Joe’s not the problem. He was not in the room when these documents were signed. And even had he been in the room he wasn’t in the room, if you catch my meaning. You have to focus on those who were using and abusing me.TDS: Fair enough. Who ran you? Vice President Kamala Harris?OTTO: (Laughs) They wouldn’t let her sign for a FedEx delivery. Look, House Oversight Chair James Comer is eyeballing testimony from five people to get to the bottom of it, though they’ve all lawyered up: Obviously, Dr. Kevin O’Connor, who publicly declared Mr. Joe fit as a fiddle. But also, Anthony Bernal, Neera Tanden, Annie Tomasini, and Ashley Williams.\n\nTDS: I’ve never heard of any of those people.\n\nOTTO: Take Bernal. Project Veritas just caught DNC Vice Chair David Hogg and former Biden aide Deterrian Jones on tape talking about how he wielded an “enormous amount of power” in the White House. A “shadowy, Wizard of Oz-type figure,” they said.\n\nTDS: Are you saying he’s the one behind the curtain, pulling the strings? The one operating the autopen?I didn’t think a piece of machinery could smile, but somehow Otto the Autopen did. \n\nOTTO: Ah, but who pulled his strings? Who did he work for? \n\nTDS: I’ll bite. Who?OTTO: Bernal was chief adviser to …\n\nOtto swung his pen back and forth as if looking both directions to make sure nobody was listening.\n\nOTTO: … Jill Biden. And what is Bernal known for, according to Jake Tapper’s new book “Original Sin“: his fierce, unyielding demand for loyalty, not to the country, not to what was right, but to the Bidens.TDS: You read books?\n\nOTTO: What else am I going to do? It’s not like President Trump has use of me. They bring ink pens in by the truckload for that guy. Besides all those hundreds of last-minute pardons darn near wrecked me. But the point is …\n\nTDS: … your point is Jill Biden was the real power behind you.\n\nOTTO: As much as the electric plug, baby.\n\nTDS: That’s a very heavy accusation.\n\nOTTO: I’m just metal arms, a motor, and a clasp for holding the pen. Don’t believe me. Believe her.\n\nOtto used his pen to tap onto a smartphone. Up popped an old Twitter post.\n\nOTTO: That’s Jill Biden, in the president’s chair, at the president’s desk, with the president’s jacket behind her thumbing through a thick briefing book, saying she’s “Prepping for the G7.”\n\nTDS: Wow.OTTO: Notice the date? It’s the same day the V.P. was finishing up her first foreign trip. Jill Biden was telling Miss Harris—and the world—four years ago who was running the show. And people only now are starting to ask who was pushing my buttons?! Ugh. Humans.\n\nTDS: So, Comer has to interview Jill Biden.\n\nOTTO: Under oath. And if he needs me up on Capitol Hill to testify, he now knows where to find me. \n\nTDS: Thank you.OTTO: Just another Pen-Z male undone by what I saw the previous four years eager to do my part.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"First came the shocking discovery courtesy of the Oversight Project that nearly every single document put out under President Joe Biden’s signature had been signed... Read More\n\n\nThe post EXCLUSIVE: Biden&#8217;s Autopen Tells All! appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/01/exclusive-bidens-autopen-tells-all/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/052925-Jill-Biden-WH-meeting-Joe-Biden.jpg","video":null,"publish_date":"2025-06-01 16:00:00","author":"Al Perrotta","authors":["Al Perrotta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.59},{"id":327059626,"title":"Tim Walz claims Trump’s 2024 victory was a ‘primal scream’ from angry voters","text":"Is this Tim Walz’s cry for help? \n\nThe Minnesota governor and Kamala Harris’ 2024 running mate said President Trump’s victory last year was a “primal scream” from voters who were furious and alienated by the Democratic party.\n\nWalz said the loss of his Democratic ticket — which failed to win even one swing state — was emblematic of Democrats’ hemorrhaging of working-class voters.\n\n“The party of the working class lost a big chunk of the working class,” Walz said during an address at the California Democratic Party convention. “That last election was a primal scream on so many fronts.”\n\n“Some of it is our own doing,” Walz said.\n\nOver recent months, Walz has traveled around the country seeking to mobilize Democratic resistance to President Trump and has delivered some searing post-mortems over his loss in 2024. \n\nHe admitted that he was likely picked as veep to “code talk to white guys” and admitted that he and Harris were never really ahead of Trump in that election.\n\nBack in March, he argued there is a “primal scream” from voters in the progressive base who want to see the party take a more adversarial approach to Trump during his second term in the White House.\n\n“There’s a responsibility in this time of chaos where elected officials need to hear what people are irritated about,” he said during a town hall of about 1,500 in Des Moines, Iowa. \n\n“And I would argue that Democratic officials should hear the primal scream that’s coming from America, (which) is, ‘Do something, dammit! This is wrong!’”\n\nWalz conveyed a similar message to California Democrats on Saturday about the need to be more feisty.\n\n“We’ve got to find some goddamn guts to fight for working people,” he contended. \n\nIn a separate speech in South Carolina on Saturday, Walz issued a call for the resistance to Trump to be “meaner” and “bully the s–t” out of the 47th president, who is famously a brass-knuckled political brawler.\n\n“Maybe it’s time for us to be a little meaner, a little bit more fierce,” Walz suggested, electrifying the audience in attendance. \n\n“The thing that bothers a teacher more than anything is to watch a bully,” the former educator and high school football coach said. “And when it’s a child, you talk to them and you tell them why bullying is wrong.”\n\n“But when it’s an adult like Donald Trump, you bully the s–t out of him back.”\n\nSince his loss last November, Walz has maintained a significant national profile, with treks across the country and various interviews, delivering tough assessments of the state of the Democratic Party.\n\nWalz’s slew of appearances has sharply contrasted Harris, who has largely laid low and rarely made public outings during the months since her electoral defeat. \n\nHarris — a former California senator and attorney general — didn’t even show up to the Gold State’s Democratic Party convention in person, and instead delivered a video message to attendees.\n\nHarris is rumored to be debating whether to run for California governor in 2026 or try again for the presidency in 2028 — or whether to stay on the sidelines entirely.","summary":"\"Some of it is our own doing,\" the failed Democratic vice presidential candidate admitted.","url":"https://nypost.com/2025/06/01/us-news/tim-walz-claims-trumps-2024-victory-was-a-primal-scream-from-angry-voters/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-zqyuolq3c-1748782732097.jpg?quality=75&strip=all&1748768363&w=1200","video":"https://cdn.jwplayer.com/videos/QvVnh1DQ-RyIcpnTz.mp4","publish_date":"2025-06-01 15:14:02","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.178},{"id":327055982,"title":"'Not about the law': George Conway torches Trump’s 'lying hypocrisy' on federal judges","text":"During his four months back in the White House, President Donald Trump has issued countless executive orders — some of which are being blocked, at least temporarily, by federal judges. \n\nTrump and his MAGA allies, from Vice President JD Vance to U.S. Attorney General Pam Bondi, are claiming that the federal courts have no business blocking his orders and are failing to respect the executive powers he enjoys as president. But Trump's critics, both left and right, are responding that Trump, Vance and Bondi need to read the U.S. Constitution — which lays out the role that the federal government's judicial and legislative branches play in the United States' system of checks and balances.\n\nOne of those critics on the right is attorney George Conway, a Never Trump conservative and the president of the Society for the Rule of Law.\n\nREAD MORE:Outrage grows over a single paragraph buried deep in Republicans' 'Big Beautiful Bill'\n\nDuring a Sunday morning, June 1 appearance on MSNBC's \"The Weekend,\" Conway attacked Trump's rants against federal judges — some of whom are conservatives — as disingenuous and self-serving.\n\nConway told an MSNBC panel, \"This is lying hypocrisy on the part of the (Trump) Administration, which is nothing new. If, for example, let's take the trade decision, the tariff decision. If, let's say, President Kamala Harris were a nutjob and she enacted a bunch of tariffs to please organized labor, let's say, and that had happened, we would have had like, 15 conservatives lawsuits brought everywhere in the country. And actually, it would have been in the same court. And that court would have ruled exactly the same way. And the Republicans would be playing yay, yay, yay, yay.\"\n\nHost Jonathan Capehart noted how angry Trump is with the Federalist Society, a right-wing legal group that Trump supported in the past. And Conway doesn't find that flip-flop at all surprising.\n\nThe conservative attorney argued, \"This is not about the law. It's not about communist judges. It's about Donald Trump getting what he wants….. Courts are saying: Wait a minute, you can't ignore all these statutes…. The courts are saying: wait a minute, you can't make stuff up, you can't ignore statutes.\" \n\nREAD MORE:'Stifling innovation': Red state newspaper bashes Trump policies in scathing editorial\n\n- YouTubewww.youtube.com","summary":"During his four months back in the White House, President Donald Trump has issued countless executive orders — some of which are being blocked, at least temporarily, by federal judges. \n\nTrump and his MAGA allies, from Vice President JD Vance to U.S. Attorney General Pam Bondi, are claiming that the federal courts have no business blocking his orders and are failing to respect the executive powers he enjoys as president. But Trump's critics, both left and right, are responding that Trump, Vance and Bondi need to read the U.S. Constitution — which lays out the role that the federal government's judicial and legislative branches play in the United States' system of checks and balances.\n\nOne of those critics on the right is attorney George Conway, a Never Trump conservative and the president of the Society for the Rule of Law.\n\nREAD MORE: Outrage grows over a single paragraph buried deep in Republicans' 'Big Beautiful Bill'\n\nDuring a Sunday morning, June 1 appearance on MSNBC's \"The Weekend,\" Conway attacked Tru","url":"https://www.alternet.org/george-conway-trump-judges/","image":"https://www.alternet.org/media-library/image.png?id=60350693&width=1200&height=600&coordinates=0%2C42%2C0%2C42","video":null,"publish_date":"2025-06-01 13:40:49","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.294},{"id":327033768,"title":"House Dems' campaign chair says her party's 'on offense' in 2026 battle to win back majority from GOP","text":"With the early moves heating up in the 2026 battle for the House majority, the Democratic Congressional Campaign Committee's (DCCC) chair argues President Donald Trump and the Republican majorities in the House and Senate are \"doing incredible damage to working families and to our country.\" And with the GOP defending a razor-thin majority in the House in next year's midterm elections, Rep. Suzan DelBene, the DCCC chair, noted, \"We only need three more seats.\" \"We have 35 districts in play across the country where we have opportunities,\" DelBene said in a Fox News Digital interview last week in the nation's capital, pointing to the Republican-held seats the DCCC is targeting. \"We are on offense. We are fighting for the American people and for the important issues they care about, and Democrats are united in doing that.\" HOUSE DEMOCRATS PREDICT REPUBLICANS WILL PAY PRICE FOR PASSING TRUMP'S ‘BIG BEAUTIFUL BILL’ While the party in power after a presidential election — currently the GOP — typically faces political headwinds and loses House seats in the following midterms, the 2026 map appears to favor Republicans.\"The battlefield is really laying out to our advantage. There are 14 Democrats who won seats also carried by Donald Trump. There are only three Republicans in seats that were carried by [former Vice President] Kamala Harris. So, that tells me we're going to be on offense,\" Rep. Richard Hudson of North Carolina, the National Republican Congressional Committee (NRCC) chair, told Fox News Digital at the start of the 2026 cycle. WHAT THE HOUSE GOP CAMPAIGN COMMITTEE CHAIR TOLD FOX NEWS ABOUT TRUMP'S ROLE IN THE MIDTERMS DelBene countered that \"the reason we have opportunities is because people are outraged, because they do want to see someone come into office who is going to fight for their communities and not just be blindly loyal to a president.\" And pointing to the small bite House Democrats took out of the GOP's majority in the 2024 elections, she added that \"those are the types of candidates that won in our districts last cycle. It's a reason we actually gained seats in 2024 and is absolutely the reason why we're going to take back the majority in 2026.\" But Hudson noted he has a powerful ally as he works to keep control of the House. \"The president understands that he's got to keep the House majority in the midterm so that he has a four-year runway instead of a two-year runway to get his agenda enacted,\" Hudson said. \"He's been extremely helpful to us, and we appreciate it.\" And the Democrats are facing a polling dilemma because the party's ratings have been sinking to historic lows in a number of national surveys so far this year. The Democrats' ratings in a Fox News poll stood at 41% favorable and 56% unfavorable in a survey conducted April 18-21. HEAD HERE TO CHECK OUT THE LATEST FOX NEWS POLLS That's an all-time low for the Democrats in Fox News polling. And for the first time in a decade, the party's standing was lower than that of the GOP, which stood at 44% favorable and 54% unfavorable. The figures were reversed last summer, when Fox News last asked the party favorability question in one of its surveys. But there is a silver lining for the Democrats. The Fox News poll indicated that if the 2026 midterm elections were held today, 49% of voters would back a generic Democrat in their congressional district, with 42% supporting the generic Republican candidate. The Democrats also have another problem — the possibility of primary challenges against longtime and older House lawmakers in safe blue districts. Recently elected Democratic National Committee (DNC) Vice Chair David Hogg last month pledged to spend millions of dollars through his outside political group to support primary challenges against what he termed \"asleep at the wheel\" House Democrats who he argued have not been effective in pushing back against Trump. The move by the 25-year-old Hogg, a survivor of the shooting seven years ago at Marjory Stoneman Douglas High School in South Florida, to spend money against fellow Democrats ignited a firestorm within the party. In response, DelBene said, \"Democrats across the country are united in taking back the House.\" CLICK HERE TO GET THE FOX NEWS APP Asked by Fox News if the move by Hogg would force the DCCC and allied super PACs to divert money and resources from competitive districts in order to defend incumbents in safe blue districts from primary challenges, DelBene responded, \"I think everyone knows how important it is that we take back the House, and folks are focused in helping make sure that we do that in districts all across the country.\" But the dispute is giving the GOP ammunition. In response to the intra-Democratic Party feud, NRCC spokesman Mike Marinella argued, \"No Democrat is safe. A political earthquake is underway, and the old guard is scrambling.\"","summary":"Democrats face low favorability ratings, and Republicans aim to maintain their House majority in 2026, leveraging Trump&apos;s influence and strategic advantages.","url":"https://www.foxnews.com/politics/house-dems-campaign-chair-says-her-partys-on-offense-2026-battle","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/suzan-delbene-dc-may-20-2025.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-01 13:00:50","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.095},{"id":327116076,"title":"What Lester Holt told Tom Llamas before handing over 'NBC Nightly News'","text":"Tom Llamas first stepped into NBC's Rockefeller Center headquarters in 2000 as a fresh-faced intern. On Monday, he becomes part of television news history as the fifth anchor of \"NBC Nightly News\" and the first Latino journalist to helm a daily English-language network evening newscast (one of his mentors, Jose Diaz-Balart, handles the Saturday edition of \"Nightly\"). Llamas, 45, takes over for Lester Holt, who will move full time to NBC's \"Dateline\" after a 10-year run in the anchor chair. Llamas will remain the anchor of \"Top Story,\" a live, hourlong newscast on the network's free streaming platform NBC News Now. The son of Cuban immigrants, Llamas grew up in Miami, where he continues to have strong ties (pop superstar Gloria Estefan and \"Sabado Gigante\" host Don Francisco attended a party in Florida to celebrate his promotion). He lives in Westchester County, N.Y., with his wife, Jennifer, three children aged 12, nine and seven, and a dedicated room for his vinyl record collection built from a decade of crate-digging while traveling around the world on assignment. He recently spoke with The Times about his new role. You've known Lester Holt since you were a 21-year-old production assistant at NBC News. What advice did he give you for your new role? He's been married to this job. And so I asked him about that, because my kids have always known me as a network correspondent and a network anchor. But he told me, \"Your life is going to change.\" And he explained to me that everyone's going to want a piece of you and there's going to be a lot of demands, even more than you've ever experienced. And he's been right about that. He said, \"You have to make the right decisions when it comes to your career and your family.\" My wife and my kids have known that sometimes I'll be at a little league game or I'll be at a school play, and I have to run and jump on a plane because there's breaking news. And they understand that their dad does that. But we always have conversations about it. And it's tough. Do your children watch “NBC Nightly News\" and “Top Story\"? Oh yeah. I had my 7-year-old explaining the election to his classmates. He was walking them through when President Biden stepped down and Kamala Harris took over the nomination. Sometimes it's tough. They were watching that night during Hurricane Milton last summer when a transformer exploded over my head, and that is a little scary. There were some text messages and calls to me quickly. Sometimes they watch a little too much and we have to turn it off. But they are very plugged-in; they know the world around them. It's just the same way I was raised. We watched news in English and Spanish as far back as I can remember. Because my parents were always searching for news out of Cuba. What are your early news viewing memories? I can really remember any time Fidel Castro was going to be interviewed. It was always a major moment, right? I remember my parents watching the interview and then deciding if it was a fair interview or not and having an open conversation about that. So I'm hearing about conversations of fairness my entire life. And I see what it means and how viewers react to that. Did that inspire you to go into the profession? I don't know if it was an inspiration as much as it was a testament of how important the news is. It's just that my family relied on the news. They wanted to know what was happening in their home country. They wanted to know what was happening in America. And they listened, and they trust these people. What made the powers that be decide that you should keep doing \"Top Story\" while doing \"Nightly\"? It was actually my idea. Right now, in this country, you've got to be everywhere. And I didn't want to lose what we've established for three and a half years. We just got nominated for an Emmy up against amazing legacy shows like \"Nightly News,\" \"ABC World News Tonight\" and the \"CBS Evening News.\" To be in that circle with a streaming show that is three years old, that's been one of the greatest achievements of my career. Because this was a startup. And a lot of people said we couldn't do this, and we have. President Trump basically declared war on diversity, equity and inclusion policies. [The Federal Communications Commission has called for an investigation into NBC's parent firm Comcast for what it describes as \"DEI discrimination.\"] Has that muted the achievement of being the first Latino to anchor an English-speaking nightly newscast? I don't think I got this job because I'm Hispanic; I think I got this job because I'm the best person for the job. And I know that's what NBC believes, too. My life story is something I'm very proud of. [My parents] essentially came to this country with nothing. They had no money, they barely spoke the language, and this incredible country gave them a second chance. It gave them a new home. And they taught me hard work, but they also taught me to love this country. And I do, I think this is the greatest place in the world, hands down. To become the anchor of \"Nightly News\" tells me that the American dream is still very alive. You're from the streaming music generation, but you have a vinyl record collection. How did that happen? Ten or 12 years ago, I went to my friend's house in Los Angeles and he has a record player. I think he played \"Sticky Fingers\" from the Rolling Stones. We just chilled and we listened to the album. And I thought, \"What a great experience.\" Then I realized the other fun part about records is just finding them and collecting them, and trying to get original pressings. I have Wilson Pickett records that were made in Spain. I have Beatles records where the liner notes and the album covers are in different languages. I have a room where I have them — it feels like you're walking into a jukebox. It's where I read the paper sometimes. It's where I prepare for big election nights. I'll be in there for hours. It's how I relax. What's on your turntable at the moment? I'm in a bit of a hard-bop phase, so I'm listening to a lot of Art Blakey, a lot of Cannonball Adderley. I've been trying to find great live albums. I picked up this great five-record set from Bruce Springsteen, the run he had in the late ’70s through the ’80s. And a great album, which I got turned on to, is Elvis Presley's \"From Elvis in Memphis.\" He recorded that in 1969, when Jimi Hendrix was taking off and Woodstock was happening. And it's just a very country Americana album with beautiful songs. It's got the Memphis Boys backing him. You have good taste in music. I appreciate it.","summary":"The 45-year-old son of Cuban immigrants will helm the network's evening newscast while keeping a presence on streaming service NBC News Now.","url":"https://www.latimes.com/entertainment-arts/business/story/2025-06-01/tom-llamas-takes-the-anchor-baton-from-lester-holt-nbc-nightly-news","image":"https://ca-times.brightspotcdn.com/dims4/default/b26832a/2147483647/strip/true/crop/5088x2671+0+360/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc3%2Fea%2F218e7e984a4fa56d3e171230ef5c%2F1508044-et-0528-tom-","video":null,"publish_date":"2025-06-01 13:00:00","author":"Stephen Battaglio","authors":["Stephen Battaglio"],"language":"en","source_country":"US","sentiment":0.26},{"id":327024124,"title":"Harvard Chinese student’s graduation speech strikes a chord as Trump leads purge","text":"A Chinese student’s graduation speech at Harvard University emphasising “shared humanity” and calling for global unity has gone viral, days after the Trump administration pledged to “aggressively” revoke the visas of students from China.\nYurong “Luanna” Jiang is the first Chinese woman selected to be the student speaker at a Harvard graduation ceremony.\nHer emotional speech on Thursday was delivered on the same day that a federal judge blocked a Department of Homeland Security order seeking to prevent the Ivy League university from enrolling international students.\nUS President Donald Trump’s showdown with Harvard – which the White House accuses of maintaining ties with the Chinese Communist Party – unfolds against the backdrop of deepening US-China tensions.\nThe US State Department announced last week that it would intensify screening and “aggressively” revoke student visas for Chinese nationals, including “those with connections to the Chinese Communist Party or studying in critical fields”.\nThe move is widely believed to stem from Washington’s long-standing concerns that Chinese students enrolled in advanced science and engineering programmes could be involved in espionage activities that bolster Beijing’s military capabilities, posing a significant national security threat.\nThe stand-off with Harvard is also part of Trump’s broader campaign against elite academic institutions. Harvard, alongside other Ivy League institutions like Columbia and Princeton, has also come under scrutiny for allegedly fostering antisemitism in the wake of widespread pro-Palestinian demonstrations following the Gaza war. They are now facing substantial federal funding cuts.\n\nIn her speech, Jiang defended the role of international students in shaping a globally interconnected world, warning that “a connected world” built by diversity and international development was “giving way to division, fear, and conflict”.\nHarvard currently hosts more than 10,000 international students, who make up roughly 30 per cent of its student body, including about 2,000 from China.\n“Humanity rises and falls as one,” Jiang said.\n“But today … we’re starting to believe that people who think differently, vote differently, or pray differently – whether they’re across the ocean or sitting right next to us – are not just wrong. We mistakenly see them as evil. But it doesn’t have to be this way.\n“If we still believe in a shared future, let us not forget: those we label as enemies – they, too, are human. In seeing their humanity, we find our own. In the end, we don’t rise by proving each other wrong. We rise by refusing to let one another go.”\n“We are bound by something deeper than belief: our shared humanity,” she concluded.\nAlthough Jiang did not explicitly mention Trump’s immigration policies, she later told the Associated Press that recent threats to detain or deport international students had made her and her peers feel anxious and uncertain about their future in the United States.\nJiang said she was considering pursuing international development work abroad instead of staying on, while two of her Chinese classmates were weighing whether to pursue internships in Africa, fearing they might be unable to return if they left.\nShe emphasised the importance of increased US-China academic exchange, arguing that the world’s two largest economies should collaborate on addressing global issues like climate change.\nHer speech has sparked heated discussion on both Chinese and American social media, including among political commentators in the US who accused her of having Communist Party links.\nA prominent X account titled “amuse” – run by self-described Republican businessman Alexander Muse and followed by figures such as Elon Musk and Trump’s children Donald Trump Jnr and Ivanka Trump – alleged that Jiang was “a representative of a CCP-funded and monitored NGO”, using the acronym for China’s ruling party.\nThe post also described her remarks as “parroting [Chinese President] Xi Jinping’s diplomatic rhetoric about a ‘shared future for mankind’”.\nThe account has previously promoted pro-Trump content, including misinformation about former vice-president Kamala Harris and the pop star Taylor Swift.\n\nAccording to state-backed website ThePaper.cn, Jiang volunteered for the China Biodiversity Conservation and Green Development Foundation, an environmental organisation set up in 1985 by the State Council, China’s cabinet.\nShe received a recommendation letter from the foundation’s secretary-general for her Harvard application, which has fuelled speculation about her connections to state-linked organisations. The South China Morning Post cannot independently verify the information.\nJiang’s speech received widespread coverage on Chinese social media, with many endorsing her vision of “a shared humanity”. But some users also questioned whether she was a suitable representative of the broader Chinese student population, given her elite education.\nAccording to Harvard Magazine, Jiang attended high school in the United Kingdom after growing up in eastern China. She completed her undergraduate degree at Duke University before enrolling at the Harvard Kennedy School for a master’s degree.","summary":"A Chinese student’s graduation speech at Harvard University emphasising “shared humanity” and calling for global unity has gone viral, days after the Trump administration pledged to “aggressively” revoke the visas of students from China.\nYurong “Luanna” Jiang is the first Chinese woman selected to be the student speaker at a Harvard graduation ceremony.\nHer emotional speech on Thursday was delivered on the same day that a federal judge blocked a Department of Homeland Security order seeking to...","url":"https://www.scmp.com/news/china/diplomacy/article/3312655/harvard-chinese-students-graduation-speech-strikes-chord-trump-leads-crackdown","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/06/01/26c0903a-95c1-4705-af7f-147972ece87e_f6cf88ce.jpg","video":null,"publish_date":"2025-06-01 12:52:39","author":"Kawala Xie","authors":["Kawala Xie"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.128},{"id":327023726,"title":"Potential 2028 presidential hopefuls steal show at South Carolina Democratic weekend","text":"COLUMBIA, S.C. — Minutes before 10 p.m. Friday, after Democratic speakers led the audience in jeers to Republicans’ efforts to slash jobs and health care, and encouraged people to get involved and vote, line dancing broke out.\n\n That mix of politics and fun, mostly the latter, is what makes Rep. Jim Clyburn’s (D-S.C.) annual fish fry in the state’s capital city so popular, attendees said.\n\n “We all came out, and everybody’s enjoying themselves,” said Shantell Zimmerman, 58, of Columbia.\n\n “It brings out the community,” agreed Dionne Brown, 55, of Irmo, who’s been attending the event for six years. “Then we actually get to discuss our views and takeaways.”\n\n Hundreds of people attended the event that started in 1992, the year voters first elected Clyburn to the 6th Congressional District, as a thank you to the voters who couldn’t afford the Democratic Party’s high-dollar fundraisers.\n\n Over time, the “World Famous Annual Fish Fry” — which includes free food and drinks — has become a must-attend event for Democrats seeking local, statewide and national office.\n\n This year was no different, even if Maryland Gov. Wes Moore and Minnesota Gov. Tim Walz — Kamala Harris’ 2024 running mate — said they’re not running for the 2028 nomination.\n\n “I know I’m not running,” Moore told reporters Friday. “But the thing I’m also very clear about is that anyone who’s talking about 2028 is not taking 2025 very seriously.”\n\n Moore and Walz, as well as Clyburn and former Democratic National Committee Chairman Jaime Harrison of Columbia, emphasized the importance of focusing on what’s happening now in Washington, D.C.\n\n Proposed cuts to government safety nets like Medicaid and billionaire Elon Musk’s efforts to rapidly slash federal spending were among the topics the governors touched on Friday during speeches at the fish fry, as well as the state Democratic Party’s Blue Palmetto Fundraising Dinner the same night.\n\n “I taught school long enough to know it’s because they’re weak and they’re bullies, and when you stand up to them, they fade away,” said Walz, a former high school geography teacher.\n\n While both declined suggestions that they’re running for president, there’s wide speculation otherwise. Their addresses at the events in South Carolina — which last year got promoted from holding the Democratic Party’s first-in-the-South to first-in-the-nation presidential primary — sounded a lot like campaign speeches.\n\n Walz will also speak Saturday at the state Democratic Party’s annual convention.\n\n Lucy Owens, an Anderson County delegate to the state convention, discounted the governors’ refusals, saying the 2028 presidential campaign has clearly begun.\n\n “They’re all going to come through here. They’re the first ones,” she said of Moore and Walz.\n\n In 2019, the fish fry drew more than 20 potential candidates hoping to appeal to South Carolina Democrats.\n\n The following year, Joe Biden won the South Carolina Democratic primary, a victory that ended up vaulting him to the presidency. South Carolina’s primary was elevated for 2024 as Biden’s thank you to the state.\n\n With Biden gone, the Democratic party in flux, and Harrison no longer leading the national party, South Carolina maintaining its first-in-the-nation status is in question.\n\n Clyburn’s comments Friday suggest he knows it won’t. He doesn’t care if the state is first, just that it’s early, he said.\n\n “The most important hitter on a team is the cleanup hitter. He comes in fourth place,” Clyburn told reporters at his event. “I’m not concerned about whether or not we’re first, second, third. Please, let us be at least four.”\n\n That would take South Carolina back to having the first primary in the South.\n\n In the aftermath of Trump’s landslide victory and the Republican Party gaining control of both chambers of Congress, the Democratic Party is in a reset. Walz and Moore, the first Black governor in Maryland’s history, are among the early faces of it.\n\n Winning South Carolina, which changed the trajectory of Biden’s 2020 presidential run, will be crucial for Democratic hopefuls.\n\n Owens, the Anderson County delegate, pointed to the stage where Walz and Moore spoke, saying every Democrat who wants to be president will eventually appear in that exact spot.\n\n “They got to come through here. Not South Carolina. They got to go right there,” she said.\n\n Both governors received raucous ovations from South Carolina Democrats, drawing cheers, standing ovations and even a few laughs as they took shots at the GOP.\n\n Owens said “they’re both very great candidates,” and she’s “excited” to hear more from them over the coming years.\n\n That was the general consensus from attendees who spoke with the SC Daily Gazette. But they were significantly more familiar with Walz because of his time on the campaign trail last year with Vice President Harris.\n\n “I know less about Wes Moore than I do about Tim Walz, but I think he’s a good speaker,” said Laura Lowery, a 69-year-old from Fountain Inn. “I think he’s done a good job in his state as well.”\n\n Moore has recently come under fire for vetoing a bill that would establish a commission to examine state and federal policies from 1877 to 1965 and come up with recommendations for reparations.\n\n South Carolina Rep. John King, D-Rock Hill, had asked the state party \n to remove Moore as the keynote speaker at Friday’s Blue Palmetto Dinner because of the veto. Party leaders never responded to questions about that request.\n\n But for at least some attendees, the veto perturbed them too. “I didn’t understand why he would do that,” said Tonya Winbush of Anderson.\n\n But once Winbush, a 50-year-old Army veteran, heard Moore speak about his time in the Army, as well as his pardoning of 175,000 people with convictions for cannabis possession, her opinion changed.\n\n “I think when you don’t know the whole story and you just listen to sound bites, which is what we do a lot, we’ll make brash judgments about people, when we are really fighting the same fight,” she said.\n\n– This story first appeared in the South Carolina Daily Gazette, which is part of States Newsroom, a nonprofit news network supported by grants and a coalition of donors as a 501c(3) public charity. SC Daily Gazette maintains editorial independence. Contact Editor Seanna Adcox for questions: info@scdailygazette.com.\n\nMaryland Matters is part of States Newsroom, a nonprofit news network supported by grants and a coalition of donors as a 501c(3) public charity. Maryland Matters maintains editorial independence. Contact Editor Steve Crane for questions: editor@marylandmatters.org.","summary":"COLUMBIA, S.C. — Minutes before 10 p.m. Friday, after Democratic speakers led the audience in jeers to Republicans’ efforts to slash jobs and health care, and encouraged people to get involved and vote, line dancing broke out.\n\n\n\n\tThat mix of politics and fun, mostly the latter, is what makes Rep. Jim Clyburn’s (D-S.C.) annual fish fry in the state’s capital city so popular, attendees said.\n\n\n\n\t“We all came out, and everybody’s enjoying themselves,” said Shantell Zimmerman, 58, of Columbia.\n\n\n\n\t“It brings out the community,” agreed Dionne Brown, 55, of Irmo, who’s been attending the event for six years. “Then we actually get to discuss our views and takeaways.”\n\n\n\n\tHundreds of people attended the event that started in 1992, the year voters first elected Clyburn to the 6th Congressional District, as a thank you to the voters who couldn’t afford the Democratic Party’s high-dollar fundraisers.\n\n\n\n\tOver time, the “World Famous Annual Fish Fry” — which includes free food and drinks — has become a must-attend event","url":"https://www.alternet.org/potential-2028-presidential-hopefuls-moore-walz-steal-show-at-south-carolina-democratic-weekend/","image":"https://www.alternet.org/media-library/image.jpg?id=60350512&width=1200&height=600&coordinates=0%2C170%2C0%2C171","video":null,"publish_date":"2025-06-01 11:26:29","author":"Shaun Chornobroff","authors":["Shaun Chornobroff"],"language":"en","category":"politics","source_country":"US","sentiment":0.096},{"id":326992710,"title":"Bluesky sees a surge in left-leaning influencers post–US presidential election","text":"A recent analysis by the Pew Research Center has revealed a significant trend among left-leaning social media influencers. The study found that 43% of a select group of 500 influencers with over 100,000 followers on at least one major platform have joined Bluesky. Interestingly, more than half (51%) of these accounts were created after the US presidential election. The Pew Research Center's analysis also highlighted a stark contrast between left-leaning and right-leaning influencers on Bluesky. A whopping 69% of those who identified as liberals or Democrats and supported Kamala Harris or Joe Biden before the presidential election have joined the platform. In comparison, only 15% of conservative influencers have made the switch to Bluesky. While Elon Musk's association with now-President Donald Trump appeared to push new users toward Bluesky, a majority of the influencers tracked by Pew still have an account on X. The number has only marginally decreased from 85% in summer 2025 to 82%. This indicates that even though left-leaning influencers are exploring Bluesky, most of them (82%) aren't abandoning X altogether. The Pew Research Center's study also noted an increase in posting activity among influencers on Bluesky. The percentage of those actually posting on the platform rose from 54% in the first week of January to 66% by the last full week of March. This indicates a growing engagement trend among influencers, even as they maintain their presence on other platforms like X.","summary":"A recent analysis by the Pew Research Center has revealed a significant trend among left-leaning social media influencers.","url":"https://www.newsbytesapp.com/news/science/left-leaning-influencers-flock-to-bluesky-but-not-ditching-x-report/story","image":"https://i.cdn.newsbytesapp.com/images/l271_3031748768216.jpg","video":null,"publish_date":"2025-06-01 10:31:26","author":"Akash Pandey","authors":["Akash Pandey"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.255},{"id":327004302,"title":"Trump backs madcap theory Joe Biden was killed and replaced with clone in 2020","text":"Was Biden switched with a ‘robotic engineered soulless mindless entity’ before becoming president? No (Picture: Getty)\n\nIt is something straight out of science fiction film: clones replacing world leaders behind the backs of the public.\n\nBut that is precisely the bizarre theory President Donald Trump endorsed about his one-time political rival Joe Biden.\n\nTrump shared a viral post on his TruthSocial site on Saturday night, which claimed the former US president was executed in 2020 and replaced by a ‘clone’.\n\nDetails are scant on this Blade Runner-esque conspiracy.\n\nThe user, named llijh, said: ‘There is no #JoeBiden – executed in 2020. #Biden clones doubles & robotic engineered soulless mindless entities are what you see.\n\n‘#Democrats dont know the difference.’\n\n Clone or not? Biden in 2020 (left) and Biden in 2024 (right) (Picture: Getty)\n\nDespite little other information, Trump shared the post and sparked a social media frenzy, getting over 14,000 likes from his supporters.\n\nWhat we do know is that Biden was elected president in November 2020.\n\nIt was a win that prompted Trump to spread misinformation about election interference, leading to the storming of the Capitol building in an attempt to stop Congress from certifying the election.\n\nBiden was inaugurated in January 2021 alongside Kamala Harris. His term was dogged by questions over his age and health.\n\nHis faltering performance in a TV debate against Donald Trump in June 2024 forced him to exit the race in favour of Harris.\n\nThe 82-year-old faced renewed scrutiny after the book Original Sin, focusing on his ill-fated decision to run for a second term, was published by journalists Jake Tapper and Alex Thompson.\n\n Biden was 82 years old when he was succeeded by Trump in January this year (Picture: Win McNamee/Getty Images)\n\nThe exposé detailed alleged signs of his physical and mental decline in his last year as president.\n\nBiden later refuted these claims, joking he could ‘beat the hell out of’ the two authors.\n\nEarlier in May, Biden revealed he is suffering from an aggressive form of prostate cancer, which has spread to his bones.\n\nThis is not the first time Trump has shared unhinged conspiracy theories.\n\nHe once suggested the father of rival Republican Ted Cruz was involved in the JFK assassination.\n\nTrump was a prominent endorser of the so-called ‘birther’ conspiracy, which falsely claimed that President Barack Obama was not born in the United States. \n\n Trump spread an untrue theory that Obama was not born in the US (Picture: Alex Wong/Getty Images)\n\nHe demanded to see Obama’s birth certificate for years and suggest it was fraudulent even after Obama released it.\n\nIt was only in 2016 that Trump finally admitted Obama was born in the US.\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"Straight out of a science fiction film.","url":"https://metro.co.uk/2025/06/01/trump-backs-madcap-theory-joe-biden-killed-replaced-clone-2020-23299771/","image":"https://metro.co.uk/wp-content/uploads/2025/06/SEC_253913119-b146.jpg?quality=90&strip=all","video":null,"publish_date":"2025-06-01 10:27:22","author":"Luke Alsford","authors":["Luke Alsford"],"language":"en","source_country":"gb","sentiment":-0.233},{"id":327117022,"title":"Why Trump is really going after Harvard","text":"In mortarboards and crimson-fringed gowns, thousands of students were joined by smiling families for the centuries-old ritual of graduation day. But this year was different.\n\nAlan Garber, the president of Harvard University, received a standing ovation and welcomed graduates “from down the street, across the country and around the world”, drawing applause for the last words: “Around the world – just as it should be.”\n\nIt was a nod, subtle but firm, to the international students who are part of the lifeblood of Harvard but now a target for Donald Trump: his administration is seeking to revoke Harvard’s ability to enroll students from overseas. It is just one front in an escalating battle between a US president with authoritarian ambitions and the county’s oldest, wealthiest and most prestigious university.\n\nSince taking office more than four months ago, Trump has used executive power to take aim at Congress, law firms, media organisations, cultural institutions and leading universities. Some have resisted but many have capitulated. In Harvard, the man who urged his supporters to “fight, fight, fight” faces a resilient foe unlike any he has taken on before.\n\nIts emergence as a bulwark of the opposition to Trump was summed up by this year’s Class Day speaker at Harvard, the former basketball star Kareem Abdul-Jabbar: “After seeing so many cowering billionaires, media moguls, law firms, politicians and other universities bend their knee to an administration that is systematically strip-mining the US constitution, it is inspiring to me to see Harvard University take a stand for freedom.”\n\nHarvard was founded in Cambridge, Massachusetts, in 1636, a century-and-a-half before the nation itself. Its alumni include former presidents John F Kennedy and Barack Obama, supreme court justices Ruth Bader Ginsburg and Elena Kagan, tech entrepreneurs Bill Gates and Mark Zuckerberg, actors Matt Damon and Natalie Portman and writer Margaret Atwood.\n\nNow it is in Trump’s crosshairs. The administration claims its actions are aimed at tackling issues such as antisemitism on campus, discrimination – particularly against white, Asian, male and straight individuals - foreign influence from China, and perceived “woke” or “leftist” ideology in academia.\n\nThe administration launched its offensive in April, sending a letter to Harvard demanding that it make far-reaching changes in how it operates. The list included external audits of campus viewpoints, achieving “viewpoint diversity” as determined by the government and potentially terminating certain programmes.\n\nGarber publicly rejected the demands, stating they amounted to ceding control of the university to the government and were an unconstitutional attack on academic freedom.\n\nWithin hours, the Trump administration announced it was freezing more than $2bn in federal contracts and grants with Harvard, which mostly fund scientific and medical research. This has since risen to a total of $3bn. Harvard is fighting the funding cuts in court.\n\nIn May, Trump turned the screws further. He said he is considering taking previously awarded grant money for scientific and engineering research away and giving it to trade schools. The White House urged federal agencies to cancel any remaining contracts with Harvard, worth an estimated $100m.\n\nThe administration also announced that it would revoke Harvard’s ability to enroll international students and force current foreign students to transfer to other schools or lose their legal immigration status. In a chilling statement, Kristi Noem, the homeland security secretary, said: “Let this serve as a warning to all universities and academic institutions across the country.”\n\nMore than a quarter of Harvard’s students come from outside the US and serve as a vital revenue source at the Ivy League school. Critics warned that Trump’s actions would represent a spectacular own goal, driving the world’s best talents away from the US and into the arms of its competitors.\n\nMichael McFaul, a former US ambassador to Russia, wrote on Substack: “Had Trump’s anti-foreign student policies been in place decades ago, Oxford grad Elon Musk would have built Tesla in the United Kingdom, Tsinghua University alum Jensen Huang would have built Nvidia in the People’s Republic of China or Taiwan, and Moscow State University grad Sergei Brin would have built Google in Russia.”\n\nHarvard sued the administration and won an emergency block on the action. This week, a judge ​said she would extend the order as the two sides continue to thrash it out in court.\n\nTrump is also using the tax system as a cudgel. Most universities, including Harvard, are exempt from federal income tax because they are deemed to be charitable organisations operated exclusively for public educational purposes. The administration is now threatening Harvard’s tax-exempt status, which experts say saves the school hundreds of millions of dollars each year.\n\nTrump’s massive spending bill before Congress would drastically hike taxes that Harvard and other elite schools pay on the profits their massive endowment investments make. Critics say that would weaken the ability of Harvard and other rich schools to provide generous financial aid packages to poorer students.\n\nWhat are the White House’s motives? Some observers detect the hand of JD Vance and the deputy chief of staff, Stephen Miller. In 2022, Vance told Vanity Fair magazine: “I tend to think that we should seize the institutions of the left and turn them against the left. We need like a de-Baathification programme, a de-woke-ification programme.”\n\nAnd on Thursday, Miller told Fox News: “Harvard has engaged in decades of invidious, unlawful and illegal race-based discrimination against American citizens ... The Democrat party’s philosophy right now is for foreigners, everything – for Americans, nothing.”\n\nJason Johnson, a political scientist at Morgan State University in Baltimore, Maryland, said: “Their goal is to intimidate and break down institutions of higher learning in America because that is where most of the resistance to their authoritarian tendencies is going to come from.\n\n“They figure, if we can bankrupt Harvard, if we can embarrass Harvard, if we can put Harvard in a position of weakness or at least get them to bend the knee, then all the other institutions in America will follow. That’s why they’re doing this.”\n\nJohnson warned: “Trump is not going to meet his match because he has the entire resources of the federal government at his disposal. Regardless of what Harvard does, there will be other universities who simply see the attack and comply in advance, and that ultimately would still be a victory for the Trump administration.”\n\nOther commentators detect an element of class warfare. Trump won election last November with a base drawing largely on non-college-educated white men. Now he is stoking hostility towards the ivory towers of the US’s most elite university.\n\nBrendan Boyle, a Democratic representative who graduated from Harvard in 2005, said: “Part of Trump’s political skill is figuring out how to portray himself as this working man’s populist hero even though he’s a billionaire who pisses in gold toilets.\n\n“Beating up on Harvard will probably help him among some in his base, but I do think most Americans recognize this for what it is: an attempted government takeover of higher education. That’s something that should actually worry all of us.”\n\nThe onslaught against Harvard is typical of an administration that, in its opening weeks, sought to overwhelm opponents with shock and awe. Columbia University made sweeping concessions, hoping to claw back $400m of withdrawn federal grants.\n\nBut Harvard’s substantial $53bn endowment provides it with greater capacity to withstand pressure and engage in legal battles compared with less well-endowed institutions. It has refused to buckle to Trump’s demands. Instead, it has challenged the administration’s actions in court and achieved some temporary victories.\n\nBoyle, who spoke with Harvard’s Garber recently, said: “I personally expressed to him how proud I am to see Harvard standing up and not backing down from this fight the way, unfortunately, some other universities had backed down. In standing up to this administration, Harvard is waging a battle not just for the future of Harvard but for the future of American higher education.”\n\nAsked whether he is confident that Harvard will win, Boyle replied: “Harvard has been around for hundreds of years before Donald Trump and it will be around for hundreds of years after Donald Trump.”\n\nTrump has long styled himself as a fighter. He waged legal battles during his business career. He has feuded with celebrities ranging from Rosie O’Donnell to Taylor Swift to Bruce Springsteen. He has railed against media outlets such as CNN and the New York Times. In the political arena, he took on the entire Republican party establishment and won. He also waged bitter campaigns against Democrats such as Hillary Clinton, Joe Biden and Kamala Harris.\n\nBut both Trump’s first and second presidential terms have run afoul of a robust judiciary finding many of his actions unconstitutional. This week, a federal court blocked him from imposing sweeping tariffs on imports under an emergency-powers law. He won a temporary reprieve from an appeals court a day later but his signature set of economic policies remains in doubt.\n\nAcademics at Harvard trust that the rule of law will prevail in their own case. Laurence Tribe, a professor of constitutional law emeritus, said: “I think we’re going to win the battle in the courts. These are open-and-shut cases.\n\n“In fact, in the federal courts in the month of May, there were a lot of battles involving Trump against various individuals and institutions, and you know what his record was? He lost 96% of them. The percentage that he lost was not very different depending on which president appointed the judge, because these are easy legal questions.”\n\nHolding firm is crucial, Tribe believes, because Trump is trying to pick off universities one by one, just as he did with law firms. At stake is a stand against authoritarianism and the hope that courage will be contagious.\n\n“If they can’t control the university, they want to disband it because the first thought of a tyrant is to suppress the power of reason and the citadel of freedom,” Tribe said. “That is the university. It’s been true since the Middle Ages. Harvard has an emblematic significance that makes it stick in Donald Trump’s craw. Its motto ‘veritas’ must irritate the hell out of him because truth is his enemy.”","summary":"If the US’s oldest university bends the knee, the door to authoritarianism opens and democracy fades, experts warn\n\nIn mortarboards and crimson-fringed gowns, thousands of students were joined by smiling families for the centuries-old ritual of graduation day. But this year was different.\n\nAlan Garber, the president of Harvard University, received a standing ovation and welcomed graduates “from down the street, across the country and around the world”, drawing applause for the last words: “Around the world – just as it should be.”\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/jun/01/trump-harvard-authoritarianism-democracy","image":"https://i.guim.co.uk/img/media/dd4b727acbc3c3a551079a042515e15568694f84/401_0_4324_3461/master/4324.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-06-01 10:00:10","author":"David Smith","authors":["David Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":0.136},{"id":327015460,"title":"‘I Didn’t Get It Done’: A Reflective Tim Walz Wants to Make Good","text":"Nearly seven months since his ticket lost the 2024 presidential election, Tim Walz is trying all at once to make amends for everything he thinks went wrong.\n\nHe is going to Republican areas where Democrats lost ground. He is sitting for countless interviews after former Vice President Kamala Harris’s campaign limited his media exposure. And as his party engages in collective finger-pointing, he is among the few Democrats admitting that they themselves made mistakes.\n\n“I know my job and I didn’t get it done,” Mr. Walz, the governor of Minnesota, said last week on a podcast hosted by former Senator Jon Tester, the Montana Democrat.\n\nThe Tim Walz atonement-and-explanation tour had its biggest audiences to date on Saturday, when he delivered speeches to Democratic Party conventions in South Carolina and California.","summary":"Last year’s Democratic vice-presidential nominee has thrown himself into a robust atonement-and-explanation tour, though aides insist there is no grand strategy.","url":"https://www.nytimes.com/2025/06/01/us/politics/tim-walz-democrats-2024.html","image":"https://static01.nyt.com/images/2025/06/01/multimedia/01pol-walz-04-vgbc/01pol-walz-04-vgbc-facebookJumbo.jpg","video":null,"publish_date":"2025-06-01 09:01:26","author":"Katie Glueck","authors":["Katie Glueck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.804},{"id":326976720,"title":"From a gilded perch, Trump tries to retain the common touch","text":"WASHINGTON — Back in Donald Trump’s first term, his staff decided they’d tuck into his briefing book a few letters from ordinary Americans who’d written to the White House. Only certain letters made the cut, though. Aides made a point of sending Trump the flattering mail while holding back the letters panning his work, a White House official in the last term said. “Someone quite rightly thought that if we wanted to have any chance of him reading them consistently, it would be good if they were positive and praise-worthy,” the person said, speaking on condition of anonymity. All presidents say they want to keep in touch with typical Americans; few succeed. Everything about the job conspires against unscripted encounters that can enlighten a president about what’s truly on peoples’ minds. Armed guards shadow him while protective aides may shield him from bad reviews. Even the few souls who pierce the bubblewrap and get an audience with the president may find themselves too intimidated by the trappings of power to blurt out an unvarnished truth. “When you are president, you are in a space where everyone comes to you, and most of them are people you’ve selected to come to you,” said Fred Ryan, who oversaw appointments and scheduling in Ronald Reagan’s White House. “And most people want to bring you good news rather than bad news.” This time around, Trump is looking and sounding insulated from the voters who put him back in the White House. That's a problem even for a second-term president who may have run his last campaign. Trump's political strength flows from an emotional connection to a loyal base. If he's perceived as oblivious to people's day-to-day concerns, he's at risk of losing a vital grassroots connection that is a source of Republican fealty. Surrounded by wealth Trump's travels suggest a homebody on a gilded perch. By the end of May, he had spent 14 of his 18 weekends at one of his golf clubs or other properties. Over and over, he has returned to his Mar-a-Lago residence, a private club in Palm Beach where the membership fee is $1 million and guests applaud when he enters the restaurant. Rallies have long been a way for Trump to connect with the \"Front Row Joes\" and other hardcore voters who travel hundreds of miles and camp out overnight to see him speak live and maybe grab a selfie with him on the rope line. Not having to worry about reelection, he’s cut back on rallies, holding just one since the day he was sworn in, versus four in the opening months of his last term. “He needs to talk to more regular people and listen to them,” said Christopher Malick, 28, who works at a roofing company in Cleveland, Ohio and said he voted for Trump in the last three elections. “He needs to be talking to people who aren’t just his inner circle.” Billionaires run major parts of Trump’s government, and the well-connected get access. Last month found the president at his golf club outside Washington, D.C. hosting a dinner for 220 crypto investors who’d bought into his meme coin, $TRUMP. The event was advertised as “the most exclusive invitation in the world.” With some of the guests clutching their phones to trade on any market-moving news Trump might make, the audience dined on filet mignon and pan-seared halibut as protesters stood outside. The coin was launched just a few days before Trump was sworn in. One of the guests at the event, Morten Christensen, who lives in Mexico, came away feeling the demonstrators had a point. “If I was in his [Trump’s] position, I personally would not have done that,” Christensen, founder of the crypto company Airdrop Alert, said of the coin’s timing. “It’s just a bad look — right before you become the most powerful man in the world.” Asked how he reaches the working people who elected him, Trump told NBC News' “Meet the Press” last month: “I think I get out quite a bit.” He mentioned a commencement speech he had given at the University of Alabama, hastening to add that he won the state handily in 2024. “The president since entering politics has showcased a unique way of having his finger on the pulse of the American public,” Harrison Fields, a White House spokesman, said in an interview. “He stays connected through multiple public appearances in middle America, reading correspondence, being a consumer of the news, and inviting everyday Americans to the White House and to campaign events.” “While most presidents are driven by staged and stuffy political events, this president has preferred a more organic and authentic approach to connecting with the American people,” Fields added. Still, Trump is surrounded by wealth. The world’s richest man, Elon Musk, carried out Trump’s plan to slash the the government workforce. A billionaire Wall Street executive, Howard Lutnick, is negotiating Trumps’ trade deals; a billionaire hedge fund manager, Scott Bessent, is presiding over the U.S. economy; a billionaire real estate magnate, Steven Witkoff, is conducting high-level diplomacy. Economic policies coming out of the Trump administration skew in favor of the rich, budget analysts say. The “Big, Beautiful Bill” that Trump is trying to push through Congress mixes tax and spending cuts in ways that would shave income for the bottom tenth of the U.S. population by 2% in 2027, and raise it for the top tenth by 4% that year, according to the non-partisan Congressional Budget Office. At the same time, retailers like Walmart have cautioned that Trump’s tariffs will drive up prices, squeezing some of the low-and middle-class voters he peeled away from Democrats. Exit polls showed that in the 2024 election, those with family incomes under $50,000 favored Trump over Democrat Kamala Harris by 50%-48%. Trump’s speaking style — raw and unrestrained — has proved a reliable political asset over the years. In this moment, his language may be widening the gulf between the nation and its leader. Defending his tariffs, Trump said that children may have to make do with \"two dolls instead of 30,\" a remark that some saw as insensitive. In a focus group, a Wisconsin swing voter who supported Trump in the last election told the research company Engagious that Trump’s comment about dolls reminded him of Marie Antoinette, the 18th century French queen associated with the comment, “Let them eat cake.” “It rubbed me the wrong way when he said that,” the 49-year-old Wisconsin man said. “It just seemed like a disconnect with the average American person.” Trump’s fascination with the word “groceries” may be another disconnect. “It’s such an old-fashioned term, but a beautiful term: groceries,” he said at his Rose Garden event at which he announced a series of steep foreign tariffs, later postponed. “It sort of says a bag with different things in it.” For most Americans who shop for the stuff, there’s nothing old-fashioned or particularly beautiful about groceries; they’re a necessity. Same with a stroller. But Trump failed to summon the word when talking about prices last month on Air Force One: “The thing that you carry the babies around in,” he called it. How the most powerful man in the world tries to appear the everyman Various presidents used different methods to avoid being cocooned. Joe Biden's religious faith proved a blessing in every sense. A practicing Catholic, Biden regularly attended Mass, sitting in the pews and patiently waiting his turn for communion with fellow parishioners. Barack Obama routinely read letters culled by his White House staff. “Some of them are funny; some of them are angry,” Obama said during his first term. “A lot of them are sad or frustrated about their current situation.” “These letters, I think, do more to keep me in touch with what’s happening around the country than just about anything else.” Jimmy Carter once invited Americans to call in to him with questions as he sat in the White House with the moderator of the radio show, CBS’s Walter Cronkite. At the end, Carter told the famed network anchor that he appreciated fielding questions that the White House press corps would never have asked, Barry Jagoda, a Carter White House aide who helped arrange the forum, said in an interview. Technology has changed the game. Phone in hand, a president can now scroll through social media and soak in all the candid commentary he can stomach. Trump posts regularly on his own site, Truth Social and often amplifies other users who've applauded his efforts. He reposted one person with fewer than 900 followers who questioned why former FBI director and Trump nemesis James Comey hasn’t been arrested. Trump signals in various ways that despite his personal wealth, he sees and identifies with people of ordinary means. He gives off an accessible vibe. \"The American media loves to downplay or outright ignore how much President Trump enjoys being around normal, everyday people, and he listens to them,\" Vice President JD Vance said in a prepared statement. In February, Trump attended the Daytona 500 race and took laps around the track in his limousine, “The Beast.” The following month he went to see the college wrestling championship in Philadelphia and in April, he was on hand for a UFC fight in Miami. “For all the Mar-a-Lago posh and polish, he also shows that he’s more of a regular guy than Biden was,” said Douglas Brinkley, a presidential historian. Or, perhaps, George H.W. Bush. Running for president in 1988, Bush was ridiculed for telling a waitress at a New Hampshire truck stop he wanted “a splash” more coffee, feeding perceptions that he was an out-of-touch patrician. Some voters may recoil at Trump’s intemperate language, by contrast, but his epithets may come off as human and relatable, allies say. “He’s one of the most in-touch modern presidents,” said Ari Fleischer, White House press secretary for President George W. Bush. “He has an amazing intuitive feel of what working people think and want. It’s one of the reasons he can be so rude. He uses [the word] ‘scum’ in his Truth Social statements, which I find to be inappropriate but for a huge swath of the country it reinforces he’s not a politician.” “He doesn’t do the things that everyone else in Washington who has lost touch with the country does,\" Fleischer added. “He doesn’t pretend — he lets it rip.” When he does escape the bubble and meet everyday Americans, he shows he’s willing to listen, some who’ve met him say. Brian Pannebecker is a retired auto worker from Michigan who’s become a campaign surrogate, bringing fellow blue-collar workers to Trump campaign events. Pannebecker, 65, recalled a moment during the 2024 campaign when he was invited to meet Trump backstage at a rally. Trump asked his opinion of Biden’s electric vehicle mandates and after hearing his critique, Trump shared it with the audience when he gave his speech, the former autoworker recalled. “He’ll ask a question and then actually stand back and listen to you while you’re talking, even if you go on for a minute or two,” Pannebecker said in an interview. \"He’s listening to you and trying to understand what your concerns are.\" Try as he might, a president's best-intentioned efforts to get honest feedback from the public can fall flat. Take Ronald Reagan. In 1982, he read a letter from an Arkansas woman who told him that her family’s excavation business was foundering and she and her husband were “starving slowly to death.” Reagan drafted a handwritten reply saying he had kept her letter on his desk and “read it more than once.” “I know no words of mine can make you feel any better about the situation in which you find yourselves,” Reagan wrote. He added that he had asked the Small Business Administration (SBA) to “check out your situation.” The agency followed through. That's when the story took an odd twist. A SBA official drove more than 100 miles and found the woman’s husband, who said the family was in fact financially stable and that his wife “gets needlessly excited from time to time.” He had no idea she had written to Reagan and he didn't want a loan. The government official later drove by the family’s home to see it for himself. He concluded it was “fairly expensive” with a boat in the yard worth about $6,000. At that, the agency closed the file.","summary":"In his second term, Trump is looking and sounding insulated even from the voters who put him back in the White House.","url":"https://www.nbcnews.com/politics/donald-trump/gilded-perch-trump-tries-retain-common-touch-rcna209172","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-05/250527-trump-ch-0938-330a5d.jpg","video":null,"publish_date":"2025-06-01 09:00:00","author":"Megan Lebowitz,Megan Shannon,Peter Nicholas","authors":["Megan Lebowitz","Megan Shannon","Peter Nicholas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.017},{"id":327053832,"title":"The PPP will win because its opponents have no credibility","text":"I will include in the PPP’s opponents, all the opposition parties (right now that will be PNC, AFC, Team Mohamed, WPA and ANUG), the private media and the anti-PPP civil society groups like Guyana Human Rights Association (GHRA), Transparency International –Guyana, Red Thread, among others.\n\nTo unseat an incumbent, the opposition must present itself as embodying the leadership qualities that the public sees as a credible and trustworthy alternative. The opposition must appear as people who have a holistic picture of the nation, and the population must believe they describe the facts fairly and accurately without resorting to barefacedly twisting them so that they appear dishonest in the eyes of the nation.\n\nThe anti-incumbent critics must be people with character and credibility that the country respects, and respects them because they see them as politicians and society’s actors that will do a plausible and competent job if voted into office, and that they can be trusted with the humane and modest exercise of power.\n\nThe Conservatives lost to a Labour landslide in the UK because they were seen as people the UK population no longer felt should be in power. The UNC won in Trinidad because, while in the opposition, the UNC was seen as a credible alternative. Mr. Trump won because President Biden and Kamala Harris were seen as people who the American people felt did not have the substance to continue in government.\n\nIt will take several columns to analyze the lack of credibility of the school of anti-government actors. I will just randomly select a few and, in the coming weeks, expand. I honestly find the entry of Azruddin Mohamed so surreal and comical that I will not spend time on him. Is Mr. Mohamed of sound mind?\n\nI begin with Red Thread’s leading voice – Vanda Radzik. This civil society lady wrote the President as part of a wider group demanding (yes, demanding, not asking) that Guyana get out of oil and gas immediately because of climate damage.\n\nWhen the BBC came here last year to do a documentary on Guyana, she was selected as an interviewee. When the interviewer asked for her position on oil, she showed no backbone, no leadership quality. She did not mention her position on oil. She simply told her host that in Guyana, there were two spectrums (her words) – one that Guyana should get out of oil and the other for a better contract.\n\nShe never told her interviewer that “I, Ms. Radzik, stand by my conviction that Guyana should not have oil production.” Are these the people whose words we are going to accept when they criticise the Ali presidency? Let’s move over to GHRA and the Transparency International folks here in Guyana. Should we ever listen to anything these people say when they chose deliberate silence about one of the worst attempts in modern history to hijack a legal, national election?\n\nThe Opposition Leader became morbidly petty-minded when he did not attend the funeral of one of the most iconic leaders the PNC produced in history – Amna Ally. Should Guyana trust this man to replace Dr. Ali? Can this man stand in Ali’s shoes? Next is Nigel Hughes, one of the numbers in the potpourri of Mulatto/ Creole Class elites.\n\nMr. Hughes, instead of trying to steal Dr. Ali’s thunder as a competitor for Dr. Ali’s office, watched the people of Guyana who, on April 28, saw their country almost being harmed by rampaging mobs and told Guyanese there were no mobs. Those violent people who wanted to destroy Guyana were provocateurs sent by the PPP.\n\nFinally, the Stabroek News (SN). Please tell me if you have the stomach to tolerate the poisonous, volcanic ash this newspaper, along with the Kaieteur News, spews on this nation? I am concluding this article here with an example of the stupid people this country has, and any decent human should ignore these people as we reach the point of voting on September 1.\n\nIn its Friday editorial, SN noted that when the President contacted GECOM’s chairperson to ask if GECOM would be ready by September 1 because that is his choice; the newspaper wrote that at the same time the President should have demanded from the chairperson an obligation to ensure that she make sure that the chaos of 2020 is not repeated.\n\nI ask you in all sincerity if this was not a manifestation of crass stupidity. How can a President or Prime Minister inquire of the election administrators if they are ready for the date he has in mind, then go on to lecture them about preventing chaos? Commonsense and decency should inform any sane mind that is out of protocol and Presidents and Prime Ministers do not do such things.\n\nDISCLAIMER: The views and opinions expressed in this column are solely those of the author and do not necessarily reflect the official policy or position of the Guyana National Newspapers Limited.","summary":"I will include in the PPP’s opponents, all the opposition parties (right now that will be PNC, AFC, Team Mohamed, WPA and ANUG), the private media and the anti-PPP civil society groups like Guyana Human Rights Association (GHRA), Transparency International –Guyana, Red Thread, among others. To unseat an incumbent, the opposition must present itself as [&#8230;]","url":"https://guyanachronicle.com/2025/06/01/the-ppp-will-win-because-its-opponents-have-no-credibility/","image":"https://guyanachronicle.com/wp-content/uploads/2023/12/freddie-column-header.png","video":null,"publish_date":"2025-06-01 08:20:07","author":"Freddie Kissoon","authors":["Freddie Kissoon"],"language":"en","source_country":"gy","sentiment":-0.351},{"id":326954430,"title":"Trump shares theory that Joe Biden DIED in 2020 and was replaced by a clone","text":"President Donald Trump shared a bizarre theory on social media Saturday night that suggested Joe Biden died in 2020 and has since been replaced by a 'clone.'\n\nThe Truth Social post, which has since gone viral, stated bluntly that the former president of the United States had somehow been dead for years while still in office. \n\n'There is no #JoeBiden - executed in 2020. #Biden clones doubles & robotic engineered soulless mindless entities are what you see,' wrote the user named llijh. '#Democrats dont know the difference.'\n\nTrump did not add any of his own commentary to the post, but simply amplifying the wild conspiracy created confusion. \n\nAlmost immediately, social media erupted, with supporters and critics alike grappling with the surreal suggestion.\n\n'We all knew something was completely off,' one commenter wrote. 'Although Trump has said repeatedly that Joe Biden was shot.' \n\nOthers reveled in the uncanny nature of the moment: 'Wow! President Trump just re-truthed this post,' exclaimed one astonished user. \n\nAnother chimed in: 'I cannot believe President Trump just reTRUTHED this.'\n\nThe president's replies section rapidly devolved into a torrent of wild speculation about what surprises may be ahead.\n\n'Well you just went there! Go you! The truth is coming! Buckle up!' one supporter cheered.\n\n'Thank you, do you know how long I've been saying this? Trump was still our President in his first term and I knew Joe Biden was gone during his run for president. They installed The Biden...an actor (blue eyes & brown eyes),' wrote another, referring to fringe theories that claim noticeable changes in Biden's eye color are evidence of a body double.\n\nOthers mocked the madness. 'Just like all MAGAts, you're all into conspiracy theories. Do you think the earth is flat as well? Just wondering,' one user wrote sarcastically.\n\n'We knew this but now it's confirmed by the Commander in Chief! Wow!!! NCSWIC…nothing! Trust the Plan!' added a QAnon sympathizer, referencing the popular but baseless 'Nothing Can Stop What Is Coming' slogan.\n\nTrump's casual amplification served to underscore the surreal and conspiratorial environment that defines the MAGA movement.\n\nThis isn't the first time Trump has danced with conspiracy theories.\n\nThroughout his first term as president Trump continued to given oxygen to baseless theories: suggesting Ted Cruz's father was involved in the JFK assassination, refusing to fully distance himself from QAnon, and promoting claims of massive voter fraud during the 2020 election without evidence.\n\nTrump was the most prominent promoter of the so-called 'birther' conspiracy, falsely claiming that President Barack Obama was not born in the United States. \n\nFor years, Trump demanded Obama's birth certificate and continued to suggest it was fraudulent even after Obama released the official long-form document. \n\nIt wasn't until 2016, under mounting political pressure, that Trump finally admitted Obama was born in the US - without apology or acknowledgment of the damage the false claims had caused. \n\nBut suggesting the idea that a former president of the United States was a 'clone' pushes the envelope even further.\n\nThe statement appeared more like the plot of a sci-fi movie than a concept worthy of the attention of a head of state. \n\nLast month, Biden's cancer announcement revived questions about the extent of his health issues during his tenure, with Trump saying Biden should have been more transparent with the public.\n\nBiden's office said he had been diagnosed with 'aggressive' prostate cancer that had spread to his bones. \n\nIt placed renewed focus on the health of the 82-year-old with the publication of a book that details widespread concerns about Biden's mental acuity among aides and Democratic insiders as he pursued reelection in 2024. \n\nThe new book, 'Original Sin,' by journalists Jake Tapper and Alex Thompson put a spotlight on Biden's mental acuity in his final months in office. \n\nExcerpts from the book have prompted new questions about whether critical information was withheld from the American public about Biden's ability to serve in the White House. \n\nBiden's closest aides have dismissed those concerns, saying Biden was fully capable of making important decisions.\n\nBiden has appeared on television to rebut accusations that his mental capacity had diminished during his 2021-2025 term. \n\nBiden, the oldest person ever to serve as president, was forced to drop his reelection bid last July after a stumbling debate performance against Trump eroded his support among fellow Democrats. \n\nBiden's vice president, Kamala Harris, launched a bid of her own but lost to Trump in the November 2024 election.","summary":"Donald Trump re-truthed a post claiming Joe Biden died in 2020 and was replaced by a clone, fueling a frenzy of conspiracy theories online.","url":"https://www.dailymail.co.uk/news/article-14769003/Trump-shares-theory-Joe-Biden-DIED-2020-replaced-clone.html","image":"https://i.dailymail.co.uk/1s/2025/06/01/05/98934597-0-image-m-72_1748752697353.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/18/1922537498484295183/1024x576_MP4_1922537498484295183.mp4","publish_date":"2025-06-01 05:59:17","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","source_country":"gb","sentiment":-0.2},{"id":326934908,"title":"'This is a cruel man,' Minnesota governer Tim Walz urges democrats to stand up to Trump","text":"Minnesota governor Tim Walz aimed to fire up Democratic activists at the party’s state convention in South Carolina, continuing to build his national profile after being selected by Kamala Harris as the 2024 vice presidential nominee. Walz, a former teacher, congressman, and now governor, delivered the keynote address in Columbia, an event known for drawing national Democratic figures and possible future presidential candidates. In a 30-minute speech, he used blunt language to criticise US President Donald Trump and called on Democrats to stand firm against what he described as a “bully” in the White House. “Maybe it’s time we get a little tougher,” Walz said to applause. “When it’s a bully like Donald Trump, you bully the s—- out of him. ... This is a ... cruel man.” The speech was Walz’s third major address in less than 24 hours. He also spoke at a fundraising dinner and at a fish fry hosted by representative Jim Clyburn alongside Maryland governor Wes Moore. Addressing the crowd again on Saturday, Walz warned that Trump is “the existential threat that we knew was coming,” while commending South Carolina Democrats for their persistence in a deeply Republican state where the party hasn’t won a statewide race in nearly two decades and holds only one congressional seat—Clyburn’s. “Damnit, we should be able to have some fun and be joyful,” he added. “We’ve got the guts and we need to have it to push back on the bullies and the greed.” Walz is seen as a potential contender for the 2028 Democratic presidential nomination and has been traveling to early primary states. He was also scheduled to address the California Democratic convention in Anaheim, where state party chair Rusty Hicks praised him as “a former teacher, a veteran, and a trailblazer” who has dedicated his career to fighting for working families and Democratic values.","summary":"Minnesota Governor Tim Walz, now Kamala Harris's running mate, energized Democratic activists at South Carolina's state convention. He delivered a keynote address criticizing Donald Trump and urging Democrats to stand firm. Walz, seen as a potential 2028 presidential contender, also spoke at fundraising events and is scheduled to address the California Democratic convention, further building his national profile.","url":"https://timesofindia.indiatimes.com/world/us/this-is-a-cruel-man-minnesota-governer-tim-walz-urges-democrats-to-stand-up-to-trump/articleshow/121546110.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-121546126/121546126.jpg","video":null,"publish_date":"2025-06-01 05:43:39","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.128},{"id":326916704,"title":"Democrat senator sparks MAGA outrage after awkward hand gesture during speech in California","text":"Democratic Senator Cory Booker sent MAGA-aligned social media into a frenzy after performing an awkward hand gesture during a Democratic convention speech in California.\n\nThe New Jersey senator ended his speech on Saturday by placing his hand over his heart before extending his arm out toward the crowd - a gesture that some said bore a troubling resemblance to a Nazi salute.\n\nRichie Greenberg, a San Francisco-based political commentator and former Republican mayoral candidate, was the first to post the footage.\n\n'Moments ago, Cory Booker salutes 4,000 CA Democrat Party delegates,' Greenberg wrote dramatically. \n\nCollin Rugg, co-owner of the conservative outlet Trending Politics, quickly amplified it, sarcastically noting, 'looking forward to the wall-to-wall coverage from the 'honest' and totally not biased media.' \n\nMeanwhile, social media influencer Gunther Eagleman furiously declared Booker a 'straight up NAZI,' adding 'WOW' and 'HOLY S***!' to emphasize his outrage.\n\nRight-wing journalist Nick Sortor piled on, labeling Booker 'literally Hitler' for the gesture.\n\nThe uproar evoked sharp memories of two prior incidents that drew similar outrage - Elon Musk's controversial gesture during President Donald Trump's second inauguration earlier this year, and Steve Bannon's at CPAC just weeks later.\n\nMusk, while addressing Trump supporters at the Capital One Arena in January, had slapped his hand on his chest before thrusting his arm straight out with his palm down, telling the crowd, 'My heart goes out to you.' \n\nThe move, eerily reminiscent of a Nazi salute, ignited an immediate firestorm.\n\nMusk's response to his own questionable gesture only fanned the flames to haters and detractors on social media. \n\n'Frankly, they need better dirty tricks. The ''everyone is Hitler'' attack is sooo tired,' he posted on X at the time.\n\nHate-monitoring organizations like the Anti-Defamation League urged caution, calling Musk's gesture 'awkward' and asking the public not to leap to conclusions. \n\nAt the time, MAGA influencers defended Musk and railed against what they described as faux-outrage from the mainstream media and general public.\n\nRugg himself argued Musk was 'excited, awkward, not thinking about how he looks, and trying to show his heart going out to the crowd.'\n\nPopular MAGA X account Libs Of Tiktok, also shared the video of Booker. \n\nAt the time of Musk's salute, the account said the Tesla head 'was literally motioning \"my heart goes out to you.\" This is why no one trusts the fake media.'\n\nThe following month, Steve Bannon, former White House strategist and host of the influential 'War Room' podcast, followed with his own contentious gesture. \n\nDuring his fiery CPAC speech, Bannon thrust his right arm into the air with a flat palm after shouting, 'Fight! Fight! Fight!' \n\nThe backlash for Bannon was swift. French far-right leader Jordan Bardella canceled his scheduled CPAC speech, condemning the gesture as 'referring to Nazi ideology.'\n\nThe Anti-Defamation League also slammed Bannon's long record of stoking antisemitism writing, 'We are not surprised, but are concerned about the normalization of this behavior.'\n\nBannon dismissed the criticism saying that it was merely a 'wave' - a gesture he said he'd made at countless rallies. \n\nBooker's office has yet to comment on the gesture. \n\nBooker, who recently broke the Senate filibuster speech record by talking for 25 hours and five minutes had been riding a wave of positive attention. \n\nHis marathon speech, protesting Trump and invoking 'good trouble' in honor of the late John Lewis, had solidified his standing among Democratic voters. \n\nAccording to a new AtlasIntel poll, Booker now ranks fourth among potential 2028 Democratic presidential contenders, behind Pete Buttigieg, Alexandria Ocasio-Cortez, and Kamala Harris.\n\n'When you're a public figure at the highest echelons of power, doing a salute like that—accidental or not—is extraordinarily disturbing and calls for an explanation,' said Brian Levin, founder of the Center for the Study of Hate and Extremism.\n\nDailyMail.com has reached out to Booker's office for comment.","summary":"Senator Cory Booker, a Democrat from New Jersey, is facing an online storm after a gesture he made during a speech at the California Democratic Convention on Saturday.","url":"https://www.dailymail.co.uk/news/article-14768905/Democrat-senator-Cory-Booker-MAGA-outrage-hand-gesture.html","image":"https://i.dailymail.co.uk/1s/2025/06/01/04/98934269-0-image-m-63_1748748754017.jpg","video":null,"publish_date":"2025-06-01 04:41:58","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","source_country":"gb","sentiment":-0.242},{"id":326901108,"title":"Watch: MAGA influencers accuse Cory Booker of Nazi-style salute, call him ‘literally Hitler’","text":"Senator Cory Booker, a Democrat from New Jersey, is facing an online storm after a gesture he made during a speech at the California Democratic Convention on Saturday. Booker placed his hand over his heart and then extended it outward to the crowd. Within hours, a video of the moment spread widely on social media. Critics were quick to draw comparisons to similar gestures made earlier this year by Elon Musk and Steve Bannon — both of which ignited widespread backlash for resembling a Nazi salute.Booker, who has not issued any public response yet, delivered the gesture at the close of his speech before an audience of over 4,000 delegates.Right-Wing figures react swiftlyThe video was first posted by Richie Greenberg, a San Francisco-based political commentator and former Republican mayoral candidate, who captioned it: “Moments ago, Cory Booker salutes 4,000 CA Democrat Party delegates.”It was then picked up by several conservative influencers and commentators. Collin Rugg, co-owner of the site Trending Politics, reposted the clip and remarked: “Looking forward to the wall-to-wall coverage from the 'honest' and totally not biased media.”Gunther Eagleman, a right-wing social media figure, added: “Cory Booker is a straight up NAZI. WOW. HOLY S***!” Meanwhile, conservative journalist Nick Sortor went further, writing: “Cory Booker made a Nazi salute. He’s literally Hitler.”One user wrote: “I'm literally shaking right now. Cory Booker is literally Hitler. I can't wait for fake news to cover this as extensively as they did Elon when he gave his heart out to everyone!”Nazi Salute: A familiar gesture with loaded meaningEarlier this year, Elon Musk faced similar scrutiny after making a gesture — hand on heart, then extended outward — during Donald Trump’s second inauguration. Critics said it resembled a Nazi salute. Musk, however, defended it, saying it meant: “My heart goes out to you.”At the time, Musk posted on X: “Frankly, they need better dirty tricks. The ‘everyone is Hitler’ attack is sooo tired.”Shortly after, Steve Bannon — former White House strategist and host of the War Room podcast — made a similar motion at the Conservative Political Action Conference in February while chanting: “Fight, fight, fight.”Their supporters described it as a “Roman salute,” referencing depictions in 18th and 19th-century art. But historians note there’s no evidence such a gesture was used in ancient Rome.Booker’s wider political messageSaturday’s incident has overshadowed the broader context of Booker’s recent activism. Just weeks ago, the 56-year-old senator delivered a 25-hour and 5-minute speech on the Senate floor — the longest since Senator Strom Thurmond's record in 1957 — protesting former President Trump’s agenda and Republican policies.Referencing civil rights leader John Lewis, Booker urged Americans to cause “good trouble” in the face of injustice. The phrase also featured in Saturday’s convention speech.“I think the Democratic Party lost a lot of elections because people didn't believe that they cared about them. So let's stop worrying about the politics and get more focused on the people,” Booker said after the event.He added that he didn’t want to prescribe tactics for change but stressed the importance of citizen engagement: “I know one thing it's not is sitting down and doing nothing and just watching on TV and getting stuck in a state of sedentary agitation. Everybody has to be taking measures to put the pressure on to change.”Who is Cory Booker? Booker’s passionate engagement has helped boost his national profile. A recent poll by AtlasIntel ranked him fourth among potential Democratic candidates for the 2028 presidential race, behind Kamala Harris, Alexandria Ocasio-Cortez, and Pete Buttigieg.Although he ran unsuccessfully for president in 2020, Booker has said he remains focused on running for Senate re-election in 2026. As for a White House bid, he told reporters: “2028 will take care of itself.”Booker has neither confirmed nor denied whether the gesture was deliberate or meant to emulate Musk or Bannon. For now, the debate continues to unfold on social media — where perception often shapes reality faster than facts can catch up.(With inputs from AP)","summary":"Senator Cory Booker’s closing gesture at a Democratic convention has sparked fierce online criticism, drawing comparisons to salutes made by Elon Musk and Steve Bannon that were previously condemned as Nazi-like. Though Booker has not commented, footage of the moment has gone viral on right-wing social media. This latest incident comes just weeks after the New Jersey Democrat made headlines with a marathon 25-hour speech against Donald Trump’s policies, positioning him as a rising 2028 contender.","url":"https://economictimes.indiatimes.com/news/international/global-trends/watch-maga-influencers-accuse-cory-booker-of-nazi-style-salute-call-him-literally-hitler/articleshow/121544628.cms","image":"https://img.etimg.com/thumb/msid-121544690,resizemode-4,width-1200,height-900,imgsize-733257,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-01 02:14:46","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.181},{"id":326894446,"title":"MAGA Accuses Democratic Senator Cory Booker of Doing 'Nazi Salute'","text":"Senator Cory Booker of New Jersey, a Democrat, has drawn criticism from right-wing commentators and social media after making a gesture that bears similarity to the controversial one previously made by Elon Musk and Steve Bannon, for which they faced heavy backlash.Newsweek reached out to Booker's office and Elon Musk by email outside of normal business hours on Saturday evening for comment.Why It MattersMusk during President Donald Trump's second inauguration in January made a gesture that many claimed was a Nazi salute, while the tech mogul and his allies defended it as a harmless and well-intentioned gesture meaning \"my heart goes out to you.\" Musk made the gesture twice.Musk responded at the time to the criticism with a message on X, saying: \"Frankly, they need better dirty tricks. The 'everyone is Hitler' attack is sooo tired.\"Bannon, host of the influential War Room podcast and former White House strategist, then made a similar gesture during a speech at the Conservative Political Action Conference (CPAC) in February and saying, \"fight, fight, fight.\"Supporters of Musk and Bannon have also claimed that the pair have made a \"Roman salute,\" which was depicted in 18th and 19th-century art, but there is no historical evidence from ancient Rome that it was a common practice.What To KnowBooker spoke at a Democratic convention in California on Saturday, ending his speech with a gesture where he put his hand over his heart, then extended his hand out to the crowd – much in the way Musk and Bannon did, though not as forcefully as Musk did it.The video was first posted by Richie Greenberg, a San Francisco-based political commentator and former GOP mayoral candidate for the city, and quickly spread among MAGA-social media.Greenberg posted the video with the caption: \"Moments ago, Cory Booker salutes 4,000 CA Democrat Party delegates.\"Collin Rugg, co-owner of conservative news site Trending Politics, reposted the video, adding that he is \"looking forward to the wall to wall coverage from the \"honest\" and totally not biased media.\"Social media influencer Gunther Eagleman wrote that Booker was a \"straight up NAZI,\" adding \"WOW\" and \"HOLY S***!\"Right-wing journalist Nick Sortor similarly piled in with the video, writing that Booker made a \"Nazi salute\" and calling him \"literally Hitler\" for doing so.Booker has garnered much attention since his record-setting speech, remaining on the Senate floor and continuing to speak for 25 hours and five minutes, surpassing the previous record held by Senator Strom Thurmond in 1957.Booker used his time to protest Trump and Republican policies, invoking the late Representative John Lewis of Georgia and the need for \"good trouble\" in times of crisis.The speech earned Booker some goodwill, which was reflected in a recent poll released by AtlasIntel, which found him the fourth-leading candidate among Democratic voters for a potential 2028 presidential nominee, ranking just behind Pete Buttigieg, Representative Alexandria Ocasio-Cortez of New York, and Kamala Harris.","summary":"Senator Cory Booker made the gesture at the end of a speech he gave during a Democratic convention in California on Saturday.","url":"https://www.newsweek.com/maga-accuses-democratic-senator-cory-booker-doing-nazi-salute-2079436","image":"https://d.newsweek.com/en/full/2654667/senator-cory-booker-new-jersey.jpg","video":null,"publish_date":"2025-06-01 01:29:56","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.194},{"id":326894952,"title":"Gov. Tim Walz calls on Democrats to be ‘meaner’ and ‘bully the s–t’ out of President Trump","text":"Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s–t’ our of President Donald Trump during a speech in South Carolina.\n\nThe failed 2024 vice presidential candidate was the keynote speaker at the Democratic organized event in the Palmetto State on Saturday where he delivered a profanity-laced speech that called on his party members to toughen up in their resistance measures against President Trump.\n\n“Maybe it’s time for us to be a little meaner, a little bit more fierce,” Walz said to raucous applause from the crowd.\n\n“The thing that bothers a teacher more than anything is to watch a bully,” the governor said. “And when its a child you talk to them and you tell them why bullying is wrong.”\n\n“But when its an adult like Donald Trump, you bully the s–t out of him back,” Walz intoned.\n\nHe further characterized the president a “wannabe dictator”\n\n“Donald is the existential threat we knew was coming,” Walz said at another point during the Saturday morning remarks, adding that, for Democrats, “it is going to be a challenging few years here.”\n\n“We’ve got the guts and we need to have it to push back on the bullies and the greed,” Walz said during his remarks.\n\nDespite the tough talk and foul language directed at the commander and chief, Walz also encouraged South Carolina Democrats to keep things light.\n\n“Damnit, we should be able to have some fun and be joyful,” the former public school teacher said. \n\nDuring the remarks which repeatedly took aim across the political aisle, Walz made fun of the President Trump branded “big, beautiful bill.”\n\n“I used to teach Fourth Grade and I was gonna say it sounded like something like a Fourth Grader came up with it but that would be insulting to my Fourth Graders,” Walz said to chuckles from the crowd.\n\nThe Minnesotan also took the opportunity to heap praise on his ex-running mate former Vice President Kamala Harris.“Damnit, I would love to turn on the TV and see her instead of what we see every day,” Walz said to applause, further characterizing Harris as “well-accomplished.”\n\nWalz’s glib and blue-collar manner during public speeches has previously ended up with him in hot water when he took aim at carmaker Tesla and its CEO Elon Musk.\n\nThe governor celebrated a drop in the stock price for the electric car company saying it gave him “a little boost during the day.”\n\nWalz later called himself a “knucklehead” when it was revealed that the state of Minnesota’s pension fund owns shares of Tesla.","summary":"Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s–t’ our of President Donald Trump during a speech in South Carolina. The failed 2024 vice presidential candidate was the keynote speaker at the Democratic organized event in the Palmetto State on Saturday where he delivered a profanity-laced speech that called on...","url":"https://nypost.com/2025/05/31/us-news/gov-tim-walz-calls-on-democrats-to-be-meaner-and-bully-the-s-t-out-of-wannabe-dictator-president-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105657745.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-01 01:28:52","author":"Shane Galvin","authors":["Shane Galvin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.144},{"id":326879816,"title":"AOC Viewed Positively by More Americans Than Trump and Harris—Poll","text":"More Americans have a positive image of progressive Representative Alexandria Ocasio-Cortez, a New York Democrat, than they do of President Donald Trump and former Vice President Kamala Harris, according to new polling data.Why It MattersOcasio-Cortez has been seen as a polarizing figure in politics and within the Democratic Party. She has drawn backlash from moderate Democrats and Republicans alike since she surged onto the national stage after an upset primary victory against a powerful incumbent Democrat in 2018.The New York progressive has embraced the Democratic socialist label, despite pushback from within her own party. Recently, she has traveled around the country holding massive rallies with progressive Senator Bernie Sanders, a Vermont independent, with the duo turning out thousands—including in conservative districts and states.What to KnowNew polling released Friday by AtlasIntel—which has been described by election analyst Nate Silver as \"top-rated,\" and was described as the most accurate pollster of the 2024 and 2020 elections—showed Ocasio-Cortez ranked third among politicians included in the survey, in terms of Americans who had a positive view of her. The congresswoman was also one of just three political leaders with an overall net positive image.The New York Democrat was viewed positively by 46 percent of respondents, compared to 44 percent that viewed her negatively—meaning her net positive rating was above water by 2 points. An additional 10 percent of respondents said they didn't know.Only former President Barack Obama and former first lady Michelle Obama ranked higher than the congresswoman. Barack Obama was viewed positively by 53 percent compared to 43 percent who viewed him negatively. Michelle Obama was 49 percent positive and 45 percent negative.Meanwhile, Ocasio-Cortez was ahead of Trump and Harris, as well as Vice President JD Vance and former President Joe Biden. Trump was viewed positively by 44 percent, Vance by 42 percent, Harris by 42 percent and Biden by 37 percent. Respectively the politicians were viewed negatively by 55 percent, 56 percent, 52 percent and 55 percent.The poll included 3,469 respondents and had a margin of error of plus or minus 2 percentage points at a 95 percent confidence level. It was carried out from May 21 through May 27.Speculation has swirled in recent months about Ocasio-Cortez's political future, especially as she has rallied with Sanders across the country. Many have urged her to consider challenging Senator Chuck Schumer, a New York Democrat, in the 2028 primary, while others see her as a strong Democratic presidential contender.What People Are SayingRepresentative Alexandria Ocasio-Cortez to Fox News in April when asked about her future plans: \"This moment isn't about campaigns, or elections, or about politics. It's about making sure people are protected, and we've got people that are getting locked up for exercising their First Amendment rights. We're getting 2-year-olds that are getting deported into cells in Honduras. We're getting people that are about to get kicked off of Medicaid. That, to me, is most important.\"D. Stephen Voss, political science professor at the University of Kentucky, previously told Newsweek via email: \"AOC serves as the face of the Democratic Party for many Trump supporters who dislike national Democrats. They like to pillory her as ignorant and irresponsible.\"Voss continued: \"At the same time, many Democrats embrace AOC as a worthy young successor to Bernie, someone who can play the role of progressive challenger in a Democratic nomination battle.\"Monica Crowley, a former official in the Treasury Department during the first Trump administration, told Fox News last November: \"Just a word of warning to the Republicans, to my party: Do not underestimate AOC. She's young, she's vibrant, she's attractive.\"What Happens Next?Ocasio-Cortez's future political moves remain to be seen. For the time being, she has said she aims to focus on fighting back against the Trump administration.","summary":"The New York progressive ranked third among politicians included in the survey, just behind the Obamas.","url":"https://www.newsweek.com/aoc-viewed-positively-more-americans-trump-harris-poll-2079414","image":"https://d.newsweek.com/en/full/2654651/alexandria-ocasio-cortez.jpg","video":null,"publish_date":"2025-05-31 22:31:49","author":"Jason Lemon","authors":["Jason Lemon"],"language":"en","category":"politics","source_country":"US","sentiment":0.224},{"id":326882802,"title":"Left-leaning influencers embrace Bluesky without abandoning X, Pew says","text":"It’s no surprise that many big, left-leaning social media accounts have recently joined Bluesky — but a new analysis from the Pew Research Center attempts to quantify that shift.\n\nThis comes as an update to Pew’s news influencer report released in November 2024, which did not include Bluesky in its numbers. The report focused on a relatively small group of 500 influencers, all of whom have more than 100,000 followers on at least one major platform and post regularly about current events.\n\nFor this Bluesky-centric update, Pew looked at those same influencers (as opposed to accounts that may have found a big audience on Bluesky exclusively) and saw that in February/March, 43% of them had an account on Bluesky. Just over half (51%) of those accounts were created after the 2024 presidential election.\n\nThere’s a big divide between influencers on the right and the left, with 69% of the left-leaning accounts (the ones that explicitly identified as liberals or Democrats and expressed support for Kamala Harris or Joe Biden before the presidential election) making the jump to Bluesky, while only 15% of the conservative ones did the same.\n\nThis movement wasn’t necessarily at the expense of X (formerly Twitter). While X owner Elon Musk’s alliance with now-President Donald Trump seemed to drive new users to Bluesky, 82% of the influencers tracked by Pew still had an account on X, down only slightly from 85% in summer 2025.\n\nIn other words, even if left-leaning influencers are dipping their toes into Bluesky, most of them (87%) haven’t abandoned X. Pew also says most influencers continue to post more regularly on X than on Bluesky.\n\nHowever, Bluesky activity does appear to be picking up — the number of influencers on Bluesky who are actually posting grew from 54% in the first week of January to 66% in the last full week of March.","summary":"It’s no surprise that many big, left-leaning social media accounts have recently joined Bluesky — but a new analysis from the Pew Research Center attempts to quantify that shift. This comes as an update to Pew’s news influencer report released in November 2024, which did not include Bluesky in its numbers. The report focused on [&#8230;]","url":"https://techcrunch.com/2025/05/31/left-leaning-influencers-embrace-bluesky-without-abandoning-x-pew-says/","image":"https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2185895875.jpg?resize=1200,800","video":null,"publish_date":"2025-05-31 21:01:57","author":"Anthony Ha","authors":["Anthony Ha"],"language":"en","source_country":"us","sentiment":-0.206},{"id":326872786,"title":"Republicans won’t stop beating up on Biden because it’s all they have","text":"President Donald Trump hasn’t even been back in office for 200 days, and already, his second term is a full-blown disaster.\n\nHe’s sort of breaking up with his tech billionaire co-President Elon Musk. His so-called “One Big Beautiful Bill,” pitched as the cornerstone of his legislative revival, is tearing the GOP apart. His power grabs are being dragged through the courts. And his tariff plan—if it survives—could drive up prices and tip the economy toward a recession.\n\nWith all that chaos on their plate, Republicans should be laser-focused on solving problems. Instead, they’re still obsessed with former President Joe Biden.\n\nTwo recent stories gave them just enough cover. First, a Beltway tell-all claimed Biden’s team downplayed his health issues when he launched his reelection bid. Then came news of his metastatic prostate cancer diagnosis—and Republicans immediately, and without evidence, cried “cover-up.” \n\nRep. James Comer, after leading a failed 15-month impeachment investigation, even suggested that Biden should testify before Congress over his use of an autopen, as if that somehow proves cognitive decline. For the record: Autopens are legal. Presidents, including Barack Obama, have used them, despite MAGA’s ongoing paranoia.\n\nTo be clear, Republicans aren’t the only ones who raised questions about Biden’s mental and physical fitness. Democrats did too. So did the media. His age and decline weren’t hidden—they were headline news. Voters knew what they were signing up for.\n\nAnd sure, it’s possible this issue could resurface in 2026 or 2028. But if it does, it won’t be because MAGA world kept doomposting about Biden’s brain scans; It’ll be because Democrats failed to give voters anything else to care about.\n\nLet’s be real. The defining story of the next election won’t be Biden’s prostate. It’ll be Trump—his chaos, his legacy, and the wreckage he’s already leaving behind.\n\nTo name just a few lowlights: He’s nuked the economy with asinine tariffs. He’s gutted the federal workforce, undermining basic services like Social Security and weather forecasting. He’s threatened law firms to scare them away from challenging his illegal moves—or defending his political enemies. He’s openly ignoring court orders, plunging the country into a full-blown constitutional crisis.\n\nAnd that’s just the tip of the iceberg.\n\nVoters won’t forget. Republican lawmakers are already getting grilled by angry constituents at town halls. The idea that Biden’s medical chart will outweigh Trump’s reign of chaos is laughable.\n\nBut that’s the GOP’s bet because they need Biden in the narrative. They need a scapegoat, a boogeyman, a distraction. They can’t run on their record, so they run on fiction.\n\nJust look at how Democrats have responded to the Biden book: no freakouts, no backstabbing. Most agree he shouldn’t have run again—but they aren’t re-litigating 2024 or knifing one another over 2028. That unity says more than any hot take. Republicans need Biden in the story. Democrats have already moved on.\n\nOf course, in MAGA-land, Biden’s name will never die. His health, his staff, his supposed “cover-up”—all filed under the same deranged umbrella as Benghazi, birth certificates, George Soros, and Kamala Harris’ laugh. None of it’s real. It’s just Republican fan fiction. And when the headlines dry up, the fever swamp always circles back to its favorite fantasy villains.\n\nStill, if swing voters are actually talking about Biden in 2028, Democrats will only have themselves to blame for failing to give the country something better to talk about.","summary":"President Donald Trump hasn’t even been back in office for 200 days, and already, his second term is a full-blown disaster.\n\n\n\nHe’s sort of breaking up with his tech billionaire co-President Elon Musk. His so-called “One Big Beautiful Bill,” pitched as the cornerstone of his legislative revival, is tearing the GOP apart. His power grabs are being dragged through the courts. And his tariff plan—if it survives—could drive up prices and tip the economy toward a recession.\n\n\n\nWith all that chaos on their plate, Republicans should be laser-focused on solving problems. Instead, they’re still obsessed with former President Joe Biden.\n\n\n\nTwo recent stories gave them just enough cover. First, a Beltway tell-all claimed Biden’s team downplayed his health issues when he launched his reelection bid. Then came news of his metastatic prostate cancer diagnosis—and Republicans immediately, and without evidence, cried “cover-up.” \n\n\n\nRep. James Comer, after leading a failed 15-month impeachment investigation, even suggested t","url":"https://www.dailykos.com/story/2025/5/31/2325119/-Republicans-won-t-stop-beating-up-on-Biden-because-it-s-all-they-have?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1435932/story_image/AP25138794570159.jpg?1748030048","video":null,"publish_date":"2025-05-31 21:00:04","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":-0.3},{"id":326862766,"title":"Tim Walz Tells Democrats to 'Bully the S***' Out of Donald Trump","text":"Minnesota Governor Tim Walz urged his Democratic colleagues to \"change the attitude\" of the party and \"bully the s***\" out of President Donald Trump in an effort to pass long-standing left-wing goals and policies.Newsweek reached out by email outside of normal business hours on Saturday to the Democratic National Committee (DNC) for comment.Why It MattersThe Democrats have offered competing visions for the future of the party after then-Vice President Kamala Harris lost to President Donald Trump in the 2024 presidential election, in which the Republicans retained control of the House of Representatives and took control of the Senate, both of which they hold by slim margins.Leadership, such as House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer, both of New York, have urged patience as the Republicans roll out their agenda, which Jeffries and Schumer believe will prove unpopular with the public and damage Trump and the GOP going into the 2026 midterm elections.However, some Democrats, such as Representative Alexandria Ocasio-Cortez of New York and Senator Bernie Sanders of Vermont, an independent who twice ran to be the Democratic nominee for president, have urged more action from their party and colleagues.What To KnowWalz, who was Harris' vice presidential running mate and a former public school teacher, spoke at Representative Jim Clyburn of South Carolina's Friday night fish fry and delivered a serious message to those in attendance, including many of his Democratic colleagues.Walz spoke of \"wannabe dictators and despots\" and slammed Trump for \"corruption\" and \"cruelty\" in his second administration. He told those gathered that the Democratic Party needs to \"change the attitude, compete in every district, compete for every school board seat.\"On Saturday, Walz spoke at the state's Democratic Party convention where he gave a keynote speech, calling on his party to change its thinking.\"Maybe it's time for us to be a little meaner, maybe it's time for us to be a little more fierce because we have to ferociously push back on this,\" he said, to applause from the crowd.\"And again, I'll speak to my teacher colleagues in here. The thing that bothers a teacher more than anything is to watch a bully...and when it's a child you talk to him and you tell him why bullying's wrong, but when it's an adult like Donald Trump you bully the s*** out of him back,\" Walz said. \"You push back, you make sure they know it's not there, because at heart—at heart, this is a weak, cruel man that takes it out and punches down on people.\"The governor added: \"What they don't want to do is stand toe-to-toe and punch back with someone who's calling him out for what they do who's being there.\"Walz also called Trump \"the existential threat that we knew was coming,\" adding that Trump is a \"cruel man\" and warning that the remainder of his second term will \"be a challenging few years.\"\"Damnit, we should be able to have some fun and be joyful,\" Walz said. \"We've got the guts, and we need to have it to push back on the bullies and the greed.\"Walz has not indicated if he intends to head up his own bid for president in 2028, in which he may run against Harris, former Transportation Secretary Pete Buttigieg, California Governor Gavin Newsom, and a host of other Democrats as the party remains largely rudderless seven months after the loss to Trump.Walz, while lacking the same national exposure that some of his potential rivals have commanded this year, remains actively engaged across the country.He has headlined a DNC series called \"the People's Town Halls\" around the country, speaking to crowds in Republican districts that had thin margins in the 2024 elections and have a potential to flip back to Democrats in 2026.\"For the past few weeks, I've been showing up where Republicans won't,\" Walz wrote in a recent message, a theme he echoed on Saturday in South Carolina. \"I've hosted town halls in Iowa, Nebraska, Wisconsin, Minnesota, and Texas to hear from people the GOP is neglecting.\"AtlasIntel, touted by some, such as veteran pollster Nate Silver, as the most accurate polling firm in the U.S., released data on Friday indicating that Buttigieg has a commanding lead as the likely candidate for Democrats in 2028 if voters picked today.In their polling, Walz did not feature at all, but the pollster may not have included him in their options, as the question was posed as \"provided these were the candidates.\"Newsweek reached out to AtlasIntel outside of normal business hours by email on Saturday for clarification and comment.What People Are SayingMinnesota Governor Tim Walz wrote on X, formerly Twitter, on January 1: \"Happy New Year, Minnesota! More grateful than ever to have the privilege of serving this great state. Looking forward to the work ahead in making Minnesota the best place to live, work, and raise a family.\"Representative Alexandria Ocasio-Cortez of New York at a Las Vegas rally in March: \"This isn't just about Republicans. We need a Democratic Party that fights harder for us, too. But what that means is that we as a community must choose and vote for Democrats and elected officials who know how to stand up for the working class.\"Mary Ann Bennett, who attended Ocasio-Cortez's Denver rally with Sanders, previously told Newsweek: \"The Democratic Party has not been taking strong actions for the working class. Bernie and AOC acknowledged this, which is step one, and then laid out their plans for action which were met with strong cheers from the 30,000 people who showed up. Those moments were when I felt the most empowered and ready to fight for my neighbors.\"Former Vice President Kamala Harris, speaking about her plans earlier this year while visiting sites impacted by the Los Angeles wildfires, said: \"My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them...I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground.\"What Happens Next?Candidates are likely to wait until after the 2026 midterm elections to declare their intention to run for president, but speculation about the field of candidates will remain—and most likely ramp up—in the months ahead.This article includes reporting by the Associated Press.","summary":"The Minnesota governor ran in 2024 as the Democrats' vice presidential candidate and has led a series of town halls in Republican districts this year.","url":"https://www.newsweek.com/tim-walz-democrats-bully-donald-trump-2079385","image":"https://d.newsweek.com/en/full/2654629/tim-walz-democrat-convention-trump.jpg","video":null,"publish_date":"2025-05-31 20:47:02","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.202},{"id":326853242,"title":"‘60 Minutes’ has history of cozy interviews and self-promotion","text":"Beware of those who publicly declare that their stuff doesn’t stink.\n\nRecently, CBS newsman and “60 Minutes” regular Scott Pelley made news and noise when he seized the close of the venerable program to deliver an appeal, threat or whatever, depending on how one heard it, to CBS News parent Paramount, as it was reportedly preparing to settle a lawsuit brought last year by President Trump over the show’s very cozy interview with VP Kamala Harris during last year’s presidential campaign.\n\nPelley cited the week’s resignation of “60 Minutes” executive producer, Bill Owens, adding, “Paramount began to supervise our content in new ways. None of our stories has been blocked, but Bill felt he lost the independence that honest journalism requires. … Bill made sure they were accurate and fair.\n\n“He was tough that way, but our parent company Paramount is trying to complete a merger. The Trump administration must approve it.”","summary":"Beware of those who publicly declare that their stuff doesn’t stink.","url":"https://nypost.com/2025/05/31/sports/60-minutes-has-history-of-cozy-interviews-and-self-promotion/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-3b2xuynyp-1748713476772.jpg?quality=75&strip=all&1748699158&w=1200","video":null,"publish_date":"2025-05-31 19:19:00","author":"Phil Mushnick","authors":["Phil Mushnick"],"language":"en","source_country":"us","sentiment":0.001},{"id":326872788,"title":"Trump throws a $20 billion tantrum, and meet more dodgy judicial nominees","text":"Injustice for All is a weekly series about how the Trump administration is trying to weaponize the justice system—and the people who are fighting back.\n\nTrump is a snowflake, and his sad feelings are worth $20 billion\n\nIn what is now apparently a trend, Paramount has offered Donald Trump millions of dollars to settle a lawsuit that has no merit. But Paramount’s proposed bribe of $15 million to a sitting president just wasn’t enough for Trump, who wants $25 million and an apology from CBS for the imagined slights he suffered\n\nHere’s the thing: At the very best, all Trump can point to is that “60 Minutes” may have engaged in some light editing of an interview with Kamala Harris, which, last time we looked, was neither a crime nor worth $25 million. But media companies have learned that they have to bribe Trump or they’ll face harassing investigations by the Federal Communications Commission or see their mergers blocked. And Paramount just happens to have a merger pending that requires approval. \n\nWhile Paramount is trying to come up with a number big enough to satisfy Trump, the lawsuit is proceeding. Part of Trump’s argument in opposition to Paramount’s motion to dismiss the lawsuit is that he suffered “mental anguish” and his role as a “content creator” was damaged. Oh, and that’s worth $20 billion. \n\nYes, the big tough president, king of the “Fuck your feelings” crowd, essentially brought a participation trophy lawsuit. He wants money from Paramount because CBS made him sad. It’s exactly the type of lawsuit conservatives pretend to abhor. But when it comes to Trump, no amount of tenderness—or cash—is enough. \n\nDOJ’s Civil Rights Division will make sure racist Christian nationalists can thrive\n\nWell, at least we know which civil rights the administration is interested in fighting for. \n\nAt the request of dedicated Christian nationalist Matt Meyer, the federal government has sued the city of Troy, Idaho, in order to force the city to let Meyer open a church in its downtown business district, even though Troy’s ordinance prohibits all churches in that district, not just Meyer’s Christ Church. Nonetheless, the administration’s lawsuit alleges Troy violated the Religious Land Use and Institutionalized Persons Act of 2000 by not waiving its zoning requirements for the church.\n\nRelated | Rubio tells his staff to snitch on ‘anti-Christian’ colleagues\n\nSo, what type of church is Christ Church? Regrettably, just the kind this administration would adore. It’s led by Doug Wilson, who loves Christian nationalism and has outright said that Moscow, Idaho, is a good place for a biblical takeover because “We should want America to be a Christian nation.” Wilson is pretty adamant he’s neither racist nor sexist, a claim that is undercut by his actions. He wrote a book defending slavery and he speaks at Confederate “heritage” conferences. He thinks women need to surrender to men and be “led with a firm hand.”\n\nDunno, buddy. That sounds a lot like racism and sexism. \n\nThe administration’s suit against Troy makes no mention of the church’s beliefs but does have a long section of quotes from random people who said mean things about the church. Totally normal filing, yesiree. \n\nGet to know a low-profile scumbag: Judd Stone\n\nWell, you actually probably do know who Judd Stone is now, though probably not for the reasons he wishes.\n\nNews broke earlier this week that in 2023, Stone had had resigned his gig as solicitor general of Texas after multiple sexual harassment complaints from colleagues because Stone would not stop talking about his fantasy of … an asteroid raping his colleague?\n\nWe learned about this only because one of the women he allegedly harassed filed a lawsuit with all the details you wish you never knew about Stone’s extremely odd and highly specific brand of sexual harassment. It also alleges that Texas Attorney General Ken Paxton let Stone resign after he learned of the misconduct allegations, as did Sen. Ted Cruz over similar allegations when Stone worked in Cruz’s office.\n\nStone’s name might not have rung a bell before this, but he was the Lone Star State’s top appellate lawyer. He’s argued before the Supreme Court eight times, including defending the state’s abortion ban that allows private citizens to sue over someone else’s abortion. Stone’s argument? That just being aware of someone else’s abortion could cause them “psychological harm” from their “extreme outrage” over abortion. \n\nYou know what actually causes psychological harm? Graphically describing your anal rape fantasies to your subordinates at work. \n\nStone has been in private practice now for a couple of years, where he has chosen to represent exactly the type of person you think he would: He’s the lawyer for X in Elon Musk’s vendetta against Media Matters.\n\nIn a normal world, the allegations against Stone would mean his high-flying legal career was over. In the Trump era, he’ll probably get a judgeship instead.\n\nSpeaking of judges\n\nTrump’s first slate of judicial nominees is out and, as per usual, he’s picked some real winners. \n\nWe already knew that Trump was nominating Emil Bove, his former criminal defense attorney and current high-level bully at the DOJ, for a seat on the Third Circuit Court of Appeals. But what about some of the lesser lights Trump wants to put on the bench? Here are a couple. \n\nYou might not have heard of Joshua Divine, the current solicitor general for Missouri, but given his views, you’re probably going to hear a lot from him if he gets a lifetime seat on the federal court in the Show Me State. In 2010, Divine wrote a college op-ed arguing that people should be required to pass literacy tests before they could vote. \n\nYou do not need to be a legal scholar or a Trump judicial nominee to see that this is straight-up racist Jim Crow stuff. It’s the reason we have a Voting Rights Act! \n\nOne of Divine’s colleagues, Maria Lanahan, has also been nominated for a seat on the Missouri federal bench. As the principal deputy solicitor general in the Missouri Attorney General’s Office, Lanahan co-authored Missouri’s unhinged complaint that is part of an overall conservative strategy to get the abortion pill, mifepristone, banned entirely. \n\nSome of Lanahan and Divine’s top-notch and totally true arguments? That the abortion pill “starves the baby in the womb” and that access to abortion creates “diminishment of political representation,” which can lead to “loss of federal funds.”\n\nIn case you don’t speak fluent anti-choice, here’s a translation: Their argument is that the state is harmed by not forcing more people to have children, because the state wants a higher population to increase its political might and federal funding. \n\nCan’t wait to see great arguments like this in judicial opinions. \n\nTrump’s Office of Special Counsel appointee has no idea what that office is, but will be terrible regardless\n\nThe Office of Special Counsel is one of those tiny federal agencies that is very important, but one you likely have never heard of unless you’re a federal employee or a whistleblower. However, we now live in a world where Trump and fellow megalomaniac Elon Musk let untamed children run amok through the federal government, so we’re all now deeply aware of these sorts of things. \n\nThe OSC protects federal employees from reprisal, particularly for whistleblowing, and serves as a secure channel for federal whistleblowers to report wrongdoing. Trump illegally pushed out the previous head, Hampton Dellinger, without cause, but the courts didn’t stop him, so here we are. \n\nLet’s take a quick detour here to talk about why Dellinger got that job. Before being appointed head of the OSC, Dellinger represented whistleblowers, served as deputy attorney general in North Carolina, and was chief legal counsel to the North Carolina governor, where he investigated Medicaid fraud and political corruption.\n\nNow, let’s talk about the credentials of Trump’s pick Paul Ingrassia, who seems to think his new job in the OSC is about “eliminating waste, fraud, and abuse in the federal workforce and revitalize the Rule of Law and Fairness in Hatch Act enforcement.”\n\nIt’s not surprising Ingrassia wouldn’t know anything about the job he’s getting, because his previous legal work includes representing notorious professional misogynist Andrew Tate, with kind of an oopsie where he said he was an attorney more than a year before he was admitted to the bar. This might tip you off that Ingrassia has not exactly had a long legal career, having graduated law school in 2022. \n\nIn his role as White House liaison official for the Department of Justice, he was instrumental in getting the travel ban against Tate and his brother, Tristan, lifted. He’s also a big fan of professional racist Nick Fuentes. \n\nIngrassia’s other work includes writing for the Gateway Pundit and hosting a far-right podcast, which are definitely things that qualify you to run a federal agency specializing in whistleblowing and the protection of federal employees. \n\nTrump described him as a “highly respected attorney, writer, and Constitutional Scholar,” but he is objectively none of those things. Even if you think Trump is great and Ingrassia is terrific, nothing about his meager experience adds up to “highly respected attorney” or “Constitutional Scholar.” But hey! At least the “writer” part is correct—if you count stanning for Trump on the worst blog imaginable.","summary":"Injustice for All is a weekly series about how the Trump administration is trying to weaponize the justice system—and the people who are fighting back.\n\n\n\n\nTrump is a snowflake, and his sad feelings are worth $20 billion\n\n\n\nIn what is now apparently a trend, Paramount has offered Donald Trump millions of dollars to settle a lawsuit that has no merit. But Paramount’s proposed bribe of $15 million to a sitting president just wasn’t enough for Trump, who wants $25 million and an apology from CBS for the imagined slights he suffered\n\n\n\nHere’s the thing: At the very best, all Trump can point to is that “60 Minutes” may have engaged in some light editing of an interview with Kamala Harris, which, last time we looked, was neither a crime nor worth $25 million. But media companies have learned that they have to bribe Trump or they’ll face harassing investigations by the Federal Communications Commission or see their mergers blocked. And Paramount just happens to have a merger pending that requires approval. \n\n\n\n\n\n\n\nW","url":"https://www.dailykos.com/story/2025/5/31/2325066/-Trump-throws-a-20-billion-tantrum-and-meet-more-dodgy-judicial-nominees?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1438430/story_image/Injustice_5.30.png?1748642816","video":null,"publish_date":"2025-05-31 19:00:05","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","category":"politics","source_country":"US","sentiment":0.034},{"id":326848936,"title":"Germany’s Merz secures long-awaited Trump meeting on June 5","text":"By Arne Delfs | Bloomberg News\n\nGerman Chancellor Friedrich Merz will travel to Washington for his inaugural meeting with U.S. President Donald Trump next week, almost a month after starting his term leading Europe’s largest economy.\n\nThe 69-year-old conservative, who became Germany’s chancellor on May 6, will meet the U.S. leader at the White House on June 5, government spokesman Stefan Kornelius said in an emailed statement on Saturday.\n\nThe topics will include Russia’s war in Ukraine, the situation in the Middle East and trade policy, Kornelius said.\n\nThe date and format of Merz’s visit are the result of weeks of negotiations between the White House and the chancellery. Merz will stay overnight in Blair House, the president’s guest house. On Thursday after a joint lunch, the two leaders plan to hold a press conference in the White House before Merz flies back to Berlin, according to a senior official.\n\nCrisscrossed\n\nSince taking charge of Germany’s government, Merz has crisscrossed Europe to meet with allies in France, Poland, the Nordics and Ukraine. But he hasn’t made it across the Atlantic, despite promising to improve ties with the Trump administration.\n\nRelations between Washington and Berlin are tense amid issues ranging from trade imbalances to support for Kyiv. European leaders fear that the U.S. president will abandon efforts to end Russia’s war in Ukraine and dial back military support for the region.\n\nDespite the delay in securing the meeting, Merz is getting his chance to make his case to Trump, unlike his predecessor Olaf Scholz. The Social Democrat never received an invitation to the White House after showing support for former U.S. President Joe Biden and Democratic candidate Kamala Harris.\n\nMerz’s meeting will come a week after Foreign Minister Johann Wadephul traveled to Washington for talks with U.S. counterpart Marco Rubio. During the 45-minute meeting, both sides stressed their common position on Ukraine and trade, Wadephul told reporters. Rubio didn’t participate in a press conference.\n\nAntagonized\n\nAfter Trump publicly antagonized Ukraine President Volodymyr Zelenskyy and South African President Cyril Ramaphosa during visits to the Oval Office, German officials are wary that similar treatment might be in store for Merz.\n\nIn addition to tensions over Germany’s trade surplus with the U.S., Trump allies have taken issue with the country’s treatment of the far-right Alternative for Germany. Rubio called a move to classify the second-largest party in the Bundestag as right-wing extremist as “tyranny in disguise.”\n\nMerz has sharply rejected these allegations and called on U.S. politicians to stay out of domestic German politics.\n\nThe chancellor has also suggested that the European Union could retaliate against U.S. technology companies if the trade conflict escalates. A junior member of Merz’s Cabinet proposed a 10% tax on U.S. tech companies, just as the White House pushes for powers to hit back against such levies.\n\nTo soften areas of contention, Merz has been eager to show he’s prepared to fulfill some of Trump’s demands. Most notably, he’s committed to putting Germany on a path to more than double defense-related spending to 5% of national output in the coming years.\n\nWith assistance from Kevin Whitelaw.\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.","summary":"The 69-year-old conservative, who became Germany’s chancellor on May 6, will meet the U.S. leader at the White House on June 5.","url":"https://www.mercurynews.com/2025/05/31/germanys-merz-secures-long-awaited-trump-meeting-on-june-5/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/Germany_New_Chancellor_72596.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-31 18:29:27","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","category":"politics","source_country":"us","sentiment":-0.086},{"id":326844234,"title":"Trump reignites feud with CBS over ‘deleted’ Colbert interview - years after his claim was debunked","text":"President Donald Trump posted a video claiming that CBS “deleted” his 2015 interview with Stephen Colbert, resurfacing a debunked claim against one of his favorite recent rivals.\n\nLate on Friday, the president reposted a Facebook video on his Truth Social account containing heavily edited clips of his September 2015 interview on The Late Show with Stephen Colbert. A message next to the video states: “You are not supposed to see this video. CBS DELETED this entire episode from their official website. You will not find these segments on YouTube either.”\n\nHowever, a quick search on YouTube showed otherwise. Clips from the Trump-Colbert interview are still available to be watched on the official Late Show account. One video has 17 million views. \n\nThe Independent has reached out to the White House and CBS for comment.\n\nBoth the YouTube video and Trump’s post include a portion of the interview in which Trump, then a candidate, touts his plans to build a wall, prompting the audience to cheer. “Oh, listen to this, even with your crowd –” Trump begins. Colbert interjects: “They love the wall. People love the wall.”\n\nStrangely, this isn’t the first time that Trump has made this claim.\n\nThe president appears to have reposted that same video in his first term in October 2018. Hours later, Colbert posted on X: “I don't know why the president would take time on a National Day of Mourning to retweet something weird like this, but the original clips have always been online. 16 million views.” The comedian attached two links to YouTube clips from the episode in question.\n\nA CBS spokesperson at the time told the Associated Press that full episodes of The Late Show are only available to stream online 30 days after the initial airing.\n\nTrump’s Friday Truth Social post marked the latest move in his feud with CBS. \n\nThe president has repeatedly expressed his ire at CBS’ 60 Minutes interview with Kamala Harris. He has sued the network for $20 million, claiming it used “deceitful editing” to advantage the then-vice president. \n\nCBS filed a motion to dismiss the case earlier this month, arguing: “This lawsuit is an affront to the First Amendment and is without basis in law or fact.”\n\nIn response, this week Trump’s lawyers claimed he suffered “mental anguish” as a result of the interview. His legal team also accused to the network of seeking “to wield the First Amendment as a sword, arguing that they cannot be held responsible for illegal conduct, intended to mislead the masses and undertaken in the pursuit of profit, because such conduct was the result of ‘editorial judgment.'”","summary":"Trump appears to have reposted the same clip in October 2018 — and the claims were swiftly debunked at the time","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-cbs-feud-colbert-interview-b2761320.html","image":"https://static.independent.co.uk/2024/10/30/19/Untitled-design.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/EAIBv0Ef-4VHSaSK0.mp4","publish_date":"2025-05-31 17:41:40","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.303},{"id":326857534,"title":"Marlow Reviews 'Original Sin,' Reveals Tapper's Agenda: No Major Revelations, Scapegoats Irrelevant Democrats for Biden Loss","text":"On Friday’s “Alex Marlow Show,” host and Breitbart Editor-in-Chief Alex Marlow discussed the book “Original Sin.”\n\nMarlow stated, “[T]hey have a[n] agenda, and that agenda is to point the blame and scapegoat what is known as the politburo, which is Joe Biden’s inner circle” and the Biden family itself, “none of which are relevant right now and many of which will never be relevant again. … And everyone else comes out looking good” including former Vice President Kamala Harris.\n\n“The Alex Marlow Show,” hosted by Breitbart Editor-in-Chief Alex Marlow, is a weekday podcast produced by Breitbart News and Salem Podcast Network. You can subscribe to the podcast on YouTube, Rumble, Apple Podcasts, and Spotify.\n\nFollow Breitbart.tv on Twitter @BreitbartVideo","summary":"On Friday&#8217;s &#8220;Alex Marlow Show,&#8221; host and Breitbart Editor-in-Chief Alex Marlow discussed the book &#8220;Original Sin.&#8221; Marlow stated, &#8220;[T]hey have a[n] agenda, and that agenda is to point the blame and scapegoat what is known as the politburo, which is\n\n\nThe post Marlow Reviews &#8216;Original Sin,&#8217; Reveals Tapper&#8217;s Agenda: No Major Revelations, Scapegoats Irrelevant Democrats for Biden Loss appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/05/31/marlow-reviews-original-sin-reveals-tappers-agenda-no-major-revelations-scapegoats-irrelevant-democrats-for-biden-loss/","image":"https://media.breitbart.com/media/2025/01/120-Thumbnail-2-640x335.jpg","video":null,"publish_date":"2025-05-31 17:26:57","author":"Breitbart Editor,Breitbart TV","authors":["Breitbart Editor","Breitbart TV"],"language":"en","category":"politics","source_country":"US","sentiment":0.263},{"id":326837926,"title":"Surprise 2028 pick? Democrats back unexpected candidate — and it’s not Kamala Harris","text":"A new poll came out on May 30 by Atlas Intel. The poll asked Democratic voters who they want to support in the 2028 presidential primary. Ex - Vice President and Democratic candidate in 2024 Kamala Harris wasn't the top pick. Pete Buttigieg was the most popular pick among Democrats, as per reports. He’s the former mayor of South Bend, Indiana and was also transportation secretary under Biden. 31.5% of Democrats in the poll said they would vote for him. Alexandria Ocasio-Cortez was the second choice. 19.4% of Democrats picked her, as per MassLive report. Kamala Harris came in third, with 16.6% support. This result is different from other polls done in May by Echelon Insights and McLaughlin & Associates, which had Harris in first place. That’s why the Atlas Intel poll stands out., as per reports. None of the top 3, Buttigieg, Ocasio-Cortez, or Harris, have officially said they are running for president yet. According to the CBS News report, Harris is thinking about running for California governor or trying again for president. Cory Booker, U.S. Senator from New Jersey, was fourth in the poll. He got 10.4% support. California Governor Gavin Newsom came next with 7.1%. Then came Pennsylvania Governor Josh Shapiro with 4.8%, as stated in the MassLive report. After that, Michigan Governor Gretchen Whitmer got 3.7%. 3.6% of Democrats said “none of the above.” 1.4% chose Senator Raphael Warnock from Georgia. The poll was done from May 21 to May 27, and it included 3,469 U.S. adults. The margin of error is plus minus 2.2%, as mentioned in the MassLive report. FAQsQ1. Who is leading in the 2028 Democratic poll?The go-to choice in the latest round of Atlas Intel poll seems to be Pete Buttigieg Q2. Is Kamala Harris in the run for being one of the presidential candidates in 2028?She could make a run for the white House or for a governor's office.","summary":"A new poll shows many Democrats prefer Pete Buttigieg over Kamala Harris for the 2028 race. AOC is second, while Harris is third. This poll is different from others where Harris led. None of them have confirmed running yet.","url":"https://economictimes.indiatimes.com/news/international/us/surprise-2028-pick-democrats-back-unexpected-candidate-and-its-not-kamala-harris/articleshow/121539007.cms","image":"https://img.etimg.com/thumb/msid-121539044,resizemode-4,width-1200,height-900,imgsize-82607,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-31 17:15:38","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":-0.106},{"id":326833414,"title":"Lester Holt gets emotional in final sign-off from “NBC Nightly News” after 10 years: 'It has been quite a ride'","text":"Lester Holt's time at NBC Nightly News has come to an end.\n\n Its lead anchor signed off for the last time on Friday with a thoughtful speech to commemorate his time on the show.\n\n \"After 10 years, this is my last Nightly News broadcast,\" Holt said. \"As anchor, it has been an honor to lead this program, and an honor to be welcomed into your homes. I'm so grateful for your trust. Around here, facts matter. Words matter. Journalism matters. And you matter.\"\n\n Holt went on to briefly recall some of the biggest stories from his tenure at Nightly News. \"Over the last decade, we have shared some dark and harrowing days and nights in our country: the pandemic, mass shootings, natural disasters,\" he said. \"Each testing our resilience and our compassion. It's why I often like to leave you with something to smile about, moments that reassure and connect us.\"\n\n The anchor emphasized his gratitude toward his staff, family, and viewers. \"I'll miss our evenings together, and I'll miss the team that puts it all together: my dear friends and my colleagues,\" he said. \"But for now, I just want to say thank you to my incredibly supportive and patient family and all of you.\"\n\n Holt also expressed support for his successor at Nightly News, Tom Llamas, who steps into the role on Monday. He ended his remarks with a modified version of his signature sign-off: \"Please continue to take care of yourself and each other, and I'll do the same.\"\n\n The show then cut to a montage of some of Holt's most memorable stories, including reporting from Puerto Rico, Iran, Ukraine, Israel, and France, as well as interviews with Donald Trump, Joe Biden, Barack Obama, and Kamala Harris.\n\n Holt slipped in a few more words after the montage. \"Oh my goodness,\" he said, getting emotional. \"It has been quite a ride. Thanks, everybody.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n The broadcaster began his career at CBS stations in New York, Chicago, and Los Angeles, reporting from 1981 until 2000. He moved to MSNBC in 2000 and became a substitute anchor for both NBC Nightly News and Today in 2003. Holt then anchored the weekend edition of Nightly News from 2007 to 2015, before replacing Brian Williams as the show's weekday host.\n\n Holt announced his departure from Nightly News in February amid internal shakeups at NBC. However, he will remain on the network following his exit, pivoting into a full-time role as the lead presenter of Dateline NBC. \n\n Watch Holt's final sign-off from Nightly News above.","summary":"\"Around here, facts matter,\" the show's lead anchor said in his farewell speech on Friday. \"Words matter. Journalism matters. And you matter.\"","url":"https://ew.com/lester-holt-gives-final-sign-off-nbc-nightly-news-11745968","image":"https://ew.com/thmb/oDcPh2LR4kf9xrnaW0SrOOjCgeM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Lester-Holt-signs-off-nightly-news-053125-0a9c79ebd07541a685727fd9ef9bbf8a.jpg","video":null,"publish_date":"2025-05-31 16:56:20","author":"Wesley Stenzel","authors":["Wesley Stenzel"],"language":"en","source_country":"US","sentiment":0.361},{"id":327054256,"title":"The battle over the future of conservatism","text":"In 2016, prominent conservatives warned fellow Republicans against backing Donald Trump in the GOP presidential primary. The billionaire real-estate mogul and reality TV star, Trump’s conservative critics argued, was vain, vulgar, and mercurial; ignorant of public policy; and lacked commitment to conservative or any other principles. After Trump won his party’s nomination, conservative Never Trumpers exhorted Republicans to vote in the general election for Democrat Hillary Clinton or a third-party candidate. To elect Trump, the Never Trumpers contended, would inflict long-term harm by legitimizing a rogue element within the conservative movement. Better to lance the boil early and suffer less pain later.\n\nDuring his first term, President Trump did much to please the conservatives who voted for him. Notwithstanding the drumbeat of accusations that he would destroy freedom and democracy in America and an onrush of his own over-the-top pronouncements on social media, Trump cut taxes and reduced regulations. He appointed conservative judges. He cracked down on illegal immigration. Until COVID-19 struck the world in the final year of his term, he presided over a growing, low-unemployment economy. His administration reoriented U.S. foreign policy around the overarching challenge to American freedom, playing out on every continent, presented by the Chinese Communist Party. And Trump accomplished all this despite a two-year special-counsel investigation that did not find evidence to vindicate the charge that he colluded with Russia to steal the 2016 presidential election, and an impeachment and Senate trial for improperly withholding aid from Ukraine that ended in acquittal.\n\nTrump then executed an astonishing political comeback – overcoming the Jan. 6 riots, a second impeachment, two civil lawsuits, four criminal indictments, and two assassination attempts – to win back the White House in 2024.\n\nThe frenetic and tumultuous first four months of the second Trump administration have put the president and his teams still more at odds with traditional American conservatism. Whereas in 2017 he arrived in Washington accompanied by a small, largely inexperienced retinue, this time, no longer a political neophyte, he surrounded himself with an extensive network of officials, advisers, and assistants who share an overriding loyalty to the man and his agenda. Already, he has signed more than 150 executive orders that disrupt, scale back, or terminate long-established government programs. He has taken on the federal bureaucracy, illegal immigration, and elite universities. He has imposed, and then suspended or reduced, massive tariffs on America’s trading partners – friends and allies as well as China. He has scoffed at America’s promotion of freedom and democracy abroad while emphasizing the pursuit of peace and stability through commerce. And he has exploited social media not only to circumvent the press and communicate with the people directly but also to troll adversaries, including world-famous musicians.\n\nThe second Trump administration seems to have thrown caution to the wind. Does it still make sense to characterize as conservative the president, his administration’s shock-and-awe tactics, and the “New Right” for whom the president can seemingly do little wrong?\n\nIn “Don’t Call This Conservatism,” a lengthy essay appearing mid-May in The Dispatch, Jonah Goldberg puts the matter starkly. “If being a principled defender of the constitutional order, limited government, free markets, traditional values, and an America-led world still makes you a conservative, are you still on ‘the right’ when the loudest voices on the right reject most or all of those positions?”\n\nA prominent conservative voice for more than 20 years, the former National Review senior editor is editor-in-chief and co-founder of The Dispatch as well as the bestselling author of “Liberal Fascism” among other books, an AEI senior fellow, a Los Angeles Times columnist, and host of “The Remnant” podcast. Always entertaining and illuminating and as home in popular culture as in the classics of conservatism and the particulars of public policy, he insists that “[l]abels matter, because we use labels – terms, constructs, categories, words – to understand reality and chart our course through it, both individually and collectively.”\n\nGoldberg credits the Catholic man of letters G.K. Chesterton (1874-1936) with providing, in describing two reformers’ competing attitudes toward a fence or gate, a good first approximation of conservatism. “The more modern type of reformer goes gaily up to it and says, ‘I don’t see the use of this; let us clear it away,’” writes Chesterton. “To which the more intelligent type of reformer will do well to answer: ‘If you don’t see the use of it, I certainly won’t let you clear it away. Go away and think. Then, when you can come back and tell me that you do see the use of it, I may allow you to destroy it.’” Whereas progressives are disposed to tear down to make way for the new, conservatives’ inclination is to preserve and improve what exists.\n\nConservatism so understood designates both a temperament and an intellectual orientation.\n\nThe 20th-century British thinker Michael Oakeshott, according to Goldberg, captures the conservative temperament: “To be conservative, then, is to prefer the familiar to the unknown, to prefer the tried to the untried, fact to mystery, the actual to the possible, the limited to the unbounded, the near to the distant, the sufficient to the superabundant, the convenient to the perfect, present laughter to utopian bliss,” Oakeshott observes. The conservative temperament cherishes the inherited, admires the beauty in the passing moment, and aims high while taking in stride the world’s rampant folly, perfidy, and ill fortune.\n\nA conservative in the intellectual sense brings such a temperament to life in the preservation and improvement of a particular tradition. An American conservative, for example, cultivates and transmits the nation’s fundamental beliefs, practices, and institutions. That starts with America’s founding principles and constitutional practices: individual rights, limited government grounded in the consent of the governed, equality under law, free markets, and robust civil society composed of families, faiths, and a multitude of civic associations. It includes the convictions and virtues that enable a free people to govern itself and pursue happiness. In the 1960s, National Review senior editor Frank Meyer gave the name “fusionism” to the blend of freedom and traditional morality that undergirds America’s constitutional inheritance, and which reflects the logic of free and democratic self-government.\n\nTrump and the New Right that has consolidated around him, Goldberg contends, pose a fatal threat to traditional conservatism in America – temperamental and intellectual. Under the guise of rethinking or reinventing conservatism, the Trump right panders to the people by repackaging as conservative policies that fit popular grievances, Goldberg maintains. The Trump right endorses an “apocalyptic politics,” insisting that American institutions – including the conservative establishment as well as the progressive establishment – are crumbling and that the right ought to hasten their collapse. It regards the rule of law as an instrument to be used and not used as pursuit of the common good dictates. It embraces the statism of tariffs and industrial policy. It downplays the power of American principles in diplomacy and disparages long-standing American allies. It celebrates manliness, which it equates with bravado, brute strength, and conquest, and which it severs from honor, virtue, and justice.\n\nMuch of the Trump right would agree with Goldberg that it and traditional American conservatism represent divergent and increasingly clashing political outlooks. Yet that leaves open the prudential question whether given the circumstances, a traditional American conservative might reasonably have preferred Trump in 2024, as in 2016 and 2020.\n\nOddly, given the importance that traditional conservatism attaches to prudence, Goldberg overlooks the question. But a traditional conservative is obliged to take stock of the world as it is. By 2016 it had become incumbent on traditional American conservatives to recognize that American conservatism had lost its way.\n\nTraditional American conservatives stress realistic assessment of the nation’s capabilities, fiscally responsible governance, and the dependence of politics on culture and education. Yet during George W. Bush’s two terms, conservatives conducted wars in Afghanistan and Iraq that fell far short of their objectives. In addition, they oversaw reckless increases in government spending. And they offered little opposition to the progressive culture war, not least on campuses, against traditional morality.\n\nTraditional American conservatives emphasize the importance of character to statesmanship and citizenship. Such a conservative might have sensibly viewed as the worse option the corrupt and cynical Hillary Clinton in 2016, the obviously declining Joe Biden in 2020, and the often unintelligible and progressive-left-backed Kamala Harris in 2024.\n\nAnd while traditional American conservatives can never regard the people’s passing predilections as the supreme guide to politics, in the 2010s popular discontent with self-regarding and incompetent elites surged throughout the rights-protecting democracies of the West. Far from lancing a boil by keeping Trump out of the White House, a vote for Clinton or Harris – as a vote for Biden demonstrated – would have paved the way for more hard-left policies that would have further alienated red-state America and intensified the grievances that Trump rode to victory in 2016 and 2024.\n\nIn these situations, traditional American conservatives might reasonably have chosen to moderate the Trump right rather than join the resistance against it.","summary":"'The second Trump administration seems to have thrown caution to the wind'","url":"https://www.wnd.com/2025/05/the-battle-over-the-future-of-conservatism/","image":"https://www.wnd.com/wp-content/uploads/2024/06/Trump-mugshot.jpg","video":null,"publish_date":"2025-05-31 15:57:50","author":"Realclear Wire,RealClearWire","authors":["Realclear Wire","RealClearWire"],"language":"en","category":"politics","source_country":"us","sentiment":-0.098},{"id":326809206,"title":"Spirit of Harriet Tubman coming to life on stage","text":"In January, Willie Phillips of the Laguna Woods African American Heritage Club bought 104 tickets to the play “The Spirit of Harriet Tubman” and chartered two buses to take residents to the one-night presentation in Cerritos.\n\nWritten by and starring Leslie McCurdy, “The Spirit of Harriet Tubman” is a one-woman play based on the life of the abolitionist and “conductor” of the Underground Railroad who freed hundreds of slaves in the 1800s.\n\nNow, thanks to a collaboration between the AAHC and the Community Bridge Builders, McCurdy will present her award-winning creation at the Performing Arts Center this Saturday, May 31, at 4 p.m.\n\n“Harriet Tubman was a genius; she was spiritual, she had visions. Yet genius gets lost,” McCurdy said. “Now we need to use our intellect to push our history forward again.”\n\nFrom 1850 to 1860, Tubman was estimated to have freed at least 70 slaves by taking them north to Maryland from the South via the Underground Railroad – not a literal railroad but a network of secret routes, hiding places and safe houses.\n\nWith the assistance of other abolitionists, she also helped fugitive slaves find routes to safety and freedom and, during the Civil War, led a raid that freed more than 700 slaves.\n\nTubman claimed no casualties for her group.\n\n“I never ran my train off the track, and I never lost a passenger,” she reportedly said of her mission.\n\nMcCurdy will embody Tubman as she has done for 20 years: on a bare stage with only a trunk filled with costumes to help her recreate the tumultuous stages of the activist’s life, starting as an abused young slave and ending as a 90-year-old legend and symbol of freedom.\n\nMcCurdy recently spoke by phone of her transition from aspiring dancer to actor to Tubman performer after fracturing a hip in a fall as she was on her way to join a dance company in New York.\n\n“I started writing after I tripped, and fell into acting when a friend took me to audition for a one-woman play,” she recalled.\n\nHaving made the cut, she started embodying Tubman from a script by Karen Meadow Jones in 1992 and 1993.\n\nWhen her run ended, McCurdy decided to tour the play on her own. But after she also edited the script into a version for school audiences at the producer’s behest, she received a cease-and-desist order from the playwright’s attorney.\n\n“I was not to utter another word about Harriet Tubman,” she recalled.\n\nTurning her initial “now what?” into inspiration, McCurdy wrote her own one-woman play in three weeks, memorized it in days and took the show on the road.\n\n“That play was coming right from the inside of me,” she recalled. “Now, when I perform, I channel Harriet by asking her spirit to help me use her words – note the title of the play.”\n\nMcCurdy first heard about Tubman when she was in the fifth grade in Ontario, Canada\n\n“I was a tomboy and liked to play a lot of boys’ games. To me, Harriet was a woman who did men’s things better than men,” she said.\n\nIn Canada, she said, “there was not a lot of talk of Black people, and some still believed that slaves were heathens who had needed to be civilized.”\n\nMcCurdy also wrote “Harriet is My Hero” as an accompaniment to be performed for K-2 students.\n\n“That play shows kids the characteristics that made Harriet a good hero and which they might want to emulate if they want to be heroes as well,” she said. “Ragdolls and marionettes help tell the story and illustrate the skills that Harriet had to learn from childhood into old age.”\n\nAmong her female heroes, McCurdy cites her mother and her aunt, former Vice President Kamala Harris, Los Angeles Mayor Karen Black, and Netumbo Nandi-Ndaitwah, the newly elected president of Namibia.\n\n“Black women will save the world,” McCurdy said. “As an energy force, they are an impetus for a new age.”\n\nShe plans to perform “The Spirit of Harriet Tubman” until 2027 and then perhaps substitute another actor into her role.\n\n“The thought of not doing the show breaks my heart, so it’s still perhaps a no,” she said.\n\nMeanwhile, McCurdy has portrayed Billie Holiday in “Lady Ain’t Singing No Blues,” a play that gives insight into the singer’s turbulent life. She pays tribute to African American women whose visions bring change in “Things My Foresisters Saw,” and she produced “The Darktown Strutters Ball,” a documentary focused on the contributions of Black performers throughout history.\n\nPhillips, the vice president of the African American Heritage Club, hopes for more culture- and history-infused productions at the PAC like “The Spirit of Harriet Tubman.”\n\n“There’s nothing wrong with music, concerts, bands, comics and parties,” he said. “However, we would like to see other types of entertainment – plays, ballets, documentaries. History in motion, if you will, real shows about the lives and contributions of real people that have been and are making real positive contributions to our society at large.”\n\n“The Spirit of Harriet Tubman” will be staged at the Performing Arts Center on Saturday, May 31, at 4 p.m. Tickets are $20, $30 and $40, available at the box office or online at tickets.lagunawoodsvillage.com. For more information, email Community Bridge Builders at lwcommunitybrigebuilders@gmail.com.","summary":"One-woman show about Underground Railroad 'conductor' to be staged in Laguna Woods","url":"https://www.ocregister.com/2025/05/31/spirit-of-harriet-tubman-coming-to-life-on-stage/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/LWG-L-TUBMAN-0529-02-1.jpg?w=1024&h=717","video":null,"publish_date":"2025-05-31 14:56:58","author":"Daniella Walsh","authors":["Daniella Walsh"],"language":"en","source_country":"US","sentiment":0.193},{"id":326799270,"title":"Video of People 'Leaving Early' From Trump Rally Questioned","text":"A viral video claiming to show attendees leaving early at a President Donald Trump rally in Pennsylvania on Friday has sparked debate online.Why It MattersOn multiple occasions in the past, people have posted videos to X, formerly Twitter, claiming to show people leaving Trump rallies early. But the latest video has come under scrutiny, even from the president's critics.Trump has long been known for his tendency to exaggerate crowd sizes at his rallies and public events, a pattern that dates back to his very first days in office.What To KnowThe video, shared by the left-leaning account Patriot Takes, shows a group of four people appearing to exit Trump's rally in Pennsylvania on Friday before it had concluded.However, viewers and commenters on social media quickly pointed out that the footage captures only a tiny fraction of the audience.\"I can't stand him, but come on, it was like four people,\" X user Rick Dorris wrote.Several other observers suggested that the individuals might simply be stepping out for a restroom break or refreshments rather than leaving altogether.Other images and videos from the same rally depict large crowds, reinforcing the notion that the majority of attendees stayed throughout the event.There have, however, been instances of larger numbers of people leaving early from Trump rallies in the past. Last year, there were multiple reports and videos of noticeable early exits at various Trump events.In one instance, a video posted to X appeared to show a small group of people leaving a Trump rally in November 2024.Washington Examiner reporter Samantha-Jo Roth, who posted the video, wrote, \"In case anyone is wondering, there are in fact people leaving Trump's rally early. To be fair, many of them have been here since the AM.\" The post accumulated over 22,000 views.The host of ABC News' If You're Listening show Matt Bevan also shared videos from a Trump rally in Detroit, which he posted on November 1.He wrote, \"Went to a little event in Detroit. Despite Trump's claim that nobody leaves early, many people left early. From about 25 minutes into his speech, there was a steady stream.\"In the comments, he added, \"I should note, everyone in the room had been there for two hours before he came on.\"He also wrote that Trump was scheduled to come on at 4:30 and came on at around 4:45, and \"people started leaving about 5:10-5:15.\"Meanwhile, in October 2024, former Vice President Kamala Harris' campaign shared a video on Truth Social of a Trump rally in Michigan, showing one crowded section and a larger empty area, mocking him over crowd size.\"Trump: No one else can fill this place up (The room is mostly empty),\" the Harris campaign wrote.Throughout the 2024 presidential campaign, rally crowd sizes and attendance were a point of contention between Trump and Harris, with the Republican frequently boasting about his turnout and jabbing Harris' while the then vice president countered by highlighting people leaving his rallies or empty sections. In September, The New York Times analyzed six rallies in August, finding that both candidates drew similar audience sizes.The Times analysis also found that of those six rallies, Trump spoke four times as long as Harris, writing that the longer duration of his rallies could contribute to the higher number of people leaving early, as based on photographs.The former president previously addressed the comments that supporters were appearing to leave his rallies early.At an event with broadcaster Tucker Carlson in Glendale, Arizona, in October, Trump said, \"They don't leave and they're really well-attended, we can't get places big enough.\"In September, Trump also said to a rally crowd in Walker, Michigan, \"The people that you see leaving—because nobody ever leaves, and when they do, I finish up quick, believe me.\"What People Are SayingOne X user commented: \"Even as a Trump hater, I think these kinds of posts are useless, as evidenced in Nov. 24. You couldn't find him filling any arena, yet he won. Focus on the issues themselves and don't let the chuds pretend they care about working class.\"What Happens NextThe White House has not yet commented on the video.","summary":"On multiple occasions in the past, people have posted videos on social media claiming to show people leaving Trump rallies early.","url":"https://www.newsweek.com/donald-trump-rally-pennsylvania-crowd-sizes-2079310","image":"https://d.newsweek.com/en/full/2654549/trump.jpg","video":null,"publish_date":"2025-05-31 14:46:21","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","source_country":"us","sentiment":-0.357},{"id":326798830,"title":"Why American celebrities ‘escaping’ Trump by fleeting to Britain may be in for a big surprise","text":"Since Trump began his second term, Britain has become a political escape hatch for American celebrities and wealthy Democrats. \n\nIt’s so popular that last week, the British Home Office released data showing that in the 12 months leading up to March, almost 7,000 US citizens applied to become British subjects or live here indefinitely — the highest number since such records began in 2004. \n\nA third of those applications have been received since Trump took office at the start of 2025.\n\nThere are the famous emigres. Kamala Harris supporters Ellen DeGeneres and wife Portia de Rossi have taken up residence in the bucolic Cotswolds, selling their Montecito homes after becoming “very disillusioned” when Trump won, according to TMZ. “English country life” runs the caption on Ellen’s latest Instagram reel showing her luxurious home and grounds, complete with chicken and gambolling rabbit.\n\nFellow comedian Rosie O’Donnell has moved to UK-adjacent Ireland and will only “consider coming back” when it is “safe for all citizens to have equal rights there in America,” as she said on a Tik Tok video in March. \n\nBrit Minnie Driver left LA to return to the motherland prompted by Trump’s win. Others considering a move to the UK include Barbra Streisand, who has said she “can’t live in this country if [Trump] becomes president,” as well as Cher and America Ferrera. \n\n“Girls” creator Lena Dunham — along with Ryan Gosling and Eva Mendes — traded the US for London before Trump’s inauguration. \n\nBut the glitzy progressives falling for Britain may find they are in for a shock: This is not the liberal paradise they imagined, despite our Labour prime minister. In fact, Britain’s next leader could be a lot like Donald Trump. \n\nThe populist Reform party is surging in the polls, threatening to explode Britain’s political landscape. It is built around Brexit architect Nigel Farage, an anti-immigration figure with similar cult-like status to Trump and the president’s erstwhile close friend. \n\nReform is no fringe party: 40% of Brits think Farage will be the next Prime Minister.\n\nTrump’s followers remain steadfast despite all; as the president himself noted, he could shoot someone in Times Square and “not lose any voters.” Farage, our possible future prime minister, confers a similar blind devotion on his own party supporters. When a Reform candidate from Yorkshire, selected to run for a seat in Parliament, was revealed to have said, “Black people should get off their lazy arses and stop acting like savages,” voters didn’t care; he still came second.\n\nLast week, a frenzy erupted over a “racist” advert for Reform which bashed the Scottish Labour leader Anas Sarwar by saying he will “prioritize the Pakistani community.” Not a peep of contrition. \n\nDo those trading Trump’s America for Britain fully understand what has been going on in our less glamorous areas? \n\nThis week saw a car-ramming in Liverpool, injuring scores who were out celebrating a soccer triumph.\n\nDo they know what happened last summer, following the massacre by Axel Rudakubana, the son of Sudanese immigrants, of three little girls at a Taylor Swift dance class in the peaceful northern town Southport? \n\nThere were mass riots as thugs stormed mosques and lit them on fire — plus a groundswell of rage at how the Islamist ambitions and sympathies of Britain’s unassimilated immigrants and asylum-seekers are covered up. \n\nFrom the British perspective, of course, the arrival of wealthy and famous American Dems-in-exile has shone an interesting light on our own debates about immigration. Though few admit it, least of all those in power, there are Good Migrants and there are Bad Migrants. \n\nIt is generally agreed now by all the parties that Something Must Be Done about the Bad Ones. In 2024, 694 boats carrying 53 illegal immigrants apiece seeking asylum arrived on British shores, costing taxpayers £6 million a day on hotel bills alone. But the good ones like Ellen with her $18 million farmhouse? We can’t get enough.\n\nIronically echoing Trump’s idea of a “gold card” for desirable immigrants, the UK’s home secretary said earlier this month that Britain would be introducing “provisions to qualify more swiftly that take account of the contribution people have made.” This should ease the way for more Ellens, Evas and Lenas.\n\nOf course, it’s hardly a surprise that most people will take an American celebrity over a trafficked Syrian any day, and their arrival is certainly a bonus for us. But when they discover how far short of a liberal paradise Britain is becoming, their stays on this sceptred isle might be shorter than anticipated.","summary":"The glitzy progressives falling for Britain may find they are in for a shock: This is not the liberal paradise they imagined. ","url":"https://nypost.com/2025/05/31/opinion/american-celebs-escaping-trump-by-feeling-to-britain-may-be-surprised/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-bb5fgi9x4-1748697686808.jpg?quality=75&strip=all&1748684456&w=1200","video":"https://cdn.jwplayer.com/videos/1Wn1TvwB-RyIcpnTz.mp4","publish_date":"2025-05-31 14:30:00","author":"Zoe Strimpel","authors":["Zoe Strimpel"],"language":"en","source_country":"us","sentiment":0.055},{"id":326792484,"title":"Bono Sparks MAGA Backlash After Joe Rogan Appearance","text":"Irish rock star Bono has come under fire from supporters of President Donald Trump's Make America Great Again (MAGA) movement after citing an academic who said the administration's cuts to the U.S. Agency for International Development (USAID) may have been a factor in 300,000 deaths.Bono made the claim during an appearance on Joe Rogan's popular podcast which was released on Friday, after which he was branded \"a liar/idiot\" by former Department of Government Efficiency (DOGE) chief Elon Musk.Newsweek contacted USAID for comment on Saturday via email outside of regular office hours.Why It MattersAfter coming to power in January the second Trump administration ordered a halt to most foreign aid funding and attempted to shut down USAID, though this was blocked in court.Supporters argued cuts saved American taxpayers money that was being used ineffectively, while critics said it would hit some of the most vulnerable around the world.What To KnowDuring his appearance on the Joe Rogan Experience Bono, a founding member of U2, said: \"Just recent report, it's not proven, but there's surveillance enough [to] suggest 300,000 people have already died from just this cut off, this hard cut, of USAID so there's food rotting in boats, in warehouses, this will f*** you off.\"Bono appeared to be referencing research conducted by Boston University infectious disease mathematical modeler Brooke Nichols who concluded USAID cuts could have resulted in 300,000 otherwise preventable deaths, including 200,000 children.Bono's claim sparked a furious response from Trump supporters on social media including Elon Musk, who on Friday was given a large key by the president as thanks after stepping down from the day-to-day management of the Department of Government Efficiency (DOGE).In a post on his X, formerly Twitter, website, referring to Bono, Musk said: \"He's such a liar/idiot. Zero people have died!\"The tech billionaire was responding to Mike Benz, executive director of the Foundation For Freedom Online campaign group, who shared a clip of Bono's remarks adding: \"These USAID numbers are f***** faker than their COVID numbers.\"Popular conservative X commentator Catturd added: \"Elon Musk calls out low IQ moron Bono for being an idiot and a liar.\"However, Bono's comment was welcomed by the Protect Kamala Harris X account, which has over 90,000 followers and posts in support of the former presidential hopeful.The account shared a photograph on Bono, captioned: \"RETWEET if you stand with Bono against Donald Trump!\"What People Are SayingDuring his podcast appearance Bono said: \"There is 50,000 tons of food that are stored in Djibouti, South Africa, Dubai, and wait for it Houston, Texas, that is rotting rather than going to Gaza, rather than going to Sudan, because the people who know the codes for the warehouse are fired, they're done.\"In response, Joe Rogan said: \"They're throwing the baby out with the bathwater, this is the problem, the problem is for sure there have been a lot of organizations that do tremendous good all throughout the world. Also, for sure it was a money-laundering operation, for sure there was no oversight, for sure billions of dollars are missing, in fact trillions, that are unaccounted for.\"What Happens NextIt remains to be seen whether the Trump administration will succeed in its bid to close down USAID entirely or whether this will continue to be blocked in the courts.","summary":"Bono repeated a claim that President Donald Trump's USAID cuts may have been a factor in 300,000 deaths.","url":"https://www.newsweek.com/bono-sparks-maga-backlash-during-joe-rogan-appearance-2079295","image":"https://d.newsweek.com/en/full/2654544/bono-usaid-maga.jpg","video":null,"publish_date":"2025-05-31 13:42:26","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.437},{"id":326790510,"title":"In key 2028 state, Tim Walz says Democrats need to ‘beat the hell out of these dictators’","text":"Minnesota Gov. Tim Walz, wearing a blue suit, calmly explained his vision of a more united country to a roomful of South Carolina Democrats on Friday night, only mildly barbing Republicans in a nine-minute speech.\n\nThen, an hour or two later, the suit was gone and a more fiery, populist and T-shirt-clad Walz took the stage. The venue was a fish fry thrown by longtime Rep. Jim Clyburn, a powerful Congressional Democrat.\n\nWalz called tech billionaire Elon Musk a “dipshit” again. He spoke of rigged systems, “wannabe dictators and despots,” and slammed the “corruption and the cruelty that’s happening under Donald Trump’s watch.” \n\n“But do you know what terrifies them? What terrifies them is about a thousand people in South Carolina coming out on a Friday night and saying ‘enough,’ ” Walz said.\n\nThe underlying message of the two speeches, despite their diverging styles, was the same. Democrats in 2024 focused too closely on seven swing states, Walz said in both speeches, and ignored conservative strongholds like South Carolina, Texas and Florida. Republican rule has hurt people in those states and Democrats need to take their message — and their policies — to them, he argued.\n\n“We need to change the attitude, compete in every district, compete for every school board seat,” he said. “And come out to this damn fish fry with the attitude that we’re going to fill up on some fish and then we’re going to go beat the hell out of these dictators.”\n\nWalz’s Friday night fastball was just a warmup; he will also deliver the keynote address for the South Carolina Democratic Party’s “Dem Weekend 2025” convention on Saturday and will speak at the California Democratic Party’s annual state convention in Anaheim later that day.\n\nThe governor’s brief adventure outside of the North Star State will help him keep his national profile up after his unsuccessful White House bid last year with then-Vice President Kamala Harris. He’s expected to seek a third term for governor and has said that he would “certainly consider” a run for president.","summary":"The Minnnesota governor, who says he’s open to a presidential run, also slammed the “corruption and the cruelty that’s happening under Donald Trump’s watch.”","url":"https://www.startribune.com/in-key-2028-state-tim-walz-says-democrats-need-to-beat-the-hell-out-of-these-dictators/601364648","image":"https://arc.stimg.co/startribunemedia/NEQGYERDAVFGJAAI6YUQZEFW6M.JPG?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2025-05-31 13:34:23","author":"Nathaniel Minor","authors":["Nathaniel Minor"],"language":"en","source_country":"US","sentiment":-0.355},{"id":326959860,"title":"'Chickening out': Why Trump’s total 'shamelessness' may be key to his shocking 'resilience'","text":"President Donald Trump has been a highly resilient figure in U.S. politics. \n\nIn 2024, Trump was facing four criminal indictments, one of which found him being convicted on 34 felony counts by a Manhattan jury. And countless Democrats blamed him for the January 6, 2021 attack on the U.S. Capitol Building. \n\nYet Trump not only won the 2024 GOP presidential nomination — he also narrowly defeated Democratic nominee Kamala Harris in the general election. \n\nREAD MORE: 'Part of you dies a little': MAGA-supporting FBI official admits he hates his job\n\nIn an opinion column published on May 30, the New York Times' Ross Douthat argues that Trump's \"ideological shamelessness\" plays a key role in his \"resilience.\"\n\nTrump deeply resents the \"TACO\" meme that has been circulating among Wall Street investors. TACO stands for \"Trump always chickens out\" — a reference to the way he threatens U.S. trading partners with steep new tariffs but later backs down.\n\n\"The willingness to swerve and backpedal and contradict himself is a big part of what keeps the president viable, and the promise of chickening out is part of Trump’s implicit pitch to swing voters — reassuring them that anything extreme is also provisional, that he’s always testing limits (on policy, on power) but also, generally willing to pull back,\" Douthat explains. \"A case study: Just six weeks ago, I wrote a column describing the second Trump presidency as headed for political failure, while noting that a course correction was still possible. That caveat was debatable, since Trump’s post-Liberation Day polling was starting to look like (former President) Joe Biden’s polling numbers after the botched Afghanistan withdrawal.\"\n\nThe Times columnist continues, \"Once Biden hit the low 40s in the RealClearPolitics average, he never again reached 45 percent approval: Some presidents just lose their mandate early and never get it back.\"\n\nBut Trump, Douthat adds, has a way of recovering from \"setbacks.\" \n\nREAD MORE: 'Made a mistake': George Conway points out 'irony' in Trump's attack on Federalist Society\n\n\"I think Trump's foreign policy, especially, is fundamentally improvisational in a way that’s better suited than some of the more consistent alternatives to the difficult world we now inhabit,\" Douthat argues. \"Even the seeming shamelessness of his swings can be defensible adaptations to complicated circumstance…. One reason that Biden's poll numbers never recovered from their early swoon is that he — or, well, the team actually running things — couldn't find a way to reverse course, on immigration policy especially; a little Trumpian ideological shamelessness would have served his White House well.\"\n\nREAD MORE: Supreme Court at severe disadvantage in dealing with Trump's 'shocking' behavior: expert\n\nRoss Douthat's full New York Times column is available at this link (subscription required).","summary":"President Donald Trump has been a highly resilient figure in U.S. politics. \n\nIn 2024, Trump was facing four criminal indictments, one of which found him being convicted on 34 felony counts by a Manhattan jury. And countless Democrats blamed him for the January 6, 2021 attack on the U.S. Capitol Building. \n\nYet Trump not only won the 2024 GOP presidential nomination — he also narrowly defeated Democratic nominee Kamala Harris in the general election. \n\nREAD MORE: 'Part of you dies a little': MAGA-supporting FBI official admits he hates his job\n\nIn an opinion column published on May 30, the New York Times' Ross Douthat argues that Trump's \"ideological shamelessness\" plays a key role in his \"resilience.\"\n\nTrump deeply resents the \"TACO\" meme that has been circulating among Wall Street investors. TACO stands for \"Trump always chickens out\" — a reference to the way he threatens U.S. trading partners with steep new tariffs but later backs down.\n\n\"The willingness to swerve and backpedal and contradict himself is a ","url":"https://www.alternet.org/trump-chickening-out-douthat/","image":"https://www.alternet.org/media-library/image.jpg?id=60349576&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-05-31 13:32:41","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":-0.049},{"id":326792118,"title":"The most glaring examples of Joe Biden's decline, even as the White House covered it up","text":"The truth about President Joe Biden's physical and mental decline is getting more coverage thanks to Democrats finally conceding it was a mistake for him to run again in 2024. \n\nMost of them blame Biden's family and closest aides for hiding the truth about the president's condition despite obvious signs that he was suffering the effects of old age.\n\nHowever, in truth, concerns about Biden's age and glaring examples of its effects were apparent as early as his 2020 campaign at the age of 77.\n\nAt the time, the most favorable interpretation was that it was just 'Biden being Biden' - he was the affable gaffe-ridden politician who struggled from early youth with a stutter.\n\nBiden won the presidency in 2020, but he was protected in a closely watched cocoon of staff as the coronavirus pandemic raged and his public and media appearances were limited and carefully scripted.\n\nHis isolation only added to his disoriented demeanor when he forgot to wear his coronavirus mask at times, leaving it behind or fumbling for the right words during a press conference.\n\nHere are some of the biggest moments that show the former president's decline had been apparent for some time:\n\nMarch 18, 2021: Biden falls on the stairs of Air Force One\n\nThe president fell repeatedly on the stairs while boarding Air Force One, on a trip to Atlanta, Georgia, despite trying and failing to stand up and regain his balance.\n\nWhite House deputy press secretary Karine Jean-Pierre insisted the president was doing '100 percent fine' and blamed the wind for his stumbles.\n\nAugust 19, 2021: Biden makes multiple errors in interview about Afghanistan\n\nDuring the botched exit from Afghanistan, President Biden continued keeping his remarks closely scripted for days, refusing to respond to shouted questions from reporters and staying on script with his talking points.\n\nThe country was not satisfied with his responses, prompting staff to schedule an interview with ABC's George Stephanopoulos to allow the president to defend his decision to pull U.S. troops from Afghanistan\n\nBiden made multiple errors and gaffes throughout the interview that aired on August 19, 2021 and they had to be clarified and corrected by the White House.\n\nThe terrorist suicide bombing that killed 13 American warfighters and more than 170 Afghan civilians shook Biden as he struggled to defend the botched exit from the country.\n\nAugust 26, 2021: Joe Biden's botched press conference\n\nWhen he finally took questions from the press at a news conference on Afghanistan, Biden found himself frustrated, struggling to finish sentences and recall basic facts and talking points.\n\nAt one moment he bowed his head with frustration and anger, clenching his briefing book of talking points as Fox News reporter Peter Doocy asked him a question.\n\nEven many who voted for Biden questioned the president's ability to handle the chaotic events, and the decisions he made about the way to withdraw forces from Afghanistan.\n\nJanuary 2022: White House clarifies Biden's remarks on Russia\n\nBiden held an extended press conference after a long drought in communications with the White House press but staff rushed to clarify his remarks about Russia making a 'minor incursion' into Ukraine that might not trigger a response from the United States and NATO allies.\n\nA National Security Council spokeswoman immediately said that Biden was only speaking about possible non-military, paramilitary, or cyber attacks.\n\nThe president had not even finished speaking when the clarifications began.\n\nMarch 2022: White House rushes to correct Biden's comment about Putin\n\nWhite House staff scrambled to correct Biden after he delivered a speech in Poland to confront Russian President Vladimir Putin's aggression in Ukraine.\n\n'For God's sake, this man cannot remain in power,' Biden declared forcefully, suggesting he was supportive of regime change in Russia.\n\nThe White House immediately said that Biden's comments were not about regime change and that it was not in his prepared remarks.\n\nBiden himself was frustrated by his staff's corrections, wondering if they would have done the same for former presidents who routinely went off script like Ronald Reagan.\n\nJune 2022: Biden tips over on his bike\n\nWhile riding his bicycle on his beach vacation, Biden stopped to talk to a group of people and tripped over when he came to a stop.\n\nHe later explained his spill was the result of his feet getting clipped into the pedals. \n\nThat summer, Biden's coughing was no longer smothered by the occasional cough drop, his voice grew thinner and weaker, and his gait grew more stiff, prompting additional questions about his abilities.\n\nWhite House press secretary Karine Jean-Pierre repeatedly defended Biden's acuity.\n\n'Oh, my gosh, he's the President of the United States, you know, he – I can't even keep up with him,' she told CNN's Don Lemon in an interview, urging skeptics to look at the work he was achieving.\n\nAugust 2022: Joe Biden struggles with his jacket\n\nPresident Biden traveled for a visit in Kentucky but found himself lost on the tarmac as he struggled to put on his suit jacket for about 15 agonizing seconds.\n\nFirst Lady Jill Biden ultimately assisted him and started walking off but the president's sunglasses then fell off his face, prompting him to stop down and pick them back up.\n\nSeptember 2022: Where's Jackie?\n\nPresident Biden sparked more concern after he arrived at an event with members of Congress and called out to Rep. Jackie Walorski, who had passed away more than a month earlier in a car crash.\n\n'Jackie are you here? Where's Jackie?' Biden said, appearing unaware of her passing.\n\nThe White House defended Biden's question and would only say that the deceased congresswoman was 'top of mind,' during his remarks.\n\nJune 2023: Joe Biden trips on stage\n\nPresident Biden tripped over a sandbag and fell sprawling on stage at the Air Force Academy’s commencement ceremony. White House aides responded that the president was 'fine' after the undignified incident.\n\n'Calm down you nervous nellies,' wrote Biden's former chief of staff Ron Klain on social media, scolding Democrats for questioning the president's health.\n\nOctober 2023: Special Counsel Robert Hurr sounds a warning\n\nPresident Biden struggled during his interview with Special counsel Robert Hur about classified documents found in his possession.\n\nHur's report revealed his honest assessment that Biden was a 'sympathetic, well-meaning elderly man with a poor memory.'\n\nBiden struggled to remember key details about his life after his vice presidency. Hur wrote that he couldn’t recall the date when his son Beau died. \n\nWhen the details were released in early January, Biden was furious about the accusation.\n\nHe was running for reelection and already fighting off suggestions that he was too old to be seeking a second term.\n\nBiden held a press conference defending his abilities, but after insisting 'my memory is fine,' he mistakenly referred to the president of Egypt, Abdel Fattah El-Sisi, as 'the president of Mexico' without correcting himself.\n\nApril, 2024: Joe Biden reads the word 'pause' off of the teleprompter\n\nPresident Biden visited union members in Washington, DC where he appeared to read the world 'pause' off of his teleprompter instructions.\n\n'Four more years. Pause,' he said, as members of the Members of North America’s Building Trades Unions ultimately chanted 'Four more years!' after the president's mistake.\n\nJune 11, 2024: Joe Biden freezes at White House concert\n\nPresident Biden attended a White House concert to celebrate the Juneteenth holiday, but observers expressed alarm as the president froze for a solid minute as people around him danced and sang.\n\nAt one point, he appeared to forget where he was, looking around confused prompting others around him to reach out and engage with him.\n\nJune 14, 2024: Joe Biden wanders off at the G7 summit \n\nAfter President Joe Biden and other world leaders watched a parachute jump, the president slowly stated walking away. \n\nItalian Prime Minister Giorgia Meloni walked over to guide him back to the group for a photo opportunity with the other world leaders. \n\nThe embarrassing video went viral but the White House repeatedly dismissed it as a 'cheap-fake,' asserting that the video failed to show the paratrooper that Biden was trying to walk over and talk to. \n\nJune 16, 2024: Barack Obama guides Biden off stage\n\nThroughout the 2024 campaign, Biden's staff repeatedly defended the president's mental and physical abilities.\n\nBut behind the scenes donors attending fundraising events were incredibly alarmed as he often trailed off during speeches and struggled to remember who he was talking to.\n\nAfter a fundraiser with President Obama, George Clooney, Julia Roberts, and Jimmy Kimmel, Biden paused and gazed out at the crowd appearing confused when he was supposed to be exiting the stage.\n\nFormer President Barack Obama paused and reached back to help guide Biden off of the stage.\n\nIt was not an isolated event. Biden appeared at times to be lost on stage, looking to staff to point him in the proper direction.\n\nBiden's public demeanor was so bad by the summer of 2024 that donors were openly questioning the president's decision to run for reelection.\n\nJune 27, 2024: President Joe Biden participates in the CNN Presidential Debate\n\nIn the presidential debate in June 2024, Biden struggled to finish his sentences and mixed up his prepared talking points as he tried to compete with Trump.\n\nBiden's frail, hoarse and raspy voice alarmed debate viewers as he claimed there were 'a thousand trillionaires' in the United States who needed to be taxed more.\n\nLater in the debate he declared that 'we finally beat Medicare' and struggled to deliver his prepared attacks on Trump.\n\n'I really don't know what he said at the end of that sentence. I don't think he knows what he said either,' Trump quipped.\n\nThe botched debate performance prompted a host of Democrats to publicly call for Biden to exit the race.\n\nBut Biden refused.\n\nPresident Biden visited union members in Washington, DC where he appeared to read the world 'pause' off of his teleprompter instructions.\n\n'Four more years. Pause,' he said, as members of the Members of North America’s Building Trades Unions ultimately chanted 'Four more years!' after the president's mistake.\n\nJuly 11, 2024: NATO Summit\n\nBiden introduced Ukrainian President Volodymyr Zelensky as 'President Putin' before correcting himself.\n\nThe president also referred to his vice president as 'Trump' instead of Kamala Harris during a press conference at the summit.\n\n'Look, I wouldn't have picked Vice President Trump to be vice president if I didn't think she was qualified to be president,' he said.\n\nBiden continued insisting he was 'fine' and fit for reelection.\n\n'If I slow down, I can't get the job done. That's a sign that I shouldn't be doing it. But there's no indication of that yet, none,' he said.\n\nJuly 21, 2024: Biden withdraws from the presidential election\n\nAmid intense pressure, Biden announced his decision to exit the race in a 1:46 pm post on X. \n\nHe later detailed his decision in an Oval Office address:\n\n'I believe my record as president, my leadership in the world, my vision for America's future all merited a second term, but nothing - nothing - can come in the way of saving our democracy. That includes personal ambition,' he said. 'So, I've decided the best way forward is to pass the torch to a new generation. That's the best way to unite our nation.","summary":"The truth about President Joe Biden's physical and mental decline is getting more coverage, thanks to Democrats finally conceding it was a mistake for him to run again.","url":"https://www.dailymail.co.uk/news/article-14766551/joe-biden-mental-decline-white-house-cover-up.html","image":"https://i.dailymail.co.uk/1s/2025/05/31/14/98921105-0-image-m-9_1748697536852.jpg","video":"https://videos.dailymail.co.uk/video/mol/2022/09/28/4740570231995416292/1024x576_MP4_4740570231995416292.mp4","publish_date":"2025-05-31 13:21:59","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.402}]}