{"offset":0,"number":50,"available":803,"news":[{"id":288250606,"title":"Kim Kardashian Freaks Out About Wardrobe Malfunction Ahead of White House Meeting","text":"Kim Kardashian faced an ill-timed wardrobe malfunction moments before arriving at the White House.\n\n Kardashian, an advocate for criminal justice reform, visited former Vice President Kamala Harris during the season 6 premiere of The Kardashians. But, the visit didn’t start on a great foot. \n\n On the way to the White House, Kardashian, 44, reevaluated her outfit and realized it wasn’t as conservative as she would have liked. As the SKIMS co-founder rides in the car with attorneys Erin Haney and Jessica Jackson, she pointed out how much cleavage her black blazer showed, and how it wasn’t appropriate for the meeting. \n\n “I love being here. But I'm also literally falling apart,\" she said in her confessional.\n\n The show then cut back to Kardashian in the car as she said, “I mean it’s still boobing out,\" She asked if they could pull over so Haney could grab Kardashian’s black sports bra and she could change in the car.\n\n “The only other option I had is to switch and put on the sports bra that I wore on the flight here so it has a higher neckline,” Kardashian said in her confessional. \n\n As they approached the entrance, Kardashian rapidly changed her top, calling out that they were running late. \n\n “I'm just spiraling, but we're gonna be so late. I'm changing in the car, trying to figure it out. [My] wig's falling off. There's just like a lot going on,” Kardashian revealed in her confessional. “Nothing like a little wardrobe wig malfunction to get the day going.”\n\n Although the behind-the-scenes footage of Kardashian’s visit to Washington D.C. was a bit more hectic than the TV personality preferred, at the April 25 meeting Harris expressed gratitude for Kardashian's activism for prisoners in the U.S.\n\n The Kardashians star participated in a roundtable discussion about criminal justice reform with Harris, White House public engagement director Steve Benjamin and several recently pardoned former inmates.\n\n \"I want to thank Kim for your advocacy and for using your platform in a way that has really lifted up the importance of talking about and being dedicated to second chances,\" Harris said in a video of the meeting shared by the White House on YouTube.\n\n Kardashian then addressed the newly-pardoned panelists, including Beverly Holcy, Jason Hernandez, Bobby Darrell Lowery, and Jesse Mosley, and said, \"I am super honored to be here to hear your stories today,” per USA Today.\n\n “I think it's so important to share them and amplify them because there are so many people that are in your position that could use the inspiration,\" Kardashian said. \"I'm just here to help and spread the word.”\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n New episodes of The Kardashians air Thursdays on Hulu.","summary":"“Nothing like a little wardrobe wig malfunction to get the day going,\" the TV personality said of her April 2024 visit to the White House","url":"https://people.com/kim-kardashian-wardrobe-malfunction-ahead-of-white-house-meeting-8788358","image":"https://people.com/thmb/K42CwvpEbyzl6N7BBl490j1i1U0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(750x250:752x252)/kim-kardashian-white-house-2-episode-020725-2b337f0ffb314ee0b7be895db24f6ec5.jpg","video":null,"publish_date":"2025-02-08 00:52:33","author":"Charna Flam","authors":["Charna Flam"],"language":"en","category":"politics","source_country":"US","sentiment":0.201},{"id":288250234,"title":"Trump official’s directive tying transportation grants to birth rates could hinder blue states","text":"By JEFF McMURRAY and SUSAN HAIGH\n\nCHICAGO (AP) — Shortly after he was confirmed as President Donald Trump’s transportation secretary, Sean Duffy circulated a memo that instructed his department to prioritize families by, among other things, giving preference to communities with marriage and birth rates higher than the national average when awarding grants.\n\nThe memo also calls for prohibiting governments that get Department of Transportation funds from imposing vaccine and mask mandates, and requiring their cooperation with the administration’s immigration enforcement efforts.\n\nWith hundreds of billions of dollars in transportation money still unspent from the 2021 bipartisan infrastructure law, such changes could be a boon for projects in Republican-majority states, which on average have higher fertility rates than those leaning Democratic.\n\nStates controlled by Democrats were generally more receptive to mask and vaccine rules to combat the COVID-19 pandemic and have been more resistant to Trump’s immigration raids.\n\nMore births for more roads?\n\nAll administrations set their own rules for choosing which transportation projects to prioritize. But some of Duffy’s directives were received as highly unusual.\n\n“Distributing transportation funding based marriage and birth rates is bizarre and a little creepy,” said Kevin DeGood, senior director of infrastructure and housing policy at the left-leaning Center for American Progress. “States and regions with aging populations tend, on average, to have lower birth rates … Are they somehow not deserving of transportation investment?”\n\nAccording to the latest figures from the Centers for Disease Control and Prevention in 2022, the 14 states with the highest fertility rates backed Trump in the November election while the bottom 11 plus the District of Columbia supported Democrat Kamala Harris. Marriage rates tend to skew higher for red states too, but by a smaller margin.\n\nVice President JD Vance has long expressed concern about declining birth rates, citing national economic needs as well as the inherent value of children.\n\nTennessee Republican Sen. Marsha Blackburn raised the idea of tying transportation funding to population growth during Duffy’s confirmation hearing.\n\n“People are leaving some of these blue states and coming to places like Tennessee,” she said. “And this means that we need to look at where those federal highway dollars are spent and placing them in areas with growing needs rather than areas that are losing population.”\n\nSarah Hayford, sociology professor and director of the Institute for Population Research at Ohio State University, said she had never heard of birth rates being used to set funding priorities.\n\n“I was a little surprised,” she said. “Often the policy around birth rates is trying to address challenges or barriers to people not having children. This seems more focused on rewarding people for already having children.”\n\nThe U.S. birth rate has been declining since 2007, which Hayford attributes in part to economic uncertainty during the Great Recession. She said research has tied higher birth rates to areas with lower education.\n\nLongstanding transportation policy already considers where kids live, said Beth Jarosz, senior program director at the nonpartisan and nonprofit Population Reference Bureau.\n\n“If what you’re trying to do is support families, birth rates aren’t necessarily the best way to do that,” she said, pointing out that many growing families move to new communities when they find their homes are too small.\n\nThe Department of Transportation has not responded to questions about the memo.\n\nSo far, lawmakers and advocates are unaware of birth and marriage rates being linked to non-transportation grants.\n\nBlue states push back\n\nBlumenthal said the transportation secretary’s focus on birth and marriage rates was “reminiscent of what you might see in the People’s Republic of China.”\n\n“On its face, it’s social engineering. But clearly and indisputably, it is a dagger aimed at blue states,” he said. “It is patently discriminatory if you look at the numbers. This criteria was designed to punish blue states and coerce states to change their lawful policy on tolls, vaccines and immigration.”\n\nU.S. Rep. Kweisi Mfume, a Maryland Democrat, said he feared Duffy’s directives would harm some grants already announced — including $85 million awarded to Baltimore in the final weeks of the Biden administration to transform a blighted stretch of U.S. 40 known as the “highway to nowhere.”\n\n“If it’s an effort to reward red states, he ought to just go ahead and say that,” Mfume said. “Otherwise, there will be a lot of challenges by states and advocacy organizations all over the country who have no choice but to fight back, and that fight will become a legal one.”\n\nYet Jarosz said the policy’s political intentions are unclear, noting communities like San Diego and Sacramento in California are above the national average in terms of birth rates, while certain rural areas of the country are below.\n\nIs this even legal?\n\nLegal experts say it is too early to know whether anything in Duffy’s memo could be struck down by the courts.\n\nAlthough it is difficult to make a legal argument for funding equality based on political affiliation, federal law does protect against discrimination over such things as race, sex, and disabilities.\n\nJoel Roberson, who handles transportation and infrastructure cases at the Washington, D.C., law firm Holland & Knight, said administrations have widespread authority to set their own criteria for awarding money. However, communities denied funding could file a lawsuit arguing they endured an illegal “disparate impact.”\n\nAs for whether Trump could redirect transportation grants awarded under Biden, Roberson said it largely depends on the status of the project and whether Congress has already appropriated the funding.\n\nState transportation officials have expressed confidence that the new guidelines won’t impact the federal funds states use to set their own transportation priorities and build roads. But many other grants are awarded at the discretion of the administration in power.\n\nLess clear is the status of some already approved discretionary grants, such as an agreement signed just before former President Joe Biden left office committing $1.9 billion toward a nearly $5.7 billion project to add four new L stations in South Side Chicago.\n\nBlumenthal, a former state attorney general and federal prosecutor, said Duffy’s edict created “uncertainty and confusion” and pointed out it doesn’t carry any legal weight like statutes and regulations do. He predicted courts would ultimately reject the policy.\n\n“Anybody can write a memo,” Blumenthal said.\n\nHaigh reported from Hartford, Connecticut.","summary":"Some of Duffy’s directives were received as highly unusual.","url":"https://www.bostonherald.com/2025/02/07/transportation-grants-directive-birth-rates/","image":"https://www.bostonherald.com/wp-content/uploads/2025/02/Trump-Transportation_Funding-Explainer_06395.jpg?w=1024&h=682","video":null,"publish_date":"2025-02-08 00:35:25","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.154},{"id":288249334,"title":"Trump official’s directive tying transportation grants to birth rates could hinder blue states","text":"By JEFF McMURRAY and SUSAN HAIGH\n\nCHICAGO (AP) — Shortly after he was confirmed as President Donald Trump’s transportation secretary, Sean Duffy circulated a memo that instructed his department to prioritize families by, among other things, giving preference to communities with marriage and birth rates higher than the national average when awarding grants.\n\nThe memo also calls for prohibiting governments that get Department of Transportation funds from imposing vaccine and mask mandates, and requiring their cooperation with the administration’s immigration enforcement efforts.\n\nWith hundreds of billions of dollars in transportation money still unspent from the 2021 bipartisan infrastructure law, such changes could be a boon for projects in Republican-majority states, which on average have higher fertility rates than those leaning Democratic.\n\nStates controlled by Democrats were generally more receptive to mask and vaccine rules to combat the COVID-19 pandemic and have been more resistant to Trump’s immigration raids.\n\nMore births for more roads?\n\nAll administrations set their own rules for choosing which transportation projects to prioritize. But some of Duffy’s directives were received as highly unusual.\n\n“Distributing transportation funding based marriage and birth rates is bizarre and a little creepy,” said Kevin DeGood, senior director of infrastructure and housing policy at the left-leaning Center for American Progress. “States and regions with aging populations tend, on average, to have lower birth rates … Are they somehow not deserving of transportation investment?”\n\nAccording to the latest figures from the Centers for Disease Control and Prevention in 2022, the 14 states with the highest fertility rates backed Trump in the November election while the bottom 11 plus the District of Columbia supported Democrat Kamala Harris. Marriage rates tend to skew higher for red states too, but by a smaller margin.\n\nVice President JD Vance has long expressed concern about declining birth rates, citing national economic needs as well as the inherent value of children.\n\nTennessee Republican Sen. Marsha Blackburn raised the idea of tying transportation funding to population growth during Duffy’s confirmation hearing.\n\n“People are leaving some of these blue states and coming to places like Tennessee,” she said. “And this means that we need to look at where those federal highway dollars are spent and placing them in areas with growing needs rather than areas that are losing population.”\n\nSarah Hayford, sociology professor and director of the Institute for Population Research at Ohio State University, said she had never heard of birth rates being used to set funding priorities.\n\n“I was a little surprised,” she said. “Often the policy around birth rates is trying to address challenges or barriers to people not having children. This seems more focused on rewarding people for already having children.”\n\nThe U.S. birth rate has been declining since 2007, which Hayford attributes in part to economic uncertainty during the Great Recession. She said research has tied higher birth rates to areas with lower education.\n\nLongstanding transportation policy already considers where kids live, said Beth Jarosz, senior program director at the nonpartisan and nonprofit Population Reference Bureau.\n\n“If what you’re trying to do is support families, birth rates aren’t necessarily the best way to do that,” she said, pointing out that many growing families move to new communities when they find their homes are too small.\n\nThe Department of Transportation has not responded to questions about the memo.\n\nSo far, lawmakers and advocates are unaware of birth and marriage rates being linked to non-transportation grants.\n\nBlue states push back\n\nBlumenthal said the transportation secretary’s focus on birth and marriage rates was “reminiscent of what you might see in the People’s Republic of China.”\n\n“On its face, it’s social engineering. But clearly and indisputably, it is a dagger aimed at blue states,” he said. “It is patently discriminatory if you look at the numbers. This criteria was designed to punish blue states and coerce states to change their lawful policy on tolls, vaccines and immigration.”\n\nU.S. Rep. Kweisi Mfume, a Maryland Democrat, said he feared Duffy’s directives would harm some grants already announced — including $85 million awarded to Baltimore in the final weeks of the Biden administration to transform a blighted stretch of U.S. 40 known as the “highway to nowhere.”\n\n“If it’s an effort to reward red states, he ought to just go ahead and say that,” Mfume said. “Otherwise, there will be a lot of challenges by states and advocacy organizations all over the country who have no choice but to fight back, and that fight will become a legal one.”\n\nYet Jarosz said the policy’s political intentions are unclear, noting communities like San Diego and Sacramento in California are above the national average in terms of birth rates, while certain rural areas of the country are below.\n\nIs this even legal?\n\nLegal experts say it is too early to know whether anything in Duffy’s memo could be struck down by the courts.\n\nAlthough it is difficult to make a legal argument for funding equality based on political affiliation, federal law does protect against discrimination over such things as race, sex, and disabilities.\n\nJoel Roberson, who handles transportation and infrastructure cases at the Washington, D.C., law firm Holland & Knight, said administrations have widespread authority to set their own criteria for awarding money. However, communities denied funding could file a lawsuit arguing they endured an illegal “disparate impact.”\n\nAs for whether Trump could redirect transportation grants awarded under Biden, Roberson said it largely depends on the status of the project and whether Congress has already appropriated the funding.\n\nState transportation officials have expressed confidence that the new guidelines won’t impact the federal funds states use to set their own transportation priorities and build roads. But many other grants are awarded at the discretion of the administration in power.\n\nLess clear is the status of some already approved discretionary grants, such as an agreement signed just before former President Joe Biden left office committing $1.9 billion toward a nearly $5.7 billion project to add four new L stations in South Side Chicago.\n\nBlumenthal, a former state attorney general and federal prosecutor, said Duffy’s edict created “uncertainty and confusion” and pointed out it doesn’t carry any legal weight like statutes and regulations do. He predicted courts would ultimately reject the policy.\n\n“Anybody can write a memo,” Blumenthal said.\n\nHaigh reported from Hartford, Connecticut.","summary":"Some of Duffy’s directives were received as highly unusual.","url":"https://www.sandiegouniontribune.com/2025/02/07/transportation-grants-directive-birth-rates/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/02/Trump-Transportation_Funding-Explainer_06395.jpg?w=1024&h=682","video":null,"publish_date":"2025-02-08 00:35:25","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.154},{"id":288248296,"title":"Walz's home state joins California in ignoring Trump's executive order to ban transgenders from girls sports","text":"The Minnesota State High School League announced Thursday it will continue to allow transgender athletes to compete against girls despite President Donald Trump's executive order to ban them from doing so. Trump on Wednesday signed the \"No Men in Women's Sports\" executive order, fulfilling one of his major campaign promises of keeping biological men out of girls and women’s sports. The Minnesota organization said in an email to member schools that participation by, and eligibility of, transgender athletes is controlled by the Minnesota Human Rights Act, which includes protections for LGBTQ+ people, and the Minnesota Constitution. SIGN UP FOR TUBI AND STREAM SUPER BOWL LIX FOR FREE \"The Minnesota State High School League, similar to other youth sports organizations, is subject to state anti-discrimination laws, which prohibit discrimination based on gender identity,\" the organization said in a statement. \"Therefore, students in Minnesota are allowed to participate consistent with their gender identity.\" Minnesota joins California in ignoring Trump's executive order. The state is governed by Tim Walz, who was Kamala Harris' running mate for the 2024 election; the Democrats won the state. The state was home to a Supreme Court case where a transgender powerlifter was continuing the fight to compete against biological women. Trump signed the executive order on National Girls and Women in Sports Day, which celebrates female athletes in women’s sports and those committed to providing equal access to sports for all females. HOW TO WATCH SUPER BOWL LIX BETWEEN CHIEFS, EAGLES STREAMED ON TUBI Prior to Trump signing the order Wednesday, White House press secretary Karoline Leavitt said part of the motivation behind Trump's executive order would be to create a \"pressure campaign\" for the International Olympic Committee (IOC) and NCAA to follow and prevent transgender athletes from competing in women's sports. In response to Trump's order, the NCAA changed its policy, in place since 2010, to disallow transgender athletes from competing against women, requiring them to compete based on their birth gender. During Trump's ceremony at the White House to sign the executive order, he announced that Homeland Security Secretary Kristi Noem will prohibit any transgender athletes attempting to compete as women from entering the country for the Olympics in 2028. The United Nations released study findings saying nearly 900 biological females have fallen short of winning medals because they lost to transgender athletes. CLICK HERE TO GET THE FOX NEWS APP The study, \"Violence against women and girls in sports,\" said more than 600 athletes did not medal in more than 400 competitions in 29 different sports, totaling over 890 medals, according to information obtained up to March 30. Fox News' Jackson Thompson and The Associated Press contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Minnesota&apos;s governing body for high school sports says it will continue to allow transgender athletes to compete in prep athletics despite President Trump&apos;s executive order.","url":"https://www.foxnews.com/sports/walzs-home-state-joins-california-ignoring-trumps-executive-order-ban-transgenders-from-girls-sports","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/donald-trump7.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-08 00:12:40","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","category":"politics","source_country":"us","sentiment":-0.227},{"id":288242458,"title":"Donald Trump Is More Popular in New York City Than Eric Adams: Poll","text":"President Donald Trump is more popular than Mayor Eric Adams in New York City, according to a new poll.Newsweek reached out to the White House and Adams' office for comment via email.Why It MattersNew York City has long been a Democratic stronghold, dominating state politics and producing some of the most progressive Democrats in the country. But Trump made inroads with many voters there in last year's presidential race amid concerns of immigration, the economy and public safety.Republicans now face the question of whether those gains will last through future elections, while Democrats will be spending the next few years fighting to win back those voters who shifted rightward in 2024.Adams' low approval rating may have implications for the New York City's mayoral race this year, as the poll suggests he is vulnerable to a primary challenge from other well-known Democrats.What To KnowThe Emerson College poll found that only 27 percent of New York City residents hold a positive view of Adams, who was hit with bribery and wire fraud charges last year, though he has pleaded not guilty to all counts. Fifty-eight percent said they view him unfavorably.About 40 percent of respondents said they hold a favorable view of Trump, while 53 percent said they view the president unfavorably.Trump made substantial gains in New York state last year, losing it by only about 12.6 points to Vice President Kamala Harris. Four years earlier in 2020, President Joe Biden carried the Empire State by 23.2 points.Regarding potential Democratic mayoral primary challengers, the poll found Adams could be in peril, particularly if former New York Governor Andrew Cuomo runs. If Cuomo jumps into the race, he would receive about 32.5 percent support, while only 9.8 percent would back Adams.If Cuomo doesn't run, Adams may be in a stronger position, the poll found. He received more support than other candidates, with state Senator Jessica Ramos and former New York City Comptroller Scott Stringer receiving the next highest number of votes.Cuomo hasn't said he plans to run yet—but other polls have similarly found him with an early lead.What People Are SayingAdams, to Politico: \"People who are running — they're going to have to take claim for the stuff that they did when they were holding office. Who was there for the original bail reform? Who signed some of these procedures? You're going to have to answer these questions.\"Spencer Kimball, executive director of Emerson College Polling, in a news release: \"Mayor Adams leads with Black voters at 23% with 34% undecided, but when former Governor Cuomo is on the ballot, they shift to him 35% to 13% for Adams, and undecideds drop to 24%. Cuomo's high name recognition gives him an early advantage, but the race is fluid with six months to go.\"What Happens NextThe primary is set for June 24 and candidates are expected to spend the next several months making their pitch to voters about why they should lead the country's most populous city.","summary":"A new Emerson College survey showed 4 in 10 New York City residents have a favorable view of Trump.","url":"https://www.newsweek.com/trump-more-popular-eric-adams-new-york-city-2028185","image":"https://d.newsweek.com/en/full/2584070/eric-adams-donald-trump-approval-poll.jpg","video":null,"publish_date":"2025-02-08 00:02:25","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.157},{"id":288243410,"title":"Photos show crew removing USAID signage amid the agency's uncertain future","text":"At 2:30 p.m. on Friday, metal letters spelling \"US Agency for International Development\" clung to the side of 1300 Pennsylvania Avenue NW in Washington, D.C. By 2:56 p.m., they sat in a pile next to the now-bare building.Construction crews spent Friday afternoon removing all signage from the USAID headquarters after President Donald Trump said to \"CLOSE IT DOWN\" in a social media post. Earlier that afternoon, someone taped over the agency's name on a nearby sign and logos on the building's windows.Shortly before 2 p.m., a group of five construction workers were huddled outside the building. Two wore yellow harnesses. All of them had tape over a patch on their jacket. None would comment to Business Insider on who they worked for.Just after 2:30 p.m., a bucket crane hoisted one of the workers into the air and he began to pry the letters off the building before dropping them onto the crane. It eventually became a two-man job, taking around 15 minutes. Once the building was bare, the construction workers ripped open a plastic garbage bag and, fighting with the DC wind, taped it over the building's logo.This comes just days after the Trump administration moved to gut USAID — the government's foreign agency. The proposed cuts mean that the agency could be forced to drastically shrink its workforce from about 10,000 to 294 employees. The agency announced Tuesday that it will put staff on administrative leave beginning on Friday at 11:59 p.m., with exceptions to people with \"exceptional circumstances,\" per Secretary of State Marco Rubio. The American Federation of Government Employees, which represents about 800,000 federal workers, filed a lawsuit on Thursday in an effort to prevent the agency from being dismantled. On Friday, a judge sided with the workers, partially blocking the shutdown. But the agency's future remains uncertain. Both Trump and Elon Musk have previously said USAID is \"wasteful\" and supports liberal causes. Its gutting is the latest example of the Department of Government Efficiency's promise to slash the federal budget and reform the bureaucracy. The Trump administration did not immediately respond to Business Insider's comment request.DOGE's account on X celebrated the changes to the headquarters, posting photos of the now-bare building with the caption, \"Unburdened by what has been,\" a reference to former Vice President Kamala Harris.AT USAID BUILDING, letters coming off one by one. A woman yelled shame a few times; a couple police officers have gathered; the street is mainly quiet, really pic.twitter.com/hd9SvGb0t4USAID administered civilian foreign aid and development assistance around the world, including various food, healthcare, and education initiatives. Data for fiscal year 2024 shows that USAID distributed nearly $32.5 billion in aid that year, much of it to Africa and the Middle East. The proposed operations cuts would likely reduce the most assistance in Ukraine, Jordan, and Ethiopia. Still, the multi-billion aid bill is only about 1% of the federal budget.","summary":"A crew took letters off the  USAID headquarters hours after President Trump called to \"CLOSE IT DOWN.\"","url":"https://www.businessinsider.com/photos-crew-remove-usaid-sign-elon-musk-donald-trump-doge-2025-2","image":"https://i.insider.com/67a673c17bb3f854015c3d63?width=1200&format=jpeg","video":null,"publish_date":"2025-02-08 00:00:00","author":"Alice Tecotzky,Allie Kelly","authors":["Alice Tecotzky","Allie Kelly"],"language":"en","category":"politics","source_country":"us","sentiment":-0.334},{"id":288235166,"title":"Riverside County Sheriff Chad Bianco could announce run for governor on Feb. 17","text":"Speculation is mounting that Riverside County Sheriff Chad Bianco will soon announce plans to run for California governor in 2026.\n\nAccording to a post on the event-planning website Eventbrite, the Republican sheriff will make a “major announcement” Monday, Feb. 17, at a downtown Riverside venue.\n\nRELATED: Riverside County Sheriff Chad Bianco could run for governor in 2026\n\nIt’s not clear what that announcement might be or what connection the post has to Bianco or his supporters. The sheriff and his department’s media representatives did not respond to requests for comment Friday, Feb. 7.\n\nBianco first said in 2024 that he was considering a gubernatorial bid. The office of governor will be an open seat in 2026, with Democratic incumbent Gavin Newsom unable to run for reelection due to term limits.\n\nBianco, who was first elected sheriff in 2018, can continue to lead Riverside County’s top law enforcement agency if he were to run for governor and lose. A 2022 state law that shifts sheriff’s elections to presidential election years tacked on another two years to Bianco’s term, which now ends in 2028.\n\nA number of candidates on the Democratic side have already announced for governor, including former state Senate president Toni Atkins, Lt. Gov. Eleni Kounalakis, State Superintendent of Public Instruction Tony Thurmond, former Los Angeles mayor Antonio Villaraigosa and former state controller Betty Yee.\n\nThere’s also speculation that former Vice President and 2024 Democratic presidential nominee Kamala Harris, a California native, will run. California Attorney General Rob Bonta, a rumored gubernatorial candidate, said this week he’s not entering the race.\n\nA November poll by the Institute of Governmental Studies at UC Berkeley of voters’ preferences for governor found Bianco coming in second behind Democrat and former Orange County congressmember Katie Porter.\n\nHowever, 52% of those polled expressed no clear preference for a particular candidate. And 46% of respondents said they’d be very likely or somewhat likely to support Harris if she ran.\n\nIf Bianco runs, he would represent a staunchly conservative candidate in a Democrat-friendly state that hasn’t elected a Republican to statewide office since 2006.\n\nHe’s also a strong supporter of President Donald Trump, a generally unpopular figure in California. Bianco endorsed Trump in 2024 — “It’s time we put a felon in the White House,” he quipped — and went to the White House in late January to watch Trump sign the Laken Riley Act aimed at cracking down on undocumented immigrants who commit certain crimes.\n\nHe also posted an Instagram video in October of part of a phone conversation he had with Trump. It’s unclear what the president and sheriff talked about.\n\nSince becoming sheriff, Bianco, who made national headlines for defying Newsom’s COVID-19 mandates, has cultivated an image of a straight-talking, tough-on-crime critic of Sacramento’s Democratic establishment.\n\nIn an Instagram video this week, the sheriff said: “We have been infected by liberal judges appointed by a progressive, liberal governor or governors that are destroying our criminal justice system and causing what to all of us is our biggest issue in California and that is rising crime, homelessness, drugs — all of those issues.”\n\n“I’m fed up,” he said. “I’m tired of the lies. I’m tired of the manipulation from our politicians, the lack of accountability of our politicians, the lack of accountability to our judges and then the media blaming it on law enforcement.”\n\nHe added: “You’re going to be seeing these videos from me repeatedly, telling you the truth about public safety, telling you the truth about our failed politicians, telling you the truth about our failed criminal justice system. And this is only the beginning.”\n\nWhile facing an uphill battle should he run for governor, Bianco has a loyal following among California conservatives.\n\nA website, www.biancomerch.com, already is selling “Bianco for governor” hats, T-shirts and other merchandise featuring cartoon images of Bianco in a cowboy hat with an oversized mustache and a bandana around his neck. It’s unclear if the website is connected to Bianco.\n\nJoy Miedecke, president of the East Valley Republican Women Patriots in the Coachella Valley, is enthusiastic about the prospect of a Bianco gubernatorial run.\n\n“If the sheriff decides to run, which I feel that he will, that is exactly what should happen,” she said Friday. “He is a law-and-order sheriff and we need law and order in our state, amongst many other things.”","summary":"A \"major announcement\" in Riverside is promoted online, but the connection to Bianco is unclear.","url":"https://www.ocregister.com/2025/02/07/riverside-county-sheriff-chad-bianco-could-announce-run-for-governor-on-feb-17/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/RPE-L-AGUANGA-0104-21TP.jpg?w=1024&h=678","video":null,"publish_date":"2025-02-07 23:25:20","author":"Jeff Horseman","authors":["Jeff Horseman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.254},{"id":288236550,"title":"The View hosts praise Travis Kelce’s ‘classy’ response to Trump Super Bowl appearance","text":"The View co-hosts Alyssa Farah Griffin and Ana Navarro have praised Travis Kelce for his “classy” response to the news that President Donald Trump may attend this weekend’s Super Bowl.\n\nEarlier this week, the Kansas City Chiefs tight end told reporters that he considered Trump’s appearance to be “a great honor.”\n\n“I think, you know, no matter who the president is, I know I’m excited because it’s the biggest game of my life, you know, and having the president there, you know, it’s the best country in the world. So, that’d be pretty cool,” he said.\n\nKelce was criticized for his comments in some quarters after Trump’s previous disparaging remarks about the athlete’s girlfriend, pop phenomenon Taylor Swift.\n\nHowever the hosts of The View defended Kelce, with political strategist Alyssa Farah Griffin saying: “This Taylor Swift fan is not mad about it. I thought it was totally classy, a diplomatic answer, and it’s his big day.\n\n“Also, and I think I’ll be repeating this a lot in the next four years, the presidency is bigger than any one person. He’s proud that the President of the United States is there. I don’t know that it’s any kind of statement about Donald Trump specifically. \n\n“He’d say the same thing if it was Joe Biden, Obama, George Bush. I thought it was a very classy statement and don’t make it a bigger story. It would’ve totally distracted from the game.”\n\nAna Navarro agreed with Griffin, arguing that if Kelce “had said something against Trump, it would be taken out on his team and all the hate that his team would receive as they’re heading into the Super Bowl.”\n\nKelce, 35, and his Chiefs teammates, including quarterback Patrick Mahomes, will take on the Philadelphia Eagles during Super Bowl LIX at Caesars Superdome in New Orleans.\n\nThe news was first revealed that Trump would be attending the game on Tuesday, making him the first sitting president to watch the Super Bowl in person. His presence comes amid feverish security preparations in the city in the wake of the deadly New Year’s Eve terror attack in which 14 people were killed and several more were injured.\n\nSwift endorsed Trump’s opponent, Democratic candidate Kamala Harris, in the 2024 Presidential Election.\n\nIn a lengthy post on Instagram in September, she said that, having watched the presidential debate between the two of them, Harris “fights for the rights and causes I believe.”\n\nShortly after the Instagram post was shared, Trump spoke on Fox and Friends to say that he was “not a fan of Taylor Swift.”\n\nThe “Karma” singer will also be in attendance at the Super Bowl this year to show her support for Kelce.","summary":"The Kansas City Chiefs tight end said it would be a 'great honor' for the President to attend the Super Bowl","url":"https://www.independent.co.uk/arts-entertainment/tv/news/the-view-kelce-trump-super-bowl-b2694436.html","image":"https://static.independent.co.uk/2025/02/07/22/39/MixCollage-07-Feb-2025-02-14-PM-8985.jpg?trim=0,0,0,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/qOCa3iiF-4VHSaSK0.mp4","publish_date":"2025-02-07 23:08:52","author":"Kevin E G Perry","authors":["Kevin E G Perry"],"language":"en","source_country":"gb","sentiment":-0.036},{"id":288238084,"title":"Experts see ‘hallmarks of government censorship’ in FCC’s latest investigation of radio station","text":"The Trump-appointed chairman of the Federal Communications Commission announced this week that the FCC is investigating San Francisco-based radio station KCBS over its coverage of the administration's mass deportation raids in San Jose, prompting First Amendment experts to express concerns about authoritarian-style censorship. \n\n“This effort to control media content – a foundational trait of dictatorships – contains the hallmarks of government censorship,” Joseph Russomanno, professor emeritus at Arizona State University’s Walter Cronkite School of Journalism, told The Independent.\n\n“This is troubling on many fronts and will have a severe chilling effect on how news organizations do their jobs,” said Roy Gutterman, director of the Newhouse School's Tully Center for Free Speech.\n\nDuring an appearance on Fox & Friends on Thursday morning, FCC chief Brendan Carr took issue with KCBS 740 AM for revealing the live locations and vehicle descriptions of ICE officials who were conducting immigration raids in San Jose on January 26. The station has come under fire from right-wing listeners and conservative media personalities over the segment.\n\n“I try to look on the bright side of things, and here I think that’s the fact, that we were having an unprecedented number of deportations taking place in this country, and for that, thank goodness for President Trump,” Carr stated.\n\n“Promises made, promises kept. He came in and said he’s the person that can not only secure the border, but also deport people here illegally, and he’s carrying that out with unprecedented speed,” he added. \n\n“This is really concerning, so what happened was you had ICE agents undercover doing operations in East San Jose, part of the town known for violent gang activity, and you had this radio station broadcasting the live location, identifying the unmarked vehicles that they were in.”\n\nNotably, Carr’s remarks about East San Jose’s “violent gang activity” echoed that of far-right social media influencer Andy Ngo, who made similar complaints about KCBS’s reporting the same night the segment aired. \n\n“We have sent a letter of inquiry, a formal investigation into that matter, and they have days left to respond to that inquiry and explain how this could possibly be consistent with their public interest obligations,” the FCC chairman concluded. \n\nThe commission’s enforcement bureau, according to Carr, is looking into whether the station violated its FCC license – which states that it must operate in the “public interest” – with the segment.\n\nAn additional wrinkle in this investigation is that KCBS is run by Audacy, an internet and radio company initially developed by CBS Radio. Last year, the company underwent a bankruptcy restructuring plan, and billionaire George Soros’ investment fund became the platform's most significant stockholder.\n\nCarr, then a Republican commission member, criticized the FCC for approving the investment by Soros, a liberal philanthropist who has long been a bogeyman for the right. Carr also said he would review the Audacy reorganization once Donald Trump appointed him chair of the FCC.\n\nKCBS and Audacy declined to comment about the FCC’s investigation.\n\nThis latest probe comes as Carr has gone after other media outlets whom the president has blasted over what he feels is unfair and negative coverage of him over the years. Carr announced just last week that he was launching an investigation into NPR and PBS for potentially violating federal rules on sponsorships and commercials, a charge both organizations have denied.\n\nThe FCC head also recently demanded the full transcript and raw video of CBS News’ October interview with Democratic presidential nominee Kamala Harris, citing a “news distortion” complaint. Trump is suing the broadcast network for $10 billion for airing slightly different versions of Harris’ answer to one question, claiming CBS attempted to interfere in the election by deceptively editing the interview. \n\nWhile the network has denied Trump’s accusations and said the lawsuit is “completely without merit,” Carr has said the allegations of “news distortion” could play a factor in his agency’s review of an upcoming merger involving the channel’s parent company Paramount Global, prompting its executives to pursue a possible settlement with the president.\n\nThe FCC’s bevy of media investigations and reinstated complaints against broadcasters (except for Fox News) has sparked concerns among free press advocates that Carr and the administration are seeking to intimidate and bully adversarial press outlets.\n\n“The FCC's incursion into news operations is unusual and highly suspect,” Gutterman stated. “This reflects the new chairman's interest in pursuing the Administration's regulation and punishment of news organizations.”\n\nHe added: “The FCC, under its new leadership, is venturing into areas that were traditionally outside its purview, whether we're talking about newsrooms or a new definition of what constitutes advertising or how content is being handled online.”\n\nRussomanno also noted that Carr’s actions are “clearly political in nature,” especially given the praise he exhibited in the recent Fox & Friends interview. \n\n“Undoubtedly, this will result in a chilling effect, leading some broadcasters to dilute or eliminate specific reporting,” he warned. “This is precisely what the First Amendment’s freedom of press clause is supposed to prevent.”\n\n“It is also clear that this is a continuation of the president’s perceived mandate to exact retribution on his political enemies,” Russomanno continued. “He and his believers seem to overlook that station licensing is not supposed to hinge on the content produced and shared with the public. This is at the foundation of the First Amendment protection provided to not only media organizations, but also to every citizen.”\n\nHe concluded: “All of this also reflects how the FCC, like other government institutions – i.e., the U.S. Supreme Court – has evolved into an extension of the political process. So many issues such as net neutrality are little more than political footballs, their fate linked to which party occupies the White House.”","summary":"‘This is troubling on many fronts and will have a severe chilling effect on how news organizations do their jobs,’ one press freedom advocate told The Independent.","url":"https://www.independent.co.uk/news/world/americas/us-politics/fcc-radio-investigation-censorship-b2694429.html","image":"https://static.independent.co.uk/2024/11/22/18/SEI230216553-copy.jpg?width=1200","video":null,"publish_date":"2025-02-07 23:03:18","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","category":"politics","source_country":"gb","sentiment":0.005},{"id":288246992,"title":"“IT’S JUST WRONG”: Chris Christie SHREDS NJ Gov. Phil Murphy’s “Unthinkable” Claim of Harboring an Illegal Migrant","text":"Chris Christie, former governor of NJ and 2024 presidential candidate, joined the Guy Benson Show today and discussed the latest embarrassing display by current NJ Governor Phil Murphy. Governor Murphy hinted that he would be harboring an illegal immigrant at his house from ICE, and former Governor Christie reacted to the move, calling it “just wrong.” Christie and Guy also discussed some sports, as Christie’s NY Mets recently acquired MLB superstar Juan Soto. Christie and Guy also discussed their Super Bowl predictions, and you can listen to the full interview below!\n\nListen to the full interview:\n\nListen to the full podcast:\n\nRead the full (automated) transcript below:\n\nGuy Benson: And back with us here on the show is Chris Christie, former Republican presidential candidate and the former governor of my home state, New Jersey, author of the book What Would Reagan Do? Governor, great to have you back on the show. Happy Friday.\n\nChris Christie Happy Friday to you Guy. It’s good to be back.\n\nGuy Benson: Absolutely. Great to have you here. Why do a little politics, a little sports as well. Let’s start with the politics. Phil Murphy, the governor of New Jersey. Now, he he said something very interesting recently, and then his staff had to beat a very hasty retreat. We covered a little bit. There’s a few updates here. Let’s just play for the audience what he said. He was at some interview or symposium and he was bragging about basically harboring an illegal immigrant on his property.\n\nGov. Phil Murphy: Me and wife were talking about I don’t want to get into too much detail, but there’s someone in our broader universe whose immigration status is not yet at the point that they are trying to get it to. And we said, you know what? Let’s have her live at our house above our garage. And good luck to the feds coming in to try to get her.\n\nGuy Benson: Good luck to the feds trying to come in to get her. So kind of like taunting ice there. Once that went public and people started noticing what he said. The backtrack began. You had a representative for the governor of New Jersey saying, well, his words had been, quote, misinterpreted. Apparently they told The New York Post that the governor was just referring to a legal resident in a circle of friends, but, quote, No one’s ever lived in the home under the circumstances described by the governor. So nothing to see here. This never happened. But I mean, he said what he said. What’s going on here? Is the staff lying to cover up the fact that the governor of New Jersey is actually doing what he said he’s doing or was the governor of New Jersey lying to try to kind of beat his chest a little bit and show what a great resister he is of these Ice raids or something?\n\nChris Christie I think you’ve got a place in the context where he was when he said it. To answer your question, he was in front of a very far left group called Blue Wave, which in New Jersey is a far left progressive group. And I think that Phil Murphy sat up there. This is my guess. You know, no one knows for sure, guy. But my guess, knowing Phil Murphy, is that he went up there and got himself very carried away trying to act like he was going to be this progressive protector of folks who are here illegally and a lot of get carried away and not tell the truth. And that’s where he got himself to. And I think that from the conversations I’ve had since then, that the staff was stunned to hear that and he got himself caught. Let’s say exaggerating would be the best, the nicest way to put it. Or the other word that you used. I think that the governor clearly made a huge mistake here and he inflamed the situation that doesn’t need to be inflamed. And he did it to try to curry favor with this progressive group.\n\nGuy Benson: Yeah, score some points there. But in the meantime, he’s like broadcasting the world, hey, we’re harboring. And it was very specific. It wasn’t like, hey, we’re looking after a friend of ours. He said it was a she and that she was living above their garage. Right. That was a very specific action that he that he was bragging about. And then for the staff to turn around and say, she doesn’t exist and actually she’s legal and she’s never lived there, I mean, none of that makes any sense, right? I mean, if she’s legal, you wouldn’t have to harbor her. You wouldn’t have to defy the feds. Like, good luck coming to get her. Why would they be coming to get her if she’s legal and if she’s not living above your garage on your property? Why would you say that?\n\nChris Christie Again, I think that, you know, this is a guy who wanted to make news in this moment and make it look like some progressive hero. And instead, you know, I remember seeing the headline in The New York Post. I’m sure you probably saw it, too. It said full of crap about his comments. And, you know, the Post always comes up with some good headlines. And and I think because, you know, the governor is look you know guy that I had state police at my home for eight years and the idea that anybody would put the New Jersey State police governor in that situation, it’s unthinkable that you put them in this situation of, you know, I coming to the residence to get in. To find someone who you were illegally harboring was an impossible position to put the state police in. They’d have to defer to Ice to let them do their job. But at the same time, potentially putting the governor at risk. So the governor didn’t think this one through at all, in my view. And it’s just wrong. It’s wrong to have done to try to get into the middle of a story. And by the way, I think for my own opinion, being on the wrong side of the story, I mean, the fact is that I think an overwhelming majority of people in this country believe that, you know, if you’re here illegally, that it’s time for you to go home and enter our country through a legal process, not illegally.\n\nGuy Benson: Yeah. I mean, this is the most powerful, highest elected official in one of our 50 states who is at least thinking it was a good look for him to say that. Yeah, we’ve got a friend of ours who’s in the country illegally, and we’re so opposed to law enforcement and we’re so committed to that form of lawlessness that we’re helping prevent her from any repercussions. And in fact, good luck to the feds trying to come get her because she’s under my protection, even if it’s a giant made up thing in order to impress some left wing audience. I think that’s also a reflection of someone’s values and their commitment to the rule of law. When you’re when you’re an elected official at a very high level. And the other thing is and I want to broaden this out to New Jersey politics, because, look, I understand elections come and go. The winning side often feels really empowered and we’re in great shape. We’ll never lose again. And the other side gets really down in the dumps. And so, gosh, the sky is falling. And I don’t want to get caught up in this idea that Republicans are necessarily ascendant in the years to come. They might be. They might not be. But there are some indications that certainly in a place like Pennsylvania, but also in New Jersey, the electorate is not nearly as Democrat heavy as it used to be. Even when you ran and won and had your big reelection when you were governor. Since then, I mean, at the national level, growing up in Jersey, I mean, I the Democrats could count New Jersey’s electoral votes easily in their corner every time by a large margin. And that was always the case. But you go back to what year would it have been at this point, the 2023 or whenever? When Murphy was reelected 21 and was 21, he just barely won in a race that he was considered to be the easy favorite. He’s going to waltzed to reelection then. That got very scary for him on election night. He pulled it out by a couple points. Then a couple of years later, you know, Donald Trump, yes, he lost the state of New Jersey, but it was mid-single digits. And there were parts of that state I mean, Passaic going red was wild. Governor. What are you seeing in New Jersey politics right now?\n\nChris Christie I think that the woke ism that was represented both by the Biden administration and by the Murphy administration, that people in New Jersey are just tired of it. You know, New Jersey is in many ways a real microcosm of the country in this respect. We have very wealthy people here in New Jersey, but we are predominantly a working class state. And I think what you’re seeing by the changes in those election results are that a lot of the working class folks in our state who have, you know, typically reflexively voted Democrat are saying, wait a second, these guys don’t represent our values anymore. I think this is a values thing guy more than it is any particular policy, but it’s a tone and a values position that the Democratic Party across the country, but also in New Jersey have taken that are really turning off middle class, working class voters who say, you know what, They don’t represent my values right now and I’m not going to vote for them. And so, you know, I do think it presents opportunities for the Republican Party as we move into a gubernatorial election year now. It’s always a tough race to win here in New Jersey as a Republican statewide. But if the Democrats continue and if they frequently nominate a candidate who continues to espouse the values that have been, you know, espoused by Biden, Harris and and by Murphy, I think they could find themselves in real trouble in November.\n\nGuy Benson: Yeah, I saw a statistic just a couple days ago. I have it right here. It was the latest voter registration month by month numbers. And the Republicans had gained more than 10,000 registered Republicans in New Jersey. The Democrats had shed 2400 of their registered Democrats. And in isolation, I would look at that and say, okay, good for the Republican. Goodness. You’d rather have that than not. But it’s fool’s gold. It’s Lucy in the football. It’s the Republicans in New Jersey. And look, there’s exceptions at the governor level, as you proved, twice. But it was it was the Murphy close call and then especially a mid single digit Kamala victory only by that margin. Just a few months ago. Then you look at stats like this that’s at least got to be ringing some alarm bells. You would think, right with the party has gotten very comfortable with its power. The Democrats in New Jersey, maybe they shouldn’t be quite so comfortable.\n\nChris Christie Well, look, you know, I think you’re right. And especially in the gubernatorial election, we’ve seen over the course of years that before Phil Murphy, you know, the only two term governors over the 50 years before Phil Murphy were were Christie Whitman, Tom Kean and me, three Republicans. And so, you know, there’s there’s there’s cause in history to think that this kind of thing can happen. And it’s being, I think, now really exacerbated by the values conversation that’s going on. And you see it all over the place. You’re right about the state county now, you know, I want to say county in 2013, but it was very unusual for that to happen and for Donald Trump to win it make it even more unusual. And so those are all kind of canary in the coal mine. And, you know, we’re going to see what the Democrats in New Jersey do. Who do they nominate? What’s that person talking about? And hopefully, you know, from the Republican side, we nominate someone who can clearly articulate that values message in addition to some good policy proposals on taxes and affordability in this state, which could give them a real chance to win.\n\nGuy Benson: Yeah, I mean, one of those winning messages for the Republican, whoever ends up being in the race could be something really, really kooky. Like, I will never harbor an illegal immigrant at my house. Right? That that could be one thing that might appeal to a broad swath of New Jerseyans to draw something of a contrast there. All right, Governor Christie, I want to talk about sports. I want to get this out of the way. We haven’t talked about it publicly yet, so I just want to say it once. Soto is in New York. Matt, your Yankee fan. I look and I said this when the deal happened, I said it was pretty clear he was looking for something that the Yankees weren’t going to give him. I always saw him as a one year hired gun for the Yankees If they could keep him, great. But I didn’t want them to break the bank forever to keep him. But he is an unbelievable talent. As you know, you’re a Mets fan. Like scale of 1 to 10. How excited are you about Soto?\n\nChris Christie 1111 Well, I’m also guy and you may not know this. I’m also a member of the board of directors of the Mets.\n\nGuy Benson: I did know that. Yes. You have that sweet of yours. You have a lot of talent. You’ll be watching as you loom in your suite with the with the abundance of riches on the field.\n\nChris Christie Yes, exactly right. And we’re looking to bloom and go for you Yankee fan. I’ll just say that that will treat this like a divorce and we’ll give you visitation. You know, the Yankees are going to be at Citi Field on 4th of July weekend this year. And Guy, I’m making this public invitation to you right now as one of the divorced parents of Juan Soto, You can come to watch the game with me and visit. Why? I’m not going to let you, you know, take him overnight, but we’ll let you come and visit while we get the fair thing for us to do.\n\nGuy Benson: We wouldn’t even give his family a suite, which is part of the reason why I think he walked. So, I mean, obviously it’s it’s slightly rancorous here, but but mostly okay.\n\nChris Christie I suspect that his family tree will be next to mine because on the other side of me is Francisco Lindor. Sweet. So I hope they’re going to put Soto on the other side so I can enjoy both of our MVP candidates families as I watch the games. And again, if you come this 4th of July weekend, I’m making that invitation to you right now. No, it’s very coming. We’ll be we will we will be more than happy to introduce you to both the indoor and the Soto Fair.\n\nGuy Benson: I mean, look, I’m up to meet anyone. I’m typically out of the tri state area around the fourth. But if that is not the case, I will be there with bells on in my Yankees hat. And it’s a very, very nice invitation for you to extend to a Yankee fan of all people for the Subway Series.\n\nChris Christie Because we care about you.\n\nGuy Benson: Big, big, your well being. That’s that’s always been what’s motivated you. I know that more than anything else. It’s that and also the ability to gloat if you guys win in my presence. One more thing here. Super Bowl weekend coming up. Do you have a pick in the game? Do you have a rooting interest? I suspect you do. I think I think it’s the same as mine for similar reasons, but not quite. Are you are you picking the same team that you’re rooting for? Give us your analysis.\n\nChris Christie Ah, I am. And I’m picking the Chiefs. And I think she’s 27, Eagles 24, because I think if you want to lose money, bet against Patrick Mahomes. I guess you don’t see the guy lose all that much. Yeah, And I think the chiefs, you know, the Eagles are a very good team. You know, I’m a Cowboys fan, so the Eagles are not, you know, in the forefront of my love.\n\nGuy Benson: That’s right.\n\nChris Christie But on the other hand, there are very good team. And I certainly recognize as a football fan that they’re good. But Mahomes, the special and he’s different. He’s this generation’s Tom Brady. He usually finds a way to win.\n\nGuy Benson: I think that’s completely fair. So I have picked the Eagles to win. But I’m rooting for the Chiefs because same deal, NFC East. And just in general, if you’re against Philadelphia Sports, if you’re against the criminal cartel, that is Philadelphia sports fans, you have to root for chiefs in this game, right? That’s to me, it’s just a very clear moral issue. So I’ll be watching along with the rest of the country, including Governor Chris Christie, former governor of New Jersey, board of directors member, as he will hasten to mention for the New York Mets as well. Governor, great to talk to you. Thanks so much for joining us on a Friday night.\n\nChris Christie Always happy to be with you. Have a great weekend.","summary":"Chris Christie, former governor of NJ and 2024 presidential candidate, joined the Guy Benson Show today and discussed the latest embarrassing display by current NJ Governor Phil Murphy. Governor Murphy hinted that he would be harboring an illegal immigrant at his house from ICE, and former Governor Christie reacted to the move, calling it &#8220;just wrong.&#8221; Christie and Guy also discussed some sports, as Christie&#8217;s NY Mets recently acquired MLB superstar Juan Soto. Christie and Guy also discussed their Super Bowl predictions, and you can listen to the full interview below! Listen to the full interview: Listen to the full podcast: Read the full (automated) transcript below: Guy Benson: And back with us here on the show is Chris Christie, former Republican presidential candidate and the former governor of my home state, New Jersey, author of the book What Would Reagan Do? Governor, great to have you back on the show. Happy Friday. Chris Christie Happy Friday to you Guy. It&#8217;s good to be back. ","url":"https://radio.foxnews.com/2025/02/07/chris-christie-phil-murphy/","image":"https://static.foxnews.com/radio.foxnews.com/content/uploads/2025/02/BENSON-WEB-TEMPLATE-1-9.png","video":null,"publish_date":"2025-02-07 23:00:55","author":"Dylan Rolfsen","authors":["Dylan Rolfsen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.001},{"id":288236672,"title":"Trump’s 2025 execution a far cry from the chaos of 2017","text":"The executive orders, approaching 60 at the time of this writing, are coming so quickly and in such contrast to everything that we’ve seen over the previous four years that it’s impossible for Democrats and their allies in the resistance media to keep up. \n\nWe’ve seen executive orders, seemingly on an almost-hourly basis, on all the campaign promises that helped Trump win the popular vote and every swing state. And these positions aren’t unpopular with the public, either. \n\nThere have been multiple executive orders on the border and deportation. Drug cartels have been designated as terrorists. \n\nForeign aid for some of the most ridiculous items imaginable that have nothing to do with advancing U.S. interests abroad — do we really need to fund a transgender opera in Colombia or build electric vehicle charging stations for Vietnam when we can’t even do it here? — have been halted for review. \n\nTrump has rightly suspended the security clearances of those 51 former intelligence officials who declared Hunter Biden’s laptop was the product of Russian disinformation shortly before the 2020 election despite having zero access to said laptop before coming to such a conclusion. \n\nThe president also signed an executive order defining a person’s sex based on (gasp) biology while also signing another preventing sex changes for minors and another banning diversity, equity, and inclusion policies in the military and the Federal Aviation Administration. \n\nAnother ban that’s immensely popular is biological men competing against women in sports. And my favorite, an executive order signed Friday eliminating paper straws. Say hello again to plastic, America! \n\nThese are just a handful of what Trump has accomplished in under three weeks. Even Politico couldn’t help but be in awe: \n\n“Trump might be the oldest president ever to swear the oath, but he’s not slowing down,” reads Thursday’s Politico Playbook. “The pace of executive action has been off the charts. And Trump has made public appearances and taken media questions almost every single day. Each EO signing turns into a press conference; every trip on Air Force One an impromptu gaggle with hacks. Trump has dominated every moment of the news agenda. Joe Biden he is not.” \n\nTrump also will reduce the federal workforce by at least 40,000 after offering incentives to resign to those who don’t feel like showing up for work. He also reportedly plans to keep fewer than 300 staff members at the U.S. Agency for International Development, an agency that once employed approximately 10,000 people. Two-thirds of USAID employees are based outside the United States. \n\nThe USAID plan has particularly ignited the ire of Democratic lawmakers, with many targeting Elon Musk, who heads Trump’s Department of Government Efficiency. And the reactions have been patently unhinged. \n\n“We are gonna be in your face, we are gonna be on your asses, and we are going to make sure you understand what democracy looks like, and this ain’t it,” Rep. Jasmine Crockett (D-TX) screamed at an anti-DOGE rally outside of USAID headquarters. \n\n“Goddammit shut down the city!” Rep. LaMonica McIver (D-NJ) exclaimed. “WE ARE AT WAR!”\n\nDemocrats are allowing emotion and cheesy performance art to guide their resistance to Trump, all while making Musk out to be the next threat to democracy. But here’s two reasons why that’s falling flat.\n\nFirst, the Blue Team repeated this same rhetoric throughout 2024. Trump is a fascist, they claim. He’s an existential threat to democracy and therefore must be stopped (Ryan Routh echoed that sentiment when he tried to assassinate Trump in September, the second such attempt of the year). \n\nBut after Democrats installed then-Vice President Kamala Harris as their nominee without the backing of one voter in July, it’s been hard to take the party seriously as the guardians of democracy. \n\nSecond, Trump was duly elected to serve as the nation’s 47th president. As head of the executive branch, he can listen to whoever he wants to. When Musk makes a recommendation, Trump can choose to accept or reject it, as any executive at any corporation does. This isn’t anything new. \n\nDemocrats are oddly choosing to defend keeping the status quo and trusting the government to spend wisely. But the latest Associated Press poll on the matter of spending, for example, shows that just 16% of the public believe the government isn’t spending enough money, meaning Democrats are siding with the 16% who want it to continue. \n\nThat’s political suicide, especially in this environment of deep distrust in the government. \n\nFor Trump, he correctly sees a mandate to take a sledgehammer to existing norms. Winning the popular vote has only emboldened him, as has the fact that in 2017, when he entered office for the first time, he didn’t know how Washington worked. And more importantly, party loyalty to him was not remotely what it is today. \n\nThere is no John McCain to give a thumbs-down to his effort to repeal and replace Obamacare. There is no Mitch McConnell running the Senate to ensure enough establishment Republicans hinder his agenda. \n\nAs evidenced by his Cabinet nominees, some unconventional and controversial, likely all being confirmed, and virtually no leaks from inside the White House undermining his program, it’s a far cry from eight years ago, when palace intrigue and allegations of Russian collusion dominated the news cycle. \n\n“Over the past eight years I have been tested and challenged more than any president in our 250-year history,” Trump said during his inaugural address on Jan. 20. “And I have learned a lot along the way.”\n\nWhat he’s clearly learned is how to exert power and who he can trust around him to carry those orders through. \n\nTrump is also embracing the Ronald Reagan tone of optimism. With the Gipper, America was “the shining city upon a hill.” Reagan won 44 and 49 states in two presidential races, respectively. \n\nWith Trump, “American Carnage” was the theme at his first inauguration in 2017, which the New York Times predictably called dark and “a notable disconnect from reality.” In 2025, at his second inauguration, he hailed a “Golden Age of America” with a call to fix the “horrible betrayal” bestowed upon the public by Biden and Harris, who were sitting just a few feet behind him. \n\nThe mood in the country is far different this time around, yet Democrats still believe shouting “RESIST!” is the way to go again. \n\nFor example, more than a million people attended women’s marches across the country in 2017 after Trump took office. In 2025, the attendance paled in comparison. In Washington, for instance, more than 500,000 women marched in January 2017. For Trump’s sequel this year, that number dropped to just around 50,000. \n\n“There were 10 to 20 times as many people the first time,” Karen Elkin of Virginia told NPR. “I had like 10 people staying at my house from all over the country. And I have zero people staying at my house this time.”\n\nThe relatively muted protests are partly due to Trump being more popular than at any time before, including his entire first term. One big factor is that he’s on the right side of major issues. \n\nLook at border security as a prime example. In 2017, Pew Research found that 62% of voters opposed a border wall. Today, 64% approve of the wall being completed. The massive shifts can also be found on issues ranging from men competing against women in sports to continued funding of the war in Ukraine. \n\nTrump 2.0, unlike the first act, has a clear, bold, bull-in-the-China-shop plan and an understanding of what needs to be done to achieve it. \n\nAs the great Yogi Berra once famously said, “Life is a learning experience, only if you learn.”","summary":"The breakneck speed of President Donald Trump&#8216;s first 19 days in office is nothing like we&#8217;ve seen out of any president this fast out of the gate.  The executive orders, approaching 60 at the time of this writing, are coming so quickly and in such contrast to everything that we&#8217;ve seen over the previous four [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3314242/trump-2025-execution-far-cry-from-2017-chaos/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/Donald-Trump-spending-freeze-impoundment.webp","video":null,"publish_date":"2025-02-07 23:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","category":"politics","source_country":"US","sentiment":0.109},{"id":288229930,"title":"Trump angling for nine-figure payout from CBS to settle $10B lawsuit over Harris interview: sources","text":"President Trump is angling for a massive payout from CBS – significantly more than what he accepted from ABC and Meta – to settle his $10 billion lawsuit over alleged election interference, The Post has learned. \n\nSources with knowledge of the negotiations told The Post that Trump’s lawyers are poised to ask for as much as nine figures – a sum that would vastly exceed the $16 million recently paid by ABC and the $25 million doled out by Meta in recent weeks.\n\nThe two sides began “very preliminary” discussions last week over the controversial “60 Minutes” interview with Kamala Harris, which Trump has claimed was deceptively edited to boost the Democrat in the presidential race.\n\nTrump’s team has yet to propose a settlement offer to Paramount, a source with knowledge of the negotiations told The Post.\n\nBut a source close to Trump’s legal team said he would not be surprised if the president demanded $100 million — or more.\n\n“Is $100 million or $150 million a possibility? I don’t see why not,” the source said.\n\nThe expected nine-figure opening salvo from Team Trump would be similar to the hard-knuckle negotiating tactics used by his legal team against ABC in its defamation suit after star anchor George Stephanopoulos insisted that Trump was “found liable of rape,” the source added.\n\nThose negotiations involved Donald Trump Jr., according to the insider.\n\nThe president’s oldest son, whose participation in the talks has not previously been reported, had reached a tentative deal for around $15 million but then Trump’s lawyers jacked up the demand to roughly three times that amount, the source said.\n\nThe two sides finally settled on $15 million being donated to Trump’s presidential library and another $1 million in lawyers’ fees.\n\n“I think what happened with ABC proves Trump will be very aggressive,” the source said.\n\nABC declined to comment.\n\nCBS parent Paramount Global and the media giant’s controlling stakeholder Shari Redstone have a lot riding on getting the issue resolved as she looks to finally close the merger with the Larry and David Ellison controlled Skydance Media.\n\nThe $8 billion deal – $2 billion less than what Trump is suing CBS for in a Texas court – was expected to close in the first quarter of the year. The Redstone family is set to walk away with $1.75 billion.\n\nBut the deal faces intense scrutiny from the Federal Communications Commission, which has scheduled a public hearing late next month over “news distortion” allegations against CBS News.\n\nOn Wednesday, Trump-appointed FCC chair Brendan Carr released the unedited transcript and video of Harris’ “60 Minutes” sit-down, which revealed that the venerated news program cut down one of her “word salad” answers about Israel to just 20 words.\n\n“Carr is trying to kick the can down the road so he doesn’t have to make a decision on approving the merger,” a source close to the talks speculated, and will give the parties a chance to settle before the FCC steps in.\n\nRepresentatives for CBS and the FCC declined to comment.\n\nTrump slammed the network in a post on Truth Social after the release of the transcripts.\n\n“This was election changing ‘stuff’, election interference and, quite simply election fraud at a level never seen before. CBS should lose its license,” he wrote.\n\nA lawyer for Trump also claimed “CBS and its parent company Paramount deceived the American people.”\n\n“Real accountability for CBS and Paramount will ensure that the President is compensated for the harm done to him, and will deter the Fake News from further distorting the facts to advance a partisan agenda,” Trump attorney Ed Paltzik told The Post.","summary":"Sources with knowledge of the negotiations told The Post that Trump’s lawyers are poised to ask for as much as nine figures – a sum that would vastly exceed the $16 million recently paid by ABC and the $25 million doled out by Meta in recent weeks.","url":"https://nypost.com/2025/02/07/business/trump-angling-for-nine-figure-payout-from-cbs-to-settle-10b-lawsuit-over-harris-interview-sources/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/u-s-president-donald-trump-97906737.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-07 22:47:05","author":"Josh Kosman","authors":["Josh Kosman"],"language":"en","source_country":"us","sentiment":-0.318},{"id":288233694,"title":"US Consumer Sentiment Hits 7-Month Low After Trump Takes Office","text":"U.S. consumer sentiment has fallen to a seven-month low as inflation persists and President Donald Trump promotes various economic policies, including levying tariffs on key U.S. trading partners, according to preliminary February data from the University of Michigan Surveys of Consumers.Newsweek has reached out to the University of Michigan survey team and the White House for comment via email on Friday.Why It Matters The drop, which occurred across political affiliations, signals that many Americans lack confidence in the economy.Trump, who took office on January 20, campaigned heavily on the economy, vowing to reduce inflation and impose tariffs on some of the country's closest trading partners like Mexico and Canada, citing concerns over drugs, immigration, and trade deficits.Tariffs are taxes on imported goods, typically paid by the importing businesses, which can then pass costs onto consumers through higher prices. The importing business could be any American company that purchases goods from foreign suppliers and brings them into the country for resale, manufacturing, or distribution. Tariffs can be used to protect domestic industries by making foreign goods more expensive and encouraging consumers to buy locally, however they can make products more expensive.What To Know The University of Michigan's consumer sentiment index found Americans' confidence in the economy is slipping on Friday, as the preliminary February index dropped to 67.8, the lowest reading since July when it was 66.4 under then-President Joe Biden. It was 71.1 in January.Ratings of current economic conditions fell among Democrats, independents, and Republicans, indicating widespread pessimism about the economy, according to the survey.The results come as Trump has authorized dozens of executive orders, reversing some, and launching tariffs on close trading partners. A temporary pause has been placed on the tariffs he issued on Mexico and Canada, while a 10 percent tariff remains in effect on China.The tariffs are expected to heighten tensions between the nations and drive-up consumer prices on a range of goods.The survey also measured consumers' inflation expectations for this year, which rose a full percentage point from last month to 4.3 percent from 3.3 percent.Consumer confidence had surged following Trump's electoral victory in November against then-Vice President Kamala Harris. However, since taking office it has declined.What People Are Saying Survey director Joanne Hsu told Reuters in a Friday statement: \"The decrease was pervasive...Furthermore, all five index components deteriorated this month, led by a 12% slide in buying conditions for durables, in part due to a perception that it may be too late to avoid the negative impact of tariff policy.\"Steven Rattner, former adviser to former President Barack Obama, journalist, and investor, wrote in an X post on Friday: \"Consumer sentiment dropped among Republicans for the first time since Trump's election win, as prices and interest rates remain high. Sentiment also continued to decline among Democrats, yielding an overall drop for the second month in a row.\"Matt Stoller, director of research at the American Economic Liberties Project, wrote in an X post, \"Consumer sentiment is worsening and inflation expectations are getting worse even though the CPI [Consumer Price Index] is fine. Why? Interest rates are high. Car payments, credit card payments, student loans, mortgages aren't in the CPI but they exist in reality.\"What Happens Next?The University of Michigan's final reading of consumer sentiment for the month of February will be released in two weeks.Trump's 25 percent tariffs on imports from Canada and Mexico are set to take effect on March 4, following a 30-day pause.","summary":"Following Donald Trump's first few weeks as president, preliminary data shows consumer sentiment has dropped in February.","url":"https://www.newsweek.com/us-consumer-sentiment-hits-7-month-low-after-trump-takes-office-2028151","image":"https://d.newsweek.com/en/full/2584020/donald-trump.jpg","video":null,"publish_date":"2025-02-07 22:37:24","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","source_country":"us","sentiment":-0.152},{"id":288231508,"title":"For Next Year’s Super Bowl 60, How About a Halftime Show Worthy of the Big Game?","text":"Somewhere, the Motown music hitmakers of the 1960s and 1970s, such as the original members of the Four Tops and the Temptations who have passed on, are surely rolling over in their graves at what soul and R&B music has devolved into when an incomprehensible and vulgar mess like rapper Kendrick Lamar’s song “Not Like Us” can win five Grammy Awards, as it did last Sunday night.\n\nAwarding it “Song of the Year” and “Record of the Year” doesn’t speak very highly of the music industry today or of the 13,000 Grammy-voting members of the Recording Academy, either, whose taste appears to be all in their mouths.\n\n“Not Like Us” is sonic entropy that I won’t deign to call music. I haven’t the slightest idea what Lamar is trying to say, because the lyrics are an incoherent, illiterate word salad that would make former Vice President Kamala Harris sound like a rocket scientist by comparison. From what I’ve been able to ascertain online, “Not Like Us” is basically intended as a “diss” aimed at rival rapper Drake.\n\nThe song, if you can call it that, is replete with a flurry of gratuitous F-bombs and N-words. But as bad as that is, Lamar also put out a “gay remix” that is even more obscene, with explicit descriptions of sex acts.\n\nI don’t know how either version could have received any airplay on any terrestrial radio station that valued its FCC-issued broadcast license, and the late Casey Kasem surely would be disheartened by what “Top 40\" pop music has devolved into.\n\nAll that to say, I’m fairly certain the producers and directors of the Super Bowl 59 telecast on Fox on Sunday night will be sure to have one finger poised above the seven-second-delay “bleep” button, unless there’s a sanitized “radio edit” clean version Lamar could perform at the halftime show on Sunday night.\n\nAll of this raises a serious question: What was NFL Commissioner Roger Goodell—or whoever in the league’s C-suites chose Lamar as the big game’s halftime performer—thinking?\n\nThe choice of a foulmouthed rapper for the world’s biggest show should earn the NFL the equivalent of a personal foul deserving of a 15-yard penalty.\n\nWhy not pick a singer or singers who could appeal to a broader audience, one spanning multiple generations of viewers—an audience Forbes magazine estimates will be between 117 million and 120 million—who will gather around 65” plasmas at home or in pubs across the U.S. on Sunday night to watch the once-a-year spectacle that is the Super Bowl?\n\nWhile it’s too late now to call in a suitable replacement off the bench, there’s always next year (as the Washington Commanders and New York Jets are all too familiar with saying).\n\nNext year’s NFL championship game in February 2026 will be Super Bowl 60, and with the 60th being a milestone number, allow me to propose a halftime show worthy of the occasion: A Beatles reunion, of sorts.\n\nBut not just a reunion of the two remaining members of the Fab Four by themselves, however. I would have Paul McCartney and Ringo Starr, both of whom are still recording and performing in concert despite being 82 and 84, respectively, be joined onstage for the 15-minute halftime extravaganza by their musician offspring—James McCartney, the late John Lennon’s sons Julian and Sean Lennon, the late George Harrison’s son Dhani Harrison, and Ringo’s son Zak Starkey.\n\nJames McCartney, 47, is a guitarist and drummer who has worked with his father before and has released albums and EPs of his own. Dhani Harrison, 46, the spitting image of his late father, is a singer-songwriter who has performed at festivals, including Coachella. Julian Lennon, 61, a filmmaker and author as well as a musician, has recorded seven albums, most recently 2022’s “Jude,” a reference to the Beatles’ 1968 hit “Hey Jude,” which was written for and about him. Sean Lennon, 49, Julian’s half brother, has played in a number of groups, including his parents’ Plastic Ono Band and released two solo albums. Like his father a drummer, Starkey, 59, has toured with Ringo’s All-Starr Band and has performed and recorded with The Who since 1996.\n\nFor Paul McCartney, it would be a triumphant three-peat at the Super Bowl: On Feb. 3, 2002, at Super Bowl 36, he performed a pregame song dedicated to the memory of the victims of 9/11 at the Superdome in New Orleans, where this year’s Kansas City Chiefs-Philadelphia Eagles contest will be played on Sunday. Three years later, on Feb. 6, 2005, at Alltel (now EverBank) Stadium in Jacksonville, Florida, he performed a four-song set of “Drive My Car,” “Get Back,” “Live and Let Die,” and “Hey Jude.”\n\nEx-Beatle Paul McCartney performs during the Super Bowl XXXIX halftime show at Alltel (now EverBank) Stadium on Feb. 6, 2005, in Jacksonville, Florida. (Harry How/Getty Images)\n\nIf a Beatles family reunion weren’t enough starpower for the ages and worthy of the Super Bowl stage, the NFL could up the ante by also inviting the Beatles’ pre-Ringo drummer, Pete Best—who got the boot in 1962, but still performs occasionally as the Pete Best Band—to join them for a fence-mending reunion some 64 years later. (“When I’m 64,” anyone?)\n\nIf the NFL really wanted to go all in and go for the extra point, it could also invite McCartney and Starr’s fellow British Invaders Mick Jagger, Keith Richards, and Ronnie Wood of the Rolling Stones.\n\nIf the NFL already has performers booked for the 2026 halftime show, it should punt and reschedule them for 2027. After all, McCartney and Starr may be musical immortals, but they won’t live forever.","summary":"Somewhere, the Motown music hitmakers of the 1960s and 1970s, such as the original members of the Four Tops and the Temptations who have passed... Read More\n\n\nThe post For Next Year’s Super Bowl 60, How About a Halftime Show Worthy of the Big Game? appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/07/super-bowl-lx-how-about-a-halftime-show-for-the-ages/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/20250207_MaccaSuperBowl2-scaled.jpg","video":null,"publish_date":"2025-02-07 22:29:59","author":"Its Investment,Peter Parisi","authors":["Its Investment","Peter Parisi"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.037},{"id":288229282,"title":"Trump discloses the next big goal for DOGE cryptocurrency","text":"President Donald Trump revealed Friday he is so pleased with the work of the Department of Government Efficiency (DOGE) that he is asking Elon Musk to investigate all other agencies for waste and fraud. \n\n‘I’ve instructed him to go check out Education, to check out the Pentagon, which is the military. And sadly you’ll find some things that are pretty bad,’ Trump said during a press conference at the White House on Friday.\n\nHe added: ‘Pentagon, Education, just about everything. We’re going to go through everything.’\n\nThe Pentagon has failed seven audits in a row, as it has been unable to account for billions in public spending. \n\nTrump has also endorsed the idea of shutting down the Department of Education. \n\nThe Musk-led effort to root out government waste has stricken fear into government employees and angered Democrats for its draconian cuts to federal funding programs. \n\nTrump also backed Vice President JD Vance’s call for the government to bring back DOGE employee Marko Elez, a 25-year-old software engineer, who resigned after controversial racial posts on social media resurfaced.\n\n‘I’m with the vice president,’ Trump said, after Vance confirmed that he had endorsed the idea. \n\nVance voiced his support for Elez on social media on Friday afternoon.\n\n‘Here’s my view: I obviously disagree with some of Elez’s posts, but I don’t think stupid social media activity should ruin a kid’s life,’ he wrote. \n\nVance indicated that Elez was the victim of an effort to smear Musk’s effort to cut government waste. \n\n‘We shouldn’t reward journalists who try to destroy people. Ever. So I say bring him back. If he’s a bad dude or a terrible member of the team, fire him for that,’ he wrote. \n\nTrump was also asked Friday to react to a TIME magazine cover that featured Musk behind the president’s desk, suggesting he was taking over the top job.\n\n‘Elon is doing a great job. He’s finding tremendous fraud and corruption and waste,’ Trump replied, pointing to the work the billionaire has done collapsing USAID. ‘He’s got a staff that’s fantastic. He’s wanted to do this for a long time.’ \n\nTrump was also asked about Musk’s declaration on Friday that he loved the president ‘as much as a straight man can love another man.’ \n\n‘What does the First Lady think about that?’ asked Fox News reporter Peter Doocy.\n\n‘Oh, I think she’ll be okay with it somehow,’ Trump replied. \n\nMusk’s Department of Government efficiency ordered the USAID relief agency to be shut down by Friday. \n\nFederal workers were spotted Friday afternoon removing the letters of the agency building where protesters gathered earlier in the week. \n\nThe DOGE social media account celebrated the event, sharing images of the building with the letters removed.\n\n‘Unburdened by what has been,’ the message read, a reference to a favorite saying of former Democratic presidential nominee Kamala Harris.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump revealed Friday he is so pleased with the work&#8230;\n\n\nThis Post: Trump discloses the next big goal for DOGE cryptocurrency first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-discloses-the-next-big-goal-for-doge-cryptocurrency/","image":"https://i.dailymail.co.uk/1s/2025/02/07/20/94985533-0-image-a-23_1738961474432.jpg","video":null,"publish_date":"2025-02-07 22:15:46","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.155},{"id":288227704,"title":"Federal judge shields 2,200 USAID employees from being put on leave","text":"U.S. District Judge Carl Nichols, an appointee of President Donald Trump, said he would enter a “very limited” restraining order in response to a lawsuit filed by the American Federation of Government Employees and the American Foreign Service Association, which argued that the administration’s actions violated federal law and threatened global humanitarian efforts. Nichols said he will decide later tonight as to whether an additional 500 agency staff already on leave would remain there or be reinstated.\n\nThe ruling temporarily halts the forced leave and relocations of the USAID personnel who were part of the suit, but it does not fully block Trump’s executive order pausing U.S. foreign aid or the administration’s plans to restructure the agency.\n\nWhile Nichols’s order provides temporary relief for thousands of employees, the decision leaves intact much of the administration’s plan, which aimed to downsize dramatically the federal agency that previously staffed over 10,000 personnel.\n\nThe USAID building’s signage was entirely removed on Friday, a stark symbol of the administration’s sweeping changes. \n\nUnburdened by what has been. pic.twitter.com/NK2bcK3hlH— Department of Government Efficiency (@DOGE) February 7, 2025\n\nThe X account for the Department of Government Efficiency, led by billionaire Elon Musk, posted photos of the stripped-down building with the caption “Unburdened by what has been.” The apparent reference to former Vice President Kamala Harris’s quote, paired with the rapid dismantling of agency branding, sent a clear signal that the administration’s overhaul is moving forward despite legal challenges.\n\nThe restructuring has already led to the suspension of USAID projects worldwide, disruptions in agency computer systems, and mass layoffs. In an earlier notice to employees, USAID said it planned to retain only 611 essential workers out of its 10,000-person global workforce.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nAt one point during the afternoon hearing, Nichols asked whether Secretary of State Marco Rubio, as acting USAID administrator, has authority to immediately recall workers. Lawyers with the Department of Justice told the judge they believe that the secretary has “broad authority” over foreign affairs as well as diplomats and foreign service officers.\n\nThe DOJ is likely to appeal to achieve a broader win in court, while unions have vowed to continue launching legal challenges. Congressional Democrats are calling for emergency hearings, warning that the restructuring could have far-reaching consequences for U.S. foreign policy.","summary":"A federal judge on Friday issued a limited order shielding 2,200 U.S. Agency for International Development employees from being placed on leave or abruptly relocated but stopped short of blocking the Trump administration’s broader overhaul of the agency. U.S. District Judge Carl Nichols, an appointee of President Donald Trump, said he would enter a “very limited” restraining order in [&#8230;]","url":"https://www.washingtonexaminer.com/news/justice/3314571/federal-judge-shields-2200-usaid-employees-leave/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/020325_USAID_PROTEST-5.webp","video":null,"publish_date":"2025-02-07 22:15:20","author":"Kaelan Deese","authors":["Kaelan Deese"],"language":"en","category":"politics","source_country":"US","sentiment":-0.438},{"id":288223630,"title":"Sport And Politics Entwine As Trump Makes Historic Super Bowl Visit","text":"Donald Trump will make history on Sunday when he becomes the first sitting US President to attend the Super Bowl, writing a new chapter in an often-strained relationship with the NFL that has been marked by decades of animosity.A keen sports fan, Trump's links to America's most popular sport stretch back to the early 1980s, when he first sought to join the exclusive club of NFL team owners by attempting to purchase the Baltimore Colts.Thwarted on that occasion, he went on to buy a team in the United States Football League (USFL), set up as a spring-summer alternative to the autumn-winter NFL. Trump was subsequently the driving force behind an acrimonious lawsuit filed by the USFL which accused the NFL of operating a monopoly, with the goal of forcing a USFL-NFL merger.Although a jury found in favor of Trump's USFL, the league was awarded only $3 in damages, effectively leading to the league's decision to close in 1986 amid multi-million dollar losses.Trump's first presidential term, meanwhile, witnessed a series of running battles against the NFL and its players, most notably following Colin Kaepernick's decision to kneel during the playing of the US national anthem in protest at racial injustice.\"Wouldn't you love to see one of these NFL owners, when somebody disrespects our flag, to say, 'Get that son of a bitch off the field right now. He's fired!'\" Trump roared at a September 2017 rally in Alabama.That led to a wave of player protests across the NFL, with more than 200 players kneeling during the national anthem in solidarity with Kaepernick and in defiance of Trump's rhetoric.\"Divisive comments like these demonstrate an unfortunate lack of respect for the NFL, our great game and all of our players,\" NFL commissioner Roger Goodell said in response to Trump's remarks.Several teams from the NFL and other sports opted to skip the traditional White House reception offered to championship-winning teams in a snub to Trump. The Philadelphia Eagles, Super Bowl winners in the 2017-2018 season, were disinvited by the White House after several players said they would not attend. Yet just like the expansion of his electoral base during the presidential campaign, Trump has gradually found a foothold in sport over the past year.On Monday he welcomed the Florida Panthers ice hockey team to the White House in recognition of their National Hockey League championship victory last season.A day later, the White House confirmed that Trump would become the first US president to attend the Super Bowl in person, joining around 74,000 other fans at Sunday's showpiece between the Kansas City Chiefs and Philadelphia Eagles.Amy Bass, a professor of sports studies at Manhattanville University in New York, says Trump's decision to attend the Super Bowl is \"political.\"\"Even if he is going because he loves football ... it is a political move because he is the president of the United States and everything he does is political,\" Bass told AFP.Some have interpreted the NFL's decision to remove the words \"End Racism\" from the end zone at this weekend's Super Bowl as a concession to the \"anti-woke\" stance of the new Trump administration.However NFL chief Goodell insisted on Monday that the league remained firmly committed to diversity programs, despite the Trump administration's calls for similar initiatives in government and elsewhere to be scrapped.\"We got into diversity efforts because we felt it was the right thing for the National Football League ... we've proven to ourselves that it does make the NFL better,\" Goodell said.Players at Sunday's Super Bowl have reacted positively to Trump's attendance, with Chiefs tight end Travis Kelce calling it a \"great honor.\"That could potentially lead to some awkwardness between Kelce and his pop icon girlfriend, Taylor Swift. Swift endorsed Trump's election rival Kamala Harris last year, prompting Trump to write on social media_ \"I hate Taylor Swift.\"The Super Bowl's high-profile halftime concert on Sunday could also be an opportunity for anti-Trump sentiment, with rapper Kendrick Lamar, who has been critical of the president in the past, headlining the show. Bass wonders how fans at the Superdome might respond on Sunday, given the Eagles' recent history with Trump following the 2018 row.\"Here's the thing about using a stadium or a ball park as a political arena: you have absolutely no idea what the crowd is going to do, because you, the politician, are not why anyone is there,\" Bass said.\"You'd be hard pressed to find a city that hates Donald Trump more than Philadelphia, so....might they be disrespectful? Yes. And that's a shame. Because the office of the president deserves respect.\"But Donald Trump changed the rules on respect, so all's fair.\"","summary":"Donald Trump will make history on Sunday when he becomes the first sitting US President to attend the Super Bowl, writing a new chapter in an often-strained relationship with the NFL that has been marked by decades of animosity.","url":"https://www.ibtimes.com.au/sport-politics-entwine-trump-makes-historic-super-bowl-visit-1856004","image":"https://d.ibtimes.com.au/en/full/1873371/members-new-york-giants-kneel-during-us-national-anthem-2020-form-protest-slammed-donald.jpg","video":null,"publish_date":"2025-02-07 22:00:24","author":"Thomas Urbain","authors":["Thomas Urbain"],"language":"en","category":"politics","source_country":"au","sentiment":0.291},{"id":288226256,"title":"Sport And Politics Entwine As Trump Makes Historic Super Bowl Visit","text":"Donald Trump will make history on Sunday when he becomes the first sitting US President to attend the Super Bowl, writing a new chapter in an often-strained relationship with the NFL that has been marked by decades of animosity.A keen sports fan, Trump's links to America's most popular sport stretch back to the early 1980s, when he first sought to join the exclusive club of NFL team owners by attempting to purchase the Baltimore Colts.Thwarted on that occasion, he went on to buy a team in the United States Football League (USFL), set up as a spring-summer alternative to the autumn-winter NFL. Trump was subsequently the driving force behind an acrimonious lawsuit filed by the USFL which accused the NFL of operating a monopoly, with the goal of forcing a USFL-NFL merger.Although a jury found in favor of Trump's USFL, the league was awarded only $3 in damages, effectively leading to the league's decision to close in 1986 amid multi-million dollar losses.Trump's first presidential term, meanwhile, witnessed a series of running battles against the NFL and its players, most notably following Colin Kaepernick's decision to kneel during the playing of the US national anthem in protest at racial injustice.\"Wouldn't you love to see one of these NFL owners, when somebody disrespects our flag, to say, 'Get that son of a bitch off the field right now. He's fired!'\" Trump roared at a September 2017 rally in Alabama.That led to a wave of player protests across the NFL, with more than 200 players kneeling during the national anthem in solidarity with Kaepernick and in defiance of Trump's rhetoric.\"Divisive comments like these demonstrate an unfortunate lack of respect for the NFL, our great game and all of our players,\" NFL commissioner Roger Goodell said in response to Trump's remarks.Several teams from the NFL and other sports opted to skip the traditional White House reception offered to championship-winning teams in a snub to Trump. The Philadelphia Eagles, Super Bowl winners in the 2017-2018 season, were disinvited by the White House after several players said they would not attend. Yet just like the expansion of his electoral base during the presidential campaign, Trump has gradually found a foothold in sport over the past year.On Monday he welcomed the Florida Panthers ice hockey team to the White House in recognition of their National Hockey League championship victory last season.A day later, the White House confirmed that Trump would become the first US president to attend the Super Bowl in person, joining around 74,000 other fans at Sunday's showpiece between the Kansas City Chiefs and Philadelphia Eagles.Amy Bass, a professor of sports studies at Manhattanville University in New York, says Trump's decision to attend the Super Bowl is \"political.\"\"Even if he is going because he loves football ... it is a political move because he is the president of the United States and everything he does is political,\" Bass told AFP.Some have interpreted the NFL's decision to remove the words \"End Racism\" from the end zone at this weekend's Super Bowl as a concession to the \"anti-woke\" stance of the new Trump administration.However NFL chief Goodell insisted on Monday that the league remained firmly committed to diversity programs, despite the Trump administration's calls for similar initiatives in government and elsewhere to be scrapped.\"We got into diversity efforts because we felt it was the right thing for the National Football League ... we've proven to ourselves that it does make the NFL better,\" Goodell said.Players at Sunday's Super Bowl have reacted positively to Trump's attendance, with Chiefs tight end Travis Kelce calling it a \"great honor.\"That could potentially lead to some awkwardness between Kelce and his pop icon girlfriend, Taylor Swift. Swift endorsed Trump's election rival Kamala Harris last year, prompting Trump to write on social media_ \"I hate Taylor Swift.\"The Super Bowl's high-profile halftime concert on Sunday could also be an opportunity for anti-Trump sentiment, with rapper Kendrick Lamar, who has been critical of the president in the past, headlining the show. Bass wonders how fans at the Superdome might respond on Sunday, given the Eagles' recent history with Trump following the 2018 row.\"Here's the thing about using a stadium or a ball park as a political arena: you have absolutely no idea what the crowd is going to do, because you, the politician, are not why anyone is there,\" Bass said.\"You'd be hard pressed to find a city that hates Donald Trump more than Philadelphia, so....might they be disrespectful? Yes. And that's a shame. Because the office of the president deserves respect.\"But Donald Trump changed the rules on respect, so all's fair.\"","summary":"Donald Trump will make history on Sunday when he becomes the first sitting US President to attend the Super Bowl, writing a new chapter in an often-strained relationship with the NFL that has been marked by decades of animosity.","url":"https://www.ibtimes.com/sport-politics-entwine-trump-makes-historic-super-bowl-visit-3762880","image":"https://d.ibtimes.com/en/full/4581301/members-new-york-giants-kneel-during-us-national-anthem-2020-form-protest-slammed-donald.jpg","video":null,"publish_date":"2025-02-07 22:00:18","author":"Thomas Urbain","authors":["Thomas Urbain"],"language":"en","category":"politics","source_country":"US","sentiment":0.291},{"id":288224652,"title":"Protip: Before sending out a school newsletter, make sure it does not contain any racial slurs [Fail]","text":"Skip to content\n\nTry Ads-Free Fark\n\nIt's Not News, It's Fark\n\nHow To FarkLog In | Sign Up »\n\nForgot password?\n\n Turn on javascript (or enable it for Fark) for a better user experience.\n\nIf you can read this, either the style sheet didn't load or you have an older browser that doesn't support \nstyle sheets. Try clearing your browser cache and refreshing the page.\n\n Discussion\n\n Entertainment\n\n Protip: Before sending out a school newsletter, make sure it does not contain any racial slurs (click2houston.com)\n\n More: Fail, Family, Comfort, Parent, Montessori school, Email, Publication, Foster care, Causality\n\n542 clicks;posted toMain »on 07 Feb 2025 at4:52 PM(30 minutes ago) | Favorite | Watch | share: Copy Link\n\n 24 Comments \n\nEnable JavaScript for Fark in order to vote for entries.\n\nLog in (at the top of the page) to enable voting.\n\nView Voting Results:SmartestandFunniest\n\nvudukungfu \n\n(6) Funniest\n\n46 minutes ago\n\n(5) Funniest\n\nless than a minute ago\n\nI doubt it was an accident.\n\nDarkSoulNoHope \n\n(7) Funniest\n\nless than a minute ago\n\nBut making sure it doesn't have any racial slurs before publishing it is DEI, and that's now illegal!\n\nA Man A Plan A Chicken \n\n(8) Funniest\n\nless than a minute ago\n\nTrump quickly penning an executive order to make it required that all school newsletters contain at least one racial slur.\n\n(2) Funniest\n\nless than a minute ago\n\nSlur aside:\n\n\"The idea that I'm supposed to send my child to this school again with someone who has this type of language on their hearts and in their minds ... I can't do that.\"\n\nFFS, racism, language and slurs are all around you in today's America. This past election proved it. The supermarket, church, schools, dollar stores, mcdonalds, etc. Might as well just keep your kid at home until the kid decides to kill you from being sheltered so much.\n\nIvo Shandor \n\n(4) Funniest\n\nless than a minute ago\n\nUpdated guidance from Washington - school newsletters must now contain a minimum of two slurs per page.\n\nsome_beer_drinker \n\n(1) Funniest\n\nless than a minute ago\n\ni thought was ok these days?\n\n(7) Funniest\n\nWhen I lived in Alabama, people would use the N word all the time... if they knew you. If they didn't know you, they were on their best behavior ace get indignant if you even assumed they would stoop so low..\n\nThe south is full of racist. They just hide in hypocrisy.\n\n(0) Funniest\n\nless than a minute ago\n\nNo one is going to agree. But. Maybe we should encourage people to admit how they feel?\nAnd maybe ask them why they let a list of bad occurrences to be justification for thinking all members of group Y are not necessary representative of that group! But most importantly we need to understand that the person or persons that hurt them didn't do that because of their parents. But because they individually decided to do awful shiat.\n\n(0) Funniest\n\nless than a minute ago\n\nDarkSoulNoHope: But making sure it doesn't have any racial slurs before publishing it is DEI, and that's now illegal!\n\nThis is awful. But. Correct. And probably needs to happen in combination with actual consequences.\nRacism continues to exist because it has no consequences.\n\nfreakdiablo \n\n(0) Funniest\n\nless than a minute ago\n\nA Man A Plan A Chicken: Trump quickly penning an executive order to make it required that all school newsletters contain at least one racial slur.\n\nIs Oompa Loop a slur? Because that's one I'm ok with.\n\n(0) Funniest\n\nless than a minute ago\n\nA Man A Plan A Chicken: Trump quickly penning an executive order to make it required that all school newsletters contain at least one racial slur.\n\nAt this point, we should all agree, that would be redundant.\n\n(3) Funniest\n\nless than a minute ago\n\nmcsiegs: Slur aside:\n\n\"The idea that I'm supposed to send my child to this school again with someone who has this type of language on their hearts and in their minds ... I can't do that.\"\n\nFFS, racism, language and slurs are all around you in today's America. This past election proved it. The supermarket, church, schools, dollar stores, mcdonalds, etc. Might as well just keep your kid at home until the kid decides to kill you from being sheltered so much.\n\nWhy are you mad at a parent who is concerned about their child attending a school that freely distributes horribly racist and misogynistic statements? FFS, the parent is 100% correct to be concerned their child is being schooled by nazi farkwads\n\nBilly Liar \n\n(0) Funniest\n\nless than a minute ago\n\nWait, any slurs?\nOr any more than usual?\n\nmongbiohazard \n\n(4) Funniest\n\nless than a minute ago\n\npaulleah: When I lived in Alabama, people would use the N word all the time... if they knew you. If they didn't know you, they were on their best behavior ace get indignant if you even assumed they would stoop so low..\n\nThe south is full of racist. They just hide in hypocrisy.\n\nWhen I lived in Marion County FL the racism was farking endemic. It was everywhere, and yeah, most folks would keep it quiet until they got to know you (most, not all).\n\nMy - up until that point - favorite boss was taking a smoke break with me one night, before we headed back in to finish wrapping things up. She was a fiery little lady, and I like that, and had a whole southern bell accent thing going on when she turned to me and said - apropos of nothing by the way - \"I just wish there weren't all those laws which make me hire (n-words)\". She'd gotten comfortable with me, and I look like a white dude, so I guess she figured it'd be OK. I told her, \"Up until you said that I really respected you before. I'm going to go inside and pretend I didn't hear it, but I did, and I'll remember it.\"\n\nWhen I got a tan I'd get pulled over by the cops, and then when I opened my mouth and they took a good look at me up close and realized I wasn't a hispanic guy like they'd thought their demeanor would change and I'd be free to go on my way. Racism in the south is seeped into the pores of the society.\n\nMr.Tangent \n\n(0) Funniest\n\nless than a minute ago\n\nFun with LLM's without proof reading?\n\nDevolving_Spud \n\n(1) Funniest\n\nless than a minute ago\n\n\"Sometimes just spending that quality academic time with your child one on one in the comfort of your home can be equal to if not greater than the academic authorization of a real n**** b****,\" the paragraph read, when discussing reading with your child at home.\n\nWTF does that sentence even mean?\n\n(0) Funniest\n\nless than a minute ago\n\nWhat the actual fark?\n\nI was expecting something with a double meaning that's still unacceptable but at least could be found in idiom. This would make hip hop artists blush.\n\nCokezeroinacan \n\n(0) Funniest\n\nless than a minute ago\n\nAnd the writer just got hired by DOGE.\n\nmongbiohazard \n\n(1) Funniest\n\nless than a minute ago\n\nDevolving_Spud: \"Sometimes just spending that quality academic time with your child one on one in the comfort of your home can be equal to if not greater than the academic authorization of a real n**** b****,\" the paragraph read, when discussing reading with your child at home.\n\nWTF does that sentence even mean?\n\nIt means the author is a racist piece of shiat and you should find another school for your kids if you can. Being that it was a Montessori school the parents probably have the means to enroll their kids in another school.\n\n(0) Funniest\n\nless than a minute ago\n\nDepending on the school, that is.\n\nhammettman \n\n(0) Funniest\n\nless than a minute ago\n\nDevolving_Spud: \"Sometimes just spending that quality academic time with your child one on one in the comfort of your home can be equal to if not greater than the academic authorization of a real n**** b****,\" the paragraph read, when discussing reading with your child at home.\n\nWTF does that sentence even mean?\n\nn**** b****, please.\n\nDarth_Lukecash \n\n(0) Funniest\n\nless than a minute ago\n\nDevolving_Spud: \"Sometimes just spending that quality academic time with your child one on one in the comfort of your home can be equal to if not greater than the academic authorization of a real n**** b****,\" the paragraph read, when discussing reading with your child at home.\n\nWTF does that sentence even mean?\n\nThat's what I'm trying to wrap my head around. Obviously, a Black woman was an educational leader with high standards was in the area. Perhaps Kamala Harris?\n\nEither way, there is no way that spell check didn't find this or it auto corrected from something innocent. This person uses slurs so much, the computer just shrugged its shoulders.\n\n(0) Funniest\n\nless than a minute ago\n\nDevolving_Spud: \"Sometimes just spending that quality academic time with your child one on one in the comfort of your home can be equal to if not greater than the academic authorization of a real n**** b****,\" the paragraph read, when discussing reading with your child at home.\n\nWTF does that sentence even mean?\n\nI'm pretty sure what b**** is, but I'm also worried that n**** isn't actually missing a letter and I might be a worse person than I thought.\n\nDisplayed 24 of 24 comments\n\nEnable JavaScript for Fark in order to vote for entries.\n\nLog in (at the top of the page) to enable voting.\n\nView Voting Results:SmartestandFunniest\n\nRedisplay/refresh comments\n\nIf you're having problems voting, quoting, or posting comments, try disabling any browser add-ons that might disable Javascript (NoScript, AdBlock, etc).See our FAQ.\n\n Forgot password?\n\nCreate an account to make comments\n\nRemember me\n\nIf you can see this, something's wrong with your browser's CSS support. (Or you're a spambot.)\n\nIf you are using the NoScript browser extension, you may have problems posting comments,\nespecially if they contain images.For a fix, see\nthis FAQ entry.If you still have problems, contact Farkback.\n\nBefore adding a comment, please take a minute to review our posting rules and our legal/privacy policy.\nBy commenting, you agree to these terms.\nYou might also want to take a look at our FAQ.\n\nIf you like these links, you'll love\n\nCome check out what's behind the curtain.\n\nlearn more | sign up\n\nSupport Fark\n\nSign up for the Fark NotNewsletter!\n\nHeadlines of the Month\n\nFark NotNewsletter\n\nTotalFark signup\nBareFark signup\nPurchase FarkUnits\n\nPurchase OhFark\n\nTop Comments\n\nTop Submitters\n\nTop Smart Comments\n\nTop Sources/Topics\n\nTop Funny Comments\n\nPress/Publicity\n\nLink Voting\n\nSports Forum\n\nFandom Forum\n\nEntertainment Forum\n\nPolitics Forum\n\nFark Parties\n\nFark Party Forum\n\nPS/Photo Browser\n\nPhotoshop Forum\n\nFarktography Forum\n\nDiscussion/TF Live Forum\n\nTop Commented\n\nTop Commented ▼\n\nTop Commented\n\nTop Clicked\n\nMy Recent Commented\n\nRecent Mentions\n\nJavascript is required to view headlines in widget.\n\nLinks are submitted by members of the Fark community.\n\nWhen community members submit a link, they also write a custom headline for the story.\n\nOther Farkers comment on the links. This is the number of comments. Click here to read them.\n\nYou need to create an account to submit links or post comments.\n\nClick here to submit a link.\n\nAlso on Fark\n\nPlane crashes into bus while trying to make emergency landing, Brazilians killed ( dailyrecord.co.uk ) » (3 comments)\n\nIn other news, the Count is doing weather reports on CNN now ( us.cnn.com ) » (13 comments)\n\nCurling tournament has been going on for over 100 years. That's a long tournament ( cbc.ca ) » (2 comments)\n\nCompany tapped to build hydrogen-powered buses for London collapses, surprising those who had expected it to explode ( businesscloud.co.uk ) » (0 comments)\n\n'Cursed' skeletons unearthed with tablets between their legs in ancient burial site. Surprisingly some of the batteries were still charged ( dailymail.co.uk ) » (1 comment)\n\nEntertainment\n\nWill the Simpsons ever end, or will AI keep them going forever and ever and ever? ( gizmodo.com ) » (18 comments)\n\nGame reviewer who awarded Starfield a 10/10 score when it was released worries that Elder Scrolls VI won't live up to the hype ( gamingbible.com ) » (19 comments)\n\nWe firmly believe that all kittens are adorable and deserving of love, but those found wandering outside tug at our heartstrings even more - especially when we encounter them via the cat distribution system ( yahoo.com ) » (1 comment)\n\nCracker Barrel adopting TicketMaster egg surcharging ( msn.com ) » (8 comments)\n\nHow deep is this state? ( politico.com ) » (12 comments)\n\nFark :: Main | Discussion | Sports | Business | STEM | Entertainment | Fandom | D'awww | Food | Politics\n\nTotal Fark :: TotalFark | TF Live | TF Advice | TF Discussion | Commented | Top Voted | Greenlit\n\nFArQ :: About Us | Quick Answers | Posting Rules | Farkisms\n\nContests :: Photoshop | Farktography | Caption\n\nBuy Fark :: Fark Book | Fark Store\n\nSubmit a Link »\n\nCopyright © 1999 - 2025 Fark, Inc | Last updated: Feb 07 2025 17:23:05\n\nContact Us via Farkback | Report a bug/error msg | Terms of service/legal/privacy policy | Do Not Sell or Share My Personal Information\n\nRuntime: 0.121 sec (121 ms)","summary":"[link] [21 comments]","url":"https://www.fark.com/comments/13554162","image":"https://usrimg-850.fark.net/U/U3/fark_U3KIiXirE0isx0QbAOgdTveZ3nI.jpg?AWSAccessKeyId=JO3ELGV4BGLFW7Y3EZXN&Expires=1739163600&Signature=z7K%2FgPrR9f9ymKRxyi5wDDU4CMM%3D","video":null,"publish_date":"2025-02-07 21:52:14","author":null,"language":"en","source_country":"us","sentiment":-0.381},{"id":288211988,"title":"Trump seems to declare Travis Kelce 'best tight end' even after Taylor Swift's Biden, Harris endorsements","text":"It's safe to say the president is looking forward to the Super Bowl. President Donald Trump is expected to attend the Super Bowl in New Orleans Sunday, the first time a sitting president will attend the big game. He's getting a great matchup too, with the Kansas City Chiefs looking become the first team to win three consecutive Lombardi Trophies. SIGN UP FOR TUBI AND STREAM SUPER BOWL LIX FOR FREE On the other sideline will be the Philadelphia Eagles, who will be playing in their third Super Bowl in seven seasons. It's a rematch from the Super Bowl two years ago, which Kansas City won 38-35. Trump gave a quick preview of the game on Truth Social, praising the \"two great quarterbacks,\" Patrick Mahomes and Jalen Hurts; \"an unbelievable running back,\" seemingly Saquon Barkley; and \"incredible coaching\" from Andy Reid and Nick Sirianni. But Travis Kelce appeared to get the highest praise from Trump. In the post, Trump appeared to suggest the longtime Chiefs star was the \"best tight end in football (ever)\" without actually mentioning him by name. HOW TO WATCH SUPER BOWL LIX BETWEEN CHIEFS, EAGLES STREAMED ON TUBI That's high praise mere hours after Antonio Gates was voted into the Hall of Fame. It also would put Kelce ahead of Tony Gonzalez, Rob Gronkowski and Jason Witten, among others. The praise comes despite Kelce's girlfriend, pop star Taylor Swift, endorsing Kamala Harris before last year's election. Swift also endorsed Joe Biden in 2020 in his race against Trump. After Swift's endorsement and Patrick Mahomes' wife's apparent support for the president, some wondered whether Brittney Mahomes and Swift's friendship was over, but that has not appeared to be the case. Kelce has not made his political leanings very public. CLICK HERE TO GET THE FOX NEWS APP Among tight ends, Kelce ranks third in NFL history in receptions (1,004) and yards (12,151) and fifth in touchdowns (77). Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Ahead of attending the Super Bowl between the Chiefs and Eagles, President Donald Trump appeared to refer to Travis Kelce as the &quot;best tight end .. .ever&quot;","url":"https://www.foxnews.com/sports/trump-seemingly-dubs-travis-kelce-best-tight-end-even-after-taylor-swifts-biden-harris-endorsements","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/travis-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-07 20:56:20","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.383},{"id":288221102,"title":"The People Who Turned On Democrats Over Gaza Don’t Want Your Blame After Trump’s Rant","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nAfter Donald Trump’s incendiary call for Palestinians to leave Gaza and for the United States to take control there, it didn’t take long for a now-familiar chorus to begin.\n\n“Heck of a job, Dearborn. Especially you, Rashida Tlaib,” posted a political columnist. “I have ZERO sympathy for the Palestinian-Americans who stayed home or voted for Trump. You get what you deserve,” added another liberal commentator. An MSNBC host reminded her audience, “I think now it’s very appropriate to reiterate that elections have consequences.” A Washington correspondent sneered, “Hope everyone is happy now that they got Genocide Joe out of office.”\n\nThe people in Dearborn and other Arab American enclaves—many of whom spent months telling professional Democrats what was happening in their communities and begging for a change in policy toward the war in Gaza—are watching the blame game with resignation.\n\nMohyeddin Abdulaziz, a Palestinian American lawyer and longtime Democratic organizer in Arizona, told me he spent months campaigning against the presidential candidate of his own party, hoping to pressure the Biden administration into reversing its policy of arming Israel. Like virtually every Palestinian in the global diaspora, he said he carried the grief of witnessing a never-ending influx of videos showing the aftermath of Israel’s relentless aerial bombardments. Dismembered children, the bodies of babies, mass graves—Abdulaziz described the anguish of knowing that the bombs used to kill his people were paid for in part by his tax dollars. Continuing to support the administration responsible seemed impossible. He felt abandoned by his own party.\n\nFirst, he tried to apply pressure through internal channels, warning Democratic leaders that the party’s unflinching support for Israel would cost them at the polls. “We told them that we have more votes than the anti-Trump Republicans and Liz Cheney supporters. They made a decision not to communicate with us and instead spent time and money promoting their relationship with Liz Cheney,” he said.\n\nHe and many others continued to protest but were always ready to find a way to support Kamala Harris if she distanced herself from Biden’s policies. But she never did. “I am so disappointed and still disappointed in the Democratic Party,” he said. “Kamala failed.”\n\nWhen he first read Trump’s proposal to expel Palestinians from Gaza and turn it into “the Riviera of the Middle East,” Abdulaziz was stunned. “Usually, perpetrators of war crimes or genocide don’t talk about it. They want to disassociate themselves. But it was so brazen there in the White House, talking about it as if it was neutral, or a deal.” Still, he doesn’t believe much would have changed if Harris had won. He said those who are now blaming people like him are an extension of the Democratic Party’s persistent refusal to listen to and understand its voters. “They have shown no imagination, no understanding of what happened, and no ability to move forward. If they thought our vote was insignificant, how can they blame us for their defeat afterward? It just doesn’t make sense.”\n\nIn Pennsylvania, a crucial swing state that broke for Trump, Palestinian American activist Reem Abuelhaj spent much of the election season bolstering the No Ceasefire, No Vote movement. As with Abdulaziz in Arizona, the goal was not to hand Trump the election but to wield political power in a critical state to save lives.\n\n“For people who a vote for genocide was a red line, who were being vocal during the election, they were giving the Biden–Harris administration an opportunity to change course and do the right thing. First and foremost, for Palestinians in Gaza, and secondly, to secure a victory in the election,” she told me. Instead, those voters were shut out. “It’s not surprising that after a year of watching children get brutally killed by U.S. bombs on social media and everywhere else, many people in the U.S. were not motivated to go out and vote for a party that was paying for that,” she said.\n\n“It’s obviously horrific to hear this call for ethnic cleansing,” she added. “But this is just the next step in a long series of political leaders supporting this policy.”\n\nHamid Bendaas, the communications director for the Policy Project at the Institute for Middle East Understanding, finds it telling that the people now finger-pointing tend to single out Palestinians and Arabs, not others who opposed the war. According to an IMEU poll, Arab and Muslim voters were far from alone in abandoning the Democrats over Gaza; voters across racial and political demographics did so too. “Millions of people felt this way. The question is: Why were they not willing to do something that most Democrats support? Why were they unwilling to listen to their own base?” Bendaas asked.\n\nJames Zogby, the founder of the Arab American Institute, has spent decades working within the Democratic Party. He believes that Harris’ campaign did everything in its power to alienate Arab voters—and that no one should be surprised that it succeeded. As for Trump’s comments and the response from some liberal commentators, he thinks the party is getting played: “This is a distraction,” he said. “He throws out these absurd, bombastic ideas, knowing they’ll dominate the conversation while his administration pushes through devastating policies elsewhere.”\n\nZogby is still active in Democratic leadership and says he is urging insiders not to scapegoat Arab American voters and to try to understand how painful the past year and a half has been for them. “I do not want to see us marginalized. I told the campaigns, when they would tell me ‘It’s a binary choice and they’ll make the right choice,’ I said, ‘The “binary choice” is not going to be the one you think it is. The binary choice is going to be vote or not vote,’ and people chose not to vote,” he said. “I will not accept anyone from my party, the Democratic Party or anyone from the campaign, to put the blame on us. The blame is on them. They created this dilemma. They made it difficult for people to go to the polls. They made it difficult for people to choose the Democratic nominee.”\n\nZogby told me that even so, he’s embarking on difficult conversations within his community as well. “That doesn’t mean that we celebrate having brought down Democrats or that we taught them a lesson,” he said. “This is very painful. This is not an easy situation. And I think we have to understand that and deal with the reality of it. I will fault the campaign, but I’ll say we have to think about what just happened.”\n\nLayla Elabed, a co-founder of Listen to Michigan and one of the most prominent faces in the “uncommitted” movement, is observing a similar dynamic at play in the current environment. “I just don’t think what we’re seeing on social media and on mainstream media is helpful,” she said. “It’s kind of giving the opposition exactly what they want.\n\n“I don’t know anybody who cast a protest vote during the general election who are gloating about it,” she told me. “The few folks that I talked to that voted third party or skipped the top of the ticket, it wasn’t, like, a joyous moment.”\n\nShe said Democrats still have a lot of work to do and that, indeed, not everyone in these communities regrets their vote, even after this week. “I’ve seen folks who feel like they made inroads with the Republican Party and want to continue to organize within that party for their interests, even around Palestine.\n\n“We can go over the mistakes that the Democratic Party made. We can go over the retrospection of movements that were trying to get Democrats to do better,” she added. “Personally, I am moving toward organizing around racial solidarity because this kind of division that we’re seeing right now is only going to serve those who are attacking our civil liberties.”","summary":"“If they thought our vote was insignificant, how can they blame us for their defeat afterward?”","url":"https://slate.com/news-and-politics/2025/02/donald-trump-gaza-strip-news-israel-democrats.html?via=rss","image":"https://compote.slate.com/images/660c2aa8-ab20-49ba-9280-30398debd298.jpeg?crop=5830%2C3887%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-02-07 20:53:12","author":"Aymann Ismail","authors":["Aymann Ismail"],"language":"en","category":"politics","source_country":"US","sentiment":-0.334},{"id":288212700,"title":"Trump blows up ‘Palestine,’ give parents school choice and other commentary","text":"Mideast watch: Trump Blows up ‘Palestine’\n\nDonald Trump “single-handedly collapsed the most destructive idea of the last hundred years” at his press conference on Gaza, applauds Tablet’s Lee Smith — specifically, the idea that Middle East peace requires a Palestinian state. “Given the repeated failure of the multi-decade-long dream of eliminating and replacing the Jews of Israel, it seems unlikely that the Palestinians will receive a better offer” than Trump’s plan to build a “Riviera” there. Indeed, his “generous offer” “signals a return to history, but with a twist. Trump has not only spared them, but vowed to provide them with new lives, better lives, work, new homes, and a chance to raise their families in peace.”\n\nFrom the right: Give Parents School Choice\n\nIn a refreshing shift, President Trump “directed the federal Education Department to examine ways it can better support school choice programs at the state level,” cheers USA Today’s Ingrid Jacques. National test data show “that the current system of educating America’s kids isn’t working” and Trump’s order will “encourage states to break free of the stranglehold that unions have on government-run schools.” It’s imperative that Trump and Republican lawmakers “prioritize both expanding school choice incentives and doing away with the Education Department if they want to see any real change or progress.”\n\nConservative: Democrats’ Ideology Problem\n\nDemocrats are “becoming more liberal, but America remains more conservative,” argues J.T. Young at The Hill. Gallup polling finds that, for the third year in a row, “Republicans led Democrats among voters who identified with one of the two parties” and “presidential exit polling in 2024 showed that Kamala Harris’s largest lead among voters based on age was her 11-point margin among 18- to 29-year-olds.” But voters tend to grow more conservative as they age, so Democrats will “need big majorities among younger voters to offset later future losses.” “Obviously, the political answer for Democrats is to become more moderate,” but it seems “they’re becoming more adamantly liberal.” Recently, “only 23 percent of House Democrats voted” for the popular Laken Riley Act, which “strengthens law enforcement’s hand against illegal immigrants who commit crimes.” “It is one thing to lose an election. It is another altogether to lose an electorate.”\n\nHealth beat: RFK’s Right on Ozempic for Kids\n\n“Minors are being overmedicated with weight-loss drugs,” and Robert F. Kennedy Jr. “is one of the few people pointing it out,” warns The Wall Street Journal’s Jillian Lederman. “The number of Americans 12 to 17 using GLP drugs in a given month rose from 1,653 in 2020 to 10,785 in 2023.” But “there is no conclusive data on the long-term effects” on kids’ health, and “the likely consequences” aren’t looking good. Studies suggest that “restricting caloric intake” can “compromise children’s physical development,” and “adolescents’ inclination toward risk-taking” can lead to abuse of the drugs. That’s “especially true for girls,” who are more likely to “exhibit disordered eating.” “Increasing rates of obesity” among children is a “real, complex societal” problem. “But it’s a mistake to treat understudied pharmaceuticals as a cheat code.”\n\nForeign desk: Mexico’s Alliance With Cartels\n\nThe Trump White House’s claim that “Mexican drug-trafficking organizations have an intolerable alliance with the government of Mexico” is a “seismic pronouncement that heralds a new era of confrontation between the two nations,” explains Joshua Treviño at The Spectator. And it’s “obvious to nearly all of us” who’ve worked on the issue that the statement is indeed “wholly true.” The regime “regards trafficking cartels as vehicles for profit and control and also agents of national policy abroad — especially but not only in the United States.” Team Trump “deserves full credit for speaking the plain truth.” “What follows in policy and action” is “the choice of the American government — and the fault, in full, of the Mexican one.” \n\n— Compiled by The Post Editorial Board","summary":"Donald Trump “single-handedly collapsed the most destructive idea of the last hundred years” at his press conference on Gaza, applauds Tablet’s Lee Smith.","url":"https://nypost.com/2025/02/07/opinion/trump-blows-up-palestine-give-parents-school-choice/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/2025-washington-dc-netanyahu-first-97908802_3e6cb6.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-07 20:52:17","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.018},{"id":288235100,"title":"Parents Move Right, Pundits Panic, Trump Delivers","text":"While progressive voters, Kamala Harris’s campaign team, and the Pod Save America guys wax poetic and point fingers about November’s election results, President Trump is delivering on his campaign promises to parents—firehose style. My sense is that most in the pundit class still don’t grasp how much parents with school-aged children influenced the election–shifting 7 points to the right between 2020 and 2024. Based on the first few weeks of President Trump’s second term, he did not take those votes for granted. His actions have shown parents across the political spectrum that he is delivering on promises made. Their frustrations with DEI and gender obsession in schools had reached a boiling point—so much so that many, for the first time, voted for him with hopes of restoring sanity in their children’s classrooms. \n\nAnyone who had an actual ear to the ground in K-12 education over the past few years saw the Trump train coming from a mile away. It was obvious that parents of every political stripe had reached their limit regarding the complete ideological capture and non-academic focus of their kids’ schools. Republicans and Independents were certainly more publicly outspoken about their concerns, but anyone who failed to see Democrats losing patience as well was simply ignoring the bright red warning signs. \n\nThere was no hard data to support my sense that a sizable number of voters with children were going to vote for Trump for the first time. It was just a sense that the Democratic Party, the teachers’ unions, and countless school boards had pushed people too far and the backlash would reveal itself in the voting booth. \n\nPolling data now confirms what so many of us have been seeing, feeling, and hearing on the ground: the Biden administration’s education priorities, which were largely based in ideology instead of academics, have proven deeply unpopular with parents. \n\nAccording to a poll of parents commissioned by Parents Defending Education (where I work), a whopping 90 percent of parents agree that focusing on core subject areas—such as math, reading, writing, science, and social studies—would improve the quality of public education. In other words, as cliche as it may sound, parents want schools to get back to the basics. Parents are not on board with gender policies that allow students (and staff) to self-identify as the opposite sex, yet these policies are now the norm in most schools. 77 percent of parents, regardless of party affiliation, oppose allowing males, who identify as females, to use female bathrooms and locker rooms and vice versa. Notably, the party breakdown of that number is 92 percent of Republican parents, 75 percent of Independent parents, and 58 percent of Democratic parents. \n\nThe concept of “equity” seemed reasonable to most parents—until they saw how their school district applied it. Instead of fairness, it meant eliminating honors classes, doling out different disciplinary consequences based on race, and giving credit for school work that was never even turned in. 82 percent of parents, including 75 percent of Democrats, believe disciplinary consequences should be the same for all students, regardless of race. Additionally, 72 percent of parents, including 58 percent of Democrats, oppose 'grading for equity.’\n\nNeedless to say, Trump’s day-one executive order on gender ideology and biological truth is music to the ears of parents who are fed up with schools teaching kids that gender is a choice and that they might have been born in the wrong body. \n\nThree days later, there was reason for more celebration when Trump’s Department of Education announced the elimination of DEI initiatives in K-12: \n\nFrom the press release: \n\nThe U.S. Department of Education has taken action to eliminate harmful Diversity, Equity, and Inclusion (DEI) initiatives, including references to them in public-facing communication channels and its associated workforce. These actions are in line with President Trump’s ongoing commitment to end illegal discrimination and wasteful spending across the federal government. They are the first step in reorienting the agency toward prioritizing meaningful learning ahead of divisive ideology in our schools.\n\nParents are hardly a monolith, but it is undeniable that voters with children shifted significantly in the presidential race–enough to make a real impact. It is also undeniable that, baked into that vote, was a rejection of the race, gender, and equity-obsessed madness in their children’s schools. During the campaign, Trump recognized parental dissatisfaction with the DEI takeover of K-12 schools as an opportunity, which he capitalized on, and it is already bearing fruit for parents who voted for him.","summary":"While progressive voters, Kamala Harris's campaign team, and the Pod Save America guys wax poetic and point fingers about November's election results, President Trump is delivering on his","url":"https://www.realcleareducation.com/articles/2025/02/07/parents_move_right_pundits_panic_while_trump_delivers_on_education_1090009.html","image":"https://assets.realclear.com/images/67/677407_6_.jpeg","video":null,"publish_date":"2025-02-07 20:15:45","author":"Erika Sanzi,RealClearEducation","authors":["Erika Sanzi","RealClearEducation"],"language":"en","category":"politics","source_country":"US","sentiment":0.047},{"id":288208198,"title":"Fetterman worried Democrats haven’t learned from 2024 after DNC election","text":"Fetterman appeared concerned about the DNC’s new vice chairman, 24-year-old activist David Hogg. The DNC held leadership elections on Feb. 1, electing Hogg along with Artie Blanco and Malcolm Kenyatta as vice chairs. Minnesota DFL chairman Ken Martin was elected chairchairman.\n\n“The new leadership of the DNC, the vice chair, [said] you know, abolish ICE and the other thing saying, defund the police,” Fetterman said in a podcast with Puck journalist Tara Palmeri. “I’m concerned that we really haven’t paid attention on what happened. And have we looked up at the scoreboard and been like, oh, by the way, we’ve lost.”\n\nFULL LIST OF EXECUTIVE ORDERS, ACTIONS, AND PROCLAMATIONS TRUMP HAS MADE AS PRESIDENT\n\nFetterman is referencing social media posts Hogg made in 2020. Hogg posted “Abolish ICE” in a July 31 post, and “Defund the police not USPS” on Aug. 15 of the same year. \n\nThe senator added that he “didn’t know much about” Martin, the new chairman.\n\nDemocrats lost a chance at regaining the House, and lost control of both the Senate and the White House during the 2024 elections.\n\nThe party reflected in the aftermath of the election, partly blaming former Vice President Kamala Harris’s late entry into the race, and their inconsistent stances on transgender, Israel, and immigration issues.\n\nThe Pennsylvania senator also agreed that his party is “toxic” and had a hard time connecting with voters in swing states like his home state.\n\n“I think their primary currency was shaming and scolding and talking down to people and telling them, ‘Hey, I know better than you, or you’re dopes, or you’re a bro, or you’re ignorant or, how can you be this dumb? I can’t imagine it. And then, by the way, they’re fascists. How can you vote for that?’” Fetterman said.\n\nHe continued, “And you know, when you’re in a state like Pennsylvania, I know, and I love people that voted for Trump, and they’re not fascist. They don’t support insurrection and those things. And if you go to an extreme, and you become a boutique kind of proposition, then you’re going to lose the argument. And we have done that.” \n\nFetterman later went further to say that he wasn’t sure Democrats could win back white men, and that support from the demographic has been “seriously eroding” for a while.\n\n“In the conversations I’ve had a lot of people, they don’t even want to say it publicly, but they just feel like, you know, the other side seems like it’s, it’s like men, well, that men’s the problem,” he said. “Men are to blame, or their masculinity is toxic. Or if you, unless you’re able to conform to our very strict kinds of definition of what we think’s appropriate, well then I’m going to find an alternative. And they’ve done that.”\n\nFetterman has been one of the most moderate Democratic senators since the start of Trump’s presidency. He’s met with Trump, voted in favor of some of his nominees, and has been more open than other Democrats to meeting with his prospective cabinet choices like DNI nominee Tulsi Gabbard and HHS nominee Robert F. Kennedy Jr.\n\nThe senator was heavily rumored to be a candidate to leave the Democratic Party last month, but he shot the rumors down in harsh terms, saying it was “amateur-hour sh*t.”\n\n“If they think, ‘Oh, it’s going to be like a Manchin or a Sinema play,’ that’s just not true, and that’s not going to happen … And even if I wanted to do that, that is a rocket sled to Palookaville to try to switch. I would make a pretty bad Republican.”","summary":"Sen. John Fetterman (D-PA) is anxious that the Democratic Party hasn&#8217;t learned from its 2024 election loss with its new leadership choices. Fetterman appeared concerned about the DNC&#8217;s new vice chairman, 24-year-old activist David Hogg. The DNC held leadership elections on Feb. 1, electing Hogg along with Artie Blanco and Malcolm Kenyatta as vice chairs. [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3314083/fetterman-worried-democrats-not-learned-from-2024-election-with-new-leadership/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/John-Fetterman-Dems.webp","video":null,"publish_date":"2025-02-07 20:10:32","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.162},{"id":288235092,"title":"A 2024 Election Postmortem","text":"After a whirlwind 2024 election filled with twists and turns, Donald Trump has once again taken the presidency. But as the dust settles, a new poll from RealClearOpinion Research/Emerson Polling offers a revealing look back at the 2024 election \u0013 unpacking why Kamala Harris fell short and what lessons both parties can take into the future.\n\nRead Full Article �","summary":"After a whirlwind 2024 election filled with twists and turns, Donald Trump has once again taken the presidency. But as the dust settles, a new poll from RealClearOpinion Research/Emerson Polling offers a revealing look back at the 2024 election - unpacking why Kamala Harris fell short and what lessons both parties can take into the future.","url":"https://www.realclearpolitics.com/2025/02/07/a_2024_election_postmortem_640590.html","image":"https://assets.realclear.com/images/66/669108_5_.jpeg","video":null,"publish_date":"2025-02-07 20:10:22","author":"Jonathan Draeger,RealClearPolitics","authors":["Jonathan Draeger","RealClearPolitics"],"language":"en","category":"politics","source_country":"US","sentiment":0.143},{"id":288203310,"title":"The ‘View’ co-hosts applaud Travis Kelce’s ‘classy’ reaction to President Trump attending Super Bowl","text":"The “View” co-hosts supported Travis Kelce after he gave a “diplomatic” reaction to President Donald Trump attending the upcoming Super Bowl 2025.\n\nThe Kansas City Chiefs tight end made headlines earlier this week when he said it was a “great honor” that Trump will become the first sitting president to go to a Super Bowl.\n\nThe comment drew some criticism from fans, because Trump has previously expressed “hate” towards Kelce’s girlfriend, Taylor Swift. \n\n“This Taylor Swift fan is not mad about it,” Alyssa Farah Griffin began on Friday’s episode. “I thought it was totally classy, a diplomatic answer, and it’s big day.”\n\nThe former political strategist pointed out that the “presidency is bigger than any one person” and Kelce, 35, said he’s “proud that the president of the United States is there.”\n\n“I don’t know that it’s any kind of statement about Donald Trump specifically,” Griffin added. “He’d say the same thing if it was Joe Biden, Obama, George Bush. I thought it was a very classy statement and don’t make it a bigger story. It would’ve totally distracted from the game.”\n\nAna Navarro agreed and argued that if Kelce “had said something against Trump, it would be taken out on his team and all the hate that his team would receive as they’re heading into the Super Bowl.”\n\nMeanwhile, Sara Haines reminded viewers that the upcoming game is a “historical moment” for Kelce and his teammates, because they could become the first NFL team to win the Super Bowl three years in a row. \n\n“This is the biggest game [and] anything else he said would have made it about something else and not about them,” Haines said. \n\nHaines, 47, also added that Kelce expressed his “love” for the country –– and not Trump.\n\n“He was essentially saying, ‘I love this country,'” Haines said.\n\nSunny Hostin chimed in to say that Kelce is “very protective” over Swift and was thinking about the long-term effects.\n\n“He was being a diplomat, and I think he did the right thing by not giving into this madness,” Hostin, 56, said.\n\nWhoopi Goldberg ended the conversation by simply saying, “The kid did well.”\n\nKelce told reporters during a press conference on Wednesday that it was “awesome” and a “great honor” to have Trump coming to the game.\n\n“I think, you know, no matter who the president is, I know I’m excited because it’s the biggest game of my life, you know, and having the president there, you know, it’s the best country in the world. So, that’d be pretty cool,” he said.\n\nTrump –– who’s expected to attend alongside House Speaker Mike Johnson (R-La.) and Homeland Security Secretary Kristi Noem –– will see Kelce and his teammates take on the Philadelphia Eagles at Caesars Superdome in New Orleans on Sunday.\n\nKelce shared the statement months after Swift publicly endorsed former Vice President Kamala Harris when she was running against Trump in the 2024 Presidential Election.\n\nTrump subsequently reacted to the endorsement by writing on his Truth Social platform, “I HATE TAYLOR SWIFT!”\n\nTrump ultimately won the 2024 election and officially took office in January.","summary":"The Kansas City Chiefs tight end made headlines earlier this week when he said it was a \"great honor\" that Trump will attend the Super Bowl 2025.","url":"https://pagesix.com/2025/02/07/entertainment/the-view-co-hosts-applaud-travis-kelces-reaction-to-president-trump-attending-super-bowl/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/02/98064009.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/uYoMoo0Q-guILbWnz.mp4","publish_date":"2025-02-07 20:02:20","author":"Caroline Blair","authors":["Caroline Blair"],"language":"en","category":"politics","source_country":"us","sentiment":-0.086},{"id":288210980,"title":"CBS Releases The Unedited Vice President Harris Interview!","text":"As seen on Gutfeld!, Greg mocks some of the most mind-blowing clips from the unedited 60 minutes interview with former Vice President Kamala Harris.\n\nLearn more about your ad choices. Visit podcastchoices.com/adchoices","summary":"As seen on Gutfeld!, Greg mocks some of the most mind-blowing clips from the unedited 60 minutes interview with former Vice President Kamala Harris. Learn more about your ad choices. Visit podcastchoices.com/adchoices","url":"https://radio.foxnews.com/2025/02/07/cbs-releases-the-unedited-vice-president-harris-interview/","image":"https://static.foxnews.com/radio.foxnews.com/content/uploads/2024/12/HEADER_BANNER_GUTFELD_MONOLOGUES.png","video":null,"publish_date":"2025-02-07 19:46:46","author":"James Laverty","authors":["James Laverty"],"language":"en","category":"politics","source_country":"us","sentiment":0.112},{"id":288190660,"title":"“The View” hosts defend Travis Kelce calling it 'great honor' to have Donald Trump at Super Bowl: 'The kid did well'","text":"The ladies of The View are standing up for Travis Kelce after he received backlash from girlfriend Taylor Swift’s fans for calling Donald Trump’s upcoming attendance at the Super Bowl a “great honor.” \n\n The Kansas City Chiefs tight end, 35, made his remarks during a press conference on Wednesday. “It’s a great honor, no matter who the president is. I know I’m excited because it’s the biggest game of my life, you know?” Kelce said. “And having the president there — it’s the best country in the world, so, it’ll be pretty cool.”\n\n Kelce faced heavy pushback online from Swift's fanbase due to his positive outlook on Trump's appearance at the event, given that Trump famously posted on his platform Truth Social that he hated the “Bad Blood” singer after she endorsed Kamala Harris in the run-up to the 2024 presidential election. However, one longtime Swiftie sitting at the Hot Topics table thought his comments were just fine.\n\n “I thought it was totally classy, a diplomatic answer, and it’s his big day to be playing,” Alyssa Farah Griffin, dressed in a Chiefs sweater, said. “I think I’m gonna repeat this a lot in the next four years: the presidency is bigger than any one person. He’s proud that the President of the United States is there, I don’t know that it’s any kind of statement about Donald Trump specifically. He’d say the same thing if it was Joe Biden, [Barack] Obama, George Bush.”\n\n Ana Navarro similarly noted that if Kelce had chosen to call out Trump, he wouldn’t have been the only one suffering the consequences. She added, “It would be taken out on his team.” \n\n Cohost Sara Haines also pointed out that Kelce was asked the question while he was representing his team at a professional event. “He’s dressed in his uniform: whenever you’re in — whether it’s your company, your brand, your team — you’re representing more than yourself,” she explained. “And he made a point of saying, ‘I love this country.’ That was not: ‘I’m a big fan, I love this person.’”\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n Sunny Hostin agreed with Haines’ response, noting that Kelce's choice to express his love for the United States regardless of who was currently serving as president was a huge “tell” for her. \n\n “We know his brother [Jason Kelce], they are a very loving family, they are very protective over their women,” she said. “I just want to throw up real quick the tweet that Trump put up about Taylor Swift. ‘I hate Taylor Swift,’ he said. I’m pretty sure that Travis Kelce knows that. He was being a diplomat. And I think he did the right thing by not giving into this madness.” \n\n Moderator Whoopi Goldberg applauded her cohosts for seeing through the unnecessary negativity and defending Kelce ahead of the big game. “I like that we’re not giving into the madness either. Because part of our job is not to feed that, because we want to help you not be like this,” she told the audience. “So, the kid did well, I think.” \n\n Super Bowl LIX, which airs live from the Caesars Superdome in New Orleans on Feb. 9, will see the Chiefs go toe-to-toe against the Philadelphia Eagles. If the Chiefs win, Kelce and his teammates will once again make history by becoming the first team to ever win the Super Bowl three years in a row. \n\n The View airs weekdays at 11 a.m. ET/10 a.m. PT on ABC.","summary":"Trump posted \"I hate Taylor Swift\" on his social media account ahead of the presidential election.","url":"https://ew.com/the-view-hosts-defend-travis-kelce-calling-honor-trump-super-bowl-8787788","image":"https://ew.com/thmb/_18XxABYMGJ2wUGrFlyMn8gelew=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/whoopi-goldberg-travis-kelce-donald-trump-020725-b121ec6c5c5d437386868229b6592b9d.jpg","video":null,"publish_date":"2025-02-07 19:32:06","author":"Emlyn Travis","authors":["Emlyn Travis"],"language":"en","category":"politics","source_country":"US","sentiment":0.034},{"id":288197136,"title":"How Trump suddenly became a feminist champion","text":"It was US President Donald Trump – a man who looked at Playboy founder, Hugh Hefner, and thought, “Now there’s a guy with life figured out” – who somehow became the only person in charge willing to pump the brakes on the surreal spectacle of born males bulldozing women on the rugby field, then waltzing right into the women’s locker room along with them. All while intersectional third-wave feminists are on the sidelines, basically acting like the hype squad… for the “dudes.”\n\nAfter allowing a dude to smoke all the women in college swim championships, the NCAA American collegiate sports league announced on Thursday that it was suddenly putting an end to the practice, limiting the participation of transsexuals in women’s events to those whose assigned gender at birth was female. \n\nThe move came in the wake of Trump’s executive order earlier in the week withdrawing federal funding from institutions that allowed biological males to compete against women. “If you let men take over women’s sports teams or invade your locker rooms, you will be investigated for violations of Title IX and risk your federal funding,” Trump said. \n\nUnder this Title IX civil rights law, considered a major victory for 60’s and 70s-era second-wave feminist icons like Gloria Steinem, Betty Friedan, and tennis icon and activist Billie Jean King, colleges receiving federal funding couldn’t just have sports teams and scholarships exclusively reserved for men anymore. Sports suddenly became a social elevator and opportunity springboard for young women, too. But all of that was clawed back, mostly to deafening silence from feminists.\n\nHow on earth did Donald “grab her by the p***y” Trump end up being the one to reestablish due north on this issue?\n\nOne could argue that it’s feminism itself that has been ideologically corrupted by radical leftism, to the point where even the second-wave feminists – who were considered radical back when they were fighting for women to own property, have their own credit cards, or keep their own name in marriage – now seem almost conservative in comparison to this latest crop. \n\nFeminism didn’t need intersectionality. That is, to get mixed up with causes that detract from the straightforward focus on improving the lives of women. There’s more than enough material to work with already when we still haven’t fully emerged from the turbulent wake of the MeToo movement, which shattered the long-standing omertà that mandated women’s silence about systemic second-class or abusive treatment as the price of fame and fortune in Western media and entertainment.\n\nI was personally once told, despite supposedly being hired for my political acumen at a certain New York-based American cable news outfit, to just sit there and laugh at my co-host’s jokes, deferring to him while crossing and uncrossing my bare legs on camera. The message was clear: You either leave or comply, because if you don’t, then some other ambitious woman with equally decent legs will. And if you’re on the political right, good luck finding any feminists in your corner. Because leftist causes now take precedence over the defense of actual women, particularly if the woman in question doesn’t pass the ideological litmus test.\n\nRather than fighting the creeping, increasingly institutionalized corruption-driven brand of globalist leftism, today’s feminists have embraced it, confounding their struggle with all sorts of other causes that dilute their original mission. If one wanted to hijack the feminist movement, and render it totally useless in the actual defense of women, it’s hard to imagine a better way of going about it than by confusing it with issues like climate change and gender bending.\n\nAccording to the United Nations’ “Feminist Climate Justice Framework for Action,” published in 2023, “economic hardship wrought by a heating planet is having additional knock-on effects for gender equality. Evidence shows that as communities are plunged into recurrent crises, tensions within families and between partners rise and gender-based violence escalates.” Ok, so when it gets hot outside, folks can get testy, and Mr. Hand can be inclined to become Mr. Fist. Do I have that right?\n\nLemme guess, the solution is just to give governments more of our tax money in an effort to stop the hot weather, right? Of course.\n\nI seriously doubt that a single woman’s life has been spared by laundering tax cash into the elites’ climate change scam. Maybe if people were paying less of their own money into rackets like this, men and women alike would have more freedom to make decisions in their own best interests – including escaping any bad situation, whether that means leaving home or leaving a Spanish summer heatwave for the Edinburgh rain.\n\nThe kind of leftist causes that feminists have swallowed like they’re obligatory menu items included in a full meal deal are exactly the sort of issues that are relentlessly backed and promoted by corrupt institutional tools of regime change like USAID, which has funneled cash to NGOs messing around in the domestic affairs other countries, including under the pretext of promoting diversity. So much for sticking it to the patriarchy when you’re actively helping to grease the skids for its regime change efforts. The kind that harm women around the world through displacement, insecurity, and death.\n\nThis systemic perversion has been such a detriment to the average woman that when Trump campaigned on the promise to take a wrecking ball to the costly corruption that was keeping the working and middle class impoverished, barefoot and in the kitchen in service of predatory special interests primarily serving the global financial class, he managed to get a higher percentage of the female vote than even Joe Biden did in 2020, despite Trump running against a woman: former Vice-President Kamala Harris. And Trump managed to score this support despite a clear lack of appetite in reclaiming the issue of women’s reproductive freedom from the states, several of which have outlawed abortion outright. Enough women apparently decided in the voting booth that their current lives are impacted by worse problems than just that one issue, which Harris and Biden themselves never promised to do anything about, either, opting instead to punt it to Congress and saying that they’ll sign a law protecting the right to access the procedure, if Congress can ever be bothered to give them one someday.\n\nThe same Democratic officials, hailed by today’s feminists, couldn’t be bothered to stand up for women against men who decided to identify as women – right before taking full advantage of the chance to dominate them on the playing field.\n\nSecond wave feminists who have been fighting for women’s equality of opportunity for decades by promoting the adoption of the Equal Rights Amendment, inexplicably failed to react, beyond actually cheering, when a key aspect of it that managed to make it into law – Title XI – was undermined. How exactly does allowing men to steal opportunities and financial benefits from women jibe with female advancement?\n\nIt doesn’t, and isn't it unfortunate that the lack of interest in addressing this issue, or even the outright support of this undermining of women’s rights, has ultimately resulted in a man unilaterally stepping in to get the job done?\n\nThe women who were speaking out against the injustice were typically dismissed as right-wing populists whose politics failed the feminist litmus test. But right-wing populist women can be feminists striving for equality and freedom, too. Such women consider the corrupt establishment status quo to be the primary existential oppressive force preventing social mobility by protecting “elite” special interests, including through the kind of Orwellian manipulations for which far too many leftist feminists have been keen to serve as handmaidens.\n\nWouldn’t it be just dandy if our sisters on the left could stop doing unpaid internships for the globalist overlords and their radical agenda? Imagine what we could accomplish if we stopped fighting each other for a hot minute and started fighting the actual final boss battle here.","summary":"The ban on biological men in female sports is an actual move to protect women, unlike most of the leftist posturing done to date \nRead Full Article at RT.com","url":"https://www.rt.com/news/612329-how-trump-became-feminist-champion/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67a5f2f485f54009f4692a16.jpg","video":null,"publish_date":"2025-02-07 19:28:11","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.154},{"id":288192776,"title":"Super Bowl 2025 likely to have Donald Trump in attendance, Patrick Mahomes' mother reacts","text":"President Donald Trump's anticipated appearance at Super Bowl LIX is discussed by Patrick Mahomes' mother.How does the Mahomes family feel about Trump’s visit?The mother of Patrick Mahomes, the star of the Kansas City Chiefs, Randi Mahomes, walked the red carpet before Thursday night's NFL Honors in New Orleans.Mahomes will be watching her son and the Chiefs play for a historic third straight Super Bowl championship from the stands at the Caesars Superdome.President Donald Trump is anticipated to attend. It would make him the first sitting president to attend a Super Bowl.Mahomes supported Donald Trump before he defeated Kamala Harris in the presidential election. She told Fox News Digital that it's amazing for a president of our country, the United States. Whoever the president is, she believes they should support the teams and America's top sport. Being able to support it as president is really cool, in her opinion, as quoted in a report by Fox News.Speaking to reporters on Wednesday, the Chiefs' star quarterback also responded to the prospect of President Trump going to the game. It's always cool to be able to play in front of a sitting president, Mahomes stated. Someone that is at the top position in our country. Prior to the game, President Donald Trump congratulated Patrick and Brittany Mahomes on the birth of their third child. The president was a little evasive when asked earlier in the week who he was pulling for.There’s a certain quarterback that seems to be a pretty good winner, he stated, as reported by Fox News.FAQsWill Donald Trump attend Super Bowl LIX?He is expected to attend the Super Bowl, making history as the first sitting president to do so.How did Patrick Mahomes react?He said it was cool to play in front of a sitting president and recognized the significance of the occasion.","summary":"Donald Trump is expected to attend Super Bowl LIX, becoming the first sitting president to do so.","url":"https://economictimes.indiatimes.com/news/international/us/super-bowl-2025-likely-to-have-donald-trump-in-attendance-patrick-mahomes-mother-reacts/articleshow/118034834.cms","image":"https://img.etimg.com/thumb/msid-118034888,resizemode-4,width-1200,height-900,imgsize-42918,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-07 19:25:35","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":-0.188},{"id":288197834,"title":"Fentanyl changed everything for our family: McDowell","text":"Rep. Addison McDowell’s first time speaking on the floor of the U.S. House of Representatives had added meaning. McDowell lost his sibling to fentanyl poisoning in 2016, when Joe Biden was vice president in the Obama administration – a hierarchy with policies he says contributed to the fatality.\n\nMcDowell saw progress as the day grew late. House passage was 312-108 sending the Halt All Lethal Trafficking of Fentanyl Act, or HALT Fentanyl Act, to the Senate. The only North Carolinians against were Democratic Reps. Alma Adams and Valerie Foushee. One Republican and 107 Democrats were against it; 98 Democrats were in favor, including North Carolina’s Don Davis and Deborah Ross.\n\nThe legislation will be received in a Senate with 53 Republicans, 45 Democrats and two independents caucusing with the minority party. President Donald Trump, including within tariff threats, has singled out the danger of fentanyl and pledged to use all means to stop it.\n\nMcDowell said it was one pill, manufactured in China, smuggled through an open border.\n\n“In 2017, we lost my little brother Luke to fentanyl poisoning,” McDowell said. “He was only 20 years old. It changed everything for our family. And there’s not a day that goes by that we don’t feel the pain of that loss.”\n\nPassage in the chamber was a day before what would have been his 29th birthday. McDowell – 30 when he took his oath, a birthday celebrant Jan. 21 – said his family’s pain is not unique.\n\n“Tens of thousands of Americans are being shattered, and their families are being shattered by this crisis each year,” he said. “Today, fentanyl is the leading cause of death among young adults. Enough is enough, Mr. Speaker. Enough is enough!”\n\nThe legislation would take care of a sunset on an emergency order expiring at the end of next month, keeping fentanyl and fentanyl-related substances a Schedule 1 drug. Without that classification, lawmen can’t seize many of the deadly drugs, McDowell said.\n\n“It means drug traffickers will be empowered to push deadlier drugs on our streets, and it means that our Border Patrol officials will lose the authority to seize these drugs coming across our border,” said the representative of the state’s 6th Congressional District. “We have before us the opportunity to save many lives. We lost my little brother to fentanyl. And I will not stop until we ensure that others don’t lose theirs.”\n\nOffenses involving 100 grams or more trigger a 10-year mandatory prison term, according to the bill language authored by Rep. Morgan Griffith, R-Va.\n\nMcDowell campaigned on the drug war, turning back Rev. Mark Walker in a close primary that qualified for a runoff. Walker declined, instead joining the campaign team of eventual winner Trump.\n\nPrior to Kamala Harris campaigning for President Joe Biden in Greensboro on July 11, McDowell and Rockingham County Sheriff Sam Page took square aim saying she wouldn’t say anything about the border and fentanyl.\n\n“Joe Biden’s open border – and his border czar Kamala Harris – could stop this border crisis today if they wanted to. But they won’t,” McDowell said in the summer. “They opened the border on Day 1 and they’ve endangered every family in North Carolina.”\n\nTrump’s policies of his first three weeks are changing the border activity. And McDowell added something to the fight for his brother Luke.","summary":"(The Center Square) – Wrought with emotion by his brother’s fentanyl poisoning, a 31-year-old freshman congressman from North Carolina on Thursday implored colleagues to fight the deadliest of drugs at America&#8217;s borders. Rep. Addison McDowell’s first time speaking on the floor of the U.S. House of Representatives had added meaning. McDowell lost his sibling to [&#8230;]","url":"https://www.washingtonexaminer.com/news/3314417/fentanyl-changed-everything-for-our-family-mcdowell/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/AP24257616120027.webp","video":null,"publish_date":"2025-02-07 19:24:55","author":"Alan Wooten | The Center Square","authors":["Alan Wooten | The Center Square"],"language":"en","source_country":"US","sentiment":-0.278},{"id":288193712,"title":"'Red Line': Arab-Americans Oppose Trump's Gaza Takeover Plan","text":"In America's largest Arab enclave, where frustration with President Joe Biden's Gaza policy led many to back Donald Trump, anger is now growing over the president's explosive proposal to take control of the Palestinian territory.But Dearborn voters say their only viable option in 2024 was to punish Democrats, leveraging their influence as a minority community on their core issue.\"I do not regret my vote,\" said Samra'a Luqman, a political activist in this Detroit suburb of 110,000, where most residents have Middle Eastern or North African heritage.Previously a Democratic stronghold, Dearborn saw Trump win 42.5 percent of the vote in November, followed by Kamala Harris at 36.3 percent and Green Party candidate Jill Stein at 18.3 percent.Some Democratic critics claim the community helped deliver Michigan to Trump, despite his decisive 80,000-vote margin -- a gap too large to be attributed solely to shifts within the relatively small Arab and Muslim electorate. Moreover, Trump carried all seven swing states.\"We've seen the great march of return, emotions I can't even describe,\" said 42-year-old Luqman, describing the overwhelming joy of displaced Palestinians finally returning home despite the devastation. She credited Trump for making the ceasefire between Israel and Hamas possible.Yet Luqman and other Trump voters insist they strongly oppose the Republican's idea of displacing the nearly two million Gazans from their homeland and remain committed to holding both US political parties accountable in future elections.\"That's not something we will stand for,\" said Faye Nemer, 39, a prominent businesswoman who lost relatives in Israel's recent attacks on Lebanon. \"Palestine is a red line for the community.\"Nemer said the community met with high-level Democrats and Republicans before deciding whom to support.Trump visited Dearborn, while Harris did not, touring the state instead with Liz Cheney, who many Americans consider a war hawk.Nemer, who helped organize a lunch for Trump at a local restaurant, said he pledged support for peace and a two-state solution -- an assurance that swayed many voters. She remains \"very optimistic\" he will ultimately deliver.Bishara Bahbah, a prominent Trump supporter celebrating in Dearborn on election night, is also confident in Trump's broader vision for Middle East diplomacy.\"The president wants to see peace in the Middle East that satisfies all parties,\" he told AFP, insisting Trump was speaking \"hypothetically rather than realistically\" about displacing Gazans.Bahbah chairs the group formerly known as \"Arab Americans for Trump,\" recently renamed \"Arab Americans for Peace\" -- a change he says reflects the post-election shift rather than any reaction to Trump's policies.Trump also secured endorsements from Arab American mayors Bill Bazzi of Dearborn Heights and Amer Ghalib of Hamtramck, although neither responded to requests for comment. Bazzi did speak to AFP on election night, celebrating Trump's win.For local news publisher Osama Siblani, 70, their silence may stem from embarrassment.\"They have nothing to say, but they have to answer to their constituents,\" he said, noting that both mayors face re-election in 2025.\"Trump came here and he lied. He said, 'I'm going to spread peace and love in the region and in the world.' And as soon as he got in, he wants to take Canada, he wants to take Greenland, he wants to take Panama, he wants to take Gaza.\"Still, Siblani believes Democrats are to blame for their losses, pointing out that his newspaper, The Arab American News, endorsed neither candidate.\"We are not responsible for this outcome; our price was low,\" said comedian and lawyer Amer Zahr, 47, who voted for Stein.Zahr argued that Harris could have secured Arab American support simply by signaling openness to an arms embargo on Israel.Instead, Democrats' condemnation of Trump's proposals and newfound willingness to talk about \"ethnic cleansing\" only \"validates\" the community's choices by proving the party can be nudged in the right direction with the right incentives, he said.Luqman, who leans strongly left on issues like the environment and abortion, acknowledged the difficult choice many faced.\"A lot of people held their nose and voted who did not want to vote Republican but did it anyway, and are now open to either party,\" she said.","summary":"In America's largest Arab enclave, where frustration with President Joe Biden's Gaza policy led many to back Donald Trump, anger is now growing over the president's explosive proposal to take control of the Palestinian territory.","url":"https://www.ibtimes.com/red-line-arab-americans-oppose-trumps-gaza-takeover-plan-3762860","image":"https://d.ibtimes.com/en/full/4581263/faye-nemer-ceo-mena-american-chamber-commerce-talks-about-president-donald-trumps-comments.jpg","video":null,"publish_date":"2025-02-07 19:21:24","author":"Issam Ahmed","authors":["Issam Ahmed"],"language":"en","category":"politics","source_country":"US","sentiment":-0.058},{"id":288190668,"title":"‘The View’ hosts applaud Kansas City Chiefs star Travis Kelce for not slamming Trump’s Super Bowl attendance","text":"Despite their deep dislike of President Donald Trump, the co-hosts of \"The View\" agreed with Kansas City Chiefs tight end Travis Kelce refusing to condemn the president’s appearance at the Super Bowl. During Friday’s episode of the ABC daytime talk show, the panel remarked that Kelce’s answer to a question about Trump being at the game was \"very classy\" as it showed respect for the office of the presidency no matter the occupant, as well as keeping his team out of drama ahead of the NFL championship. \"He’d say the same thing if it was Joe Biden, Obama, George Bush,\" co-host Alyssa Farah Griffin remarked, adding, \"I thought it was a very classy statement.\" TRUMP EXPECTED TO ATTEND SUPER BOWL LIX IN NEW ORLEANS Kelce, whose team is looking to overcome the Philadelphia Eagles to secure a third straight Super Bowl win on Sunday, reacted positively to news that Trump is expected to attend. \"I think it’s a great honor no matter who the president is,\" he said during a Super Bowl press conference on Wednesday. \"I know I’m excited because it’s the biggest game of my life, you know, and having the president there, you know, it’s the best country in the world. So, that’d be pretty cool.\" Kelce kept his remarks civil despite Trump’s public criticism of his pop star girlfriend, Taylor Swift, on the presidential campaign trail last year after she endorsed Trump’s opponent, former Vice President Kamala Harris. Since then, however, Trump has showed support for the Chiefs and its key players, including Kelce. In a recent Truth Social post, Trump called the player the \"absolute best tight end in football (Ever!).\" HOW TO WATCH SUPER BOWL LIX BETWEEN CHIEFS, EAGLES STREAMED ON TUBI He has praised the team’s quarterback, Patrick Mahomes, while hinting at rooting for them over the Eagles this Sunday. When asked who he thought would win, Trump told reporters, \"I don’t want to say, but there’s a certain quarterback that seems to be a pretty good winner.\" \"This Taylor Swift fan is not mad about it,\" Griffin told her View co-hosts about Kelce's comments. \"I thought it was totally classy – a diplomatic answer and it’s his big day to be playing. And also by the way, I think I’m going to repeat this a lot in the next four years: the presidency is bigger than any one person. He is proud that the President of the United States is there. I don’t know that it’s any kind of statement about Donald Trump specifically.\" Co-host Ana Navarro agreed, noting that if Kelce had disparaged Trump it would have garnered backlash for his team. \"And imagine though, if he had said something against Trump, it would be taken out on his team, right? And all the hate that his team would receive as they are heading into the Super Bowl.\" Co-host Sara Haines chimed in, \"This is such a historical moment that this is the biggest game. Anything else he said would have made it about something else and not about them.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE She added, \"And I also would remind – he was in his, like you said, he’s dressed in his uniform. Whenever you’re in – whether it’s your company, your brand, your team, you’re representing more than yourself. And he made a point of saying, ‘I love this country. ’That was not, ‘I’m a big fan. I love this person.’ He was essentially saying, ‘I love this country.’\" \"I agree,\" co-host Sunny Hostin said. She brought up Trump’s \"I HATE TAYLOR SWIFT!\" post from September, alleging that Kelce remembers that and chose to be \"a diplomat\" in spite of it. \"I think he did the right thing by not giving in to this madness,\" Hostin declared. CLICK HERE TO GET THE FOX NEWS APP Whoopi Goldberg agreed as well, saying, \"I like that we’re not giving into the madness either, 'cause part of our job is not to feed that.\"","summary":"&quot;The View&quot; co-hosts praised Kansas City Chiefs star Travis Kelce for not trashing President Trump after hearing he may attend Sunday&apos;s Super Bowl game.","url":"https://www.foxnews.com/media/the-view-hosts-applaud-kansas-city-chiefs-star-travis-kelce-not-slamming-trumps-super-bowl-attendance","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/the-view-super-bowl.png?ve=1&tl=1","video":null,"publish_date":"2025-02-07 19:01:12","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":0.059},{"id":288204012,"title":"Is Kamala Harris gearing up for another run for office?","text":"Former Vice President Kamala Harris may not be done with politics yet. \n\nOn Thursday, Harris toured the devastating damage left by the deadly wildfires that ripped through Los Angeles area last month. Since leaving office, she has made few public appearances as she reportedly mulls what her political future may hold after losing to President Donald Trump in November. \n\nWhen speaking to reporters on Thursday, she was asked whether she would be making a run for governor of California. Gov. Gavin Newsom’s term is up in 2027, leaving the race wide open for potential contenders. \n\nHarris did not rule out running for the seat, instead focusing her comments on the relief efforts in California. \n\n“I have been home for two weeks and three days,” Harris told reporters. “My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them.”\n\nShe was later asked again if seeing the destruction left by the wildfires could impact her decision to run. \n\n“I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground,” she said.\n\nShortly after the election, Harris reportedly told her advisers and allies to “keep her options open,” Politico reported at the time. \n\n“... Whether for a possible 2028 presidential run, or even to run for governor in her home state of California in two years. As Harris has repeated in phone calls, ‘I am staying in the fight,’” per the report.\n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"What is Kamala Harris up to after losing to Donald Trump?","url":"https://www.nj.com/politics/2025/02/is-kamala-harris-gearing-up-for-another-run-for-office.html","image":"https://www.nj.com/resizer/v2/EBWMERXLSVBXPHRWUNJNNUVMR4.jpg?auth=e9654e479a74b755e4b47650d603935cc2e2b0ba5551f77204110025507511d2&width=1280&quality=90","video":null,"publish_date":"2025-02-07 18:54:44","author":"Lauren Sforza","authors":["Lauren Sforza"],"language":"en","category":"politics","source_country":"us","sentiment":-0.246},{"id":288192774,"title":"Weeks after quitting U.S. for UK, Ellen DeGeneres has already clashed with her neighbors; here's the reason why","text":"Comedian Ellen DeGeneres and her wife Portia de Rossi left the U.S. to begin a new life in the countryside of the United Kingdom, and she and her new British neighbors are reportedly at odds over plans for the construction of her new $18 million farmhouse.DeGeneres is already in danger of getting on the wrong side of a prominent member of her new neighborhood after she committed a 'technical breach' during the construction of a single-story extension at her new home, which the London-based newspaper the Daily Mail described as a planning clash.Five months before their relocation plans were made public, the former TV host and her 52-year-old wife are said to have bought the house in June. At the time, there were rumors that the couple would be relocating to the Cotswolds, a picturesque area about two hours from London.Three local council members expressed concern that DeGeneres and de Rossi's extension might increase flood risk in the village and disturb Roman remains, which appears to have dampened their fresh start across the pond, as quoted in a report by Realtor.According to reports, neighbors have voiced their opposition to deGeneres and de Rossi's extension plan on multiple occasions. Council documents seen by the Daily Mail reveal that the onus is on the owner to report any historic remains uncovered. Other residents expressed concern that the hedge and wire fence at the comedian’s home could lead to flooding if trash gets “caught in the fence” and limits the “flow across the field.” Despite the protests, a spokesperson for West Oxfordshire Direct Council insisted that the Roman remains sit over 200 yards from DeGeneres and de Rossi’s property and that the work was “completed to a high standard.”The reports come just weeks after a piece was published in Vanity Fair in which several unnamed locals from DeGeneres’ former community of Montecito accused her—along with Prince Harry and Meghan Markle—of driving up house prices in the area.In November, when news of DeGeneres and de Rossi’s move was first revealed, it was claimed by TMZ that their decision to get the hell out of the U.S. was cemented by Donald Trump’s victory in the 2024 election—despite the fact that they had purchased their home months earlier. DeGeneres was an outspoken supporter of Vice President Kamala Harris during the 2024 presidential election, publicly endorsing her in a post shared on Instagram back in August.FAQsWhy are Ellen's neighbors so upset?Some residents opposed her home extension, fearing it would increase flood risks and disturb Roman remains.Did Ellen break any building rules?Technically, yes. The extension violated development rights, but officials found it acceptable and closed the case without further action.","summary":"Ellen DeGeneres and Portia de Rossi's new life in the UK has hit a stumbling block after locals objected to their $18 million farmhouse extension.","url":"https://economictimes.indiatimes.com/news/international/uk/weeks-after-quitting-u-s-for-uk-ellen-degeneres-has-already-clashed-with-her-neighbors-heres-the-reason-why/articleshow/118033413.cms","image":"https://img.etimg.com/thumb/msid-118033911,resizemode-4,width-1200,height-900,imgsize-19518,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-07 18:51:30","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":-0.035},{"id":288183104,"title":"Dave Portnoy Says Swifties Are 'On The Right Side of History' After Kanye West Rant","text":"By the early morning of February 7, social media was on fire talking about Kanye West's all-night rant on X (formerly Twitter). But Dave Portnoy had his own take. Ignoring the content of the sordid posts — some of which topped 10 million views each — Portnoy instead took to X and Facebook with a message to Taylor Swift.\"Great morning for the Swifties,\" the Bar Stools Sports owner posted to his social media followers. \"Never gets old being on the right side of history.\"Since Portnoy was coy about what he was referring to, his comments quickly piled up with fans guessing he was referencing backlash to West's posts. Although West's 13-hour X rant never mentions Swift, 35, the rapper, 47, had engaged in a 10-year, one-sided feud with the pop star.Portnoy, meanwhile, has called himself \"King of the Swifties.\" On October 21, 2024, he posted a video of himself reading a personal thank you note Swift had her brother, Austin, hand-deliver him in the VIP tent of a Miami concert. This caused a stir since Portnoy endorsed Donald Trump, and Swift was an outspoken supporter of opposing candidate Kamala Harris. He first went viral as a Swiftie in October 2023, when he said on his BFFs podcast, \"I've never seen anybody try to suck up like she is to Taylor Swift.\" He was referring to Kim Kardashian, who was married to West when he started his feud with the Tortured Poets Department singer.West and Taylor's rivalry started in 2009, when West took to the MTV VMAs stage to interrupt Swift, who was accepting her award for Best Female Video. West took the microphone away from her to express that he thought Beyoncé should have won. Over the next few years, West continued to poke the star, often with the support of his then-wife Kardashian. For her part, Swift's only possible engagement was a song she released the year after the MTV Awards called \"Innocent.\"","summary":"The Taylor Swift fan took to social media after the rapper — who has tried to feud with Swift in the past — went on an all-night rampage.","url":"https://www.newsweek.com/entertainment/celebrity-news/dave-portnoy-social-media-swifties-kanye-west-rant-2028033","image":"https://d.newsweek.com/en/full/2583852/dave-portnoy.jpg","video":null,"publish_date":"2025-02-07 18:31:50","author":"Abby Tegnelia","authors":["Abby Tegnelia"],"language":"en","source_country":"us","sentiment":0.201},{"id":288176510,"title":"LA Times tells left-leaning opinion writers to publish fewer columns as staffers fume over ‘red-pilled’ owner: report","text":"The Los Angeles Times will reportedly slash commentary from its left-leaning opinion writers — and staffers are said to be fuming over the owner cozying up to President Trump.\n\nRobin Abcarian, Jackie Calmes and LZ Granderson were informed by their superiors that they are expected to publish one opinion piece per week rather than their usual two, according to a report in Oliver Darcy’s Status newsletter.\n\nAbcarian is a veteran LA Times columnist who writes about politics, culture and social issues. Her columns have traditionally appeared in the Wednesday and Sunday editions of the paper.\n\nCalmes’ opinion pieces normally focus on national politics and policy. Granderson’s columns explore the intersection of sports, culture and politics.\n\nStaffers at the newspaper suspect that the move to reduce the three writers’ weekly output is a byproduct of owner Dr. Patrick Soon-Shiong’s intent to ingratiate himself with Republicans and the White House, according to Status.\n\nEarlier this week, Soon-Shiong announced his intent to clean house at the LA Times by offering voluntary buyouts to staffers with over two years of tenure as well.\n\nLA Times staffers have reportedly been furious with Soon-Shiong over a recent interview he granted to Bari Weiss’ the Free Press, in which he acknowledged having taken the “red pill” — a reference to the film “The Matrix,” which, in current context, means becoming more aligned with Republicans.\n\nSoon-Shiong, who made his fortune in pharmaceuticals and biotechnology, told the Free Press that he regretted the newspaper’s endorsement of Los Angeles Mayor Karen Bass, the Democrat who has been widely criticized for her handling of the recent devastating wildfires.\n\nThe Times owner said the Bass endorsement was borne out of “confirmation bias” as well as “echo chambers” and “false assumptions” about race and politics among the newspaper’s staffers.\n\nAccording to Status, Soon-Shiong’s comments “infuriated staffers inside the Times” because the mogul “opted to trash the newspaper” at a time when reporters and editors were working around the clock to provide coverage of the aftermath of the wildfires.\n\n“His trashing of the newsroom at a moment when you all have done the most spectacular work is really something,” one staffer is reported to have written on the company’s internal Slack channel.\n\nAnother staffer chimed in: “The whole interview is kind of breathtaking.”\n\n“These comments, on top of the buyout notice, are extremely disheartening,” wrote another Times employee.\n\nThe barrage of criticism apparently prompted Soon-Shiong to attempt damage control, according to Status.\n\nOn Thursday, Soon-Shiong sent a three-paragraph note to the newsroom which read: “I am so proud of your work.”\n\nBut morale at the paper remains low, according to Darcy’s report.\n\n“People are in disbelief,” one Times staffer told Status. \n\n“Patrick’s public comments … were bad enough, but the buyout offer — especially the timing, given how tirelessly the newsroom has been working since the wildfires began — felt tone-deaf at best, and spiteful at worst.”\n\nThe Post has sought comment from the LA Times.\n\nSoon-Shiong caused internal turmoil weeks before the Nov. 5 election after he intervened to block his editorial board from publishing an endorsement of Trump’s Democratic opponent, former Vice President Kamala Harris — a move that mimicked that of Amazon founder and Washington Post owner Jeff Bezos.\n\nThe move angered thousands of LA Times readers — some of whom canceled their subscriptions. It also led to several writers quitting the newspaper’s editorial board.\n\nHe has also incorporated conservative voices into the editorial board to foster diverse perspectives.\n\nIn November, conservative commentator Scott Jennings joined the LA Times editorial board.\n\nJennings, a former adviser to President George W. Bush and a CNN pundit, was brought on to provide a conservative viewpoint that he argues is often underrepresented in mainstream media.","summary":"LA Times staffers have reportedly been furious with owner Dr. Patrick Soon-Shiong over a recent interview he granted to Bari Weiss's \"The Free Press.\"","url":"https://nypost.com/2025/02/07/media/la-times-tells-left-leaning-opinion-writers-to-publish-fewer-columns/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/lz-granderson-speaks-onstage-night-98059482.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-02-07 18:25:55","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","category":"politics","source_country":"us","sentiment":0.079},{"id":288171632,"title":"Elon Musk's TIME Magazine cover has everyone saying the same thing","text":"Elon Musk's TIME Magazine cover has everyone saying the same thing\n\nPODCAST: Get all the latest news and insider gossip on our new politics show – Welcome to MAGAland\n\nBy NIKKI SCHWAB, CHIEF CAMPAIGN CORRESPONDENT FOR DAILYMAIL.COM IN WASHINGTON, D.C.\n\nPublished: 17:39 GMT, 7 February 2025 | Updated: 18:13 GMT, 7 February 2025\n\nElon Musk gracing the cover of Time Magazine could spell disaster for the DOGE-running tech billionaire. \n\nTime's latest issue shows Musk sitting behind the Resolute Desk - where President Donald Trump should be positioned in the Oval Office. \n\n'No,' Trump first responded in the Oval Office Friday alongside Japanese Prime Minister Shigeru Ishiba when asked if he had a reaction to Musk's cover. 'Is Time Magazine still in business? I didn't even know that,' he then sarcastically replied.\n\nTrump had touted being named Time's Person of the Year last year. \n\n'Elon is doing a great job. He's finding tremendous fraud and corruption and waste,' the president added, pointing to the work the billionaire has done collapsing USAID. 'He's got a staff that's fantastic. He's wanted to do this for a long time.' \n\nIn February of 2017, Time Magazine put White House Chief Strategist Steve Bannon on the cover and asked the question: 'Is Steve Bannon the second most powerful man in the world?' \n\nAt the time, Bannon was labeled 'The Great Manipulator.' \n\nIn April 2017, The New York Times reported that Trump was still annoyed by the cover, telling people 'that doesn't just happen,' a term the president used when talking about underlings overshadowing him. \n\nBannon was out in August of that year. \n\nTime Magazine's latest cover shows Elon Musk sitting in President Donald Trump's place behind the Resolute Desk in the Oval Office \n\nPresident Donald Trump is captured seated behind the Resolute Desk in the Oval Office - in a similar position where Elon Musk is portrayed on the new Time magazine cover \n\nNow eight years later, Musk's cover is even more provocative - which prompted uh-ohs from a number of journalists and online observers. \n\nThe reporter talking to Trump in the Oval Office Friday even pointed out that Musk was sitting behind 'your Resolute Desk.' \n\nMusk, the richest person on the planet, has received just as much attention as Trump since the Republican was sworn back in on January 20th. \n\nDOGE's early actions - to take a wrecking ball to USAID, are chronicled in Time's piece about the billionaire's arrival in Washington. \n\nGovernment employees at the Department of Homeland Security told the magazine how they're assuming the 'defensive crouch' as they wait for DOGE to arrive. \n\nIn the aftermath of the Time's cover release, Musk was making his own moves. \n\n'I love @realdonaldtrump as much as a straight man can love another man,' he professed on X, the platform he acquired, on Friday morning. \n\nIn another Friday morning post, he cheered that Trump was the 'Greatest president ever!' \n\nMusk highlighted a post where Trump said he was going to end the 'ridiculous Biden push for Paper Straws, which don't work.' \n\n'BACK TO PLASTIC!' Trump wrote. \n\nMusk became an ardent MAGA supporter in July, as Trump survived an assassination attempt at a rally in Butler, Pennsylvania. \n\nA February 2017 Time cover reportedly annoyed Trump when it showcased then Chief White House Strategist Steve Bannon, labeling him 'The Great Manipulator' \n\nDAMAGE CONTROL? On Friday morning Elon Musk said that he loved President Donald Trump 'as much as a straight man can love another man' \n\nMinutes before he labeled Trump the 'Greatest President ever!' as the Republican is poised to sign an executive order barring paper straws\n\nThe billionaire SpaceX, Tesla and X boss endorsed Trump and then plowed millions into the Republican's reelection effort over Democratic nominee, Vice President Kamala Harris. \n\nDuring the transition, Musk rarely left Trump's side - even renting a $2,000-a-night cottage at Mar-a-Lago. \n\nDuring this time period, Vivek Ramaswamy - who has already exited as the co-leader of DOGE - and in turn Musk, started an online war with Bannon and other MAGA traditionalists over the use of H1-B visas. \n\nTrump appeared to take the tech entrepreneurs' side. \n\nMusk stirred up some more trouble when he trashed the AI project Stargate, which Trump announced from the White House on January 21, just one day after inauguration. \n\nThe DOGE leader isn't a fan of OpenAI CEO Sam Altman, one of the three tech leaders involved in the $500 billion project. \n\nA Republican close to the White House told Politico that some Trump staff was 'furious' at Musk for torching Stargate online. \n\n'It's clear he has abused the proximity to the president,' the Trump ally said. 'The problem is the president doesn't have any leverage over him and Elon gives zero f***s.' \n\nTrump was then asked about it. \n\n'He hates one of the people in the deal,' the president shrugged. \n\nSteve BannonPoliticsDonald TrumpElon Musk\n\nShare or comment on this article:\nElon Musk's TIME Magazine cover has everyone saying the same thing\n\nAdd comment","summary":"Time's latest issue shows DOGE leader Elon Musk sitting behind the Resolute Desk - where President Donald Trump should be positioned in the Oval Office.","url":"https://www.dailymail.co.uk/news/article-14373117/elon-musk-time-magazine-cover.html","image":"https://i.dailymail.co.uk/1s/2025/02/07/17/94978489-0-image-m-71_1738949375074.jpg","video":null,"publish_date":"2025-02-07 18:13:30","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":0.015},{"id":288182622,"title":"What Is Carried Interest? Trump Proposes Ending Wall Street’s Tax Break, Again.","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nPresident Donald Trump has proposed ending a tax break used by private equity fund managers known as the carried-interest “loophole,” echoing his earlier calls and efforts by other presidents, including Barack Obama and Joe Biden, to abolish the break that has faced bipartisan opposition for years.\n\nPrevious presidents have called to abolish the tax perk, including Barack Obama and Joe Biden.\nCopyright 2025 The Associated Press. All rights reserved\n\nWhite House Press Secretary Karoline Leavitt said Thursday that Trump met with Republican lawmakers to discuss his tax priorities, including ending “special tax breaks for billionaire sports team owners” and ending the carried-interest tax break.\n\nCarried interest is the percentage of a private equity’s investment profits that a fund manager or venture capitalist receives as compensation for their investment.\n\nThis compensation faces capital gains taxes as high as 20% instead of the federal income tax—which can be as high as 37%, depending on the person’s taxable income—allowing fund managers to receive more money.\n\nEnding carried interest could reduce the federal deficit by $13 billion through 2034, according to estimates by the Congressional Budget Office.\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\nHow Much Do Private Equities Earn In Carried Interest?\n\nPrivate equity firms hold billions in investments that are eligible for carried-interest compensation: Blackstone Inc. reported $6.3 billion at the end of 2024, KKR & Co. reported $7.9 billion and Apollo Global Management reported nearly $1.7 billion.\n\nWhat Has Trump Said About Carried Interest?\n\nIn 2015, Trump assailed hedge fund managers, claiming they “make a fortune, they pay no tax” while saying “they have to pay taxes.” Trump did not mention cutting carried interest during his latest presidential campaign, though in 2016, Trump said he would abolish the “carried interest deduction” and other “special interest loopholes.” The tax breaks benefitted Wall Street investors and “people like me,” but are “unfair to American workers,” Trump said. He reportedly told aides in 2017 that he wanted the loophole eliminated in a new tax bill, though it was not included after some Republicans opposed his demands.\n\nCould Carried Interest Be Eliminated?\n\nIt’s not immediately clear whether lawmakers would support cutting carried interest. In 2007, President George W. Bush indicated he would veto a Democrat-led bill to abolish the tax break, suggesting the proposal would have raised taxes on the middle class. President Barack Obama called to end carried interest in 2013 and 2015, but lawmakers reportedly did not reach a consensus on tax cuts. In 2022, a provision in the Inflation Reduction Act abolished the tax perk, though then-Democratic Sen. Kyrsten Sinema—who previously supported eliminating carried interest—said she would only approve the bill if the provision was cut. Vice President Kamala Harris campaigned on eliminating the tax break, suggesting carried interest would be taxed as ordinary income.\n\nKey Background\n\nThe “carried-interest loophole” has faced opposition from lawmakers and some billionaires for nearly two decades. Berkshire Hathaway CEO Warren Buffett—whose fortune is estimated at $148.4 billion—called on the Bush administration to eliminate the tax break in 2007, suggesting the “taxation system has tilted towards the rich and away from the middle class.” Nearly two dozen lawmakers wrote in support of carried interest in 2017, suggesting the tax break was “mischaracterized” as a loophole and its elimination would harm U.S. businesses. The National Venture Capital Association reportedly argued against eliminating carried interest, claiming in 2007 the incentive would “discourage long-term, high-risk investment” and be “extremely harmful to U.S. economic growth.”\n\nFurther Reading\nFtDonald Trump seeks to close tax loophole enjoyed by private equity groups\n\nFollow me on Twitter. Send me a secure tip. \n\nEditorial Standards\n\nForbes Accolades","summary":"Previous presidents have called to abolish the tax perk, including Barack Obama and Joe Biden.","url":"https://www.forbes.com/sites/tylerroush/2025/02/07/what-is-carried-interest-trump-proposes-ending-wall-streets-tax-break-again/","image":"https://imageio.forbes.com/specials-images/imageserve/67a64ce4c5be1b8a2805cf63/0x0.jpg?format=jpg&crop=1795,1009,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-02-07 18:12:35","author":"Forbes Staff,Ty Roush","authors":["Forbes Staff","Ty Roush"],"language":"en","category":"politics","source_country":"US","sentiment":-0.398},{"id":288173626,"title":"Trump praises Taylor Swift's boyfriend Travis Kelce before attending Super Bowl","text":"President Donald Trump has a history of \"Bad Blood\" with Taylor Swift, but that isn't stopping Travis Kelce, Swift's boyfriend, from laying down the welcome mat for the president ahead of Super Bowl weekend.The Kansas City Chiefs tight end said it would be \"awesome\" and a \"great honor\" for the president to attend the Super Bowl in New Orleans this Sunday, when the Chiefs will face off against the Philadelphia Eagles.\"No matter who the president is, I know I'm excited because it's the biggest game of my life,\" Kelce said on Wednesday. \"Having the president there — you know, it's the best country in the world, so it will be pretty cool.\"It will be the first time a sitting president has attended the Super Bowl. Trump said on Truth Social that he planned to give an interview before the game.Trump called Kelce the \"absolute best tight end in football (Ever!)\" in a post on Truth Social on Friday morning, adding that it will be a \"great game.\"The warm exchange between Trump and Kelce, however, comes months after the president announced his dislike of Swift, who endorsed Kamala Harris before the presidential election.\"I HATE TAYLOR SWIFT!\" he wrote in a Truth Social post in September.Swift has been a regular presence at Kelce's games and is widely expected to attend the Super Bowl on Sunday, putting the president and the popstar on a possible collision course.A spokesperson for Swift did not immediately respond to a request for comment.","summary":"After Kansas City Chiefs star Travis Kelce said it would be an \"honor\" to have Donald Trump at the Super Bowl, the president called him the \"best tight end in football.\"","url":"https://www.businessinsider.com/donald-trump-taylor-swift-travis-kelce-super-bowl-2025-2","image":"https://i.insider.com/67a648a1eb4be2fff9a3f3de?width=1200&format=jpeg","video":null,"publish_date":"2025-02-07 18:11:43","author":"Katie Balevic","authors":["Katie Balevic"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.24},{"id":288166888,"title":"'BACK TO PLASTIC': Trump slams Biden's paper straws, to sign executive order next week to undo ban","text":"US President Donald Trump on Friday (Feb 7) said that he would sign an executive order next week to undo a ban imposed by former President Joe Biden. Advertisment Trump said that he would end the \"ridiculous Biden push for Paper Straws\". In a post on Truth Social, the US president said, \"I will be signing an Executive Order next week ending the ridiculous Biden push for Paper Straws, which don\"t work. BACK TO PLASTIC!.\" AdvertismentAlso read: 'Hypocrite': Kamala Harris spotted shopping with husband, carrying plastic bags after supporting ban Biden announced a target to eliminate single-use plastic utensils like drinking straws by 2035 in government departments. Trump's move comes as the latest on environmental issues by the Republican president. Notably, Trump pulled out of the Paris climate change agreement soon after his inauguration for a second term. Advertisment Also read: Increase of plastic can cause autism? Here\"s what the latest study determined Musk reacts American billionaire Elon Musk also shared Trump's Truth Social post, calling him the \"greatest President ever\". Earlier during a campaign rally for the 2020 elections, Trump had shown his criticism of the growing trend of paper drinking straws. \"They want to ban straws. Has anyone tried those paper straws? They're not working too good,\" he said. Also read: EU to ban single-use plastic in cafes and restaurants by 2030 \"It disintegrates as you drink it, and if you have a nice tie like this tie, you've got no choice,\" Trump added. Moreover, his campaign team has also sold branded plastic straws with the slogan \"Liberal paper straws don't work.\" In 2019, Trump's campaign sold red plastic straws labeled with “Trump” as an alternative to the “liberal” paper straws, which he claimed were ineffective. Notably, Trump is expected to place over 160 environmental justice employees on paid leave as part of broader government restructuring efforts. (With inputs from agencies)","summary":"US President Donald Trump on Friday (Feb 7) said that he would sign an executive order next week to undo a ban imposed by former President Joe Biden. \n\n\nTrump said that he would end the \"ridiculous Biden push for Paper Straws\".\n\n\nIn a post on Truth Social, the US president said, \"I will be signing an Executive Order next week ending the ridiculous Biden push for Paper Straws, which don&rsquo;t work. BACK TO PLASTIC!.\" \n\n\n\n\n\n\n\nAlso read: 'Hypocrite': Kamala Harris spotted shopping with husband, carrying plastic bags after supporting ban\n\n\nBiden announced a target to eliminate single-use plastic utensils like drinking straws by 2035 in government departments. \n\n\nTrump's move comes as the latest on environmental issues by the Republican president. Notably, Trump pulled out of the Paris climate change agreement soon after his inauguration for a second term. \n\n\nAlso read: Increase of plastic can cause autism? Here&rsquo;s what the latest study determined\n\n\nMusk reacts\nAmerican billionaire Elon Musk also shared Tru","url":"https://www.wionews.com/world/back-to-plastic-trump-slams-bidens-paper-straws-to-sign-executive-order-next-week-undo-ban-8700621","image":"https://img-cdn.thepublive.com/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/02/07/ztAXZnL2hMmsIbgxMZr4.png","video":null,"publish_date":"2025-02-07 18:06:06","author":"Mansi Arora","authors":["Mansi Arora"],"language":"en","source_country":"in","sentiment":-0.232},{"id":288169580,"title":"McDonald's customers rejoice as Trump announces end to 'ridiculous' fast food law that everyone despised","text":"BREAKING NEWSMcDonald's customers rejoice as Trump announces end to 'ridiculous' fast food law that everyone despised\n\nREAD MORE: Shoppers stunned by import duties as Trump tariffs take effect\n\nBy TILLY ARMSTRONG DEPUTY CONSUMER EDITOR FOR DAILYMAIL.COM\n\nPublished: 17:42 GMT, 7 February 2025 | Updated: 18:02 GMT, 7 February 2025\n\nFast food fans are rejoicing as President Trump announced he would bring back plastic straws. \n\nIn the last several years, many major fast food companies, including McDonald's, have experimented with a move to paper alternatives for drinks.\n\nThis has been met by fierce backlash from some customers, who claim that paper straws do not work or affect the taste of their favorite beverages. \n\nIn a post on his social media platform Truth Social on Friday, the President wrote: 'I will be signing an Executive Order next week ending the ridiculous Biden push for Paper Straws, which don't work. 'BACK TO PLASTIC!'\n\n'Trump should be on Mt. Rushmore for this. I hate those paper straws,' one fan wrote on X following the news. \n\n'What a time to be alive,' another wrote. \n\nThe plastic versus paper straw debate has long been a contentious topic among Trump and his political opponents. \n\nIn 2019, Kamala Harris endorsed a potential ban on single-use plastic straws, which Trump's campaign at the time blasted as attempt by the left to restrict American freedom.\n\nFast food fans are rejoicing as President Trump announced he would bring back plastic straws\n\nTrump even began selling his own Trump-branded plastic straws as a result of the proposal by Democrats.\n\n'Liberal paper straws don't work. STAND WITH PRESIDENT TRUMP and buy your pack of recyclable straws today,' his website read.\n\nAt the time, several jurisdictions including California and Washington, D.C. were banning plastic straws due to environmental concerns.\n\nCalifornia instituted a restaurant ban on plastic straws in 2019, while companies like McDonald's, Wendy's and Starbucks began moving away from using them. \n\nRetail expert Neil Saunders told DailyMail.com President Trump is just making good on his various campaign promises, and one of those was to 'stop the green agenda from taking over every aspect of life.' \n\n'The issue of straws might seem small, but it's an emotive topic and a lot of people dislike the new paper varieties,' said Saunders, managing director at GlobalData retail.\n\nDuring the Biden administration starting in 2020, the former president worked to reduce plastic waste with the Environmental Protection Agency (EPA).\n\nAt the end of his presidency in November 2024, Biden announced a national strategy which supported a shift to more sustainable materials and supported efforts to reduce the use of plastic straws.\n\n'Liberal paper straws don't work,' Trump said in 2019 of paper straws\n\nThe Trump campaign sold packs of plastic straws for $15 in 2019\n\nIn the last several years, many major fast food companies, including McDonald's, have experimented with a move to paper alternatives for drinks (Pictured: Trump at a McDonald's restaurant in October 2024)\n\nAstonishing price rises that Trump tariffs will spark on everyday items\n\nThe vast majority of plastic ends up in land-fills, and companies cited the threat to oceans posed by single-use products.\n\nAccording to a study by National Geographic, 91 percent of plastic is not recycled. \n\nIt states that plastic takes 400 years to degrade, with 8.3 billion metric tons of plastic already having been produced by 2019.\n\nDespite some fast food fans praising Trump's proposal to go 'back to plastic', other Americans pointed out the potential environmental impact. \n\n'Does he not realize the damage plastic does to our oceans?' one user wrote on X. \n\n'Plastic is not good for the environment,' wrote another. \n\nSaunders pointed out that while Trump cannot command everyone to use plastic straws, or tell states how to handle the issue, he can set federal policies on the matter and therefore set a wider tone for the nation. \n\n'At the end of the day, people can still use what straws work best for them, and companies can decide their own policies,' he added.\n\nConsumer Finance\n\nShare or comment on this article:\nMcDonald's customers rejoice as Trump announces end to 'ridiculous' fast food law that everyone despised\n\nAdd comment","summary":"Fast food fans are rejoicing as Donald Trump said he would ban a 'ridiculous' fast food mandate.","url":"https://www.dailymail.co.uk/yourmoney/consumer/article-14373239/mcdonalds-customers-rejoice-trump-end-fast-food-law.html","image":"https://i.dailymail.co.uk/1s/2025/02/07/17/94979507-0-image-m-47_1738949653517.jpg","video":null,"publish_date":"2025-02-07 18:02:35","author":"Editor,Tilly Armstrong","authors":["Editor","Tilly Armstrong"],"language":"en","source_country":"GB","sentiment":-0.129},{"id":288176702,"title":"This is Nancy Pelosi's five-word reply on whether she would be able to repair her relationship with former first lady Jill Biden","text":"Nancy Pelosi is known for giving some short and sweet answers when asked tough questions, and this time it was posed around her relationship with former First Lady Jill Biden which had reportedly turned sour. She gave a quick and short reply about the fact of whether she would be able to mend her terms with the former First Lady, according to a Daily Mail report. Pelosi's terms with the BidensNancy Pelosi, a strong Democrat had been at odds with former First Lady Jill Biden after her backing of Kamala Harris, and the way she reportedly pushed Joe Biden out of the US Presidential election 2024 race. She even had to face a lot of backlash because of backing Kamala Harris who went on to face a massive defeat against Donald Trump in the US Presidential polls. Some even claimed that Pelosi backed the wrong candidate as Biden could have won the elections himself if he was the candidate till the end, according to earlier reports. This was the major point when Pelosi's terms turned sour with the Biden family. What did Pelosi reply?Nancy Pelosi replied with a 'Well, I certainly hope so,' when a reporter asked if there is any way her relationship could be mended with Joe and Jill Biden, but she also said that she has not been in touch with them recently, according to the Daily Mail UK report. FAQs:Is Nancy Pelosi a Democrat? Yes, Nancy Pelosi is a Democrat and has been part of the previous government administration led by Joe Biden. Did Nancy Pelosi support Kamala Harris?Yes, Nancy Pelosi supported Kamala Harris strongly during the US Presidential elections, which reportedly placed her in a poor light with the Biden family.","summary":"Nancy Pelosi has finally shed some light about the fact whether she would be able to repair her relationship with former First Lady Jill Biden. She gave a rather witty answer","url":"https://economictimes.indiatimes.com/news/international/us/this-is-nancy-pelosis-five-word-reply-on-whether-she-would-be-able-to-repair-her-relationship-with-former-first-lady-jill-biden/articleshow/118031754.cms","image":"https://img.etimg.com/thumb/msid-118031739,resizemode-4,width-1200,height-900,imgsize-1963764,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-07 17:48:38","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":-0.169},{"id":288161392,"title":"Kamala Harris' final humiliation as former VP sits in the cheap seats at Lakers game... and 'nobody even cared'","text":"Kamala Harris' final humiliation as former VP sits in the cheap seats at Lakers game... and 'nobody even cared'\n\nREAD MORE: Donald Trump makes bold Travis Kelce claim ahead of Super Bowl \n\nPODCAST: Get all the latest news and insider gossip on our new politics show – Welcome to MAGAland\n\nBy OLIVER SALT\n\nPublished: 17:38 GMT, 7 February 2025 | Updated: 17:40 GMT, 7 February 2025\n\nA crestfallen Kamala Harris arrived at an LA Lakers basketball game to very little fanfare on Thursday night - before making her way to the cheap section of the arena.\n\nHarris, who was trounced by Donald Trump in November's presidential election, attended the NBA fixture with husband Doug Emhoff as the Lakers faced her beloved Golden State Warriors in Los Angeles.\n\nYet in a final moment of humiliation for the ex-VP, footage from Crypto.com arena shows her walking several rows back to find her seat in front of the broadcast booth after not landing a VIP spot courtside.\n\nAnd as she makes her way to the very back of the section, the majority of spectators barely seem to notice an awkward Harris, who did smile and wave to one member of the crowd after seemingly being recognized in her home state.\n\nThe clip of her uncomfortable entrance quickly went viral on social media, with one user brutally concluding: 'Kamala Harris and Doug Emhoff arrive at the Lakers game. Pretty much nobody cared.'\n\n'Notice how no one in the crowd even gives a f**k…' said another.\n\nKamala Harris sat in the cheap seats while watching a Lakers game with husband Doug Emhoff\n\nKamala Harris sitting in front of @LAIreland & @champagnennuts at Lakers game @ESPNLosAngeles 🏀 pic.twitter.com/GxBKPs3ETw\n— Beto Durán (@DuranSports) February 7, 2025\n\nDonald Trump's secret vendetta against the NFL made him run for president, reveals Stephen A. Smith\n\nA third joked: 'Wow that was a thundering welcome.'\n\nWhile another commented: 'Just goes to show you how unpopular Kamala really is and how all the hoopla while she campaigned was completely fake.'\n\nComedian Jeff Dye also shared a zoomed-in video of Harris sitting in the cheap seats and captioned it: 'Kamala Harris is at the Lakers Warriors game in like row 58. Should’ve saved some of that money.'\n\nTo add to her woes, Harris' Warriors suffered a 120-112 defeat on the night against the Lakers. \n\nHarris was elevated from backup to then-president Joe Biden to the Democratic nominee in August, but failed to inspire her party to victory in the election three months later.\n\nTrump became only the second Republican to win the popular vote since 1988, while he also swept all seven key battleground states on his way to a dominant victory over the Democrats.\n\nHarris was barely recognized by fans as she walked several rows back to find her seat\n\nThe former vice president and her husband failed to land VIP spots at courtside for the game\n\nThough while she did lose the presidential race, Harris remains popular in her home state of California despite some voters in the state shifting to the right. \n\nIt's unclear whether the 60-year-old has plans to run for governor, as heading back to California and running for state-wide office could be seen as a backwards step in her political career after serving as vice president.\n\nDemocratic insiders fully expect her to run for president again in 2028, despite the fact her 106-day presidential campaign ultimately ended in a bruising defeat.\n\nHarris is already leading the race for the Democratic nomination again, largely thanks to her name recognition from the last campaign.\n\nA McLaughlin poll published in January revealed she leads with 33 percent over potential rivals Pete Buttigieg (nine percent) and Gov. Gavin Newsom (seven percent).\n\nLA LakersNBADonald Trump\n\nShare or comment on this article:\nKamala Harris' final humiliation as former VP sits in the cheap seats at Lakers game... and 'nobody even cared'\n\nAdd comment","summary":"Harris, who was trounced by Donald Trump in November's presidential election, attended the NBA game alongside husband Doug Emhoff as the Lakers faced her beloved Golden State Warriors.","url":"https://www.dailymail.co.uk/sport/nba/article-14373179/kamala-harris-nba-lakers-warriors-husband-doug-emhoff.html","image":"https://i.dailymail.co.uk/1s/2025/02/07/17/94977455-0-image-m-100_1738949722088.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/07/4366500511758566780/1024x576_MP4_4366500511758566780.mp4","publish_date":"2025-02-07 17:40:30","author":"Editor,Oliver Salt","authors":["Editor","Oliver Salt"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.005},{"id":288187878,"title":"Kanye West Bashes Jews, Admits He Controls His Wife, Praises Diddy, Calls Himself a 'Nazi,' Claims to be a 'God on Earth,' Insults Kamala Harris, Names Himself 'Yedolf Yitler' and More Outrageous Tweets From Kanye's 9-Hour Rant on X","text":"On the latest episode of wild things Kanye “Ye” West has said, the rapper took to X, going on an overnight rant about any and everything. He’s already made it clear he doesn’t care about backlash from his controversial statements or actions, but now, Ye is taking things to a new level that some fear he can never come back from.\n\n Starting off strong, West fully admitted to having “DOMINION” over his wife, Bianca Censori. On X, Ye tweeted “THIS AINT NO WOKE AS FEMINIST SH*T SHES WITH A BILLIONAIRE,” speaking of his wife. This follows the couple’s highly criticized appearance at the Grammys red carpet. Censori made headlines for her completely see through dress, and according to Ye, it was all part of his plan. \n\n“YES I DONT MAKE HER DO NOTHING SHE DOESNT WANT TO BUT SHE DEFINITELY WOULDNT HAVE BEEN ABLE TO DO IT WITHOUT MY APPROVAL,” he tweeted. \n\nKanye didn’t stop there. Shockingly, the Chicago rapper called himself a nazi, saying “I LOVE HITLER NOW WHAT B*TCHES” and flat out confessing “IM A NAZI.” \n\nAnd to make matters even worse, West went on a full tirade bashing Jewish people, doubling down on his past antisemitic remarks, and even calling out Elon Musk for stealing his “NAZI SWAG AT THE INAUGURATION,” he tweeted. “YOOOO MY GUY GET YOUR OWN THIRD RALE.” He continued tweeting:\n\n“N*GGAS NEWSFLASH WHITE PEOPLE AND JEWISH PEOPLE ARE DIFFERENT YOU CAN GET MONEY WITH JEWISH PEOPLE BUT THEY ALWAYS GONNA STEAL AND INVITE YOU OVER TO THEY HOUSE ON FRIDAY WHITE PEOPLE DO NOT F*CK WITH N*GGAS THEY LEAVE THAT TO THE JEWS IF YOU THINK YOU GETTING MONEY WITH A WITH A WHITE PERSON ITS NOT TRUE THAT SO CALLED WHITE PERSON IS ACTUALLY JEWISH JEWS HATE WHITES BECAUSE OF THE GERMANS FROM WORLD WAR 2\"\n\nThe platform has since flagged West’s antisemitic posts citing hate speech, but as of right now, all of his tweets are still up for the public to see. Quotes and replies to him largely criticize the rapper and even beg him to stop tweeting completely. But the “Graduation” rapper says he doesn’t care about anyone trying to censor him or call him out. “I AINT ADJUSTING NOTHING I DO OR SAY FOR ANYBODY WHO HAS ENOUGH TIME ON THEIR HANDS TO SIT AND TALK ABOUT WHAT THE F*CK I WRITE,” he said. “I DONT GIVE A F*CK WHAT ANYONE LIKES EVERYTHING I DO OR MAKE IS SELF SERVING.”\n\nAnd speaking of not caring what anyone thinks, Kanye took the time to pledge his support for disgraced Hip-Hop mogul Sean “Diddy” Combs, saying “PUFF WE LOVE YOU.” He even tagged President Donald Trump, begging him to help “PLEASE FREE MY BROTHER PUFF.”\n\nLater, he admitted his call to free Diddy “IS COMPLETELY SELFISH.” He continued saying “I NEED TO FIND WHOEVER BEEN TRYING TO OUT BLACK MOGULS.”\n\nBut wait... there’s even more! Kanye addressed his past social media posts sexualizing former Vice President Kamala Harris. Now, Ye says “I DONT KNOW KAMALA AND I AINT GOT NOTHING AGAINST THAT LADY SHE WAS JUST BEING USED FOR WHAT THEY CALL ‘THE BLACK VOTE.’”\n\nAt one point, West even bragged about denying pics for “Make A Wish” patients. “I TURNED DOWN 3 PHOTOS THIS WEEK WITH MAKE A WISH KIDS IN WHEELCHAIRS,” he said. \n\nThe rest of his tweets consisted of offensive slurs, calling out fans and disrespecting Black people, Jewish people, women, all while emphasizing how no one can control him. We’re not sure what exactly sparked Ye’s nine hour rant, but it seems like he’s done... for now at least.","summary":"On the latest episode of wild things Kanye “Ye” West has said, the rapper took to X, going on an overnight rant about any and everything. He’s already made it clear he doesn’t care about backlash from his controversial statements or actions, but now, Ye is taking things to a new level that some fear he can never come…\n\nRead more...","url":"https://www.theroot.com/kanye-west-bashes-jews-admits-he-controls-his-wife-pr-1851758048","image":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/6ffd7e146f40f5d13cbe4b3806cb264a.jpg","video":null,"publish_date":"2025-02-07 17:38:00","author":"Phenix S Halley","authors":["Phenix S Halley"],"language":"en","source_country":"US","sentiment":-0.305},{"id":288160606,"title":"NY Post editorial board says CBS needs to ‘clear out the partisan rot’ by booting top producer","text":"The New York Post’s editorial board declared that CBS News could start to fix it’s \"lefty-propaganda problem\" by cutting ties with \"60 Minutes\" executive producer Bill Owens. Earlier this week, Federal Communication Commission (FCC) Chairman Brendan Carr knocked CBS News' conduct following the release of the network's unedited transcript of its \"60 Minutes\" interview with then-Vice President Kamala Harris. It showed that CBS News had aired only the first half of her response to \"60 Minutes\" correspondent Bill Whitaker's question about Israeli Prime Minister Benjamin Netanyahu not \"listening\" to the Biden administration in a preview clip that aired on \"Face the Nation,\" but aired only the second half of her response during the primetime special. In October, President Trump filed a $10 billion lawsuit against CBS News alleging election interference over its handling of the \"60 Minutes\" interview, accusing the network of aiding his Democratic rival through deceptive editing just days before the election. FCC RELEASES CBS NEWS' RAW ‘60 MINUTES’ TRANSCRIPT FROM KAMALA HARRIS INTERVIEW The New York Post’s editorial board believes changes need to occur at CBS News as a result. \"Like all too many legacy media operations, it needs to clear out the partisan rot. It can start by booting ‘60 Minutes’ head producer Bill Owens, who has made all too many bad calls,\" the Post’s editorial board wrote. \"Most obviously, to slice-and-dice the Harris interview, cutting down one word-salad answer after another into seemingly coherent responses,\" the editorial board continued. \"Owens told his staff that the interview editing was ‘perfectly fine’ and that ‘the company knows I will not apologize for anything we have done.’\" The Post editorial board said \"hiding the true (incoherent!) nature of a favored presidential candidate\" is \"deception,\" not journalism. \"And viewers likely never would’ve never known about the deception if CBS hadn’t released her full response to one question in a promo,\" the board added. ‘60 MINUTES’ TRANSCRIPT AT CENTER OF TRUMP'S LAWSUIT AGAINST CBS IS VITAL TO INVESTIGATION, FCC CHAIR SAYS The Post’s editorial board feels whether the footage is \"legit grounds for President Trump’s lawsuit over the deceptive editing is another matter,\" but it is certainly a headache for CBS’ parent company as it seeks a merger with Skydance Media. \"Owens also oversaw a badly biased ‘60 Minutes’ report on the Gaza war that not only advanced the lie that Israel was blocking aid, but withheld the extremist affiliations of the advocates it showed claiming Washington was ‘complicit,’ in helping the Jewish state (supposedly) violate international law,\" the editorial board wrote. Earlier this year, the American Jewish Committee (AJC), the global advocacy organization for the Jewish people, slammed \"60 Minutes\" for a segment, \"Dissent within the State Department over U.S. Role in Israel-Hamas War.\" The group said \"60 Minutes\" played \"directly into the hands of the enemies of the West who aim to show that support for Israel is not in the United States’ best interest.\" \"This segment, the latest example of major news outlets recklessly reporting on Israel's defensive war against Hamas, was shockingly one-sided, lacked factual accuracy, and relied heavily on misguided information,\" the AJC wrote. \"Perhaps most egregiously, the segment made almost no mention of Hamas’ actions that started this war, placing Palestinian civilians in Gaza in harm’s way for years by embedding weapons and other terrorist infrastructure in civilian areas,\" the Jewish advocacy group added. \"The segment only briefly referred to Hamas’ massacre on October 7, 2023, described their fighters as \"militants\" rather than terrorists, and even went so far as to elevate the outlandish notion that, following Hamas’ October 7 attack, Israel should have sought to make peace with Hamas terrorists rather than act in self-defense.\" FCC CHAIR CALLS CBS NEWS' CONDUCT 'HARD TO EXPLAIN' FOLLOWING RELEASE OF KAMALA HARRIS INTERVIEW TRANSCRIPT Between the Harris interview and the Israel-Hamas segment, The New York Post has seen enough. \"Axing Bill Owens won’t magically restore CBS News’ reputation; Americans’ trust in mainstream media is at an all-time low for a lot of reasons. But ousting the shameless partisans from power is a necessary start,\" the editorial board wrote. CBS News did not immediately respond to a request for comment. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital’s Joseph A. Wulfsohn contributed to this report.","summary":"The New York Post’s editorial board declared that CBS could start to fix it’s &quot;lefty-propaganda problem&quot; by cutting ties with &quot;60 Minutes&quot; executive producer Bill Owens.","url":"https://www.foxnews.com/media/ny-post-editorial-board-says-cbs-needs-clear-out-partisan-rot-booting-top-producer","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/image0-22.jpeg?ve=1&tl=1","video":null,"publish_date":"2025-02-07 17:30:36","author":"Brian Flood","authors":["Brian Flood"],"language":"en","source_country":"US","sentiment":-0.552},{"id":288159894,"title":"‘The View’ Praises Travis Kelce For His Response To Trump Attending The Super Bowl: “He Did The Right Thing”","text":"Travis Kelce got an official stamp of approval from The View table this morning. The ladies collectively praised the Kansas City Chiefs tight end for his remarks about President Donald Trump‘s plans to attend the Super Bowl this Sunday (Feb. 9), where he will become the first sitting president to do so. \n\nKelce was asked about his reaction to Trump’s planned attendance by a reporter on Wednesday (Feb. 5), and replied, “That’s awesome. It’s a great honor.” \n\nHe added, “No matter who the president is, I know I’m excited because it’s the biggest game of my life, and having the president there, and it’s the best country in the world.” \n\nOf course, Trump has been vocal about his distaste for Kelce’s girlfriend Taylor Swift — who endorsed President Joe Biden in 2020 and Kamala Harris in 2024 — and even once posted on social media, “I HATE TAYLOR SWIFT!”\n\nHowever, The View wasn’t mad that Kelce didn’t diss Trump. Instead, his words pleased the Hot Topics table, and even self-professed “Taylor Swift fan” Alyssa Farah Griffin, who said she’s “not mad about it.” \n\n“I thought it was pure, totally classy and diplomatic answer, and it’s his big day to be playing,” she said, adding, “The presidency is bigger than any one person. He is proud that the president of the United States is there, I don’t know that it’s any kind of statement about Donald Trump, specifically.”\n\nAna Navarro argued that if Kelce had said anything inflammatory, it would have affected his team on one of the biggest days of their careers. “Imagine though, if he had said something about Trump, it would have been taken out on his team, and all the hate that his team would receive as they’re heading into the Super Bowl,” she said. \n\nSara Haines agreed, noting, “Anything else he said would have made it about something else and not about them. He’s dressed in his uniform … you’re representing more than yourself. He made a point of saying, ‘I love this country.'”\n\nAs for Sunny Hostin , she said those words were “a tell” from Kelce, who comes from a “very loving” family who is “very protective over their women.” By saying he loved the country but not saying he loved the president, Hostin believed Kelce was sending a subtle message while keeping everything civil. \n\n“I’m pretty sure that Travis Kelce knows that [Trump hates Swift],” Hostin said. “He was being a diplomat, and I think he did the right thing by not giving in to this madness.” \n\nWhoopi Goldberg, of course, kept it simple. She praised Kelce by saying, “The kid did well, I think.” \n\nThe View airs weekdays at 11/10c on ABC.","summary":"\"The kid did well.\"","url":"https://decider.com/2025/02/07/the-view-praises-travis-kelce-response-trump-super-bowl/","image":"https://decider.com/wp-content/uploads/2025/02/Kelce-AFG.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/gT1wHkaQ-QVS3bn7S.mp4","publish_date":"2025-02-07 17:11:19","author":"Greta Bjornson,mliss1578","authors":["Greta Bjornson","mliss1578"],"language":"en","source_country":"us","sentiment":0.068},{"id":288160076,"title":"Senate confirms ‘Project 2025’ co-writer Russel Vought as Trump’s Budget Director","text":"The US Senate has confirmed the appointment of Russel Vought as Director of the Office of Management and Budget. Vought is known for co-authoring ‘Project 2025,’ the potential threat of which was cited by the Kamala Harris campaign. Vought also served as Trump’s OMB director in 2020 before being appointed in an acting or deputy capacity.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/senate-confirms-project-2025-co-writer-russel-vought-as-trumps-budget-director/videoshow/118030159.cms","image":"https://img.etimg.com/thumb/msid-118030159,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-118030159,imgsize-55764.cms","publish_date":"2025-02-07 17:00:11","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.293},{"id":288199978,"title":"Media Giants Settling With Donald Trump Are Setting a “Dangerous” Precedent","text":"The three cases have appalled legal scholars, journalists, and First Amendment advocates because the settlements appear to be motivated less by the strength of Trump’s arguments than by the fear of much worse to come. The concern is that Trump is using the power of the presidency, and the threat of extracting even greater pain, to strongarm his targets. “No president has ever been as overt about his goal of using as many levers of punishment as possible” to intimidate news organizations and their parent companies, said RonNell Andersen Jones, a University of Utah law professor. The corporate capitulation, she told me, is “shortsighted and dangerous.”\nEver since he began to attract media attention in the 1980s, Trump has sued or threatened to sue news organizations. Until late last year, however, he had little to show for it. Trump has never won a defamation suit outright; the Constitution and state libel laws generally protect the press, setting a high bar for celebrities and public figures to prove harm in court. But Trump doesn’t have to go to trial to bring would-be adversaries to his terms. It’s no coincidence that Disney and Meta have settled since Election Day, and Paramount has come to the table. As president, Trump’s leverage has increased exponentially.\nTrump sued ABC News last March, claiming anchor George Stephanopolous had defamed him during a TV interview by saying Trump had been found liable for “rape” in E. Jean Carroll’s civil trial. The trial judge later said the jury’s finding of “sexual abuse” amounted to rape “as many people commonly understand the word.” But Disney bailed on the matter a week before Christmas, just as Stephanopolous was to be deposed. The news blindsided and shocked ABC’s journalists: “No one [at Disney] said a thing to us,” one employee told me. “We had to read about it just like you.”\nTrump’s lawsuit against Meta involved his allegation that the company had violated his First Amendment rights in 2021 by locking his Facebook and Instagram accounts, an action the company took as a result of Trump’s role in sparking the January 6, 2021 riot at the US Capitol. Meta restored his accounts in early 2023, but the lawsuit rolled on; the settlement was announced nine days into Trump’s second term.\nParamount’s discussions with Trump reportedly began soon after he sued CBS News and 60 Minutes at the end of October. He alleged at the time that the news program had engaged in “election interference” by deceptively editing clips of its interview with Kamala Harris. That allegation appears to have little basis in fact. CBS released the full transcript and interview footage this week, which validated what the network has long maintained: That its editing didn’t alter the substance of Harris’s responses to correspondent Bill Whitaker, despite Trump’s claims to the contrary. The network used one part of Harris’s response to a question in a piece that aired on Face the Nation, then used another part of the same answer on 60 Minutes, a routine bit of editing in TV news.\nIn a Thursday segment, CNN’s Jake Tapper highlighted how TV networks edit interviews while arguing that Paramount, in settling, “would be hoisting a white flag of surrender,” and essentially saying that its news division “will not speak truth to power,” but “acquiesce to power at the expense of truth.”\nThe concern that Trump might weaponize the federal bureaucracy is well-founded. During his first term, the Justice Department sued AT&T and Time Warner—CNN’s parent company—to block their merger on antitrust grounds. The companies ultimately beat the rap, but the litigation created uncertainty for both parties, drove up their legal costs, and delayed the merger’s completion.\nParamount and Disney are aware, too, that Trump has an aggressive ally in Carr, his newly appointed FCC chairman. In a chapter he contributed to Project 2025—the conservative blueprint for an overhaul of the federal government—Carr proposed reforming the regulations surrounding Big Tech. But he clearly has his eyes on Big Media too. Among his first official acts last month, Carr reinstated a conservative organization’s petition for investigations into CBS, NBC, and ABC. The petition echoed allegations Trump made in his lawsuits against ABC and CBS.\nEven after CBS responded by releasing the full 60 Minutes transcript, the FCC investigation remains open. Paramount continues to discuss settling Trump’s lawsuit.\nNotably, Carr’s Democratic predecessor, Jessica Rosenworcel, had dismissed this petition in her final days as chair, saying the FCC shouldn’t be “the president’s speech police [and] the FCC should not be journalism’s censor-in-chief.” But Carr reversed Rosenworcel’s decision, deeming the matter worthy of further investigation. A Democratic FCC commissioner, Anna Gomez, blasted Carr’s actions as “a retaliatory move” designed to “instill fear” in the networks. Carr, she added, has “shown a concerning pattern of implementing the will of the administration on issues that go far beyond our core responsibilities.”\nIt isn’t just Democrats like Gomez who find Carr’s conduct troubling. In an interview with VF, Al Sikes, a former Republican FCC chairman, called Carr’s revival of the network complaint “shocking.” The FCC has historically avoided rendering judgments about news coverage, Sikes said, out of respect for broadcasters’ First Amendment rights. “In my time, we stayed out of the free-speech business,” he told me.\nSikes has his own vested interest in this issue. He is a member of a group that in 2023 asked the FCC to deny Fox Corp.’s renewal of its license to operate its TV station in Philadelphia. Sikes’s group argued that Fox’s senior management, including controlling shareholders Rupert and Lachlan Murdoch, lacks the requisite “character” to hold the license in view of Fox News’s extensive promotion of Trump’s election lies in 2020 and 2021. Rosenworcel dismissed the complaint when she left the agency last month. Carr declined to put it back into play, despite reviving the complaints against ABC, CBS, and NBC (the FCC didn’t respond to requests for comment).\nCarr’s restoration of the complaint against CBS appears likely to increase the pressure on the network’s parent company, Paramount, to settle Trump’s lawsuit—a possibility that has enraged CBS’s journalists, just as Disney’s settlement enraged those at ABC News. Bill Owens, the executive producer of 60 Minutes, privately told his staff this week that he would not apologize for the Harris interview, according to The New York Times. When Trump filed the suit last year, a CBS spokesman said the company would “vigorously defend against it.”\nNo one’s talking that way now, at least not in public. In fact, as Paramount engages in peace talks with Trump, no one is talking at all. A Paramount spokesperson, Justin Dini, told me this week that the company had no comment about the lawsuit.\nBezos’s The Washington Post notably spiked the paper’s endorsement of Harris in October, a move many readers interpreted as Trump-friendly. Amid a blizzard of subscription cancellations, Bezos seemed to double down. He, too, publicly congratulated Trump on winning reelection. Amazon also contributed $1 million to his inauguration.\nAnother multibillionaire mogul, Los Angeles Times owner Patrick Soon-Shiong, has also become a visible Trump cheerleader. Soon-Shiong killed his newspaper’s endorsement of Harris three days before Bezos did. He later publicly congratulated Trump on winning and praised him for his response to the Southern California wildfires. Soon-Shiong lately has been a prominent booster of Trump’s controversial Health and Human Service nominee, Robert F. Kennedy Jr., tweeting 18 times over four days on Kennedy’s behalf. A medical doctor and inventor, Soon-Shiong has an extracurricular interest in staying on Trump’s sunny side: He has three drug applications requiring approval by the Food and Drug Administration. (His spokesperson didn’t return a request for comment.)\nSo far, there’s no sign of settlement in other lawsuits Trump has pending against journalists and related organizations. The list includes complaints against investigative reporter Bob Woodward and his book publisher, Simon & Shuster; the Pulitzer Prize board (for recognizing reporting on Trump); and the Des Moines Register and its pollster, Ann Selzer (for a preelection poll giving Harris the edge in Iowa.)\nAppeasing Trump may make practical sense for chief executives obligated to maximize profits and protect shareholders’ interests. But doing so represents a historical retreat, said Sonja West, a University of Georgia law professor who specializes in First Amendment issues. For decades, she told me, confident (and well-heeled) news organizations fought vigorous legal battles to protect their rights and to defend their reporting. Nowadays, however, the news industry isn’t so confident or so well-heeled. “What we’re seeing today is a concerning shift in that dynamic,” she said. Paying off the president to settle his meritless claims is a losing strategy, and will only invite more of the same, she suggested. “Our democracy depends on the press to serve as a check on powerful people,” West said, “not just to cut them checks for millions of dollars.”","summary":"Disney and Meta have already shelled out $40 million to the president since Election Day, with Paramount in talks to settle Trump’s 60 Minutes suit. It’s a “concerning shift,” says one legal expert, from news outlets historically battling in court over the First Amendment.","url":"https://www.vanityfair.com/news/story/media-donald-trump-paramount-disney-meta","image":"https://media.vanityfair.com/photos/67a5011a04bf6ec41e960b94/16:9/w_6496,h_3654,c_limit/vf225-trump-media-lawsuits.jpg","video":null,"publish_date":"2025-02-07 16:48:11","author":"Paul Farhi","authors":["Paul Farhi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.451},{"id":288159730,"title":"Patrick Mahomes Debunks Trump’s Weird Lie About His College Career","text":"Donald Trump will become the first sitting president to attend the Super Bowl on Sunday, and he’s spent the run-up to the big game talking out of his ass about the game that famously spurned him when he tried to buy a team in the 1980s.\n\n Trump threw a nod to Sen. Tommy Tuberville (R-Ala.) on Wednesday while signing an executive order intended to ban trans women from competing in women’s sports, claiming that when Tuberville was a college football coach, “his quarterback was Mahomes” and that Tuberville told Trump that Mahomes “made me into a great coach.”\n\n Patrick Mahomes will attempt to lead the Kansas City Chiefs to their third straight Super Bowl championship this weekend, and has already established himself as one of the greatest quarterbacks of all time despite only playing in the NFL for seven full seasons.\n\n Mahomes had a distinguished collegiate career at Texas Tech, but Tuberville never coached him. Mahomes was the school’s quarterback from 2014-2016; Tuberville left the school following the 2012 season. Tuberville’s tenure with the school came after his far-more-notable run with Auburn, which he coached to a national title, so even if he did coach Mahomes at Texas Tech, which he didn’t, the idea that the quarterback would have “made [him] into a great coach” is ridiculous.\n\n Trump’s lie about Tuberville forced the senator into an awkward situation while appearing on former Fox News host Megyn Kelly’s show later in the day. “Since you used to coach Patrick Mahomes, does this mean you’re rooting for the Chiefs at the big game this Sunday?” Kelly asked.\n\n “Well, I never even coached him,” Tuberville said. “What happened is, I recruited him, and then I left and went to another school. But, I got to be very good friends with him.”\n\n But Tuberville didn’t recruit Mahomes, either, nor did they become good friends. Take it from Mahomes himself, who was asked about Tuberville while doing press ahead of the Super Bowl. “Uhhh, he did not recruit me at the time,” Mahomes said. “I don’t remember if I ever got to meet him or not.”\n\n Trump has a history of glomming onto star quarterbacks, and regularly gushed about Tom Brady while the New England Patriots were winning Super Bowls. He’s now doing what he can to sidle up to Mahomes. The day after his absurd lie about Tuberville coaching Mahomes, Trump congratulated Mahomes and his wife Brittany, who has expressed support for Trump’s policies, on the birth of their third child. “This is what I call a baby with great genes, both mother and father,” Trump wrote on Truth Social. “It’s happy times in the wonderful Mahomes family. See you all on Sunday!”\n\n Mahomes’ new daughter, Golden Raye, was born nearly a month before Trump’s post.\n\n Trump kept the football content coming on Friday. “Two great Quarterbacks in this game,” he wrote on Truth Social. “Also, an unbelievable running back, and the absolute best tight end in football (Ever!). Incredible coaching! If they would only get rid of that really weird looking new Kickoff ‘deal,’ which actually makes football more dangerous, they would be doing everybody, especially the fans, a big favor. ANYWAY, IT WILL BE A GREAT GAME!!! I’ll be doing the interview, before the game, at 3:00 P.M. There hasn’t been one in four years (Gee, I wonder why?).”\n\n The kickoff “deal” to which Trump is referring is a new formation requirement the NFL implemented this year in order to reduce the potential for injury. “It actually is incredibly promising,” NFL Commissioner Roger Goodell said of the rule change in October. “We’re seeing lower impacts that have led to less severe injuries and less number of injuries. So I think it’s working.” \n\n Trump is right about Travis Kelce, though, who is indeed one of the greatest tight ends to ever play the game. Kelce is dating Taylor Swift, who will also be in attendance on Sunday — and who famously endorsed Kamala Harris for president last September, angering Trump.\n\n “I HATE TAYLOR SWIFT!” the president wrote in response.","summary":"The president is trying to burnish is football bona fides and cozy up to the Chiefs quarterback before the Super Bowl","url":"https://www.rollingstone.com/politics/politics-news/patrick-mahomes-debunks-trump-weird-lie-tommy-tuberville-1235259985/","image":"https://www.rollingstone.com/wp-content/uploads/2025/02/trump-football-mahomes.jpg","video":null,"publish_date":"2025-02-07 16:46:16","author":"Ryan Bort","authors":["Ryan Bort"],"language":"en","category":"politics","source_country":"us","sentiment":-0.062}]}