{"offset":0,"number":50,"available":272,"news":[{"id":358356626,"title":"‘The President did this’: Horror at key Trump decision","text":"01:08Learn MoreXShareFacebookX/TwitterCopy URLCopied URL to clipboard\n\n SUBSCRIBER ONLYThis video is available for subscribers only. Subscribe or log in to watch.'The President did this': Key Trump decision roastedOne of Donald Trump's former political allies, Republican Chris Christie, has ripped into him over his decision to install an anti-vaxxer at...\n\nHighlightsSep 07, 20257:37 PMDemocratic presidential contender rules himself out7:07 PM'Be quiet': Trump gets tetchy with reporter6:57 PM'The President did this': Former Trump ally blasts himWelcome to another week in US politics. This is our live coverage.Donald Trump has popped up at the men’s final of the US Open. The President copped boos from the crowd, but also some cheers, particularly during the national anthem.Mr Trump didn’t watch the whole match – he walked out about an hour-and-a-half in – but the President returned to his seat shortly before it ended.There was some mild controversy, ahead of time, because the tournament asked broadcasters not to cut to Mr Trump between points and games.He was briefly shown after Carlos Alcaraz won the title, though. Surrounded by clapping people, he did not applaud, instead adjusting his pants and blazer while looking rather morose. Perhaps he was cheering for Jannik Sinner.Or maybe he was just bored.00:14XLearn MoreMorevideos\n\n ShareFacebookX/TwitterCopy URLCopied URL to clipboardSUBSCRIBER ONLYThis video is available for subscribers only. Subscribe or log in to watch.Fans notice Trump's salty reaction to AlcarazDonald Trump wasn't stoked with Carlos...Elsewhere, the talking heads in America continue to fight over last week’s testimony, to Congress, from the Health and Human Services Secretary, Robert F. Kennedy Jr.Mr Trump rewarded Mr Kennedy, a quite notorious anti-vaxxer and conspiracy theorist, with the job heading up America’s federal health system after he ended his independent presidential campaign last year and endorsed Mr Trump instead of Democrat Kamala Harris.Mr Kennedy’s appearance at a congressional hearing was often testy and bad-tempered, as various senators grilled him on his reorientation of the Health Department to make it more hostile to vaccines.“You look at that appearance before Congress and it just confirms what all of us around this table have known for decades: Robert F. Kennedy Jr is a foolish man, full of foolish, vapid ideas,” former New Jersey governor Chris Christie, a Republican and one-time ally of Mr Trump, said on the ABC program This Week today.He lamented that a “wholly unqualified man” had been put in charge “of 25 per cent of government spending”.“The President did this. He knows. The President’s smart enough to know RFK Jr doesn’t belong in that job,” said Mr Christie.“But after he won, he wanted to show everybody, ‘I can do whatever I want to do, because this Senate will be compliant no matter what I do, and I’ll put the greatest vaccine and public health denier of the last 20 years in charge of public health in America.’“It’s a human middle finger to everybody who opposed him.”37 minutes ago HIGHLIGHT Democratic presidential contender rules himself outSamuel ClenchOne of the names being floated as a potential presidential nominee for the Democrats in 2028, Maryland Governor Wes Moore, has explicitly ruled himself out.We’ll see whether that commitment holds two or three years from now. He wouldn’t be the first to reject the idea, only to turn around and enthusiastically pursue it shortly afterwards.But Mr Moore told the NBC program Meet the Press that he harboured no such ambitions.“Do you rule out a run for president, Governor?” host Kristen Welker asked him. More ⌄7:07 PMSep 07, 2025 HIGHLIGHT 'Be quiet': Trump gets tetchy with reporterSamuel ClenchA reporter has asked Donald Trump about this social media post from the weekend.Very normal behaviour. The context here is that Mr Trump has threatened to send the National Guard into Chicago to help law enforcement combat crime, a legally dubious move, and one local leaders say they don’t want.Also, he just signed an executive order which seeks to rename America’s Department of Defence the Department of War, which was the name of its precursor until the late 1940s.“Are you trying to go to war with Chicago?” a reporter asked Mr Trump today, as he departed the White House to watch the tennis. More ⌄6:57 PMSep 07, 2025 HIGHLIGHT 'The President did this': Former Trump ally blasts himSamuel ClenchThe talking heads in America continue to fight over last week’s testimony, to Congress, from the Health and Human Services Secretary, Robert F. Kennedy Jr.Donald Trump rewarded Mr Kennedy, a quite notorious anti-vaxxer and conspiracy theorist, with the job heading up America’s federal health system after he ended his independent presidential campaign last year and endorsed Mr Trump instead of Democrat Kamala Harris.Mr Kennedy’s appearance at a congressional hearing was often testy and bad-tempered, as various senators grilled him on his reorientation of the Health Department to make it more hostile to vaccines.“You look at that appearance before Congress and it just confirms what all of us around this table have known for decades: Robert F. Kennedy Jr is a foolish man, full of foolish, vapid ideas,” former New Jersey governor Chris Christie said on the ABC program This Week today. More ⌄6:51 PMSep 07, 2025Trump pops up at US Open tennis finalSamuel ClenchHere we are, at the start of another week.President Trump attended the men’s final of the US Open today. He copped boos from the crowd, but also some cheers, particularly during the national anthem.Mr Trump didn’t watch the whole match – he walked out about an hour-and-a-half in – but the President returned to his seat shortly before it ended.There was some mild controversy, ahead of time, because the tournament asked broadcasters not to cut to Mr Trump between points and games. For … some reason? I can tell you there was no hesitation at all about showing other celebrities in the crowd at every available opportunity. More ⌄Read related topics:Donald TrumpMore related storiesUS PoliticsTrump says it’s time for US to punish RussiaThe US President has declared he is ready to make Russia pay a hefty price after it pommeled Ukraine with its largest air strike since the war began.Read moreUS PoliticsWild new Trump theory changes everythingA wild new theory has been swirling about US President Donald Trump that could change everything we know about the way he runs the country.Read moreUS PoliticsUS in denial as leaders crumble publiclySpeculation over Donald Trump’s health threatens to mask an embarrassing truth about America’s politics – one that goes far beyond one man.Read more","summary":"One of Donald Trump’s former political allies has ripped into him over his decision to install an anti-vaxxer at the top of America’s health system.","url":"https://www.news.com.au/world/north-america/us-politics/us-politics-live-donald-trump-blasted-by-former-ally-for-picking-wholly-unqualified-vaccine-denier-to-run-americas-health-system/live-coverage/bc7079806268a3d736dbd78a56967f4c?from=rss-basic","image":"https://content.api.news/v3/images/bin/0cd29011a20ecea057154f0c625fa046","video":null,"publish_date":"2025-09-08 00:15:18","author":"Samuel Clench","authors":["Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.15},{"id":358360854,"title":"Maryland Democrat reveals on whether he'll run for president in 2028","text":"Maryland Governor Wes Moore (D) shocked NBC \"Meet the Press\" host Kristen Welker on Sunday with his announcement about whether he intends to run for president in the 2028 election. Speculation has swirled that Moore would run for president, and the Maryland governor is up for reelection in 2026. When asked if Moore intends to serve a full term if reelected, he said yes. When Welker pressed if he would not be running for president, Moore ruled out a presidential run in the next election. \"Yes, I'm going to be serving a full term. I'm excited about re-election. I'm exciting about what I'm gonna be able to do for the people of Maryland,\" Moore said. KAMALA HARRIS' MAJOR CALIFORNIA ANNOUNCEMENT TRIGGERS CIRCULAR DEM FIRING SQUAD \"Do you rule out a run for president, governor?\" Welker shot back. \"Yeah, I'm not running for president,\" Moore replied. \"You rule it out? Yes. You completely rule it out?\" Welker asked. Moore proceeded to list his accomplishments as governor and said he looks forward to continuing to work leading Maryland. DOUG SCHOEN: WHY AOC COULD TAKE THE WHITE HOUSE IN 2028 AND KAMALA HARRIS WON'T \"I'm so excited about what we're doing, that we've gone from 43rd in the country in unemployment to now one of the lowest unemployment rates. We've had amongst the fastest drops in violent crime anywhere in the United States of America. Our population is growing, Maryland is moving, and so I'm really excited about going back in front of the people of my state and asking for another term,\" Moore said. Maryland’s unemployment rate was 3.4% as of July 2025, slightly higher than the previous month, but tied for 14th lowest among all 50 states. Baltimore saw 201 homicides in 2024, according to police data. Its homicide rate represented a ten-year low. However, Maryland’s violent crime rate was 17.1% higher than the national average. Moore was just one of several names speculated to run for the Democratic nomination in 2028, other prominent Democrats thought to be potential candidates include Illinois Gov. J.B. Pritzker, California Gov. Gavin Newsom, former Secretary of Transportation Pete Buttiegieg and 2024 Democratic nominee Kamala Harris. New York \"squad\" Rep. Alexandria Ocasio-Cortez is also thought to be mulling a presidential run. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE A recent Emerson poll found Newsom leading the pack with 25% of respondents saying that they would back him in the 2028 primary, with Pete Buttigieg getting 16% support and Harris garnering only 11%. However, 23% of respondents said they were undecided. Moore was not included in the poll. CLICK HERE TO GET THE FOX NEWS APP","summary":"Governor Wes Moore tells Meet the Press he will serve his full Maryland gubernatorial term and will not run for president in the 2028 election cycle.","url":"https://www.foxnews.com/media/maryland-democrat-reveals-whether-hell-run-president-2028","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/09/WesMoore1.jpg","video":"https://www.foxnews.com/video/6378730661112","publish_date":"2025-09-08 00:00:36","author":"David Spector","authors":["David Spector"],"language":"en","category":"politics","source_country":"us","sentiment":-0.199},{"id":358361912,"title":"Why do so many Republicans think Trump is more liberal than he is?","text":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics.\n\nBack in June 2015, it wasn’t easy to pin down President Donald Trump’s politics. \n\nThe celebrity businessman spent most of his public life discussing money, rather than policy. He hopped between parties, voted irregularly, and never truly committed to a single ideology. No surprise, then, that Americans weren’t sure what box to put him in.\n\nFour years in the White House changed that. And since his return to the White House earlier this year, Trump has doubled down on a hard-right agenda—rolling back protections for LGBTQ+ people, cutting deals that benefit the wealthy, dismantling DEI initiatives, and pushing policies that are both anti-democratic and anti-Democratic. Whatever ambiguity existed a decade ago is long gone.\n\nRelated | Trump's just fine with queer kids killing themselves\n\nAnd yet, a sizable share of Republicans still see Trump very differently. A late August YouGov poll shows just how off the mark GOP voters are about his record. According to the survey, 35% of Republicans think Trump supports raising the minimum wage, 45% believe he backs stronger worker protections, 26% say he favors higher corporate taxes, and just 29% think he’d raise taxes on the wealthy.\n\nIn reality, Trump’s record runs the other way. His administration moved to strip minimum wage and overtime protections from 3.7 million home-care and domestic workers. He killed a plan to stop employers from paying disabled workers less than the $7.25-an-hour federal minimum wage. And his sweeping tax and budget plan—officially called the The One Big Beautiful Bill Act—is expected to deliver the largest transfer of wealth from working-class Americans to the ultrawealthy in U.S. history. \n\nThe disconnect is striking. Democrats and independents are much more accurate in gauging Trump’s positions. The same YouGov poll found only 9% of Democrats and 17% of independents believe Trump supports stronger worker protections. Just 10% of Democrats and 18% of independents think he favors raising the minimum wage.\n\nIn other words, Democrats and independents generally see Trump for who he is. Republicans, not so much.\n\nSo why the misperception? Grant Reeher, a professor of political science at Syracuse University, said it comes down to polarization and “expressive bias.” \n\n“I imagine what’s happening among many Republicans is that they start with the notion that they are supporters of Trump,” Reeher told Daily Kos. “Then, when they are asked what he wants to do in those specific policy areas, they choose what they would like to see happen, and assume that’s also what Trump wants to do, because they support Trump.” \n\nThat’s the polarization effect at work.\n\nExpressive bias takes it further. Popular policies—like raising the minimum wage or taxing corporations—are often attributed to Trump by Republicans who want to reinforce their support. \n\n“Some of them may recognize that raising the minimum wage, improving worker conditions, and raising the tax on corporations are popular positions, and then assert that Trump wants to do those things—again because they support Trump and want to show that support, rather than stating that Trump wants to do something less popular,” Reeher said.\n\nReeher added that some Republicans may be connecting dots that don’t actually line up. For example, seeing Trump’s tough talk on immigration or manufacturing as proof that he wants to raise wages.\n\n“Some voters seem to translate Trump’s rhetoric into policies he doesn’t actually support—like assuming support for blue-collar workers means raising the minimum wage, or that calling out corporations means taxing them,” Reeher said.\n\nRelated | Trump’s tariffs hit his blue-collar backers where it hurts\n\nThis isn’t entirely new. Democrats were privately fuming about it during the 2024 campaign. A New York Times/Siena College survey that September found just under one-in-three (32%) likely voters thought Trump was “too conservative,” compared with 47% who said former Democratic presidential nominee Kamala Harris was “too liberal.” It was a striking data point, one that helped reinforce the narrative that Trump was a more moderate option than Harris—even as his actual record said otherwise.\n\nWe saw shades of the same phenomenon in 2021, when millions of Americans insisted the 2020 election was “stolen.” For many, the claim was less about genuine belief in voter fraud and more about signaling allegiance to Trump. \n\nAs Reeher put it, this kind of bias isn’t necessarily about facts—it’s about expressing loyalty.\n\nFraming matters too. People like the idea of “worker protections” in theory, but they may not connect that principle to actual policies. Moves like weakening OSHA rules, loosening child labor restrictions, or undermining wage standards don’t sound like “pro-worker” positions when spelled out plainly. It’s easier for supporters to say Trump is “for workers” in the abstract, even when his policies cut against them in practice. \n\nBy contrast, Democrats’ policy positions are far less muddled in the public mind. The same YouGov survey found adults across the political spectrum generally understood where Democrats stand: 86% of Democrats, 65% of independents, and 63% of Republicans knew that Democrats want to increase the minimum wage. Similar majorities across partisan groups also knew Democrats want to raise taxes on corporations and the wealthy. Even if voters don’t always like Democrats’ positions, they tend to know what they are.\n\nThat’s what makes Republicans’ perception of Trump so revealing. If GOP voters truly believe he’s more liberal than he is, it suggests two things: Either Republicans want policies like higher wages and stronger worker protections but don’t realize Trump opposes them, or they don’t know enough about his record to notice the gap between rhetoric and reality.\n\n“Many polls over recent decades have suggested that the public is generally supportive of more liberal policies when those policies are described in objective ways,” Reeher said. “Whether that means Republicans should adopt those policies is a more complicated question—historically, they have been arguing for a more conservative approach.”\n\nThe bigger issue here is a lack of political literacy. Most voters don’t follow the fine print of economic or labor policy closely enough to see where the parties really split. That gap makes it easy for misperceptions to take hold—and for partisan loyalty and Trump’s branding to fill in the blanks. \n\nJohn Mark Hansen, a professor of political science at the University of Chicago, told Daily Kos that with unions representing just 6% of private-sector workers, very few Americans hear consistently pro-worker messaging outside of partisan politics. Into that void, Trump has filled the space with performative stunts that sound worker-friendly. But when it comes to actual policy, his record tells a different story. \n\n“Most people have very limited information about policies, particularly in areas that don’t affect them,” Hansen said. “Partisans tend to fall back on party talking points when they don’t know or care much. How else did a chest-thumping party of Russia haters come to champion Putin as America’s best friend?”\n\nIn the end, the polling says less about Trump’s policies than about how voters see themselves reflected in him. What this survey and other surveys suggest is that Trump supporters project their own preferences onto him—even when those preferences are at odds with his actual record. That gap between perception and reality isn’t just a quirk of polling—it’s a feature of today’s politics: Facts often take a back seat to identity.\n\nAny updates?\n\n Fresh polling from the Wall Street Journal–NORC shows Americans sinking deeper into economic gloom. Only 25% say they have a good chance of improving their standard of living—the lowest share since the survey began in 1987. Nearly eight in 10 (78%) doubt the next generation will be better off, and close to 70% say the American dream either never existed or no longer does, the most skepticism recorded in 15 years. The discontent cuts broadly across gender, age, education, and income. Still, the outlook isn’t entirely bleak. Forty-four percent now describe the economy as excellent or good, an uptick from 38% a year ago. Yet most adults—56%—continue to rate conditions as poor, underscoring how Trump’s economic policies are weighing on public sentiment.\n\n Over the holiday weekend, rumors circulated that Trump had died—claims the president himself said earlier this week he had heard nothing about. While Trump remains very much alive, his health has come under scrutiny after he was seen with bruising on the back of his right hand and swelling around his ankles. Ongoing questions about his age and fitness have led some voters to wonder if he’s fully capable of handling the job as president. A YouGov poll found that 59% of adults believe Trump’s health and age affect his ability to do the job, at least somewhat, while about a quarter (26%) say it hasn’t affected him at all. As expected, opinions vary sharply along party lines, with Republicans much less likely to see an impact. Still, if a transition were necessary, most GOP voters trust Vice President JD Vance: 75% of Republicans told YouGov that he is qualified to take over, compared with just 10% of Democrats.\n\n Trump and his allies have been blunt about wanting women—especially white women—to have more kids. And new Gallup polling shows that even with falling birth rates, Americans still like the idea of bigger families. A plurality now says the “ideal” family size is two or three children—down from three or four back in 1935—but the point is clear: People still want families, despite Republican talking points suggesting otherwise.\n\nAs of midday Friday, 44.3% of the Americans approved of Trump, while 51.3% disapproved—a net approval rating of -6.9 points, after rounding, according to election analyst Nate Silver’s polling average.","summary":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics.\n\n\n\n\nBack in June 2015, it wasn’t easy to pin down President Donald Trump’s politics. \n\n\n\nThe celebrity businessman spent most of his public life discussing money, rather than policy. He hopped between parties, voted irregularly, and never truly committed to a single ideology. No surprise, then, that Americans weren’t sure what box to put him in.\n\n\n\nFour years in the White House changed that. And since his return to the White House earlier this year, Trump has doubled down on a hard-right agenda—rolling back protections for LGBTQ+ people, cutting deals that benefit the wealthy, dismantling DEI initiatives, and pushing policies that are both anti-democratic and anti-Democratic. Whatever ambiguity existed a decade ago is long gone.\n\n\n\n\nRelated | Trump's just fine with queer kids killing themselves\n\n\n\n\nAnd yet, a sizable share of Republicans stil","url":"https://www.dailykos.com/story/2025/9/7/2341813/-Why-do-so-many-Republicans-think-Trump-is-more-liberal-than-he-is?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1474989/story_image/SurveySaysAP25246582994149.png?1757107391","video":null,"publish_date":"2025-09-07 23:00:10","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":-0.253},{"id":358347328,"title":"Trump attends U.S. Open as Rolex's guest despite Swiss tariffs","text":"President Donald Trump attended the U.S. Open on Sunday (September 7, 2025) and briefly stepped out from a luxury box to wave at a main court crowd mostly still arriving for the men’s final. He drew mixed cheers and boos.\n\nArthur Ashe stadium was only partially full, and Mr. Trump’s waves weren’t announced beforehand. They were also brief enough so that some of those in attendance didn’t notice them. \n\nThe President attended as a guest of Rolex despite imposing steep tariffs on the Swiss watchmaker’s home country, and organisers were seeking to keep booing of him from being seen on the TV broadcast. \n\nMr. Trump has built the bulk of his second term’s domestic travel around attending major sports events rather than hitting the road to make policy announcements or address the kind of large rallies he so relished as a candidate. \n\nBecause of extra security screening, the final between second-seeded Carlos Alcaraz, a 22-year-old Spaniard, and No. 1 seed and defending champion Jannik Sinner, 24, of Italy, was pushed back half an hour — meaning Mr. Trump arrived more than 45 minutes before the new start time. \n\nThe President was watching from Rolex’s suite, and his acceptance of Rolex’s invitation came mere weeks after the Trump administration imposed a whopping 39% tariff on Swiss products. \n\nThe levy is more than 2 1/2 times higher than the one the Mr. Trump administration agreed to for European Union goods exported to the U.S. and nearly four times higher than on British exports to the U.S. It has raised questions about Switzerland’s ability to compete with the 27-member bloc that it neighbours. \n\nThe White House declined to comment on Mr. Trump accepting a corporate client’s invitation at the tournament, but the President has had few qualms about blurring lines between political and foreign policy decisions and efforts to boost the profits of his family business. \n\nThat includes tirelessly promoting cryptocurrency interests and luxury golf properties around the country and the world that bear his name. He announced on Friday (September 5, 2025) that the U.S. will use its turn hosting the Group of 20 summit in December 2026 to stage the sweeping event at Trump National Doral in South Florida. \n\nAny negative reaction to Mr. Trump’s presence won’t be shown on ABC’s national telecast, per standard policy, the U.S. Tennis Association says. “We regularly ask our broadcasters to refrain from showcasing off-court disruptions,” the organisation said in a statement. \n\nAs heavy rains began mostly clearing, and throngs of fans arrived for the match, no major street protests against the president could be seen from the tournament’s main stadium. Attendees also steered clear of wearing any of the president’s signature “Make America Great Again” caps, though. \n\nA 58-year tennis fan originally from Turin, Italy, came from her home in the Boston area to watch the final and said that when she bought a U.S. Open cap, she went with a fuchsia-hued one so it wouldn’t be mistaken for the signature darker colour of MAGA hats. “I was careful not to get the red one,” said the fan, who declined to give her name because of her employer’s rules about being publicly quoted. \n\nAttending with Mr. Trump were White House press secretary Karoline Leavitt, Attorney General Pam Bondi, Treasury Secretary Scott Bessent, special administration envoy Steve Witkoff and Susie Wiles, the White House chief of staff. \n\nElsewhere in the crowd were a slew of celebrities — some of whom publicly backed then-Vice President Kamala Harris during last year’s election against Mr. Trump. Among them were Pink, Bruce Springsteen, Shonda Rhimes, Michael J. Fox, Sting, Shaggy, Ben Stiller and Courtney Cox. \n\nMr. Trump came back to the press cabin on Air Force One during the flight to New York to note that the plane would be flying over Ashe stadium but didn’t offer any further comment. \n\nMr. Trump was once a U.S. Open mainstay but hasn’t attended since he was loudly booed at a quarterfinals match in September 2015, months after launching his first presidential campaign. \n\nThe Mr. Trump Organisation once controlled its own U.S. Open suite, which was adjacent to the stadium’s television broadcasting booth, but suspended it in 2017, during the first year of Mr. Trump’s first term. The family business is now being run by Mr. Trump’s sons with their father back in the White House. \n\nMr. Trump was born in Queens, home of the U.S. Open, and for decades was a New York-area real estate mogul and, later, a reality TV star. Attending the tournament before he was a politician, he usually sat in the suite’s balcony during night matches and was frequently shown on the arena’s video screens. \n\nIn recent years, however, including between his presidential terms, Mr. Trump primarily lived at his Florida estate, Mar-a-Lago. \n\nAlcaraz said before the final that having Mr. Trump on-hand would be a privilege and “great for tennis,” but also suggested that such sentiment went for any president watching from the stands. “I don’t want myself to be nervous because of it,” he said. \n\nThe President has also frequently attended sporting events — where the roar of the crowd sometimes features people booing him while others cheer him. \n\nSince returning to the White House in January and prior to Sunday’s (September 7, 2025) U.S. Open swing, Mr. Trump went to the Super Bowl in New Orleans and the Daytona 500, as well as UFC fights in Miami and Newark, New Jersey, the NCAA wrestling championships in Philadelphia and the FIFA Club World Cup final in East Rutherford, New Jersey. \n\nHaving a sitting president attend the U.S. Open hasn’t happened since Bill Clinton went to the 2000 tournament, though former President Barack Obama and his wife, Michelle, attended the event’s opening night in 2023.","summary":"The President was watching from Rolex’s suite, and his acceptance of Rolex’s invitation came mere weeks after the Trump administration imposed a whopping 39% tariff on Swiss products","url":"https://www.thehindu.com/news/international/trump-attends-us-open-as-rolexs-guest-despite-swiss-tariffs/article70023870.ece","image":"https://th-i.thgim.com/public/incoming/bykq3o/article70023873.ece/alternates/LANDSCAPE_1200/2025-09-07T214923Z_549807563_UP1EL971O9GNA_RTRMADP_3_TENNIS-USOPEN.JPG","video":null,"publish_date":"2025-09-07 22:34:49","author":null,"language":"en","source_country":"in","sentiment":0.022},{"id":358343744,"title":"Jack Schlossberg, grandson of JFK, takes first step toward running for Congress","text":"Jack Schlossberg, a writer and political commentator who also happens to be the grandson of late president John F. Kennedy, announced Sunday that he has formed an exploratory committee for a potential congressional run. \n\nIn his first step toward a formal political career, Schlossberg, 32, said in a brief X post that he had formed the group, which will likely determine whether or not Schlossberg could successfully run to replace New York Representative Jerry Nadler. \n\nNadler, a Democrat, represents New York City’s 12th district, which includes Midtown and Uptown Manhattan. He announced last week he would not seek re-election after more than three decades in Congress.\n\nSchlossberg, a native New Yorker, became national news last year when he used his social media influence to advocate for former vice president Kamala Harris’s election campaign. He also became a political correspondent for Vogue during that time, and currently hosts a political commentary show on YouTube.\n\nThe 32-year-old, who was educated at Yale and Harvard, belongs to one of the country’s most famous political dynasties, the Kennedys. His mother is Caroline Kennedy, a former ambassador and Democratic activist. She is the only surviving child of JFK.\n\nSchlossberg’s cousin first-removed is Health and Human Services Secretary Robert F. Kennedy Jr., whom he has repeatedly criticized on social media for spreading health misinformation.\n\nSchlossberg has been trolling RFK Jr. online, launching unsubstantiated claims at him, such as accusing the Trump Cabinet secretary of being a “Russian spy.”\n\nBut the political “nepo baby” appears keen to enter the family business by making a formal bid to become an elected representative. \n\nTypically, the first step in announcing a campaign is forming an exploratory committee, which allows potential candidates to raise money and hire staff without having to report activity to the Federal Election Commission. \n\nExploratory committees, also known as “testing the waters” committees, give candidates more time before making a formal campaign announcement. \n\nSchlossberg is already well known in Democratic circles, thanks to his family’s famous name. But his exploratory committee announcement puts him in a crowded field of many potential Nadler successors.\n\nNew York Assembly member Micah Lasher, largely considered Nadler’s heir, has filed a formal campaign with the FEC. \n\nLiam Elkind, a 26-year-old co-founder of Invisible Hands – a nonprofit dedicated to delivering food or medicine to those unable to acquire it themselves -- has also announced he would seek to replace Nadler.\n\nNadler himself has brushed off Schlossberg as an unserious candidate. \n\n“There’s nothing particularly good or bad about a Kennedy holding my seat, but the Kennedy, unlike Schlossberg, should be somebody with a record of public service, a record of public accomplishment, and he doesn’t have one,” Nadler told CNN.","summary":"Schlossberg has made a name for himself, mostly online, by serving as a political correspondent for Vogue and attacking his relative, Health Secretary RFK Jr.","url":"https://www.independent.co.uk/news/world/americas/us-politics/jack-schlossberg-jfk-election-congress-b2821911.html","image":"https://static.independent.co.uk/2025/09/07/21/53/GettyImages-2172637552.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/alNlnU8M-4VHSaSK0.mp4","publish_date":"2025-09-07 22:09:14","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":0.435},{"id":358339526,"title":"Trump’s US Open visit sparks boos and long security queues","text":"US President Donald Trump attended the US Open on Sunday and was booed by the crowd at the men’s final, which was delayed due to the extra security associated with his visit.\nThe final still featured long queues of fans waiting to get in when play began.\nWearing a suit and red tie, Trump briefly emerged from his suite about 45 minutes before the match started and heard a mix of boos and cheers from an Arthur Ashe Stadium, which was still mostly empty.\nNo announcement preceded his appearance and it was brief enough that some in the crowd missed it.\nTrump appeared again to more boos before the National Anthem. Standing in salute, the president was shown briefly on the arena’s big screens during the song and offered a smirk that briefly made the boos louder.\nWhen the anthem was over, the Republican pointed to a small group of supporters seated nearby, then sat on the suite’s balcony to watch the match intently.\nHe barely applauded, even following major points that energised the rest of the crowd as Spain’s Carlos Alcaraz took on No 1 seed and the tournament’s defending champion Jannik Sinner, 24, of Italy.\nTrump was shown on the big screen again after the first set ended and elicited louder boos. He raised his left fist in salute as the noise continued.\nOrganisers delayed the start of the match by half an hour to give people more time to pass through Secret Service screening checkpoints reminiscent of security at airports. Still, thousands of increasingly frustrated fans remained in line outside waiting to get inside well past the start of play.\nMany seats, especially those in upper rows, stayed empty for nearly an hour.\n\nThe Secret Service in a statement said that protecting Trump “required a comprehensive effort” and noting that it “may have contributed to delays for attendees.”\n“We sincerely thank every fan for their patience and understanding,” the statement said.\nTrump attended the final as a guest of Rolex, despite imposing steep tariffs on the Swiss watchmaker’s home country.\nThe US Tennis Association also tried to limit negative reaction to Trump’s attendance being shown on ABC’s national telecast, saying in a statement before play began: “We regularly ask our broadcasters to refrain from showcasing off-court disruptions.”\nThe reactions to Trump did not ultimately constitute major disruptions, though.\nGoing to the US Open was the latest example of Trump having built the bulk of his second term’s domestic travel around attending major sports events rather than hitting the road to make policy announcements or address the kind of large rallies he so relished as a candidate.\nSince returning to the White House in January and before Sunday’s US Open swing, Trump went to the Super Bowl in New Orleans and the Daytona 500, as well as UFC fights in Miami and Newark, New Jersey, the NCAA wrestling championships in Philadelphia and the Fifa Club World Cup final in East Rutherford, New Jersey. Some of those crowds cheered him but people booed him at other events.\nThe president accepted Rolex’s invitation despite his administration imposing a whopping 39 per cent tariff on Swiss products. That is more than two-and-a-half times higher than levies on European Union goods exported to the US and nearly four times higher than on British exports to the US.\n\nThe White House declined to comment on Trump accepting a corporate client’s invitation at the tournament, but the president has had few qualms about blurring lines between political and foreign policy decisions and efforts to boost the profits of his family business.\nHe has tirelessly promoted his cryptocurrency interests and luxury golf properties, and even announced that the US will host the Group of 20 (G20) summit in December 2026 at his Doral golf resort in Florida.\nNo major street protests against Trump could be seen from the tournament’s main stadium on Sunday.\nAmong those attending with Trump were White House Press Secretary Karoline Leavitt, Attorney General Pam Bondi, Treasury Secretary Scott Bessent, special envoy Steve Witkoff and Susie Wiles, the White House chief of staff. Trump spent various portions of the match engaged in conversation with many of those around him.\nElsewhere in the crowd were a slew of celebrities – some of whom publicly backed then-vice-president Kamala Harris during last year’s election. Among them were Pink, Bruce Springsteen and Shonda Rhimes. In prematch interviews shown on large stadium screens with the likes of Martha Stewart and Jon Hamm, the questions asked stuck to tennis and pop culture – not Trump and politics.\nThe president nonetheless was excited enough about his trip to tell reporters on Air Force One during the flight to New York when the plane flew over Ashe stadium – though the covered roof kept those inside from reacting.\nTrump was once a US Open mainstay but had not attended since he was booed at a quarter-final match in September 2015, months after launching his first presidential campaign.\nThe Trump Organization once controlled its own US Open suite, which was near the stadium’s television broadcasting booth, but suspended it in 2017 during the first year of Trump’s first term.","summary":"US President Donald Trump attended the US Open on Sunday and was booed by the crowd at the men’s final, which was delayed due to the extra security associated with his visit.\nThe final still featured long queues of fans waiting to get in when play began.\nWearing a suit and red tie, Trump briefly emerged from his suite about 45 minutes before the match started and heard a mix of boos and cheers from an Arthur Ashe Stadium, which was still mostly empty.\nNo announcement preceded his appearance and...","url":"https://www.scmp.com/news/world/united-states-canada/article/3324675/trumps-us-open-visit-sparks-boos-and-long-security-queues","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/09/08/b061af2f-d36e-47c9-9f75-dd30aaa36ae8_2ce5571a.jpg","video":null,"publish_date":"2025-09-07 21:42:47","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.038},{"id":358332570,"title":"Trump's US Open visit sparks boos, long security lines","text":"New York, Sep 7 (AP) President Donald Trump attended the US Open on Sunday where he was booed by the crowd at the men’s final clash, which was delayed due to the extra security associated with his visit.\nThe final still featured long lines of attendees waiting to get in when play began.\nWearing a suit and long, red tie, Trump briefly emerged from his suite about 45 minutes before the match started and heard a mix of boos and cheers from an Arthur Ashe stadium, which was still mostly empty. No announcement proceeded his appearance, and it was brief enough that some in the crowd who were there missed it.\nTrump appeared again to more boos before the National Anthem. Standing in salute, the president was shown briefly on the arena’s big screens during the song, and offered a smirk that briefly made the boos louder.\nWhen the anthem was over, the Republican pointed to a small group of supporters seated nearby, then sat on the suite’s balcony to watch the match intently.\nHe mostly didn’t applaud, even following major points that energised the rest of the crowd as Spain’s Carlos Alcaraz, 22, took on No. 1 seed and the tournament’s defending champion Jannik Sinner, 24, of Italy.\nTrump was shown on the big screen again after the first set ended, and elicited louder boos. He raised his left fist in salute as the noise continued.\nOrganisers delayed the start of the match by half an hour to give people more time to pass through Secret Service screening checkpoints reminiscent of security at airports. Still, thousands of increasingly frustrated fans remained in line outside waiting to get inside well past the start of play.\nMany seats, especially those in upper rows, stayed empty for nearly an hour.\nThe Secret Service in a statement said that protecting Trump “required a comprehensive effort”, noting that it “may have contributed to delays for attendees”.\n“We sincerely thank every fan for their patience and understanding,” the statement said.\nTrump attended the final as a guest of Rolex, despite imposing steep tariffs on the Swiss watchmaker’s home country.\nThe US Tennis Association also tried to limit negative reaction to Trump’s attendance being shown on ABC’s national telecast, saying in a statement before play began: “We regularly ask our broadcasters to refrain from showcasing off-court disruptions.” The reactions to Trump didn’t ultimately constitute major disruptions, though.\nGoing to the US Open was the latest example of Trump having built the bulk of his second term’s domestic travel around attending major sports events rather than hitting the road to make policy announcements or address the kind of large rallies he so relished as a candidate.\nSince returning to the White House in January and prior to Sunday’s US Open swing, Trump went to the Super Bowl in New Orleans and the Daytona 500, as well as UFC fights in Miami and Newark, New Jersey, the NCAA wrestling championships in Philadelphia and the FIFA Club World Cup final in East Rutherford, New Jersey. Some of those crowds cheered him, but people booed him at other events.\nThe president accepted Rolex’s invitation despite his administration imposing a whopping 39 per cent tariff on Swiss products. That’s more than 2 1/2 times higher than levies on European Union goods exported to the US and nearly four times higher than on British exports to the US.\nThe White House declined to comment on Trump accepting a corporate client’s invitation at the tournament, but the president has had few qualms about blurring lines between political and foreign policy decisions and efforts to boost the profits of his family business.\nHe’s tirelessly promoted his cryptocurrency interests and luxury golf properties, and even announced that the US will host the Group of 20 summit in December 2026 at his Doral golf resort in Florida.\nNo major street protests against Trump could be seen from the tournament’s main stadium on Sunday. But attendees also steered clear of wearing any of the the Republican’s signature “Make America Great Again” caps.\nA 58-year tennis fan originally from Turin, Italy, came from her home in the Boston area to watch the final and said that when she bought a US Open cap, she went with a fuchsia-hued one so it wouldn’t be mistaken for the signature darker colour of MAGA hats.\n“I was careful not to get the red one,” said the fan, who declined to give her name because of her employer’s rules about being publicly quoted.\nAmong those attending with Trump were White House Press Secretary Karoline Leavitt, Attorney General Pam Bondi, Treasury Secretary Scott Bessent, Special Envoy Steve Witkoff and Susie Wiles, the White House chief of staff. Trump spent various portions of the match engaged in conversation with many of those around him.\nElsewhere in the crowd were a slew of celebrities — some of whom publicly backed then-vice president Kamala Harris during last year’s election. Among them were Pink, Bruce Springsteen and Shonda Rhimes.\nTrump was once a US Open mainstay, but hadn’t attended since he was booed at a quarterfinal match in September 2015, months after launching his first presidential campaign.\nThe Trump Organization once controlled its own US Open suite, which was adjacent to the stadium’s television broadcasting booth, but suspended it in 2017, during the first year of Trump’s first term. The family business is now being run by Trump’s sons with their father back in the White House. (AP) ARI","summary":"","url":"https://www.news18.com/agency-feeds/trumps-us-open-visit-sparks-boos-long-security-lines-9555963.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_Sports_Section_Default_Image_1600x900-2025-07-4ca3f8a0fffd320c759cb5b8267edc70.jpg","video":null,"publish_date":"2025-09-07 20:45:02","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.027},{"id":358336930,"title":"Trump’s US Open visit sparks boos and long security lines","text":"NEW YORK (AP) — President Donald Trump was loudly booed at the men’s final of the U.S. Open on Sunday, where extra security caused by his visit led to lines long enough that many people missed the start of play, even after organizers delayed it.\n\nWearing a suit and long, red tie, Trump briefly emerged from his suite about 45 minutes before the match started and heard a mix of boos and cheers from an Arthur Ashe Stadium that was still mostly empty. No announcement proceeded his appearance, and it was brief enough that some in the crowd missed it.\n\nTrump appeared again to more boos before the National Anthem. Standing in salute, the president was shown briefly on the arena’s big screens during the anthem, and offered a smirk that briefly made the boos louder. \n\nWhen the anthem was over, the Republican pointed to a small group of supporters seated nearby, then sat on the suite’s balcony to watch the match intently. He mostly didn’t applaud, even following major points that energized the rest of the crowd as Spain’s Carlos Alcaraz took on the No. 1 seed and the tournament’s defending champion, Jannik Sinner of Italy. \n\nTrump was shown on the big screen again after the first set ended, and elicited a roar of louder boos and some piercing whistles. He raised his left fist in salute as the noise continued in the stadium, which with a capacity of 24,000 is one of the largest in tennis. Trump later moved back inside the suite where he was seen seated at a table with family members.\n\nOrganizers pushed the start of the match back half an hour to give people more time to pass through enhanced screening checkpoints reminiscent of security at airports. Still, thousands of increasingly frustrated fans remained in line outside as the match got underway. Many seats, especially those in upper rows, stayed empty for nearly an hour.\n\nThe Secret Service issued a statement saying that protecting Trump “required a comprehensive effort” and noting that it “may have contributed to delays for attendees.” \n\n“We sincerely thank every fan for their patience and understanding,” it said. \n\nTrump attended the final as a guest of Rolex, despite imposing steep tariffs on the Swiss watchmaker’s home country. The U.S. Tennis Association also tried to limit negative reaction to Trump’s attendance being shown on ABC’s national telecast, saying in a statement before play began: “We regularly ask our broadcasters to refrain from showcasing off-court disruptions.” \n\nThe reactions to Trump didn’t ultimately constitute major disruptions, though. \n\nGoing to the U.S. Open was the latest example of Trump having built the bulk of his second term’s domestic travel around attending major sports events rather than hitting the road to make policy announcements or address the kind of large rallies he so relished as a candidate.\n\nSince returning to the White House in January and prior to Sunday’s U.S Open swing, Trump has gone to the Super Bowl in New Orleans and the Daytona 500, as well as UFC fights in Miami and Newark, New Jersey, the NCAA wrestling championships in Philadelphia and the FIFA Club World Cup final in East Rutherford, New Jersey. Some of those crowds cheered him, but people booed him at other events. \n\nThe president accepted Rolex’s invitation despite his administration imposing a whopping 39% tariff on Swiss products. That’s more than 2 1/2 times higher than levies on European Union goods exported to the U.S. and nearly four times higher than on British exports to the U.S. \n\nThe White House declined to comment on Trump accepting a corporate client’s invitation at the tournament, but the president has had few qualms about blurring lines between political and foreign policy decisions and efforts to boost the profits of his family business. He’s tirelessly promoted his cryptocurrency interests and luxury golf properties, and even announced that the U.S. will host the Group of 20 summit in December 2026 at his Doral golf resort in Florida. \n\nNo major street protests against Trump could be seen from the tournament’s main stadium on Sunday. But attendees also steered clear of wearing any of the the Republican’s signature “Make America Great Again” caps. \n\nA 58-year-old tennis fan originally from Turin, Italy, came from her home in the Boston area to watch the final and said that when she bought a U.S. Open cap, she went with a fuchsia-hued one so it wouldn’t be mistaken for the signature darker color of MAGA hats. \n\n“I was careful not to get the red one,” said the fan, who declined to give her name because of her employer’s rules about being publicly quoted.\n\nAmong those attending with Trump were White House press secretary Karoline Leavitt, Attorney General Pam Bondi, Treasury Secretary Scott Bessent, special envoy Steve Witkoff and Susie Wiles, the White House chief of staff. Trump spent various portions of the match engaged in conversation with many of those around him.\n\nElsewhere in the crowd were a slew of celebrities — some of whom publicly backed then-Vice President Kamala Harris during last year’s election. Among them were Pink, Bruce Springsteen and Shonda Rhimes. In pre-match interviews shown on large stadium screens with the likes of Martha Stewart and Jon Hamm, the questions asked stuck to tennis and pop culture — not Trump and politics. \n\nThe president nonetheless was excited enough about his trip to tell reporters on Air Force One during the flight to New York when the plane flew over Ashe stadium — though the covered roof kept those inside from reacting. \n\nTrump was once a U.S. Open mainstay, but hadn’t attended since he was booed at a quarterfinals match in September 2015, months after launching his first presidential campaign. \n\nThe Trump Organization once controlled its own U.S. Open suite, which was adjacent to the stadium’s television broadcasting booth, but suspended it in 2017, during the first year of Trump’s first term. The family business is now being run by Trump’s sons with their father back in the White House. \n\nTrump was born in Queens, home of the U.S. Open, and for decades was a New York-area real estate mogul and, later, a reality TV star. Attending the tournament before he was a politician, he usually sat in his company’s suite’s balcony during night matches and was frequently shown on the arena’s video screens.\n\nWill Weissert, The Associated Press","summary":"NEW YORK (AP) — President Donald Trump was loudly booed at the men&#8217;s final of the U.S. Open on Sunday, where extra security caused by his visit led to lines long enough that many people missed the start of play, even after organizers delayed it. Wearing a suit and long, red tie, Trump briefly emerged [&#8230;]","url":"https://toronto.citynews.ca/2025/09/07/trumps-us-open-visit-sparks-boos-and-long-security-lines/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/09/b56ba72d2ab61e82048f0edde67432fa62d20c5a87c228c566a87ef705391c58.jpg","video":null,"publish_date":"2025-09-07 20:31:46","author":"News Staff,Will Weissert","authors":["News Staff","Will Weissert"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.01},{"id":358324748,"title":"LA police stop security services for Kamala Harris","text":"LOS ANGELES: The Los Angeles Police Department ended its protection for former Vice President Kamala Harris on Saturday after facing criticism from an elite unit of officers and the police union, according to two people familiar with the matter. The department said this past week that it had assigned officers to assist the California Highway Patrol in providing security for Kamala. The agencies stepped in to fill the gap that was left after President Trump terminated Kamala's Secret Service security detail. Officers had been reassigned from crime suppression work, one of those people said. The request for the protection service came as the department was managing with reduced resources, the official said. NYT","summary":"The Los Angeles Police Department ceased providing security for former Vice President Kamala Harris following criticism from officers and the police union. This decision comes after the LAPD stepped in to assist the California Highway Patrol when President Trump ended Harris's Secret Service detail. The reassignment of officers from crime suppression duties occurred amidst the department's existing resource constraints.","url":"https://timesofindia.indiatimes.com/world/us/la-police-stop-security-services-for-kamala-harris/articleshow/123752110.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-123752469/123752469.jpg","video":null,"publish_date":"2025-09-07 19:14:55","author":null,"language":"en","source_country":"in","sentiment":-0.335},{"id":358315808,"title":"John Burton, powerful liberal who shaped California politics for decades, dies","text":"John L. Burton, the proudly liberal and pro-labor lawmaker who shaped California politics and policy over six decades on topics as varied as welfare, foster care, auto emissions, guns and foie gras, has died. He was 92. With his brother, Rep. Phillip Burton, and college buddy, former San Francisco Mayor Willie Brown, Burton was integral to the organization that dominated Democratic politics in San Francisco and the state starting in the 1960s. Burton was elected to the Assembly in 1964 and Congress a decade later. Laid low by cocaine addiction, he did not seek reelection in 1982. But he returned to Sacramento after getting clean and became the Capitol’s most powerful legislator as Senate president pro tem from 1998 until term limits forced him to retire in 2004. “I think government's there to help the people who can't help themselves. And there's a lot of people that can't help themselves,” Burton said, describing his view of a politician’s job in an oral history interview by Open California. Burton's death was confirmed in a statement released by his family on Sunday. “He cared a lot,” said Kimiko Burton, his daughter. “He always instilled in me that we fight for the underdog. There are literally millions of people whose lives he helped over the years who have no idea who he is.” An L.A. Times writer described Brown, always dapper and cool, as a piece of living art. In contrast, Burton was performance art — rumpled, often rude, too fidgety to sit in long policy meetings. Some people sprinkle conversation with profanities. Burton doused his sentences with expletives, usually F-bombs. He was quick to yell but could also be charming. He bought pies from a fruit stand off Interstate 80 between San Francisco and Sacramento and delivered them as apologies to targets of his rants. An aide once gave him a T-shirt with the phrase: “I yell because I care.” Unlike most politicians, who dress to the nines, Burton wore ties reluctantly and showed up at meetings with governors wearing guayaberas, rarely with his hair in place. When cameras weren’t around, he drove through San Francisco delivering blankets to homeless people. One of Burton’s many intensely loyal aides was Angie Tate, whom he hired to be his political fundraiser in 1998 knowing she was pregnant with twins. After she gave birth three months early and tried to return to work, Burton insisted that she take a year off, fully paid. She worked with him for the rest of his days. In later years, he created John Burton Advocates for Youth, a nonprofit group to mentor foster youth and seek policy changes. One such bill extended services for foster youth until age 21, rather than the previous cutoff of 18. “I don’t think there is a person who has done more for foster kids than John Burton,” said Miles Cooley, a Los Angeles entertainment attorney who was in foster care when he was a child and sits on the board of Burton’s foundation. “He wasn’t speaking truth to power. He was yelling it.” From his early days in public life, Burton, a lawyer and Army veteran, advocated for greater civil rights, opposed the death penalty, and was an antiwar activist, protesting U.S. involvement in Vietnam in October 1963, when the U.S. had fewer than 17,000 troops there. As state Senate leader four decades later, Burton joined folk singer Joan Baez at a protest of President George W. Bush’s impending invasion of Iraq. As California Democratic Party chair from 2009 to 2017, he presided as the party changed its platform to oppose capital punishment. “John Burton was liberal when it was popular to be liberal and he was liberal when it was not popular. I always admired that,” said former state Sen. Jim Brulte, a Republican who tangled with Burton in the Legislature and later when they chaired their respective political parties. A party chair’s job is to win elections. That requires money. In 2008, the year before Burton took over the state Democratic Party, the California Republican and Democratic parties raised and spent roughly equal sums. By 2016, his final campaign as chair, the Democrats were outspending the Republicans $36.2 million to $17.7 million. He promoted a ballot measure in 2010 that allows the Legislature to pass the annual budget by a simple majority rather than the previous two-thirds supermajority, allowing the Democrats to pass a legislative session’s most important measure — the budget — without Republican votes, further marginalizing the GOP in Sacramento. When Burton stepped down from the California Democratic Party in 2017, Democrats held all statewide offices and had supermajorities in both houses of the 120-seat Legislature. Rep. Nancy Pelosi (D-San Francisco), then-Rep. Barbara Lee (D-Oakland), Los Angeles County Supervisor Hilda Solis and state Treasurer Fiona Ma were among the politicians, most of them women, who joined Burton on the convention stage in 2017 for his farewell as party chair. Former state Sen. Martha Escutia serenaded him with a rendition of “Bésame Mucho.” “John is the chief architect of the Democrats’ dominance in California,” Pelosi said at the time. Burton paid tribute to the people who had helped him, saying, \"You're only as good as your staff,\" and closed by exhorting party loyalists to raise their middle fingers and give a Burton-like cheer to then-President Trump. Although Burton was a partisan, his closest friend in the Senate was Ross Johnson of Fullerton, who was Senate Republican leader. Sharing a quirky love of song, the unlikely duet interrupted a Senate floor session with a rendition of “Big Rock Candy Mountain.” They also shared a distrust of authority and collaborated to curb law enforcement’s ability to seize individuals’ assets without a trial. Burton and Johnson shaped campaign finance law with a ballot measure permitting political parties to accept unlimited donations, enhancing parties’ power. As a sweetener for voters, the measure required rapid disclosure of contributions. John Lowell Burton, born in Cincinnati in 1932, was the youngest of three brothers. After his father completed medical school in Chicago, the family relocated to San Francisco, where Dr. Burton cared for patients whether they could pay or not. Burton lettered in basketball at San Francisco State College and kept a clipping of a newspaper box score showing he scored 20 points against a University of San Francisco team that included young Bill Russell, one of the greatest basketball players of all time. He met Brown at San Francisco State and they became lifelong friends. A bartender in his younger days, Burton was arrested for bookmaking in 1962, but was cleared. Burton credited his oldest brother, Phillip, with pushing him to enter politics. A dominant political figure, Rep. Phil Burton might have become House speaker if he had not died in 1983 at the age of 56. The Burton brothers reflected a dichotomy in California politics, rising from the left while Richard Nixon and Ronald Reagan ascended from the right, against the swirl of the Bay Area’s brand of radical politics. John Burton and Brown won their Assembly seats in 1964, the same year that voters approved a ballot measure backed by the real estate industry giving property owners the right to refuse to sell to people of color. Courts later overturned it. The Burton-Brown organization spawned a who’s who of leaders, including two San Francisco mayors — George Moscone, who was a high school friend, and Brown, the most powerful Assembly speaker in California history. Burton was a friend of Gov. Gavin Newsom’s father, a state appellate court justice, and watched young Gavin’s high school sports games. Brown gave Newsom his start in politics with an appointment. Barbara Boxer worked for John Burton during his time in Congress, before succeeding him in 1982 and winning a U.S. Senate seat a decade later. When Boxer retired in 2016, Brown helped promote Boxer’s successor, Kamala Harris. Pelosi is most consequential of all. Phillip Burton’s widow, Sala Burton, succeeded him in Congress. As she was dying of cancer, Sala Burton told John that she wanted Pelosi to succeed her, and he used all his connections to help Pelosi win the congressional seat in 1987. In November 1978, Burton declined an invitation from Rep. Leo Ryan, a Democrat from San Mateo, to accompany him to Guyana to investigate the People’s Temple cult, once a force in San Francisco politics. On Nov. 18, as Ryan’s plane was about to depart with cult defectors, one of cult leader Jim Jones’ followers assassinated the congressman. Jones led a murder-suicide resulting in more than 900 deaths. On Nov. 27, 1978, with the city convulsed by the Jonestown cataclysm, Dan White, a former San Francisco supervisor, sneaked into City Hall and assassinated Moscone and Supervisor Harvey Milk. Burton fell hard in the months and years after, drinking heavily, huffing nitrous oxide and freebasing cocaine. He missed congressional votes, and aides feared he would be found dead. In 1982, he checked into a rehab facility in Arizona and did not seek reelection. Back in San Francisco, he built a law practice, stayed clean and returned to politics, winning a special election for an open Assembly seat in 1988. He reunited with Speaker Brown and became his close ally. Burton’s eclectic circle of friends included national political figures, Hollywood glitterati, football coach John Madden, North Beach topless dancer Carol Doda and, from his bartending days, Alice Kleupfer, a cocktail waitress. In this small world, Kleupfer's son James Rogan won an Assembly seat from the Burbank area as a Republican in 1994, was elected to Congress in 1996, and helped lead the impeachment of President Clinton. Politics aside, Burton and Rogan shared a connection through Kleupfer. That friendship mattered on May 30, 1996, when Republicans, holding a short-lived 41-39 seat advantage in the Assembly, rushed to approve tough-on-crime bills. One bill would have made it a crime for pregnant women to abuse drugs, a response to accounts of babies born addicted to cocaine. The GOP-led Assembly seemed certain to pass it when Burton stood to speak. Though not a commanding orator, Burton spoke from the heart about how cocaine \"takes total control of your life,\" and how he spent days freebasing in hotel rooms, refusing maid service because he didn’t want anyone to see him. \"It took me, somebody who at least has got a fair set of brains sometimes, who comes from a background that is not deprived, who at the time I was doing it — and I’m not proud to say — was a member of the House of Representatives, and it took me two years to get off this drug, which is the most insidious drug you can imagine,\" Burton said. Floor speeches rarely change minds. But after Burton pleaded with Republicans not to “turn these young women into criminals,” Rogan, then-Speaker Curt Pringle and a few other Republicans withheld their votes. With the bill pending, Republicans conferred behind closed doors and quietly dropped the bill. “It wasn’t planned. It wasn’t scripted. It was pure John Burton,” said Rogan, who went on to become a Superior Court judge in Orange County. Burton was the only Democrat who had the relationships and gravitas to derail the bill. For most of his time in office, Burton served under Republican governors. He butted heads with them and on occasion won them over. When young Assemblyman Burton sought to decriminalize marijuana, Reagan, implying that Burton was a nut, quipped that the San Franciscan was the one man in Sacramento who had the most to fear from the squirrels that populate Capitol Park. Burton answered by calling reporters to the park and trying to feed squirrels a copy of some Reagan-backed legislation. “There’s some benefit to people thinking you're nuts,” Burton said in an interview. Though he was a relatively junior legislator, Burton took a lead role in Reagan’s 1971 welfare overhaul, pushing for annual cost-of-living adjustments for welfare recipients, something he fought to protect over the years. He disparaged Gov. Pete Wilson, a Marine Corps veteran, for his efforts to limit welfare by calling him \"the little Marine.\" Burton had a \"wicked sense of humor and a “colorful” way of expressing it\" but was \"a straight shooter,\" Wilson said. \"With respect to legislative leaders, as Democrats, I would say that the combination of John Burton and Willie Brown negotiating budget and policy solutions during a time of crisis in the Reagan Cabinet Room was some of the finest policy and political talent California has ever seen,\" Wilson said. Voters elected Burton to the state Senate in 1996, and senators elected him Senate president pro tem in 1998, the year Gray Davis was elected governor, the first Democrat to hold that office after 16 years of Republicans. The relationship was strained. In appearance, temperament and approach, they were opposites, and they clashed. Davis was a centrist who tried to be tightfisted. Burton, often dismissive of Davis, tried to pull him to the left. When it suited their interests, however, Davis signed legislation that Burton advocated, and Burton carried administration legislation. “It ain’t brain surgery,” Burton said in 2021 of the art of turning a bill into a law. But few legislators could handle a lawmaking scalpel like Burton. As Senate leader, he shepherded legislation to buy the last large stands of old-growth redwoods, increase public employee pensions, restrict guns and expand the right to sue, including for victims of sexual harassment. He was the target of such a suit in 2008. It was settled a few months later. Burton routinely blocked legislation that increased the length of prison sentences but was a favorite of the California Correctional Peace Officers Assn., which represents prison guards. He was, after all, pro-labor. In 2002, Burton carried legislation ratifying the prison officers’ contract negotiated by the Davis administration granting officers a raise of roughly 35% over five years, and boosting their pensions. Later that year the union, run by the fedora-wearing Don Novey, celebrated Burton’s 70th birthday by donating $70,000 to his campaign account. Often, Burton sought no credit for what he helped others accomplish, as Fran Pavley discovered. In 2001, her first year in the Assembly, Pavley, an Agoura Hills Democrat, proposed far-reaching climate change legislation to authorize the California Air Resources Board to regulate greenhouse gas emissions from vehicle tailpipes. Lobbyists for automakers shifted into overdrive, airing ads warning California that AB 1058 would dictate what cars people could own. The oil industry, drive-time talk radio hosts, and even Cal Worthington and his dog Spot piled on. AB 1058 looked like roadkill. Burton’s solution: Hijack another bill and insert the contents of Pavley’s bill into it. With that bit of legerdemain, AB 1058 died, AB 1493 was born, and the auto industry’s campaign crashed. Burton didn’t attend the ceremony when Davis signed the bill. Nor did he accompany Pavley a decade later when President Obama held a Rose Garden ceremony embracing the California concept in nationwide fuel-efficiency standards. Pavley said she had never seen a politician work so hard for a bill for no credit, ”and I haven't seen it since.” Burton took special interest in certain issues. He was, for example, appalled at the force-feeding of ducks and geese to enlarge their livers to produce foie gras. In one of his final bills, he battled restaurant owners and agricultural interests to ban the practice. It passed the Senate by one vote. In a letter urging Gov. Arnold Schwarzenegger to sign the bill against the wishes of some chefs, he included Burtonesque doggerel: \"Save Donald Duck. F— Wolfgang Puck.” Schwarzenegger signed the bill and sent Burton a photo of himself and Burton in the governor’s office looking at the bottom of the governor’s shoe with a note: “I got duck liver on my shoe!” In the background of the photo, there’s an image of Reagan, smiling with his head tilted back as if he’s having a good laugh. Burton, who was divorced twice, is survived by his daughter, attorney Kimiko Burton, and two grandchildren. Times staff writer David Zahniser contributed to this report. Morain is a former Times staff writer.","summary":"Rude, profane, yet utterly charming, Burton became the state Capitol's most powerful legislator when he served as Senate president pro tem.","url":"https://www.latimes.com/california/story/2025-09-07/john-burton-dead-powerful-liberal-shaped-california-politics-for-decades","image":"https://ca-times.brightspotcdn.com/dims4/default/8323b43/2147483647/strip/false/crop/3026x1959+0+0/resize/1486x962!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fzbk%2Fdamlat_images%2FLA%2FLA_PHOTO_ARCHIVE%2FSDOCS%2814%29%2F","video":null,"publish_date":"2025-09-07 18:19:36","author":"Dan Morain","authors":["Dan Morain"],"language":"en","source_country":"us","sentiment":0.392},{"id":358304984,"title":"Democrat Governor Gives Clear Indication of Presidential Aspirations","text":"Maryland Governor Wes Moore, a Democrat, has ruled himself out of the running for a potential 2028 presidential bid.When asked about his plans for the future on Sunday during an interview appearance on NBC News' Meet the Press, the governor said he planned to seek reelection instead.Why It MattersThe Democratic Party continues to seek a clear path forward in the aftermath of a clear Republican victory in last year's elections, with President Donald Trump defeating then-Vice President Kamala Harris while Republicans held the House of Representatives and reclaimed the Senate, giving the party total control of the executive and legislative branches.No clear frontrunner has emerged for the Democrats as the party reeled from the defeat, with much finger-pointing and disagreement about what went wrong, with polls indicating Harris had a strong chance of defeating Trump, and what to do as the country heads towards the 2026 midterms.What To KnowMoore has gained increased national prominence as Trump looks to expand on his immigration and crime crackdowns, naming Baltimore as one of the cities he would consider deploying National Guard troops in a similar manner to how he did in Los Angeles and Washington, D.C.,—the former to aid in detaining and removing illegal immigrants, the latter to handle what he deemed a problem of rampant crime in the nation's capital.Moore has defended Baltimore, firing back at the president each time about the city's homicide rate, which has fallen to a 50-year low but has remained relatively high compared to other major cities.\"If you are not willing to be part of the solution, keep our names out of your mouth,\" Moore said at a press conference last month.Some Democrats have therefore suggested him as a potential nominee in 2028, but Moore has dismissed any such plans.Speaking with NBC News host Kristen Welker on Sunday, Welker noted that Moore had yet to announce his plans to seek reelection as governor, to which he said he planned to serve out his full term, which would end in 2027, following the 2026 gubernatorial election.\"Yes, I'll be serving a full term. I'm excited about reelection,\" Moore said. \"I'm excited about what I'm going to be able to do for the people of Maryland.\"When asked if that means ruling himself out for a bid for president in 2028, Moore said: \"Yeah, I'm not running for president,\" repeating himself when Welker asked him again.\"I'm excited about what we're doing,\" he said. \"That we've gone from 43rd in the country in unemployment to now one of the lowest unemployment rates; we've had amongst the fastest drops in violent crime anywhere in the United States of America.\"Moore added: \"Our population is growing, Maryland is moving, and so I'm really excited about going back in front of the people of my state and asking for another term.\"Who Are Potential Democratic Presidential Nominee Frontrunners?Several names have been touted as potential nominees for the Democrats, even as it remains far too early to pick out a clear frontrunner.California Governor Gavin Newsom has made clear efforts to put himself front and center of the national conversation, and polling has him top of everyone's minds as a potential candidate. He recently started imitating Trump on his personal X account and has started a podcast in order to engage with right-wing figures in the so-called \"manosphere.\"He narrowly edges out Harris in polling, with the former vice president retaining much goodwill despite losing to Trump.Meanwhile, Representative Alexandria Ocasio-Cortez of New York, continues to overperform in polling, regularly coming in top three despite giving no indication or desire she would run for president.Former President Joe Biden's Transportation Secretary Pete Buttigieg also regularly ranks highly for potential candidates and has also made the rounds on podcasts discussing Trump's policies and engaging with figures on both ends of the political spectrum.Governors Josh Shapiro of Pennsylvania and Gretchen Whitmer of Michigan round out the list of top contenders, though their national prominence has faded throughout the early months of the second Trump administration.What Happens Next?Candidates typically make campaign announcements after the midterms, which are scheduled to take place next November.","summary":"Maryland Governor Wes Moore is one of the several names touted as a potential presidential nominee for 2028 as the Democratic Party seeks clear leadership.","url":"https://www.newsweek.com/maryland-governor-wes-moore-gives-clear-indication-presidential-aspirations-2126024","image":"https://d.newsweek.com/en/full/2717664/maryland-governor-wes-moore-president.jpg?w=1600&h=900&q=88&f=507badca2b86137287d51ad844058cf7","video":null,"publish_date":"2025-09-07 17:54:47","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.017},{"id":358301866,"title":"Trump Family Adds $1.3 Billion Of Crypto Wealth In Span Of Weeks","text":"It took just a few eventful weeks for President Donald Trump’s family to rack up about $1.3 billion from two crypto ventures, each less than a year old.The haul from crypto firm World Liberty Financial and separate mining operation American Bitcoin Corp. shows how still-nascent projects are already translating into tangible wealth for the first family. The sums rival the values of long-held golf and resort properties that had been synonymous with the Trumps, whose fortune now stands at $7.7 billion, according to the Bloomberg Billionaires Index. The president’s two eldest sons, Donald Trump Jr. and Eric Trump, still share the role of executive vice president at the Trump Organization, but are increasingly the faces of the family’s growing crypto portfolio.World Liberty, which they co-founded last year along with the president’s youngest son, Barron, reached a key milestone on Sept. 1, opening up the ability for customers to trade its eponymous token. Last month, it clinched a lucrative deal with a public company to stockpile the asset. Together, those developments added about $670 million to the Trumps’ net worth, according to Bloomberg’s wealth index, which now treats it as a family fortune. Bloomberg’s calculation excludes roughly $4 billion worth of tokens owned by the Trumps that remain locked for now.Eric Trump’s stake in American Bitcoin, created in March to mine virtual assets, was worth more than $500 million when the stock surged in its trading debut on Sept. 3. The blitz suggests a new reality is setting in for the first family: The properties most closely associated with them, like Trump Tower on Manhattan’s Fifth Avenue and even the palm-fringed Mar-a-Lago resort, aren’t the fastest path to new wealth. And even for a family that’s long attached its name to everything from steaks to vodka, the speed and magnitude of their crypto gains are unlike anything they’ve done before..‘Easier To Pump’: Crypto Coin Backed By Trumps Opens For Trading.The Trump Organization and the White House didn’t respond to requests for comment. David Wachsman, a spokesman for World Liberty Financial, declined to comment..The Trumps have new ideas in progress, too. Warren Hui, co-founder of Soul Ventures, which invested in Alt5 Sigma Corp., the public company that started buying World Liberty tokens last month, said the crypto company’s founders recently suggested they may start “tokenizing” real estate assets — creating a digital proxy for something that exists in the physical world. Eric Trump was among the group pitching the idea, he added.“We had confidence when we talked to Eric Trump, from his experience with hospitality and real estate,” Hui said. ‘Buy Right Now’World Liberty and American Bitcoin are now operating at the intersection of crypto and public markets. While crypto enthusiasts once sought an alternative to traditional finance, increasingly they’re using publicly listed vehicles to bolster the value of their tokens. It’s a riff on a concept crypto celebrity Michael Saylor pioneered and a way to create a more steady source of demand for volatile virtual assets.Under earlier regulatory regimes, the crypto industry was under greater scrutiny. The Securities and Exchange Commission during the Biden administration cracked down on crypto exchanges for selling unregistered securities, and sued some of the best known companies, including Coinbase Global Inc. and Kraken. Under Trump, who appointed friendlier regulators and promised to turn the US into the “crypto capital of the world,” those high-profile cases were dropped. In response to criticism over the potential for conflicts of interest, given the family’s involvement in virtual assets, President Trump’s sons have said their businesses are distinct from the government..Still, during the Bitcoin Asia conference at the end of August, Eric Trump said he had urged his father to address Bitcoin enthusiasts while campaigning in Nashville last year. Eric Trump, who told Bloomberg last week that he’s been buying Bitcoin for “several years,” often makes a sales pitch for the asset class now helping his family amass substantial new wealth. “Buy right now,” he told the Bitcoin Asia audience in Hong Kong. “Buy this second.” He followed up with a mention of Saylor’s entreaty to “sell a kidney if you must, but keep the Bitcoin.”World Liberty Financial World Liberty got its start in September 2024, while Trump was running against Kamala Harris. The Trumps were listed as co-founders, alongside Steve Witkoff, who became the administration’s special envoy to the Middle East, and his sons Zach and Alex Witkoff. At first, buyers could only use World Liberty Financial tokens to cast votes to “shape the future” of the project. There have been three proposals to date, including whether to make the WLFI token tradeable, according to a snapshot on the company’s website.One matter that wasn’t put up for a vote: a deal in August with Alt5 Sigma, a little-known Las Vegas-based firm previously focused on biotechnology. Publicly-traded Alt5 Sigma said it would buy about $1.5 billion of World Liberty tokens. The transaction had two legs: The company traded its own shares for about $750 million worth of tokens at 20 cents each, and bought roughly the same amount using cash. At the time, the WLFI token was still straitjacketed and untradeable. The Alt5 Sigma deal is worth about $670 million all-in to the Trumps, according to Bloomberg calculations. Though shares of Alt5 Sigma have lost more than half their value since the tie-up was announced, they’re still worth nearly $170 million to the first family. The Trumps also get 75% of the proceeds from World Liberty token sales, worth roughly another $500 million.“We are at the tip of the spear,” Eric Trump said at Nasdaq’s Times Square office, where he gathered with Zach Witkoff and fellow co-founders Chase Herro and Zak Folkman to celebrate the union. “We are really going to rewrite the whole playbook.”The wild card through it all is the Trump family’s 22.5 billion WLFI tokens, which they received when the project began. WLFI tokens started partially trading in the past week, at prices that would value the Trumps’ haul at $4 billion.But unlike the portion of the tokens that became tradeable for early investors, the tokens allocated to the Trumps, Witkoffs and other World Liberty team members remain “locked.” The Bloomberg Billionaires Index excludes these tokens from the total value of the Trumps’ crypto holdings because they can’t yet be traded.American Bitcoin American Bitcoin, for its part, emerged about two months after President Trump’s inauguration with a plan to mine Bitcoin and backed by Eric Trump and Donald Trump Jr. While Bitcoin mining is an energy-intensive process, dependent on droves of computers, they didn’t need to supply any of the specialized equipment — instead, a public company called Hut 8 Corp. offered its own mining machinery in exchange for a majority stake in the fledgling firm.American Bitcoin became a public company in short order. Rather than pursue the more traditional path of an initial public offering, it had public company Gryphon Digital Mining absorb American Bitcoin’s name and business, changing its stock ticker to ABTC. Eric Trump now owns about 7.5% of the public company, according to Bloomberg calculations, which for a fleeting moment last week made his stake worth close to $1 billion. Donald Trump Jr. also held a smaller stake in American Bitcoin, but its size wasn’t listed in public filings.When asked about the ballooning size of his American Bitcoin wealth on Bloomberg TV, Eric Trump said only that “we are incredibly fortunate in life with or without this endeavor.” But he nodded to the fact that he now spends considerable time promoting crypto and the companies he has backed. “I want to be a great spokesperson for it,” he said..What Is Polymarket And Why Is Donald Trump Jr Investing In It?","summary":"The haul from crypto firm World Liberty Financial and separate mining operation American Bitcoin Corp. shows how still-nascent projects are already translating into tangible wealth for the family.","url":"https://www.ndtvprofit.com/crypto/trump-family-adds-13-billion-of-crypto-wealth-in-span-of-weeks","image":"https://media.assettype.com/bloombergquint/2025-09-07/0olc8uun/439376463.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-09-07 17:06:58","author":null,"language":"en","source_country":"in","sentiment":0.189},{"id":358265564,"title":"Comment on Trump withdraws Kamala Harris’s Secret Service protection by Olof Meister","text":"The Secret Service customarily protects vice presidents for six months after they leave office, a period that ended on July 21 for Harris.\n\nBut then-president Joe Biden approved a year-long extension for Harris in a previously undisclosed order — which Trump has now terminated, a senior White House official told AFP on condition of anonymity.\n\nHarris’s office also confirmed the move.\n\n“The Vice President is grateful to the United States Secret Service for their professionalism, dedication, and unwavering commitment to safety,” Kirsten Allen, a senior advisor to Harris, told AFP.\n\nDemocrats rallied behind Harris over the move, especially in California where she previously served as a senator.\n\nLos Angeles Mayor Karen Bass said it was “another act of revenge following a long list of political retaliation” by Trump, according to a statement reported by US media.\n\n“This puts the former Vice President in danger and I look forward to working with the Governor to make sure Vice President Harris is safe in Los Angeles.”\n\nSince taking office in January, Trump, 79, has taken similar measures against a long list of his perceived enemies and political opponents.\n\nTrump has withdrawn protection for former national security advisor John Bolton — whose house was raided by FBI agents in a classified documents probe last week — former secretary of state Mike Pompeo and former top US military officer Mark Milley.\n\nIn March he pulled government bodyguards from Biden’s son Hunter and daughter Ashley.\n\n– Stripped of clearances –\n\nHe has also stripped other officials and former officials — including Biden himself — of their security clearances to receive sensitive information.\n\nWhile Harris, 60, has kept a low profile since losing the election, she is scheduled to go on tour this fall to promote her memoir “107 Days” about her short presidential run.\n\nThe book, which Harris said she wrote with “candor and reflection”, will be published by Simon & Schuster on September 23 in the United States.\n\nThe first woman to serve as vice president of the United States, Harris became the Democratic nominee after Biden, now 82, withdrew from the race amid concerns about his cognitive health.\n\nThe move to withdraw her protection comes even though the Trump administration has repeatedly stressed the need for security for current officials following the assassination attempt that the Republican survived in July 2024 in Butler, Pennsylvania.\n\nTrump sent a signed memo ordering Homeland Security Secretary Kristi Noem to “discontinue any security-related procedures previously authorized by Executive Memorandum, beyond those required by law” for Harris from September 1, said CNN, which first reported the move.\n\nThe Secret Service did not immediately respond to a request for comment.\n\nBiden and his wife Jill get protection for life under federal law as a former president and his spouse, but his adult children were not so lucky.\n\nTrump in March said it was “ridiculous” that Hunter Biden had a security detail of up to 18 people.\n\nBut after his first term in office from 2017 to 2021, billionaire Trump issued an order giving a six-month extension of Secret Service protection to all four of his adult children and three senior administration officials.\n\n© Agence France-Presse","summary":"I wasn’t expecting much when I first tried &lt;a href=&quot;https://spinmamas.net&quot; rel=&quot;nofollow ugc&quot;&gt;spinmama casino&lt;/a&gt;  , but the clean layout and smooth gameplay surprised me. I lost a few rounds initially but then scored a small win that kept me playing longer than planned. By the end of the evening, I felt satisfied and relaxed. It’s become one of my go-to sites for casual online entertainment, and I’ve recommended it to a couple of friends as well.","url":"https://extra.cw/trump-withdraws-kamala-harriss-secret-service-protection/","image":"https://extra.cw/wp-content/uploads/2025/08/InternationalInput-INTERNASHONAL-4-KAMALA-HARRIS.jpg","video":null,"publish_date":"2025-09-07 14:38:39","author":"Kena Betancur,Olof Meister","authors":["Kena Betancur","Olof Meister"],"language":"en","category":"politics","source_country":"aw","sentiment":-0.178},{"id":358249996,"title":"Dems hit by the lawfare, executive order and federal intervention boomerang they created","text":"President Donald Trump’s greatest achievement within six months was simply ending illegal immigration as we had once known it — without “comprehensive immigration reform” or any other rhetorical trickery.\n\nIt remains difficult to find, much less deport, the 10 million to 12 million illegal aliens who entered in the last four years.\n\nThose who helped break the law, by design or indifference, now believe it was moral to destroy federal immigration law but immoral to uphold it.\n\nAnd it is still unclear whether former President Joe Biden’s handlers deliberately sabotaged their own border for political and demographic purposes out of sheer orneriness or utter incompetence.\n\nMany of the left’s cherished totems — massive Green New Deal subsidies, the diversity/equity/inclusion industry, biological males competing in women’s sports and the USAID revolving door — are either comatose or in their death throes.\n\nThe historic drop-off in military recruitment reversed shortly after Trump took office.\n\nRepublican voter registration is up, and Democratic registration is down.\n\nAbroad, Trump finds remarkable successes.\n\nFor now, there are pauses in the fighting between India and Pakistan, Egypt and Somalia, Cambodia and Thailand, Rwanda and Congo, Serbia and Kosovo and Armenia and Azerbaijan.\n\nMuch credit is due to Trump for brokering ceasefires.\n\nIran will not get a bomb in the next four years — as seemed likely when Biden left office.\n\nThe Middle East’s current most grotesque terrorist cadres and states — Iran, Hezbollah, Hamas and the Houthis — are far weaker than they were when Trump entered office in January.\n\nThere is at least some engagement in envisioning the outlines of a cease-fire in Trump’s inherited Ukraine War.\n\nThe rub is finding the degree of ordnance necessary to convince Putin that increasing Russia’s casualties to more than 1 million will endanger his own dictatorship sooner than destroy Ukraine.\n\nBreaking up the new 3 billion-person China/India/Russia nexus hinges on ending the war.\n\nThe economy is still strong. Gas prices are at historic lows. Increases in all types of energy production proceed full bore.\n\nGDP, inflation, unemployment and the stock market — all at one time or another said to be in a crisis state — remain strong. Talk of an impending recession or hyperinflation is mostly muted.\n\nNo one quite knows either the full effects of Trump’s tariffs — especially given the injunctions issued by left-wing district justices — or of the promised $10 trillion-plus in foreign investments.\n\nMuch of Trump’s agenda will hinge on whether interest rates are lowered, Republicans survive the midterms and the degree to which unelected left-wing lower-court justices can be stopped from hijacking the Constitution and de facto running the country.\n\nAs for the Democratic opposition, there is no counter agenda, no shadow government of responsible leadership and no willingness to craft bipartisan legislation.\n\nInstead, the left’s strategy is that of the kamikaze: to destroy Trump at the cost of destroying the Democratic Party.\n\nOtherwise, Democrats seek to prove so obnoxious in demonizing Trump that they create such mass hysteria that the weary electorate figuratively lies down, closes its eyes, covers its ears and screams nonstop, “Make them all go away!”\n\nFormer foul-mouthed vice-presidential candidate Tim Walz is now reduced to a ghoulish status. He recently boasted to an audience that rumors of Trump’s death — who survived two assassination attempts last summer — will thankfully one day prove true.\n\nThe top of the failed ticket, Kamala Harris, wanders aimlessly without an office, constituency, audience or ideas.\n\nTo remain viable, she knows she must continue touring and speaking. But Harris accepts that the more anyone hears her word salads, the more they will remember her 2024 train wreck.\n\nThe head of the Democratic Party, Ken Martin, now screams that Trump is a fascist.\n\nBut by what standards does he judge? Did Trump try to take his rivals off state ballots?\n\nDoes he advocate for destroying the filibuster, the Electoral College and the 156-year-old nine-justice Supreme Court, or packing the Senate by admitting two new states?\n\nAre local, state and federal prosecutors — a la Alvin Bragg, Letitia James, Jack Smith and Fani Willis — coordinating with the White House and DOJ to indict Trump’s current chief adversaries, such as Gavin Newsom, Kamala Harris or Josh Shapiro?\n\nDid Trumpers hire a foreign spy to concoct a fake hit dossier on Democratic grandees?\n\nAre his subordinates now spreading it to the media?\n\nAre 51 conservative former CIA contractors and retired spooks swearing that Newsom or Harris is working with the Russians, Chinese or any of our enemies?\n\nDemocrats’ greatest fear?\n\nThat they have so institutionalized excessive executive orders, ad hominem lawfare, lower-court usurpation, state nullification of federal law and federal intervention in higher education, the energy industry and the nation’s open spaces that their own legacies empowered Trump and now will boomerang upon themselves — as the public applauds the karma.\n\nVictor Davis Hanson is a distinguished fellow of the Center for American Greatness.","summary":"Those who helped break the law, by design or indifference, now believe it was moral to destroy federal immigration law but immoral to uphold it.","url":"https://nypost.com/2025/09/07/opinion/trump-keeps-scoring-wins-while-the-left-lacking-an-agenda-can-only-attack-him/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/u-s-president-donald-trump-110812149.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-09-07 13:33:18","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.139},{"id":358251246,"title":"Latest line: A good week for Gavin Newsom, a bad week for Jay Leno","text":"Gavin Newsom\n\nNew Yahoo/YouGov poll shows California governor leading 2028 Democratic presidential nomination race, with 21%, followed by Kamala Harris at 19%; Alexandria Ocasio-Cortez at 12% and Pete Buttigieg 10%.\n\nFormer Tonight Show host takes a political loss after Democrats in Sacramento kill “Leno’s Law,” a bill he pushed to exempt classic collector cars and other old vehicles from smog check tests.\n\nJoel Engardio\n\nSan Francisco supervisor, facing a recall election Sept. 16 for supporting turning the Great Highway into a park, wins the backing of Nancy Pelosi but is found in violation of city rules for not disclosing meetings.","summary":"California governor takes the lead in early 2028 polls, as former Tonight Show host runs out of gas in Legislature","url":"https://www.mercurynews.com/2025/09/07/latest-line-a-good-week-for-gavin-newsom-a-bad-week-for-jay-leno/","image":"https://www.mercurynews.com/wp-content/uploads/2025/09/California_Trump_Newsom_05633-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-07 12:30:17","author":"Bay Area News Group","authors":["Bay Area News Group"],"language":"en","source_country":"us","sentiment":0.077},{"id":358316214,"title":"Trump attends the US Open as Rolex’s guest despite Swiss tariffs. Mixed cheers and boos greet him","text":"By WILL WEISSERT\n\nNEW YORK (AP) — President Donald Trump attended the U.S. Open on Sunday and briefly stepped out from a luxury box to wave at a main court crowd mostly still arriving for the men’s final. He drew mixed cheers and boos. \n\nArthur Ashe stadium was only partially full and Trump’s waves weren’t announced beforehand. They were also brief enough so that some of those in attendance didn’t notice them.\n\nThe president attended as a guest of Rolex despite imposing steep tariffs on the Swiss watchmaker’s home country, and organizers were seeking to keep booing of him from being seen on the TV broadcast. \n\nTrump has built the bulk of his second term’s domestic travel around attending major sports events rather than hitting the road to make policy announcements or address the kind of large rallies he so relished as a candidate. \n\nBecause of extra security screening, the final between second-seeded Carlos Alcaraz, a 22-year-old Spaniard, and No. 1 seed and defending champion Jannik Sinner, 24, of Italy, was pushed back half an hour — meaning Trump arrived more than 45 minutes before the new start time. The president was watching from Rolex’s suite, and his acceptance of Rolex’s invitation comes mere weeks after the Trump administration imposed a whopping 39% tariff on Swiss products.\n\nThe levy is more than 2 1/2 times higher than the one the Trump administration agreed to for European Union goods exported to the U.S. and nearly four times higher than on British exports to the U.S. It has raised questions about Switzerland’s ability to compete with the 27-member bloc that it neighbors.\n\nThe White House declined to comment on Trump accepting a corporate client’s invitation at the tournament, but the president has had few qualms about blurring lines between political and foreign policy decisions and efforts to boost the profits of his family business. \n\nThat includes tirelessly promoting cryptocurrency interests and luxury golf properties around the country and the world that bear his name. He announced Friday that the U.S. will use its turn hosting the Group of 20 summit in December 2026 to stage the sweeping event at Trump National Doral in South Florida. \n\nAny negative reaction to Trump’s presence won’t be shown on ABC’s national telecast, per standard policy, the U.S. Tennis Association says.\n\n“We regularly ask our broadcasters to refrain from showcasing off-court disruptions,” the organization said in a statement.\n\nAs heavy rains began mostly clearing, and throngs of fans arrived for the match, no major street protests against the president could be seen from the touranment’s main stadium. Attendees also steered clear of wearing any of the president’s signature “Make America Great Again” caps, though. \n\nA 58-year tennis fan originally from Turin, Italy, came from her home in the Boston area to watch the final and said that when she bought a U.S. Open cap, she went with a fuchsia-hued one so it wouldn’t be mistaken for the signature darker color of MAGA hats. \n\n“I was careful not to get the red one,” said the fan, who declined to give her name because of her employer’s rules about being publicly quoted.\n\nAttending with Trump were White House press secretary Karoline Leavitt, Attorney General Pam Bondi, Treasury Secretary Scott Bessent, special administration envoy Steve Witkoff and Susie Wiles, the White House chief of staff. \n\nElsewhere in the crowd were a slew of celebrities — some of whom publicly backed then-Vice President Kamala Harris during last year’s election against Trump. Among them were Pink, Bruce Springsteen, Shonda Rhimes, Michael J. Fox, Sting, Shaggy, Ben Stiller and Courtney Cox. \n\nTrump came back to the press cabin on Air Force One during the flight to New York to note that the plane would be flying over Ashe stadium, but didn’t offer any further comment. \n\nTrump was once a U.S. Open mainstay, but hasn’t attended since he was loudly booed at a quarterfinals match in September 2015, months after launching his first presidential campaign. \n\nThe Trump Organization once controlled its own U.S. Open suite, which was adjacent to the stadium’s television broadcasting booth, but suspended it in 2017, during the first year of Trump’s first term. The family business is now being run by Trump’s sons with their father back in the White House. \n\nTrump was born in Queens, home of the U.S. Open, and for decades was a New York-area real estate mogul and, later, a reality TV star. Attending the tournament before he was a politician, he usually sat in the suite’s balcony during night matches and was frequently shown on the arena’s video screens.\n\nIn recent years, however, including between his presidential terms, Trump primarily lived at his Florida estate, Mar-a-Lago. \n\nAlcaraz said before the final that having Trump on-hand would be a privilege and “great for tennis,” but also suggested that such sentiment went for any president watching from the stands. “I don’t want myself to be nervous because of it,” he said.\n\nThe president has also frequently attended sporting events — where the roar of the crowd sometimes features people booing him while others cheer him. \n\nSince returning to the White House in January and prior to Sunday’s U.S Open swing, Trump went to the Super Bowl in New Orleans and the Daytona 500, as well as UFC fights in Miami and Newark, New Jersey, the NCAA wrestling championships in Philadelphia and the FIFA Club World Cup final in East Rutherford, New Jersey. \n\nHaving a sitting president attend the U.S. Open hasn’t happened since Bill Clinton went to the 2000 tournament, though former President Barack Obama and his wife, Michelle, attended the event’s opening night in 2023.\n\nAssociated Press writer Brian Mahoney contributed to this report.","summary":"President Donald Trump is attending the U.S. Open on Sunday as a guest of Rolex despite imposing steep tariffs on the Swiss watchmaker’s home country and with organizers seeking to keep any audience booing of him from being seen on the TV broadcast.","url":"https://www.bostonherald.com/2025/09/07/trump-attends-the-us-open-as-rolexs-guest-despite-swiss-tariffs-mixed-cheers-and-boos-greet-him/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Trump_US_Open_26906-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-07 11:45:44","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.029},{"id":358239850,"title":"EXCLUSIVE: George Goes Off! Clooney Shatters Sophisticated Image After Wild Rants About His Age, Talent, Marriage to Amal and Involvement in Politics – 'I Don't Give a S--t'","text":"Thin-skinned George Clooney is on a hair-trigger over his age, his talent, his marriage to Amal Clooney and his disastrous attempts to meddle in politics – and RadarOnline.com can reveal his increasingly nasty outbursts mean the suave, sophisticated image he has long cultivated is shattered for good.\n\n\"Do people say that I only play myself? I don't give a sh*t,\" he recently railed in an interview.George Goes Off\"Have you ever tried playing yourself? It's hard to do,\" he added defensively.\n\nAs reported, the vain Syriana actor has been grappling with age and marital issues, as well as criticism over how he kicked Joe Biden to the curb and backed the failed presidential bid of Kamala Harris in the 2024 election.\n\n\"I'm 63 years old, dude – I can't do 50 takes,\" he grumbled about making the upcoming Netflix film Jay Kelly. \"I don't have it in me. I've got the acting range from A to B.\"\n\nInsiders said George's foul moods are more frequent these days because Amal, 47, is fed up with him spending too much time on his projects and political meddling and not enough time at home with her and their 8-year-old twins, Ella and Alexander.Split RumorsShe notably did not attend opening night for George's Broadway run of Good Night, and Good Luck.\n\n\"Everyone expected Amal to be at the opening,\" said an insider. \"Her absence only increased chatter that their marriage is not in a good place.\"\n\nNow, sources said the grumpy old man had better cool it before he loses it.\n\nHis foul-mouthed fuming in the recent interview \"goes to show how sensitive he is to criticism and getting old,\" said a source. \"It must be stressful at home, or why else would he go off like this? George has been a time bomb for a while now.\"'Crabby George'Insiders said George has been crabby with friends, but that Amal gets the brunt of it.\n\n\"They don't tend to fight outright; they withdraw from each other,\" said a tipster. \"Amal does her best to shake him out of these moods, but he's getting increasingly cantankerous. He snaps a lot quicker than he used to.\n\n\"They've had their issues, and George isn't helping by being so tightly wound. People around him are telling him to lighten up.\"","summary":"George Clooney has shattered his sophisticated image with wild rants on age, talent, marriage to Amal, and politics.","url":"https://radaronline.com/p/george-clooney-marriage-politics-shatters-image-rants-age-talent/","image":"https://media.radaronline.com/brand-img/Z2eFY3kP8/0x0/george-clooney-shatters-image-rants-age-talent-marriage-politics-1756220528260.jpg","video":null,"publish_date":"2025-09-07 11:00:00","author":"Aaron Johnson","authors":["Aaron Johnson"],"language":"en","source_country":"us","sentiment":0.034},{"id":358275894,"title":"Pinkerton: Meet the New AI Boss, Same as the Old MSM Boss","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBART\n\nDept. of War\nLisa Cook Probe\nCrime Crackdown\nUK Migrant Battle\nEU Censorship\nIsrael vs Hamas\n\nPinkerton: Meet the New AI Boss, Same as the Old MSM Boss\n\n BNN via ChatGPT\n\nJames P. Pinkerton7 Sep 2025 \n\nArtificial Intelligence (AI)\n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nWoke's Not Dead: Trans Model Returns as Victoria's Secret Angel for 2025\nMcConnell Attacks Trump, Refuses to Say if U.S. Is Better Off in Trump Era\nRosie O’Donnell Promotes IG Post Calling Netanyahu a ‘Mass Murderer’\nGod's Influencer: Carlo Acutis Canonized as First Millennial Saint\nSuspect Behind North Carolina Train Stabbing Arrested, Charged with Murder\nRussia Hits Ukraine Gov't Building Amid Ariel Attack on Kyiv\nWatch: Rosie O’Donnell Says Trump Is a ‘Serial Pedophile Rapist’\nWhite House Body Slams Stephen King After He Said Trump Voters will Deny It\nActress Mia Farrow: Trump Strike on Tren de Aragua Boat ‘Was Murder'\nEric Adams Says He is the 'Only One That Can Beat Mamdani'\n\nFROM THE HOMEPAGE\n\nSuspect Behind Fatal North Carolina Train Stabbing Arrested, Charged with Murder\n‘God’s Influencer’ — Carlo Acutis Canonized as First Millennial Saint by Pope Leo\nJapan’s PM Shigeru Ishiba Resigns as Critics Call His ‘African Hometown’ Program a Gateway to Mass Migration\nRussia Hits Ukraine Gov’t Building Amid Drone and Missile Strikes on Kyiv\nActor-Comedian Jon Reep Arrested, Charged with Ten Counts of Child Sexual Exploitation\nReport: Trump Proposes Last-Minute Hostage Deal; Passed by Witkoff via Civilian to Hamas\nPinkerton: Meet the New AI Boss, Same as the Old MSM Boss\nNot a Boycott, but a Downgrade: Trump to Send Vance to South Africa in His Stead\nLAPD Ends Short-lived Protection for Kamala Harris\nOver 1,000 Illegals Arrive on UK Home Secretary Shabana Mahmood’s First Day in Office\nFilm Celebrating Futile, Self-Destructive Palestinian Violence Fêted at TIFF\nRosie O’Donnell Promotes IG Post Calling Netanyahu a ‘Mass Murderer’ and Trump a ‘Child Rapist’ \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"What does Google think of Breitbart News?  I asked it. I took headlines from Breitbart and turned them into questions to Google.  The answers were revealing, showing us how Google—including its artificial intelligence (AI) programs—plans to persuade us to be obedient liberals. \n\n\nThe post Pinkerton: Meet the New AI Boss, Same as the Old MSM Boss appeared first on Breitbart.","url":"https://www.breitbart.com/tech/2025/09/07/pinkerton-meet-the-new-ai-boss-same-as-the-old-msm-boss/","image":"https://media.breitbart.com/media/2025/09/AI-newspaper-640x480-1-640x335.png","video":null,"publish_date":"2025-09-07 10:30:13","author":"James P. Pinkerton","authors":["James P. Pinkerton"],"language":"en","source_country":"US","sentiment":-0.11},{"id":358231972,"title":"Police union, Republicans sound alarm on Kamala Harris’s makeshift security detail","text":"The CHP is authorized to provide security for current and former California constitutional officers when a threat assessment deems it necessary. Harris, a former state constitutional officer, is receiving protection coordinated by the agency in response to current concerns, sources told the Washington Examiner. \n\nBass called Trump’s actions “another act of revenge following a long list of political retaliation in the forms of firings, the revoking of security clearances and more.”\n\n“This puts the former Vice President in danger and I look forward to working with the Governor to make sure Vice President Harris is safe in Los Angeles,” she said. \n\nAbout a dozen LAPD officers have started working a detail to protect Harris, parking outside her Brentwood home. It’s unclear if they will be with her when she starts on her nationwide book tour, which begins at the end of the month in New York City. \n\nThe CHP and the LAPD have been tight-lipped on how long the around-the-clock security service will last and how much it will cost. \n\n“We do not comment on security arrangements,” the CHP told the Washington Examiner, while the LAPD confirmed it was “assisting the California Highway Patrol in providing protective services for former Vice President Kamala Harris until an alternate plan is established. ”\n\n“This temporary coordinated effort is in place to ensure that there is no lapse in security,” LAPD Communications Director Jennifer Forkish, told the Washington Examiner. \n\nSpending money to protect Harris isn’t sitting well with some, including the Los Angeles Police Protective League, the union that represents rank-and-file LAPD officers. \n\n“Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi-millionaire, with multiple homes and who can easily afford to pay for her own security, is nuts,” the union said in a statement. It added that Bass “should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base, then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness.”\n\nAssemblyman Carl DeMaio (R-CA) also had an issue with it. \n\n“It will reduce public safety plain and simple,” he told the Washington Examiner. “It’s not even an argument. It’s not even debatable. How dare Karen Bass and Gavin Newsom shortchange Californians’ and Los Angelenos’ safety so that they can give a politician protection? Nobody cares about Kamala Harris. Nobody is threatening her. She isn’t being given any less security than any other vice president. Vice presidents lose their security after six months. That has been perfectly fine for the past 40 years but no, apparently Californians are going to be on the hook to cater to her as servants.” \n\nSteve Hilton, who is running as a Republican candidate for governor, called Harris’s new security “completely outrageous and a corrupt abuse of public resources.” \n\n“It’s just having insult added to injury when we’ve got the absolute underfunding of police departments across the state, we are way below capacity, in terms of the number of police and sheriff’s deputies we need to fight crime,” he told the Washington Examiner. \n\nThe Secret Service usually protects a former vice president for six months after they leave office, but former President Joe Biden had signed an order extending Harris’s protection for a year beyond that. Harris’s aides had asked Biden’s team to extend protection due to safety concerns. Without the extension, Harris’s protection would have ended in July. \n\nA White House memorandum, signed by Trump, directed Homeland Security Secretary Kristi Noem “to discontinue any security-related procedures previously authorized by Executive Memorandum, beyond those required by law,” for Harris.\n\nTrump also pulled protection from Mike Pompeo, one of his former secretaries of state; former aide Brian Hook; John Bolton, Trump’s former national security adviser; and Anthony Fauci, who received death threats when he oversaw the COVID-19 pandemic. \n\nNot everyone is upset that Harris is getting star treatment on the public’s tab.\n\nJUDGE RULES TRUMP DEPLOYMENT OF NATIONAL GUARD TO LOS ANGELES VIOLATED FEDERAL LAW\n\nKaivan Shroff, a Democratic commentator and alumnus of the Hillary for America digital team, told the Washington Examiner that securing Harris’s safety is paramount.\n\n“Yes, protecting our first black woman vice president, despite Trump’s antics, is a good use of funds,” he said. “Kamala Harris — like many Democrats — has a target on her back because of the rhetoric Trump, Vance and other MAGA electeds use. The reality is that less than 3 months ago, a deranged Trump supporter murdered Melissa Hortman and her husband and shot their dog.”","summary":"Los Angeles police and the California Highway Patrol are providing taxpayer-funded security for former Vice President Kamala Harris — a move that has infuriated the police union and some Republican lawmakers.  The use of state and local resources was likely requested by Harris and approved by Los Angeles Mayor Karen Bass (D) and Gov. Gavin [&#8230;]","url":"https://www.washingtonexaminer.com/news/3795552/police-union-republicans-alarm-kamala-harris-security-detail/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP25054112368312.jpg?w=696","video":null,"publish_date":"2025-09-07 10:00:00","author":"Barnini Chakraborty","authors":["Barnini Chakraborty"],"language":"en","category":"politics","source_country":"US","sentiment":-0.208},{"id":358275890,"title":"LAPD Ends Short-lived Protection for Kamala Harris","text":"The Los Angeles Police Department (LAPD) ended its protection for former Vice President Kamala Harris just days after beginning it, following President Donald Trump’s withdrawal of her Secret Service protection.\n\nThe media, and the Democrats, made a fuss about the end of Secret Service protection, but vice presidents are not entitled to it, and past vice presidents have also lost their protection about six months after leaving office.\n\nCalifornia Gov. Gavin Newsom (D) made a show of diverting California Highway Patrol (CPD) officers to provide Harris with security, and the LAPD joined in, as reported Thursday by the Los Angeles Times:\n\nLos Angeles police Metropolitan Division officers, meant to be working crime-suppression assignments in hard-hit areas of the city, are instead providing security for former Vice President Kamala Harris, sources told The Times.\nThe department is “assisting the California Highway Patrol in providing protective services for former Vice President Kamala Harris until an alternate plan is established,” said Jennifer Forkish, L.A. police communications director. “This temporary coordinated effort is in place to ensure that there is no lapse in security.”\nA dozen or more officers have begun working a detail to protect Harris after President Trump revoked her Secret Service protection as of Monday. Sources not authorized to discuss the details of the plan said the city would fund the security but that the arrangement was expected to be brief, with Harris hiring her own security in the near future.\n\nBy Saturday, the LAPD had ended its involvement, the Los Angeles Times reported:\n\nThe Los Angeles Police Department on Saturday discontinued its protection for former Vice President Kamala Harris after heavy criticism within its own ranks that officers were being diverted from crime suppression, sources told The Times.\nLAPD Metropolitan Division officers had been assisting the California Highway Patrol in protecting Harris and were visible until Saturday morning outside her Brentwood home.\nBoth California police agencies scrambled this week to protect Harris after President Trump, her rival in November’s election, revoked Harris’s Secret Service protection last week. Thursday. President Biden had extended that protection for Harris beyond the six months after leaving office that vice presidents traditionally get.\n\nHarris has declined to run for governor in 2026. Her political future remains uncertain as she mulls another presidential run in 2028.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Zionist Conspiracy Wants You, now available on Amazon. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.","summary":"The Los Angeles Police Department (LAPD) ended its protection for former Vice President Kamala Harris just days after beginning it, following President Donald Trump's withdrawal of her Secret Service protection.\n\n\nThe post LAPD Ends Short-lived Protection for Kamala Harris appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/07/lapd-ends-short-lived-protection-for-kamala-harris/","image":"https://media.breitbart.com/media/2024/11/Kamala-Harris-silent-Associated-Press-640x335.jpg","video":null,"publish_date":"2025-09-07 09:35:43","author":"Joel B. Pollak","authors":["Joel B. Pollak"],"language":"en","source_country":"US","sentiment":-0.211},{"id":358251022,"title":"Courts keep striking down California laws infringing on free speech, gun rights","text":"Gov. Gavin Newsom and his fellow Democrats in the Legislature incessantly denounce President Donald Trump for trampling on civil rights in his lust for power.\n\nTheir current drive to sanction a gerrymander of California’s 52 congressional districts to add five Democratic seats is couched in assertions that it would help blunt Trump’s authoritarian tendencies. One pro-Proposition 50 ad describes Trump’s campaign for pro-Republican gerrymanders as a “blitzkrieg,” using language associated with Hitler and World War II Germany.\n\nHowever, as Newsom, et al, posture as saviors of democracy, they haven’t hesitated to infringe on constitutional rights themselves.\n\nFor instance, California’s restrictive laws governing gun ownership have drawn adverse decisions from federal judges in recent months who have applied U.S. Supreme Court interpretations of the constitutional right to bear arms. In the past, Newsom denounced judges who ruled against them as toadies of the firearms industry.\n\nCalifornia’s willingness to abridge constitutional rights extends beyond guns, however. Newsom and legislators also will challenge constitutionally protected free speech if it comes from those on the other side of the political divide.\n\nLast year, in response to some political parodies that used images created by artificial intelligence, including one that pilloried Vice President Kamala Harris, the Legislature passed and Newsom signed two measures to outlaw such tomfoolery.\n\nOne, Assembly Bill 2655, dubbed the Defending Democracy from Deepfake Deception Act, ordered social media platforms to block or label fictional AI-generated material. Babylon Bee, which generates right-wing satire, and X, Elon Musk’s social media site, filed suit to overturn the law. A month ago, federal Judge John Mendez struck it down for violating the federal Communications Decency Act, which provides immunity to platforms for posting by third parties.\n\nMendez bypassed the plaintiffs’ contention that the measure unconstitutionally abridged free speech rights. However, he indicated that the second measure, Assembly Bill 2839, did violate the Constitution. Last week, Mendez took that a step further, declaring that by prohibiting deepfake material within 120 days of an election, AB 2839 restricted free speech.\n\n“To be sure, deepfakes and artificially manipulated media arguably pose significant risks to electoral integrity, but the challenges launched by digital content on a global scale cannot be quashed through censorship or legislative fiat,” Mendez wrote, adding, “Just as the government may not dictate the canon of comedy, California cannot preemptively sterilize political content.”\n\nThe judge also noted that the state Constitution protects speech so “it follows that AB 2839 violates California’s Constitution for all of the same reasons that it violates the First Amendment of the United States Constitution.”\n\nDespite having the two bills shot down by court, California’s politicians seem bent on once again trying to influence what Californians can be told via social media and the Internet.\n\nIt stems from the often bitter debate over Israel’s invasion of Gaza in the wake of a deadly Hamas attack on Israel two years ago. The bill is mainly sponsored by pro-Israel groups who say it’s needed to block antisemitic threats. However, groups such as the Council on American-Islamic Relations argue that opening up potential financial penalties would encourage platforms to reduce or eliminate criticism of the war.\n\nAn Assembly Judiciary Committee analysis suggested that if SB 771 is enacted it might run afoul of the federal law protecting media platforms from liability for third-party content — the same law cited by Mendez in his decision on the state deepfake law.\n\nDan Walters is a CalMatters columnist.","summary":"Courts keep striking down California laws infringing on free speech, gun rights","url":"https://www.presstelegram.com/2025/09/05/courts-keep-striking-down-california-laws-infringing-on-free-speech-gun-rights/","image":"https://www.presstelegram.com/wp-content/uploads/2025/09/OCR-L-OCIMMIGRATION-0814_004_232537592.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-07 08:03:20","author":"Gqlshare","authors":["Gqlshare"],"language":"en","source_country":"au","sentiment":0.138},{"id":358165976,"title":"24/7 Security Team for Kamala Harris Withdrawn by Los Angeles Police","text":"The LAPD has dropped its around-the-clock protection for former Vice President Kamala Harris following outrage from conservatives and pressure from the city’s police union.\n\nThe move comes after President Donald Trump revoked Harris’s Secret Service protection earlier this year, cutting short an extension granted by former President Joe Biden that would have lasted until July 2026.\n\nIn response, Los Angeles Mayor Karen Bass had directed LAPD resources to continue safeguarding Harris, according to The Los Angeles Times.\n\nBut the decision drew criticism from the Los Angeles Police Protective League, the union representing rank-and-file officers. The union argued that officers were being diverted from crime suppression duties to provide security for a wealthy political figure who, in their view, could afford private protection.\n\n‘Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi-millionaire with multiple homes and who can easily afford to pay for her own security is nuts,’ the union’s board said in a statement.\n\nThe board also dragged California Governor Gavin Newsom into the dispute, blasting the use of public funds for Harris’s security.\n\n‘The mayor should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness,’ the statement continued.\n\nTypically, former vice presidents receive Secret Service protection for six months after leaving office.\n\nHowever, Biden had extended Harris’s protection period to 18 months, a decision which Trump reversed in August.\n\n‘The Vice President is grateful to the United States Secret Service for their professionalism, dedication, and unwavering commitment to safety,’ Harris’ senior adviser Kirsten Allen told CNN at the time.\n\nDuring her time under both the Secret Service and LAPD, Harris reportedly received 24/7 surveillance, including officers stationed outside her Brentwood residence.\n\nAccording to FOX 11, those officers were drawn from elite LAPD units typically assigned to investigative and suppression tasks.\n\nThe situation has also ignited public backlash as local residents and political commentators took to social media to slam the use of city resources.\n\nReality TV personality Spencer Pratt wrote on X: ‘NEWSOM AND KAREN BASS HAVE ENOUGH RESOURCES TO HAVE LAPD AND CHP PROTECT KAMALA HARRIS BUT NOT ENOUGH TO MAKE SURE PEOPLE AREN’T TRESPASSING ON OUR DIRT LOT IN THE PALISADES AND DOING SELFIES??????!!!!’\n\nLA Republican official Lisa Cusack added: ‘Democrat elites truly have no souls.’\n\nWhen asked about the controversy, Bass released a statement defending the city’s decision and criticizing Trump’s removal of federal protection.\n\n‘This is another act of revenge following a long list of political retaliation in the form of firings, the revoking of security clearances and more,’ Bass said.\n\n‘This puts the former Vice President in danger and I look forward to working with the Governor to make sure Vice President Harris is safe in Los Angeles.’\n\nThe LAPD told the Daily Mail on Thuraday: ‘For security reasons, the LAPD never discusses the existence of these assignments or provides details surrounding protective operations.’\n\nHarris, who has a 15-stop book tour planned to promote her upcoming memoir 107 Days, is now expected to rely on private security.\n\nThe memoir, referencing the length of her brief 2024 presidential campaign, will be released on September 23, with the tour kicking off the next day. Stops are scheduled across the U.S. and abroad, including London and Toronto.\n\nGoing forward, the California Highway Patrol has reportedly offered to assist with security, The Los Angeles Times reported.\n\nTrump’s removal of Harris’s protection follows similar decisions involving former officials.\n\nThe 47th President previously cut security for former national security adviser John Bolton and former Secretary of State Mike Pompeo – despite reported threats from Iran.\n\nMost recently, he revoked Secret Service coverage for Hunter and Ashley Biden, President Biden’s adult children.\n\nThough it’s not unusual for former vice presidents to lose protection after six months, it is also not uncommon for extensions to be granted – especially in cases involving ongoing threats.\n\nAccording to a White House official, a recent Secret Service threat assessment found no credible or ongoing threats to Harris, leading the administration to determine that extended protection was not necessary.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe LAPD has dropped its around-the-clock protection for former Vice President Kamala&#8230;\n\n\nThis Post: 24/7 Security Team for Kamala Harris Withdrawn by Los Angeles Police first appeared on Internewscast Journal","url":"https://internewscast.com/news/24-7-security-team-for-kamala-harris-withdrawn-by-los-angeles-police/","image":"https://internewscast.com/wp-content/uploads/2025/09/Los-Angeles-police-pulls-Kamala-Harris-elite-247-protection.jpg","video":null,"publish_date":"2025-09-07 07:03:36","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.018},{"id":358163154,"title":"Sanders, Mamdani rally progressive voters as NYC mayor’s race intensifies","text":"Vermont Senator Bernie Sanders has been travelling around the United States on his Fighting the Oligarchy Tour — a series of town halls aimed at engaging progressive voters nationwide.\n\nOn Saturday evening, he brought that message to his alma mater, Brooklyn College, for a joint town hall with New York City mayoral candidate Zohran Mamdani.\n\nSeated beside the longtime progressive politician, Mamdani drew 1,700 people as the clear frontrunner in the city’s mayoral race — a contest now drawing national attention as progressives view him and candidates like him as a way to energise their movement and also fuelling the ire and concerted attacks from the right, including from President Donald Trump.\n\n“Politics can be powered by ordinary people,” Mamdani told the packed auditorium.\n\nThe event, part of Sanders’s tour that has already reached 21 states and more than 300,000 people, underscored the growing national spotlight on New York’s mayoral race and the increasingly hostile rhetoric from the White House towards the progressive assembly member.\n\nOn Friday, Trump inaccurately referred to Mamdani — a Democratic socialist — as “a communist”.\n\nMamdani has long faced criticism from more moderate Democrats and Republicans for his policies, which they have labelled as unrealistic and extreme, particularly his approach to economic issues, contrary to Al Jazeera’s analysis.\n\nBut the message that resonated strongly with supporters was about the growing income inequality and the consolidation of wealth in fewer hands.\n\nSanders focused on national issues, directing sharp criticism at billionaire owners of major media companies, including David Ellison, who now oversees Paramount, which owns CBS News, and whom Sanders argues are not being critical enough of the White House under their new ownership.\n\nThe network, which recently merged with Skydance Media, paid $16m to settle a lawsuit alleging that an interview with then-Democratic presidential hopeful Kamala Harris had been altered. Earlier this week, CBS also announced that it would no longer edit interviews on its Sunday political show Face the Nation following complaints from the Trump administration.\n\nSanders also took aim at Elon Musk, the billionaire CEO of Tesla. On Friday, Tesla shareholders approved a $1 trillion compensation package for the world’s richest man.\n\n“We are living in a crazy world,” Sanders said.\n\n“Millions of people are struggling to put food on the table, and they [Tesla shareholders] are making one guy a trillionaire.”\n\nMamdani focused his attention on big businesses like the delivery service DoorDash, which spent $1m in efforts to defeat Mamdani, calling it out twice in the town hall.\n\n“New York City is not for sale,” Mamdani said.\n\nEven as criticisms of that campaign are not friendly to the larger business community, Mamdani has been taking on those concerns. In July, not long after clinching the Democratic nomination, Mamdani met business leaders from across New York to address their concerns about his policy stances, which The Partnership for New York City — a business advocacy group — said was “productive”.\n\nEven so, the core of the message that Mamdani and Sanders tapped into was a sentiment outside the business community, issues that resonated with working- and middle-class supporters, which have driven Mamdani’s campaign.\n\nChildcare was among the topics brought up by locals at the town hall, which, according to the New York City Council, can cost as much as 25 percent of household income.\n\nOne in the audience, a working mother, said she spends $36,000 on childcare a year.\n\n“We have to feel the depth of the statistics we have grown numb to,” Mamdani said in response to a teacher who asked about his plan on childcare.\n\nMamdani has proposed free childcare for children aged between six weeks and five years.\n\nTrump’s thumb on the scale\n\nBut his efforts come amid concerns that the Trump administration may be trying to meddle in the New York mayoral race after allegedly offering support to incumbent Eric Adams, currently in fourth place in the polls, trailing Mamdani, who holds a double-digit lead over Andrew Cuomo, the former governor of New York state and his nearest competitor, according to all major polls except one from the right-leaning Manhattan Institute. Republican Curtis Sliwa follows behind Adams.\n\nAdams is reportedly being considered for a role in the Trump administration. The New York Times reported that Trump is considering nominating him to be the ambassador to Saudi Arabia, citing four people familiar with the matter. On Friday, Trump denied the claims that he is considering Adams for the role.\n\nIt comes days after Adams denied he was in talks with the Trump administration to be considered for a post in the Department of Housing and Urban Development.\n\nAdams told reporters on Friday that he would not drop out of the race amid another New York Times report that the controversy embroiling the mayor is also being considered for suspending his re-election bid.\n\nRepresentatives for Adams’s campaign did not respond to Al Jazeera’s request for comment.\n\nCuomo also pushed back on the president’s alleged involvement in the race.\n\n“I don’t want him [Trump] involved in anything to do with my race,” Cuomo told reporters on Friday.\n\nCuomo, who is in second, still believes that the Mamdani camp is concerned that if Adams or Curtis Sliwa, another Republican, were to drop out of the race, voters would flock to his campaign.\n\nWhile Mamdani holds a commanding lead in the polls, he has not broken the 50 percent mark on any of them.\n\nCuomo’s campaign did not respond to Al Jazeera’s request for comment.\n\nMamdani also pushed back on Trump’s involvement in the race.\n\n“This is a city where we will choose our own mayor,” Mamdani said.\n\nMamdani also called out Bill Ackman, CEO of the hedge fund Pershing Square, who posted on X that Mayor Adams should step aside from the race. And when Mamdani clinched the Democratic nomination, Ackman promised to fund a more “centrist” candidate.\n\nA national push\n\nNew York’s mayoral race has drawn outsized attention as the nation’s largest city and a global hub for finance and media, but it is far from the only place where progressives are gaining ground. Across the US, left-leaning candidates are mounting challenges in cities both large and small, often centred on widening income inequality, housing costs, and worker protections.\n\nSanders pointed out that Mamdani’s surge and the backlash from the White House are, in his view, because the progressive wave has momentum.\n\n“What they are afraid of is Mamdani becoming an example of what could happen all over the US,” Sanders told the supporters.\n\nIn Minneapolis, state Senator Omar Fateh, a progressive Democrat, is running for mayor against incumbent Jacob Frey. His campaign, echoing themes raised by Mamdani in New York, emphasises affordable housing and stronger protections for workers.\n\nIn Albuquerque, New Mexico, Alex Uballaz is running on a “housing for all” platform, pledging tougher rental protections and more transitional housing for residents struggling with addiction.\n\nIn Seattle, Washington, Katie Wilson, a progressive organiser, is challenging Mayor Bruce Harrell with a platform focused on the rising cost of housing, homelessness, and support for small businesses.\n\nBut the movement faces obstacles, including at the federal level. In Chicago, Mayor Brandon Johnson has clashed with Trump, who has called for federal intervention to address violent crime. Trump has described the city as a “killing field” despite crime rates trending downwards. Chicago’s homicide rate in the first half of 2025 was 33 percent less than the same timeframe the year prior.\n\nBack in New York, Mamdani said the city must be prepared if Trump does the same thing in the city.\n\n“We have to prepare for the inevitability of that deployment. We cannot try to convince ourselves that because something is illegal, Donald Trump will not do it,” Mamdani said.\n\nHe emphasised the need for coordination with state officials, citing California as an example: there, the mayor of Los Angeles, the state attorney general, and Governor Gavin Newsom successfully challenged a national guard deployment in court, which was ruled as illegal.\n\nStill, if Trump were to send in the guard under the banner of fighting crime, he would not be the first. Just last year, Democratic Governor Kathy Hochul deployed the national guard to patrol New York’s subway system in the name of public safety, even though crime there had already been steadily declining.\n\nNew York police data released last week showed that the city recorded fewer shootings in the first eight months of this year than during any comparable period in its history.","summary":"Mamdani discusses how he plans to address income inequality and affordability issues in the largest US city.","url":"https://www.aljazeera.com/news/2025/9/7/sanders-mamdani-rally-progressive-voters-as-nyc-mayors-race-intensifies?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/09/2025-09-06T235336Z_2106023733_RC2NMGA55KK1_RTRMADP_3_USA-ELECTION-NEW-YORK-1757211272.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-09-07 06:39:07","author":"Andy Hirschfeld,Apps Support","authors":["Andy Hirschfeld","Apps Support"],"language":"en","source_country":"QA","sentiment":0.214},{"id":358251028,"title":"Mimicking Donald Trump will only get Gavin Newsom so far","text":"The Democratic Party brand is in the gutter and at least one of its aspiring standard bearers is settling for chasing his own ambitions instead of trying to effectively pump life into the flailing party.\n\nRecent polling shows the Democratic Party’s approval rating is at the lowest it’s been in decades. Fewer than one quarter of registered voters have a favorable view of the party, while 56 percent hold a negative view, according to a CNBC poll from a few weeks ago.\n\nIt turns out that Joe Biden’s ‘Weekend at Bernie’s” presidency and the Democratic coverup did considerable damage to the party’s brand. And instead of pushing forward with real solutions to the real problems voters face, Democrats have focused almost exclusively on opposing Trump, who is like a catnip to them.\n\nThe constant focus on attacking Trump with little solution-based messaging means they are constantly being defined by Trump, proving that simply being someone who is not someone else is not an inspiring strategy.\n\nMany Democrats have deluded themselves into thinking they lost to Trump twice because they didn’t fight or fight hard enough, especially since they have fought him constantly over the past decade.\n\nLiberal data guy Nate Silver wrote gleefully that the abhorrent national gerrymandering fight, which California Democrats are proudly diving into, signals the end of a decade-plus of a “when they go low, we go high” attitude among Democratic leaders.\n\n“Democrats are fighting mad about Trump-led Republican efforts to conduct mid-decade redistricting in Texas and other states in advance of next year’s midterms — and, perhaps for a change, they’re in a mood to fight back,” he wrote.\n\nSilver’s comments mirror those of many others, including Democratic voters and Gov. Gavin Newsom, who are all clearly misremembering the recent past. I’m not sure at what point Democrats went high in their interactions with Trump: They impeached him twice, prided themselves on how often Democratic states sued the Trump administration, passed laws to try to block his access to the ballot and pursued criminal charges against him, just to name a few things.\n\nThis is all on top of the late-night TV and social media posts mocking him, countless Democrats campaigning against him, and endless news and opinion articles calling him everything from a felon to a rapist to a threat to democracy to Hitler.\n\nIn other words, it’s absurd to think Democrats’ problem was they didn’t fight enough. They might not have fought effectively, but there wasn’t a lack of effort.\n\nWatching the campaign for the Democratic presidential nomination shape up suggests change is not coming soon for Democrats. Former Vice President Kamala Harris can’t decide what she wants to do but she apparently saddled the Democratic National Committee with millions of dollars of debt, which has left a large opening for Newsom, who is trying every gimmick to get attention except actually doing a good job governing.\n\nFor the past few months, Newsom tapped his social media team to impersonate Trump online, typing in all caps, making self-aggrandizing claims (more than normal, that is), and being generally combative. Apparently, it’s working a little.\n\nNewsom has enjoyed a 13-point bump year over year in the latest Emerson College poll, which shows him outperforming former Vice President Kamala Harris.\n\nNewsom has every incentive to keep the ruse going, but it’s going to be a lot of work to pretend to be someone else for the next few years, especially someone Newsom has called a grifter and compared to Hitler.\n\nNewsom and his catty social media team often boast about how well California performs compared to all other states. But the claims are only true in ways that have nothing to do with Newsom. Does anyone actually think California’s economic wealth has much to do with Newsom’s decision-making? Where Newsom is involved (or completely absent, as the case may be) the state is bad and getting worse.\n\nWorking against Newsom is the fact that he’ll have to keep coming up with gimmicks because his record in California is one of failure. This is the same Newsom who just a few years ago helped inspire progressive thought leader Ezra Klein to write damningly in the New York Times: “If progressivism can’t work there, why should the country believe it can work anywhere else?”\n\nThat was in 2021. Newsom has done nothing to change that perception, though he’ll tweet a bunch of lies and half truths that say otherwise.\n\nThis is also the same Newsom who a few months ago was pretending to be moderate, even somewhat conservative, pro-gun and manly. This was after years of decrying what he called toxic masculinity.\n\nIn fact, there have been so many Newsom’s over the past few years, so many desperate pleas for attention, that something had to work eventually.\n\nBut it probably won’t last. Newsom is having a moment now, but sooner or later impersonating Trump won’t be enough.\n\nIf Democratic leaders are interested in expanding their appeal, they should start by showing they can solve a problem. Any problem. Pick one. There are plenty of things voters need help with.\n\nAnd voters should hold them accountable. Don’t reward Newsom for being obnoxious; reward him for being effective – if he can figure out how.\n\nMatt Fleming is a columnist for the Southern California News Group. Follow him on X @FlemingWords and write to him at flemingwords@gmail.com","summary":"Mimicking Donald Trump will only get Gavin Newsom so far","url":"https://www.presstelegram.com/2025/09/06/mimicking-donald-trump-will-only-get-gavin-newsom-so-far/","image":"https://www.presstelegram.com/wp-content/uploads/2025/08/LDN-L-REDISTRICTING-0810-01.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-07 06:34:03","author":"Gqlshare","authors":["Gqlshare"],"language":"en","category":"politics","source_country":"au","sentiment":-0.476},{"id":358145718,"title":"Los Angeles police pulls Kamala Harris' elite 24/7 protection after outcry from conservatives","text":"The LAPD has dropped its around-the-clock protection for former Vice President Kamala Harris following outrage from conservatives and pressure from the city's police union.\n\nThe move comes after President Donald Trump revoked Harris's Secret Service protection earlier this year, cutting short an extension granted by former President Joe Biden that would have lasted until July 2026.\n\nIn response, Los Angeles Mayor Karen Bass had directed LAPD resources to continue safeguarding Harris, according to The Los Angeles Times.\n\nBut the decision drew criticism from the Los Angeles Police Protective League, the union representing rank-and-file officers. The union argued that officers were being diverted from crime suppression duties to provide security for a wealthy political figure who, in their view, could afford private protection.\n\n'Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi-millionaire with multiple homes and who can easily afford to pay for her own security is nuts,' the union's board said in a statement.\n\nThe board also dragged California Governor Gavin Newsom into the dispute, blasting the use of public funds for Harris's security.\n\n'The mayor should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness,' the statement continued.\n\nTypically, former vice presidents receive Secret Service protection for six months after leaving office.\n\nHowever, Biden had extended Harris's protection period to 18 months, a decision which Trump reversed in August.\n\n'The Vice President is grateful to the United States Secret Service for their professionalism, dedication, and unwavering commitment to safety,' Harris' senior adviser Kirsten Allen told CNN at the time.\n\nDuring her time under both the Secret Service and LAPD, Harris reportedly received 24/7 surveillance, including officers stationed outside her Brentwood residence.\n\nAccording to FOX 11, those officers were drawn from elite LAPD units typically assigned to investigative and suppression tasks.\n\nThe situation has also ignited public backlash as local residents and political commentators took to social media to slam the use of city resources.\n\nReality TV personality Spencer Pratt wrote on X: 'NEWSOM AND KAREN BASS HAVE ENOUGH RESOURCES TO HAVE LAPD AND CHP PROTECT KAMALA HARRIS BUT NOT ENOUGH TO MAKE SURE PEOPLE AREN'T TRESPASSING ON OUR DIRT LOT IN THE PALISADES AND DOING SELFIES??????!!!!'\n\nLA Republican official Lisa Cusack added: 'Democrat elites truly have no souls.'\n\nWhen asked about the controversy, Bass released a statement defending the city's decision and criticizing Trump's removal of federal protection.\n\n'This is another act of revenge following a long list of political retaliation in the form of firings, the revoking of security clearances and more,' Bass said.\n\n'This puts the former Vice President in danger and I look forward to working with the Governor to make sure Vice President Harris is safe in Los Angeles.'\n\nThe LAPD told the Daily Mail on Thuraday: 'For security reasons, the LAPD never discusses the existence of these assignments or provides details surrounding protective operations.'\n\nHarris, who has a 15-stop book tour planned to promote her upcoming memoir 107 Days, is now expected to rely on private security.\n\nThe memoir, referencing the length of her brief 2024 presidential campaign, will be released on September 23, with the tour kicking off the next day. Stops are scheduled across the U.S. and abroad, including London and Toronto.\n\nGoing forward, the California Highway Patrol has reportedly offered to assist with security, The Los Angeles Times reported.\n\nTrump's removal of Harris's protection follows similar decisions involving former officials.\n\nThe 47th President previously cut security for former national security adviser John Bolton and former Secretary of State Mike Pompeo - despite reported threats from Iran.\n\nMost recently, he revoked Secret Service coverage for Hunter and Ashley Biden, President Biden's adult children.\n\nThough it's not unusual for former vice presidents to lose protection after six months, it is also not uncommon for extensions to be granted - especially in cases involving ongoing threats.\n\nAccording to a White House official, a recent Secret Service threat assessment found no credible or ongoing threats to Harris, leading the administration to determine that extended protection was not necessary.","summary":"The move comes after Trump revoked Harris's Secret Service protection earlier this year, cutting short an extension granted by Joe Biden that would have lasted until July 2026.","url":"https://www.dailymail.co.uk/news/article-15073917/Los-Angeles-police-pulls-Kamala-Harris-elite-24-7-protection-outcry-conservatives.html","image":"https://i.dailymail.co.uk/1s/2025/09/07/06/101910935-0-image-m-52_1757223167744.jpg","video":null,"publish_date":"2025-09-07 05:38:55","author":"Editor,Samantha Rutt","authors":["Editor","Samantha Rutt"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.018},{"id":358176836,"title":"Kamala Harris will no longer receive protection from LAPD","text":"As of Saturday, that detail has since been disbanded, sources told the Los Angeles Times.\n\nThe move is relatively unsurprising, as the additional LAPD protection for Harris was previously described by an official as a “temporary coordinated effort” with CHP “until an alternate plan is established.”\n\nBut it does follow frustration from LAPD officers, with the biggest police union in Los Angeles slamming the earlier formation of the detail, which was organized by Los Angeles Mayor Karen Bass, as “nuts.”\n\nNEWSOM COMPARES CALIFORNIA’S HOMICIDE RATE TO RED STATES. DOES HE HAVE A POINT?\n\n“Mayor Karen Bass should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base, then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness,” a statement from the Los Angeles Police Protective League said.\n\nThe union added that Harris can “easily afford to pay for her own security,” which may be needed as she is set for 15-city book tour starting on Sept. 24 and lasting until Nov. 20. The book, 107 Days, is slated to release on Sept. 23.","summary":"Former Vice President Kamala Harris will no longer receive protection from the Los Angeles Police Department after backlash from officers who were reportedly pulled from crime prevention efforts for the security detail. Officers within the LAPD&#8217;s Metropolitan Division had been assisting California Highway Patrol in protecting Harris after President Donald Trump revoked her Secret Service [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3796325/kamala-harris-will-no-longer-receive-protection-lapd/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/kamala-harris-lapd-protection-gone.jpg?w=696","video":null,"publish_date":"2025-09-07 01:18:17","author":"Zach LaChance","authors":["Zach LaChance"],"language":"en","source_country":"US","sentiment":0.132},{"id":358113146,"title":"LAPD ends its protection of Kamala Harris after backlash","text":"The Los Angeles Police Department has stopped providing protection to former Vice President Kamala Harris amid backlash from a police organization.\n\nAfter President Donald Trump ended Secret Service protection for the former vice president earlier this year, LA Mayor Karen Bass extended Harris protection via the LAPD, according to the Los Angeles Times.\n\nThe Los Angeles Police Protective League, which says its mission is to \"vigilantly protect, promote, and improve the working conditions, legal rights, compensation, and benefits of Los Angeles police officers,\" complained that officers who were assigned to crime suppression tasks were pulled away to guard Harris.\n\n\"Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi- millionaire with multiple homes and who can easily afford to pay for her own security is nuts,\" the board said in a statement.\n\nThe board continued lashing out and pulled California Governor Gavin Newsom into its criticism.\n\n\"The mayor should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness,\" it said.\n\nIt's standard protocol for former vice president to receive protection from the Secret Service for six months after they leave office.\n\nPresident Joe Biden extended Harris's protection period to 18 months, which would have kept a detail on her until July 2026. But Trump canceled that extension in August.\n\n“The Vice President is grateful to the United States Secret Service for their professionalism, dedication, and unwavering commitment to safety,” Kirsten Allen, one of Harris's senior advisors, told CNN at the time.\n\nWhen Harris had security through the Secret Service and later the LAPD, she had 24-7 surveillance at her home and the constant presence of officers at her Los Angeles home.\n\nNewsom, through a spokesperson, condemned Trump's actions at the time.\n\n“The safety of our public officials should never be subject to erratic, vindictive political impulses,” the spokesperson, Bob Salladay, told CNN.\n\nHarris has a book tour planned to promote her memoir. It's unclear who is going to be providing her security during those visits, but it is likely that she or her publisher will need to hire private security.\n\nAccording to a report from the LA Times, the California Highway Patrol has also offered to provide security for Harris.\n\nThe former vice president isn't the only official to have their protection revoked by Trump.\n\nBoth former national security adviser John Bolton and former Secretary of State Mike Pompeo had their protections withdrawn, even as both were reportedly under threat from Iran.\n\nMore recently, Trump ended the Secret Service protection for former President Biden's children, Hunter and Ashley, after Biden extended their Secret Service protections.","url":"https://uk.news.yahoo.com/lapd-ends-protection-kamala-harris-004606298.html","image":"https://s.yimg.com/ny/api/res/1.2/to9DVrCUEyA9A3VpQm_aZA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/3e548b6531afc790e68b2aa275a3f232","video":null,"publish_date":"2025-09-07 00:46:06","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","source_country":"gb","sentiment":-0.337},{"id":358112508,"title":"LAPD ends its protection of Kamala Harris after backlash","text":"The Los Angeles Police Department has stopped providing protection to former Vice President Kamala Harris amid backlash from a police organization. \n\nAfter President Donald Trump ended Secret Service protection for the former vice president earlier this year, LA Mayor Karen Bass extended Harris protection via the LAPD, according to the Los Angeles Times.\n\nThe Los Angeles Police Protective League, which says its mission is to \"vigilantly protect, promote, and improve the working conditions, legal rights, compensation, and benefits of Los Angeles police officers,\" complained that officers who were assigned to crime suppression tasks were pulled away to guard Harris. \n\n\"Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi- millionaire with multiple homes and who can easily afford to pay for her own security is nuts,\" the board said in a statement. \n\nThe board continued lashing out and pulled California Governor Gavin Newsom into its criticism. \n\n\"The mayor should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness,\" it said. \n\nIt's standard protocol for former vice president to receive protection from the Secret Service for six months after they leave office. \n\nPresident Joe Biden extended Harris's protection period to 18 months, which would have kept a detail on her until July 2026. But Trump canceled that extension in August. \n\n“The Vice President is grateful to the United States Secret Service for their professionalism, dedication, and unwavering commitment to safety,” Kirsten Allen, one of Harris's senior advisors, told CNN at the time. \n\nWhen Harris had security through the Secret Service and later the LAPD, she had 24-7 surveillance at her home and the constant presence of officers at her Los Angeles home. \n\nNewsom, through a spokesperson, condemned Trump's actions at the time. \n\n“The safety of our public officials should never be subject to erratic, vindictive political impulses,” the spokesperson, Bob Salladay, told CNN. \n\nHarris has a book tour planned to promote her memoir. It's unclear who is going to be providing her security during those visits, but it is likely that she or her publisher will need to hire private security. \n\nAccording to a report from the LA Times, the California Highway Patrol has also offered to provide security for Harris. \n\nThe former vice president isn't the only official to have their protection revoked by Trump. \n\nBoth former national security adviser John Bolton and former Secretary of State Mike Pompeo had their protections withdrawn, even as both were reportedly under threat from Iran. \n\nMore recently, Trump ended the Secret Service protection for former President Biden's children, Hunter and Ashley, after Biden extended their Secret Service protections.","summary":"The California Highway Patrol has reportedly offered the former vice president protection, according to a report","url":"https://www.independent.co.uk/news/world/americas/us-politics/lapd-ends-protection-kamala-harris-b2821644.html","image":"https://static.independent.co.uk/2025/08/29/19/TRUMP_HARRIS_SERVICIO_SECRETO_50476.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/RX9kXHaH-OhrQWqOm.mp4","publish_date":"2025-09-07 00:46:06","author":"Graig Graziosi","authors":["Graig Graziosi"],"language":"en","source_country":"gb","sentiment":-0.337},{"id":358103064,"title":"Travis Kelce's friend sucks up to Chargers man who smacked the Chiefs star with cringe Instagram comment","text":"Travis Kelce's friend sucks up to Chargers man who smacked the Chiefs star with cringe Instagram comment\n\nREAD MORE: Chargers giant Teair Tart brutally mocks Travis Kelce over slap\n\nBy JAMES COHEN, SPORTS REPORTER\n\nPublished: 01:17 BST, 7 September 2025 | Updated: 01:24 BST, 7 September 2025\n\nTravis Kelce's friend, and ex-NFL player, Taylor Lewan has seemingly turned his back on the Chiefs star after mocking him with an Instagram comment. \n\nOn Friday night, Kelce was smacked in the face by Los Angeles Chargers defender Teair Tart midway through the Chiefs' 27-21 season-opening defeat in Brazil. \n\nThe pair came to blows after the Chiefs star blocked Tart on a drive for his team that would end with a Patrick Mahomes touchdown, before the 6ft 2in, 315-pound Chargers tackle seemed to take exception with how hard he was pushing him. \n\nWhen he let go, he stared back at Kelce before striking him across the helmet with an open palm in a shocking moment which quickly went viral.\n\nWhile Swifties bombarded Tart's social media comment section, ex-NFL star Lewan - who previously hosted Kelce on his podcast - seemed to back the Chargers man. \n\nTart took to Instagram to claim he was 'too swift with it even in Brazil' - a clear nod to Kelce's fiance - before Lewan said: 'Will smith’d the s*** outta Trav [laughing emojis]'.\n\nLos Angeles Chargers defender Teair Tart has poked fun at his viral slap on Travis Kelce \n\nFormer NFL star Taylor Lewan - who has previously been pictured alongside Kelce and Taylor Swift - appeared to mock the Chiefs star with a comment on the incident\n\nLegendary actor Will Smith infamously smacked Chris Rock on stage at the Oscars back in 2022, with the moment instantly being etched into pop culture history.\n\nWhile Lewan saw the funny side to the incident, Kelce fans quickly responded to his comment and it's fair to say that they were not happy. \n\nOne user wrote: 'wow some loyalty there'. Another said: 'And neither was cool. What a s*** thing to say. Fair-weather friend'.\n\nAnother fan said: 'got it…so you used TK and TS for your podcast views and enjoy him getting fully disrespected in a personal way on here'.\n\nAnd amid the outrage from Swifties, Tart added fuel to the fire by reposting a famous Dave Chappelle skit depicting American singer and songwriter Rick James slapping comedian Charlie Murphy.\n\nHe shared the skit - which sees Chappelle's fictional James character ask Murphy 'what did the five fingers say to the face?' before smacking him - along with two laughing emojis in a clear reference to his altercation with Kelce.\n\nMeanwhile, back in June, both Kelce and Swift posed for a picture alongside Lewan and his co-host for the 'Bussin' With The Boys' podcast, Will Compton, at Kelce's Tight End University events in Nashville.\n\nHowever, due to their affiliation with Donald Trump, Swift and Kelce came under fire for hanging with the duo, who shared the photo of the quartet on social media.\n\nFans of Kelce - and Taylor Swift - labelled Lewan a 'fair-weather friend' after his comment\n\nChiefs star Kelce has made multiple appearance on Lewan's podcast; Bussin' With The Boys\n\n'Confirmed: Taylor Swift is FOR THE BOYS,' they captioned the picture on social media. But the viral image has caused fury among Swifties, one of whom asked: 'Where the f*** is her self-respect?'\n\nA week after the photo was posted, Kelce featured on the 'Bussin' With The Boys' podcast for the second time, having made his debut on the show last year.\n\nDonald Trump appeared on 'Bussin With The Boys' ahead of last year's election and the ex-NFL stars were even given a shoutout during his victory celebrations.\n\nDana White namechecked the podcast for helping propel Trump to victory over Kamala Harris. Back in 2023, Compton and Lewan were also seen shaking hands with the president at a UFC event.\n\nLos Angeles ChargersTravis KelceBrazil\n\nShare or comment on this article:\nTravis Kelce's friend sucks up to Chargers man who smacked the Chiefs star with cringe Instagram comment\n\nAdd comment","summary":"On Friday night, Kelce was smacked in the face by Los Angeles Chargers defender Teair Tart midway through the Chiefs' 27-21 season-opening defeat in Brazil.","url":"https://www.dailymail.co.uk/sport/nfl/article-15073337/Travis-Kelce-Chargers-smack-Chiefs-Instagram-comment.html","image":"https://i.dailymail.co.uk/1s/2025/09/07/01/101892801-0-Los_Angeles_Chargers_defender_Teair_Tart_has_poked_fun_at_his_vi-a-16_1757203708513.jpg","video":null,"publish_date":"2025-09-07 00:24:50","author":"Editor,James Cohen","authors":["Editor","James Cohen"],"language":"en","source_country":"gb","sentiment":0.276},{"id":358104292,"title":"2025 Creative Arts Emmys: See all the winners so far","text":"Ahead of the 2025 Primetime Emmys next week, a majority of this year's trophies are being given out during this weekend's Creative Arts Emmys.\n\n Winners in nearly 100 categories will be chosen on Saturday and Sunday during a two-night event at the Peacock Theater at L.A. LIVE in Los Angeles. An edited presentation of the ceremonies will air on Emmys Eve, Saturday, Sept. 13 at 11 p.m. ET/8 p.m. PT on FXX, and stream on Hulu through Oct. 7.\n\n Malin Akerman, Gwendoline Christie, Jamie Lee Curtis, and Ron Howard are among the many presenters on Saturday. The following day, Mikey Day, Danielle Fishel, Sarah Silverman, and more will announce winners.\n\n Follow along below for the complete list of winners from Night 1 of the Creative Arts Emmys, including awards for guest actors in comedy and drama series, music, makeup, stunts, and more.\n\n Check back for live updates throughout the weekend.\n\n Ceremony 1 (Saturday, Sept. 6) \n\n Outstanding Animated Program \n\n ArcaneBob's BurgersCommon Side EffectsLove, Death + RobotsThe Simpsons\n\n Outstanding Casting for a Comedy Series \n\n The BearHacks Only Murders in the BuildingShrinking The Studio\n\n Outstanding Casting for a Drama Series \n\n The Last of UsThe PittSeveranceSlow HorsesThe White Lotus\n\n Outstanding Casting for a Limited or Anthology Series or Movie \n\n AdolescenceBlack MirrorDying for SexMonsters: The Lyle And Erik Menendez StoryThe Penguin\n\n Outstanding Character Voice-Over Performance \n\n Julie Andrews, Bridgerton, \"Into the Light\"Hank Azaria, The Simpsons, \"Abe League of Their Moe\"Maya Rudolph, Big Mouth, \"Why Do We Go Through Puberty?\"Alan Tudyk, Andor, \"Who Else Knows?\"Jeffrey Wright, What If...?, \"What If...1872?\"Steven Yeun, Invincible, \"What Have I Done?\"\n\n Outstanding Choreography for Scripted Programming \n\n Bridgerton Routines: \"Butterfly Ball,\" \"Eros And Psyche,\" \"Jealousy,\" \"Wedding Dance,\" and \"Rejoining The Ton\"Doctor Who Routine: \"There's Always A Twist\"Étoile Routines: \"Piece 2,\" \"Growing Pressure,\" \"Big In Japan,\" and \"Piece 1\"Severance Routines: \"Choreography & Merriment\" and \"The Ballad Of Ambrose And Gunnel\"Will Trent Routines: \"Last Dance,\" \"In The Night,\" \"Quartet No. 5,\" and \"I Can't Stand The Rain\"\n\n Outstanding Cinematography for a Limited or Anthology Series or Movie \n\n Adolescence, \"Episode 2\"American Primeval, \"Episode 1\"Disclaimer, \"I\"The Penguin, \"Top Hat\"Zero Day, \"Episode 2\"\n\n Outstanding Cinematography for a Series (Half-Hour) \n\n Emily in Paris, \"Masquerade\"Georgie & Mandy's First Marriage, \"The 6:10 to Lubbock\"Hacks, \"I Love LA\"The Righteous Gemstones, \"Prelude\"The Studio, \"The Oner\"\n\n Outstanding Cinematography for a Series (One Hour) \n\n Andor, \"Harvest\"The Day Of The Jackal, \"Episode 1\"Étoile, \"The Swap\"Pachinko, \"Chapter Nine\"Severance, \"Hello, Ms. Cobel\"The White Lotus, \"Killer Instinct\"\n\n Outstanding Contemporary Costumes for a Series \n\n Emily In Paris, \"The Grey Area\"Hacks, \"Heaven\"The Righteous Gemstones, \"You Hurled Me Into The Depths, Into The Very Heart Of The Seas\"WINNER: The Studio, \"CinemaCon\"The White Lotus, \"Same Spirits, New Forms\"\n\n Outstanding Contemporary Costumes for a Limited or Anthology Series or Movie \n\n Adolescence, \"Episode 2\"American Horror Stories, \"Backrooms\"Dying For Sex, \"Topping Is A Sacred Skill\"WINNER: The Penguin, \"A Great Or Little Thing\"Sirens, \"Exile\"\n\n Outstanding Contemporary Hairstyling \n\n Abbott Elementary, \"100th Day Of School\"Emily In Paris, \"Back On The Crazy Horse\"Hacks, \"I Love LA\"WINNER: The Penguin, \"Cent'anni\"The Studio, \"CinemaCon\"The White Lotus, \"Amor Fati\"\n\n Outstanding Contemporary Makeup (Non-Prosthetic) \n\n Grotesquerie, \"Unplugged\"The Last Of Us, \"Day One\"Only Murders In The Building, \"Valley Of The Dolls\"WINNER: The Penguin, \"Cent'anni\"The Pitt, \"7:00 P.M.\"The White Lotus, \"Full-Moon Party\"\n\n Outstanding Fantasy/Sci-Fi Costumes \n\n Agatha All Along, \"Follow Me My Friend\"WINNER: Andor, \"Harvest\"Black Mirror, \"USS Callister\"Dune: Prophecy, \"The Hidden Hand\"House Of The Dragon, \"The Burning Mill\"\n\n Outstanding Guest Actor in a Comedy Series \n\n Jon Bernthal, The Bear, \"NapkinsBryan Cranston, The Studio, CinemaConDave Franco, The Studio, CinemaConRon Howard, The Studio, \"The Note\"Anthony Mackie, The Studio, \"The Note\"Martin Scorsese, The Studio, \"The Promotion\"\n\n Outstanding Guest Actor in a Drama Series \n\n Giancarlo Esposito, The Boys, \"Beware The Jabberwock, My Son\"Scott Glenn, The White Lotus • Killer InstinctsShawn Hatosy, The Pitt • 9:00 P.M.Joe Pantoliano The Last Of Us • The PriceForest Whitaker, Andor • I Have Friends EverywhereJeffrey Wright, The Last Of Us • Day One\n\n Outstanding Guest Actress in a Comedy Series \n\n Olivia Colman, The Bear, \"Forever\"Jamie Lee Curtis, The Bear, \"Ice Chips\"Cynthia Erivo, Poker Face, \"The Game Is A Foot\"Robby Hoffman, Hacks, \"Cover Girls\"Zoë Kravitz, The Studio, \"The Presentation\"WINNER: Julianne Nicholson, Hacks, \"A Slippery Slope\"\n\n Outstanding Guest Actress in a Drama Series \n\n Jane Alexander, Severance, \"Sweet Vitriol\"Gwendoline Christie, Severance, \"Cold Harbor\"Kaitlyn Dever, The Last Of Us, \"Through The Valley\"Cherry Jones, The Handmaid's Tale, \"Exile\"Catherine O'Hara, The Last Of Us, \"Future Days\"Merritt Wever, Severance, \"Who Is Alive?\"\n\n Outstanding Music Composition for a Limited or Anthology Series, Movie or Special (Original Dramatic Score) \n\n Black Mirror, \"Hotel Reverie\"Black Mirror, \"USS Callister: Into Infinity\"Dying For Sex, \"It's Not That Serious\"Monsters: The Lyle And Erik Menendez Story, \"Spree\"The Penguin, \"After Hours\"The Supremes At Earl's All-You-Can-Eat\n\n Outstanding Music Composition for a Series (Original Dramatic Score) \n\n Andor, \"Who Are You?\"Based On A True Story, \"Relapse\"Cobra Kai, \"Blood In Blood Out\"Severance, \"Cold Harbor\"The Studio, \"The Missing Reel\"The White Lotus, \"Amor Fati\"\n\n Outstanding Music Supervision \n\n Hacks, \"I Love LA\"The Last Of Us, \"The Price\"The Righteous Gemstones, \"You Hurled Me Into The Depths, Into The Very Heart Of The Seas\"Severance, \"Cold Harbor\"The Studio, \"The Promotion\"The White Lotus, \"Same Spirits, New Forms\"\n\n Outstanding Original Main Title Theme Music \n\n Dept. QDune: ProphecyLazarusThe ResidenceThe White LotusYour Friends & Neighbors\n\n Outstanding Original Music and Lyrics \n\n Agatha All Along, \"Circle Sewn With Fate / Unlock Thy Hidden Gate,\" Song Title: \"The Ballad of the Witches' Road\"Andor, \"Who Are You?,\" Song Title: \"We are the Ghor (Planetary Anthem)\"The Boys, \"We'll Keep The Red Flag Flying Here,\" Song Title: \"Let's Put the Christ Back in Christmas\"SNL50: The Anniversary Special, Song Title: \"Adam Sandler's Song: 50 Years\"\n\n Outstanding Performer in a Short Form Comedy or Drama Series \n\n Nathalie Emmanuel, Die Hart: Hart To KillKevin Hart, Die Hart: Hart To KillJ.K. Simmons, Die Hart: Hart To KillDesi Lydic, The Daily Show: Desi Lydic FoxsplainsTom Segura, Bad Thoughts\n\n Outstanding Period or Fantasy/Sci-Fi Hairstyling \n\n Anne Rice's Interview With The Vampire, \"No Pain\"WINNER: Bridgerton, \"Old Friends\"House Of The Dragon, \"Smallfolk\"Monsters: The Lyle And Erik Menendez Story, \"Hang Men\"What We Do In The Shadows, \"The Finale\"\n\n Outstanding Period or Fantasy/Sci-Fi Makeup (Non-Prosthetic) \n\n Anne Rice's Interview With The Vampire, \"Do You Know What It Means To Be Loved By Death\"WINNER: House of the Dragon, \"The Red Dragon and the Gold\"Monsters: The Lyle And Erik Menendez Story, \"Brother, Can You Spare A Dime?\"The Righteous Gemstones, \"Prelude\"What We Do In The Shadows, \"Come Out And Play\"\n\n Outstanding Period Costumes \n\n American Primeval, \"Episode 2\"WINNER: Bridgerton, \"Into the Light\"Monsters: The Lyle And Erik Menendez Story, \"Blame It On The Rain\"1923, \"A Dream And A Memory\"Wolf Hall: The Mirror And The Light (MASTERPIECE), \"Wreckage\"\n\n Outstanding Picture Editing for a Drama Series \n\n Andor, \"Who Are You?\"The Last Of Us, \"Through The Valley\"Severance, \"Attila\"Severance, \"Chikhai Bardo\"Severance, \"Cold Harbor\"The White Lotus, \"Amor Fati\"\n\n Outstanding Picture Editing for a Multi-Camera Comedy Series \n\n The Conners, \"The Truck Stops Here\"Frasier, \"My Brilliant Sister\"Mid-Century Modern, \"Here’s to You, Mrs. Schneiderman\"The Upshaws, \"Buy Now\"The Upshaws, \"Grifter, Grifter\"\n\n Outstanding Picture Editing for a Single Camera Comedy Series \n\n The Bear, \"Tomorrow\"Hacks, \"I Love LA\"The Rehearsal, \"My Controls\"The Rehearsal, \"Pilot's Code\"The Studio, \"The Promotion\"What We Do In The Shadows, \"The Finale\"\n\n Outstanding Picture Editing for a Limited or Anthology Series or Movie \n\n Monsters: The Lyle And Erik Menendez Story, \"Blame It On The Rain\"The Penguin, \"Bliss\"The Penguin, \"Cent'anni\"The Penguin, \"A Great Or Little Thing\"Sirens, \"Exile\"\n\n Outstanding Production Design for a Narrative Contemporary Program (One Hour or More) \n\n The Last Of Us, \"Day One\"The Penguin, \"Homecoming\"The Residence, \"The Fall Of The House Of Usher\"WINNER: Severance, \"Chikhai Bardo\"The White Lotus, \"Amor Fati\"\n\n Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More) \n\n WINNER: Andor, \"Who Are You?\"Bridgerton, \"Romancing Mister Bridgerton\"Dune: Prophecy, \"The Hidden Hand\"1923, \"Wrap Thee In Terror\"Pachinko, \"Chapter Thirteen\"\n\n Outstanding Production Design for a Narrative Program (Half-Hour) \n\n Hacks, \"A Slippery Slope\"Mid-Century Modern, \"Working Girls\"Only Murders In The Building, \"Gates Of Heaven\" and \"Valley Of The Dolls\"WINNER: The Studio, \"The Note\"What We Do In The Shadows, \"Headhunting\"\n\n Outstanding Prosthetic Makeup \n\n House Of The Dragon, \"The Red Sowing\"The Last Of Us, \"Feel Her Love\"WINNER: The Penguin, \"After Hours\"The Pitt, \"4:00 P.M.\"Saturday Night Live, \"Host: Timothée Chalamet\"\n\n Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour) \n\n The Acolyte, \"Night\"Agatha All Along, \"Darkest Hour / Wake Thy Power\"The Bear, \"Doors\"The Righteous Gemstones, \"Prelude\"The Studio, \"The Golden Globes\"\n\n Outstanding Sound Editing for an Animated Program \n\n Arcane, \"The Dirt Under Your Nails\"Love, Death + Robots, \"400 Boys\"Secret Level, \"Warhammer 40,000: They Shall Know No Fear\"Star Trek: Lower Decks, \"The New Next Generation\"What If...?, \"What If...1872?\"\n\n Outstanding Sound Editing for a Comedy or Drama Series (One Hour) \n\n Andor, \"Who Are You?\"The Last Of Us, \"Through The Valley\"The Pitt, \"7:00 P.M.\"Severance, \"Chikhai Bardo\"\n\n Outstanding Sound Editing for a Limited or Anthology Series, Movie or Special \n\n Adolescence, \"Episode 1\"Black Mirror, \"USS Callister: Into Infinity\"The GorgeThe Penguin, \"After Hours\"Star Trek: Section 31\n\n Outstanding Sound Mixing for a Comedy or Drama Series (Half-Hour) and Animation \n\n The Bear, \"Doors\"Mid-Century Modern, \"Sour Pickleball\"Only Murders In The Building, \"Once Upon A Time In The West\"Shrinking, \"The Drugs Don’t Work\"The Studio, \"The Golden Globes\"\n\n Outstanding Sound Mixing for a Comedy or Drama Series (One Hour) \n\n Andor, \"Who Are You?\"The Last Of Us, \"Through The Valley\"The Pitt, \"6:00 P.M.\"Severance, \"Cold Harbor\"The White Lotus, \"Amor Fati\"\n\n Outstanding Sound Mixing for a Limited or Anthology Series or Movie \n\n Adolescence, \"Episode 1\"Black Mirror, \"USS Callister: Into Infinity\"Monsters: The Lyle And Erik Menendez Story, \"Blame It On The Rain\"The Penguin, \"After Hours\"Zero Day, \"Episode 6\"\n\n Outstanding Special Visual Effects in a Season or a Movie \n\n AndorDune: ProphecyHouse Of The DragonThe Last Of UsThe Lord Of The Rings: The Rings Of Power\n\n Outstanding Special Visual Effects in a Single Episode \n\n Black Mirror, \"USS Callister: Into Infinity\"The Penguin, \"Bliss\"The Residence, \"The Fall Of The House Of Usher\"Severance, \"Hello, Ms. Cobel\"The Umbrella Academy, \"End Of The Beginning\"\n\n Outstanding Stunt Coordination for Comedy Programming \n\n Cobra Kai Only Murders In The BuildingPoker FaceThe Righteous GemstonesTulsa King\n\n Outstanding Stunt Coordination for Drama Programming \n\n The BoysFBI: Most WantedLionessThe PenguinThe Rookie\n\n Outstanding Stunt Performance \n\n The Boys, \"The Insider\"FBI: Most Wanted, \"Moving On\"The Penguin, \"Top Hat\"The Rookie, \"Til Death\"Severance, \"Cold Harbor\"\n\n Outstanding Television Movie \n\n Bridget Jones: Mad About The BoyThe GorgeMountainheadNonnasRebel Ridge\n\n Check out more from EW's The Awardist,\n\n Ceremony 2 (Saturday, Sept. 7) \n\n Outstanding Casting for a Reality Program \n\n The Amazing RaceLove on the SpectrumQueer EyeRuPaul's Drag RaceSurvivor\n\n Outstanding Choreography For Variety Or Reality Programming \n\n The Apple Music Super Bowl LIX Halftime Show Starring Kendrick Lamar, Routines: \"Humble\" and \"Not Like Us\"Beyoncé Bowl, Routines: \"My House,\" \"Sweet Honey Buckiin',\" and \"Texas Hold 'Em\"The 67th Annual Grammy Awards, Routine: Doechii Musical PerformanceThe Lion King At The Hollywood Bowl, Routine: \"He Lives In You\"The Oscars, Routines: James Bond Tribute Performance and Quincy Jones Tribute Performance\n\n Outstanding Cinematography for a Nonfiction Program \n\n Chef's Table, \"Jamie Oliver\"100 Foot Wave, \"Chapter III - Cortes Bank\"Ren Faire, \"Daddy's Dyin', Who's Got The Will?\"Tucci In Italy, \"Tuscany\"Will & Harper\n\n Outstanding Cinematography for a Reality Program \n\n The Amazing Race, Series Body Of WorkLife Below Zero, Series Body Of WorkLove On The Spectrum, \"Episode 7\"Survivor, Series Body Of WorkThe Traitors, Series Body Of Work\n\n Outstanding Commercial \n\n \"Batman Vs. Bateman,\" State Farm\"The Boy & The Octopus,\" The Walt Disney Company\"Brian Cox Goes To College,\" Uber One for Students\"Flock,\" Apple Privacy\"Heartstrings,\" Apple AirPods Pro\"So Win.,\" Nike\n\n Outstanding Costumes for a Variety, Nonfiction, or Reality Programming \n\n Beyoncé Bowl\n\n Outstanding Directing for a Documentary/Nonfiction Program \n\n Deaf President Now!Ladies & Gentlemen... 50 Years Of SNL MusicPee-wee As HimselfSuper/Man: The Christopher Reeve StoryWill & Harper\n\n Outstanding Directing for a Reality Program \n\n The Amazing Race, \"It Smells Like The Desert\"Love On The Spectrum, \"Episode 7\"RuPaul's Drag Race, \"Squirrel Games\"Top Chef, \"Foraged In Fire\"The Traitors, \"Let Battle Commence\"\n\n Outstanding Directing for a Variety Series \n\n The Daily Show, \"Jon Stewart Delivers A Mug-Smashing Take On Musk’s DOGE\"Jimmy Kimmel Live!, \"Anthony Mackie, Lizzy Caplan, And Musical Guest Bartees Strange\"Last Week Tonight With John Oliver, \"India Elections\"The Late Show With Stephen Colbert, \"David Oyelowo, Finn Wolfhard, Special Appearance By Alan Cumming, Performance By Ok Go\"\n\n Outstanding Directing for a Variety Special \n\n The Apple Music Super Bowl LIX Halftime Show Starring Kendrick LamarBeyoncé BowlThe OscarsSNL50: The Anniversary SpecialSNL50: The Homecoming Concert77th Annual Tony Awards\n\n Outstanding Documentary or Nonfiction Series \n\n Chef's Table100 Foot WaveSimone Biles RisingSNL50: Beyond Saturday NightSocial Studies\n\n Outstanding Documentary or Nonfiction Special \n\n Deaf President Now!MarthaPee-wee As HimselfSly Lives! (Aka The Burden Of Black Genius)Will & Harper\n\n Outstanding Emerging Media Program \n\n Impulse: Playing With RealityShawn Mendes: Red Rocks Live In VRSNL 50th The Anniversary Special: Immersive Experience\n\n Exceptional Merit in Documentary Filmmaking \n\n I Am: Celine DionPatrice: The MovieThe Remarkable Life Of Ibelin\n\n Outstanding Game Show \n\n Celebrity Family FeudJeopardy!The Price Is RightWheel Of FortuneWho Wants To Be A Millionaire\n\n Outstanding Hairstyling for a Variety, Nonfiction or Reality Program \n\n American Idol, \"Finale\"The Boulet Brothers' DragulaDancing With The Stars, \"Halloween Nightmares\"Fantasmas, \"The Void\"SNL50: The Anniversary SpecialThe Voice, \"Live Semi-Final Performances\"\n\n Outstanding Host for a Game Show \n\n Elizabeth Banks, Press Your LuckSteve Harvey, Celebrity Family FeudKen Jennings, Jeopardy!Colin Jost, Pop Culture Jeopardy!Jimmy Kimmel, Who Wants To Be A Millionaire\n\n Outstanding Host for a Reality or Reality Competition Program \n\n RuPaul Charles, RuPaul's Drag RaceMark Cuban, Lori Greiner, Kevin O'Leary, Barbara Corcoran, Robert Herjavec, Daymond John, Daniel Lubetzky, Shark TankAlan Cumming, The TraitorsKristen Kish, Top ChefJeff Probst, Survivor\n\n Outstanding Hosted Nonfiction Series or Special \n\n Conan O'Brien Must GoThe Daily Show Presents: Jordan Klepper Fingers The Pulse: MAGA: The Next GenerationFinding Your Roots With Henry Louis Gates, Jr.My Next Guest Needs No Introduction With David LettermanTucci In Italy\n\n Outstanding Lighting Design/Lighting Direction for a Series \n\n American Idol, \"Songs Of Faith\"Dancing With The Stars, \"Semi-Finals\"RuPaul's Drag Race, \"The Wicked Wiz Of Oz: The Rusical!\"Saturday Night Live, \"Host: Lady Gaga\"The Voice, \"Live Finale (Part 1)\"\n\n Outstanding Lighting Design/Lighting Direction for a Special \n\n The 67th Annual Grammy Awards2024 Rock & Roll Hall Of Fame Induction CeremonySNL50: The Anniversary SpecialSNL50: The Homecoming Concert\n\n Outstanding Makeup for a Variety, Nonfiction or Reality Program \n\n The Boulet Brothers' Dragula, \"Welcome To Hell\"Dancing With The Stars, \"Halloween Nightmares\"The Lion King At The Hollywood BowlA Nonsense Christmas With Sabrina CarpenterRuPaul's Drag Race, \"Bitch, I’m A Drag Queen!\"SNL50: The Anniversary Special\n\n Outstanding Music Composition for a Documentary Series or Special (Original Dramatic Score) \n\n The Americas, \"Andes\"Chef's Table, \"José Andrés\"Leonardo Da VinciPlanet Earth: Asia, \"Beneath The Waves\"Super/Man: The Christopher Reeve Story\n\n Outstanding Music Direction \n\n The Apple Music Super Bowl LIX Halftime Show Starring Kendrick LamarThe Kennedy Center HonorsThe OscarsSNL50: The Anniversary SpecialSNL50: The Homecoming Concert\n\n Outstanding Narrator \n\n Sir David Attenborough, Planet Earth: Asia, \"The Frozen North\"Idris Elba, Erased: WW2's Heroes Of Color, \"D-Day\"Tom Hanks, The Americas, \"Andes\"Barack Obama, Our Oceans, \"Indian Ocean\"Phoebe Waller-Bridge, Octopus! \"Part 1\"\n\n Outstanding Picture Editing for a Nonfiction Program \n\n Chimp Crazy, \"Gone Ape\"Ladies & Gentlemen... 50 Years Of SNL MusicPee-wee As HimselfSNL50: Beyond Saturday Night, \"More Cowbell\"Super/Man: The Christopher Reeve StoryWill & Harper\n\n Outstanding Picture Editing for Structured Reality or Competition Program \n\n The Amazing RaceQueer EyeRuPaul's Drag RaceThe TraitorsThe Voice, Series Body Of Work\n\n Outstanding Picture Editing for an Unstructured Reality Program \n\n Deadliest Catch, Series Body Of WorkLife Below Zero, \"The Last Snow\"Love On The Spectrum, \"Episode 7\"RuPaul's Drag Race: Untucked, \"Drag Baby Mamas\"Welcome To Wrexham, \"Down To The Wire\"\n\n Outstanding Picture Editing for Variety Programming \n\n Ali Wong: Single LadyBill Burr: Drop Dead YearsConan O'Brien: The Kennedy Center Mark Twain Prize For American HumorCunk On LifeYour Friend, Nate Bargatze\n\n Outstanding Picture Editing for Variety Programming (Segment) \n\n The Daily Show, \"The Dailyshowography Of Kamala Harris: Just Normal (segment)\"The Daily Show, \"The Dailyshowography Of Stephen Miller: What He Does In The Shadows (segment)\"Last Week Tonight With John Oliver, \"Facebook Content Moderation (segment)\"Last Week Tonight With John Oliver , \"That Stuff’s American (segment)\"SNL50: The Anniversary Special, \"Physical Comedy (segment)\"\n\n Outstanding Production Design for a Variety Special \n\n Beyoncé BowlThe 67th Annual Grammy AwardsThe OscarsSNL50: The Anniversary SpecialSNL50: The Homecoming Concert\n\n Outstanding Production Design for a Variety or Reality Series \n\n The Daily Show, \"Jon Stewart & The News Team Live At The Chicago DNC\"Jimmy Kimmel Live!, \"The Chanucorn & Hawk Tuah Girl’s Romantic Holiday Movie\"Last Week Tonight With John Oliver, \"Mass Deportations\"RuPaul's Drag Race, \"RDR Live!\"Saturday Night Live, \"Host: Lady Gaga\"\n\n Outstanding Short Form Comedy, Drama Or Variety Series \n\n The Daily Show: Desi Lydic FoxsplainsLate Night With Seth Meyers CorrectionsThe Rabbit Hole With Jimmy KimmelThe Tonight Show: During Commercial Break\n\n Outstanding Short Form Nonfiction or Reality Series \n\n Adolescence: The Making Of AdolescenceHacks: Bit By BitMaking Of The Last Of UsOnly Murders In The Building: Unlocking The MysteryThe White Lotus: Unpacking The Episode\n\n Outstanding Sound Editing for a Nonfiction or Reality Program \n\n Beatles '64Music By John Williams100 Foot Wave, \"Chapter III - Cortes Bank\"Pee-wee As HimselfSNL50: Beyond Saturday Night, \"Season 11: The Weird Year\"\n\n Outstanding Sound Mixing for a Nonfiction Program \n\n Beatles '64Music By John Williams100 Foot Wave, \"Chapter III - Cortes Bank\"Yacht Rock: A Dockumentary (Music Box)Pee-wee As Himself\n\n Outstanding Sound Mixing for a Reality Program \n\n The Amazing Race, Series Body Of WorkAmerican Idol, \"Grand Finale\"Deadliest Catch, \"My Brothers Keeper\"The Voice, \"Live Finale, Part 2\"Welcome To Wrexham, \"Down To The Wire\"\n\n Outstanding Sound Mixing for a Variety Series or Special \n\n The Daily Show, \"Jon Stewart & The News Team Live At The Chicago DNC\"The 67th Annual Grammy AwardsThe OscarsSNL50: The Anniversary SpecialSNL50: The Homecoming Concert\n\n Outstanding Structured Reality Program \n\n Antiques RoadshowDiners, Drive-ins And DivesLove Is BlindQueer EyeShark Tank\n\n Outstanding Technical Direction and Camerawork for a Series \n\n After Midnight, \"Featuring Jonah Ray, Kumail Nanjiani, Emily Gordon\"The Daily Show, \"Jon Stewart & The News Team Live At The Chicago DNC\"Everybody's Live With John Mulaney, \"How Tall Are You?\"Saturday Night Live, \"Host: Jack Black\"The Voice, \"Live Finale (Part 1)\"\n\n Outstanding Technical Direction and Camerawork for a Special \n\n Bono: Stories Of SurrenderAn Evening With Dua LipaAn Evening With Elton John & Brandi CarlileThe Lion King At The Hollywood Bowl2024 Rock & Roll Hall Of Fame Induction CeremonySNL50: The Anniversary Special\n\n Outstanding Unstructured Reality Program \n\n America’s Sweethearts: Dallas Cowboys CheerleadersLove On The SpectrumRuPaul's Drag Race: UntuckedThe Secret Lives Of Mormon WivesWelcome To Wrexham\n\n Outstanding Variety Special (Pre-Recorded) \n\n Adam Sandler: Love YouAli Wong: Single LadyBill Burr: Drop Dead YearsConan O'Brien: The Kennedy Center Mark Twain Prize For American HumorSarah Silverman: PostMortemYour Friend, Nate Bargatze\n\n Outstanding Writing for a Nonfiction Program \n\n Chimp Crazy, \"Head Shot\"Conan O'Brien Must Go, \"Austria\"The Daily Show Presents: Jordan Klepper Fingers The Pulse: MAGA: The Next GenerationMarthaSuper/Man: The Christopher Reeve Story\n\n Outstanding Writing for a Variety Special \n\n Conan O'Brien: The Kennedy Center Mark Twain Prize For American HumorCunk On LifeSarah Silverman: PostMortemSNL50: The Anniversary SpecialYour Friend, Nate Bargatze\n\n Tune into the 77th Primetime Emmy Awards, hosted by Nate Bargatze, on Sunday, Sept. 14 at 8 p.m. ET/5 p.m. PT on CBS.","summary":"Emmys are being handed out in nearly 100 categories over a two-night ceremony on Sept. 6 and 7.","url":"https://ew.com/2025-creative-arts-emmys-winners-list-11803060","image":"https://ew.com/thmb/1WGnIxc6hia0XPKSsnPFw5ryjzc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/emmy-award-trophy-071224-366355b993f441c4a239b6722fedfa04.jpg","video":null,"publish_date":"2025-09-07 00:24:36","author":"Daysia Tolentino,Jillian Sederholm","authors":["Daysia Tolentino","Jillian Sederholm"],"language":"en","source_country":"US","sentiment":0.624},{"id":358137312,"title":"Chicago Mayor Brandon Johnson, Mehdi Hasan Respond to Trump’s Chicago ‘War’ Rhetoric: ‘Impeachment-Worthy’","text":"Chicago’s Mayor Brandon Johnson, British broadcaster Mehdi Hasan and more responded to a Truth Social from Donald Trump that appeared to indicate plans for U.S. military action in the city. As Hasan put it, such a post from any other preceding president “would be impeachment-worthy.”\n\nTrump shared an AI-generated image of himself dressed like Lieutenant Colonel Bill Kilgore (Robert Duvall) from “Apocalypse Now” in front of the Chicago skyline. The AI-generated Trump is crouched in front of flames as helicopters enter the city to his right.\n\n“‘I love the smell of deportations in the morning,’” the image is captioned. “Chicago is about to find out why it’s called the Department of WAR.” The image also bears the phrase “Chipocalypse Now.”\n\n“The president of the United States just declared war, actual military war, not a metaphorical one, on a major American city, and one governed by his political opponents,” Hasan wrote on Bluesky. “In any other period, this would be impeachment-worthy.”\n\nMayor Johnson also slammed the message. \n\n“The President’s threats are beneath the honor of our nation, but the reality is that he wants to occupy our city and break our Constitution,” he wrote on X. “We must defend our democracy from this authoritarianism by protecting each other and protecting Chicago from Donald Trump.”\n\nPolitical strategist Mike Nellis, who worked as the former senior advisor to then-Vice President Kamala Harris, had a strong response as well: “My response to Trump as a proud resident of the city of Chicago: Go f–k yourself. Stay the hell out of our city, you fascist.”\n\n“President Trump’s military threats against Chicago are reckless and un-American,” wrote Congressman Raja Krishnamoorthi, who represents the state’s 8th district, on X. “Chicago won’t be bullied.”","summary":"On Saturday the president shared an AI-generated image of himself crouching in front of the city as it burns\n\n\nThe post Chicago Mayor Brandon Johnson, Mehdi Hasan Respond to Trump&#8217;s Chicago &#8216;War&#8217; Rhetoric: &#8216;Impeachment-Worthy&#8217; appeared first on TheWrap.","url":"https://www.thewrap.com/trump-chicago-war-truth-social-mayor-brandon-johnson-mehdi-hasan-respond/","image":"https://www.thewrap.com/wp-content/uploads/2025/09/donald-trump.jpg","video":null,"publish_date":"2025-09-06 23:56:02","author":"Stephanie Kaloi","authors":["Stephanie Kaloi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.012},{"id":358095508,"title":"West Point Association of Graduates cancels Tom Hanks' award ceremony; Alumni cite focus on academy’s ‘core mission’","text":"ANITom Hanks (File Image)\n\nThe alumni association at the US Military Academy at West Point canceled an award ceremony intended to honor two-time Oscar winner and veterans advocate Tom Hanks. He was scheduled to be honored on September 25 with the Sylvanus Thayer Award. Hanks, a longtime backer of Democratic candidates and causes, was also recently criticized for his portrayal of a President Trump supporter as a ‘racist.’“This decision allows the Academy to continue its focus on its core mission of preparing cadets to lead, fight, and win as officers in the world’s most lethal force, the United States Army,” wrote Retired Army Col. Mark Bieger in an email to alumni on Friday, as reported by The Washington Post.Details on the Sylvanus Thayer AwardThe Sylvanus Thayer Award recognizes an “outstanding citizen” who did not attend West Point but exemplifies the academy’s ideals of “Duty, Honor, Country.” The ceremony was to include a parade attended by the entire Corps of Cadets and is considered the closest equivalent to an honorary degree from West Point. Colonel Sylvanus Thayer served as the academy’s superintendent from 1817 to 1833.The email from Bieger did not clarify whether Hanks’ award had been revoked or would be presented at a later date, as per the outlet.What west point and hanks said earlierLive EventsRobert McDonald, a former secretary of veterans affairs and the alumni association’s board chairman, announced it in June: “Tom Hanks has done more for the positive portrayal of the American service member, more for the caring of the American veteran, their caregivers and their family, and more for the American space program and all branches of government than many other Americans.”According to the release on West Point dated June 11, Hank replied, “To have my first ever visit to the Academy be to accept such an honor as the Thayer Award is simply astounding. West Point’s legacy of leadership, character, and service to the nation is a powerful example for all Americans. To be recognized by an institution whose graduates have shaped our country’s history through selfless service is both humbling and meaningful,” says Hanks.Hank’s Record of Veteran Support and Political InvolvementTom Hanks, 69, has a history of making anti-Trump comments and has donated to Democratic figures, including former Presidents Barack Obama and Joe Biden, as well as presidential candidates Hillary Clinton and Kamala Harris. The June announcement by the alumni group recognized Hanks’ role in advocating for veterans and cited his portrayals of US service members in films such as Forrest Gump and Saving Private Ryan.Why did West Point cancel Tom Hanks’ award ceremony?According to The Washington Post, the decision may have been influenced by Trump-era politics. Hanks supported Joe Biden’s 2020 campaign and appeared in a 2022 video highlighting the Biden administration’s achievements.As reported by Forbes, President Trump introduced several changes at West Point, including rolling back programs promoting diversity, equity, and inclusion (DEI). Jen Easterly, who served as cybersecurity chief under the Biden administration, was dismissed in June after complaints from Trump loyalist Laura Loomer. Additionally, a 20-foot portrait of Gen. Robert E. Lee, a West Point graduate who fought in the Civil War to preserve slavery, was rehung in the academy’s library.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTom Hanks award ceremony cancellationWest Point Association of GraduatesWest Point alumni controversyTom Hanks veteran supportSylvanus Thayer Award Tom HanksTrump politics West PointWest Point diversity equity inclusionWest Point core missionUS Military AcademyTom Hanks Democratic advocate\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTom Hanks award ceremony cancellationWest Point Association of GraduatesWest Point alumni controversyTom Hanks veteran supportSylvanus Thayer Award Tom HanksTrump politics West PointWest Point diversity equity inclusionWest Point core missionUS Military AcademyTom Hanks Democratic advocate(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"The US Military Academy at West Point called off Tom Hanks' award event. He was to receive the Sylvanus Thayer Award. Hanks, a supporter of Democratic causes, faced criticism. The academy cited its focus on cadet preparation. The decision followed changes at West Point. These changes included rolling back diversity programs.","url":"https://economictimes.indiatimes.com/news/international/us/west-point-association-of-graduates-cancels-tom-hanks-award-ceremony-alumni-cite-focus-on-academys-core-mission/articleshow/123741332.cms","image":"https://img.etimg.com/thumb/msid-123741294,width-1200,height-630,imgsize-10950,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-09-06 22:25:21","author":"Rana Sarkar","authors":["Rana Sarkar"],"language":"en","source_country":"in","sentiment":0.301},{"id":358084212,"title":"Tom Hanks Dropped from West Point Awards Ceremony","text":"Tom Hanks won’t be receiving an honor from the U.S. Military just yet.\n\n The Elvis actor, 69, was slated to receive the 2025 Sylvanus Thayer Award at a Sept. 25 ceremony hosted by the U.S. Military Academy at West Point, but the event was called off by the school’s alumni association, The Washington Post reported.\n\n The decision to cancel the event was announced in an email sent to faculty by retired Army Col. Mark Bieger, president and chief executive officer of the West Point Association of Graduates, per the outlet. He explained in his email why the decision was ultimately made.\n\n “This decision allows the Academy to continue its focus on its core mission of preparing cadets to lead, fight, and win as officers in the world’s most lethal force, the United States Army,” he wrote.\n\n Bieger did not mention whether Hanks would still receive the 2025 Sylvanus Thayer Award at a later event or in a different format, according to The Washington Post.\n\n PEOPLE has reached out to the U.S. Military Academy at West Point and reps for Hanks for comment.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n The U.S. Military Academy at West Point announced in June that Hanks would receive the Thayer Award, which is given annually to an outstanding citizen of the U.S. “whose service and accomplishments in the national interest exemplify personal devotion to the ideals expressed in West Point’s motto: ‘Duty, Honor, Country.’ ”\n\n At the time of the announcement, the school’s board chairman, Robert A. McDonald, explained that Hanks would be given the award, in part, due to his portrayal of the life of a “service member” in several of his films, including Saving Private Ryan, Forrest Gump and Greyhound.\n\n “Tom Hanks has done more for the positive portrayal of the American service member, more for the caring of the American veteran, their caregivers and their family, and more for the American space program and all branches of government than many other Americans,” McDonald said in a statement.\n\n The academy also said that Hanks was being honored for his support of the military, after previously serving as national chairperson of the D-Day Museum Capital Campaign and joining former U.S. Senator Bob Dole as a national spokesperson for the World War II Memorial in Washington, D.C. \n\n Reacting to the forthcoming honor at the time, Hanks — who noted at the time that the award ceremony would have been his first time visiting the academy — said in a statement, “To be recognized by an institution whose graduates have shaped our country’s history through selfless service is both humbling and meaningful.”\n\n The news of the canceled awards ceremony comes amid a period of transition at the U.S. Military Academy at West Point, which has faced significant changes since Donald Trump’s presidency. Per The Washington Post, Trump’s directives led to the rollback of diversity, equity and inclusion initiatives across the armed forces, as well as heightened scrutiny of leadership, curricula and faculty at all U.S. service academies.\n\n Hanks was a vocal supporter of the Biden administration, and also endorsed Kamala Harris in the 2024 presidential election. In 2022, the actor narrated a video for Joe Biden's inauguration anniversary, touting his administration's accomplishments. Hanks also joined a group of prominent Greek-Americans in signing an open letter in support of Harris' presidential bid in October 2024, per The National Herald.","summary":"Hanks was slated to receive the 2025 Sylvanus Thayer Award at a Sept. 25 ceremony hosted by the U.S. Military Academy at West Point","url":"https://people.com/tom-hanks-dropped-from-west-point-awards-ceremony-11804948","image":"https://people.com/thmb/cqcxaMTA04Ut2guonxCS5nadWVQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(795x299:797x301)/Tom-Hanks-060425-0ba2a67c5a834ff49c499f6ff74634eb.jpg","video":null,"publish_date":"2025-09-06 20:49:41","author":"Kimberlee Speakman","authors":["Kimberlee Speakman"],"language":"en","source_country":"US","sentiment":-0.018},{"id":358176832,"title":"Biden begins fundraising for Delaware presidential library","text":"The Joe and Jill Biden Foundation approved a 13-person governance board that has been ordered to direct the project. Board members include former Secretary of State Antony Blinken, adviser Steve Ricchetti, and others with ties to the presidential pair.\n\nBiden may face challenges raising money for his library. He was blamed by many in his party for not dropping out of the presidential race sooner to make way for former Vice President Kamala Harris.\n\nThe party as a whole is still searching for its direction, and it appears to be growing more distant from Biden. He has gotten some sympathy from Republicans and Democrats for his prostate cancer diagnosis.\n\nPresident Donald Trump has also continued to disparage Biden and blame him for the country’s problems. With the country leaning in a Republican direction, donors could be less apt to risk donating to Biden.\n\nBoard chairman Rufus Gifford acknowledged that it could be difficult to see donors with the Trump issue.\n\n“There’s certainly folks — folks who may have been not thinking about those kinds of issues who are starting to think about them,” Gifford told the Associated Press. “That being said … we’re not going to create a budget, we’re not going to set a goal for ourselves that we don’t believe we can hit.”\n\nThe library’s location comes at little surprise. Biden spent decades as one of Delaware’s senators and resides there.\n\nGifford said the Bidens felt that Delaware was where the library should be because the state has “propelled his entire political career.”\n\nJERRY NADLER SAYS HE WILL NOT RUN FOR REELECTION\n\nGov. Matt Meyer (D-DE) cheered Biden’s decision.\n\n“To Delaware, he will always be our favorite son,” Meyer said. “The new presidential library here in Delaware will give future generations the chance to see his story of resilience, family, and never forgetting your roots.”","summary":"Former President Joe Biden has selected Delaware as the site of his presidential library, and his team started raising money to fund its construction. Building a presidential library recently has cost into the hundreds of millions. The library is paid for by private money. The Joe and Jill Biden Foundation approved a 13-person governance board [&#8230;]","url":"https://www.washingtonexaminer.com/news/3796179/biden-begins-fundraising-for-delaware-presidential-library/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/biden-democrats.jpg?w=696","video":null,"publish_date":"2025-09-06 19:53:14","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.17},{"id":358068860,"title":"Anthony Kim takes a jibe at Kamala Harris' ex-running mate Tim Walz in his latest X post","text":"Despite his relegation from LIV Golf, Anthony Kim keeps his fans updated with clips from his practice sessions, where he flaunts his swing. Today, the golfer stayed true to his habit while launching a fresh jab at Kamala Harris' former running mate Tim Walz.On September 6, Kim shared a clip on X (previously Twitter), where his daughter Bella could be seen joining him in the golf practice session. In the caption of his post, the professional golfer expressed his excitement regarding the football match between Oklahoma and Michigan. Apart from that, Anthony Kim made a dig at Walz, claiming that the politician might perform during the halftime show.\"❤️ wen the fam comes 2 join me while I finish up practicing like last evening. Gonna B2 gr8 2 watch @OU_Football VS @UMichFootball ... Heard a rumor that @GovTimWalz is doing the halftime show w high kicks & spirit fingers &#128080;&#128514;. SOBER is DOPE &#128293;\"Take a look at Anthony Kim's X post regarding the Governor of Minnesota here:Screenshot from Kim's X post about Walz / @AnthonyKim_Golf on XLast year, Kim joined the Saudi PIF-backed golf league, and since then, he has come out swinging on X. Anthony Kim's politically-charged commentary on social media has a long history of the golfer being critical of Democrats. Kim even launched his very own customized \"MAKGA\" hats after Donald Trump's triumph as the US President.The 40-year-old has consistently shown support for President Trump and the Republican Party. Even before Trump stepped into the Oval Office after winning the 2024 election, Anthony Kim kept launching jabs at Democratic nominee Kamala Harris. In an X post in September 2024, Kim even claimed that all of Harris' interviews are reportedly staged. Apart from mocking Harris, the golfer has also criticized the Democrat's former running mate, Walz.Anthony Kim slams Tim Walz after the latter failed to answer a questionA Congressional Hearing in June 2025 left Walz stuck in a very awkward situation. The former Democratic vice presidential candidate faced a plethora of questions from the Republican Party's Nancy Mace. During questioning, the South Carolina representative asked Walz the definition of a woman, which the latter failed to 'understand'.Later on, Anthony Kim reposted a clip of the questioning session on X and launched a fresh jibe at Walz. He wrote:\"Gr8ful 4 another day of sobriety&#128293; ALSO thank every higher power lil Tim isn’t the VP of the &#127482;&#127480; since he can’t even define what a woman is&#129318;‍♂️says he was friends with school shooters &#129318;‍♂️BUT does gr8 high kicks&#128514;. SOBER is DOPE&#128293;\"Take a look at the relegated LIV golfer's post on X:Screenshot from Kim's tweet about Walz / Source: @AnthonyKim_Golf on XThe latter part of Kim's above jibe is a reference to an infamous slip-up Walz suffered last year. During the vice presidential debate in 2024, Harris' former running mate mistakenly said he was friends with school shooters. However, Walz later revealed that he actually meant to say that he would become friends with all the victims of school shooting incidents.","summary":"Despite his relegation from LIV Golf, Anthony Kim keeps his fans updated with clips from his practice sessions, where he flaunts his swing.","url":"https://www.sportskeeda.com/golf/news-anthony-kim-takes-jibe-kamala-harris-ex-running-mate-tim-walz-latest-x-post","image":"https://staticg.sportskeeda.com/editor/2025/09/a6fa7-17571838786830-1920.jpg","video":null,"publish_date":"2025-09-06 19:35:55","author":"Pravashis Biswas","authors":["Pravashis Biswas"],"language":"en","source_country":"in","sentiment":0.132},{"id":358070372,"title":"LAPD Withdraws Kamala Harris Protection After Backlash, Days After Secret Service Detail Pulled","text":"The Los Angeles Police Department ended its temporary protection detail for former Vice President Kamala Harris on Saturday, the Los Angeles Times reported. LAPD’s Metropolitan Division officers had been stationed outside Harris’ Brentwood home to support the California Highway Patrol (CHP) after President Trump revoked her Secret Service protection earlier this week. Sources told the Times the move was brief and meant to prevent a lapse in coverage, but it drew backlash from within the force. Officers had been pulled from crime suppression duties in the San Fernando Valley, sparking frustration inside the department. Why the Security Arrangement Became Contentious Mayor Karen Bass had directed the LAPD to assist the CHP temporarily, but the arrangement quickly came under fire. The Los Angeles Police Protective League, the union representing rank-and-file officers, criticised the deployment as an unnecessary strain on city resources. “The department is assisting the CHP until an alternate plan is established,” LAPD spokesperson Jennifer Forkish said on Thursday, describing it as a stopgap measure, per the Los Angeles Times. The CHP has not clarified how LAPD’s withdrawal will alter its plans for protecting Harris, nor has Harris’ office commented on whether she will hire private security. Fox 11 earlier showed aerial images of LAPD officers posted outside Harris’ residence. Legal Entitlement and Trump’s Revocation Under federal law, former vice presidents receive six months of Secret Service protection after leaving office. President Biden extended Harris’ coverage, but Trump revoked that order last week, citing discretion afforded to the sitting president, Reuters reported. Without the federal detail, Harris’ security fell to local agencies until she arranges private coverage. This is not the first time discretionary extensions have been revoked; however, the rarity of a former vice president losing federally funded protection has raised questions about political motives. Analysts say the incident underscores the discretionary power presidents wield in extending or terminating protection for ex-officials. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"The Los Angeles Police Department on Saturday withdrew its security detail for former Vice President Kamala Harris after sharp criticism that officers were being pulled from crime suppression duties, the Los Angeles Times reported. Harris lost Secret Service protection last week when President Trump revoked an extension previously granted by President Biden.","url":"https://www.timesnownews.com/world/us/us-news/lapd-withdraws-kamala-harris-protection-after-backlash-days-after-secret-service-detail-pulled-article-152695879","image":"https://images.timesnownews.com/thumb/msid-152695907,thumbsize-38766,width-1280,height-720,resizemode-75/152695907.jpg","video":null,"publish_date":"2025-09-06 19:21:42","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","source_country":"in","sentiment":0.048},{"id":358110270,"title":"Tamaki Makaurau by-election bombshell result","text":"What an emphatic victory – and vindication – for Te Pati Maori and what a humiliating thrashing for Labour. The results at the end of last night (06/09/2025) for the Tamaki Makaurau electorate by-election confirmed as final, but not yet officially declared, give Oriini Kaipara a thumping 2,938 majority over Peeni Henare. Never would I have thought Te Pati Maori could go from barely winning in 2023 to such a resounding victory two years later with a newby candidate to fill the vacancy left by the well-respected Takutai Tarsh Kemp.\n\nThe near 3,000 majority cannot convey the relative size that majority represents given the low turnout (see below for that discussion). Kaipara got twice as many votes as Henare. That shocks me, I thought it would be a tight race, but that Kaipara should edge him out based on two factors: the zeitgeist and winds of history right now at least are with Te Pati Maori and so they are being defaulted to rather than Labour by Maori voters generally, and the 3,000 odd Green votes breaking to TPM. I didn’t see it would be a bulldozing not an edging. Nothing to me suggested this result. I was wondering how TPM strategy of social media first would pan out and was keeping an open mind, but never would I guess the magnitude of what happened. The voters must have preferred the logic of having both in the House and they have rationally and very ruthlessly applied it. I think that is the overwhelming element here.\n\nI will explain why it looked a closer race from the outside. From the debates and the Q+A interviews Kaipara just didn’t have any detail, at all, none. Great presentation skills as one would expect of a news reader, but no firm handle on anything. Given latitude for expansive answers on Q+A she painted a kupu collage of slogans and platitudes like Kamala Harris used to do with her word salads. Was she not bothering to appeal to serious voters?\n\nWas she after a youth vote or a radical non-voter vote? Was she instructed to be vague? She just wasn’t good on policy. I would love to have known what political motivations she had before entering politics two months ago – but I don’t think anyone’s asked her. I haven’t heard a reason – a compelling reason – from her as to why she wants to be an MP. I’ve heard lots of uncompelling reasons lost in a fog of fluffy feminist rhetoric. Her stock response to any question is to say she is a mama. It explains all. Mama. Mama. That’s the go to. Mama. I’m a woman. As a wahine. As a woman. How many times did she say it and did we hear it? Too many. Mama’s not a qualification to govern anymore than dada is, dada, dada. How unserious to vote for this superficial nonsense – and yet…\n\nAnd yet, we all saw the dramatic weight loss didn’t we. Didn’t we!? No one said anything publicly, of course, but it was there every time she stood in front of her own hoardings. We could see the difference instantly – the woman in front of us talking about feeding the kids is 10kg’s thinner than the already slim woman on the billboard. Hollowed out, haggard. But no one says anything. The Emperor’s new crash diet? Is she dying? Is she? Are we not allowed to ask, is it private? They voted for a husk of a woman, a waif, visibly deteriorated from her election pictures which had only been taken a few weeks prior. We all hope she recovers, because she looks frail. And yet…\n\nAnd yet Peeni Henare was bulldozed off the planet last night. She just absolutely wiped the floor with him, but in essence the voters said: you bore our fucking tits off. Nice guy, but you bore our fucking tits off. Not sure what the whakatauki is for that. Nice guy, but a low energy vibe. I noticed Willie Jackson looked concerned and not quite his usual frisky, cheeky self on the Herald’s morning political panel on Friday (in Auckland) and wondered if he was nervous about how things were on the street. Turns out he was indeed on the correct frequency.\n\nLooking through the polling station data there are hardly any that Henare carried. Auckland University and AUT advance voting had Kaipara beating Henare nearly 3:1 so the students were clearly not impressed with Labour. Labour will be asking themselves if they pulled their punches. Maybe they should have just punched them right in the face to start with and don’t let up – no Mr Nice Guy. Problem was the candidate was Mr Nice Guy!\n\nHenare will lick his wounds, coddled only in the knowledge that the size of his loss was commensurate with how much of a nice guy he is and he is one hell of a nice guy to have lost by that much.\n\nKaipara will be in for a very steep learning curve and she said as much in her victory speech. Presentation being such an important part of politics she may go far, especially if she can demonstrate some policy chops – or any sort of chops – by the general election next year.\n\nBased on this astonishing result the chances of a clean sweep of the seven Maori seats looks likely – how can Te Tai Rawhiti resist the tide? TPM will be ordering new millinery to celebrate, but what they have gained is not just an excuse for more headwear but a strong bar to either lever Labour or bludgeon them. Some sort of electoral arrangement – seemingly distant or impossible – is now a step closer.\n\nTurnout of 9,377 on an enrolled voter total of 43,796 is 21.4%.\n\nI first thought I had never seen a by-election turnout number this low – I could not recall any result below 10,000 votes – but that’s only because I have a poor memory as it turns out. The Electoral Commission’s election results page says otherwise as mentioned below. The actual percentage turnout though is the lowest, surely, at less than a quarter of the electorate casting a vote. I’m not going to trawl all the way back last century, but in my lifetime this must be the worst turnout ever. My sense – being a politics graduate who studied a lot of elections and electoral systems – is that this is a New Zealand record. So, congratulations, Tamaki Makaurau, you all made history last night simply by collectively not being arsed.\n\nThe previous two Maori electorate by-elections were connected to the Maori Party. Tariana Turia caused a by-election in her western Maori electorate of Te Tai Hauauru in July 2004 where the turnout was 7,861 (28%). The Tai Tokerau by-election result where Hone Harawira resigned from the Maori Party and then formed the Mana Party in June 2011 was 12,339 – 41% turnout. Dame Tariana had no real competition however as the Labour Party decided not to contest it so that sub-10,000 figure needs to be seen in this light – and even then the percentage was still over a quarter!\n\nWhy the lowest turnout in history?\n\nIn some ways it is totally counter-intuitive to think it would be low – let alone the lowest. Looking at it on paper one would think that where the two main parties to an electorate at the general election contest the by-election it will drive engagement and more so when those previous candidates were only 42 votes apart. Both parties have been actively working on the ground by all reports, even if the campaign debates didn’t start happening until the last fortnight. There has been nothing else on the political radar to distract from the by-election, the opportunities in the media have been there – at least Henare was using his free shots in the House at Question Time to generate some while Kaipara seemed like she was deliberately keeping a low profile after the initial buzz of her nomination. It was a slow burn and as it transpired no flames except for TPM’s Takuta Ferris hating on Labour’s immigrant Auckland membership with three days to go.\n\nIt is difficult to explain the lowest turnout ever, but I will attempt it.\n\nThe Editor of The Daily Blog and I had discussed the situation yesterday before polling closed and made some forecasts, one that we did agree on is the turnout would be a little over 10,000, but the weather was so bad it might drag it down to 10k or maybe just under. It is one thing to speculate on it, but it is shocking to see a figure even further south than that. The other reason is the relatively young population compared to other electorates that will always skew to a lower turnout. But goddamn, really? Astoundingly Labour’s machine couldn’t get the punters to the polls despite the massive resources they have as an operation. Something else is at play here for this scale of disengagement from the voting process.\n\nThe winter and the crappy wet weather on the day alone doesn’t account for it because we can clearly see turnout well above that in the two previous Maori electorate by-elections where there was no effective opposition candidate to the incumbent. In part, yes, this does mean political martyrdom drives turnout in Maori electorates. Did the punters – most of them younger – not connect with either Kaipara or Henare? Did the 78.6% who didn’t vote think there was no material difference between the leading candidates? Was the political love-in between the two candidates and lack of friction demotivating – either one is fine, and so someone else can perform the ritual of choosing them. I suspect that was the case, but it is much more troubling for Labour and what that might indicate about how Aucklanders regard them – the phone is still off the hook.\n\nAnd finally, Hannah Tamaki, the mad old girl be cray, cray-cray, but she knows when to thrust her face into the arse of free publicity to get noticed. It was fair to comment on Kaipara’s appearance and so in the spirit of fairness and consistency it’s fair to say that for someone obsessed with motorbikes she looks increasingly like she gets around on a broom. She looks like she’s gone from saying prayers to casting spells, and her talk of demonic forces is a defensive sort of projection. Following in the trajectory of her self-inflicted train wreck of an interview with Mr Bradbury on his show The Bradbury Group (see video below) got 146 votes out of the 9,377 total votes cast, or 1.6%. There were more of those leathered-up half-witted goons from hubby’s motorbike gang blocking the motorway than actually voted for her. It’s reassuringly low numbers. The Tamaki Temu cult and their political clown car Vision NZ – or more accurately Vicious NZ – is in need of a miracle. And please note in the video the revelation that she badgered her husband into forming the gang – that’s its manly origin story: my missus nagged me into forming this gang. Inspiring! Blessed be the fruit.","summary":"What an emphatic victory – and vindication &#8211; for Te Pati Maori and what a humiliating thrashing for Labour. The results at the end of last night (06/09/2025) for the Tamaki Makaurau electorate by-election confirmed as final, but not yet officially declared, give Oriini Kaipara a thumping 2,938 majority over Peeni Henare. Never would I [&#8230;]","url":"https://thedailyblog.co.nz/2025/09/07/tamaki-makaurau-by-election-bombshell-result/","image":"https://thedailyblog.co.nz/wp-content/uploads/2024/05/footer-logo.png","video":null,"publish_date":"2025-09-06 19:02:45","author":"Tim Selwyn","authors":["Tim Selwyn"],"language":"en","category":"politics","source_country":"nz","sentiment":-0.561},{"id":358061970,"title":"LAPD yanks cops off Kamala Harris’ mansion after uproar over diverted patrols","text":"The Los Angeles Police Department has pulled its cops from a security detail at Kamala Harris’ Brentwood, California home after outrage that crime-fighting units were being diverted to guard the former vice president.\n\nA dozen Metro Division officers had been stationed outside Harris’ mansion after President Trump revoked her Secret Service protection last week, ending an extension through which had been quietly granted by President Biden. \n\nBy Saturday, the backup was gone, sources told the Los Angeles Times.\n\nThe short-lived detail drew fury inside the department after LAPD officers were pulled from crime suppression in the San Fernando Valley to guard Harris. \n\n“Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi-millionaire … and who can easily afford to pay for her own security, is nuts,” the Los Angeles Police Protective League’s board said.\n\nMayor Karen Bass had directed LAPD to assist the California Highway Patrol in the wake of Trump’s move, which she called an act of “political retaliation.” \n\nCalifornia Gov. Gavin Newsom, who had to approve CHP protection, hasn’t confirmed the arrangement, but his office said “the safety of our public officials should never be subject to erratic, vindictive political impulse.”\n\nA FOX 11 helicopter spotted LAPD officers standing guard at Harris’ home earlier this week, but the city-funded detail was always expected to be temporary, with Harris likely to hire private security. \n\nThe controversy over taxpayer-funded protection comes as Harris gears up for a 15-stop international book tour promoting her memoir, “107 Days,” which recalls her brief 2024 presidential campaign.\n\nFormer vice presidents traditionally receive just six months of Secret Service protection, compared to lifetime coverage for presidents.\n\nA spokesperson for Harris did not immediately respond to a message seeking comment.","summary":"LAPD officers guarding Kamala Harris’ Brentwood mansion were pulled off duty after anger erupted over cops being taken from San Fernando Valley crime suppression, days after Trump revoked her extended Secret Service protection.","url":"https://nypost.com/2025/09/06/us-news/lapd-pulls-cops-from-kamala-harris-home-security-detail/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/110815389.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/jxz8pQ3m-RyIcpnTz.mp4","publish_date":"2025-09-06 18:41:11","author":"Samantha Olander","authors":["Samantha Olander"],"language":"en","source_country":"zm","sentiment":-0.289},{"id":358199822,"title":"Bari Weiss, media success story, can save CBS news from itself","text":"And become very rich doing so.\n\nYou may have heard by now that Paramount, the parent company of CBS News, will be buying Weiss’s The Free Press independent news site, for a reported $200 million, according to Puck News. Weiss launched the newsletter in 2021, not long after famously resigning from the Times by excoriating the alleged “paper of record” for “unlawful discrimination,” having “a hostile work environment,” and “caving to the whims of critics on Twitter.” \n\n“Stories are chosen and told in a way to satisfy the narrowest of audiences, rather than to allow a curious public to read about the world and then draw their own conclusions,” she wrote in said letter that attracted considerable news coverage. \n\n“Twitter is not the masthead of the New York Times, but Twitter has become the ultimate editor,” she correctly added. \n\nIn other words, the Times, which (for no reason whatsoever) eliminated the position of public editor, which served as an ombudsman of its content. Liz Spayd was its last public editor, but was forced out for the crime of calling our rampant bias at the Times, including what was likely the final nail in her public editor position in 2017, her article titled, “Trump, Russia, and the Story That Wasn’t.” \n\nSpayd did what she was supposed to do: take the Times (and legacy media as a whole) to task for running with Trump-Russia collusion stories without any evidence to support its explosive claims. So when Weiss, a classical liberal, did the same a few years later, her accusations against the paper were courageous but not necessarily surprising. \n\nAt a time when the media industry is largely faltering financially while draining most of its credibility down the toilet, The Free Press is an extraordinary modern-day success story. While other media entities fail or consolidate, Weiss expanded from a staff of a few to more than two dozen, including prominent writers from Douglas Murray to Abigail Shrier. Notable billionaires, including former Starbucks CEO Howard Schultz and venture capitalist David Sachs, invested in it. \n\nAnd in just four years, it boasts more than 1.5 million subscribers. It also expanded into hosting live events, including debates and panel discussions, before sold-out audiences across the country. \n\nIn addition to Paramount’s purchase of Weiss’s site, she’ll also be rewarded with a top leadership role, which has been sorely lacking at this once-proud news division. There have been several low points over the years, including Dan Rather’s pathetic attempt to alter the 2004 presidential election with a farcical story questioning George W. Bush’s National Guard service by using “fake but accurate” documents that were quickly called out as fakes. \n\nBut the worst example of bias came after 60 Minutes interviewed (installed) Democratic nominee Kamala Harris and clearly manipulated one of her answers on a question about Israel to make her sound coherent. Criticism poured in, but CBS refused to release the transcript of the interview for months until President Donald Trump sued the company for election interference. CBS-Paramount eventually released the transcript and settled for $16 million. A lose-lose all around. \n\nNevertheless, the Left has lost its collective mind over the hiring of Weiss, which is ironic considering she is not remotely close to being a conservative. \n\n“Handing Weiss the keys won’t broaden trust — it will further erode it among the people who actually watch the network, reinforcing suspicions about [Paramount CEO] David Ellison’s agenda,” wrote “Status” founder Oliver Darcy, whose newsletter is indistinguishable from what is coughed up at far-left Media Matters. “In effect, the move will set CBS News on a course to squander its hard-earned credibility with the audience that reveres its history and demands it stand unbowed to power.”\n\nOn what planet does CBS News have “hard-earned” credibility, especially after the Kamala debacle? That ship sailed the moment Walter Cronkite retired. As for the audience that reveres its history, it should also be noted there isn’t much of one: CBS This Morning and The CBS Evening News both sit in a distant third place behind ABC and NBC. \n\nThe Nation’s Jack Mirkinson goes even further with this unhinged take in a piece subtly titled, “Vile Grifters Are Taking Over Establishment Media.” \n\n“Bari Weiss has been making the world worse for a long time… If we lived in a less terrible time and place, Weiss would be dismissed as a crank and a bigot, and never heard from again. But we live in the waking nightmare that is the United States in 2025. So instead Weiss is being rewarded with a prize that even she must think is kind of wild… That prize? CBS News.”\n\nThe last straw for Weiss at Times came in the summer of 2020 after Sen. Tom Cotton (R-AR) wrote a perfectly acceptable piece arguing for the use of National Guard troops to be called in if local police were overwhelmed by rioters in cities such as Minneapolis and Atlanta. More than 1,000 staffers at the Times signed a denunciation letter of then-opinion editor James Bennet for the audacity of publishing a piece that half the country agreed with. Weiss was one of the few staffers not to sign the letter, which infuriated pro-censorship liberals. Bennet would resign just a few days later. \n\nFast forward to 2025, and not much has changed at the Times: \n\n“CBS is about to become your go-to news source on keffiyeh-wearing college students, how wokeness is the defining crisis of our times, whatever trans kids are up to, and whatever this is,” writes former Times editor Jil Filipovic. This is the same writer who laughably called Kamala Harris a “moderate” and Trump “an authoritarian” in her endorsement of the former vice president before the 2024 election. \n\n“The right wing grift economy is undefeated,” wrote “Internet Culture Expert” Taylor Lorenz. \n\nYup, Paramount purchasing a highly successful publication built from scratch is a “grift.” In a related story, The Free Press brings in $15 million in subscriber revenue per year. \n\nWeiss was ostracized by the press for her pro-Israel, anti-woke reporting. \n\nGIULIANI TO RECEIVE PRESIDENTIAL MEDAL OF FREEDOM, TRUMP SAYS\n\nNow Weiss may well be the next head of CBS News, a rudderless ship for decades that will only right itself if the right leadership is brought in. \n\nThat may just be happening with the addition of Weiss, the politically-independent entrepreneur who will likely be laughing all the way to the bank.","summary":"In Focus delivers deeper coverage of the political, cultural, and ideological issues shaping America. Published daily by senior writers and experts, these in-depth pieces go beyond the headlines to give readers the full picture. You can find our full list of In Focus pieces&#160;here. She was bullied, cast out, exiled from legacy media. But now [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3796123/bari-weiss-media-success-story-can-save-cbs-news-from-itself/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Norah-ODonnell-CBS-Evening-News.webp?w=696","video":null,"publish_date":"2025-09-06 18:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","source_country":"us","sentiment":-0.263},{"id":358158632,"title":"‘A Crime Against Humanity’- MSNBC Host Dismantles RFK Jr.’s Credibility in Scathing On-Air Monologue","text":"Robert F. Kennedy Jr., or RFK Jr., is known for controversy and faced more criticism this week. On a popular show on MSNBC, called The Last Word, the host (Lawrence O’Donnell) had powerful words for him. O’Donnell said RFK Jr. is “a crime against humanity” because of his long history of questioning vaccines and talking about conspiracy theories.\n\nRecently, he has linked autism with an autistic child’s mother using Tylenol when pregnant, and other such “facts” he thinks are true, and periodically comes up with. \n\nLawrence O’Donnell (who studied at Harvard with Kennedy) didn’t hold back in evaluating the man who has served as the 26th U.S. Secretary of Health and Human Services since 2025. He pointed out, “Robert Kennedy Junior did not take Biology in college, (…) did not take a single pre-med course in college, and could not have gotten through one,” O’Donnell said sharply. He argued that having a famous family name might help you get noticed, but it doesn’t mean you know anything about science.\n\nThe monologue climaxed when O’Donnell turned the tables on one of RFK Jr.’s well-known statements.\n\nEarlier, Kennedy had labeled COVID-19 vaccines as “a crime against humanity.” O’Donnell stung where it hurts by referencing RFK Jr.’s own words and saying that he himself is “a crime against humanity.”\n\nThis was quite the dramatic show on cable news. It all came as Dr. Kennedy faced a tough time at the Senate Finance Committee, where some accused him of not being completely honest about how the CDC has managed vaccine policies. Another MSNBC host, Joe Scarborough, went so far as to say that Dr. Kennedy was “lying repeatedly” while speaking to the lawmakers under oath.\n\nALSO READ: RFK Jr. as Health Secretary Triggers Fear—Here’s How Women Are Taking Control of Their Health!\n\nThe Kennedy name has a storied history in the American political arena, yet O’Donnell suggests it’s the source of the issue at hand. According to him, RFK Jr. secured his position under Donald Trump‘s administration solely due to his surname.\n\nInitially esteemed as an environmental attorney, RFK Jr. has since distanced himself from much of his family and the scientific world with his unorthodox health beliefs. His sister, Mary Kerry Kennedy, had reportedly even urged him to step down, especially after the chaos he brought to the CDC and his controversial stance on vaccine requirements.\n\n🚨NEW: Kerry Kennedy, brother of RFK Jr., calls for him to resign as HHS Secretary: “Enough is enough. Secretary Kennedy must resign. Now.”\nRETWEET if you stand with @KerryKennedyRFK against RFK Jr! pic.twitter.com/3urk8XK9yi\n— Protect Kamala Harris ✊ (@DisavowTrump20) September 6, 2025\n\nO’Donnell’s on-air anger was personal and had a clear warning.\n\nHe saw RFK Jr. as a problem because he thought being famous was more important than knowing what you’re talking about, especially when many people were getting sick and even dying from the coronavirus. It’s like saying, just because someone is famous or has a powerful family, they should be believed over scientists when it comes to keeping people safe and healthy!\n\nDespite this, we can’t deny RFK Jr. occupies a top position in the US government.\n\nThis is the photo Democrats want you to forget about. RFK Jr. endorsing Donald Trump 👏 🔥 pic.twitter.com/lt5uMsAprD\n— MAGA Voice (@MAGAVoice) October 2, 2024\n\nHis friendship with Donald Trump has only strengthened his power in Washington, particularly as he questions vaccines and rejects government health advice. This worries many because he uses his influence to spread ideas that aren’t science-based.\n\nNEXT UP: ‘Somebody Who’s Flown on Epstein’s Jet!’: RFK Jr. Humiliated in Brutal Senate Clash","summary":"MSNBC’s O’Donnell scorches RFK Jr. in a takedown for the ages.","url":"https://www.inquisitr.com/msnbc-host-dismantles-rfk-jr-s-credibility-in-scathing-on-air-monologue","image":"https://www.inquisitr.com/wp-content/uploads/2025/09/Lawrence-ODonnell-slammed-Robert-F.-Kennedy-Jr.-on-MSNBC-calling-him-a-crime-against-humanity.jpg","video":null,"publish_date":"2025-09-06 17:52:59","author":"Sohini Sengupta","authors":["Sohini Sengupta"],"language":"en","source_country":"us","sentiment":-0.141},{"id":358053066,"title":"CBS News changes editing policy after Kristi Noem interview complaint","text":"Sept. 6 (UPI) -- The CBS News program Face The Nation will no longer edit its recorded interviews before broadcast, following a complaint by Homeland Security Secretary Kristi Noem.\n\nNetwork executives confirmed the policy change this week, after Noem took issue with her recent appearance on the Sunday segment, which did not air her full comments.\n\nNoem called the practice \"deceptive\" editing, after the interview with moderator Margaret Brennan was trimmed from 16 minutes and 40 seconds to 12 minutes and 15 seconds.\n\nCBS News later posted the full, unedited interview online, as well as a full transcript of the interview.\n\nBrennan has hosted the interview-style program since 2018.\n\nNoem was discussing the case of Kilmar Abrego Garcia during the interview, the illegal immigrant facing deportation.\n\nThe Department of Homeland Security later issued a statement after the edited interview aired. The statement says CBS News \"selectively edited answers,\" and \"removed more than 23% of Secretary Noem's answers\" about Abrego Garcia.\n\nThis week, CBS CEO George Cheeks and CBS News President Tom Cibrowski both said they had reviewed the situation with the CEO of parent company Paramount, David Ellison, and agreed on the policy change.\n\n\"This extra measure means the television audience will see the full, unedited interview on CBS, and we will continue our practice of posting full transcripts and the unedited video online,\" the network said in a statement.\n\nParamount and CBS News have been targets of President Donald Trump since before he took office. The company has also been in talks for a multi-billion-dollar merger, which needed approval from the Trump administration.\n\nThe deal between Skydance Media and Paramount Global closed last month.\n\nThis past November, Trump sued CBS News for $10 billion, claiming it \"deceptively edited\" an interview with then Vice-President Kamala Harris to portray him in a negative light. Trump and CBS settled the lawsuit in July, a month before the Paramount merger was finalized.","summary":"The CBS News program Face The Nation will no longer edit its recorded interviews before broadcast, following a complaint by Homeland Security Secretary Kristi Noem.","url":"https://www.upi.com/Top_News/US/2025/09/06/cbs-news-kristi-noem-interview-edit-policy/8401757176198/","image":"https://cdnph.upi.com/sv/ph/og/upi/8401757176198/2025/1/bc36aa982027619ba8d6cafb5c576d71/v1.5/CBS-News-changes-editing-policy-after-Kristi-Noem-interview-complaint.jpg","video":null,"publish_date":"2025-09-06 17:34:34","author":"Simon Corlett","authors":["Simon Corlett"],"language":"en","source_country":"US","sentiment":-0.478},{"id":358064974,"title":"CBS News says it will no longer edit interviews on Sunday show ‘Face the Nation’, days after Kristi Noem complaint","text":"CBS News says that it will no longer edit interviews on its Sunday news show, “Face the Nation”, days after a complaint from Homeland Security Secretary Kristi Noem.\n\nThe broadcaster announced Friday it will now only broadcast live or live-to-tape interviews, subject to national security or legal restrictions, on the show.\n\nThe decision comes after Secretary Noem claimed that CBS News had “shamefully edited the interview to whitewash the truth” when she appeared on August 31 to discuss Kilmar Abrego Garcia, a migrant mistakenly deported to El Salvador who has become a high-profile case in the Trump administration’s crackdown on immigration.\n\nNoem’s interview with “Face the Nation” was taped in advance. After it was aired, Noem claimed that an important section of the interview had been cut, and posted her full, unedited response on X.\n\nIn the full response, she made a series of unproven accusations about Abrego Garcia, alleging that he was a member of gang MS-13, a “wife-beater” and had solicited nude photos from minors. Abrego Garcia has denied the accusations against him.\n\nIn response to Noem’s accusations, CBS News said that four minutes of the secretary’s interview had been edited out for timing purposes. \n\nOn Friday, the network said it will now only broadcast live or live-to-tape interviews on the show, meaning guests' statements will not be edited, subject to legal or national security restrictions. \n\nIn a statement to The Independent, a CBS News spokesperson said: “In response to audience feedback over the past week, we have implemented a new policy for greater transparency in our interviews. \n\n“Face the Nation will now only broadcast live or live-to-tape interviews (subject to national security or legal restrictions). This extra measure means the television audience will see the full, unedited interview on CBS and we will continue our practice of posting full transcripts and the unedited video online.”\n\nThe spokesperson did not comment on whether Noem’s complaint had affected the decision.\n\nNoem’s unedited interview was posted on CBS News’ website and on its YouTube channel.\n\nThe broadcaster’s change in editing policy is likely to renew claims that CBS is capitulating to the Trump administration, after settling with the president over his “60 Minutes” lawsuit.\n\nTrump had accused the network of “partisan and unlawful acts of election and voter interference” intended to “mislead the public and attempt to tip the scales” of the 2024 presidential election in favor of former vice president Kamala Harris after it aired different clips of her interview on “60 Minutes” and “Face the Nation.”\n\nTrump repeatedly alleged that Harris’ interview was edited by CBS News at the direction of her campaign, which the network denied. \n\nUltimately, CBS’s parent company, Paramount Global, agreed to pay $16 million to Trump to settle the lawsuit.\n\nThe new CBS News editing policy raises the possibility that it would allow guests to spread unchecked falsehoods on “Face the Nation”. However, hosts will still be able to fact-check or challenge claims made by interview subjects, an anonymous CBS News employee told the Associated Press.","summary":"The network announced Friday it will now only broadcast live or live-to-tape interviews, subject to national security or legal restrictions","url":"https://www.independent.co.uk/news/world/americas/us-politics/cbs-interview-editing-face-the-nation-kristi-noem-b2821502.html","image":"https://static.independent.co.uk/2025/08/31/16/00/Screenshot-2025-08-31-at-12-30-48.png?width=1200","video":"https://cdn.jwplayer.com/videos/Eglf1HK5-OhrQWqOm.mp4","publish_date":"2025-09-06 17:24:00","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":-0.308},{"id":358039892,"title":"Trump's Pick For Labour Stats Dept Linked To Racist, Offensive Remarks Against Democrats","text":"US President Donald Trump’s pick to lead the Bureau of Labour Statistics (BLS), EJ Antoni, allegedly operated a now-deleted Twitter account that featured sexually degrading attacks on Kamala Harris, offensive remarks about gay people and crude insults for Trump critics.\nAntoni, a 37-year-old economist and a staunch Trump loyalist, posted the offensive remarks from 2017 to 2020 under several usernames. As per a CNN investigation, all of Antoni’s posts came from the same Twitter account, and the posts from the anonymous aliases shared strikingly similar biographical details as Antoni.\nAntoni has been an outspoken critic of the non-partisan BLS, which calculates US job growth and unemployment figures. His appointment came after Trump fired the Biden-appointed BLS commissioner and accused the agency of corruption, without evidence, after a report showed job growth in May and June was weaker than previously estimated.\nHe works at the conservative think tank, Heritage Foundation, and has positioned himself as an advocate of government accountability through the organisation’s blog posts and media appearances. However, his digital presence is traced back to a pattern of offensive rhetoric that includes conspiracy theories and misogyny.\nAntoni’s Attacks On Top Democrats\nAntoni’s account was used to make degrading and sexist remarks about female Democratic politicians, including Kamala Harris, Alexandria Ocasio-Cortez, Rashida Tlaib and Ilhan Omar, as per the CNN report. It was also used to make unsubstantiated allegations against left-leaning public figures and bigoted attacks towards gay TV news anchors.\nIn 2019, the now-deleted account known as “ErwinJohnAntoni” changed its username to “phdofbombsaway”, and posted five sexually suggestive tweets implying that then-Senator Kamala Harris had advanced her career through sexual favours.\nHe also referred to Christine Blasey Ford, the woman who accused Supreme Court Justice Brett Kavanaugh of sexual assault, as “Miss Piggy” and retweeted several misogynistic posts. The account was also used to propagate conspiracy theories about the Covid-19 pandemic and the 2020 presidential elections.\nHis remarks include calling Alexandra Ocasio-Cortez a “whack job” and a “space cadet”. In March 2020, Antoni tweeted about Democratic Representative Rashida Tlaib, a Trump critic, saying, “No one wants to have sex with that catfish.”\nIn one post, he dismissed the existence of LGBTQ people, saying, “There is only one sexual orientation — everything else is a disorientation.” He also argued against abortion even in cases of rape.\nConcerns over Antoni’s Appointment\nAntoni was nominated to be the next BLS commissioner after Trump ordered the dismissal of Erika McEntarfer, who was appointed by former President Joe Biden, on August 1 after accusing her of publishing “phony” job creation numbers for July.\nThe White House defended Antoni and did not address the offensive tweets he made earlier. “President Trump has nominated Dr. EJ Antoni to fix the issues at the BLS and restore trust in the jobs reports. Dr. Antoni has the experience and credentials needed to restore solution-oriented leadership at the BLS — solutions that will prioritise increasing survey response rates and modernising data collection methods to improve the BLS’s accuracy,” CNN quoted White House spokesperson Taylor Rogers.\nHowever, Antoni has no experience working for the government, unlike McEntarfer. He earned a PhD in economics from Northern Illinois University in 2020 and took positions at the Texas Public Policy Foundation and the Heritage Foundation, which is believed to be the architect of Project 2025, a blueprint for Trump’s second term.\nAntoni’s work as an economist has also come under scrutiny after he co-published a report last year that claimed that the American economy had been in a recession since 2022, sparking backlash from economists across political circles.\nIn past media appearances, Antoni has echoed Trump’s dissatisfaction with labour statistics and the Federal Reserve. Earlier this year, he accused the central bank of “election interference” for cutting rates close to the 2024 presidential election, a claim Trump has also made.","summary":"EJ Antoni, who was nominated by Trump to lead the Bureau of Labour Statistics, allegedly operated a Twitter account that featured sexually degrading attacks against Democrats.","url":"https://www.news18.com/world/trumps-pick-for-labour-stats-dept-linked-to-racist-offensive-remarks-against-democrats-ws-bkl-9554498.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/trump-antoni-2025-09-0f1ae1569e2c81b12c09915f84ca01a5.jpg","video":null,"publish_date":"2025-09-06 16:54:25","author":"Aveek Banerjee,News18","authors":["Aveek Banerjee","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.356},{"id":358048102,"title":"LAPD ends protection of former Vice President Kamala Harris amid criticism over diverting cops, sources say","text":"The Los Angeles Police Department on Saturday discontinued its protection for former Vice President Kamala Harris after heavy criticism within its own ranks that officers were being diverted from crime suppression, sources told The Times. LAPD Metropolitan Division officers had been assisting the California Highway Patrol in protecting Harris and were visible until Saturday morning outside her Brentwood home. Both California police agencies scrambled this week to protect Harris after President Trump, her rival in November's election, revoked Harris’s Secret Service protection last week. Thursday. President Biden had extended that protection for Harris beyond the six months after leaving office that vice presidents traditionally get. Los Angeles Mayor Karen Bass had directed the LAPD to provide the security team to assist the CHP in the short term. According to sources, those Metro officers had to be drawn away from crime suppression work in the San Fernando Valley this week. The department is \"assisting the California Highway Patrol in providing protective services for former Vice President Kamala Harris until an alternate plan is established,\" said Jennifer Forkish, L.A. police communications director, on Thursday. \"This temporary coordinated effort is in place to ensure that there is no lapse in security.\" The CHP has not indicated how the LAPD's move would alter its arrangement with the former vice president nor said how long it will continue. A dozen or more LAPD officers began working a detail to protect Harris after Trump revoked her Secret Service protection as of Monday. Sources not authorized to discuss the details of the plan said the city would fund the security but that the arrangement was expected to be brief, with Harris hiring her own security in the near future. A security detail was seen outside Harris' Brentwood home by a Fox 11 helicopter as the station broke the story of the use of L.A. police earlier this week. The Los Angeles Police Protective League, the union that represents rank-and-file LAPD officers, criticized the move. \"Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi-millionaire... and who can easily afford to pay for her own security, is nuts,\" its board of directors said. The statement continued, \"Mayor Karen Bass should tell Governor Newsom that if he wants to curry favor with Ms. Harris and her donor base, then he should open up his own wallet because LA taxpayers should not be footing the bill for this ridiculousness.\" Newsom, who was required to sign off on CHP protection, has not confirmed the arrangement to The Times, but a spokesperson for Newsom added: \"The safety of our public officials should never be subject to erratic, vindictive political impulse.\" Bass, in a statement last week, commented on Trump scrapping the security detail for Harris, saying: \"This is another act of revenge following a long list of political retaliation in the form of firings, the revoking of security clearances, and more. This puts the former Vice President in danger and I look forward to working with the governor to make sure Vice President Harris is safe in Los Angeles.\" Deploying LAPD officers to protect Harris was a source of controversy within the department in years past. During L.A. Police Chief Charlie Beck's tenure, when Harris was a U.S. senator, plainclothes officers served as security and traveled with her from January 2017 to July 2018. Beck said at the time through a spokesman that the protection was granted based on a threat assessment. Beck's successor, Michel Moore, ended the protection in July 2018 after he said a new evaluation determined it was no longer needed. The decision came as The Times filed a lawsuit seeking records from then-Mayor Eric Garcetti detailing the costs of security related to his own extensive travel. Garcetti said he was unaware of the police protection until Moore ended it. Former vice presidents usually get Secret Service protection for six months after leaving office, while former presidents are given protection for life. But before his term ended, then-President Biden signed an order to extend Harris' protection to July 2026. Aides to Harris had asked Biden for the extension. Without it, her security detail would have ended last month, according to sources. The curtailing of Secret Service protection comes as Harris is going to begin a book tour next month for her memoir, titled “107 Days.” The tour has 15 stops, which include visits to London and Toronto. The book title references the short length of her presidential campaign. Harris, the first Black woman to serve as vice president, was the subject of an elevated threat level — particularly when she became the Democratic presidential contender last year. The Associated Press reports, however, a recent threat intelligence assessment by the Secret Service conducted on those it protects, such as Harris, found no red flags or credible evidence of a threat to the former vice president.","summary":"California officials scrambled this week to protect Harris after President Trump revoked her Secret Service protection.","url":"https://www.latimes.com/california/story/2025-09-06/lapd-ends-protection-of-ex-vp-kamala-harris-after-criticism-of-diverting-cops-from-crime-suppression","image":"https://ca-times.brightspotcdn.com/dims4/default/2c6621e/2147483647/strip/false/crop/2048x1365+0+0/resize/1486x990!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F90%2F61%2F0821d4294a8bb4a19cd2f399e666%2Fla-me-ln-kamala-harri","video":null,"publish_date":"2025-09-06 16:25:59","author":"Richard Winton","authors":["Richard Winton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":358028626,"title":"Trump Astride at 7 Months","text":"President Donald Trump’s greatest achievement within six months was simply ending illegal immigration as we had once known it—without “comprehensive immigration reform” or any other rhetorical trickery.\n\nIt remains difficult to find, much less deport, the 10 to 12 million illegal aliens who entered in the last four years.\n\nThose who helped break the law, by design or indifference, now believe it was moral to destroy federal immigration law but immoral to uphold it.\n\nAnd it is still unclear whether former President Joe Biden’s handlers deliberately sabotaged their own border for political and demographic purposes out of sheer orneriness or utter incompetence.\n\nMany of the Left’s cherished totems—massive Green New Deal subsidies, the diversity/equity/inclusion industry, biological males competing in women’s sports, and the U.S. Agency for International Development revolving door—are either comatose or in their death throes.\n\nThe historic drop-off in military recruitment reversed shortly after Trump took office.\n\nRepublican voter registration is up, and Democrat registration is down.\n\nAbroad, Trump finds remarkable successes.\n\nFor now, there are pauses in the fighting between India and Pakistan, Egypt and Somalia, Cambodia and Thailand, Rwanda and Congo, Serbia and Kosovo, and Armenia and Azerbaijan.\n\nMuch credit is due to Trump for brokering ceasefires.\n\nIran will not get a bomb in the next four years—as seemed likely when Biden left office.\n\nThe Middle East’s current most grotesque terrorist cadres and states—Iran, Hezbollah, Hamas, and the Houthis—are far weaker than they were when Trump entered office in January.\n\nThere is at least some engagement in envisioning the outlines of a ceasefire in Trump’s inherited Ukraine War.\n\nThe rub is finding the degree of ordnance necessary to convince Putin that increasing Russia’s casualties to more than one million will endanger his own dictatorship sooner than destroy Ukraine.\n\nBreaking up the new three-billion-person China/India/Russia nexus hinges on ending the war.\n\nThe economy is still strong. Gas prices are at historic lows. Increases in all types of energy production proceed full bore.\n\nCurrent gross domestic product, inflation, unemployment, and the stock market—all at one time or another said to be in a crisis state—remain strong. Talk of an impending recession or hyperinflation is mostly muted.\n\nNo one quite knows either the full effects of Trump’s tariffs—especially given the injunctions issued by left-wing district justices—or of the promised over $10 trillion in foreign investments.\n\nMuch of Trump’s agenda will hinge on whether interest rates are lowered, Republicans survive the midterms, and the degree to which unelected left-wing lower-court justices can be stopped from hijacking the Constitution and de facto running the country.\n\nAs for the Democrat opposition, there is no counter agenda, no shadow government responsible leadership, and no willingness to craft bipartisan legislation.\n\nInstead, the Left’s strategy is that of the kamikaze: to destroy Trump at the cost of destroying the Democratic Party.\n\nOtherwise, Democrats seek to prove so obnoxious in demonizing Trump that they create such mass hysteria that the weary electorate figuratively lies down, closes its eyes, covers its ears, and screams nonstop, “Make them all go away!”\n\nFormer foul-mouthed vice presidential candidate Tim Walz is now reduced to a ghoulish status. He recently boasted to an audience that rumors of Trump’s death—who survived two assassination attempts last summer—will thankfully one day prove true.\n\nThe top of the failed ticket, Kamala Harris, wanders aimlessly without an office, constituency, audience, or ideas.\n\nTo remain viable, she knows she must continue touring and speaking. But Harris accepts that the more anyone hears her word salads, the more they will remember her 2024 train wreck.\n\nHead of the Democratic Party, Ken Martin, now screams that Trump is a fascist.\n\nBut by what standards does he judge? Did Trump try to take his rivals off state ballots?\n\nDoes he advocate for destroying the filibuster, the Electoral College, and the 156-year-old nine-justice Supreme Court, or packing the Senate by admitting two new states?\n\nAre local, state, and federal prosecutors—a la Bragg, James, Smith, and Willis—coordinating with the White House and the Justice Department to indict Trump’s current chief adversaries, such as Gavin Newsom, Kamala Harris, or Josh Shapiro?\n\nDid Trumpers hire a foreign spy to concoct a fake hit dossier on Democrat grandees?\n\nAre his subordinates now spreading it to the media?\n\nAre 51 conservative former CIA contractors and retired spooks swearing that Newsom or Harris is working with the Russians, Chinese, or any of our enemies?\n\nThe greatest Democrat fear?\n\nThat it has so institutionalized excessive executive orders, ad hominem lawfare, lower-court usurpation, state nullification of federal law, and federal intervention in higher education, the energy industry, and the nation’s open spaces that their own legacies empowered Trump and now will boomerang upon themselves—as the public applauds the karma.\n\n(C)2025 Tribune Content Agency, LLC.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"President Donald Trump&#8217;s greatest achievement within six months was simply ending illegal immigration as we had once known it—without &#8220;comprehensive immigration reform&#8221; or any other... Read More\n\n\nThe post Trump Astride at 7 Months appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/06/trump-astride-at-seven-months/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/GettyImages-2230143735.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-09-06 16:00:00","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.094},{"id":358196874,"title":"Mimicking Donald Trump will only get Gavin Newsom so far","text":"The Democratic Party brand is in the gutter and at least one of its aspiring standard bearers is settling for chasing his own ambitions instead of trying to effectively pump life into the flailing party.\n\nRecent polling shows the Democratic Party’s approval rating is at the lowest it’s been in decades. Fewer than one quarter of registered voters have a favorable view of the party, while 56 percent hold a negative view, according to a CNBC poll from a few weeks ago.\n\nIt turns out that Joe Biden’s ‘Weekend at Bernie’s” presidency and the Democratic coverup did considerable damage to the party’s brand. And instead of pushing forward with real solutions to the real problems voters face, Democrats have focused almost exclusively on opposing Trump, who is like a catnip to them.\n\nThe constant focus on attacking Trump with little solution-based messaging means they are constantly being defined by Trump, proving that simply being someone who is not someone else is not an inspiring strategy.\n\nMany Democrats have deluded themselves into thinking they lost to Trump twice because they didn’t fight or fight hard enough, especially since they have fought him constantly over the past decade.\n\nLiberal data guy Nate Silver wrote gleefully that the abhorrent national gerrymandering fight, which California Democrats are proudly diving into, signals the end of a decade-plus of a “when they go low, we go high” attitude among Democratic leaders.\n\n“Democrats are fighting mad about Trump-led Republican efforts to conduct mid-decade redistricting in Texas and other states in advance of next year’s midterms — and, perhaps for a change, they’re in a mood to fight back,” he wrote.\n\nSilver’s comments mirror those of many others, including Democratic voters and Gov. Gavin Newsom, who are all clearly misremembering the recent past. I’m not sure at what point Democrats went high in their interactions with Trump: They impeached him twice, prided themselves on how often Democratic states sued the Trump administration, passed laws to try to block his access to the ballot and pursued criminal charges against him, just to name a few things.\n\nThis is all on top of the late-night TV and social media posts mocking him, countless Democrats campaigning against him, and endless news and opinion articles calling him everything from a felon to a rapist to a threat to democracy to Hitler.\n\nIn other words, it’s absurd to think Democrats’ problem was they didn’t fight enough. They might not have fought effectively, but there wasn’t a lack of effort.\n\nWatching the campaign for the Democratic presidential nomination shape up suggests change is not coming soon for Democrats. Former Vice President Kamala Harris can’t decide what she wants to do but she apparently saddled the Democratic National Committee with millions of dollars of debt, which has left a large opening for Newsom, who is trying every gimmick to get attention except actually doing a good job governing.\n\nFor the past few months, Newsom tapped his social media team to impersonate Trump online, typing in all caps, making self-aggrandizing claims (more than normal, that is), and being generally combative. Apparently, it’s working a little.\n\nNewsom has enjoyed a 13-point bump year over year in the latest Emerson College poll, which shows him outperforming former Vice President Kamala Harris.\n\nNewsom has every incentive to keep the ruse going, but it’s going to be a lot of work to pretend to be someone else for the next few years, especially someone Newsom has called a grifter and compared to Hitler.\n\nNewsom and his catty social media team often boast about how well California performs compared to all other states. But the claims are only true in ways that have nothing to do with Newsom. Does anyone actually think California’s economic wealth has much to do with Newsom’s decision-making? Where Newsom is involved (or completely absent, as the case may be) the state is bad and getting worse.\n\nWorking against Newsom is the fact that he’ll have to keep coming up with gimmicks because his record in California is one of failure. This is the same Newsom who just a few years ago helped inspire progressive thought leader Ezra Klein to write damningly in the New York Times: “If progressivism can’t work there, why should the country believe it can work anywhere else?”\n\nThat was in 2021. Newsom has done nothing to change that perception, though he’ll tweet a bunch of lies and half truths that say otherwise.\n\nThis is also the same Newsom who a few months ago was pretending to be moderate, even somewhat conservative, pro-gun and manly. This was after years of decrying what he called toxic masculinity.\n\nIn fact, there have been so many Newsom’s over the past few years, so many desperate pleas for attention, that something had to work eventually.\n\nBut it probably won’t last. Newsom is having a moment now, but sooner or later impersonating Trump won’t be enough.\n\nIf Democratic leaders are interested in expanding their appeal, they should start by showing they can solve a problem. Any problem. Pick one. There are plenty of things voters need help with.\n\nAnd voters should hold them accountable. Don’t reward Newsom for being obnoxious; reward him for being effective – if he can figure out how.\n\nMatt Fleming is a columnist for the Southern California News Group. Follow him on X @FlemingWords and write to him at flemingwords@gmail.com","summary":"Working against Newsom is the fact that he’ll have to keep coming up with gimmicks because his record in California is one of failure.","url":"https://www.sandiegouniontribune.com/2025/09/06/mimicking-donald-trump-will-only-get-gavin-newsom-so-far/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/LDN-L-REDISTRICTING-0810-01.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-06 15:00:52","author":"Gqlshare,Matt Fleming","authors":["Gqlshare","Matt Fleming"],"language":"en","category":"politics","source_country":"us","sentiment":-0.476},{"id":358016904,"title":"Mimicking Donald Trump will only get Gavin Newsom so far","text":"The Democratic Party brand is in the gutter and at least one of its aspiring standard bearers is settling for chasing his own ambitions instead of trying to effectively pump life into the flailing party.\n\nRecent polling shows the Democratic Party’s approval rating is at the lowest it’s been in decades. Fewer than one quarter of registered voters have a favorable view of the party, while 56 percent hold a negative view, according to a CNBC poll from a few weeks ago.\n\nIt turns out that Joe Biden’s ‘Weekend at Bernie’s” presidency and the Democratic coverup did considerable damage to the party’s brand. And instead of pushing forward with real solutions to the real problems voters face, Democrats have focused almost exclusively on opposing Trump, who is like a catnip to them.\n\nThe constant focus on attacking Trump with little solution-based messaging means they are constantly being defined by Trump, proving that simply being someone who is not someone else is not an inspiring strategy.\n\nMany Democrats have deluded themselves into thinking they lost to Trump twice because they didn’t fight or fight hard enough, especially since they have fought him constantly over the past decade.\n\nLiberal data guy Nate Silver wrote gleefully that the abhorrent national gerrymandering fight, which California Democrats are proudly diving into, signals the end of a decade-plus of a “when they go low, we go high” attitude among Democratic leaders.\n\n“Democrats are fighting mad about Trump-led Republican efforts to conduct mid-decade redistricting in Texas and other states in advance of next year’s midterms — and, perhaps for a change, they’re in a mood to fight back,” he wrote.\n\nSilver’s comments mirror those of many others, including Democratic voters and Gov. Gavin Newsom, who are all clearly misremembering the recent past. I’m not sure at what point Democrats went high in their interactions with Trump: They impeached him twice, prided themselves on how often Democratic states sued the Trump administration, passed laws to try to block his access to the ballot and pursued criminal charges against him, just to name a few things.\n\nThis is all on top of the late-night TV and social media posts mocking him, countless Democrats campaigning against him, and endless news and opinion articles calling him everything from a felon to a rapist to a threat to democracy to Hitler.\n\nIn other words, it’s absurd to think Democrats’ problem was they didn’t fight enough. They might not have fought effectively, but there wasn’t a lack of effort.\n\nWatching the campaign for the Democratic presidential nomination shape up suggests change is not coming soon for Democrats. Former Vice President Kamala Harris can’t decide what she wants to do but she apparently saddled the Democratic National Committee with millions of dollars of debt, which has left a large opening for Newsom, who is trying every gimmick to get attention except actually doing a good job governing.\n\nFor the past few months, Newsom tapped his social media team to impersonate Trump online, typing in all caps, making self-aggrandizing claims (more than normal, that is), and being generally combative. Apparently, it’s working a little.\n\nNewsom has enjoyed a 13-point bump year over year in the latest Emerson College poll, which shows him outperforming former Vice President Kamala Harris.\n\nNewsom has every incentive to keep the ruse going, but it’s going to be a lot of work to pretend to be someone else for the next few years, especially someone Newsom has called a grifter and compared to Hitler.\n\nNewsom and his catty social media team often boast about how well California performs compared to all other states. But the claims are only true in ways that have nothing to do with Newsom. Does anyone actually think California’s economic wealth has much to do with Newsom’s decision-making? Where Newsom is involved (or completely absent, as the case may be) the state is bad and getting worse.\n\nWorking against Newsom is the fact that he’ll have to keep coming up with gimmicks because his record in California is one of failure. This is the same Newsom who just a few years ago helped inspire progressive thought leader Ezra Klein to write damningly in the New York Times: “If progressivism can’t work there, why should the country believe it can work anywhere else?”\n\nThat was in 2021. Newsom has done nothing to change that perception, though he’ll tweet a bunch of lies and half truths that say otherwise.\n\nThis is also the same Newsom who a few months ago was pretending to be moderate, even somewhat conservative, pro-gun and manly. This was after years of decrying what he called toxic masculinity.\n\nIn fact, there have been so many Newsom’s over the past few years, so many desperate pleas for attention, that something had to work eventually.\n\nBut it probably won’t last. Newsom is having a moment now, but sooner or later impersonating Trump won’t be enough.\n\nIf Democratic leaders are interested in expanding their appeal, they should start by showing they can solve a problem. Any problem. Pick one. There are plenty of things voters need help with.\n\nAnd voters should hold them accountable. Don’t reward Newsom for being obnoxious; reward him for being effective – if he can figure out how.\n\nMatt Fleming is a columnist for the Southern California News Group. Follow him on X @FlemingWords and write to him at flemingwords@gmail.com","summary":"Working against Newsom is the fact that he’ll have to keep coming up with gimmicks because his record in California is one of failure.","url":"https://www.ocregister.com/2025/09/06/mimicking-donald-trump-will-only-get-gavin-newsom-so-far/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/LDN-L-REDISTRICTING-0810-01.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-06 15:00:52","author":"Matt Fleming","authors":["Matt Fleming"],"language":"en","category":"politics","source_country":"US","sentiment":-0.476},{"id":358019210,"title":"CBS forbids editing of 'Face the Nation' interviews after complaints from Noem","text":"Days after complaints over the handling of an interview with Homeland Security Secretary Kristi Noem on “Face the Nation,” CBS News said Friday it would no longer allow editing of its guests' words on the Sunday morning public affairs show.Noem charged that CBS had “shamefully edited the interview to whitewash the truth” about Kilmar Abrego Garcia, whose mistaken deportation to El Salvador made him a symbol of controversies about President Donald Trump's immigration crackdown. Her interview had been taped in advance.Going forward, CBS said it would only broadcast live or live-to-tape interviews on the show, meaning guests' statements could not be edited, subject to legal or national security restrictions. CBS said the change was made “in response to audience feedback.”The network's news division is being watched closely for how it deals with the Trump administration following the FCC's recent approval of its parent company's takeover by Skydance Media. Shortly before Paramount Global's sale to Skydance was given the OK, Paramount paid $16 million to settle a lawsuit from Trump over a “60 Minutes” interview with Democratic presidential candidate Kamala Harris.CBS said it had edited four minutes out of its Noem interview for time. On social media, Noem focused on an excised clip where she made a series of unproven accusations about Abrego Garcia, which she said emphasized “the threat he poses to American public safety.”CBS News noted that the unedited interview was posted on its website and on YouTube, but that didn't stop the complaints.Like the “60 Minutes” settlement, the policy change opens CBS News to charges that it is capitulating to Trump. During an interview on Tuesday with the Daily Caller, White House press secretary Karoline Leavitt called “Face the Nation” host Margaret Brennan “stupid.”The new policy also raises the possibility that “Face the Nation” would allow guests to spread unchecked falsehoods on the program. But Brennan will still be able to fact-check or challenge claims made by interview subjects, said a CBS News employee familiar with the change who spoke under condition of anonymity because they were not authorized to publicly discuss it.In its announcement, CBS News said the policy will allow for “greater transparency” in interviews.The case that provoked Trump's lawsuit also involved “Face the Nation.” The president accused the network of deception because different clips aired on “60 Minutes” and “Face the Nation” last fall showed Harris giving different answers to a question posed by correspondent Bill Whitaker.","summary":"CBS News will stop editing 'Face the Nation' interviews after Kristi Noem accused it of cutting her remarks, citing a push for more transparency.","url":"https://www.scrippsnews.com/politics/cbs-forbids-editing-of-face-the-nation-interviews-after-complaints-from-noem","image":"https://ewscripps.brightspotcdn.com/dims4/default/c2c94f4/2147483647/strip/true/crop/3183x1671+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F16%2Fda%2F5b3085464e4eb91177a08266b54f%2Fap25238723522783.jpg","video":null,"publish_date":"2025-09-06 14:14:27","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","source_country":"us","sentiment":-0.341},{"id":358020188,"title":"Nolte: CBS News Admits Defeat, Will Stop Editing On-Air Interviews After Misleading Kristi Noem Clip","text":"Disgraced, far-left CBS News announced a policy change after it was caught selectively editing an interview with Department of Homeland Security Secretary Kristi Noem.\n\n“Face the Nation will now only broadcast live or live-to-tape interviews (subject to national security or legal restrictions),” CBS News said in a statement Friday. “This extra measure means the television audience will see the full, unedited interview on CBS and we will continue our practice of posting full transcripts and the unedited video online.”\n\nSo, no more selective editing broadcasts to deliberately damage the Republican and boost the Democrat.\n\nYeah, we’ll see.\n\nThis is the second time CBS has surrendered this year. Back in July, the corrupt outlet agreed to pay out $16 million to President Trump. He sued CBS for election interference after 60 Minutes got caught selectively editing Trump’s presidential opponent, Kamala Harris, to make her look better during her abysmal campaign (she’s a Democrat).\n\nLess than two months after that settlement, CBS was right back to its old regime tricks. In this case, Noem appeared on Face the Nation and laid out the allegations against Kilmar Abrego Garcia, a confirmed illegal alien and credibly accused wife beater/gang banger/human trafficker/child porn solicitor. CBS cut that crucial part of her interview. Its only explanation — and it’s a laughable one — is that out of the full hour broadcast, those 24 seconds put Face the Nation over the time limit.\n\nAt first CBS was defiant.\n\n“Secretary Noem’s Face The Nation interview was edited for time and met all CBS News standards,” the far-left network harrumphed in a statement. “The entire interview is publicly available on YouTube, and the full transcript was posted early Sunday morning at CBSNews.com.”\n\nTranslation: CBS News looked into the accusation against CBS News and found that CBS News did nothing wrong.\n\nThe arrogance in that statement is one thing. What struck me more is that CBS News believes it is still living in the past where it can get away with 1) selectively editing Noem to make the administration looks like it’s obsessively chasing an innocent Maryland Man, and 2) issuing smug statements that will make this all go away.\n\nIt’s not 2007 anymore, y’all. And because the old, corrupt, corporate regime media has spent decades whoring out its moral authority with this…\n\nPhoto of Starving Gaza Baby Hoax\nIsraeli Troops Murdered Food-Seeking Palestinians Hoax\nTrump Tariffs Will Explode Prices Hoax\nMaryland Man Hoax\nBlack Newborns Much More Likely to Die If Doc’s White Hoax\nElon Musk Nazi Salute Hoax\nMass Hysterectomies Performed on Immigrants Hoax\nThe All-White Trump Party Hoax\nSpringfield Bomb Threat Hoax\nTrump Called for Liz Cheney to Be Executed Hoax\nViolent Crime Down Under Biden/Harris Hoax\nArlington Cemetery Hoax\nKamala Was Never America’s Border Czar Hoax\nRussia Collusion Hoax\nHands Up, Don’t Shoot Hoax\nJussie Smollett Hoax\nCovington KKKids Hoax\nVery Fine People Hoax\nSeven-Hour Gap Hoax\nRussian Bounties Hoax\nTrump Trashes Troops Hoax\nPolicemen Killed at Mostly Peaceful January 6 Protest Hoax\nRittenhouse Hoax\nEating While Black Hoax\nBorder Agents Whipping Illegals Hoax\nNASCAR Noose Hoax\nGeorgia Jim Crow 2.0 Hoax\nTrump Assaulted Secret Service Agents and Grabbed Steering Wheel of Beast Hoax\nMAGA Assaulted Paul Pelosi Hoax\nCOVID Lab Leak Theory Is Racist Hoax\nHunter Biden’s Laptop Is Russian Disinformation Hoax\nJoe Biden Will Never Ban Gas Stoves Hoax\nCOVID Deaths are Overcounted Is a Conspiracy Theory Hoax\nMass Graves of Native Children in Canada Hoax\nTrump Killed Japanese Koi Fish Hoax\nTrump Told People to Drink Bleach Hoax\nHamas Hospital Hoax\nIf Reelected, Trump Will Execute People Hoax\nThe 900,000 Kids Hospitalized with Coronavirus Hoax\nDozens of Environmental Hoaxes\nThe Alfa Bank Hoax\nLibs of TikTok Murdered Non-Binary Teen Hoax\nAaron Rodgers Sandy Hook-Truther Hoax\n‘Bloodbath’ Hoax\nBiden ‘Sharp-as-a-Tack’ Hoax\nIowa Poll Hoax\n\n…alternative media is kicking your ass.\n\nA media that was honest and fair wouldn’t have any of these problems, but they just can’t do it.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"Disgraced, far-left CBS News announced a policy change after it was caught selectively editing an interview with Department of Homeland Security Secretary Kristi Noem.\n\n\nThe post Nolte: CBS News Admits Defeat, Will Stop Editing On-Air Interviews After Misleading Kristi Noem Clip appeared first on Breitbart.","url":"https://www.breitbart.com/the-media/2025/09/06/nolte-cbs-news-admits-defeat-will-stop-editing-on-air-interviews-after-misleading-kristi-noem-clip/","image":"https://media.breitbart.com/media/2025/09/GettyImages-1229093307-640x335.png","video":null,"publish_date":"2025-09-06 13:55:28","author":"John Nolte","authors":["John Nolte"],"language":"en","source_country":"US","sentiment":-0.49},{"id":358139804,"title":"Red state Republicans invoke Christian values to gerrymander out a Black minister","text":"As the Show-Me State joins the mid-decade gerrymandering war following prodding by President Donald Trump, Republican leaders quickly framed the effort as a godly mission. Yet, their proposed map seeks to flip the seat of U.S. Rep. Emanuel Cleaver, a longtime Democratic congressman who is also a United Methodist minister.\n\nIn announcing a special legislative session to redraw congressional lines, Gov. Mike Kehoe insisted the change would represent Missouri’s “common sense values, rooted in faith, family, and freedom.” Similarly, Senate President Pro Tem Cindy O’Laughlin claimed Kehoe “wants to be sure Missouri’s representation matches Missouri’s Christian conservative majority.”\n\nSomehow, the plan allegedly rooted in faith values to represent Christians means driving out of office one of only three ministers in the U.S. House of Representatives. As a Baptist minister in Missouri who would be thrown from the third district to the fifth district that is currently Cleaver’s seat, I reject efforts to bless this profane partisan power grab as based on Christian values.\n\nDuring the redistricting process over three years ago — at the constitutionally prescribed time — some conservative politicians and activists unsuccessfully targeted Cleaver’s seat. Ultimately, state lawmakers approved a map keeping a 6-2 Republican advantage in Missouri’s congressional delegation instead of carving up Kansas City to try for a 7-1 map now under consideration.\n\nOf course, a 5-3 split would more closely match statewide elections. That divide still gives Republicans a bit more than the 2024 results when Trump defeated Kamala Harris 58%-40% and Kehoe beat Crystal Quade 59%-39%. So the current map is gerrymandered, just not as badly as Trump wants.\n\nEven if we accept O’Laughlin’s claim of needing a map to represent “Missouri’s Christian conservative majority,” that would not justify a 7-1 map. Only 62% of Missourians identify as Christian — the same percentage as five seats out of eight. Even that gives her argument too much credit since not all of Missouri’s Christians are conservatives, as Cleaver proves.\n\nFor those who desired a 7-1 split three years ago, the partisan goal of rigging the maps was often cast as a Christian mission. As I documented in my new book, The Bible According to Christian Nationalists, proponents of a 7-1 map in 2022 misused Scripture to justify trying to oust a Methodist politician. They twisted Bible verses out of context to depict themselves as divinely chosen heroes on a righteous crusade to save the nation.\n\nYet, as they gerrymandered the Bible to defend their partisanship, they overlooked basic moral teachings like treat others how you want them to treat you, do not steal, and love your neighbor as yourself. Kehoe and O’Laughlin make the same mistake now. They wish to claim the mantle of upholding Christian values all while violating how Jesus clearly taught his followers to behave.\n\nAlthough Kehoe and O’Laughlin spin their motives, Cleaver noted more honestly what this “unprecedented” attempt will do. Calling it a move to “silence voices,” Cleaver insisted voters should pick their representatives, not the other way around. He added: “Our nation has endured wars, depressions, and great struggles for civil rights. And through it all, the principle that every vote counts has carried us forward. That principle is bigger than me, this seat, or any president looking to rig the rules for personal gain.”\n\nIf Kehoe and O’Laughlin were honest, they would admit the inspiration for this partisan gerrymandering came not from Christian values but Trump. While they appear to hold enough political power to ram the new map through, they do not own the terms “faith” and “Christian.” I will not sit by quietly as they seek to rig morality.\n\nAs the biblical prophet Isaiah insisted, we must not call bitter “sweet” or call evil “good.”\n\nNOW READ: Trump's horrific cult contains the seeds of its own destruction","summary":"As the Show-Me State joins the mid-decade gerrymandering war following prodding by President Donald Trump, Republican leaders quickly framed the effort as a godly mission. Yet, their proposed map seeks to flip the seat of U.S. Rep. Emanuel Cleaver, a longtime Democratic congressman who is also a United Methodist minister.\n\nIn announcing a special legislative session to redraw congressional lines, Gov. Mike Kehoe insisted the change would represent Missouri’s “common sense values, rooted in faith, family, and freedom.” Similarly, Senate President Pro Tem Cindy O’Laughlin claimed Kehoe “wants to be sure Missouri’s representation matches Missouri’s Christian conservative majority.”\n\nSomehow, the plan allegedly rooted in faith values to represent Christians means driving out of office one of only three ministers in the U.S. House of Representatives. As a Baptist minister in Missouri who would be thrown from the third district to the fifth district that is currently Cleaver’s seat, I reject efforts to bless this p","url":"https://www.alternet.org/gerrymandering-2673966832/","image":"https://www.alternet.org/media-library/image.jpg?id=61562371&width=1200&height=600&coordinates=0%2C172%2C0%2C172","video":null,"publish_date":"2025-09-06 11:39:49","author":"Brian Kaylor,Missouri Independent","authors":["Brian Kaylor","Missouri Independent"],"language":"en","category":"politics","source_country":"us","sentiment":0.164}]}