{"offset":0,"number":50,"available":563,"news":[{"id":363253410,"title":"Mother of Dallas ICE shooter Joshua Jahn is hardline liberal who raged against gun rights","text":"The mother of a sniper who killed two migrants in a horror shooting at a Dallas ICE facility was a liberal supporter of anti-gun laws who targeted members of the GOP over mass shootings. \n\nSharon Jahn, the mother of 29-year-old Joshua Jahn, kept an active Facebook page where she followed everyone from Kamala Harris and Rachel Maddow to an account representing the U.S. Democratic Socialists. \n\nAfter the tragic mass shooting in Uvalde, Texas in 2022, she posted a lengthy rant to Facebook challenging Senators Ted Cruz and John Cornyn, as well as Governor Greg Abbott for their support of gun rights. \n\nShe wrote: 'Governor Abbott, Senator Cornyn and Senator Cruz how does it make you feel that your action to open up gun laws is responsible for the killing of 21 more people? Do you secretly sit in front of a tv and smile a demented smile? You must be proud of all the money that sits in your bank accounts from gun lobby support. Was it worth it, Governor Abbott? How about you senators?'\n\n'When you prioritize money over people this is what you get,' Jahn added, noting 'blood money' all three had taken from the gun lobby. \n\nShe further slammed Cornyn for not having 'the spine to stand up to the NRA' for missing their annual meeting and saying he was a 'spineless coward. \n\n'Why have our government officials failed us? Their lust for money and power. It is time we vote out spineless tools and bring in people who actually care about others.'\n\nShe also posted a poem that read: 'If we only have love, we can melt all the guns, and give the new world to our daughters and sons.' \n\nJahn was confronted by The Independent earlier Tuesday while she was sobbing.\n\n'I'm sorry, I can't talk to you right now. I'm sorry, I'm so sorry. But I just can't talk to you now,' she said. \n\nThe Daily Mail has reached out to Jahn for further comment.\n\nHer son Joshua Jahn, 29, was named as the gunman who opened fire on the ICE detention center around 7am Wednesday morning, before killing himself as cops descended on him. \n\nLaw enforcement said that the sniper perched on a roof adjacent to the facility and rained bullets on the migrants as they were being transported in an unmarked ICE van. \n\nInvestigators said that they are still establishing a motive, but believe the shooting may have been fueled by anti-law enforcement sentiment. \n\nFBI Director Kash Patel released images of bullets found at the scene, showing 'anti-ICE' scrawled on the shells in blue ink. \n\nAfter Jahn was identified as the alleged shooter, his brother Noah told NBC News that he did not believe his brother was especially interested in politics and had not voiced his opinions on immigration before. \n\n'He didn't have strong feelings about ICE as far as I knew,' his brother said. \n\nNoah said his brother was unemployed but had previously worked as a coder, and was planning on moving in with their parents in Oklahoma. \n\nJahn has been pictured in a mugshot from his arrest in 2015, when he was hit with felony charges for delivering marijuana in an amount greater than 1/4 ounce. \n\nHe was a registered independent in the 2024 election, but last voted in the Democratic primaries in March 2020, records showed.\n\nThe alleged shooter's brother reportedly spoke before he knew that his brother had been identified as the sniper, and described him as 'unique' without elaborating. \n\n'I didn't think he was politically interested,' he continued, saying he had last seen him two weeks before the shooting on Wednesday and nothing seemed unusual. \n\n'He wasn't interested in politics on either side as far as I knew.' \n\nThe siblings grew up in Allen, Texas, and spent their childhoods attending the Boy Scouts, the brother said. \n\nHe added that his brother knew how to use a rifle that his parents owned, but insisted that 'he's not a marksman, that's for sure.' \n\nAsked about the ICE facility shooting, he remarked: 'He would not be able to make any shots like that.' \n\nAs investigators descended on the scene in Dallas, images showed a poster taped to the side of a vehicle believed to belong to Jahn. \n\nA sign with what appears to be black splatter on the car reads: 'Radioactive fallout from nuclear detonations that've passed over these areas more than 2x since 1951.'\n\nHomeland Security spokesperson Tricia McLaughlin told CNN that the death toll stood at two as of Wednesday afternoon. A third victim was in serious condition. \n\nInvestigators said Jahn fired 'indiscriminately' at the ICE office, peppering the transport van with bullets and also hitting windows in the building numerous times. \n\nWitness Arianny Sierra told NBC that she was in her car waiting for her husband to return from an ICE appointment in the facility when she heard shots ring out. \n\n'The shots began at around 6:10 a.m. There were like 20 shots in a row,' she said.\n\nThe victims were ICE detainees, and no law enforcement were injured in the shooting. Officials said at a press conference on Wednesday morning that the sniper opened fire 'from an elevated position' as migrants were inside the transport van. \n\nHe is believed to have been found on the roof of a nearby immigration attorney's office, WFAA reported. \n\nPatel said in an X post: 'While the investigation is ongoing, an initial review of the evidence shows an ideological motive behind this attack.\n\n'These despicable, politically motivated attacks against law enforcement are not a one-off.'\n\nAlthough the sniper appeared to target migrants in ICE custody, Texas Attorney General Ken Paxton wrote on X that the shooting represented an attack on ICE and law enforcement.\n\n'We will continue to do everything in our power to combat the alarming increase of targeted attacks against ICE and all law enforcement by evil, twisted individuals,' Paxton wrote.\n\nVice President JD Vance added: 'The obsessive attack on law enforcement, particularly ICE, must stop. I'm praying for everyone hurt in this attack and for their families.'\n\nAt the press conference on Wednesday, Texas Senator Ted Cruz made an impassioned plea for the end of politically motivated violence that has swept the nation in recent times.\n\n'We should not be putting language out there that inspires mad men to commit evil crimes,' Cruz said. 'Stop it, please.'\n\nCruz also cited the recent assassination of Charlie Kirk, telling reporters: 'It was two weeks ago today that we saw a political assassination in Utah that tore the heart out of much of this country.","summary":"Sharon Jahn, the mother of 29-year-old Joshua Jahn, kept an active Facebook page where she followed everyone from Kamala Harris to an account representing Democratic Socialists.","url":"https://www.dailymail.co.uk/news/article-15131183/Mother-Dallas-ICE-shooter-Joshua-Jahn-hardline-liberal.html","image":"https://i.dailymail.co.uk/1s/2025/09/25/00/102428591-0-image-m-19_1758755436638.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/24/3280779127479222990/1024x576_MP4_3280779127479222990.mp4","publish_date":"2025-09-25 00:24:49","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.215},{"id":363242940,"title":"‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility","text":"‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nSept. 24, 202502:27\n\n10-year-old chess player is now the youngest-ever female International Master\n\nNow Playing\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nFBI says fake apartment ads on social media a growing scam\n\nSorority ‘RushTok’ videos becoming big business\n\nKimmel returns to air for first time in nearly a week\n\nGrowing controversy over Camp Mystic reopening\n\nDeadly Super Typhoon Ragasa kills at least 17 people\n\nText message from 80-year-old softball teammate inspires millions of fans\n\nKamala Harris details her presidential campaign\n\nJimmy Kimmel set to return to late night tonight\n\nRyan Routh attempts to stab himself in neck after conviction\n\nPlot foiled to take down New York City cell phone grid\n\nTrump signals shift on Ukraine after blunt speech criticizing the U.N.\n\nFrench authorities investigate close call at airport\n\nSuper Typhoon Ragasa threatens Southern China\n\nWH strongly denies report Tom Homan accepted money from undercover FBI agents\n\nMore Americans live in RVs as cost of owning a home rises\n\nComedian and audience come together to save one man’s life during comedy show\n\nTens of thousands attend emotional service for Charlie Kirk\n\nDisney announces Kimmel show will return to air on Tuesday following suspension\n\nNightly News\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nAuthorities said a detainee was killed in a shooting at a Dallas ICE facility that DHS said was an attack against ICE agents. The acting ICE director said the gunman was “randomly shooting” at the facility striking a van holding detainees. NBC News’ Priscilla Thompson reports.Sept. 24, 2025\n\nGet more newsLiveon\n\n10-year-old chess player is now the youngest-ever female International Master\n\nNow Playing\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nFBI says fake apartment ads on social media a growing scam\n\nSorority ‘RushTok’ videos becoming big business\n\nKimmel returns to air for first time in nearly a week\n\nGrowing controversy over Camp Mystic reopening\n\nGet more newsLiveon\n\nBest of NBC News\n\nNightly News\n\n10-year-old chess player is now the youngest-ever female International Master\n\nNightly News\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nNightly News\n\nFBI says fake apartment ads on social media a growing scam\n\nNightly News\n\nSorority ‘RushTok’ videos becoming big business\n\nNightly News\n\nKimmel returns to air for first time in nearly a week\n\nNightly News\n\nGrowing controversy over Camp Mystic reopening","summary":"Authorities said a detainee was killed in a shooting at a Dallas ICE facility that DHS said was an attack against ICE agents. The acting ICE director said the gunman was “randomly shooting” at the facility striking a van holding detainees. NBC News’ Priscilla Thompson reports.","url":"https://www.nbcnews.com/nightly-news/video/-anti-ice-message-found-on-bullets-after-deadly-shooting-at-dallas-ice-facility-248284229924","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_09/1758755170289_nn_pth_ICE_Dallas_250924_1920x1080-gf7htr.jpg","video":null,"publish_date":"2025-09-24 23:06:21","author":null,"language":"en","source_country":"na","sentiment":-0.256},{"id":363242934,"title":"Kimmel returns to air for first time in nearly a week","text":"Kimmel returns to air for first time in nearly a week\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\nKimmel returns to air for first time in nearly a week\n\nSept. 24, 202501:35\n\n10-year-old chess player is now the youngest-ever female International Master\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nFBI says fake apartment ads on social media a growing scam\n\nSorority ‘RushTok’ videos becoming big business\n\nNow Playing\n\nKimmel returns to air for first time in nearly a week\n\nGrowing controversy over Camp Mystic reopening\n\nDeadly Super Typhoon Ragasa kills at least 17 people\n\nText message from 80-year-old softball teammate inspires millions of fans\n\nKamala Harris details her presidential campaign\n\nJimmy Kimmel set to return to late night tonight\n\nRyan Routh attempts to stab himself in neck after conviction\n\nPlot foiled to take down New York City cell phone grid\n\nTrump signals shift on Ukraine after blunt speech criticizing the U.N.\n\nFrench authorities investigate close call at airport\n\nSuper Typhoon Ragasa threatens Southern China\n\nWH strongly denies report Tom Homan accepted money from undercover FBI agents\n\nMore Americans live in RVs as cost of owning a home rises\n\nComedian and audience come together to save one man’s life during comedy show\n\nTens of thousands attend emotional service for Charlie Kirk\n\nDisney announces Kimmel show will return to air on Tuesday following suspension\n\nNightly News\n\nKimmel returns to air for first time in nearly a week\n\nJimmy Kimmel’s late night talk show returned to the air, nearly a week after Disney suspended it. Kimmel explained the comments he made in the wake of the assassination of Charlie Kirk and warned about threats to freedom of speech. NBC News’ Liz Kreutz reports.Sept. 24, 2025\n\nGet more newsLiveon\n\n10-year-old chess player is now the youngest-ever female International Master\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nFBI says fake apartment ads on social media a growing scam\n\nSorority ‘RushTok’ videos becoming big business\n\nNow Playing\n\nKimmel returns to air for first time in nearly a week\n\nGrowing controversy over Camp Mystic reopening\n\nGet more newsLiveon\n\nBest of NBC News\n\nNightly News\n\n10-year-old chess player is now the youngest-ever female International Master\n\nNightly News\n\n‘Anti-ICE’ message found on bullets after deadly shooting at Dallas ICE facility\n\nNightly News\n\nFBI says fake apartment ads on social media a growing scam\n\nNightly News\n\nSorority ‘RushTok’ videos becoming big business\n\nNightly News\n\nKimmel returns to air for first time in nearly a week\n\nNightly News\n\nGrowing controversy over Camp Mystic reopening","summary":"Jimmy Kimmel’s late night talk show returned to the air, nearly a week after Disney suspended it. Kimmel explained the comments he made in the wake of the assassination of Charlie Kirk and warned about threats to freedom of speech. NBC News’ Liz Kreutz reports.","url":"https://www.nbcnews.com/nightly-news/video/kimmel-returns-to-air-for-first-time-in-nearly-a-week-248281669849","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_09/1758754401792_nn_lkr_jimmy_kimmel_returns_250924_1920x1080-0q9mob.jpg","video":null,"publish_date":"2025-09-24 22:53:27","author":null,"language":"en","source_country":"na","sentiment":-0.264},{"id":363253408,"title":"Trump demands apology from Kamala Harris on 'closest election' claim","text":"President Donald Trump is demanding an apology from former Vice President Kamala Harris for saying several times while promoting her new book that the 2024 election was the 'closest election in the 21st century.' \n\n'Kamala Harris, who is DUMB AS A ROCK, is going around and using, as a standard part of her Speech on why she lost the Election, that 2024 was the \"closest Presidential Election in the 21st Century,\"' Trump wrote on Truth Social adding, 'Everyone knows this is a lie.' \n\nThere have been six presidential elections in the 21st century - which began after a true toss-up election in the year 2000.\n\nOf those races, the closest margin in the Electoral College vote count came in 2004, when Republican President George W. Bush won reelection over Democrat John Kerry.\n\nThe margin of difference was just 35 electoral votes.\n\nIn 2024, Trump won 312 Electoral College votes to Harris' 226 - a difference of 86 Electoral College votes. \n\nBut in calculating the closest election of the 21st century, it depends on how you do the math. If based purely on popular vote tallies, Harris' calculation stands up. \n\nA spokesperson for Harris pointed the Daily Mail to a New York Times story that characterized the 1.5 percent popular vote margin as the 'smallest margin since 2000.' \n\n'Fact check true,' her spokesperson said. \n\nThe popular vote margin in the 2024 election was about 1.5 percent, which is indeed the smallest popular vote margin since the 2000 election. \n\nFor comparison, the 2000 election popular vote margin was about 0.51 percentage points, when Al Gore won the popular vote but lost in the Electoral College.\n\nIn 2020, Joe Biden secured over 81 million votes and carved out a margin of about 4.45 percentage points nationwide. The 2016 election was a popular vote difference of just 2 percentage points, nearly as tight as 2024, but not quite. \n\nIn 2012, Barack Obama won by 3.8 percentage points over Mitt Romney after besting John McCain by a 7 points nationally in 2008.\n\nThe 2004 election had George W. Bush winning by 2.46 points over John Kerry.\n\nOn the popular vote tally, 2024 was no landslide. \n\n'I won the Electoral College, 312-226, a LANDSLIDE, Counties Nationwide, 2,600 to 525, a LANDSLIDE, all seven Swing States, a LANDSLIDE, and, despite the fact that California's Fake Mail In Ballots came in at ridiculous numbers (It was RIGGED!), I still won the Popular Vote by MILLIONS! Trump said. \n\nThere is no evidence that California's mail-in ballots impacted the election results, though Trump used the widespread use of mail-in ballots in 2020 amid the COVID-19 pandemic to falsely claim that election had been 'stolen.' \n\nOn Truth Social, Trump then pointed to Bush's razor-thin win in 2000 - despite that election not technically happening in the 21st century, which began on January 1, 2001. \n\n'Kamala's \"closest in the 21st Century\" soundbite was, like everything else in the Democrat Party, A TOTAL LIE!' Trump said. \n\nHarris has made the 21st-century claim during several recent media appearances as she's resurfaced to promote her book, 107 Days. \n\n'The sitting vice president enters the race against a former president of the United States who's been running for 10 years, with 107 days to go. And it ended up being the closest presidential election in the 21st century,' Harris said during a Monday night appearance on MSNBC's the Rachel Maddow show. \n\nMaddow didn't challenge Harris' assessment during the sit-down. \n\nTrump announced that he was planning to run for the White House a third time on November 15, 2022, after losing the 2020 election to President Joe Biden. \n\nWhile Trump had a long runway, Biden didn't drop his bid to be the Democratic nominee until July 21, 2024, leaving Harris just over three months to mount a viable presidential campaign. \n\nThroughout her book tour, she's revealed some behind-the-scenes drama and second-guessing she experienced when making her vice presidential pick.","summary":"President Donald Trump is demanding an apology from former Vice President Kamala Harris for saying that the 2024 election was the 'closest election in the 21st century.'","url":"https://www.dailymail.co.uk/news/article-15130773/trump-apology-kamala-harris-closest-election.html","image":"https://i.dailymail.co.uk/1s/2025/09/24/22/102428439-0-image-a-28_1758749964509.jpg","video":null,"publish_date":"2025-09-24 22:52:15","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.153},{"id":363232808,"title":"Harris faces backlash for saying Buttigieg was not viable running mate due to being gay","text":"Former Vice President Kamala Harris faced swift criticism for saying that it was not viable to have former transportation secretary Pete Buttigieg as her running mate in 2024 due to him being gay. \"I guess I’d ask you to just elaborate on that a little bit. It’s hard to hear,\" MSNBC host Rachel Maddow said Monday during an interview with Harris about her campaign memoir.\"You’re the first woman elected vice president. You’re a Black woman and a South Asian woman elected to that high office, very nearly elected president. To say that he couldn’t be on the ticket effectively because he was gay, it’s hard to hear.\" In her new book, \"107 Days,\" Harris wrote that Buttigieg \"would have been an ideal partner — if I were a straight White man.\" \"That's not what I said, that he couldn't be on the ticket because he is gay,\" the former presidential candidate responded. \"I was clear that in '107 Days,' in one of the most hotly contested elections for president of the United States against someone like Donald Trump, who knows no floor, to be a Black woman running for president of the United States, and as a vice presidential running mate, a gay man. With the stakes being so high, it made me very sad. But I also realized it would be a real risk.\" KAMALA HARRIS BREAKS SILENCE ON BIDEN DROPOUT, ADMITS SHE HAS REGRETS ABOUT HER HANDLING OF SITUATION She said she had been an ally of the LGBTQ community her whole life and said it was not due to any \"prejudice\" on her part, but rather because she feared it would be untenable with Americans to elect a Black woman with a gay running mate. \"We had such a short period of time. And the stakes were so high. I think Pete is a phenomenal, phenomenal public servant,\" she said. Harris’ interview was immediately criticized online. \"Kamala Harris claims she couldn't pick Pete Buttigieg as her VP because he's gay, so she settled for buffoon Tim Walz,\" conservative CNN commentator Scott Jennings said, mocking Harris’ later choice for running mate. \"So to her, being gay is a bigger liability than endorsing taxpayer-funded sex changes for minors?! This logic is incoherent. Voters made the right choice.\" Sen. Ted Cruz, R-Texas, also mocked Harris’ eventual choice, writing, \"Kamala couldn’t pick Buttigieg bc he’s gay. She couldn’t pick Shapiro bc he’s Jewish. So, in today’s crazy Dem party, she went with Walz—who’s just weird!\" KAMALA HARRIS' NOD TO PETE BUTTIGIEG TEES UP POTENTIAL 2028 RUN: DNC VICE CHAIR Talk show host Piers Morgan balked at how the times have changed, quipping, \"This is beyond parody… Kamala admits to snubbing Buttigieg because he’s gay. What happened to DEI?!\" Radio personality Bo Snerdley mocked Harris, arguing she was speaking deceptively about her own words in her book. \"She didn't say what her book said she said — but then she says it again,\" he wrote. It wasn't just on the right that Harris took criticism. \"I'm not a Buttigieg fan, but the way homophobia often works is that people discriminate against gay people on the basis of the idea that other people are homophobic,\" Noah Berlatsky wrote on progressive-leaning social media site Bluesky. Former Chicago Mayor Rahm Emanuel said Harris failed to trust her \"gut\" with her decision. Buttigieg himself said he was surprised by Harris' admission, telling Politico, \"My experience in politics has been that the way that you earn trust with voters is based mostly on what they think you’re going to do for their lives, not on categories.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Fox News Digital reached out to Harris’ team and the Human Rights Campaign, a major LGBTQ advocacy group, but did not receive an immediate response. CLICK HERE TO GET THE FOX NEWS APP","summary":"Political backlash erupts as Kamala Harris admits she couldn&apos;t choose Pete Buttigieg as running mate because he&apos;s gay, drawing widespread criticism.","url":"https://www.foxnews.com/media/harris-faces-backlash-saying-buttigieg-not-viable-running-mate-due-being-gay","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/kamala-harris-and-pete-buttigieg.jpg","video":"https://www.foxnews.com/video/6379980425112","publish_date":"2025-09-24 22:00:18","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"US","sentiment":-0.051},{"id":363232810,"title":"Democrat gubernatorial candidates' records for supporting trans athletes in women's sports coming into focus","text":"The New Jersey and Virginia gubernatorial elections each feature Democratic candidates with a congressional record of supporting trans athletes in women's sports. Mikie Sherrill of New Jersey and Abigail Spanberger of Virginia have come under scrutiny in recent days for their stances on the subject. Spanberger was the subject of a recent viral interview with ABC13 when she was asked about trans people playing women's and girls' sports and using women's bathrooms. The Democratic candidate did not take a concrete stance. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"So in Virginia, until very recently, we have had a process in place where on an individual, one by one basis, schools, principals, parents, coaches were making decisions based on fairness, competitiveness and safety, where a child might be able or might not be able to play in a particular sport,\" Spanberger said. When asked if she would support a bill that allows trans people in female bathrooms and sports, Spanberger said, \"I would support a bill that would put clear provisions in place that provide a lot of local ability for input, based on the age of children, based on the type of sport, based on competitiveness. Because certainly I recognize, I absolutely recognize. \"I recognize the concern that families and community members might have about the safety of their own kids, about competitiveness, about fairness. And I think the process that was in place for 10 years was one that was working. It was one that took individual circumstances and individual communities into account, and I think that is the process that Virginia should continue to utilize.\" Spanberger was a co-sponsor of The Equality Act in 2021, which \"prohibits discrimination on the basis of sexual orientation, gender identity, and sex characteristics,\" and then in 2023 she voted against the Protection of Women and Girls in Sports Act, which would have protected female athletes from trans competitors nationally. Meanwhile, Sherill has been the subject of criticism on social media for her congressional voting record on the issue. INSIDE GAVIN NEWSOM'S TRANSGENDER VOLLEYBALL CRISIS Former University of Pennsylvania women's swimmer and women's sports activist Paula Scanlan, the first UPenn swimmer to speak up about the school's Lia Thomas controversy in 2022, called out Sherrill on X over the issue this week. Like Spanberger, Sherrill also co-sponsored the Equality Act, but Sherrill also co-sponsored the Transgender Bill of Rights, which more explicitly \"guarantees certain rights for transgender and nonbinary people with respect to public services and accommodations,\" including sports teams consistent with gender identity. Sherrill also voted against the Protection of Women and Girls in Sports Act, twice, when the bill was first proposed in 2023, and again this past February when it was re-introduced. The New Jersey GOP attacked Sherrill for this record directly in a campaign graphic last week. Sherrill's opponent, Republican Jack Ciatterelli, mentioned this issue for Sherrill in a post back in July. Fox News Digital has reached out to both Sherrill's and Spanberger's campaigns requesting clarity on why they voted the way they did on those previous bills, and whether they would enforce President Donald Trump's \"Keeping Men Out of Women's Sports\" executive order as governor of their respective states. Neither campaign has provided a response. Back in January, a New York Times/Ipsos survey found the vast majority of Americans, including a majority of Democrats, don't think transgender athletes should be permitted to compete in women's sports. Of the 2,128 people who participated, 79% said biological males who identify as women should not be allowed to participate in women's sports. Of the 1,025 people who identified as Democrats or leaning Democrat, 67% said transgender athletes should not be allowed to compete with women. Among 1,022 Republicans, that number was 94%. The 81 independents who were interviewed represented the group with the most reluctance to say transgender athletes shouldn't be allowed to compete. Just 64% said they were against it, while 26% refused to answer. Just 3% of the Democrats and 1% of the Republicans refused to answer. Nearly 70% of Americans say biological men should not be permitted to compete in women's sports, according to a Gallup poll last year. Additional data suggests the issue impacted the 2024 election. A national exit poll conducted by the Concerned Women for America (CWA) legislative action committee found that 70% of moderate voters saw the issue of \"Donald Trump’s opposition to transgender boys and men playing girls' and women’s sports and of transgender boys and men using girls' and women’s bathrooms\" as important to them. And 6% said it was the most important issue of all, while 44% said it was \"very important.\" Meanwhile, prominent Democratic figures have backpedaled on their party's support for males in women's sports, including Pete Buttigieg, Gavin Newsom and even Kamala Harris. CLICK HERE TO GET THE FOX NEWS APP In her recent book \"107 Days,\" Harris wrote that she \"agrees\" with the concerns of parents and athletes who oppose letting males compete with females. \"I agree with the concerns expressed by parents and players that we have to take into account biological factors such as muscle mass and unfair student athletic advantage when we determine who plays on which teams, especially in contact sports,\" Harris wrote. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Democratic gubernatorial candidates Mikie Sherrill and Abigail Spanberger defended trans athlete participation despite polling showing voter opposition.","url":"https://www.foxnews.com/sports/democrat-gubernatorial-candidates-records-supporting-trans-athletes-womens-sports-coming-focus","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/mikie-sherrill-abigail-spanberger-trans-flag.jpg","video":"https://www.foxnews.com/video/6378531214112","publish_date":"2025-09-24 21:42:21","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.243},{"id":363220180,"title":"Dem Rep. Josh Riley quietly invested in DC distillery that sells ‘Fascist Tears Vodka’ and likes ‘ICE Crushed’","text":"WASHINGTON — Freshman Democratic Rep. Josh Riley has racked up shares in a “women-owned, queer-led” DC-based distillery that sells left-wing branded liquor such as Fascist Tears Vodka and Dissent Gin — and prides itself on preferring “ICE crushed.”\n\nWhile it’s not clear when Riley invested in the distillery, the 44-year-old has ties to its co-founder, Pia Carusone, a veteran Democratic operative who helped craft ads for his two congressional campaigns.\n\nRiley, whose sprawling district includes the cities of Binghamton, Catskill, Hudson, Ithaca, and Monticello, holds between $1,001 and $15,000 worth of shares in Carusone’s Republic Restoratives LLC, according to financial disclosures.\n\nThe revelations about Riley’s investment in the in-your-face, politically charged spirit slinger come amid a spate of violence targeting Immigration and Customs Enforcement and political figures such as conservative activist Charlie Kirk, who was assassinated Sept. 10 by a suspect who engraved the phrase “Hey fascist! Catch” on one of his unfired bullet casings.\n\nOn Wednesday, a sniper opened fire on an ICE facility in Dallas, killing one detainee and wounding two others before taking his own life. The suspect, identified as 29-year-old Joshua Jahn, had scrawled the words “Anti ICE” on his ammo, according to the FBI.\n\nRepublic Restoratives Distillery is nestled in northeastern DC about three miles from the White House, and has cultivated a niche following — particularly among lefty Beltway operatives.\n\n“This isn’t just a cocktail bundle. It’s a statement. A middle finger to every billionaire-funded politician trying to control what you can say, do, or drink,” reads one description of a “spirit pack” offering Fascist Tears vodka, Dissent gin and Assembly gin for $159.\n\nCarusone — who served as chief of staff to then-Rep. Gabby Giffords (D-Ariz.) when the legislator was shot and seriously wounded in a 2011 assassination attempt — co-founded the distillery in 2016 with her longtime friend Rachel Gardner, hailing it as the “largest crowdfunded distillery in U.S. history.”\n\nIn addition to the politically-charged branding, proceeds from liquor sales are used to boost left-wing causes. \n\nFor example, money from the sale of Dissent Gin goes to the National Network of Abortion Funds, which helps lower-income women terminate their pregnancies.\n\nCivic Pride vodka sales fund Advocates for Trans Equality.\n\nThe distillery’s most eye-catching product, Fascist Tears Vodka, bears branding reminiscent of conservative broadcaster Ben Shapiro’s “Leftist Tears” paraphernalia, with proceeds going to Vote.org.\n\nRepublic Restoratives also offers “Fascist Tears” T-shirts and mugs, and one advertisement for the spirit declares that “We Prefer Our ICE Crushed,” in a clear nod to left-wing hatred for the border agency.\n\nEarlier this month, the distillery shouted out California Gov. Gavin Newsom after his press office posted an AI-generated clip of the Democrat imbibing “MAGA Tears” branded alcohol.\n\nOther products include Madam whiskey, with a picture of former Vice President Kamala Harris on the bottle, and Rodham Rye — a nod to Hillary Clinton.\n\nOn April 1 of this year, the distillery mused about creating Gulf of Mexico Tequila in a rebuke of Trump’s renaming of the body of water to the Gulf of America.\n\n“Last year on April Fools’ Day, we posted a fake bottle called Fascist Tears,” the Republic Restoratives Facebook page wrote. “You flooded the comments. So we made it real.”\n\nThe Post reached out to Riley’s team and Carusone for comment.","summary":"Freshman Hudson Valley Rep. Josh Riley appears to have quietly racked up shares in a \"women-owned, queer-led\" DC-based distillery that sells politically branded liquor such as \"Fascist Tears Vodka,\" \"Dissent\" gin that funds abortion, and prides itself in preferring \"ICE crushed.\"","url":"https://nypost.com/2025/09/24/us-news/dem-rep-josh-riley-quietly-invested-in-dc-distillery-that-sells-fascist-tears-vodka-and-likes-ice-crushed/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-r2k6vxknn-1758729570233.jpg?quality=75&strip=all&1758715260&w=1200","video":"https://cdn.jwplayer.com/videos/j613i2DX-RyIcpnTz.mp4","publish_date":"2025-09-24 21:08:55","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":0.052},{"id":363243058,"title":"Kamala Harris is a 'human Chernobyl,' says Joe Concha","text":"to top close Video This video is playing in picture-in-picture.\n\nKudlow September 24, 2025 08:40 \n\n Kamala Harris is a 'human Chernobyl,' says Joe Concha \n 'Kudlow' panelists Joe Concha and Mark Simone discuss the state of the New York City mayoral race and former Vice President Kamala Harris' book tour.\n\nTags WHAT TO WATCHSHOWSKUDLOWKUDLOW | LATEST EPISODESV-VIDEOSPOLITICS","summary":"&apos;Kudlow&apos; panelists Joe Concha and Mark Simone discuss the state of the New York City mayoral race and former Vice President Kamala Harris&apos; book tour.","url":"https://www.foxbusiness.com/video/6380060586112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/73faa333-5436-4caa-82cc-88431539f67b/6c7ea672-e13b-4a04-9311-6a066266e705/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-24 21:08:24","author":null,"language":"en","source_country":"us","sentiment":0.23},{"id":363227336,"title":"Socialist Mayoral Candidate Beloved By Democrats Admits He Should Apologize To NYPD, Doesn’t Apologize","text":"Democratic New York City Mayoral nominee Zohran Mamdani knows he should apologize. He just doesn’t seem to want to do it. \n\nThe New York Times (NYT) asked Mamdani on Sept. 11 if he felt he should “apologize to police officers” for a 2020 tweet calling the New York City Police Department (NYPD) “racist, anti-queer, and a major threat to public safety.” (RELATED: We Now Know Which Crimes Are A-OK With Beloved Socialist Candidate Zohran Mamdani … For Now)\n\nMamdani eventually agrees an apology is warranted. First, he blusters, according to an edited transcript of the interview released Wednesday. \n\n Honesty and accountability matter. So too does an apology. But @andrewcuomo is incapable of that. Grateful to the families who gathered us across party lines to mark the 5th anniversary of the ex-Gov’s tragic decision to send patients with COVID back into nursing homes. pic.twitter.com/VgGywuHUnX — Zohran Kwame Mamdani (@ZohranKMamdani) March 24, 2025\n\n“Those comments are not reflective of not only the campaign that I’ve run, but also my view of public safety and the fact that police will be critical partners in delivering public safety,” Mamdani said. “Beyond every headline and beyond every caricature, what I’ve found is a New Yorker simply trying to do the best that they can. I know that that is the case for NYPD officers,” \n\n“Do you still believe that now?” The NYT questioned. \n\n“No. These were comments that I made at the height of frustration in 2020 around the ways in which after the murder of George Floyd, many New Yorkers felt a real betrayal on the promise — to use Eric Adams’s words — of safety and justice being things that could be mutually delivered, as opposed to one at the expense of another,” Mamdani claimed.\n\n“If those comments are wrong and you don’t believe them now, should you apologize to the officers of the N.Y.P.D.?”\n\n“Yes,” Mamdani admitted.\n\nIt’s been nearly two weeks since Mamdani told the Times he should apologize. Tick, tock. \n\nMamdani has received enthusiastic endorsements from Independent Vermont Sen. Bernie Sanders, Democratic Massachusetts Sen. Elizabeth Warren, and Democratic New York City Rep. Alexandria Ocasio-Cortez. And a lackluster endorsement from former vice president Kamala Harris. (RELATED: Kamala Harris Half-Heartedly Backs Socialist Zohran Mamdani Without Even Saying His Name)\n\nMamdani is projected to win the mayor’s race, according to a Sept. 9 NYT/Siena Poll.\n\nThe NYT includes Mamdani’s response regarding the NYPD in a Wednesday article, “10 (More) Questions With Zohran Mamdani.” They do not reference an apology issued in that time. Mamdani’s X profile, which is frequently updated, bears no mark of apology, either. \n\nMaybe he’s just being consistent.\n\nDuring 2020’s Astoria assembly race, Mamdani lambasted his opponent, Aravella Simotas, for apologizing. \n\n This morning our opponent said she was sorry that her returning police money made the right-wing press angry. That this was not her intention. Here’s a promise to Astoria: I will never apologize for standing up for what’s right. We know what’s coming. And we’re ready to fight. pic.twitter.com/W6e0F0Bk3c — Zohran Kwame Mamdani (@ZohranKMamdani) June 1, 2020\n\n“This morning our opponent said she was sorry that her returning police money made the right-wing press angry. That this was not her intention.”\n\n“Here’s a promise to Astoria: I will never apologize for standing up for what’s right,” Mamdani pledged.\n\nHe’s reluctant to apologize for standing up for what’s wrong, too.\n\nFollow Natalie Sandoval on X: @NatSandovalDC","summary":"Just being consistent","url":"https://dailycaller.com/2025/09/24/zohran-mamdani-democrat-socialist-new-york-city-police-apology-interview-sorry/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2235950167-e1758745247476.jpg","video":null,"publish_date":"2025-09-24 20:48:38","author":"Natalie Sandoval","authors":["Natalie Sandoval"],"language":"en","category":"politics","source_country":"US","sentiment":-0.288},{"id":363248002,"title":"GOP strategist calls Harris a ‘failed Hail Mary’ for Democrats in 2024 election","text":"to top close Video This video is playing in picture-in-picture.\n\nFox And Friends September 24, 2025 06:48 \n\n GOP strategist calls Harris a ‘failed Hail Mary’ for Democrats in 2024 election \n Republican strategist Katie Zacharia and Democratic strategist Michael LaRosa assess former Vice President Kamala Harris’ comments about former President Joe Biden’s re-election on ‘Fox & Friends.’\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRV-VIDEOPERSONALITIESFOX & FRIENDSPOLITICS","summary":"Republican strategist Katie Zacharia and Democratic strategist Michael LaRosa assess former Vice President Kamala Harris’ comments about former President Joe Biden’s re-election on ‘Fox &amp; Friends.’","url":"https://www.foxnews.com/video/6380060452112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/93ba1e15-f42a-42ce-96d8-5646ddd66a7a/a8f9886e-0453-4328-9a1b-2f5a2fceb430/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-24 20:29:06","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.249},{"id":363242416,"title":"Fact Check: Kamala Harris Claims 2024 Race Was 'Closest' of the 21st Century","text":"Former Vice President Kamala Harris has repeated a blatant lie about her 2024 election performance while on her book promotion media tour, falsely claiming that the results were the “closest” of the twenty-first century.\n\nThe failed presidential candidate made the statements this week while promoting her new book, 107 Days, on ABC’s The View and on MSNBC’s The Rachel Maddow Show.\n\n“By the way, another piece of what is unprecedented and a bit historical about that race, it is the closest presidential race in the twenty-first century, in terms of outcome,” she said Tuesday to applause from The View’s studio audience.\n\nLeft-wing co-host Ana Navarro said, “You know, say that again because he likes to say over and over again that he got a mandate.”\n\nHarris replied, “Well that’s part of why I wrote this book, because history will talk about this race. It is part of American history.”\n\nShe said the same thing on left-wing anchor Rachel Maddow’s show the day prior:\n\nIn reality, the closest election of the century was former President George W. Bush’s 271-266 electoral college win over former Vice President Al Gore. \n\nThe 2020 election was also slimmer, with former President Joe Biden garnering 74 more electoral votes than President Donald Trump, while he received 86 more electoral votes than Harris in 2024.\n\nIn reality, Harris lost every single swing state, failed to flip even a single county in her direction, and became the first Democrat in two decades to lose the popular vote.\n\nOlivia Rondeau is a politics reporter for Breitbart News based in Washington, DC. Find her on X/Twitter and Instagram.","summary":"Former Vice President Kamala Harris has repeated a blatant lie about her 2024 election performance while on her book promotion media tour, falsely claiming that the results were the \"closest\" of the twenty-first century.\n\n\nThe post Fact Check: Kamala Harris Claims 2024 Race Was &#8216;Closest&#8217; of the 21st Century appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/24/fact-check-kamala-harris-claims-2024-race-was-closest-of-the-21st-century/","image":"https://media.breitbart.com/media/2025/09/Kamala-Harris-What-Can-I-Say_-640x335.jpeg","video":null,"publish_date":"2025-09-24 20:07:51","author":"Olivia Rondeau","authors":["Olivia Rondeau"],"language":"en","source_country":"US","sentiment":-0.1},{"id":363212120,"title":"Democratic win in Arizona could force House vote on Epstein files","text":"Democrat Adelita Grijalva has won a special election in Arizona’s 7th Congressional District, and her victory could be the tipping point in the fight to force a vote on releasing the Epstein files.\n\nThe race was called Tuesday night, with early returns showing Grijalva more than doubling the vote count of Republican Daniel Butierez, who also lost in 2024 to her father, the late Rep. Raul Grijalva.\n\nThis time, Grijalva cleared nearly 69% of the vote in a district that spans Arizona’s southern border with Mexico, including Tucson and parts of Phoenix. Her win makes her the first Latina to represent Arizona in Congress and keeps a reliably blue seat firmly in Democratic hands.\n\n“This is a victory not for me, but for our community and the progressive movement my dad started in Southern Arizona more than 50 years ago,” Grijalva said after her July primary win. \n\nOn Tuesday night, she thanked her supporters on social media. \n\n“Now, let’s get to work,” she wrote. \n\nGrijalva will serve the remaining months of her father’s term.\n\nIn 2024, Kamala Harris won Arizona’s 7th District by more than 22 points, making Grijalva’s landslide another Democratic overperformance—this time in an off-year contest.\n\nGrijalva’s arrival on Capitol Hill also shrinks the GOP’s razor-thin majority to 219-214 with two vacancies still unfilled—meaning House Speaker Mike Johnson can lose only two GOP votes on party-line bills. \n\nThe next two special elections—one in Texas following Democratic Rep. Sylvester Turner’s death and the other in Tennessee after GOP Rep. Mark Green’s departure—could tighten the margin even further. An all-party primary for Turner’s seat is set for Nov. 4, and Green’s replacement will be chosen on Dec. 2, leaving every vote in Washington at a premium heading into 2026.\n\nDemocrats are counting on Grijalva to waste no time signing the discharge petition to force a floor vote on a bill requiring the Justice Department to release all unclassified Epstein files. The petition—spearheaded by GOP Rep. Thomas Massie of Kentucky and Democratic Rep. Ro Khanna of California—has been gaining signatures for months and now has the 218 votes needed to bypass GOP leadership. \n\nMassie secured the 217th vote earlier this month when Virginia Democrat James Walkinshaw was sworn in after a special election win. Both Grijalva and Butierez told the Arizona Daily Star that they supported the petition, making Tuesday night’s result the breakthrough that supporters had been waiting for.\n\n“We are hearing from voters that they believe the survivors deserve justice, and Congress must fulfill its duty to check the executive branch and hold Trump accountable,” Grijalva told CNN.\n\nMassie says that a vote could come as early as mid-October, calling the Arizona race the catalyst for reaching 218 signatures. Once Grijalva is sworn in and signs on, there will be a seven-day waiting period before the bill can be forced to the floor. House leaders then have two legislative days to take action.\n\nHouse Republicans have spent months trying to avoid this moment, with Johnson even adjourning the chamber a day early in July to block votes on the issue. \n\nDischarge petitions rarely succeed because rank-and-file members are reluctant to defy their leadership, but the Epstein case has sparked unusual bipartisan energy. Every Democrat and four Republicans have signed on, including Trump allies like Reps. Marjorie Taylor Greene of Georgia, Lauren Boebert of Colorado, and Nancy Mace of South Carolina, who argue that survivors deserve answers.\n\nRelated | This poll should give Democrats hope for the 2026 midterms\n\nEven if the petition succeeds, the bill still faces a steep climb in the Senate and would require President Donald Trump’s signature—an unlikely prospect. Still, Grijalva’s win gives Democrats momentum in a House where they’ve been searching for leverage against Johnson’s slim but stubborn majority.\n\nOn the trail, Grijalva campaigned on limiting immigration operations, protecting health care, and fighting for environmental justice. She also pledged to curb Trump’s power to impose tariffs unilaterally.\n\nTrump’s allies may try to slow-walk the vote, but pressure is mounting. \n\nFor Democrats, Grijalva’s victory not only keeps her father’s seat in the family, but it also brings the House one step closer to forcing one of the most politically explosive votes of the year—and to holding Trump’s DOJ accountable.","summary":"Democrat Adelita Grijalva has won a special election in Arizona’s 7th Congressional District, and her victory could be the tipping point in the fight to force a vote on releasing the Epstein files.\n\n\n\nThe race was called Tuesday night, with early returns showing Grijalva more than doubling the vote count of Republican Daniel Butierez, who also lost in 2024 to her father, the late Rep. Raul Grijalva.\n\n\n\n\nDemocrat Adelita Grijalva right before winning a special election in Arizona’s 7th Congressional District.\n\n\nThis time, Grijalva cleared nearly 69% of the vote in a district that spans Arizona’s southern border with Mexico, including Tucson and parts of Phoenix. Her win makes her the first Latina to represent Arizona in Congress and keeps a reliably blue seat firmly in Democratic hands.\n\n\n\n“This is a victory not for me, but for our community and the progressive movement my dad started in Southern Arizona more than 50 years ago,” Grijalva said after her July primary win. \n\n\n\nOn Tuesday night, she thanked her su","url":"https://www.dailykos.com/story/2025/9/24/2345222/-Democratic-win-in-Arizona-could-force-House-vote-on-Epstein-files?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1481508/story_image/AP25246685904569.jpg?1758733450","video":null,"publish_date":"2025-09-24 20:00:25","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":-0.329},{"id":363229738,"title":"EXCLUSIVE: Obama Fingerprints Exposed! Top Aide Told Kamala Harris To Stop Praising the 'Unpopular' President During Campaign — 'People Hate Joe Biden'","text":"A top presidential advisor gave Kamala Harris some sobering news just as she launched her ill-fated election campaign: \"People hate Joe Biden.\" \n\nThe former vice president is opening up about her real relationship with Biden in her explosive new memoir, 107 Days.In the first few days of her campaign, Harris admits she was still getting her feet wet and finding her own voice. At the start, her standard stump speech would include glowing remarks about her former boss.\n\n\"I spent the first third of my remarks effusively praising him before I launched into my own campaign speech,\" Harris writes in her book. \"I would do that for several weeks until my campaign strategists urged me to stop: 'It's time this campaign was about you.'\"\n\nHowever, President Obama's 2008 campaign manager, David Plouffe, who was now working to help elect Harris, put it more bluntly when he told her point-blank, \"People hate Joe Biden.\"'Biden F---ed Us'Plouffe has made his opinion of Biden's insistence on staying in the race well-known. In Jake Tapper's book, Original Sin, Plouffe threw the 82-year-old under the campaign bus, saying Harris' rushed push for president was a \"f--king nightmare.\"\n\n\"And it’s all Biden,\" Plouffe slammed. \"He totally f---ed us.\"\n\nStill, he wasn't wrong. At the time of his announcement that he was stepping aside, Biden's approval rating had plummeted to just 41%.\n\nHarris herself acknowledged the truth in her book, calling Biden's rating a \"ball and chain dragging on my campaign.\"Biden was 'Reckless'Harris has held little back in her scathing memoir, calling Biden's refusal to retire \"reckless.\"\n\n\"The stakes were simply too high, she wrote in her book. \"This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition. It should have been more than a personal decision.\"\n\nShe also revealed she had \"concerns\" about many of the staffers Biden left behind when he did eventually drop out. She complained the Biden campaign lacked a specific direction and was only interested in \"(fixing) the problem by throwing money at it.\"Civil WarHowever, Biden's top aides are biting back and have launched a brutal counterattack on the failed candidate. \n\nOne ex-White House official told Axios that Harris was \"simply not good at the job.\" The official added, \"She had basically zero substantive role in any of the administration’s key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was.\"\n\nHarris has argued that the truncated timeline of her 2024 campaign made success impossible. But another Biden aide dismissed that defense, insisting the blame was hers alone.\n\nThe official said: \"The independent variable there is the vice president, not Biden or his aides.\"\n\nOthers aimed at Harris' suggestion that she lacked sufficient backing from Biden's team. One official countered that multiple staffers had tried to set her up for success.\n\nThe former aide claimed: \"There were several officials who really tried to help her thrive. But she and her team did not seize that support and make the most of it. It is all a tragedy.\"","summary":"The former vice president is opening up about her real relationship with Joe Biden in her explosive new memoir, '107 Days'","url":"https://radaronline.com/p/obama-top-aide-kamala-harris-stop-praising-unpopular-joe-biden/","image":"https://media.radaronline.com/brand-img/jqdHKE13q/0x0/joe-biden-kamala-harris-1758741001361.jpg","video":null,"publish_date":"2025-09-24 20:00:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","category":"politics","source_country":"us","sentiment":-0.427},{"id":363242462,"title":"Reuters Poll: Americans Greatly Distrust Democrats' Mass Migration Agenda","text":"A new poll reveals that American adults mostly distrust Democrats on the issue of immigration, suggesting huge opposition to their mass migration agenda.\n\nThe poll, conducted for Reuters by Ipsos, asked more than 1,000 American adults “which party has a better plan” on various issues from crime to the environment. The poll was conducted over the weekend and has a margin of error of ±3 percentage points.\n\nSignificantly, just 22 percent of Americans said Democrats have a better plan on immigration, while 40 percent said they prefer Republicans on the issue. With crime, only 2 in 10 Americans said they favor Democrats to handle the issue, while 4 in 10 prefer Republicans.\n\nLikewise, 42 percent of Americans approve of President Donald Trump’s immigration agenda — which is focused on massively expanding Immigration and Customs Enforcement (ICE) to more swiftly arrest and deport millions of illegal aliens from the United States.\n\nCompare that approval on immigration to former President Joe Biden’s: In December 2024, just 26 percent of Americans said they approved of his administration’s open borders policies, which oversaw the arrival of more than 8 million illegal aliens to the United States.\n\nThe poll reveals a deep distrust among Americans for Democrats’ mass migration agenda, where amnesty for illegal aliens, catch and release at the southern border, and rapid naturalizations are at the forefront, while interior immigration enforcement is gutted.\n\nUnder Biden and former Vice President Kamala Harris, for instance, the foreign-born population hit a record 52 million or about 15.5 percent of the nation’s total population. In addition, Biden and Harris oversaw a record 3.5 million legal immigrants securing naturalized American citizenship — by far the most of any single presidential term in U.S. history.\n\nJohn Binder is a reporter for Breitbart News. Email him at jbinder@breitbart.com. Follow him on Twitter here.","summary":"A new poll reveals that American adults mostly distrust Democrats on the issue of immigration, suggesting huge opposition to their mass migration agenda.\n\n\nThe post Reuters Poll: Americans Greatly Distrust Democrats&#8217; Mass Migration Agenda appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/24/reuters-poll-americans-greatly-distrust-democrats-mass-migration-agenda/","image":"https://media.breitbart.com/media/2025/09/Democrats-640x335.png","video":null,"publish_date":"2025-09-24 19:55:51","author":"John Binder","authors":["John Binder"],"language":"en","category":"politics","source_country":"US","sentiment":0.007},{"id":363242430,"title":"Trump’s Five Most Impactful Moments at U.N. General Assembly","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBART\n\nKimmel Back\nRIP Charlie Kirk\nNewsom vs ICE\nPalestinian State Farce\nShutdown Showdown\nTikTok Deal\n\nTrump’s Five Most Impactful Moments at U.N. General Assembly\n\n Spencer Platt/Getty Images\n\nNick Gilbertson24 Sep 2025 \n\nLondon / Europe\nNational Security\n\nDonald Trump\n\ngreen agenda\nillegal immigration\n\nRussia-Ukraine war\n\nUnited Nations\nVolodymyr Zelensky \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\nGoogle Admits Political Censorship on YouTube, Will Embrace Free Speech\nJimmy Kimmel Thanks Ted Cruz, Mitch McConnell, Ben Shapiro for Backing Him\nKimmel: I Thank Righties Who Backed Me, Didn't Intend to Blame a Group\nNewsom: We Will Not Have An Election In 2028 'Unless We Wake Up'\nPhotos of Presidents in Rose Garden Show Biden as 'Autopen'\nPregnant Liberal Women Post Videos Downing Tylenol to Own Trump\nFBI: Dallas Sniper Who Attacked ICE Facility had 'Anti-ICE' on Bullets\nVance Says ICE Dallas Sniper Was 'A Violent Left-Wing Extremist'\nFact Check: Kamala Harris Claims 2024 Race Was 'Closest' of the Century\nGraham: 'Russia Is a Paper Tiger'\n\nFROM THE HOMEPAGE\n\n8 Times Democrats Demonized ICE Agents for Enforcing Federal Immigration Law\nVance Says ICE Dallas Sniper Was ‘A Violent Left-Wing Extremist’, Rebukes Left for Demonizing Rhetoric\nFBI: Dallas Sniper Who Attacked ICE Facility had ‘Anti-ICE’ ‘Ideological Motive’\nNolte: Gavin Newsom & Jasmine Crockett Incited Violence Against ICE Before Dallas Sniper Attack\nJimmy Kimmel Thanks Ted Cruz, Mitch McConnell, Ben Shapiro for Backing Him over Trump\nTrump Hangs Portraits of Presidents in Rose Garden Showing Biden as ‘Autopen’\nICE Arrests Illegals Convicted of Child Sex Crimes, Manslaughter, Robbery\n‘Charlie Kirk Show’ Producer: Flyers Promoting, Celebrating Assassination Found at Georgetown\nTrump to Sign Executive Order Dismantling ‘Domestic Terrorism Networks’\nFact Check: Kamala Harris Claims 2024 Race Was ‘Closest’ of the 21st Century\nSyria’s Jihadi President Asks U.N. for Money, Promising an ‘Inclusive’ Government\nBritain Now Has More Parking Enforcers Than Soldiers: Report \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"President Donald Trump made waves at the United Nations on Tuesday, from his address to the General Assembly to breakout meetings with world leaders and Truth Social bombshells. \n\n\nThe post Trump’s Five Most Impactful Moments at U.N. General Assembly appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/24/trumps-five-most-impactful-moments-at-u-n-general-assembly/","image":"https://media.breitbart.com/media/2025/09/trump-united-nations-general-assembly-getty-640x335.jpg","video":null,"publish_date":"2025-09-24 19:24:05","author":"Nick Gilbertson","authors":["Nick Gilbertson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.179},{"id":363214478,"title":"Kamala Harris reminds everyone why she isn’t president","text":"Former Vice President Kamala Harris just released “107 Days,” recounting her brief tenure as the Democrats’ presidential nominee after President Joe Biden dropped out. Her insider’s view of that transition affirms what others since have revealed about Biden’s mental composition. \n\n“At eighty-one, Joe got tired,” she writes. “That’s when his age showed in physical and verbal stumbles.” She called his decision to run again “reckless.” \n\nThe bottom fell out of Biden’s candidacy during his disastrous debate with Donald Trump. She remembers, “As soon as he walked onto the debate stage in Atlanta, I could see he wasn’t right.” \n\nIn the book, Harris concedes her own mistakes as a candidate, including during one appearance she made on “The View” which came to define her campaign. Asked what she would do differently from Biden, a choice opportunity to differentiate herself, she replied, “There is not a thing that comes to mind.” In the book, she called that answer as “a gift to the Trump campaign.”\n\nGaining the most controversy is her section on picking a vice presidential running mate. Her first choice was Transportation Secretary Pete Buttigieg, “an ideal partner – if I were a straight white man.” She said it was “too big a risk” asking the electorate to accept the team of a black woman and a gay man. \n\nAsked about this passage, Buttigieg responded that he was “surprised” by it and said,“My experience in politics has been that the way that you earn trust with voters is based mostly on what they think you’re going to do for their lives, not on categories.” He’s right.\n\nAlso in the book, Harris also put Gov. Gavin Newsom on blast. She explains that she called the governor the moment she learned President Biden was dropping out of the race. “Hiking. Will call back,” Newsom responded. According to Harris, he never did call her back.\n\n“You want to waste your time with this? We’ll do it,” Newsom told a group of reporters when asked about this. “I was up there hiking, there was an unknown number. Meanwhile, I was on a text exchange trying to get in touch with the Biden administration.”\n\n, “107 Days” moves to look at the future. Naturally she attacks Trump’s policies. We give her credit for saying, “Tariffs are a tax on everyday Americans,” because that’s obviously true no matter how much Republicans want to pretend otherwise. \n\nHer own solutions are thin, amounting to, “We need to come up with our own blueprint that sets out our alternative vision for our country.” \n\nSure, but Harris apparently hasn’t figured out what that blueprint might look like even after all of this time. Her party is still going through an identity crisis, one so intense it’s taking Gov. Newsom seriously as a leader to rally behind. Meanwhile, others in her party are flirting with the false promise of socialism by way of Rep. Alexandria Ocasio-Cortez. \n\nHarris says she’s going to spend time going around the country talking to Americans. We’ve interviewed her in the past and invite her to a conversation any time.","summary":"Her own solutions are thin, amounting to, “We need to come up with our own blueprint that sets out our alternative vision for our country.” ","url":"https://www.ocregister.com/2025/09/24/kamala-harris-reminds-everyone-why-she-isnt-president/","image":"https://www.ocregister.com/wp-content/uploads/2025/08/SUT-Z-HARRIS-CALIF-01.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-24 19:20:11","author":"The Editorial Board","authors":["The Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.161},{"id":363227346,"title":"Democrat With The Stones To Speak Out On Trans Issue Now Getting Primaried By Bearded Woman","text":"It has flown under the radar a bit, but Democratic Massachusetts Rep. Seth Moulton, one of the few in his party who has been outspoken against pro-trans activists, is getting challenged by a bearded woman who identifies as a man.\n\nMoulton, a moderate Harvard graduate and Bronze Star Iraq veteran, is now weighing a primary challenge of his own to unseat left-wing Massachusetts Sen. Ed Markey, he confirmed Wednesday. But back in July, Moulton was on the receiving end of a primary threat — for the first time since 2020. (Subscribe to MR. RIGHT, a free weekly newsletter about modern masculinity)\n\nBethany Andres-Beck, a transgender man who uses “any/all pronouns,” told Boston.com in July that a huge part of her decision to run was that lawmakers like Moulton are too distracted by “wedge issues” like biological boys playing in women’s sports, rather than America’s affordability crisis and the cost of higher education.\n\n“It’s clear he’s not hanging out with trans people. He’s treating us as though we are something he has seen someone else talk about on TV, and I think if you spent time around Salem, that can’t be true if you’re out and about,” she told the outlet. “I was more frustrated and offended by the idea that the Democratic Party would be that petty. It’s really frustrating watching the party fail to rise to the moment. I don’t think that there’s any substitute for authenticity, and it feels like the Democratic Party desperately wants to be liked. I just don’t feel like that’s how you make good policy. That’s not how you build communities. You have to actually know people.”\n\nAfter Kamala Harris’ loss in the 2024 election, Moulton was one of the first Democrats to acknowledge that the party’s stance on transgender issues might be a turn off to normal voters.\n\n Seth Moulton telling ⁦@reidepstein⁩ that identity politics hurt dems “I have two little girls. I don’t want them getting run over on a playing field by a male or formerly male athlete. But as a Democrat, I’m supposed to be afraid to say that” https://t.co/cRneaHgRd9 — Robert Jimison (@RobertJimison) November 7, 2024\n\n“I have two little girls, I don’t want them getting run over on a playing field by a male or formerly male athlete,” Moulton told The New York Times in the election aftermath. “But as a Democrat, I’m supposed to be afraid to say that.”\n\nIn the weeks that followed, Moulton took a lot of heat from the left. His campaign manager resigned in protest. Protesters descended on his office. Massachusetts Gov. Maura Healey chided him and accused him of “playing politics.” The head of the Salem Democratic City Committee, Liz Bradt, compared Moulton to a “Nazi cooperator” in an inflammatory email. She also threatened to find a candidate to primary him.\n\nWell, now she has him or her.\n\nMoulton has long been a thorn in the side of the Democratic Party, and ascended to Congress in 2015 by unseating an incumbent Democrat, John F. Tierney, who at the time had the support of Nancy Pelosi and Sen. Liz Warren. In 2018, Moulton spearheaded an effort to shake up party leadership and block Pelosi from taking over as speaker of the House.\n\nNow, it’s a potential primary against Ed Markey, who himself fended off a primary from Joe Kennedy in 2020 by actually becoming more left-wing. The race may end up becoming a fascinating litmus test on the future of the Democratic Party.\n\nIn fact, both potential races will be interesting to watch. Whether Moulton decides to run for Senate or hold back to seek reelection in the House, two competing visions for the Democratic Party will clash: a center-left one tempered by a moderate to conservative stance on certain social issues, or one that doubles down on left-wing delusion, both socially and economically.\n\nMy money is on the latter.","summary":"Fascinating...","url":"https://dailycaller.com/2025/09/24/massachusetts-seth-moulton-bethany-andres-beck-primary-challenge-ed-markey-senate-democrats-path-future/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2162570114-scaled-e1758736574238.jpg","video":null,"publish_date":"2025-09-24 19:11:49","author":"John Loftus","authors":["John Loftus"],"language":"en","source_country":"US","sentiment":-0.151},{"id":363212494,"title":"AOC stars in Newsom redistricting ad, urging Californians to 'fight' Trump for democracy","text":"Rep. Alexandria Ocasio-Cortez, D-N.Y., is once again sparking campaign buzz for participating in an advertisement advocating California redistricting. \"Trump is redrawing maps to force a Congress that only answers to him — not the people,\" Gov. Gavin Newsom, D-Calif., said while posting a viral video of Ocasio-Cortez on X. \"@AOC knows California can stop him with Prop 50.\" California voters will decide during November's special election whether to temporarily redraw new congressional district maps in response to President Donald Trump successfully urging Gov. Greg Abbott and Texas Republicans to secure five additional Republican-leaning districts through their own redistricting process. \"Prop 50 levels the playing field and gives power back to the people,\" the New York Democrat said in the ad, urging Californians to \"fight for democracy in all 50 states\" by voting \"yes on 50.\" AOC ALLEGEDLY EYEING 2028 RUN AS DNC VICE CHAIR RALLIES PARTY NEEDS MAMDANI TO OCASIO-CORTEZ AS LEADERS If passed, Prop 50 would allow California's Democratic supermajority to redraw its congressional districts to secure five more Democrat-leaning congressional districts, leveling the playing field against Texas redistricting. More states, including Missouri and Ohio, have their own redistricting plans ahead of competitive midterm elections expected in 2026. \"California, you know we don't back down from a fight,\" the New York Democrat said in the ad. \"And this November, the fight belongs to you.\" NEWSOM UNVEILING CALIFORNIA REDISTRICTING EFFORT TO COUNTER TRUMP-BACKED PUSH IN TEXAS The video has been viewed by more than 2 million people in the 24 hours since Newsom posted it. \"Seven years in, some politicians are *finally* understanding why bringing @AOC into our fight is a good thing!\" Democratic strategist Rebecca Katz responded on X. The Bronx representative also appears in a Spanish version of the ad, which was paid for by Yes on 50. \"Donald Trump is redrawing election maps to force through a Congress that only answers to him, not the people. If he gets away with it, all bets are off for our healthcare, our paychecks and our freedoms. With Prop 50, we can stop him,\" she said, looking directly into the camera. The California Republican Party criticized Newsom for \"relying on a New Yorker\" to \"tell Californians how to vote.\" \"It’s part of their disturbing pattern: silence the debate, control the outcome, and erase the people who think differently. Don’t let them rig the system. Vote NO on Prop 50!\" California Republicans said on X. Meanwhile, former California Gov. Arnold Schwarzenegger is trying to terminate California Democrats' redistricting fight. The ad was released on the heels of an Axios' report saying Ocasio-Cortez's team is positioning her for a 2028 presidential or U.S. Senate run. Former Vice President Kamala Harris made apparent jabs at her potential 2028 presidential opponents in her new book, \"107 Days,\" which was released Tuesday. \"Hiking. Will call back. (He never did.)\" was Newsom's response when Harris reached out after President Joe Biden suspended his re-election campaign, according to the book. But Harris only had positive words for Ocasio-Cortez, the youngest woman ever elected to Congress. \"AOC goes deep into policy but has a lightness with people, a joyful warrior vibe,\" Harris said in the book. \"Her talent for deconstructing complex issues and her commitment to getting justice for working people make her an invaluable leader in this moment.\" Ocasio-Cortez sparked plenty of campaign buzz earlier this year when she joined Sen. Bernie Sanders, I-Vt., on his widely popular \"Fighting Oligarchy\" tour. In April, Ocasio-Cortez's campaign account posted a video on X that invigorated rumors she could be mulling a presidential run as the four-term Democrat from New York City and the progressive leader proclaimed, \"We are one.\" When asked later that month if she was harboring any presidential ambitions, the young Democrat did not rule out 2028 presidential aspirations to Fox News Digital. The momentum around Ocasio-Cortez comes as Democrats are searching for new party leadership following consequential losses up and down the ballot in 2024. CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez and Sanders have both endorsed and supported New York City Democratic mayoral candidate Zohran Mamdani's campaign despite establishment Democrats' reluctance to embrace the self-identified Democratic socialist's platform. Newsom and Ocasio-Cortez did not immediately respond to Fox News Digital's request for comment.","summary":"Rep. Alexandria Ocasio-Cortez, D-N.Y., stars in a viral California redistricting ad as speculation grows about her potential 2028 presidential ambitions.","url":"https://www.foxnews.com/politics/aoc-stars-newson-redistricting-ad-urging-californians-fight-trump-democracy","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/05/aoc.jpg","video":"https://www.foxnews.com/video/6380042523112","publish_date":"2025-09-24 19:11:18","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":363215346,"title":"Mariska Hargitay, Malin Akerman, Monica Lewinsky Set for Reese Witherspoon’s Shine Away Event","text":"Skip to main content\n\nSeptember 24, 2025 12:03pm\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nReese Witherspoon attends Hello Sunshine's Second Annual Shine Away Experiential Event, connected by AT&T, at Nya Studios on Oct. 5, 2024.\n\nEmma McIntyre/Getty Images for Hello Sunshine\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nReese Witherspoon and Hello Sunshine are bringing their Shine Away event to Los Angeles for the third straight year, this time taking over the Universal Studios lot for two jam-packed days on Oct. 11 and 12.\n\nShine Away will offer back-to-back days of curated programming, activations, immersive experiences and conversations, with speakers including Mariska Hargitay, Malin Akerman, Chrissy Teigen, Monica Lewinsky, Angela Kinsey, Molly Sims, Karen Pittman and Brittany Snow, along with a special musical performance by Maren Morris. Witherspoon will also kick off the book tour for her debut novel — thriller Gone Before Goodbye — alongside co-author Harlan Coben, at the event; access to the Oct. 11 date of the book tour is included with purchase of a Shine Away ticket.\n\nRelated Stories\n\nReese Witherspoon Says It Was \"Terrifying\" Living in L.A. After Divorce Due to Paparazzi Following Her Children\n\nThrough Her Lens: The Tribeca Chanel Women's Filmmaker Program Celebrates 10 Years of Supporting Female and Nonbinary Artists\n\n“I’m so excited to welcome such an extraordinary group of women to Shine Away’s third year,” Witherspoon said in a statement. “With each bringing their own unique voice and perspective, I know our community will feel inspired by the conversations and connections we’ll share together. It’s an honor to celebrate our third year surrounded by so much creativity and joy.”\n\nShine Away’s programming will touch on all aspects of the Hello Sunshine portfolio, including Reese’s Book Club, The Home Edit, The Hello Sunshine Collective, Sunnie, Drop of Sunshine, The Bright Side and Bookmarked podcasts, as well as the company’s hit film, television and music projects. AT&T serves as presenting sponsor of the two-day experience, and tickets are available here.\n\nPrevious Shine Away participants include Laura Dern, Octavia Spencer, Olivia Munn, Amanda Kloots, comedian Heather McMahan, Jennifer Garner, Mindy Kaling and Tracee Ellis Ross.\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\n‘Seinfeld’ Star Jason Alexander Models New York Yankees Apparel for Kith\n\nCharlie Puth Teases New Music and Shares the Best Piece of Advice He’s Ever Received\n\nScott Evans\n\n‘Access Hollywood’ Host Scott Evans on Launching ‘House Guest’ and Hosting Kamala Harris\n\nJulianne Nicholson\n\nIn Lieu of Runway Show, Gucci Premieres Film Starring Demi Moore, Elliot Page, Keke Palmer\n\nJ.Crew Reimagines Its OG Rollneck Sweater With Help From Young Stars — and the Internet Approves\n\nStockX and Walmart Restock Sold-Out Labubus After Success of Last Month’s Limited Run\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"The two-day Hello Sunshine experience will take place Oct. 11 - 12 on the Universal Studios lot.","url":"https://www.hollywoodreporter.com/lifestyle/lifestyle-news/mariska-hargitay-malin-akerman-reese-witherspoon-shine-away-1236378916/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/09/GettyImages-2177027868.jpg","video":null,"publish_date":"2025-09-24 19:03:20","author":"Kirsten Chuba","authors":["Kirsten Chuba"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.747},{"id":363189974,"title":"Millennial Democrat Ian Calderon announces bid for California governor","text":"By Jeanne Kuang, CalMatters\n\nFormer state lawmaker Ian Calderon is joining the crowded 2026 race for California governor, he announced Tuesday.\n\nThe Whittier Democrat is framing his candidacy as one from a “new generation of leadership.” He was 27 when he became the first millennial to be elected to the state Assembly in 2012.\n\nBut he was no newcomer even then — Calderon comes from a line of politicians from southeast Los Angeles County. His father, Charles Calderon, started the dynasty when he was elected to the Assembly in 1982. Two of his uncles also served in the Legislature — and federal prison for corruption.\n\nIan Calderon left the Assembly, where he was majority leader, in 2020 to focus on his young family and his stepmother Lisa Calderon now holds his seat. But he’s been biding his time for a return.\n\nIn a campaign video that heavily features his wife and children, he said since leaving office he’s been “living in the real world, watching everyday life get harder for families like mine.” He highlighted the high costs of gas, child care and housing, taking particular aim at investment firms buying up properties.\n\n“The people running our government? They’re trying to use yesterday’s ideas to solve today’s problems and it isn’t working,” he said.\n\nHe joins a crowd of Democrats jockeying in a wide-open race for the governorship, including: state Superintendent of Public Instruction Tony Thurmond, former Controller Betty Yee, former state Senate President Pro Tem Toni Atkins, former Rep. Katie Porter, former U.S. Health and Human Services Secretary Xavier Becerra and former Los Angeles Mayor Antonio Villaraigosa.\n\nRepublicans Chad Bianco, the sheriff of Riverside County, and commentator Steve Hilton also are running.\n\nPolling in August showed Porter was the frontrunner after former Vice President Kamala Harris decided not to run.","summary":"Ian Calderon joins a crowd of Democrats jockeying in a wide-open race for governor. The former assemblymember left the Legislature in 2020 to focus on his family.","url":"https://www.mercurynews.com/2025/09/24/millennial-democrat-ian-calderon-announces-bid-for-california-governor/","image":"https://www.mercurynews.com/wp-content/uploads/2025/09/091119-Ian-Calderon-AP-CM.webp?w=150&strip=all","video":null,"publish_date":"2025-09-24 18:49:58","author":"CalMatters,Gqlshare","authors":["CalMatters","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":0.316},{"id":363243072,"title":"Kamala Harris' favorability declines during book release press tour","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Big Money Show September 24, 2025 06:34 \n\n Kamala Harris' favorability declines during book release press tour \n The 'Big Money Show' panel discusses Kamala Harris' favorability rating declining amid her book release and press tour and give opinions as to why her approval has fallen since losing the 2024 election.\n\nTags WHAT TO WATCHSHOWSPOLITICSV-VIDEOS","summary":"The &apos;Big Money Show&apos; panel discusses Kamala Harris&apos; favorability rating declining amid her book release and press tour and give opinions as to why her approval has fallen since losing the 2024 election.","url":"https://www.foxbusiness.com/video/6380055384112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/7c70810f-4cb3-400e-8c90-b09abe109ed6/809c00f3-741a-48d8-96b3-e9ebb0e403df/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-24 18:35:00","author":null,"language":"en","source_country":"us","sentiment":-0.07},{"id":363192890,"title":"Google Admitting to Extensive Censorship Is Vindication","text":"Investigations\n\n Books & Culture\n RealClearPublicAffairs\n Pennsylvania \n\n Sign In | SUBSCRIBE RCP+\n\n All Latest Polls\n President Trump Job Approval\n Trump, Obama, Bush - 2nd Term\n Favorability Ratings\n Direction of Country\n Trump Approval on Issues\n Generic Ballot\n State of the Union Polls\n Trump Job Approval - 1st Term\n RCP Pollster Scorecard\n RCP Polling Archive \n\n Election 2025 - '28\n\n Senate Polls\n Governor Polls\n Generic Congressional Vote\n Election 2028 Polls\n Trump vs. Harris\n 2024 National Full Field\n Top Battlegrounds\n 2024 Betting Odds Chart\n RCP Pollster Scorecard\n Historical Polling Archive\n\n Andrew WalworthJonathan DraegerTom BevanCarl M. CannonSean TrendeSusan CrabtreePhilip WegmannColumnistsLanny J. DavisJ. Peder ZanePeter BerkowitzFrank MieleContributorsBill KingCharles LipsonMargot ClevelandJared D. CarlL. Sandy MaiselVictor Davis HansonRichard PorterDavid HarsanyiLuis FariasAnn RavelJonathan TurleyJessica CurtisWendell L. Willkie IIMiranda DevineLance TroverByron YorkWilliam A. PierceSteve McIntoshMary VoughtAdam BrandonRussell MuirheadJosef JoffeMark GlennonHaley BarbourMarco RubioTed DabrowskiSen. Rob PortmanJohn HartSandy MaiselLou CannonAnneke E. GreenJoel KotkinMyra Adams\n\n All Latest Polls\n President Trump Job Approval\n Trump, Obama, Bush - 2nd Term\n Favorability Ratings\n Direction of Country\n Trump Approval on Issues\n Generic Ballot\n State of the Union Polls\n Trump Job Approval - 1st Term\n RCP Pollster Scorecard\n RCP Polling Archive\n\n Election 2025 - '28\n\n Senate Polls\n Governor Polls\n Generic Congressional Vote\n Election 2028 Polls\n Trump vs. Harris\n 2024 National Full Field\n Top Battlegrounds\n 2024 Betting Odds Chart\n RCP Pollster Scorecard\n Historical Polling Archive\n\n Andrew WalworthJonathan DraegerTom BevanCarl M. CannonSean TrendeSusan CrabtreePhilip WegmannColumnistsLanny J. DavisJ. Peder ZanePeter BerkowitzFrank MieleContributorsBill KingCharles LipsonMargot ClevelandJared D. CarlL. Sandy MaiselVictor Davis HansonRichard PorterDavid HarsanyiLuis FariasAnn RavelJonathan TurleyJessica CurtisWendell L. Willkie IIMiranda DevineLance TroverByron YorkWilliam A. PierceSteve McIntoshMary VoughtAdam BrandonRussell MuirheadJosef JoffeMark GlennonHaley BarbourMarco RubioTed DabrowskiSen. Rob PortmanJohn HartSandy MaiselLou CannonAnneke E. GreenJoel KotkinMyra Adams\n\n Opinion Research\n Newsletters\n\n Special Series\n\n Energy of the Future \n Freedom of Religion\n\n Publishing\n\n Submissions\n\n Back to Videos\n\n Turley: Google Admitting To Censorship Is Vindication For Blacklisted Scientists\n\n | \n\n Posted By Ian Schwartz\n On Date September 24, 2025\n \n\n \n \n Turley: Google Admitting To Censorship Is Vindication For Blacklisted Scientists0 seconds of 4 minutes, 16 secondsVolume 90%Press shift question mark to access a list of keyboard shortcutsKeyboard ShortcutsShortcuts Open/Close/ or ?Play/PauseSPACEIncrease Volume�Decrease Volume�Seek Forward�Seek Backward�Captions On/OffcFullscreen/Exit FullscreenfMute/UnmutemDecrease Caption Size-Increase Caption Size+ or =Seek %0-9\n\n Next UpFormer Dem Fundraiser: Kamala Harris' Decision Not To Challenge Biden Alone Should Disqualify Her From 202804:55http://www.realclearpolitics.com/video/2025/09/24/turley_google_admitting_to_censorship_is_vindication_for_blacklisted_scientists.htmlCopied\n\n Live00:2403:5204:16More Videos04:55Former Dem Fundraiser: Kamala Harris' Decision Not To Challenge Biden Alone Should Disqualify Her From 202803:24CNN's Enten: The American People Don't Want Kamala Harris, Her Favorability Rating Is \"Swimming With The Fishes\"02:26MSNBC Host: People Ask \"Why Won't You Have More Republicans On?\" I Would Love To, But It Is Challenging Right Now01:11Gay Cabinet Secretary Slams Harris For Snubbing Buttigieg: \"She Judged Him On His Identity\"01:50FBI: \"Anti-ICE\" Targeted Violence In Dallas Will Merit \"Whole Of Government Response\"02:12President Trump: These Are Two Things From The United Nations, A Bad Escalator And A Bad Teleprompter03:18Trump: If Europe Doesn't Stop Buying Russian Energy, Support For Ukraine Is A Big Waste Of Time, Money, Lives01:03Hillary Clinton: We Have Got To Stop The Finger-Pointing And Scapegoating (Most Of That Is Coming From The Right)01:42Kamala Harris: I Admire And Respect Joe Biden And Still Speak To Him -- \"I'm Being Sincere, Sincerely\"00:56FDA Commissioner Dr. Marty Makary: Growing Body Of Evidence Links Tylenol And AutismClose \n\nFOX News contributor Jonathan Turley on Wednesday reacts to Google's letter to Rep. Jim Jordan (R-OH) acknowledging coordinating with the Biden administration to censor scientists and others who discussed the COVID pandemic on YouTube.\n\nJON SCOTT, FOX NEWS: Professor, good morning to you. I know you've written about this when it comes to meta. Now you get a chance to write about this when it comes to YouTube and Google. Here's what I think. I mean, my sense is when it came to a national crisis and when it came to free speech, we failed.\n\nJONATHAN TURLEY: We most certainly did, Bill. And I write about this in The Indispensable Right that you had this coordination between the government, corporations, academia, even the media to censor people with opposing views. And it came at a great cost, not just to free speech.\n\nBut in COVID, we never had the debate that other countries had. Many of our allies did not shut down their schools, and they have not experienced the psychological and developmental problems that we have experienced. And that's because at platforms like Google and YouTube and Facebook, these scientists were barred. They were banned. They were blacklisted. You know, many of the signatories of the Great Barrington Declaration, which were scientists that raised opposing views, were at a speech of mine at the University of Chicago over a year ago.\n\nAnd they have been vindicated in many respects on the stuff that they wanted to get out to the public but were prevented from doing so. But it's also important to remember that, you know, I testified repeatedly in Congress. And before the release of the Twitter files, Democratic members really mocked us and said, oh, you've no evidence of coordination. This is all speculation. It wasn't at that time. But the Twitter files and later the Facebook files showed that coordination. And this is a vindication for those scientists and many others who have been in this fight against Congress to try to get this information out to show the public how extensive this censorship was.\n\nSCOTT: I mean, big tech, free speech, censorship, government control, it's all right there for a guy like you. Here's what the letter said, OK? The administration's officials, including President Biden, created a political atmosphere that sought to influence the actions of platforms based on their concerns regarding misinformation.\n\nSo let's go back to January. Mark Zuckerberg with Joe Rogan. All right.\n\nTalking about Meta, talking about this exact same issue.\n\nZUCKERBERG: Basically, these people from the Biden administration would call up our team and like scream at them and curse. It just got to this point where we were like, no, we're not going to we're not going to take down things that are true. That's ridiculous.\n\nSCOTT: I sense some pushback there, but I don't know where this all landed, because it it seems to me that Silicon Valley was listening to the government in charge at that time.\n\nTURLEY: Well, it was there was extensive censorship, not just on covid issues, but other issues. Even jokes were being censored at the demand of Biden administration officials. And this is part of censorship. It creates an insatiable desire and appetite. And these companies found themselves overwhelmed. It snowballed. And so soon Meta was just censoring a huge amount of people. \n\nElon Musk deserves a great deal of credit here. When he bought Twitter, it was interesting. Figures like Hillary Clinton went to Europe and said, use the Digital Services Act, this infamous EU legislative initiative to to censor Americans. And, you know, Musk has been out there alone in this fight. Then Meta joined and has replicated what Musk did at X.\n\nAnd now we have Google. And this is a huge development for the free speech community. We need these companies, particularly in fending off the EU, which is being very aggressive in this anti free speech campaign.\n\nRelated Topics: Jonathan Turley, Elon Musk, Hillary Clinton\n\n Send Tips\n\n Follow Us\n\n Latest Political Videos","summary":"","url":"https://www.realclearpolitics.com/video/2025/09/24/turley_google_admitting_to_censorship_is_vindication_for_blacklisted_scientists.html","image":"https://assets.realclear.com/images/69/697859_5_.jpg","video":null,"publish_date":"2025-09-24 18:30:05","author":"FOX News,Ian Schwartz,Jonathan Turley","authors":["FOX News","Ian Schwartz","Jonathan Turley"],"language":"en","source_country":"US","sentiment":-0.058},{"id":363254100,"title":"Pete Buttigieg responds to Tucker Carlson’s ‘very specific questions about gay sex’ on Kara Swisher’s podcast","text":"Pete Buttigieg has never been shy about confronting absurd attacks on his identity. But when the former transportation secretary sat down with journalist Kara Swisher for a live recording of On with Kara Swisher at the University of Michigan, he faced one of the strangest yet: Tucker Carlson’s claim that Buttigieg is a “fake gay.”\n\nRelated: Tucker Carlson says Pete Buttigieg is 'fake gay,' should answer questions about gay sex\n\nSwisher, leaning into the controversy with her trademark wit, teased Buttigieg in the episode released Tuesday by saying she was “starting to agree with Tucker Carlson on this fake gay thing,” when he didn’t know the significance of a meme Swisher said was popular among gay men. Buttigieg, unflappable, laughed and replied: “Chasten, my husband, has threatened to have my gay card revoked so many times. This is just going to be the latest.”\n\nLater, Swisher, a lesbian, pressed Buttigieg on Carlson’s suggestion that he should be forced to answer “very specific questions about gay sex.” Buttigieg responded by pointing out the high level of cringeworthiness. “First of all, I do not think I want to discuss anything with Tucker Carlson,” Buttigieg said. “I cannot think of a topic I would like to discuss less.” He stopped himself after starting to say, \"Even though I will admit some level of morbid curiosity on what in the hell he thinks. Actually, no.\"\n\nThe audience laughed. Then, Buttigieg added, “I suppose it’s a sign of progress that their idea of a conspiracy is that I’m actually secretly straight.”\n\nRelated: Kamala Harris reveals why she didn't pick Pete Buttigieg as her running mate in 2024\n\nHe and Chasten Glezman Buttigieg, 36, were married in June 2018, when Pete, 43, was the mayor of South Bend, Indiana, before launching his presidential campaign. In 2021, the couple announced the birth of their twins, Penelope Rose and Joseph “Gus” August, via adoption. The husbands are raising their 4-year-old children in Michigan.\n\nThen U.S. Secretary of Transportation Pete Buttigieg (R) and husband Chasten Buttigieg with their children Penelope and Gus during the annual Easter Egg Roll on the South Lawn of the White House on April 10, 2023 in Washington, DC. Drew Angerer/Getty Images\n\nThe conversation included more substantive topics. Buttigieg reiterated his condemnation of the recent assassination of conservative commentator Charlie Kirk in Utah, insisting that “the only sane place to begin” is acknowledging the tragedy of a family losing a father. Yet he warned that President Donald Trump and Vice President JD Vance have exploited the killing to stoke anger and justify repression.\n\n“Part of what makes political violence a crime, not just against the target but against the country, is that it deprives our whole country of the freedom to have open, honest, safe political debate,” Buttigieg said. He cautioned that labeling opponents as terrorists echoes authoritarian tactics in places like Russia.\n\nButtigieg framed the moment as a fork in the road: either Americans resist the escalation of violence and rhetoric, or they risk sliding further into an illiberal age.\n\nSwisher also pressed Buttigieg on his earlier view that former President Joe Biden should not have run for reelection, a position echoed by former Vice President Kamala Harris, who admitted in her new memoir, 107 Days, that Buttigieg was her first choice as a running mate but that she didn't select him over fears that the country wasn't ready to support a ticket with a Black woman and a gay man. Buttigieg explained that while he respected Biden’s decision at the time, “the truth … was that we had a choice between two candidates, two presidents. It was not close who should be president between those two.”\n\nStill, he conceded that Harris might have benefited from a short primary after Biden’s withdrawal. “With the benefit of hindsight, if we’d invested those 30 days, then had she been the nominee, she would’ve done so after consolidating the party in a competition,” he said.\n\nRelated: Pete Buttigieg weighs in on ‘fairness’ of transgender kids playing girls’ sports\n\nThe podcast also highlighted Buttigieg’s evolving position on Gaza, an issue that has divided Democrats and alienated younger voters. He said he supports recognition of a Palestinian state as part of a two-state solution, but only through a negotiated agreement that ensures Israel’s security.\n\nPete Buttigieg on Kara Swisher's show\n\nAt the same time, he did not mince words about Prime Minister Benjamin Netanyahu’s conduct. “The Netanyahu government is perpetrating atrocities in Gaza,” Buttigieg said, insisting that U.S. support cannot be “a blank check.”\n\nThough Buttigieg stopped short of announcing a 2028 run, the possibility hung over the interview. Asked directly if he would run, he dodged: “I don’t know. Really. It’s 2025. Have you lived through the last nine months? That’s long.”\n\nHowever, his answers suggested that he views himself as part of a generational shift. He praised younger Democratic lawmakers such as New Jersey Sen. Andy Kim and Michigan Sen. Elissa Slotkin and urged the party to adapt to new realities in communication and coalition-building.\n\n“We have an opportunity to invent some things from first principles,” he said. “It is a bad thing that we are here … but if we do have to start over, it should be to build a different way of doing things socially, economically, politically, that actually supports your ability to live a life of your choosing and to have a good life.”\n\nThis article originally appeared on Advocate: Pete Buttigieg responds to Tucker Carlson’s ‘very specific questions about gay sex’ on Kara Swisher’s podcast","url":"https://www.yahoo.com/news/articles/pete-buttigieg-responds-tucker-carlson-182125228.html","image":"https://s.yimg.com/ny/api/res/1.2/K7yJbu0qQXX3q0c2DxYi7g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xMzUwO2NmPXdlYnA-/https://media.zenfs.com/en/the_advocate_articles_932/73c0a5c5535936569db14d858df7d302","video":null,"publish_date":"2025-09-24 18:21:25","author":"Christopher Wiggins","authors":["Christopher Wiggins"],"language":"en","category":"politics","source_country":"us","sentiment":-0.044},{"id":363171564,"title":"Ted Cruz Blasts Kamala Harris &#039;Bigoted&#039; Remarks on Pete Buttigieg Being Gay","text":"Senator Ted Cruz, a Texas Republican, blasted former Vice President Kamala Harris’ remarks about not picking former Transportation Secretary Pete Buttigieg as her running mate in the 2024 election.\n\nNewsweek reached out to Harris’ office for comment via email.\n\nWhy It Matters\n\nHarris picked Minnesota Governor Tim Walz as her running mate last year, but the pair ended up losing to President Donald Trump and Vice President JD Vance, then an Ohio senator, in the November election. Buttigieg has been seen as a rising star in the Democratic Party and, like Harris, is seen as a potential 2028 presidential candidate.\n\nWhat to Know\n\nHarris revealed in her new book 107 Days that she opted against Buttigieg due to concerns about how voters would respond to a presidential ticket consisting of a Black woman and gay man.\n\n“We were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. Part of me wanted to say, Screw it, let’s just do it. But knowing what was at stake, it was too big of a risk,” she wrote.\n\nCruz responded to her comments on his podcast Verdict With Ted Cruz published on Wednesday.\n\n“Democrats are at their core racist. They are at their core deeply bigoted,” he said.\n\nSenator Ted Cruz, a Texas Republican, speaks during a press conference in Washington, D.C., on September 27, 2023.\n\nHe said he doubts voters would refuse to vote for Harris “because she is a Black woman married to a Jewish man.” Instead, he pointed to issues ranging from immigration to inflation as to why she lost.\n\n“She says Pete would be an ideal partner. That’s who she wanted to pick, and the singular reason she did not is he is gay. If he were straight, she doesn’t explicitly say it, but she pretty clearly suggests he would have been her pick. She’s quite open about saying, Nope, for her, being gay was disqualifying,” he said.\n\nWhile Harris’ remarks have drawn some backlash, her supporters note that she has long supported LGBTQ+ rights and was an early supporter of same-sex marriage during her career in California politics. Cruz has opposed LGBTQ+ rights like same-sex marriage, voting against the Respect for Marriage Act in 2022.\n\nCruz has, however, condemned an anti-gay law passed in Uganda that would include the death penalty for “aggravated homosexuality.” In 2023, he called that law “horrific and wrong.”\n\nButtigieg responded to Harris’ writings last week in an interview with Politico, saying that he believes in “giving Americans more credit.”\n\n“My experience in politics has been that the way that you earn trust with voters is based mostly on what they think you’re going to do for their lives, not on categories,” Buttigieg said.\n\nWhat People Are Saying\n\nHarris told MSNBC’s Rachel Maddow: “It made me very sad, but I also realized it would be a real risk. I’ve been an advocate and an ally for the LGBT community my entire life. It wasn’t about any prejudice on my part, but we had such a short period of time and the stakes were so high. I think Pete is a phenomenal public servant, and I think America is and will be ready for that. But when I had to make that decision with two weeks to go, you know, and maybe I was being too cautious.”\n\nThe View co-host Sara Haines said last week: “This is my problem with identity politics. Kamala Harris is a Black woman, and she’s a lot of other things. Pete Buttigieg is a gay man, and he’s a lot of other things. When I look at these people, I don’t look and say ‘Well there’s a Black woman, there’s a gay man.’ End of story.”\n\nJournalist Chris Cillizza said in a video posted to X: “I don’t think Kamala Harris picking Pete Buttigieg wins her the presidency. Nor do I think, by the way, it would have lost her the presidency. But I think it is revealing in who she is as a politician, and that is someone who doesn’t like risk. Doesn’t like to leap before they look, even occasionally.”\n\nWhat Happens Next\n\nButtigieg and Harris are both seen as potential 2028 candidates. Polls suggest they would be among the leading options for Democratic primary voters. Neither has confirmed plans to run, but decisions to skip the 2026 elections have fueled speculation that they could be considering doing so.","summary":"Harris has faced questions about her decision not to pick Buttigieg as her running mate in the 2024 election in recent days.","url":"https://www.newsweek.com/ted-cruz-blasts-kamala-harris-bigoted-remarks-on-pete-buttigieg-being-gay-10482798","image":"https://assets.newsweek.com/wp-content/uploads/2025/09/GettyImages-1704574545-1.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-09-24 17:35:00","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.396},{"id":363188750,"title":"Your guide to the billionaire-backed groups working to push Dems right in 2026","text":"Republish this articleThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License.\nWe encourage republication of our original content. Please copy the HTML code in the textbox below, preserving the attribution and link to the article's original location, and only make minor cosmetic edits to the content on your site.Your guide to the billionaire-backed groups working to push Dems right in 2026\nby Adam Johnson, The Real News Network September 24, 2025\n\n Your guide to the billionaire-backed groups working to push Dems right in 2026\nby Adam Johnson, The Real News Network September 24, 2025\n\nIt’s clear that the Democratic Party, and the Liberal-Left more broadly, is in total disarray. As the Trump administration continues to erode liberal norms, worker protections, due process, free speech, and civil liberties, there’s a broad consensus that the most impactful way to push back against Trump’s unprecedented power grab is at the ballot box in 2026 and 2028. The stakes for these elections couldn’t be higher, and thus the approach Democrats take to do so couldn’t be any more salient. Attempting to get ahead of this narrative, and steer the party away from anything with even the vaguest whiff stench of Left populism, are a recent constellation of think tanks, PACs, and “movements” designed to keep the fundamentally neoliberal, billionaire-approved Democratic Party fundamentally neoliberal and billionaire-approved. \nBut simply appealing to the status quo wouldn’t be credible after the Democratic Party has fallen to their lowest point in over 40 years (if not 100). So these factions are creating pseudo-worldviews and political frameworks that are meant to appear bold and forward-looking, but are ultimately just a rebranded defense of the party establishment. And we know this because, to the person, they are funded by the same billionaire donors that have shaped democratic politics for decades and are working in concert with party leaders looking to deflect blame for their own repeated failures. \nThere have been several centrist efforts hatching in the marshes of DC this year, but for the purposes of this essay we will focus on three high-profile ones that launched in 2025: the so-called Abundance Movement, Majority Democrats PAC, and the Searchlight Institute. They differ somewhat in approach and branding but all operate under the same false premise: that Vice President Kamala Harris lost to Trump last November not because the party had become too centrist, or too inauthentic, or spent decades alienating labor, or campaigned too much with Liz Cheney, or threw too many constituencies under the bus, or was backing a horrific, generation-defining genocide. Instead it was because Harris—and the party brand in general—had somehow gone too far to the Left. The evidence for this premise, as I will lay out, is wanting. But it’s become conventional wisdom in elite liberal circles, first and foremost, because it lets everyone in elite liberal circles off the hook.\nIndeed, it’s an exceedingly convenient narrative for the billionaires backing these factions. Post-2024 loss, if I’m a Democratic consultant or “strategist” wanting to hoover up money to “rebuild the party” and polish my personal brand, I won’t find much funding by telling wealthy liberal donors that the problem with the party is that it sold out the working class and didn’t do nearly enough during the Biden years to win them back, or that it needs to embrace bold redistributive policies like Medicare for All or stronger labor unions, or that it needs to embrace Sanders-Mamdani-style politics of class conflict, less hawkish foreign policy, and unapologetically progressive stances on “social issues.” Obviously, this would not only prevent me from getting millions to start my own “institute” or “movement” and being featured in glossy puff pieces in the New York Times, it would actively upset these donors and effectively ice me out of funding networks. \nThus, the buyer’s market for supposedly new “thinkers” and “movements” that will repackage the existing power structure as edgy, bold, and new is hotter than ever. Enter: these three projects. \nThe Abundance Movement - Broad Network/Buzzword \nUnlike the other two factions on this list, the Abundance faction isn’t a specific group, but a deliberately vague, supposedly post-ideological worldview that, its supporters claim, can include everyone from socialists to the far right. In practice, however, the movement is textbook neoliberalism. Primary boosters of this “movement” include Silicon Valley and Wall Street-funded organizations like the Niskanen Center, Arnold Ventures, Open Philanthropy, Emergent Ventures, increasingly many elements within the Koch Brothers network, the overtly rightwing American Enterprise Institute, and a smattering of other billionaire-backed organizations and passthroughs. Henry Burke of the Revolving Door Institute recently published a detailed report laying out each blade in the sprawling carpet of astroturf. \nSince its two primary thought leaders, the New York Times’ Ezra Klein and the Atlantic’s Derek Thompson, published their book, Abundance in March 2025, the movement, such as it is, has received largely fawning, uncritical coverage in our media due in large part to the movement’s so-vague-as-to-be-unobjectionable premise. Their pitch goes something like this: The reason why liberalism is falling out of favor is because it “no longer builds” anymore. It’s a tempting solution and one that not only rejects class politics as a path out of the woods, but embraces its opposite: further enriching and empowering the wealthy through deregulation so they can “innovate” and “build” us back to prosperity. They will sometimes throw in “building state capacity” rhetoric as an appeal to left-leaning types to throw them off the neoliberal stench, but it’s—at best—an afterthought. \nIf this sounds like “the Good Things Plan”, a politics so generic and devoid of serious rigor that it can basically be anything to anyone, that’s because it is. This genericness, combined with its total lack of class politics and heavy emphasis on deregulation, is a major reason why it has sucked up so much billionaire money and elite media buy-in. Adding urgency to this dynamic, and a good explanation for the gobs of Silicon Valley cash backing it, is the rapidly increasing AI energy demands that the US can, by its backers’ own admission, only meet by massively “streamlining” safety, climate, and environmental review for new energy production, including that of new fossil fuel extraction. Which, once again, worked out well for those in power. \nMajority Democrats - PAC\nA rebrand of previous centrist initiatives, Majority Democrats pins the blame for Democratic Party woes on “woke.” They vaguely gesture toward the Democrats shedding support in the working class, but largely chalk up this loss to “cultural” factors (see: changes that won’t offend billionaire donors) rather than the party takeover by corporate forces.\n“These Younger Democrats Are Sick of Their Party’s Status Quo,” reads the obligatory New York Times launch puff piece, framing the astroturf effort as an organic youth movement. “Majority Democrats, a new group of elected officials from all levels of government, has outsized ambitions to challenge political orthodoxies and remake the party,” the New York Times informs its readers. \nHow exciting! What bold new subversive project is Majority Democrats doing to win over working class and younger voters? Ending US support for genocide in Gaza? Medicare for All? \n\nAgain, when one needs to repackage More Of The Same donor-friendly politics but make it seem new and fresh and subversive (most often in opposition to a fictitious Woke Establishment), there’s really only one place to go: become more bigoted.\n\nAlas, the New York Times piece is light on specifics. There’s a lot of “trading best practices” and “debating and developing ideas,” but little moral or political vision on offer. (“Majority Democrats has yet to issue policy prescriptions,” The Times notes, as if it’s an afterthought.) The group is said, however, to be embracing the advice of “Seth London, an adviser to major Democratic donors,” which is a somewhat incomplete biography in that it omits that Seth London is a multimillionaire venture capitalist. But, we are told, he has access to donors, which is not seen as a conflict of interest that could, perhaps, undermine their nominal aim of “winning back working-class voters.” Instead, this access is presented as a mark of Seriousness. \nIn paragraph 19, the New York Times spells out what’s really going on:\n\n“In some ways, the group’s structure resembles that of the Democratic Leadership Council, the once-influential group that successfully pushed the party to the middle in the Clinton era.\nBut while many of the officials involved in Majority Democrats similarly come from the center-left, organizers insist there is no ideological litmus test to join.”\n\nOnce again, they are aware of the branding problem of neoliberalism and its previous avatar, the Democratic Leadership Council. They want to gesture towards it to assure wealthy donors it’s a fundamentally centrist project, but throw in vague rhetoric about how they “don’t have an ideological litmus test” despite all its members being down-the-line pro-Israel centrists. \nAgain, when one needs to repackage More Of The Same donor-friendly politics but make it seem new and fresh and subversive (most often in opposition to a fictitious Woke Establishment), there’s really only one place to go: become more bigoted. There’s two general philosophies on how best Democrats can “win back working-class voters”: (1) what we can generally call the Bernie-Mamdani wing, becoming more aggressively Left, economically populist, and more anti-war (which the working class overwhelmingly is); or (2) turn up the racism, transphobia, and anti-immigrant dial from 5 to 8 without any Left economic populism. Which one of these paths is more likely to appeal to wealthy donors? The answer, and thus the rhetoric and diagnosis of Democratic failures from these factions, is obvious. \nSearchlight Institute - Think Tank \nWhat if Democrats’ brand is in the toilet not because wealthy donors, Silicon Valley, or Wall Street have outside influence on their policies and made them divorced from Labor, pro-“free trade,” and run by dead-eyed lawyers, but it was, instead, because far-Left activists were manipulating the party behind the curtain and forcing candidates into taking unpopular positions? This is the general theory being promoted by Sen. John Fetterman’s former Chief of Staff Adam Jentleson and his team of centrist operators, who last week launched the Searchlight Institute, a new “think tank” making a similar pitch to that of Majority Democrats PAC: that Democrats' central problem is they have become too Woke. Specifically, Jentleson pins Harris’ loss on “the groups,” namely the ACLU, which asked Harris in 2019 if she supported healthcare for incarcerated trans people, which she did—a stance, it is now dogma in elite circles, that significantly contributed to her defeat by Trump, despite this claim having little to no empirical basis. But it vaguely feels true and, most essential of all, blames a fairly powerless constituency instead of the consulting class and their billionaire patrons. \nThis latest effort to rebrand neoliberalism, like Majority Democrats PAC, is clever enough to gesture towards populism, but does so in a superficial and class-flattening way. Indeed, the ever-cynical Jentleson keeps attempting to take ideological credit for the success of New York City Democratic mayoral nominee Zohran Mamdani, despite the fact that Jentleson never supported his candidacy and has been openly hostile and smug towards the pro-Palestine movement that made up the backbone of Mamdani’s early, evangelical volunteer core. \nIn the New York Times obligatory launch puff piece for Searchlight, published last week, they would, per usual, allow these centrist operators to advance the entirely unfounded idea that Mamdani’s primary win somehow proves their centrist theory of change works because something something \"affordability.\" (Abundance partisans use this gambit as well, because Mamdani said he is open to market-rate housing, despite the fact they oppose basically everything else in his platform. But victory, as they say, has a thousand fathers.)\n\nSince Ms. Harris’s loss, many in the party have adopted a more economic-focused message while avoiding social issues. Some prominent Democrats, like Gov. Gavin Newsom of California, have backtracked on prior support for transgender rights and open immigration policy. The most prominent liberal candidate to capture the party’s imagination this year, Zohran Mamdani, decisively won the Democratic primary for mayor of New York with an intense focus on the affordability of housing, groceries and child care. \n\nReading this, one would think Mamdani, like Newsom, also “avoided social issues,” but he very much did not. In addition to being openly combative with ICE during the campaign, repeatedly pledging to defend trans New Yorkers, and promising to defend abortion, Mamdani put on fundraising events with Mahmoud Khalil, the former Columbia Gaza protest leader targeted by Trump. Indeed, Mamdani is exhibit A on how one marries robust Left economic populism and progressive “cultural” stances seamlessly, without needing to throw either under the bus. But the New York Times, without any basis, accepts Jentleson’s dishonest narrative and presents Mamdani as the opposite. \nThis is a popular sleight of hand, and one also advanced by influential centrist pollster David Shor: the conflation of “focusing on affordability” grounded in clear class-oriented left populist politics—in Mamdani’s case born out of the Democratic Socialist of America—and what Jentleson and Shor are doing when they say Democrats need to “focus on affordability,” which is mainly a rhetorical box-checking exercise untethered from broader class politics. Neither Jentleson nor Shor push for renewing labor, bringing union leaders into the fold, or pushing for major redistributive policies that would meaningfully empower the working class such as Medicare for All—all of which Mamdani does. They instead act as if the working class can be tricked into voting Democrat with tweaks around the margins, more acceptance of bigotry, and better “messaging” that uses the right \"affordability\"-adjacent language. \nIn paragraph six, the New York Times casually mentions the rub with Jentleson’s Searchlight Institute: “The organization is subsidized by a roster of billionaire donors highlighted by Stephen Mandel, a hedge fund manager, and Eric Laufer, a real estate investor.”\nThe use of “roster” and “highlighted” implies there are several more billionaire donors. TRNN emailed Searchlight to find out who these other billionaire donors were. Searchlight did not reply to our request for comment. \nBut this is the buyer’s market right now: DC operators and careerists seeking support from a handful of mega-donors to “remake the Democratic Party” into an equally zionist, slightly more populist-sounding, exceedingly more racist and transphobic version of its 2024 self. And our media, ever indifferent to the broader structural forces backing these overnight “groups” and “movements,” treats all of this as largely organic, with no class interests, much less conflicts of interest. Everything is presented as good faith, simply Concerned With Pragmatic Necessities of Winning, and neoliberalism is rebranded as something novel and grassroots. And everyone in party leadership, big donor circles, and the wealthy consultancy class in power gets to, once again, remain in power.\n\n This article first appeared on The Real News Network and is republished here under a Creative Commons Attribution-NoDerivatives 4.0 International License. </script","summary":"They’re funded by real estate and Silicon Valley and—in a total inversion of reality—keep taking credit for Mamdani’s primary win.","url":"https://therealnews.com/your-guide-to-the-billionaire-backed-groups-working-to-push-dems-right-in-2026","image":"https://therealnews.com/wp-content/uploads/2025/09/GettyImages-2235257953-scaled.jpg","video":null,"publish_date":"2025-09-24 17:29:54","author":"Adam Johnson","authors":["Adam Johnson"],"language":"en","source_country":"us","sentiment":-0.265},{"id":363183894,"title":"President Trump Does A 180 & Goes All In On Ukraine","text":"Brian Kilmeade discussed President Trump changing his tactics and going all in on helping Ukraine. Plus, Jimmy Kimmel returns, and the Kamala Harris book tour continues to cause problems for democrats.\nClick here to watch\nFeatured guests:\nRobert O’Brien, former National Security Advisor to President Trump\nRich Lowry, Editor of National Review\nDan Bilak, member of the Territorial Defense Forces of Ukraine\nKarl Rove, Former Deputy Chief of Staff and Senior Advisor to President George W. Bush","summary":"Brian Kilmeade discussed President Trump changing his tactics and going all in on helping Ukraine. Plus, Jimmy Kimmel returns, and the Kamala Harris book tour continues to cause problems for democrats. Click here to watch Featured guests: Robert O&#8217;Brien, former National Security Advisor to President Trump Rich Lowry, Editor of National Review Dan Bilak, member of the Territorial Defense Forces of Ukraine Karl Rove, Former Deputy Chief of Staff and Senior Advisor to President George W. Bush","url":"https://radio.foxnews.com/2025/09/24/president-trump-does-a-180-goes-all-in-on-ukraine/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2025/09/Trump-Zelensky-scaled.jpg","video":null,"publish_date":"2025-09-24 17:23:44","author":"Peter Caterina","authors":["Peter Caterina"],"language":"en","category":"politics","source_country":"us","sentiment":0.061},{"id":363174116,"title":"Ex-WaPo columnist threatens legal action, claims she's 'now a victim' after firing over Charlie Kirk posts","text":"Left-wing columnist Karen Attiah threatened to take legal action against The Washington Post on Wednesday, claiming she is \"now a victim\" after being terminated earlier this month over social media posts following the assassination of Charlie Kirk. Attiah, who suggested on Bluesky she would not mourn a \"White man that espoused violence,\" argues she was wrongfully terminated when the Post dismissed her for \"gross misconduct\" over social media posts that leadership said violated company policy. The Democracy Defenders Fund, a group that bills itself as a \"nonpartisan, all-star team of experts dedicated to stopping the assault on democracy and restoring American democracy,\" sent a letter on Attiah’s behalf to Post Chief Human Resources Officer Wayne Connell, saying she will \"pursue all appropriate remedies\" to rectify the situation. WASHINGTON POST COLUMNIST FIRED OVER SOCIAL MEDIA POSTS AFTER CHARLIE KIRK'S ASSASSINATION \"Ms. Attiah did not engage in any misconduct, much less in the ‘gross misconduct’ you allege in your letter of September 11, 2025. Rather she did precisely the job you hired her to do as an opinion writer and acted fully in compliance with The Post’s own social media policy,\" the letter states. \"She spoke truthfully and forcefully about matters of vital public concern, and her performance is worthy of praise – not condemnation – for speaking difficult truths at a challenging time,\" the letter continued. \"Ms. Attiah was clear in condemning the murder of Charlie Kirk.\" In the wake of Kirk’s tragic assassination, Attiah wrote: \"Refusing to tear my clothes and smear ashes on my face in performative mourning for a White man that espoused violence is… not the same as violence\" and \"Part of what keeps America so violent is the insistence that people perform care, empty goodness and absolution for White men who espouse hatred and violence.’\" Attiah also resurfaced an old Kirk quote that made the slain conservative leader sound like he was being derogatory against all Black women, though she later admitted it was specifically about Joy Reid and Michelle Obama. PROFESSOR SLAMMED FOR 'DESPICABLE BEHAVIOR' WITH CONTROVERSIAL REPOSTS ON CHARLIE KIRK Attiah also shared an article headlined, \"Charlie Kirk’s Legacy Deserves No Mourning,\" that insisted he preached \"hate, bigotry, and division.\" The four-page letter sent to the Post’s human resources chief claimed that Attiah exercised \"journalistic caution during a fast-breaking news event.\" \"Ms. Attiah presented her opinions while condemning Mr. Kirk’s killing but at the same time refusing to engage in ‘performative mourning’ for a man who impugned Black women, put academics on watch lists, claimed Black people were better off in the era of Jim Crow, said the Civil Rights Act was a mistake, and promoted a book that called liberals ‘Unhumans,’\" the letter stated. \"Ms. Attiah presented all of these well-supported opinions in precisely the manner The Post employed her to do – as an opinion journalist using social media to comment on critical issues of the day,\" the letter continued, before suggesting her termination violates the collective bargaining agreement between the Post and the Washington-Baltimore News Guild. KAMALA HARRIS DISPARAGES WASHINGTON POST, LA TIMES OVER NON-ENDORSEMENTS IN 2024 \"We do not know yet whether The Post took this blatantly illegal action at the urging of Administration officials, although there is ample reason to ask the question. We intend to investigate the alternative as well – whether this action was taken in bad faith out of fear that the administration would take or threaten to take some action against the Post,\" the letter said. \"Relevant to those determinations, The Post or its owner, Jeff Bezos, has been heavily criticized for transforming the publication and especially the editorial page in an attempt to find a way into the good graces of the Administration and for finding ways to put money into the Trump family’s pockets through Amazon,\" the letter added. \"The Post’s unlawful action against Ms. Attiah must, moreover, be viewed in the context of the intimidation campaign President Trump and his administration have waged to silence those who criticize him and the actions and policies of his Administration.\" The letter declared the Post \"had no grounds to terminate\" Attiah and said she is \"now a victim.\" \"In sum, beyond the violation of the CBA, The Post’s silencing of its only Black female opinion writer raises many deeply troubling issues, including under the First Amendment, other legal authorities, and other matters of public policy,\" the letter said. \"Please let us know if The Post wishes to discuss how to set these wrongs right,\" it concluded. \"If not, we intend to pursue all appropriate remedies for her sake, that of media freedom, and of our democracy itself.\" Former MSNBC host Katie Phang is among the lawyers representing Attiah. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The Washington Post declined comment on personnel issues. The Guild did not immediately respond to a request for comment. The Post's Policies and Standards includes a section on social media that reads, \"Post journalists should ensure that their activity on social media platforms would not make reasonable people question their editorial independence, nor make reasonable people question The Post’s ability to cover issues fairly.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital’s Hanna Panreck contributed to this report.","summary":"Former Washington Post columnist Karen Attiah claims she&apos;s a victim of wrongful termination after dismissal over Charlie Kirk social media comments.","url":"https://www.foxnews.com/media/ex-wapo-columnist-threatens-legal-action-claims-shes-now-victim-after-firing-over-charlie-kirk-posts","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/karen-attiah-legal-threat.jpg","video":"https://www.foxnews.com/video/6380020743112","publish_date":"2025-09-24 17:02:07","author":"Brian Flood","authors":["Brian Flood"],"language":"en","category":"politics","source_country":"US","sentiment":-0.29},{"id":363183898,"title":"The Media’s Fanfiction","text":"As seen on Guteld!, Kamala Harris makes an appearance on ‘The View’. Meanwhile, in a gripping report by NBC, investigators have revealed that Charlie Kirk’s alleged assassin is not connected to any left-wing group. Tune in to hear Greg’s take on this startling claim!\n\nLearn more about your ad choices. Visit podcastchoices.com/adchoices","summary":"As seen on Guteld!, Kamala Harris makes an appearance on &#8216;The View&#8217;.  Meanwhile, in a gripping report by NBC, investigators have revealed that Charlie Kirk&#8217;s alleged assassin is not connected to any left-wing group. Tune in to hear Greg&#8217;s take on this startling claim! Learn more about your ad choices. Visit podcastchoices.com/adchoices","url":"https://radio.foxnews.com/2025/09/24/the-medias-fanfiction/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2024/12/HEADER_BANNER_GUTFELD_MONOLOGUES.png","video":null,"publish_date":"2025-09-24 16:45:05","author":"FOX News Radio","authors":["FOX News Radio"],"language":"en","source_country":"us","sentiment":-0.128},{"id":363188752,"title":"How Democrats set the stage for Trump’s assault on free speech","text":"Republish this articleThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License.\nWe encourage republication of our original content. Please copy the HTML code in the textbox below, preserving the attribution and link to the article's original location, and only make minor cosmetic edits to the content on your site.How Democrats set the stage for Trump’s assault on free speech\nby Marc Steiner, The Real News Network September 24, 2025\n\n How Democrats set the stage for Trump’s assault on free speech\nby Marc Steiner, The Real News Network September 24, 2025\n\nhttps://www.youtube.com/watch?v=wX64dXuMvyY\n\nBy pressuring broadcast giant ABC to suspend Jimmy Kimmel’s late-night show—a decision that ABC reversed this week—the Trump administration has taken its assault on the First Amendment to new heights over the past week. Kimmel’s show is back on the air for now, but the whole debacle has revealed just how vulnerable free speech in America is to political and corporate authoritarianism. This is a crisis, and both Democrats and Republicans have set the stage for it. “As corporate media accelerate their censorship of comedians and journalists,” renowned media analyst Jeff Cohen writes, “we must realize that we got to this dire situation because of old-fashioned, bipartisan corruption in Washington, DC.” In this episode of The Marc Steiner Show, Marc speaks with Cohen about how the consolidation of corporate control over the media, mixed with a ravenously censorious Trump administration, has left free speech in America hanging by a thread.\n\nJeff Cohen is a retired journalism professor at Ithaca College and the author of Cable News Confidential: My Misadventures in Corporate Media. In 1986, Cohen founded the media watch group FAIR; he is also the co-founder of RootsAction.org.\n\nAdditional resources:\n\nJeff Cohen, Salon, “Kimmel’s suspension shows media censorship is a structural problem”\nBobby Allyn, NPR, “Legal experts say pulling Jimmy Kimmel from air may amount to illegal 'jawboning'”\nPaul Starr, The American Prospect, “Capture the media, control the culture?”\n\nProducer: Rosette Sewali\nStudio Production: David Hebden\nAudio Post-Production: Stephen Frank\n\nThe following is a rushed transcript and may contain errors. A proofread version will be made available as soon as possible.\nMarc Steiner:\nWelcome to the Marc Steiner Show here in The Real News. I'm Marc Steiner. It's great to have you all with us. Our democracy is under attack and one of the underpinnings of a free society is a free and independent press. Right now, 90% of our media is controlled by just six corporations, and when those in media do their job and confront power, they're attacked by their corporate owners and by the right wing. We're in control of the White House. Trump said in response to the firing of Jimmy Kimmel, congratulations to a, b, C for finally having the courage to do what had to be done.\nAnd while Jimmy Kimmel may be back on many stations controlled by right-wing conglomerates like Nexstar, which controls over 200 stations, reaching 220 million people will not carry Kimmel. This monopolistic control of our media is a canary in the coal mine. And to unravel we face, we're joined today by Jeff Cohen, founder of the Media Watchdog Group, Fairness and Accuracy in Reporting, and co-founder of RootsAction.org. He's a retired journalism professor at the college and author of Cable News Confidential: My Misadventures in Corporate Media. Jeff, it's good to have you with us. I really appreciate you taking the time here.\nJeff Cohen:\nGreat to be with you\nMarc Steiner:\nAnd a propitious moment as well. I mean, we could talk about, as we will, the state of media in America today and where we are, but the Kimmel episode was really a frightening in the beginning, but enlightening and how this is unfolding talk. I really want to hear, start off with your kind of analysis of where that is, why this bloody thing happened in the first place and why it's turned around the way it turned around.\nJeff Cohen:\nYeah, it's been a long time coming. We'd almost have to talk about the decades of the federal government, both parties, Congress and the White House, allowing the media, placing the media in the hands of fewer and fewer ever larger conglomerates. That's the beginning. And then these conglomerates, when they want to merge even bigger, they need to get federal approval. So if there's too many employees that are interfering or making things difficult with them, for them, with whoever the government is, I experienced this as you know, Marc, I was at MSNBC in the run up to the Invasion of Iraq in 2003.\nMarc Steiner:\nI remember.\nJeff Cohen:\nAnd we were muzzled by management and then terminated three weeks before the invasion and all the internal memos leaked out. Why? Because of what we were trying to question, ask journalistic questions about the invasion. So it's been happening decade after decade, but it's never been worse than now because the conglomerates are bigger than they ever were. And we have the Trump team. So you have all of these companies doing somersaults to please Trump, especially if they have merger business before the Federal Communications Commission. The reason that Colbert was terminated, many of us believe is because Paramount needed to merge with Skydance. When that happened, the boss of Paramount, Sherry Redstone became $2 billion richer than the day before the merger, and the merger could not go through until 60 Minutes had been squeezed. The executive producer 60 minutes left in protest, as did his boss, and they were still holding out.\nThat's when I suspected they're waiting for something to be done to either Colbert on CBS, which Paramount owns or comedy the Daily Show on Comedy Central. So now we come to Kimmel, and it's the same thing. Disney had merger business before the Federal Communications Commission. Disney already owns Hulu, the streaming service, and they wanted to get fubu, and that needs federal approval. It's currently at the Justice Department, Trump's Justice Department. And then perhaps even more important than Disney's collaboration with Trump in suspending, Kimmel was two big television groups. One is the right wing Sinclair Broadcast Group, which is as Trumpian as any media company in our country and the other, and they own or operate nearly 200 television stations. And nexstar owns even more TV stations. And both of them after the FCC threatened to go after a B, C affiliates carrying Kimmel. That's also unprecedented. Those two companies said were preempting Kimmel and that put pressure on Disney and then Disney folded. But what it has to be understood about both Nexstar and Sinclair Broadcast Group, their government created conglomerates prior to the 1996 Telecommunications Act that was pushed through by Democratic President Bill Clinton, hand in hand with Republican Speaker of the House, Newt Gingrich.\nYou could only own 12 TV stations in the whole country. You couldn't own 200 like Nexar and Sinclair owned. So that brings us up today. They're going to bring Kimmel back this week according to Disney, but Nexstar and have said, no, he's not coming back on our stations. I heard from someone in Washington DC they won't be able to watch Kimmel's return because of who owns the Washington DC ABC affiliates and nearly somewhere between 25 and 30% of ABC affiliates will not be carrying Kimmel on his return.\nMarc Steiner:\nIt's so convoluted, but also very dangerous. I'm going to take a step back for just a minute. People may not, who are watching and listening to us now may not be aware of what happened in 1996 and how that allowed all this to unfold and why the Democrats team built Republicans to allow it to happen, why Clinton allowed it to happen to kind of take this massive media world we have in our country owned by many different people across the country, local stations, doing it in local ways. Why that changed? Well, what was the dynamic in 1996 that allowed that to happen and exactly what did happen so people understand really what we're facing?\nJeff Cohen:\nYeah, it's really important. When we, for decades, one individual or company could only own in the whole country, seven television and 7:00 AM radio and seven FM radio, and you couldn't own two in one market. When Reagan took over Fowler, his FCC chair got it changed. So it was 12, 12, 12. That's how it stood until the point you want me to talk about, which is 1996 when there was this corrupt law written by the telecommunications and media company lobbyists that sort of divided up the media pie among fewer companies that were allowed to get bigger because the caps were relaxed. So instead of being able to own 12 TV stations, now you could own hundreds. And so Sinclair Broadcast Group only owned 12 in 1996, and they're completely Trumpian, totally right wing. They've been right wing since they intervened. I remember in the 2004 presidential election\nMarc Steiner:\n\nJeff Cohen:\nA smear documentary attacking Kerry two weeks before the election of Kerry and George W. Bush in 2004. So those companies, thanks to the Telecommunications Act of 1996, they now own or operate around 200 stations. That was illegal in 1995. You could only own 12 nationwide. So other things that happened, Murdoch, because of the 1996 bill, he was able to build his Fox Empire Clear Channel, a right wing radio company out of Texas, closely allied with George W. Bush. Prior to the Telecommunications Act, they owned 50 radio stations. Within two years, they owned about 1200 radio stations. Again, this was written by lobbyists Fair, the media watch group that I founded, we were protesting, we were trying to get journalists to even cover this 1996 telecommunications act, which was the biggest change in media since the 1930s, and you couldn't get coverage. I remember the Consumer Federation of America was so concerned about how little attention this very dangerous corporate media bill was getting. They went to CNN and said, Hey, we've raised the money for a 32nd ad to warn the public, and CNN wouldn't sell them the 32nd ad time\nMarc Steiner:\nWould not sell them the ad,\nJeff Cohen:\nRight? So it was horrific at the time. I was able back then to write stuff in the Baltimore Sun actually\nMarc Steiner:\n\nJeff Cohen:\nHow dangerous this bill was. And we've now seen the implications both parties back then. This is before Citizens United Corporations couldn't give to politicians, but they could give to party organizations. That was what was called soft money. And the big media companies were giving big dollars to the Democratic party organizations and the Republican party organizations. And it passed the Senate, the Telecommunications Act of 1996, 81 to 18. And I remember talking shortly after it passed with Senator Paul Simon, not the singer, the senator from Illinois,\nAnd Paul Simon was the only journalist in the Senate. He had been a newspaper publisher in Illinois, and he said, it's one of the proudest votes I've ever cast was to vote no on this horrible bill giving all of our media information power to fewer and fewer big companies. So the 1996 Act, when I say to people, don't just blame Trump. If you're blaming presidents for the censorship that's going on, whether it's journalists, whether it's Colbert, whether it's Kimmel, also you have to blame President Bill Clinton, a Democrat because of the role he played in pushing this corrupt legislation. And again, Democrats were getting big money from the media companies as well as Republicans.\nMarc Steiner:\nThat period I remember, well, I was on public radio with my show and we covered this. It was almost like was deafening the silence of the opposition to what we saw unfold. And I think so especially what you've been writing lately is we are reaping what was sowed then. And I think that this is, as I said earlier, we're on a very dangerous precipice with corporate control of everything we see, read and hear, and a very right, right-wing government in power in our country. And I don't think people really understand the clear danger\nJeff Cohen:\n\nMarc Steiner:\nThis poses for us.\nJeff Cohen:\nAnd remember, when these companies want to get even bigger, they need federal approval. And that means Trump and Trump's basically told every federal agency, you work for me. So the Federal Communications Commission used to be somewhat independent. Now it's headed by a Trump bite. He wrote part of Project 2025,\nHe wrote the part of it on the media, and that's Brendan Carr. He's maybe even more ferociously right wing than Trump. And so these companies, Nexar, which already owns or operates 200 television stations, and they won't be running Kimmel, when Kimmel comes back, they want to merge with a company called TEGNA Media. And instead of just reaching 39% of US households, which is what the cap is now, they want it changed to 80%. And Brendan Carr at the FCC has basically said he would do that. So the FCC has to approve the Nexar merger. They need to approve that. The Justice Department will have to, is now investigating the merger Disney wants, where they will take over FUBU to go along with their Hulu. And it's also the internet tycoons. I mean the billionaires control the media, and you had all of them sitting in the front row of the Trump inauguration. That was unprecedented. Marc, you and I go back a few decades, but for young viewers,\nWe have to let them know how abnormal all of this is. That instead of in the front row being US Senators who've been in office for 20, 30 years, it was the tech moguls. It was Zuckerberg, it was Bezos, it was Elon Musk. Bezos owns the Washington Post. He's demanded that the opinion page only have free market propaganda. You can't be critical of corporate capitalism on the Washington Post. People have had to resign their political cartoonists, their award winner. Ann, tell Nate, she had to resign recently over comments about Charlie Kirk that were accurate just quoting what Kirk stands for\nMarc Steiner:\nSaid what actually said. Right?\nJeff Cohen:\nYes. She got fired. The Global Opinions editor and African-American woman, Karen Atia. So the censorship is worse than ever. It's happening because the media are concentrating in the hands of a few. People always say, well, at least Colbert can go until May. I'll be shocked if he survives till May Kimmel's contract. He's coming back, but he's coming back limping because those huge station groups aren't carrying it. At least not now. And I saw a great quote from the head of Nexstar or from their pr, they're not going to bring Kimmel back to their, I think they have more than 30 ABC affiliates because approval is pending. They want to see if Kimmel will be fostering an environment of respectful dialogue. Now, I guess that means they can't cover anything that comes out of the mouth of Trump. He's usually so abusive and name calling, but Kimmel, they want to be more obedient.\nSo yeah, it's utterly dangerous that the billionaires and these conglomerates have been having so much handed, so much media power. All they care about is profit maximization. They don't care about journalism. They don't care about the right to dissent. A, B, C News is a shrinking part of the Disney conglomerate. They don't care about news or journalism. Paramount Skydance because they got rid of, or they've terminated Colbert as of May. That merger went through with Paramount that owns Comedy Central and CBS merging with Skydance, which is Larry Ellison's money. He's the 81-year-old billionaire who founded Oracle. His son David is the CEO of Skydance. They've already announced they're going to move CBS news to the right. They're going to make sure there's no bias, nothing that will offend Trump. People have already left CBS news because of this. It's going to get worse. And there was an amazing column by a former Wall Street banker who's now a publisher in the New York Times a couple days ago.\nAnd he said, Larry Ellison, the 81-year-old billionaire who's now perhaps the billionaire most closely allied with Trump since Trump had his falling out with Musk, this guy is now the behind Paramount Skydance, which owns CBS Comedy Central and so much more. He's going to get a majority stake. He's part of this consortium taking over TikTok, and there's evidence that Larry Ellison wants to take over Warner Brothers discovery, which owns HBO CNN. So we're in, and again, if Trump gets what he wants out of these conglomerates, he's going to approve these mergers that would not have been able to be approved years or decades ago.\nMarc Steiner:\nSo one of the things I was thinking about reading all this and leading up to this conversation, but also just covering this because of the years I've been doing this work in media, is that this reminds me of the period of the trusts that ran America in the late 1890s, early 19 hundreds before Teddy Roosevelt broke them up. All you can say about Teddy Roosevelt, you can say about him, but he broke up the trusts, he went after\nJeff Cohen:\n\nMarc Steiner:\nHe didn't back down. So where do you think that political force today to take this on?\nJeff Cohen:\nWell, what's fascinating is when you do polls of the public, whether it's right wing people, left wing people, everyone thinks there's too much corporate power and too much corporate. It's just not debatable that the masses want these things broken up. You can do polls on this. Are the insurance companies too big? Is big pharma too big? So you bring up the key point that the reason the media have been able to be put in the hands of such a few companies is antitrust law quit being enforced.\nThe Federal Communications Commission kept changing its rules to loosen ownership caps. And I mean, think about antitrust, one of the most important cases in the area of media and information when governments still enforced antitrust law that as you say, came about at the turn of the 20th century with a Republican president, Teddy Roosevelt in 1948, the Justice Department in a suit initiated under Franklin Roosevelt's government that was continued under Harry Truman's government. They said to the big movie studios, the case is called United States versus Paramount, the movie studios, you want to own movie studios. You shouldn't be able to own the where you produce the content. You shouldn't be able to own the movie theaters that are at the end delivery point of the product or the content. Classic vertical monopoly\nMarc Steiner:\n\nJeff Cohen:\nNot allowed. And they had to sell off their theaters. And it allowed independent movies to sometimes be shown in theaters because there was no longer this vertical monopoly. That was 1948, beginning in the eighties with Reagan continuing with Clinton in the nineties. And Bush and Obama. They don't enforce antitrust law. And what was interesting is one of Biden's best appointments of all was the head of the Federal Trade Commission, Lena Kahn. And she was really a break on some of these mergers. And you had big democratic donors like Kamala Harris's big donor, Reed Hoffman was demanding month after month. They've got to get rid of Lena Khan at the Federal Trade Commission\nBecause she was obstructing these ridiculous mergers that all would've been illegal 10, 20, 50 years ago. And if Kamala Harris had been elected and Kahn was probably going to go. So that's the problem you bring up antitrust. We used to have rules that made the economy more competitive and allowed smaller outlets, smaller companies, including smaller media companies to compete. That's a bygone era, and it's not a natural process that the media were handed over to a few companies. It's utterly corrupt. These companies were funding both parties, usually done behind closed doors. As you know, the 1996 Telecommunications Act, the biggest change in media law for 60 years was hardly discussed in mainstream media.\nMarc Steiner:\nNobody covered it. I mean, in that period, I forced a conversation on Capitol Hill with our Maryland Congressman about that bill, because you saw the handwriting on the wall. You knew what it was going to mean. So I just wonder, in all the ways of looking where our media is at this moment, how do you see the political opposition organizing to stop it? Or does it exist?\nJeff Cohen:\nWell, the fascinating thing is most of the people getting censored are not as famous or big as Jimmy Kimmel, but when he got suspended, it was an uprising. There were demonstrations in the streets. There were all these online petitions. There was let's boycott Disney, boycott Hulu, 400 of the biggest names in Hollywood all signed an ACLU petition protesting the FCC, putting pressure to get Kimmel suspended. So that's the good news is people know how to organize on behalf of freedom of speech, the right to dissent. But a broader answer to your question is independent media. That's the key. I've supported The Real News Network since day one. If you know about The Real News Network, and most Americans do not.\nMarc Steiner:\n\nJeff Cohen:\nFund it, tell your neighbors and friends and relatives about it, independent news outlets are doing the serious journalistic work and having the serious debates that are not happening in mainstream media. And so if you're an activist who cares about these big issues, whether it's labor rights, environmental rights, environmental justice, anti-racism, you've got to also be, if you're an activist on any of those issues, your second issue should be media activism. And if you're a media activist, that means you resist censorship wherever you see it, and you use your own email, your own social media, your own word of mouth to promote The Real News Network, to support these places that are doing the real digging and having the voices. I can't get on mainstream media anymore. I was banned in 2003. They\nMarc Steiner:\nWon't have you.\nJeff Cohen:\nI mean, with Phil Donahue, I saw what media censorship was up close. And so I'm a big believer in independent media. The independent media is strong, but it needs activist to promote it because The Real News Network doesn't exactly have a big ad budget.\nMarc Steiner:\nIt does not. I think one of the things in terms of what you're laying out for people to hear is that most Americans, I think at this point don't understand the danger we're in with this kind of right wing authoritarian power in Washington dc. The destruction of our independent media, the monopolies taking place over our media and what we hear and learn. I mean, this is a moment where I think that people have to, the most we can do is to make people understand what we face. Our democracy is under threat. Our media independence is under threat. One of the things about America that made it blossom was freedom of the press. People speaking their minds and presses in the newspapers being owned locally by people in the community.\nJeff Cohen:\nYou've said it. I mean, we were the original democracy. It was always imperfect, always was racist.\nMarc Steiner:\n\nJeff Cohen:\nWe went to Tocqueville, a French nobleman, traveling all around the us. He's just amazed. Everyone's reading newspapers. He came from Europe where it was all monarchs. And I've marveled as recently as a few weeks ago, that we're a country where you can have Jimmy Kimmel and Colbert criticizing, ridiculing the president night after night with millions of people watching. But again, that seems to be a thing of the past. Even the comedians are going to have to go independent. Colbert. If he wants to do something, he'll be doing it online. Probably Kim will, John Stewart, they're all making plans for a post conglomerate. I mean, we have these great comics that have kept many of us sane through the Trump era, but they're all employed by conglomerates. Paramount employs Colbert and John Stewart and the team at Comedy Central at the Daily Show, Warner Brothers Discovery, which may have a new right wing owner.\nSoon they employ one of the great investigative journalists of our day, the comedian John Oliver Comcast. And Trump's been threatening Comcast. Comcast is the employer of Seth Meyers and Jimmy Fallon on NBC. Now, most people, if we had media literacy in the schools, kids would be taught, oh, okay, here are the companies that own the media and information system, but we don't have media literacy in our schools. So yeah, it's very dangerous. The comedians have been a breath of fresh air. I've always said that you can learn more from a 10 minute monologue from Kimmel or John Oliver or Colbert than from watching like a month of news on those very same channels. The journalists have always been, this is why fair.org exists. And by the way, a good way to fight for media against censorship is with fair.org. But the reason we exist is because of this censorship that has gone on, and you can resist it together as a group, and it's more effective. I am telling people the worst thing you can do in a period like this where Trump is collaborating with conglomerates to squeeze dissenting voices, the worst thing you can do is sit at home alone. You've got to join organizations. You need to become a sustainer of the Real News Network. You have to join fair fair.org. I'm also with Roots Action and Activism Group that fights this censorship roots action.org. When you'd start joining with other people.\nThat personal despair I think can be eroded because we're taking action and we're doing it with other like-minded people.\nMarc Steiner:\nWhat you're saying is really critical. Everything you've been writing about it, I think is very critical. But what you're saying at this moment in our conversation is critical because it's, we're not done yet. And I can remember in 19, I am dating myself here. I can remember in 1968 when we convened a national media in Washington DC of alternative media, but not just alternative media of media people, of small newspapers across America who came in to start talking about what we have to do to organize, to not allow then the corporate media from owning everything. And I think we're at that moment.\nJeff Cohen:\nYeah, and we're at that. I think it's the most dangerous moment since the height of the Joe McCarthy era\nOf Blacklist, where so many journalists were purged. Edward Murrow didn't even defend some of the journalists that got purged from CBS News. Journalists across the country were purged. Academics were purged. Union leaders were purged. A number of unions were almost smashed during that era. And today, one of the most outrageous things that's happened in the last week or two is the University of California President has taken the names of 160 professors, students and staff, and turn them over for investigation to Trump on the basis that maybe they engaged in antisemitism. We know a lot of these people on the list are Jewish. It's a hoax, as we know from the encampments, protesting the Gaza genocide. And my daughter is one of them.\nSo many of the protesters are Jewish, but they use this charade, this hoax that they're antisemitic when they protest the University of California being invested with Israel in killing Palestinian civilians. So they've turned over a list. It's like if you're talking about echoes of the McCarthy era, when a university is turning over a list and the people on the list don't know what they did, they've been notified. They're on the list, they have no clue why they're on the list. Many of them are Jewish. They are not antisemitic. So yes, it's a dangerous time, but we still have independent media. And if you put together the audience of the Real News Network and Democracy Now, and Common Dreams and Truth Dig and Truth Out and Counter Punch, and the Young Turks salon.com, I mean, you've got millions of people every day are getting independent news from non-corporate, non conglomerated sources. That's new. Now, there's obviously tens of millions that don't know about these independent sources, but the fact that so many millions of people are getting the news every hour. This didn't happen in the sixties. In the sixties and early seventies, which was a boom in independent media, which had underground newspapers and liberation news service. But it basically reached a youth demographic,\nAnd it was once a week, aside from Pacifica Radio, it was once a week with the internet. We have these independent outlets that are giving you the real scoop, as you guys say, the Real News on an hourly and daily basis. And we didn't have that in the late sixties, early seventies when the underground press, the alternative media boomed.\nMarc Steiner:\nWell, I really do appreciate this conversation, and I do want to have more of these conversations with you and others, and we have to keep this fire burning, and you keep your fire burning and keep putting yourself out there.\nJeff Cohen:\nThanks. And we have to be optimistic. I know The Real News Network emphasizes taking action, not just learning the news.\nMarc Steiner:\nThat's right. That's\nJeff Cohen:\nRight. That's the key.\nMarc Steiner:\nThat's the key.\nJeff Cohen:\nThanks, Marc.\nMarc Steiner:\nOnce again, thank you so much.\nJeff Cohen:\n\nMarc Steiner:\nWe'll stay in touch once again. Let me thank Jeff Cohen for joining us today. And thanks to David Hebden for not only running the program, but editing today's program and producer Rosette Sewali for making it all work behind the scenes and everyone here through the news for making this show possible. So please let me know what you thought about what you heard today and what you'd like us to cover. Just write to me at mss@therealnews.com, and I'll get right back to you. Once again, thank you to Jeff Cohen for joining us today and for the valuable work he does for all of us. So for the crew here at The Real News, I'm Marc Steiner. Stay involved. Keep listening, and take care.\n\n This article first appeared on The Real News Network and is republished here under a Creative Commons Attribution-NoDerivatives 4.0 International License. </script","summary":"Jimmy Kimmel’s show is back on the air… kind of. But the consolidation of corporate control over the media, mixed with a ravenously censorious Trump administration, leaves free speech in America hanging by a thread.","url":"https://therealnews.com/how-democrats-set-stage-for-trumps-assault-on-free-speech","image":"https://therealnews.com/wp-content/uploads/2025/09/GettyImages-2197181128-scaled.jpg","video":null,"publish_date":"2025-09-24 16:03:07","author":"Marc Steiner","authors":["Marc Steiner"],"language":"en","category":"politics","source_country":"us","sentiment":0.129},{"id":363186686,"title":"Dallas mayor calls for prayer after deadly ICE facility shooting ","text":"Dallas mayor calls for prayer after deadly ICE facility shooting \n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\nDallas mayor calls for prayer after deadly ICE facility shooting \n\nSept. 24, 202503:27\n\nFans divided over Automated Ball-Strike System coming to MLB\n\nSuspected Dallas ICE facility shooter identified\n\nStabbing at Pittsburgh high school leaves at least three injured\n\nWitness says she took cover after hearing gunshots at Dallas ICE facility \n\nSpecial Report: Dallas ICE facility shooting leaves two dead, including the suspect\n\nNow Playing\n\nDallas mayor calls for prayer after deadly ICE facility shooting \n\nJimmy Kimmel returns after suspension with free speech message\n\nDrones found flying over Danish and Norwegian airports\n\nRichard Branson launches immersive exhibit on land mines in Ukraine\n\nKamala Harris details her presidential campaign\n\nJimmy Kimmel set to return to late night tonight\n\nRyan Routh attempts to stab himself in neck after conviction\n\nPlot foiled to take down New York City cell phone grid\n\nWoman in Graceland fraud scheme sentenced to nearly five years in prison\n\nRyan Routh attempted to stab himself in the neck with a pen after guilty verdict\n\nKimmel suspension may have been a factor in ABC affiliate shooting, authorities say\n\nNexstar joins Sinclair in keeping Jimmy Kimmel off ABC affiliate stations\n\nHow Secret Service discovered and dismantled NYC telecommunication threat\n\nMichigan mother says her son was expelled after disarming classmate\n\nSecret Service shuts down disruptive telecommunications threat in New York City\n\nDallas mayor calls for prayer after deadly ICE facility shooting \n\nDallas Mayor Eric Johnson spoke at a press conference shortly after the deadly shooting at an ICE facility. Johnson said, \"The country and city needs prayer.\" Two people are dead, including the shooter, who died from a self-inflicted gunshot wound.Sept. 24, 2025\n\nGet more newsLiveon\n\nFans divided over Automated Ball-Strike System coming to MLB\n\nSuspected Dallas ICE facility shooter identified\n\nStabbing at Pittsburgh high school leaves at least three injured\n\nWitness says she took cover after hearing gunshots at Dallas ICE facility \n\nSpecial Report: Dallas ICE facility shooting leaves two dead, including the suspect\n\nNow Playing\n\nDallas mayor calls for prayer after deadly ICE facility shooting \n\nGet more newsLiveon\n\nBest of NBC News\n\nNBC News NOW\n\nFans divided over Automated Ball-Strike System coming to MLB\n\nNBC News NOW\n\nSuspected Dallas ICE facility shooter identified\n\nNBC News NOW\n\nKeys to happiness: Dog's love for owner's piano playing goes viral\n\nNBC News NOW\n\nStabbing at Pittsburgh high school leaves at least three injured\n\nFour people shot at Dallas ICE facility, officials say\n\nNBC News NOW\n\nWitness says she took cover after hearing gunshots at Dallas ICE facility","summary":"Dallas Mayor Eric Johnson spoke at a press conference shortly after the deadly shooting at an ICE facility. Johnson said, \"The country and city needs prayer.\" Two people are dead, including the shooter, who died from a self-inflicted gunshot wound.","url":"https://www.nbcnews.com/video/dallas-mayor-calls-for-prayer-after-deadly-ice-facility-shooting-248242757954","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_09/1758729086790_nbc_spec_texas_mayor_ice_facility_shooting_250924_1920x1080-89drx4.jpg","video":null,"publish_date":"2025-09-24 15:51:32","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.103},{"id":363213938,"title":"'Final Epstein vote secured': Here are 3 crucial election takeaways","text":"On Tuesday, September 23, some special elections were held in the United States — including a U.S. House of Representatives race in Arizona's 7th Congressional District and a Georgia State Senate race. \n\nThe U.S. House race was a landslide victory for progressive Democrat Adelita Grijalva, who, according to the Associated Press (AP), was ahead of Republican Daniel Butierez by roughly 39 percent after about 87 percent of the votes had been counted. A third Latino in the race, Green Party candidate Eduardo Quintana, picked up around 1 percent of the vote.\n\nMeanwhile, in Georgia's 21st Senate District, MAGA Republican Jason Dickerson defeated Democratic attorney Debra Shigley. Dickerson attacked Shigley as a \"woke liberal,\" and that messaging worked in the heavily GOP district.\n\nIn a listicle published on September 24, The Hill's Caroline Vakil lays out three \"key takeaways\" from these special elections: (1) \"Final Epstein vote secured,\" (2) \"Adelita Grijalva takes up father's progressive mantle,\" and (3) \"Democrats fall short in Georgia, but overperform.\"\n\n\"Grijalva's win Tuesday night means lawmakers pushing for the release of files related to convicted sex offender Jeffrey Epstein now have enough votes in the House to move forward,\" Vakil explains. \"Reps. Thomas Massie (R-Ky.) and Ro Khanna (D-Calif.) will clinch enough signatures on their discharge petition once Grijalva is sworn in, which will force a vote on the House floor over the Justice Department's release of the files…. The Trump Administration's handling of the Epstein files has angered Republicans and Democrats alike, particularly after the Justice Department determined, earlier this year, that Epstein didn't maintain a 'client list'— a departure from what some Trump allies had originally alluded to — and that the disgraced financier's death was by suicide, not the result of foul play.\"\n\nAdelita Grijalva is the daughter of the late Rep. Raúl Grijalva (D-Arizona), and she was endorsed by some well-known progressives: Sen. Bernie Sanders (D-Vermont) and Rep. Alexandria Ocasio-Cortez (D-New York).\n\nCNN data expert Harry Enten noted that Adelita Grijalva carried that district by a 17 percent higher margin than 2024 Democrat presidential nominee Kamala Harris.\n\nIn Georgia, Dickerson defeated Shigley by around 22 percent. But given how deep red that district is, Democratic strategists believe that Shigley overperformed; Republican Brandon Beach, who gave up that seat to work in the Trump Administration, won it by greater margins than Dickerson.\n\n\"Despite Shigley's loss…. Democrats still celebrated the attorney's performance in the state legislative election,\" Vakil observes. \"While Beach won his seat comfortably in November with 70 percent of the vote, Dickerson didn't break 62 percent Tuesday. Though special elections and the usual November elections encounter different dynamics, Democrats touted Shigley's overperformance — part of a larger trend for the party this year in a number of special legislative and congressional elections.\n\nRead Caroline Vakil's full listicle for The Hill at this link.","summary":"On Tuesday, September 23, some special elections were held in the United States — including a U.S. House of Representatives race in Arizona's 7th Congressional District and a Georgia State Senate race. \n\nThe U.S. House race was a landslide victory for progressive Democrat Adelita Grijalva, who, according to the Associated Press (AP), was ahead of Republican Daniel Butierez by roughly 39 percent after about 87 percent of the votes had been counted. A third Latino in the race, Green Party candidate Eduardo Quintana, picked up around 1 percent of the vote.\n\nMeanwhile, in Georgia's 21st Senate District, MAGA Republican Jason Dickerson defeated Democratic attorney Debra Shigley. Dickerson attacked Shigley as a \"woke liberal,\" and that messaging worked in the heavily GOP district.\n\nIn a listicle published on September 24, The Hill's Caroline Vakil lays out three \"key takeaways\" from these special elections: (1) \"Final Epstein vote secured,\" (2) \"Adelita Grijalva takes up father's progressive mantle,\" and (3) \"Democ","url":"https://www.alternet.org/grijalva-special-elections/","image":"https://www.alternet.org/media-library/image.jpg?id=61643797&width=1200&height=600&coordinates=0%2C356%2C0%2C356","video":null,"publish_date":"2025-09-24 15:50:31","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":-0.07},{"id":363138486,"title":"Sarah Huckabee Sanders torches Kamala Harris’ ‘revisionist history’ after 2024 election defeat","text":"Arkansas Gov. Sarah Huckabee Sanders criticized former Vice President Kamala Harris, accusing her of rewriting the story of her failed 2024 presidential run. \"The revisionist history that Kamala has is pretty laughable. It wasn't that she didn't have enough time. It's that she doesn't have any good ideas,\" Sanders said Wednesday on \"Fox & Friends.\" \"America had already seen what an administration under her leadership would look like: failed, disastrous, open borders, tons of crime, high inflation. And people didn't want that anymore. They rejected her and her ideas.\" KAMALA HARRIS BREAKS SILENCE ON BIDEN DROPOUT, ADMITS SHE HAS REGRETS ABOUT HER HANDLING OF SITUATION Sanders’ comments come after Harris reflected on why she lost the election during her Tuesday appearance on ABC’s \"The View.\" \"Probably one of the biggest in my mind is we just didn't have enough time,\" Harris told the hosts in reference to her campaign, which lasted only 107 days. KAMALA HARRIS REJECTS IDEA THAT BUNGLED 'VIEW' INTERVIEW WAS TIPPING POINT IN CAMPAIGN She was also pressed on her 2024 appearance on \"The View,\" when she was asked whether she would have handled anything differently during the Biden administration. At the time, she said, \"not a thing comes to mind,\" a response widely viewed as damaging to her campaign. \"I'm a loyal person. And I didn't fully appreciate how much people wanted to know there was a difference between me and President Biden. I thought it was obvious. And I didn't want to offer a difference in a way that would be received or suggested to be a criticism,\" Harris said this week. CNN PANEL SHREDS HARRIS' COLBERT INTERVIEW FOR HER LACK OF SOLUTIONS AFTER 'SIX MONTHS TO FIGURE IT OUT' But Sanders pushed back, saying Harris wasn’t rejected because of Biden, but because she \"had nothing to offer.\" She pointed to President Donald Trump’s recent meetings with world leaders, such as his speech at the United Nations General Assembly earlier this week, as proof of his effectiveness. \"Can you imagine if Kamala Harris was dealing with and in the position that Donald Trump was in? He's cleaning up all of their messes, not making them worse.\" Sanders said Harris’ appearance on \"The View,\" promoting her new book, serves as a reminder of why Americans voted the way they did. CLICK HERE TO GET THE FOX NEWS APP \"When she does interviews like that, it only reminds us even more why we're glad Donald Trump is back in the White House.\"","summary":"Gov. Sarah Huckabee Sanders responds to Kamala Harris&apos; recent interview about her 2024 election defeat, arguing voters rejected her ideas rather than timing.","url":"https://www.foxnews.com/media/sarah-huckabee-sanders-torches-kamala-harris-revisionist-history-after-2024-election-defeat","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/kamala-harris-sarah-sanders-fox-news.jpg","video":"https://www.foxnews.com/video/6380040248112","publish_date":"2025-09-24 15:50:12","author":"Madison Colombo","authors":["Madison Colombo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.336},{"id":363163494,"title":"Kamala Humiliates Tim Walz One Last Time By Revealing Why She Chose Him For VP","text":"Former Vice President Kamala Harris detailed in her new book why she chose Minnesota Gov. Tim Walz to be her 2024 running mate, drawing on his self-deprecating nature and lack of desire to out shine her.\n\nHarris released her book, “107 Days” on Tuesday. It’s her account of running the shortest presidential campaign in modern history. The former vice president detailed the running mate interview process, in which she narrowed it down to Pennsylvania Gov. Josh Shapiro, Walz and Arizona Sen. Mark Kelly. Shapiro was “polished” but Harris noted her reservations towards his political ambitions. Walz, in Harris’ description, is nearly the complete opposite. (RELATED: Kamala Awkwardly Explains Passing On Pete Buttigieg In 2024 Race)\n\n“It was quickly clear to me that Tim had walked into that room feeling he wouldn’t get the job,” Harris said of her interview with Walz. “The first thing he said as he sat down—I don’t even know if the door had closed behind him—was: ‘Whether or not you pick me, I’m going to do everything I can to get you elected.'”\n\n“He was immediately self-critical. ‘I’m not a good debater.’ ‘I’ve never used a teleprompter,'” Harris continued.\n\n“He was less polished than Josh. But he had an appealing authenticity and was genuinely self-deprecating. A lot of people in politics act self-deprecating, but it’s just that, an act. If anything, Tim over-indexed his own liabilities,” the former vice president stated.\n\nHarris praised Walz’s roots and down-to-earth demeanor. She wrote about how she liked his track record as a politician.\n\n“He said he had no ambition to be president, that his aim as vice president would be doing meaningful work to improve people’s lives. It’s no bad thing for a vice president to want to be president, unless that ambition plays a corrosive role in the relationship and causes disloyalty,” Harris stated.\n\n“That wouldn’t be an issue with Tim. He had no fixed ideas about what the role of vice president should be, saying he would do whatever I found was most useful for him to do,” she continued.\n\nBefore meeting with Walz, Harris wrote that she met with Shapiro first. The two, she later said, made good impressions but in different ways.\n\n“In our meeting [Shapiro] was, as always, poised, polished, and personable,” Harris noted about her interview with Shapiro. “I told him how much I admired his work. He was great on the stump, a wonderful campaigner, very compelling and very bright.”\n\nShe continued with more details from their interview in which they discussed how to win Pennsylvania and Shapiro’s past statements on his support for Israel. The former vice president then asked him if he understood the role of the vice president, adding that doing so would make him successful.\n\n“He peppered me with questions, trying to nail down, in detail, what role I saw for my VP. At one point, he mused that he would want to be in the room for every decision. I told him bluntly that was an unrealistic expectation. A vice president is not a copresident,” Harris said of their meeting.\n\n“I had a nagging concern that he would be unable to settle for a role as number two and that it would wear on our partnership. I had to be able to completely trust the person in that role,” she continued.\n\n“‘Every day as president,” she said, “I’ll have ninety-nine problems, and my VP can’t be one,” she concludes.\n\nWith Kelly, Harris’ main concern seemed to be that he wouldn’t be able to handle Trump’s attacks and the political arena because of his short time in politics.\n\n“Could a captain, used to deference and respect, adapt to an opponent’s national campaign specifically designed to disrespect him, to cut a hero down to something small?” she wrote.\n\nThe former vice president later revealed that most of her inner circle was leaning towards Walz as her running mate. Harris asked her 17-year-old godson, who she describes as a “creature of the zeitgeist,” for a young person’s opinion. He also liked Walz.\n\nHarris noted that her husband, former second gentleman Doug Emhoff, was leaning towards Shapiro because he had known him longer.\n\n“It was always going to have to be my decision. I told my staff and family that I didn’t want any more input, and I went to do something practical: I made a tasty rub and seasoned a pork roast,” Harris wrote.\n\n“By the time I went to bed, I’d decided on Walz.”","summary":"'Tim over-indexed his own liabilities'","url":"https://dailycaller.com/2025/09/24/kamala-harris-tim-walz-josh-shapiro-vice-president-2024-election-book/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2181638838-e1758724794462.jpg","video":null,"publish_date":"2025-09-24 15:05:29","author":"Reagan Reese","authors":["Reagan Reese"],"language":"en","source_country":"US","sentiment":0.197},{"id":363180158,"title":"Kamala Harris Admits Being ‘Disappointed’ With Her Husband – Subtly Confirms Divorce Rumors Weren’t Entirely False","text":"Romantic relationships can be quite stressful, and it’s safe to say that running for president has the same impact. Now, combine both of these, and you can imagine how hard it has been for former Vice President Kamala Harris and her husband, Doug Emhoff.\n\nThere have been innumerable rumors around their divorce, especially in light of Harris’ 2024 presidential campaign. Harris and Emhoff’s public appearances have suggested that their marriage has survived. However, Harris may have just confirmed that those divorce rumors weren’t entirely false.\n\nHarris describes how her 60th birthday in October of that year, just before the election, was almost a breaking point. She mentions this in her memoir “107 Days,” which chronicles her 2024 presidential campaign. Harris remembers that while she and Emhoff were traveling for their campaigns, her team managed to arrange for them to both be in Philadelphia on her special day.\n\nShe had been looking forward to what Emhoff had planned, only to realize that he hadn’t planned anything, and that her subordinates had taken care of practically everything. “Storm [Harris’ social secretary] knocked on Doug’s door to ask him to choose the menu. He’d shrugged and told her to ask me. So she picked the menu herself,” Harris writes (via The List). \n\nIn her book, the former Vice President expresses sympathy for Emhoff, pointing out that he had been campaigning hard as well and that they were both exhausted by the attacks from political pundits. But it only took a couple more perceived slights on Harris’ birthday to escalate the situation because tensions were already so high.\n\nIn her memoir, Kamala Harris writes that she was, to say the least, disappointed by her husband, Doug Emhoff, on her 60th birthday. Emhoff’s own hectic schedule prevented him from making reservations for the hotel, dinner, or dessert; instead, Harris’ staff handled all of it.\n\nEven worse, the hotel was evidently nothing to write home about, even though it was supposedly finer than some of the locations they’d typically stay while on the campaign trail. Emhoff briefly appeared to redeem himself by giving Harris a lovely piece of jewelry, from a set of two, as a birthday present.\n\nBut when Harris saw that the date engraved on the back was really their wedding anniversary rather than her birthday, her appreciation soon gave way to resentment. “He’d obviously intended to give me both pieces on our anniversary, until it occurred to him that by repurposing one piece, he could kill two birds with one stone,” Harris writes in her memoir.\n\nWhen Harris went to the bathtub to relax, she discovered that the towels were across the room. Emhoff was too busy watching a baseball game to heed her cries for help. Harris had finally had enough, and they started fighting. \n\nHowever, Emhoff was able to put an end to the argument by saying something that struck a chord with Harris: “We can’t turn on each other.” “With the hits coming from every direction, we had to stay united,” Harris wrote. To put things right, Emhoff penned Harris several love notes on index cards, which were then placed one by one on the pillows in the then-VP’s hotel room on the evenings when they were in different locations.","summary":"After the 2024 election, Kamala Harris and Doug Emhoff faced divorce rumors. Now it seems the rumors aren't all untrue.","url":"https://www.inquisitr.com/kamala-harris-admits-being-disappointed-with-her-husband-subtly-confirms-divorce-rumors-werent-entirely-false","image":"https://www.inquisitr.com/wp-content/uploads/2025/09/Kamala-Harris-addresses-divorce-rumors.jpg","video":null,"publish_date":"2025-09-24 15:02:28","author":"Shrobana Rakshit","authors":["Shrobana Rakshit"],"language":"en","source_country":"us","sentiment":-0.284},{"id":363163502,"title":"‘Embarrassing For Her’: Democrats Reportedly Rage Over Kamala Harris’ New ‘Gossip’ Book","text":"Some Democrats are livid with former Vice President Kamala Harris over her new memoir, Politico reported on Wednesday.\n\nSeveral individuals active in Democratic politics have been expressing frustration about Harris as the party’s failed 2024 nominee embarks on her media tour promoting her newly released book, “107 Days,” according to Politico. The report comes as Democrats are attempting to escape from the political “wilderness” and move past their party’s steep losses in the 2024 election cycle.\n\n“In an era where Democrats need all hands on deck in the fight to protect the country and the constitution from the lawlessness of the Trump administration, she had a real opportunity to be a critical voice in the resistance,” Michael Hardaway, a Democratic strategist who served as a senior adviser to House Minority Leader Hakeem Jeffries, told Politico. “This book seems to be unhelpful and divisive in a way that makes it hard for her to be the face of the party as we look to the future.” (RELATED: Kamala Harris Says Her Grief From Losing To Trump Compared To The Day Her Mother Died)\n\n Kamala Harris is knives out for Biden World in her new book, ‘107 Days’: pic.twitter.com/DLDjn1iA7V — Reagan Reese (@reaganreese_) September 23, 2025 \n\nMeanwhile, an anonymous adviser to a prospective 2028 presidential candidate told Politico that Harris “chose to write a gossip book that prioritizes the pettiness of her politics.” \n\n“At a time when people are looking for a vision and leadership … and want to see leaders rise to the level of threat facing the country, it’s pretty crazy she chose to write a gossip book that prioritizes the pettiness of her politics,” the adviser said. “It’s embarrassing for her, and for all Democrats, considering she was the leader of the party less than a year ago.”\n\nIn a Tuesday appearance on ABC’s “Good Morning America,” Harris expressed regret over the fact that she did not relay concerns to former President Joe Biden about his decision to seek reelection, saying it was “reckless.” When asked about a potential 2028 White House run during an interview with MSNBC’s “The Rachel Maddow Show” on Monday, Harris said that the upcoming presidential race is not her “focus right now.”\n\n“That’s not my focus right now. That’s not my focus at all, it really isn’t,” the former vice president said.\n\n“If this was intended as a campaign launch, I don’t think it got off the pad,” David Axelrod, former President Barack Obama’s former chief campaign strategist, told Politico. “If it was intended as a catharsis, only she can know if it was successful.”\n\nOne anonymous former Biden and Harris campaign staffer told Politico that if voters “start seeing her as a sore loser,” that is “the risk” for Harris politically.\n\nStill, some Democrats are expressing continued support for Harris, according to Politico. Mike Nellis, a Democratic strategist who worked with Harris on her 2020 White House bid, lauded the former vice president for “speak[ing] her truth,” despite “that truth” being “uncomfortable for people,” Politico reported.\n\n“I think if we had had more difficult conversations as a party over the last couple of years,” Nellis told Politico, “we would’ve been in a much stronger position to win the election last year.”\n\nHarris announced in late July that she is not running in California’s upcoming gubernatorial race, spurring rumors that she is planning to launch a White House bid in 2028. However, some recent polling has shown that many California Democrats are unenthused about the prospect of Harris launching another presidential campaign.\n\nOn Monday, CNN chief data analyst Harry Enten said that Harris has only become less popular among Democrats since she was defeated by President Donald Trump in the 2024 presidential election. Trump notably won the popular vote in 2024 — becoming the first Republican nominee to accomplish this feat in 20 years — garnering 49.8% to Harris’ 48.3%.\n\nHarris’ office did not respond to a request for comment by the Daily Caller News Foundation.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'unhelpful and divisive'","url":"https://dailycaller.com/2025/09/24/democrats-reactions-kamala-harris-book-embarrassing/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2178262007-scaled-e1758723312809.jpg","video":null,"publish_date":"2025-09-24 14:52:42","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.182},{"id":363127100,"title":"Kamala Harris Slams Trump for Pardoning 'the Fentanyl Dealer Ross Ulbricht'","text":"I confess I haven't read 107 Days, Kamala Harris' new memoir about her short-lived presidential campaign, cover to cover. But I did read at least one sentence, and it was a doozy.\n\n\"The Justice Department is going after Trump's enemies list,\" the former vice president writes, \"while Trump supporters have been pardoned and released: January 6 rioters who attacked police, the fentanyl dealer Ross Ulbricht, numerous tax cheats.\"\n\nAh, Ross Ulbricht, the fentanyl dealer who was not convicted of actually dealing fentanyl—or any drug—himself.\n\nUlbricht was sentenced to life in prison for his role in operating the Silk Road, an online marketplace where people could buy and sell illicit drugs. \"By punishing Ulbricht as if he personally distributed narcotics, the government set a dangerous precedent for internet platforms and personal liability in the digital age,\" wrote Editor in Chief Katherine Mangu-Ward in the April issue of Reason. \"Pressure to hold platform operators liable for everything from misinformation to sex work has grown in the past decade as Ulbricht and his supporters—especially those in the libertarian and cryptocurrency communities—fought for his freedom.\"\n\nUlbricht ultimately obtained that freedom, as Harris notes, from President Donald Trump, who granted Ulbricht a pardon after he had served 11 years in prison. One need not even approve of Ulbricht's conduct to understand that clemency here was not the scandal Harris portrays.\n\nHis sentence was, for one, grossly disproportionate to his offenses: a double life sentence without the possibility of parole. The only way he would have otherwise been released was in a body bag. Serving more than a decade in prison is no small thing.\n\nBut his motivations should also matter, which Harris obscures by reducing Ulbricht to \"the fentanyl dealer.\"\n\n\"The Silk Road began as Ulbricht's idealistic attempt to make the black market just a little safer by creating a place where people could vet buyers,\" notes Reason's Zach Weissmueller, \"avoid risky in-person transactions, find untainted drugs, and share safety information.\" Indeed, Ulbricht, who has expressed remorse multiple times for any harm he caused, has said he \"was trying to do something good.\"\n\nHarris isn't wrong that Trump has issued pardons to some undeserving recipients. She could have chosen to highlight Scott Jenkins, for instance, the Virginia sheriff who was convicted of accepting cash bribes from businessmen in exchange for appointing them as auxiliary deputy sheriffs, a sworn law enforcement position, so they could take advantage of the special privileges associated with that role. Jenkins was sentenced to ten years in prison but did not serve a day of that. Why? \"No MAGA left behind,\" said Pardon Attorney Ed Martin on X.\n\nEven still, Harris is entitled to her opinion on whether or not Ulbricht succeeded in his goal to \"do something good.\" Her throwaway line about him in her new book, however, is a reminder that no matter how many times she has tried to position herself as someone who supports redemption and sensible criminal justice reform—and to run away from her tough-on-crime past—she is still ever the prosecutor.","summary":"In her new book, 107 Days, the former vice president reminds us that she is ever the prosecutor.","url":"https://reason.com/2025/09/24/kamala-harris-slams-trump-for-pardoning-the-fentanyl-dealer-ross-ulbricht/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/09/ross-ulbricht-kamala-harris.jpg","video":null,"publish_date":"2025-09-24 14:43:24","author":"Billy Binion","authors":["Billy Binion"],"language":"en","category":"politics","source_country":"us","sentiment":-0.366},{"id":363154460,"title":"For Black conservatives, Charlie Kirk built more than politics -- he built community","text":"The death of Charlie Kirk has left a generation of young Black conservatives grieving not only the loss of an influential figure but also the man they say built a community where they felt they belonged, a half a dozen Black conservatives tell ABC News.\n\nFor many, the news arrived in the most jarring of ways, text messages lighting up phones and timelines filled with a viral video of his final moments. What followed was shock, heartbreak and reflection on the complicated legacy of a man whose influence for some ran deeper than many outside his circle ever realized.\n\nTo be a Black conservative in America often means carrying a dual burden that is as social as it is political. Pew Research found that 83% of Black voters identify with or lean Democratic, while 12% align with the Republican Party. Faced with such a stark divide, families can fracture, friendships may fade and communities sometimes close their doors. For thousands who found themselves drawn to Turning Point USA (TPUSA) or BLEXIT, Kirk offered a sense of belonging, said the Black conservatives ABC News spoke with.\n\nBLEXIT, short for \"Black Exit,\" is a group encouraging Black Americans to leave the Democratic Party and embrace conservative politics. Turning Point USA, Kirk's flagship organization, often partnered with BLEXIT to create platforms, events, and mentorship pipelines for young Black conservatives before later merging.\n\nIn March 2023, TPUSA announced, \"TurningPoint USA will incorporate the corporate structure, leadership team, branding, social media, and the underlying mission of BLEXIT, helping grow the movement into the future.\"\n\nKirk's efforts, many argue, helped broaden the GOP's reach among Black voters. Donald Trump drew about 8% of the Black vote in 2020, and by 2024 his support climbed to 15%, including roughly 21% of Black men. Vice President Kamala Harris still carried a commanding majority with about 83%.\n\nDuring Kirk's memorial on Sunday, President Donald Trump highlighted that work. \"Charlie was actually a master builder of people, it was Charlie who first started organizing young Black conservatives hungry for support and leadership,\" Trump said.\n\nConservative leaders told ABC News that Kirk nurtured a generation of young leaders, influencers and organizers who otherwise might have stood alone.\n\n\"We wouldn't have a Republican Party if it weren't for Charlie Kirk,\" Brandon Tatum told ABC News.\n\nTatum, alongside Kirk and conservative podcaster Candace Owens, helped organize the first Young Black Leadership Summit in 2018. It was the largest gathering of Black conservatives ever invited to the White House.\n\nNearly 400 young people had their travel and expenses covered by Turning Point USA, leaders said. For some, it was their first plane ride, the first time they'd worn a suit and their first glimpse of Washington.\n\nThat summit, Tatum said, was a turning point.\n\n\"Every Black conservative that you can think of that's prominent on social media today, most of them came from that summit,\" he said.\n\nFor Amir Odom, a former TPUSA ambassador, the journey toward Kirk's movement began with fear and uncertainty. \"If you ask anybody pre-2017, I was the most anxiety-ridden person ever, crippling anxiety, fearful of my life for being Black and gay in America,\" he said. \"The weight that was lifted off my shoulders when I was like, Oh, you can actually talk to Republicans, and it's fine.\"\n\nIn 2017, Odom, was marching with Black Lives Matter activists in Atlanta after the police killing of Philando Castile. But he said he found himself at a crossroads, uneasy with some of the messaging and decisions being made, including a call to march onto a highway.\n\nAround that time, after a chance date, he was encouraged to watch a video featuring Kirk, Owens and Tatum. He eventually reached out to Tatum, who invited him to the Young Black Leadership Summit.\n\n\"​​Within a year, I went from marching with BLM to meeting Kirk and shaking Trump's hand,\" said Odom, who said he never felt unwelcome among the conservative community led by Kirk.\n\nThe community he found through YBLS was unlike anything he'd known, he said. Kirk's message to the group was to \"'keep using your voice, be vocal, seek the truth and just be honest,'\" Odom described it. It was that message that inspired him to do more, he added, even at personal cost.\n\n\"I actually lost all of my friends on the left. I have an aunt that I haven't talked to since then, for literally just looking at the other side,\" he said.\n\nThere are about 100,000 Black supporters of TPUSA and BLEXIT, according to Pierre Wilson, senior director of BLEXIT and Kirk's highest-ranking Black employee.\n\n\"Charlie launched probably thousands of careers of people that people will never know. He launched their careers and is the reason that they're as successful as they are today,\" he said.\n\nBut Kirk's rise was not without fierce opposition. Critics argued he played on racial archetypes and stereotypes, and reinforced white supremacy while dismissing systemic racism. He hosted a college lecture series called the \"Exposing Critical Racism Tour\" in 2021, where he attacked Critical Race Theory. By 2024, Kirk took aim at diversity, equity and inclusion (DEI) initiatives.\n\nDEI is a framework designed to expand opportunities for underrepresented groups. Kirk argued that DEI and affirmative action \"lowers the threshold of standards, and increases things that do not matter, such as skin color and ethnic background.\" He later said the Civil Rights Act of 1964 was a mistake.\n\nThe Congressional Black Caucus issued a statement after his death that reflected both sorrow over violence and sharp disapproval of his views.\n\n\"We must unequivocally reject violence in all its forms,\" Chair Yvette D. Clarke wrote, invoking the assassinations of Martin Luther King Jr., Medgar Evers and Fred Hampton. But the CBC also said that Kirk promoted \"a worldview that includes ideas many Americans find racist, harmful, and fundamentally un-American.\"\n\nBilal Dabir Sekou, an associate professor of political science at the University of Hartford, said Kirk's ability to reach young Black conservatives was tied to his skill to merge civic life with Christian identity and culture.\n\n\"You're seeing this sort of engagement with the church among younger Blacks, that Kirk was able to make that connection,\" Sekou said. \"It's hard for a lot of people to really understand just how important the church actually is within the Black community, and how connected many Black people are to the church. And so when you have a moment that really merges civic life with Christian identity and Christian culture, that can be very appealing to a lot of young people who grew up in the church, especially in the South, but also in many other parts of the country. That kind of message can resonate with them.\"\n\nSekou stressed that the Black community is not monolithic, and that even within conservatism, there are tensions over race and justice.\n\n\"Even for a lot of Black conservatives, and I think there's a lot of overlap with religious identity for many who fall into that camp, there's also recognition that there is a need for a social justice agenda,\" he said. \"Black conservatives are in this really weird position where the Black community is generally identified as a liberal group, a liberal demographic that votes mostly for the Democratic Party. But I think the values of Blacks are a lot more diverse, and the issues they care about are more diverse than what the voting reflects.\"\n\nFor Jasmine Woodson, Kirk's vision became deeply personal. She said she never imagined a future in politics. Six months before joining BLEXIT, she was working as an exotic dancer, she said.\n\nThen she found faith.\n\n\"That night, I gave my life to God,\" she said. \"I told God, 'Hey, I don't know what you have in store for me, but this isn't it.'\"\n\nShe started posting videos online, which caught the attention of BLEXIT organizers, and she was invited to a \"Back the Blue\" protest in support of law enforcement in Washington, D.C., and, while traveling, received an invitation to attend a Trump speech.\n\nNot long after, she formally joined BLEXIT, first at the state level and later as the group's national recruiting manager. Though she eventually left the organization, she credits it with opening doors she never expected.\n\n\"Your current situation does not dictate your future, I never would have guessed in a million years I'd be where I am today,\" she said. \"They never judged my past, they believed in my abilities. They still platformed me, they still put me in rooms and gave me opportunities and never made me feel like I was my past.\"\n\nWoodson now works as the director of a conservative anti-death penalty organization.\n\nThose mourning him remember a man who could be opinionated and controversial, from his criticism of DEI to his remarks on race and Civil Rights leaders. At the same time, the Black conservative leaders told ABC News he was also generous and encouraging, someone relentless about making space and sharing resources for Black and brown voices inside conservatism. In the days after his death, group chats filled with old photos, playlists were swapped and prayer circles sprang up online, reminders that the community he built is still leaning on one another.\n\nKirk's death leaves Black conservatives at a crossroads, the leaders told ABC News, but also a community determined to carry forward the lessons of family, opportunity and resilience he worked to build.\n\n\"God's plan is bigger than and better than what we ever could expect, and there's something good that's going to come out of this because what the enemy created to be as a negative, God will make it tremendous,\" Tatum told ABC News.","summary":"Charlie Kirk broadened the GOP’s reach and helped create space for young Black conservatives, though his critics say his legacy on race and inclusion remains divisive.","url":"https://abcnews.go.com/US/generation-black-conservatives-charlie-kirk-built-politics-built/story?id=125765387","image":"https://i.abcnewsfe.com/a/1c0f451d-4857-47c8-8584-5c16744e3cb6/kirk_1758679109456_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-09-24 14:17:24","author":"Beatrice Peterson","authors":["Beatrice Peterson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.128},{"id":363184388,"title":"Trump, Carr push boundaries of broadcast law, FCC authority","text":"Sept. 24 (UPI) -- The FCC is prohibited from influencing network content but Chairman Brendan Carr and President Donald Trump have used pressure campaigns on ABC and others to test those limits.\n\nThe Trump administration's attempt to push Jimmy Kimmel Live! off the air worked, briefly. While consumer backlash convinced Disney and ABC to reverse course, the alarm has been sounded over the weaponization of federal authority to suppress free speech.\n\nKimmel returned to ABC on Tuesday, lamenting the importance of standing up for free speech in his opening monologue, calling attempts to take shows like his off the air for sharing dissenting opinions \"un-American.\"\n\n\"Ten years ago this sounded crazy: Brendan Carr, the chairman of the FCC, telling an American company 'We can do this the easy way or the hard way,' and 'These companies can find ways to change conduct and take action on Kimmel or there's going to be additional work for the FCC ahead,'\" Kimmel said. \"In addition to being a direct violation of the First Amendment, it is not a particularly intelligent threat to be made in public.\"\n\nSection 326 of the Communications Act states that the commission cannot interfere with the right to exercise free speech.\n\nFormer FCC Commissioner Tom Wheeler, who served during the Obama administration, told UPI Carr is bringing the commission into \"uncharted territory.\"\n\n\"The FCC is approaching 100 years old,\" Wheeler said. \"Over that period, one of its primary purposes has been to make sure when it comes to broadcasters using the people's airwaves that there is a diversity of voices and a diversity of ownership.\"\n\n\"That's something that has held true until today, when we see the chairman of the FCC attempting to influence what people hear and we hear the president of the United States saying that he wants to consider yanking the broadcast licenses for those who don't agree with him,\" he continued.\n\nOne of the FCC's chief responsibilities is licensing. It is responsible for ensuring that licenses are distributed and used in the public's interest, convenience and necessity. The statute does not go on to define what public interest means, leaving it up to the heads of the FCC to determine this over the years.\n\nThroughout its history, according to Wheeler, FCC chairmen have taken seriously the importance of fulfilling their duties in a neutral and independent way.\n\nThe FCC operations manual refers to Section 326 of the Communications Act and the First Amendment, stating that both \"expressly prohibit the commission from censoring broadcast matter. Our role in overseeing program content is very limited.\"\n\n\"Those are pretty explicit,\" Wheeler said of the First Amendment and Section 326. \"The public interest definition ought to presumably fall within the four corners of those kinds of descriptions.\"\n\nThe FCC's role in overseeing content may be limited, as its manual acknowledges, but it still has influence.\n\nNetworks are required to renew their licenses every eight years. This applies to all networks, including major networks like ABC and local companies.\n\nThe FCC must also approve the transfer of licenses when companies merge. For example, when Disney bought ABC, the ownership of its licenses needed to reflect this transfer of ownership. This is also true for companies like Sinclair and Nexstar purchasing local networks.\n\nNexstar has an agreement in place to purchase Tegna for $6.2 billion. If the deal is approved, Nexstar would own 265 stations in 44 states and the District of Columbia, including 132 of the top 210 TV markets in the country, expanding its reach to 80% of U.S. households.\n\nThe FCC has a 39% cap on how many households a network group can reach. It is called the National Television Ownership rule and its purpose is to maintain diversity, competition and localism by preventing a small number of companies from controlling the airwaves.\n\nIn June, the FCC Media Bureau filed a public notice that it seeks new public comments to refresh the record on television network ownership rules. It is looking for input on whether it should retain, modify or eliminate the 39% cap on network ownership. It last did this in 2017.\n\n\"The FCC has an economic lever over those that it regulates,\" Wheeler said. \"There's economic leverage that Brendan Carr has been very successful in playing up.\"\n\nNexstar owns 32 ABC affiliate networks and Sinclair owns more than 30. Both announced Tuesday that they will not air Jimmy Kimmel Live! despite ABC electing to bring it back.\n\nThe licenses held by networks permit them to use the public's airwaves to broadcast content. It does not give them ownership of those airwaves. They belong to the public.\n\nThe licensing renewal process is usually straightforward and without much controversy, Gigi Sohn, Benton Institute senior fellow and public advocate, told UPI.\n\n\"Throughout almost the entire history of the FCC there has been one time and one time only that the FCC has denied a license renewal based on the content of programming,\" Sohn said. \"That was in the '60s when a Mississippi radio and TV station refused to run any news program or any program of any kind about the Civil Rights movement and instead ran racist programming.\"\n\nSohn added that the FCC, in that instance, did not tell the station it could not run one program and had to run another or had to change how it edited its programs. Instead, it determined the station was not serving the public interest because it was not giving its audience access to all the information related to the stories it was broadcasting.\n\n\"That is something that the FCC has the right to do when it looks at the overall programming of a broadcaster,\" Sohn said. \"What it doesn't have the right to do is bully a network -- into dropping one program because he made a joke about, not even about the president, not about Charlie Kirk, but about the way the president's followers were reacting to the Kirk murder.\"\n\nAfter Jimmy Kimmel's comments on his late-night show about the late Charlie Kirk, the FCC chairman threatened to take action against ABC and parent company Disney. Media companies Nexstar and Sinclair quickly followed with statements that were critical of Kimmel's comments.\n\nWithin hours of Carr's threats, ABC announced Jimmy Kimmel Live! would be preempted indefinitely.\n\nAccording to Sohn and Wheeler, Carr wielded his regulatory power in this instance to influence ABC to remove Kimmel's show from the airwaves due to his longtime criticism of the president. They add that it is not the first time Carr has done something like this since becoming chairman earlier this year.\n\nA pending merger between Skydance and Paramount remained under scrutiny by Carr and the FCC for months before being approved in July. During the hold up, Carr investigated CBS News over its editorial decisions.\n\nTrump meanwhile had an open lawsuit against CBS, seeking $20 billion over allegations that 60 Minutes edited an interview with former presidential candidate Kamala Harris in a way that was favorable to her and her candidacy. On July 2, it was reported that Paramount Global, the parent company of CBS, settled with Trump for $16 million.\n\nThe FCC approved the Skydance-Paramount merger on July 24. As conditions of the merger, Skydance agreed to Carr's demands that the company will end or not establish any diversity, equity and inclusion policies.\n\nIt also agreed to hire an ombudsman to oversee CBS News editorial decisions. The ombudsman, Kenneth Weinstein, is the former president and CEO of conservative think tank the Hudson Institute.\n\nHarold Feld, senior vice president of Public Knowledge, told UPI a bad precedent is being set by networks like ABC and CBS as they give into pressure from the FCC and the president.\n\n\"Not only does it show the administration that these guys are going to cave and therefore we can keep pushing them, but it also means we won't get coverage when the administration does this to other companies,\" Feld said. \"If the news has been cowed into submission it means the administration is free to do this to anyone and nobody will find out about it.\"\n\nFormer FCC Commissioner Anna M. Gomez issued a statement after the suspension of Kimmel's program was reinstated.\n\n\"As this FCC considers steps that would let the same billion-dollar media conglomerates that caved in to government pressure grow even bigger, we must combat these efforts to stifle free expression,\" Gomez said.","summary":"The FCC is prohibited from influencing network content but Chairman Brendan Carr and President Donald Trump have used pressure campaigns to test those limits.","url":"https://www.upi.com/Top_News/US/2025/09/24/fcc-broadcast-free-speech-jimmy-kimmel/1781758720767/","image":"https://cdnph.upi.com/sv/ph/og/upi/1781758720767/2025/1/a961777102e737354b8179cfb204d102/v1.5/Trump-Carr-push-boundaries-of-broadcast-law-FCC-authority.jpg","video":null,"publish_date":"2025-09-24 14:17:08","author":"Joe Fisher","authors":["Joe Fisher"],"language":"en","source_country":"US","sentiment":0.09},{"id":363128810,"title":"What was once Trump’s greatest asset is now one of his worst weaknesses: poll","text":"During the United States' 2024 presidential race, Democratic nominee Kamala Harris warned that if Donald Trump won the election and followed through on the steep tariffs he was proposing, Americans could look forward to much higher prices. Yet it was Trump who, according to polls, had the advantage on inflation, hammering Harris and then-President Joe Biden relentlessly on that issue. And it was enough of an advantage for Trump to narrowly win the popular vote by roughly 1.5 percent.\n\nMany polls cited the economy as a top reason why a small majority of voters favored Trump over Harris in the end. But now, eight months into his second presidency, Associated Press (AP) polling is showing that what was once Trump's greatest advantage — the economy — is now a major weakness.\n\nAssociated Press (AP) reporter Linley Sanders, in an article published on September 24, explains, \"Once strengthened by economic issues, Trump's approval is now relatively low on the economy — and he's leaning on his stronger issues of crime, border security and immigration. Concerns about the economy and immigration helped propel him to the White House, but polling over the past year shows that Americans' faith in the Republican president's handling of the economy is low — particularly among independents — and his approval on immigration has fallen slightly.\"\n\nSanders continues, \"Now, Trump's strongest issues are border security and crime, but there were signs of potential weakness on crime in the most recent poll from The Associated Press-NORC Center for Public Affairs Research.\"\n\nAccording to AP/NORC, only 37 percent of Americans approve of Trump's handling of the economy. And Trump fares slightly worse on his handling of health care, with 35 percent approval.\n\nHowever, Trump enjoys 55 percent approval on border security, according to AP/NORC found that. And his overall approval, AP/NORC finds, is 39 percent.","summary":"During the United States' 2024 presidential race, Democratic nominee Kamala Harris warned that if Donald Trump won the election and followed through on the steep tariffs he was proposing, Americans could look forward to much higher prices. Yet it was Trump who, according to polls, had the advantage on inflation, hammering Harris and then-President Joe Biden relentlessly on that issue. And it was enough of an advantage for Trump to narrowly win the popular vote by roughly 1.5 percent.\n\nMany polls cited the economy as a top reason why a small majority of voters favored Trump over Harris in the end. But now, eight months into his second presidency, Associated Press (AP) polling is showing that what was once Trump's greatest advantage — the economy — is now a major weakness.\n\nAssociated Press (AP) reporter Linley Sanders, in an article published on September 24, explains, \"Once strengthened by economic issues, Trump's approval is now relatively low on the economy — and he's leaning on his stronger issues of crime","url":"https://www.alternet.org/trump-ap-poll-economy/","image":"https://www.alternet.org/media-library/u-s-president-donald-trump-speaks-with-u-s-secretary-of-the-treasury-scott-bessent-in-the-oval-office-at-the-white-house-in.jpg?id=61643503&width=1200&height=600&coordinates=0%2C438%2C0%2C438","video":null,"publish_date":"2025-09-24 14:00:54","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":-0.041},{"id":363120302,"title":"Kimmel’s Returning Monologue Is His Most-Viewed On YouTube In Nearly One Year—Since Election Show","text":"Late-night host Jimmy Kimmel is quickly earning record viewership for his anticipated first monologue since ABC reinstated his show, racking up more than 8.8 million views in 9 hours, possibly boosted by nearly a third of ABC stations refusing to broadcast his return.\n\nJimmy Kimmel returned to the air Tuesday night following his suspension by ABC. (Photo by Randy Holmes/Disney via Getty Images)\nDisney via Getty Images\n\nTitled “Jimmy Kimmel Is Back,” the host returned with a nearly 30-minute monologue in which he clarified his remarks about the killing of conservative activist Charlie Kirk, and took aim at President Donald Trump and the FCC.\n\nKimmel’s monologue has 8.8 million views as of Wednesday morning, his most-watched video on YouTube since November 2024 when he delivered a monologue addressing Trump’s election victory, which garnered 9.1 million views.\n\nKimmel’s latest monologue may be earning more viewership than usual on YouTube because broadcasting companies Nexstar and Sinclair, which own nearly a third of all ABC stations nationwide, refused to air Kimmel’s return.\n\nIn his monologue, Kimmel acknowledged many major markets wouldn’t air his show, including Washington, D.C., Nashville, New Orleans and St. Louis, where he said his wife’s family would be obstructed from watching the show.\n\n“Sorry Aunt Sharon, sorry Aunt Maureen, you’ll have to go to YouTube, I guess,” Kimmel joked.\n\nWhat Did Kimmel Say In His Monologue?\n\nKimmel said Tuesday night it was “never my intention to make light of the murder of a young man…I don’t think there’s anything funny about it,” stating he doesn’t think “the murderer who shot Charlie Kirk represents anyone; this is a sick person who believed violence is a solution, and it isn’t ever.” Kimmel’s comments come a week after he accused the “MAGA gang” of “desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them” and trying to score political points from Kirk’s death. Also on Tuesday, Kimmel said the United States has “become so authoritarian,” joking even German television offered him a job. Kimmel slammed FCC Chairman Brendan Carr for “telling an American company we can do this the easy way or the hard way,” calling his threat a “direct violation of the First Amendment” and slamming Carr as “the most embarrassing car Republicans have embraced since” Tesla’s Cybertruck. Kimmel also jabbed Trump for doing “his best to cancel me,” joking Trump “forced millions of people to watch the show. That backfired bigly. He might have to release the Epstein files to distract us from this now.” After Kimmel’s show was taped, Trump raged about his return on Truth Social, threatening to sue ABC.\n\nWhy Wasn’t Kimmel Broadcast Everywhere On Tuesday?\n\nEarlier this week, two major television station operators, Nexstar and Sinclair, said they would stand by decisions they made last week to pre-empt Kimmel’s show, refusing to air it after Kimmel sparked controversy for comments he had made about Kirk on his show. Nexstar—which is seeking FCC approval for its acquisition of broadcast company TEGNA—said in a statement Tuesday it would not air Kimmel “pending assurance that all parties are committed to fostering an environment of respectful, constructive dialogue in the markets we serve.” On Monday, Sinclair said it would not air Kimmel while it engaged in talks with ABC to “evaluate the show’s potential return.” ABC had announced Monday it would bring back Kimmel’s show, days after his suspension sparked outrage from Hollywood and drew allegations of free speech suppression. Kimmel’s suspension was celebrated by Carr and Trump.\n\nFellow late-night host Stephen Colbert similarly faced a spike in YouTube views when he delivered his first monologue since CBS announced his late-night show would be cancelled. The monologue earned 11 million views, marking Colbert’s most-watched video on YouTube in six years. Colbert said on his show the “gloves are off” when it comes to covering Trump, whom he told to “go f— yourself.” CBS cited financial reasons for Colbert’s cancellation, though critics noted his show was axed after CBS settled a lawsuit with Trump, who had sued over what he alleged was a deceptively edited interview with his election opponent, former Vice President Kamala Harris. At the time, Paramount, CBS’ parent company, was seeking FCC approval for its merger with Skydance.\n\nFurther Reading\n\nJimmy Kimmel Calls Out FCC Chair And Trump As He Returns To ABC (Forbes)\n\nTrump Calls Jimmy Kimmel ‘Arm Of The DNC’—Signals He May Sue ABC As Comedian Returns To Air (Forbes)\n\nStephen Colbert’s Cancellation Monologue Nears 10 Million On YouTube—His Most-Watched Video In 6 Years (Forbes)\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Jimmy Kimmel’s YouTube numbers may have spiked because nearly one-third of ABC stations, those owned by Nexstar and Sinclair, refused to air his return.","url":"https://www.forbes.com/sites/conormurray/2025/09/24/kimmels-returning-monologue-is-his-most-viewed-on-youtube-in-nearly-one-year-since-election-show/","image":"https://imageio.forbes.com/specials-images/imageserve/68d3f862771131b33ecbab38/0x0.jpg?format=jpg&crop=1123,631,x137,y42,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-09-24 13:56:47","author":"Conor Murray,Forbes Staff,Randy Holmes","authors":["Conor Murray","Forbes Staff","Randy Holmes"],"language":"en","source_country":"US","sentiment":-0.247},{"id":363118892,"title":"Kamala Harris called out for 'laughable' deflection on 2024 election: 'Disastrous'","text":"to top close Video This video is playing in picture-in-picture.\n\nFox And Friends September 24, 2025 06:08 \n\n Kamala Harris called out for 'laughable' deflection on 2024 election: 'Disastrous' \n Arkansas Gov. Sarah Huckabee Sanders joined 'Fox & Friends' to discuss Kamala Harris' reflection of the 2024 presidential election, why she believes she ultimately failed on the campaign trail and teens restoring a Charlie Kirk memorial.\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRFOX & FRIENDSPERSONALITIESV-VIDEOPOLITICSKAMALA HARRIS","summary":"Arkansas Gov. Sarah Huckabee Sanders joined &apos;Fox &amp; Friends&apos; to discuss Kamala Harris&apos; reflection of the 2024 presidential election, why she believes she ultimately failed on the campaign trail and teens restoring a Charlie Kirk memorial.","url":"https://www.foxnews.com/video/6380040248112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a2ba4d6d-75ca-48e0-aec0-ccc4b122c0f4/0b774d06-9d56-42e3-a01b-2377bacb8926/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-24 13:48:17","author":null,"language":"en","source_country":"us","sentiment":0.085},{"id":363180674,"title":"Jimmy Kimmel defends free speech as he returns to late-night television from suspension","text":"LOS ANGELES, (Reuters) – Jimmy Kimmel returned to U.S. late-night television last night defending political satire against Trump administration “bullying”, six days after his on-air remarks about the murder of right-wing activist Charlie Kirk led Walt Disney DIS.N to suspend his show.\n\nDisney’s decision to cut short Kimmel’s exile for comments it initially labeled as “ill-timed” and “insensitive” marked a high-profile act of corporate defiance in the face of Trump’s escalating crackdown on perceived enemies in the media through litigation and regulatory threats.\n\nStill, in his first night back on air in nearly a week, Kimmel jockeyed between his usual brand of wry wit and a more sober, sensitive tone addressing the uproar his earlier commentary had unleashed.\n\n“It was never my intention to make light of the murder of a young man. I don’t think there’s anything funny about it,” the “Jimmy Kimmel Live!” host told viewers, his voice choking with emotion, moments after taking the stage to a standing ovation.\n\n“Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual – that was really the opposite of the point I was trying to make,” Kimmel, 57, added.\n\nDisney, parent company of the ABC network that airs his show, halted its production on September 17, two days after Kimmel said in his opening monologue that President Donald Trump’s supporters were eager to characterize Kirk’s accused assassin “as anything other than one of them” and accused them of trying to “score political points” from his killing.\n\nThe Trump administration and many of its supporters voiced outrage at Kimmel’s comments, which came five days after Kirk, a close Trump ally and radio-podcast host, was shot dead while speaking on the campus of Utah Valley University in Orem, Utah.\n\nIn response to Kimmel’s remarks, Federal Communications Commission Chairman Brendan Carr had threatened an investigation and urged television stations to drop Kimmel’s show or face possible fines and revocation of their broadcast licenses.\n\n“We can do this the easy way or the hard way,” Carr said then.\n\nA short time later, Disney announced its immediate, indefinite suspension of Kimmel, sparking a backlash that ultimately grew to include several prominent conservatives who joined Democrats in condemning the FCC for what they branded as attempts at government censorship.\n\n“I want to thank the people who don’t support my show and what I believe but support my right to share those beliefs anyway,” Kimmel said yesteday, name-checking such luminaries of the political right as commentators Ben Shapiro and Candace Owens, as well as U.S. Republican Senators Mitch McConnell of Kentucky and Ted Cruz of Texas.\n\n“I don’t think I’ve ever said this before, but Ted Cruz is right,” Kimmel said to laughs.\n\nDisney also faced pressure from consumers protesting Kimmel’s suspension by canceling their subscriptions to the Disney+ streaming channel.\n\nKimmel joked during the broadcast that Disney only imposed one condition for his return – then pulled a piece of paper from his pocket to read a statement asking viewers to renew their Disney+ service.\n\nEven though Disney has now brought Kimmel back to ABC’s lineup, the two largest television station groups of ABC local affiliates – Nexstar Media Group NXST.O and Sinclair SBGI.O – were still boycotting his show.\n\nBefore Tuesday’s broadcast, Trump opined on his Truth Social online platform that he “can’t believe” ABC gave Kimmel back his show, and hinted at further action against the network.\n\n“Why would they want someone back who does so poorly, who’s not funny, and who puts the Network in jeopardy by playing 99% positive Democrat GARBAGE,” Trump wrote.\n\n“He is yet another arm of the DNC (Democratic National Committee) and, to the best of my knowledge, that would be a major illegal Campaign Contribution. I think we’re going to test ABC out on this.”\n\nKimmel, a four-time Oscars host, said Trump was not just after comedians he disliked, but also journalists, saying of the Republican president: “He’s suing them, he’s bullying them.”\n\nABC News agreed to donate $15 million to Trump’s presidential library to settle a lawsuit over comments anchor George Stephanopoulos made about the civil case brought against the president by writer E. Jean Carroll.\n\nAnd Paramount Global paid $16 million in July to settle a lawsuit filed by Trump claiming that the CBS News program “60 Minutes” deceptively edited an interview with former Vice President Kamala Harris that the network broadcast in October.\n\nThe same month, Paramount announced it was canceling “The Late Show” hosted by comedian Stephen Colbert on CBS. The network said it was a business decision but critics widely saw it as part of a move to please Trump.\n\n“I know that’s not as interesting as muzzling a comedian, but it’s so important to have a free press, and it is nuts we’re not paying more attention to it,” Kimmel said.\n\nDispelling any notion he might pull his punches when it came to lampooning Trump on Tuesday, Kimmel opened the show quipping, “I’m not sure who had a weirder 48 hours – me or the CEO of Tylenol,” a reference to Trump’s announcement that linked autism to the use of the popular pain medication by women when they’re pregnant.\n\n“Follow the advice of Donald Trump, and you too can look like a glazed ham with deep vein thrombosis,” Kimmel joked. “This is Tylenol. We’re talking about the thing that you take when they won’t let you take anything that works.”\n\nNear the end of his monologue, Kimmel returned to the subject that got him briefly banished from late night TV, saying that he was “deeply” moved by the forgiveness Kirk’s widow, Erika Kirk, has voiced for her husband’s 22-year-old accused killer, an expression the host called “a selfless act of grace.”\n\n“And if there’s anything we should take from this tragedy to carry forward, I hope it can be that,” he said, his eyes again welling with tears.","summary":"LOS ANGELES,  (Reuters) &#8211; Jimmy Kimmel returned to U.S. late-night television last night  defending political satire against Trump administration &#8220;bullying&#8221;, six days after his on-air remarks about the murder of right-wing activist Charlie Kirk led Walt Disney DIS.N \n\n\nThe article Jimmy Kimmel defends free speech as he returns to late-night television from suspension appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/09/24/news/world/jimmy-kimmel-defends-free-speech-as-he-returns-to-late-night-television-from-suspension/","image":"https://s1.stabroeknews.com/images/2025/09/kimmel.jpg","video":null,"publish_date":"2025-09-24 13:43:41","author":"Staff Editor","authors":["Staff Editor"],"language":"en","source_country":"gy","sentiment":-0.065},{"id":363109410,"title":"President Trump Calls Out the UN","text":"Back to Videos\n\n RCP Podcast: Trump Calls Out UN, Kamala's Book Tour, Talk to Someone You Disagree With In Memory of Charlie Kirk\n\n | \n\nPosted By RCP RadioOn Date September 23, 2025\n\nTuesday on the RealClearPolitics radio show, Tom Bevan, Carl Cannon, and Andrew Walworth discuss President Trump's speech today at the 80th General Assembly of the United Nations in New York, and Kamala Harris hitting cable news for the book tour for her 2024 campaign memoir, \"107 Days.\" Plus, they discuss Jimmy Kimmel returning to the air tonight on ABC. Is that a victory for free speech, or was the whole affair a waste of time? \n\nLater, RCP columnist Melinda Henneberger joins the gang to discuss her reaction to Charlie Kirk's memorial service and her op-ed: \"Let\u0019s Respond To Kirk\u0019s Murder By Listening As Well As Speaking\"\n\nYou can listen to the show weeknights at 6:00 p.m. on SiriusXM's POTUS Channel 124 and then on Apple, Spotify, YouTube, and here on our website.\n\nThe show opened with President Trump's speech this morning to the United Nations General Assembly, where he delivered the \"MAGA\" message on issues of war and peace, immigration, and more. \n\n\"There were really two speeches,\" Carl Cannon commented. \"The first was the jingoistic speech written for him, and then there was the riffing, where he starts talking about his familiar things -- tariffs, how he deserves seven Nobel Peace Prizes. But he had a pointed message that allowing unlimited migration is wrecking Europe's heritage.\"\n\n\"My impression was that people in that room, as opposed to the last time he spoke there, were not laughing at him \u0014 they were laughing with him. And that may be in part because they fear him now in a way that they didn\u0019t, and they understand that they have to deal with him,\" Andrew Walworth commented. \n\nAfter that, starting at minute 10, the 2024 campaign memoir from Kamala Harris is finally published, and she's hit MSNBC, \"The View,\" and more on her book tour. Is she going to be able to position herself to run again or is this her final round? \n\n\"Democrats are not happy with this book,\" Tom Bevan said. \"I guess she\u0019s just trying to make some money and stay in the conversation, and it looks like, you know, she wants to run in 2028, or at least she wants to have the option to run in 2028 if she so desires.\"\n\n\"Saying 'I want to be part of the conversation' is pretty directly saying, I\u0019m not going away; I\u0019m gonna run again for something. That\u0019s what I took from it,\" Cannon said. \"In this book and the interviews, she thinks she was loyal to Joe Biden, but that Joe Biden and Jill Biden and the Biden family and the Biden inner circle were not loyal to her.\"\n\nNext, starting at minute 20:30, Jimmy Kimmel is returning to the air tonight on ABC after a five-day suspension. Some say this is a victory for free speech, others say ABC has just caved in to pressure, or was the whole affair a waste of time? \n\n\"He wasn\u0019t celebrating Charlie Kirk\u0019s death like some of these other wackos have done,\" Bevan said. \"I hate using the word martyr -- because Charlie Kirk actually was martyred -- but I don\u0019t think Jimmy Kimmel deserves that. This made him this sort of poster boy for free speech, which he didn\u0019t deserve to be, quite frankly.\"\n\nFinally, at minute 29, RCP columnist Melinda Henneberger joins the gang to discuss her reaction to Charlie Kirk's memorial service and her op-ed: \"Let\u0019s Respond To Kirk\u0019s Murder By Listening As Well As Speaking\"\n\n\"After Kirk\u0019s death, a very smart, kind-hearted person of goodwill, an editor I used to work with at the New York Times, told me that she had never heard of Kirk before his death. And that really bothered her a lot, as it should. And so I thought, wow, man, we really need to get out of our silos,\" Henneberger explained. \"We\u0019re getting trapped in there by our, you know, by these social media algorithms. And so we have to climb out in real life and not just talk to people who feel differently, but listen to them.\"\n\n\"Even worse than that, with the information silos we live in, people on the left who did know of Charlie Kirk got this distorted view of him because the things that they were reading,\" Tom Bevan added. \"They knew about him, but they knew about him in a vastly distorted way. And that\u0019s one of the things that helped contribute to his death, I think, ultimately.\"\n\n\"It would be interesting to know, wouldn\u0019t it, how Tyler Robinson knew about him,\" Henneberger said. \"I\u0019m constantly surprised at the broad-brush assumptions that people make about people in the other tribe that really are not right.\"\n\nDon\u0019t miss a single episode of the RealClearPolitics weeknight radio show \u0013 subscribe at Apple, Spotify, or wherever you listen to podcasts.\n\n Recommended\n\n \n\n President Trump: \"What Is The Purpose Of The United Nations?\" \"Not Even Close To Living Up To Its Potential\"\n\n September 23, 2025\n\n President Trump asked the United Nations why it exists, at his speech to the 80th annual General Assembly on Tuesday. \n\nHe said during negotiations to end wars in Africa and the Middle East, \"the United Nations wasn\u0019t there for us\"\n\n\"That being the case, what is the purpose of the United...\n \n Donald TrumpUnited NationsdiplomacyTrump foreign policy","summary":"Tuesday on the RealClearPolitics radio show, Tom Bevan, Carl Cannon, and Andrew Walworth discuss President Trump's speech today at the 80th General Assembly of the United Nations in New York, and Kamala Harris hitting cable news for the book tour for her 2024 campaign memoir, &quot;107 Days.&quot; Plus, they discuss Jimmy Kimmel returning to the air tonight on ABC. Is that a victory for free speech, or was the whole affair a waste of time?","url":"https://www.realclearpolitics.com/video/2025/09/23/rcp_podcast_trump_calls_out_un_kamalas_book_tour_talk_to_someone_you_disagree_with_in_memory_of_charlie_kirk.html","image":"https://assets.realclear.com/images/69/697820_5_.jpg","video":null,"publish_date":"2025-09-24 13:18:41","author":"Bevan,Cannon & Walworth,RCP on SiriusXM,Rcp Radio","authors":["Bevan","Cannon & Walworth","RCP on SiriusXM","Rcp Radio"],"language":"en","category":"politics","source_country":"US","sentiment":-0.129},{"id":363138494,"title":"Sanders urged Harris to focus 'on the working class, not just on abortion,' book reveals","text":"Left-wing Vermont Sen. Bernie Sanders reportedly urged then-Vice President Kamala Harris to focus on the \"working class\" instead of abortion as she took the mantle of the Democratic Party during the unprecedented 2024 election cycle, according to Harris' highly anticipated book, \"107 Days.\" \"I supported Joe because he was the strongest voice for the working class. Please focus on the working class, not just on abortion,\" Sanders told Harris, according to her notes of their conversation following then-President Joe Biden dropping out of the race July 21, 2024. Sanders was among a lengthy list of top Democrats, including former President Barack Obama and former Speaker of the House Nancy Pelosi, who initially resisted endorsing Harris immediately after Biden dropped out, instead offering her advice to focus on the working class. Harris ultimately lost all seven of the battleground states to President Donald Trump at the ballot box Nov. 4, 2024, with Democrats, media pundits and others offering a handful of reasons explaining the loss, with many pointing to how the party embraced left-wing policies such as transgender issues in children and sports versus supporting the working and middle class. BERNIE SANDERS CALLS OUT KAMALA HARRIS' CAMPAIGN FOR BEING 'HEAVILY INFLUENCED BY WEALTHY PEOPLE' \"It should come as no great surprise that a Democratic Party which has abandoned working class people would find that the working class has abandoned them. While the Democratic leadership defends the status quo, the American people are angry and want change,\" Sanders posted to X in November 2024, accompanied by a press release on the election results. \"And they’re right.\" Other top pundits, including James Carville, have said the party \"betrayed\" working-class voters in favor of building a \"too-cool-for-school group\" that bled White male voters, while party leaders in 2025 have returned to the drawing board to map out how to attract White male votes who threw their votes to Trump. REPUBLICAN PARTY HAS 'CAPTURED' THE WORKING-CLASS VOTE FOR THE FORESEEABLE FUTURE, SAYS FORMER TRUMP ADMINISTRATION OFFICIAL During the campaign cycle, Harris did focus a handful of events and speeches on abortion, and also came under fire for mocking pro-life protesters at an event in Wisconsin just hours before she skipped the Al Smith Catholic charity dinner that same day. CARVILLE SAYS DEMS 'BETRAYED' WORKING-CLASS VOTERS BY NOT INCLUDING THEM IN 'TOO-COOL-FOR-SCHOOL' COALITION The Vermont senator ultimately endorsed Harris July 27, 2024 — just days after Biden dropped out — and declared on X that \"We must defeat Trump, elect VP @KamalaHarris, and create a government that works for all, not just the 1%.\" Harris continued in her book that postmortem data on the election cycle found voters, most notably the youth, did not cast votes based on abortion, the war in Israel or climate change, but for economic reasons, bolstering Sanders' initial advice that she focus her attention on the working class. \"Polling revealed that many of these young voters didn’t feel they knew me. And contrary to some predictions, they did not vote primarily on reproductive rights, or Gaza, or climate change,\" she wrote in her book. \"They voted on their perceived economic interests. In a postelection study conducted by Tufts University, 40 percent put the economy and jobs as their top issue.\" The former vice president released her highly anticipated memoir Tuesday, which will be followed by her launching of a book tour in cities across the nation, and in London, in the coming weeks. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to Sanders' office for comment Tuesday morning but did not immediately receive a reply.","summary":"Sen. Bernie Sanders reportedly told former Vice President Kamala Harris to focus on the working class instead of abortion when she sought his endorsement after Biden dropped out, her book reveals.","url":"https://www.foxnews.com/politics/sanders-urged-harris-focus-on-working-class-not-just-abortion-book-reveals","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/sanders-kamala-harris.png","video":"https://www.foxnews.com/video/6364358550112","publish_date":"2025-09-24 13:16:24","author":"Emma Colton","authors":["Emma Colton"],"language":"en","source_country":"us","sentiment":-0.181},{"id":363109408,"title":"Kamala Harris' Book Tour a Car Crash for Woke Left","text":"Leave it to Kamala Harris to blame Donald Trump for her decision to deny a job to a gay man. Yes, it might be surprising to use the word \u001chomophobic\u001d to describe America\u0019s first black/South Asian/female vice-president, a Californian who grew up surrounded by extreme progressivism, with a strong claim to being the wokest candidate ever to have had a shot at reaching the White House. But what else do you call it when Harris effectively admits that she refused to choose Pete Buttigieg, the former US transport secretary, as her running mate because he is gay?\n\nRead Full Article �","summary":"Leave it to Kamala Harris to blame Donald Trump for her decision to deny a job to a gay man. Yes, it might be surprising to use the word &quot;homophobic&quot; to describe America's first black/South Asian/female vice-president, a Californian who grew up surrounded by extreme progressivism, with a strong claim to being the wokest candidate ever to have had a shot at reaching the White House. But what else do you call it when Harris effectively admits that she refused to choose Pete Buttigieg, the former US transport secretary, as her running mate because he is gay?","url":"https://www.realclearpolitics.com/2025/09/24/kamala_harrisrsquo_book_tour_a_car_crash_for_woke_left_654041.html","image":"https://assets.realclear.com/images/69/696745_5_.jpeg","video":null,"publish_date":"2025-09-24 13:11:57","author":"David Kaufman,The Telegraph","authors":["David Kaufman","The Telegraph"],"language":"en","source_country":"US","sentiment":-0.24},{"id":363187108,"title":"Kamala Harris brands Trump a 'con man' after revealing surprising comments he made to her in private","text":"Kamala Harris hasn't held back in her new political memoir.\n\nHarris was Joe Biden's successor when he withdrew his presidential candidacy in June 2024 and she became Donald Trump's key opponent.\n\nIt was a close race between the pair but ultimately it was Trump who proved successful. He won the national popular vote with a plurality of 49.8 percent.\n\nDuring their respective campaigns, Harris and Trump wasted no time in slating each other in public. At one stage, the now-president said his competitor was 'mentally impaired'.\n\nAnd the slinging match between the pair didn't stop once Trump won and Harris has made a series of comments about the 79-year-old in her new memoir 107 Days.\n\nIn the book, which hit shelves yesterday (September 23), Harris recounted a conversation she had with Trump after the second assassination attempt against him.\n\nRyan Routh has been found guilty of plotting to kill the president. Routh had pleaded not guilty to the charges he was facing, but it took the jury just 2.5 hours of deliberation to convict him of all five of them; one being attempted assassination of a major presidential candidate.\n\nHe may now face life behind bars and will be sentenced on December 18, says BBC News.\n\nHarris and Trump spoke on the phone after the September 2024 incident and, while Trump made some brutal remarks about Harris in public, he seemingly had nothing but nice things to say to her in private.\n\nHe allegedly said: \"How do I say bad things about you now? I'm going to tone it down. I will. You're going to see.\"\n\nTrump also said that his daughter Ivanka was a 'big fan' of Harris' — but the former vice president didn't buy into his sweet talking.\n\n\"He’s a con man. He’s really good at it,\" Harris penned, per The Guardian.\n\nElsewhere in the book, she takes aim at Biden and branded his decision to run for a second term as 'reckless'.\n\nDiscussing the fact she didn't advise Biden not to run again, Harris wrote: \"Was it grace, or was it recklessness? In retrospect, I think it was recklessness.\"\n\nShe continued: \"The stakes were simply too high. This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition. It should have been more than a personal decision.\"","summary":"![CDATA[Kamala Harris has recently published her own political memoir]]","url":"https://www.unilad.com/news/politics/kamala-harris-calls-trump-con-man-782547-20250924","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blt48b9fc4030d1ebb4/68d3ea56c6d25750e434c62d/GettyImages-2212213158.jpg","video":null,"publish_date":"2025-09-24 13:06:17","author":"Niamh Shackleton","authors":["Niamh Shackleton"],"language":"en","source_country":"gb","sentiment":-0.413},{"id":363118846,"title":"Democratic special election win makes life even harder for Republicans on Capitol Hill","text":"In the aftermath of Election Day 2024, the conventional wisdom suggested not only that Republicans had entered an era of electoral dominance, but also that Democratic voters were demoralized, disheartened and prepared to withdraw from civic life for a long while. Following a series of 2025 special elections, those assumptions are quickly unraveling. The latest test came in Arizona, where Democrat Adelita Grijalva won a congressional special election, winning the seat held by her late father. NBC News reported: Once sworn in, Grijalva will be Arizona’s first-ever Latina congresswoman, and she’ll narrow the GOP majority in the U.S. House: Republicans will hold 219 seats to the Democrats’ 214, with two vacancies remaining. Also of interest was the congresswoman-elect’s margin of victory: Last fall, Kamala Harris carried this Tucson-area district by 22 points, but based on the latest vote tallies, Grijalva appears to have won this week’s special election by nearly 40 points. That level of Democratic over-performance, which has been common in elections throughout the country this year, is what should worry Republican officials as much as the defeats. But as Grijalva prepares to take the oath of office on Capitol Hill, there’s another dimension to this that will add to GOP leaders’ headaches. A bipartisan pair of lawmakers — Republican Rep. Thomas Massie of Kentucky and Democratic Rep. Ro Khanna of California — have spearheaded a pending discharge petition to force disclosure of the Jeffrey Epstein files, currently being held back by Donald Trump’s Justice Department. Proponents of the effort are currently one member short of 218 signatures, which would trigger a process House Speaker Mike Johnson would be largely powerless to stop. Grijalva has already said she will gladly sign on to the effort, which would give the discharge petition its 218th signature. It’s possible that one (or more) of the four Republicans who’ve already signed on could be pressured to change their minds, upending the process. But if the signatories follow through, the public should expect a vote in early October, and a victory would send the matter to the Senate. Watch this space. This post updates our related earlier coverage.","summary":"Adelita Grijalva's victory in Arizona narrows the Republicans' majority in the House. It also makes disclosure of the Jeffrey Epstein files more likely.","url":"https://www.msnbc.com/rachel-maddow-show/maddowblog/grijalva-arizona-election-republicans-discharge-petition-epstein-rcna233381","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-09/250924-Adelita-Grijalva-rs-288280.jpg","video":null,"publish_date":"2025-09-24 12:52:19","author":"Steve Benen","authors":["Steve Benen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.126},{"id":363123338,"title":"Super Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island","text":"Super Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island\n\nSuper Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island\n\nLast Updated:September 24, 2025, 23:20 IST Breaking News Videos\n\nSuper Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island\n\n\nGet Latest Updates on Movies, Breaking News On India, World, Live Cricket Scores, And Stock Market Updates. Also Download the News18 App to stay updated!\n\nMore from breaking-newsView More\n\n Project Cheetah: India to bring eight more cheetahs from Botswana, first four to arrive in May Ladakh Unrest: Violence Erupts In Leh As BJP Office Torched During Ladakh Statehood Stir | News18 ‘Angry And Disappointed’: Ex VP Kamala Harris Critical Of Joe Biden In New Book Super Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds Project Cheetah: India to bring eight more cheetahs from Botswana, first four to arrive in May Ladakh Unrest: Violence Erupts In Leh As BJP Office Torched During Ladakh Statehood Stir | News18 ‘Angry And Disappointed’: Ex VP Kamala Harris Critical Of Joe Biden In New Book Super Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds Project Cheetah: India to bring eight more cheetahs from Botswana, first four to arrive in May Ladakh Unrest: Violence Erupts In Leh As BJP Office Torched During Ladakh Statehood Stir | News18 ‘Angry And Disappointed’: Ex VP Kamala Harris Critical Of Joe Biden In New Book \n\nSuper Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island","summary":"Super Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island","url":"https://www.news18.com/videos/breaking-news/super-typhoon-ragasa-14-dead-more-than-100-missing-in-taiwan-after-storm-hits-island-9594236.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/Twitter-Card-VOD-Thumb-5-2025-09-77316543150892d3487009f411dceb43.jpg","video":null,"publish_date":"2025-09-24 12:20:48","author":"News18,Sameer Khan","authors":["News18","Sameer Khan"],"language":"en","category":"politics","source_country":"in","sentiment":-0.577},{"id":363123316,"title":"Super Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds","text":"Super Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds\n\nSuper Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds\n\nLast Updated:September 24, 2025, 23:16 IST Breaking News Videos\n\nSuper Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds\n\n\nGet Latest Updates on Movies, Breaking News On India, World, Live Cricket Scores, And Stock Market Updates. Also Download the News18 App to stay updated!\n\nMore from breaking-newsView More\n\n Project Cheetah: India to bring eight more cheetahs from Botswana, first four to arrive in May Ladakh Unrest: Violence Erupts In Leh As BJP Office Torched During Ladakh Statehood Stir | News18 ‘Angry And Disappointed’: Ex VP Kamala Harris Critical Of Joe Biden In New Book Super Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island Project Cheetah: India to bring eight more cheetahs from Botswana, first four to arrive in May Ladakh Unrest: Violence Erupts In Leh As BJP Office Torched During Ladakh Statehood Stir | News18 ‘Angry And Disappointed’: Ex VP Kamala Harris Critical Of Joe Biden In New Book Super Typhoon Ragasa: 14 dead, more than 100 missing in Taiwan after storm hits island Project Cheetah: India to bring eight more cheetahs from Botswana, first four to arrive in May Ladakh Unrest: Violence Erupts In Leh As BJP Office Torched During Ladakh Statehood Stir | News18 ‘Angry And Disappointed’: Ex VP Kamala Harris Critical Of Joe Biden In New Book \n\nSuper Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds","summary":"Super Typhoon Ragasa kills 15 in Taiwan, hits Hong Kong with fierce winds","url":"https://www.news18.com/videos/breaking-news/super-typhoon-ragasa-kills-15-in-taiwan-hits-hong-kong-with-fierce-winds-9594227.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/Twitter-Card-VOD-Thumb-3-2025-09-9f1565b5cfec22f4923b7e3dc314f2a8.jpg","video":null,"publish_date":"2025-09-24 12:16:43","author":"News18,Sameer Khan","authors":["News18","Sameer Khan"],"language":"en","source_country":"in","sentiment":-0.577},{"id":363090594,"title":"Rahm Emanuel says Harris was wrong to skip Buttigieg as running mate, failed to 'trust in your gut'","text":"Former Chicago Mayor Rahm Emanuel disagreed with former Vice President Kamala Harris’ reasoning for not selecting former Transportation Secretary Pete Buttigieg as her running mate on CNN Tuesday. In Harris’ new book \"107 Days,\" the ex-vice president revealed that Buttigieg was her first choice for running mate ahead of the 2024 presidential election. However, she wrote that the potential pairing was too risky, saying he \"would have been an ideal partner – if I were a straight white man.\" \"But we were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. Part of me wanted to say, ‘Screw it, let’s just do it.’ But knowing what was at stake, it was too big of a risk,\" she added. \"And I think Pete also knew that – to our mutual sadness.\" RAHM EMANUEL ON POTENTIAL 2028 WHITE HOUSE RUN: 'I HAVE SOMETHING I THINK I CAN OFFER' Emanuel acknowledged her \"political\" concerns but took issue with her failing to \"trust in [her] gut\" as his old bosses, former Presidents Barack Obama and Bill Clinton, did. \"They all have pluses,\" Emanuel said on CNN's \"The Arena.\" \"They all have minuses. If it was 100% here and everybody else was 80, that’s a computer. This is a judgment call. This is a call about who are you comfortable when you are having, and there are going to be plenty of those cabinet meetings…Who‘s the one person who you can totally trust as copilot? And even though you‘re angry and frustrated, you respect their opinion enough and their judgment enough to keep talking at you and to you.\" HARRIS TELLS 'THE VIEW' SHE 'DIDN’T HAVE ENOUGH TIME’ TO WIN 2024 PRESIDENTIAL RACE He continued, \"To me, she was right about the political pieces, but she was wrong about the biggest question that comes to picking a vice president. And that is what I call the cabinet room test. You‘re going to walk from the cabinet 50 feet, 25 feet into the Oval Office, and you want to be alone, but you trust the judgment of your copilot enough that you let them talk to you and talk with you and keep a conversation going that you really want it to end and throw things at the wall about.\" Fox News Digital reached out to Harris’ office for comment. KAMALA HARRIS BREAKS SILENCE ON BIDEN DROPOUT, ADMITS SHE HAS REGRETS ABOUT HER HANDLING OF SITUATION On MSNBC’s \"The Rachel Maddow Show\" Monday night, Harris insisted that she did not reject Buttigieg because he was gay but reiterated that it would have been a \"risk\" to pick him. CLICK HERE TO GET THE FOX NEWS APP \"My point is, as I write in the book, is that, I was clear that in 107 days, in one of the most hotly contested elections for President of the United States against someone like Donald Trump, who knows no floor, to be a Black woman running for President of the United States, and as a vice presidential running mate, a gay man. With the stakes being so high, it made me very sad. But I also realized it would be a real risk,\" Harris said.","summary":"Former Chicago mayor Rahm Emanuel disagreed with former Vice President Kamala Harris’ reasons for not selecting Pete Buttigieg as running mate in the 2024 election.","url":"https://www.foxnews.com/media/rahm-emanuel-says-harris-wrong-skip-buttigieg-running-mate-failed-trust-your-gut","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/kamala-harris-book-107-days.jpg","video":"https://www.foxnews.com/video/6380013821112","publish_date":"2025-09-24 12:05:54","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"US","sentiment":-0.217}]}