{"offset":0,"number":50,"available":463,"news":[{"id":311540650,"title":"I went inside AOC & Bernie Sanders’ ‘Fighting Oligarchy’ tour — here’s what the right should know","text":"One gets the sense that the circus doesn’t stop in Boise much — at least not the political kind.\n\nOn Monday night, an estimated 12,500 people — mostly retired Boomers, with a smattering of Gen X and Gen Z — packed in an arena in Nampa, Idaho, a 30-minute drive from the Gem State capital. They were there for the latest stop on Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez’s “Fighting Oligarchy” tour.\n\nSanders did speak here in 2016. But “Fighting Oligarchy” is a new beast — progressive Democrats zagging into what is mostly Republican territory. On Sunday, the two were in Salt Lake City, and Missoula, Montana, is on tap for Wednesday.\n\nGeri Lynn Green, who owns a salon in downtown Boise, said “a chance to be with Bernie and AOC is a once in a lifetime thing. Especially for Idaho.” She choked up talking about the Vermont senator.\n\nCollege student Charlotte Konkol, who came with her grandparents, was giddy to see her oft-ignored hometown embraced by her favorite politicians. “Boise is such a little blue dot and we get overlooked because we are one of the most red states,” she told me.\n\nSome, like nurse practitioner Ginger Jensen, traveled four hours to attend. Retired educator Carolyn Walpole, who is recovering from a knee replacement and ankle fusion, drove more than 100 miles because she is so worried about Social Security — a bogeyman fear stoked by MSNBC and Joe Biden himself.\n\n“Being here, being counted is going to make my heart feel a little better. Like I’ve done something,” said Walpole.\n\nThe crowd went wild when Sanders said, “We don’t accept this blue state-red state nonsense. We are one people.”\n\nIf arena rock is a thing, so now is arena politics. With his 2016 campaign, Donald Trump turned campaigning into a touring entertainment experience. He drew supporters to large venues to cheer and jeer. He obsessed over crowd size. The failed Kamala Harris campaign took up the same model — as well as the fixation on crowd size.\n\nAs a leadership vacuum plagues the Dems, others, like Minnesota governor Tim Walz and California Rep. Ro Khanna, are now “touring,” albeit to little fanfare.\n\nBut, for better or worse, Sanders and Ocasio-Cortez’s left-wing populist evangelism sure is filling the pews. And I wanted to know why.\n\nBoise local Eric Knutson, who is unemployed, told me: “She is a rockstar, AOC. It’s like, Madonna and AOC.” Green hopes she runs for president. (Me too. I think the Republicans will run away with the next election.)\n\nDuring fiery speeches, the duo raged against the one percent with blistering rhetoric, drawing thunderous cheers — part religious revival, part free entertainment. And, as many folks told me, it was their chance to be in communion with like-minded people.\n\nHoward and Julie Wiley, both retired counselors from Boise, left feeling energized.\n\n“It’s encouraging to know there are other sane folks who live in this area and call this home,” said Howard. “It was encouraging to me, to see a unified voice.”\n\nIt also felt like, dare I say, a Trump rally — only with different heroes and villains.\n\nDifferent merch, too. One vendor said their most popular item was a “Gulf of Mexico” T-shirt — showing how the new Trump agenda is agitating the left, but also sparking a business opportunity for resourceful merchants.\n\nHere, the “oligarchs” — mostly DOGE master Elon Musk, along with Jeff Bezos and Mark Zuckerberg —were on the stake. There was no mention of the left’s robust meddling billionaire class (Soros, Pritzker, Reid Hoffman) or the fact that Bezos and Zuckerberg aren’t, despite attending Trump’s inauguration, known conservatives.\n\nThere were boos for Space X and big cheers for free healthcare, migrants, kindness and any mention of the working class. Ocasio-Cortez lionized Columbia University pro-Palestinian protester Mahmoud Khalil.\n\nOne common refrain from both Trump and Bernie supporters is that they feel their guy is fighting for them, personally. “He’s for the people,” said Knutson of Sanders.\n\nAnd a very big distinction: In 2016, much of the media willfully ignored the momentum of Trump rallies; attendees were dismissed as deplorables. The right would be remiss to completely disregard our current moment’s traveling progressive-palooza — and its attendees — even this early.\n\nI sat next to a retired teacher and former Republican who previously believed Sanders was too far left, but now she’s rethinking things. She kindly served as my interpreter on local issues: keeping public land public and the now-viral story of a nearby middle school teacher ordered to remove her “Everyone is Welcome” classroom sign.\n\nYou could see that as a warning shot to the right, to not overplay their hand in the culture war they’re currently winning.\n\nAt one point during Sanders’ speech, a girl in a keffiyeh unfurled a “Free Palestine” banner over the American flag hanging high behind the stage, leading to a tug-of-war with cops. She was kicked out soon enough, but the place erupted into a “Free Palestine” chant so loud, Bernie struggled to regain the crowd.\n\nHaving already hit out at both Biden and Trump for financing “Netanayhu’s war machine,” he tried to gracefully pivot out of the disruption by comparing the plight of Gazans to that of the American working class. Hey, if we’re talking about freeing Palestinians from Hamas, I’m on board.\n\nMaybe it’s not a big deal in Boise, but as a New Yorker trying to clarify the future of the Democrat party, it was clear that this anti-Israel bent will be a major — and well-deserved — roadblock to gain moderate voters.\n\nAnd this crowd wasn’t just anti-Trump. After years of having their candidates chosen by party leaders instead of voters, they’re not feeling a lot of love toward the old establishment figures.\n\nWe’re witnessing a party molting its skin — and looking for its next form.","summary":"For better or worse, Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez are filling the pews on their \"Fighting Oligarchy\" tour. It's important for Republicans — and Democrats — to understand why.","url":"https://nypost.com/2025/04/15/opinion/i-went-inside-aoc-amp-bernie-sanders-fighting-oligarchy-tour/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/02DFC437000003E8.t.jpg?quality=75&strip=all&w=200","video":"https://cdn.jwplayer.com/videos/i3Lr5mYU-RyIcpnTz.mp4","publish_date":"2025-04-15 23:43:04","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","source_country":"zm","sentiment":0.16},{"id":311544804,"title":"Joe Biden Draws Mixed Reactions After Forcefully Defending Social Security","text":"Former President Joe Biden drew mixed reactions when he took the stage Tuesday—his first major public appearance since leaving office—and forcefully defended the Social Security Administration (SSA) as it stares in the face of looming layoffs and the shuttering of crucial services that benefit millions of Americans.Why It MattersBiden, 82, has largely stayed out of the public eye since he left the White House. But the former president returned this week to highlight the Democratic Party's concerns about the Trump administration's cuts to the Social Security Administration, threatening a critical program that 73 million elderly and disabled Americans rely on.Biden's comments on Tuesday came as the SSA is planning to lay off 7,000 employees. The agency also recently reneged on a plan to cut off phone services after public backlash over the cuts, which would have disproportionately affected elderly and disabled SSA recipients.President Donald Trump has publicly pledged to safeguard Social Security, which pays out $1.5 trillion every year to retirees, survivors, disabled and poor Americans.But SpaceX CEO and Department of Government Efficiency (DOGE) head Elon Musk has denigrated the program, which Americans pay into, as \"the biggest Ponzi scheme of all time.\"Trump and Musk have also suggested, without evidence, that Social Security benefits are being fraudulently paid out to millions of dead people.What To KnowBiden's address in Chicago to the national conference of Advocates, Counselors and Representatives for the Disabled drew varying reactions from Democrats and Republicans alike.Call To Activism, a liberal group that tracks the Trump administration's moves, posted on X, formerly Twitter: \"BREAKING NEWS: A fiery Joe Biden delivers the first speech since leaving office and he calls for DIGNITY for every single person who lives in this country. 'It's who we are as Americans. That's what it's about.' I miss him.\"The Blaze, a right-wing media outlet, struck a different tone, writing on X: \"A confused and lost Joe Biden is already rambling into the microphone over blaring music during his first speech since leaving office.\"James Surowiecki, an economics reporter and contributor at The Atlantic, wrote before Biden's address: \"There is no one the country needs to hear from less right now than Joe Biden.\"Others echoed that sentiment.\"It takes a special level of chutzpah as the man most responsible for reelecting Donald Trump to decide it's your voice that is missing in this moment,\" a person who worked closely with the Biden campaign told Politico. \"The country would be better served if he rode off into the sunset.\"Biden drew the ire of members of his own party when he initially refused to bow out of the 2024 presidential race following a disastrous debate performance against Trump. Though Biden did eventually drop out and then Vice President Kamala Harris replaced him as the Democratic nominee, many Democrats still blamed him for the party's loss in the 2024 election.The 46th president was joined on Tuesday by a bipartisan group of former lawmakers, including former Republican Senator Roy Blunt of Missouri, former Democratic Senator Debbie Stabenow of Michigan and former Social Security Administrator Martin O'Malley.O'Malley, in his remarks, accused Trump and Musk of having \"gutted\" the SSA \"with a chainsaw.\" He also described Biden as \"the greatest defender of Social Security\" in the last 20 years.Biden, in his keynote address, described Social Security as a \"sacred promise\" from the government and touted his administration's efforts to make the agency more \"efficient and more effective\" at delivering on benefits.The former president also pointed to the fact that he signed the bipartisan Social Security Fairness Act into law as one of his last actions before leaving office. The legislation restored benefits to public service workers, including firefighters, police officers, and teachers who had their payments reduced despite paying into the system.Among other things, Biden on Tuesday accused Trump and Musk of taking a \"hatchet\" to Social Security, referring to the Trump administration's steep cuts to the SSA that have imposed significant consequences on recipients across the country.The Washington Post published a lengthy report last month detailing how the agency has been hobbled by its website repeatedly crashing, long call wait times, overloaded servers and staffing shortages.Biden also referred to the Silicon Valley motto, espoused by Musk, to \"move fast and break things.\"\"Well, they're certainly breaking things,\" the former president said in his address, later adding, \"Who do they think they are?\"What People Are SayingThe official X account for the SSA wrote after Biden's address: \"Former President Joe Biden is lying to Americans.\"White House press secretary Karoline Leavitt mocked Biden ahead of his address on Tuesday, telling reporters at a press briefing: \"I'm shocked that he is speaking at nighttime. I would have thought his bedtime was much earlier than his speech tonight.\"Let me make this very clear ahead of former President Biden's remarks: The president, this president, President Trump, is absolutely certain about protecting Social Security benefits for law-abiding, tax-paying American citizens and seniors who have paid into this program. He will always protect that program. He campaigned on it.\"David Axelrod, a key architect of Barack Obama's presidential campaigns, wrote on X before Biden's speech: \"Of course Joe Biden has the standing as a former president and the right of every citizen to speak out. And his admonitions that Social Security is under threat are important. But you have to know Trump is excited to see his favorite foil back in the fray.\"House Minority Leader Hakeem Jeffries said in a call with reporters earlier Tuesday: \"This is an all hands on deck moment, which is why President Biden's voice in this moment is so important.\"O'Malley said before Tuesday's address: \"Social Security is a sacred promise between generations. We are deeply grateful to the President for joining us at ACRD to discuss how we can keep that promise for all Americans.\"Independent Senator Angus King of Maine, who typically caucuses with Democrats, told The Post: \"What's going on is the destruction of the agency from the inside out, and it's accelerating. I have people approaching me all the time in their 70s and 80s, and they're beside themselves. They don't know what's coming.\"What Happens NextA bipartisan group of lawmakers recently asked the SSA in a letter to clarify its retroactivity policy surrounding the Social Security Fairness Act, particularly for those who were wrongly advised by SSA staff in earlier years.The senators asked the agency to revise its policy and grant eligible Americans the full scope of back payments allowed by law, saying the SSA should issue \"maximum retroactivity payments to all spouses who were protected on prior applications.\"The SSA has not yet issued a formal response to the letter.The Associated Press contributed reporting to this story.","summary":"Biden drew mixed reactions from Democrats and Republicans alike when he resurfaced to defend Social Security on Tuesday.","url":"https://www.newsweek.com/joe-biden-social-security-reactions-2060199","image":"https://d.newsweek.com/en/full/2627919/joe-biden.jpg","video":null,"publish_date":"2025-04-15 23:38:44","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","source_country":"US","sentiment":-0.388},{"id":311540604,"title":"Biden goes after Trump on Social Security in his first public post-presidency speech","text":"CHICAGO — Former President Joe Biden used his first public remarks since leaving office in January to rebuke the Trump administration’s approach to Social Security, saying its cuts were already putting the institution in peril for millions of deserving Americans. In a roughly half hour of remarks Tuesday before disability advocates, Biden — often speaking in a subdued, hushed tone — did not mention President Donald Trump by name, referring to him instead as “this guy” and held back from robust criticism of the administration. Biden more broadly took aim at Trump's tenure so far saying that in “fewer than 100 days, this new administration has made so much ... damage and so much destruction. It’s kind of breathtaking.” \"We can't go on like this as a divided nation, as divided as we are. Like I said, I've been doing this a long time. It's never been this divided,\" Biden said. \"Granted, it's roughly 30%, but it's a 30% that has no heart.\" It's not clear what group of people the 30%-remark was referring to. White House spokesman Steven Cheung sharply criticized Biden, saying his \"incoherent speech\" showed he had a \"feeble mind\" in a \"rapid decline to new lows.\" \"President Trump has repeatedly promised to protect Social Security and ensure higher take-home pay for seniors by ending the taxation of Social Security benefits. Anybody saying otherwise is either stupid or an all-out liar, or both in Biden’s case,\" Cheung said. Despite a regular churn of verbal abuse from Trump, it was the first time Biden spoke publicly since leaving the White House on Jan. 20. But on Tuesday, he did not offer a defense of himself or his own administration. At times, it was difficult to hear Biden — so much so that those in the room at the event remained still and quiet to hear him speak. Trump routinely chastises Biden, having called him “the worst president in American history.” He frequently characterizes Biden’s tenure as a mess that his administration must now clean up, particularly with regard to border security. In the earliest days of his second term, Trump repeatedly blamed lagging economic indicators on Biden. Soon, however, it was Trump’s own topsy-turvy tariff policies that threw the stock market into disarray. Biden's address came before a conference for Advocates, Counselors and Representatives for the Disabled (ACRD) at the Sofitel Hotel on Chicago’s Magnificent Mile. The group’s meeting focused on strengthening Social Security at a moment when the Trump administration has set its sights on revamping the agency in a way that beneficiaries fear could put them in peril. Last month, Biden spoke at a National High Schools Model United Nations event, but it was not open to members of the press. Biden left office deeply at odds with his own party, which pressured the 82-year-old to abandon his reelection bid in the wake of a devastating presidential debate against Trump last June in which Biden struggled at times to express a clear thought. The debacle exacerbated long-standing concerns about the then-president’s age and mental capacity. Biden’s vice president, Kamala Harris, claimed the Democratic nomination and embarked on a whirlwind, 107-day campaign against Trump that shattered fundraising records, offering fleeting hope to the party. Ultimately, Harris went on to lose against Trump, including in each of six battleground states as well as the popular vote. In January, Biden said in an interview that he believed he could have defeated Trump if he had run again — but at the same time, he admitted in the same USA Today interview that he was unsure he could have served out a full term.","summary":"Former President Joe Biden used his first public remarks since leaving office in January to rebuke the Trump administration’s approach to Social Security.","url":"https://www.nbcnews.com/politics/joe-biden/biden-trump-social-security-first-post-presidency-speech-rcna201309","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-04/250415-joe-biden-vl-411p-d14649.jpg","video":null,"publish_date":"2025-04-15 23:22:17","author":"Natasha Korecki","authors":["Natasha Korecki"],"language":"en","category":"politics","source_country":"us","sentiment":-0.234},{"id":311544800,"title":"Republican 2028 Primary Polls: What Early Surveys Show","text":"Polling for the 2028 Republican presidential primaries has started to percolate, and although state contests to choose the next candidate are about three years away, clear favorites are beginning to surface.Why It MattersRepublicans gained control of the White House, Senate and Congress after the 2024 presidential election amid President Donald Trump's decisive win.Several Republicans have called it a \"mandate\" from the American people to enact GOP-backed legislation and governance nationwide.Numerous 2028 primary polls have been issued since the 2024 election season, including those involving Democratic contenders.What To KnowIn a new poll released this week by Yale Youth Poll, 53 percent of respondents said they would support Vice President JD Vance in the 2028 primary, and 50 percent of those under age 30 would back him.Health and Human Services Secretary Robert F. Kennedy Jr. scored the second highest in the poll, with 8.7 percent, and 13.1 percent from those under 30.Florida Governor Ron DeSantis came in third with 7.5 percent of the vote, and 5.8 percent from those under 30 years old.The poll was taken from April 1 to April 3 among 4,100 registered voters, with a 1.9 percent margin of error.In a poll by Echelon Insights on Monday, Vance was also the front-runner, with a new high of 47 percent. DeSantis was the runner-up with 9 percent and RFK Jr. with 7 percent. The survey was taken from April 10 to April 14 among 1,014 \"voters in the likely electorate,\" the poll says. The margin of error for the survey is 3.5 percent.Democratic front-runners appear to be former Vice President Kamala Harris, U.S. Representative Alexandria Ocasio-Cortez of New York, former Transportation Secretary Pete Buttigieg and California Governor Gavin Newsom.What People Are SayingPolitical analyst Craig Agranoff told Newsweek via text message on Tuesday: \"In 2028, GOP voters might want a candidate with Trump's nod but not the full MAGA vibe. Someone who keeps his populist edge; strong on economy or borders, but dials back the divisiveness to pull in moderates.\"Agranoff continued, \"They'll likely value authenticity and a practical governing style. Whether this works for the party depends on how the base and swing voters gel after 2024. Too early to call, but a unifying figure could gain traction.\"MSNBC anchor Lawrence O'Donnell on X this month: \"The 2028 Republican Presidential Primary campaign is underway. Rubio v Vance will be, among other things, a cruelty contest.\"California Democratic Representative Ro Khanna speaking at Yale University on Tuesday, NBC News reports: \"Vance,\" said Khanna, \"has not only declared war on the courts, but on the universities. And it is no accident. As Stephen Kotkin observed in his study of Stalin, strongmen do not fear recessions or even failed wars as much as they fear the university.\"What Happens NextPolls will continue rolling out as the race gets closer and a clearer picture will form on whom Republicans will most likely choose as their candidate for the 2028 presidential election.","summary":"Front-runners in the potential GOP matchup for the 2028 Republican primary have emerged in early polling.","url":"https://www.newsweek.com/republican-2028-primary-polls-what-early-surveys-show-2060209","image":"https://d.newsweek.com/en/full/2627909/jd-vance.jpg","video":null,"publish_date":"2025-04-15 23:18:12","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"US","sentiment":0.11},{"id":311537892,"title":"Fox News Politics Newsletter: Leak source located?","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -CDC eyes narrower COVID-19 vaccine guidance ahead of 2025–2026 season -Top Republican warns families of 'largest tax hike in history' next year if Trump budget fails -Biden to address disability advocates in first major speech since leaving White House Placed on leave A top advisor to Defense Secretary Pete Hegseth was escorted out of the Pentagon on Tuesday and placed on administrative leave, according to a Defense Department official. Reuters first reported Caldwell had been placed on leave for an \"unauthorized disclosure\" of information amid an investigation into Pentagon leaks. An official confirmed to Fox News Digital that Reuters' reporting is accurate but declined to comment on an ongoing investigation. Caldwell previously worked at restraint-minded think tank Defense Priorities and Concerned Veterans for America, a group formerly led by Hegseth. A foreign policy realist, he has argued that the U.S. should dramatically reduce its footprint in Europe and pull out forces in Iraq and Syria…Read more White House ‘NEED TO COMPLY’: SCOTUS should hold Trump admin in contempt over deported Salvadoran migrant DEPORTATION BATTLE: Trump admin defies court over Maryland deportation, ignites legal showdown 'SUPPORTING SICKNESS': Trump says Harvard should lose its tax exempt status, be treated as 'political entity' amid funding dispute CHECKMATE: Trump admin strikes deal for new state-of-the-art border checkpoint in California ROLLING BACK: Trump directs agencies to follow Supreme Court rulings, as he continues to rein in administrative state 'HIGHER SECURITY': Top Trump agency reveals key reason why REAL ID will be enforced World Stage DISMISSED: Judge greenlights DOJ's motion to drop gun case against Salvadoran, accused MS-13 leader BEST BROS: El Salvador's Bukele after friendly White House meeting with Trump: 'I miss you already, President T' Capitol Hill 'BAD MEDICINE': Schumer calls on Leland Dudek, acting commissioner of SSA, to resign GREENE DAY: Marjorie Taylor Greene brings town hall to Harris-won Georgia county, shrugs off possible 'outbursts' CASH DASH: House Republican campaign arm touts 'unstoppable momentum' with record fundraising haul 'BIG BOOST': GOP senator reveals why Trump's 'complete and total endorsement' will be crucial for his midterm race COMEBACK KID: First Mexico-born rep targets indictment-plagued Democrat in House GOP comeback bid 'DEEP DIVISIONS': AOC tells rally goers don't let Republicans 'trick' them into identity politics, stoking racial divisions 'KAMALA'S PLAYBOOK': Social media erupts after AOC debuts another 'strange' accent at rally: 'Kamala’s playbook' WAR OF THE WORDS: Left-wing lawmaker calls Trump MAGA's 'buffoon of a leader': 'Thank me later' Across America DEPARTMENT DISMANTLED: Shapiro leads lawsuit against Trump admin for pulling COVID-era school funding BILLION-DOLLAR BAILOUT: Newsom signs $2.8B bailout for healthcare program overrun by illegal immigrants BY THE NUMBERS: ICE using Social Security records to aid Trump push to deport illegal immigrants VISA CRACKDOWN: ACLU of Indiana sues Trump admin, claims DHS violated rights of foreign students Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-leak-source-located","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/gettyimages-2208742631.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 23:15:31","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.039},{"id":311540646,"title":"AOC claims Republicans want to ‘trick’ Americans into identity politics to ‘keep us fighting’","text":"Rep. Alexandria Ocasio-Cortez, D-N.Y., told rally attendees not to let Republicans “trick” them into thinking they “can be separated” by race or into stoking “deep divisions along race, identity and culture,” despite President Donald Trump’s recent efforts to rid identity politics from public and private spaces.\n\nThe progressive “Squad” lawmaker’s comments came at a “Fighting Oligarchy” rally Monday night in Idaho alongside Sen. Bernie Sanders, I-Vt. It was the pair’s latest stop in a tour of appearances across the country.\n\n“The only chance they have to get away with such an unpopular and hurtful agenda is to stoke deep divisions along race, identity and culture to keep us fighting and distracted. It’s not going to work anymore,” AOC told rally goers. “Don’t let them trick us into thinking we are enemies. Don’t let them trick us into being weak and being into thinking we can be separated into rural and urban, black and white and Latino.”\n\nThe rally with AOC and Sanders was largely centered around criticizing “billionaire” oligarchs like Elon Musk, Jeff Bezos, Mark Zuckerberg and President Donald Trump, who, as president, has been leading an anti-DEI push that is aimed at ridding identity politics from public and private spaces.\n\nIn fact, per political analyst and regular MSNBC contributor Eddie Glaude, identity politics was “at the heart” of former Vice President Kamala Harris’ election loss to Trump.\n\n“The only thing that was woke or representational about [Kamala Harris’] campaign was her, her body, the fact that she was a woman of color. So I think that the concern, the so-called backlash, to tending to the diversity of the nation actually proves the point,” Glaude said in an interview with NPR shortly after Republican’s November election victories.\n\nMeanwhile, since being inaugurated, Trump has implemented executive actions explicitly targeting “identity politics.”\n\n“Prior to harmful changes introduced by the Obama and Biden administrations, the United States military offered equality of opportunity to every American capable of and interested in serving their country. Yet these two administrations exploited the military in favor of identity politics—harming our national defense, undermining the non-political nature of our military, and eroding morale and recruitment,” Trump wrote in one of his first Executive Orders after being sworn in. “Due to this ‘woke’ assault, the Services together logged their lowest recruiting records since 1940 with a 41,000-troop shortfall in 2023.”\n\nTrump has also taken steps to rid DEI from universities, the federal government and even the private sector.\n\nAccording to Trump, it was Democrat President Joe Biden who implemented “illegal and immoral discrimination programs,” which often tied individual success to immutable factors like race, sex and ethnicity.\n\n“President Trump is restoring fairness and accountability in federal hiring, and terminating DEI across the federal government,” reads a March fact sheet from the White House.","summary":"MSNBC contributor Eddie Glaude told NPR identity politics was 'at the heart' of Kamala Harris' election loss to Trump.","url":"https://nypost.com/2025/04/15/us-news/aoc-claims-republicans-will-trick-americans-into-identity-politics/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/newspress-collage-uno8jvfc3-1744756806844.jpg?quality=75&strip=all&1744742454&w=1200","video":"https://cdn.jwplayer.com/videos/zyvliAIY-RyIcpnTz.mp4","publish_date":"2025-04-15 23:04:00","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":0.006},{"id":311534118,"title":"James Carville suggests 'split' with the left over 'pronoun politics'","text":"Veteran Democratic strategist James Carville wants the progressive wing of the Democratic Party to distance themselves from the party, suggesting a \"split\" due to \"pronoun politics.\" \"I don't think we can't work together on pronoun politics. This election did not teach you how damaging that is. I don't think there's anything that I can tell you,\" Carville said on the Politics War Room podcast on Tuesday. KAMALA HARRIS WAS ‘VERY ANNOYED’ WITH OBAMA AS SHE SOUGHT HIS ENDORSEMENT, BOOK REVEALS \"And you say, this guy is stuck in another century, not another decade. And he represents nothing to do with the future of our movement. I can accept that. You're not really going to hurt my feelings. So, maybe we can have a kind of amicable split here,\" he added. As progressives tend to be very vocal about LGBTQ rights, Carville proposed that there needs to be a \"schism\" within the Democratic Party. Carville went on to say, \"They’ll never run against a Republican… All they do is run against other Democrats. I don't quite understand why you're so anxious to have the word Democrat in the description of what you do. But maybe we can have an amicable split here. And you go your way, we go our way, and after the election, we come together and see how much common ground we can find.\" KAMALA HARRIS SAYS 'I TOLD YOU SO' WHILE SLAMMING PRESIDENT TRUMP'S SECOND TERM IN LATEST PUBLIC APPEARANCE Carville's comments came after he said last week that the Democratic Party needed to distance themselves from identity politics because their first priority should be to win elections. He explained further that if there is a formidable female candidate to win the White House, then the Democratic Party will rally around her. Carville, who became famous for working on former President Bill Clinton's campaign in 1992, listed several factions within the Democratic Party, including the Justice Party, the Working Families Party, and the Socialist Party. \"The only thing I'd ask is just don't use the word Democratic in any title that you have, because most Democrats that I know that are running for office don't want your name, don't want you to be part of the deal,\" the veteran Democratic strategist said. \"They would surely be glad to take your vote. Who wouldn't? Everybody wants to get as many votes as they can. Maybe you come up with your own name. And by the way, nothing against after the election, you can sit down and do like it's done in parliamentary governments or governments around the world.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"After their last defeat in the presidential election, James Carville wants a &quot;schism&quot; within the Democratic Party due to differences of opinion on how to handle &quot;pronoun politics.&quot;","url":"https://www.foxnews.com/media/james-carville-suggests-split-left-over-pronoun-politics","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/11/931/523/CFB-James-Carville.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 23:00:23","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.335},{"id":311540866,"title":"Biden Calls Out Republicans For Threatening Social Security: 'Who In The Hell Do They Think They Are?'","text":"Former President Joe Biden on Monday delivered his first major speech since leaving the White House nearly three months ago, calling on the budget-slashing Trump administration to keep its hands off Social Security.Speaking at the national conference of Advocates, Counselors and Representatives in Chicago, Biden scolded President Donald Trump's dismantling of the federal government, particularly Republican calls to cut the \"sacred promise\" of the popular social safety-net program that Democrats see as a rallying point for future elections.Under the leadership of Trump-appointed billionaire Elon Musk, who heads the new Department of Government Efficiency's (DOGE) effort to eliminate fraud, waste and abuse, more than 100,000 federal workers have been fired and entire departments have been slashed or eliminated, including 7,000 jobs at the Social Security Administration.\"We also face the constant threat from some Republican members of Congress who want to cut and gut Social Security -- period,\" Biden told the audience. \"They want to let Social Security expire every five years unless reauthorized by Congress. ... 'Who in the hell do they think they are?'\"They want to break it so they can rob it.\"Biden emphasized the importance of preserving Social Security, which benefits 73 million retired or disabled Americans. He pointed out that millions of Americans have paid into the system over the course of their work careers, making it less of a social program than a savings plan.\"One of them called it a Ponzi scheme. Ponzi scheme? What the hell are they talking about?\" Biden said. \"People earned these benefits. They paid into that benefit. They rely on that benefit, and no one, no one, no one should take it away from them.\"Biden was unceremoniously pushed out of his reelection bid in the 2024 race following a disastrous first debate performance against Trump in June raised questions about the then-81-year-old's cognitive function. Biden was replaced on the ticket by former Vice President Kamala Harris, who lost 312-226 in electoral votes.","summary":"Former President Joe Biden on Monday delivered his first major speech since leaving the White House nearly three months ago, calling on the budget-slashing Trump administration to keep its hands off Social Security.","url":"https://www.ibtimes.com/biden-calls-out-republicans-threatening-social-security-who-hell-do-they-think-they-are-3770211","image":"https://d.ibtimes.com/en/full/4570920/biden-signs-spending-bill.jpg","video":null,"publish_date":"2025-04-15 22:48:54","author":"Terry Massey","authors":["Terry Massey"],"language":"en","category":"politics","source_country":"US","sentiment":-0.259},{"id":311534654,"title":"Kamala Harris says, “I’m not going anywhere” (Video)","text":"Former Vice President and presidential candidate Kamala Harris vowed earlier this month that she is not going anywhere. A new New York Times article aims to answer where she is going next and co-author Tyler Pager joins \"America Decides\" to discuss.\n\nCBS News 24/7 is the premier anchored streaming news service from CBS News and Stations that is available free to everyone with access to the internet and is the destination for breaking news, live events, original reporting and storytelling, and programs from CBS News and Stations' top anchors and correspondents working locally, nationally and around the globe. It is available on more than 30 platforms across mobile, desktop and connected TVs for free, as well as CBSNews.com and Paramount+ and live in 91 countries.\n\nSubscribe to the CBS News YouTube channel: https://youtube.com/cbsnews\nWatch CBS News 24/7: https://cbsnews.com/live/\nDownload the CBS News app: https://cbsnews.com/mobile/\nFollow CBS News on Instagram: https://instagram.com/cbsnews/\nLike CBS News on Facebook: https://facebook.com/cbsnews\nFollow CBS News on X: https://twitter.com/cbsnews\nSubscribe to our newsletters: https://cbsnews.com/newsletters/\nTry Paramount+ free: https://paramountplus.com/?ftag=PPM-05-10aeh8h\n\nFor video licensing inquiries, contact: licensing@veritone.com","summary":"Former Vice President and presidential candidate Kamala Harris vowed earlier this month that she is not going anywhere. A new New York Times article aims to answer where she is going next and co-author Tyler...\n\n\nThe post Kamala Harris says, &#8220;I&#8217;m not going anywhere&#8221; (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/04/15/kamala-harris-says-im-not-going-anywhere-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/04/15/maxresdefault-65.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1744757500","video":null,"publish_date":"2025-04-15 22:21:40","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","source_country":"in","sentiment":0.272},{"id":311536788,"title":"Obama calls Trump’s freeze of Harvard funding ‘unlawful’","text":"Former President Barack Obama is applauding Harvard University's decision to refuse the White House's demands that it change its policies or lose federal money, in his first social media post to criticise the Trump administration since at least Inauguration Day.\n\nPresident Donald Trump is freezing more than $2bn (£1.5bn) in federal funds for Harvard because it would not make changes to its hiring, admissions and teaching practices that his administration said were key to fighting antisemitism on campus.\n\nObama, a Harvard alum, described the freeze as \"unlawful and ham-handed\".\n\nHe called on other institutions to follow Harvard's lead in not conceding to Trump's demands.\n\n\"Harvard has set an example for other higher-ed institutions – rejecting an unlawful and ham-handed attempt to stifle academic freedom, while taking concrete steps to make sure all students at Harvard can benefit from an environment of intellectual inquiry, rigorous debate and mutual respect,\" Obama wrote on social media.\n\nThe former president, who graduated from Harvard Law School in 1991, has rarely criticised or rebuked government officials or government policies on social media since leaving the White House almost a decade ago. His posts during the election typically extolled Trump's challenger, then-Vice-President Kamala Harris, and since Inauguration Day, he has mainly posted tributes, personal messages and thoughts on sports.\n\nObama is one of a handful of US political figures and university officials now speaking out against the Trump administration's attempts to reshape the country's top universities, through pressure to change what they teach and who they hire and threats to cut research funding.\n\nHundreds of faculty members at Yale University published a letter expressing their support for Harvard's decision to reject the Trump administration's demands.\n\n\"We stand together at a crossroads,\" the letter read. \"American universities are facing extraordinary attacks that threaten the bedrock principles of a democratic society, including rights of free expression, association, and academic freedom. We write as one faculty, to ask you to stand with us now.\"\n\nMany US universities receive some type of federal funding, which is mostly designated for scientific research in areas such as drug development.\n\nSince Trump returned to office in January, elite institutions such as Stanford University have had to freeze hiring and cut budgets in the face of shrinking federal funds.\n\nSome of the funding has been paused to press universities to take steps that the Trump administration says will fight antisemitism. Trump has accused them of failing to protect Jewish students during last year's campus protests against the war in Gaza and US support for Israel.\n\nStanford President Jonathan Levin and Provost Jenny Martinez on Tuesday said in a statement praising Harvard that \"universities need to address legitimate criticisms with humility and openness\".\n\n\"But the way to bring about constructive change is not by destroying the nation's capacity for scientific research, or through the government taking command of a private institution,\" they wrote.\n\nWhile Columbia University ceded to some of Trump's demands earlier this month, Harvard became the first major US university to take the opposite approach.\n\n\"No government – regardless of which party is in power – should dictate what private universities can teach, whom they can admit and hire, and which areas of study and inquiry they can pursue,\" Harvard's president, Alan Garber, said in a statement on Monday.\n\nMassachusetts Institute of Technology (MIT) followed Harvard's lead on Monday and also rejected the Trump administration's demands.\n\nDespite the criticism, Trump is standing fast. On Tuesday he took another strike against Harvard, threatening to revoke its tax-exempt status.\n\nUniversities, as well as many charities and religious groups, are exempted from paying federal income taxes. This valuable tax break, though, can be removed if the groups become involved in political activities or move away from their stated purposes.","summary":"Former President Barack Obama is applauding Harvard University's decision to refuse the White House's demands that it change its policies or lose federal money, in his first social media post to criticise the Trump administration since at least Inauguration Day.","url":"https://www.myjoyonline.com/obama-calls-trumps-freeze-of-harvard-funding-unlawful/","image":"https://www.myjoyonline.com/wp-content/uploads/2024/10/image-19-14.jpg","video":null,"publish_date":"2025-04-15 21:45:00","author":"Abubakar Ibrahim,Bbc 45pm","authors":["Abubakar Ibrahim","Bbc 45pm"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.174},{"id":311526514,"title":"'Befuddled' And Exhausted During Debate Prep: All The Allegations About Joe Biden's Mental Decline In New Books","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nFormer President Joe Biden appeared exhausted and disconnected from reality during his 2024 campaign, but his inner circle was “delusional” and genuinely believed he could win, according to a new book, among several in recent months with damning new allegations about the former president’s mental state amid the collapse of his presidential campaign last year.\n\nFormer U.S. President Joe Biden poses backstage on opening night of \"Othello\" on Broadway at The ... More Barrymore Theatre on March 23, 2025 in New York City. (Photo by Bruce Glikas/WireImage)\nBruce Glikas/WireImage\n\nFormer CBS producer and author Chris Whipple’s book, “Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History,” reportedly details how top Biden adviser Ron Klain described Biden as “fatigued, befuddled, and disengaged,” in the lead-up to the debate, and said he ended one debate-prep session early and fell asleep by the pool.\n\nBiden was so preoccupied with foreign policy, Klain said he “wondered half-seriously if Biden thought he was president of NATO,” Whipple wrote.\n\nBiden “didn’t look well” and “didn’t sound vital” several days after the debate at a donor event, where he used a path of fluorescent tape on the floor to guide his steps and a teleprompter for what were supposed to be unscripted remarks, The Hill reporter and author Amie Parnes and NBC reporter Jonathan Allen wrote in “Fight: Inside the Wildest Battle for the White House.”\n\nCNN’s Jake Tapper, who moderated the Trump-Biden debate, and Axios’ Alex Thompson, coauthored a third yet-to-be-released book, “Original Sin: President Biden’s Decline, Its Cover-up, and His Disastrous Choice to Run Again,” in which they say, “Biden, his family and his team let their self-interest and fear of another Trump term justify trying to put an at times addled old man in the Oval Office.”\n\nWhipple concluded that Biden’s inner circle genuinely believed Biden was capable of serving another term, characterizing the mindset as “delusion and denial,” rather than a cover-up—similarly, Klain told the Guardian in response to Whipple’s book that he “never doubted the president’s mental acuity,” but that Biden failed, or refused, to grasp what was required to be successful in the campaign.\n\nDespite the confidence of Biden and his inner circle, Democratic National Committee officials were working on contingency plans for Biden’s potential exit from the race as early as 2023 and aides to Kamala Harris even “strategized around the possibility that Biden might die in office,” according to “Fight.”\n\nBiden plans to write a book about his presidency and his decision to exit the race, multiple outlets reported in January.\n\nCrucial Quote\n\n“I am convinced that Joe Biden’s inner circle was convinced that Joe Biden was capable of governing, and they believed that he could do it for another four years,” Whipple told NPR. People who visited Biden in the Oval Office said he was “on top of every nuance of Middle Eastern policy” Whipple wrote in his book, concluding that, “Joe Biden, behind closed doors, was governing capably,” but he wasn’t mentally or physically equipped to run a successful campaign.\n\nKey Background\n\nBiden, 82, publicly dismissed polls that showed voters did not want him to run for another term and insisted he could beat Trump since he had done it before, despite showing blatant signs of aging in both public and private that grew more frequent as the 2024 campaign season neared. Biden’s political career effectively ended moments into his June 26 debate with Trump, when he lost his train of thought and continued his shaky performance throughout the 90-minute program. He announced his decision to step down on July 21, amid growing calls from Democrats in Congress to withdraw. Trump’s decisive win over Harris, and Republicans’ dominance in House and Senate races, left the Democratic party in tatters without a clear messaging strategy or prominent leaders. Many still blame Biden for the 2024 fiasco. Polls show the party’s popularity has dropped to record lows. Biden, however, has remained defiant that he could have beaten Trump, he told USA Today in an interview published in January, though he seemed to acknowledge for the first time he might not have been healthy enough to serve another term. “Who the hell knows?” he said when asked the question.\n\nFurther Reading\n\nBiden Admits He Might Be Too Old To Have Served Another Term (Forbes)\n\nBiden Loses Train Of Thought And Corrects Himself Repeatedly In Debate With Trump (Forbes)\n\nBiden Drops Out Of 2024 Race—Here’s What Happens Next (Forbes)\n\nFollow me on Twitter. Send me a secure tip. \n\nEditorial Standards\n\nForbes Accolades","summary":"“I am convinced that Joe Biden’s inner circle was convinced that Joe Biden was capable of governing,” author Chris Whipple told NPR.","url":"https://www.forbes.com/sites/saradorn/2025/04/15/befuddled-and-exhausted-during-debate-prep-all-the-allegations-about-joe-bidens-mental-decline-in-new-books/","image":"https://imageio.forbes.com/specials-images/imageserve/67feced091d8ddfbc9763467/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-04-15 21:28:37","author":"Forbes Staff,Sara Dorn","authors":["Forbes Staff","Sara Dorn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.259},{"id":311526154,"title":"WATCH LIVE: Biden gives first post-presidency speech","text":"BIDEN REEMERGES FOR SOCIAL SECURITY-FOCUSED SPEECH AS TRUMP POPULARITY DIPS\n\nBiden, 82, forfeited the Democratic nomination in July after a concerted pressure campaign from Democratic leaders over his age and health. Former Vice President Kamala Harris took his spot and was defeated by President Donald Trump despite Biden’s endorsement.\n\nDemocratic anger was widely directed at Biden, with many in the party blaming their sweeping election losses on his late exit from the race. The anger may have contributed to his decision to remain outside the limelight in his retirement despite Trump’s public criticisms of him.","summary":"Former President Joe Biden is giving his first public speech on Tuesday since leaving office. Biden, who left the White House in January, is scheduled to begin speaking at approximately 5:45 p.m. He will deliver his address to an event hosted by Advocates, Counselors, and Representatives for the Disabled in Chicago and speak out against [&#8230;]","url":"https://www.washingtonexaminer.com/policy/finance-and-economy/3381323/watch-live-biden-first-post-presidency-speech-social-security/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/Bidenbucks-EO-2025.webp","video":null,"publish_date":"2025-04-15 20:46:15","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":0.349},{"id":311511288,"title":"AI Action Figure Trend, Explained — And How To Make Your Own","text":"“Life in plastic, it’s fantastic,” Barbie crooned. Just how fantastic? It seems everyone on the internet is finding out by hopping on an AI trend that turns people into action figures, box art, personalized accessories and all.\n\nThe viral craze picked up after OpenAI launched its new image generator, powered by GPT-40, immediately attracting scores of users eager to experiment. Creating a toy version of yourself or anyone else (that includes pets, yup), works like this: Upload a photo, add a text prompt describing your ideal action figure, and voila — you’re boxed and ready for toy store shelves (or, more likely, Instagram).\n\nPlenty of the action figures flooding social media represent everyday people curious to see how they look miniatured and in plastic. But, unsurprisingly in these politically charged times, people have found a new avenue for biting social commentary — creating AI-generated figurines of everyone from President Trump, Elon Musk, Vladimir Putin, Kamala Harris and Bernie Sanders to categories of people like “eco-left protester,” “pro-life doctor” and “Liverpool fan” (I’m just the messenger, soccer fans).\n\nMORE FOR YOU\n\nUpgraded Northern Lights Alert For 17 States After ‘Double Eruption’ On Sun\n\n‘Elder Scrolls IV: Oblivion Remake’ Images Leak Ahead Of Imminent Release\n\nBaldur’s Gate 3 - Patch 8 Is Big, Beautiful And Sad\n\nAthletes, tech executives, historical figures are getting turned into action figures, as are characters from pop culture — a Seinfeld fan account on X has posted action figures of Jerry (white sneakers and puffy pirate shirt included), Elaine, George, Kramer, Newman and J. Peterman.\n\nBrands including Mac Cosmetics and company selling pet health products have jumped on the trend too, and on LinkedIn, action figures have become a cheeky new way to promote professional strengths.\n\nThe action figures come on the heels of another wildly popular trend that followed the launch of the ChatGPT image generator. It saw users creating images in the style of Japanese anime house Studio Ghibli.\n\nHow to Make Your Own AI Action Figure\n\nOnce you’re logged in to ChapGPT, upload a photo of yourself in the chatbox. If it’s just a headshot, ChatGPT will add a body. For more accuracy, try adding a full-body shot.\n\nAdd a prompt. More details mean a more customized figure. A commenter on the Instagram account chatgpttricks shared the below detailed template that can be tweaked according to your action figure vision. You can, for example, stipulate the color of the cardboard backing and add items that reflect your personality and interests (a basketball, a guitar, a yoga mat, books, gardening tools).\n\nThis Prompt Can Be A Starting Point\n\nA picture of a collectible action figure titled “[FIGURE NAME]” in a sealed plastic blister pack on a cardboard backing. The figure is posed confidently inside the transparent plastic shell, surrounded by three accessories that reflect their personality or career. The character is wearing [OUTFIT DESCRIPTION] and has a [FACIAL EXPRESSION] expression. The packaging features a [COLOR SCHEME OR PATTERN] background with bold letters at the top displaying the name “[FIGURE NAME]” and the subtitle “ACTION FIGURE” beneath it. The visual style is playful, minimal and toy-like, with smooth surfaces and soft lighting that mimics the look of real plastic.\n\nNote that it will take the tool a couple of minutes to generate your action figure. I tried making a few, including one of my cat Jetson Higgs Boson, who — given his delightfully kinetic and annoyingly destructive tendencies — was born for the role.\n\nMy cat, Jetson Higgs Boson, is now an action figure coming to destroy your carpet too.\nChapGPT/Leslie\n\nFollow me on Twitter or LinkedIn.\nEditorial StandardsForbes Accolades","summary":"People are flooding social media with AI-generated toy versions of themselves, and others, made with ChatGPT's new image generator. They're fun and sometimes political.","url":"https://www.forbes.com/sites/lesliekatz/2025/04/15/ai-action-figure-trend-explained---and-how-to-make-your-own/","image":"https://imageio.forbes.com/specials-images/imageserve/67febed56c1f3bafa5363aac/0x0.jpg?format=jpg&crop=875,493,x0,y234,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-04-15 20:22:48","author":"Leslie Katz,Senior Contributor","authors":["Leslie Katz","Senior Contributor"],"language":"en","source_country":"US","sentiment":0.239},{"id":311499844,"title":"In urban America, abundance framing can actually be a good thing","text":"I found myself at a large airport the other day, pleased to discover the perfect in-flight book waiting for me on a shelf in Concourse A. It was Ezra Klein and Derek Thompson’s new book, “Abundance,” a text that had (however briefly) captured the imagination of pundits. That’s about what you want an airport book to do.\n\nA brief review: “Abundance” is a surface look at urban and environmental politics — which is to say, liberal politics — in the United States, aiming to reframe its tactics more optimistically. Sure, that seems out of date in May 2025, and the book was undoubtedly written before President Donald Trump’s reelection and subsequent descent away from the Constitution. It’s hard to think clearly about public policy right now, so I’ll give the authors a pass about whether or not their text predicted the zeitgeist. \n\nThis is to say that the book is not a work of genius. Outside of a few examples like zoning reform, infrastructure costs, or quasi-environmental regulations, they don’t dive deeply into policy details. But for a 20,000-foot narrative, it’s a push in the right direction, a useful reframing that goes beyond urban housing debates.\n\n‘Lawn sign liberals’\n\nThe book offers a broad critique of liberal urban governance, focusing in particular on housing and green infrastructure. After the breezy introduction, the chapters lay out simple imperatives — build, deploy, govern, etc. — each of which focuses on case studies of “blue state” failures to follow through on stated ideals. Jumping every few paragraphs from citation to citation, the book almost reads like an annotated bibliography; here in rapid succession, you will find glosses of Ralph Nader, Ed Glaeser, Matt Yglesias, Mancur Olson, Robert Caro, John Maynard Keynes and Bill McKibben. \n\nThe authors let repetition make their case, in between digging in with pithy slogans like “lawn sign liberals” or “the Liberalism lawyers” to highlight the hypocrisy of unaffordable-but-“welcoming” cities. Given the facts on the ground around population growth and home values, it’s not unconvincing. \n\nWhether it’s particularly original is a different story. As a slogan, the idea of “abundance” has been around a long time, at least since the 1990s in the field of creativity (see Julia Cameron) or for a decade in mainstream housing advocacy. This is not to say that it’s a useless pivot. In fact, it’s probably good framing for a future urban agenda, at least if and when the country finds itself on the other side of its existential political crisis. \n\nFor me, the utility of the abundance concept became clear after spending years mired in the gentrification impasse. (See for example this column, for which I received no little pushback.) Twelve years ago, I attended a conference on creative placemaking in New York City and found myself being endlessly detoured into conversations around zero-sum gentrification. One Brooklyn friend explained that he and his partner were hoping for a crime wave in their Bed-Stuy neighborhood, so that rents might stay low enough for them to afford to remain there. (He was only half-joking.) That’s precisely the kind of outcome that Klein and Thompson, and a generation of pro-housing advocates, have long sought to circumvent. \n\nYet the majority of urban housing conversations in blue states and cities take place within this overall “scarcity” framework, where any new housing is invariably perceived to come at the expense of existing residents. This is why proposals to turn a vacant lot into an apartment building, add a parklet to a busy street, or improve transit are often swamped by discussions of who might benefit from change, and whether it’s the right group of people. To a degree this is useful, but Klein and Thompson rightfully devote time to pointing out the counterproductivity of this approach becoming the urban norm. \n\nFor “Abundance,” the best illustration of their overall critique lies in the hypocrisy of blue cities around housing, where exclusionary zoning and dog whistles like “neighborhood character” make most neighborhoods unaffordable or deeply fragile. (Believe it or not, the Twin Cities offers the best exceptions to this rule, at least for now.) This is probably why the term “abundance” has been in broad circulation in housing advocacy for years already. \n\nThe zero-sum mindset vs. abundance\n\nThree years ago, I attended a conference in Portland called YIMBYtown centered on housing advocacy. At the event, half of my conversations centered on the question of whether the conference had the right name, or whether it was an alienating brand. (For the record, they haven’t yet changed it.) The YIMBY moniker is frustrating for many advocates because it reinforces binaries that invoke a zero-sum mindset: my win is your loss. This comes into play around the incessant acronyms: NIMBYs versus YIMBYs, but also PHIMBYs (Public Housing in My Backyard), or folks demanding that all new housing be subsidized and permanently affordable. \n\nThe binary logic is frustrating because most advocates I know agree about a few basic things: First, that American housing policy has long been mired in damaging race and class segregation, zoning regulations rooted in racism and classism. And second, that more housing of every kind is needed. Most advocates adopt a “yes-and” framework, pushing for subsidized, market-rate, social/public housing, and incremental (e.g. ADU) housing. This is why advocates have been rallying under the more inclusive abundance banner for years, with groups like Abundant Housing Massachusetts, Abundant Housing LA, or (our fun local example) Neighbors for More Neighbors.\n\n“Abundance” doesn’t just end at housing, and covers plenty of seemingly well-intentioned bureaucratic hurdles in other fields. For example, the authors call out policy failures around climate and transportation infrastructure, another familiar critique when it comes to electric grid expansion or transit project funding costs. (Good examples are Dave Roberts’ wonderful podcast conversations with climate policy wonks, or Alon Levy’s tireless efforts to point out bloated infrastructure costs in the U.S.) The book is full of stories like this, for example pointing to the role that the passage of the California Environmental Quality Act (CEQA), and a subsequent 1972 court decision, have played in derailing change in America’s largest state. (The local example is the weaponization of the Minnesota Environmental Rights Act to hold up the Minneapolis 2040 plan.) \n\nThe authors likewise use California’s interminable high-speed project to illustrate the timeframe and budget costs of transportation infrastructure, a critique that will ring true for anyone following the ongoing Green Line Light Rail Extension construction saga. Yet another auditor’s report was just released on this, but last year’s efforts to reform the Met Council failed just as Klein and Thompson might predict. Throughout the book, the culprit can be found in bureaucratic inertia and inelegant governance structures, and thus the lack of strong leadership focused on changing the status quo. U.S. cities lack the internal capacity that must be built to change the regulatory and cost burdens. \n\nIt’s less important whether or not the authors are right about the policy details — sometimes not, as self-driving cars and sustainable aviation fuel are various shades of fool’s gold — but the result is a useful, if untimely, reframing. I remain somewhat skeptical that this kind of message can be delivered in today’s media environment. For example, how different is this from Kamala Harris’ “opportunity economy,” or Bernie Sanders and Alexandria Ocasio-Cortez’s push for a Green New Deal? One could argue that both of those high-profile campaigns were essentially about abundance. \n\nThe big difference I suppose is that they didn’t point their figures at the right problem, in this case, the barriers erected by urban liberal governance. At least around housing and climate infrastructure, that’s a useful move. And it’s certainly the case that the politics of abundance are easier to defend than their opposite — scarcity. That alone is a useful lesson, to stay focused on a relentless positive vision. If anything, people pushing for climate urbanism could use all the optimism they can get right now.","summary":"“Abundance” explores urban and environmental politics from 20,000 feet.\n\n\nThe post In urban America, abundance framing can actually be a good thing appeared first on MinnPost.","url":"https://www.minnpost.com/cityscape/2025/04/in-urban-america-abundance-framing-can-actually-be-a-good-thing/","image":"https://www.minnpost.com/wp-content/uploads/2025/04/abundance-titile.png","video":null,"publish_date":"2025-04-15 19:57:21","author":"Bill Lindeke","authors":["Bill Lindeke"],"language":"en","source_country":"us","sentiment":0.026},{"id":311481560,"title":"Obama calls Trump administration's freeze on Harvard funding 'unlawful'","text":"\"Harvard has set an example for other higher-ed institutions – rejecting an unlawful and ham-handed attempt to stifle academic freedom, while taking concrete steps to make sure all students at Harvard can benefit from an environment of intellectual inquiry, rigorous debate and mutual respect,\" Obama wrote on social media. \n\nThe former president, who graduated from Harvard Law School in 1991, has rarely criticised or rebuked government officials or government policies on social media since leaving the White House almost a decade ago. His posts during the election typically extolled Trump's challenger, then-Vice-President Kamala Harris, and since Inauguration Day, he has mainly posted tributes, personal messages and thoughts on sports.\n\nObama is one of a handful of US political figures and university officials now speaking out against the Trump administration's attempts to reshape the country's top universities, through pressure to change what they teach and who they hire and threats to cut research funding.\n\nHundreds of faculty members at Yale University, published a letter expressing their support for Harvard's decision to reject the Trump administration's demands. \n\n\"We stand together at a crossroads,\" the letter read. \"American universities are facing extraordinary attacks that threaten the bedrock principles of a democratic society, including rights of free expression, association, and academic freedom. We write as one faculty, to ask you to stand with us now.\"\n\nMany US universities receive some type of federal funding which is mostly designated for scientific research in areas such as drug development.\n\nSince Trump returned to office in January, elite institutions such as Stanford University have had to freeze hiring and cut budgets in the face of shrinking federal funds. \n\nSome of the funding has been paused to press universities to take steps that the Trump administration says will fight antisemitism. Trump has accused them of failing to protect Jewish students during last year's campus protests against the war in Gaza and US support for Israel.\n\nStanford President Jonathan Levin and Provost Jenny Martinez on Tuesday said in a statement praising Harvard that \"universities need to address legitimate criticisms with humility and openness\". \n\n\"But the way to bring about constructive change is not by destroying the nation's capacity for scientific research, or through the government taking command of a private institution,\" they wrote.\n\nColumbia University agrees to Trump demand for mask banTrump pulls $400m from Columbia UniversityWhy has Trump revoked hundreds of international student visas?\n\nWhile Columbia University ceded to some of Trump's demands earlier this month, Harvard became the first major US university to take the opposite approach.\n\n\"No government – regardless of which party is in power – should dictate what private universities can teach, whom they can admit and hire, and which areas of study and inquiry they can pursue,\" Harvard's president, Alan Garber, said in a statement on Monday.\n\nMassachusetts Institute of Technology (MIT) followed Harvard's lead on Monday and also rejected the Trump administration's demands. \n\nDespite the criticism, Trump is standing fast. On Tuesday he took another strike against Harvard, threatening to revoke its tax-exempt status.\n\nUniversities, as well as many charities and religious groups, are exempted from paying federal income taxes. This valuable tax break, though, can be removed if the groups become involved in political activities or move away from their stated purposes.","url":"https://www.bbc.com/news/articles/cn0w2656x33o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/ee0e/live/ac1a4c60-1a17-11f0-95f9-83e0a180f556.jpg","video":null,"publish_date":"2025-04-15 18:50:59","author":"Ana Faguy","authors":["Ana Faguy"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.02},{"id":311487404,"title":"AOC Has Strongest Fundraising Quarter, Raking In Close To $10 Million As Her Profile Raises In The Democratic Party","text":"Rep. Alexandria Ocasio-Cortez (AOC) had her largest ever fundraising quarter, raking in close to $10 million as she raises her profile during a time of potential change for the Democratic party, with new faces showing willingness to challenge the old guard.AOC's campaign manager Oliver Hidalgo-Wohlleben said on Tuesday that the funds came from 266,000 individual donors who, in average, gave $21. \"AOC doesn't take a dollar from lobbyists or corporate PACS. Our top donor professions are teachers and nurses. 64% were first time contributors,\" he said.The lawmaker reacted to the figure on X, saying \"I cannot convey enough how grateful I am to the millions of people supporting us with your time, resources, & energy.\" \"Your support has allowed us to rally people together at record scale to organize their communities. All with an avg donation of $21. THANK YOU & pa'lante,\" she added, using an expression in Spanish that means \"onward.\"The donations come as AOC has been touring the country along with Sen. Bernie Sanders, holding rallies aimed at denouncing the Trump administration and mobilizing voters. They have drawn crowds of thousands in different parts of the U.S. At a recent rally she argued about the need to reframe the divide in the Democratic Party not as progressive versus moderate, but as those going after Republican President Donald Trump and those being more cautious.\"No matter who you voted for in the past, no matter if you know all the right words to say, no matter your race, religion, gender identity or status,\" Ocasio-Cortez said at a different rally at Arizona State University. \"No matter even if you disagree with me on a few things. If you are willing to fight for someone you don't know, you are welcome here.\"Attendees in different rallies have called on her to seek higher office, primarying Chuck Schumer for a New York Senate seat in 2028 or even running for president in the next election. A recent survey by Data for Progress considering a potential Senate primary showed the New York City lawmaker ahead by almost 20 percentage points, getting 55% of the vote compared to Schumer's 36%. The poll was conducted on March 31 among 767 likely voters.Politico, which first reported on the survey, described Data for Progress as a liberal firm. The fact that it conducted the poll, the outlet analyzed, \"underscores that liberal organizations are continuing to look for ways to prod Schumer to take a tougher stance against President Donald Trump.\"Another survey by Echelon polled her along with several other Democrats ahead of a potential presidential primary. She got 7% of the support, same as former Transportation Secretary Pete Buttigieg and behind Sen. Cory Booker (11%) and Kamala Harris (28%).About two-thirds of Democrats have a favorable opinion of AOC and just 5% view her unfavorably, according to Gallup polling from January. In her home state, about 4 in 10 New York voters in the November election viewed her favorably while about the same share had an unfavorable opinion, according to AP VoteCast.Other Democrats, however, are still weary of her, painting her as too progressive to appeal to a broad coalition of Americans.\"Her politics are just too far left for this party,\" a chair of a state party that sends a large number of delegates to Democratic presidential conventions told NBC News of Ocasio-Cortez as a potential national candidate. \"I don't agree with most of her policy positions, but she's showing a fight, which a lot of people are looking for their members of Congress to do, and they're just not seeing it.\"Originally published on Latin Times","summary":"Rep. Alexandria Ocasio-Cortez raised over $9.5 million in the last quarter as her profile raises during a time of potential change for the Democratic party","url":"https://www.ibtimes.com/aoc-has-strongest-fundraising-quarter-raking-close-10-million-her-profile-raises-democratic-3770191","image":"https://d.ibtimes.com/en/full/4594162/aoc.jpg","video":null,"publish_date":"2025-04-15 18:49:11","author":"Demian Bio","authors":["Demian Bio"],"language":"en","category":"politics","source_country":"US","sentiment":-0.112},{"id":311485418,"title":"AOC claims Republicans will 'trick' Americans into identity politics, stoking racial divisions","text":"Rep. Alexandria Ocasio-Cortez, D-N.Y., told rally attendees not to let Republicans \"trick\" them into thinking they \"can be separated\" by race or into stoking \"deep divisions along race, identity and culture,\" despite President Donald Trump's recent efforts to rid identity politics from public and private spaces. The progressive \"Squad\" lawmaker's comments came at a \"Fighting Oligarchy\" rally Monday night in Idaho alongside Sen. Bernie Sanders, I-Vt. It was the pair's latest stop in a tour of appearances across the country. \"The only chance they have to get away with such an unpopular and hurtful agenda is to stoke deep divisions along race, identity and culture to keep us fighting and distracted. It's not going to work anymore,\" AOC told rally goers. \"Don't let them trick us into thinking we are enemies. Don't let them trick us into being weak and being into thinking we can be separated into rural and urban, black and white and Latino.\" BERNIE SANDERS COMPARES TRUMP, MUSK AND OTHER ‘OLIGARCHS’ TO ‘HEROIN ADDICTS,’ SAYS DRUG OF CHOICE IS ‘GREED’ The rally with AOC and Sanders was largely centered around criticizing \"billionaire\" oligarchs like Elon Musk, Jeff Bezos, Mark Zuckerberg and President Donald Trump, who, as president, has been leading an anti-DEI push that is aimed at ridding identity politics from public and private spaces. In fact, per political analyst and regular MSNBC contributor Eddie Glaude, identity politics was \"at the heart\" of former Vice President Kamala Harris' election loss to Trump. \"The only thing that was woke or representational about [Kamala Harris'] campaign was her, her body, the fact that she was a woman of color. So I think that the concern, the so-called backlash, to tending to the diversity of the nation actually proves the point,\" Glaude said in an interview with NPR shortly after Republican's November election victories. BERNIE SANDERS SAYS LARGEST ‘FIGHTING OLIGARCHY’ RALLY WITH AOC IS MAKING TRUMP, MUSK ‘VERY NERVOUS’ Meanwhile, since being inaugurated, Trump has implemented executive actions explicitly targeting \"identity politics.\" \"Prior to harmful changes introduced by the Obama and Biden administrations, the United States military offered equality of opportunity to every American capable of and interested in serving their country. Yet these two administrations exploited the military in favor of identity politics—harming our national defense, undermining the non-political nature of our military, and eroding morale and recruitment,\" Trump wrote in one of his first Executive Orders after being sworn in. \"Due to this ‘woke’ assault, the Services together logged their lowest recruiting records since 1940 with a 41,000-troop shortfall in 2023.\" Trump has also taken steps to rid DEI from universities, the federal government and even the private sector. CLICK HERE TO GET THE FOX NEWS APP According to Trump, it was Democrat President Joe Biden who implemented \"illegal and immoral discrimination programs,\" which often tied individual success to immutable factors like race, sex and ethnicity. \"President Trump is restoring fairness and accountability in federal hiring, and terminating DEI across the federal government,\" reads a March fact sheet from the White House.","summary":"Rep. Alexandria Ocasio-Cortez told rally goers Monday evening not to let Republicans &quot;trick&quot; them into thinking they are defined by their race or other immutable characteristics.","url":"https://www.foxnews.com/politics/aoc-claims-republicans-trick-americans-identity-politics-stoking-racial-divisions","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/trump_aoc_identity_politics.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 18:39:15","author":"Alec Schemmel","authors":["Alec Schemmel"],"language":"en","category":"politics","source_country":"us","sentiment":0.04},{"id":311485146,"title":"AOC and Bernie Sanders Handed Major Boost as They Tour Country","text":"Representative Alexandria Ocasio-Cortez and Senator Bernie Sanders have been given a major boost in polling, as more Democratic voters are now open to the party becoming more progressive.Polling from SurveyUSA shows that half of all Democrats want the party to become more progressive. The poll comes during Ocasio-Cortez and Sanders' Fighting Oligarchy tour of America that has been drawing large crowds in Democrat and Republican areas.The survey was conducted among 859 Republicans and 885 Democrats. SurveyUSA did not provide a margin of error for their data.Newsweek has contacted Ocasio-Cortez and Sanders via email for comment.Why It MattersOcasio-Cortez and Sanders have been working to push their party to the left as part of a progressive coalition since being elected to national office in 2018 and 2006, respectively. The polling might influence other Democrats to move to the left as well, now that half of their base wants their party to be more progressive.The poll also found that 40 percent of Republican voters want their party to become more conservative. This could create a wider ideological gulf between parties and voters.What To KnowOcasio-Cortez and Sanders drew a crowd of 20,000 people in Salt Lake City over the weekend. Although Salt Lake County went for Vice President Kamala Harris in 2024, President Donald Trump won Utah with 59.4 percent of the vote.The nationwide Fighting Oligarchy tour has seen the progressive duo hosting rallies to promote progressive politics such as Medicare for All and progressive taxation. The rallies also call out the uber-rich and their influence on American politics.The push for the Democratic Party to become more progressive is shared across age groups, as 51 percent of Democrats 18-49 want the party to lean further left, and 48 percent of age 50+ feel the same.Additionally, half of voters of all races, except Asian Democrats, feel the party needs to become more progressive.Although the SurveyUSA poll found that 40 percent of Republicans want their party to become more conservative, it also found that 34 percent of Democrats who voted for Trump want the Democratic Party to lean more to the left.This is in keeping with the informal poll that Ocasio-Cortez sent out following the election in which she asked if anyone had voted for her and Trump. She also asked why people did that, and one of the common notes was a belief that she and Trump care about the working class.Speaking with Newsweek about why Democrats want their party to lean more to the left, Colin Seeberger, senior adviser for communications at the Center for American Progress Action Fund, said that Sanders and Ocasio-Cortez are not the only voices influencing the party.Cory Booker's record-breaking speech in the Senate was another indication of a Democratic politician showing they are willing to fight the Trump administration. For Seeberger, this is the type of Democratic messaging people want to see from the party.The positive reaction to Booker's speech, according to Seeberger, \"underscores how much people are, you know, really looking for Democratic leaders to stand up and fight back against this very atypical moment that we find ourselves in in our politics.\"What People Are SayingRepresentative Alexandria Ocasio-Cortez at a Fighting Oligarchy rally in Los Angeles: \"Big money is how we got Donald Trump. And his whole presidency began with launching tools for bribery, meme coins to fleece working people and move around money in the dark, extortion settlements from media companies and law firms who gladly pay them.\"Senator Bernie Sanders discussing the Fighting Oligarchy rally in Idaho on X, formerly Twitter: \"We filled an arena of 12,500 people tonight in Nampa, Idaho. Yes, Idaho. Red state, blue state — the American people are prepared to fight Trumpism.\"Colin Seeberger of the Center for American Progress told Newsweek: \"The Democratic Party is a big tent that has views across a wide ideological spectrum. I think both what progressives like AOC and Bernie have tapped into, but also people like Cory Booker, who had a tremendous response and a record-setting speech in the Senate, is voters are responding to elected officials who are being seen as fighting and standing up against a politics that is not normal in this country.\"What Happens NextThe Fighting Oligarchy tour is continuing this month. The next two stops are April 15 in Bakersfield and Folsom, California.","summary":"Two of the Democratic Party's biggest progressive voices have been handed a major polling victory within the party.","url":"https://www.newsweek.com/aoc-bernie-sanders-handed-major-boost-they-tour-country-2060059","image":"https://d.newsweek.com/en/full/2627582/denver-fighting-oligarchy.jpg","video":null,"publish_date":"2025-04-15 18:38:26","author":"Sophie Clark","authors":["Sophie Clark"],"language":"en","source_country":"US","sentiment":-0.555},{"id":311485160,"title":"Barack Obama, Foiled by Black Male Voters, Inspires Ivy League Resistance","text":"Barack Obama's efforts to rally voters against Donald Trump in the 2024 election met an unexpected wall: younger Black and Latino men. Now, just months after Kamala Harris' failed bid to the White House, the former president and elder statesman of the wounded Democratic party is making his voice heard again—not on the campaign trail, but in the halls of higher education.At a speech last week at Hamilton College in New York, Obama delivered a forceful rebuke of what he views as the Trump administration's authoritarian overreach and its targeting of elite American universities.\"It is up to all of us to fix this,\" Obama said during the event, warning citizens, students and institutions alike that \"you may actually have to sacrifice\" to preserve democratic values.Speaking about the Trump administration's move to pull federal funding unless universities dismantle diversity, equity and inclusion (DEI) programs and institute what amounts to federal oversight of their operations, Obama added: \"If you are a university, you may have to figure out: 'Are we, in fact, doing things right?... If not, and you're just being intimidated, well, you should be able to say: 'That's why we got this big endowment'\"​.The White House's campaign to reshape higher education through funding threats is part of a broader ideological push. President Trump and Education Secretary Linda McMahon have targeted Ivy League and other top universities for what they call \"ideological capture\" and \"civil rights failures,\" especially around antisemitism.As schools like Columbia gave in to the pressure from the administration, Harvard pushed back. Within days of the remarks from Obama – perhaps Harvard's most distinguished living alumnus — the university publicly refused to comply with the Trump administration's sweeping list of mandates.What's the cost of defiance? A loss of nearly $2.3 billion in federal grants and contracts. In a striking message to his staff and students, Harvard President Alan Garber declared: \"The University will not surrender its independence or relinquish its constitutional rights\"​.Obama quickly took to social media, praising Harvard's position as \"an example for other higher-ed institutions—rejecting an unlawful and ham-handed attempt to stifle academic freedom\"​.The former president was back in the fight.Not Cautious AnymoreThis moment marks a shift in Obama's post-presidential public life, which has been marked more by lucrative media contracts with tech platforms like Netflix and Spotify than full-throated \"resistance\" politics. Once cautious about overshadowing Democratic candidates like Joe Biden or Kamala Harris, he now appears freer to act—and speak—independently, especially with no clear Democratic frontrunner emerging after Harris' humbling defeat.\"Being a former president is a sensitive role. You don't want to overshadow the current candidate—you want to give them the spotlight while offering support behind the scenes. Obama was very mindful of that balance,\" Veteran Democratic strategist Robert Creamer told Newsweek.Still, the wounds of 2024 are fresh. About three in 10 Black men under 45 voted for Trump, nearly double the share he received in 2020. Young Latino men also broke with the Democratic Party, with only about half voting for Harris—down from 60 percent who backed Biden four years earlier.That shift is personal for Obama, who became America's first Black president on the back of the support of about 95 percent of Black men and roughly three-quarters of young Latino voters in 2008.As Democrats lose ground with these formerly iron-clad supporters, some of the 2024 backlash landed squarely on Obama. In the election's post-mortem, several commentators questioned his delayed engagement in Harris's campaign, with several reports suggesting he had serious doubts about her electability.Imani Cheers, a professor of media and public affairs at George Washington University, told Newsweek that the disconnect wasn't entirely about Obama's influence—it was about who had the loudest megaphone. \"Trump's rhetoric was louder,\" she said. \"People often respond more to the loudest voice in the room.\"Cheers also noted that economic frustrations, particularly around the rising cost of groceries and everyday essentials, played a major role in the president's decisive victory.Creamer echoed that sentiment, emphasizing that Obama shouldn't shoulder the blame for the party's poor performance last year. \"It wasn't his campaign in the first place,\" he said, pointing instead to broader structural issues. Creamer argued that the Democratic Party failed to lead with a \"populist economic message\" that could resonate with working-class voters.Filling The VoidThe Hamilton College event, along with the Harvard standoff, reflects a turning point for the 44th president. \"Now we're at one of those moments where, you know what? It's not enough just to say you're for something; you may actually have to do something,\" Obama said at the leafy campus in Upstate New York.\"Obama is setting that example,\" Creamer told Newsweek. \"And he should be applauded for it.\"That call appears to have been heard. Just a month from Columbia's capitulation to the administration, fellow Ivys like MIT and Yale are following Harvard's lead. This week, both vaunted institutions issued statements reaffirming their commitment to academic freedom and rejecting federal interference in curriculum and admissions policy.The Trump administration, meanwhile, doubled down. In a statement issued Tuesday, a federal task force accused Harvard of embodying a \"troubling entitlement mindset\" and warned other universities that federal investment \"does not come without responsibility.\"President Trump weighed in on Truth Social, arguing that Harvard should be taxed \"as a political entity\" if it continues to promote what he called \"ideological and terrorist-inspired sickness.\" Representative Elise Stefanik, a Harvard graduate and a Republican, also said it was time \"to totally cut off U.S. taxpayer funding to this institution.\"With more than 60 colleges and universities still under federal review, the divide is becoming increasingly clear: some, like Columbia, are willing to yield in order to preserve their funding, while others, like Harvard, are drawing a line in the sand to defend their values.That dividing line is now embodied by the two most admired — and polarizing — presidents of the 21st century. For the prestigious universities that sit at the apex of American higher education, the choice is now: Are you with Trump, or are you with Obama?","summary":"Once cautious about overshadowing Democratic candidates like Joe Biden or Kamala Harris, the former president now appears freer to act independently.","url":"https://www.newsweek.com/barack-obama-foiled-black-male-voters-inspires-ivy-league-resistance-2060102","image":"https://d.newsweek.com/en/full/2627644/barack-obama-hamilton-c.jpg","video":null,"publish_date":"2025-04-15 18:35:56","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","source_country":"US","sentiment":-0.178},{"id":311483472,"title":"Democrats Slam Biden’s ‘Special Level of Chutzpah’ for Making a Comeback Speech","text":"Democrats are furious that former President Joe Biden is set to burst back into the public eye with a speech Tuesday.\n\nBiden, who has kept a low profile since exiting office, will discuss protecting Social Security, which President Donald Trump and Elon Musk have eyed for cuts. And some Democratic insiders are not happy about it.\n\n “It takes a special level of chutzpah as the man most responsible for reelecting Donald Trump to decide it’s your voice that is missing in this moment,” a person who worked closely with Biden’s campaign told Politico. “The country would be better served if he rode off into the sunset.”\n\nOne of Biden’s former donors told Politico that giving a speech was “fine” because “that’s what you expect a former president to do, but I don’t anticipate crowds of Democrats wanting him as a focal point of the national conversation.”\n\nAfter Trump’s victory over Kamala Harris in November, many Democratic insiders threw blame at Biden for only exiting the race after a disastrous debate showing in June, leaving Harris just three months to campaign. Biden left office in January with an approval rating of just 36 percent, matching the lowest of his term, according to CNN.\n\nSince Trump was inaugurated, and amid the whirlwind of challenges to political norms that followed, Biden has had almost no public-facing presence. \n\nHe has limited himself to appearing at a Model United Nations conference, a St. Patrick’s Day brunch, and a convention of the International Brotherhood of Electrical Workers, where he accepted a lifetime achievement award.\n\nA longtime donor had a brutal response when asked by CNN if they had heard from Biden. All they said was, “No. Thank God.”\n\n“I haven’t heard of one person who has communicated with him,” a Democratic member of Congress, who used to speak regularly with Biden, told CNN. \n\nPeople close to him told CNN that his post-presidency has so far been a time for “reconnecting, rebuilding, and reflecting.” He has caught up on books and movies, spent time with his family, and even donned a tuxedo for the opening of Denzel Washington’s Othello on Broadway.\n\nBut despite the concerns of many Democrats, the 82-year-old isn’t ready to fade out of the political fold just yet. And by addressing one of the most sensitive targets of the Trump administration at a time when the president’s popularity has sunk under his market-roiling tariffs, Biden is taking aim at the heart of the conversation.\n\nMartin O’Malley, Biden’s Social Security commissioner, is set to appear alongside the ex-president and address a group of disability advocates in Chicago on Tuesday. He told CNN that he’s glad Biden is speaking out against Trump.\n\n“One of the stabilizing influences in the history of our republic has been the voices of former presidents,” he said. “President Biden’s administration racked up a lot of important progress for the people of our country. I don’t believe that as a party we did the best job we could have in telling that story. But there’s no time like the present.”\n\n“I think with every passing day, people miss him more and more. He’s for sure a net positive,” O’Malley added.","summary":"MANDEL NGAN / POOL/AFP via Getty ImagesDemocrats are furious that former President Joe Biden is set to burst back into the public eye with a speech Tuesday.\n\nBiden, who has kept a low profile since exiting office, will discuss protecting Social Security, which President Donald Trump and Elon Musk have eyed for cuts. And some Democratic insiders are not happy about it.\n\n “It takes a special level of chutzpah as the man most responsible for reelecting Donald Trump to decide it’s your voice that is missing in this moment,” a person who worked closely with Biden’s campaign told Politico. “The country would be better served if he rode off into the sunset.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/democrats-slam-bidens-special-level-of-chutzpah-for-making-a-comeback-speech/","image":"https://www.thedailybeast.com/resizer/v2/YKUX7D35GBH3LEFH433YN7LC74.jpg?smart=true&auth=7098a369a37e26688c10fe8a46acd08ed4f442465238a0f70a531cfa6f6c32ae&width=1440&height=1080","video":null,"publish_date":"2025-04-15 18:22:16","author":"Liam Archacki","authors":["Liam Archacki"],"language":"en","category":"politics","source_country":"us","sentiment":-0.142},{"id":311485426,"title":"Social media erupts after AOC debuts another 'strange' accent at rally: 'Kamala’s playbook'","text":"Democratic Rep. Alexandria Ocasio-Cortez faced blowback from conservatives on social media this week after they accused her of putting on a fake accent at a rally. The progressive New York congresswoman held a rally in Nampa, Idaho, with Sen. Bernie Sanders, I-Vt., who caucuses with Democrats, on Monday where she reportedly drew over 12,000 people and caught the attention of conservatives with one particular clip where she was accused of deliberately changing her tone of voice. \"Oh look, AOC is doing the interchangeable accents to fit the demographic she's in front of,\" conservative influencer account Gunther Eagleman wrote on X. \"Did she take notes from Kamala?\" \"Kamala Harris just introduced yet another new accent,\" conservative influencer Benny Johnson posted on X. \"Sike, this is AOC. Seems to be using Kamala’s playbook. I guess she didn’t pay attention during the 2024 election.\" AOC SLAPPED WITH ETHICS COMPLAINT OVER 'TROUBLING EXPENSES' MADE TO DANCE COMPANY \"AOC is pretending to have some sort of strange accent,\" Townhall.com posted on X. \"This is exactly what Kamala Harris did on the campaign trail. Why do they do this?\" \"WATCH: AOC debuts new accent ahead of reported Presidential run,\" Breaking 911 posted on X. \"It’s worse than Kamala’s or Hillary.\" FETTERMAN TAKES SWIPE AT AOC: 'WE KEPT OUR GOVERNMENT OPEN. DEAL WITH IT' Fox News Digital reached out to AOC’s office for comment. The comparisons to Harris originate from the presidential campaign trail last year when Harris was often criticized for using different accents while speaking to different crowds. CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez has been touring the country with Sanders as part of a \"Fighting Oligarchy\" campaign criticizing Tesla CEO Elon Musk and the Trump administration overall. \"Your presence here today is making Donald Trump and Elon Musk very nervous,\" the 83-year-old Sanders said to loud cheers at a rally in Los Angeles, adding about 36,000 attended the event. The pair have also held rallies in Las Vegas; Tempe and Tuscon, Arizona; and Denver and Greeley, Colorado, and they have several upcoming rallies scheduled. Fox News Digital's Brie Stimson contributed to this report","summary":"Dem. Rep. Ocasio-Cortez is facing accusations of using a &quot;fake&quot; accent at a recent rally similarly to how former VP Kamala Harris was mocked for the same thing last year.","url":"https://www.foxnews.com/politics/social-media-erupts-after-aoc-debuts-another-strange-accent-kamalas-playbook","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/adobe-express-file-17.png?ve=1&tl=1","video":null,"publish_date":"2025-04-15 18:13:09","author":"Andrew Miller","authors":["Andrew Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.064},{"id":311477142,"title":"California voters ‘indifferent’ over potential Kamala Harris run for governor: ‘Surprising lack of enthusiasm’","text":"California policy influencers are “indifferent” about former Vice President Kamala Harris running for governor in the state, a survey conducted by Politico and UC Berkeley’s Citrin Center found.\n\nThe poll surveyed California registered voters and a selected group of policy insiders, who included lawmakers, as well as state and federal government staffers. California’s registered voters were more enthusiastic about Harris than the policy insiders, with 33% reportedly feeling “joyful” about the possibility.\n\nThirty-six percent of the policy influencers said they felt “indifferent” about Harris running for governor. Just 4% said they would be outraged, 22% said they were “mostly excited” and 20% said they were irritated by the potential gubernatorial bid.\n\nHarris has not officially declared her candidacy in her home state, but has vowed to remain active in politics since losing to President Donald Trump in the 2024 election. She is also weighing a bid for the presidency in 2028.\n\nThe former vice president received a low level of enthusiasm among independent voters in California, with 21% saying they felt “hopeless” about Harris potentially running, and 26% saying they felt “irritated” by the possibility.\n\nVoters of color gave a mixed reaction to the possibility of Harris running. While 35% of Black voters felt “joyful” and 38% said they were “mostly excited,” other voters of color weren’t as enthusiastic. \n\nNineteen percent of Latino voters said they felt “hopeless” about the former vice president running in California. Eighteen percent of Asian voters said in the survey that they felt “irritated” by Harris possibly launching a bid.\n\n“It’s almost a surprising lack of enthusiasm,” Jack Citrin, a political science professor at UC Berkeley, told Politico, referring to Latino voters. “But we know from the general election that Latino voters shifted as compared to 2020 or 2016 towards Trump.”\n\nHarris became the 2024 Democratic nominee for president a month after former President Joe Biden decided to exit the race in the weeks that followed his disastrous debate performance against Trump. \n\nThe former vice president cheered the resistance to Trump in a post on social media this month, saying, “Americans are standing up to the administration as they implement Project 2025 at full speed.”","summary":"California policy influencers are \"indifferent\" about former Vice President Kamala Harris running for governor in the state, a survey conducted by Politico and UC Berkeley’s Citrin Center found.","url":"https://nypost.com/2025/04/15/us-news/california-voters-indifferent-over-potential-kamala-harris-run-for-governor/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/102780805.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/zyvliAIY-RyIcpnTz.mp4","publish_date":"2025-04-15 18:13:03","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.202},{"id":311472372,"title":"Texas and California show that Democrats can’t provide ‘abundance’","text":"Newsom’s California almost perfectly personifies why Klein’s abundance agenda would never work for Democrats. When Klein tried to point to Democrats’ overregulation as a reason they could not effectively and efficiently build housing, Newsom made sure to find some Republicans in Huntington Beach to blame it on. According to Newsom, the governor of a state with a Democratic supermajority in the legislature, it is “NIMBY-ism that persists in rural and red parts of the country” that should be blamed for failing housing policies.\n\nWhen asked about his housing goal of 2.5 million units by 2030, Newsom admitted that the state was “not even close” and proceeded to blame the economic condition of the country coming out of the COVID-19 pandemic. The first step to addressing a problem is admitting that you have one, but the partisanship of the Democratic Party, even in a state where Republicans are irrelevant, prevents even that little bit of introspection.\n\nTexas has typically been the Republican foil to California’s Democratic governance, and Texas may, in fact, be the model of “abundance” that Klein supposedly wants. A new report found that Texas is issuing more new housing permits and building more new homes than any state in the country. That includes more new affordable homes than any other state. Texas’s housing market is more affordable than the national market, driven by a wealth of supply: Texas accounts for 12.6% of all U.S. homes for sale, while the state has about 9% of the country’s population.\n\nCalifornia, meanwhile, is about 34 years away from building enough housing to meet the estimated 4 million home shortage the state is facing. Housing costs have been the driving force behind people leaving California for Texas, which is projected to surpass the Golden State in population by 2045.\n\nEnergy is another area where Texas represents abundance and California represents scarcity. Texas brought its upstream oil and gas employment to over 205,000 people as of February. Texas’s oil and gas job growth has helped the state lead the nation in U.S. job creation for 56 of the last 58 months. The average salary for these oil and gas jobs is about $128,000, 74% more than the average of all private sector jobs in Texas.\n\nAn abundance of well-paying jobs powering the country is not the kind of abundance Klein has in mind. As Klein said in another of his media appearances, “I want more clean energy, not more dirty energy. Right? If you come to me with a proposal for how we can build a s*** ton more fossil fuel plants, I am not excited about that. I will oppose you.” Icky oil and gas jobs are not part of Klein’s utopian future.\n\nBut Texas also added more gigawatts of solar and battery capacity in 2024 than California. In 2022, Texas generated more than double the gigawatt-hours of wind and solar energy than California. It is easier to build renewable energy infrastructure in Texas, the king of the domestic oil industry, than in climate-obsessed, Democratic supermajority California.\n\nTexas’s energy grid functions on an abundance of energy. California has made scarcity the focus of its own grid, doing all it can to eliminate oil and gas from the state. The state has even tried to eliminate nuclear energy, which produces no carbon but makes environmentalists uncomfortable enough to brand it as “dirty.” California has instead embraced a rapid transition to a grid powered only by renewable, state-approved green energy sources, such as wind and solar.\n\nThe result was a predictable catastrophe, in which California endured multiple rounds of rolling blackouts because its grid did not provide enough energy to meet demand. California Democrats have since had to backtrack on numerous energy policies, which included the state using temporary gas-field generators to support the grid, Newsom supporting an expansion for a gas storage facility that he campaigned on shutting down, and state officials trying to stop the anti-nuclear momentum they created by keeping the state’s last nuclear plant open, as it provides about 9% of the state’s energy on its own.\n\nTexas has already recognized that a balanced energy grid is the best solution for residents. California has had to be dragged, kicking and screaming, by reality and the terrible political optics of allowing rolling blackouts to reach the same conclusion. One state is willingly practicing “abundance,” and the other is only doing so after years of self-sabotage made it a necessity.\n\nThis is the case for California on issue after issue. California’s burdensome regulatory regime has left residents with fewer insurance options, as insurers have determined it isn’t worth the costs. California is in the process of banning gas cars, gas stoves, and other gas-powered items, forcibly limiting options for residents, who don’t have political connections, to serve the state’s ridiculous climate agenda. That same agenda is behind California banning plastics as well, and the state is trying to export its anti-abundance policies by using its economic power to dictate how farmers in other states do their jobs.\n\nKlein can make California’s failures the focus of his complaints about “abundance” all he wishes, but California is the Democratic model. Former President Joe Biden plucked former Vice President Kamala Harris out of her Senate seat in California and proceeded to model his administration after Newsom’s, one job-killing policy at a time. Biden put multiple California Democrats in his Cabinet, and both liberal media and Newsom offer the state as the model of Democratic governance due to its population and its Democratic supermajority. California is where Democrats are able to act on every legislative and executive impulse they have, and the state’s failures are the result.\n\nKlein should know this all too well. He was the media face of former President Barack Obama’s healthcare reforms, which led to people losing their health insurance plans all across the country. Klein, like the California Democratic Party, thinks that a few intelligent do-gooders can micromanage the government and achieve utopia. The bloated bureaucracies and regulatory regimes that result from this mindset naturally reduce options for people, whether that be in insurance, housing, or energy. It is the inescapable contradiction between “abundance” and “liberalism.”\n\nIf you want an “abundance agenda” for the country, a Republican-run state like Texas would be the model. But you cannot get Texas results with California thinking, meaning you can’t get Texas’s abundance using the same old bureaucratic thinking that comes with a Democratic Party that has been defined by people like Klein and Newsom for the past decade.","summary":"“Abundance” liberalism is the new hot idea among the liberal pundit-chattering class. Left-wing politics is at odds with the goal of abundance, though, which is why Republican states are models for increasing abundance and why Democratic states fail in that regard. The new framing of “abundance” stems from Derek Thompson and Ezra Klein, who have [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3380038/democrats-cant-provide-abundance-texas-california/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/AP23244520674640.webp","video":null,"publish_date":"2025-04-15 18:00:00","author":"Zachary Faria","authors":["Zachary Faria"],"language":"en","category":"politics","source_country":"US","sentiment":-0.3},{"id":311471308,"title":"Left-wing lawmaker calls Trump MAGA's 'buffoon of a leader': 'Thank me later'","text":"Rep. Jasmine Crockett, D-Texas, who last week referred to President Donald Trump as a \"mofo\" — an abbreviated form of the profanity ‘motherf---er’ — has continued leveling colorful attacks against him. In a Monday night post on X she used words including \"buffoon\" and \"orange.\" \"Y’all can keep wasting time on conspiracy theories aka lies about me OR start paying attention to things that actually impact your life like this,\" she wrote when sharing a video in which wealthy investor Ray Dalio said he is concerned about the possibility of \"something worse than a recession … \" LEFT-WING LAWMAKER CALLS TRUMP A ‘MOFO,’ SAYS SOME VOTERS ‘DISQUALIFIED’ KAMALA HARRIS FOR ‘HER RACE & OR SEX’ \"PS Still Single, Childless, no granny drama, no new mysterious wealth (like those that may have engaged in INSIDER TRADING as Trump manipulated the market & produced more wealth for his rich friends), no random mansions, no shady donations (like Elon’s purchase of the Oval Office),\" Crockett continued. \"Unfortunately for MAGA… their buffoon of a leader is every ethical & criminal stereotype that they attribute to me, but the only one that fits the bill isn’t black, but instead orange,\" she declared. \"Thank me later for trying to educate you as your leader wants you left in the dark.\" Fox News Digital reached out to Crockett's office on Tuesday but did not receive a comment by the time of publication. The White House replied to a comment request on Tuesday by sending a previously reported statement from spokesperson Harrison Fields. \"Crockett and her followers in the Democratic Party are simply all hammer and no nail. When she's leading the Democrats in ‘oversight,’ that's when you know the party is in shambles. Her constituents should DOGE her in the next election.\" MEET THE ARMY VETERAN RUNNING TO UNSEAT EMERGING TRUMP RESISTANCE LEADER CROCKETT: ‘TEARING OUR COUNTRY DOWN’ Crockett said on MSNBC last week that \"the fact that no one is questioning\" Trump's \"mental acuity or fitness to serve is beyond wild to me.\" Contrary to the congresswoman's comments, a memo from the physician to the president states that \"President Trump exhibits excellent cognitive and physical health and is fully fit to execute the duties of the Commander-in-Chief and Head of State.\" However, the insults have been flying in both directions, with Trump blasting Crockett as well. REP. JASMINE CROCKETT SUGGESTS THE UNITED STATES NEEDS ILLEGAL IMMIGRANTS BECAUSE ‘WE DONE PICKING COTTON' CLICK HERE TO GET THE FOX NEWS APP Trump called Crockett a \"very low-IQ person and a lowlife\" during an interview with radio host Vince Coglianese last month. \"She can't speak. She can't get the words out of her mouth,\" he said of Crockett, noting that he \"can't see her going very far in politics.\" During remarks at a National Republican Congressional Committee event last week, the president said that if Crockett is the Democrats' \"new star\" the party is in \"serious trouble.\"","summary":"Rep. Jasmine Crockett, a progressive Democratic House lawmaker, called President Donald Trump a &quot;buffoon&quot; as she continued lobbing colorful attacks against him.","url":"https://www.foxnews.com/politics/left-wing-lawmaker-calls-trump-magas-buffoon-leader-thank-me-later","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/crockett-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 17:40:12","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","category":"politics","source_country":"US","sentiment":-0.175},{"id":311472366,"title":"RNC chairman says Trump ‘tickdown’ in support still puts him ahead of Democrats","text":"“The American people don’t want to see fraud, waste, and abuse in the federal government,” Whatley argued on Fox News’s America’s Newsroom. “They do not want to see open borders. They want to make sure that America’s going to be strong. So the president may have a slight tick down in this poll or that poll, and he may be a slight tick up in other polls, but the fact is he is dramatically more popular right now than the Democratic Party because of the agenda that he is pushing. The common sense agenda of rebuilding our economy, restoring the southern border, and keeping communities safe.”\n\nAhead of the 2026 midterm elections, Whatley acknowledged that the Democratic Party has “a ton of money” to outspend the Republican Party. However, he stressed that Republicans cannot think “for a second” that outspending the opposing party is key to victory. Rather, he said Republicans should focus on finance and other factors to advocate Trump, including volunteers, infrastructure, and election integrity. \n\nWhatley also addressed how a Republican organization raised $13 million in the first three months of 2025, saying this reflects people’s desire to see Trump’s agenda advance beyond just two years. As such, he said the Republican Party’s mission should be ensuring it keeps control of Congress so Trump can cooperate with the House and Senate for his full term.\n\nREPUBLICANS SHOULD ADDRESS WELFARE’S WORK DISINCENTIVES IN BUDGET RECONCILIATION\n\nLast week, Sabato’s Crystal Ball suggested that the Democratic Party could narrowly win a couple more seats, with 19 congressional seats considered toss-ups. Kyle Kondik, managing editor of Sabato’s Crystal Ball, said both parties have some advantages. However, the biggest deciding factor will be what happens in the 19 months leading up to Election Day in 2026.\n\nThis year’s elections will see the governor’s mansion up for grabs in Virginia and New Jersey, both states that went to former Vice President Kamala Harris despite Republicans gaining some ground in the 2024 presidential election. Gov. Brian Kemp (R-GA), chairman of the Republican Governors Association, expressed enthusiasm for both elections following Trump’s victory against Harris.","summary":"Republican National Committee Chairman Michael Whatley downplayed concerns that President Donald Trump&#8216;s legislative actions could dent his support ahead of the 2026 midterm elections, suggesting he is still “dramatically” more popular than the Democratic Party.  Whatley said the Democratic Party is “rudderless” ahead of former President Joe Biden&#8216;s first speech on Tuesday since leaving the [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3380856/rnc-chairman-michael-whatley-trump-tickdown-support-still-puts-him-ahead-democrats/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/Whatley-ahead-of-2026-scaled-1024x683.webp","video":null,"publish_date":"2025-04-15 17:22:51","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.069},{"id":311529746,"title":"Missions, Mantras, Migrants and Microchips: A History of the Indo-Us Encounter, 1492 to the Present","text":"The book is a refreshing version of a bilateral relationship that continues to evolve in a way that few would have imagined some years ago\n\nThere is never a dull moment in India-United States relations. Still rarely is the compulsion or desire to look how bilateral relations even evolved beyond cliched notions of the Second World War, Cold War, post-Cold War, globalisation and so on. And it takes an eminent historian like Leonard Gordon to look back into history and weave a sequence of events that would tickle the mind of a policy maker in New Delhi and Washington or an ordinary person thinking big about the American dream.\n\nMissions, Mantras, Migrants and Microchips is not just a story of the bilateral encounter from 1492 to the present. It is a well-researched document that gives perspective on history and international relations. For those who are dismayed now that the Trump administration is trying to do away with birthright citizenship or perceived to be placing obstacles to a Green Card and an American Passport, Gordon reminds the reader of the times of the 1920s and 1930s when South Asians were denied citizenship based on something called “colour”. Still, from a handful of immigrants even till about the 1980s, the Indian American community is a force to reckon with today, economically, socially and politically.\n\nGordon is not just a historian; rather is a person deeply involved in civilizations who connects the dots in areas that few have ventured. In the case of India-US the author quietly navigates India under the British rule and how the Americans came to be involved in a country as missionaries and merchants to start with. Even many Indians would have forgotten the antecedents of the Christian Medical College in Vellore, a first-rate facility and other medical institutions started by an American missionary, Ira Scudder. Well, that is one of the many that Gordon highlights, not to forget the political games the British and Americans were playing out in India.\n\nDepth and width of relationships\n\nBut Missions were not a one-way street… they were followed by mantras, migrants and then the influx in the late 1960s and beyond. One of the things that Gordon highlights throughout his masterpiece is that the wisdom, depth and width of India and the US encounter cannot be seen only through the likes of Jawaharlal Nehru and Martin Luther King but also through folks rarely remembered. “Who, these days, has heard of Kumar Goshal, Ida Scudder, J. Krishnamurthi, Charles Page Perin, John Bissell or even Maharishi Mahesh Yogi?” Gordon thoughtfully asks.\n\nThe “account” as the author notes is in four parts: the Age of Empires which would be Colombus to 1919; The Age of Gandhi, 1919 to 1948; New Nations in a Divided World or from 1947 to the present; and the Cultural Explosion of the South Asian Diaspora between 1947 and now. And these four sections are traced through themes of Missions, Mantras, Migrants and Microchips with the fifth “M” being the Mahatma. “Gandhi’s ideas simplified and stripped of some of their cultural content, have enriched American views of freedom, the good society and the means to achieve them,” the author says.\n\nThe American interest and interaction with India as Gordon so eloquently paints cannot be mechanically seen in terms of the Thirteen Colonies trying to shake off the British Empire or in American merchants trying for a stake in the East Indies. Seen differently it was not just a simple exchange of missionaries and their respective perceptions and trying to shake off entrenched belief structures in each other’s societies. “It is not possible to understand the US’ complicated relationship with India without looking back at the complicated and nuanced history — that converged in the Boston Tea Party — not only of the two countries but also the development of worldwide connections and empires,” Gordon notes.\n\nIn ways more than one Gordon offers a refreshing version of a bilateral relationship that continues to evolve and in the framework of influences and circumstances that few would have imagined some years or decades ago. From literally nobody in Who’s Who at the start of the 20th century, a person of Indian/South Asian heritage, Kamala Harris, almost made it to the White House in the November 2024 elections after being a Vice President for four years under the Biden administration; and currently Indian American Usha Vance enjoys her position as Second Lady of the United States.\n\nModern makers of bilateral ties\n\nThere are different strands of thought that have been pursued in this lengthy but readable work; and singling out one or two of them would do injustice to not only the broader theme of discussion but also to the author who has spent years researching and spending hours with relevant people and in the process also highlighting the professional difficulties in an academic exercise like getting a visa. But the bottom line of this marvellous exercise is not just remembering the modern makers of bilateral ties associated with Silicon Valley or the elites of Washington DC but also remembering the forgotten souls of yesteryears.\n\nFor all the heady discussion these days in the US on immigration there is a message that Gordon conveys in his conclusion that perhaps succinctly wraps up any discussion of the ups and downs of a bilateral relationship. “Some want to seal the borders, though they, too, are immigrants or the children of immigrants. It is unlikely that these wall builders will be successful. Frontiers are too porous, the desire to come and work in America too powerful. This nation is, as it has long been, on the move. A good deal of the past has been terrible. Some of it positive. This is likely the course of the future as well,” is a fitting conclusion.\n\n(The reviewer is a senior journalist having been in Washington D.C. for 14 years covering North America and the United States; and in academics for more than a decade as Professor and Deputy Dean in the Faculty of Science and Humanities, SRMIST)\n\nTitle: Missions, Mantras, Migrants and Microchips: A History of the Indo-Us Encounter, 1492 to the Present\n\nAuthor: Leonard Gordon\n\nPublisher: Penguin/India Viking\n\nPrice: ₹784\n\nAmazon Link: Missions, Mantras, Migrants and Microchips: A History of the Indo-Us Encounter, 1492 to the Present\n\nPublished on April 15, 2025","summary":"Looking beyond simple links in India-US relations","url":"https://www.thehindubusinessline.com/books/reviews/missions-mantras-migrants-and-microchips-a-history-of-the-indo-us-encounter-1492-to-the-present/article69454114.ece","image":"https://bl-i.thgim.com/public/incoming/e56mcr/article69454111.ece/alternates/LANDSCAPE_1200/811oE2CSRPL._SY522_.jpg","video":null,"publish_date":"2025-04-15 17:15:55","author":"Sridhar","authors":["Sridhar"],"language":"en","source_country":"in","sentiment":0.558},{"id":311469660,"title":"AOC’s massive speaking tour has far-right scrambling for new way to discredit her","text":"Right-wing influencers are accusing Rep. Alexandria Ocasio-Cortez (D-N.Y.) of switching the way she speaks in hopes of drumming up support for a future presidential run.\n\nThe progressive representative has firmly dismissed rumors about a run in 2028, even as recent polls show Ocasio-Cortez is a top contender in the minds of those surveyed.\n\nBut as Ocasio-Cortez hits the road with Sen. Bernie Sanders (I-Vt.) on their anti-Trump administration “Fighting Oligarchy” tour, murmurs about a presidential future for Ocasio-Cortez are only growing, given the duo’s massive crowds.\n\nAnd some right-wingers think they’ve found a clear signal of Ocasio-Cortez’s intentions: the supposed accent she’s using at the rallies.\n\n“AOC tries to sound presidential with new accent,” blasted one right-wing conspiracy theorist. \n\nA number of her critics highlighted another clip of Ocasio-Cortez saying that when President Donald Trump “talks about rapists and criminals, he should look in the mirror” as evidence of the new accent.\n\n“Oh look, AOC is doing the interchangeable accents to fit the demographic she’s in front of,” accused one influencer. “Did she take notes from Kamala?”\n\n“Kamala 2.0,” echoed someone else.\n\n“It’s worse than Kamala’s or Hillary’s,” dug one right-wing aggregator.\n\nBoth former Vice President Kamala Harris and Secretary of State Hillary Clinton drew bad-faith criticism for their dialects while campaigning for president—with the right accusing the two Democrats of pandering.\n\nThe criticism particularly ramped up when Harris was on the campaign trail after replacing former President Joe Biden in 2024, as conservatives online accused her of using a “fake” accent. \n\nMany speech experts, however, noted that accusations of fake accents ignored the realities of code-switching when speaking to different groups. \n\nOne critic of AOC referenced the accusation against Harris, saying: “It’s the Kamala Harris Irish-Jamaican accent!”\n\n“Hahaha they are all so fake!” concluded another of both Harris and Ocasio-Cortez.\n\n“Kamala Harris just introduced yet another new accent. Sike, this is AOC,” wrote a right-wing influencer. “Seems to be using Kamala’s playbook. I guess she didn’t pay attention during the 2024 election.”\n\nInternet culture is chaotic—but we’ll break it down for you in one daily email. Sign up for the Daily Dot’s web_crawlr newsletter here. You’ll get the best (and worst) of the internet straight into your inbox.","summary":"Right-wing influencers are accusing Rep. Alexandria Ocasio-Cortez (D-N.Y.) of switching the way she speaks in hopes of drumming up support for a future presidential run.\n\n\n\n\n\n\n\n\nThe progressive representative has firmly dismissed rumors about a run in 2028, even as recent polls show Ocasio-Cortez is a top contender in the minds of those surveyed.\n\n\n\n\n\n\n\n\nBut as Ocasio-Cortez hits the road with Sen. Bernie Sanders (I-Vt.) on their anti-Trump administration \"Fighting Oligarchy\" tour, murmurs about a presidential future for Ocasio-Cortez are only growing, given the duo's massive crowds.\n\n\n\n\n\n\n\n\nAnd some right-wingers think they've found a clear signal of Ocasio-Cortez's intentions: the supposed accent she's using at the rallies.\n\n\n\n\n\n\n\n\n\"AOC tries to sound presidential with new accent,\" blasted one right-wing conspiracy theorist. \n\n\n\n\n\n\n\n\n\n\nhttps://twitter.com/MattWallace888/status/1911950744510685300/?foo=bar\n\n\n\n\n\n\n\n\nA number of her critics highlighted another clip of Ocasio-Cortez saying that when President Do","url":"https://www.dailydot.com/debug/aoc-accent-rally-ocasio-cortez/","image":"https://uploads.dailydot.com/2025/04/aoc_accent_2028_bid.jpg?auto=compress&fm=pjpg","video":null,"publish_date":"2025-04-15 17:06:34","author":"Katherine Huggins","authors":["Katherine Huggins"],"language":"en","category":"politics","source_country":"US","sentiment":-0.156},{"id":311457668,"title":"AOC rallies thousands in red America by blasting 'criminal' Trump","text":"Progressive Rep. Alexandria Ocasio-Cortez of New York headlined a “Fight Oligarchy” rally with Vermont Sen. Bernie Sanders in one of the reddest states in the country on Monday night, attracting thousands of people.\n\nThe event attracted at least 12,500 people to the Ford Idaho Center in Nampa, Idaho, according to organizers. Idaho was the third-strongest state for Donald Trump in the 2024 presidential election, where he won 66.9% of the vote to Democrat Kamala Harris’ 30.4%. Canyon County, where the Ocasio-Cortez/Sanders event was held, was even redder, with Trump winning 72.0% of the vote there.\n\nBut Ocasio-Cortez’s message received a raucous reception in the heart of Trump country.\n\n“Donald Trump is a criminal who was found guilty of 34 felony counts of fraud. Liable for sexual abuse. Of course, he’s lying and abusing and manipulating the stock market too,” she said. “When he talks about rapists and criminals, he should look in the mirror.”\n\nShe criticized the influence of corporate money over political votes, noting that too many politicians receive campaign donations “tied up in pharmaceutical, oil and gas, or defense company stocks.”\n\nOcasio-Cortez singled out Republican Rep. Marjorie Taylor Greene for her recent purchases of stocks after the market took a hit from Trump’s tariff announcements and her profiteering after Trump retreated on the issue.\n\n“How much did you make off of people’s despair? How much did you make off that panic? How much did you make off of that suffering?” she asked, accusing Trump of manipulating the market for his friends.\n\nThe congresswoman also called out Trump for abducting dissenters and sending them to nations like El Salvador while musing about expanding those abuses to Americans.\n\n“Today, we just saw President Trump express openness to taking U.S. citizens and sending them off, without due process, to foreign prisons. It’s anti-American,” she said.\n\nThe rally was another sign that as Republicans continue to hide from the public, refusing to face the backlash from months of hostile actions from Trump and co-President Elon Musk, Democrats and progressives are listening to them.\n\nOcasio-Cortez has emerged as a leader for Democrats, even as many voters have soured on the party for insufficient opposition to Trump.\n\nIn a poll released on Sunday by CNN/SSRS, while only 29% of Americans expressed a favorable opinion of Democrats, Ocasio-Cortez was the leader whom most Democrats and Democratic-leaning independents said reflects the core values of the party. She was ahead of other notable figures like former President Barack Obama, Senate Minority Leader Chuck Schumer, former Speaker Nancy Pelosi, and even recent Democratic presidential candidate Kamala Harris.\n\nTop Trump administration figures like immigration “czar” Tom Homan have in recent months pushed for Ocasio-Cortez to be silent and stop voicing opposition to Trump. As thousands in Idaho have now witnessed, she isn’t backing down.","summary":"Progressive Rep. Alexandria Ocasio-Cortez of New York headlined a “Fight Oligarchy” rally with Vermont Sen. Bernie Sanders in one of the reddest states in the country on Monday night, attracting thousands of people.\n\n\n\nThe event attracted at least 12,500 people to the Ford Idaho Center in Nampa, Idaho, according to organizers. Idaho was the third-strongest state for Donald Trump in the 2024 presidential election, where he won 66.9% of the vote to Democrat Kamala Harris’ 30.4%. Canyon County, where the Ocasio-Cortez/Sanders event was held, was even redder, with Trump winning 72.0% of the vote there.\n\n\n\nBut Ocasio-Cortez’s message received a raucous reception in the heart of Trump country.\n\n\n\n“Donald Trump is a criminal who was found guilty of 34 felony counts of fraud. Liable for sexual abuse. Of course, he’s lying and abusing and manipulating the stock market too,” she said. “When he talks about rapists and criminals, he should look in the mirror.”\n\n\n\n\nx\n\n\nx\nYouTube Video\n\n\nShe criticized the influence of cor","url":"https://www.dailykos.com/story/2025/4/15/2316572/-AOC-rallies-thousands-in-red-America-by-blasting-criminal-Trump?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1421341/story_image/AP25080103975467.jpg?1744732359","video":null,"publish_date":"2025-04-15 17:00:14","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.352},{"id":311445332,"title":"Marjorie Taylor Greene brings town hall to Harris-won Georgia county, shrugs off possible 'outbursts'","text":"Rep. Marjorie Taylor Greene, R-Ga., is facing her constituents in a critical swing county for an in-person town hall on Tuesday, despite House GOP leaders' warnings earlier this year to step back from such events amid progressive groups' coordinated efforts to derail them. Greene said she organized her event months before House Republican leaders' guidance but that it did not dissuade her from hosting them. \"This has been on my calendar for a long time. And yes, we have seen Republican town halls targeted by Democrat protesters, and it's well-organized by the Democrat Party,\" Greene told Fox News Digital in a brief interview. \"We even had leadership recommend to do tele-town halls. And for me that that is absolutely unacceptable. There's no way I'm going to sit on a telephone and talk to the people in my district… I've done town halls ever since I was elected, starting back in 2021. So I love to do them.\" Known as a conservative bomb-thrower and close ally of President Donald Trump, Greene is hosting her event in Cobb County – an area encompassing the Atlanta suburbs that former Vice President Kamala Harris won by roughly 15% last November. SENATE GOP PUSHES TRUMP BUDGET FRAMEWORK THROUGH AFTER MARATHON VOTE SERIES It's a more moderate spot in Greene's otherwise deep red district – but the congresswoman said its politics did not factor into her decision. \"The reason why we picked that part of the district is it's the newest part of the district for me, because of redistricting. And so this is a new part of Cobb County that I've gained in my district, and I think they're great, and I want to go down there and speak with them,\" Greene said. \"They just voted for me for the first time in November. I like to pay attention to my district. And so I want to do my first town hall there.\" \"It has nothing to do with population or anything. Actually, I can tell you right now, I can get in much deeper red parts of my district and draw much bigger crowds. So this was about paying attention to the newest part of my district,\" Greene added. She's one of few Republican lawmakers holding an in-person town hall during Congress' two-week Easter break away from Washington. It comes after progressive groups like Indivisible and MoveOn staged a series of coordinated protests at GOP lawmakers' town halls and other events. Even town halls held by Greene's fellow Georgia delegation members have been derailed by activists – who in some cases have traveled from other districts – jeering and booing GOP policies. MEET THE TRUMP-PICKED LAWMAKERS GIVING SPEAKER JOHNSON A FULL HOUSE GOP CONFERENCE But Greene's town hall will see additional security measures aimed at ensuring disruptions are at a minimum. The address is only provided to registered attendees, who must be living in Greene's district to gain entry. \"I'm not sure how other members do it, but we only allow people that actually live in the district to come to the town hall. This isn't a place for political grandstanding, protesting and outbursts,\" Greene said. \"We take their sign-up information. They have to show their ID when they come in the door and match up the sign-up list. And then we told them well ahead of time, if they want to stand up and interrupt and scream and yell, and have big outbursts, and use this as a protest, they're going to get thrown out.\" She added that she welcomed all of her constituents, Republicans and Democrats. \"We expect them to behave well. And we expect them to be, you know, respectful. And we're going to have a great town hall, and I cannot wait for it,\" Greene said. The majority of coordinated protests have centered on the Department of Government Efficiency (DOGE) and Elon Musk – one of Indivisible's specific protest campaigns was labeled \"Musk or Us,\" and one of its most recent off-shoots targeted a town hall held by Rep. Mike Flood, R-Neb., in his red Midwestern district. Greene, who chairs the House Oversight Committee's subcommittee on DOGE, said she anticipated the topic would come up, albeit under calmer circumstances. \"DOGE, I think, is going to be a big topic. And being the chairwoman of the DOJ's subcommittee on Oversight, I cannot wait to inform my constituents about what's happening there, as well as reconciliation, which is what Congress will be working on over the next few weeks and even further until we get that done,\" she said. CLICK HERE TO GET THE FOX NEWS APP Another topic Greene anticipated was Trump's tariffs, and \"how that's helping America.\" \"And I think there'll be questions about immigration enforcement deportations. And I can't wait to talk about that, because I think President Trump and his entire administration is literally saving our country by deporting murderers and rapists and cartels,\" Greene said. \"When I come back home to my district, I grocery shop by myself, I go to Home Depot, I go to restaurants. I literally live in my community. So I really know people here. I know what they care about. So I feel very confident to be able to answer their questions.\"","summary":"Rep. Marjorie Taylor Greene spoke with Fox News Digital ahead of her Tuesday evening town hall in Cobb County.","url":"https://www.foxnews.com/politics/marjorie-taylor-greene-brings-town-hall-harris-won-georgia-county-shrugs-off-possible-outbursts","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/greene-harris-townhall.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 16:23:25","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","source_country":"US","sentiment":-0.122},{"id":311472582,"title":"Piers Morgan confronts WaPo columnist on why he won’t call out Jeff Bezos over Trump","text":"Washington Post columnist Josh Rogin confessed to Piers Morgan this week that he can’t call out his paper’s owner in the same manner he recently did to Bill Maher for “falling into the trap” of being used by Donald Trump, noting that Jeff Bezos could potentially fire him for his criticism.\n\nThe admission by Rogin comes days after a fiery exchange on Maher’s HBO show Real Time, which also incidentally featured Morgan. During a panel discussion, Rogin challenged Maher for breaking bread with Trump after being an outspoken critic of the president for years, suggesting the comic had become a pawn in the president’s latest “PR stunt.”\n\nRogin’s remarks, which did not sit well with Maher, came after the late-night host agreed to meet with Trump for a private dinner that was arranged by MAGA country rocker Kid Rock. Speaking about the meeting for the first time on his Friday broadcast, Maher praised a “gracious” Trump for making him “feel comfortable” and insisted that he never felt he “had to walk on eggshells around” the president.\n\n“A crazy person doesn’t live in the White House. A person who plays a crazy person on TV a lot lives there, which I know is f***ed up. It’s just not as f***ed up as I thought it was,” he told viewers, adding: “I get it. It doesn’t matter who he is at a private dinner with a comedian. It matters who he is on the world stage. I’m just taking it as a positive that this person exists. Because everything I’ve ever not liked about him was — I swear to God — absent.”\n\nTrying his best not to offend Maher and give him the benefit of the doubt that his dinner with Trump was in “good faith,” Rogin nevertheless said that he felt the president took advantage of the opportunity.\n\n“I think you’ve fallen into the trap, and I think I represent 99 percent of the internet when I say this: you’ve played the game of proximity is principle. I’m not questioning your motivation; I’m questioning Trump’s, OK?” Rogin told Maher.\n\n“You don’t have to patronize me, dude. I don’t know you. I’ve never met you,” a perturbed Maher snapped back. He would fume about the exchange the rest of the show, coming back to Rogin’s “little rant” later in the discussion.\n\nMorgan, who sided with Maher on Friday night, invited Rogin onto Monday night’s broadcast of his own show Uncensored and put the Washington Post writer on the spot when it comes to his own boss. \n\nBezos, of course, notoriously blocked the Post’s endorsement of Democratic presidential nominee Kamala Harris just days before the 2024 election and announced a new mandate for the paper’s opinion section, which has sparked concerns that he’s currying favor with Trump by softening the publication’s coverage of the president. The Amazon founder also donated money to Trump’s inauguration fund, gave Trump’s wife $40 million to stream her documentary, and dined with Trump following his dramatic change to the Post’s opinion page. \n\n“You work for the Washington Post. Your owner, Jeff Bezos, has done a lot more than Bill Maher in crossing the divide with Trump,” Morgan addressed Rogin. “He used to be very critical of Trump. But in the last year and a half or so, or since his shooting actually, he seems to have performed a massive U-turn on Trump.”\n\nAfter listing all of the ways that Bezos has cozied up to Trump in the past year, Morgan then asked: “I mean, as a Washington Post senior journalist, how do you feel about all that?”\n\nClaiming he “wasn’t trying to criticize” Maher on Friday, Rogin insisted that he was trying to push back on the notion that “engagement with Trump” can actually create a “bridge towards healing the cultural divide.” At the same time, he said that when “business leaders go to meet with Trump, that’s a different set of calculations.”\n\nRegarding Bezos, who is currently the second wealthiest man in the world, Rogin said that he’s “not privy to what goes on at the ownership level” at the Post and that he merely works there. “I’m not part of the management. I’m not part of ownership. I’ve never met Jeff Bezos. I don’t know what his calculations are. And I know that’s above my pay grade,” he continued, insisting that he wasn’t trying to “duck” Morgan’s question.\n\n“Look, if it looks like a duck and it sounds like a duck, it’s probably a duck,” Morgan shot back. “I mean, you can appreciate that if you’re Bill Maher watching you refusing to be remotely critical of what your own owner has done with Trump in terms of kissing the ring, you could potentially see that he might think there’s a double standard there.”\n\nMorgan’s needling of Rogin forced the columnist to confess why he wasn’t able to point that same critical lens at the Blue Origin owner.\n\n“You know, I see what you’re trying to do, Piers, but I’m not in a position to comment on Jeff Bezos, because if I comment on Jeff Bezos then I could be fired from my job and you know that, so I’m not going to do that,” Rogin flatly stated.\n\n“But at the same time, I want to be honest with you so I don’t seem to be dodging your question,” he continued. “And my honest answer from my heart is, every person that engages with this administration, including all the people on this panel – including you, including me – has to make that judgment based on their own calculations of their own values and their own interests, and we have to be careful not to judge each other for where we all come down on that.”\n\nIn the end, Rogin acknowledged that Morgan’s viewers would likely not be pleased with his response but that this was as good as it was going to get lest he jeopardize his own employment.\n\n“That is my effort to answer you honestly, Piers, without getting fired from my job but to try to prove to you that I do have a very consistent philosophy on this,” he concluded. “Which is not going to please the Trumpsters and is not gonna please the liberals, because I’m neither a Trumpster nor a liberal.”","summary":"‘If it looks like a duck and it sounds like a duck, it’s probably a duck,’ Piers Morgan reacted when Josh Rogin claimed he wasn’t trying to dodge the question","url":"https://www.independent.co.uk/news/world/americas/us-politics/bezos-bill-maher-trump-hypocrisy-washington-post-b2733803.html","image":"https://static.independent.co.uk/2025/04/15/15/55/Screenshot-Capture-2025-04-15-10-56-08.png?trim=0,136,0,136&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/c7NFoEzv-OhrQWqOm.mp4","publish_date":"2025-04-15 16:14:24","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":0.011},{"id":311433642,"title":"President Bukele won't return wrongly deported man from El Salvador prison","text":"HuffPost UKTrump Has Responded To Russia's Latest Missile Strike By Attacking A President – And It's Not PutinDozens of civilians were killed as they made their way to church to mark Palm Sunday.\n\nHuffPost UKJD Vance Slaps Down Zelenskyy's Fear About US's Attitude Towards Russia With 1 WordThere's no love lost between the US vice president and the Ukrainian leader.\n\n Why this ad?Go ad-free* \n\nThe IndependentTrump has a deep grudge against Zelensky - but he’s now taken it further than ever beforeNEWS ANALYSIS: Trump’s victim-shaming of Ukraine is ugly and symptomatic of something more dangerous, writes world affairs editor Sam Kiley\n\nSportBibleWhite House announce Donald Trump's official weight after regular golf trips and it's left people stunnedTrump's weight has been examined after regular golf rounds.\n\nThe HillCarville: Trump ‘has broken the cardinal rule in American politics’Longtime Democratic strategist James Carville said in a Monday op-ed that President Trump “has broken the cardinal rule in American politics” amid economic anxiety about the president’s tariffs. “In what will certainly be recorded as one of the most ignorant acts of political leadership in American history, the president of the United States has now…\n\n Why this ad?Go ad-free* \n\nHuffPostAlexandria Ocasio-Cortez Hits Marjorie Taylor Greene With 1 Damning QuestionThe New York Democrat slammed the Georgia Republican for stock trades just before Trump announced his tariff pause.\n\nSportBibleLegendary musician revealed what Donald Trump is really like to play golf with amid 'cheating' allegationsThe US President is well known for buying and owning multiple golf courses.\n\nAFPChina tells airlines to suspend Boeing jet deliveries: reportChina has told its airlines to stop taking deliveries of jets from American aviation giant Boeing, a report said Tuesday, as a trade war between Beijing and the United States deepens.Bloomberg News reported Tuesday that China had also ordered airlines to halt deliveries of Boeing planes, citing people familiar with the matter.\n\n Why this ad?Go ad-free* \n\nFortuneThe White House pressed for fast negotiations with its shock and awe tariffs. Now it can’t drum up enough interest from a ‘first mover’The rhetoric out of Trump’s cabinet on tariffs is changing, with Scott Bessent pushing for a “first mover” to sign on the dotted line for a deal with the U.S.\n\nBirmingham LiveDWP issues new statement on state pension triple lockThe Government has come under pressure over frozen tax thresholds\n\nHuffPostWall Street Journal Skewers Trump’s Tariffs Chaos As A Triple Whammy For Americans“Welcome to the new tariff economy...\" wrote the newspaper's conservative editorial board.\n\n Why this ad?Go ad-free* \n\nThe IndependentBillionaire hedge fund leader warns US facing something ‘worse than a recession’US ‘very close’ to a recession after weeks of Trump tariff instability, warns Ray Dalio\n\nThe Telegraph‘Everything is grinding to a halt’: China digs in after Trump shockThe Great War of China. Dollar wreckoning. This memes war.\n\nAFP'Don't take part in this war', Chinese soldiers captured in Ukraine warnUkraine on Monday held a press conference at which Chinese prisoners of war under armed guard told journalists they hoped to be swapped and warned other Chinese nationals not to go to fight.Two Chinese men dressed in camouflage uniform were escorted into a Kyiv press centre in handcuffs and sat flanked by armed Ukrainian soldiers, with no way of telling whether they were expressing themselves of their own free will.\n\n Why this ad?Go ad-free* \n\nAssociated PressPresident Trump says CBS and '60 Minutes' should 'pay a big price' for going after himPresident Donald Trump bitterly attacked “60 Minutes” shortly after the CBS newsmagazine broadcast stories on Ukraine and Greenland on Sunday, saying the network was out of control and should “pay a big price” for going after him. “Almost every week, 60 Minutes ... mentions the name ‘TRUMP’ in a derogatory and defamatory way, but this Weekend's ‘BROADCAST’ tops them all,” the president said on his Truth Social platform. Trump has an ongoing $20 billion lawsuit against “60 Minutes” for how it edited an interview with Democratic presidential candidate Kamala Harris last fall.\n\nThe TelegraphWhat Americans think of Trump’s tariffsDonald Trump’s “liberation day” tariffs sent international markets into a panic, plunging indexes to new lows and unnerving investors globally. Despite a slight reprieve owing to his subsequent 90-day pause, the world remains on edge.\n\nHuffPostVolodymyr Zelenskyy Says JD Vance Is ‘Somehow Justifying’ Putin’s War In UkraineThe Ukrainian president called on Donald Trump to visit his country before engaging in any further negotiations to end the conflict.\n\n Why this ad?Go ad-free* \n\nPA Media: UK NewsMore migrants arrive in UK after record English Channel crossingsPictures showed people wearing life jackets coming ashore from a Border Force vessel in Dover on Monday.\n\nPA Media: UK NewsRetailers warn Chinese sellers ‘dumping’ goods on UK marketplacesThe boss of Currys said there are early signs that stock meant for the US is already being diverted to the UK.\n\nBenzingaAnthony Scaramucci Compares Market Drop To Pandemic Panic. 'Trump Is The Virus, And The Only Cure Is The 25th Amendment'Anthony Scaramucci, the former White House communications director turned fierce Trump critic, says President Donald Trump’s chaotic trade policies are wreaking havoc on the markets, and the damage isn’t just economic. ‘Trump Is the Virus,’ Says Former Aide “This is COVID-like selling, but now Trump is the virus and there is no cure. Except the 25th Amendment,” Scaramucci posted on X on Monday. The post came as stocks reeled from Trump’s aggressive new tariffs, which were announced as part of hi","url":"https://uk.news.yahoo.com/president-bukele-wont-return-wrongly-160000452.html","image":"https://s.yimg.com/ny/api/res/1.2/wHupNTkVkFNE7CFPGo.MQQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/kameraone_537/4e26535fa0ac2aaab19c5c4bbcff6f02","video":"","publish_date":"2025-04-15 16:00:00","author":"Kameraone","authors":["Kameraone"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.091},{"id":311443546,"title":"Johnson Rakes in $32 Million in Q1","text":"House Speaker Mike Johnson has raised a whopping $32.2 million in campaign funds during the first quarter of the year since Republicans swept into the trifecta governance in Washington of the presidency and both houses of Congress.\n\nThe speaker has given $5 million to the National Republican Congressional Committee and $4 million to Republican incumbents. His team called the haul the most amount of money raised during a single quarter ever. \n\nReacting to the quarterly report, Johnson posted on X, “After we defended our majority, the American people are enthusiastic about keeping House Republicans on offense in 2026. While we deliver our America First agenda, we are also building a massive war chest by hitting the ground running in the first quarter.”\n\nBut Democrats have outperformed Republicans in fundraising, and that has shown up in the numbers. The NRCC had $15 million at the end of February with $11.2 million in debt, compared to the its counterpart Democratic Congressional Campaign Committee, which had $26 million and owed $12.5 million. The NRCC raised $9.2 million, while the DCCC raised more than $11 million. \n\nJohnson has shepherded House Republicans through an impressive number of legislative victories, including passage of the SAVE Act last week and voting to strike down the Consumer Financial Protection Bureau’s overdraft fee cap from the Biden administration. Johnson is currently working on a budget bill, which is aimed at cementing Trump administration policies on defense and border security. \n\nPresident Donald Trump remains a popular figure, having raised $35 million last week at a dinner hosted by the NRCC. The overall political landscape for the 2026 midterms will, as always, also be heavily impacted by super PACs with billionaires on both sides of the political aisle weighing in. \n\nLast month, more than $90 million was poured into the Wisconsin Supreme Court race, almost doubling what was spent on another seat on the state’s highest court in 2023. That race had set the previous record at $51 million. Much of that came from a handful of wealthy individuals including leftist billionaire George Soros; Illinois Democratic Gov. JB Pritzker, an heir to the Hyatt Hotel empire, and industrialist Elon Musk. The Republican candidate for the Wisconsin high court seat lost that race, although Badger State residents also voted to enshrine voter ID requirements into their state constitution.\n\nIt’s not uncommon now for Democrats, whose party increasingly skews wealthier, to outraise Republicans. For example, between January 2023 and October 16, 2024, then-President Joe Biden and then the successor Kamala Harris campaign committee raised $997.2 million, whereas the Trump campaign raised only $388 million. However, financial advantages do not always translate into electoral victory.","summary":"House Speaker Mike Johnson has raised a whopping $32.2 million in campaign funds during the first quarter of the year since Republicans swept into the... Read More\n\n\nThe post Johnson Rakes in $32 Million in Q1 appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/04/15/mike-johnson-rakes-32-million/","image":"https://www.dailysignal.com/wp-content/uploads/2025/04/mike-johnson-1024x532.png","video":null,"publish_date":"2025-04-15 15:46:21","author":"Jacob Adams","authors":["Jacob Adams"],"language":"en","category":"politics","source_country":"us","sentiment":-0.075},{"id":311496378,"title":"Democrats in disarray","text":"Nearly six months into the drubbing of 2024, Democrats seem to be still coming to terms with what happened at the hustings. Worse, for all the gasping at what has been going on since January 20, 2025, the party seems leaderless and directionless in terms of even putting up a token of a resistance in the hallways of Congress or outside.\n\nForget former President Joe Biden for a second, the former Vice-President and Democratic contender last November, Kamala Harris, is still making up her mind on her next course of political action. Will she contest the Governor’s race in 2026 or immerse herself in the next Presidential contest of 2028? At least those in the fray for the California top spot want to know soon.\n\nIt is difficult to be taken in by the argument that Democrats are still calculating why the party did so badly in November 2024 or why only after the first debate last June did the party painfully come to the conclusion that Biden was too weak on the ticket. Many writers and media pundits have made the point that the inner circle of Biden, including family members, were in denial. Biden was clearly not “up to it” even before he took the stage for the first debate in Atlanta on June 27, 2024, many are convinced.\n\nAs an after thought some have been making the point that Biden went back on his word and entered the 2024 race after saying in 2020 that he was a transitional President. Others wonder if Harris would have won the White House if she had more than 107 days to prepare for the showdown.\n\nWith Biden tanking in the polls, Harris was asked in one of her rare interviews in October 2024 if she would have done anything different than her boss. Her stunning response: “… there is not a thing that comes to mind”. This partly explains the debacle of 2024.\n\nMisplaced outrage\n\nEqually difficult is understanding the outrage of Democrats to the goings on in Washington. On every issue starting with immigration, jobs slashing, tariffs, Canada, Greenland, and so on President Donald Trump had clearly indicated how he would be proceeding. The only thing different is that the President has further fine tuned his ideas to fall in line with his base, the Make America Great Again (MAGA) crowd for the most part. If there is disbelief it is because Democrats did not expect him to go through or did not think he would pull it off last November.\n\nNot long ago, veteran Democratic strategist, James Carville, who has seen many an election, argued that the best thing for Democrats to do would be to let Trump and Company have their way and sink under their own weight instead of fighting on every imaginable issue as was done in Trump’s first term.\n\n“Sometimes the most powerful thing we can do is retreat on the immediate battlefield — and advance in another direction”, Carville wrote, stressing the need for Democrats to look for good candidates in 2026 as they did in 2018.\n\nDemocrats would do well to listen carefully to what Carville has said. This is not the time to argue about a loss that was well on the cards given the campaign styles. It is hardly going to matter if Biden is going to say anything different in his new book that is supposedly in the works.\n\nThe bottomline for Democrats is to come up with a coherent message and an effective messenger for November 3, 2026 mid-terms; not resting on history that the party of the President sitting in the Oval Office loses.\n\nThe writer is a senior journalist who has reported from Washington DC on North America and UN\n\nPublished on April 15, 2025","summary":"The party must focus now on the Nov’26 mid-terms","url":"https://www.thehindubusinessline.com/opinion/democrats-in-disarray/article69453704.ece","image":"https://bl-i.thgim.com/public/incoming/2tdh48/article69453712.ece/alternates/LANDSCAPE_1200/BL19_Think_US_democratic.jpg","video":null,"publish_date":"2025-04-15 15:35:27","author":"Sridhar","authors":["Sridhar"],"language":"en","category":"politics","source_country":"in","sentiment":-0.301},{"id":311517786,"title":"‘You Are the Purveyors of Hate’: Lemon Blames GOP for PA Arson Attack","text":"The Don Lemon Show\nApril 14, 2025\n\nDON LEMON: So, MAGA is silent this morning. The White House is silent this morning. Donald Trump is silent this morning. They don't have a thing to say about one of the most horrific acts of political terrorism this country has seen in some time.\n\nThis is awful. I don't know if you paid attention to it. As I said, I just couldn't watch after a while. I had to stop, especially after this happened. I'm like, oh my God, what is going on in the world? And why isn't someone condemning this from the highest heights in the White House? Right? Why isn't someone condemning this? One of the most horrific acts of political terrorism in this country has seen in some time.\n\nOver the weekend, authorities say a man scaled an iron security fence in the middle of the night, everyone, eluded police and broke into the Pennsylvania governor's mansion. Where he set a massive fire, and then he attempted to murder Josh Shapiro with a hammer.\n\nNow, you guys remember when that happened to Nancy Pelosi's husband, right? And then the right made fun of it. Remember that? And then they tried to pretend it was some sort of love affair, some hookup gone wrong. All kinds of conspiracy theories. And they did it not just on the fringe media, they did it in the mainstream media as well. The big right-wing news organizations were laughing and joking about it.\n\n“The silence speaks volumes.” You're right about that, Marlene Prosser, it does.\n\nAnd so now you have this. Now imagine, if Kamala Harris was in office and something like this happened and there was no statement or nothing, and you didn't hear anything, people weren't condemning it. Imagine what would happen. What would folks be saying about this? What would they be saying about this, had this happened and then a Democrat didn't say anything?\n\nMr. Shapiro, Governor Shapiro and his family fortunately escaped just in the nick of time. They're okay. Cody Balmer, who was arrested later in the day, faces charges including attempted homicide, terrorism, aggravated arson, and aggravated assault. During a police interview, authorities said that Cody Balmer told them, after he was taken into custody, that he would have beaten Shapiro with a small sledgehammer if he would have found him. That's what the documents say.\n\nSo this is what I'm saying to you guys. This is, this is what I mean about what is going on in the country. Where are our priorities? Where are the priorities today? Is it in a rocket? Is it in stopping stuff like this? Because there's a reason that there's so much hate going around. There's a reason that there's so much anti-Semitism and so much racism going around, and there's a lot of it. There's a look – and it's not just, you know, one political party and all that stuff, but you can place it at the feet of one person who didn't start this but certainly exacerbates it and foments hate and bigotry.\n\nLEMON: So, I was just listening to the thing and Donald Trump said he had only just heard of the attack. And look, he will probably respond I'm sure, hopefully he will respond in depth, but I don't see many people, many Republicans or anyone speaking out against this. And I just know if had it been the other way around, it would have been people in the MAGA folks would have been going crazy. ‘I can't believe Kamala Harris, she's condoning this. Why aren't Democrats doing whatever.’\n\nSo, I think Republicans speak out, say something. Not just like a measly little statement. ‘Have my, uh, have, have uh have Barbara draw up a statement for me uh to this and whatever, and have him put it out on social media.’ No, let's say something. Don't just draw up the statement.\n\nAnd the Governor is right, this is happening far too often. Now, I say it is not exclusive to one political party, but it certainly is – it certainly does happen more on one side. Hate. January 6. The racism. The bigotry. The anti-Semitism. The transphobia. The homophobia. It certainly does happen on one side more than the other. And they don't speak out about it enough.\n\nSo, yeah, does it happen on the Democratic side? Yeah, but not to the extent that it happens on the Republican side, especially with MAGA. Let's just be honest. It seems to be part of the, I mean, that's the, not the cog, that's a thing that makes the MAGA wheel spin. That's the motor. That's the axle. Is hatred and bigotry.\n\nSo, let's hope someone responds. Governor, I'm with you, my Jewish brothers and sisters over this Passover, and over the weekend, I'm with you as well. I wanna see more people start speaking out more about it. Say something, Donald Trump, more than just I haven't heard about it, and some wrote statement. Say something Republicans about the hate every single time it happens. Every single time it happens. And don't try to spin it as to that Democrats always do it, only do it, and Republicans, somehow MAGA is not doing it when you are the purveyors of hate.","summary":"Over the weekend, Pennsylvania Democratic Governor Josh Shapiro was the target of a possible politically motived arson attack at the Governor’s mansion by a man with a history of mental illness and animosity towards both parties. But minutes after the news broke on Monday, disgraced former CNN host Don Lemon took to his podcast to blame President Trump, MAGA, and Republicans in general for the attack and every bad act in America; proclaiming: “You are the purveyors of hate!”\n\nDespite the news being very fresh, Lemon decried that “MAGA is silent this morning. The White House is silent this morning. Donald Trump is silent this morning.” Meanwhile, Trump did call the man responsible for the attack a “whack job.”\n\nLemon seemed to catch himself as he launched into a hyperbolic statement suggesting the arson attack was worse than the assassination attempts on Trump. “They don't have a thing to say about one of the most horrific acts of political terrorism this country has seen in some time,” he said.\n\nHe never gave","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/04/15/you-are-purveyors-hate-lemon-blames-gop-pa-arson-attack","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-04/2025-04-14-Don-Lemon-Blames-Trump-MAGA-for-Arson-Attack-Against-PA-Gov_0.jpg?itok=i7YKofz6","video":null,"publish_date":"2025-04-15 15:33:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","category":"politics","source_country":"US","sentiment":-0.46},{"id":311472606,"title":"Illinois Gov. JB Pritzker ‘not decided’ on third term amid 2028 rumors","text":"Illinois Governor JB Pritzker has said he has “not decided” on whether to run for a third term in office, fueling rumors that he may be mulling a run for the Democratic presidential nomination in 2028.\n\n“I have not decided if I’m running for re-election,” Pritzker told NBC Chicago, looking ahead to the state’s 2026 gubernatorial race.\n\nThe governor has already raised eyebrows by skipping a pre-slating meeting with Cook County Democrats as preparations for the next campaign cycle get underway, dismissing speculation about his motives on the basis that he has missed out on the gathering before.\n\n“When I did it in the past, it was when I was thinking about running the first time [in 2018],” he said.\n\nPressed on whether his absence might indicate a future bid for the presidency, Pritzker coyly conceded that it remains “a possibility.”\n\nThe governor, a member of the wealthy dynasty behind the Hyatt hotel chain and a former venture capitalist, was a prominent critic of President Donald Trump during his first term in the White House. \n\nHe also played a prominent role at last summer’s Democratic National Convention in Chicago and was floated as a potential running mate for Kamala Harris before she chose his Minnesota counterpart Tim Walz.\n\nAs Democrats continue to lick their wounds following November’s scarring election defeat and attempt to get to grips with the new Trump administration, the party has yet to unite around a single figure who might lead it into an uncertain post-Biden future.\n\nFellow state governors Gavin Newsom and Gretchen Whitmer have been widely seen as potential 2028 candidates and have made preliminary moves toward the center.\n\nVermont Senator Bernie Sanders and New York Representative Alexandria Ocasio-Cortez, representing the progressive wing of the party, have meanwhile drawn crowds at public gatherings protesting Trump’s policies.\n\nMore unexpectedly, outspoken sports commentator Stephen A Smith has also emerged as a contender, even attracting the attention of former Trump adviser Kellyanne Conway.\n\nConway appeared on Fox News’s Jesse Watters Primetime on Monday and spoke of him in admiring terms while dismissing Sanders and Ocasio-Cortez as “boring.”\n\n“Stephen A Smith is intriguing to me, because [Barack] Obama was an outsider. Donald Trump certainly was a political outsider,” she said.\n\n“Electability, the lack of electability, is going to haunt Stephen A Smith, but it’s a gift to him, because the moment people say he can’t win, voters say, ‘I don’t care who can win. I care who can lead.’”","summary":"Illinois governor with long track record of standing up to Donald Trump suggests he could make a bid for the White House","url":"https://www.independent.co.uk/news/world/americas/us-politics/jd-pritzker-2028-presidential-run-b2733727.html","image":"https://static.independent.co.uk/2025/02/19/11/Illinois_Governor_Screen_Free_Schools_73428.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/Kn9pQTZ1-4VHSaSK0.mp4","publish_date":"2025-04-15 15:30:53","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":-0.215},{"id":311434790,"title":"Column: Gov. Whitmer's party should learn from what she did in the Oval Office","text":"Kudos to Michigan Gov. Gretchen Whitmer. She managed to generate the most negatively iconic photo of a Democrat since Michael Dukakis wore a helmet atop a tank. Whitmer, long considered a promising presidential prospect by Democratic insiders, was at the White House to discuss state business. But when Donald Trump’s aides whisked her into the Oval Office, it was not for the planned one-on-one with the president, but for a photo op during which the Trump signed (outrageous) executive orders targeting two perceived political enemies for criminal investigation. Realizing that she was in a political tiger pit, Whitmer opted for the Ostrich Maneuver. Lacking sand to stick her head in, she hid her face behind some binders. The photo perfectly encapsulates Democratic dysfunction. Her White House visit was wholly defensible, but because she was in the room when Trump was doing something indefensible, she’s being vilified by her own side for enabling Trump, generating more “Dems in disarray” drama in the process. Of course, the Dems really are in disarray. If you just go by the topline 2024 presidential election returns, it’s not obvious they should be. Kamala Harris lost by 1.48% of the popular vote, the fifth closest election since 1900. And yet, Democrats are a mess. In March, the party hit its all-time low in popularity. Last week — a bad week for Trump — Quinnipiac released a poll finding that voters are evenly split — 33% to 33% — on the question of which party cares more about them and their problems. Democrats had led on that question by double digits, going back to 1994. “This to me is the most shocking pieces of poll data that I truthfully have seen this year, maybe in any prior year,” CNN’s polling guru Harry Enten exclaimed. The main driver of the Democrats' plight is that the party that likes to see itself as the party of the little guy is perceived, not inaccurately, as the party of urban and coastal elites by the largest chunk of the electorate: white voters without a college degree. More broadly, voters remain profoundly distrustful of elite institutions, and progressives have dominated most of those institutions for decades. What the Democrats can do to fix themselves and voters’ perception is the subject of intense internal debate. At least four options have emerged. The first is to replay the “resist!” theatrics of the first Trump term. The second is the “Fight the Oligarchy!” tour headlined by Sen. Bernie Sanders and Rep. Alexendra Ocasio-Cortez, which made a splash in California over the weekend. Both approaches are psychologically appealing to Democrats because they require no philosophical introspection or political self-correction. Not so Option 3. “Abundance” is the buzzword and book title for a technocratic theory of “supply-side liberalism” that seeks to clear away the red tape and interest-group NIMBYism standing in the way of government planners who want to expedite the delivery of public services — housing, high speed rail, etc. This course has the most to recommend it. But it has three political weaknesses. First, the bureaucratic bottlenecks that the abundance Dems want to circumvent are closely guarded by progressive constituencies. If you want to bulldoze through the Clean Water or Endangered Species acts, you won’t be picking fights with a lot of Republicans. You’ll be antagonizing well-heeled Democrats and a liberal-dominated media that reflexively casts such efforts in a negative light. Second, national Democrats are powerless in the Republican-controlled House and Senate. So absent a truly courageous governor, they can’t demonstrate the efficacy of their ideas. Last, it essentially represents a bunch of elite eggheads saying “trust us, we’re different now” when no one trusts them. Ironically, the fourth option is symbolically close to what Whitmer did: Hide. Or, as James Carville puts it, “Play dead.” Keep your head down and powder dry while Trump self-immolates. I think this is, by far, the wisest course in the short term. Trump’s approval, most notably on the economy, is plummeting. A majority — 54% — of Americans think Trump’s policies are responsible for the state of the economy. If trends continue Trump will lose support from the groups that believed he could deliver on his economic promises. The problem is the long term. Our politics are broken because both parties have given up on the idea of being majority parties. When out of power, they rely on turning out their bases and the unpopularity of their incumbent opponents to squeak out narrow victories, only to squander power on fan service to their bases once elected. This cycle can be broken only by a party that, when elected, opts to build a majority from the center-out. I see no sign of that happening anytime soon. @JonahDispatch","summary":"Democrats have four options for a comeback.  The best one for now: the Ostrich Maneuver","url":"https://www.latimes.com/opinion/story/2025-04-15/gretchen-whitmer-oval-office-photograph-democrats","image":"https://ca-times.brightspotcdn.com/dims4/default/15618b1/2147483647/strip/true/crop/2336x1226+0+1139/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbc%2Fac%2Ff12c0e06442785e369d556371b62%2Fhttps-delivery-gett","video":null,"publish_date":"2025-04-15 15:30:36","author":"Jonah Goldberg","authors":["Jonah Goldberg"],"language":"en","category":"politics","source_country":"us","sentiment":-0.269},{"id":311439472,"title":"Trump-Loving Influencer Who Gifted Him a Rolex Says He’s Lost ‘Eight Figures’ in Stock Crash—Wants Kamala Harris Back!","text":"Donald Trump’s supporter Adin Ross might now be open to changing sides. The influencer didn’t hold back while admitting how Trump’s latest move hit him where it hurts. Ross revealed how he has taken a massive hit financially thanks to Trump’s tariff agenda.\n\nAdin Ross is best known for being an internet personality. The 23-year-old is an internet gamer and is known to have a liking towards Donald Trump. So much so that he has even gifted the 78-year-old a Rolex before. Safe to say the gold custom MAGA-themed Tesla Cybertruck watch cost the gamer a fortune.\n\nDuring a recent live stream, the influencer shared how the tariffs that Trump has imposed have put him in financial distress. Ross revealed that the recent stock market crash made him lose around “eight figured.”\n\nDJ Akademiks, who had joined Ross in the live stream, also had something to say about the economic state of the US. “People are getting killed. Me too. We all are,” he noted.\n\nRoss seemed to acknowledge how bad the current stock market crash is in reply to the DJ’s comment. “It’s bad, I’m not gonna lie to you,” he admitted. The gamer also added how he hoped that things would get “better” but at the moment they remain to stay bad.\n\n“You over here like, damn, Kamala, come back to me,” the DJ added The Kamala that the DJ seemed to be referring to was former Vice President Kamala Harris. With that statement alone, we are left to ponder if Trump supporters are now shifting sides thanks to his extreme economic reforms.\n\nKamala Harris is hammering Trump’s tariff plan accurately as a de facto national sales tax, ” He intends to cut social security and medicare. And he wants to impose what is in effect a national sales tax that will cost a typical family $3,900 a year.” pic.twitter.com/5pJzmqGRfh\n— Sarah Reese Jones (@PoliticusSarah) August 21, 2024\n\nHarris had somewhat foreseen the future during her Presidential campaign. The Diplomat had criticized Trump’s tariff plan and predicted exactly this outcome. The former VCP had noted how the Republican’s plan would leave adverse effects on the US economy. The recent state of the stock market just seems to be a testament to Harris’ prediction.\n\nThe criticism towards the Trump administration keeps increasing as they continue to take drastic measures. The government’s recent aggressive deportation procedures have been widely criticized by the citizens. Trump’s statement about wanting to send US citizens to the El Salvador high-security prison has left people baffled.\n\nReporter: “The President of El Salvador said he would be willing to take American citizens [into his prison camps].”\nTrump: “I love that… I’d be honored to give them… if they can house these criminals… I’m all for it.”\nThis is totalitarianism.pic.twitter.com/7EvPFmSDhF\n— Joshua Reed Eakle 🗽 (@JoshEakle) April 7, 2025\n\nThe work that the DOGE is doing under the supervision has also been a topic of discussion for supporters and critics alike. The last straw for the people of America seemed to be the unreasonably high tariffs that the President decided to impose on imported goods.\n\nEvery decision that the President has taken since being in office has met with resistance from the opposition. But now, the current state of the country has forced even loyal supporters like Ross to acknowledge how bad the conditions are getting under the Trump administration.\n\nWhich raises an important question for Trump to reflect on: Does teamwork make the dreamwork if you have no team left on your side at the end of the day?","summary":"Loyal Donald Trump supporter asks to bring Kamala Harris back amid tariff wars and stock market crashes.","url":"https://www.inquisitr.com/donald-trump-loving-influencer-who-gifted-him-a-rolex-says-hes-lost-eight-figures-in-stock-crash-wants-kamala-harris-back","image":"https://www.inquisitr.com/wp-content/uploads/2025/04/Donald-Trump-and-Kamala-Harris.jpg","video":null,"publish_date":"2025-04-15 14:31:59","author":"Vaishnavi Shetye","authors":["Vaishnavi Shetye"],"language":"en","category":"politics","source_country":"US","sentiment":-0.117},{"id":311425748,"title":"Katy Perry Boasts About Ridiculous Rocket Launch While NASA Is Scrubbing History of Women in Space","text":"Upon returning to Earth on Monday following her 11-minute trip to Earth's outer atmosphere onboard a Blue Origin spacecraft, pop star Katy Perry — still decked in her custom blue flightsuit and full-coverage glam — told reporters that her brief adventure in low orbit was for \"future women.\" And \"Earth.\" Or both, we guess?\n\n\"It's about making space for future women and taking up space and belonging,\" Perry gushed, explaining that she sang Louis Armstrong's \"What a Wonderful World\" whilst in orbit onboard the Blue Origin's New Shepard. \"And it's about this wonderful world that we see right out there and appreciating it.\"\n\n\"This is all for the benefit of Earth,\" she added.\n\nPerry's word salad is, in part, a callout to the six-person flight crew's all-woman makeup, which has been central to the spectacle's framing. That's not an accident: the flight was organized by Lauren Sánchez, the former news anchor and helicopter pilot best known today as fiancée to Blue Origin's founder and the world's second-richest man Jeff Bezos, with Sánchez cryptically telling Vogue back in 2023 that the mission — then still in its nascency — would be \"paving the way for women.\" (It was later revealed that Sánchez would be joined by Perry; the journalist and broadcast personality Gayle King; film producer Kerianne Flynn; civil rights activist Amanda Nguyen; and Aisha Bowe, a former aerospace engineer for the National Aeronautics and Space Administration.)\n\nTo be clear, Monday's flight didn't mark the first time that a rocket made it out of Earth's atmosphere without a man onboard. That honor belongs to Valentina Tereshkova, the Russian cosmonaut who became the first woman in space after making a solo trip into the cosmos back in 1963. And while all these women are certainly accomplished in their respective fields, there's an insidious hollowness to the sweeping characterization of the flight as a great achievement for women that's somehow paving roads for aspiring future space travelers — particularly by Perry and Sánchez — that's deeply, and cynically, at odds with the way that new federal mandates about diversity policies are actively working to erase women's legacy in American space exploration.\n\nAs has been widely reported, NASA has been incredibly hard-hit by the Trump Administration's chaotic and widespread attacks on what it refers to as diversity, equity, and inclusion (DEI) policies. Last month, the Orlando Sentinel first reported, NASA scrubbed language from a webpage about the agency's Artemis missions declaring that a goal of the mission was to put the first woman and first person of color on the Moon; just a few days later, NASA Watch reported that comic books imagining the first woman on the Moon had been deleted from NASA's website.\n\nA webpage for \"Women at NASA\" is still standing, but pictures of women and people of color — astronauts, engineers, scientists — have reportedly been removed from NASA's real-world hallways amid the so-called \"DEI\" purge. Per Scientific American, the word \"inclusion\" has been removed as one of NASA's core pillars. And as 404 Media reported in February, NASA personnel were directed to remove mentions of women in leadership positions from its website.\n\nThese purges haven't just impacted the hard-earned visibility for women and minorities at NASA and across the American space sciences, whose work has been integral to the furthering of American space exploration. As The Verge reported last month, the administration's anti-DEI mandates — which intersect with ongoing confusion and chaos around federal funding cuts and layoffs, scientific censorship, and attacks on universities and research institutions — are wreaking havoc within the American space science landscape at large, threatening to make missions to space less safe.\n\n\"The 1986 Challenger disaster — in which seven crew members were killed when their Space Shuttle broke apart shortly after launch — was directly linked to a homogeneity of thought among NASA personnel,\" wrote acclaimed space journalist Georgina Torbett for the Verge. \"The agency's lack of diverse perspectives fed into the tendency toward groupthink that contributed to the disaster, while research has shown that more cultural and ethnic diversity in groups leads to more creative and higher quality ideas — and lower risks for space missions.\"\n\nThough Blue Origin and its most famous flyers repeatedly promoted the 11-minute journey as a push to get a diverse mix of young people interested in the sciences and achieving their dreams — Perry, for her part, told Elle Magazine for a pre-launch cover story that she hoped the trip would \"inspire a whole new generation and make space and science glam\" — nothing about the flight was particularly scientific or boundary-pushing. This was Blue Origin's eleventh successful space tourism flight. And while two of the flight's crewmembers do have backgrounds in STEM, as Amanda Hess noted in The New York Times, the crew's \"central mission\" wasn't to conduct science but \"to experience weightlessness, view the Earth from above, and livestream it.\"\n\n\"They are like payload specialists,\" Hess wrote, \"with a specialty in marketing private rockets.\"\n\nAnd then there's Blue Origin's founder, to which the supposedly historic all-women crew is inextricably linked. On the same day that president Donald Trump issued the executive order that caused NASA to erase its declaration that it would soon put a diverse group of astronauts on the Moon, and peel images celebrating the diversity of its spacefarers and scientists from its walls, Bezos stood — alongside several other billionaire Big Tech CEOs, together on prominent display — behind the returning commander-in-chief. (Several months before, Bezos, who owns The Washington Post, killed the paper editorial board's endorsement of then-vice-president Kamala Harris for president, and has since reorientied its opinion pages in \"support and defense of two pillars: personal liberties and free markets.\") Next to him was Sánchez. For the occasion, she wore suffragette white.\n\nIn case you're wondering, the space travelers didn't have anything to say about NASA's purge of material about women or the Trump administration's attack on science. Instead, speaking to Elle ahead of the flight, the crewmates discussed wearing makeup and doing their hair for the brief spaceflight.\n\n\"Who would not get glam before the flight?!\" Sánchez told the magazine.\n\n\"Space is going to finally be glam,\" added Perry. \"If I could take glam up with me, I would do that. We are going to put the 'ass' in astronaut.\"\n\nIn Perry's case, her vacant brand of empowerment feels sadly reminiscent of her recent refusal to address criticism of her decision to work with the music producer Łukasz \"Dr. Luke\" Gottwald on her latest album, including to produce an attempt at a feminist anthem titled \"Woman's World.\" In 2014, fellow musician Kesha Sebert — of \"TiK ToK\" fame — filed a bombshell lawsuit accusing Gottwald of drugging and raping her shortly after she signed to his record label at the age of 18, and subjecting her to years of \"mental manipulation\" and \"emotional abuse\" thereafter (Gottwald quickly sued Sebert for defamation, and the two parties finally settled the case in 2023 after a decade-long legal battle.)\n\nWhen asked about working with Gottwald for her recent album on the popular \"Call Her Daddy\" podcast, Perry didn't seem to think it was a big deal.\n\n\"Look, I understand that it started a lot of conversations,\" Perry meekly responded, adding that Gottwald \"was one of many collaborators that I collaborated with.\"\n\nAs Hess notes for the NYT, over 100 women have gone to space since Sally Ride's historic 1983 flight; even so, women remain deeply underrepresented in astronomy and space exploration. And to that end, going to space for the good of all women, or the \"benefit of Earth,\" or even to make science \"glam,\" are much better stories than \"a centibillionaire and his fiancée said I could go to space on their penis-shaped rocket, I wanted to go, and I wanted to look good for it.\"\n\nAt best, Perry and Sánchez are cosplaying in ChatGPT-generated feminism, searching for excuses to paint billionaire-funded space tourism as something more than what it was. At worst, though, their framing of their mission as a path-carving, glass-shattering step for women obfiscuates the very real attacks on women and minorities across the American sciences that threaten the legacy of the real women spacefarers and scientists who came before Sánchez, Perry, and company — and in turn, the direction of the young women who dream of furthering American space exploration in the future.\n\nMore on The Perry Flight: Chat Relentlessly Mocks Katy Perry's \"Space Trip\"","summary":"Upon returning to Earth on Monday following her 11-minute into Earth's outer atmosphere onboard a Blue Origin spacecraft, the pop star Katy Perry — still in her blue Monse flightsuit, and in full glam — told reporters that her brief adventure in low orbit was for \"future women.\" And \"Earth.\" Or both, we guess? \"It's about making space for future women and taking up space and belonging. And it's about this wonderful world that we see right out there and appreciating it,\" said Perry, explaining that she sang Louis Armstrong's \"What a Wonderful World\" whilst in orbit onboard the Blue Origin's […]","url":"https://futurism.com/katy-perry-rocket-nasa-scrubbing-women","image":"https://wordpress-assets.futurism.com/2025/04/katy-perry-rocket-nasa-scrubbing-women.jpg","video":null,"publish_date":"2025-04-15 14:25:53","author":"Maggie Harrison Dupré","authors":["Maggie Harrison Dupré"],"language":"en","source_country":"us","sentiment":0.088},{"id":311443548,"title":"Democrats Are Being Dishonest About Extending Tax Cuts","text":"It’s Tax Day in the United States. “Republicans believe every day is the Fourth of July, but the Democrats believe every day is April 15,” President Ronald Reagan quipped during his 1984 reelection campaign. But Tax Day will be much worse next year if Republicans don’t extend our signature 2017 legislation—the Tax Cuts and Jobs Act—and Democrats are trying to deceive the American people about the impact.\n\nThe Left’s lies about the act are nothing new. The New York Times noted in 2019 that most Americans received a tax cut from the 2017 tax reform but simply didn’t believe it.\n\n“To a large degree, the gap between perception and reality on the tax cuts appears to flow from a sustained—and misleading—effort by liberal opponents of the law to brand it as a broad middle-class tax increase,” the paper wrote.\n\nThe New York Times was right, but Democrats continued the drumbeat of deceit.\n\nThen-House Minority Leader Nancy Pelosi claimed middle-class Americans would only receive “crumbs” from the bill. Those “crumbs” equated to lower taxes, higher wages, and bonuses.\n\nIn 2019, then-presidential candidate Kamala Harris tweeted that because average tax refunds were down about $170, the law must be a tax hike. The Washington Post had to correct her, noting, “The size of the tax refund has no bearing on whether a person’s taxes rose or fell. A person might end up giving less of their income to the IRS—and still end up with a smaller tax refund.” In other words, Americans enjoyed lower taxes throughout the entire year, not just on April 15.\n\nAnd in 2021, then-House Democratic Caucus Chair Hakeem Jeffries told MSNBC, “83% of the benefits went to the wealthiest 1%, and they saddled us with approximately $2 trillion in debt to subsidize the lifestyle of the rich and shameless.”\n\nThe statement was so bad, The Washington Post upgraded its fact check from two “Pinocchios” to three and called it a “zombie claim.” That’s because Jeffries and Democrats were relying on projections of what would happen after significant provisions in the Tax Cuts and Jobs Act expired—the same provisions Republicans are trying to save and Democrats are trying to stop.\n\nTo be clear: Democrats were and are criticizing Republicans by using future projections when some Tax Cuts and Jobs Act provisions expire while doing everything they can to stop us from extending the provisions that would prevent that scenario.\n\nSince 2017, the flow of misinformation has convinced a broad swath of Americans that they didn’t receive a tax cut—which they did—and the same cast of deceivers is trying to dupe Americans by promoting the extension of the law as a tax giveaway for millionaires and billionaires—which it isn’t.\n\nThe 2019 Washington Post article asserted that 91% of Americans in the middle quintile received a tax cut and that, according to the Cato Institute, “The largest share of the tax changes goes to the middle-income quintile” when payroll taxes are excluded—a direct rebuttal to the Left’s argument and a good reason to keep the law’s provisions in place.\n\nHere are the facts.\n\nThe average American will see a 22% tax hike if we don’t extend the Tax Cuts and Jobs Act. The law resulted in a 16% tax cut for Americans earning less than $100,000, while the top 1% increased their share paid into the U.S. Treasury from 44.9% to 45.9% from 2017 to 2019. Additionally, American workers in the bottom 10% of income earners saw 50% higher wage growth than the top 10%. If Congress permanently extends the law, America’s gross domestic product is expected to increase by 1.2%, and an estimated 829,000 full-time equivalent jobs will be supported.\n\nDemocrats aren’t just lying about the law’s beneficiaries—they’re also twisting the truth about the impact on the Treasury.\n\nThe Congressional Budget Office painted a grim picture of future tax receipts to the Treasury when the law passed in 2017. While we’ve certainly witnessed a growing national debt over the last decade, since 2017, annual revenues into the Treasury have increased 48%. At the same time, federal spending has ballooned 70%. Revenues have actually remained close to their pre-Tax Cuts and Jobs Act trend when adjusting for inflation, but it’s Washington’s spending that’s been out of control.\n\nAllowing Americans to keep more of their money and implementing pro-growth tax policies for small businesses meant more money into the Treasury despite other bad policies coming out of Washington.\n\nToday, Republicans are fighting two battles—passing the Tax Cuts and Jobs Act extensions with a narrow majority and pushing back on Democrats’ dishonesty. If we win the first battle, Democrats will likely still make the false claim that our extensions only benefited the top 1%. If we don’t extend the law, April 15 will be more miserable for all Americans, and the Left will likely still blame Republicans for not passing a bill they lied about and fought against.\n\nRegardless of the Left’s lies, the GOP will do what’s right to extend the Tax Cuts and Jobs Act for American families and small businesses, so we don’t experience Tax Day all year long.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"It’s Tax Day in the United States. “Republicans believe every day is the Fourth of July, but the Democrats believe every day is April 15,”... Read More\n\n\nThe post Democrats Are Being Dishonest About Extending Tax Cuts appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/04/15/democrats-are-being-dishonest-extending-tax-cuts/","image":"https://www.dailysignal.com/wp-content/uploads/2025/04/taxes.jpg","video":null,"publish_date":"2025-04-15 14:17:19","author":"Ron Estes","authors":["Ron Estes"],"language":"en","category":"politics","source_country":"us","sentiment":-0.696},{"id":311488056,"title":"Jury selected in retrial of Sarah Palins libel case against the New York Times - Sarah Palin","text":"A jury was selected on Monday to hear a retrial of Sarah Palin’s claims that the New York Times libeled her in an editorial eight years ago.\n\nOpening statements were scheduled for Tuesday as the one-time Republican vice-presidential candidate and ex-governor of Alaska gets another chance to prove to a federal jury that the newspaper defamed her with the 2017 editorial falsely linking her campaign rhetoric to a mass shooting. Palin said it damaged her reputation and career.\n\nThe Times has acknowledged the editorial was inaccurate but said it quickly corrected the “honest mistake”.\n\nDuring a jury selection process that lasted less than an hour, Judge Jed S Rakoff in Manhattan gave jurors a brief description of the case, saying that the plaintiff was Sarah Palin and the defendant was the New York Times, “complete unknowns I’m sure”.\n\nThe trial, expected to last up to two weeks, comes after the second US circuit court of appeals restored the case last year.\n\nIn February 2022, Rakoff rejected Palin’s claims in a ruling issued while a jury deliberated. The judge then let jurors deliver their verdict, which also went against Palin.\n\nIn restoring the lawsuit, the second circuit said Rakoff’s dismissal ruling improperly intruded on the jury’s work. It also cited flaws in the trial, saying there was erroneous exclusion of evidence, an inaccurate jury instruction and an erroneous response to a question from the jury.\n\nBefore jury selection began on Monday, the sometimes self-deprecating and humor-prone Rakoff told lawyers that the appeals court “seems to think I got it wrong in a lot of ways”.\n\nHe said that on Friday, he “went back and read the entire opinion, painful though it was”.\n\nThe retrial occurs as Donald Trump and others in agreement with the president’s views of news coverage have been aggressive toward media outlets when they believe there has been unjust treatment.\n\nTrump sued CBS News for $20bn over the editing of a 60 Minutes interview with his 2024 opponent, former vice-president Kamala Harris, and also sued the Des Moines Register over an Iowa election poll that turned out to be inaccurate. ABC News settled a lawsuit with Trump over its incorrect claim the president had been found civilly liable for raping writer E Jean Carroll.\n\nKenneth G Turkel, a lawyer for Palin, left the courthouse Monday without commenting.\n\nCharlie Stadtlander, a spokesperson for the Times, said Palin’s claim stemmed from “a passing reference to an event in an editorial that was not about Sarah Palin”.\n\n“That reference was an unintended error, and quickly corrected,” Stadtlander said in a statement. “We’re confident we will prevail and intend to vigorously defend the case.”","summary":"Jury selected in retrial of Sarah Palins libel case against the New York Times - Sarah Palin","url":"https://www.theguardian.com/us-news/2025/apr/14/sarah-palin-new-york-times-case-trial","image":"https://i.guim.co.uk/img/media/5ef1cf745fadeaf3c7a1d9ddf7f078b439ab5f5f/0_271_8124_4877/master/8124.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-04-15 14:04:38","author":null,"language":"en","source_country":"au","sentiment":-0.237},{"id":311415836,"title":"Kamala Harris potential run for California governor met with indifference from policy influencers","text":"California policy influencers are \"indifferent\" about former Vice President Kamala Harris running for governor in the state, a survey conducted by Politico and UC Berkeley’s Citrin Center found. The poll surveyed California registered voters and a selected group of policy insiders, who included lawmakers, as well as state and federal government staffers. California's registered voters were more enthusiastic about Harris than the policy insiders, with 33% reportedly feeling \"joyful\" about the possibility. Thirty-six percent of the policy influencers said they felt \"indifferent\" about Harris running for governor. Just 4% said they would be outraged, 22% said they were \"mostly excited\" and 20% said they were irritated by the potential gubernatorial bid. Harris has not officially declared her candidacy in her home state, but has vowed to remain active in politics since losing to President Donald Trump in the 2024 election. She is also weighing a bid for the presidency in 2028. KAMALA HARRIS REVEALS HER TIMETABLE ON HER NEXT POLITICAL STEPS The former vice president received a low level of enthusiasm among independent voters in California, with 21% saying they felt \"hopeless\" about Harris potentially running, and 26% saying they felt \"irritated\" by the possibility. Voters of color gave a mixed reaction to the possibility of Harris running. While 35% of Black voters felt \"joyful\" and 38% said they were \"mostly excited,\" other voters of color weren't as enthusiastic. Nineteen percent of Latino voters said they felt \"hopeless\" about the former vice president running in California. Eighteen percent of Asian voters said in the survey that they felt \"irritated\" by Harris possibly launching a bid. \"It’s almost a surprising lack of enthusiasm,\" Jack Citrin, a political science professor at UC Berkeley, told Politico, referring to Latino voters. \"But we know from the general election that Latino voters shifted as compared to 2020 or 2016 towards Trump.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Harris became the 2024 Democratic nominee for president a month after former President Joe Biden decided to exit the race in the weeks that followed his disastrous debate performance against Trump. The former vice president cheered the resistance to Trump in a post on social media this month, saying, \"Americans are standing up to the administration as they implement Project 2025 at full speed.\" Harris also posted a clip on April 7 of a speech she delivered, during which she said, \"I'll see you out there. I'm not going anywhere.\" CLICK HERE TO GET THE FOX NEWS APP The former vice president has limited her public appearances since losing to Trump, unlike her 2024 running mate, Gov. Tim Walz, who has made several public appearances and given multiple interviews since the election.","summary":"California policy influencers, as polled by Politico, feel &quot;indifferent&quot; about former Vice President Kamala Harris running for governor in the state.","url":"https://www.foxnews.com/media/kamala-harris-potential-run-california-governor-met-indifference-from-policy-influencers","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/KAMALA-HARRIS-SPEAKING.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 13:59:33","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.064},{"id":311431370,"title":"‘Daily Show’ Host Jon Stewart Tied with Democrat Governors in Latest Presidential Candidate Poll","text":"Is seeing Jon Stewart of the Daily Show sitting with his feet spread beneath the Resolute Desk in the Oval Office on your list of future political predictions? If you (surprisingly) answered yes, then you have company.\n\nA poll released Tuesday and published by the Daily Beast shows Stewart, 62, gaining support with three percent of votes of those polled seeing him as a potential Democratic presidential candidate next time around.\n\nThat is the same as mooted frontrunners Pennsylvania Gov. Josh Shapiro and Illinois Gov. JB Pritzker, while ESPN First Take host Stephen A. Smith nabbed one percent.\n\nWho is at the front of the pack? The Daily Beast report sets that out:\n\n[…] the survey of more than 1,000 participants found former Vice President Kamala Harris topping the list as a favorite to win with 28 percent of votes.\nMeanwhile, New Jersey Sen. Cory Booker soared up the ranks following his record-setting Senate floor speech earlier this month, landing at the No. 2 spot with 11 percent of votes.\nJoining Harris and Booker in the top five are former Transportation Secretary Pete Buttigieg and New York Rep. Alexandria Ocasio-Cortez, who tied at 7 percent, plus Minnesota Governor Tim Walz at 5 percent.\n\nThe survey was conducted by Echelon Insights between April 10 to April 14.\n\nThe November 2028 election is over 1,000 days away with primaries slated to begin in New York and Nevada in February, 2028.\n\nFollow Simon Kent on Twitter: Follow @SunSimonKent or e-mail to: skent@breitbart.com","summary":"Is seeing Jon Stewart of the Daily Show sitting with his feet spread beneath the Resolute Desk in the Oval Office on your list of future political predictions? If you (surprisingly) answered yes, then you have company.\n\n\nThe post ‘Daily Show’ Host Jon Stewart Tied with Democrat Governors in Latest Presidential Candidate Poll appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/04/15/daily-show-host-jon-stewart-tied-with-democrat-governors-in-latest-presidential-candidate-poll/","image":"https://media.breitbart.com/media/2025/04/Gjon-stewart-for-president-640x335.jpg","video":null,"publish_date":"2025-04-15 13:45:28","author":"Simon Kent","authors":["Simon Kent"],"language":"en","category":"politics","source_country":"US","sentiment":0.212},{"id":311386898,"title":"Arson Attack on Pa. Gov. Josh Shapiro’s Home Would Have Had 'Different Outcome' If Doors Weren't Closed, Fire Chief Says","text":"Pennsylvania Governor Josh Shapiro's Harrisburg home was set on fire in the early hours of April 13 in a suspected arson attackFire Chief Brian Enterline has since told reporters that \"it would have been a totally different fire and a totally different outcome\" had certain doors not been closed, per Fox NewsSuspect Cody Balmer, 38, has been arrested in connection with the incident and is facing charges including attempted murder, terrorism and aggravated arson\n\n Pennsylvania Governor Josh Shapiro having certain doors closed inside his Harrisburg home when it was set on fire in a suspected arson attack over the weekend could have saved lives, the fire department has said.\n\n On Sunday, April 13, at approximately 2 a.m. local time, \"members of the Harrisburg Bureau of Fire responded to the Governor’s Residence, located on North Front Street, Harrisburg City, Dauphin County, for the report of a fire,\" Pennsylvania State Police (PSP) said in a news release. \n\n Cody Balmer, 38, has since been arrested and is facing charges of attempted murder, terrorism, aggravated arson, burglary, reckless endangerment and loitering, as well as two counts of aggravated assault, PEOPLE previously reported. \n\n While speaking to reporters on April 14, Harrisburg Fire Chief Brian Enterline said \"it was a very surreal scene\" when he arrived to help tackle the blaze \"about 15 minutes into it,\" per a clip shared by Fox News.\n\n Enterline said that he asked Pennsylvania State Police (PSP) to bring in the arson investigation team after seeing the evidence.\n\n He recalled of the fire, \"Luckily, for the governor and his family, there were doors closed between that main portion of the ballroom and the hallway that leads to the main and master staircase going to the second floor.\"\n\n \"It would have been a totally different fire and a totally different outcome, most likely, had that door not been closed,\" the fire chief added, per the clip shared by Fox News.\n\n Shapiro, 51, was in the home with his family at the time of the suspected attack when he \"woke up to bangs on the door\" from the PSP not long after, he wrote in a statement previously shared on X.\n\n It was the south wing of the governor's residence that had been badly damaged, per the Associated Press,\n\n According to a criminal complaint obtained by PEOPLE, suspect Balmer allegedly admitted to entering the official governor's residence and igniting several \"homemade incendiary devices,\" with the intent to \"commit a violent offense intending to affect the conduct of government.\"\n\n Balmer allegedly told police that he broke into the governor's residence at around 1:30 a.m. ET on April 13, by scaling a perimeter fence and breaking two windows. Officers alleged in the complaint that he confessed to throwing homemade Molotov cocktails made of gasoline siphoned from a lawn mower into empty Heineken bottles.\n\n In an interview with the PSP, Balmer allegedly admitted that he was prepared for violence when the home was set ablaze — and he was aware that he would face consequences.\n\n Balmer allegedly expressed hatred for Shapiro, who was considered for the role of Kamala Harris' running mate in the 2024 presidential election.\n\n Want to keep up with the latest crime coverage? Sign up for PEOPLE's free True Crime newsletter for breaking crime news, ongoing trial coverage and details of intriguing unsolved cases. \n\n When asked what he would have done if Shapiro confronted him in person during the apparent arson attack, Balmer allegedly said he would have beaten the governor with the hammer that he used to break the windows, according to the complaint.\n\n Shapiro, a Democrat, was sworn in as the 48th governor of Pennsylvania in January 2023. He previously served as attorney general from 2017 to 2023, chair of the board of commissioners in Montgomery County from 2011 to 2017 and state representative from 2005 to 2011, per the state's website.\n\n The Harrisburg Bureau of Fire did not immediately respond when contacted by PEOPLE for additional information.","summary":"Cody Balmer, 38, is facing charges including attempted murder, terrorism and aggravated arson following the fire at Shapiro's residence on April 13","url":"https://people.com/arson-attack-pennsylvania-governor-josh-shapiro-home-different-outcome-closed-doors-fire-chief-11715304","image":"https://people.com/thmb/yquXj0keF83B9SuL0yz8VkreODg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(741x240:743x242)/josh-shapiro-governor-fire-041525-1-67e30de201544a128b45fb2c945fe653.jpg","video":null,"publish_date":"2025-04-15 13:32:04","author":"Becca Longmire","authors":["Becca Longmire"],"language":"en","category":"politics","source_country":"US","sentiment":-0.43},{"id":311382376,"title":"Biden to address disability advocates in first major speech since leaving White House","text":"Former President Joe Biden is expected to deliver what is billed as his first public speech since leaving the Oval Office, delivering the keynote address on Tuesday before the national conference of Advocates, Counselors and Representatives for the Disabled (ACRD). \"We are deeply honored President Biden is making his first public appearance at ACRD’s sold-out conference,\" the group's executive director, Rachel Buck, said in a press release provided to Fox Digital. The conference will be held in Chicago. \"As bipartisan leaders have long agreed, Americans who retire after paying into Social Security their whole lives deserve the vital support and caring services they receive. As a result, we are thrilled the President will be joining us to discuss how we can work together for a stable and successful future for Social Security.\" The event is billed as the 46th president's first public speech since leaving the White House, with the former president expected to address the conference sometime after 5 p.m. ET, Fox Digital learned. Biden, however, has delivered other public remarks since Jan. 20, Fox Digital found, including speaking before the National High School Model United Nations in March, which received little media attention, as well as joining an International Brotherhood of Electrical Workers event this month. ACRD is an advocacy organization that works to equip \"disability professionals with the tools, technology, and training to lead the industry forward,\" according to its website. \"Our mission is to empower and educate disability representatives by providing comprehensive training, fostering leadership skills, promoting technological proficiency, and offering valuable networking opportunities.\" BIDEN'S TEAM HID TRUTH ABOUT HIS HEALTH ALL ALONG: WH PRESS SEC Biden will headline the event, which will focus on strengthening Social Security, and will be joined by Sen. Roy Blunt, R-Mo., former Sen. Debbie Stabenow, D-Mich., and former Democrat Maryland Gov. and Social Security Administrator Martin O’Malley, according to the press release. Blunt reported in comments provided in the press release that discussions on Tuesday will focus on bolstering the Social Security system so it can meet the needs of Americans by \"reducing red tape, strengthening claims processing, and ensuring unnecessary spending is eliminated.\" \"Social Security is a sacred promise between generations,\" O’Malley, who serves as chair of ACRD’s Advisory Board, added in the press release. \"It’s a promise that ensures dignity in retirement, security after tragedy, and support for those with disabilities. We are deeply grateful to the President for joining us at ACRD to discuss how we can keep that promise for all Americans.\" BIDEN AIDES 'SCRIPTED' EVERYTHING, ALLOWED HIS FACULTIES TO 'ATROPHY,' NEW BOOK CLAIMS Biden has been out of the public's view since leaving the Oval Office on Jan. 20, when President Donald Trump was inaugurated as the 47th commander in chief. Biden attended the inauguration and was seen chatting with his successor after offering five family members pardons in the final minutes of his tenure, including to his two brothers and his sister. BIDEN ENDS BID FOR SECOND TERM IN WHITE HOUSE AS HE DROPS OUT OF HIS 2024 REMATCH WITH TRUMP Biden was slated to face off against Trump for the second time during the 2024 presidential election cycle but dropped out of the running in July as concerns mounted over his mental acuity and age. Biden passed the torch to his then-vice president, Kamala Harris, who failed to rally enough support to defeat Trump after just over 100 days on the campaign trail. The Bidens have been spotted at various events since Trump's Inauguration Day, including attending the opening night of \"Othello\" on Broadway last month in New York City and traveling to Santa Barbara County, California, immediately following the end of his administration. CLICK HERE TO GET THE FOX NEWS APP Biden has been spending his days in both Delaware and the nation's capital since his Oval Office exit, with the 46th president working on his next memoir while meeting with various Democratic Party leaders such as DNC Chair Ken Martin, NBC News reported in March. Fox Digital reached out to Biden's office for additional comment on the matter but did not immediately receive a reply.","summary":"Former President Biden is expected Tuesday to deliver his first public speech since leaving the White House, addressing Advocates, Counselors and Representatives for the Disabled.","url":"https://www.foxnews.com/politics/biden-address-disability-advocates-first-major-speech-since-leaving-white-house","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/931/523/GettyImages-1806653988.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-15 13:00:58","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"US","sentiment":0.123},{"id":311403642,"title":"Jimmy Kimmel: ‘Now I See Myself More as a Place to Scream’","text":"he president and the richest man on the planet hate Jimmy Kimmel. You would think that would bestow on him a resistance status that at the very least grants a private office in the upper reaches of the Masonic Temple in Hollywood, where Jimmy Kimmel Live! is shot live on tape four nights a week.\n\n This is not the case. The talk-show host’s workspace is very public, with an assistant’s desk next to his and two more staffers peering in from the other side of a large wall of glass, much like his producers did in his early days as a shock jock. The only secluded corner holds a bathroom and a closet containing a cardboard box full of worn ties that his idol David Letterman sent him upon his retirement.\n\n “I wore one, but they’re so long,” says Kimmel, who had a Late Night T-shirt under his suit when Jimmy Kimmel Live! debuted in 2003.\n\n His arms disappear into the box.\n\n “You’ve got to take one.”\n\n For a decade, Kimmel was happy to be a Letterman disciple, projecting a just-snarky-to-be-here vibe, pulling pranks on Matt Damon and his own Aunt Chippy. There were chats with sidekick Guillermo Rodriguez, who was promoted, in Lettermanesque fashion, from security guard to on-air talent. It all befitted the Vegas-raised Kimmel, who before all of this was best known for co-hosting Comedy Central’s The Man Show with Adam Carolla, a program that either celebrated or skewered the frat-boy lifestyle.\n\n Then, the rise and fall and rise of Donald Trump changed his life. A new Kimmel emerged. This one — initially propelled by anger at Trump and the Republicans’ approach to health care and gun violence — savages Trump nightly, leading the president to make calls to Disney in 2018, urging it to rein him in. (Disney did not.) \n\n Now, Kimmel has Elon Musk in his sights. A few days after we talked, Kimmel derided Musk after he’d begged for civility following a wave of Tesla vandalism and expressed bewilderment about why folks were mad at him.\n\n “Well, let me see if I can explain it for you,” said Kimmel. “When you pull out a chain saw to celebrate firing thousands of people, they get mad. My God. I mean, this poor guy. You do one, maybe two Nazi salutes, everybody gets all bent out of shape!” Musk responded by labeling Kimmel “an unfunny jerk.” \n\n Kimmel and I talked in his office for two and a half hours after a March taping of his show. We made a pledge not to talk about Trump for the whole time. We sort of failed, but Kimmel did manage to work Howard Stern, Michelangelo’s David, and stalker culture into one cogent soundbite. Dad-rock talk about Kimmel’s good friend Huey Lewis’ first band, Clover, has been edited out for space.\n\n Your office has two staffers looking in. It’s hard to imagine Letterman having this kind of setup.There’s no alone time. If I have a private call, it’s taken in the bathroom.\n\n Are you feeling OK? During yesterday’s taping, you appeared to be in some physical distress.I had some very serious stomach cramping. It just came upon me suddenly. You came close to seeing me shit my pants onstage for the first time. It’s weird, whatever is going on always stops when I take the stage. If I’m hiccuping, it stops. Sneezing, it stops. But diarrhea waits for no man.\n\n “I don’t think anybody should be canceled. I really don’t.”\n\n I see your clarinet over there. I know you’re pretty good, but how the hell did you make that your instrument of choice?Well, I didn’t choose it. It chose me. And I don’t say that the way Jimi Hendrix might say it. I say it the way Jimmy Kimmel would say it, which is, I thought it was a trombone. I wanted to play the trombone, and thought a trombone when I was 11 years old was called a clarinet. So I signed up for clarinet class, and I got to the class, and some kids had their instruments. I told the band teacher, “I’m in the wrong class. I’m supposed to be in the clarinet class.” And he said, “This is the clarinet class.” I said, “No, clarinet.” I did the trombone motion with my hand. And I remember him laughing so hard. He goes, “No, that’s a trombone.” And I said, “Oh.” And he said, “We’ll rearrange your schedule.” And I was like, “OK.” And I went home and my mom had bought me a clarinet, and my parents never bought anything. And I didn’t know you could return things. So I felt too guilty to say “No, I wanted to play the trombone.” So I just said, “I won’t change the schedule, and I’ll play the clarinet.” And here we are.\n\n I hate to do this, but let’s start with Trump.Donald Trump? Who’s that? Yeah, used to be you think of me, you think of Guillermo or Matt Damon [not getting on the show]. Now it’s Trump. \n\n I think most comedians have a strong sense of justice, and he violates that so frequently. I know we should be hardened to it by now, but I’m not. It is shocking to me; it seems like a comic-book villain. He seems like the kind of character that would flame out after a few years, but the fact that he’s still with us is remarkable.\n\n A year ago, I would’ve said I’m hoping to show people who aren’t paying attention to the news what’s actually going on, and hoping to change things that way. Obviously, that didn’t have enough impact before the election, so now I see myself more as a place to scream.\n\n From a comedy point of view, there are some advantages, right?You don’t have to set the joke up, because everyone knows everything about him, so you go right to the punch line. [The problem is] he’s somebody that a lot of people don’t like. They don’t want to hear his name. But there’s always material. Some days, he gives you so much that you’re throwing things away that would’ve been the biggest event of the entire Bush presidency. I try not to get too deep in the weeds. I have to remind myself that this is not an exposé, it is a comedy show.\n\n When did you realize, “Oh, shit, this is serious and no longer just ridiculous”?It was 2016, and I had Hillary Clinton on. I said to Hillary during a commercial break, “I hope Trump gets the nomination. I think he’ll be a slam-dunk for you.” And she said, “Be careful what you wish for.” I’m not in the group of people who thought he might win.\n\n Listen, when O.J. was found not guilty, I was just absolutely shocked. I had that same feeling. I had this faith in America that was shaken, and I still am not over it. I thought that when it comes down to it, this country, we do the right thing. That’s obviously in the past.\n\n You saw this up close in 2017. Your son was born with a serious heart condition while the Republicans were trying to repeal Obamacare. What made you go public about such a personal thing?There were a few things. I was sitting in the hospital; I was watching them debate this in Congress. I was watching them decide on whether Americans would have access to health insurance or not. And I am looking around this hospital and seeing all these kids and families that are obviously poor. And the idea that if these people were your next-door neighbors, you’d do anything you could to help them struck me. Health care is boring, and most people don’t understand it, so I just wanted to humanize it the best way I possibly could.\n\n You had Sen. Bill Cassidy on the show to explain your son’s condition, and he promised that any health care bill would pass “the Jimmy Kimmel test” and preexisting conditions would be covered. Then the Republican bill came out and that didn’t happen. Were you surprised?I was surprised. When I spoke to Bill Cassidy on the air, I thought, “This man is a doctor. He understands this better than most politicians,” and I felt that he was going to seize that moment and make himself a hero to Americans by doing the right thing, and I was quite surprised that he didn’t. And thank God John McCain did. I will always be grateful to him.\n\n I wonder if that experience gave you insight into the Republican Party during the Trump years in terms of, they are not going to display a moment of courage even when it seems like it is in America’s best interest.Well, they’re so scared of him, I think even more so now than they were the first time around, because he’s so vindictive and there’s no length to which he will not go to punish you. I just don’t understand how Americans can support what he’s doing and the stupid stuff that he gets hung up on, like transgender sports and the stuff that affects almost no one. \n\n I know politicians do this; they pick little things they know are going to push your buttons, and those are the things that they go with, but this is an extreme that we’ve never seen before. There’s no decency. It’s just a bunch of animals, and it’s disgusting. \n\n I mean, on the Fourth of July, I still put up a flag, and I’m never going to stop doing that, because I’m never going to let them have that symbol. It’s not their flag; it is not a MAGA brand.\n\n I wonder if you see Elon Musk in a similar light in the sense that, like Trump, he gives so much material. Well, he’s kind of the same as Trump in a lot of ways. I mean, he supported Obama and then Hillary, and now it’s convenient for him to support Trump. And to me, those are the worst people. I don’t think Trump believes in any of it, and I don’t think Elon Musk believes in it. I think Elon Musk sees this as a great way to accrue a lot of power and make a lot of money, and that’s exactly what he’s doing. \n\n Here’s where I realized Elon Musk was a very bad person and a dangerous person: When Nancy Pelosi’s husband, Paul, an elderly man, was viciously attacked, his first reaction was to repost a brazenly false story suggesting that it was a male prostitute that did it. That’s when I realized, “Oh, this is a bad person. There’s no depth to which he will not stoop.” An old man was hit with a hammer and that’s his first reaction. It’s vile.\n\n “On the Fourth of July I still put up a flag. I’ll never stop doing that. It is not a MAGA brand.”\n\n Do you think Trump has actual true believers? Stephen Miller?Yeah, he’s a scary motherfucker, that guy. \n\n Tucker Carlson?Oh, he’s a complete phony. He’s an opportunist. When you look at Tucker Carlson, you go, “OK, this is a smart guy.” And then you see him over in Russia in a supermarket holding up fruit and going, “This apple is only 12 cents. In America, you’d pay 50 cents for this apple.” And you go, “Yes, but the minimum wage in Russia is a dollar an hour.” And what he’s doing there is acknowledging his fans are not too swift, and he doesn’t care.\n\n We published a story in 2023 that Trump was phoning ABC calling for you to be fired. You seemed pissed and yet amused. I think it’s funny. I like when he admits I’m bothering him. Here at the show, where we put a lot of work into lampooning him, for him to acknowledge our work is one of the few things he does that I appreciate. If he ignored us, it wouldn’t be as much fun.\n\n One thing I like to think about is whether this ruins having been president for President Obama. Being president used to be a big deal. It’s really been cheapened. Maybe it’s how Johnny Carson and David Letterman felt when we all got talk shows.\n\n You grew up in Las Vegas in the 1980s. Was that weird or normal?It was a very normal place to grow up, and also a very abnormal place to grow up. And I didn’t really understand that until I moved away. I played Little League and I was an altar boy, and we went to church every Sunday. But also, on the weekends, we would go for the $1.99 steak dinner at two o’clock in the morning. I’d walk around downtown Las Vegas with a video camera doing interviews with tourists, and then we’d go home and we’d watch it, and then we’d tape over the same tape and do it again the next weekend because that was our only VHS tape.\n\n Do you remember your first Vegas show as a kid?I went to one with my buddy Cleto, who’s my bandleader now. We went to see this show called Splash. There was water on the stage, and the women were topless. But the opener was Frank Gorshin, who played the Riddler on Batman. He was a stand-up comic. You could see he was dead inside opening for Splash. I remember they gave us two Heinekens, and we were pretty hammered by the time Frank wrapped up a set. We gave him a standing ovation at the end. He just glared at us. \n\n I also saw Siegfried and Roy at the Frontier Hotel, and the elephants onstage were urinating so forcefully that they were splashing these Japanese businessmen in the front row. They didn’t seem happy.\n\n Tell me about your earliest comedy memories.I had an audio-cassette recorder, and before Letterman came on, I would watch Carson. And specifically when Bill Cosby was hosting for Johnny. I taped the monologue and I transcribed it, because I wanted to see what it looked like. But I didn’t have any intention of being a comedian, and that never occurred to me. I had a “LATENITE” license plate and had a Late Night birthday cake because I love Letterman so much, not that I thought I could do it someday.\n\n “Comedians have a strong sense of justice, and Trump violates that.”\n\n Your family seems to have been an essential part of your comedy upbringing. Many are on the show.My Aunt Chippy has always been a source of great amusement for me. I have these old notebooks where my cousin Sal and I wrote a bunch of fake Aunt Chippy quotes, which seemed like things she would say — like, “Frank, goddammit, I’ll punch you in the face, knock all your teeth out, and make it into a necklace.” I remember my mom would scare my dad in the shower. She’d scare him and laugh really hard at it. My mom used to pretend she was dead. She’d lay on the ground, pretend she was dead until we cried. And then I found out my Aunt Chippy would do it too! And then my grandfather told me his mother would do it to him. And I was like, “Look at this. This is a deep sickness. It deserves a psychological examination.”\n\n Your Aunt Chippy is in a hilarious skit where she doesn’t understand why her taxi doesn’t have a driver [it’s Waymo]. But my favorite is when your cousin Micki is scared first by a wax dummy of you and then by your human form, which she thinks is a wax dummy.Micki is great. Because she will believe anything. She’s trusting. I once told her that there’s a place called Ice Cream Town and it’s got all these different stores. And you go to one store, it’s the scoop-of-vanilla-ice-cream store. And then you can go across the street to the other store if you want chocolate syrup. And then there’s the cherry store. And she’s like, “Oh, my God, this sounds great.” Meanwhile, if you really think about it, realistically, it’s a huge pain in the ass. She’s very sweet, and in her own way, very smart, but also very, very gullible.\n\n Cousin Sal has been with you for years, and now he’s multi-platforming in every direction. Let me tell you something. I had dinner with Barack Obama the other night, and we spent a solid 15 minutes talking about Cousin Sal. He listens to the Bill Simmons and Cousin Sal podcast. And it was blowing my mind. I couldn’t believe it, because my cousin Sal is, first of all, one of the most unusual and funniest people you’ll ever meet in your life. And Obama was talking about “Parents’ Corner” [where Sal talks of his travails raising three boys]. The closest person I could compare Sal to that people would get is Bill Murray, in that he has impulses and acts on them, even if they’re completely antisocial, and they’re always funny.\n\n Are you continuing the prank tradition with your own kids?Oh, yeah. This weekend we’re putting up signs in our neighborhood that say “We’ve lost our chimpanzee,” and warning people not to get too close to it, but if you see it, call us. We’re going to put them up on the telephone poles in the neighborhood. And I got a burner phone number, so if people call they’ll get a response.\n\n Radio seemed to be your gateway drug into comedy.That was where it was for me. The radio show I did when I was in high school on a college radio station, we had a fake rap band. We would make songs that were funny. And I made a lot of crank calls that I would tape, and Cleto was learning to play the piano, so he’d learn certain tunes and we’d make up funny songs for them. And that’s when I thought, “Yeah, this is what I want to do. I want to be like Howard Stern.” \n\n Radio is still the best medium, because they can’t see you, and it’s very freeing, in the same way actors are more comfortable in a costume, playing a character. Really, you can say whatever pops in your head and be really loose.\n\n Your early radio days were marked by various dismissals and other shenanigans. Tell me about some of your most infamous experiences.Looking back at the time, each time I was fired, I felt a grave injustice had been done. I now completely understand why each one of those adult men fired this young asshole who came in and immediately started fucking with them directly. I was mistakenly under the impression that as a listener, as an employee, you love hearing a disc jockey make fun of his boss.\n\n My first radio station was in Seattle. We had a guy named Larry Sharp who was the program director and the afternoon guy. And that was the best, because he was also on the air, so the listeners knew who he was. When he’d drag us into the office to yell at us, we’d secretly tape him and then play it back on the air the next morning and make fun of him. We called him Shar-Pei, because he looked like a wrinkly shar-pei dog. We just never stopped fucking with the guy.\n\n Then there was our program director in Tucson, Arizona. I had a hot dog, and I decided to put it in his desk, and closed the desk as I was leaving. And then the next morning, his office was unlocked, and I went in there to see if it was still in the desk. It wasn’t in the desk, but it was in the trash can. So, I took it out of the trash can and put it back in the desk. And then he started locking his door. So, we were able to lift the panels of the ceiling and climb over. And as we’re climbing over, it fell through. We destroyed his office. The whole wall unit came down. The office was completely destroyed because we went in there to put this hot dog back in his desk, and we’re like, “Oh, fuck, we’re going to get fired for this.” So, we just closed the door. And when he came into work, he’s like, “What the fuck happened?” We acted like we didn’t know what had happened. We were eventually fired from that job. I remember one thing he said. He said, “I love corporate rock.” And he said it in a serious way. And I remember thinking, like, “Oh, what a dipshit this guy is.”\n\n Howard Stern is one of your heroes, and is now a friend. How did you meet him? When I started on The Man Show, Comedy Central hired a publicist for us for the show, and I said to him, there’s just one thing that I want to do. Because I’d already been on Letterman, I wanted to be on Howard Stern. And he’s like, “Oh, OK. All right.” It took years. And we were on the show, on the phone. It was me and Adam Carolla, we were on together. And he seemed to like us OK on the air. And then Adam started filling in, in the spot that eventually became Artie Lange’s spot. And he and Adam started to become friendly. And I was a little bit jealous, because Adam wasn’t necessarily really even a fan of the show.\n\n Still, to this day, I listen to him every morning. I think his show is better than it has ever been. I am humbled by him. He’s one of my very good friends, and he’s one of the few people I can really turn to when I need advice, because he’s been through all of this stuff and then some.\n\n Often, after you go after Trump hard, his defenders will post one of your bits from The Man Show, whether it’s you asking women “What’s in my pocket” or ogling them from behind. They call you a hypocrite. Is that fair game? Yeah, it’s fair game. I think it’s kind of funny, because the very people who are using those videos as an example of why I’m a horrible person were probably the biggest fans of the show at that time. We did the show a little tongue-in-cheek. I mean, if you really watch the show, we are making fun of ourselves through almost the whole show. It was not meant to be taken literally that men are superior to women, but for some people, it was. I just didn’t realize until the last season that what the show was really about was the friendship between me and Adam Carolla, the chemistry that was there. It was meant to be Homer Simpsonesque. But you can pull things out of context and then they are taken literally. And that’s just how it goes.\n\n There seems to be a constant redrawing of what is acceptable in comedy today.I don’t put limits on what I laugh at. But for me personally, as I’ve grown older, as I’ve matured, I won’t make a joke that I wouldn’t make if a person of that color or persuasion was in the room. That’s how I look at it. I think a lot of the outrage is completely manufactured, and it’s like, a lot of these people who are angry aren’t really angry. I think these liberals who’ve done such a good job of viciously attacking comedians are a big part of the reason why Trump is the president right now.\n\n What do you mean?I just think human beings in general, when you see something that makes you laugh and you see a bunch of other people laughing, and then somebody steps in with their arms folded and goes, “That’s not funny, and here’s why that’s not funny,” it just doesn’t give you a good feeling about a person. And you want to say to that person, “Lighten up.” There’s no black and white when it comes to comedy. There is no line. The line is different for every person. Dave Chappelle can say things that somebody else might not be able to. I don’t think anybody should be canceled. I really don’t.\n\n “I think a lot of the outrage is completely manufactured.”\n\n This isn’t a cancel-culture question, but your friend Adam spread a lot of misinformation about the L.A. fires in January. Did you have any urge to pick up the phone and call him on it?I know he’s a good person. I also know his house was right in the middle of those fires. So, he’s coming from a point of view that a lot of people aren’t coming from. And I know that he has preconceived notions, true or false, about the people who run this city and who run this state. I’m not the kind of person who will cut someone out of my life just because we don’t believe the same thing. It doesn’t mean I won’t try to make my case. I’m not going to end the relationship because of that. I know people who do and who feel that way, and I respect that, too. I know it’s just hard for them. There’s no hope for us if we stop talking to each other. When you have deep ties to somebody, you can’t just cut it off.\n\n From your mom to your wife, Molly, who’s the head writer for your show, women have played a significant part in your comedy, which some might feel is odd for a guy whose breakthrough was The Man Show.You gravitate to what you’re comfortable with. And for me, my mother was the class wit of her huge high school in Brooklyn. My Aunt Chippy, as you know, is really just a very, very funny person. My sister is a comedian. There are a lot of very funny women in my family. That’s what I’m comfortable with. I would never be in a relationship with a woman who isn’t funny. I don’t think a woman who isn’t funny would even have any reason to be attracted to me. \n\n My wife is very bright, very ethical, and also is very funny. And I think that that’s a rare combination. And to be able to run some of these half-baked notions I have by her and vice versa, and to kind of figure them out before I come into work, is a great thing to have. And I’m sure I abuse it. I mean, there are times where I will actually make noise to wake her up because I think of something funny that I want to share, and I can’t wait. Like a child. But there are lines. I recently changed my wife’s license plate to “WE B JAMMIN,” and she didn’t love that.\n\n I talked to James Corden eight years ago about the breakdown of the late-night audience, and here we are again. CBS recently canceled After Midnight. How do you see the landscape in 2025?ABC pays me. So ideally, in an ideal world, everybody would watch [our show] on ABC. But it’s just not how it works. It’s very easy to watch it on YouTube. People can watch anything at a moment’s notice now, and in late night I find most of the people are watching me the next day. That’s the next day in the morning. But if you look at YouTube, and you look at all the shows, more people are watching our late-night television than ever were. And that is what any comedian wants.\n\n In the past couple of years, you have talked of retirement. Do you revisit that every year?I’ve realized that there’s no point in talking about it. It upsets the people I work with.\n\n “I won’t cut someone out of my life because we don’t believe the same thing.”\n\n I did a story about Tom Petty on his last tour and saw a bunch of shows. And he’d play great for two hours and then need the next 46 hours to recover. When I talked to him, he hinted that at least part of it was that he still loved to play, but so many people were depending on him for jobs that he felt a responsibility to keep going. I wonder if you feel that.Oh, absolutely. It’s a huge part of the responsibility. There are a lot of people who won’t have jobs when I retire. That definitely weighs on me. But the reality is I’m not going to do this forever. At a certain point, it is going to have to end. I also know there’s not one person who works here who would resent me for retiring. I think they know that when I’m done, I’ll feel like I have done this as long as I possibly can. But you always feel like the bandleader, that when you stop everyone is going to have to find new jobs.\n\n You can get very emotional on air, whether talking about your son or your monologue after Trump was reelected. Have you always been so open with your emotions?I cried on the last Man Show, which is kind of funny. I just have a hard time keeping my emotions within. My father is like that. And honestly, it’s embarrassing to me. And I know a lot of the women that work here would be like, “Oh, I think it’s great. It shows a good side of you.” But if I could turn it off, I would. \n\n I try to attach these events to real people, and that’s what I did after the election, and I just know how much misery is in store for so many people and how unnecessary it is. I mean, we had plenty of problems before him. The idea that we’ve now created a whole new set of problems seems so counter-productive, and it’s just disheartening. It overwhelms me, just thinking about the realities; it can hit me pretty hard.\n\n Tonight on the show, you did a bit about lame Democrats doing some kind of Congress warrior-ninja video. It was cringe. What are the Democrats doing wrong, or what could be done differently just to get them back in the game? Or do we just need to let Trump blow himself up for the first six months or year of his second term?I think there’s got to be some combination. It’s just like, I know for sure that there are charismatic, intelligent, even funny people [in the Democratic Party]. I mean, Jasmine Crockett, one night, I’m playing a clip of her being hilarious. And the next night she’s participating in this. It looks like a video that the PTA would make to entertain at the luncheon. And it’s just got to be better than that. \n\n Say what you want about Trump, we played a clip in rehearsal of Biden’s State of the Union address and Trump’s State of the Union address. The energy in the room, it’s like the difference between golf and wrestling. There’s just a huge amount of energy in the room, and it’s undeniable.\n\n And when people ask me why they think Trump won, I really believe the reason more than anything is he’s so much more famous than Kamala Harris. He is a celebrity. He is a star. He is the most famous person in the world. And it’s hard to compete with that.\n\n Let’s try to end on a happier note. You recently went to Italy with Howard and your wives. He became quite reclusive during the pandemic. How did you persuade him to go?It’s very simple. He wanted to go. He can’t admit this stuff, even to himself. Of course he wants to go to Italy. But for Howard, it takes a long time. He’s got to get there. And I think he had a great time.\n\n We were looking at the statue of David sculpted by Michelangelo himself. At a certain point, Howard and I realized that every single person in the room had turned their cameras to us and were photographing us looking at David. And it was the weirdest fucking thing, to be in another country and to suddenly steal the attention away from David.\n\n STEPHEN RODRICK is a senior writer at -Rolling Stone. He wrote about the devastating L.A. fires in the March issue of the magazine.","summary":"The late-night stalwart talks about taking on Trump, growing up in Vegas, and his path from host of The Man Show to defender of democracy","url":"https://www.rollingstone.com/tv-movies/tv-movie-features/jimmy-kimmel-trump-late-night-future-interview-1235315906/","image":"https://www.rollingstone.com/wp-content/uploads/2025/04/20250312JimmyKimmel0435-copy.jpg","video":null,"publish_date":"2025-04-15 13:00:00","author":"Stephen Rodrick","authors":["Stephen Rodrick"],"language":"en","source_country":"us","sentiment":-0.236},{"id":311384746,"title":"Unprecedented Nationwide Protests: America Under Siege?","text":"In a resounding cry for change, Americans from all walks of life united on April 5th, gathering in major cities across the nation. The rallying cry? “Stop Destroying America.” This was no ordinary protest—it was a nationwide declaration against the contentious policies of President Donald Trump and the rumored influential sway of Tesla CEO Elon Musk.\n\nThe Spark of Protest: Laying Off at the Core\n\nThe initial sparks were President Trump’s radical announcements, seeking to invigorate the government through efficiency by executing mass government layoffs and trimming what he calls “excess fat.” According to Time Magazine, the passionate cries were heard in Atlanta, where children articulated concerns over their educational futures, fearing the disassembly of vital institutions like the Department of Education.\n\nMarching with a Purpose: A Vision for a Better Tomorrow\n\nAs banners unfurled and crowds marched from East to West—Washington D.C. to Los Angeles—each voice spoke clearly against a perceived billionaire usurpation and a growing threat to personal liberties. The “Hands Off!” campaign was more than a stance against layoffs; it was a multifaceted protest, also advocating for LGBTQ+ rights, sustainable climate policies, and immigrant protection.\n\nA Global Stand: Echoes Across the World\n\nThis wasn’t simply an American marvel. Solidarity was felt globally, with international demonstrations in vibrant cities such as London, Paris, and Berlin. In the heart of Berlin, a striking message lingered, “Hands off our Social Security,” a poignant echo of the U.S.’s own societal uncertainties under the current Administration’s ambitious, tumultuous timeline.\n\nPolitical Reverberations and Fast-Talking\n\nIn response, the White House stood firm, championing their agenda as protective of American seniors, juxtaposing Democratic approaches which they criticized as exacerbating national debt. Yet, resistance echoed louder as former Vice President Kamala Harris thanked citizens on X (formerly Twitter) for their unyielding courage. This massive movement represents not just a political rebuttal, but a deep-seated resolve within the populace to rebuderate—defy erosions in vital social services and environmental integrity.\n\nLooking to the Horizon: What’s Next?\n\nThese protests serve as a testament to a nation that will not stand silently by. They cast a spotlight on the fabric of democracy and its fragility, but also on the resilience, unity, and indomitable spirit of the people. As eyes turn toward the future, one question lingers: will this administration heed the voices of its citizens or forge ahead unabated?\n\nThe reverberations of April 5th’s protests are sure to shape conversations in the weeks and months to come, demonstrating that the people’s power remains alive and well. The very foundation of democracy is at stake, and without a doubt, America’s voice will continue to be heard, loud and clear.","summary":"Protests erupt across the U.S. demanding action against Trump's policies and Musk's controversial initiatives. Discover what ignited these waves.","url":"https://internetprotocol.co/wtf/2025/04/15/unprecedented-nationwide-protests-america-under-siege/","image":"https://internetprotocol.co/content/images/2025/04/866481902.png","video":null,"publish_date":"2025-04-15 12:26:12","author":"Kay Lee","authors":["Kay Lee"],"language":"en","source_country":"co","sentiment":0.065},{"id":311377890,"title":"Vance Lashes Out at Zelensky for Saying He’s Too Nice to Putin","text":"JD Vance slammed Volodymyr Zelensky’s “absurd” claim that he is unduly siding with Vladimir Putin in Russia’s war against Ukraine. \n\nThe Ukrainian president accused Vance of “somehow justifying Putin’s actions” in a 60 Minutes interview while reflecting on their heated meeting alongside President Donald Trump in the White House in February.\n\nVance has now responded to Zelesnky’s comments, telling British publication UnHerd: “I think it’s sort of absurd for Zelensky to tell the [U.S.] government, which is currently keeping his entire government and war effort together, that we are somehow on the side of the Russians.” \n\nVance also told the publication he has condemned Russia’s actions for the last three years, saying that an end to the conflict will require a recognition of both Kyiv and Moscow’s “strategic objectives.”\n\n“That doesn’t mean you morally support the Russian cause, or that you support the full-scale invasion, but you do have to try to understand what are their strategic red lines, in the same way that you have to try to understand what the Ukrainians are trying to get out of the conflict,” Vance said.\n\nHe added that Zelensky’s rhetoric “is certainly not productive.”\n\nIn an interview broadcast Sunday, the Ukrainian president told 60 Minutes that an “altered reality” seems to have taken hold within the Trump administration, with officials peddling Russian talking points about the ongoing war with Ukraine. \n\n“I believe, sadly, Russian narratives are prevailing in the U.S.,” he said in the interview filmed in his hometown of Kryvyi Rih, where, last week, 10 adults and nine children were killed in a Russian airstrike near a playground. “This speaks to the enormous influence of Russia’s information policy on America, on U.S. politics and U.S. politicians.”\n\nZelensky then referenced Vance specifically, adding that Trump’s right-hand man is “somehow justifying Putin’s actions.”\n\n“I tried to explain, ‘You can’t look for something in the middle. There is an aggressor and there is a victim. The Russians are the aggressor, and we are the victim,‘” Zelensky added, referring to their showdown at the White House in February.\n\nTrump, meanwhile, raged at CBS in Truth Social posts the same evening the broadcast aired. \n\n“I just finished watching 60 Minutes,” he wrote before launching into a tirade about former Vice President Kamala Harris’ answers in her interview on the show in October.\n\n“Now tonight, with two separate but highly inaccurate stories about ‘TRUMP,’ they’re at it again. The people at CBS Fake News just don’t get it!” he added.\n\nIn a follow-up post he said the network is “out of control” partly due to the Zelensky interview.\n\n“They did not one, but TWO, major stories on ‘TRUMP,’ one having to do with Ukraine, which I say is a War that would never have happened if the 2020 Election had not been RIGGED, in other words, if I were President,” he said, adding his chagrin with another story about his apparent designs on taking Greenland from Denmark. \n\nStill stewing over the matter hours later, Trump fired off another post Monday, saying the Russia-Ukraine conflict is “Biden’s war, not mine.”","summary":"Allison Joyce/Getty ImagesJD Vance slammed Volodymyr Zelensky’s “absurd” claim that he is unduly siding with Vladimir Putin in Russia’s war against Ukraine. \n\nThe Ukrainian president accused Vance of “somehow justifying Putin’s actions” in a 60 Minutes interview while reflecting on their heated meeting alongside President Donald Trump in the White House in February.\n\nVance has now responded to Zelesnky’s comments, telling British publication UnHerd: “I think it’s sort of absurd for Zelensky to tell the [U.S.] government, which is currently keeping his entire government and war effort together, that we are somehow on the side of the Russians.” \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/jd-vance-lashes-out-at-volodymyr-zelensky-for-saying-hes-too-nice-to-vladimir-putin/","image":"https://www.thedailybeast.com/resizer/v2/YHKZMLPXXZCOFK23LETGKDFXHE.jpg?smart=true&auth=253c7b57656b65f6195bee13b6f05bf245a8e767b59bde0598a30691c50923a4&width=1440&height=1080","video":null,"publish_date":"2025-04-15 12:17:10","author":"Leigh Kimmins","authors":["Leigh Kimmins"],"language":"en","category":"politics","source_country":"us","sentiment":-0.391},{"id":311358672,"title":"Joe Biden will speak about Social Security in his return to the national stage","text":"By STEVE PEOPLES and FATIMA HUSSEIN, Associated Press\n\nWASHINGTON (AP) — Former President Joe Biden returns to the national stage Tuesday to elevate liberal concerns that President Donald Trump’s agenda is threatening the health of Social Security.\n\nThe 82-year-old Democrat has largely avoided speaking publicly since leaving the White House in January. That’s even as Trump frequently blames Biden for many of the nation’s problems, often attacking his predecessor by name.\n\nBiden is expected to fight back in an early evening speech to the national conference of Advocates, Counselors and Representatives for the Disabled in Chicago. While Biden has made a handful of public appearances in recent weeks, Tuesday’s high-profile address focuses on a critical issue for tens of millions of Americans that could define next year’s midterm elections.\n\n“As bipartisan leaders have long agreed, Americans who retire after paying into Social Security their whole lives deserve the vital support and caring services they receive,” said Rachel Buck, executive director of the ACRD. “We are thrilled the president will be joining us to discuss how we can work together for a stable and successful future for Social Security.”\n\nTrump almost immediately began slashing the government workforce upon his return to the White House, including thousands of employees at the Social Security Administration.\n\nAlong with a planned layoff of 7,000 workers and controversial plans to impose tighter identity-proofing measures for recipients, the SSA has been sued over a decision to allow Elon Musk’s Department of Government Efficiency to access individuals’ Social Security numbers and other personally identifiable information.\n\nMusk, the world’s richest man and one of Trump’s most influential advisers, has called Social Security “the biggest Ponzi scheme of all time.”\n\nAt the same time, Social Security recipients have complained about long call wait times as the agency’s “my Social Security” benefits portal has seen an increase in outages. Individuals who receive Supplemental Security Income, including disabled seniors and low-income adults and children, also reported receiving a notice that said they were “not receiving benefits.”\n\nThe agency said the notice was a mistake. And the White House has vowed that it would not cut Social Security benefits, saying any changes are intended to reduce waste and fraud.\n\nBiden will be joined in Chicago by a bipartisan group of former elected officials, including former Sen. Roy Blunt, R-Mo., former Sen. Debbie Stabenow, D-Mich., and former Social Security Administrator Martin O’Malley.\n\n“Social Security is a sacred promise between generations,” O’Malley said. “We are deeply grateful to the President for joining us at ACRD to discuss how we can keep that promise for all Americans.”\n\nBiden is not expected to make frequent public appearances as he transitions into his post-presidency. He still maintains an office in Washington, but has returned to Delaware as his regular home base. Trump has revoked his security clearances.\n\nWhile Biden may be in position to help his party with fundraising and messaging, he left the White House with weak approval ratings. Biden also faces blame from some progressives who argue he shouldn’t have sought a second term. Biden ended his reelection bid after his disastrous debate performance against Trump and made way for then-Vice President Kamala Harris, who lost to Trump in the fall.\n\nJust 39% of Americans had a favorable opinion of Biden in January, according to a Gallup poll taken shortly after Trump’s inauguration.\n\nViews of the Democratic former president were essentially unchanged from a Gallup poll taken shortly after the November election. They broadly track with the steadily low favorability ratings that Biden experienced throughout the second half of his presidential term.\n\nPeoples reported from New York. Associated Press writer Linley Sanders contributed to this report.","summary":"Tuesday’s high-profile address focuses on a critical issue that could define next year’s midterm elections.","url":"https://www.twincities.com/2025/04/15/biden-speaks-social-security/","image":"https://www.twincities.com/wp-content/uploads/2025/04/Biden_94739.jpg?w=1024&h=682","video":null,"publish_date":"2025-04-15 11:34:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.121},{"id":311396086,"title":"Joe Biden will speak about Social Security in his return to the national stage","text":"By STEVE PEOPLES and FATIMA HUSSEIN, Associated Press\n\nWASHINGTON (AP) — Former President Joe Biden returns to the national stage Tuesday to elevate liberal concerns that President Donald Trump’s agenda is threatening the health of Social Security.\n\nThe 82-year-old Democrat has largely avoided speaking publicly since leaving the White House in January. That’s even as Trump frequently blames Biden for many of the nation’s problems, often attacking his predecessor by name.\n\nBiden is expected to fight back in an early evening speech to the national conference of Advocates, Counselors and Representatives for the Disabled in Chicago. While Biden has made a handful of public appearances in recent weeks, Tuesday’s high-profile address focuses on a critical issue for tens of millions of Americans that could define next year’s midterm elections.\n\n“As bipartisan leaders have long agreed, Americans who retire after paying into Social Security their whole lives deserve the vital support and caring services they receive,” said Rachel Buck, executive director of the ACRD. “We are thrilled the president will be joining us to discuss how we can work together for a stable and successful future for Social Security.”\n\nTrump almost immediately began slashing the government workforce upon his return to the White House, including thousands of employees at the Social Security Administration.\n\nAlong with a planned layoff of 7,000 workers and controversial plans to impose tighter identity-proofing measures for recipients, the SSA has been sued over a decision to allow Elon Musk’s Department of Government Efficiency to access individuals’ Social Security numbers and other personally identifiable information.\n\nMusk, the world’s richest man and one of Trump’s most influential advisers, has called Social Security “the biggest Ponzi scheme of all time.”\n\nAt the same time, Social Security recipients have complained about long call wait times as the agency’s “my Social Security” benefits portal has seen an increase in outages. Individuals who receive Supplemental Security Income, including disabled seniors and low-income adults and children, also reported receiving a notice that said they were “not receiving benefits.”\n\nThe agency said the notice was a mistake. And the White House has vowed that it would not cut Social Security benefits, saying any changes are intended to reduce waste and fraud.\n\nBiden will be joined in Chicago by a bipartisan group of former elected officials, including former Sen. Roy Blunt, R-Mo., former Sen. Debbie Stabenow, D-Mich., and former Social Security Administrator Martin O’Malley.\n\n“Social Security is a sacred promise between generations,” O’Malley said. “We are deeply grateful to the President for joining us at ACRD to discuss how we can keep that promise for all Americans.”\n\nBiden is not expected to make frequent public appearances as he transitions into his post-presidency. He still maintains an office in Washington, but has returned to Delaware as his regular home base. Trump has revoked his security clearances.\n\nWhile Biden may be in position to help his party with fundraising and messaging, he left the White House with weak approval ratings. Biden also faces blame from some progressives who argue he shouldn’t have sought a second term. Biden ended his reelection bid after his disastrous debate performance against Trump and made way for then-Vice President Kamala Harris, who lost to Trump in the fall.\n\nJust 39% of Americans had a favorable opinion of Biden in January, according to a Gallup poll taken shortly after Trump’s inauguration.\n\nViews of the Democratic former president were essentially unchanged from a Gallup poll taken shortly after the November election. They broadly track with the steadily low favorability ratings that Biden experienced throughout the second half of his presidential term.\n\nPeoples reported from New York. Associated Press writer Linley Sanders contributed to this report.","summary":"Tuesday’s high-profile address focuses on a critical issue that could define next year’s midterm elections.","url":"https://www.ocregister.com/2025/04/15/biden-speaks-social-security/","image":"https://www.ocregister.com/wp-content/uploads/2025/04/Biden_94739.jpg?w=1024&h=682","video":null,"publish_date":"2025-04-15 11:34:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.121},{"id":311350238,"title":"Joe Biden will speak about Social Security in his return to the national stage","text":"By STEVE PEOPLES and FATIMA HUSSEIN, Associated Press\n\nWASHINGTON (AP) — Former President Joe Biden returns to the national stage Tuesday to elevate liberal concerns that President Donald Trump’s agenda is threatening the health of Social Security.\n\nThe 82-year-old Democrat has largely avoided speaking publicly since leaving the White House in January. That’s even as Trump frequently blames Biden for many of the nation’s problems, often attacking his predecessor by name.\n\nBiden is expected to fight back in an early evening speech to the national conference of Advocates, Counselors and Representatives for the Disabled in Chicago. While Biden has made a handful of public appearances in recent weeks, Tuesday’s high-profile address focuses on a critical issue for tens of millions of Americans that could define next year’s midterm elections.\n\n“As bipartisan leaders have long agreed, Americans who retire after paying into Social Security their whole lives deserve the vital support and caring services they receive,” said Rachel Buck, executive director of the ACRD. “We are thrilled the president will be joining us to discuss how we can work together for a stable and successful future for Social Security.”\n\nTrump almost immediately began slashing the government workforce upon his return to the White House, including thousands of employees at the Social Security Administration.\n\nAlong with a planned layoff of 7,000 workers and controversial plans to impose tighter identity-proofing measures for recipients, the SSA has been sued over a decision to allow Elon Musk’s Department of Government Efficiency to access individuals’ Social Security numbers and other personally identifiable information.\n\nMusk, the world’s richest man and one of Trump’s most influential advisers, has called Social Security “the biggest Ponzi scheme of all time.”\n\nAt the same time, Social Security recipients have complained about long call wait times as the agency’s “my Social Security” benefits portal has seen an increase in outages. Individuals who receive Supplemental Security Income, including disabled seniors and low-income adults and children, also reported receiving a notice that said they were “not receiving benefits.”\n\nThe agency said the notice was a mistake. And the White House has vowed that it would not cut Social Security benefits, saying any changes are intended to reduce waste and fraud.\n\nBiden will be joined in Chicago by a bipartisan group of former elected officials, including former Sen. Roy Blunt, R-Mo., former Sen. Debbie Stabenow, D-Mich., and former Social Security Administrator Martin O’Malley.\n\n“Social Security is a sacred promise between generations,” O’Malley said. “We are deeply grateful to the President for joining us at ACRD to discuss how we can keep that promise for all Americans.”\n\nBiden is not expected to make frequent public appearances as he transitions into his post-presidency. He still maintains an office in Washington, but has returned to Delaware as his regular home base. Trump has revoked his security clearances.\n\nWhile Biden may be in position to help his party with fundraising and messaging, he left the White House with weak approval ratings. Biden also faces blame from some progressives who argue he shouldn’t have sought a second term. Biden ended his reelection bid after his disastrous debate performance against Trump and made way for then-Vice President Kamala Harris, who lost to Trump in the fall.\n\nJust 39% of Americans had a favorable opinion of Biden in January, according to a Gallup poll taken shortly after Trump’s inauguration.\n\nViews of the Democratic former president were essentially unchanged from a Gallup poll taken shortly after the November election. They broadly track with the steadily low favorability ratings that Biden experienced throughout the second half of his presidential term.\n\nPeoples reported from New York. Associated Press writer Linley Sanders contributed to this report.","summary":"Tuesday’s high-profile address focuses on a critical issue that could define next year’s midterm elections.","url":"https://www.sandiegouniontribune.com/2025/04/15/biden-speaks-social-security/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/04/Biden_94739.jpg?w=1024&h=682","video":null,"publish_date":"2025-04-15 11:34:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.121}]}