{"offset":0,"number":50,"available":6293,"news":[{"id":254639606,"title":"RFK-Trump alliance could be battleground boon","text":"There are a couple of days left of the Democratic National Convention. Its result is preordained, the narrative is scripted, and the enthusiasm is performative. While it’s impossible to actually knock a political convention from being the lead story in most news publications, former President Donald Trump and Robert F. Kennedy have a unique opportunity to do so Friday, shifting the spotlight from Chicago to an unorthodox political alliance that may give Trump back some of the momentum he had before Vice President Kamala Harris took the top spot on the 2024 ticket. Kennedy running mate Nicole Shanahan raised the prospect of an alliance between the GOP nominee and the independent candidate. “There’s two options that we’re looking at, and one is staying in, forming that new party, but we run the risk of a Kamala Harris and [Tim] Walz presidency because we draw votes from Trump,” she said on the Impact Theory with Tom Bilyeu podcast. Once a third-party campaign starts floating these kinds of scenarios, the game is about over. Kennedy recently made news for a conversation with Trump that included talk of a role in a future Republican administration if he endorsed the GOP nominee, followed by a failed attempt to talk to Harris about a job should she be elected. So the trial balloon shouldn’t be surprising, especially since Kennedy has long since lost much of his initial voter interest in surveys. But polls also give us a positive. Even a diminished Kennedy, rendered grotesque by stories of dropping off bear corpses in Central Park and eating remarkably canine-looking goats, is a valuable asset given he still has appeal in the handful of battleground states that will decide who wins in November. If Kennedy is serious about being an boon to Trump and running-mate J.D. Vance, it would be political malpractice not to allow him to be part of the package. This is despite some polling, such as a Cygnal survey of Pennsylvania, saying he as a spoiler candidate helps Trump win but voters go to Harris if he leaves the race. After all, trends are showing those voters are going somewhere anyway, and it may as well happen now, when more battleground state polls than not show Kennedy support larger than the gap between Trump and Harris. Other national polling shows Kennedy is most popular among Republicans at this point. An Economist/YouGov Poll conducted August 17 to 20 finds him above 50% with the GOP, another reason this makes sense. One caveat: It’s not as if the Kennedy side isn’t seeking assurances if they fall in line, though. As Shanahan went on to say: “Do we trust Trump and his personal sincerity to really do the right thing for our country, end chronic disease, balance the budget, end these forever wars? Is he somebody that’s going to continue to invite people like Bobby and [me] into the conversation? Or is he going to fall victim again to the things he fell victim to in his first administration?” Kennedy has said he will “talk with leaders of any political party to further the goals I have served for 40 years in my career and in this campaign,” such as “reversing the chronic disease epidemic, ending the war machine, cleaning corporate influence out of government and toxic pollution out of the environment, protecting freedom of speech and ending politicization of enforcement agencies.” Is that a place Donald Trump’s Republican Party really wants to go? Alternatively, is Kennedy willing to take victories in a couple of areas and concede on the rest? The question of whether the juice is worth the squeeze should be central to both sides’ thinking. But in terms of narrative, it’s a winner. This season has been a breakneck campaign, and Team Trump has looked low energy in contrast with the pop culture push of the Harris spectacle. A Kennedy pick can reset the narrative and jump start the electorate. Especially in the battleground states.","summary":"There are a couple of days left of the&nbsp;Democratic National Convention. Its result is preordained, the narrative is scripted, and the enthusiasm is performative. While it’s impossible to actually knock a political convention from being the lead story in most news publications, former President Donald Trump and Robert F. Kennedy have a unique opportunity to...","url":"https://nypost.com/2024/08/21/us-news/rfk-trump-alliance-could-be-battleground-boon/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-6oez08g58-1724270873995.jpg?quality=75&strip=all&1724256674&w=1200","video":null,"publish_date":"2024-08-22 00:29:49","author":"A.g. Gancarski","authors":["A.g. Gancarski"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.151},{"id":254639524,"title":"Oprah Winfrey will speak at the Democratic National Convention tonight","text":"The NPR Network will be reporting live from Chicago throughout the week bringing you the latest on the Democratic National Convention. Oprah Winfrey is slated to speak as a last minute addition to tonight's DNC lineup as a sign of support to the Harris-Walz campaign, according to a source that spoke to NPR on condition of anonymity because they are not authorized to speak about the surprise guest. Winfrey has thrown her support behind Democratic leaders in the past. She supported former President Barack Obama during his 2008 presidential bid, leveraging the strong connection she has with her wide-reaching audience. Winfrey also supported former Secretary of State Hillary Rodham Clinton in 2016 and President Biden in 2020, along with notably endorsing Pennsylvania Sen. John Fetterman over Dr. Mehmet Oz in the 2022 midterms. In endorsing Biden and Harris in 2020, Winfrey emphasized Harris' leadership as a woman and woman of color. “I was thinking the other day, ‘I wish Maya [Angelou] were alive to see it,’” Winfrey said in an interview with People Magazine. “There’s no way to measure what the election of Kamala Harris means for all women, all colors, everywhere.”","summary":"Oprah Winfrey is slated to speak as a last minute addition to tonight's DNC lineup as a sign of support to the Harris-Walz campaign.","url":"https://www.npr.org/2024/08/21/g-s1-18581/oprah-winfrey-democratic-national-convention","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1828+0+0/resize/3000x1828!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0d%2F84%2F26561a5448108333cc50cfc99a2e%2Fgettyimages-1202662597.jpg","video":null,"publish_date":"2024-08-22 00:20:29","author":"Jeongyoon Han","authors":["Jeongyoon Han"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.271},{"id":254639552,"title":"Trump defeats Harris by landslide in Elon Musk’s poll on X social network","text":"NEW YORK, August 22. /TASS/. US Republican presidential candidate Donald Trump defeated his Democrat election rival Kamala Harris by an overwhelming margin in a poll on the X social network, organized by US entrepreneur Elon Musk. More than 5.8 million people took part in the vote. A total of 73.2% of them voted for Trump, and the remaining 26.8% supported Harris. The US presidential election will be held on November 5. The Democratic Party was supposed to be represented by Joe Biden, but after his failed performance in the June debate with Trump, calls for the incumbent head of state to give up the fight grew louder among Democrats. On July 21, he decided to withdraw from the race and endorse Harris for the state's top office. At the Democratic convention, which is underway on August 19-22, Harris is expected to officially agree to run for US President in the November elections.","summary":"More than 5.8 million people took part in the vote","url":"https://tass.com/world/1832259","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2024-08-22 00:20:04","author":"Tass","authors":["Tass"],"language":"en","catgory":"politics","source_country":"RU","sentiment":-0.417},{"id":254639654,"title":"Unpermitted anti-Israel protest blocked from approaching DNC’s United Center","text":"CHICAGO — Anti-Israel protesters are marching toward the United Center on Wednesday evening during the third night of the convention to fete Vice President Kamala Harris. A police officer on the scene confirmed to the Washington Examiner the group waving Palestinian flags does not have a permit for the demonstration to protest the U.S. response to the Israel-Hamas war. Meantime, inside the United Center, the parents of Hersch Goldberg-Polin addressed the Democratic National Convention and pleaded for the release of the Hamas-captured hostages. The protesters started at Union Park and marched toward Park No. 578 near the United Center, the same spot where demonstrators broke through the security gate on Monday. They were quickly encountered by law enforcement preventing entry to the park. This is a developing story and will be updated with new information as available","summary":"CHICAGO — Anti-Israel protesters are marching toward the United Center on Wednesday evening during the third night of the convention to fete Vice President Kamala Harris. A police officer on the scene confirmed to the Washington Examiner the group waving Palestinian flags does not have a permit for the demonstration to protest the U.S. response [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3130322/anti-israel-protest-dnc-united-center/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/IMG_2009-scaled.webp","video":null,"publish_date":"2024-08-22 00:19:53","author":"Tiana Lowe Doescher","authors":["Tiana Lowe Doescher"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.469},{"id":254639296,"title":"Jamie Dimon's name keeps being floated for a spot in the White House &mdash; by both parties","text":"JPMorgan Chase CEO Jamie Dimon's name has been floated for a Cabinet role in the White House by former President Donald Trump — and now, according to a report, folks in Vice President Kamala Harris' orbit.In June, Donald Trump told Bloomberg in an interview that he would consider Dimon for a potential role as Treasury Secretary.\"He is somebody that I would consider, sure,\" Trump told Bloomberg. The former president later denied that he ever floated Dimon's name.Dimon also appears to be an option for Harris' cabinet.A source familiar with the matter told CNBC that among names floated, Harris' orbit has mentioned Dimon for the same role in conversations that took place during the Democratic National Convention this week in Chicago.A spokesperson for the Harris campaign and a spokesperson for JPMorgan did not respond to a request for comment.Dimon has previously tried to tame speculation about a potential White House role amid discussions around his retirement and an August op-ed in The Washington Post in which he called for unity but stopped short of endorsing a 2024 candidate.When the CEO was asked in August if he would take up the Treasury Secretary role during an interview on CNBC's \"The Exchange,\" Dimon avoided giving a direct answer but seemed to suggest that he was focused on his current role at JPMorgan.\"I am very happy with what I'm doing,\" he said in the interview. \"I say it over and over, but I'm very happy with what I'm doing.\"CNBC's Leslie Picker followed up: \"So that would be a no to President Trump if you were called — \"\"I'm very happy with what I'm doing,\" Dimon interrupted.Dimon also has hinted at an impending retirement.For years, Dimon has teased that he would retire in the next five years, but the CEO said in May at an annual investor meeting that the timeline was \"not five years anymore\" and that a plan to announce a successor was \"well on its way.\"\"Well, eventually, I have to leave,\" Dimon told CNBC, adding: \"But even if I'm done as CEO, I might be chairman for a year or two. It's totally up to the board at that point. So I have a while to go before I'm out of the company.\"","summary":"JP Morgan CEO Jamie Dimon has been considered for the Treasury Secretary role by Donald Trump and Harris' circle, according to reports.","url":"https://www.businessinsider.com/jamie-dimon-floated-donald-trump-kamala-harris-treasury-secretary-2024-8","image":"https://i.insider.com/66954f828893442a5156a855?width=1136&format=jpeg","video":null,"publish_date":"2024-08-22 00:11:37","author":"Lloyd Lee","authors":["Lloyd Lee"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.441},{"id":254639652,"title":"Is Tim Walz too folksy? The Onion has the answer with the relaunch of its print paper","text":"Chicago-based satirical news outlet The Onion has revived its print publication — after moving completely online in 2013 — with the debut of a 16-page special edition highlighting the Democratic National Convention. The front page story features the headline: “Tim Walz Unveils New Retro-Futurist Persona After Feeling Boxed In By Folksy Image,” with a photo of the Democratic vice presidential candidate in a silver spacesuit-like outfit with light bulbs. Another front-page story declares that The New York Times “ceased publication” because the “struggling” newspaper simply couldn’t “compete with The Onion’s newly relaunched print edition.” There’s also a mock interview with Vice President Kamala Harris who said in response to a question about her favorite book, “If I don’t say Becoming, Michelle will pull her endorsement. But really it’s The Audacity Of Hope.” Much of the special issue focuses on the upcoming elections, politics and hot-button issues. The outlet relaunched its print edition as part of a larger plan to diversify revenue streams, after its new owners purchased the company in April. Workers wearing The Onion T-shirts handed out the “Chicago DNC Edition” this week along Michigan Avenue and near hotels and venues where DNC attendees are congregating. More than 50,000 delegates, media and other visitors are expected to attend the convention this week, which wraps up Thursday. “Our beautiful new website was coming to fruition, we wanted to launch a print edition this fall, and the DNC — filled with the exact folks who deserve to read the most important news of the day — was in our backyard,” The Onion’s Chief Marketing Officer Leila Brillson said in an email. “This perfect storm allowed us to do the DNC in our own unique way, and while we had a captive national audience, too.” Brillson declined to specify how many issues of The Onion’s DNC paper were printed. “We are printing on demand, and let me tell you ... demand has been tremendous,” she said. The issue featured tips for DNC attendees such as a list of must-try food, which included a reference to Chicago’s signature hot dog fixings: “Chicago-Style Pigeon: No Chicagoan would be caught dead eating a flattened pigeon off the ground without mustard, relish, onions, tomato, sport peppers, a pickle spear and celery salt.” A map of the “DNC convention center” indicated stables where President Joe Biden’s body doubles are held. Visitors “can even feed them an apple for 50 cents!” according to the map. The Onion’s monthly print edition is available through a new membership program. Readers can subscribe on the outlet’s website. The Onion is offering 12 monthly print issues at a promotional rate of $60, including home delivery, until Aug. 31. Monthly subscribers pledging more than $5 can get print delivery. The Onion said the print edition is “a return to the tactile, back-to-basics format our most loyal readers have refused to shut up about, and it’s an inspiration to an entire profession that had, until now, totally lost its way.” “While the print edition of The Onion will be available only to paying subscribers, the digital version will remain completely free of charge until such time as upper management has the desire to gorge itself on additional revenue,” The Onion said in a statement. The recently-formed company Global Tetrahedron bought The Onion from G/O Media for an undisclosed sum. Global Tetrahedron is a fictional company in The Onion’s 1999 book “Our Dumb Century.” The owners include ex-tech CEO Jeff Lawson; Ben Collins, The Onion’s new CEO and former NBC News disinformation reporter; Brillson, previously a marketer for TikTok; and Danielle Strle, former product director of Tumblr. Like many media outlets, The Onion faces the daunting challenge of becoming financially sustainable. For more than two decades, media companies have been decimated by a loss of subscribers and advertising revenue. Brillson told the Sun-Times in May that The Onion’s previous owners pigeonholed it as a website rather than a strong multimedia brand with books, a social media presence and a big potential for merchandise, live events and partnerships. Self-described as “America’s Finest News Source,” it was founded in 1988 by two University of Wisconsin-Madison students, initially as a print publication. The paper moved to New York City in 2000 then relocated to Chicago in 2012.","url":"https://chicago.suntimes.com/money/2024/08/21/tim-walz-folksy-the-onion-global-tetrahedron-answer-relaunch-print-paper","image":"https://cst.brightspotcdn.com/dims4/default/2d8cee9/2147483647/strip/true/crop/4303x2456+0+317/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F6b%2Fd8%2Fe9faef4e4c45be31afd9e391ab4f%2Fthe-","video":null,"publish_date":"2024-08-22 00:07:46","author":"Amy Yee","authors":["Amy Yee"],"language":"en","source_country":"us","sentiment":0.092},{"id":254638960,"title":"Fourth day of DNC demonstrations underway: 'We just want a peaceful protest'","text":"A fourth day of protesting outside the Democratic National Convention began peacefully Wednesday afternoon, even though the latest group to march against the war in Gaza chose to do so without a permit. The Chicago Coalition for Justice in Palestine planned a parade from Union Park to the United Center, where the DNC was underway. Among those set to speak in the arena are former President Bill Clinton and vice presidential hopeful Tim Walz. The demonstration follows Tuesday’s violent clash in the West Loop between protesters and Chicago police officers, which led to 59 arrests. However, the group involved in Tuesday’s violence was not affiliated with the coalition that planned Wednesday’s event. Rather, the organizers of Wednesday’s demonstration are familiar with Chicago police. The group has held dozens of protests against the war in Gaza since October. Four young men wearing black and white keffiyeh scarves actually approached a Chicago police commander at the edge of the park Wednesday to discuss how and why they set up a perimeter and why they were there. “We approached him and he was friendly,” said one of the young men, who would not give their names. “We just want a peaceful protest and we know they have jobs to do.” Palestinian flags and kuffiyehs flowed in the wind as chants ripped through the crowd. The protest was meant to be “family-friendly” and several parents brought their small children, who held miniature Palestinian flags and clapped along to chants. A 26-year-old Palestinian-American protester painted a mask with the Palestinian flag to catch people’s attention. “It was just a good way to express everything about Palestine,” said the organizer, who didn’t give his name for fear of being targeted online. “It’s art, you know? When people see art, it catches their eye.” The Jefferson Park resident said his dad started bringing him to pro-Palestinian protests in 2008 when he was just 10 years old. “It didn’t start on Oct. 7th and people are just now starting to get it,” he said. “It needs all the exposure it can get. It’s all I can do for my people who are getting killed.” Riverside resident Sara Vacek thought it was important to draw a connection between the push for reproductive rights in the Democratic Party and the atrocities faced by pregnant people in Gaza. “Women in Gaza, they have no prenatal care, no postnatal care,” Vacek said. “It’s not acceptable for Vice President [Kamala] Harris to be preaching about reproductive rights and abandoning women’s rights in Gaza.” While marching down Washington Street near where delegates gathered at the United Center, Vacek held a sign that read “Wanna talk about reproductive rights?” on one side and “Tent scraps for menstrual pads, C-sections w/o anesthesia, mothers eating birdseed” on the other. A police helicopter buzzed over the rally, and Chicago police stood nearby but kept their distance. Police Supt. Larry Snelling appeared on the front lines, as he has since demonstrations began Sunday night. During a press conference earlier Wednesday, Snelling was asked about allowing unpermitted marches to go forward. Snelling said police officials would assess unpermitted events “as they happen,” like they did on Tuesday night. “People have the right to assemble,” he said. “However, we are going to control the situations. When we get there, we’ll make an assessment of what’s happening, and if we know we need to take action, we’ll take action.” Organizers said they would follow the same route as a march held Monday, starting west on Washington Boulevard. The march began with no resistance from Chicago police. The crowd chanted “end the siege on Gaza now” and “no peace on stolen land.” Contributing: David Struett","url":"https://chicago.suntimes.com/2024-democratic-national-convention/2024/08/21/dnc-protests-union-park-united-center-israel-hamas-palestinian","image":"https://cst.brightspotcdn.com/dims4/default/c0a8794/2147483647/strip/true/crop/6127x3498+0+295/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fc1%2F37%2F79e3a0c1437687806ce40cf8194d%2F561a","video":null,"publish_date":"2024-08-22 00:03:19","author":"Brett Chase,Emmanuel Camarillo,Frank Main,Mary Norkol,Nader Issa","authors":["Brett Chase","Emmanuel Camarillo","Frank Main","Mary Norkol","Nader Issa"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.135},{"id":254638882,"title":"Kamala Harris’ bail fund endorsement helped put killer, rapist back on the streets to offend again","text":"Kamala Harris helped a controversial bail fund rake in millions of dollars, which it spent on getting violent criminals back on the streets in the name of “social justice” — only for some of them to commit more crimes, including murder. Among the freed criminals: A twice-convicted male sex-offender who went on to allegedly assault other women before his re-arrest and a man who left a victim with a traumatic brain injury after being sprung from jail while awaiting trial for another felony assault. Following the May 25 death of George Floyd in Minneapolis at the hands of police, which sparked riots across the country, the Minnesota Freedom Fund received endorsements and donations from several celebrities including Seth Rogan, Justin Timberlake and Cynthia Nixon. Harris, then a California senator, also asked her supporters to donate in a June 2020 tweet. “If you’re able to, chip in now to the @MNFreedomFund to help post bail for those protesting on the ground in Minnesota,” Harris wrote. The fund, started in 2016, raked in $41,655,560, according to its 2020 tax filings — a huge windfall compared to previous years when it took in between $100,000 and $230,000 in annual donations, according to public records. The injection of capital allowed the group to go from spending $1,000 a day on bail to more than $100,000 to spring offenders, according to a report. Crime watchdogs point out how big bail funds can undermine the system itself, and say Harris — herself a former prosecutor and District Attorney in California —should know better. Hannah E. Meyers, an expert on policing at the Manhattan Institute, told The Post: “The value of the bail system is that it provides leverage, ensuring that someone charged with hurting the community doesn’t do it again before trial. “For most people, the idea of losing their own money or the savings of their loved ones is a huge motivator for not re-offending. Bail funds scramble this dynamic, since — humans being what they are — nobody cares as much about losing strangers’ money.” Meyers also noted bail is set at judges’ discretion, and should be made economically appropriate to the person in front of them. She also pointed out how those who have previously been convicted are much more likely to re-offend. “Advocates for extreme bail reform often try to obscure these very different levels of risk between releasing serious, repeat offenders and low-level or first-time offenders.” Since 2016, MFF has paid $21.2 million in cash bail and $4.8 million for immigration bonds, freeing 2,537 people from pre-trial detention and 463 from immigration detention, according to statistics on its web site. A crime watchdog group in Minneapolis which monitors the fund’s bail initiatives and crime in the city called Harris’s actions endorsing the group “irresponsible.” “It was ridiculous for Kamala Harris or any government official to promote an organization like Minnesota Freedom Fund, considering she didn’t make the tweet until June 1, well after it was clearly obvious that our city was being burned and looted by protesters,” said the director of the group who did not want to be identified because of safety concerns. “The fact that Harris’s tweet still has not been deleted, nor has she denounced how irresponsible MFF has been in bailing out dangerous offenders, even after all the controversy and proof of harm that MFF has caused to Minnesota, is proof she cares more about criminals than law abiding citizens.” When asked about the filings and the criticism leveled against their initiatives in bailing out sometimes violent criminals, the group told The Post Tuesday it is “a local non-profit led by a volunteer -based board. “We received an unprecedented level of support following the murder of George Floyd, and we have used that support to advance our mission during the years since,” said Noble Frank, the group’s communications director. Despite the huge influx of cash, MFF listed a loss of $6.7 million on its 2022 federal filings, the latest available. Here are cases where bailing offenders out has resulted in disaster for public safety: CHRISTOPHER BOSWELL The Minnesota Freedom Fund paid $350,000 in cash for the release of Christopher Don Boswell in 2020, according to the local site Alphanews.com. By that time he had already served almost 16 years in prison after being convicted of two rapes. When he was bailed out, Boswell was facing ten felony counts including attempted rape, sexual assault and kidnapping against two women, according to local news reports. No record of the outcome of those charges could be located, indicating they were dropped. The Post is waiting to hear back from police on the matter. By 2022 Boswell was alleged to be dealing meth and accused of beating up his then-girlfriend. He is also said to have forced her into having oral sex with another man while he raped her, according to the charges filed against him by the state. The charges also describe one occasion Boswell was driving to a liquor store and allegedly forced the girlfriend out of the car and to her knees while he fired off a gun to scare her. He then told the woman to get back into the car where he fired another round out the window and said “I could have killed you twice now,” according to the court papers. Boswell, now aged 41, was convicted of criminal sexual assault in the first degree, promoting prostitution, stalking and assault with a dangerous weapon last year over the 2022 incidents. He is scheduled to be released in 2042, according to court records. GEORGE HOWARD In the summer of 2021, the freedom fund bailed out George Howard while he was awaiting trial on a misdemeanor domestic assault charge. Less than a month later, Howard was arrested on a murder charge, accused of shooting another man — Luis Martinez Ortiz — in a road rage incident along a local highway in Minneapolis. Several hours after Crime Watch Minneapolis posted a tweet condemning MFF for having bailed Howard out on the domestic assault charge – he was ultimately convicted of misdemeanor disorderly conduct in that case – the non-profit seemed to have second thoughts. “MFF believes that every individual who has been arrested by the law enforcement is innocent until proven guilty, and if a judge deems them eligible for bail, they should not have to wait in jail simply because they don’t have the same income or access to resources as others,” it said, later deleting the tweet and issuing a new statement. “The killing of Luis Martinez Ortiz is an undeniable loss and tragedy for the entire community,” the new tweet said. “We have heard from you and we have revised this statement because our previous statement did not acknowledge this deep loss and for that we apologize.” Howard, who also goes by the name Ricco Lamont Passmore, 50, pleaded guilty last year. He is scheduled to be released in 2031. LIONEL TIMMS Lionel Melaki Timms, now 36, was bailed out by MFF for $10,000 in cash bail after being charged with committing a felony third-degree assault, causing substantial bodily harm, aboard a bus in Bloomington in July 2020. Timms was said to have been panhandling and repeatedly hit a passenger who refused to give him money, leaving him with a fractured nose, swollen eye and multiple abrasions and needing hospital treatment, according to court documents in the case. A month later Timms was arrested again on a new set of assault charges after allegedly leaving a victim with a traumatic brain injury, a fractured skull and a brain bleed after kicking them in an alley, according to reports. The MFF commented on news of the second assault, saying it was “deeply saddened” by the assault on a “popular and well-respected member of our community.” They also tried to blame local authorities, saying: “We paid his bail after working to first ensure that Mr. Timms would be provided with housing and other necessary support … Delays in the government’s processing of his release prevented him from receiving that assistance, setting the stage for the subsequent tragedy.” Hennepin County Attorney’s Office brought another felony count of third-degree assault against him over the incident. Both cases were combined and Timms was found guilty of felony assault in 2021 and sentenced to five years in prison, court records show.","summary":"Minnesota Freedom Fund took in more than $41 million after an endorsement from Kamala Harris, and then used the cash to spring violent criminals","url":"https://nypost.com/2024/08/21/us-news/kamala-harris-bail-endorsement-helped-put-re-offenders-back-on-the-streets/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/kamala-bail.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-22 00:01:38","author":"Isabel Vincent","authors":["Isabel Vincent"],"language":"en","source_country":"us","sentiment":-0.068},{"id":254639106,"title":"Differences between Kamala Harris' 2020 and '24 White House runs","text":"Differences between Kamala Harris' 2020 and '24 White House runs Ian Sams is the senior national spokesperson for the Harris-Walz campaign and acted as national press secretary for Kamala Harris's presidential campaign in the leadup to the 2020 election. Sams joined CBS News to discuss Harris' 2024 campaign so far.","summary":"Ian Sams is the senior national spokesperson for the Harris-Walz campaign and acted as national press secretary for Kamala Harris's presidential campaign in the leadup to the 2020 election. Sams joined CBS News to discuss Harris' 2024 campaign so far.","url":"https://www.cbsnews.com/video/differences-between-kamala-harris-2020-and-24-white-house-runs/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/22/19cd0f9b-444a-4e34-8c16-ac96b92e5713/thumbnail/1200x630/10c8d7f4ebccdbdb59cbe3384d3b5d14/cbsn-fusion-differences-between-kamala-harris-2020-and-24-white-house-runs-thumbnail.jpg?v=fd6e213336f58b575c9e83","video":null,"publish_date":"2024-08-22 00:01:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":1},{"id":254638680,"title":"Beyoncé Sends Donald Trump Campaign Cease-and-Desist Over ‘Freedom’ Use: Report","text":"Beyoncé‘s record label has sent a cease-and-desist to Donald Trump‘s presidential campaign over its use of the megastar’s song “Freedom” in a social media video, according to Rolling Stone, which reports that the campaign did not have permission to use the track. In the offending clip, which was posted to Trump campaign spokesperson Steven Cheung‘s X account, “Freedom” plays over footage of the Republican presidential candidate stepping off a plane. The video arrived long after the song had become the official theme song for the campaign of Democratic presidential nominee Kamala Harris and her running mate Tim Walz, with Vice President Harris playing the song at her first presidential campaign rally earlier this summer after President Joe Biden dropped out of the race and endorsed her candidacy. The Harris-Walz campaign’s use of the track, including in multiple campaign ads and at the Democratic National Convention, has been done with Beyoncé’s permission. As of this writing, the Trump video using “Freedom” remains on Cheung’s X account. This is far from the first time Trump has run afoul of an artist for using their song at campaign events and elsewhere without permission. On Aug. 11, lawyers for the Isaac Hayes estate filed a notice of copyright infringement and threatened further legal action against the Trump campaign over its use of Hayes’ “Hold On, I’m Coming” at multiple Trump rallies without authorization between 2022 and 2024. Other artists who have objected to Trump’s use of their songs over the years include The Rolling Stones, Rihanna, Adele and Aerosmith‘s Steven Tyler.","summary":"The megastar's camp has reportedly bristled at the campaign's use of the track, which has become the official theme song for Kamala Harris' campaign, in a social media clip.","url":"https://www.billboard.com/pro/beyonce-label-sends-donald-trump-cease-and-desist-freedom-use/","image":"https://www.billboard.com/wp-content/uploads/2024/04/beyonce-renaissance-tour-2023-billboard-1548.jpg","video":null,"publish_date":"2024-08-21 23:55:24","author":"Chris Eggertsen","authors":["Chris Eggertsen"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.147},{"id":254638548,"title":"Everything Maren Morris Has Said About Donald Trump Ahead of DNC","text":"Maren Morris has made her opinion of former president Donald Trump and his supporters clear, and the Grammy-winning artist is taking an even stronger stance in politics with her appearance at the Democratic National Convention (DNC) on Wednesday night.Morris, who announced her split from country music last year, is set to take the stage at the DNC in Chicago, Illinois, on Wednesday night. John Legend and Stevie Wonder also are expected to perform. Morris' scheduled appearance has resurfaced comments the singer has previously made about Trump and comes as Vice President Kamala Harris is poised to officially accept the Democratic party's nomination for the presidential election on Thursday.Newsweek reached out to the DNC, the Trump campaign and representatives for Morris by email for comment.In September 2023, Morris said she was moving away from country music because of the biases associated with the genre. In an interview with the Los Angeles Times, Morris opened up about her reasons behind distancing herself from country music.\"After the Trump years, people's biases were on full display. It just revealed who people really were and that they were proud to be misogynistic and racist and homophobic and transphobic,\" she said at the time. \"All these things were being celebrated, and it was weirdly dovetailing with this hyper-masculine branch of country music. I call it butt rock.\"Morris also spoke openly about her struggles as a woman in country music, and about her feud with Brittany and Jason Aldean, which escalated following Jason Aldean's controversial track \"Try That in a Small Town.\" Aldean has previously voiced his support for Trump, admitting that he has \"nothing but good things to say about\" the former president, and telling the Los Angeles Times that it \"wouldn't hurt my feelings\" if Trump landed the 2024 Republican nomination earlier this year, Newsweek previously reported.Morris, however, holds different political views. Earlier this month in an interview with USA Today, Morris vowed to support Kamala Harris in the November election.\"I campaigned for Biden and have met Kamala and she's a badass,\" Morris told USA Today. \"I feel invigorated to vote. Living in Tennessee, it feels more impactful to have that say.\"Last year, Morris pushed back against the country music genre, telling the Los Angeles Times that the way country music is sold \"feels like indoctrination\" and that some people are streaming country songs—such as Aldean's \"Try That in a Small Town\"—out of spite.\"It's not out of true joy or love of the music. It's to own the libs,\" she told the Los Angeles Times. \"And that's so not what music is intended for. Music is supposed to be the voice of the oppressed—the actual oppressed. And now it's being used as this really toxic weapon in culture wars.\"","summary":"Singer-songwriter Maren Morris is expected to perform at the Democratic National Convention on Wednesday night.","url":"https://www.newsweek.com/everything-maren-morris-said-donald-trump-dnc-performance-1942677","image":"https://d.newsweek.com/en/full/2455373/everything-maren-morris-said-donald-trump.jpg","video":null,"publish_date":"2024-08-21 23:54:35","author":"Anna Skinner","authors":["Anna Skinner"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.192},{"id":254638534,"title":"What the DNC isn’t telling us about Kamala Harris — because they can’t","text":"Someone finally listed a concrete Kamala Harris achievement from the podium at the Democratic National Convention: She cooks a mean brisket, hubby Doug Emhoff confided. Seriously: The speeches so far have been heavy with Trump-bashing, rich with vows to protect abortion rights, deep in “vibes” — but utterly empty on specifics about what the nominee actually does well. We’ve had the odd bit about how she was “tough” as San Francisco DA and California attorney general and some kind words about her (brief) Senate service — and President Biden said she shared in his achievements. But the closest Michelle Obama, for all her memorable lines, came was: “From a middle-class household, Kamala worked her way up to become vice president of the United States of America.” Doing what? And “Kamala has shown her allegiance to this nation, not by spewing anger and bitterness, but by living a life of service and always pushing the doors of opportunity open to others.” What service, exactly? Maybe name someone who got to walk through those doors? “Throughout her entire life, that’s what we’ve seen from Kamala Harris, the steel of her spine, the steadiness of her upbringing, the honesty of her example, and yes, the joy of her laughter and her light.” It was pure character reference. Barack Obama tried to offer a few specifics: “As a prosecutor, Kamala stood up for children who had been victims of sexual abuse.” Stood up — with what results? As Cali attorney general, “she fought big banks and for-profit colleges, securing billions of dollars for the people they had scammed.” She won some big settlements. What big-state AG doesn’t? Finally: “As vice president, she helped take on the drug companies to cap the cost of insulin, lower the cost of health care and give families with kids a tax cut.” She helped! That’s all we got, in over an hour of speechifying from the party’s superstar speakers. Kamala Harris has been in politics for decades, but nobody can think of a major act of leadership or truly bold action — let alone any serious results she’s personally delivered. We hope that brisket’s really good.","summary":"Someone finally listed a concrete Kamala Harris achievement from the podium at the Democratic National Convention: She cooks a mean brisket, hubby Doug Emhoff confided.","url":"https://nypost.com/2024/08/21/opinion/what-the-dnc-isnt-telling-us-about-kamala-harris-because-they-cant/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/doug-emhoff-second-gentleman-u-88065259-e1724280414765.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-21 23:54:24","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.082},{"id":254638758,"title":"Former Kamala Harris comms director previews Bill Clinton's DNC speech","text":"Former Kamala Harris comms director previews Bill Clinton's DNC speech CBS News political contributor Ashley Etienne is also the former communications director for Vice President Harris. She commented on what she expects from Bill Clinton's DNC address and offered her thoughts on both Michelle Obama's Tuesday night speech and Nancy Pelosi's upcoming Wednesday night remarks.","summary":"CBS News political contributor Ashley Etienne is also the former communications director for Vice President Harris. She commented on what she expects from Bill Clinton's DNC address and offered her thoughts on both Michelle Obama's Tuesday night speech and Nancy Pelosi's upcoming Wednesday night remarks.","url":"https://www.cbsnews.com/video/former-kamala-harris-comms-director-previews-bill-clintons-dnc-speech/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/21/e3f75dac-0ca9-463b-8c4e-e1edd88cf671/thumbnail/1200x630/b8aff693db1b22c667d61fc864c39515/cbsn-fusion-former-kamala-harris-comms-director-previews-bill-clintons-dnc-speech-thumbnail.jpg?v=fd6e213336f58b5","video":null,"publish_date":"2024-08-21 23:48:00","author":null,"language":"en","source_country":"US","sentiment":0.785},{"id":254638606,"title":"CBS News poll shows how Democrats feel about Tim Walz as VP pick","text":"CBS News poll shows how Democrats feel about Tim Walz as VP pick A CBS News poll shows 60% of Democrats say they are enthusiastic about having Minnesota Gov. Tim Walz as Kamala Harris' running mate. CBS News executive director of elections and surveys Anthony Salvanto has more on the new polling.","summary":"A CBS News poll shows 60% of Democrats say they are enthusiastic about having Minnesota Gov. Tim Walz as Kamala Harris' running mate. CBS News executive director of elections and surveys Anthony Salvanto has more on the new polling.","url":"https://www.cbsnews.com/video/cbs-news-poll-shows-democrats-feel-about-tim-walz-vp-pick/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/21/b5e10122-92be-4074-8628-277244dac9a9/thumbnail/1200x630/c63ba25d28a20eaae2e27b97b1aebfd4/cbsn-fusion-cbs-news-poll-shows-democrats-feel-about-tim-walz-vp-pick-thumbnail.jpg?v=fd6e213336f58b575c9e836e955","video":null,"publish_date":"2024-08-21 23:47:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.012},{"id":254638754,"title":"Exclusive: Hillary Clinton Says Her DNC 2024 Speech “Was Cathartic”","text":"“It certainly is a speech that I felt I needed to give, and only I could have given,” Clinton, whom I spoke to this morning, tells me. From the start, Clinton appeared more relaxed than many people had seen her before. Gone were the headwinds of previous Clinton eras, the melodrama of an embattled Bill and Hill against the world. Now in semi-retirement, Secretary Clinton could speak her mind without fear of attack—and tap into her emotions more frankly than ever before. “There still is this sense of 2016 being unresolved,” she says, “and that’s one of the common themes I hear. It certainly is what people tell me.” The first sign of that shared feeling was the crowd response at the United Center, a cathartic roar that lasted a full minute. Though the room was huge, it felt intimate for Clinton, who saw friendly faces in the rows before her. “The way that the stage went out so close to the first row of delegates, I could literally see their faces, and see the faces of people going back 120 rows,” Clinton recalls. “I didn’t feel like I was up on a stage apart from the crowd, but that I was really right in the midst of the crowd. And so it was a really emotional sense of embrace that I felt from the moment that I walked out there.” “Overall,” she adds, “it was even more emotional than I thought.” Clinton worked on the speech for two weeks, collaborating primarily with speechwriter Dan Schwerin, along with aides and writers Nick Merrill, Caty Gordon, and Lauren Peterson, an assigned DNC writer. Her first reader, of course, was Bill Clinton. “Originally, it was going to be Joe Biden’s convention,” Clinton says, but the mission had changed: “How would I feel when another woman would be hopefully on the brink of getting into the Oval Office?” she says. “And I felt really good.” Clinton’s mandate was to pass a torch to Kamala Harris, to place her in the arc of history and the women’s rights movement, from the runs of Shirley Chisholm and Geraldine Ferraro to that of Clinton herself. On the day of the speech, says Schwerin, Clinton “was sitting around a table where she was reading and editing and practicing and putting her stamp on it, because it was, in the end, a deeply personal speech, her life’s work.” This invariably made it, at least in part, about the dashed hopes of 2016, when Clinton had been holding the torch and women and girls across America had expected to wake to news of the first female president of the United States the morning after Election Night. “When I was working on the speech and practicing the speech, I got emotional numerous times,” Clinton says, “and had to kind of work through it so that I could get through it up onstage.” “It certainly was cathartic for me,” she continues, “and based on both the reception I got in the hall and the follow-on outreach that I’ve gotten, it was cathartic for many, many people.” Afterward, she says, people told her they had to “force themselves to watch it,” because of how painful the memory of 2016 was, but then found it “therapeutic” to hear her not just revive the feminist storyline of her own campaign but reinvent it for Harris, envisioning her taking the oath through the nearly 66 million cracks in the proverbial glass ceiling that Clinton herself had put there. “I mean, I have just been swamped by people—both online, on text, on email, in person—really expressing how what I said made them feel in the moment, made them feel about all of their unresolved emotions around 2016,” she says. “So it was a collective experience, and that made me feel like I had done what I came to do—that, you know, don’t be afraid. Don’t be in a crouch. Do everything you can to try to elect Kamala because it’s the right thing to do, it’s the best thing to do, and it’s what our country needs right now.” Clinton was uniquely suited to telegraph to voters the “urgency” of the moment and to give them “permission to be 100% invested” without worrying whether they were going to get fooled again. “Don’t be afraid,” she says of her message. “You know, a lot of weird things happened in 2016—we have to be prepared. We have to be smarter, quicker.” Clinton put a few rhetorical daggers into Trump, most notably her line about Trump falling asleep at his own trial and waking up to find he’d “made his own kind of history” as a convicted felon. But the line that best crystallized the feeling inside the room in Chicago led to giddy cheers. That line was: “We have him on the run now.” It was a line Democrats wanted and needed to hear—especially from Hillary Clinton. “I think Democrats have been kind of in a crouch,” Clinton tells me, “with our hands over our head, not wanting to get hit again by, you know, the chaos, the corruption that Trump brings in his wake, the overwhelming attention that he demands from the press, which just floods not just the airwaves but the brain waves.” Merrill, Clinton’s chief aide, thinks the speech “broke the fever dream” of Trump’s hold on the Democratic psyche. And that may be true. Hillary Clinton, rising to a moment nobody dreamed of a month ago, had liberated Democrats to move forward—and, in doing so, liberated herself as well.","summary":"In a new interview with Vanity Fair, Secretary Clinton speaks about writing one of the most groundbreaking speeches of her career—and the emotions it released from 2016.","url":"https://www.vanityfair.com/news/story/hillary-clinton-dnc-2024","image":"https://media.vanityfair.com/photos/66c65ee3be7d9a8109517dbf/16:9/w_2000,h_1125,c_limit/hillary-clinton-dnc-speech.jpg","video":null,"publish_date":"2024-08-21 23:45:44","author":"Joe Hagan","authors":["Joe Hagan"],"language":"en","source_country":"US","sentiment":0.007},{"id":254638290,"title":"Why RFK Jr.’s Exit From Race Probably Won’t Help Trump Very Much","text":"Share to Facebook Share to Twitter Share to Linkedin Topline Robert F. Kennedy Jr.’s anticipated exit from the presidential race and rumored endorsement of former President Donald Trump might help Trump in the race by a tiny margin, according to some analyses, but his single-digit polling average isn’t likely to boost Trump or Vice President Kamala Harris enough to tip the scales in either candidate’s favor. Independent presidential candidate Robert F. Kennedy Jr. speaks during the Freedom Fest at the ... [+] Caesars Forum Conference Center, on Friday, July 12, 2024, in Las Vegas. (Daniel Jacobi II/Las Vegas Review-Journal/Tribune News Service via Getty Images) TNS Key Facts RealClearPolitics’ polling average shows Harris with a 1.6-point advantage over Trump in a five-way race with Kennedy, independent Cornel West and Green Party candidate Jill Stein on the ballot, but her lead only narrows to 1.5 points in a two-way matchup—indicating Kennedy would barely help Trump if he’s not on the ballot. Similarly, an Emerson College poll released Thursday found Kennedy’s exit from the race is a wash: Trump and Harris both gained two points in a head-to-head matchup, compared to their margins in a six-way race. A Washington Post analysis, however, found that Kennedy has been hurting Trump more than Harris since President Joe Biden left the race, citing six reputable surveys that found Trump loses points when third-party candidates are in the mix. Equal shares (2%) of Republicans and Democrats and those who lean toward either party backed Kennedy in an Aug. 11-13 Economist/YouGov poll, while Kennedy netted 8% of support from voters who identified as independent or leaning independent. An Aug. 1-4 NPR/PBS/Marist poll also found 2% of Democrats, 3% of Republicans and 12% of independents would support Kennedy. Since the Kennedy voters who identify as Republican or Democrat would likely vote for their party’s preferred candidate in a two-way race, most of the votes up for grabs are from independents who prefer Kennedy. Generally, independent voters tend to prefer Harris over Trump (48% to 37% in the NPR/PBS/Marist poll and 33% to 20% in the Economist/YouGov poll when voters who lean independent are factored in), suggesting she’s more likely to pick up a larger share of the independent voters who say they’d back Kennedy. Big Number 4.5%. That’s the share of voters who back Kennedy as of Wednesday, according to RealClearPolitics’ polling average, compared to 16.7% who supported him in November, a month after he dropped his Democratic primary bid to run as an independent. Tangent Harris gains ground in the crucial swing states of Michigan (0.4 points) and Wisconsin (0.7 points) with Kennedy in the mix, but Trump benefits with him on the ballot in Nevada (1 point) and Georgia (0.7 points), according to a RealClearPolitics analysis. Harris also makes gains in Arizona and Pennsylvania with Kennedy on the ballot—enough, in fact, to take the lead away from Trump given his narrow advantage in the two key swing states, according to RealClearPolitics. Key Background Kennedy announced Wednesday he will speak Friday about his “path forward” in the presidential race, and multiple outlets reported he will drop out and endorse Trump. His running mate, Nicole Shanahan, said in an interview on Tuesday he was considering ending his presidential campaign to endorse Trump, amid a decline in polls and a struggle to fundraise. Trump has been angling for Kennedy’s endorsement, and met with him in July to discuss the prospect. Trump has also said he’s open to giving Kennedy a role in his administration if he’s elected to a second term. Further Reading RFK Jr. Will Speak About ‘Path Forward’ Friday Amid Reports He Will Drop Out And Endorse Trump (Forbes) Trump Says He’s ‘Open’ To Role For RFK Jr. In Second Term—As Independent Reportedly Considers Ending Run (Forbes) Election Betting Markets Swing Towards Trump As RFK Jr. Mulls Dropping Out (Forbes) Follow me on Twitter. Send me a secure tip. Sara Dorn Following Editorial Standards Print Reprints & Permissions","summary":"Polls show RFK Jr.’s support has tanked from about 17% in November to less than 5%.","url":"https://www.forbes.com/sites/saradorn/2024/08/21/why-rfk-jrs-exit-from-race-probably-wont-help-trump-very-much/","image":"https://imageio.forbes.com/specials-images/imageserve/66c6790d137e64e211d6d15c/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-21 23:43:44","author":"Forbes Staff,Sara Dorn","authors":["Forbes Staff","Sara Dorn"],"language":"en","source_country":"US","sentiment":-0.003},{"id":254638238,"title":"Donald Trump Was 'Highest Bidder' For RFK Jr.: George Conway","text":"Conservative attorney George Conway, a frequent critic of Donald Trump, suggested that the former president may have played a role in Robert F. Kennedy Jr.'s reported decision to drop out of the 2024 presidential race.ABC News reported on Wednesday that Kennedy, who is running as an independent, is planning to suspend his campaign by the end of the week and throw his endorsement behind Trump. Sources familiar with the situation, who spoke on the condition of anonymity, also confirmed Kennedy's plans to CNN and Politico.The reports follow news that Kennedy—a lifelong Democrat and nephew of former President John F. Kennedy—had sought a meeting earlier this month with Vice President Kamala Harris to discuss a potential role in her future administration in exchange for his endorsement, according to The Washington Post. The newspaper reported in July that Kennedy had talks with Trump about a similar deal, but people familiar with the matter said that no agreement was reached.\"I guess Trump was the highest bidder,\" Conway wrote to X, formerly Twitter, Wednesday evening.Newsweek has reached out to Kennedy's campaign via email for comment.Trump said during an interview with CNN's Kristen Holmes earlier this week that he was \"open\" to offering Kennedy a role in his administration if the independent dropped out of the 2024 race.\"I like him a lot, I respect him a lot,\" Trump said on Tuesday. \"I probably would if something like that would happen. He's a very different kind of a guy, a very smart guy, and I would be honored by that endorsement certainly.\"That same day, Kennedy posted to X that he was \"willing to talk with leaders of any political party to further the goals I have served for 40 years in my career and in this campaign.\" Among his priorities, he said, are \"reversing the chronic disease epidemic, ending the war machine, cleaning corporate influence out of government and toxic pollution out of the environment, protecting freedom of speech, and ending politicization of enforcement agencies.\"Kennedy's press secretary, Stefanie Spear, also fueled speculation around the candidate's political future in a post to X Wednesday afternoon, writing that Kennedy plans to \"address the nation live on Friday about the present historical moment and his path forward.\"Sources who spoke with ABC News said that any decisions about Kennedy's campaign had not been finalized. When asked by the outlet directly on Wednesday if he plans to endorse Trump, Kennedy told ABC, \"I will not confirm or deny that. We are not talking about any of that.\"","summary":"Kennedy, an independent presidential candidate, is reportedly considering dropping out of the 2024 race and endorsing Trump.","url":"https://www.newsweek.com/donald-trump-highest-bidder-rfk-jr-george-conway-1942707","image":"https://d.newsweek.com/en/full/2455418/trump-was-highest-bidder-rfk-conway.jpg","video":null,"publish_date":"2024-08-21 23:43:08","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.012},{"id":254638306,"title":"Democrats set Chicago convention roll call to a soundtrack: Here’s each song, by state or territory","text":"The traditional roll call at the Democratic National Convention in Chicago turned into a boisterous dance party Tuesday, with each delegation announcing their votes for presidential nominee Kamala Harris to a fitting song. The musical nods spun by DJ Cassidy were mostly obvious. Massachusetts went with a punk song about Boston. Kansas picked a song from the band Kansas. But there were curious picks — like American Samoa rolling out to Lady Gaga’s “Edge of Glory” — and some delegations said they simply didn’t have a say in the matter. Here’s how each song (likely) fits each state or territory, in order of the roll call: Alabama: “Sweet Home Alabama,” Lynyrd Skynyrd Yes, the Southern state picked its most famous name-check, even if the band itself is originally from Florida. Alaska: “Feel It Still,” Portugal. The Man Despite the European nation in its name, the rock band is from Wasilla, Alaska, which also happens to be the hometown of former Republican vice presidential candidate Sarah Palin. American Samoa: “Edge of Glory,” Lady Gaga The territory’s Democratic Party didn’t respond to an email seeking comment Wednesday but NPR reports this is a “tongue-in-cheek nod to the territory’s position as the southernmost territory in the United States.” So we’ll go with that. Arizona: “Edge of Seventeen,” Stevie Nicks The former Fleetwood Mac singer and solo artist is from Phoenix. Arkansas: “Don’t Stop,” Fleetwood Mac The Southern state also went with a Nicks’ hit when it picked this song, which was also famously the theme of then-Arkansas Gov. Bill Clinton’s winning 1992 presidential campaign. Colorado: “September,” Earth, Wind & Fire One of the original lead singers of the band, Philip Bailey, was born in Denver, where he and other band members from the Mile High City are also in the Colorado Music Hall of Fame. Connecticut: “Signed, Sealed, Delivered (I’m Yours),” Stevie Wonder The New England state’s pick was one of former President Barack Obama’s go-to songs during his two successful presidential runs, but there’s no apparent connection to Connecticut. (Wonder is from Michigan.) Delaware: “Higher Love,” Kygo and Whitney Houston The home state of President Joe Biden went with a song that had been a mainstay of his 2020 campaign. Democrats Abroad: “Love Train,” The O’Jays The organization acknowledged Wednesday it didn’t have a say in the pick, but said the early disco hit was appropriate, given it has members in more than 190 countries. Washington, D.C.: “Let Me Clear My Throat,” DJ Kool The delegation from the nation’s capital went with the party anthem by a native son. Florida: “I Won’t Back Down,” Tom Petty The late rock star was born in — you guessed it — the Sunshine State. Georgia: “Turn Down For What,” DJ Snake and Lil Jon Atlanta’s own Lil Jon delivered a raucous version of his hit live and in person to the crowd at Chicago’s United Center. Guam: “Espresso,” Sabrina Carpenter The island territory went with one of the biggest hits of the summer, though Carpenter was born and raised in Pennsylvania, some 7,800 miles (12,500 kilometers) away. Hawaii: “24K Magic,” Bruno Mars If you haven’t already picked up on a theme here, the R&B star hails from Honolulu. Idaho: “Private Idaho,” The B-52s The song is by the Georgia band most famous for “Love Shack” and other hits, but singer Fred Schneider told the Idaho Statesman he chose this song title because the state is “pretty mysterious to, you know, all of us.” Illinois: “Sirius,” The Alan Parsons Project The British prog rock band’s song was the intro music for the Michael Jordan-era Chicago Bulls, who played in the very arena hosting the convention. Indiana: “Don’t Stop ’til You Get Enough,” Michael Jackson Jackson and his famous family were originally from the industrial city of Gary, Indiana. Iowa: “Celebration,” Kool and The Gang The band may have been from New Jersey but everyone likes to celebrate good times, c’mon. Kansas: “Carry On Wayward Son,” Kansas There was really only one way this pick was going to go — a song from the arena rock band from Topeka, Kansas. Kentucky: “First Class,” Jack Harlow The rapper was born and raised in the Bluegrass State. Louisiana: “All I Do Is Win,” DJ Khaled feat. T-Pain, Ludacris, Snoop Dogg and Rick Ross New Orleans native? Check. Infectious party anthem? You bet. Maine: “Shut Up and Dance,” Walk the Moon Once again, a New England state ended up with a song everyone can sing along to, even if it didn’t have an obvious local connection. (Walk the Moon is from Ohio.) Maine Democrats say their pick of a song from local band The Ghost of Paul Revere was ultimately nixed. Maryland: “Respect,” Aretha Franklin The mid-Atlantic state also decided against a homegrown pick when it rolled with a hit from Detroit’s late “Queen of Soul.” Massachusetts: “I’m Shipping Up to Boston,” The Dropkick Murphys The de facto anthem of the Red Sox, by an Irish American punk band from the suburbs of the Massachusetts capital? No notes. Michigan: “Lose Yourself,” Eminem The hit comes from the Detroit native’s 2002 semi-autobiographical movie “8 Mile,” about a struggling rapper trying to make his name in the city’s hip-hop scene. Mississippi: “Twistin’ the Night Away,” Sam Cooke The late soul singer was born in Clarksdale, Mississippi. Missouri: “Good Luck, Babe!,” Chappell Roan The Show-Me State went with an upbeat track by the rising pop star, who hails from Willard, Missouri (and who recently headlined Chicago’s Lollapalooza). Montana: “American Woman,” Lenny Kravitz The song, originally by the Canadian band The Guess Who, has no obvious connection to the Big Sky State — but the title has everything to do with sending a woman to the White House. Nebraska: “Firework,” Katy Perry Perry has no apparent connection to the Cornhusker State, but she’s lent her starpower to the Democratic Party in recent years, performing at Biden’s inauguration. Her hit song “Roar” also featured prominently in Hillary Clinton’s failed 2016 presidential campaign. Nevada: “Mr. Brightside,” The Killers Brandon Flowers and Dave Keuning formed the rock band more than two decade ago, in Las Vegas. New Hampshire: “Don’t Stop Believin’,” Journey The rock band formed in San Francisco, but we’d be hard-pressed to find an event, rally or game that hasn’t used this song as its anthem. New Jersey: “Born in the U.S.A.,” Bruce Springsteen It couldn’t get more obvious than this. “The Boss” is from Long Branch, New Jersey, and politicians from both parties have played his song at rallies and events too many times to count — despite its more subversive lyrics. New Mexico: “Confident,” Demi Lovato Lovato was born in Albuquerque, New Mexico. New York: “Empire State of Mind,” Jay-Z feat. Alicia Keys Both Jay-Z and Keys are from New York, the city for which this song is an anthem and ode. North Carolina: “Raise Up,” Petey Pablo Pablo, a rapper and record producer, is from the Tar Heel State. North Dakota: “Girl on Fire,” Alicia Keys As established above, Keys is from New York, but her song has often been used to celebrate and empower women (including at the Olympics ). Northern Mariana Islands: “Ain’t No Mountain High Enough,” Marvin Gaye and Tammi Terrell The U.S. commonwealth north of Guam has no apparent connection to Gaye or Terrell, but it is mountainous with several volcanos — and the song choice could be a nod to the journey Harris is on. Ohio: “Green Light,” John Legend feat. André 3000 Legend was born in Springfield, Ohio. (André 3000 of Outkast is from Atlanta, however. And Legend is in town for the DNC). Oklahoma: “Ain’t Goin’ Down (‘til the Sun Comes Up),” Garth Brooks The country singer was born in Tulsa, the Sooner State’s second-largest city. Oregon: “Float On,” Modest Mouse The band was formed in Washington state, but is now based in Portland, Oregon. Pennsylvania: “Motownphilly,” Boyz II Men; “Black and Yellow,” Wiz Khalifa Boyz II Men is from Philadelphia, where the music video for “Motownphilly” was filmed. Meanwhile, Wiz Khalifa’s “Black and Yellow” is about growing up in Pittsburgh. The titular colors are a tribute to the city’s football team, the Steelers. Puerto Rico: “Despacito,” Luis Fonsi feat. Daddy Yankee Both singers behind this 2017 song of the summer are from Puerto Rico. Rhode Island: “Shake it Off,” Taylor Swift Swift is from Pennsylvania, but in 2013 purchased what was then the most expensive private home in Rhode Island. South Carolina: “Get Up (I Feel Like Being A) Sex Machine,” James Brown The late “Godfather of Soul” was born in Barnwell, South Carolina. South Dakota: “What I Like About You,” The Romantics The rock band is from Detroit, not the Mount Rushmore State. Does it matter if there’s a lot to like? Tennessee: “9 to 5,” Dolly Parton The country music legend was born in Pittman Center, Tennessee, and currently lives outside of Nashville. Texas: “TEXAS HOLD ‘EM,” Beyoncé In case it needs explaining, Beyoncé is from Houston. Utah: “Animal,” Neon Trees The rock band formed in Provo, Utah. Vermont: “Stick Season,” Noah Kahan Kahan was born in Strafford, Vermont, a picturesque New England town. US Virgin Islands: “VI to the Bone,” Mic Love As the song title indicates, the rapper is from the U.S. Virgin Islands. Virginia: “The Way I Are,” Timbaland feat. Keri Hilson and D.O.E. Timbaland was born and raised in Norfolk, Virginia. Washington: “Can’t Hold Us,” Macklemore & Ryan Lewis Both Macklemore and Lewis are from the Evergreen State. West Virginia: “Take Me Home, Country Roads,” John Denver Denver is from New Mexico, but the hit song he wrote with Bill Danoff and Taffy Nivert has long been a symbol of the Mountain State. Wisconsin: “Jump Around,” House of Pain The hip-hop trio is from Los Angeles, but their 1992 hit song has been played at University of Wisconsin football games for years. Wyoming: “I Gotta Feeling,” Black Eyed Peas The song has no apparent connection to the state but sent a message that’s pretty self-explanatory. And at the end of the alphabetical roll call, the candidates’ home states: Minnesota: “Kiss” and “1999,” Prince and The Revolution The pop superstar was born in — and died in — his home state, which he shares with vice presidential nominee Gov. Tim Walz. California: “The Next Episode,” Dr. Dre; “California Love,” Tupac Shakur; “Alright” and “Not Like Us,” Kendrick Lamar Harris’ home state picked a medley of West Coast hip-hop anthems — classic and more recent — to close out the roll call. Marcelo reported from New York and Naishadham from Washington.","url":"https://chicago.suntimes.com/2024-democratic-national-convention/2024/08/21/democrats-set-chicago-convention-roll-call-to-a-soundtrack-heres-each-song-by-state-and-territory","image":"https://cst.brightspotcdn.com/dims4/default/a273020/2147483647/strip/true/crop/7735x4415+0+372/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fae%2F1c%2F2cd686804e16abd791807387e7e0%2Fdnct","video":null,"publish_date":"2024-08-21 23:38:39","author":"Philip Marcelo | Ap,Suman Naishadham | Ap","authors":["Philip Marcelo | Ap","Suman Naishadham | Ap"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.178},{"id":254638464,"title":"Donald Trump’s strategy to grab attention away from Kamala Harris at the DNC","text":"Donald Trump plans to flood the airwaves with rallies, press conferences and campaign events that will run a massive counterprogramming effort to the Democratic National Convention this week. The former president will hold events each day this week in key swing states, and his running mate Sen. J.D. Vance also plans to hit battleground states with events on Monday, Tuesday and Thursday – and it all culminates in a rally on Friday. Meanwhile, Trump’s allies will run daily press conferences at Trump Hotel in Chicago, Illinois each day of the DNC. Republican surrogates coming to town for the Convention include Sens. Rick Scott (Fla.) and Ron Johnson (Wisc.) and Florida Reps. Byron Donalds and Mike Waltz. The Thursday press conference will include a ‘surprise special guest.’ During a call with reporters, the Trump campaign noted they are ‘making sure we are accessible’ to the press while Harris goes nearly a month without a press conference or sit-down interview since announcing her candidacy. As Democrats descend on Chicago for their Convention to nominate for their 2024 ticket Vice President Kamala Harris as president and Minnesota Gov. Tim Walz as VP, Trump and Vance will hit all seven of the swing states that will determine the outcome in November. ‘At the DNC, Kamala Harris will hide behind celebrities because everyday families know that she has been an absolute disaster for our nation, and real Americans are worse off now than four years ago,’ Trump Campaign Senior Advisors Chris LaCivita and Susie Wiles said in a statement on the counterprogramming. ‘Harris has failed to answer media questions for 28 days because she can’t explain away her record of supporting policies that cause inflation, bans on private health insurance, destroying American energy, and higher taxes,’ they added. ‘As they meet Americans where they are in battleground states across the country, President Trump and Senator Vance will remind voters that under their leadership, we can end inflation, protect our communities from violent criminals, secure the border, and Make America Great Again.’ Trump will first head to York, Pennsylvania on Monday to focus on economic issues at an intimate event with about 150 people at a manufacturing warehouse. Sen. Vance will also be in Pennsylvania on the first day of the DNC with about 200 factory workers and business owners in Philadelphia. On the same day, President Joe Biden is the keynote speaker for the DNC after delegates officially nominate Harris and Walz. On Tuesday, Trump will go to Detroit, Michigan for an event with 100 law enforcement officers and their families to discuss rising crime under Democratic leadership. Vance will also focus on crime and safety during an event with victims of crime in Kenosha, Wisconsin on Tuesday. In Chicago, former President Barack Obama will headline remarks after his wife and former first lady Michelle Obama speaks. Trump and Vance will appear together on Wednesday for a national security-focused event at the North Carolina Aviation Museum and Hall of Fame in Asheboro. It comes the same month as the third anniversary of Biden’s botched troop withdrawal from Afghanistan, which resulted in the deaths of 13 U.S. service members. Rep. Donalds will also attend the event with approximately 3,000 veterans, gold star families and elected officials for remarks focused on keeping American sovereignty and military strength. Walz will keep with tradition by speaking and formally accepting his nomination as the Democrats’ vice presidential candidate on the penultimate day of the Convention. And Harris will speak on Thursday. Trump will head to the border on Thursday – the last day of the Convention – for an immigration event in Montezuma Pass, Arizona, while his running mate will be in Valdosta, Georgia to also focus on immigration issues at a local sheriff’s office. Trump’s campaign says their themes for the week purposefully line-up with speakers at the Convention. When Biden and Hillary Clinton speak on Monday, the Trump campaign will focus on economic policies with ‘Make America Wealthy Again.’ As the Obamas speak on Tuesday, the theme for Republicans is ‘Make America Safe Again.’ And when Walz talks on Wednesday the Trump team is focusing on national security and military strength with ‘Make America Strong Again.’ When Harris wraps on Thursday, Trump and Vance will go after the VP for her role as ‘border czar’, where she was meant to lead Biden administration efforts to address migrant issues and secure the southern border. After the DNC wraps on Thursday, Trump is continuing his programming with a stop in Las Vegas, Nevada highlighting his proposal for no tax on tips on Friday morning and will head back to Arizona for a rally in Glendale in the evening. On the road, Trump and Vance will hold opportunities for reporters to ask them questions as the Republican ticket continues to bring to the forefront the juxtaposition of their press strategy compared to the Harris-Walz ticket. Since taking over Biden’s campaign on July 21, Harris has not sat down for an interview or held a press conference with reporters. The Trump team has blamed the media for giving Harris a ‘free pass’ and providing her with favorable coverage without having to sit for an interview and therefore prolonging the ‘honeymoon phase.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump plans to flood the airwaves with rallies, press conferences and&#8230;\n\n\nThis Post: Donald Trump&#8217;s strategy to grab attention away from Kamala Harris at the DNC first appeared on Internewscast Journal","url":"https://internewscast.com/politics/donald-trumps-strategy-to-grab-attention-away-from-kamala-harris-at-the-dnc/","image":"https://i.dailymail.co.uk/1s/2024/08/18/19/88656581-13755147-image-a-15_1724006989928.jpg","video":null,"publish_date":"2024-08-21 23:37:22","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.072},{"id":254638206,"title":"DNC Chairman Shares Why He’s Excited to Support Kamala Harris","text":"Jaime Harrison, Chairman of the Democratic National Committee, shares with NTD’s Kelly Wright why he supports Vice President Kamala Harris for president. He also explores his personal upbringing and what makes America unique.","summary":"Jaime Harrison, Chairman of the Democratic National Committee, shares with NTD’s Kelly Wright why he supports Vice President Kamala Harris for president. He also explores his personal upbringing and what makes America unique.","url":"https://www.theepochtimes.com/epochtv/dnc-chairman-shares-why-hes-excited-to-support-kamala-harris-5710417","image":"https://img.theepochtimes.com/assets/uploads/2024/08/21/id5710430-jaime-harrison-2.jpg","video":null,"publish_date":"2024-08-21 23:36:21","author":"Kelly Wright","authors":["Kelly Wright"],"language":"en","source_country":"us","sentiment":0.541},{"id":254637940,"title":"Gwen Walz's Fertility Journey in Spotlight: What to Know About IUI vs. IVF","text":"When Vice President Kamala Harris elevated Minnesota Governor Tim Walz as her running mate this month, the country was introduced to a new political figure whose family background quickly attracted attention.For the Walz family, the biggest test on the national stage will begin Wednesday night as First Lady Gwen Walz steps into the spotlight by way of a narrated video that will formally introduce her husband at the Democratic National Convention.Gwen and Tim, both former high school teachers, are parents to two children, Hope and Gus. The couple have spoken openly about how they named their daughter Hope after years of trying to conceive.In his debut speech Harris' vice presidential nominee, Walz shared how IVF was \"personal\" to him, recounting the \"years going through infertility treatments\" before their daughter was born.\"Even if we wouldn't make the same choice for ourselves, there's a golden rule: Mind your own damn business,\" Walz said in Philadelphia. \"Look, that includes I.V.F. And this gets personal for me and my family.\"Years earlier, when he first ran for governor of Minnesota, a campaign flyer was mailed out in an envelope reading: \"My wife and I used I.V.F. to start a family.''But the Walzes did not technically do I.V.F., as the New York Times reported this week.The campaign has since clarified that the couple went through intrauterine insemination, also known as I.U.I. The process is often discussed by those who go through it under the umbrella term of I.V.F., but there are notable differences. Chief among them: the I.U.I process happens inside the body, while I.V.F. happens in a lab. What Have Tim and Gwen Walz Shared About IUI?On Tuesday, amid growing scrutiny over what her husband has said about their fertility journey, Gwen Walz issued a statement that offered a more comprehensive account of her family's experience.\"Like so many who have experienced these challenges, we kept it largely to ourselves at the time—not even sharing the details with our wonderful and close family,\" Walz said.I.U.I., often attempted before I.V.F., does not carry the same level of political controversy because it does not involve the potential destruction of embryos, which some anti-abortion advocates, including the Catholic Church, equate to unborn children.\"In Vitro Fertilization requires inseminating an egg outside of the uterus and then implanting that embryo. IUI, on the other hand, involves the insertion of sperm and stimulation to help with mobility, leading to fertilization within the womb rather than outside. Those are the main differences,\" said Julie Burkhart, president of Wellspring Health Access in Wyoming.How Has the Harris Campaign Responded?The Walz family's fertility journey has drawn criticism from the Trump campaign and others on the right after Tim Walz brought it up as a way to critique the GOP's stance on reproductive rights.Earlier this month, Walz criticized Ohio Sen. JD Vance, the Republican candidate for vice president, saying: \"If it was up to him, I wouldn't have a family because of I.V.F.\"After the details of their fertility treatments came to light, Vance accused Walz of lying about his family's use of I.V.F.: \"Today it came out that Tim Walz had lied about having a family via I.V.F.,\" he wrote on social media. \"Who lies about something like that?\"In response, Mia Ehrenberg, a spokesperson for the Harris-Walz campaign, defended Walz, saying: \"Governor Walz talks how normal people talk. He was using commonly understood shorthand for fertility treatments.\"Dr. Jason Griffith, a reproductive endocrinologist at Shady Grove Fertility in Houston, added more context. He told Newsweek that patients often confuse the terms when they start treatment.\"They come in and say, 'Oh, I want to do IVF.' And when we discuss it, they realize, 'Wait, that's not what I thought it was—where you just put the sperm into the uterus.' That's actually intrauterine insemination (IUI),\" Griffith said.Who Are Gwen and Tim's Kids, Hope and Gus Walz?As Tim Walz joins Harris on the campaign trail, Gus and Hope have been thrust into the national spotlight. They have been seen on the trail, even sporting Harris-Walz camouflage hats that nod to both the Midwest and pop culture.Hope, 23, recently graduated from Montana State University and now works as a social worker in Montana. Her involvement in her father's campaign has helped catapult him into Gen Z stardom, with Hope even garnering her own fanbase online.Gus, 17, is starting his senior year at St. Paul Central High School this fall. Earlier this month, the Walz family shared with People magazine that Gus has a \"non-verbal learning disorder,\" ADHD, and an anxiety disorder.Follow Newsweek's live DNC updates here.","summary":"Tim Walz' wife has clarified how she was able to have children, revealing that she did not use in-vitro fertilization as was previously implied.","url":"https://www.newsweek.com/tim-gwen-walz-ivf-iui-fertility-dnc-2024-1942662","image":"https://d.newsweek.com/en/full/2455361/tim-walz-gwen-walz.jpg","video":null,"publish_date":"2024-08-21 23:35:51","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.347},{"id":254638204,"title":"Undecided Voters Swayed by Momentum of Winning Candidate: Sen. John Hickenlooper","text":"Undecided Voters Swayed by Momentum of Winning Candidate: Sen. John Hickenlooper | EpochTV Undecided Voters Swayed by Momentum of Winning Candidate: Sen. John Hickenlooper Like Save Donate Subscribe Undecided Voters Swayed by Momentum of Winning Candidate: Sen. John Hickenlooper 2024 Elections Views 33 • Aug-21-2024 Sen. John Hickenlooper (D-Colo.) tells The Epoch Times’ Jan Jekielek that undecided voters will “go where they think the winner is” and Vice President Kamala Harris is “persuading a lot of people” that she will win.","summary":"Sen. John Hickenlooper (D-Colo.) tells The Epoch Times’ Jan Jekielek that undecided voters will “go where they think the winner is” and Vice President Kamala Harris is “persuading a lot of people” that she will win.","url":"https://www.theepochtimes.com/epochtv/undecided-voters-swayed-by-momentum-of-winning-candidate-sen-john-hickenlooper-5710418","image":"https://img.theepochtimes.com/assets/uploads/2024/08/21/id5710433-Sen.-John-Hickenlooper.jpg","video":null,"publish_date":"2024-08-21 23:33:23","author":"Jan Jekielek","authors":["Jan Jekielek"],"language":"en","source_country":"us","sentiment":0.232},{"id":254638434,"title":"Trump and Vance use rally to whine about conspiracies and 'mean tweets'","text":"On Wednesday, Donald Trump rolled into Asheboro, North Carolina, with running mate JD Vance in tow, and staged his first outdoor rally since the failed attempt on his life in July. Speaking from behind bulletproof glass, Vance used his opening-act timeslot to awkwardly attack the elusive “them” for “whining about Donald Trump's mean tweets.” Then he unveiled his latest attempt at pretending to be a regular guy. “Mean tweets and world peace has a pretty nice ring to it,” he said, “and I think we oughta bring it right back.” Oof. After Vance finished his stilted speech, the stage was empty for nearly an hour before … Vance was brought back up to introduce Trump. \"They couldn't beat him at the ballot box, so they tried to bankrupt him. They failed at that, so they tried to impeach him. They failed at that, so they tried to put him in prison, and they even tried to kill him,” Vance said, once more relying on the vague, conspiratorial “they.” https://youtu.be/F0pQMstYlA8 Finally, Trump took the mic to blather through what mostly passes as his stump speech these days. He said his new name for Democratic presidential nominee Kamala Harris was “comrade” because she’s so “radical.” He then whined about everyone and everything. \"Every American was safer under President Trump. In fact, the entire world was safer when I sat behind that beautiful Resolute desk in the Oval Office,” Trump meandered. “You know, I heard the other day, for the first time, I heard [President Joe] Biden say, ‘The beautiful Resolute desk.’ He never said that before. They copy me. When I say we're a nation in decline, guys are copying me, then they say they shouldn't say that, but they thought the words were beautiful. But they copy me all the time.” Then, undercutting his whole point, he added, “In that case, it was Republicans that were copying me because they happened to be right. So I don't mind if a Republican copies me. Any of you guys want to copy me.” Soon after that, the weirdo train chugged right out of town.","summary":"On Wednesday, Donald Trump rolled into Asheboro, North Carolina, with running mate JD Vance in tow, and staged his first outdoor rally since the failed attempt on his life in July.\n\n\n\nSpeaking from behind bulletproof glass, Vance used his opening-act timeslot to awkwardly attack the elusive “them” for “whining about Donald Trump's mean tweets.” Then he unveiled his latest attempt at pretending to be a regular guy.&nbsp;\n\n\n\n“Mean tweets and world peace has a pretty nice ring to it,” he said, “and I think we oughta bring it right back.”\n\n\n\nOof.\n\n\n\nxJD Vance's new line: \"Let 'em whine about Donald Trump's tweets. Because let's be honest, folks: Mean tweets and world peace has a pretty nice ring to it, and I think we oughta bring it right back.\"\n\n(note the bulletproof enclosure visible as Vance leaves the stage) pic.twitter.com/b2VqZkgzMH\n\n— Aaron Rupar (@atrupar) August 21, 2024","url":"https://www.dailykos.com/story/2024/8/21/2264830/-Trump-and-Vance-use-rally-to-whine-about-conspiracies-and-mean-tweets?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1337066/story_image/GettyImages-2163362159.jpg?1724274662","video":null,"publish_date":"2024-08-21 23:30:12","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.234},{"id":254638410,"title":"Republicans at the DNC urge anti-Trump voters to put ‘country over party’","text":"CHICAGO — Republicans are showing up on and off the stage at the Democratic National Convention to urge their peers to support Vice President Kamala Harris for president over former President Donald Trump. A mayor in a battleground state, a former Trump voter, and a former Trump White House official have already addressed the convention to explain why they cannot support the former president’s return to the White House as they seek to appeal to those in the middle of the political spectrum. More high-profile Republicans will take the stage on Wednesday. On the sidelines, there are a number of Republicans sitting in the stands of the United Center who are actively working to get Harris elected. Joe Walsh, a former GOP congressman from Illinois, said he reached over 70,000 people over Zoom in his Republicans for Harris effort, along with former GOP Rep. Adam Kinzinger (R-IL), who was part of the House committee that was in charge of investigating the former president’s actions during the Jan. 6 attack. “It continues to grow and more high-profile national people join me and Adam Kinzinger and others. And you know this election is going to come down to 12 people in four states, and if we can just help give enough courage to some local Republicans in the battleground states, it’ll help,” Walsh told the Washington Examiner at the Democratic National Convention. Craig Snyder is the director of Haley Voters for Harris, a PAC of like-minded Republicans who voted for former United Nations ambassador Nikki Haley in this year’s Republican primaries. He believes there’s a sizable number of Republicans who could be swayed, pointing to the tens of thousands of primary voters who chose Haley even after she dropped out of the primary race. “There could easily be a third of registered Republicans who really want to move on from Donald Trump,” Snyder explained in an interview with the Washington Examiner ahead of a planned happy hour with Republicans attending the DNC on Wednesday. “The only way to move on from Donald Trump is to defeat him.” In the weeks following Harris’s rise to the top of the ticket, the Trump campaign has struggled to define Harris. In their most recent attack ads airing in swing states, they call her a “soft-on-crime radical who is too dangerous for the White House.” Snyder doesn’t think that branding is effective. “Look, she’s going to be labeled as Mao Zedong by the Trump campaign but the truth is they would say that about any Democrat, that’s the playbook,” he said. “The reality is that she was a tough prosecutor, tough on crime, for most of her career, the political criticism from the Left. “When she ran for president in 2019, she took a bunch of positions that were, in fact, pretty far left. She is renouncing those positions in this campaign. I think people can criticize that, I think it’s a sign of growth,” he added. Stephanie Sharp is also working to court a similar group of voters as the co-founder of Women4U.S., an organization of center-right women working to defeat Trump. Sharp describes herself as a lifelong Republican who served in the Kansas legislature. “We’ve talked to three different state party people this week that have said, ‘we have women walking through the doors of the Georgia Democratic Party and saying, ‘I’m a lifelong Republican, but you have to activate me’,” she said. Renee Lafair, a co-founder of the group, said there are a lot of Republicans who are helping them organize behind the scenes, specifically targeting women in swing states. “There’s a real cost for people to publicly say they’re not supporting the top of the ticket on the Republican side,” Lafair said. “There are a lot of people who are helping us quietly organize, and we’ve been happy with the response. The Trump campaign said they continue to make inroads with disaffected Democrats and Independents, pointing to speculation that Robert F. Kennedy Jr. may drop out of the 2024 race and endorse Trump. “President Trump continues to build a historic and unified political movement to make America strong, wealthy, and safe again,” said Karoline Leavitt, Trump campaign national press secretary, in a statement to the Washington Examiner. “Comrade Kamala Harris is the most unpopular Vice President in history and our campaign will spend every day until Nov. 5 ensuring every voter understands how dangerously liberal Kamala is.” On Tuesday, GOP Mayor John Giles, of Mesa, Arizona, pleaded with fellow Republicans to “put country first” in a prime-time speech at the convention and commended the Biden-Harris administration for “reaching across the aisle” to get things done. “I’m going to ribbon cuttings every single week all because Joe Biden and Kamala Harris reached across the aisle and they delivered for my conservative community,” Giles said in a speech on Tuesday night. Giles invoked the name of the late Sen. John McCain in his speech and the Arizona senator’s famous motto of “country over party.” “John McCain’s party is gone, and we don’t owe a damn thing to what’s been left behind,” he said. Democratic delegates on the convention floor gave former White House press secretary Stephanie Grisham a standing ovation as she shared what it was like to work for the former president. “I saw him when the cameras were off, behind closed doors. Trump mocks his supporters. He calls them basement dwellers,” she said. After serving as Trump’s press secretary for nine months, Grisham was named first lady Melania Trump’s chief of staff. She said the last straw for her was the Jan. 6 insurrection when a pro-Trump mob stormed the Capitol, seeking to stop the certification of Joe Biden’s electoral win. “On Jan. 6, I asked Melania if we could at least tweet that while peaceful protest is the right of every American, there’s no place for lawlessness and violence. She replied with one word: ‘No,’” Grisham said, as a picture of the alleged text chain appeared on the jumbotron. Cross-party endorsements are not new in U.S. politics and Republicans have played prominent roles in previous Democratic conventions in the past. In 2020, former Ohio Gov. John Kasich endorsed Biden in a recorded speech. Democrats were not regularly featured at last month’s Republican convention, although Trump counts on support and advice from former Democrat Tulsi Gabbard, who once served as a congresswoman from Hawaii. Harris’s campaign is seeking to court disaffected Republicans and recently unveiled a GOP task force for the vice president across the country through outreach to current and former GOP voters in the state “who feel marginalized by the MAGA movement.” The group is working to poach an existing network of anti-Trump Republicans who have opposed the former president’s bid for a third presidential cycle. Democrats appear to understand the benefits of courting conservative and moderate voters outweigh the risks of offending their progressive flank. Rep. James Clyburn (D-SC), the former House majority whip and one of the most influential voices in Congress, praised Republicans who are at the DNC and those who are taking the stage. “I really applaud [Republicans] for doing this for the American people and letting them know what is at stake here is in fact our democracy and not Democrats or Republicans or Independents – but it’s for everybody,” Clyburn said, speaking to reporters Monday night after he took the stage. “So many Republicans in my home state, believe it or not, of South Carolina, are now speaking out.” “I think it’s good for us to give a platform to these people while they are tuning in and trying to find out who Kamala Harris is, so I think this is a good time to do that,” he said. Before Republicans took to the stage this week, Gov. Andy Beshear (D-KY) contended that Republicans and “everybody else” are welcome in the Harris campaign and “space” in a potential administration that Harris “would put together.” “So many people feel that they’ve been left out and left behind by the extremism that is Donald Trump,” Beshear told reporters Tuesday after addressing the Democratic National Committee’s Rural Council. “We can be a party that works with everyone, that believes that our job is to create a better life for every single American, not to spend our time on vengeance or retribution, but to spend time moving our country forward.” “At the end of the day, people care most about how their family is doing, how their neighbors are doing, and yes, their neighbors may be of a different party, but you still care about your neighbor and you want them to do well,” he said. When asked about prickly issues such as immigration, Beshear predicted the public will “get thoughtful answers from her, answers that are based on policy, and answers that recognize the complexity that yes, we need strong borders, and border security is national security, but we’re still talking about human beings”. “You can believe in both, and then we can get real immigration reform that they were working on until Donald Trump killed it,” he added. “So yes, she’s going to be able to talk to all voters.” For former North Dakota Sen. Heidi Heitkamp, Republican outreach cannot be patronizing. “No one likes to be told that they made a mistake when they voted, right?” Heitkamp told the Washington Examiner after the same Rural Council meeting. “What you will hear from so many people in rural America is, ‘I don’t like the guy, I don’t like how he talks to people, I don’t like how he represents, you know, himself, but I like his ideas.’ And that’s an opening to talk about what those ideas are and how our ideas are better.” The day before, Gov. Josh Shapiro (D-PA) agreed about drawing a contrast for Republicans between Harris and Trump. “I think what Pennsylvanians want to know is how is the next president going to impact their lives and Donald Trump has a history of bringing chaos into people’s lives, less jobs, less freedom,” Shapiro told reporters after addressing the Labor Council. “Kamala Harris has been on the side of the people, and I think Pennsylvanians are less concerned about where she grew up, as opposed to what direction she wants to take the country in the future, and what she’s talking about, bringing down costs, increasing job opportunities, particularly in the energy sector.” Democrats are aggressively courting rank-and-file union members who had drifted over to Trump in the 2016 election, believing he’d be a champion for the working class. While the former president led with union voters in the critical swing state of Pennsylvania 50% to 45% in July, Pennsylvania likely voters in unions are now breaking for Harris by 15 points, according to an Emerson College poll released last week. “Unions are a critical element of any kind of electoral coalition. We care deeply as Democrats about unions and the right to collectively bargain,” said Sen. Gary Peters (D-MI), speaking with reporters on Tuesday. “Kamala Harris is part of the Biden Harris administration that was, without question, the most pro-union administration we have seen in the presidency,” Peters said. In former President Barack Obama’s speech to the convention on Tuesday night, he urged Democrats to appeal to a large swath of voters, which includes outreach to Republicans and independents alike. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER “To make progress on the things we care about, the things that really affect people’s lives, we need to remember that we’ve all got our blind spots and contradictions and prejudices; and that if we want to win over those who aren’t yet ready to support our candidate, we need to listen to their concerns — and maybe learn something in the process,” Obama said. Marisa Schultz contributed to this report.","summary":"CHICAGO — Republicans are showing up on and off the stage at the Democratic National Convention to urge their peers to support Vice President Kamala Harris for president over former President Donald Trump. A mayor in a battleground state, a former Trump voter, and a former Trump White House official have already addressed the convention [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3129553/republicans-for-harris-dnc/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/IMG_2278-scaled.webp","video":null,"publish_date":"2024-08-21 23:28:50","author":"Samantha-Jo Roth","authors":["Samantha-Jo Roth"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.218},{"id":254637880,"title":"At DNC, my party is shining a hopeful spotlight on America. At RNC it was just on Trump","text":"Whether we’re talking about how a grateful nation embraced President Joe Biden as he passed the torch to Vice President Kamala Harris and a new generation of leadership or former President Barack Obama reminding us that \"the ties that bind us together\" as a nation and a people are stronger than the hateful rhetoric, conspiracy theories and divide us, in an address echoing the 2004 speech that put him in the national spotlight, one thing is clear: something special is happening in Chicago. The DNC Convention is bursting with a sense of hope and joy that is part grassroots movement, part family reunion. And the contrast with last month’s GOP convention couldn’t be clearer. On Day One of the Republican Convention, MAGA darling Rep. Marjorie Taylor Greene attacked LGBTQ Americans and immigrants, spewed misinformation and called Donald Trump a \"founding father,\" while the audience hissed and booed at any hint of diversity. Compare that to Day One of the Democratic Convention this week where Rep. Jasmine Crockett took the presidential job applications of both Trump and Harris line by line, correctly noting that, \"Kamala Harris has a resume. Donald Trump has a rap sheet.\" But Crockett didn’t stop there. DNC ATTENDEES REJECT POPULAR GOP ACCUSATION OF CONVENTION HYPOCRISY: 'APPLES AND ORANGES Crockett talked about Harris, not just as a transformational leader, but as a person, a product of the American Dream and a woman who takes the time out of her relentless schedule to listen to a freshman congresswoman’s concerns and remind her that she is exactly where God wants her to be. She talked about Harris as a beacon of hope and freedom that shines our way to the future and, most importantly, she reminded all of us how important it is for all of us to engage in this election. She asked America to vote. Greene and the Republicans never bothered to do that because, as far as they’re concerned, they don’t need to do it. Greene and the Republicans think they’re entitled to the White House. Crockett and the Democrats are working to earn it. Now, that’s just one example. But it has repeated itself over and over again this week in Chicago. CNN’S VAN JONES FAWNS OVER BARACK AND MICHELLE OBAMA'S DNC SPEECHES: LIKE 'OASIS' IN 'SPIRITUAL DESERT' While Republicans cheered Gregg Abbot, the 66-year-old governor of Texas who signed that state’s near-total abortion ban in 2021, Democrats embraced Amanda and Josh Zurawski, the young couple who were turned away from the hospital in Texas while Amanda was enduring a painful and deadly miscarriage because Abbot’s ban wouldn’t let the doctors care for her. Where Republicans had Peter Navarro, a former Trump adviser and fellow old white guy who spoke just hours after being released from federal prison, the Democrats had Ana Navarro, a former Nicaraguan refugee whose bold vision and courage exemplifies a new generation of Democratic leadership. She’s never been in prison, by the way. FLASHBACK: OBAMA WAS ONE OF EARLIEST BIG-NAME DEMS TO ENDORSE WALZ AT DAWN OF HIS POLITICAL CAREER Watching the Republican convention, you saw Reps. Nancy Mace and Matt Gaetz, Gov. Sarah Huckabee Sanders and former House Speaker Newt Gingrich. Watch the Democratic Convention and you see Sens. Bernie Sanders and Chuck Schumer, sure, but you also see DNC Chair Jaime Harrison and Convention Committee Chair Minyon Moore, the historic team that put the DNC convention together. You see Rep. Alexandria Ocasio-Cortez, Sen. Raphael G. Warnock, New Mexico Gov. Michelle Lujan Grisham, Angela Alsobrooks and more. We’ve seen labor leaders like AFL-CIO President Elizabeth H. Shuler and UAW President Shawn Fain speaking at the Democratic convention. We see trailblazers like Reps. Maxine Waters and Jim Clyburn. We even see former Trump supporters like Rich Logis and former Georgia Lt. Gov. Geoff Duncan. CLICK HERE FOR MORE FOX NEWS OPINION Now, the conspiracy theorists and naysayers will try to dismiss this as nothing but a speaker lineup. But it’s more than that. A lot more. You see, when I watched the Republican Convention, I couldn’t see myself on stage or in the audience because people like me are not who MAGA and Trump’s Project 2025 are built for. But we’re welcome at the Democratic Convention because the Democrats know that diversity is what makes us strong. That’s where the hope and joy come from. That’s the vibe that’s different. So, when you turn on the TV to see what’s going on in Chicago or tune in to the speeches from Gov. Tim Walz and Vice President Kamala Harris, look at the stage and the audience and you’ll see America. You’ll see men and women working together for better jobs, higher wages, reproductive freedom and equal justice. You’ll see Black voters for affordable housing, Latinos for infrastructure improving education, Asian-Americans for infrastructure and even white folks for justice reform. You’ll see young voters fighting to expand student debt relief and end climate change stand hand-in-hand with senior citizens supporting Medicare, Medicaid, Social Security and President Biden’s $35 cap on the cost of insulin. You’ll see LGBTQ Americans fighting Project 2025 and straight Americans fighting right alongside them. CLICK HERE TO GET THE FOX NEWS APP At the end of the day, the Democratic Convention is shining our spotlight on America. At the Republican Convention, it was just on Donald Trump. But they did have Hulk Hogan. So, I guess there’s that. CLICK HERE TO READ MORE FROM ANTJUAN SEAWRIGHT","summary":"When you turn on the TV to see what’s going on in Chicago or tune in to the speeches from Gov. Tim Walz and VP Kamala Harris, look at the stage and the audience and you’ll see America.","url":"https://www.foxnews.com/opinion/dnc-party-shining-hopeful-spotlight-america-rnc-just-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/1200/675/Joe-Biden-Kamala-Harris-Democratic-convention-Chicago-Aug-19-2024.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-21 23:27:42","author":"Antjuan Seawright","authors":["Antjuan Seawright"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.01},{"id":254638408,"title":"Shaving democracy: MyPillow’s Mike Lindell takes drastic measure to blend in at DNC","text":"MyPillow CEO Mike Lindell, an ardent supporter of former President Donald Trump, shaved his 30-year-old mustache to go undercover at the Democratic National Convention. Lindell is one of several Republican social media influencers, also including Turning Point USA founder Charlie Kirk and Daily Wire columnist Matt Walsh, to observe the DNC. “Mike Lindell finally did it,” he posted on X. “It’s been 30 years since Mike has shaved his mustache. But in order to go undercover at the DNC and deliver FrankSpeech viewers undercover footage, he finally allowed a barber to take a razor to his iconic ‘stache.” Lindell is also known for his hard-line support for Trump’s unproven claim that he won the 2020 election and that there was significant election interference. Voting machine company Dominion sued Lindell after he promoted a theory that the company conspired with foreign powers to rig voting machines to steal the election from Trump. Democratic content creator Knowa spotted Lindell. Lindell was seen arguing with Knowa about recent Georgia voting news. He was heard saying, “They found 257,000 votes in Georgia that are missing from the 2020 election,” repeating claims of 2020 election fraud. Walsh and Kirk have been spotted around the DNC floor as well. Walsh is taking a similar path to Lindell, disguising himself with a “Kamala Harris for President” hat and “White Dudes for Harris” shirt, while changing up his hair and glasses. His disguise appears to be a part of his upcoming movie Am I Racist? Some commenters were displeased with his appearance at the convention, one calling him “weird,” a common Democratic attack on Republicans after Vice President Kamala Harris took the mantle as the party’s nominee. Kirk is not in disguise. He openly treaded the DNC floor and argued with Young Democrats of Georgia President Parker Short, who appeared upset at Kirk’s appearance there. The DNC is continuing for its third day Wednesday, and Harris will accept the Democratic nomination Thursday, the last day of the convention.","summary":"MyPillow CEO Mike Lindell, an ardent supporter of former President Donald Trump, shaved his 30-year-old mustache to go undercover at the Democratic National Convention. Lindell is one of several Republican social media influencers, also including Turning Point USA founder Charlie Kirk and Daily Wire columnist Matt Walsh, to observe the DNC. &#8220;Mike Lindell finally did [&#8230;]","url":"https://www.washingtonexaminer.com/news/3130252/mike-lindell-drastic-measure-blend-in-at-dnc/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Lindell-DNC.webp","video":null,"publish_date":"2024-08-21 23:23:50","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","source_country":"US","sentiment":-0.56},{"id":254637576,"title":"The Obamas Showed Democrats It's Time to Reach Out | Opinion","text":"To borrow an Obama-ism, let me be clear. They planned this.Barack and Michelle Obama's electrically brilliant speeches to the Democratic convention Tuesday night were a coordinated jab–cross that perfectly met Democrats' needs and – if the party is paying close enough attention – laid the groundwork for the strategic transition that Kamala Harris absolutely must pull off in order to win.They ended the first phase of the Harris campaign and launched the second.Former President Barack Obama greets former first lady Michelle Obama as he arrives to speak on stage during the second day of the Democratic National Convention at the United Center on Aug. 20.Andrew Harnik/Getty ImagesMichelle was the star of the night among giddy Democrats for her eloquent mix of rhetorical flourishes, pointed critiques of former president Donald Trump's silver spoon privilege and golden parachute business life (\"most of us will never be afforded the grace of failing forward\"), and gruesome knife twists, including the night's most excruciatingly dank line: \"who's going to tell [Trump] that the job he's currently seeking might just be one of those Black jobs.\"The result was a full on face-slap to the man who Democrats see as the spawn of Satan – and they were predictably rapturous. And why such a whiplash-inducing departure from her 2016 \"when they go low we go high\" mantra? Because that's what her party needed. Michelle's mission was to complete the great Democratic consolidation of 2024.When President Joe Biden dropped out exactly one month ago, polling averages showed Trump leading Harris 45.6% to 41.0%. As of Tuesday night, Trump had dropped by about one percentage point. Harris had risen six. So clearly, Harris' growing support is mostly not coming from persuading Trump voters. Rather, it's coming almost entirely at the expense of third-party candidate Robert F Kennedy, Jr. who has fallen four points in that time. In other words, it's coming from consolidation: Harris has been clawing back Democratic-leaning voters who were previously drifting away from Biden.Reclaiming the vast majority of your base—in 4 weeks, during August when voters are paying less attention, and with limited paid communications—is a minor miracle. And it was enough to give Harris the slightest of edges in election forecast models and betting markets.The problem is that consolidation only takes you so far. In key swing states like Pennsylvania, Wisconsin, North Carolina, and Georgia, there's not much more that Harris can eke out of bringing wayward Democrats home. Kennedy's support has already fallen to 4% or below. That's about what Gary Johnson and Jill Stein got combined in 2016, the last time big name third party candidates were on the ballot. There's probably not that much further for Kennedy to fall. The other problem is that RFK is now openly mulling dropping out and throwing his support to Trump, which caused betting markets to swing back in Trump's favor yesterday.Firing up your base is critical—and Michelle gave it the greatest energy injection that anyone could muster—but it only gets Democrats halfway there, no better than a 50-50 shot.Enter Barack Obama.The former president was perfectly aware that not only was he following a supremely talented orator (\"I am the only person stupid enough to speak after Michelle Obama\") but also that he had a harder job than his spouse. Because his mission last night was to begin the transition away from base motivation—i.e., firing up the folks who deep down probably wanted to be with Harris—to persuading swing voters. These are voters who pollsters have shown to be highly disengaged, badly turned off by the nastiness of today's politics, and facing the unfamiliar prospect of supporting the first Black woman for president to boot.Fortunately for Democrats, there is literally no one in history more accomplished at reassuring voters that the unfamiliar is unscary, that politics is not all anger and division, and that the Party is open-invite. That was the core of Obama's exhilarating 2004 convention keynote, and that was the theme he sounded over and over again last night: \"Together, Kamala and Tim have kept faith with America's central story: a story that says, 'We are all created equal.' All of us endowed with certain inalienable rights. That everyone deserves a chance. That even when we don't agree with each other, we can find a way to live with each other.\"Indeed, his most important message on this theme was part plea to the uncommitted, part warning to his own side: \"Our politics have become so polarized these days that all of us across the political spectrum seem so quick to assume the worst in others unless they agree with us on every single issue. We start thinking that the only way to win is to scold and shame and out-yell the other side. And after a while, regular folks just tune out, or they don't bother to vote... we need to remember that we've all got our blind spots and contradictions and prejudices. After all, if a parent or grandparent occasionally says something that makes us cringe, we don't automatically assume they're bad people. Our fellow citizens deserve the same grace we hope they'll extend to us.\"Translation to Democrats: we can't beat deplorables by being insufferables. Cancel the \"callout\" culture and keep welcoming back the white non-college-educated working voters who put Trump in the White House in the first place (Trump won them by 36 points in 2016). Translation to swing voters: we see you starting to creep back our way. So keep coming, because we will welcome you, not judge you.The normal arc of a presidential campaign has predictable stages played out on the leisurely cadence of a baseball season: candidate intros, selecting a nominee, drawing back in the supporters of the also-rans, firing up that base, and finally, pivoting to the center for the stretch run appeal swing voters.Last night, the Obamas hit the fast forward button, accomplishing every single step toward the end. The final sprint begins now.Matt Robison is a writer, podcast host, and former congressional staffer.The views in this article are the writer's own.","summary":"Barack and Michelle Obama's electrically brilliant speeches to the Democratic convention Tuesday night were a coordinated jab–cross that perfectly met Democrats' needs.","url":"https://www.newsweek.com/obamas-showed-democrats-its-time-reach-out-opinion-1942708","image":"https://d.newsweek.com/en/full/2455417/simply-dems-best.jpg","video":null,"publish_date":"2024-08-21 23:23:04","author":"Matt Robison","authors":["Matt Robison"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.359},{"id":254637876,"title":"After Obamas get personal at DNC, Trump asks 'Do I still have to stick to policy?'","text":"Former President Trump is pointing to personal attacks at the Democratic convention by former President Obama and former First Lady Michelle Obama as justification to disregard advice from allies to cut out insults and stick to policy attacks on Vice President Kamala Harris. \"Did you see Barack Hussein Obama last night? He was taking shots at your president. And so was Michelle,\" Trump told supporters at a rally in battleground North Carolina on Wednesday. Pointing to Trump, the former first lady emphasized during her address at the Democratic National Convention in Chicago that \"going small is petty, it’s unhealthy, and, quite frankly, it’s unpresidential.\" And she argued that \"it’s his same old con: doubling down on ugly, misogynistic, racist lies as a substitute for real ideas and solutions that will actually make people’s lives better.\" TRUMP SPOTLIGHTS JOBS REPORT REVISION TO TAKE AIM AT BIDEN AND HARRIS Minutes later, former President Obama called his successor in the White House \"a 78-year-old billionaire who has not stopped whining about his problems since he rode down his golden escalator nine years ago.\" \"It has been a constant stream of gripes and grievances that’s actually been getting worse now that he is afraid of losing to Kamala. There’s the childish nicknames, the crazy conspiracy theories, this weird obsession with crowd sizes,\" Obama added, as he made a hand gesture which seemed to imply he was mocking Trump’s manhood. Trump, spotlighting the verbal attacks on him from the previous night, seemed to mock advice from Republican allies. DEMOCRATIC NATIONAL CONVENTION: LIVE UPDATES \"You know, they always say, ‘Sir, please stick to policy, don’t get personal,’\" Trump said.\" And yet they’re getting personal all night long, these people.\" \"Do I still have to stick to policy?\" Trump asked his supporters in the crowd. While criticizing Harris over key issues such as border security, crime and inflation, Trump in the past four weeks has also continuously slammed the vice president and insulted her during speeches, news conferences and in social media posts. Sources in Trump's political orbit have told Fox News that top advisers to the former president are quietly aiming to persuade him to tamp down the insults to Harris and the questioning of the vice president's racial identity and instead focus on branding her an ultra-liberal. Trump allies have publicly pitched the former president to refocus his attention. \"You’ve got to make this race not on personalities,\" former House Speaker Kevin McCarthy said last week in an interview on Fox News' \"America's Newsroom.\" \"Stop questioning the size of her crowds and start questioning her position.\" CLICK HERE TO GET THE FOX NEWS APP McCarthy emphasized that Trump has \"a short time frame to do it, so don’t sit back. Get out there and start making the case.\" During an interview last week with Bret Baier on Fox News' \"Special Report,\" former U.N. ambassador and former South Carolina Gov. Nikki Haley — Trump's top rival from the Republican presidential primaries earlier this year — also had some unsolicited advice for her former boss. Haley, who reiterated that she wants Trump to win the presidential election, emphasized that \"the campaign is not going to win talking about crowd sizes. It's not going to win talking about what race Kamala Harris is. It's not going to win talking about whether she's dumb. It's not. You can't win on those things. The American people are smart. Treat them like they're smart.\" Trump, at his rally on Wednesday, imitated allies who have urged him to avoid personal insults. \"Sir, you must stick to policy. You’ll win it on the border. You’ll win it with inflation. You’ll win it with your great military that you built,\" Trump said. And minutes later, Trump surveyed his supporters in the crowd, asking \"should I get personal, or should I not get personal?\" Getting personal won by a very clear margin. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Trump points to personal attacks by the Obamas as justification to disregard advice from allies to cut out insults and stick to policy attacks on Vice President Kamala Harris.","url":"https://www.foxnews.com/politics/after-incoming-fire-from-obamas-trump-asks-do-i-still-have-stick-policy","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Donald-Trump-Asheboro-NC-August-21-2024-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-21 23:20:31","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.029},{"id":254638746,"title":"Democrats Are Building Their Blue Wall on More Than Just Good Vibes: “We Can’t F--k Around”","text":"“We can’t fuck around,” Michigan representative Haley Stevens told me. “And we haven’t been fucking around.” Just a month ago, the party seemed in danger of losing the key Midwest swing states on which the 2024 election will hinge: Biden was already lagging behind Trump in polls, and went into a tailspin after a disastrous debate performance in June. Before he dropped his candidacy, polls had him trailing Trump in five battleground states—including the blue-wall states of Michigan, Wisconsin, and Pennsylvania. But the rise of Vice President Kamala Harris seems to have reversed Democrats’ fortunes: She herself has rebounded in the polls—even looking like the frontrunner in some—and revitalized the party in the swing states where it was once in peril, as my colleague Chris Smith reported recently. Now, she and the Democrats have new momentum—and they want to keep it going well-beyond the Democratic National Convention. “I’m just excited,” said Ohio representative Shontel Brown. While the party will “have to work twice as hard, twice as fast” in this abbreviated campaign, she said, Democrats will “take the bump” from the convention: “I would caution everyone to look out where they’re stepping because the glass ceiling is being shattered everywhere.” Harris’s historic candidacy is a big part of that energy, of course. But some of it seems to be rooted in a shift in party positioning—from democracy’s doomsayers to “happy warriors”—which has been reinforced by running mate Tim Walz, the governor of Minnesota. “They may have crappy sports teams in Minnesota,” Wisconsin representative Mark Pocan told me on the concourse of the United Center, referring to the rivalry between the neighboring states’ football teams. Still, he added, the two have “similar values.” And Democrats have a “very clear lane” to do that, Michigan state senator Mallory McMorrow told me: Trump and JD Vance tap into real economic fears and disillusionment, said the Democrat, but offer only culture-war bile in lieu of real solutions. Harris, she said, is putting forth a program that will actually improve Americans’ lives; the task before Democrats right now is to sell them on it. “We can have a lot of fun while we do important work,” McMorrow told me, noting Democratic successes in Michigan under Governor Gretchen Whitmer and the narrowly-held Democratic majorities in both state chambers. McMorrow, a rising star in the party, got a prominent billing in the DNC programming—appearing onstage in an early slot Monday to deliver some of the party’s opening arguments against Project 2025, the MAGA-governing blueprint Trump could rely on if he returns to power in November. “It was a lot to take in,” McMorrow told me. But her role was “an acknowledgment [by the Harris campaign] of how important Michigan is.”","summary":"At the 2024 Democratic National Convention, lawmakers emphasized the kitchen-table issues that resonate particularly in the Midwest, which is poised to make or break Kamala Harris’s election prospects.","url":"https://www.vanityfair.com/news/story/dnc-democrats-blue-wall","image":"https://media.vanityfair.com/photos/66c67582be7d9a8109517dc1/16:9/w_6000,h_3375,c_limit/2167645851","video":null,"publish_date":"2024-08-21 23:19:53","author":"Eric Lutz","authors":["Eric Lutz"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.355},{"id":254638186,"title":"Walz leans into military service at DNC as veterans rebuff ‘stolen valor’ attacks","text":"CHICAGO — Accusations that Gov. Tim Walz (D-MN) is guilty of “stolen valor” are falling flat to the group of people attending the Democratic National Convention who are closest to the situation: veterans.Multiple military veterans expressed discontentment while speaking to the Washington Examiner about the attacks against Walz’s military service, calling accusations that the Minnesota governor is stealing valor a “nonstarter” and a “made-up political junky term,” among other things.Walz is expected to lean into his military service at his vice presidential acceptance speech Wednesday night. Walz’s military service has been under a microscope since he was tapped to be Vice President Kamala Harris’s running mate. Criticism about his service includes what rank Walz held when he retired, as Walz and his allies have inaccurately claimed he retired as a command sergeant major. In a video set to introduce Walz Wednesday that is narrated by his wife, Gwen, she recounts Walz’s military service, saying he “served 24 years in in the National Guard, rising to command sergeant major.”Walz held the rank of command sergeant major before retiring; however, he did not complete the necessary requirements needed for the position and was reverted back to master sergeant for benefits purposes upon his departure. Harris’s campaign website once described Walz as a “retired command sergeant major” but has since been updated.Walz’s Republican rival, Sen. J.D. Vance (R-OH), has accused the Democratic vice presidential nominee of lying about his military record and abandoning his unit before it was deployed to Iraq when he retired to run for Congress.“Kamala Harris, she gets really mad when I bring up the stolen valor of her running mate, but let me tell you why it matters; every single person here understands why this matters,” Vance said during a campaign stop recently. “Here’s the record on Tim Walz, the governor of Minnesota; he dropped out of the military and allowed his unit to go to Iraq without him. He knew they were going to Iraq, he lied about it, but he knew they were going to Iraq.”Vance continued, “What won’t ‘stolen valor’ Tim Walz fib about?” Retired National Guard Maj. Gen. Randy Manner, who oversaw overseas deployments for the National Guard, called the attacks against Walz just “political crap” with “no facts behind it.”Retired Marine Sgt. Maj. John Estrada expressed disappointment in Vance for attacking Walz’s military record, explaining that “less than 1% of Americans serve.” Estrada continued, “And we go wherever our nation wants us at that time, and he went wherever our nation sent him. He did support our operation, enduring freedom. l am disappointed that J.D. Vance would come after Gov. Walz like he did. I do not feel that he should have.”Walz served 24 years in the Army National Guard before retiring in 2005 just months before his unit got the official order it would be deploying to Iraq. Republicans have accused him of abandoning his unit, and a few members of his unit have publicly expressed resentment that Walz retired when he did.Walz also came under fire for a comment he made in a video from 2018 circulating on social media in which he spoke out against gun violence, saying, “We can make sure that those weapons of war, that I carried in war, is the only place where those weapons are at.”Critics say the comment implies Walz served in an active war zone; however, the Minnesota governor was never deployed to a combat zone during his military career. He did deploy to Italy in 2003 to support active military forces in Iraq and Afghanistan. Vance jabbed at Walz for the comment during a campaign stop earlier this month.“I wonder, Tim Walz, when were you ever in war?” Vance said. “What was this weapon that you carried into war given that you abandoned your unit right before they went to Iraq.”A spokesperson for Harris’s campaign said in a statement earlier this month that Walz “misspoke” in the video.Army Reserve Maj. Michael Bell, who also served 15 years in the Army National Guard, said Walz’s comment was a “misquote” and that he “made a mistake.”“We all do it,” said Bell. “I don’t think that’s stolen valor. Plenty of other people make similar comments about their service. No one is going to yell at them or argue with them or accuse them of stolen valor, of trying to take something away from other veterans. They both served. They’re both veterans and I thank them both for their service, but J.D. Vance is wrong in this.”Retired Navy Rear Adm. Mike Smith called Vance’s attacks against Walz “absolutely disgraceful.” “I think that if anything, we should be honoring Tim Walz. We’ve been through this whole thing,” Smith said, referring to criticism John Kerry weathered during his presidential campaign known as “swift boating.”Sen. Mark Kelly (D-AZ), who was one of the Democratic lawmakers on Harris’s short list to be her running mate, called claims that Walz was guilty of stolen valor “ridiculous” while speaking with reporters outside the DNC’s Veterans and Military Families Council meeting Tuesday. “I spent 25 years in the United States Navy, I retired at 25 years. Gov. Walz retired from the Army at 24 years, when you serve over 20 years in the military, you’ve earned over a career the opportunity to retire,” Kelly said. Kelly continued, “The contrast could not be more clear between patriots and veterans like Tim Walz and Donald Trump, who has a total and complete disregard for our veterans and our service members.” CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Congressional military veterans have been divided over the issue, with 50 Republican lawmakers condemning Walz for committing “egregious misrepresentations” of his military record in a letter sent to the Minnesota governor on Wednesday. The letter, which was sent on a Trump-Vance letterhead, followed a previous statement signed by 18 Democratic lawmakers defending Walz and his service.","summary":"CHICAGO – Accusations that Gov. Tim Walz (D-MN) is guilty of “stolen valor” are falling flat to the group of people attending the Democratic National Convention who are closest to the situation: veterans. Multiple military veterans expressed discontentment while speaking to the Washington Examiner about the attacks against Walz’s military service, calling accusations that the [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3129873/veterans-dnc-rebuff-stolen-valor-attacks-against-walz/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Tim_Walz_Pennsylvania_2024_1.webp","video":null,"publish_date":"2024-08-21 23:18:40","author":"Hailey Bullis","authors":["Hailey Bullis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.115},{"id":254638004,"title":"Here's the schedule for the DNC's third night in Chicago featuring Walz, Clinton and Amanda Gorman","text":"CHICAGO (AP) — Democratic National Convention organizers have released the schedule for the event’s third day. Headliners include Minnesota Gov. Tim Walz, Vice President Kamala Harris’ running mate, and former President Bill Clinton. Other speakers include former House Speaker Nancy Pelosi, poet Amanda Gorman and the parents of an Israeli American taken hostage by Hamas. Musicians John Legend, Stevie Wonder and Maren Morris will perform. Here’s a look at the entire schedule. All times are Central. After 5:30 p.m. Mini Timmaraju, president and CEO of Reproductive Freedom for All; Planned Parenthood Action Fund President and CEO Alexis McGill Johnson; longtime abortion-rights advocate Cecile Richards; Kelley Robinson, president of the Human Rights Campaign; Jessica Mackler, president of EMILYs List; María Teresa Kumar, founding president and CEO of Voto Latino; and Rep. Tom Suozzi, D-N.Y. After 6 p.m. Sen. Cory Booker, D-N.J.; Mayors Aftab Pureval of Cincinnati and Cavalier Johnson of Milwaukee; lead pipe removal advocates Rashawn Spivey and Deanna Branch; Rep. Lisa Blunt Rochester, D-Del.; Rep. Grace Meng, D-N.Y.; Colorado Gov. Jared Polis; Rep. Debbie Wasserman Schultz, D-Fla.; Rep. Suzan DelBene, D-Wash.; Minnesota Attorney General Keith Ellison; Michigan Attorney General Dana Nessel; Jon Polin and Rachel Goldberg, parents of Hersh Goldberg-Polin, an Israeli American who was abducted by Hamas on Oct. 7; a performance from singer Maren Morris. After 7 p.m. Rep. Veronica Escobar, D-Texas; Sen. Chris Murphy, D-Conn.; Bexar County, Texas, Sheriff Javier Salazar; Rep. Pete Aguilar, D-Calif.; content creator Carlos Eduardo Espina; former Trump administration official Olivia Troye; former Georgia Lt. Gov. Geoff Duncan, a Republican; Rep. Bennie Thompson, D-Miss.; retired U.S. Capitol Police Sgt. Aquilino Gonell; Rep. Andy Kim, D-N.J.; content creator Olivia Julianna; a performance from singer Stevie Wonder; comedian Kenan Thompson and other guests on “Project 2025.” After 8 p.m. Host Mindy Kaling; House Democratic leader Hakeem Jeffries of New York; former President Bill Clinton; former House Speaker Nancy Pelosi of California; Pennsylvania Gov. Josh Shapiro; Alexander Hudlin, Jasper Emhoff and Arden Emhoff; Sen. Catherine Cortez Masto, D-Nev. After 9 p.m. Poet Amanda Gorman; Maryland Gov. Wes Moore; Transportation Secretary Pete Buttigieg; a performance from singers John Legend and Sheila E.; Sen. Amy Klobuchar, D-Minn.; Benjamin C. Ingman, a former student of Minnesota Gov. Tim Walz; Walz.","summary":"CHICAGO (AP) — Democratic National Convention organizers have released the schedule for the event's third day.","url":"https://www.thestar.com/news/world/united-states/heres-the-schedule-for-the-dncs-third-night-in-chicago-featuring-walz-clinton-and-amanda/article_c301124a-ce50-5178-9871-b7f96b58be22.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/3/1c/31c52305-6478-5c76-87de-e5fd7ebbb2e5/66c676211ec31.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2024-08-21 23:15:35","author":"The Associated Press,Wire Content","authors":["The Associated Press","Wire Content"],"language":"en","source_country":"CA","sentiment":0.076},{"id":254637484,"title":"Former Trump Campaign Advisor Reacts to DNC: ‘Not One Tough Question’ for Kamala Harris","text":"Views 1 • Aug-21-2024 A former campaign advisor to Former President Donald Trump tells The Epoch Times’ Jan Jekielek, “The Harris campaign has had the best 30 days in modern presidential history. No one’s laid a glove on her, not one tough question.” David Urban says the polls are looking good for Trump compared to 201...","summary":"A former campaign advisor to Former President Donald Trump tells The Epoch Times’ Jan Jekielek, “The Harris campaign has had the best 30 days in modern presidential history. No one&#8217;s laid a glove on her, not one tough question.” David Urban says the polls are looking good for Trump compared to 2016 and 2020, and [&#8230;]","url":"https://www.theepochtimes.com/epochtv/former-trump-campaign-advisor-reacts-to-dnc-not-one-tough-question-for-kamala-harris-5710402","image":"https://img.theepochtimes.com/assets/uploads/2024/08/21/id5710413-DNC-0821-David-Urban-EET.jpg","video":null,"publish_date":"2024-08-21 23:14:59","author":"Jan Jekielek","authors":["Jan Jekielek"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.037},{"id":254637890,"title":"Here's the schedule for the DNC's third night in Chicago featuring Walz, Clinton and Amanda Gorman","text":"Democratic National Convention organizers have released the schedule for the event's third day. Headliners include Minnesota Gov. Tim Walz, Vice President Kamala Harris' running mate, and former President Bill Clinton. Other speakers include former House Speaker Nancy Pelosi, poet Amanda Gorman and the parents of an Israeli American taken hostage by Hamas. Musicians John Legend, Stevie Wonder and Maren Morris will perform. Here's a look at the entire schedule. All times are Central. After 5:30 p.m. Mini Timmaraju, president and CEO of Reproductive Freedom for All; Planned Parenthood Action Fund President and CEO Alexis McGill Johnson; longtime abortion-rights advocate Cecile Richards; Kelley Robinson, president of the Human Rights Campaign; Jessica Mackler, president of EMILYs List; María Teresa Kumar, founding president and CEO of Voto Latino; and Rep. Tom Suozzi, D-N.Y. After 6 p.m. Sen. Cory Booker, D-N.J.; Mayors Aftab Pureval of Cincinnati and Cavalier Johnson of Milwaukee; lead pipe removal advocates Rashawn Spivey and Deanna Branch; Rep. Lisa Blunt Rochester, D-Del.; Rep. Grace Meng, D-N.Y.; Colorado Gov. Jared Polis; Rep. Debbie Wasserman Schultz, D-Fla.; Rep. Suzan DelBene, D-Wash.; Minnesota Attorney General Keith Ellison; Michigan Attorney General Dana Nessel; Jon Polin and Rachel Goldberg, parents of Hersh Goldberg-Polin, an Israeli American who was abducted by Hamas on Oct. 7; a performance from singer Maren Morris. After 7 p.m. Rep. Veronica Escobar, D-Texas; Sen. Chris Murphy, D-Conn.; Bexar County, Texas, Sheriff Javier Salazar; Rep. Pete Aguilar, D-Calif.; content creator Carlos Eduardo Espina; former Trump administration official Olivia Troye; former Georgia Lt. Gov. Geoff Duncan, a Republican; Rep. Bennie Thompson, D-Miss.; retired U.S. Capitol Police Sgt. Aquilino Gonell; Rep. Andy Kim, D-N.J.; content creator Olivia Julianna; a performance from singer Stevie Wonder; comedian Kenan Thompson and other guests on “Project 2025.” After 8 p.m. Host Mindy Kaling; House Democratic leader Hakeem Jeffries of New York; former President Bill Clinton; former House Speaker Nancy Pelosi of California; Pennsylvania Gov. Josh Shapiro; Alexander Hudlin, Jasper Emhoff and Arden Emhoff; Sen. Catherine Cortez Masto, D-Nev. After 9 p.m. Poet Amanda Gorman; Maryland Gov. Wes Moore; Transportation Secretary Pete Buttigieg; a performance from singers John Legend and Sheila E.; Sen. Amy Klobuchar, D-Minn.; Benjamin C. Ingman, a former student of Minnesota Gov. Tim Walz; Walz.","summary":"Democratic National Convention organizers have released the schedule for the event’s third day","url":"https://www.independent.co.uk/news/tim-walz-ap-bill-clinton-nancy-pelosi-amanda-gorman-b2599905.html","image":"https://static.independent.co.uk/2024/08/22/00/Election_2024_DNC_15818.jpg?width=1200","video":null,"publish_date":"2024-08-21 23:14:32","author":"Via AP news wire","authors":["Via AP news wire"],"language":"en","source_country":"gb","sentiment":0.08},{"id":254637244,"title":"The DJ Behind the Dem’s Role Call Dance Party","text":"It’s usually the part of TV convention coverage when even the most zealous political junkies head to the refrigerator for a snack break. The roll call, when each state calls out the number of its delegates voting for a particular candidate — is largely a pro forma, ceremonial procedure, a bit like the Price Waterhouse segment at the Oscars, only maybe even a bit more boring. Not this time. At the DNC last night, the Dems turned their roll call into a raucous, jubilant dance party, with record-spinning virtuoso DJ Cassidy laying down special tracks for each state. Arkansas got Fleetwood Mac’s “Don’t Stop,” California got a sampling of Dr. Dre, Tupac Shakur, and Kendrick Lamar, Montana got Lenny Kravitz’s cover of “American Woman.” And so on, lasting a bit over 75 euphoric minutes. “I got a call from Ricky Kirshner, the producer of the DNC, and he said, ‘How would you like to be the first musical maestro of a convention roll call?’” DJ Cassidy — whose real name is Cassidy Podell — explains how he ended up with the gig. “To be honest, I wasn’t entirely sure what that was.” Podell is hardly a newcomer to political events. He helped program the music for the Democrat’s 2012 convention and Joe Biden’s 2021 inaugural and had DJ’d at the White House for Barack Obama’s 50th birthday. Less political but equally zeitgeist-shaking, he DJ’d at Jay-Z and Beyonce’s wedding in 2008. But nothing the boater-hat-wearing 43-year-old DJ has accomplished in the past — including his popular BET show, Pass the Mic (which he’s also turned into live show at Planet Hollywood in Las Vegas) — has ever popped quite as loud as his DNC gig Tuesday night. The roll call was broadcast with hardly any pundit interruptions on CNN and MSNBC (who knows about Fox) and was featured prominently in cable news’ day-after highlight reels of the convention, all the more remarkable considering that reel also contained rafter-raising speeches by both Obama and his wife, Michelle. Even former RNC chairman and current MSNBC talking head Michael Steele — who turns out to have been a DJ himself in his college days — couldn’t help but gush about Podell’s skills when the DJ appeared for a quickie interview on Jen Psaki’s show right after the convention. “Just the artistry of it,” Steele rhapsodized. “This brother did work to put this together…. Props all around.” “I really didn’t expect this to be so big,” Podell says. “But afterwards, I stayed up all night reading tweets and Facebook comments. So many people were writing about how they were brought to tears by the music. It wasn’t just music of hype; it was music of emotion. I strive for that, but I never thought this would strike such an emotional chord.” Pulling together the set was something of a superhuman effort, especially since he only had about three weeks to work on it — he’d been approached by Kirshner right after Biden stepped down and Kamala Harris took his place as candidate. Also, Podell, who normally works alone, had a ton of collaborators on this playlist, not just the DNC producers but each and every state and territory involved in the roll call. They all wanted a say in what song represented their homes. “Some were pretty easy,” Podell says. “Like ‘Empire State of Mind,’ right? But some states were more interesting. The initial batch of suggestions I sent to Florida, for instance — Pittbutt, DJ Khaled, Flo Rida — were not what we went with in the end. We went with Tom Petty’s ‘I Won’t Back Down,’ which turned out to be something of a state anthem that I wasn’t aware of. But I was happy to pivot because the title of that song says it all.” What Podell did at the United Center in Chicago will likely alter American presidential politics forever. “You have changed the way conventions will do this in the future,” Steele assured him. But when you think about it, last night’s dance party could have implications here in Hollywood, as well. One can’t help but wonder if perhaps certain high-ranking officials at the Academy of Motion Picture Arts and Sciences might want to give a certain DJ a call. Perhaps to discuss that Price Waterhouse segment. And if they did, what might Podell tell them? “I would suggest we have a private conversation,” he says. “Maybe the morning after the next Oscars.”","summary":"It’s usually the part of TV convention coverage when even the most zealous political junkies head to the refrigerator for a snack break. The roll call, when each state calls out the number of its delegates voting for a particular candidate — is largely a pro forma, ceremonial procedure, a bit like the Price Waterhouse [&#8230;]","url":"https://www.hollywoodreporter.com/news/politics-news/dj-dnc-roll-call-dance-party-1235980930/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/08/DJ_Cassidy.jpg","video":null,"publish_date":"2024-08-21 23:13:10","author":"Benjamin Svetkey","authors":["Benjamin Svetkey"],"language":"en","source_country":"US","sentiment":-0.142},{"id":254638768,"title":"“People Will Literally Die.” America’s Youngest Congressman Sounds the Alarm.","text":"Rep. Maxwell Frost is the youngest US congressman—and every headline and article about him (including ours!) never fails to mention it. Hailed as the first and only (for now) Gen Z Representative, Frost rose from the ranks of activism as the national organizing director for March for Our Lives to Congress, when he was elected to represent central Florida nearly two years ago. He instantly aligned with several big progressive causes, especially ending gun violence, and joined the Congressional Progressive Caucus. He also became an outspoken defender of and campaigner for President Joe Biden. That’s come at a cost. More recently, critics singled him out for having betrayed his activist roots, accusing him of not being outspoken enough about the war in Gaza. Having just won his primary this week, Frost is facing reelection in November and I had the chance to catch up with him in one of the DNC’s fancy “creator” spaces on the sidelines of the Democratic National Convention in Chicago. During our sit-down interview, we talked about what he’s learned in his short time in Congress (it’s dysfunctional!), how to navigate big, contentious issues (it’s hard!), and what he wants to see from the Harris campaign in terms of policy (he’s very excited about housing! Not surprising when you recall his apartment-hunting headaches when he arrived in DC.) Watch the video, and below there’s a lightly edited transcript of the conversation. Okay, so what have you learned? What has been most surprising for you as a Congressman? And, I wanna know how you’ve changed. Honestly, what’s been really surprising for me, is we know there’s so much dysfunction in Congress. And oftentimes, we just blame the people there for that dysfunction, so I’m gonna give them 60 percent of the blame. Forty percent, or a good chunk, actually has to do with the institution itself. I’ll give you a very small example. Orientation, when the new members first get to know each other, before we start arguing, we’re just all humans, new people to Congress. You don’t really get a lot of time to spend time with the other side of the aisle. The only time I’m with the Republicans is during the classes, and what are you supposed to do in class? Listen. The last half of the day, the social aspect, is all separated by party. So it makes sense why there’s so much dysfunction here. Here at the DNC, we are looking forward. We have about 75, or so, days until the election. What is it that you wanna see? What kind of policies? What do you want the Harris campaign to bring forward? I’m really excited about the housing platform that Vice President Harris has put forth. Honestly, it’s one of the first times, I think, the Democratic party has put together a housing platform that’s really exciting. What else? I’m excited to see the Vice President continue to talk about her plans around preventing the climate crisis. Obviously, the Biden-Harris administration made history and dedicated the most resources and money towards defeating the climate crisis. Not in the history of our country, but the history of the world. The Vice President has been very vocal on gun control—an issue that’s very near and dear to you and your work. What are you hoping to see around that? And what role would you play? I’m proud that the first bill I introduced in Congress was to create a federal office of gun violence prevention. The President took that legislation with Senator Chris Murphy (D-Conn.) and used it as the foundation for an executive order. And he created the White House Office of Violence Prevention. Who’s its leader? Vice President Kamala Harris. So, I’m excited to see her expand that office, and what I wanna see is for us to put more money toward CVI, Community Violence Intervention. These are programs, community-based, that work at identifying people most likely to be shot, and the people most likely to shoot someone. And then, they intervene at the community level. We had this program in Orlando, and gun violence has gone down in the blocks it’s operating in. And how did we get the program started? Federal money. First from the American Rescue Plan, and then from the Bipartisan Safer Communities Act. So, let’s get a personal question in here. How do you grow as a politician and a leader with all of the complex issues here that we face in this country. Yeah, there’s so much to learn. I have 10 meetings in a day about completely different subjects. I’m gonna be honest, number one, it’s a team effort. I have a great staff that really helps educate me. There’s a lot of resources that are available to us. There’s actually something called the Congressional Research Service. I can go to my staff and say, “I want an in-depth briefing on the situation in the Congo.” And they will get our government experts to come in and give me an in-depth briefing. That information, is always the basis for me to do more research, and speak to other outside groups, as well. So we have a lot of resources we can take advantage of to educate ourselves. We’re not gonna be experts on every issue. But we should definitely try our best to educate ourselves on every issue. That way we can legislate in a better way. We have so many issues like, why is this important? What makes it more important than something else? And it all leads us to, why is this election important? This election is important because if we elect Donald Trump again, it’s not a pause in progress, it’s a rollback. And there are communities that won’t survive. That word “survival” means something different for everyone. More people will die of gun violence. He wants mass deportations of certain communities. Nothing will be done about the climate crisis. People will literally die. We’re experiencing extreme heat right now that’s killing more people than ever before. So, lives are at stake. And from the gun violence movement, my work, and my organizing has always been about saving lives. So, we gotta make sure we don’t let that guy anywhere near the White House. Kamala Harris is gonna save lives. Congressman Frost, thank you so much for your time. Appreciate it man.","summary":"Rep. Maxwell Frost is the youngest US congressman—and every headline and article about him (including ours!) never fails to mention it. Hailed as the first and only (for now) Gen Z Representative, Frost rose from the ranks of activism as the national organizing director&#160;for March for Our Lives to Congress, when he was elected to [&#8230;]","url":"https://www.motherjones.com/politics/2024/08/trump-kamala-maxwell-frost-guns-climate-interview-video/","image":"https://www.motherjones.com/wp-content/uploads/2024/08/20240821-dnc-garrison-maxfrost-video-project-2025_2000_B.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2024-08-21 23:13:09","author":"Garrison Hayes","authors":["Garrison Hayes"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.078},{"id":254637854,"title":"Democratic convention second-night ratings far surpass Trump’s RNC following speeches from Obamas","text":"Viewership of the Democratic National Convention spiked on its second night and peaked at an average of 20.6 million viewers, up from 20 million on Monday, according to Nielsen. As with Monday, the measurements were taken from 12 TV networks: ABC, CBS, NBC, Scripps News, CNN, CNNe, FOX Business, FOX News Channel, MSNBC, Newsmax, NewsNation and PBS. Tuesday’s convention featured speeches from Barack and Michelle Obama. During the former president’s address, according to Nielsen, viewership jumped above the night’s average, to reach 21.6 million. The first night of the DNC averaged 20 million viewers across 13 networks, and surpassing the audience for the first three days of the Republican National Convention (RNC) last month in Milwaukee, Wisconsin. The first three days of the RNC reached 18.1 million, 14.8 million and 18 million viewers, respectively, according to Nielsen. Donald Trump headlined the final night of the convention, which averaged 25.4 million viewers and peaked with 28.4 million. According to Michael Mulvihill, TV analyst and president of insights and analytics at FOX Sports, FOX Entertainment, and Tubi, the DNC also had significantly more viewers percentage-wise. DNC had 11.9 percent of sampled households watching in 44 major metro areas across seven networks on Tuesday, compared with the RNC’s 7.7 percent rating, a difference of over 50 percent, Mulvihill posted on X. He pointed out that on night one, the DNC beat the RNC by 21 percent in the overnight figures, then 10 percent in the full nationals. “Expect some narrowing of this gap when the whole country is in,” Mulvihill wrote. Wednesday night’s schedule in Chicago will include speeches from former president Bill Clinton and former House Speaker Nancy Pelosi. The headliner is Minnesota Governor Tim Walz, who will officially accept the Democratic nomination for vice president. Award-winning musicians Stevie Wonder and John Legend are among the performers. The fourth and final night of the DNC will see Kamala Harris take the stage, accept the party’s nomination for president and officially close the convention.","summary":"During former president Barack Obama’s speech on Tuesday, viewership jumped above the night’s average, to reach 21.6 million","url":"https://www.independent.co.uk/news/world/americas/us-politics/dnc-ratings-night-two-rnc-trump-b2599876.html","image":"https://static.independent.co.uk/2024/08/21/18/SEI218078832.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/sltzmnoN-4VHSaSK0.mp4","publish_date":"2024-08-21 23:08:30","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.094},{"id":254637526,"title":"At the DNC, Orange County’s delegates find an energetic, but emotional, environment","text":"It’s been a medley of emotions — and hip-hop music — for local delegates at the Democratic National Convention in Chicago this week. The convention is part formality, the opportunity for Democrats to officially nominate Vice President Kamala Harris to lead their party’s presidential ticket, and part political theater, where heavyweight elected officials and activists and past presidents give rousing speeches to drum up optimism for the future of the party. But the historic nature of the convention, solidifying Harris as the first woman of color nominated for the presidency and putting her on the potential path to becoming the first female president, has elicited many emotions for delegates gathered in Chicago’s United Center. That includes Ada Briceño, chair of the Orange County Democratic Party who is attending her first in-person convention. (The 2020 DNC, where Harris was tapped to join President Joe Biden on the winning ticket, was held virtually due to the COVID-19 pandemic.) “It’s been so exciting to be on the floor, to see the roll call,” said Briceño, who managed to get to the convention hall early enough for Tuesday’s events (featuring former President Barack Obama and first lady Michelle Obama) to snag a seat in the fourth row. While Harris was officially selected to lead the Democratic Party’s ticket in an online vote a couple weeks before the convention, the roughly 4,700 delegates gathered in Chicago participated in what’s been dubbed a “celebratory roll call” Tuesday. And it was a party: California’s delegation, led by Gov. Gavin Newsom, was accompanied by music from Dr. Dre, Tupac Shakur and Kendrick Lamar. A crowd favorite was rapper Lil Jon, who performed a live version of “Turn Down for What,” which just happens to be Huntington Beach Councilmember Dan Kalmick’s young son’s current favorite song. “Lil Jon was not on my bingo card,” said Kalmick, who is part of California’s delegation. “I was able to get a good video of (Lil Jon) for him.” Amidst the party-like atmosphere — Orange County delegates have described the vibe as “electric” and “energetic” — Briceño can’t help but think of her upbringing in Nicaragua before her family fled to the U.S. when she was just 7 years old. “I just really think that the experience of being in this country and living every piece of how democracy moves forward is really what is making me so emotional,” Briceño said before convention festivities got underway Wednesday morning. The state roll call took a long time, Briceño said, but she “would have been standing for another four hours” if needed. “There’s so much energy, so much electricity, so much pride,” said Briceño. “I know the TV doesn’t do it justice.” Parties aside, the convention is also a chance for local Democrats to meet with statewide elected officials and their counterparts from other states. There are breakfasts every morning where the California delegation can break bread in a less formal setting with state or federal politicians and other caucuses or groups convening for attendees to dive deeper into specific topics, like labor, gun violence or disability rights. “It’s incredible just to connect with people from all over the country, from the Sun Belt to the Rust Belt,” said Assemblymember Cottie Petrie-Norris, D-Irvine, who is missing some of the final days of the legislative session to attend her first DNC. “It’s really incredible to connect and build new friendships and see old friends.” Kalmick said housing, homelessness and public safety are issues other local elected officials are also grappling with around the country, and they can collaborate and brainstorm on possible solutions. “Overall,” he said, “it’s really talking with other folks and finding out what they’re doing.” The excitement from the convention is translating to other down-ballot races this election cycle as well, said Petrie-Norris. “We have seen this huge surge in people wanting to get involved and get engaged,” she said. “So many people were sitting on the sidelines before, and particularly for young voters, they felt they didn’t really care. We’ve seen a 180-degree turn from that, and the number of folks who are suddenly energized and wanting to get involved … is just awesome.” California sent 496 delegates – and 35 alternates – to the convention in Chicago. Pledged delegates are allocated based on March’s presidential primary results. Biden, who led the party ticket at the time and was relatively unchallenged in the primary, handily won the California primary. In Orange County, 90.1% of voters who participated in the Democratic primary cast ballots for Biden. But for Briceño, the chance to be in Chicago this week means “everything” to her. “That’s exactly why I decided to be involved and give my time to politics,” Briceño said. “I believe that our voices are crucial and are everything, and I’m guided by my early experience of living in danger in my country. And so now, the fact that people have a voice here, and I get to be a small part of making sure that that continues to happen in our country through this election, is everything.” The DNC is scheduled to wrap up the festivities Thursday, Aug. 22.","summary":"The historic nature of the convention has elicited many emotions for delegates gathered in Chicago's United Center.","url":"https://www.ocregister.com/2024/08/21/at-the-dnc-orange-countys-delegates-find-an-energetic-but-emotional-environment/","image":"https://www.ocregister.com/wp-content/uploads/2024/08/OCR-L-DNCDELEGATES-0821.jpg?w=1024","video":null,"publish_date":"2024-08-21 23:06:01","author":"Kaitlyn Schallhorn","authors":["Kaitlyn Schallhorn"],"language":"en","source_country":"US","sentiment":0.279},{"id":254637264,"title":"Taylor Swift calls cancellation of Vienna shows 'devastating,' explains silence","text":"CTVNews.ca Top Stories 'Intimate partner violence' led to triple homicide in McCreary: Manitoba RCMP A 'horrific act of intimate partner violence' is what led to a triple homicide in McCreary, Man. last week according to RCMP. LIVE UPDATES LIVE UPDATES | DNC day 3: Walz is expected to accept the party's nomination for vice-president U.S. vice-presidential nominee Tim Walz and former U.S. president Bill Clinton will headline the Democratic National Convention on Wednesday, the third day of the party’s choreographed rollout of a new candidate, Kamala Harris, and her pitch to voters. 'Issues remain significant' between parties just hours before potential railway stoppage: labour minister Just hours ahead of an unprecedented railway stoppage in Canada, Labour Minister Steven MacKinnon says issues between the parties involved 'remain significant.' Being here 'means something': Why one federal party leader is attending the DNC While the stakes for Canada may be high in the upcoming U.S. presidential election, only one Canadian federal party leader has actually attended either the Republican or Democratic national conventions. Canada's 'labour moment' expected to stick around for a couple more years: experts Canada's unions seem to be having a moment and labour experts don't see the increase in strikes, lockouts and job action scaling back anytime soon. Kansas mom sentenced to life in prison after her 2-year-old son fatally shot her 4-year-old daughter Kansas mom sentenced to life in prison after her 2-year-old son fatally shot her 4-year-old daughter Taylor Swift calls cancellation of Vienna shows 'devastating,' explains silence Two weeks after organizers scrubbed Taylor Swift's concerts in Vienna amid a foiled terror plot, the singer issued her first statement on the cancellation. 'Caught me by surprise': Rare 'blue' frog spotted in Nova Scotia When a Nova Scotia woman set out on a walk, she ended up discovering something very colourful - a rare 'blue' frog. Tory MP deletes post that claimed cost of living is driving parents to traffic kids Conservative MP Michelle Ferreri has deleted a post on X that claimed the affordability crisis has driven parents to traffic their kids. Canada 'Intimate partner violence' led to triple homicide in McCreary: Manitoba RCMP A 'horrific act of intimate partner violence' is what led to a triple homicide in McCreary, Man. last week according to RCMP. Ontario premier defends plan to close 10 supervised drug consumption sites, despite experts calling for more to open Premier Doug Ford is defending his government’s decision to shutter 10 of Ontario’s 23 supervised drug consumption sites due to their proximity to schools and child care centres. Child's phone catches fire in Cambridge, Ont. movie theatre A mother was left shaken after her 11-year-old's cellphone suddenly caught fire while he was in a movie theatre. Multiple Jewish organizations, hospitals across Canada receive identical bomb threats More than 100 synagogues, Jewish organizations and doctors in multiple cities across the country were on high alert Wednesday after they received the same threatening email. No evidence of docs related to misconduct allegations against Frank Stronach: court An Ontario court has rejected a bid by Frank Stronach’s granddaughter to compel the family business to disclose any documents that might exist related to complaints of sexual misconduct against him and settlements involving complainants. 'Issues remain significant' between parties just hours before potential railway stoppage: labour minister Just hours ahead of an unprecedented railway stoppage in Canada, Labour Minister Steven MacKinnon says issues between the parties involved 'remain significant.' World RFK Jr. to speak Friday amid speculation he'll drop independent presidential bid and support Trump Independent presidential candidate Robert F. Kennedy Jr. will speak Friday 'about the present historical moment and his path forward,' his campaign announced Wednesday, fuelling growing speculation that Kennedy could drop out and support Republican nominee Donald Trump. Brazil will restrict entry of some foreign nationals, aiming to curb migration to US and Canada Brazil will begin imposing restrictions on the entry of some foreign citizens from Asia seeking refuge in the South American nation as a means to migrate to the United States and Canada, the justice ministry’s press office said Wednesday. Human bones found near carousel in waterfront park in Brooklyn New York City authorities are investigating after human bones were discovered twice this week on the shoreline of the East River near a waterfront carousel known for its spectacular views of the Brooklyn Bridge. Ex-politician set to tell jury his story at trial in killing of Las Vegas investigative journalist A former Las Vegas-area Democratic elected official was set Wednesday to begin telling his story to a jury that will decide whether he goes to prison or goes free in the killing of an investigative reporter who wrote articles critical of him and his workplace conduct. Tech tycoon, defence attorney, and Morgan Stanley banker among those missing in freak yacht sinking A superyacht that sank Monday off the Sicilian coast during a storm left at least six people dead and one passenger missing. Among that list is British tech kingpin Mike Lynch and some of his inner circle, who were gathered to celebrate his victory in a long-running legal trial. Defense attorneys for Boston Marathon bomber seek recusal of judge overseeing case Attorneys for Boston Marathon bomber Dzhokhar Tsarnaev are seeking to remove the judge overseeing the protracted legal battle over Tsarnaev's death sentence. Politics 'Issues remain significant' between parties just hours before potential railway stoppage: labour minister Just hours ahead of an unprecedented railway stoppage in Canada, Labour Minister Steven MacKinnon says issues between the parties involved 'remain significant.' Being here 'means something': Why one federal party leader is attending the DNC While the stakes for Canada may be high in the upcoming U.S. presidential election, only one Canadian federal party leader has actually attended either the Republican or Democratic national conventions. Tory MP deletes post that claimed cost of living is driving parents to traffic kids Conservative MP Michelle Ferreri has deleted a post on X that claimed the affordability crisis has driven parents to traffic their kids. Health 'Jarring' survey results reveal worsening mental health among Ontario youth More than half of middle and high school students in Ontario say they’re experiencing a significant level of psychological distress, a figure that has doubled over the past decade, new research shows. Nearly two-thirds of supermarket baby foods are unhealthy, study finds The supermarket baby food aisle in the United States is packed with non-nutritious foods containing far too much sugar and salt and misleading marketing claims, a new study found. Ketamine therapy can help people with depression, but also poses risks: experts Ketamine can be a 'life-saving' treatment for depression but also a major risk to patients with a history of addiction, Canadian psychiatrists say after U.S. authorities charged several people in connection with actor Matthew Perry's overdose death. Sci-Tech 'Caught me by surprise': Rare 'blue' frog spotted in Nova Scotia When a Nova Scotia woman set out on a walk, she ended up discovering something very colourful - a rare 'blue' frog. See the best photos from Monday's super blue moon A rare celestial event was seen around the world, when a blue moon and a supermoon teamed up. As hate-crime landscape evolves, a reminder — online behaviour exists in real life A lawyer with the British Columbia Civil Liberties Association says it's wise to remember that even though charges over offensive social media activity are rare, online posts exist in real life and involve real people. Entertainment Taylor Swift calls cancellation of Vienna shows 'devastating,' explains silence Two weeks after organizers scrubbed Taylor Swift's concerts in Vienna amid a foiled terror plot, the singer issued her first statement on the cancellation. 'It Ends With Us' actor Brandon Sklenar addresses online 'negativity' after backlash related to the film 'It Ends With Us' actor Brandon Sklenar is addressing the online discourse surrounding the release and promotion of the new movie. Adam Sandler is putting 'stud' Travis Kelce in the 'Happy Gilmore' sequel The world learned the degree of Sandler's affection for the Kansas City Chief tight end during a recent appearance on 'The Tonight Show with Jimmy Fallon,' where the actor and comedian revealed that Kelce will be in the sequel for his hit 'Happy Gilmore' movie. Business 'Issues remain significant' between parties just hours before potential railway stoppage: labour minister Just hours ahead of an unprecedented railway stoppage in Canada, Labour Minister Steven MacKinnon says issues between the parties involved 'remain significant.' Business groups warn of dire consequences unless feds step in as rail shutdown looms Hours away from an unprecedented potential shutdown at the country's two main railways, business groups ratcheted up their pleas for the federal government to step in and prevent a work stoppage that would upend supply chains — even as the prime minister stressed a deal at the table is the best outcome. Canada's 'labour moment' expected to stick around for a couple more years: experts Canada's unions seem to be having a moment and labour experts don't see the increase in strikes, lockouts and job action scaling back anytime soon. Lifestyle Video shows sea otter hitching ride on B.C. woman's paddleboard When Joanie Paquin was walking towards the water the other day, she was preparing to go paddle boarding with her visiting sister. She never expected to pick up a second passenger. Plaything or peril? Brazilian kites are endangering lives and prompting a push for a national ban Kite fighting has caused horrific injuries and even deaths, and a bill moving through Brazil's Congress is seeking to prohibit the manufacture, sale and use of the razor-sharp lines nationwide, with violators facing one to three years in prison and a hefty fine. Ticket sold in northeastern Ont. wins $70 million Lotto Max jackpot The winner of Tuesday night's $70 million Lotto Max jackpot bought their ticket in the Timiskaming-Cochrane area of northeastern Ontario, lottery officials say. Sports 'Competitiveness has always been a part of me': Former Humboldt Bronco heading to Paris for Paralympics Jacob Wassermann, 24, is heading to the 2024 Paralympic Games in Paris just a few years after taking up the sport of rowing. Maple Leafs sign forward Alex Steeves to one-year two-way contract The Toronto Maple Leafs have re-signed forward Alex Steeves to a one-year, two-way contract, the NHL club announced Wednesday. Canada draws into group with Puerto Rico, Cuba, Panama at 2026 World Baseball Classic Canada has drawn into a pool with Puerto Rico, Cuba and Panama at the 2026 World Baseball Classic. Autos 2 found in trunk of car speeding 50 km/h over the limit in Ottawa Ottawa police caught a group of eight people in a five-seater vehicle speeding 50 km/h over the speed limit on Greenbank Road in Ottawa's Barrhaven neighbourhood. Ford changes EV plans, will delay pickup truck, axe three-row SUV Ford Motor is reshuffling its electric vehicle plans, killing its three-row SUV and delaying its next-generation pickup while adding a new pickup and van to its future lineup as it adjusts to slower-than-expected EV growth. Toronto family claims car wash malfunction caused $3K in damage A Toronto family claims a car wash malfunction caused nearly $3,000 worth of damage to their vehicle. Local Spotlight Video shows sea otter hitching ride on B.C. woman's paddleboard When Joanie Paquin was walking towards the water the other day, she was preparing to go paddle boarding with her visiting sister. She never expected to pick up a second passenger. 'Competitiveness has always been a part of me': Former Humboldt Bronco heading to Paris for Paralympics Jacob Wassermann, 24, is heading to the 2024 Paralympic Games in Paris just a few years after taking up the sport of rowing. Robert Pattinson, Jennifer Lawrence movie among major productions filming in Calgary A new movie starring Hollywood heavyweights Robert Pattinson, Jennifer Lawrence and LaKeith Stanfield began filming in Calgary Monday. Saskatchewan's Twilite Drive-in celebrates 70th anniversary The Twilite Drive-in Theatre has been serving movie lovers for decades. Children battling chronic illness get luxury rides to BC Lions game More than a dozen children who have been diagnosed with chronic illnesses were given an unforgettable experience on the way to Sunday’s BC Lions game. Decades of protection added to 164-year-old New Brunswick lighthouse Decades of durability have been added to one of Canada’s most photographed lighthouses, the Swallowtail Lighthouse on New Brunswick’s Grand Manan Island. After multiple open heart surgeries, 10-year-old Montreal boy ready to hit Grade Six running After four open heart surgeries, 10-year-old Samih Angelo Alame is thriving and ready to hit Grade Six running. 'There needs to be changes': Downtown Vancouver store fed up after spending $300K to fight constant crime The owners of a thrift store on Vancouver's Granville strip are fed up after spending $300,000 to fight off what they describe as escalating crime over the past three years. Without bees, life 'wouldn't exist,' says local beekeeper In light of World Honey Bee Day on Saturday, local beekeepers recognized the crucial role that honey bees play in the ecosystem. Vancouver Multiple B.C. synagogues targeted with bomb threats, premier says As police investigate bomb threats directed at Jewish institutions across Canada, the premier of B.C. has confirmed \"multiple\" such incidents within the province. B.C. man who stole nearly US$1 million from investors sentenced to 3 years in prison: regulator A North Vancouver man who stole nearly US$1 million from investors over a 10-year period has been handed a three-year prison sentence, according to B.C.'s financial markets regulator. B.C. developer ordered to pay almost $100K for misconduct that caused 'consumer harm' A developer in B.C.'s Kootenay region has been ordered to pay nearly $100,000 to the BC Financial Services Authority for misconduct that caused \"consumer harm.\" Toronto Ontario premier defends plan to close 10 supervised drug consumption sites, despite experts calling for more to open Premier Doug Ford is defending his government’s decision to shutter 10 of Ontario’s 23 supervised drug consumption sites due to their proximity to schools and child care centres. Metrolinx to 'acquire' 25 homes on Pape Avenue in Riverdale for Ontario Line construction More than two dozen renters and homeowners on the east side of Pape Avenue in Riverdale have recently learned that they will have to give up their homes – at least temporarily – for the construction of the new Ontario Line. No evidence of docs related to misconduct allegations against Frank Stronach: court An Ontario court has rejected a bid by Frank Stronach’s granddaughter to compel the family business to disclose any documents that might exist related to complaints of sexual misconduct against him and settlements involving complainants. Calgary Calgary police officer speaks out after fellow cop pleads guilty to sharing sex video A Calgary police officer pleaded guilty to discreditable conduct on Wednesday, after it was found he shared an intimate video and images of a woman and fellow officer with others on the force. Driver seriously injured in crash that closed Deerfoot Trail off ramp Calgary police say a man was hospitalized following a Wednesday morning crash on the off ramp from southbound Deerfoot Trail N.E. onto westbound Stoney Trail N.E. Calgary synagogue targeted in wave of bomb threats against Jewish institutions A Calgary synagogue was targeted Wednesday as part of a wave of bomb threats across Canada directed toward Jewish institutions and organizations. Ottawa RCMP investigating bomb threats at Ottawa hospitals, Jewish organizations Hospitals, synagogues and Jewish organizations in Ottawa were among the more than a hundred across Canada who received identical bomb threats on Wednesday morning. City of Ottawa joins dozens who will not participate in Capital Pride parade The City of Ottawa is the latest organization to back out of this weekend's Capital Pride parade. Here's how you can help students with a back-to-school backpack It's the time of year when many parents are back-to-school shopping, filling kids' backpacks with school supplies. But for some families, it's yet another expense that isn't possible. Montreal Montreal synagogues on Canada-wide list of threatened Jewish institutions Montreal police says at least a dozen synagogues in Montreal are on a list of more than 100 places of worship across Canada that received email threats. Man, 28, charged with first-degree murder after woman found with hands, mouth bound in Lachine apartment A man is facing a first-degree murder charge after a 64-year-old woman was found dead with her hands and mouth bound last month in Montreal's Lachine borough. Quebec schools still short 3,858 teachers ahead of new school year With just one week to go before the start of the new school year, Quebec schools are still short 3,858 teachers, down from 5,704 last week. Edmonton 'Unacceptable': Business groups say rail stoppage would hit grain, groceries and more An impending labour stoppage on Canada's two national railways has riled industry groups who worry consumers and businesses will be hit hard if goods ranging from grains to french fries to petrochemicals can't be moved. Court order halts plans for sanction hearing against Edmonton city councillor over misconduct allegations A planned sanction hearing for an Edmonton city councillor accused of misconduct is on hold after a court order issued Tuesday stopped it. Hawrelak Park rehabilitation on schedule and on budget: City The rehabilitation work on William Hawrelak Park is continuing on schedule and on budget, according to the city. Atlantic Halifax police chief expects charges to be laid in high-profile attack on couple The new chief for the Halifax Regional Police expects charges to be laid in connection to a high-profile attack on a same-sex couple in the city’s downtown core earlier this summer. Search for kayaker in Halifax ends, investigation continues as missing person case A three-day search for a missing kayaker in a Halifax-area lake has concluded although the woman has yet to be found. Police search for suspect who allegedly threw a beverage at woman, toddler in Saint John The Saint John Police Force is looking for a suspect and witnesses following an assault in the city earlier this month. Winnipeg 'Intimate partner violence' led to triple homicide in McCreary: Manitoba RCMP A 'horrific act of intimate partner violence' is what led to a triple homicide in McCreary, Man. last week according to RCMP. Winnipeg synagogues received bomb threats: Jewish Federation Winnipeg synagogues were among the Jewish organizations across the country that received bomb threats Wednesday morning. 'Beware of free plants': Master gardener warns about invasive species that could take over your yard A Manitoba master gardener is warning Manitobans about accepting free plants as the growing season nears its end and people may be thinning out their flower beds. Regina 'A devastating effect': Sask. premier calls for federal intervention amid fears of rail lockout Premier Scott Moe has called on the federal government to intervene in the ongoing labour dispute involving Canada's two largest railways. The first person in Canada to legally access 'magic mushroom' therapy has died at age 56 A Saskatoon man who became a trailblazer for psilocybin-assisted therapy, using a psychedelic drug commonly known as magic mushrooms, has died at age 56. Check your Lotto Max tickets, someone in Regina won over $300,000 People in Regina are encouraged to check their Lotto Max tickets, as someone in the Queen City split one of the Maxmillions. Kitchener Child's phone catches fire in Cambridge, Ont. movie theatre A mother was left shaken after her 11-year-old's cellphone suddenly caught fire while he was in a movie theatre. 'People will die': Local experts condemn province's drug consumption sites ban Local drug strategy experts are raising red flags about the province’s forced closure of two drug consumption sites in Kitchener and Guelph. Ont. family trying to regain ownership after stolen vehicle sold illegally An Ontario man is trying to get back ownership of the vehicle that was stolen from him, but so far, he's had no luck. Saskatoon 'A hell of a fire': Home destroyed in farm fire south of Saskatoon A large fire south of Saskatoon has destroyed multiple buildings, including a home. The first person in Canada to legally access 'magic mushroom' therapy has died at age 56 A Saskatoon man who became a trailblazer for psilocybin-assisted therapy, using a psychedelic drug commonly known as magic mushrooms, has died at age 56. Saskatoon unveils $1.2B funding plan for arena district Saskatoon’s administration revealed its cost estimate for the proposed downtown arena district — $1.22 billion. Northern Ontario There is a link between the meat you eat and a chronic disease, according to new research Regularly eating red and processed meats in particular is associated with a higher risk of type 2 diabetes, according to a new global study. Ontario woman accidentally overpays Visa bill by nearly $13,000 Many of us pay our bills using online banking because it's simple, fast and usually problem free, but if you make a mistake and pay the wrong amount, it can sometimes be difficult to get your money back. Northern Ont. townships alarmed about plan to move radioactive material The Township of Nairn and Hyman and the Township of Baldwin held a joint emergency council meeting this week to discuss a plan to move radioactive material from the former Beaucage Mine. London 'I thought he was going to kill me': Elderly woman explains how she survived knife attack An elderly woman says she’s lucky to be alive after surviving a stabbing attack while walking her dog near her east London Ont. home on Monday morning. Many Jewish organizations receive identical bomb threats across Canada, including in London, Ont. RCMP say more than 100 synagogues, Jewish organizations, and doctors across the country received a threatening email Wednesday morning. Cannabis locations closed by OPP, with warrants related to 'illegal cannabis storefronts' Police said that they executed search warrants on at least two London cannabis stores and other locations on the Chippewas of the Thames First Nation on Tuesday. Barrie Young mother killed in head-on Innisfil crash crossed centre line, police say A young mother who died in a crash in Innisfil in the spring caused the fatal collision, police say. Boy, 14, hospitalized after alleged stabbing at Barrie park Police officers are investigating reports a young teen was stabbed at a park in Barrie Tuesday evening. Guilty plea expected in Barrie hit-and-run that claimed international student's life A 20-year-old man charged in connection with the death of an international student in Barrie could soon be entering a guilty plea. Windsor $1 billion in daily trade at risk as railway lockout looms: Local chambers The CEOs of the Chatham-Kent and Windsor-Essex Chambers of Commerce warn supply of everything from produce like whisky, minivans to gravel is at risk. Mulch fire in Detroit sends smoke and air quality concerns into Windsor A large mulch fire, that began Tuesday evening, is now under control, according to City of Detroit officials. Incident in Chatham resolved peacefully The Chatham-Kent Police Service (CKPS) said the incident in the area of McNaughton Avenue East between Taylor Trail and Spurgeon Drive has been rosolved peacefully. Vancouver Island Multiple B.C. synagogues targeted with bomb threats, premier says As police investigate bomb threats directed at Jewish institutions across Canada, the premier of B.C. has confirmed \"multiple\" such incidents within the province. B.C. home struck by lightning, sparking electrical fire A neighbourhood in Ladysmith, B.C, got the shock of a lifetime when a bolt a lightning struck a home late Sunday afternoon. B.C. man who stole nearly US$1 million from investors sentenced to 3 years in prison: regulator A North Vancouver man who stole nearly US$1 million from investors over a 10-year period has been handed a three-year prison sentence, according to B.C.'s financial markets regulator. Kelowna Man charged with mischief for allegedly starting several fires Vernon, B.C. A 33-year-old man is facing multiple charges for allegedly setting several fires in Vernon on Monday. West Kelowna police seek help identifying break-and-enter suspect Mounties in West Kelowna are looking for a suspect they say broke into a local home while a mother and her child were inside. One year later: Hazards, progress, frustration in wake of West Kelowna wildfire When the McDougall Creek fire sparked on Aug. 15, 2023, no one could’ve imagined it would mushroom in size, consuming homes, infrastructure and livelihoods in the West Kelowna area with damage that will take years to address. Lethbridge 'It's fun being creative': Whoop-Up Days inspired food menu launches Those taking in the food at this year’s Whoop-Up Days festival can expect to see a few different items on the menu. Crown files notice, may appeal not-guilty verdicts in Coutts murder-conspiracy case Crown prosecutors in Alberta have given notice they plan to appeal the not-guilty verdicts given to two men arrested at the 2022 blockade at Coutts, Alta. Whoop-Up Days 2024 kicks off in Lethbridge Whoop-Up Days are here and plenty of people have already made their way to the exhibition grounds to see what this year has in store. Sault Ste. Marie Consumption site ban will lead to more deaths, northern official say Northern officials say safe consumption services are still needed to keep patients alive and connect them to treatment. Hwy. 17 east of the Sault reopens after collision Highway 17 is closed in Thessalon, Ontario Provincial Police said Wednesday afternoon. Sault stabbing suspect wanted for second-degree murder arrested in Toronto A year to the day after the fatal stabbing took place in Sault Ste. Marie, 25-year-old Tyler Abbot has been charged with second-degree murder. N.L. Myrle Vokey, beloved educator who created the Newfoundland Screech-in, dead at 85 Myrle Vokey, an educator who created Newfoundland's famed Screech-in ceremony as a way to give people a sense of belonging, died on Saturday at the age of 85, after a road trip and a night out for his 58th wedding anniversary. Trial begins for Newfoundland RCMP officer accused of assaulting unruly air passenger A trial is underway for an RCMP officer accused of assaulting an unruly flight passenger after he was escorted off an international flight that had been diverted to the airport in Stephenville, N.L. Hurricane Ernesto to swing south of Newfoundland, but it will bring heavy rain and high seas Newfoundland has caught a lucky break with Hurricane Ernesto expected to pass south of the island, but the fast-moving storm will still bring a lot of rain in a short time overnight on Monday, Environment Canada says. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks Our Guide To The Best Meal Prep Containers For Everything From Snacks to Lunches 16 Boring (But Very Useful) Back-To-School Supplies That Cost Less Than $15 Here Are The Running Belts That Should Be On Your Radar Home Just 21 Things You Might Want To Add To Your Cart This Week 19 Handy Organization Products That'll Help Keep Your Home Neat And Tidy Our Guide To The Best Automatic Pet Feeders In Canada In 2024 (And Where To Get Them) Gifts 20 Birthday Gifts That Won't Disappoint 14 Of The Best Gifts For 10-Year-Olds You Can Get Online Right Now 15 Practical Gifts That Cost Less Than $50 Beauty 15 Of The Best Hair Products For Split Ends, According To Reviewers If You're Looking For A Hyaluronic Acid Serum, Here Are A Few That Reviewers Are Loving Right Now Here Are 19 Of The Absolute Best Liquid and Cream Blushes — And Reviewers Swear By Them Deals 22 Amazon Canada Deals And Discounts On Back-To-School Supplies The Best Amazon Canada Deals On Kitchen Products This Week From Lululemon to Amazon Canada: Here Are All The Best Sales, Deals, and Discounts You'll Find Online Right Now Stay Connected","summary":"Two weeks after organizers scrubbed Taylor Swift's concerts in Vienna amid a foiled terror plot, the singer issued her first statement on the cancellation.","url":"https://www.ctvnews.ca/entertainment/taylor-swift-calls-cancellation-of-vienna-shows-devastating-explains-silence-1.7009582","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/21/taylor-swift-1-7009608-1724281249831.jpg","video":null,"publish_date":"2024-08-21 23:02:14","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"ca","sentiment":-0.273},{"id":254638432,"title":"Harris campaign ads target anti-Asian hate and protecting Obamacare","text":"Vice President Kamala Harris’ campaign released two ads directed at Asian American, Native Hawaiian, and Pacific Islander voters this week. The campaign ads focus on the rise in anti-Asian hate and threats to repeal the Affordable Care Act. According to the Harris-Walz campaign, the ads will appear digitally, on radio, and on television throughout the battleground states of Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania, and Wisconsin. The campaign is part of a broader three week $90 million media blitz currently underway for the month of August. “These new ads remind Asian American, Native Hawaiian, and Pacific Islander voters that the choice in this election is clear for our communities,” said Harris-Walz AANHPI Spokesperson Andrew Peng in a statement. “Vice President Harris is working to lower the costs of healthcare—having already capped insulin at $35 per month for over 2 million AANHPI seniors—while Trump promises to tear critical protections away. And while the Vice President continues to fight relentlessly to keep our families safe, Donald Trump actively encourages anti-Asian hate and remains an active danger to our families and freedoms, ” he continued. The first ad, called “Reduced,” focuses on Trump’s threats to repeal the ACA, and protections that benefit AANHPI communities. The second ad, “The Seal,” is even more damning as it lays into the xenophobia and racism exhibited by Trump during the pandemic. Anti-Asian hate crimes rose dramatically as Trump and his surrogates focused their vitriol on conspiracy theories revolving around China. NBC News reports that since the last election cycle, Asian American voters showed the largest growth of any racial group in the United States. American Asian communities now make up more than 6% of all eligible voters in the U.S. According to AAPI Data, a research and policy organization focused on Asian American, Native Hawaiian, and Pacific Islander communities, there are 1,444,503 eligible Asian American voters living in swing states as of April 2024. The results of swing states this election are projected to be close and reminding voters how toxic Trump is to all Americans will make the difference this November.","summary":"Vice President Kamala Harris’ campaign released two ads directed at Asian American, Native Hawaiian, and Pacific Islander voters this week. The campaign ads focus on the rise in anti-Asian hate and threats to repeal the Affordable Care Act.\n\n\n\nAccording to the Harris-Walz campaign, the ads will appear digitally, on radio, and on television throughout the battleground states of Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania, and Wisconsin. The campaign is part of a broader three week $90 million media blitz currently underway for the month of August.&nbsp;\n\n\n\n“These new ads remind Asian American, Native Hawaiian, and Pacific Islander voters that the choice in this election is clear for our communities,” said Harris-Walz AANHPI Spokesperson Andrew Peng in a statement.\n\n\n\n&nbsp;“Vice President Harris is working to lower the costs of healthcare—having already capped insulin at $35 per month for over 2 million AANHPI seniors—while Trump promises to tear critical protections away. And while the Vi","url":"https://www.dailykos.com/story/2024/8/21/2264776/-Harris-campaign-ads-target-anti-Asian-hate-and-protecting-Obamacare?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1337060/story_image/GettyImages-2161325629.jpg?1724272585","video":null,"publish_date":"2024-08-21 23:00:04","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":-0.1},{"id":254638150,"title":"DeSantis’ rep further diminished after series of brutal GOP primary losses","text":"After the 2022 midterms, Florida Gov. Ron DeSantis was hailed as one of the rock stars of the GOP and the MAGA movement. DeSantis defeated Democratic gubernatorial nominee Charlie Crist (an ex-Republican) by 19 percent in a year when Democrats greatly exceeded expectations, and some right-wing pundits predicted he would go on to win the 2024 GOP presidential nomination and enjoy a solid victory over President Joe Biden in the general election. But DeSantis underperformed as a presidential candidate and ended up dropping out of the race and endorsing now-nominee Donald Trump, who is up against Democratic nominee Kamala Harris now that Biden is no longer seeking reelection. In an article published on August 21, NBC News' Matt Dixon stresses that DeSantis' reputation in GOP circles has continued to suffer in light of some primary election results the night before. READ MORE: 'Total hatred': Trump most upset about this DNC speech \"DeSantis backed 23 school board candidates in Tuesday's primaries, and nearly half of them did not win, while six others were forced into runoffs,\" Dixon explains. \"DeSantis remains a popular governor in an increasingly red-leaning state that just saw Republicans take a more than 1 million voter registration advantage. But the primary losses are among the biggest in-state political headwinds he has faced in years.\" The NBC News reporter adds, \"DeSantis-backed candidates also suffered losses in other races, while he notched victories in some state legislative contests. But the school board elections provide a snapshot of how the political dynamic has shifted for him.\" Dixon notes that DeSantis-backed candidates lost even in some of Florida's \"traditional conservative strongholds.\" A veteran GOP operative in Florida, interviewed on condition of anonymity, told NBC News, \"I think it's pretty clear that we are moving back toward a scenario where candidates once again matter. In 2018, a Trump endorsement was inflatable. In 2022, DeSantis could have handpicked anyone in Florida he wanted. In 2024, you need more than an endorsement to win.” READ MORE: 'Mind blowing': Experts stunned by Harris' half a billion cash haul in 'just under a month","summary":"After the 2022 midterms, Florida Gov. Ron DeSantis was hailed as one of the rock stars of the GOP and the MAGA movement. DeSantis defeated Democratic gubernatorial nominee Charlie Crist (an ex-Republican) by 19 percent in a year when Democrats greatly exceeded expectations, and some right-wing pundits predicted he would go on to win the 2024 GOP presidential nomination and enjoy a solid victory over President Joe Biden in the general election.\n\nBut DeSantis underperformed as a presidential candidate and ended up dropping out of the race and endorsing now-nominee Donald Trump, who is up against Democratic nominee Kamala Harris now that Biden is no longer seeking reelection. \n\nIn an article published on August 21, NBC News' Matt Dixon stresses that DeSantis' reputation in GOP circles has continued to suffer in light of some primary election results the night before.\n\nREAD MORE: 'Total hatred': Trump most upset about this DNC speech\n\n\"DeSantis backed 23 school board candidates in Tuesday's primaries, and nearly ","url":"https://www.alternet.org/desantis-nbc-news/","image":"https://www.alternet.org/media-library/image.jpg?id=53504854&width=1200&height=600&coordinates=0%2C0%2C0%2C213","video":null,"publish_date":"2024-08-21 23:00:03","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.05},{"id":254636560,"title":"The Impact of Harris on Boosting Democratic Fundraising: Insights from the Politics Desk","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill. In today’s edition, we explore how Robert F. Kennedy Jr.’s impending exit from the presidential race could give Donald Trump a boost. Plus, national political reporter Ben Kamisar breaks down how Kamala Harris opened the fundraising floodgates. Programming note: Stay tuned for a special edition of the From the Politics Desk newsletter each night after the Democratic National Convention this week, bringing you all the latest news and analysis from our team in Chicago. Sign up to receive this newsletter in your inbox every weekday here. How Harris had supercharged Democratic fundraising By Ben Kamisar The latest campaign finance reports underscore just how much the Joe Biden-to-Kamala Harris switcheroo has supercharged Democratic enthusiasm and fundraising. The party’s presidential campaign reported raising an eye-popping $204 million in July. Biden was the candidate at the top of the ticket until July 21, when he dropped out and backed his running mate. By comparison, Donald Trump’s campaign raised $47.5 million in July. A dive into digital fundraising numbers from ActBlue — a platform that effectively serves as the Democratic credit-card processor for online donations — shows how Harris opened the floodgates. Across the first 20 days of July, with Biden facing a steady drumbeat of Democratic calls to exit the race in the wake of his shaky debate performance, his campaign raised about $30 million through ActBlue, an average of about $1.5 million per day. But from when he ended his candidacy through the end of the month, Harris raised more than $183 million — including $39.5 million the day Biden dropped out and almost $43 million the following day — an average of about $16.7 million per day. The trend is clear. While the campaign never hit $3 million in daily ActBlue fundraising in Biden’s final 20 days as a candidate, it never brought in less than $7 million daily in the final 11 days of July with Harris as the Democratic standard-bearer. What to expect on Night 3 of the Democratic convention Minnesota Gov. Tim Walz will deliver tonight’s headlining address, presenting his biggest opportunity since Harris selected him as a running mate to introduce himself to the nation. Other notable speakers include: Former President Bill Clinton; former House Speaker Nancy Pelosi; Transportation Secretary Pete Buttigieg; Pennsylvania Gov. Josh Shapiro; Maryland Gov. Wes Moore; House Minority Leader Hakeem Jeffries; and Sens. Cory Booker of New Jersey, Catherine Cortez Masto of Nevada, Amy Klobuchar of Minnesota, and Chris Murphy of Connecticut. Follow along with tonight’s speeches on our live blog → RFK Jr. is planning to drop out of the 2024 presidential race and endorse Trump Robert F. Kennedy Jr. intends to end his independent presidential campaign and endorse Trump, according to two sources familiar with the plans, Vaughn Hillyard, Dasha Burns, Katherine Koretski and Alec Hernández report. The sources cautioned that talks are ongoing, but there will be clarity by the end of the week. One of the sources said the campaigns are working toward a joint appearance. The decision to drop out will end the most prominent third-party candidacy in the 2024 race. Kennedy announced Wednesday that he will give a campaign speech addressing “his path forward,” days after his running mate said the campaign faced a choice about staying in the 2024 election or dropping out to back Trump. Trump’s running mate, Sen. JD Vance of Ohio, told NBC News in an interview Wednesday that “there’s been a lot of communication back and forth” between Kennedy and his campaign. Vance also said Trump wouldn’t promise a Cabinet position for Kennedy’s endorsement. The potential fallout: As Mark Murray notes, polls show that a Kennedy withdrawal would likely help Trump more than it hurts him. National NBC News polling finds that Republicans like Kennedy more than Democrats do. In January, Kennedy held net-positive ratings from Republicans (+18) and independents (+4), while Democrats viewed him mostly negatively (-25). The spread has only gotten starker since then. Fast-forward to July’s NBC News poll — conducted before Biden’s exit — when Kennedy was in positive territory with only Republican voters (+11), while he was negative among independents (-18) and Democrats (-38). The July poll also shows that in a multicandidate field, Trump kept 87% of the voters who backed him in a head-to-head contest with Biden, while 10% of his voters went to Kennedy, 1% went to Jill Stein and 1% went to Cornel West. By contrast, Biden kept 85% of his two-way support, while 6% went to Kennedy, 3% to Stein, 2% to Chase Oliver and 1% to West. And since Biden’s departure from the race, the total share of voters supporting Kennedy and third-party candidates in general has declined, according to national and battleground polls. More voters have been choosing Harris or Trump instead. While the potential share of Kennedy backers is smaller than it used to be, those voters could still be decisive in a close election. That’s all from the Politics Desk for now. If you have feedback — likes or dislikes — email us at [email protected]","summary":"Internewscast Journal\n\nInternewscast\n\n\nWelcome to the online version of From the Politics Desk, an evening newsletter&#8230;\n\n\nThis Post: The Impact of Harris on Boosting Democratic Fundraising: Insights from the Politics Desk first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/the-impact-of-harris-on-boosting-democratic-fundraising-insights-from-the-politics-desk/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-How-Harris-has-supercharged-Democratic-fundraising-From.jpg","video":null,"publish_date":"2024-08-21 22:57:13","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.181},{"id":254637074,"title":"The Truth About Celebrities and Politics","text":"In his DNC address, former President Barack Obama warned about putting a premium on “money, fame, status,” and “likes.” At the same time, his fellow Democrats are shrewdly deploying celebrities and influencers to help propel Kamala Harris to victory this November. How should voters square this tension? First, here are three new stories from The Atlantic: The Pop-Culture Election Years from now, if someone asks you to recall a specific moment from the 2024 Democratic National Convention, what will come to mind? I’d probably mention Lil Jon bounding through the audience and hyping up the arena during the 50-state roll call. Political pundits often dismiss such spectacles as meaningless bombast. But the reality is, these are the moments that make politics fun. For better or worse, images—not policies—remain lodged in voters’ brains. You can fight that fact or you can use it to your advantage. Maybe you’ve heard the joke that D.C. is “Hollywood for ugly people.” These days, the line between the political world and the celebrity world has all but vanished. Last night, just before prime time, the Harris campaign sent out a fundraising email from the Veep star Julia Louis-Dreyfus: “I know a thing or two about vice presidents,” it read. “And let me tell you, Kamala Harris is the real deal.” In Chicago, Lil Jon’s performance wasn’t the only celebrity appearance. Spike Lee, Patti LaBelle, Common, Eva Longoria, Wendell Pierce, Sean Astin, Don Cheadle, and others were all inside the United Center last night. Jason Isbell, Mickey Guyton, and Tony Goldwyn popped up the night before. The Democratic National Committee has also invited more than 200 influencers and “content creators” to the convention—people who know how to secure those dreaded “likes.” The Harris campaign is leaning into the celebrity-fication and meme-ification of politics, and, so far, it’s working. On social media, Harris’s official rapid-response account, @KamalaHQ, has embraced Charlie XCX’s “brat” iconography, and the campaign recently referenced the infamous internet jokester @dril in an official press release. With these subversive actions, they’re courting younger, terminally online voters who may have been tuning out this election altogether—even if it all feels a bit strange to older supporters. Obama—the first president of the social-media age—lamented certain aspects of our internet-inflected life last night. “We chase the approval of strangers on our phones,” he said. “We build all manner of walls and fences around ourselves, and then we wonder why we feel so alone.” The former president’s address was sharp, poignant, and funny (following an absolute barn burner of a speech from the former first lady). But it was his section on modern life that stuck out to me most. The message seemed a bit out of sync with the fact that Barack and Michelle Obama are celebrities themselves. Since leaving the White House, the duo’s work has been anchored in an entertainment company that has produced Oscar-winning documentaries and slick Netflix movies. Both Obamas have written extremely popular memoirs. Both have famous friends. The former president’s literature and music suggestions have become beloved perennial lists. To be sure, none of that is a problem—merely a reflection of contemporary existence. Americans “stan” all manner of famous people in parasocial ways. Even Harris’s running mate, the salt-of-the-earth Tim Walz, who will headline tonight, has become an unlikely celebrity in recent weeks. Celebrities also played a role in the intraparty fighting that led to President Joe Biden’s withdrawal from the race. After Biden’s disastrous debate performance, journalists and political experts published reams of articles calling for Biden to step aside. And yet it was an op-ed from the Democratic fundraiser and actor George Clooney that seemed to catalyze a broader movement to force Biden’s hand. For better or worse, celebrity culture is American culture. Republicans know this too. Arguably the most-talked-about moment from last month’s Republican convention in Milwaukee was Hulk Hogan ripping off his shirt, rivaled only by Kid Rock singing “American Bad Ass.” Though the current iterations of the Democratic and Republican Parties couldn’t be more different from each other, they both know how Americans think—and where the race is. This election may come down to the state of Pennsylvania, birthplace of Taylor Swift. If either party could somehow persuade Swift, the biggest pop star on the planet, to stage a benefit concert in Pennsylvania, the election might be over. But Swift has spent most of her career avoiding politics altogether. A few days ago, Trump boosted an AI image of Swift on Truth Social and “accepted” a Potemkin endorsement from the star and her fans. It wasn’t real—but its potential impact was. Back to last night’s surprise star: Lil Jon. He was ostensibly there to represent his home state of Georgia during the roll call, though his appearance may have had another layer of meaning. Lil Jon was among the contestants who once appeared on The Celebrity Apprentice—Trump’s old reality-TV show. At the 2011 White House Correspondents’ Dinner, Obama taunted Trump at length, fed up with his birtherism conspiracy-mongering. “Obviously we all know about your credentials and breadth of experience,” Obama said to Trump while up on the dais. He described a recent episode of The Celebrity Apprentice and Trump’s choice of whom to “fire” on TV. “Ultimately you didn’t blame Lil Jon or Meat Loaf—you fired Gary Busey,” Obama deadpanned. “And these are the kind of decisions that would keep me up at night. Well handled, sir. Well handled.” That night, the room roared with laughter. Trump sat in the audience, humiliated. Four years later, he would descend the golden escalator inside his namesake tower and change the course of history. Trump would go on to become one of the most famous people to ever live. America has always been a place where celebrities lead and others follow. But over the past few elections, our politics and our lives have never been more intertwined with all things celebrity. To win an election, you may just have to pay that premium. Related: Today’s News Dispatches Explore all of our newsletters here. Evening Read Cape Cod Offers a Harbinger of America’s Economic Future By Rob Anderson More From The Atlantic Culture Break Watch (or skip). Emily in Paris (available on Netflix) is the epitome of guilty-pleasure viewing. It should probably stay that way, Hannah Giorgis writes. Debate. When is it okay to not finish a book? Sophie Vershbow walks through how to decide to put a book down. Stephanie Bai contributed to this newsletter. When you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic.","summary":"The Democrats and the Republicans both understand that fame is inextricable from American culture.","url":"https://www.theatlantic.com/newsletters/archive/2024/08/the-truth-about-celebrities-and-politics/679553/","image":"https://cdn.theatlantic.com/thumbor/8sQkcRMTL07sfcXsHdtNM1kkE48=/0x712:5990x3832/1200x625/media/img/mt/2024/08/GettyImages_2167642094/original.jpg","video":null,"publish_date":"2024-08-21 22:57:00","author":"John Hendrickson","authors":["John Hendrickson"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.186},{"id":254637122,"title":"Trump speaks from behind bulletproof glass at 1st outdoor rally since Butler shooting","text":"Former President Donald Trump on Wednesday delivered his latest campaign trail remarks protected by bulletproof glass and multiple visible counter snipers on top of nearby buildings – his first outdoor campaign event not at his properties since a gunman attempted his life at a rally in Butler, Pennsylvania, last month. It was his third counterprogramming event of the week against the Democratic National Convention, continuing with the series of events in battleground states focused on key election issues this year. In Asheboro, North Carolina, on Wednesday, Trump focused on national security, attacking the Biden-Harris administration on ongoing foreign conflicts, the Afghanistan withdrawal, American hostage deals and other issues. Contrary to his intimate and small counterprogramming events in Pennsylvania and Michigan earlier this week, this was his biggest campaign event so far this week. Trump – with the American flag in the backdrop just like in Butler – speaking in an open field in front of thousands of supporters, including some who told ABC News they were at the Butler rally and said the set up in Asheboro reminded them of the Butler rally. As ABC News previously reported, the U.S. Secret Service has ordered multiple sets of bulletproof glass panels to be stored around the country so it can be trucked to wherever it's needed, sources said. While the measure is typically reserved exclusively for sitting presidents, the Secret Service has made an exception following the attempt on Trump's life. The Secret Service had recommended that Trump stop holding outdoor rallies last month after a gunman in Butler fired at him from a rooftop 400 feet from the stage, nicking his ear and killing a spectator in the crowd. Since July 13, Trump has held nearly a dozen campaign events, all of them indoors. Claiming the United States was respected during his administration, Trump repeatedly painted a grim picture of a possible Kamala Harris presidency, saying, \"If Comrade Kamala wins this November, World War three is virtually guaranteed to happen. Everything she touches, she destroys.\" Escalating his attacks on the sitting vice president, Trump began to directly blame Harris for the ongoing war between Ukraine and Russia, even falsely claiming that Harris met with Russian President Vladimir Putin days before the Russia-Ukraine war broke out. \"Remember when Biden sent Kamala to Europe to stop the war in Ukraine? She met with Putin, and then three days later, he attacked,\" Trump falsely claimed. \"How did she do it? Think she did a good job. She met with Putin to tell him, don't do it. And three days later he attacked. That's when the attack started.\" In reality, there's no public record of Harris meeting with Putin. Instead, she met with Ukrainian President Volodymyr Zelensky at a security conference in Munich five days before the war broke out. Trump also suggested Harris was responsible for the way U.S. troops left Afghanistan, saying \"she was the last person in the room with Biden when the two of them decided to pull the troops out of Afghanistan.\" \"She had the final vote; she had the final say, and she was all for it,\" Trump said, later promising to hold the Biden-Harris administration accountable by asking for the resignations of \"every single senior military official who touched the Afghanistan disaster.\" Trump also claimed he would have handled the Afghanistan withdrawal better, claiming he has had conversations with the head of Taliban and that he \"respected\" him. \"Our adversaries knew that America was not to be trifled with when I was your commander in chief,\" Trump said. \"... But since the Afghanistan catastrophe, it's been open season on America and our allies.\" Trump also railed against \"woke\" military generals throughout his speech, claiming, \"I know the good ones, the weak ones,\" praising his former military officials like Gen. Keith Kellogg. Offering a glimpse of what his second term would look like, Trump declared \"the days of blank checks for the weapons systems\" are over and said he will build \"a great Iron Dome\" and give it to other countries like Israel. \"We will increase funding, but at the same time, the days of blank checks for the weapons systems over the past are over. I tell you what we will build, we're going to build a great Iron Dome over our country so that we don't have to get hit. We give it to other countries, we help Israel and other countries,\" Trump said. Trump also said he would \"aggressively\" shift funding to \"keep American on the cutting edge, investing in drones and other technology, saying he wants to invest \"heavily\" in \"drones and robotics and artificial intelligence and hypersonics.\" Even as he focused on policies, Trump dismissed the idea of stopping personal attacks on Harris – at one point, mocking his advisers for suggesting he should stick to policy and stray away from personal attacks. He then said that many speakers at the Democratic National Convention personally attacked him, referencing Barack and Michelle Obamas speeches last night. Trump then polled the crowd to see if he should \"get personal,\" followed by many in the crowd cheering. Prior to Obama's speech last night, Trump spoke highly of the former president, but quickly shifted his tone saying he was \"nasty.\" \"Did you see Barack Hussein Obama last night? He was taking shots at your president. And so is Michelle. They always say, please stick to policy, don't get personal. Yet they are getting personal all night long, these people. Do I still have to stick to policy?\" \"I try and be nice to people, you know, but it's a little tough when they get personal,\" Trump said. \"He was very nasty last night. I try and be nice,\" Trump said about former Obama's speech at the DNC Tuesday night. \"Should I not get personal? he asked the crowd. After few agreed, Trump quipped, \"I don't know -- my advisers are fired.\" \"","summary":"Donald Trump spoke behind bulletproof glass at his first outdoor rally since the assassination attempt against him in Butler, Pennsylvania last month.","url":"https://abcnews.go.com/Politics/trump-speaks-bulletproof-glass-1st-outdoor-rally-butler/story?id=113030425","image":"https://i.abcnewsfe.com/a/52918e8d-2d33-4b93-b3c1-47f7f85e23c6/trump-rally-rt-jef-240821_1724265879091_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2024-08-21 22:53:41","author":"Alexandra Hutzler","authors":["Alexandra Hutzler"],"language":"en","source_country":"US","sentiment":0.041},{"id":254636370,"title":"How the DNC Was Tweaked From a Biden-Led Event and Harnessed the Energy Around Kamala Harris","text":"In early July, this year’s convention in Chicago looked like it would be a major dud for the Democrats. There was very little to look forward to in the Windy City back when the party was in meltdown following President Joe Biden’s painfully revealing debate performance. Delegates and party members then winced as Biden dug in his heels on stepping away from the 2024 ticket, and with each primetime interview the president sat for over the summer, the Democrats’ precarious position became more apparent. The event, which is meant to ignite the party and inspire voters to turn out for the Democrats’ ticket, began to look like an obligation rather than a must-attend, potentially historic event. Then, that wind shifted. Biden bowed out toward the end of July, and Harris ascended to the top of the ticket unchallenged, with everyone — including Beyoncé — throwing her their support. Within 48 hours, genuine excitement was unexpectedly in the air. Who would join Harris on the ticket? And of course, what would become of the upcoming Democratic National Convention? A new candidate demands a new type of convention — the Democratic National Committee would need to present an event that ushers in a younger party figurehead while passing the guard from older Democrats and re-introducing Harris to the electorate in front of roughly 5,000 delegates, 12,000 volunteers and 15,000 media members. The convention being broadcast over four nights this week is the work of DNC staffers who worked until the final moments this week to realize a new vision, according to a source close to the convention who spoke to The Hollywood Reporter on background. This new event was designed to carefully present Harris as an exciting leader while respectfully making space for Biden, honoring what Rep. Nancy Pelosi called his “very selfless” act of stepping aside for the greater good of the party. Meanwhile, some of the convention’s logistics had to be tweaked, celebrity invites had to be handled (the Hollywood elements this week don’t scream Biden, after all), fresh videos needed to be shot and a certain amount of what’s seen on-site at the United Center had to be Kamala-ified. Much of what happens in political campaigning occurs at a rapid pace and what is seen by the layman has fallen into place at the last minute. With so many elements, that’s no different for conventions and this year’s DNC, THR was told this week. Adding Washington and Kaling as hosts was a late-in-the-game move — with a famous Black woman on one night and another who is Indian-American taking host duties the night before meant to represent Harris’ Jamaican and South Asian heritage. While the committee certainly appears to be downplaying any stress or major legwork caused by the sudden shift to a Harris-led ticket — the schedules of two A-list TV producer-actors like Washington and Kaling can’t possibly be wide open — their late booking for the DNC speaks to the importance they feel in offering support and the attention Harris commands at this moment. After the ticket change, Biden’s speech was moved to the first night. The DNC’s idea was to give the career politician the proper time to speak directly to the party and the nation following his historic exit. Many working at the DNC got into politics because of Biden, THR was told. And with Harris watching from within the stadium (she took to the stage to embrace Biden when he concluded his remarks) this would allow for the remaining three nights to focus on moving forward and cede the podium to the party’s future. Unfortunately, the pitfalls of live events, including speeches running over and waiting for hooting and hollering to die down were not just a testament to a party with plenty to discuss and a highly engaged crowd. This all pushed Biden’s speech out of primetime and past many a bedtime. The president hit the stage at 11:30 p.m. ET, so his 50-plus-minute speech went well past midnight. It’s unclear when the many speakers from earlier on Monday night were booked, but the roster on day one — Rep. Maxime Waters, L.A. Mayor Karen Bass — seemed to be more reflective of a Harris-led ticket than Democrats who would have been prioritized if Biden hadn’t ended his campaign. Political conventions tend to be a mix of pre-taped candidate-friendly PR and live speeches and often staged moments designed to stick in the memories of voters. Harris has spent some of her past few whirlwind weeks on shoots for videos, Politico reported, which are being shown across the convention. Meanwhile, clips that could be used if any Democrat were running — the first two nights include some of a former Trump supporter talking about breaking out of MAGAland and making the journey across the aisle. It’s difficult to discern if the musical guests were booked for a Biden or Harris-centric event. James Taylor on night one, who was bumped for time, certainly screams Biden while rapper Common is likely on self-proclaimed “hip-hop girl” Harris. As mentioned, so much is happening in politics that is done last minute, and the DNC isn’t releasing performers until hours before the night’s events begin. One performer that’s guaranteed to electrify the crowd is Harris herself, whose brief moment onstage Monday got what looked like the entire arena onto their feet to cheer her on. A moment like that only helps to smooth over any snags in proceedings at this altered convention, because if the candidate’s star power is this strong, the job of the DNC was already done.","summary":"In early July, this year’s convention in Chicago looked like it would be a major dud for the Democrats. There was very little to look forward to in the Windy City back when the party was in meltdown following President Joe Biden’s painfully revealing debate performance. Delegates and party members then winced as Biden dug [&#8230;]","url":"https://www.hollywoodreporter.com/news/politics-news/how-dnc-tweaked-convention-joe-biden-kamala-harris-1235980842/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/08/GettyImages-2166918556_b238bc.jpg","video":null,"publish_date":"2024-08-21 22:53:06","author":"Kevin Dolak","authors":["Kevin Dolak"],"language":"en","source_country":"US","sentiment":-0.314},{"id":254636324,"title":"Chicago-area Republicans show solidarity with Donald Trump during day 3 of Democratic National Convention","text":"CHICAGO (WLS) — Local Republicans are keeping an eye on this week’s Democratic National Convention in Chicago. ABC7 spoke with voters Wednesday who favor former President Donald Trump and the GOP ticket. ABC7 Chicago is now streaming 24/7. Click here to watch With the exuberance of the DNC in full swing, some African-American Republicans from the Chicago area said Trump is still their pick. Jimmy Lee Tillman is the president of the Martin Luther King Republicans. He said its a conservative organization founded in 2007 with roughly 750 members, they and have offices in Chicago, Milwaukee and Detroit. RELATED | Chicago DNC 2024: Live updates on protests, street closures, security, parking and more “There is nothing the Democratic Party has offered to be a solution to the unemployment problem especially with the immigration problem here,” Tillman said. Unlike a majority of Black American, Tillman says people of color should support the Republican nominee for president and his running mate despite Trump’s continued questioning of Vice President Kamala Harris’ ethnicity and intelligence, along with a barrage of personal attacks. “I think he’s a genuine guy,” Tillman said. “I don’t think there’s a racist bone in his body… and I know he’s going to work hard to do right by the Black community.” Meanwhile, Trump allies traveled to Chicago for a third day Wednesday to continue their criticisms of Harris. They called her a weak and failed Vice President. “She’s been in the White House for almost four years. She hasn’t been an outside observers in the community doing social work,” Trump campaign senior advisor Brian Hughes said. “She’s been in the meeting, side by side with Joe Biden.” Black conservatives like Tillman added that Democrats have made, what he calls, empty promises to African Americans for years. He is convinced people of color will be better off with Trump. ‘We’re going to bring back the Freedmen’s Bureau,” Tillman said. “We’re going to bring back the bureau for the native descendants of native Black Americans and make sure we get our rights that the government has entitled for us that have been ignored.” While Tillman said he and his membership don’t have details about how a pro-Black agenda by a future Trump administration will be addressed, he’s optimistic about the promise of a new deal for Black America. “People got two choices, they can either stay home, which I think they should do, or vote for trump,” Tillman said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCHICAGO (WLS) &#8212; Local Republicans are keeping an eye on this week&#8217;s&#8230;\n\n\nThis Post: Chicago-area Republicans show solidarity with Donald Trump during day 3 of Democratic National Convention first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/chicago-area-republicans-show-solidarity-with-donald-trump-during-day-3-of-democratic-national-convention/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-08-21 22:51:12","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.43},{"id":254636142,"title":"Making families cool again — not federal cash — will solve US ‘birth dearth’","text":"Last week the Democrats showed us the past and the future of population policy. Even as they cheered news that a Planned Parenthood mobile van would park right outside their national convention to choke off pregnancies with free abortions and vasectomies, nominee Kamala Harris announced a half-baked proposal to encourage childbearing via tax credits for new parents. The party’s old, negative attitude toward parenthood and family formation was spurred by (false) 1960s fears of a population explosion that still drive Boomer-era perceptions. But in fact we now live in an era of population implosion, with birth rates in America and elsewhere well below replacement, and still dropping. “Global fertility isn’t just declining, it’s collapsing,” according to writer James Pethokoukis. This means that governments are increasingly trying to find ways to get people to have more children, not fewer. Other countries are already trying that with subsidies, with very limited results. Turns out you just can’t pay people enough to offset the financial cost of having children. It’s school clothes, expensive sneakers, ballet lessons and soccer equipment, perhaps private school and public or private college tuition, all on top of the basics of feeding, clothing and amusing a person in the 21st century. Not cheap: Adjusted for inflation, the cost of raising a middle-class child to adulthood in this country in 2024 is approximately $312,000. And that’s not counting college expenses. Against that, the $6,000 tax credit promised by Harris, as she one-upped a $5,000 credit proposed by Republican veep nominee JD Vance, is chump change — even though many critics fear this sort of subsidy could break the budget over the next decade if enacted. (I should say break the budget more, since the deficit is already unsustainable.) But nations that have tried such financial incentives haven’t had much success. Hungary offered forgivable loans to new parents and Poland announced substantial annual subsidies to promote childbirth, but without noticeable effect. South Korea has had the same experience. China has been frantically, and futilely, trying to undo the catastrophic results of its “one child” policy. France first enacted birth incentives in 1939, but without much luck — birth rates have fallen pretty steadily since. There’s just no way to ease the cost of raising a child with government spending. But there are many other things we can do. For one, we could minimize the hassle of raising a child. The modern culture of safetyism actually doesn’t provide a lot of safety, but it’s bad for kids’ mental health and makes raising them more expensive. Excessive car seat requirements, for example, save only a handful of lives, but the rules mean that you can’t have three kids or more without a minivan or large SUV. A recent study found that state car-seat mandates — which can require even 8-year-olds to be buckled into bulky boosters — prevented 8,000 births in 2017, while saving only 57 lives. “Free range” kids are mentally healthier and easier to raise, but our culture is so opposed to the idea of autonomy for school-age children that parents get cited for letting their kids play in their own front yards without direct oversight. And parenting is, let’s face it, a low-prestige activity in our society. Minivans are generally seen as uncool “mommy mobiles”, and the appeal of an SUV is mostly that they are associated with high-prestige activities like hiking or kayaking rather than low-prestige parenting needs. (Even though for most they’re basically minivans with plausible deniability). TV shows portray dads as bumbling idiots, moms as exhausted and put-upon, and kids as terrors. And schools and the government send constant signals that parents are losers who can’t raise their children without outside supervision. It wasn’t always that way. TV shows once portrayed multi-kid families as normal and happy, and parents as sensible and admirable. And political conventions of the recent past certainly didn’t feature abortion and surgical sterilization as sideshow attractions. The overwhelming presumption in decades past was that children were desirable and enjoyable, and that parents were doing a genuine public service by raising them. It could be that way again, and I predict that it will. A falling population is an economic, military and social disaster. A birth dearth leaves us with no way to fund the social welfare programs that advanced nations rely on: Social Security, Medicare and other safety-net systems are built on a demographic pyramid, and when that pyramid is inverted, with more old people at the top than young people coming in at the bottom, it collapses. Vance’s and Harris’ tax credit proposals won’t work — but the fact that both parties are suddenly pushing pro-birth policies is a sign of change. Watch for attitudes toward children and childbearing to evolve, too, in the coming years. It’s about time. Glenn Harlan Reynolds is a professor of law at the University of Tennessee and founder of the InstaPundit.com blog.","summary":"Vance's and Harris' subsidy proposals won't make Americans have more babies — but the fact that both parties are suddenly pushing pro-birth policies is a sign of change. ","url":"https://nypost.com/2024/08/21/opinion/make-families-cool-again-to-solve-us-birth-dearth/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-i4c8i6uio-1724277400981.jpg?quality=75&strip=all&1724266033&w=1200","video":"https://cdn.jwplayer.com/videos/vGI1Kg2Y-RyIcpnTz.mp4","publish_date":"2024-08-21 22:49:27","author":"Glenn H. Reynolds","authors":["Glenn H. Reynolds"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.09},{"id":254636158,"title":"The Obamas criticize Trump harshly","text":"Former President Barack Obama and First Lady Michelle Obama went for Donald Trump ‘s jugular in back-to-back speeches at the Democratic National Convention despite the Republican ex-president finally showing a moment of decency toward them. The one-two punch by the powerful former first couple Tuesday night in Chicago came just hours after the GOP nominee unexpectedly praised his predecessor after years of attempting to delegitimize him. ‘I happen to like him. I respect him, and I respect his wife,’ Trump said in an interview with CNN on Tuesday just hours before their remarks. He also called Obama a ‘nice gentleman.’ It was a sharp turn from Trump who spent years attacking Obama and promoting the birtherism conspiracy theory questioning whether the country’s first black president was born in the United States. Neither Barack or Michelle Obama held back as they unleashed a series of brutal takedowns of the former president with the former first lady delivering what could be one of the most devastating one lines of the entire convention. ‘Who’s going to tell him that the job he’s currently seeking might just be one of those “black jobs?”‘ she said to thunderous applause in the United Center. Former President Obama also sent the internet into a frenzy with his hand gesture suggesting he was making a crude joke about his successor as he joked about the Republican presidential nominee’s ‘weird obsession with crowd sizes.’ This was not the former first couple who welcomed the Trumps graciously into the White House after the 2016 election despite Trump’s attacks on them. But their scathing response to the Republican ex-president’s attempt for a second term in the White House was met with thunderous approval from Democrats. The former first lady blasted the ex-president saying for years Trump ‘ did everything in his power to try to make people fear us.’ ‘His limited and narrow view of the world made him feel threatened by the existence of two hardworking, highly educated, successful people who also happened to be black,’ she said. She accused him of being the ‘same old con’ and blasted his ‘ ugly, misogynistic, racist lies.’ In his remarks moments later, Obama slammed Trump for ‘ whining about his problems since he rode down his golden escalator nine years ago.’ ‘We don’t need four more years of bluster and chaos. We’ve seen that movie – and we all know that the sequel is usually worse,’ Obama said. The 44th president compared Trump to a neighbor running a lief blower every day: ‘f rom a neighbor, that’s exhausting. From a president, it’s just dangerous.’ The gloves were off and neither Obama was embracing the words of the first lady at the convention in 2016 when she said ‘when they go low, we go high.’ Michelle Obama warned that Vice President Kamala Harris, the first woman of color nominated for the top of a major party presidential ticket was about to face the same criticism, she and her husband faced. ‘Now, unfortunately, we know what comes next. We know folks are going to do everything they can to distort her truth,’ she said before torching Trump. She urged Democrats on Tuesday night to work ‘like our lives depend on it’ ahead of Election Day and heaped praise on ‘my girl’ Harris. Her speech came just one day after President Biden spoke at the convention after his dramatic exit from the presidential race just one month ago, but the former first lady did not mention him. She was solely focused on moving forward. President Obama did mention Biden, calling his decision to choose the current president to serve as his vice president back in 2008 was one of his best decisions. ‘History will remember Joe Biden as an outstanding President who defended democracy at a moment of great danger,’ he said. ‘And I am proud to call him my President, but I am even prouder to call him my friend.’ From there Obama turned his wrath on the ex-president. ‘It has been a constant stream of gripes and grievances that’s actually been getting worse now that he is afraid of losing to Kamala,’ he said. ‘There’s the childish nicknames, the crazy conspiracy theories, this weird obsession with crowd sizes.’ Obama accused Trump of seeing power as ‘ nothing more than a means to his ends.’ Before claiming he respected Obama on Tuesday, Trump over the years has called his predecessor everything from a ‘disaster’ and ‘catastrophe’ to falsely claiming Obama was not born in the United States. He also spent his four years in office attempting to undo some of Obama’s biggest legislative achievements – most prominently efforts to repeal the Affordable Care Act or Obamacare. Trump responded to the blistering criticism of him at the convention in a conservative radio interview on Wednesday morning. ‘I was mentioned at the Democrats’ little party that they have going on in Chicago, and it’s pretty sad,’ Trump said on The Hugh Hewitt Show in response to a question about the ‘rhetoric’ being used against him and the recent assassination attempt. ‘These people are out of control, and they’re ruining our nation. Our nation is going to [expletive],’ he claimed. Want more stories like this from the Daily Mail? Visit our profile page and hit the follow button above for more of the news you need.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer President Barack Obama and First Lady Michelle Obama went for Donald&#8230;\n\n\nThis Post: The Obamas criticize Trump harshly first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/the-obamas-criticize-trump-harshly/","image":"https://i.dailymail.co.uk/1s/2024/08/21/19/88776543-0-Former_President_Barack_Obama_and_First_Lady_Michelle_Obama_went-a-29_1724263744689.jpg","video":null,"publish_date":"2024-08-21 22:49:05","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.011},{"id":254636330,"title":"Beyoncé Threatens Cease-and-Desist After Trump Campaign Uses Her Song 'Freedom' on Social Media: Report","text":"The Trump campaign has gotten Beyoncé's attention for all the wrong reasons. Steven Cheung, a spokesperson for Donald Trump, shared a video on his own X account of the former president walking off a plane on Tuesday, Aug. 20, set to the track \"Freedom\" off Beyoncé's 2016 album Lemonade. \"Touchdown in Michigan!! @realDonaldTrump,\" the caption read. The use of the song, which also features Kendrick Lamar, instantly caught attention online, as Democratic nominee Kamala Harris has used it at several campaign events. While Beyoncé, 42, has not commented on the video, Rolling Stone reported on Wednesday, Aug. 21, that the Trump campaign did not have permission to use the track and that the singer has threatened to send the Republican presidential nominee's camp a cease-and-desist. PEOPLE has reached out to a representative for Beyoncé for comment. The Harris campaign most recently used the track in a new ad unveiled on Monday, Aug. 19, during the first day of the Democratic National Convention. Although Beyoncé has not officially endorsed Harris, she's voiced her support for the Democratic party on various occasions, including in 2013, when she sang the national anthem at former President Barack Obama's inauguration. In 2020, she posted a social media clip encouraging voters for current President Joe Biden. However, Harris has officially been endorsed by Beyoncé's mother, Tina Knowles. The fashion designer, 70, posted a photo next to Harris in late July on Instagram, writing, \"New, Youthful, Sharp , , energy !!!! You asked for it and our President Biden did what was best for the country ! Putting personal Ego , power and fame aside . That is the definition of a great leader, . Thank you, President Biden for your service and your leadership . Go Vice President Kamala Harris for President. Let's Go ❤️❤️❤️❤️ #kamala2024.\" Earlier this month, the Trump campaign was called out by Céline Dion for using her 1997 hit song \"My Heart Will Go On\" at a campaign rally in Montana. \"Today, Celine Dion’s management team and her record label, Sony Music Entertainment Canada Inc., became aware of the unauthorized usage of the video, recording, musical performance, and likeness of Celine Dion singing “My Heart Will Go On” at a Donald Trump / JD Vance campaign rally in Montana,\" a statement shared on the performer's social media accounts read. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. \"In no way is this use authorized, and Celine Dion does not endorse this or any similar use. …And really, THAT song?\" the statement continued, referencing its original use in the 1997 blockbuster film Titanic.","summary":"The song choice instantly caught attention online, as Democratic nominee Kamala Harris has used it at several campaign events","url":"https://people.com/beyonce-threatens-cease-and-desist-after-trump-campaign-uses-song-freedom-social-media-8699496","image":"https://people.com/thmb/hgwEG9M0jPmc4rTsIN3-NUY0BnM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x255:755x257)/beyonce-donald-trump-082124-20735ee36f7542409a8c0111853a4358.jpg","video":null,"publish_date":"2024-08-21 22:48:01","author":"Ingrid Vasquez","authors":["Ingrid Vasquez"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.299},{"id":254636512,"title":"Doug Emhoff's ex-wife helped produce the video bio of him that played at the DNC","text":"The NPR Network will be reporting live from Chicago throughout the week bringing you the latest on the Democratic National Convention. Kerstin Emhoff, Doug Emhoff's first wife with whom he shares two children, is at the Democratic National Convention supporting her ex-husband and Democratic presidential candidate and Vice President Kamala Harris. During the DNC's second night of festivities, Cole Emhoff introduced his father with a touching video about the second gentleman's life, family and relationship with Harris. Kerstin Emhoff shared on social media that she and her production company, Ventureland, helped produce the video. She's been spotted each night of the DNC so far, standing alongside her kids and the Emhoff family cheering for Harris and her running mate, Minnesota Gov. Tim Walz. The two Emhoff children, Cole and Ella, are extremely close with Harris, whom they call \"Momala.\" Harris has previously written about their blended family and being close with Kerstin Emhoff. She wrote in Elle last month, \"Kerstin and I hit it off ourselves and are dear friends. She and I became a duo of cheerleaders in the bleachers at Ella’s swim meets and basketball games, often to Ella’s embarrassment. We sometimes joke that our modern family is almost a little too functional.\"","summary":"Kerstin Emhoff, Doug Emhoff's first wife with whom he shares two children, is at the Democratic National Convention supporting her ex-husband and Democratic presidential candidate and Vice President Kamala Harris.","url":"https://www.npr.org/2024/08/21/g-s1-18527/democratic-national-convention-doug-cole-kerstin-emhoff","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5602x3735+0+0/resize/5602x3735!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F11%2F39%2F33be2a1448dab3696c5a80323959%2Fgettyimages-2167677131-1.jpg","video":null,"publish_date":"2024-08-21 22:47:08","author":"Jaclyn Diaz","authors":["Jaclyn Diaz"],"language":"en","source_country":"us","sentiment":0.348},{"id":254636140,"title":"Trump would demand ‘Afghanistan disaster’ resignations, ‘back pay’ for troops fired for refusing vax on Day 1, he says","text":"ASHEBORO, N.C. — Former President Donald Trump pledged to demand mass resignations of top military officials behind the chaotic Afghanistan withdrawal and give “back pay” to service members fired for refusing COVID-19 vaccines should he return to the White House in January. The Republican presidential nominee’s focused on his national security policies in his Asheboro, NC – his second visit to the state in a week. He gave his remarks from behind bulletproof glass, which the Department of Defense and Secret Service ordered for all his outdoor events after hi July 13 near-assassination in Butler, Pa. Trump, 78, touched on issues related to Afghanistan, the war in Ukraine, Iran, “woke-ism” in the military and recruitment crisis facing the US armed services. Afghanistan The former president laid blame on both President Biden and Vice President Kamala Harris for the botched US exit from Afghanistan, arguing that it has been “open season on America and our allies” since the “Afghanistan disaster.” “It was the most humiliating event in the history of our country,” Trump said of the nation’s “catastrophic retreat” from the now Taliban-run country. . Biden, 81, has not fired anyone related to the Afghanistan withdrawal, but Trump vowed to hold the government and military officials responsible for it accountable. “I will ask for the resignations of every single senior military official who touched the Afghanistan disaster,” he announced. “I want their resignations immediately.” Trump said he expected to see resignation letters on his “desk in the Oval Office” on Inauguration Day. He also criticized the Biden-Harris administration’s decision to leave behind equipment in Kabul, though the military said most were destroyed or made inoperable. “In fact, Afghanistan is now one of the largest arms merchants in the entire world,” he added, highlighting the eye-popping tally of equipment – “70,000 armored trucks” and “700,000 rifles and guns” – abandoned during the August 2021 withdrawal. “All left by the Biden-Harris administration. Who bought all that stuff in the first place?” Trump said. “This calamity is on comrade Kamala Harris’ shoulders,” he argued. “She was the last person in the room with Biden when the two of them decided to pull out of Afghanistan.” Event attendee Craig Garner, a 55-year-old lineman, told The Post that he thinks Trump would handle the military better than the Biden-Harris administration did. “[The military is] very poorly equipped. I don’t think we are prepared at all,” he said. “Trump is going to do a better job with it. He says he is pro military, and our son is a marine, so we are a military family also.” Ukraine Trump predicted that under a Harris administration, Russia’s war against Ukraine would continue raging on. “This war is going to escalate and escalate,” he said. The GOP nominee also suggested he could negotiate peace in the region even before assuming office, if elected. “I’ll get it settled as president-elect. I’ll get that war stopped. It will be done before I get into office,” Trump pledged. He touted former President Ronald Reagan’s “peace through strength” doctrine, arguing that he’d be able to prevent future Russian incursions into the Ukraine, or other parts of Europe, and other world conflicts through tough diplomacy. “If you go to war with another country that’s friendly to us – or even not friendly to us – you’re not going to do business in the United States, and we’re going to charge you a 100% tariff,” he said of what he would tell world leaders seeking conflict. “I’ve talked this world out of a lot of wars with telephone calls,” he boasted. “We don’t have to send in the troops.” Woke Military Trump lamented that the nation’s armed forces have become too “woke” – pledging to end focus on gender identity and race in the military upon taking office. “At the top, they are woke,” he said of the military. “We don’t want woke generals; we want generals who know how to win.” “On Day One, I will get critical race theory and transgender insanity the hell out of our US armed forces,” Trump promised. “We’re taking it out.” “Our warriors should be focused on defeating America’s enemies, not figuring out their genders.” Trump added, “Marxist ideologies have no place in combat.” “If you want to have a sex change or social justice seminar then you can do it somewhere else, but you’re not going to do it in the Army, Navy, Coast Guard, Air Force, Space Force or the United States Marines.” The proposal played well with attendees including retired parametic Marlina Straughn, 64, whose husband served in the Army. “The military is not the same. They are losing people mainly because they’re just – I don’t know how to say it – just don’t have the will that they used to have. They’ve lost it. It’s just become so woke,” she said. “They have people who are serving in the military just to get [gender reassignment] surgeries. I’m not trying to be rude, or mean or ugly – but that’s not a reason to join the military,” the Guilford County resident added. Recruiting and Rebuilding the Military Trump promised to rehire service members fired for refusing COVID vaccines under Biden with “an apology and back pay.” In the Army alone, 1,903 soldiers were discharged for opting against getting the shots. Last year, the military welcomed those troops back once the vaccine mandate was rescinded, but did not offer them back pay or an apology. Trump also pledged to hold the “largest peacetime recruitment drive in the history of the armed forces.” Under Biden, the Army, Navy, Air Force, and Coast Guard have fallen short of their recruitment goals. “There‘s no spirit [in the military] now,” Trump argued. “The sense of spirit, pride and prestige will soon come roaring back and reach levels never seen before.” “We’re going to make it so hot – I’m going to want to resign and join the military.” Trump was ruled medically ineligible to serve in the military during the Vietnam War. Enhanced Security Measures for Trump The former president’s podium was placed behind a large pane of ballistics glass and three more plates of the bulletproof material shielded Trump’s back and sides as spoke to his supporters. The Security Service reportedly encouraged the Trump campaign to no longer hold outdoor rallies in the wake of the Butler shooting, and the bulletproof glass is part of the additional measures being deployed by the embattled agency to protect the GOP nominee. At one point, Trump ventured outside the perimeter of the glass – mid-speech – to embrace a woman who required medical attention, seemingly overcome by the North Carolina heat. The glass was fairly reflective and somewhat obscured the crowd’s view of Trump. “Put the signs down,” someone apparently unable to see the former president because of the reflections yelled at one point.","summary":"ASHEBORO, N.C. &#8212; Former President Donald Trump pledged to demand mass resignations of top military officials behind the chaotic Afghanistan withdrawal and give “back pay” to service members fired for refusing COVID-19 vaccines should he return to the White House in January. The Republican presidential nominee’s focused on his national security policies in his Asheboro,...","url":"https://nypost.com/2024/08/21/us-news/trump-standing-behind-bulletproof-glass-demands-afghanistan-disaster-resignations-and-promises-back-pay-for-service-members-fired-for-refusing-v/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/88090522.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/vyRy9WcX-RyIcpnTz.mp4","publish_date":"2024-08-21 22:45:40","author":"Victor Nava,Victoria Churchill","authors":["Victor Nava","Victoria Churchill"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.336}]}