{"offset":0,"number":50,"available":444,"news":[{"id":361944354,"title":"Jimmy Kimmel foresaw his demise after second Trump win, vowed to keep ‘very important voice’ on TV right before ratings dive","text":"WASHINGTON — Jimmy Kimmel predicted his own demise the day after President Donal Trump won the 2024 election, assuming he was on the president’s “list of enemies’’ and should give up — before vowing reverently to keep his own “very important voice’’ on air.\n\nKimmel, who was “indefinitely” sidelined from his eponymous show on Wednesday, told his sidekick Guillermo in a “Jimmy Kimmel Live!” opening sketch taped after Vice President Kamala Harris’ brutal loss to Trump last November that he was “leaving the country.”\n\n“I can’t stay for another four years of this — who knows what he’s going to do?” he balked. “You’ve heard him. He said he has a list of enemies. You think I’m not on that list?”\n\nGuillermo, whose full name is Guillermo Rodriguez, countered, “Jimmy, we need you to help us get through this. You have a very important voice.”\n\n“I do?” Kimmel replied. “Maybe you’re right.”\n\nThe TV host then spent his 10-minute, sometimes-teary monologue grousing about Trump’s victory and how it was “a terrible night for women, for children, for the hundreds of thousands of hard working immigrants who make this country go, for health care, for our climate, for science, for journalism, for justice, for free speech.”\n\n“It was a terrible night for poor people, for the middle class, for seniors who rely on Social Security, for our allies in Ukraine, for NATO and democracy and decency,” he continued in a mawkish tone.\n\n“And it was a terrible night for everyone who voted against him. And guess what? It was a bad night for everyone who voted for him too. You just don’t realize it yet.”\n\nAfter making a “joke” about sharing a jail cell with Taylor Swift, Kimmel quipped: “We’ll see how funny that is in six months. When the great talkshow host roundup begins.”\n\nTen months later, ABC executives pulled him off the air — but his ratings had started nose-dived almost immediately after the election, as he resumed his Trump tirades.\n\nMonthly Nielsen figures showed “Jimmy Kimmel Live!” fell to just 1.1 million total viewers in August 2025, were cut nearly in half from January’s 1.95 million, trailing behind every one of his late night peers.\n\nHere’s the latest on Jimmy Kimmel’s suspension after Charlie Kirk comments\n\nJimmy Kimmel raged against Trump almost every night for a year before ABC pulled him off air\n\nDisney bosses want Jimmy Kimmel to ‘de-escalate’ before putting show back on air: reports\n\nHow late-night hosts handled Jimmy Kimmel suspension in first shows since ABC yanked him from air\n\nJimmy Kimmel’s suspension just latest example of Disney yanking celebrities off the air\n\nKimmel’s August household rating of 0.35 was his lowest point of the year. Viewers between the ages of 18 and 49 were his worst demographic.\n\nThe “Man Show” alum averaged only 129,000 viewers in that bracket in August, off from 212,000 in January and less than half his June peak of 284,000.\n\nKimmel was indefinitely canned got into trouble early in his monologue Monday night when he decided to talk about the brutal killing of Kirk at an event at Utah Valley University in Orem last week.\n\n“We hit some new lows over the weekend, with the MAGA gang trying to characterize this kid who killed Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,” he told the audience at the El Capitan Entertainment Centre in Hollywood, California. \n\nKirk, 31, was fatally shot amid his “American Comeback” college speaking tour on the campus of Utah Valley University on Sept. 10.\n\nTyler Robinson, a “radicalized” 22-year-old with a live-in trans partner, was captured 33 hours later and charged with Kirk’s murder.\n\nUtah Gov. Spencer Cox had told The Wall Street Journal in a piece published Sept. 13 that Robinson subscribed to a “leftist ideology.”\n\nKimmel’s deal with ABC had been slated to run through May 2026 under a three-year extension signed in September 2022 — but he was abruptly pulled before his show aired Wednesday night. \n\nThe $16-million-per-year late-night host has refused to apologize for his remarks during his Monday monologue, part of the reason that Disney CEO Bob Iger and TV boss Dana Walden pulled the show.\n\nKimmel reportedly told execs that he intended to “clarify” his remarks in an upcoming monologue — only to double down and signal he was going to go after Trump supporters again.","summary":"\"You've heard him. He said he has a list of enemies. You think I'm not on that list?\" Kimmel said of Trump in his first post-election monologue.","url":"https://nypost.com/2025/09/19/us-news/jimmy-kimmel-predicted-his-own-demise-after-trump-win-pledged-to-keep-very-important-voice-on-tv-before-ratings-dive/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/111741772.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/u532cp4X-RyIcpnTz.mp4","publish_date":"2025-09-19 23:29:42","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","source_country":"us","sentiment":-0.188},{"id":361937900,"title":"Jay Jacobs and other NY Democrats have great reasons to reject Zohran Mamdani","text":"Zohran Mamdani is unraveling New York’s Democratic Party, and Republicans are ready to pick up the pieces.\n\nThe state’s three most important leaders — Gov. Kathy Hochul, Assembly Speaker Carl Heastie and Senate Majority Leader Andrea Stewart-Cousins — have now all endorsed the 33-year-old leftist for NYC mayor.\n\nThey’re opening the floodgates for Mamdani’s extreme agenda to take root across the state.\n\nBut standing in the way is Jay Jacobs, the party’s state chair and a sworn enemy of its socialist wing.\n\nHe bluntly rebuffed the prospect of an endorsement: “I reject the platform of the so-called ‘Democratic Socialists of America’ and do not believe that it represents the principles, values or policies of the Democratic Party.”\n\nNassau County Reps. Tom Suozzi and Laura Gillen likewise refused to back Mamdani.\n\nInstead, they doubled down on their concerns about his radical views on public safety and Israel.\n\nThese regular Democrats recognize the danger that the young radical poses to the wider party: Their reelection bids could be early casualties of a Mamdani mayoralty.\n\nBoth hail from purple districts that voted in Republicans in 2022, when then-Rep. Lee Zeldin ran an impressively close race against Hochul on a tough-on-crime message.\n\nIn total, Democrats lost four New York House seats in 2022, three of which they regained last year.\n\nThe GOP’s pitch to voters writes itself: Don’t want socialist extremism to spread near you? Vote Republican.\n\nFor all of his charm, Mamdani is an extremely polarizing figure.\n\nIf his extreme criminal-justice agenda cuts down a police headcount hovering near three-decade lows, New Yorkers are going to feel increasingly unsafe as response times climb.\n\nAs they will if social workers replace cops and fail to deal adequately with violent mentally ill and homeless people.\n\nZeldin showed that’s a recipe for Republicans to flip swing House seats yet again.\n\nA Manhattan Institute poll conducted in January showed 70% of New York City voters want more police officers; 81% want more on subways. \n\nDon’t expect those numbers to decrease in swing districts like Suozzi’s and Gillen’s.\n\nWorse, if civil unrest occurs on Mamdani’s watch, how will he restore order — if he even tries?\n\nHe’s vowed to disband the NYPD’s Strategic Response Group, the unit responsible for responding to large protests and mass shootings like the July atrocity at 345 Park Ave.\n\nScrapping the SRG would give President Donald Trump a reason to send troops to New York to quell disturbances — and allow Republicans to take credit for bringing order to chaos, as happened in Washington, DC.\n\nDemocrats’ embrace of Mamdani will also drive moderate and center-left Jews who fear and detest his antisemitism to vote for the GOP next year, including for Hochul’s likely general-election challenger, Rep. Elise Stefanik.\n\nThey have nowhere else to go. \n\n(Remember, Nassau County is about twice as Jewish as the Big Apple, which itself is home to more Jews than any other city in the world.)\n\nHow can Jews stand behind a party that’s championing someone who’s repeatedly refused to condemn globalizing the intifada?\n\nIs it now suddenly OK for Democrats to back arresting Israeli Prime Minister Benjamin Netanyahu?\n\nLittle wonder pro-Israel House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer are still holding out on their endorsements.\n\nFearing for their safety, New Yorkers might move to other states, accelerating the outmigration that already threatens to cost New York up to three House seats in the 2030 redistricting.\n\nThey’ll join others who’ll avoid the state in the face of new taxes on the wealthy.\n\nHeastie said last week that he’d push to raise taxes for Mamdani’s agenda, calling millionaire taxes “popular.”\n\nBy Democrats’ new logic, they expect to win elections by raising taxes.\n\nAs fiscal expert E.J. McMahon and the Citizens Budget Commission have shown, however, an increasing share of the nation’s millionaires have already made their home outside of New York.\n\nWith a projected $34.3 billion state budget gap through 2029, Albany is also going to feel the pinch when New York’s biggest taxpayers bail.\n\nJacobs, Suozzi and Gillen prove that it wasn’t necessary for the state’s top brass to back Mamdani after he won a closed primary with about 32% voter turnout.\n\nAfter all, he didn’t endorse Joe Biden or Kamala Harris last year. \n\nState Dems could have reciprocated the cold shoulder.\n\nInstead, Mamdani’s record will be tied to his endorsers.\n\nHochul, in particular, has ceded her chance to be the adult in the room with Mamdani.\n\nShe could’ve ensured that the city is still governed responsibly and its residents are safe.\n\nIf Mamdani wins in November, there’s little to prevent him from making the state a bellwether for democratic socialism nationwide.\n\nBut Americans as a whole aren’t going to embrace his radical agenda like New York City and its leaders have.\n\nThey’ll make it known at the ballot box.\n\nJohn Ketcham is director of cities and a legal policy fellow at the Manhattan Institute. All views expressed are those of the author and not the Manhattan Institute.","summary":"Gov. Kathy Hochul, Assembly Speaker Carl Heastie and Senate Majority Leader Andrea Stewart Cousins have now all endorsed the 33-year-old leftist.","url":"https://nypost.com/2025/09/19/opinion/how-zohran-mamdani-is-dividing-democrats-and-paving-the-way-for-gop-victories/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/new-york-city-mayoral-candidate-111747998-e1758320472471.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-09-19 23:14:06","author":"John Ketcham","authors":["John Ketcham"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.301},{"id":361940900,"title":"Emily Compagno: Kamala Harris is burning all bridges in her new book","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Five September 19, 2025 02:45 \n\n Emily Compagno: Kamala Harris is burning all bridges in her new book \n 'The Five' weighs in on former Vice President Kamala Harris' new book and her remarks against other Democrats.\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE FIVEV-VIDEOPOLITICSDEMOCRAT ELECTIONSKAMALA HARRIS","summary":"&apos;The Five&apos; weighs in on former Vice President Kamala Harris&apos; new book and her remarks against other Democrats.","url":"https://www.foxnews.com/video/6379812120112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5039164c-c8d3-40af-be3d-cfef9360991b/db143fa4-2b23-4a63-957a-e8b824e4bb32/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-19 22:22:30","author":null,"language":"en","source_country":"us","sentiment":0.373},{"id":361947440,"title":"Kamala Harris Admits She Didn't Choose Pete Buttigieg as Veep Because He's Gay: 'Too Big of a Risk'","text":"Kamala Harris has revealed in her explosive new memoir that Minnesota Governor Tim Walz was not her first choice for vice president, RadarOnline.com can report, during her ill-fated and brief 2024 presidential campaign.\n\nHarris has promised to lift the lid on the circumstances before her hastily run race, which was slapped together after President Biden's disastrous debate performance against Donald Trump.Harris Rejects Selecting Buttigieg For VPHarris is just days away from the September 23 release of her highly anticipated memoir, 107 Days, which promises to deliver a \"behind-the-scenes account\" on the \"high-stakes\" campaign she led after Biden suspended his re-election bid three months before the election.\n\nAmong the early secrets being spilled is the revelation that the 60-year-old had a different running mate in mind – but knew it would be a tough sell. \n\nAccording to a preview in The Atlantic, Harris originally eyed former Secretary of Transportation and her close friend, Pete Buttigieg, for the VP role, but ultimately decided that it would be \"too big a risk\" for a Black woman to run with a gay man.\n\nButtigieg \"would have been an ideal partner – if I were a straight white man,\" Harris details in her book. \"But we were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. \n\n\"Part of me wanted to say, Screw it, let’s just do it. But knowing what was at stake, it was too big of a risk.\"Buttigieg Was Left Perplexed By The DecisionHarris shared in her book that \"Pete knew\" about the risk, but the politician told Politico on Thursday, September 18, it was all news to him, strongly stating he believed in letting the voters make the ultimate decision. \n\n\"My experience in politics has been that the way that you earn trust with voters is based mostly on what they think you’re going to do for their lives, not on categories,\" Buttigieg snapped back.\n\nHe then pointed to the success President Obama had during his campaigns, along with his own two terms as mayor of South Bend, Indiana, as examples of letting the voters make the decision.\n\n\"You just have to go to voters with what you think you can do for them,\" he said. “Politics is about the results we can get for people and not about these other things.\"Harris Will Lift Lid On Election In New BookHarris hits the road next week to start promoting her memoir and is likely to face lots of questions about it and her failed campaign. \n\nShe first announced the book in July, when her official X account shared a video along with the caption: \"What the world saw on the campaign trail was only part of the story. My new book is a behind-the-scenes look at my experience leading the shortest presidential campaign in modern history. \n\n\"107 Days is out on September 23. I can't wait for you to read it.\"\n\nIn the clip, Harris described her campaign as being \"intense, high-stakes, and deeply personal.\"Behind-The-ScenesThe former vice president added: \"Since leaving office, I've spent a lot of time reflecting on those days. Talking with my team, my family, my friends, and pulling my thoughts together. In essence, writing a journal that is this book.\n\n\"With candor and reflection, I've written a behind-the-scenes account of that journey. I believe there's value in sharing what I saw, what I learned, and what I know it will take to move forward.\n\n\"In writing this book, one truth kept coming back to me: Sometimes the fight takes a while.\"","summary":"Kamala Harris has promised to lift the lid on the circumstances before her hastily run race in her new tell-all memoir","url":"https://radaronline.com/p/kamala-harris-pete-buttigieg-vice-president-gay-tim-walz/","image":"https://media.radaronline.com/brand-img/s_lRQr0ay/0x0/kamala-harris-pete-buiiigieg-1758313868638.jpg","video":null,"publish_date":"2025-09-19 22:20:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":0.075},{"id":361938706,"title":"Biden’s former chief of staff details his memory struggles in White House and how Jill had him manage declining president","text":"Joe Biden’s former chief of staff has testified to Congress about the Democratic president’s memory struggles in the final years of his presidency, a new report reveals.\n\nJeff Zients told the House Oversight Committee in a closed hearing on Thursday that Biden had difficulty remembering names and dates in his final years in the White House, Axios reports, citing people familiar with his remarks.\n\nZients reportedly acknowledged that Biden had always struggled with faces and dates, but that it got worse as his presidency went on. He also noted that Biden would often request more meetings to make decisions on issues as he finished his term, according to Axios.\n\nThe ex-chief of staff went on to say that former First Lady Jill Biden urged him to adjust the president’s schedule to ensure he could get more rest, Axios reports. Zients reportedly said that fellow aide Annie Tomasini also requested that he limit Biden’s schedule and shorten the distances the president had to walk.\n\nZients said the president’s son, Hunter Biden, was present for discussions about his father’s presidential pardons, according to the report. As he prepared to leave office, Biden issued pardons to members of his family and political allies who had been the targets of attacks by President Donald Trump. \n\nThe group included Hunter, Dr. Anthony Fauci, and lawmakers who served on the House committee that investigated the attempted insurrection at the U.S. Capitol on January 6, 2021.\n\nZients’ testimony comes as lawmakers investigate whether “Biden’s cognitive decline was covered up by his inner circle,” and if critical decisions were made on his behalf using an autopen, according to the committee’s website.\n\nThe Independent has contacted Zients and Biden’s office for comment.\n\nEarlier this year, leaked audio of Biden’s 2023 interview with Special Counsel Robert Hur revealed the extent to which the then-80-year-old president struggled to remember key details and dates. \n\nThe audio, published by Axios, included a moment when Biden’s attorneys had to remind him of the year his son Beau died and the year that Trump was first elected president.\n\nWhile the transcripts were already public at the time, the audio also revealed that Biden spoke in a halting, whispering voice, punctuated by long silences.\n\nIn her forthcoming memoir, former Vice President Kamala Harris has also unveiled new details about her relationship with Biden after he dropped from the race and endorsed her as the Democratic nominee. \n\nIn one anecdote, Harris recounted that Biden called her — moments before she walked on stage to debate Trump — to ask if she’d been badmouthing him to Democratic donors. She said the moment threw her off balance at a critical point in her bid for the White House.\n\nHarris also slammed Biden’s decision to stay in the 2024 presidential race for as long as he did.\n\n“‘It’s Joe and Jill’s decision.’ We all said that, like a mantra, as if we’d all been hypnotized,” Harris wrote, in an excerpt published by The Atlantic.\n\n“Was it grace, or was it recklessness? In retrospect, I think it was recklessness. The stakes were simply too high. This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition. It should have been more than a personal decision,” she continued.\n\nHarris’s memoir, 107 Days, will be released on Tuesday.","summary":"Jeff Zients reportedly testified that the former First Lady urged him to adjust Biden’s schedule so he could get more rest","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-memory-jill-white-house-decline-b2830207.html","image":"https://static.independent.co.uk/2025/09/19/21/38/GettyImages-1461459785.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/8biS5tHB-4VHSaSK0.mp4","publish_date":"2025-09-19 21:37:35","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.065},{"id":361934954,"title":"Kamala Harris mocked for cringe quoting of rap lyric in memoir opener","text":"Former Vice President Kamala Harris is being mocked for quoting a lyric from a Kendrick Lamar song in her upcoming memoir.\n\nHarris includes the cringeworthy quote at the front of in her soon-to-be-released book ‘107 days.’ The book provides an in-depth account of her perspective from her devastating defeat to Donald Trump.\n\n‘I got loyalty, got royalty inside my DNA…I was born like this,’ reads the quote attributed to Lamar’s 2017 rap song ‘DNA.’\n\nConservatives on social media slammed Harris for including the quote by claiming the decision reveals she is unrelatable to the public.\n\n‘Wow this incredibly reddit,’ wrote a popular ‘Lord of the Rings’ fan account named ‘The Middle-earth Mixer.’\n\n‘Isolated Lib elites have no ability to relate to people.’\n\nMeanwhile, conservative political consultant Ryan Girdusky wrote, ‘I mean... was she unable to find a Dr. Seuss quote?’\n\nAnother X user joked, ‘Recommend title: \"How I spent billions in 107 days, paid celebrities to endorse me, paid podcasts to endorse me, paid media figures to endorse me, asked media to edit my answers if they sound bad, or even requested entire interviews to be scrapped - but still got my ass kicked.\"’\n\nOther comments accused Harris of hiring a ghost writer to complete the book with one X user claiming, ‘This is indistinguishable from parody. She needs a new ghost writer.’\n\n‘This is almost parodic,’ wrote an individual named Phil. ‘It’s like the quotes you’d see from a less than impressive male high school senior in their year book.’\n\nHarris’ decision to include the rap song quote may be in reference to a passage in the book where the former vice president claims her ‘warmth and loyalty’ towards Biden was tested leading up to election day.\n\nShe claims that Biden called her minutes before the September debate with Trump accusing his vice president of bad mouthing him to ‘powerbrokers’ in Philadelphia.\n\n‘Why’s he asking that?’ Harris writes in the memoir.\n\nHarris noted she felt pressure from Biden to perform well in the debate against Trump by comparing it to a ‘prizefight.’\n\nHarris’ new memoir offers a peak behind the curtain of her national campaign to salvage Democratic hopes of retaining the White House in 2024. \n\nThe former vice president also unveils new criticism of Biden and his White House staff.","summary":"Kamala Harris is being mocked for quoting a lyric from a Kendrick Lamar song in her upcoming memoir.","url":"https://www.dailymail.co.uk/news/article-15115973/Kamalas-cringe-DNA-Kendrick-Lamar.html","image":"https://i.dailymail.co.uk/1s/2025/09/19/21/102295131-0-image-a-51_1758312887988.jpg","video":null,"publish_date":"2025-09-19 21:13:37","author":"Editor,Phillip Nieto","authors":["Editor","Phillip Nieto"],"language":"en","source_country":"gb","sentiment":-0.264},{"id":361948498,"title":"Judge throws out Trump's $15 billion lawsuit against New York Times","text":"A federal judge on Friday threw out U.S. President Donald Trump's $15 billion defamation lawsuit against the New York Times over its content, calling it a \"decidedly improper and impermissible\" effort to attack his adversaries.\n\nU.S. District Judge Steven Merryday said Trump violated a federal civil procedure rule by failing to offer a short and plain statement of why he should prevail over the Times, four of its reporters and the publisher Penguin Random House.\n\nHe faulted the president for instead packing his 85-page complaint with unnecessary statements lauding his successes and \"singular brilliance,\" attacking critics, and even defending his father.\n\n\"A complaint is not a public forum for vituperation and invective -- not a protected platform to rage against an adversary,\" wrote Merryday, an appointee of Republican former President George H.W. Bush.\n\nThe Tampa, Florida-based judge gave Trump 28 days to file an amended complaint \"in a professional and dignified manner\" of no more than 40 pages.\n\nA spokesman for Trump's legal team said in a statement: \"President Trump will continue to hold the Fake News accountable through this powerhouse lawsuit against the New York Times, its reporters, and Penguin Random House, in accordance with the judge's direction on logistics.\"\n\nIn a separate statement, a Times spokesperson said: \"We welcome the judge's quick ruling, which recognized that the complaint was a political document rather than a serious legal filing.\"\n\nPenguin Random House did not immediately respond to requests for comment.\n\nFriday's order is an unusual rebuke by a federal judge to a sitting president over decorum in the judicial process.\n\nTrump sued over three articles and a book by two of the Times reporters. He accused the defendants of defaming him prior to the 2024 presidential election in order to sabotage his campaign and disparage his reputation as a successful businessman.\n\nIn a four-page order, Merryday said plaintiffs like Trump are supposed to \"fairly, precisely, directly, soberly, and economically\" tell defendants in complaints why they are being sued.\n\nTrump's complaint said the defendants \"baselessly hate President Trump in a deranged way,\" and that their actions \"represent a new journalistic low for the hopelessly compromised and tarnished 'Gray Lady,'\" a nickname for the Times.\n\nIt also contended that the Times itself was \"deranged\" for endorsing Democrat Kamala Harris for president.\n\n\"A complaint is not a megaphone for public relations,\" the judge wrote. \"Although lawyers receive a modicum of expressive latitude in pleading the claim of a client, the complaint in this action extends far beyond the outer bound of that latitude.\"\n\n© Thomson Reuters 2025.","summary":"A federal judge on Friday threw out U.S. President Donald Trump's $15 billion defamation lawsuit against the New York Times over its content, calling it a &quot;decidedly improper…","url":"https://japantoday.com/category/world/judge-throws-out-trump%27s-15-billion-lawsuit-against-new-york-times-citing-improper-content","image":"https://media.japantoday.com/img/store/9e/01/d16e5bc6abba8a291e44e397799f7828eb8b/tag-reuters/_w1700.jpeg","video":null,"publish_date":"2025-09-19 20:55:02","author":"Japan Today Editor,Jonathan Stempel","authors":["Japan Today Editor","Jonathan Stempel"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.501},{"id":361922892,"title":"Charlie Kirk credited with helping Trump gain significant ground with young voters","text":"As conservatives reflect on the legacy of Turning Point USA founder Charlie Kirk ahead of his celebration of life in Arizona on Sunday, some Republicans credit him with helping President Donald Trump win over young voters in 2024. Former TPUSA staffer Anthony DeWitt explained that the grassroots element of Kirk’s work likely played a \"monumental\" role in \"energizing the youth to get out and vote in 2024.\" RED HATS AND CHANTS OF 'USA' MARK VIGIL HONORING SLAIN CONSERVATIVE LEADER CHARLIE KIRK: 'ACT' \"Charlie created something that finally lifted the voices and work of not only grassroots, but young people, people like myself who were just entering politics and gave us something that traditionally was only achieved by those who have had a lifetime in politics,\" DeWitt stated. \"Getting young people knocking doors, chasing ballots, getting signatures, signing up new voters, attending conferences — that was the key to winning the 2024 election.\" A Fox News voter analysis had Trump wooing 47% of voters aged 18-29, with former Vice President Kamala Harris narrowly winning the demographic with 51%. FROM GRIEF TO GROWTH: TURNING POINT USA BECOMES A RALLYING FORCE FOR GEN Z IN BATTLEGROUND ARIZONA In the battleground state of Michigan, the analysis found that Trump won the age group with 50%, compared to 48% for Harris. He also came close with 48% in Arizona, where TPUSA is headquartered, with 51% of those surveyed backing Harris. Trump ultimately ended up sweeping the battleground states, including Michigan and Arizona, winning 312 electoral votes and the popular vote. However, it is an 11% increase from the 36% of voters in the same age range in 2020, with former President Joe Biden carrying the demographic with 61%. 'SLEEPING GIANT' LIKELY WOKE UP FOR TURNING POINT USA AFTER CHARLIE KIRK'S ASSASSINATION Colin Reed, a Washington, D.C.-based Republican strategist, noted how Kirk plays a unique role in \"expanding the tent\" for the party. \"A generation ago, it would have been unthinkable for a Republican candidate to run nearly equal among younger voters against a Democratic standard-bearer who had every Hollywood and celebrity endorser under the sun, but that’s precisely what happened in 2024,\" Reed wrote to Fox News Digital, alluding to Harris’s star-studded, but short campaign after Biden dropped out in July. \"Charlie opened the doors for younger people to not only consider the conservative movement but embrace it and champion its principles as a ticket to prosperity and happiness.\" CLICK HERE TO GET THE FOX NEWS APP Those close to Kirk, including Turning Point Action’s leader Tyler Bowyer, dubbed 2026 the \"Charlie Kirk election\" at a vigil at Arizona State University Monday. \"2028 will be the Kirk-Vance election,\" he said, and the organization is expected to rally around Vice President JD Vance to be Trump’s successor.","summary":"Turning Point USA founder Charlie Kirk is credited with energizing young voters for Trump&apos;s 2024 victory, as Republicans gained ground with the 18-29 demographic nationwide.","url":"https://www.foxnews.com/politics/charlie-kirks-influence-likely-helped-youth-swing-trump-2024","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/charlie-kirk-trump-handshake.jpg","video":"https://www.foxnews.com/video/6379804869112","publish_date":"2025-09-19 20:54:22","author":"Cameron Arcand","authors":["Cameron Arcand"],"language":"en","category":"politics","source_country":"us","sentiment":0.045},{"id":361946706,"title":"The FCC Chair's Unprecedented, and Constitutionally Problematic, Response to Jimmy Kimmel","text":"On Monday Jimmy Kimmel said:\n\nWe hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it. In between the finger-pointing, there was, uh, grieving on Friday − the White House flew the flags at half-staff, which got some criticism, but on a human level, you can see how hard the president is taking this. Yes, he's at the fourth stage of grief: construction. Demolition, construction. This is not how an adult grieves the murder of someone he called a friend; this is how a four-year-old mourns a goldfish, OK? And it didn't just happen once. And then we installed the most beautiful chandelier. Responses you wouldn't believe. Who thinks like that, and why are we building a $200 million chandelier in the White House? Is it possible that he's doing it intentionally so he can be bad about that instead of the Jeffrey Epstein list?\n\nYesterday, FCC Chair Brendan Carr said:\n\nPublic interest means you can't be running a narrow partisan circus and still meeting your public interest obligations. That means you can't be engaging in a pattern of news distortion.\nIt appears to be some of the sickest conduct possible. In some quarters, there's a very concerted effort to try to lie to the American people about the nature of one of the most significant, newsworthy, public interest acts that we've seen in a long time.\nFrankly, when you see stuff like this — I mean, we can do this the easy way or the hard way. These companies can find ways to change conduct and take action, frankly, on Kimmel, or there's going to be additional work for the F.C.C. ahead.\n\nA few hours after Carr's remarks, ABC indefinitely suspended Kimmel's show.\n\nAnd this evening, Donald Trump said of broadcasters:\n\nThey give me only bad publicity or press. I mean, they're getting a license. I would think maybe their license should be taken away.\n\nWhat Is the FCC's Statutory Authority?\n\n47 U.S.C. 301 grants the FCC control over the radio spectrum and directs the FCC to grant licenses to use specified frequencies for a specified number of years. So wireless broadband providers, satellite television providers, local broadcast stations, etc. must obtain FCC licenses. Licenses are generally very valuable (broadband auctions for initial licenses have yielded more than $200 billion to the Treasury), and a licensee really wants to be able to renew its license and to sell it to someone else who will then be able to renew it (otherwise, the buyer would not pay very much). This creates two principal levers the FCC uses to control licensees.\n\nFirst, under 47 U.S.C. 310 the FCC must approve any proposed transfer of a license as long as it finds that \"the public interest, convenience, and necessity will be served thereby.\" This was the source of the FCC's leverage with respect to the CBS/Skydance transaction: CBS wanted to transfer the licenses for the local TV stations it owned, and the FCC had to approve. As readers know, the FCC did approve that transfer after (in the words of the FCC press release) Skydance committed not to have any DEI policies, to \"ensur[e] that the new company's array of news and entertainment programming will embody a diversity of viewpoints across the political and ideological spectrum,\" and to invest new capital. And of course the FCC approved the transfer shortly after Stephen Colbert's show was cancelled – at a minimum creating an appearance problem (or an opportunity, for those who want future transferees to fear the FCC).\n\nThe second key source of authority is 47 U.S.C. 309, which specifies that the FCC can similarly deny renewal of a license if the FCC does not find that the licensee \"has served the public interest, convenience, and necessity.\"\n\nIs This Consistent with the First Amendment?\n\nAt this point a key question may occur to you: how can it be consistent with the First Amendment for any FCC renewal or transfer decisions to turn in any way on the content, much less the viewpoint, of a licensee's speech? Content-based regulation of cable television providers (whose systems often require rights-of-way from a government) or websites that transmit content via wireless frequencies would be subject to strict scrutiny, which is nearly always fatal, and viewpoint-based regulation is always invalidated. Indeed, even without the use of any rights-of-way or frequencies (which the Court never mentioned in its cable and internet cases), the Court would apply strict scrutiny. (And by the way, the Court has invalidated the regulation of knowingly false speech -- indeed, particularly offensive false speech, in the form of lying about receiving military medals.)\n\nSo how can the FCC look at content under sections 309 and 310?\n\nThe answer in the case law has been that in FCC v. Pacifica Foundation the Supreme Court held that broadcasting is subject to less rigorous First Amendment scrutiny primarily because it is uniquely pervasive, and secondarily because it is uniquely accessible to children. And in Red Lion Broadcasting Co. v. FCC, the Court allowed mandates that broadcasters host speech the government deemed valuable, based largely on spectrum scarcity. (Red Lion does not suggest that scarcity justifies restricting harmful speech, but rather justifies requiring broadcasters to air valuable speech.)\n\nDenying a renewal or transfer based on viewpoint goes beyond Pacifica and Red Lion, and there is a reasonable argument that neither decision extends that far. Even if they did, it would not follow that the Supreme Court would permit such actions.\n\nPacifica and Red Lion have been subject to persuasive criticism for years. As to Pacifica, broadcasting is just another medium of communication. The government powerfully argued in cases involving cable television, the internet, and telephones, (all of which Congress chose to regulate) that those other media are just as pervasive, and just as available to children, as broadcasting, and in each case the Supreme Court rejected the government's argument and invalidated the regulation under strict scrutiny, making it harder and harder to defend Pacifica.\n\nRegarding Red Lion, to quote from my Internet & Telecommunications Regulation casebook, \"almost all resources —e.g., wires, labor, steel, land, and investment capital —are scarce in that (a) if given away at no charge people would request more of them than is available and (b) if we could create more of them, that additional increment could also be put to productive use.\" Indeed, in some respects radio frequencies are less scarce than land: the range of usable frequencies has increased more than 10-fold in the last 50 years – as if we had discovered 10 new usable Earths. And the Court declined the opportunity to apply Red Lion in later cases like Miami Herald v. Tornillo (newspapers) and Moody v. NetChoice (social media), making it harder and harder to defend Red Lion.\n\nAs Justice Thomas noted in FCC v. Fox,\n\nRed Lion and Pacifica were unconvincing when they were issued, and the passage of time has only increased doubt regarding their continued validity. The text of the First Amendment makes no distinctions among print, broadcast, and cable media, but we have done so in these cases.[Internal quotation marks omitted.]\n\nFCC commissioners and staff are aware of the First Amendment problems with content-based FCC decisionmaking, and the broader governance concerns raised when government wields so much power. Indeed, the FCC repealed the Fairness Doctrine (whose legal hook was the threat of non-renewal) and later (after much prodding from the D.C. Circuit) the Personal Attack and Political Editorial rules (which were similarly predicated on the threat of non-renewal) on First Amendment grounds. And see the final block quote below. Many people (myself included) expect that if the Supreme Court squarely confronted Pacifica and/or Red Lion, it would overrule them.\n\nBut the costs for a licensee to challenge a non-renewal or transfer denial are very high. The Court has made it clear that only it can overrule its cases, so a licensee would face months if not years of delay on a transfer (often fatal to transfer deals) or on a renewal, with no guarantee of success. The obvious incentive is for the private party to do what the government wants. That is why Trump had leverage over ABC, leading it to settle a very weak lawsuit. That's how things work in lots of countries we don't want to emulate.\n\nWould This Be an Ordinary Application of FCC Standards?\n\nFirst things first: Trump said the quiet part out loud tonight – he thinks that broadcasters have been too critical of him and thus maybe their licenses should be taken away. That has never happened, and here's hoping it never will.\n\nNow to Carr's stated focus – news distortion. First, it has been applied only to news shows (which of course Kimmel's show is not). Second, the FCC has created guardrails around it that seem to exclude Kimmel's monologue. As the FCC stated in rejecting a news distortion complaint against a Fox television station in 2007:\n\nIn evaluating whether an allegation of news distortion impacts the licensee's ability to serve the public interest, the Commission analyzes both the \"substantiality\" and \"materiality\" of the allegation. An allegation is \"material\" only if the licensee itself is said to have participated in, directed, or at least acquiesced in a pattern of news distortion. An allegation of news distortion is \"substantial\" if it meets two conditions: it is deliberately intended to slant or mislead; and it involves a significant event and not merely a minor or incidental aspect of the news report. It is sufficient for a petitioner to raise a \"substantial and material question of fact\" as to intent, and the Commission cannot require a petitioner to demonstrate \"intent.\" However, the Commission determines in the first instance whether the evidence submitted raises a substantial question of fact.\nSection 326 of the Act prohibits the Commission from censoring radio communications, and the First Amendment to the Constitution strictly limits the Commission's authority to interfere with the programming decisions of licensees. In light of these limitations, and because journalistic or editorial discretion in the presentation of news and public information is the core concept of the First Amendment's Free Press guarantee, \"the Commission's policy makes its investigation of an allegation of news distortion 'extremely limited in scope.'\" In showing an intent to distort, \"[i]t is not enough to dispute the accuracy of a news report…or to question the legitimate editorial decisions of the broadcaster.\" Allegations of deliberate distortion must be supported by extrinsic evidence \"such as written or oral instructions from station management, outtakes, or evidence of bribery.\" With respect to a report's accuracy in particular, the Commission has stated that it possesses \"neither the expertise nor the desire to look over the shoulder of broadcast journalists and inquire why a particular piece of information was reported or not reported.\" To do otherwise \"would involve the Commission deeply and improperly in the journalistic functions of broadcasters.\"\n\nIn the Matter of TVT License, Inc., 22 F.C.C. Rcd. 13591, 13592 (2007).\n\nThird, the FCC has found distortion in only eight cases since 1969, and just once since 1982. Fourth, in none of those cases did the FCC revoke the license based on the distortion. A representative example involved a \"letter of admonishment\" that had no impact on the licensee (and proved to have no impact on its future renewals) despite the FCC\n\nfinding \"repeated instances of deceptive programming broadcast by the station\" in five different news programs over a two-year period. Deceptions included staff members concocting letters and phone calls that were presented on the air as having been issued from viewers, supposedly spontaneous questions by members of studio audiences which were prepared by staff members and fictitious interviews with various people misidentified as members of the public.\n\nThe only finding of news distortion since 1982 was a similar letter of admonishment in 1993 for NBC\n\nstaging a segment of a \"Dateline NBC\" report on unsafe gas tanks in General Motors trucks. The report showed video of what it called an \"unscientific\" test crash in which a GM truck exploded into flames after being hit from the side. GM's investigation found that NBC producers had rigged the test by attaching incendiary devices to the truck's gas tank.\n\nThe most recent attempts at news distortions were A) a claim, piggybacking on the state court determination in Dominion Voting System's suit against Fox News, that a Fox television station disseminated false statements about Dominion, and B) claims that CBS distorted the news by airing different footage of Kamala Harris's response to the same question on 60 Minutes and Face the Nation. The FCC rejected all these challenges shortly before Trump took office without holding any hearings, as it should have. It began all the orders by stating:\n\nThe freedom of speech and the press is enshrined in the First Amendment of the United States Constitution, and is necessary to promote the vigorous dialogue necessary in a representative democracy. When the government — including Congress, the Courts, and the Executive Branch (and States and local government) — seeks to curtail the freedom of expression on \"\"matters of valid public interest,\" doing so implicates the very heart of speech that the First Amendment is meant to protect. Accordingly, for nearly a century since the Commission's inception in 1934, the Communications Act has expressly prohibited the Commission from engaging in the \"power of censorship,\" or issuing regulations or conditions that \"interfere with the right of free speech.\" It has instead plainly recognized that \"[b]roadcasters—not the FCC or any other government agency—are responsible for selecting the material they air\" and that \"our role in overseeing program content is very limited.\" Moreover, \"the Commission does not—and cannot and will not—act as a self-appointed, free-roving arbiter of truth in journalism.\"\n\nIn the Matter of Preserving the First Amendment, Application of Fox Television Stations, LLC for Renewal of License of WTXF-TV, Philadelphia, Pa (Jan. 16, 2025).\n\n(By the way, that last quotation was from a 2020 order rejecting a challenge to the airing of allegedly false statements about Covid-19 by President Trump and others.)\n\nThe only remotely analogous FCC action was Carr's decision, upon becoming chair, to reopen the challenges to CBS's handling of Kamala Harris's answers (but not to Fox's statements about Dominion). But it would take chutzpah for Carr to claim that his Kimmel comments are not unprecedented simply because he did something roughly analogous nine months ago.\n\nThe bottom line: treating Kimmel's statement as news distortion would be unprecedented. Indeed, that understates the point. The idea that his statement resembles anything the FCC has punished as news distortion is somewhere between strained and frivolous.\n\n[Edit to make explicit that the first two limits on news distortion knock out application to Kimmel's monologue.]","summary":"And Trump's much more extreme one. [EV writes: I bumped this post from yesterday, because it struck me as especially timely and substantively valuable.]","url":"https://reason.com/volokh/2025/09/19/the-fcc-chairs-unprecedented-and-constitutionally-problematic-response-to-jimmy-kimmel/","image":"https://d2eehagpk5cl65.cloudfront.net/wp-content/themes/reason-dot-com-theme/dist/./miss-800-x-600_84444db9.png","video":null,"publish_date":"2025-09-19 20:35:03","author":"Stuart Benjamin","authors":["Stuart Benjamin"],"language":"en","category":"politics","source_country":"US","sentiment":-0.243},{"id":361908846,"title":"Gov. Josh Shapiro says Trump's threats to revoke TV licenses are an attempt to 'stifle dissent'","text":"Pennsylvania Gov. Josh Shapiro on Friday accused the Trump administration of “trying to stifle dissent” after ABC removed late-night comedy host Jimmy Kimmel from the airwaves this week following comments from a federal regulator. “Without question, they’re trying to stifle dissent,” Shapiro, a Democrat, told NBC News’ “Meet the Press” moderator Kristen Welker, also characterizing the move as “extremely dangerous.” Shapiro’s comments come after President Donald Trump suggested that the television networks were “97% against” him and that those who give him “bad publicity” should have their federal broadcasting licenses revoked during a Thursday night gaggle aboard Air Force One. “And if they’re 97% against, they give me only bad publicity, press,” Trump said. “I mean, they’re getting a license. I would think maybe their license should be taken away.” Ultimately, the president said the decision would be up to Federal Communications Commission Chair Brendan Carr. Shapiro on Friday said that his reaction to the Kimmel suspension was “fear” and “worry for our country.” “Our foundational principle in this country, which has roots in the Commonwealth of Pennsylvania — William Penn settled here in the 1680s — is about freedom of expression, freedom of speech. And to see that being undermined by the long arm of the federal government is extremely dangerous,” the Pennsylvania governor said. He added that, “whether you agree with Jimmy Kimmel or not, whether you found him funny or not, to fire someone because he told a joke about the president repeatedly, and the president didn’t like it, to fire him because he was inartful in his words in the wake of the killing of Charlie Kirk ... that is dangerous.” Kimmel’s suspension comes as the administration has ratcheted up threats against media organizations and calls to investigate groups it deems to be part of the “radical left” in the wake of the conservative activist’s assassination. The president and his allies have an extensive history of attacking the media. Most recently, on Friday, a judge threw out a recent lawsuit Trump had filed against The New York Times and four of its reporters, accusing them of defamation. Last year, Trump sued ABC News, accusing anchor George Stephanopoulos of making “false and disparaging” statements about him. ABC agreed to pay $15 million to a presidential foundation for Trump as part of the settlement in that case. And earlier this year, Paramount, the owner of CBS News, agreed to pay $16 million to settle a lawsuit from Trump that accused the network of deceptively editing an interview of his former rival, then-Vice President Kamala Harris. ABC announced Wednesday that Kimmel, the host of the daily late-night program, “Jimmy Kimmel Live!,” would not be appearing on the network “indefinitely“ following commentary he made on air about the man accused in the fatal shooting. “The MAGA gang [is] desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,” Kimmel said Monday about Tyler Robinson, who is accused of fatally shooting Kirk at an event at Utah Valley University last week. Robinson was charged this week with aggravated murder, among other counts. Bullet casings left at the crime scene referenced fascism, obscure internet memes and video games. Robinson’s mother told investigators that over the last year, her son had become “more political and had started to lean more to the left, becoming more pro-gay and trans rights oriented.” She also said that Robinson had begun to date his roommate, who “was transitioning genders.” Carr criticized Kimmel’s comments from earlier in the week in the wake of Kirk’s assassination during an interview Wednesday with a conservative commentator, calling Kimmel’s remarks “truly sick.” He added that, “This is a very, very serious issue right now for Disney,” ABC’s parent company. “The FCC could make a strong argument that this is sort of an intentional effort to mislead the American people about a very core fundamental fact, a very important matter,” Carr added in the interview. Carr joined Fox News on Thursday, saying that he didn’t think the Kimmel suspension “is the last shoe to drop.” “I don’t think this is the last shoe to drop. This is a massive shift that’s taking place in the media ecosystem. I think the consequences are going to continue to flow,” he said, suggesting that if broadcasters don’t like being held “accountable ... they can turn their license in to the FCC.” In the days following ABC’s announcement, officials and activists on both sides of the political spectrum raised concerns that the network was bowing down to threats from a member of the federal government, saying that it raised concerns about free speech and free expression. Asked by Welker whether he believed the Trump administration was trying to stifle dissent, Shapiro said yes, “without question.” “The president, in his own words ... made clear he wants to look at the licenses and the certifications for particular media outlets if all they’re doing is attacking Trump,” Shapiro added. On Friday, Shapiro said that free speech is “the bedrock” of the U.S. “I mean, listen, the bedrock of our free society is the freedom of speech, the freedom for someone like you to ask me questions and opine about my work, whether I agree with you or not, whether I like what you report or not,” the governor told Welker. “You’ve got the freedom and the right to be able to do that, and that is something that protects all of us, all of us and it is dangerous what this president is engaged in.”","summary":"Gov. Josh Shapiro accused Trump of “trying to stifle dissent” after ABC removed late-night comedy host Jimmy Kimmel from the air following comments from the FCC chair.","url":"https://www.nbcnews.com/politics/donald-trump/josh-shapiro-trump-kimmel-revoke-network-licenses-free-speech-rcna232366","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-04/250422-josh-shapiro-2024-ac-644p-d21e46.jpg","video":null,"publish_date":"2025-09-19 20:00:41","author":"Alexandra Marquez","authors":["Alexandra Marquez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.228},{"id":361902652,"title":"Donald Trump's lawsuit against New York Times is THROWN OUT by judge who branded it too long and too petty","text":"Donald Trump's $15billion lawsuit against The New York Times has been thrown out just four days after it was filed - by a judge who said the complaint was too long and too petty.\n\nThe President now has 28 days to refile the defamation claim after Judge Steven D. Merryday of the US District Court for the Middle District of Florida said the 85-page document was 'florid and enervating.'\n\nAny future filings must be limited to 40 pages, The New York Times reported.\n\nA spokesman for the newspaper told the Daily Mail in a statement: 'We welcome the judge’s quick ruling, which recognized that the complaint was a political document rather than a serious legal filing.'\n\nJudge Merryday - who was appointed by President George H.W. Bush - blasted the president for waiting until the 80th page of his lawsuit to formally accuse the paper of defamation. \n\nHe also suggested Trump had used the filing as a soapbox to air grievances against the paper of record, arguing: 'A complaint is not a public forum for vituperation and invective - not a protected platform to rage against an adversary.'\n\nThe jurist added: 'A complaint is not a megaphone for public relations or a podium for a passionate oration at a political rally or the functional equivalent of the Hyde Park Speakers’ Corner.' \n\nHe also told Trump that, despite being president, plaintiffs are supposed to 'fairly, precisely, directly, soberly, and economically' tell defendants in complaints why they are being sued. \n\nTrump sued the Times this week over articles he claimed cast doubts on his reputation in the run-up to the 2024 presidential election. \n\nThe paper said after the initial filing that it intended to fight the suit.\n\nFour Times reporters and publisher Penguin Random House were also named as defendants.\n\nThe tossed complaint had revolved around three articles and a book by two of the reporters.\n\nOne of the articles, penned in October of last year, was singled out for claiming Trump 'got an early start learning how to cut corners' after knowingly borrowing a friend’s dress jacket with a dozen medals to wear for his yearbook photo while attedning New York Military Academy as a boy.\n\nTimes White House Correspondent Peter Baker wrote Trump was 'in effect appropriating medals that he did not win himself' with the move. \n\nA spokesperson for Trump said he will 'continue to hold the Fake News accountable through this powerhouse lawsuit.'\n\nWhether or not the suit will be refiled remains unclear. \n\nTrump has repeatedly used the courts against media companies since his second presidential election win last year.\n\nHe has sued The Wall Street Journal for publishing a seedy birthday drawing the paper accused him of sending to late pedophile financier Jeffrey Epstein, and also secured $16 million settlements from CBS and ABC after suing both stations.\n\nThe CBS settlement was paid out after the president accused the network's flagship newsmagazine 60 Minutes of deceptively editing an interview with his 2024 rival Kamala Harris.\n\nABC was forced to hand over the eight-figure sum after Good Morning America host George Stephanopoulos incorrectly stated the president had been found civilly-liable for the rape of E. Jean Carroll following a court cast in 2023.\n\nTrump had actually been found civilly-liable for the sexual abuse of Carroll, during an incident in the changing room of NYC department store Bergdorf Goodman in the mid '90s. \n\nHe has 28 days to refile the Times suit.","summary":"The president's suit has hit an early roadblock.","url":"https://www.dailymail.co.uk/media/article-15115721/Donald-Trump-new-york-times-lawsuit-thrown-out.html","image":"https://i.dailymail.co.uk/1s/2025/09/19/18/102287815-0-image-a-9_1758303813466.jpg","video":null,"publish_date":"2025-09-19 19:52:45","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.352},{"id":361919270,"title":"Olivia Dunne Bullied In A Bathroom, Hillary Clinton Is Too Dumb To See It & Apple's MLB Girl Shows Off Her Tan","text":"While the Libs were all busy making Jimmy Kimmel their new Rosa Parks, us sane folks scooted on by to another Friday. Another weekend. Through another week. And now, we're here – and we've won. AGAIN. It's over. Too late, Libs! You let us get to another college football/NFL weekend, and there is nothing you can do about it. Sit back, be quiet, and let us take it from here. Welcome to a Friday Nightcaps – the one where Olivia Dunne stands up to a couple bathroom bullies. That's right. Mean girls in real life. You'll see. What else? I've got the best of the rest from a … weird … week of #content, Apple TV's Tricia Whitaker is ready for the MLB postseason, and did anyone else catch Amazon Prime's wild broadcast decision late in last night's game? Never seen anything like it. Even Herbstreit's dog was confused! Grab you a crappy beer, pour it out for the crappy Dolphins, get something better, say Happy Birthday to Jimmy Fallon … and THEN, settle in for a Friday 'Cap! Fallon did the impossible last night Another day, another Jimmy batting leadoff. This time, though, it's the better of the two! Credit where it's due – I thought Jimmy Fallon, who turns 51 today, did the best out of all the insufferable late night hosts last night in their first show in the post-Kimmel era. I've always liked Jimmy Fallon. He's the best of the bunch, by far, and is the closest thing left to an actual late-night host. Steers pretty clear of heavy politics, doesn't virtue-signal. Just sort of keeps his head down, stays out of harm's way, and hopes to come out in one piece. While Jon Stewart inexplicably called an emergency show last night – as if the world was just pining for Jon's opinion – and Stephen Colbert nearly cried over Kimmel's benching, Jimmy Fallon managed to do something halfway funny. It's a low bar for late-night in 2025, but Jimmy cleared it … by a lot! Better week of #content! See? Not bad! I thought it was funny. And smart. And creative. Those are three words I certainly would not use to describe the state of late-night TV in 2025. Like I said, I've never hated Fallon. Frankly, I'm always confused when Trump lumps him in with Colbert and Kimmel. He's nowhere NEAR those two lunatics. Jimmy would much rather make music videos with Justin Timberlake than, say, lie to his audience about a cold-blooded assassin and then refuse to retract it even when his bosses ask him to. Weird that he's still on the air today, while others are either A) benched, or B) in their final lameduck season. Odd how that works. As for Stewart … he was insufferable last night and was his usual unfunny self. Shocking, I know. But hey! He gets the leadoff spot in today's #content portion of class: Tyreek, Prime, Hillary & Tricia! Solid work all around. Feel like we're getting back in a groove. Much better week. Couple thoughts … 1. Livvy Dunne in the middle of a shit-talking sandwich? What are the odds?! Also, because I assume most of you will ask, chopped is what the Gen-Zers call you if they think you're fake-hot online, but ugly in real life. If Olivia Dune is chopped, we are COOKED as a country. 2. Dolphins last night? Predictably miserable. Sure, they did just enough to hang around, which made it so much worse. Tua threw his weekly death pick. Special teams committed their weekly death penalty. Tyreek (we'll get to him a minute) dropped his usual ball. At least we didn't embarrass ourselves in primetime again. There's that. 3. Stephen A. Smith at +1200 to replace Kimmel feels like the move here. He's been aiming for a late-night seat for years now, and he's far more balanced than Kimmel. That's not saying much, but it's where we are. 4. That Kamala Harris tweet? Hilarious. The lefties are so silly. She's one of many talking out of their ass right now. Hillary Clinton is another. Let's rapid-fire this final class of the week into a big Friday night! Hillary! You sly dog. You didn't think we'd forget, did you? A prominent democrat posting about free speech, while also disabling comments, is so peak liberal it hurts. It's amazing, really. They don't see it. They don't get it. They never will. They truly are the gift that never stops giving. Next? Let's jump back into last night's miserable game for just a second, and check in with the worst interception of the night. And I ain't talking about Tua! Did anyone else notice that? What was that? This, by the way, has nothing to do with the seriousness of the matter, obviously. It's serious stuff, and I'm not a huge Tyreek Hill fan. I'll just leave it at that. But, that was COMPLETELY out of the blue, and completely unnecessary. Again, it had NOTHING to do with the game. They hadn't talked about it once. Did they have some quota they had to meet before the clock hit all zeroes? To come back from a commercial break and just throw the camera on Tyreek Hill while Kaylee Hartung blasts him for 30 seconds was a … choice. An odd one. This wasn't a blowout game. This wasn't pregame. This was with seven minutes to go in the fourth quarter of a 28-21 game! \"Thank you, Kaylee … he's no stranger to off-the-field stuff.\" Thanks, Al! Appreciate that insight. Kirk Herbstreit wanted NOTHING to do with any of it. He immediately just locked back into the kickoff and started drawing up plays for Tua and the offense on the ensuing drive. He steered clear. Smart man. Wild stuff. OK, that's it for today – and this week. Good bounce back week. Let's keep the momentum up as we head into another weekend. The Red Sox may be folding like a cheap tent, but at least we still have Apple TV MLB girl, Tricia Whitaker. Take us home, Trish! OutKick Nightcaps is a daily column set to run Monday through Friday at 4 p.m. (roughly, we’re not robots). You think Olivia Dunne is chopped? Email me at Zach.Dean@OutKick.com.","summary":"","url":"https://www.outkick.com/culture/olivia-dunne-bullied-bathroom-hillary-clinton-too-dumb-see-apples-mlb-girl-shows-off-her-tan","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/09/olivia-dunne.jpg","video":null,"publish_date":"2025-09-19 19:32:28","author":"Zach Dean","authors":["Zach Dean"],"language":"en","source_country":"us","sentiment":-0.251},{"id":361937386,"title":"Trump’s New York Times lawsuit gets thrown out for its ridiculousness","text":"President Donald Trump started out the week suing The New York Times for defamation via the most hilariously overwrought complaint imaginable. \n\nNow, in a neat bit of symmetry, Trump’s week has ended with the judge throwing out that complaint entirely because, basically, it sucked. No, really. \n\nYou may recall that Trump’s complaint was not really a legal filing but instead more of a meandering trip through all of Trump’s grievances, including not getting enough credit for his role in “The Apprentice” and yelling that his 2024 election win was “the greatest personal and political achievement in American history.” \n\nThere were also illustrations! The 2024 electoral map, a screenshot of the Times’ endorsement of former Vice President Kamala Harris, and what looks to be the DVD cover for “The Apprentice.” You know, legal stuff! \n\nWhat did all of this nonsense have to do with a claim that the Times had defamed Trump? Who can say, really? \n\nIt turns out that the judge in the case, George H.W. Bush appointee Steven Merryday, also thought this was nonsense, so he threw the complaint out for violating Rule 8 of the Federal Rules of Civil Procedure. That rule requires complaints filed in federal court to contain “a short and plain statement of the claim showing that the pleader is entitled to relief.”\n\nJudges are allowed to dismiss complaints sua sponte—Latin for “of one’s own accord”—if they don’t meet that standard. This does happen with pro se litigants, as sometimes people who are not represented by lawyers end up filing a complaint that is a confused mishmash of irrelevant facts or things that aren’t legally actionable. \n\nSo, when someone files an 85-page complaint alleging that the municipal meter reader is coming in while they are asleep and stealing their teeth from inside their skull, the judge can throw out the complaint rather than requiring some sort of response from the other side.\n\nHowever, for people who have legal representation in federal court, it’s vanishingly rare to have the judge throw the complaint out entirely. For this to happen here, to the president of the United States and his handpicked legal representation, is mindblowing. \n\nJust to head off at the pass any whining from conservatives that Merryday ruled this way because he is a Soros plant or something, just know that he is the judge who, during the pandemic, blocked the Navy from reassigning an anti-vaxx commander, resulting in the Navy being unable to deploy a warship, because of religious freedom. \n\nBut you can tell that Merryday is already exhausted by the stupidity of this case and Trump’s pleadings. Here’s Merryday on what it was like to slog through Trump’s absolutely irrelevant discussion of his feelings about the history of The New York Times: \n\nThe reader of the complaint must labor through allegations, such as “a new journalistic low for the hopelessly compromised and tarnished 'Gray Lady.'\" The reader must endure an allegation of \"the desperate need to defame with a partisan spear rather than report with an authentic looking glass\" and an allegation that \"the false narrative about 'The Apprentice' was just the tip of Defendants' melting iceberg of falsehoods.”\n\nMelting … iceberg of falsehoods? What does that even mean?\n\nMerryday was as confused as the rest of us as to why we all had to hear about “The Apprentice”:\n\nSimilarly, in one of many, often repetitive, and laudatory (toward President Trump) but superfluous allegations, the pleader states, “‘The Apprentice’ represented the cultural magnitude of President Trump’s singular brilliance, which captured the [Z]eitgeist of our time.”\n\nSuch brilliance, such zeitgeist, such irrelevance to a lawsuit against The New York Times for defamation. \n\nMerryday ended this by reminding Trump’s attorney that this is honestly basic stuff he should know:\n\nAs every lawyer knows (or is presumed to know), a complaint is not a public forum for vituperation and invective - not a protected platform to rage against an adversary. A complaint is not a megaphone for public relations or a podium for a passionate oration at a political rally or the functional equivalent of the Hyde Park Speakers' Corner.\n\nTrump gets 28 days to refile, but this time with a 40-page limit, or slightly less than half of the original complaint. Expect Trump’s pet attorney on this, Alejandro Brito, to try to just stuff the 85 pages into a 40-page bag and call it good, rather than taking the judge’s point that a recitation of Trump’s singular achievements and infinite grievances does not actually belong in court. \n\nSo, in just under a month, we’ll have a new complaint to laugh at. Gotta take our joy where we can find it these days.","summary":"President Donald Trump started out the week suing The New York Times for defamation via the most hilariously overwrought complaint imaginable. \n\n\n\nNow, in a neat bit of symmetry, Trump’s week has ended with the judge throwing out that complaint entirely because, basically, it sucked. No, really. \n\n\n\nYou may recall that Trump’s complaint was not really a legal filing but instead more of a meandering trip through all of Trump’s grievances, including not getting enough credit for his role in “The Apprentice” and yelling that his 2024 election win was “the greatest personal and political achievement in American history.” \n\n\n\n\n\n\n\nThere were also illustrations! The 2024 electoral map, a screenshot of the Times’ endorsement of former Vice President Kamala Harris, and what looks to be the DVD cover for “The Apprentice.” You know, legal stuff! \n\n\n\nWhat did all of this nonsense have to do with a claim that the Times had defamed Trump? Who can say, really? \n\n\n\nIt turns out that the judge in the case, George H.W. Bush ap","url":"https://www.dailykos.com/story/2025/9/19/2344452/-Trump-s-New-York-Times-lawsuit-gets-thrown-out-for-its-ridiculousness?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1476865/story_image/AP25254494657685.jpg?1757604355","video":null,"publish_date":"2025-09-19 19:30:10","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","source_country":"US","sentiment":-0.221},{"id":361899940,"title":"Kamala Harris' nod to Pete Buttigieg tees up potential 2028 run: DNC vice chair","text":"Former Vice President Kamala Harris' highly anticipated book recapping the 2024 election cycle gives a nod to former Secretary of Transportation Pete Buttigieg that could open doors to a potential 2028 presidential run, DNC Vice Chair Shasti Conrad told Fox News Digital in an exclusive interview. \"I think that Pete Buttigieg is one of our absolute best communicators, and you know, we're seeing that now. … I think her saying that, hopefully opens up a door for Pete to run again for president, and you know, we'll see where all that lands, and whether the country, you know, is ready to have him lead us,\" Conrad told Fox News Digital in a Thursday interview. Conrad, who underscored the book also sets up Harris for potentially launching another presidential run of her own, spoke to Fox News Digital ahead of the memoir's official Tuesday release. Only a handful of excerpts of the book, \"107 Days,\" so far have been released to the public, including The Atlantic most recently reporting that Harris initially wanted Buttigieg as her running mate before ultimately choosing Minnesota Gov. Tim Walz. Buttigieg \"would have been an ideal partner—if I were a straight white man,\" Harris wrote in the upcoming book, according to The Atlantic. KAMALA HARRIS COMPLAINS ABOUT 'IMPOSSIBLE' LACK OF SUPPORT FROM BIDEN'S COMMS TEAM, INNER CIRCLE \"But we were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. Part of me wanted to say, Screw it, let’s just do it. But knowing what was at stake, it was too big of a risk,\" the excerpt of the book continued, referring to tapping a gay man for the ticket as risky. \"And I think Pete also knew that—to our mutual sadness.\" HARRIS TAPS DEM EMAILS LISTS TO MARKET NEW BOOK, SPARKING PARTY NEUTRALITY CONCERNS Media pundits and D.C. insiders took issue with Walz serving as her running mate following the November 2024 election loss to President Donald Trump, as they argued popular Pennsylvania Democratic Gov. Josh Shapiro or Arizona Sen. Mark Kelly or others could have better served the campaign against Trump. For Conrad, the excerpt gives a nod to Buttigieg as a \"national leader\" who could throw his hat in the presidential contender ring in the next cycle. Buttigieg previously ran for president in 2020 before dropping out and endorsing President Joe Biden to succeed Trump in the Oval Office. \"We won't know whether if she had added Pete as her running mate, if that would have changed anything,\" Conrad said. \"I don't think it would have. But I think that it's a, you know, a good sort of nod towards Pete that he is a national leader that we should be looking towards as potentially being someone that could … that could win the nomination in 2028.\" The DNC vice chair, who is also chair of the Washington State Democratic Party, defended Walz as a \"happy warrior\" who \"could speak the language of the working class.\" KAMALA HARRIS TO PUBLISH BEHIND-THE-SCENES ACCOUNT OF FAILED 2024 CAMPAIGN \"There's a lot of calculations and amount of time about what we would need for a winning ticket,\" she said. \"Personally, I thought that, you know, Gov. Walz was a fantastic running mate for her. And when I met him last year, I told him, I jokingly said that we'd grown him in a lab, because he really felt to me like perfect for the moment.\" In response to the excerpts, Buttigieg told the media Thursday that he believes in \"giving Americans more credit\" than basing their votes on \"categories.\" NEW BOOK SHEDS LIGHT ON HARRIS DECISION TO PICK WALZ AS HER RUNNING MATE OVER SHAPIRO: 'WENT WITH HER GUT' \"My experience in politics has been that the way that you earn trust with voters is based mostly on what they think you’re going to do for their lives, not on categories,\" Buttigieg told Politico during a ribbon cutting ceremony at a Democratic Party office in Indiana. The book allows Harris to \"speak her truth\" on the wild 2024 election cycle, Conrad added, which includes excerpts acknowledging Biden \"got tired\" while on the campaign trail but denied any \"big conspiracy at the White House to hide Joe Biden’s infirmity.\" CLICK HERE TO GET THE FOX NEWS APP It's \"good that she's sort of getting an opportunity to tell her version of events and be able to be more fully herself,\" Conrad said. \"That's what I've been seeing from these excerpts. Is, you know, a real sense that she, I think, felt very managed and very kind of controlled for much of her time, both as VP and as a candidate. And this is sort of her opportunity to just … speak her truth.\" Fox News Digital reached out to representatives for Buttigieg and Harris, but did not immediately receive replies.","summary":"Kamala Harris&apos;s upcoming book highlighting Pete Buttigieg could tee him up as a potential 2028 presidential contender, DNC Vice Chair Shasti Conrad said.","url":"https://www.foxnews.com/politics/kamala-harris-book-tees-up-potential-2028-pete-buttigieg-run-dnc-vice-chair","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/buttigieg-harris.png","video":"https://www.foxnews.com/video/6379797605112","publish_date":"2025-09-19 19:25:23","author":"Emma Colton","authors":["Emma Colton"],"language":"en","source_country":"us","sentiment":-0.13},{"id":361930330,"title":"This Is What They Do At Fancy Parties Now!","text":"Star Seeker \n\n Skip to content\n\n Main Navigation \n\nRelationships\n\nControversy\n\n \n\n \n\nThis Is What They Do At Fancy Parties Now! \n\n@Area15Official knows how to throw an epic party!!!! Happy 5 year anniversary!\n\nRelated Posts\n\n EXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother! \n\n Kamala Harris Reveals That Donald Trump Is Very Different In Private! And Joe Biden Left Her Shaken When: \n\n Blake Lively Taught Me This! | Perez Hilton \n\n CLICK HERE TO COMMENT\n \n\nSep 19, 2025 12:20pm PDT\n\n \n\nEXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother!\n\n \n\nKamala Harris Reveals That Donald Trump Is Very Different In Private! And Joe Biden Left Her Shaken When:\n\n \n\nBlake Lively Taught Me This! | Perez Hilton\n\n Click To Watch\n\nFollow Perez\n\nTop Celebrities\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n View All Celebrities\n\nLatest Video\n \n\nThis Is What They Do At Fancy Parties Now!\n\n Galleries\n\n PerezTV\n\n \n\n \nAdvertising\n \n\n \n\n \n\n \n\nCopyright © 2025 PerezHilton.com | All Rights Reserved\n\nDo Not Sell My Personal Information","summary":"@Area15Official knows how to throw an epic party!!!! Happy 5 year anniversary! [...]\n\n\nRead More...\n\n\nThe post This Is What They Do At Fancy Parties Now! appeared first on Perez Hilton.","url":"https://perezhilton.com/this-is-what-they-do-at-fancy-parties-now/","image":"https://i3.ytimg.com/vi/64zUBqPTbR0/hqdefault.jpg","video":null,"publish_date":"2025-09-19 19:20:24","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","source_country":"us","sentiment":0.563},{"id":361930318,"title":"So Cute!","text":"Star Seeker \n\n Skip to content\n\n Main Navigation \n\nRelationships\n\nControversy\n\n \n\n \n\nSo Cute! \n\n@Area15Official knows how to throw an epic party!!!!\n\nHappy 5 year anniversary!\n\nRelated Posts\n\n This Is What They Do At Fancy Parties Now! \n\n EXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother! \n\n Kamala Harris Reveals That Donald Trump Is Very Different In Private! And Joe Biden Left Her Shaken When: \n\n Blake Lively Taught Me This! | Perez Hilton \n\n CLICK HERE TO COMMENT\n \n\nSep 19, 2025 11:44am PDT\n\nThis Is What They Do At Fancy Parties Now!\n\n \n\nEXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother!\n\n \n\nKamala Harris Reveals That Donald Trump Is Very Different In Private! And Joe Biden Left Her Shaken When:\n\n \n\nBlake Lively Taught Me This! | Perez Hilton\n\n Click To Watch\n\nFollow Perez\n\nTop Celebrities\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n View All Celebrities\n\nLatest Video\n \n\nThis Is What They Do At Fancy Parties Now!\n\n Galleries\n\n PerezTV\n\n \n\n \nAdvertising\n \n\n \n\n \n\n \n\nCopyright © 2025 PerezHilton.com | All Rights Reserved\n\nDo Not Sell My Personal Information","summary":"@Area15Official knows how to throw an epic party!!!! Happy 5 year anniversary! [...]\n\n\nRead More...\n\n\nThe post So Cute! appeared first on Perez Hilton.","url":"https://perezhilton.com/so-cute-8/","image":"https://i3.ytimg.com/vi/3RtL459URGc/hqdefault.jpg","video":null,"publish_date":"2025-09-19 18:44:10","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","category":"business","source_country":"us","sentiment":0.609},{"id":361898594,"title":"Judge tells Trump to amend New York Times lawsuit","text":"A federal judge has thrown out US President Donald Trump's defamation lawsuit against the New York Times over its content, calling it a \"decidedly improper and impermissible\" effort to attack his adversaries.\n\nUS District Judge Steven Merryday said Trump in his $US15 billion ($A23 billion) lawsuit violated a federal civil procedure rule by failing to offer a short and plain statement of why he should prevail over the NYT, four of its reporters and the publisher Penguin Random House.\n\nHe faulted the president for instead packing his 85-page complaint with unnecessary statements lauding his successes and \"singular brilliance,\" attacking critics and even defending his father.\n\n\"A complaint is not a public forum for vituperation and invective - not a protected platform to rage against an adversary,\" wrote Merryday, an appointee of Republican former president George HW Bush.\n\nThe lawsuit named a book and an article written by reporters that focuses on Trump's finances and his pre-presidency starring role in television's The Apprentice.\n\nThe Tampa, Florida-based judge gave Trump 28 days to file an amended complaint \"in a professional and dignified manner\" of no more than 40 pages.\n\nA spokesman for Trump's legal team said in a statement: \"President Trump will continue to hold the Fake News accountable through this powerhouse lawsuit against the New York Times, its reporters and Penguin Random House, in accordance with the judge's direction on logistics.\"\n\nIn a separate statement, a NYT spokesperson said: \"We welcome the judge's quick ruling, which recognised that the complaint was a political document rather than a serious legal filing.\"\n\nFriday's order is an unusual rebuke by a federal judge to a sitting president over decorum in the judicial process.\n\nTrump sued over three articles and a book by two of the NYT reporters.\n\nHe accused the defendants of defaming him prior to the 2024 presidential election in order to sabotage his campaign and disparage his reputation as a successful businessman.\n\nIn a four-page order, Merryday said plaintiffs like Trump are supposed to \"fairly, precisely, directly, soberly and economically\" tell defendants in complaints why they are being sued.\n\nTrump's complaint said the defendants \"baselessly hate President Trump in a deranged way,\" and that their actions \"represent a new journalistic low for the hopelessly compromised and tarnished 'Grey Lady',\" - a nickname for the Times.\n\nIt also contended that the NYT itself was \"deranged\" for endorsing Democrat Kamala Harris for president.\n\n\"A complaint is not a megaphone for public relations,\" the judge wrote.\n\n\"Although lawyers receive a modicum of expressive latitude in pleading the claim of a client, the complaint in this action extends far beyond the outer bound of that latitude.\"","summary":"A federal US judge has tossed out a $US15 billion defamation lawsuit filed by President Donald Trump against the New York Times.","url":"https://thewest.com.au/news/crime/judge-tells-trump-to-amend-new-york-times-lawsuit-c-20081087","image":"https://images.thewest.com.au/publication/C-20081087/ae8c3ce998ac365b947c01795195395200b56b0f-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-09-19 18:34:15","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.311},{"id":361912946,"title":"Voters were right to reject Kamala Harris’s contempt for them","text":"KAMALA HARRIS BOOK EXCERPTS SHOW DEMOCRATS STILL CLUELESS ON BORDER SECURITY\n\nHere is, in Harris’s words, why she did not choose Buttigieg: “But we were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. Part of me wanted to say, Screw it, let’s just do it. But knowing what was at stake, it was too big of a risk.” (Capitalization and emphasis original).\n\nThat is how Harris views her fellow Americans. She thinks that they are, like her, obsessed with identity categories and that they are, unlike her, bigots. She thinks voters were out there with checklists, marking off “black woman” and “Jewish husband” and preparing to give Harris a third strike if she added another minority group to the ticket. It goes back to the fact that Harris does not view her loss as any reflection on her. To her, it is a reflection on her short campaign (107 days) or the fact that voters are bigots who didn’t want a black woman on a diverse ticket to win the election.\n\nTHE MARTYRDOM OF KAMALA HARRIS\n\nThe fact remains that Kamala Harris did not lose the election because she is a black woman. She lost because she is Kamala Harris. She is unlikable, a poor communicator when working off-script, and far more left-wing than the country. She lost largely because voters recognize how much she disdains them. Harris is so deep in left-wing ideology that she truly believes voters would choose someone she thinks is bad for the country over her just because of her skin color and gender.\n\nIt is good that Harris and her inherently divisive worldview are not in the White House right now, especially given the state of political divisions in the country. The American people deserve better than someone who openly disdains them and boils them down to their basic identity groups, and voters made that clear last November.","summary":"Every day that passes makes one truth more clear: Kamala Harris disdains the American people, and it is undeniable that her loss in November was a good thing for the country. Harris’s book, 107 Days, details that Harris wanted to choose then-Transportation Secretary Pete Buttigieg as her running mate. The logic there is sound: Buttigieg is well-spoken, a [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/beltway-confidential/3815886/voters-were-right-to-reject-kamala-harriss-contempt-for-them/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/kamala-harris-excludes-blocks-media-press.webp?w=696","video":null,"publish_date":"2025-09-19 18:33:17","author":"Zachary Faria","authors":["Zachary Faria"],"language":"en","source_country":"us","sentiment":-0.295},{"id":361891408,"title":"Trump's New York Times lawsuit dismissed by federal judge","text":"Sept. 19 (UPI) -- A $15 billion lawsuit filed by President Donald Trump against the New York Times was rejected by a federal judge Friday.\n\nJudge Steven Merryday in Tampa, Fla., said Trump's lengthy lawsuit had too much praise for the president and \"superfluous allegations.\"\n\nMerryday said Trump's two civil allegations against the newspaper are only mentioned in the last few pages of the 85-page complaint. The other pages are full of complaints about his political enemies and boasting of his accomplishments.\n\nMerryday gave Trump 28 days to file another version of the lawsuit.\n\n\"As every lawyer knows (or is presumed to know), a complaint is not a public forum for vituperation and invective -- not a protected platform to rage against an adversary,\" Merryday wrote. \"A complaint is not a megaphone for public relations or a podium for a passionate oration at a political rally or the functional equivalent of the Hyde Park Speakers' Corner.\"\n\n\"This action will begin, will continue, and will end in accord with the rules of procedure and in a professional and dignified manner,\" the judge wrote.\n\nThe Times company wrote in a statement when Trump's lawsuit was filed that his complaint is \"without merit.\" Times executive editor Joe Kahn on Thursday said he was confident the paper would win.\n\n\"He's wrong on the facts; he's wrong on the law. And we'll fight it, and we'll win,\" Kahn said at an Axios Media Trends Live event Thursday. He said he did not see a scenario in which the Times would settle with the president.\n\nWhen he filed the suit on Monday, Trump took to his Truth Social platform to accuse the newspaper of being a \"virtual mouthpiece for the Radical Left Democratic Party,\" but did not give details of the alleged falsehoods.\n\nThe action for damages amounting to more than the full market capitalization of The New York Times Company, was, Trump said, motivated by an imperative to \"restore integrity to journalism.\"\n\n\"The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, NOW!\" Trump said.\n\nHe also criticized the paper's endorsement of Kamala Harris for president in the 2024 election.\n\nExperts have said it was another instance of a strategy of using lawsuits of doubtful legality to gag critical voices and suppress free speech.\n\nTrump has won multi-million dollar settlements from ABC News and CBS News, in December and July, respectively, prompting groups representing the journalism industry to warn that opting to settle out of court was only fueling Trump's \"lawfare.\"\n\nAddressing the Reporters & Editors 50th anniversary gala in New York on Monday, before the latest suit was filed, Times publisher AG Sulzberger warned of a growing so-called \"anti-press playbook\" trend among \"aspiring strongmen\" globally of leveraging civil law to exert financial pressure on media.","summary":"A $15 billion suit filed by President Donald Trump against the New York Times was rejected by a judge. He said the complaint had \"superfluous allegations.\"","url":"https://www.upi.com/Top_News/US/2025/09/19/trump-new-york-times-lawsuit-dismissed/2651758304309/","image":"https://cdnph.upi.com/sv/ph/og/upi/2651758304309/2025/1/d15b4a2d0fdff62323f9694d19c39a37/v1.5/Trumps-New-York-Times-lawsuit-dismissed-by-federal-judge.jpg","video":null,"publish_date":"2025-09-19 18:22:33","author":"Lisa Hornung","authors":["Lisa Hornung"],"language":"en","category":"politics","source_country":"US","sentiment":-0.086},{"id":361880848,"title":"Judge throws out Trump’s $15 billion lawsuit against New York Times, citing improper content","text":"NEW YORK, (Reuters) – A federal judge today threw out U.S. President Donald Trump’s $15 billion defamation lawsuit against the New York Times NYT.N over its content, calling it a “decidedly improper and impermissible” effort to attack his adversaries.\n\nU.S. District Judge Steven Merryday said Trump violated a federal civil procedure rule by failing to offer a short and plain statement of why he should prevail over the Times, four of its reporters and the publisher Penguin Random House.\n\nHe faulted the president for instead packing his 85-page complaint with unnecessary statements lauding his successes and “singular brilliance,” attacking critics, and even defending his father.\n\n“A complaint is not a public forum for vituperation and invective — not a protected platform to rage against an adversary,” wrote Merryday, an appointee of Republican former President George H.W. Bush.\n\nThe Tampa, Florida-based judge gave Trump 28 days to file an amended complaint “in a professional and dignified manner” of no more than 40 pages.\n\nA spokesman for Trump’s legal team said in a statement: “President Trump will continue to hold the Fake News accountable through this powerhouse lawsuit against the New York Times, its reporters, and Penguin Random House, in accordance with the judge’s direction on logistics.”\n\nIn a separate statement, a Times spokesperson said: “We welcome the judge’s quick ruling, which recognized that the complaint was a political document rather than a serious legal filing.”\n\nPenguin Random House did not immediately respond to requests for comment.\n\nFriday’s order is an unusual rebuke by a federal judge to a sitting president over decorum in the judicial process.\n\nTrump sued over three articles and a book by two of the Times reporters. He accused the defendants of defaming him prior to the 2024 presidential election in order to sabotage his campaign and disparage his reputation as a successful businessman.\n\nIn a four-page order, Merryday said plaintiffs like Trump are supposed to “fairly, precisely, directly, soberly, and economically” tell defendants in complaints why they are being sued.\n\nTrump’s complaint said the defendants “baselessly hate President Trump in a deranged way,” and that their actions “represent a new journalistic low for the hopelessly compromised and tarnished ‘Gray Lady,'” a nickname for the Times.\n\nIt also contended that the Times itself was “deranged” for endorsing Democrat Kamala Harris for president.\n\n“A complaint is not a megaphone for public relations,” the judge wrote. “Although lawyers receive a modicum of expressive latitude in pleading the claim of a client, the complaint in this action extends far beyond the outer bound of that latitude.”","summary":"NEW YORK, (Reuters) &#8211; A federal judge today threw out U.S. President Donald Trump&#8217;s $15 billion defamation lawsuit against the New York Times NYT.N \n\n\nThe article Judge throws out Trump&#8217;s $15 billion lawsuit against New York Times, citing improper content appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/09/19/news/world/judge-throws-out-trumps-15-billion-lawsuit-against-new-york-times-citing-improper-content/","image":"https://s1.stabroeknews.com/images/2025/09/nyt-getty-scaled.jpg","video":null,"publish_date":"2025-09-19 18:06:26","author":"Staff Editor","authors":["Staff Editor"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.476},{"id":361899002,"title":"Secret Service Ramps Up Security for Press Secretary Karoline Leavitt in Wake of Charlie Kirk Assassination, Assigned Her Own Detail","text":"With tension high throughout the country following the assassination of Charlie Kirk, White House press secretary Karoline Leavitt has been given her own Secret Service detail, RadarOnline.com can confirm. \n\nThe unusual move comes as Congress considers shelling out $58million in additional funding to increase security for officials in the executive and judicial branches.There are no known reports that would indicate a threat against Leavitt or a reason for her own detail, but high-profile figures from Washington D.C. to Hollywood and beyond have upped their security amid fears of similar attacks.\n\nKirk was sitting outdoors in a public plaza surrounded by college students when Tyler Robinson allegedly climbed to the roof of a neighboring building and shot him with a rifle.\n\nPer U.S. law, the president and vice president are legally required to accept protection from the Secret Service; however, it's not unusual for other high-profile politicos to be granted protection, including the White House chief of staff and national security adviser.\n\nAnd while rare, it's also not unprecedented for press secretaries to be given a detail. In 2018, then-press secretary Sarah Huckabee Sanders was assigned a team after an incident in which a Lexington, Virginia, restaurant refused to serve her.Taylor Swift's ConcernsOthers without the luxury of government-funded protection are taking their own safety steps. RadarOnline.com revealed global music superstar Taylor Swift has been the subject of \"legitimate threats\" in the wake of Kirk's murder, and extra security measures were put in place when the star recently attended fiancé Travis Kelce's NFL opener last weekend.\n\nVideo footage, which went viral, saw a bulletproof wall erected to guard Swift as she made her way to her seat for the game.\n\nThe secrecy behind her appearance sparked a frenzy among her fanbase, with many of her followers believing she was attempting to hide a baby bump.\n\nHowever, insiders claim there was a more sinister reason behind the wall.\n\nA source told the Daily Mail: \"They used the screen to keep her safe. They have used that screen before, but usually it is for the President or someone like that, not a celebrity. But this was a weird week.\"Kamala Harris' Security StrippedHowever, just as she heads out to promote her new memoir, former Vice President Kamala Harris has had her Secret Service detail suddenly dropped by the Trump administration. \n\nNow, those close to Harris are worried she is about to lose crucial access to any possible threat warnings just as she is preparing to expose herself to the nation, possibly putting her in danger.\n\nTypically, former VPs are given six months of Secret Service protection after leaving office, according to federal law. In Harris's case, that period ended on July 21.\n\nHowever, her detail was extended for an additional year after then-President Joe Biden signed a secret directive just before leaving office. It isn't clear why Biden signed the extension, or if he had any worrying intel, and once Trump was made aware of it, he canceled it.A Risky Book Tour?In a letter sent to Homeland Security Secretary Kristi Noem last month, the president wrote: \"You are hereby authorized to discontinue any security-related procedures previously authorized by Executive Memorandum, beyond those required by law, for the following individual, effective September 1, 2025: Former Vice President Kamala D. Harris.\"\n\nWith that date now come and gone, Harris has officially lost access to her around-the-clock security detail, along with advanced levels of threat analysis surrounding her emails, texts, and social media. \n\nFederal agents have also stopped protecting her home in Los Angeles.\n\nHarris's memoir, 107 Days, comes out Tuesday, September 23, and she leaves the next day for a cross-country promotional tour.","summary":"Congress is currently considering issuing an additional $58million in federal funding to increase security for officials.","url":"https://radaronline.com/p/secret-service-security-press-secretary-karoline-leavitt-charlie-kirk-assassination/","image":"https://media.radaronline.com/brand-img/fXzFO-N4Q/0x0/karoline-leavitt-charlie-kirk-1758302615761.jpg","video":null,"publish_date":"2025-09-19 18:00:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":0.107},{"id":361890536,"title":"Trump’s New York Times suit tossed for now as ‘inexcusably’ long","text":"A judge in Florida, for now, tossed out President Trump’s $15-billion defamation lawsuit against the New York Times days after it was filed, finding the president’s lawyers failed to follow court rules requiring “short, plain, direct” claims.\n\nU.S. District Judge Steven Merryday issued an order Friday concluding that Trump’s lawsuit “unmistakably and inexcusably” violated the court’s rules by featuring “repetitive,” “superfluous” and “florid” allegations and details, but said that his lawyers could refile an edited version within the next month.\n\nTrump filed a lawsuit in federal court in Tampa, Fla., earlier this week against the New York Times Co. and Penguin Random House LLC, accusing the paper of serving as a “mouthpiece” for the Democrats, pitting himself against one of the world’s oldest and most prominent news organizations.\n\nThe 85-page complaint featured language and information that Merryday said went far beyond the limits of what the court’s rules allow. Even under a “generous and lenient” interpretation, the judge wrote, the lawsuit was “decidedly improper and impermissible.” \n\nThe judge criticized what he called “laudatory” statements included in the lawsuit about Trump, such as his “historic” election win and the “cultural magnitude” of his “singular brilliance.” The judge also called out Trump’s recitations of his business and media track records, as well as negative language used to describe the Times’ coverage, such as “new journalistic low.”\n\nEven if all of the allegations in Trump’s lawsuit are true, the initial complaint wasn’t an appropriate place “for the tedious and burdensome aggregation of prospective evidence, for the rehearsal of tendentious arguments, or for the protracted recitation and explanation of legal authority,” he wrote.\n\nTrump’s personal attorneys handling the case did not immediately respond to a request for comment shortly after the order was released Friday afternoon. The New York Times also didn’t immediately respond to a message seeking comment.\n\nThe New York Times has denied wrongdoing and said in a statement in response to the lawsuit that it “has no merit.”\n\nMerryday gave Trump’s team 28 days to present a new version of the lawsuit, this time limiting it to 40 pages.\n\nAlleged defamation\n\nThe suit, which was filed Monday, claims Trump’s reputation was harmed by the 2024 book “Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success” and by three Times articles that were published in the run-up to the 2024 election. \n\nTrump claims the book and articles are part of a “decades-long pattern by the New York Times of intentional and malicious defamation” against him. The suit raises numerous disputes with the Times, including its “deranged” front-page endorsement of former Vice President Kamala Harris in the 2024 election, that are not included in his legal claims.\n\nThe case was one of Trump’s running battles with the press. In July, he sued Dow Jones & Co., News Corp. and Rupert Murdoch for libel, seeking $10 billion in damages after the Wall Street Journal published a story alleging that Trump once sent a suggestive birthday letter to Jeffrey Epstein. House Democrats later released the alleged birthday note as part of a trove of documents received by the House Oversight Committee.\n\nTrump reached a settlement with Paramount Global in July over a lawsuit tied to CBS news network’s “60 Minutes” interview with then-Vice President Harris. In December, ABC agreed to give $15 million to Trump’s future presidential foundation or museum to resolve a separate defamation claim. \n\nTillman writes for Bloomberg.","summary":"Trump’s New York Times suit tossed for now as ‘inexcusably’ long","url":"https://www.latimes.com/business/story/2025-09-19/trumps-new-york-times-suit-tossed-for-now-as-inexcusably-long","image":"https://ca-times.brightspotcdn.com/dims4/default/f7ef2ae/2147483647/strip/true/crop/2000x1050+0+142/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa1%2Fe9%2Fdd6cd9b2b059eafee1e0924d9222%2F1x-1.jpg","video":null,"publish_date":"2025-09-19 17:28:34","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.4},{"id":361870786,"title":"In Big Setback, Florida Judge Dismisses Trump's $15 Bn Defamation Case Against New York Times","text":"A federal judge in Florida dismissed US President Donald Trump’s $15 billion defamation lawsuit against The New York Times, ending his latest courtroom clash with the media.\nTrump had filed the case in US District Court, targeting four Times journalists over a book and three articles published in the run-up to the last election.\nAnnouncing the suit on Truth Social, Trump blasted the newspaper as “one of the worst and most degenerate newspapers in the nation’s history” and a “virtual mouthpiece for Democrats.”\nThe Times rejected the claims, calling the case meritless and an attack on press freedom. “The New York Times will not be deterred by intimidation tactics,” spokesperson Charlie Stadtlander said.\nThe lawsuit was among several that Trump launched against major news outlets.\nHe previously filed suits against ABC News and CBS’ 60 Minutes, both of which were settled by their parent companies.\nIn July, he sued The Wall Street Journal and media mogul Rupert Murdoch over coverage of his ties to financier and convicted sex offender Jeffrey Epstein.\nIn the complaint against the Times, Trump accused reporters Russ Buettner and Susanne Craig of “maliciously peddling the fact-free narrative” that television producer Mark Burnett made him a celebrity through The Apprentice, an American reality television series that judged the business skills of a group of contestants.\nHe insisted he was “already a mega-celebrity and an enormous success in business” before the show. The 85-page filing also took aim at reporting on his early business dealings and his father, Fred Trump.\nThe lawsuit further objected to articles by Peter Baker and Michael S. Schmidt. Baker’s October 20 piece was titled “For Trump, a Lifetime of Scandals Heads Toward a Moment of Judgment.”\nSchmidt’s October 22 report, featuring an interview with Trump’s former chief of staff John Kelly, carried the headline “As Election Nears, Kelly Warns Trump Would Rule Like a Dictator.”\nTrump alleged the newspaper never accepted his 2016 victory and could not imagine him winning again.\nThough not part of the case, he also lashed out at the Times’ “deranged” endorsement of opponent Kamala Harris.\nOn Truth Social, he added: “The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA and our Nation as a whole. I am PROUD to hold this once-respected ‘rag’ responsible.”","summary":"Trump had filed the case in US District Court, targeting four Times journalists over a book and three articles published in the run-up to the last election","url":"https://www.news18.com/world/in-big-setback-florida-judge-dismisses-trumps-15-bn-defamation-case-against-new-york-times-9584302.html","image":"https://images.news18.com/ibnlive/uploads/2025/09/trump-2025-09-46936d1e4b809e45b7b48c1e640698f6.jpg","video":null,"publish_date":"2025-09-19 17:13:24","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.051},{"id":361856792,"title":"Donald Trump Told Kamala Harris She Has a 'Beautiful Name' and That Ivanka's a 'Big Fan' During Private Phone Calls, Ex-VP Claims","text":"Kamala Harris is shedding light on her behind-the-scenes interactions with Donald Trump.\n\n The former vice president's upcoming memoir, 107 Days, about her historic 2024 presidential campaign, reveals new details about her dynamic with the president. For much of Harris' campaign, Trump publicly attacked and belittled her — but, according to her, his tone was vastly different in private.\n\n Harris claims she first got a glimpse of Trump's other side in September 2024. When a man was arrested for allegedly plotting to assassinate Trump at his West Palm Beach golf course, the Republican candidate outwardly asserted the violence was fueled by Harris' campaign rhetoric. But shortly after, when Harris initiated a phone call with Trump, his tone had significantly changed.\n\n “I’d readied myself for a phone conversation with Mr. Hyde, but Dr. Jekyll had picked up the call,\" Harris reflects in her book, which was obtained early by PEOPLE.\n\n On the phone, Trump allegedly praised Harris and expressed gratitude to be receiving a call from one of the only other people who understood his \"dangerous\" position.\n\n \"You've done a great job, you really have,\" he said, according to Harris' account. \"My only problem is it makes it very hard for me to be angry with you. It's like, what am I going to do? How do I say bad things about you now?\"\n\n \"Well, then don't!\" Harris says she replied, with laughter.\n\n He allegedly added, \"I'm going to tone it down. I will. You're going to see.\"\n\n At the end of the call, Harris claimed that Trump threw in an unexpected comment about his eldest daughter, Ivanka Trump, saying she's a \"big fan.\"\n\n Trump then sent his regards to Harris' husband, Doug Emhoff, allegedly calling him a \"really good guy\" and complimenting his speech at the Democratic National Convention.\n\n Despite Trump's kind words out of the public eye, Harris writes, they didn't change her perception of him. She claims in her memoir that the president is \"a con man,\" who's \"really good at it.\"\n\n On the night of the 2024 presidential election, after the results projected Trump as the winner, Harris once again called Trump to formally concede. During that call, Trump pronounced her name correctly after famously popularizing a mispronunciation on the campaign trail.\n\n “I am going to be so nice and respectful,” Trump allegedly said. “You are a tough, smart customer, and I say that with great respect. And you also have a beautiful name. I got use of that name, it’s Kamala.”\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer.\n\n PEOPLE reached out to representatives for Donald and Ivanka about Harris' summary of the phone call.\n\n 107 Days comes out on Sept. 23 and is available for preorder now, wherever books are sold.","summary":"In an upcoming memoir, '107 Days,' Harris describes her behind-the-scenes interactions with Trump, including a moment when he seemingly admitted that he knew how to pronounce her name all along","url":"https://people.com/donald-trump-private-phone-calls-kamala-harris-107-days-preview-11813563","image":"https://people.com/thmb/gNCq9q7Br-AQmXGhIO85zIfvIgg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(767x242:769x244)/trump-kamala-and-ivanka-091925-cc5227ba07dd4c5bb9e9af42f7e7a633.jpg","video":null,"publish_date":"2025-09-19 16:55:25","author":"Rachel Raposas","authors":["Rachel Raposas"],"language":"en","category":"politics","source_country":"US","sentiment":0.12},{"id":361862586,"title":"Trump’s moves against the media mirror approaches by authoritarian leaders to silence dissent","text":"By JUSTIN SPIKE and NICHOLAS RICCARDI, Associated Press\n\nBUDAPEST, Hungary (AP) — Since taking office in January, President Donald Trump has waged an aggressive campaign against the media unlike any in modern U.S. history, making moves similar to those of authoritarian leaders that he has often praised.\n\nOn Wednesday, Trump cheered ABC’s suspension of Jimmy Kimmel’s late-night show after the comedian made remarks about the assassination of conservative activist Charlie Kirk that criticized the president’s MAGA movement: “Congratulations to ABC for finally having the courage to do what had to be done,” Trump wrote on his Truth Social platform.\n\nIt was the latest in a string of attacks against news outlets and media figures he believes are overly critical of him. Trump has filed lawsuits against outlets whose coverage he dislikes, threatened to revoke TV broadcast licenses and sought to bend news organizations and social media companies to his will.\n\nThe tactics are similar to those used by leaders in other countries who have chipped away at speech freedoms and independent media while consolidating political power, including Hungarian Prime Minister Viktor Orbán, a close Trump ally whose leadership style is revered by many conservatives in the U.S.\n\n“What we’re seeing is an unprecedented attempt to silence disfavored speech by the government,” said Brendan Nyhan, a political scientist at Dartmouth College. “Donald Trump is trying to dictate what Americans can say.”\n\nIs Trump taking cues from Orbán?\n\nTrump’s approach to governing has drawn comparisons to Orbán, who has been in power since 2010. The Hungarian leader has made hostility toward the press central to his political brand, borrowing Trump’s phrase “fake news” to describe critical outlets. He has not given an interview to an independent journalist in years.\n\nMedia watchdog Reporters Without Borders says Orbán has built “a true media empire subject to his party’s orders” through allies’ acquisitions of newspapers and broadcasters. The group says that strategy has given Orbán’s Fidesz party control of about 80% of Hungary’s media market. In 2018, Orbán’s allies donated nearly 500 news outlets they had acquired to a government-controlled conglomerate, a group that included all of Hungary’s local daily newspapers.\n\nOpposition parties complain that they get just five minutes of airtime on public TV during elections, the legal minimum, while state broadcasters reliably amplify government talking points and smear Orbán’s political opponents. Hungary’s media authority, staffed entirely by Orbán’s party nominees, has threatened nonrenewal of broadcast frequencies to keep outlets in line and forced the liberal-leaning station Klubrádió off the air.\n\n“Here, they bought outlets and replaced editorial staff wholesale,” said Hungarian media analyst Gábor Polyák.\n\nThe moves against independent media, along with Orbán’s systematic capture of Hungary’s democratic institutions, prompted the European Parliament in 2022 to declare that the country could no longer be considered a democracy.\n\nPolyák said that while the American media landscape is far larger and more diverse than Hungary’s, he’s been struck by the willingness of major U.S. companies to accommodate Trump’s threats.\n\n“There is a very strange kind of self-censorship in America,” he said. “Even with European eyes, it is very frightening to see to what degree individual bravery does not exist. From Zuckerberg to ABC, everyone immediately surrenders.”\n\nKimmel suspension is part of a pattern by Trump\n\nKimmel became the second late-night comic with a history of pillorying Trump to lose their show this year. CBS canceled Stephen Colbert’s show just days after he had criticized the network’s settlement of a lawsuit filed by Trump over its editing of a “60 Minutes” interview with former Vice President Kamala Harris, Trump’s opponent last fall.\n\nCBS said the July move was made for financial reasons, but Trump celebrated it nevertheless while appearing to foreshadow this week’s developments: “I absolutely love that Colbert got fired. His talent was even less than his ratings,” he wrote on his social media platform at the time. “I hear Jimmy Kimmel is next.”\n\nABC’s suspension of Kimmel on Wednesday came after Federal Communications Commission Chairman Brendan Carr made a pointed warning about the comedian on a conservative podcast earlier in the day: “We can do this the easy way or the hard way,” he said.\n\nCarr also launched an investigation into CBS and opened probes into public broadcasting networks after Trump persuaded Congress to defund them.\n\nThe Kimmel suspension has highlighted the president’s broader efforts to pressure journalists, media companies, and now comedians and commentators, to align with his views. On Thursday, as he returned from Great Britain, Trump said regulators should consider revoking the licenses of networks that provide what he considers “only bad publicity.”\n\nTrump also has targeted social media giants, claiming Meta dropped its fact-checking program partly because of his threats, which included jailing founder Mark Zuckerberg.\n\nEven powerful media owners have appeared to bend under pressure. Washington Post owner Jeff Bezos, whose companies have significant government contracts, killed an editorial endorsement of Democratic nominee Kamala Harris before the 2024 election and, like Meta, donated $1 million to Trump’s inauguration. Disney-owned ABC News agreed to a $15 million settlement to resolve a Trump lawsuit.\n\nMedia crackdowns in other countries\n\nHungary is not the only country where similar patterns to erode an independent media landscape have been playing out. In neighboring Serbia, populist President Aleksandar Vucic has faced accusations of curtailing media freedoms since coming to power over a decade ago.\n\nCritics have cited a combination of political pressure, public smear campaigns and financial pressure on the media as the means Vucic’s government has used to establish control over mainstream outlets and the public RTS broadcaster.\n\nJournalist safety in Serbia has worsened since the start of student-led protests some 10 months ago that have challenged Vucic’s firm rule. The Media Freedom Rapid Response group — which monitors press freedom in Europe — said in a recent report they were “gravely concerned” that Serbian journalists “have been reporting under immense political pressure, faced with physical violence, censorship, smear campaigns, abusive lawsuits, and daily death threats.”\n\nIn Russia, President Vladimir Putin consolidated control over national television early in his rule and later expanded restrictions on civil society, independent journalism and online platforms. Authorities later used a flurry of laws to restrict freedom of speech.\n\nThe restrictive label “foreign agent” has been slapped on the few remaining independent media outlets and scores of journalists, and the government has steadily tightened controls on the internet. Putin’s crackdown has only intensified after Russia’s 2022 invasion of Ukraine, when new laws criminalized criticism of the war and forced many journalists into exile.\n\nThe rise in India of Prime Minister Narendra Modi has coincided with mounting pressure on comedians and satirists. Police have arrested performers for jokes deemed offensive to Hindu deities or critical of Modi’s party. Comedians such as Kunal Kamra and Vir Das have faced lawsuits, show cancellations and harassment from nationalist groups for skewering the government.\n\nLeaders also have cracked down on the media in multiple Latin American countries. Nicaragua withdrew from the United Nations’ main cultural agency earlier this year to protest a press freedom award it gave to the country’s main opposition newspaper. That publication, La Prensa, has been largely produced by writers in exile since the government raided its Managua offices in 2021.\n\nRiccardi reported from Denver. Associated Press writer Jovana Gec in Belgrade, Serbia, contributed to this report.","summary":"Trump has waged an aggressive campaign against the media unlike any in modern U.S. history.","url":"https://www.denverpost.com/2025/09/19/trump-authoritarian-leaders/","image":"https://www.denverpost.com/wp-content/uploads/2025/09/Trump_Orban_Media_07852-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-19 16:47:51","author":"Gqlshare,The Associated Press","authors":["Gqlshare","The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.074},{"id":361887058,"title":"Trump’s moves against the media mirror approaches by authoritarian leaders to silence dissent","text":"By JUSTIN SPIKE and NICHOLAS RICCARDI, Associated Press\n\nBUDAPEST, Hungary (AP) — Since taking office in January, President Donald Trump has waged an aggressive campaign against the media unlike any in modern U.S. history, making moves similar to those of authoritarian leaders that he has often praised.\n\nOn Wednesday, Trump cheered ABC’s suspension of Jimmy Kimmel’s late-night show after the comedian made remarks about the assassination of conservative activist Charlie Kirk that criticized the president’s MAGA movement: “Congratulations to ABC for finally having the courage to do what had to be done,” Trump wrote on his Truth Social platform.\n\nIt was the latest in a string of attacks against news outlets and media figures he believes are overly critical of him. Trump has filed lawsuits against outlets whose coverage he dislikes, threatened to revoke TV broadcast licenses and sought to bend news organizations and social media companies to his will.\n\nThe tactics are similar to those used by leaders in other countries who have chipped away at speech freedoms and independent media while consolidating political power, including Hungarian Prime Minister Viktor Orbán, a close Trump ally whose leadership style is revered by many conservatives in the U.S.\n\n“What we’re seeing is an unprecedented attempt to silence disfavored speech by the government,” said Brendan Nyhan, a political scientist at Dartmouth College. “Donald Trump is trying to dictate what Americans can say.”\n\nIs Trump taking cues from Orbán?\n\nTrump’s approach to governing has drawn comparisons to Orbán, who has been in power since 2010. The Hungarian leader has made hostility toward the press central to his political brand, borrowing Trump’s phrase “fake news” to describe critical outlets. He has not given an interview to an independent journalist in years.\n\nMedia watchdog Reporters Without Borders says Orbán has built “a true media empire subject to his party’s orders” through allies’ acquisitions of newspapers and broadcasters. The group says that strategy has given Orbán’s Fidesz party control of about 80% of Hungary’s media market. In 2018, Orbán’s allies donated nearly 500 news outlets they had acquired to a government-controlled conglomerate, a group that included all of Hungary’s local daily newspapers.\n\nOpposition parties complain that they get just five minutes of airtime on public TV during elections, the legal minimum, while state broadcasters reliably amplify government talking points and smear Orbán’s political opponents. Hungary’s media authority, staffed entirely by Orbán’s party nominees, has threatened nonrenewal of broadcast frequencies to keep outlets in line and forced the liberal-leaning station Klubrádió off the air.\n\n“Here, they bought outlets and replaced editorial staff wholesale,” said Hungarian media analyst Gábor Polyák.\n\nThe moves against independent media, along with Orbán’s systematic capture of Hungary’s democratic institutions, prompted the European Parliament in 2022 to declare that the country could no longer be considered a democracy.\n\nPolyák said that while the American media landscape is far larger and more diverse than Hungary’s, he’s been struck by the willingness of major U.S. companies to accommodate Trump’s threats.\n\n“There is a very strange kind of self-censorship in America,” he said. “Even with European eyes, it is very frightening to see to what degree individual bravery does not exist. From Zuckerberg to ABC, everyone immediately surrenders.”\n\nKimmel suspension is part of a pattern by Trump\n\nKimmel became the second late-night comic with a history of pillorying Trump to lose their show this year. CBS canceled Stephen Colbert’s show just days after he had criticized the network’s settlement of a lawsuit filed by Trump over its editing of a “60 Minutes” interview with former Vice President Kamala Harris, Trump’s opponent last fall.\n\nCBS said the July move was made for financial reasons, but Trump celebrated it nevertheless while appearing to foreshadow this week’s developments: “I absolutely love that Colbert got fired. His talent was even less than his ratings,” he wrote on his social media platform at the time. “I hear Jimmy Kimmel is next.”\n\nABC’s suspension of Kimmel on Wednesday came after Federal Communications Commission Chairman Brendan Carr made a pointed warning about the comedian on a conservative podcast earlier in the day: “We can do this the easy way or the hard way,” he said.\n\nCarr also launched an investigation into CBS and opened probes into public broadcasting networks after Trump persuaded Congress to defund them.\n\nThe Kimmel suspension has highlighted the president’s broader efforts to pressure journalists, media companies, and now comedians and commentators, to align with his views. On Thursday, as he returned from Great Britain, Trump said regulators should consider revoking the licenses of networks that provide what he considers “only bad publicity.”\n\nTrump also has targeted social media giants, claiming Meta dropped its fact-checking program partly because of his threats, which included jailing founder Mark Zuckerberg.\n\nEven powerful media owners have appeared to bend under pressure. Washington Post owner Jeff Bezos, whose companies have significant government contracts, killed an editorial endorsement of Democratic nominee Kamala Harris before the 2024 election and, like Meta, donated $1 million to Trump’s inauguration. Disney-owned ABC News agreed to a $15 million settlement to resolve a Trump lawsuit.\n\nMedia crackdowns in other countries\n\nHungary is not the only country where similar patterns to erode an independent media landscape have been playing out. In neighboring Serbia, populist President Aleksandar Vucic has faced accusations of curtailing media freedoms since coming to power over a decade ago.\n\nCritics have cited a combination of political pressure, public smear campaigns and financial pressure on the media as the means Vucic’s government has used to establish control over mainstream outlets and the public RTS broadcaster.\n\nJournalist safety in Serbia has worsened since the start of student-led protests some 10 months ago that have challenged Vucic’s firm rule. The Media Freedom Rapid Response group — which monitors press freedom in Europe — said in a recent report they were “gravely concerned” that Serbian journalists “have been reporting under immense political pressure, faced with physical violence, censorship, smear campaigns, abusive lawsuits, and daily death threats.”\n\nIn Russia, President Vladimir Putin consolidated control over national television early in his rule and later expanded restrictions on civil society, independent journalism and online platforms. Authorities later used a flurry of laws to restrict freedom of speech.\n\nThe restrictive label “foreign agent” has been slapped on the few remaining independent media outlets and scores of journalists, and the government has steadily tightened controls on the internet. Putin’s crackdown has only intensified after Russia’s 2022 invasion of Ukraine, when new laws criminalized criticism of the war and forced many journalists into exile.\n\nThe rise in India of Prime Minister Narendra Modi has coincided with mounting pressure on comedians and satirists. Police have arrested performers for jokes deemed offensive to Hindu deities or critical of Modi’s party. Comedians such as Kunal Kamra and Vir Das have faced lawsuits, show cancellations and harassment from nationalist groups for skewering the government.\n\nLeaders also have cracked down on the media in multiple Latin American countries. Nicaragua withdrew from the United Nations’ main cultural agency earlier this year to protest a press freedom award it gave to the country’s main opposition newspaper. That publication, La Prensa, has been largely produced by writers in exile since the government raided its Managua offices in 2021.\n\nRiccardi reported from Denver. Associated Press writer Jovana Gec in Belgrade, Serbia, contributed to this report.","summary":"Trump has waged an aggressive campaign against the media unlike any in modern U.S. history.","url":"https://www.sandiegouniontribune.com/2025/09/19/trump-authoritarian-leaders/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/Trump_Orban_Media_07852-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-19 16:47:51","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":0.074},{"id":361882010,"title":"Trump’s moves against the media mirror approaches by authoritarian leaders to silence dissent","text":"By JUSTIN SPIKE and NICHOLAS RICCARDI, Associated Press\n\nBUDAPEST, Hungary (AP) — Since taking office in January, President Donald Trump has waged an aggressive campaign against the media unlike any in modern U.S. history, making moves similar to those of authoritarian leaders that he has often praised.\n\nOn Wednesday, Trump cheered ABC’s suspension of Jimmy Kimmel’s late-night show after the comedian made remarks about the assassination of conservative activist Charlie Kirk that criticized the president’s MAGA movement: “Congratulations to ABC for finally having the courage to do what had to be done,” Trump wrote on his Truth Social platform.\n\nIt was the latest in a string of attacks against news outlets and media figures he believes are overly critical of him. Trump has filed lawsuits against outlets whose coverage he dislikes, threatened to revoke TV broadcast licenses and sought to bend news organizations and social media companies to his will.\n\nThe tactics are similar to those used by leaders in other countries who have chipped away at speech freedoms and independent media while consolidating political power, including Hungarian Prime Minister Viktor Orbán, a close Trump ally whose leadership style is revered by many conservatives in the U.S.\n\n“What we’re seeing is an unprecedented attempt to silence disfavored speech by the government,” said Brendan Nyhan, a political scientist at Dartmouth College. “Donald Trump is trying to dictate what Americans can say.”\n\nIs Trump taking cues from Orbán?\n\nTrump’s approach to governing has drawn comparisons to Orbán, who has been in power since 2010. The Hungarian leader has made hostility toward the press central to his political brand, borrowing Trump’s phrase “fake news” to describe critical outlets. He has not given an interview to an independent journalist in years.\n\nMedia watchdog Reporters Without Borders says Orbán has built “a true media empire subject to his party’s orders” through allies’ acquisitions of newspapers and broadcasters. The group says that strategy has given Orbán’s Fidesz party control of about 80% of Hungary’s media market. In 2018, Orbán’s allies donated nearly 500 news outlets they had acquired to a government-controlled conglomerate, a group that included all of Hungary’s local daily newspapers.\n\nOpposition parties complain that they get just five minutes of airtime on public TV during elections, the legal minimum, while state broadcasters reliably amplify government talking points and smear Orbán’s political opponents. Hungary’s media authority, staffed entirely by Orbán’s party nominees, has threatened nonrenewal of broadcast frequencies to keep outlets in line and forced the liberal-leaning station Klubrádió off the air.\n\n“Here, they bought outlets and replaced editorial staff wholesale,” said Hungarian media analyst Gábor Polyák.\n\nThe moves against independent media, along with Orbán’s systematic capture of Hungary’s democratic institutions, prompted the European Parliament in 2022 to declare that the country could no longer be considered a democracy.\n\nPolyák said that while the American media landscape is far larger and more diverse than Hungary’s, he’s been struck by the willingness of major U.S. companies to accommodate Trump’s threats.\n\n“There is a very strange kind of self-censorship in America,” he said. “Even with European eyes, it is very frightening to see to what degree individual bravery does not exist. From Zuckerberg to ABC, everyone immediately surrenders.”\n\nKimmel suspension is part of a pattern by Trump\n\nKimmel became the second late-night comic with a history of pillorying Trump to lose their show this year. CBS canceled Stephen Colbert’s show just days after he had criticized the network’s settlement of a lawsuit filed by Trump over its editing of a “60 Minutes” interview with former Vice President Kamala Harris, Trump’s opponent last fall.\n\nCBS said the July move was made for financial reasons, but Trump celebrated it nevertheless while appearing to foreshadow this week’s developments: “I absolutely love that Colbert got fired. His talent was even less than his ratings,” he wrote on his social media platform at the time. “I hear Jimmy Kimmel is next.”\n\nABC’s suspension of Kimmel on Wednesday came after Federal Communications Commission Chairman Brendan Carr made a pointed warning about the comedian on a conservative podcast earlier in the day: “We can do this the easy way or the hard way,” he said.\n\nCarr also launched an investigation into CBS and opened probes into public broadcasting networks after Trump persuaded Congress to defund them.\n\nThe Kimmel suspension has highlighted the president’s broader efforts to pressure journalists, media companies, and now comedians and commentators, to align with his views. On Thursday, as he returned from Great Britain, Trump said regulators should consider revoking the licenses of networks that provide what he considers “only bad publicity.”\n\nTrump also has targeted social media giants, claiming Meta dropped its fact-checking program partly because of his threats, which included jailing founder Mark Zuckerberg.\n\nEven powerful media owners have appeared to bend under pressure. Washington Post owner Jeff Bezos, whose companies have significant government contracts, killed an editorial endorsement of Democratic nominee Kamala Harris before the 2024 election and, like Meta, donated $1 million to Trump’s inauguration. Disney-owned ABC News agreed to a $15 million settlement to resolve a Trump lawsuit.\n\nMedia crackdowns in other countries\n\nHungary is not the only country where similar patterns to erode an independent media landscape have been playing out. In neighboring Serbia, populist President Aleksandar Vucic has faced accusations of curtailing media freedoms since coming to power over a decade ago.\n\nCritics have cited a combination of political pressure, public smear campaigns and financial pressure on the media as the means Vucic’s government has used to establish control over mainstream outlets and the public RTS broadcaster.\n\nJournalist safety in Serbia has worsened since the start of student-led protests some 10 months ago that have challenged Vucic’s firm rule. The Media Freedom Rapid Response group — which monitors press freedom in Europe — said in a recent report they were “gravely concerned” that Serbian journalists “have been reporting under immense political pressure, faced with physical violence, censorship, smear campaigns, abusive lawsuits, and daily death threats.”\n\nIn Russia, President Vladimir Putin consolidated control over national television early in his rule and later expanded restrictions on civil society, independent journalism and online platforms. Authorities later used a flurry of laws to restrict freedom of speech.\n\nThe restrictive label “foreign agent” has been slapped on the few remaining independent media outlets and scores of journalists, and the government has steadily tightened controls on the internet. Putin’s crackdown has only intensified after Russia’s 2022 invasion of Ukraine, when new laws criminalized criticism of the war and forced many journalists into exile.\n\nThe rise in India of Prime Minister Narendra Modi has coincided with mounting pressure on comedians and satirists. Police have arrested performers for jokes deemed offensive to Hindu deities or critical of Modi’s party. Comedians such as Kunal Kamra and Vir Das have faced lawsuits, show cancellations and harassment from nationalist groups for skewering the government.\n\nLeaders also have cracked down on the media in multiple Latin American countries. Nicaragua withdrew from the United Nations’ main cultural agency earlier this year to protest a press freedom award it gave to the country’s main opposition newspaper. That publication, La Prensa, has been largely produced by writers in exile since the government raided its Managua offices in 2021.\n\nRiccardi reported from Denver. Associated Press writer Jovana Gec in Belgrade, Serbia, contributed to this report.","summary":"Trump has waged an aggressive campaign against the media unlike any in modern U.S. history.","url":"https://www.bostonherald.com/2025/09/19/trump-authoritarian-leaders/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Trump_Orban_Media_07852-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-19 16:47:51","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.074},{"id":361919276,"title":"Kamala Harris Brutally Roasted For Hilarious Reason: REACTIONS","text":"Kamala Harris, once again, is getting cooked on social media, and the reactions are hilarious. The former Vice President got blown out in the 2024 election by President Donald Trump, but that hasn't stopped her from remaining relevant. It's clear to anyone paying attention that Harris believes she has a serious shot of being the 2028 Democrat nominee for President. Does she really? Your guess is as good as mine, but she's certainly taking clear steps. Kamala Harris roasted over book quotes. One of those steps is writing her new book, \"107 Days\" about her experience replacing Joe Biden at the top of the ticket. It's a bit baffling because I truly have zero clue who the book is for, but let's not let logic ruin a good time. Axios reporter Alex Thompson tweeted out the opening quotes of Harris' book.....and they certainly are a sight to behold. One is about the energy to \"refute bullsh*t\" and the other is Kendrick Lamar lyrics about loyalty from \"DNA.\" Pretty wild to be talking about loyalty when she gleefully took Joe Biden's spot on the Democrat ticket in 2024! You can see the quotes in the mega-viral tweet below, and let me know your thoughts at David.Hookstead@outkick.com. Do you think the responses were overwhelmingly positive or did it become a roast session? The answer is the latter. It's going to be incredible if Kamala Harris manages to stick around for the foreseeable future. She's the closest we have to having Michael Scott in politics, and I'm not saying that as a compliment. Who thought quoting Kendrick Lamar in a book about a failed presidential run was a good idea? Better question. Who thought this book was a good idea? It's literally like Michael Scott floating writing \"Somehow I Manage\" in \"The Office.\" Hilarious, and completely unnecessary. Never change, Kamala. Never change. It's the best free unintentional comedy on the internet. Let me know what you think at David.Hookstead@outkick.com.","summary":"Former Vice President Kamala Harris is getting crushed for the quotes at the start of her new book.","url":"https://www.outkick.com/culture/kamala-harris-107-days-quotes-reactions","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/09/kamala-harris-3.jpg","video":null,"publish_date":"2025-09-19 16:41:04","author":"David Hookstead","authors":["David Hookstead"],"language":"en","source_country":"us","sentiment":-0.081},{"id":361860108,"title":"Judge tosses out Trump's $15 billion lawsuit against New York Times for being too long","text":"President Donald Trump's $15 billion lawsuit against The New York Times has been tossed, for now. Calling the president's 85-page lawsuit \"decidedly improper and impermissible,\" a federal judge in Tampa threw it out and gave him 28 days to file a new complaint that had to be under 40 pages. U.S. District Judge Steven D. Merryday blasted the Trump suit for alleging only two acts of defamation, yet \"Count I appears on page eighty, and Count II appears on page eighty-three.\" He also criticized the suit's flowery descriptions about Trump and overly political language, writing a complaint is not a \"public forum for vituperation and invective\" or a \"megaphone for public relations or a podium for a passionate oration at a political rally.\" Trump's lawsuit filed this week was his latest against a major media organization. He accused the paper of being a virtual \"mouthpiece\" for the Democratic Party and making an illegal \"campaign contribution\" in 2024 to opponent Kamala Harris. The Times responded that the lawsuit was an intimidation tactic and meritless. A spokesman for Trump's legal team signaled the lawsuit will proceed. \"President Trump will continue to hold the Fake News accountable through this powerhouse lawsuit against the New York Times, its reporters, and Penguin Random House, in accordance with the judge’s direction on logistics,\" the spokesman said. Fox News Digital reached out to The New York Times and the White House for comment. This is a breaking news story. Please check back for updates…","summary":"A federal judge in Florida has, for the moment, dismissed President Donald Trump&apos;s lawsuit against The New York Times due to how it was written.","url":"https://www.foxnews.com/media/judge-tosses-out-trumps-15-billion-lawsuit-against-new-york-times-being-too-long","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/trump-speaks-to-reporters-outside-white-house.jpg","video":"https://www.foxnews.com/video/6378184644112","publish_date":"2025-09-19 16:40:12","author":"David Rutz","authors":["David Rutz"],"language":"en","category":"politics","source_country":"US","sentiment":-0.471},{"id":361887038,"title":"Harris stops biting her tongue in ‘107 Days,’ her book about last year’s campaign against Trump","text":"By CHRIS MEGERIAN\n\nWASHINGTON (AP) — When it was all over, Kamala Harris couldn’t believe it. “I could barely breathe,” she writes in her new book about learning she had lost the 2024 presidential election to Donald Trump.\n\nOne of her aides peeled “Madame President” off celebratory cupcakes before serving them to crushed staffers. Harris kept asking, “My God, my God, what will happen to our country?”\n\nThe next morning was no easier. “I was ashamed to realize I was in the denial and bargaining stages of grief, a very long way from acceptance,” she wrote.\n\nIt’s one of several raw admissions in Harris’ book, “107 Days,” that is scheduled for release Tuesday. The title refers to the length of the hyperspeed campaign that the former vice president launched against Trump after Joe Biden dropped out of the race.\n\nAlthough Harris earned a reputation as guarded and circumspect, the book has the tone of someone who is finished biting her tongue. She concedes mistakes, reveals frustrations and details some of the stranger moments from her race.\n\nThe book isn’t a winding memoir or a political treatise, and Harris doesn’t disclose any future plans. Instead, it reads like a ticking time bomb, with each chapter counting down to Election Day.\n\nHere’s some memorable moments.\n\n‘Joe got tired’\n\nHarris insists in the book that she had no concerns about Biden’s ability to serve as president. “If I believed that, I would have said so.”\n\n“But at eighty-one, Joe got tired,” Harris wrote. “That’s when his age showed in physical and verbal stumbles.”\n\nHarris wrote that Biden’s inner circle “should have realized that any campaign was a bridge too far.” However, “it seemed that the worse things got, the more they pushed him.”\n\nThe tenuous situation unraveled when Biden and Trump faced off with each other. “As soon as he walked onto the debate stage in Atlanta, I could see he wasn’t right,” Harris wrote.\n\nBiden’s team appeared to be in denial. Afterward, they gave Harris talking points that said “JOE BIDEN WON.”\n\nBiden was a source of frustration\n\nHarris wrote warmly of her partnership with Biden, but there were frosty moments too. As Biden faced calls to drop out of the race, he invited Harris to join him for a Fourth of July celebration at the White House.\n\nFirst lady Jill Biden pulled Harris’ husband Doug Emhoff aside. “What’s going on?” she asked. “Are you supporting us?”\n\nLater, in private, Emhoff erupted in anger. “They have to ask if we’re loyal?”\n\nAnother difficult episode came after Harris had replaced Biden at the top of the ticket and was preparing for her own debate with Trump.\n\nShortly before she took the stage, Biden called to say he heard from his brother that Harris had been badmouthing him, upsetting some power brokers in Philadelphia. Then he rambled about his own debate performances while Harris was “barely listening.”\n\n“I just couldn’t understand why he would call me, right now, and make it all about himself,” she wrote.\n\nHindsight is 20/20\n\nHarris admits some mistakes of her own, particularly a damaging appearance on “The View” talk show. When one of the hosts asked what she would have done differently than Biden during the previous four years, Harris blanked on the talking points she had prepared and simply said, “There is not a thing that comes to mind.”\n\n“I had no idea I’d just pulled the pin on a hand grenade,” Harris writes. Around the studio, “my staff were besides themselves” about how she had just given a “gift to the Trump campaign.”\n\nHarris wrote that she didn’t want to criticize Biden or litigate any of the areas where they disagreed. But she also didn’t understand how much her association with the president was holding back her candidacy.\n\nDavid Plouffe, a senior adviser, told Harris bluntly that “people hate Joe Biden.”\n\nThe VP’s search for a VP\n\nThere’s plenty of grist in the book that could make the next Democratic convention a little more awkward.\n\nHarris wrote that Pete Buttigieg, Biden’s transportation secretary and a former mayor from Indiana, was her first choice to be her running mate. He’s also gay, and Harris thought it was “too big of a risk” to pick him while already asking voters to accept a Black woman as president.\n\nPennsylvania Gov. Josh Shapiro was another possibility. But Harris “had a nagging concern that he would be unable to settle for a role as number two and that it would wear on our partnership.”\n\nShe ended up going with Minnesota Gov. Tim Walz, but his debate performance against JD Vance left her yelling at the television screen. “You’re not there to make friends with the guy who is attacking your running mate,” she said.\n\nThere’s only one reference to California Gov. Gavin Newsom in the book. When Harris reached out to him after Biden ended his reelection campaign, he texted, “Hiking. Will call back,” but he never did.\n\nTaking over the campaign\n\nHarris’ brother-in-law is Tony West, a former top Justice Department official and member of her inner circle of political advisers. While Harris was serving as vice president, West put together what was known as the “Red File,” a collection of plans in case something happened to Biden.\n\nWest argued that it would be foolish not to prepare. Harris writes that she “didn’t want to dwell on such an eventuality” and “I left it in his hands.”\n\nHe kept refreshing the document as people pressured Biden to drop out, which came in handy when Biden finally pulled the plug on his reelection campaign.\n\nHarris writes that Biden was planning to wait a day before endorsing her as his successor, an idea that horrified her.\n\n“If you want to put me in the strongest position, you have to endorse me now,” she recalled telling him. Harris prevailed, and the endorsement happened shortly after Biden announced that he was done.\n\nThings got weird sometimes\n\nCampaigns can be hallucinatory affairs, and this one was full of bizarre moments.\n\nHarris writes that she warmed up for her convention speech with a professional voice coach who “wanted me to stand there and emit animal noises.” A little hesitant, Harris got her entire team to make “hums, grunts and trills” with her.\n\nHarris also writes about talking with Trump after a second assassination attempt against him. Despite tearing into her on the campaign trail, Trump proceeded to flatter his opponent.\n\n“How do I say bad things about you now?” he said. “I’m going to tone it down. I will. You’re going to see.” Then Trump said that his daughter Ivanka “is your big fan.”\n\nWhen the call was over, Harris was left marveling at Trump’s ability to turn on the charm. “He’s a con man,” she thought. “He’s really good at it.”","summary":"The book, set for release Tuesday, reveals her frustrations and mistakes during the campaign.","url":"https://www.sandiegouniontribune.com/2025/09/19/harris-book/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/Harris_Book_74654_a37662-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-19 16:39:32","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.192},{"id":361881996,"title":"Harris stops biting her tongue in ‘107 Days,’ her book about last year’s campaign against Trump","text":"By CHRIS MEGERIAN\n\nWASHINGTON (AP) — When it was all over, Kamala Harris couldn’t believe it. “I could barely breathe,” she writes in her new book about learning she had lost the 2024 presidential election to Donald Trump.\n\nOne of her aides peeled “Madame President” off celebratory cupcakes before serving them to crushed staffers. Harris kept asking, “My God, my God, what will happen to our country?”\n\nThe next morning was no easier. “I was ashamed to realize I was in the denial and bargaining stages of grief, a very long way from acceptance,” she wrote.\n\nIt’s one of several raw admissions in Harris’ book, “107 Days,” that is scheduled for release Tuesday. The title refers to the length of the hyperspeed campaign that the former vice president launched against Trump after Joe Biden dropped out of the race.\n\nAlthough Harris earned a reputation as guarded and circumspect, the book has the tone of someone who is finished biting her tongue. She concedes mistakes, reveals frustrations and details some of the stranger moments from her race.\n\nThe book isn’t a winding memoir or a political treatise, and Harris doesn’t disclose any future plans. Instead, it reads like a ticking time bomb, with each chapter counting down to Election Day.\n\nHere’s some memorable moments.\n\n‘Joe got tired’\n\nHarris insists in the book that she had no concerns about Biden’s ability to serve as president. “If I believed that, I would have said so.”\n\n“But at eighty-one, Joe got tired,” Harris wrote. “That’s when his age showed in physical and verbal stumbles.”\n\nHarris wrote that Biden’s inner circle “should have realized that any campaign was a bridge too far.” However, “it seemed that the worse things got, the more they pushed him.”\n\nThe tenuous situation unraveled when Biden and Trump faced off with each other. “As soon as he walked onto the debate stage in Atlanta, I could see he wasn’t right,” Harris wrote.\n\nBiden’s team appeared to be in denial. Afterward, they gave Harris talking points that said “JOE BIDEN WON.”\n\nBiden was a source of frustration\n\nHarris wrote warmly of her partnership with Biden, but there were frosty moments too. As Biden faced calls to drop out of the race, he invited Harris to join him for a Fourth of July celebration at the White House.\n\nFirst lady Jill Biden pulled Harris’ husband Doug Emhoff aside. “What’s going on?” she asked. “Are you supporting us?”\n\nLater, in private, Emhoff erupted in anger. “They have to ask if we’re loyal?”\n\nAnother difficult episode came after Harris had replaced Biden at the top of the ticket and was preparing for her own debate with Trump.\n\nShortly before she took the stage, Biden called to say he heard from his brother that Harris had been badmouthing him, upsetting some power brokers in Philadelphia. Then he rambled about his own debate performances while Harris was “barely listening.”\n\n“I just couldn’t understand why he would call me, right now, and make it all about himself,” she wrote.\n\nHindsight is 20/20\n\nHarris admits some mistakes of her own, particularly a damaging appearance on “The View” talk show. When one of the hosts asked what she would have done differently than Biden during the previous four years, Harris blanked on the talking points she had prepared and simply said, “There is not a thing that comes to mind.”\n\n“I had no idea I’d just pulled the pin on a hand grenade,” Harris writes. Around the studio, “my staff were besides themselves” about how she had just given a “gift to the Trump campaign.”\n\nHarris wrote that she didn’t want to criticize Biden or litigate any of the areas where they disagreed. But she also didn’t understand how much her association with the president was holding back her candidacy.\n\nDavid Plouffe, a senior adviser, told Harris bluntly that “people hate Joe Biden.”\n\nThe VP’s search for a VP\n\nThere’s plenty of grist in the book that could make the next Democratic convention a little more awkward.\n\nHarris wrote that Pete Buttigieg, Biden’s transportation secretary and a former mayor from Indiana, was her first choice to be her running mate. He’s also gay, and Harris thought it was “too big of a risk” to pick him while already asking voters to accept a Black woman as president.\n\nPennsylvania Gov. Josh Shapiro was another possibility. But Harris “had a nagging concern that he would be unable to settle for a role as number two and that it would wear on our partnership.”\n\nShe ended up going with Minnesota Gov. Tim Walz, but his debate performance against JD Vance left her yelling at the television screen. “You’re not there to make friends with the guy who is attacking your running mate,” she said.\n\nThere’s only one reference to California Gov. Gavin Newsom in the book. When Harris reached out to him after Biden ended his reelection campaign, he texted, “Hiking. Will call back,” but he never did.\n\nTaking over the campaign\n\nHarris’ brother-in-law is Tony West, a former top Justice Department official and member of her inner circle of political advisers. While Harris was serving as vice president, West put together what was known as the “Red File,” a collection of plans in case something happened to Biden.\n\nWest argued that it would be foolish not to prepare. Harris writes that she “didn’t want to dwell on such an eventuality” and “I left it in his hands.”\n\nHe kept refreshing the document as people pressured Biden to drop out, which came in handy when Biden finally pulled the plug on his reelection campaign.\n\nHarris writes that Biden was planning to wait a day before endorsing her as his successor, an idea that horrified her.\n\n“If you want to put me in the strongest position, you have to endorse me now,” she recalled telling him. Harris prevailed, and the endorsement happened shortly after Biden announced that he was done.\n\nThings got weird sometimes\n\nCampaigns can be hallucinatory affairs, and this one was full of bizarre moments.\n\nHarris writes that she warmed up for her convention speech with a professional voice coach who “wanted me to stand there and emit animal noises.” A little hesitant, Harris got her entire team to make “hums, grunts and trills” with her.\n\nHarris also writes about talking with Trump after a second assassination attempt against him. Despite tearing into her on the campaign trail, Trump proceeded to flatter his opponent.\n\n“How do I say bad things about you now?” he said. “I’m going to tone it down. I will. You’re going to see.” Then Trump said that his daughter Ivanka “is your big fan.”\n\nWhen the call was over, Harris was left marveling at Trump’s ability to turn on the charm. “He’s a con man,” she thought. “He’s really good at it.”","summary":"The book, set for release Tuesday, reveals her frustrations and mistakes during the campaign.","url":"https://www.bostonherald.com/2025/09/19/harris-book/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Harris_Book_74654_a37662-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-19 16:39:32","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.192},{"id":361867696,"title":"Democrats round on Kamala Harris for dishing dirt in campaign memoir","text":"A required part of this site couldn’t load. This may be due to a browser\n extension, network issues, or browser settings. Please check your\n connection, disable any ad blockers, or try using a different browser.","summary":"Former vice-president takes aim at prominent figures in her party in book about failed presidential bid","url":"https://www.ft.com/content/e23c24a7-58ed-490c-9ea6-2713aff274c3","image":null,"video":null,"publish_date":"2025-09-19 16:28:35","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-1},{"id":361856774,"title":"“The View” Hosts Remain Silent on “Jimmy Kimmel Live!” Removal After FCC Chair Threatens to 'Look into' Talk Show","text":"The View's panelists continue to stay quiet on ABC's removal of Jimmy Kimmel Live! — one day after the chair of the Federal Communications Commission suggested the agency could \"look into\" the talk show.\n\n On Friday, Sept. 19, two days after Jimmy Kimmel's long-running late-night program was pulled from the same network following his comments about right-wing political commentator Charlie Kirk, the hosts of The View did not discuss ABC's move on air. They also did not address the topic during the episode on Sept. 18.\n\n Instead, panelists Ana Navarro, Sara Haines, Sunny Hostin, Joy Behar and Alyssa Farah Griffin opened the show with talk about Kamala Harris's upcoming memoir and running-mate pick (before her Tuesday, Sept. 23 appearance on the show). They later touched on thirst traps and introduced two of the days guests. \nActress Lily James sat alongside the panelists to chat about her new drama Swiped, while comedian Andy Huggins appeared for Joy's Comedy Corner. \"I don't know about you, but I never needed a laugh more than these last few months,\" Behar said, introducing the segment. \"So it seemed like the perfect time for the return of my Joy's Comedy Corner segment.\"\n\n The latest episode arrives one day after panelists Whoopi Goldberg, Haines, Hostin, Behar and Griffin stayed quiet on Thursday's iteration of The View, their first back following the Kimmel news.\n\n The panelists kicked off the previous show with a tribute to Haines in honor of her 48th birthday, before speaking on FBI Director Kash Patel testifying before the House Judiciary Committee, Health Secretary Robert F. Kennedy Jr., Eugene Levy's new show The Reluctant Traveler and Terry Bradshaw and wife Tammy's new cookbook. The crew ended the episode by showing off some festive cookies in honor of Haines' birthday, as Goldberg promised viewers she'd \"see you tomorrow\" while signing off.\n\n The lack of acknowledgment for Kimmel's late-night pull sparked concerned comments from viewers, some of whom even shared their thoughts under The View's Instagram posts. \"Why was there no mention of Jimmy Kimmel today? Did I miss it,\" one viewer asked. \"I’ll be pissed if they did not mention him!\" \n\n On Wednesday, Sept. 17, a spokesperson for Disney's ABC confirmed that Kimmel's program is on hiatus following comments Kimmel made on air about the man who shot Kirk, a commentator who was killed at a campus event at Utah Valley University the week prior. Two days before ABC's decision, Kimmel said during his Monday monologue that the \"MAGA Gang\" was \"desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it. In between the finger-pointing, there was grieving.\"\n\n Kimmel had actually offered his condolences to Kirk's family prior to this, sharing on social media, \"Instead of the angry finger-pointing, can we just for one day agree that it is horrible and monstrous to shoot another human? On behalf of my family, we send love to the Kirks and to all the children, parents and innocents who fall victim to senseless gun violence.\"\n\n The PEOPLE Puzzler crossword is here! How quickly can you solve it? Play now!\n\n Kimmel's removal followed Nexstar Media's — the largest local broadcast and digital media company in the U.S — announcement that it would acquire rival broadcast company Tegna for $6.2 billion and place itself in 80% of America's TV-owning households, per a press release, an acquisition that would require final approval from the Trump-controlled FCC.\n\n Nexstar said it “strongly objects to recent comments made by Mr. Kimmel concerning the killing of Charlie Kirk and will replace the show with other programming in its ABC-affiliated markets.”\n\n Good Morning America — the morning news show produced by ABC News — did mention the news of Kimmel's pull on Thursday, Sept. 18 but did not provide commentary. The network's evening program, ABC World News Tonight, covered the Kimmel removal on Sept. 18. In a segment with correspondent Elizabeth Schulze, anchor David Muir acknowledged the \"fierce reaction\" it sparked, as he said some claimed the network was \"caving to political pressure.\"\n\n FCC Chair Brendan Carr, who praised the decision on social media, later told The Scott Jennings Radio Show on Sept. 18, that it may be \"worthwhile\" for the agency to take a look at The View next. \"When you look at these other TV shows, what's interesting is the FCC does have a rule called the equal opportunity rule,\" Carr said. \"But there's an exception to that rule called the bona fide news exception, which means if you are a bona fide news program, you don’t have to abide by the equal opportunity rule.\"\n\n \"I think it's worthwhile to have the FCC look into whether The View and some of the programs that you have still qualify as bona fide news programs and therefore exempt from the equal opportunity regime that Congress has put in place,\" he later added.\n\n A White House spokesperson previously claimed in a statement this year that the show hit its \"lowest ratings\" and that Behar \"should self-reflect on her own jealousy of President Trump's historic popularity before her show is the next to be pulled off air.\"\n\n The statement came after Behar called Trump \"so jealous\" of former President Barack Obama during a July 23 episode.\n\n In response, a spokesperson for the show told Entertainment Weekly that The View was \"ranking No. 1 in households and total viewers among all network daytime talk shows and news programs for the fifth straight season.\"\n\n While Trump himself has celebrated ABC indefinitely pulling Kimmel, other public figures — including Wanda Sykes, Ben Stiller and Obama — have expressed their concerns with the move. Kimmel has not addressed the decision as of Friday morning.\n\n Other late-night hosts and alumni, from Seth Meyers to David Letterman, have sounded off on the Kimmel pull this week. Stephen Colbert called it \"blatant censorship\" at the taping of his Thursday episode of Late Show.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. \n\n The View airs weekdays on ABC (check local listings).","summary":"The Friday, Sept. 19 episode did not discuss the indefinite hiatus of 'Jimmy Kimmel Live!'","url":"https://people.com/the-view-hosts-remain-silent-jimmy-kimmel-live-after-fcc-chair-threatens-talk-show-11813439","image":"https://people.com/thmb/2RphQpxocsRvleSK4W4BVz4k_LU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(750x441:752x443)/The-View-Jimmy-Kimmel-091925-tout-2549f25579b44ae6ac6899804e2237af.jpg","video":null,"publish_date":"2025-09-19 16:26:59","author":"Brenton Blanchet","authors":["Brenton Blanchet"],"language":"en","category":"politics","source_country":"US","sentiment":-0.034},{"id":361919274,"title":"Jimmy Kimmel Hammered MAGA With Jokes, Barely Touched Liberals - Here Are The Stats","text":"In a riveting piece of research released Friday, media watchdog NewsBusters revealed an absurd level of Jimmy Kimmel's jokes have been aimed at MAGA since 2023. You knew the number would be high, but we're talking an astronomical number. Brace yourselves. \"According to an aggregation of previous NewsBusters studies, 92 percent of Kimmel’s jokes since January 2023 have been about conservatives,\" the site claims. Out of 7,797 political jokes over that period, NewsBusters reports that only 565 were aimed at Jimmy's buddies on the Left. Of those jokes, 3,584 were aimed at Donald Trump. Joe Biden was on the receiving end of 336 jokes. Kamala Harris received 12 jokes. What about Jill Biden? FIVE. Melania Trump? 181. Here's the full list of subjects who have been the target of Jimmy Kimmel jokes, based on NewsBusters' research: Jimmy Kimmel pulled off the air for his statements about the Charlie Kirk assassin Here is the exact moment when Jimmy Kimmel's late-night career came unraveled. This is exactly what Kimmel told his audience about the Kirk assassination: \"We hit some new lows over the weekend with the MAGA gang trying to characterize this kid who killed Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,\" Kimmel said during his show’s Monday monologue. MORE FROM OUTKICK: JIMMY KIMMEL REFUSES TO ADDRESS LIE ABOUT CHARLIE KIRK’S ALLEGED ASSASSIN \"In between the finger-pointing, the White House flew the flag at half-staff, which got some criticism, but on a human level, you can see how hard the president was taking this.\" Based on the stats, one would be led to believe that Jimmy Kimmel said the hell with it, he was going to go out as a political martyr on the left and be remembered fondly by the LIBS for his service. \"I think this is my final contract,\" Kimmel told the L.A. Times in 2024. \"I hate to even say it, because everyone’s laughing at me now — each time I think that, and then it turns out to be not the case. I still have a little more than two years left on my contract, and that seems pretty good. That seems like enough.\" Kimmel's contract expires at the end of May 2026.","summary":"Jimmy Kimmel has told an insane number of jokes aimed at MAGA compared to Liberals.","url":"https://www.outkick.com/culture/jimmy-kimmel-hammered-maga-jokes-barely-touched-liberals-here-stats","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/09/jimmy-kimmel.jpg","video":null,"publish_date":"2025-09-19 16:22:36","author":"Joe Kinsey","authors":["Joe Kinsey"],"language":"en","source_country":"us","sentiment":-0.507},{"id":361886828,"title":"Thousands In Deep Blue State Show Up Anyway At Event Kirk Was Slated To Headline","text":"More than 7,000 people gathered at Colorado State University’s (CSU) stadium on Thursday for what should have been a speech by Turning Point USA founder Charlie Kirk — instead, it was a massive vigil for the conservative leader assassinated just one week earlier.\n\nThe event at CSU would have been the second stop of Kirk’s American Comeback Tour but was forced instead to be a memorial following Kirk’s death at Utah Valley University’s campus on Sept. 10 — the first leg of the tour. (RELATED: Student’s Charlie Kirk Tribute Trashed By Peer – But He’s The One Suspended)\n\n Charlie Kirk was scheduled to speak at CSU in Fort Collins tonight, and 10,000 people turned out anyway. This is deep blue Colorado.@TPUSA pic.twitter.com/rmaiFQ8YwP — Robbie Rose (@HelloRobbieRose) September 19, 2025 \n\nA counter event hosted by Political Review, which describes itself as “The official Counter Organization to Turning Point USA,” was originally scheduled to take place at the same time as Kirk’s speech. Following his assassination, the group decided to move the event to start after the vigil ended, saying they did not want to counter the vigil or Turning Point.\n\n 🚨BREAKING: Tens of thousands of students have shown up at Colorado State University for their Charlie Kirk Vigil. Pray for the Kirk family. RIP, Charlie.pic.twitter.com/IgoRFKBqVf — Bo Loudon (@BoLoudon) September 19, 2025 \n\n“What we are trying to do is continue the legacy of debate that Charlie endorsed,” Political Review’s CSU student chapter co-president Patrick McCabe told the Coloradoan. “We want to make sure people don’t shy away from politics.”\n\n Did y’all know that Charlie was scheduled to speak at Colorado State University last night, an event stolen from him after a POS punk ☠️ him 😤 BUT 👇🏻over 10,000 folks showed up anyway – in Deep Blue Territory – to let the world know that they still support his mission 👏🏻👊🏻. To… pic.twitter.com/8ZYWz7Va0f — Todd With Trump (@THeinrich22) September 19, 2025 \n\nIn 2024, former Vice President Kamala Harris won Colorado by a significant margin, earning 54.1% of the vote compared to President Donald Trump’s 43.1%.\n\nDozens of reports have come out in the last week revealing members of academia — including students, educators and administrators — have taken to celebrating Kirk’s assassination. Several have since been suspended, fired or expelled for comments made in public and on social media.\n\nSome have even faced punishment not for deriding Kirk, but for honoring him.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Continue the legacy of debate that Charlie endorsed'","url":"https://dailycaller.com/2025/09/19/thousands-in-deep-blue-state-show-up-anyway-at-event-kirk-was-slated-to-headline/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2235153663-scaled-e1758287461262.jpg","video":null,"publish_date":"2025-09-19 16:19:46","author":"Jaryn Crouson","authors":["Jaryn Crouson"],"language":"en","source_country":"us","sentiment":-0.223},{"id":361890714,"title":"Harris wanted Buttigieg as running mate","text":"to top close Video This video is playing in picture-in-picture.\n\nAmerica Reports September 19, 2025 05:46 \n\n Harris wanted Buttigieg as running mate \n Former Biden press chief Yemisi Egbewole and former NRSC press secretary T.W. Arrighi discuss Kamala Harris’ first choice for a running mate and the future of the Democratic and Republican Parties ahead of the 2028 presidential election.\n Tags KAMALA HARRISPERSONALITIESSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRAMERICA REPORTSPOLITICS","summary":"Former Biden press chief Yemisi Egbewole and former NRSC press secretary T.W. Arrighi discuss Kamala Harris’ first choice for a running mate and the future of the Democratic and Republican Parties ahead of the 2028 presidential election.","url":"https://www.foxnews.com/video/6379797605112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f5a9217d-c31e-44f0-8780-81e459fa3bfc/544db0bd-072a-4da3-a94c-2612deed499a/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-19 16:08:58","author":null,"language":"en","source_country":"us","sentiment":0.346},{"id":361858856,"title":"Kamala Harris admits Walz wasn’t her first choice as VP, opens up about stumble during 2024 campaign","text":"Former Vice President Kamala Harris admits in her new book that Gov. Tim Walz was not her first choice as a running mate for vice president and opens up about some of his stumbles during the 2024 presidential campaign, several news outlets reported this week.\n\nIn “107 Days,” Harris said 2020 presidential candidate and former Secretary of Transportation Pete Buttigieg, who she considers a friend, would have been her first choice. But ultimately, she decided not to pick him because she believed it would be “too big of a risk” for a Black woman to tap a gay man for the job, Harris said in an excerpt of her book reported by the Atlantic. \n\nHarris’ soon-to-be released book gives readers one of the first looks behind one of the shortest presidential campaigns put together in modern history after former President Joe Biden left the race suddenly. \n\nHarris wrote that Buttigieg “would have been an ideal partner — if I were a straight white man.” However, she grappled with the fact that “we were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. Part of me wanted to say, Screw it, let’s just do it. But knowing what was at stake, it was too big of a risk.” \n\nCiting Walz’s experience as a teacher, coach and governor, Harris announced plans to tap him as her running mate after his success on the cable news circuit. Walz had gone viral for declaring that Republicans were “really weird people‚\" for their positions on abortion and book banning. The clip helped reframe the party’s attack on the GOP. \n\nThe publication of Harris’ book comes just as Walz announced he’s seeking an unprecedented third term for governor. Being at the top of the ticket as Harris’ running mate helped solidify him as a national Democratic figure, but it’s also opened him up to greater scrutiny from Republicans. He is now tasked with choosing a running mate of his own as he looks to win a third term. \n\n“I love Pete Buttigieg. I think, I think he’d be fantastic,” Walz said during an interview on MPR on Friday, responding to Harris’ memoir. \n\n“I know my strengths. I know areas I can work on. I ... could not have been prouder to be on the ticket with the vice president,” he added. “And I think the only regret is, and I have a feeling a lot of Americans feel this way, is that we didn’t win.”","summary":"The looming release of Harris’ book comes just as Walz announced he’s seeking an unprecedented third term for governor.","url":"https://www.startribune.com/kamala-harris-admits-walz-wasnt-her-first-choice-as-vp-opens-up-about-stumble-during-2024-campaign/601477184","image":"https://arc.stimg.co/startribunemedia/WHA6EYQIGBC3RHVULCA2P77OG4.JPG?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2025-09-19 16:02:43","author":"Sydney Kashiwagi","authors":["Sydney Kashiwagi"],"language":"en","source_country":"US","sentiment":-0.131},{"id":361859346,"title":"“The View ”fails to address ABC peer Jimmy Kimmel's suspension for second consecutive day","text":"The View continues to stay silent about fellow ABC personality Jimmy Kimmel’s indefinite suspension from their network. \n\n For the second day in a row, Joy Behar, Sara Haines, Sunny Hostin, Alyssa Farah Griffin, and Ana Navarro avoided addressing the controversy surrounding Kimmel and his late-night show suddenly getting pulled off the air. Instead, the panelists discussed a passage from former Vice President Kamala Harris' new book and conducted interviews with Lily James and Andy Huggins. \n\n On Wednesday, ABC confirmed that it had put Jimmy Kimmel Live on an indefinite suspension after several local affiliate groups, including Nexstar and Sinclair, announced that they would preempt the talk show as a response to Kimmel’s comments about Tyler Robinson, the alleged killer of conservative podcaster Charlie Kirk.\n\n On Monday’s episode of Kimmel, the host said, \"We had some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and with everything they can to score political points from it.\"\n\n The View hosts' continued silence on the subject follows Donald Trump's appointed FCC chairperson Brendon Carr saying he thinks it would be \"worthwhile\" for his agency to \"look into\" the daytime talk show, too. \n\n \"When you look at these other TV shows, what's interesting is the FCC does have a rule called the equal opportunity rule,\" Carr explained on The Scott Jennings Radio Show. \"But there's an exception to that rule called the bona fide news exception, which means if you are a bona fide news program, you don't have to abide by the equal opportunity rule.\"\n\n He added that he was \"not so sure\" that The View was considered a bona fide news show and, as a result, it would be required to give the same amount of time to both sides of a story. \n\n \"I think it's worthwhile to have the FCC look into whether The View and some of the programs that you have still qualify as bona fide news programs,\" he said, \"and are therefore exempt from the equal opportunity regime that Congress has put in place.\"\n\n In July, Carr spoke about potential \"consequences\" for The View after Behar criticized Trump on the show, with him calling for \"a course correction\" in media coverage of the current presidential administration. \n\n \"It's entirely possible that there's issues over there. Stepping back, this broader dynamic, once President Trump has exposed these media gatekeepers and smashed this facade, there's a lot of consequences,\" Carr said at the time. \"I think the consequences of that aren't quite finished.\"\n\n The View hosts previously condemned Kirk's \"beyond devastating\" assassination in the aftermath of the incident.\n\n Griffin, a conservative panelist on the show, said at the time, \"Regardless of your politics, we've got to get to a place in this country where we see people we disagree with not as our enemies, but as fellow Americans with different viewpoints that we need to engage.\"","summary":"Instead, the hosts debated a passage of former Vice President Kamala Harris' new book and interviewed actress Lily James.","url":"https://ew.com/the-view-does-not-address-jimmy-kimmel-suspension-for-2nd-day-11813528","image":"https://ew.com/thmb/S2Fh_EvP_FqdLMpfo2OOh7ibGcQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/The-View-Portrait-022025-ceb344c021fc4783bc9292d78728541a.jpg","video":null,"publish_date":"2025-09-19 16:00:30","author":"Emlyn Travis","authors":["Emlyn Travis"],"language":"en","source_country":"US","sentiment":-0.111},{"id":361903334,"title":"Jimmy Kimmel and the strongman’s fear of comedians","text":"First, they came for “Puppets.”\n\nThe weekly Russian satire known as “Kukly” — or “Puppets,” in English — lampooned Russian leaders by rendering them as giant latex caricatures. Not long after its 1994 launch, the show and its producing channel, NTV, flourished. At the height of its popularity, more than half of Russia’s TV viewers tuned in to its episodes, many of which featured a puppet version of former KGB officer turned politician Vladimir Putin.\n\nIn one sketch described in a 2000 Salon story, “Kukly” shows Putin’s puppet double as “a Japanese robe-wearing playboy being serviced by a bevy of painted-up prostitutes (i.e., his political cronies).”\n\nThe show’s head writer, Viktor Shenderovich, claimed Lenin as his inspiration, since it was he who dubbed politicians “political prostitutes.” “It’s just been a long time since we last witnessed such a great illustration of the metaphor,” Shenderovich claimed at the time.\n\nPutin was not tickled. Following the thin-skinned leader’s election to the presidency in 2000, his armed operatives raided the offices of NTV’s parent company and had its owner, Vladimir Gusinsky, jailed on embezzlement charges. Shortly after that, NTV’s ownership was transferred to a Kremlin-allied oligarch, and “Kukly” went off the air in 2002.\n\nSatirists pose a danger to the likes of Putin and Donald Trump because they expose that their claims to greatness are illusions, and validate that the people oppressed by their governance aren’t crazy. Astute punchlines can be potent, taking on a life of their own, spreading faster and farther from their origin than nearly any official statement. Unless, say, that statement tees up a joke.\n\nThe Monday monologue joke that led to “Jimmy Kimmel Live!’” being pulled from ABC “indefinitely,” whatever that means, wasn’t one of the host’s best. Neither was it “the sickest conduct possible,” as Trump’s appointed Federal Communications Commission chairman Brendan Carr described it to far-right podcaster Benny Johnson on Wednesday.\n\nWhat it constitutes is a sufficient excuse to censor someone else who Trump has long desired to silence.\n\nKimmel’s relentless hammering on Trump has been the centerpiece of nearly every single monologue that’s topped “Jimmy Kimmel Live!” since the first Trump administration. The only fresh addition to Monday’s show opener is that Kimmel performed it in the wake of a nationwide censuring campaign designed to punish anyone speaking ill of right-wing activist and podcaster Charlie Kirk in the days following his murder.\n\nTo be clear, Kimmel did not malign Kirk in any way. Here’s what he said: “We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it. In between the finger-pointing, there was grieving.”\n\nCiting Trump’s order to fly flags at half-staff, he continued, “But on a human level, you can see how hard the president is taking this.” Cut to a gaggle outside the White House, where a reporter acknowledged that Kirk was the president’s good friend and asked how he was holding up.\n\nTrump responds, “I think very good. And by the way, right there, you see all the trucks? They just started construction of the new ballroom for the White House, which is something they’ve been trying to get, as you know, for about 150 years, and it’s gonna be a beauty.”\n\n“Yes,” Kimmel deadpans, “he’s at the fourth stage of grief: construction.”\n\nA Rolling Stone report cited sources that said multiple ABC execs felt that Kimmel hadn’t crossed any lines but “the threat of Trump administration retaliation loomed.”\n\n“They were p**sing themselves all day,” the magazine quoted an unnamed insider as saying.\n\nTrump obsessively raged at late-night hosts and unflattering “Saturday Night Live” parodies throughout his first presidency but lacked the political machinery to do anything about them. Now he has the backing of the federal government’s regulatory apparatus, including Carr’s FCC and a Republican-controlled Congress.\n\nDays after CBS paid Trump $16 million to settle his lawsuit alleging election interference related to a “60 Minutes” interview with former Vice President Kamala Harris, the FCC approved its parent company Paramount Global’s merger with Skydance. And for good measure, it also cancelled “The Late Show with Stephen Colbert,” claiming it was “purely a financial decision against a challenging backdrop in late night.”\n\n“I absolutely love that Colbert got fired,” Trump posted to Truth Social that week. “His talent was even less than his ratings. I hear Jimmy Kimmel is next.”\n\nAnd now, this: “Great News for America: The ratings-challenged Jimmy Kimmel Show is CANCELLED,” Trump wrote on Truth Social Wednesday. “Congratulations to ABC for finally having the courage to do what had to be done . . .That leaves Jimmy [Fallon] and Seth [Meyers], two total losers, on Fake News NBC. Their ratings are also horrible. Do it NBC!!!”\n\nDon’t you dare, NBC. “Late Night with Seth Meyers” must be protected at all costs.\n\n“I recognize laughter in the age of Trump as though it were a cousin of anti-totalitarian laughter,” Masha Gessen wrote in 2018. “It is the reaction to seeing act-based reality, as when ‘Saturday Night Live’ essentially reenacts White House press conferences, or when late-night comedians offer up what amounts to straightforward reportage and analysis. The hunger for a reflection of reality is so desperate that . . . one can reliably get laughs simply by quoting Trump during a public talk.”\n\nThat is pretty much what Kimmel did. The part that Carr found offensive, I guess, is that he implied that Trump’s purported despair wasn’t genuine. One can draw their own conclusions based on that clip, as Desi Lydic does on Tuesday’s episode of “The Daily Show.” She rolls her eyes, shakes her head and observes with a shrug, “Well, we all grieve in our own way.”\n\nLydic doesn’t have to fear retaliation from the White House, for now. Comedy Central’s new owner, Paramount Skydance, no longer needs to appease Carr, although if its proposed deal to acquire Warner Bros. Discovery goes forward, “The Daily Show” may be in a different situation.\n\nOther entertainers in Trump’s sights aren’t taking chances. Jimmy Fallon bowed out of a planned appearance at the Fast Company Innovation Festival on Thursday. On that same Thursday, the co-hosts of “The View” said nothing about their late-night colleague’s suspension from the network’s lineup.\n\nMeanwhile, on Thursday’s edition of “The Scott Jennings Radio Show,” Carr mused about having the FCC “look into whether ‘The View’ and some of the programs that you have still qualify as bona fide news programs and therefore exempt from the equal opportunity regime that Congress has put in place.”\n\nHe has turned his coup into a media tour, including a Wednesday stop by Fox News to complain that late-night hosts “went from being court jesters that would make fun of everybody in power to being court clerics and enforcing a very narrow political ideology.”\n\nJon Stewart ended Thursday by hosting a special “government-approved” edition of “The Daily Show,” identifying himself as its “patriotically obedient host.” With a tacky, maximalist golden background projected behind him, Stewart played that part by referring to Trump as “our Great Father” and praising the president’s verbal gaffes during his U.K. visit. Then the show’s correspondents clumsily formed a chorus of praise that collapsed into bickering, which halted when Ronny Chieng told everyone, “Calm down . . . God, is this your first dictator?”\n\nAmong the first moves in the strongman’s playbook is to take control of the media, starting with censoring news outlets and humorists. Stand-up comics in India who speak out against Prime Minister Narendra Modi’s authoritarian overreach face death threats and intimidation from loyalists and police.\n\nTurkey has a law threatening anyone who insults its president with between one and four years in prison. That includes minors. Around 903 kids between the ages of 12 and 17 stood trial related to such charges over six years, according to a 2020 Duvar English report. Some 264 of those were between the ages of 12 and 14.\n\nOur rights haven’t eroded to that degree, but Kimmel’s “indefinite” suspension is the most brazen evidence of this administration’s willingness to use politicized agencies against his perceived enemies. Trump has this in common with Hungarian Prime Minister Viktor Orbán, who said in 2018, “We must embed the political system in a cultural era.”\n\nA few months into Trump’s second term, he launched ideological purges of national arts institutions and directed Congress to defund the Corporation for Public Broadcasting, dealing a crippling blow to NPR and PBS member stations. (The PBS brand is closely associated with “Sesame Street,” so in a way, our government also came for the puppets first.)\n\nThat Kimmel’s suspension is the result of a regulatory agent’s threat on a podcast is singularly alarming, but follows this course. In the past, Trump fumed that the FCC should take away broadcast networks’ licenses, but that was an empty threat because broadcasters don’t hold FCC licenses. Their affiliated stations do, and that’s who Carr threatened on Wednesday by musing about actions the FCC can take.\n\nDisney doesn’t have pending business with the FCC, but Nexstar Media Group does. Around 30 of its stations are ABC affiliates, part of a portfolio consisting of 201 stations in 116 U.S. markets. Presently, it requires the commission’s approval to finalize a $6.2 billion merger with Tegna. Thus, Nexstar was the first to answer Carr’s call “to step up and say, ‘You know, this garbage . . . isn’t something that we think serves the needs of our local communities.”\n\n“We can do this the easy way,” he added, “or the hard way.”\n\nAndrew Alford, president of Nexstar’s broadcasting division, took the very easy way out. “Continuing to give Mr. Kimmel a broadcast platform in the communities we serve is simply not in the public interest at the current time,” he said in an official statement.\n\nConservative station group Sinclair also pulled “Jimmy Kimmel Live!” from its affiliates’ line-ups “until further notice.” It followed that by demanding that Kimmel apologize to Kirk’s family and make a donation to the right-wing activist organization he founded, Turning Point USA.\n\nKimmel’s brother-in-arms Colbert shared his thoughts on Thursday’s episode of “The Late Show.” “You know what my community values are, Buster? Freedom of speech!” he said, “Or as Alexander Hamilton called it, ‘Hakuna matata.’”\n\nLots of Americans are appalled, including the FCC’s lone Democratic commissioner Anna Gomez. “The FCC is weaponizing its licensing authority in order to bring broadcasters to heel, and to really think twice about what they say about this administration,” Gomez said Thursday at the Axios Media Trends Live conference. “That is contrary to the First Amendment. It’s contrary to the Communications Act, which prohibits the FCC from censoring broadcasters. So, any pressure on these broadcasters to alter their broadcasts because of their content is, in fact, inappropriate.”\n\nAs for what can be done, her response wasn’t encouraging. It’s up to the corporations overseeing the newsrooms and performers that are under attack to stand up for free speech, Gomez says, “because every time they capitulate rather than show courage, what they are doing is eroding our democracy on our First Amendment freedoms.” Between CBS and ABC’s news and entertainment divisions, we’re up to at least four public–facing capitulations.\n\nStart your day with essential news from Salon.\nSign up for our free morning newsletter, Crash Course.\n\nFear is one of the authoritarian’s topmost tools, and satire reminds us how brittle it is. That’s the theory, anyway. In practice, fear has commanded a sizable lead in the race against satire since 9/11, when ABC cancelled Bill Maher’s “Politically Incorrect.”\n\nColbert and Kimmel are merely the latest casualties in this long march toward what’s shaping into a darker period than the McCarthy Era. That ended, in part, because President Dwight D. Eisenhower worked to undermine Senator Joseph R. McCarthy. This time the White House is leading the charge against the nebulous left, empowering modern McCarthy-equivalents like Carr to do his bidding. Ironically, this echoes a very Russian tradition.\n\n“Kukly” writer Shenderovich became a prominent Kremlin critic in the years that followed its cancellation before finally fleeing Russia in 2022 after the government branded him as a “foreign agent.” Nineteen years before that, in 2003, he wrote, “Of course, the problem isn’t Putin, and not those whose interests he was appointed to protect in the Kremlin, and whose interests he protects today. The problem is us, who run to heel at the first shout, fussing pettily, bought up on the cheap.”\n\nRight now, in this land of purported free speech, those words hit close to home. One quivers at the thought of who the right’s war on free expression will claim next, but if Russia’s post-“Kukly” landscape is an indicator, the hit list may include good humor itself.\n\nOn the same day that ABC suspended Kimmel, 404 Media reported that Russia’s Ministry of Defense has debuted an AI-generated comedy featuring, among other jests, deepfake versions of French President Emmanuel Macron and Trump blabbing about golden toilets. Whether Putin appears isn’t mentioned. He probably doesn’t, since he’s the man pulling the strings.","summary":"ABC's latest sacrifice to Trump comes straight out of a playbook followed by other authoritarian governments","url":"https://www.salon.com/2025/09/19/jimmy-kimmel-and-the-strongmans-fear-of-comedians/","image":"https://www.salon.com/app/uploads/2025/09/Jimmy-Kimmel-Set-150x150.jpg","video":null,"publish_date":"2025-09-19 16:00:13","author":"Melanie McFarland","authors":["Melanie McFarland"],"language":"en","source_country":"us","sentiment":-0.187},{"id":361947696,"title":"The View Goes Silent on Kimmel Suspension, Show Off Their WikiFeet","text":"If ABC’s The View was known for anything, it was that the six co-hosts were loud and very opinionated. But for two airings, on Thursday and Friday, the liberal ladies had not so much as alluded to the story which dominated much of the liberal media’s time and fearmongering in the latter part of the week: ABC’s suspension of Jimmy Kimmel. Instead, there seemed to be an undercurrent of angst as their infamous “Hot Topics” segments came off as a bit blunted and they covered bizarre things like hyping their WikiFeet scores.\n\nNot long before going their summer hiatus, The View was very vocal in their defense of “comedian” Stephen Colbert after CBS announced that they were canceling his show. “Because it's very clear that if it is political, this is the dismantling of our democracy. This is the dismantling of our Constitution,” Hostin declared at the time. “That means the very rubric of our democracy is being dismantled. And I think every single person should be really, really concerned about it.”\n\nA pretty strong statement for them to not say something when the suspension was in their own house at ABC. Perhaps recent comments from FCC Chairman Brendon Carr taking aim at The View had them spooked, but they’ve also boasted that they weren’t afraid of the Trump administration. Or perhaps, they were spooked the Disney and ABC executives who suspended Kimmel; the same ones who scolded them once before that they needed to tone down their rhetoric or face consequences.\n\nDespite Kimmel’s suspension being announced the night prior, the Hot Topics conversations on Thursday only focused on the congressional hearings of FBI Director Kash Patel and HHS Secretary Robert F. Kennedy Jr. respectively.\n\nJoy Behar did seem brave enough to take a swing at President Trump while mocking Patel. “You know, Trump famously said he likes the poorly educated. He also seems to like the unqualified and the uninformed. I mean if the FBI director does not know the information, who is supposed to know, my dentist?” she chided.\n\nSunny Hostin also seemed brave when she suggested that Kennedy had committed perjury. Although, she did seem to hedge it (Click “expand”):\n\nCan I say to the testimony that we just saw from RFK Jr. and also from the former director of the CDC, when I used to interview people as a federal prosecutor, one of the first things I said was, “By the way, I'm a federal prosecutor, lying to a federal prosecutor is a crime. Punishable -- it's called perjury and it’s punishable by five years in federal prison. Let's now begin our interview.\n\nAnd I'm not saying that anyone lied in front of Congress, but lying to Congress is a federal crime. And so, that distinction between what happened between the human health services head and the former head of the CDC is something that I think the Justice Department should look into.\n\nAlso during that episode, they had a segment where they discussed the notion of whether or not you should experience a break up with someone before you marry them.\n\nFriday episodes of The View were often pre-recorded on Thursdays. The show’s relatively recent move to stop announcing which episodes were recorded live, made it difficult to precisely ascertain the timelines for then new shows were recorded in relation to breaking news. In this case, Carr’s suggestion that The View could be under the microscope.\n\nThe only Hot Topics segment they did on Friday’s episode was once again about former Vice President Kamala Harris’s new book about the 2024 presidential election. Pitched as a preview of what they’ll discuss with Harris during her appearance on the show next Tuesday, they talked about her regret of not picking former Transportation Secretary Pete Buttigieg to be her running mate.\n\nIn the most heated part of the conversation, Hostin tried to cry racism and sexism as usual, but there seemed to be an even stronger effort to hedge (Click “expand”):\n\nHOSTIN: I too wish that the Vice President had gone with her gut because I think Pete Buttigieg would have been -- could have been a game changer. But I also know – through my lived experience as a black woman in this country – that that is what people see first when they see you, not you perhaps [points to Sara Haines], perhaps not you [points to Alyssa Farah Griffin], but a lot of people see that and they define me by that, and that is unfortunately a fact of life here.\n\nBEHAR: But they did vote for a black guy twice.\n\nHOSTIN: Yes, they did but not a black woman. Okay? Hillary Clinton arguably was the most qualified candidate for the presidency that we've had, perhaps. [Applause] And they couldn't get past that.\n\nAfter they ended that segment, they discussed Martha Stewart’s thirst traps and their WikiFeet scores; WikiFeet being the website were creepy people posted images of celebrities’ feet and rate them. Hostin had all their scores: “Joy, you score a 4.07 out of five … Ana, 4.38 … Alyssa, 4.43. Sunny, 4.46. Sara, 4.83.”\n\nAnd out of their five guests over the course of those two days, none of them discussed politics.","summary":"If ABC’s The View was known for anything, it was that the six co-hosts were loud and very opinionated. But for two airings, on Thursday and Friday, the liberal ladies had not so much as alluded to the story which dominated much of the liberal media’s time and fearmongering in the latter part of the week: ABC’s suspension of Jimmy Kimmel. Instead, there seemed to be an undercurrent of angst as their infamous “Hot Topics” segments came off as a bit blunted and they covered bizarre things like hyping their WikiFeet scores.\n\nNot long before going their summer hiatus, The View was very vocal in their defense of “comedian” Stephen Colbert after CBS announced that they were canceling his show. “Because it's very clear that if it is political, this is the dismantling of our democracy. This is the dismantling of our Constitution,” Hostin declared at the time. “That means the very rubric of our democracy is being dismantled. And I think every single person should be really, really concerned about it.”\n\nA pretty strong ","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/09/19/view-goes-silent-kimmel-suspension-show-their-wikifeet","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-09/The%20View-11_17_46%20am-2025-09-19-0.jpg?itok=wm1ag8o_","video":null,"publish_date":"2025-09-19 15:56:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","source_country":"US","sentiment":-0.295},{"id":361863228,"title":"Kamala Harris knifes potential 2028 rival Josh Shapiro as too thirsty for power and perks","text":"Former Vice President Kamala Harris reveals in her book that Pennsylvania Governor Josh Shapiro was off-putting and very demanding when she met with him to consider him as a running mate for her failed 2024 presidential campaign. \n\nHarris described Shapiro as someone who was 'peppering' her and her staff with questions about the details of the jobs, according to a report from Politico, including details on the vice president's residence at the Naval Observatory.\n\nShapiro wanted to know how many bedrooms there were, and whether he could arrange to have more art from Pennsylvania artists in the home if he was elected vice president.\n\nHe also wanted to make sure he would be in the room before Harris made her final decision on any significant political issue.\n\nThe demand was similar to that of former President Barack Obama's concession to then-Senator Joe Biden who he chose as vice president.\n\nThe thought from Democratic consultants was that Shapiro would be a perfect running mate for Harris, due to his popularity in an important swing state.\n\nWhat Harris did not discuss was the real campaign consultant concern that Shapiro's Jewish identity and support for Israel could anger Democrat voters who upset with the Biden administration's support of the war against Hamas in Gaza.\n\nShe also zinged Shapiro for his 'lack of discretion' in the process, as he appeared to want it to be known that he was among the possible selection candidates.\n\nShapiro was one of the final three finalists along with Sen. Mark Kelly and Gov. Tim Walz.\n\nShapiro was considered to be wildly ambitious politically, which Harris advisors believed could emerge as a real threat to her leadership.\n\nRight before Harris made her decision, however, Shapiro allies made it known to the press that he felt the meeting did not go well and that he was wrestling with his desire to remain governor of his state.\n\nThe pair of Democrats do not appear to be mending any fences ahead of a possible 2028 campaign. \n\nShapiro struck back at Harris on the revelation that she felt she could not call for Biden to abandon a run for reelection.\n\n'She’s going to have to answer to how she was in the room and yet never said anything publicly,' Shapiro said in an interview with Stephen A. Smith on Thursday.","summary":"Former Vice President Kamala Harris reveals in her book that Pennsylvania Governor Josh Shapiro was off-putting and very demanding","url":"https://www.dailymail.co.uk/news/article-15115121/kamala-harrs-josh-shapiro-vice-president.html","image":"https://i.dailymail.co.uk/1s/2025/09/19/15/102286169-0-image-m-10_1758293748198.jpg","video":null,"publish_date":"2025-09-19 15:47:29","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":0.074},{"id":361863156,"title":"Seth Meyers 'freaking out' about his future after Trump called for him to be axed when Jimmy Kimmel's show was canned","text":"Seth Meyers is 'freaking out' about his late-night future after coming into the crosshairs of the Trump administration following the suspension of fellow host Jimmy Kimmel.\n\nNews of Disney's decision to pull Kimmel's ABC show after the host's comments about Charlie Kirk's accused killer led Trump to rejoice - while also taking aim at Meyers.\n\n'That leaves Jimmy [Fallon] and Seth, two total losers, on Fake News NBC,' Trump wrote on Truth Social. 'Their ratings are also horrible. Do it NBC!!!'\n\n'I do know Seth has been freaking out over this,' Puck's Matthew Belloni said.\n\nOn Thursday, Meyers accused the Trump administration of 'pursuing a crackdown on free speech,' following Kimmel's suspension in the face of threats from Federal Communications Commission Chairman Brendan Carr.\n\nA television expert told the Daily Mail that Meyers would be the next host to go due to networks' shift away from politically charged content.\n\nIn the Puck piece, entertainment reporter Kim Masters added that the decision to suspend Kimmel has roiled top brass at Disney.\n\nShe said that company co-chair Dana Walden 'is pretty shook, too', as she and Disney CEO Bob Iger made the call to suspend Kimmel. \n\nIf the decision backfires, it could hurt Walden's chances at becoming the next CEO. \n\nAn insider told the Wall Street Journal that Disney is monitoring the situation and sees a path forward for a Kimmel return 'in the next several days.' \n\nBut a meeting between Disney and Kimmel on Thursday aimed at finding a way forward reportedly ended without resolution. \n\nThat could leave Meyers the last late-night Trump critic standing at a major network.\n\nFallon has generally remained apolitical, while Trump-bashing Stephen Colbert's CBS show is already set to be cancelled in May. \n\nCBS parent company Paramount was accused of axing Colbert to avoid the administration's wrath.\n\nThe decision came days after Paramount agreed to pay Trump $16million to settle a lawsuit he filed over a 60 Minutes interview with Kamala Harris.\n\nThe settlement was seen by many as a necessary move to earn the Trump administration's approval of an $8million merger with Skydance.\n\nLast year, Disney paid $16million to Trump to settle a suit he filed against ABC News after anchor George Stephanopoulos suggested Trump had been found civilly liable for the rape of writer E. Jean Carroll.\n\nTrump had actually been found liable for sexually abusing Carroll in a Manhattan department store dressing room in the mid-'90s. \n\n'Maybe Trump's agenda was preordained, but bullies tend to be emboldened when they get what they want, and Iger should have known that - a big judgment error,' said Belloni said, calling Trump's suit 'very winnable' for ABC.\n\n'I'm not sure the Kimmel situation would have happened if Iger hadn’t first agreed to pay Trump $16million.","summary":"On Thursday, Seth Meyers accused the Trump administration of 'pursuing a crackdown on free speech' following Jimmy Kimmel's suspension.","url":"https://www.dailymail.co.uk/media/article-15114549/seth-meyers-jimmy-kimmel-future-donald-trump.html","image":"https://i.dailymail.co.uk/1s/2025/09/19/15/102283837-0-image-m-19_1758290403463.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/19/2609417835431968309/1024x576_MP4_2609417835431968309.mp4","publish_date":"2025-09-19 15:45:57","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.051},{"id":361842522,"title":"EXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother!","text":"Star Seeker \n\n Skip to content\n\n Main Navigation \n\nRelationships\n\nControversy\n\n \nTori Spelling\n \n\nEXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother! \n\nBad mom or nah? Tori Spelling…\n\nRelated Posts\n\n Adam Brody, Anna Faris, Eugene Levy, & More Stars Whose Homes Were Destroyed In The Devastating California Wildfires \n\n Tori Spelling Wishes Mom Candy A Happy 78th Birthday After Rift Over Inheritance Revealed \n\n Tori Spelling Broke Down Crying When She Learned Father's Fortune Was Going Entirely To Her Mother Candy \n\n Candy DID Offer Tori Spelling A House -- But She Turned It Down?! \n\n CLICK HERE TO COMMENT\n \n\nSep 19, 2025 08:44am PDT\n\nCandy Spelling\n\nExclusives!\n\nTori Spelling\n\nKamala Harris Reveals That Donald Trump Is Very Different In Private! And Joe Biden Left Her Shaken When:\n\n \n\nBlake Lively Taught Me This! | Perez Hilton\n\n \n\nThis Is Strong Language! Do U Agree, Though?\n\n \n\nCandace Owens Is Lying - A Lot! Bhad Bhabie UNHINGED! Shocking New Kimmel Details! And More HOT TOPICS!\n\n Click To Watch\n\nFollow Perez\n\nTop Celebrities\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n View All Celebrities\n\nLatest Video\n \n\nEXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother!\n\n Galleries\n\n PerezTV\n\n \n\n \nAdvertising\n \n\n \n\n \n\n \n\nCopyright © 2025 PerezHilton.com | All Rights Reserved\n\nDo Not Sell My Personal Information","summary":"Bad mom or nah? Tori Spelling&#8230; [...]\n\n\nRead More...\n\n\nThe post EXCLUSIVE! Tori Spelling Snubbed - By Her Own Mother! appeared first on Perez Hilton.","url":"https://perezhilton.com/exclusive-tori-spelling-snubbed-by-her-own-mother/","image":"https://i3.ytimg.com/vi/ChUkZjrFeag/hqdefault.jpg","video":null,"publish_date":"2025-09-19 15:44:33","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.24},{"id":361833782,"title":"Joe Rogan Says He's Not a Republican—'You're Gonna Need Some Socialism'","text":"Joe Rogan, the host of one of the most prominent podcasts in the world, said on Thursday's show that he is not a Republican and that \"the idea of some socialism is wonderful.\"Why It MattersRogan's voice has become one of the most influential in American politics because of his large listener base, which on YouTube alone exceeds 20.2 million subscribers. He's had individuals across the political spectrum on his program, including President Donald Trump and Senator Bernie Sanders of Vermont. As of this week, his podcast was the most listened to on Spotify and No. 4 on Apple Podcasts.The comedian and actor has garnered his fair share of criticism over the years—including during the 2024 presidential election cycle when he had Trump and his running mate, JD Vance, on the program while an interview with the Democratic candidate, then-Vice President Kamala Harris, never came to fruition.What To KnowRogan interviewed comedian, actress and podcaster Jordan Jensen on Thursday's episode of The Joe Rogan Experience. About an hour into the three-hour conversation, Rogan said, \"I'm not even a Republican.\"He said he voted for Trump because he was worried about Joe Biden's presidency and how he \"was not really a president for four years,\" adding that the same people would run the government if Democrats won again in 2024.Jensen asked, \"Weren't you like a Bernie bro?\" And Rogan replied in the affirmative.\"I've only voted Republican once in my life,\" Rogan said. While discussing his comedy club, he added. \"The idea that you have to be a Republican to get into that club is so ridiculous. That club is filled with gay people, Black people, straight people, white people, Asian—nobody gives a f***. You're just doing comedy.\"After Rogan mentioned that he has had dinner with conservatives such as Tucker Carlson, Jensen again asked whether he was a \"Bernie bro.\"\"I am—look, I think the idea of socialism is wonderful if everybody had their s*** together and everybody was disciplined,\" Rogan said. \"But it's not the case, and I think that human nature, unfortunately, you're gonna need some socialism though, right? You're gonna need the fire department.\"He continued: \"Like, this is one of the things that I point to all the time. People say, 'Oh, socialism doesn't work.' The fire department is an entirely socialist idea. Like, we all pay into it, and they take care of everybody's fire. Right? You can't have only the rich people have a fire department. And the poor people, their f****** house burns down all the time. That's crazy, right? We all agree to that.\"Rogan said the same perspective should be extended toward other parts of society, be it education or health care.\"Are we a f****** community or are we not, and if we're a community, you have to take care of the downtrodden, and you have to do it because it's bad for them and it's also bad for you,\" he said. \"We're all in this together. So you have to have a social safety net. I believe in all that.\"He added: \"But I also believe you can't just give people free money because then they rely on it, and they become dependent on it, and then it takes away their ambition, and then they don't do anything. That's true, too. That doesn't mean you're not compassionate.\"I don't like either one of these parties. I don't think there's a solution that's correct. I think you have overcorrection after overcorrection. I think the country goes one way, and then it swings hard the other way. … Everyone is so tribal, and everyone's so locked into their idea that they're the good guys and these are the bad guys.\"Rogan and Bernie SandersIn 2020, when Sanders—an independent senator who caucuses with the Democrats—was running for president, Rogan said on The Joe Rogan Experience that he would \"probably\" vote for him in the Democratic primary.That endorsement made some of Sanders' supporters uncomfortable at the time because of the perception around Rogan and his past stances.On a repeat appearance by Sanders this past March, Rogan said health care \"100 percent should be socially funded.\"\"I think that Medicare and Medicaid—having programs where people who are hurt can get an operation, and it's not going to bankrupt them for the rest of their life, is another thing that I think society should be,\" Rogan said at the time.He continued, \"It should be a part of our agreement to take care of each other as a community, that we chip in money for what people would think of as socialist positions.\"Sanders said Rogan was \"absolutely right\" after the fact and shared the viral clip on his social media accounts.Epstein 'Line in the Sand'In July, during a conservation with former CIA officer Mike Baker, Rogan said the conversations surrounding the death of convicted sex offender Jeffrey Epstein and the government files related to the case were \"a line in the sand\" for him.\"We thought Trump was going to come in and a lot of things are going to be resolved,\" Rogan told Baker. \"We're going to drain the swamp. We're going to figure everything out.\"\"You have this one hardcore line in the sand that everybody has been talking about forever, and then they're trying to gaslight you on that,\" he added.The podcaster also seemed to question Trump's remarks regarding Epstein and the release of the files after the president asked a reporter earlier this summer: \"Why do you care? Why does everyone care about Epstein?\" Rogan referred to it all as \"crazy.\"Trump had suggested during the campaign that his administration would be transparent about the files' release, as did other officials in his administration—including FBI Director Kash Patel.However, questions about the files and any purported connection to the president have only escalated. Hearings took place on Capitol Hill this week, with members of Congress grilling Patel on the contents of the files and why more information was not publicly released.","summary":"\"I don't like either one of these parties,\" Rogan said on Thursday's episode. \"I don't think there's a solution that's correct.\"","url":"https://www.newsweek.com/joe-rogan-republicans-socialism-podcast-epstein-2132501","image":"https://d.newsweek.com/en/full/2725934/joe-rogan.jpg?w=1600&h=900&q=88&f=085e045fdc5bb3542872696faec094d2","video":null,"publish_date":"2025-09-19 15:36:13","author":"Nick Mordowanec","authors":["Nick Mordowanec"],"language":"en","category":"politics","source_country":"US","sentiment":-0.271},{"id":361842018,"title":"AOC is plotting a run for president in 2028: report","text":"Democratic Representative Alexandria Ocasio-Cortez, a progressive who has cemented her popularity with young voters, is reportedly considering running for president or the Senate in 2028.\n\nOcasio-Cortez, 35, made a splash when she was elected to represent New York’s 14th congressional district, located in the Bronx and Queens, in 2019. Now, the Democrat is reportedly considering taking the next step in her political career as the party searches for its next generation of leaders, Axios reported Friday. \n\nMembers of Ocasio-Cortez’s team have recently been positioning the progressive lawmaker, known as AOC, to either run for president or run for a Senate seat.\n\nShe’s embarked on a nationwide tour called “Fighting Oligarchy” with Vermont’s Independent Senator Bernie Sanders, held town halls outside of her district in upstate New York, and raised $15 million.\n\nBut Ocasio-Cortez has not made a final decision, according to Axios. \n\nThe Independent has asked a spokesperson for Ocasio-Cortez for comment. \n\nAccording to the Axios report, Ocasio-Cortez has brought in former senior advisers to Sanders, a longtime progressive who launched two unsuccessful presidential campaigns that garnered national attention.\n\nOcasio-Cortez already has a national presence thanks to the high volume of press she received when she and other young progressives were elected to Congress in 2019. Since then, she’s grown her presence with young voters by engaging with them on social media on pressing topics like affordability, gun violence, climate change, reproductive rights, and more. \n\nWhile she’s popular with young voters, Ocasio-Cortez would also be challenging other established Democrats for the coveted party nomination if she were to run. \n\nOther names in the pool of potential candidates include former Vice President Kamala Harris, California Governor Gavin Newsom, Michigan Governor Gretchen Whitmer, and former Transportation Secretary Pete Buttigieg.\n\nThose close to Ocasio-Cortez told Politico earlier this year that it’s unclear if she would throw herself into the presidential race because of her focus on the Democratic Party, not personal ambition.\n\n“She doesn’t think the same way that so many other people do. She’s not thinking about, like, ‘Oh, what’s the next step on the ladder?’” said Democratic Representative Greg Casar of Texas, told Politico. “She really thinks about what’s right for the movement.”\n\nWhen asked about a potential presidential run, Ocasio-Cortez has dodged the question and redirected her answer to focus on building momentum in the Democratic Party.\n\nSome have allegedly pushed Ocasio-Cortez to run for Senate and challenge the incumbent, Minority Leader Chuck Schumer.\n\nSchumer, 74, is up for re-election in 2028. He’s represented New York in the Senate since 1999.\n\nPolling consistently shows that Democrats want to see the party change, especially by elevating younger lawmakers in leadership positions. Schumer in particular has faced criticism for siding with Republicans earlier this year on a spending bill to keep the government from shutting down.","summary":"She’s embarked on a nationwide tour with Vermont’s Independent Senator Bernie Sanders, held town halls outside of her district in upstate New York, and raised $15 million","url":"https://www.independent.co.uk/news/world/americas/us-politics/aoc-presidential-race-2028-senate-b2829945.html","image":"https://static.independent.co.uk/2025/07/15/19/56/SEI255288854.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/o1ONdzfM-4VHSaSK0.mp4","publish_date":"2025-09-19 15:34:23","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":0.415},{"id":361841750,"title":"Former White House Chief Spills Alarming New Details On Biden’s Cognitive Decline","text":"Former President Joe Biden’s chief of staff, Jeff Zients, admitted to congressional investigators this week that Biden’s memory had deteriorated and he needed constant hand-holding in the final years of his administration, according to multiple reports.\n\nZients, one of the highest-ranking aides to speak openly about Biden’s decline, spent roughly six hours behind closed doors on Thursday with the GOP-led House Oversight Committee, according to CNN. His account added new details to the long-running investigation into Biden’s fitness for office and his controversial use of the autopen for last-minute pardons.\n\nThe former chief of staff testified that after Biden’s devastating June 2024 debate with President Donald Trump, he suggested to White House physician Kevin O’Connor that Biden needed a comprehensive medical workup, including a cognitive exam, a source familiar with the matter told the New York Post. Publicly, however, then-White House staffers dismissed Biden’s poor debate performance as the result of a “cold.” (RELATED: New Docs Blow Open Biden Autopen Scandal, Put Spotlight On Kamala Harris) \n\n 🚨Joe Biden’s Chief Jeff Zients ADMITTED to Congress: Jill Biden spoke with him about ensuring Joe Biden got more rest. Following the disastrous debate, he recommended that President Biden undergo a cognitive test. Hunter Biden was involved in pardon meetings. @seanhannity pic.twitter.com/fC4QDoAKOH — Rep. James Comer (@RepJamesComer) September 19, 2025 \n\nZients told investigators that Biden’s well-known struggles with remembering names and dates grew noticeably worse over time, and decisions that had once required three meetings eventually grew to four, according to the New York Post. \n\nThe former chief of staff also revealed that the former president’s son, Hunter Biden, was involved in discussions about presidential pardons near the end of Biden’s term, attending meetings on some of the most controversial decisions, Axios reported.\n\nDuring his four years in the White House, Biden granted 4,245 acts of clemency, more than any previous president on record, according to the Pew Research Center. All of Biden’s pardons from December to January — including those for family members, Dr. Anthony Fauci and Gen. Mark Milley — were reportedly signed by autopen, except for the preemptive pardon for Hunter.\n\nZients also testified that Jill Biden intervened to manage her husband’s schedule, asking him to ensure he returned to the residence earlier in the evening and to avoid overloading him with meetings, according to the outlet. Former Deputy Chief of Staff Annie Tomasini also discussed limiting Biden’s workload and reducing the distance he needed to walk, even recommending cutting down on the use of stairs, the outlet reported. \n\nThe former chief of staff’s testimony capped off the Oversight Committee’s interviews with former Biden officials as part of its investigation into the previous administration’s potential cover-up of Biden’s cognitive decline. \n\nEarlier witnesses, including ex-spokesmen Ian Sams and Andrew Bates, admitted they rarely met with Biden personally and instead relied on senior aides to vouch for his fitness. Former press secretary Karine Jean-Pierre, who has since left the Democratic Party and announced a tell-all book on the Biden administration, also testified.\n\nSeveral others — including Jill Biden’s top aide, Anthony Bernal, and O’Connor, Biden’s personal physician — invoked the Fifth Amendment rather than answer questions about the former president’s condition.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"Former President Joe Biden’s chief of staff, Jeff Zients, admitted to congressional investigators this week that Biden&#8217;s memory had deteriorated and he needed constant hand-holding in the final years of his administration, according to multiple reports. Zients, one of the highest-ranking aides to speak openly about Biden’s decline, spent roughly six hours behind closed doors [&#8230;]","url":"https://dailycaller.com/2025/09/19/former-white-house-chief-spills-alarming-new-details-on-bidens-cognitive-decline/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-1461459055-scaled-e1758291829306.jpg","video":null,"publish_date":"2025-09-19 15:18:38","author":"Melissa O'rourke","authors":["Melissa O'rourke"],"language":"en","category":"politics","source_country":"US","sentiment":0.063},{"id":361854960,"title":"How Donald Trump’s Culture-Wars Playbook Felled Jimmy Kimmel","text":"The story of Kimmel’s suspension isn’t a straightforward one. Bob Iger, the C.E.O. of Disney, which owns ABC, and Dana Walden, the studio’s TV chief, chose to put the show on ice after two major local-station groups, Nexstar and Sinclair, refused to air it. (Sinclair, a conservative conglomerate, went so far as to demand that the host apologize to Kirk’s family and make a donation to his organization, Turning Point USA.) Kimmel was reportedly prepared to address the furor on air; Disney executives pulled the show instead. Donald Trump, who’d called for ABC to drop Kimmel as far back as 2018, crowed, inaccurately, on Truth Social that it had been “CANCELLED,” and suggested that Kimmel’s fellow late-night hosts Jimmy Fallon and Seth Meyers should be ousted, too. An emboldened Carr indicated that he would train his sights on ABC’s daytime talk show “The View”—another thorn in Trump’s side—next.\nThe monologue that led to Kimmel’s involuntary hiatus was thoroughly unexceptional for the show. In fact, it was a neat encapsulation of his comedic persona: that of a regular guy whose political impulses are rooted in common sense. After decrying the conduct of the “MAGA gang,” he mocked Trump’s response to a reporter’s question about Kirk, which was to immediately change the subject to the White House’s ballroom renovations. (“He’s at the fourth stage of grief: construction,” Kimmel joked. He added, more seriously, “This is not how an adult grieves the murder of someone he called a friend. This is how a four-year-old mourns a goldfish.”) Prior to his monologue, the comedian had issued a statement on social media that exhibited the populist decency he’s become known for: “Instead of the angry finger-pointing, can we just for one day agree that it is horrible and monstrous to shoot another human? On behalf of my family, we send love to the Kirks and to all the children, parents and innocents who fall victim to senseless gun violence.”\nKimmel’s censorship comes just two months after the cancellation of Stephen Colbert’s “Late Show,” under similar duress, but the differences between the two incidents are significant. Colbert got nearly a year’s notice before the end of his show, giving him time to conclude things on his own terms. In contrast, the abruptness of Kimmel’s suspension has sent shock waves throughout Hollywood. His bro-y mode of political comedy has made him a pillar at ABC, where he’s hosted everything from game shows to the Oscars. Over the past several weeks, his good-guy instincts have been seen even in his Emmy campaign—which was not for his own nominated series but for Colbert’s.\nWhat a self-own. Trump already had one over on resistance comedians; his absurdities make him famously “satire-proof,” and he can be pretty funny himself, especially when it comes to insult comedy. (“Meatball Ron,” his nickname for his onetime rival Ron DeSantis, is still a perfect put-down.) But the President is surrounded by a more sycophantic set this time around, and seems more brittle in the face of dissent. Lately, he’s responded to barbs by shutting down free speech entirely—once again laying bare the right’s highly selective defense of that ideal.\nHe wouldn’t be able to do this without the acquiescence of the media companies involved. When Trump brought a frivolous lawsuit against ABC News for the use of the word “rape” to describe his assault of E. Jean Carroll—a case that many thought the network could win with ease—Disney offered a settlement of fifteen million dollars instead. (At the time, Iger was desperate to mollify MAGA; DeSantis, Florida’s governor, had threatened to eliminate Disney World’s tax benefits after the company opposed his “Don’t Say Gay” bill.) Trump then went after CBS News for routine edits to a Kamala Harris interview; the network, whose parent company needed the F.C.C.’s blessing for a merger, settled for sixteen million dollars. He has since sued the Times and the Wall Street Journal for their reporting on his finances and his connections to Jeffrey Epstein, respectively, and has threatened to come after NBC’s broadcasting license. Some of his targets have learned through bitter experience that preëmptive appeasement only opens the door to escalating demands. Give this Administration an inch, and they’ll take a mile. As Carr said on Thursday, “We’re not done yet.”\nLong before Trump’s return to the White House, Kimmel flirted with the idea of retirement; it’s possible we wouldn’t have seen new “Jimmy Kimmel Live!” episodes past 2026 anyway. But Disney’s decision seems intended not only to appease the owners of local affiliates but also to insure that the F.C.C. will approve a deal between the N.F.L. and the media giant’s subsidiary ESPN. It would be one thing for someone like Fallon or Meyers to go out because of falling ratings; it would be quite another if they were treated as pawns to be sacrificed. In some markets, Kimmel’s show will be replaced tonight by a tribute to Charlie Kirk. So far, the gap in the schedule has been filled by Steve Harvey’s “Celebrity Family Feud”—presumably the kind of programming that Trump would prefer, because it says nothing at all. But late-night hosts, even if they’re no longer the last people we see before falling asleep, forge a bond with their audiences born of familiarity and routine. Their voices and views are a part of our lives. The genre’s relevance has increasingly been questioned, but the absence of these figures may only hasten their employers’ obsolescence. Boycotts of Hulu and Disney+ have begun. The networks muzzle themselves at their own risk. ♦","summary":"The late-night host’s show was pulled from the air after an F.C.C. pressure campaign—one that’s part of a much broader Presidential agenda.","url":"https://www.newyorker.com/culture/on-television/how-jimmy-kimmel-succumbed-to-donald-trumps-culture-wars-playbook","image":"https://media.newyorker.com/photos/68cc6c649a17cdf3870ad28f/16:9/w_1696,h_954,c_limit/Kang_Kimmel_GettyImages-2152762887.jpg","video":null,"publish_date":"2025-09-19 15:10:09","author":"Inkoo Kang","authors":["Inkoo Kang"],"language":"en","category":"politics","source_country":"us","sentiment":-0.083},{"id":361832130,"title":"Nine Inch Nails Leap Into the AI Nightmare","text":"Skip to main content\n\nSeptember 19, 2025\n\nNine Inch Nails\n\nJohn Crawford*\n\nTrent Reznor usually keeps his highbrow Oscar-winning soundtrack composer side relatively separate from his main gig running Nine Inch Nails. But the soundtrack he and longtime collaborator Atticus Ross have cooked up for TRON: Ares is the first time he’s ever slapped the NIN brand on his film work. The new album, the first Nine Inch Nails record in five years, finds Reznor elbow-deep in all his favorite bags: Eighties synth bellyaching, industrial-rock violence, metal machine minimalism, wintry piano miniatures, the second side of David Bowie’s Low, and the sweatiest corner of the all-ages goth club.\n\nOf the 24 songs here, we get four with Reznor’s vocals. “As Alive As You Need Me to Be” is pure old-school Nine Inch Nails black gold — scabrous dark-sider gear grind and Reznor rhyming “infection” and “connection” in a ritual return to his great themes of power, submission, and control. The plot twist is a vocoder “yeah yeah yeah“ refrain that evokes Daft Punk soundtracking a graveyard rave. “I Know You Can Feel It” sounds like a mad Nineties grunge song eating a sad Nineties trip-hop song as Reznor delivers a hymn to predatory anticipation. The dejectedly gorgeous “Who Wants to Live Forever?” sets his forlorn moan-croon over ambient ice sheets and gets a lovely, understated duet assist from Spanish artist Judeline. And he ends the proceedings with another hunk of rage-in-a-cage doom-disco, “Shadow of Me.” Equally torrid tracks like “A Question of Trust” and “Target Identified” might’ve turned into similarly hot contributions to the NIN canon if Reznor had added vocals. \n\nTrending Stories\n\nBrett James, Songwriter for Carrie Underwood and Kenny Chesney, Dead at 57\n\nLive Nation and Ticketmaster Sued for Working With Scalpers to Make Millions on Resale Tickets\n\nCardi B Is Back and Out For Blood on 'Am I the Drama?'\n\nDiane Martel, Trailblazing Music Video Director of 'We Can't Stop,' 'Blurred Lines,' Dead at 63\n\nThe rest of the album is engrossing film-score flotsam. The last two Nine Inch Nails releases, 2020’s Ghosts V: Together and Ghosts VI: Locusts, saw Reznor wander into the deepest reaches of beatless abstract bleakness with surprisingly compelling results. A lot of this stuff follows the same thread, often steeped in vintage synth drones, whirrs, and buzzes that evoke the turn-of-the-Eighties sci-fi futurism the first TRON movie embodied back in 1982. Reznor is also an executive producer on the new installment of the franchise, which is about mankind’s first encounter with AI beings, and he leans into the dystopian creepiness of that concept with the titles and vibes of “Building Better Worlds” and “Empathetic Trust.” To quote one of Reznor’s alt-rock fellow travelers, we’ll make great pets.\n\nOnly a masochist would sit down and listen to the whole hour-plus of this front to back — which means it’s perfectly targeted for Nine Inch Nail’s core audience. Taken in isolation, some of its best moments — like the Erik Satie-gone-Cylon “Echoes” and the slinky, bass-bomb implosion “Infiltrator” — present nice twists on the tension between of all-too-human hunger and android angst Reznor has been playing with for decades. For the next real Nine Inch Nails record, he should go for a more fully fleshed-out balance of aggression and abstraction. We might get a new-look Downward Spiral for our times.\n\nD4vd’s Deluxe Album Shelved, Tour Scrapped as Investigation Into Body Found in Car Continues\n\nCourts and Crime\n\nJon Blistein\n\nWatch Dua Lipa’s Rousing Cover Of Blondie’s ‘One Way or Another’\n\nCardi B Raps About Both Kamala Harris and Offset, Plus 8 Other Takeaways From ‘Am I The Drama?’\n\nRolling Stone\n\nJulia Michaels Is Carefree in NYC in Her ‘No Heartbreak’s Killed Me Yet’ Video\n\nLola Young Revels in Her Own Chaos on ‘I’m Only F**king Myself’\n\nAlbum Review\n\nMaura Johnston\n\nGo to PMC.com\n\nMost Popular\n\nABC Pulls 'Jimmy Kimmel Live!' Indefinitely After Host's Charlie Kirk Comments\n\nABC Suspends 'Jimmy Kimmel Live!' \"Indefinitely\" Over Charlie Kirk Shooting Comments\n\nWhy Taylor Swift’s Attendance at the Chiefs’ Season Opener Isn’t a Total Guarantee\n\nTrump Orders National Park to Remove Famed Photograph of Formerly Enslaved Man\n\nYou might also like\n\nD4vd Cancels U.S. Tour Amid Investigation Into Dead Body in Car Registered to Him\n\n3 hours ago\n\nArnold Schwarzenegger Reminds Everyone Just How Expensive His Divorce From Maria Shriver Was\n\n3 hours ago\n\nFrom Fertility Supporting Lubricant and Libido-enhancing Supplements to Retail Commitment and Brand Expansion, Women’s Wellness Is Broadening\n\n2 hours ago\n\nJon Stewart’s Comic Capitulation to Trump on ‘The Daily Show’ Stood Out — and Stood Up\n\n4 hours ago\n\nStubHub vs. Ticketmaster vs. SeatGeek: What’s the Difference?\n\n3 hours ago\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.\n\nPowered by WordPress.com VIP","summary":"The soundtrack for TRON: Ares sees Trent Reznor and Atticus Ross balance abstraction and aggression","url":"https://www.rollingstone.com/music/music-album-reviews/nine-inch-nails-tron-ares-review-1235430933/","image":"https://www.rollingstone.com/wp-content/uploads/2025/09/NIN-Press-Image.jpg","video":null,"publish_date":"2025-09-19 15:06:51","author":"Jon Dolan","authors":["Jon Dolan"],"language":"en","source_country":"us","sentiment":0.497},{"id":361832132,"title":"Watch Dua Lipa’s Rousing Cover Of Blondie’s ‘One Way or Another’","text":"Skip to main content\n\nSeptember 19, 2025\n\nDua Lipa performs during the Radical Optimism Tour at Scotiabank Arena on September 01, 2025 in Toronto, Ontario.\n\nKevin Mazur/Getty Images\n\nDua Lipa paid homage to another hometown classic Thursday night at Madison Square Garden, performing a cover of Blondie’s “One Way or Another” during her Radical Optimism tour. “Here in New York, I’m actually spoiled with the choice,” she told the crowd, before revealing, “tonight we thought we could do something [by] a real New York icon…let’s just go for it.”\n\nFans began cheering as soon as the guitar riffs started, and sang every word of Dua’s cover of the 1978 track with her and her band, all clad in black. \n\nA concert attendee who uploaded the video to YouTube captured Dua and her band digging into the rendition, singing in close quarters toward the end of the song. Fans gave her around a 20-second ovation.\n\nTrending Stories\n\nBrett James, Songwriter for Carrie Underwood and Kenny Chesney, Dead at 57\n\nLive Nation and Ticketmaster Sued for Working With Scalpers to Make Millions on Resale Tickets\n\nCardi B Is Back and Out For Blood on ‘Am I the Drama?’\n\nDiane Martel, Trailblazing Music Video Director of 'We Can't Stop,' 'Blurred Lines,' Dead at 63\n\nIt’s just the latest cover that Lipa’s done while on her marathon international tour, which also includes Aerosmith’s “I Don’t Want To Miss A Thing,” ACDC’s Highway To Hell,” and Sinead O’Connor’s “Nothing Compares To You.” She’s also sung a range of songs in different languages while overseas, including Alizée’s “Moi… Lolita,” in Paris, and the Spanish language version of Enrique Iglesias’ “Héroe” in Madrid. \n\nDua Lipa’s Radical Optimism tour, which began last November, continues in New York City through September 21, then heads to Miami for two dates before going west, concluding its US leg in Seattle on October 16. She’s then performing a slew of dates throughout South America before concluding in Mexico on December 5.\n\nNine Inch Nails Leap Into the AI Nightmare\n\nAlbum Review\n\nD4vd’s Deluxe Album Shelved, Tour Scrapped as Investigation Into Body Found in Car Continues\n\nCourts and Crime\n\nJon Blistein\n\nCardi B Raps About Both Kamala Harris and Offset, Plus 8 Other Takeaways From ‘Am I The Drama?’\n\nRolling Stone\n\nJulia Michaels Is Carefree in NYC in Her ‘No Heartbreak’s Killed Me Yet’ Video\n\nLola Young Revels in Her Own Chaos on ‘I’m Only F**king Myself’\n\nAlbum Review\n\nMaura Johnston\n\nGo to PMC.com\n\nMost Popular\n\nABC Pulls 'Jimmy Kimmel Live!' Indefinitely After Host's Charlie Kirk Comments\n\nABC Suspends 'Jimmy Kimmel Live!' \"Indefinitely\" Over Charlie Kirk Shooting Comments\n\nWhy Taylor Swift’s Attendance at the Chiefs’ Season Opener Isn’t a Total Guarantee\n\nTrump Orders National Park to Remove Famed Photograph of Formerly Enslaved Man\n\nYou might also like\n\nABC Has No Good Options in Resolving the Jimmy Kimmel Crisis\n\n4 hours ago\n\nWould You Let Your 15-Year-Old Get Lip Fillers? A Surprising 1 in 6 Parents Would\n\n4 hours ago\n\nMark Ronson Celebrates Book Launch With Dua Lipa, The Dare & More\n\n3 hours ago\n\nJon Stewart’s Comic Capitulation to Trump on ‘The Daily Show’ Stood Out — and Stood Up\n\n3 hours ago\n\nStubHub vs. Ticketmaster vs. SeatGeek: What’s the Difference?\n\n2 hours ago\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.\n\nPowered by WordPress.com VIP","summary":"Performance became the latest hometown cover while on her Radical Optimism tour","url":"https://www.rollingstone.com/music/music-news/dua-lipa-cover-blondie-one-way-or-another-1235431053/","image":"https://www.rollingstone.com/wp-content/uploads/2025/09/dua-lipa-blondie-cover.jpg","video":null,"publish_date":"2025-09-19 14:39:31","author":"Andre Gee","authors":["Andre Gee"],"language":"en","source_country":"us","sentiment":0.135},{"id":361870888,"title":"'Always Made Everything About Himself': Kamala Harris Says She Was Angry With Joe Biden","text":"Kamala Harris revealed she was “angry and disappointed” after Joe Biden called her hours before her high-stakes debate with Donald Trump in 2024 to relay that powerful associates of his brother would not support her campaign. The former US Vice President and Democratic nominee recounted the incident in her new memoir 107 Days, offering sharp criticism of Joe Biden’s leadership and campaign style.\nIn the book, Kamala Harris writes that in September, while preparing in a Philadelphia hotel room for what she called a “big prizefight” debate, Joe Biden phoned to wish her luck. But the conversation quickly turned, she says, when Joe Biden mentioned his brother had spoken to political power brokers in Philadelphia who were unwilling to support her because she had been “saying bad things about him.”\n“I just couldn’t understand why he would call me, right now, and make it all about himself,” Kamala Harris writes, adding, “Distracting me with worry about hostile power-brokers in the biggest city of the most important state.”\nKamala Harris said that she then asked Joe Biden to connect her directly with the group but the then-US President instead shifted to rehashing his own poor debate performance against Donald Trump three months earlier.\n“I beat him the other time; I wasn’t feeling well in that last one,” Joe Biden insisted, according to Kamala Harris, who says she was “barely listening.” Her husband Doug Emhoff, sensing her frustration, urged her to “let it go” and refocus on Donald Trump.\nKamala Harris also recalled Joe Biden struggling to address the Supreme Court’s overturning of Roe v. Wade in 2022, writing that his words did not “meet the gravity of the moment.” She also expressed concern about Joe Biden’s campaigning abilities, noting, “His voice was no longer strong, his verbal stumbles more frequent.”\nKamala Harris also shared that she was sometimes castigated by Joe Biden’s team for speaking too well as she wrote in the book, “Their thinking was zero-sum: If she’s shining, he’s dimmed.”","summary":"Kamala Harris criticizes Joe Biden in her memoir 107 Days, revealing disappointment over his lack of support, debate distractions and concerns about his leadership.","url":"https://www.news18.com/world/always-made-everything-about-himself-kamala-harris-says-she-was-angry-with-joe-biden-ws-l-9584091.html","image":"https://images.news18.com/ibnlive/uploads/2025/08/Untitled-design-2025-08-356271cf7e4d8671a2ff0a82d7fdbadc.png","video":null,"publish_date":"2025-09-19 14:31:41","author":"Mallika Soni,News18","authors":["Mallika Soni","News18"],"language":"en","source_country":"in","sentiment":-0.146}]}