{"offset":0,"number":50,"available":326,"news":[{"id":382879614,"title":"Trump Tops Thanksgiving Guest List, While Runner-Up Choice Likely to Ruffle Presidential Feathers","text":"Thanksgiving Dinner might be the one occasion where political debates are set aside, but there’s always discussion about who deserves a seat at the table.\n\nRecent polling data has revealed that Donald Trump tops the list as the person Americans most want to invite for Thanksgiving.\n\nA survey conducted by the Daily Mail and JL Partners indicates that Trump is preferred over Barack Obama for this coveted holiday spot.\n\nAmong 841 participants, 24 percent selected Trump, while 15 percent opted for Obama.\n\nFollowing closely behind were former Vice President Kamala Harris and current Vice President JD Vance, taking third and fourth places, respectively.\n\nThis preference for Trump highlights a fascinating aspect of Americans’ holiday choices, adding complexity to the broader national conversation about political figures in the media spotlight.\n\nThe exclusive survey sampled 1,246 registered voters online in the United States with a 3 percent margin of error. It found that while Trump may top his presidential rival, a majority of Americans would still rather not host him for the holiday.\n\nThe poll’s most brutal revelation shows that when forced to choose between two iconic couples – Donald and Melania Trump, or Canadian Prime Minister Justin Trudeau and his romantic partner, Katy Perry – a whopping 35 percent of all respondents said ‘neither.’\n\nOnly 32 percent of Americans opted to spend the holiday with the Trumps, while 26 percent chose the Trudeau-Perry duo.\n\nDespite the clear snub against him as part of a couple, Trump remains the top choice when Americans are asked to select just one politician to spend Thanksgiving with.\n\nThe poll also ranked popular media personalities, asking voters to select who they would most and least like to spend Thanksgiving with.\n\nOverall, conservative commentator Ben Shapiro was the most wanted guest, with 24 percent of all respondents voting him in as the winner. His win was almost tied, neck-to-neck with Candace Owens at 23 percent.\n\nTucker Carlson took third place with 18 percent of the vote.\n\nHowever, Republicans themselves offered a contrasting view, naming Laura Ingraham as their top choice at 23 percent, closely followed by Carlson at 22 percent and Owens at 19 percent.\n\nRepublicans intriguingly placed Shapiro at the bottom of their preferred list, with 22 percent saying he was the one they would least like to spend the holiday with.\n\nFinally, the poll reveals an amusing look into which Thanksgiving roles Americans would trust the former president to handle.\n\nThe results suggest he is better left on the receiving end of the family toast, rather than doing any heavy lifting.\n\nAmericans would least trust Trump with making dessert, with 45 percent saying they would not have faith in him to do it at all.\n\nSimilarly, he was poorly regarded if tasked with decorating the house, despite all his White House renovations. He was also voted as poorly trusted with setting the table.\n\nHis highest trust rating was for giving the Thanksgiving toast and, in second place, carving the turkey.\n\nIt seems Americans prefer Trump to talk the talk, but he’s strictly barred from the kitchen this holiday season.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThanksgiving Dinner might be the one occasion where political debates are set&#8230;\n\n\nThis Post: Trump Tops Thanksgiving Guest List, While Runner-Up Choice Likely to Ruffle Presidential Feathers first appeared on Internewscast Journal","url":"https://internewscast.com/politics/trump-tops-thanksgiving-guest-list-while-runner-up-choice-likely-to-ruffle-presidential-feathers/","image":"https://internewscast.com/wp-content/uploads/2025/11/Trump-most-popular-politician-to-have-at-Thanksgiving-table-but.jpg","video":null,"publish_date":"2025-11-27 22:12:13","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.184},{"id":382894324,"title":"Don’t Take Thanksgiving for Granted","text":"The nation will this week partake in a ritual unlike any other in the rest of the world. Americans of all persuasions, races, and creeds will gather with family around the table and give thanks, most of them to the Almighty, for the bounty they have received this year.\n\nIt’s easy to take Thanksgiving for granted. And yet it is something uniquely American, and truly a wonder. It is a holiday that confirms that we as a country are committed to gratitude and to recommitting ourselves annually to this national character trait.\n\nIt acts as some sort of baptismal sacrament. Immigrants take their first timorous step toward Americanization when they start honoring this sacred holiday and learn to cook its dishes. And thereby, without being fully aware, they begin to incarnate the national spirit.\n\nIn personal terms, a disposition to be grateful renders important benefits, reducing anxiety and depression, and making us better companions and better sleepers. This is so self-evident it hardly requires research to substantiate it, but the evidence does exist.\n\nIn geopolitics, the thankful disposition draws a bright line between the United States and wretched states officially devoted to its opposite, ungratefulness. A commitment to gratitude may have been one of the things—right up there with love of liberty—that made America the historic sworn enemy of Marxism, whose guiding ideology, envy, is the wages of ingratitude.\n\nThanksgiving is unquestionably uniquely American. I have lived at least a year in seven countries, in Asia, Europe, and the Americas, many more if one counts shorter stays, and have never encountered anything like it anywhere else.\n\nYes, in East Asia, I experienced firsthand what the Koreans call the Chuseok festival, held on 15th day of the eighth month of the lunar calendar, so from late September to early October, depending on the year. But it’s not dedicated to giving thanks, but rather to the full moon.\n\nCanada, Liberia and the Caribbean island-nation of Grenada also have official Thanksgiving days, but they are derivatives of America’s.\n\nThanksgiving is not just uniquely tied to this country because it is reflective of the American national character. Its lineage is the thread of the national quilt.\n\nAnyone who has watched A Charlie Brown Thanksgiving, and its companion, The Mayflower Voyagers, will know the essentials of how the first Thanksgiving was celebrated by the Pilgrims and their Indian hosts in 1621 in the Plymouth Colony. Right there, Thanksgiving starts as a needed slap in the face to the “land acknowledgement” crowd.\n\n(And yes, it might be better to read a book and learn history right and not from Peanuts, but don’t underestimate the value of popular culture in propagandizing the national spirit. When Charlie Brown exclaims at the Thanksgiving table, “We thank the Lord for a bountiful harvest,” Hollywood was telling generations of young Americans that it wasn’t just ok to be patriotic and faithful, but that it was normal and expected.)\n\nThen, in one of its very firsts acts, the first Congress in 1789 requested that the newly elected President Washington proclaim a national day of Thanksgiving.\n\nBut it wasn’t till later, in the middle of the Civil War and in response to a persistent, decades-long letter-writing campaign by editor and writer Sarah Josepha Hale, that Abraham Lincoln in 1863 proclaimed the last Thursday in November as our official day of Thanksgiving. Then Congress in 1941, just as America was about to enter another war, officially made it the fourth Thursday.\n\nThus, Congress and our most important leaders ratified an outlook that is the gift that keeps on giving.\n\nExperiencing gratitude is “associated with greater longevity among older adults,” says a Harvard study last year. According to the British Psychological Society, “around 18.5 per cent of individual differences in people’s happiness could be predicted by the amount of gratitude they feel.”\n\nSaying thanks to your partner and meaning it also makes the institution of marriage stronger. A team at the University of Illinois found that “higher levels of perceived gratitude buffered against the stresses of both financial strain and ineffective arguing.” (One could ask, in marriage, is there any other type of arguing?)\n\nMeanwhile, at UC Berkeley, a 2009 study found that “Gratitude was uniquely related to total sleep quality, subjective sleep quality, sleep latency, sleep duration, and daytime dysfunction.”\n\nOf course, Presidents Washington, Lincoln and Roosevelt, and the various congresses in question—to say nothing of the Pilgrim fathers, Samoset or Squanto—did not have any of these benefits in mind, they just wanted to thank the Lord. Maybe the unintended consequences are payback.\n\nThat is not going to help you deal with your aunt who voted for Kamala Harris and will show up dressed in a Handmaid’s Tale outfit. Just tell her that if President Trump and Zohran Mamdani can bury the hatchet, she can get along with others, too.\n\nHappy Thanksgiving.\n\nOriginally published by Washington Examiner.","summary":"The nation will this week partake in a ritual unlike any other in the rest of the world. Americans of all persuasions, races, and creeds... Read More\n\n\nThe post Don&#8217;t Take Thanksgiving for Granted appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/27/dont-take-thanksgiving-for-granted/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/Mike-Thanksgiving.gif","video":null,"publish_date":"2025-11-27 21:35:21","author":"Mike Gonzalez","authors":["Mike Gonzalez"],"language":"en","source_country":"us","sentiment":0.325},{"id":382867718,"title":"Trump most popular politician to have at Thanksgiving table... but the runner-up will infuriate the president","text":"While Thanksgiving Dinner may be the one time partisan politics is avoided like grandma's lumpy gravy, there's always a debate over who gets an invitation to the table at all.\n\nPolling data reveals the ultimate holiday hierarchy: Donald Trump is the choice for Americans' dream Thanksgiving guest.\n\nAn analysis of new polling data from the Daily Mail and JL Partners shows that the country chose Trump over Barack Obama.\n\nOut of 841 total responses, Trump was chosen by 24 percent of respondents, with Obama on 15 percent. \n\nFormer vice-president Kamala Harris and vice-president JD Vance followed in third and fourth place, respectively.\n\nThis strong showing for the current President sets the stage for a deeper look into Americans' holiday preferences, as yet another national poll delivers a much more complicated judgment of the rest of the political media world. \n\nThe exclusive survey sampled 1,246 registered voters online in the United States with a 3 percent margin of error. It found that while Trump may top his presidential rival, a majority of Americans would still rather not host him for the holiday.\n\nThe poll's most brutal revelation shows that when forced to choose between two iconic couples - Donald and Melania Trump, or Canadian Prime Minister Justin Trudeau and his romantic partner, Katy Perry - a whopping 35 percent of all respondents said 'neither.'\n\nOnly 32 percent of Americans opted to spend the holiday with the Trumps, while 26 percent chose the Trudeau-Perry duo.\n\nDespite the clear snub against him as part of a couple, Trump remains the top choice when Americans are asked to select just one politician to spend Thanksgiving with.\n\nThe poll also ranked popular media personalities, asking voters to select who they would most and least like to spend Thanksgiving with.\n\nOverall, conservative commentator Ben Shapiro was the most wanted guest, with 24 percent of all respondents voting him in as the winner. His win was almost tied, neck-to-neck with Candace Owens at 23 percent.\n\nTucker Carlson took third place with 18 percent of the vote.\n\nHowever, Republicans themselves offered a contrasting view, naming Laura Ingraham as their top choice at 23 percent, closely followed by Carlson at 22 percent and Owens at 19 percent.\n\nRepublicans intriguingly placed Shapiro at the bottom of their preferred list, with 22 percent saying he was the one they would least like to spend the holiday with.\n\nFinally, the poll reveals an amusing look into which Thanksgiving roles Americans would trust the former president to handle.\n\nThe results suggest he is better left on the receiving end of the family toast, rather than doing any heavy lifting.\n\nAmericans would least trust Trump with making dessert, with 45 percent saying they would not have faith in him to do it at all.\n\nSimilarly, he was poorly regarded if tasked with decorating the house, despite all his White House renovations. He was also voted as poorly trusted with setting the table.\n\nHis highest trust rating was for giving the Thanksgiving toast and, in second place, carving the turkey.\n\nIt seems Americans prefer Trump to talk the talk, but he's strictly barred from the kitchen this holiday season.","summary":"While Thanksgiving Dinner may be the one time politics is strictly avoided, this Thanksgiving, the real dinner table debate is over who gets an invitation at all.","url":"https://www.dailymail.co.uk/news/article-15326115/Trump-politician-Thanksgiving-table.html","image":"https://i.dailymail.co.uk/1s/2025/11/27/15/104244129-0-image-a-13_1764259018823.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/11/25/3763292079283286784/1024x576_MP4_3763292079283286784.mp4","publish_date":"2025-11-27 20:19:45","author":"Editor,Elina Shirazi","authors":["Editor","Elina Shirazi"],"language":"en","category":"politics","source_country":"gb","sentiment":0.115},{"id":382822168,"title":"You can't see this anywhere else' - Macy's 99th Thanksgiving parade kicks off","text":"Skip to content\n\nBritish Broadcasting Corporation\n\nIsrael-Gaza War\n\nWar in Ukraine\n\nUS & Canada\n\nUK Politics\n\nN. Ireland Politics\n\nScotland Politics\n\nWales Politics\n\nLatin America\n\nMiddle East\n\nIn Pictures\n\nBBC InDepth\n\nExecutive Lounge\n\nTechnology of Business\n\nFuture of Business\n\nScience & Health\n\nArtificial Intelligence\n\nAI v the Mind\n\nArt & Design\n\nEntertainment News\n\nArts in Motion\n\nDestinations\n\nAustralia and Pacific\n\nCaribbean & Bermuda\n\nCentral America\n\nMiddle East\n\nNorth America\n\nSouth America\n\nWorld’s Table\n\nCulture & Experiences\n\nThe SpeciaList\n\nTo the Ends of the Earth \n\nNatural Wonders\n\nWeather & Science\n\nClimate Solutions\n\nSustainable Business\n\nGreen Living\n\nPodcast Categories\n\nBBC Maestro\n\nNewsletters\n\n'You can't see this anywhere else' - Macy's 99th Thanksgiving parade kicks off\n\nMacy's Thanksgiving Day parade kicked off in New York with 34 balloons and 28 floats, including new additions like Buzz Lightyear, Pac-Man and Netflix's Stranger Things \"Upside Down Invasion\". Returning favourites such as Bluey soared above Manhattan, alongside floats from Lego and Labubu.1 hour ago\n\nThanksgiving\n\nUnited States\n\nWatch: Moment truck collides with sign on Ohio highway\nThe vehicle was travelling along Ohio’s I-70, with the dramatic collision occurring in Columbus last Thursday.\nUS & Canada\n\nNasa astronaut films Northern Lights from space\nZena Cardman captured the footage of the display from the International Space Station on 17 November.\nUS & Canada\n\nWatch: 'I'll be cheering for him' - Trump praises Mamdani after first meeting\nThe meeting between the US president and New York mayor-elect had been expected to be a showdown after months of heated rhetoric.\nUS & Canada\n\nWatch: Nasa releases new images of interstellar comet 3I/ATLAS\nThe comet, first discovered in July 2025, is only the third ever confirmed object to pass through the solar system.\nUS & Canada\n\nWatch: Blue Origin rocket successfully lands booster for first time \nJeff Bezos' space company saw its first successful return landing of a reusable booster - a feat that SpaceX pioneered.\nUS & Canada\n\nWatch: Seal jumps aboard US photographer's boat to escape orcas\nCharvet Drucker was photographing a pod of orcas when a seal boarded her boat to escape the hunt.\nUS & Canada\n\nWatch: Trump and Obama honour US troops for Veterans Day\nThe former president surprised nearly 80 veterans of the Korean and Vietnam wars landing on a special flight in Washington DC.\nUS & Canada\n\n'Government, just do your job': Frustration at US airports as shutdown delays continue\nThousands of flights are at risk just before Thanksgiving.\nUS & Canada\n\nWatch: Lava soars 1,100ft above Hawaii's Kilauea in latest eruption\nThe fountaining event lasted for nearly five hours and was the 36th volcanic episode since December 2024.\n\nUS & Canada\n\nWatch: 'Devastating' - Airline travellers react to flight reductions\nAirports are grappling with air traffic controller shortages during the federal government shutdown.\nUS & Canada\n\nVehicle explodes in huge fireball in the Bronx\nAll seven firefighters injured in the explosion are awake, alert and speaking, and are expected to make a full recovery, according to the New York City fire chief.\n\nUS & Canada\n\nWatch: Three times the Pelosi-Trump feud was caught on camera\nThe US Congresswoman directly challenged Donald Trump throughout his presidency, with the tension often spilling out in front of the press.\nUS & Canada\n\nWatch: What New Yorkers want Mamdani to do as mayor\nThe 34-year-old will become the city's first Muslim mayor and the youngest in more than a century when he is sworn in on 1 January 2026.\nUS & Canada\n\nMamdani says he's a democratic socialist. What does that mean?\nPresident Donald Trump has attacked the New York City mayor-elect's political label and claims he is a communist.\nUS & Canada\n\nVerified video shows huge fireball after plane crash in Kentucky\nBBC Verify has pieced together clips being shared online to see how the crash unfolded in Kentucky.\nUS & Canada\n\nZohran Mamdani: From immigrant roots to mayor of New York City\nThe journey of the thirty-four-year-old state assemblyman and self-identified democratic socialist started in Uganda, and continues as mayor-elect of NYC.\nUS & Canada\n\nSmiles and joy inside Mamdani's victory party\nBBC News correspondent Nada Tawfik reports from inside the Zohran Mamdani's mayoral victory party.\nUS & Canada\n\nWatch: US election night's big winners… in 90 seconds\nZohran Mamdani, who will become New York City's youngest mayor since 1892, said in his victory speech that his win was a 'mandate for change'.\nUS & Canada\n\nSmoke hangs over Louisville after deadly plane crash\nThree people have died and officials expect more fatalities after a UPS plane crashed during takeoff.\nUS & Canada\n\nRos Atkins on… A year since Trump’s election victory\nA year after Donald Trump’s election victory over Kamala Harris, Ros Atkins looks at how his second term has unfolded.\nUS & Canada\n\nBritish Broadcasting Corporation\n\nBBC in other languages\n\nThe BBC is in multiple languages\nRead the BBC In your own language\n\nOduu Afaan Oromootiin\nAmharic ዜና በአማርኛ\nArabic عربي\nAzeri AZƏRBAYCAN\nBangla বাংলা\nBurmese မြန်မာ\nChinese 中文网\n\nFrench AFRIQUE\nHausa HAUSA\nHindi हिन्दी\nGaelic NAIDHEACHDAN\nGujarati ગુજરાતીમાં સમાચાર\nIgbo AKỤKỌ N’IGBO\nIndonesian INDONESIA\nJapanese 日本語\nKinyarwanda GAHUZA\nKirundi KIRUNDI\n\nKyrgyz Кыргыз\nMarathi मराठी\nNepali नेपाली\nNoticias para hispanoparlantes\nPashto پښتو\nPersian فارسی\n\nPolish PO POLSKU\nPortuguese BRASIL\nPunjabi ਪੰਜਾਬੀ ਖ਼ਬਰਾਂ\nRussian НА РУССКОМ\nSerbianNA SRPSKOM\nSinhala සිංහල\nSomali SOMALI\nSwahiliHABARI KWA KISWAHILI\nTamil தமிழில் செய்திகள்\nTelugu తెలుగు వార్తలు\nThai ข่าวภาษาไทย\nTigrinya ዜና ብትግርኛ\nTurkish TÜRKÇE\nUkrainian УКРАЇНСЬКA\n\nUzbek O'ZBEK\nVietnamese TIẾNG VIỆT\nWelsh NEWYDDION\nYorubaÌRÒYÌN NÍ YORÙBÁ\n\nFollow BBC on:\n\nTerms of Use\n\nSubscription Terms\n\nAbout the BBC\n\nPrivacy Policy\n\nAccessibility Help\n\nContact the BBC\n\nAdvertise with us\n\nDo not share or sell my info\n\nBBC.com Help & FAQs\n\nContent Index\n\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.","url":"https://www.bbc.com/news/videos/cm28vgv8708o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/7ac2/live/192cc2f0-cbad-11f0-9fb5-5f3a3703a365.jpg","video":null,"publish_date":"2025-11-27 17:00:18","author":null,"language":"en","source_country":"gb","sentiment":0.245},{"id":382793288,"title":"NYC mayor-elect Mamdani stands up to Trump during Oval Office meeting: Letter to the Editor","text":"For those of you who are wondering why President Donald Trump turned into such a friendly guy after meeting with Zohran Mamdani, the mayor-elect of New York City, let me enlighten you. Trump thought he could bully Zohran using the stature of the Oval Office but soon found out that Mamdani was not impressed or afraid to once again call out a wannabe dictator. So, Trump realized he had better make nice. \n\nDo you remember how Kamala Harris pretty much cleaned Trump’s clock during their 2024 presidential debate? Just watch Trump with Mamdani. He’ll give him everything he wants. Hopefully, more Democratic politicians will now have the nerve to take on the not-so-tough “big bad wolf” in the same way.\n\nFrank Sobolewski,\n\nNorth Royalton","summary":"Hopefully, more Democratic politicians will now have the nerve to take on the not-so-tough “big bad wolf” President Trump in the same way Zohran Mamdani just did, writes Frank Sobolewski of North Royalton in a letter to the editor.","url":"https://www.cleveland.com/letters/2025/11/nyc-mayor-elect-mamdani-stands-up-to-trump-during-oval-office-meeting.html","image":"https://www.cleveland.com/resizer/v2/RLKVIIS4AVDP5P3IQVB6HEMB5Y.jpg?auth=e59a37a766eb0ea72dc4035d669f6a9acd21f8308fcb934dadf381abec68c86e&width=1280&smart=true&quality=90","video":null,"publish_date":"2025-11-27 15:59:25","author":"Other Voices","authors":["Other Voices"],"language":"en","category":"politics","source_country":"US","sentiment":-0.536},{"id":382784108,"title":"Hamtramck mayoral candidate sues, asking 37 uncounted votes be counted","text":"A lawsuit filed this week on behalf of Hamtramck mayoral candidate Muhith Mahmood asks the city and Wayne County to count 37 votes found the day after the election, alleging that mistakes were made by election officials.\n\nThe lawsuit was filed Monday, Nov. 24, the day before the Wayne County Board of Canvassers approved a recount in the mayoral race that will take place on Dec. 2, but that recount will currently not include the 37 votes. Only six votes currently separate Mahmood, who has 2,060 votes, and his opponent, Adam Alharbi, who is currently in the lead with 2,066 votes. Alharbi opposes the counting of the 37 votes, saying that election fraud is a problem in Hamtramck.\n\nMark Brewer, an attorney representing Mahmood and a former chair of the Michigan Democratic Party, filed the lawsuit in Wayne County against the city of Hamtramck and the Wayne County Board of Canvassers. Brewer said in the lawsuit there was an \"unconstitutional disenfranchisement of 37 Hamtramck citizens and voters whose absentee ballots were not tabulated ... due to the admitted mistakes of Hamtramck election officials.\"\n\nThe lawsuit also alleges that \"the Wayne County Board of Canvassers failed to correct those mistakes. Those ballots should be counted or those voters given the opportunity to cast new ballots.\" The lawsuit details what it says were problems in how absentee ballots were tabulated on election day. City Clerk Rana Faraj has previously said that the 37 ballots were found in her office after the election.\n\n\"On Nov. 5,\" the day after the election, Faraj \"discovered that there was a 37-ballot discrepancy between the number of return envelopes delivered to the AVCBs (Absentee Voter County Boards) and the number of ballots the AVCBs reported as tabulated,\" the lawsuit said. \"She discovered that 37 return envelopes in her office still contained the untabulated absentee ballots.\"\n\nFaraj then \"immediately placed the 37 ballots—which had unintentionally been left in their return envelopes, where they remained at all relevant times—in a secure container, sealed it, and delivered it to the Wayne County Board of Canvassers,\" reads the complaint seeking relief.\n\nBut the two Republicans on the four-member Wayne County Board of Canvassers voted to block counting the 37 ballots during its meetings on Nov. 13 and 14. The vote was 2-2, with three votes need to pass a motion to count them. Alharbi, a patent engineer who works for the Commerce Department, supported Donald Trump for president and has engaged with Republicans while Mahmood, who works in a restaurant at MGM Grand, is a Democrat who supported Kamala Harris. During the board meetings on Nov. 13 and 14, Mahmood, an immigrant from Bangladesh, received support from leaders in the Bangladeshi American community to count the 37 votes, while Alharbi, an immigrant from Yemen, had supporters in the Yemeni American community who urged the board to not count the 37 ballots.\n\nLisa Capatina, a Republican who is chair of the Wayne County Board of Canvassers, did not return a message from the Free Press seeking comment. Hamtramck city attorney Odey Meroueh also did not return a message seeking comment on the lawsuit.\n\nNabih Ayad, an attorney for Alharbi and founder of the Arab American Civil Rights League, said he opposes the counting of the 37 votes.\n\n\"There is long standing precedence why votes are not counted by those that are tasked with knowledge and rules in the process of vote counting,\" Ayad told the Free Press. \"The Wayne County Board of Canvassers were clearly justified in not adding those votes due to serious issues of chain of custody and the consequences that come with the break in the chain of custody. Whether it’s in a criminal setting or our voting process, chain of custody is vital to the integrity of our democracy and that is why they where not included in the count. The mayor-elect will be filing to intervene on this suit as he is the certified winner.”\n\nThe current mayor, Amer Ghalib, elected in 2021, decided not run for reelection for another four-year term, after Trump picked him to be ambassador to Kuwait.\n\nBrewer said the lawsuit has been assigned to Wayne County Chief Judge Patricia Perez Fresard. Fresard on Nov. 14 denied a request by Alharbi, filed by Ayad, asking to disqualify Mahmood, alleging he does not live in Hamtramck. Mahmood has previously strongly denied allegations he lives in Troy instead of Hamtramck. Michigan State Police have said they are still investigating the residency allegations against Mahmood and another councilman.\n\nReporter Natalie Davies contributed to this report.\n\nContact Niraj Warikoo: nwarikoo@freepress.com, X @nwarikoo or Facebook @nwarikoo","url":"https://eu.freep.com/story/news/politics/elections/2025/11/27/hamtramck-mayoral-candidate-muhith-mahmood-sues-37-votes-counted/87478439007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/11/04/PDTF/87094861007-a-7-d-52-df-359-a-749-f-9-af-269-cd-37133-c-9-ee.jpeg?auto=webp&crop=4031,2268,x0,y302&format=pjpg&width=1200","video":null,"publish_date":"2025-11-27 14:50:55","author":"Detroit Free Press","authors":["Detroit Free Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.419},{"id":382754676,"title":"Ryan Lizza dating former Kamala staffer who’s looks just like his cheating ex, Olivia Nuzzi","text":"The scorned ex-boyfriend of former New York Magazine reporter Olivia Nuzzi has found new love with a radical former Kamala Harris staffer almost half his age — who’s the spit of his troubled ex.\n\nJournalist Ryan Lizza, 51, was photographed by the Daily Mail on a romantic Thanksgiving trip with Caroline Motley, a 28-year-old abortion-rights activist who has openly described herself as a man-hating “misandrist.”\n\nMotley also worked for Harris’s unsuccessful 2024 campaign — and was pictured crying when the VP gave her concession speech, admitting defeat to President Trump.\n\nThe blonde liberal warrior, who grew up in a $7 million DC-area mansion and was sent to boarding school, was pictured carrying a coffee with Lizza’s name on it after she stepped out of his DC apartment to fetch his order on Tuesday, the Mail Online reported.\n\nSoon afterward, Lizza emerged carrying his luggage, before the pair got into a waiting limo and sped off.\n\nLizza recently gushed in a blog about having a new love, without revealing her identity.\n\n“I also met the most extraordinary woman I’ve ever known, someone whose beauty, inside and out, takes my breath away. Every day, I marvel at my impossible luck that she loves me back. We just celebrated our first year together,” Lizza wrote.\n\nHis reported new love, who is 23 years his junior, recently completed her Master’s at George Washington University, according to her LinkedIn page.\n\nMotley grew up in a 10,000 sq ft estate in Virginia, where her neighbors included the late former Vice President Dick Cheney, and former solicitor general of the United States Robert Bork, the Mail said.\n\nThe new love comes after former CNN analyst Lizza sensationally broke off his two-year engagement to Nuzzi after her alleged fling with Robert F. Kennedy Jr. hit the headlines in September 2024.\n\nVanity Fair reporter Nuzzi, 32, had spent weeks teasing tantalizing new details of her supposed affair to promote “American Canto,” her upcoming memoir.\n\nBut Lizza stole his ex-girlfriend’s thunder when he went scorched earth on the relationship in a blog post.\n\nHe accused Nuzzi of having a separate affair with former South Carolina Governor Mark Sanford when she was writing about him, and also revealed stomach-churning “poetry” sent to Nuzzi by a RFK Jr.\n\n“You are my canyon. I mean to flow through you,” penned the nephew of JFK in one excruciating verse.","summary":"Lizza had recently gushed about his meeting an \"extraordinary\" new woman in a blog post, but did not reveal her identity.","url":"https://nypost.com/2025/11/27/us-news/ryan-lizza-dating-former-kamala-staffer-whos-looks-just-like-his-cheating-ex-olivia-nuzzi/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/116285601.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-11-27 14:32:33","author":"Anthony Blair","authors":["Anthony Blair"],"language":"en","source_country":"us","sentiment":0.351},{"id":382784340,"title":"Putin Confirms Moscow Welcomes US Delegation Amid Kushner’s Diplomatic Role","text":"Russian President Vladimir Putin stated that the appearance of a US administration representative at negotiations in Abu Dhabi was unexpected, but emphasized that Moscow never refuses contact.\n\"A representative of the US administration attended this meeting. For us, this was unexpected, but we never refuse contacts,\" Putin told journalists.\nThe president confirmed that a US delegation will visit Moscow for talks next week.\nJared Kushner Steps Into Ukraine Negotiations\nThe Financial Times reports that the White House is actively involving US President Donald Trump’s son-in-law, Jared Kushner, in Ukraine negotiations. Kushner may soon replace Special Envoy Steve Witkoff in these discussions, according to sources cited by the publication.\nKushner has been married to Trump’s eldest daughter, Ivanka Trump, since 2009 and has played a key role in her father’s political and diplomatic initiatives. In 2016, he effectively organized Trump’s presidential campaign and has previously undertaken complex diplomatic missions. During Trump’s first term, Kushner led efforts to normalize relations between Arab states and Israel, and in October this year, he helped achieve a ceasefire in the Gaza Strip.\n“His current task is to silence weapons and drones on the frontline in Donbas. Kushner’s involvement in one of the most challenging diplomatic maneuvers of Trump’s second term is part of the president’s plan to replicate the Gaza breakthrough,” the Financial Times noted.\nWitkoff’s Position Weakens\nThe position of Steve Witkoff was reportedly undermined on November 25, when Bloomberg published a transcript of an alleged leaked call between the envoy and Russian presidential aide Yury Ushakov. No audio file was released, only the text.\nOn November 26, Trump announced that Kushner will soon travel to Moscow alongside Witkoff for a meeting with Putin. Earlier, on November 20, the Wall Street Journal reported that Kushner is one of the co-authors of the US 28-point peace plan for Ukraine.\nDiplomatic Expertise and Strategy Shift\nAccording to Philip Gordon, National Security Advisor to former US Vice President Kamala Harris, Kushner’s involvement could mark a breakthrough in diplomacy. \"Like Witkoff, he enjoys the president’s trust, which is essential for any successful negotiator. Unlike Witkoff, however, Kushner has extensive diplomatic experience,\" Gordon said.\nFurthermore, the overall US approach to Ukraine is changing. Senator Marco Rubio indicated that Washington seeks to abandon full support for Ukraine in favor of a neutral stance in negotiations. Reports from Politico suggest the US is pushing Ukraine to sign a conflict resolution agreement before providing clear security guarantees. According to one US official, security guarantees were mentioned only once by the Secretary of State, and later omitted entirely.\nHowever, this strategic shift may face resistance not only from Europe but also domestically, as several Republican lawmakers have criticized the president’s plans.","summary":"Russian President Vladimir Putin stated that the appearance of a US administration representative at negotiations in Abu Dhabi was unexpected, but emphasized that Moscow never refuses contact.\n\"A representative of the US administration attended this meeting. For us, this was unexpected, but we never refuse contacts,\" Putin told journalists.\nThe president confirmed that a US delegation will visit Moscow for talks next week.","url":"https://english.pravda.ru/news/world/164994-kushner-trump-us-russia-ukraine-talks/","image":"https://english.pravda.ru/image/preview/article/9/9/4/164994_amp.jpeg","video":null,"publish_date":"2025-11-27 14:20:00","author":"Anton Kulikov","authors":["Anton Kulikov"],"language":"en","category":"politics","source_country":"ru","sentiment":0.129},{"id":382754184,"title":"CNN’s newest anchor came in with great fanfare — but his ratings can’t even beat reruns of Anderson Cooper","text":"After he was tapped to anchor CNN’s new foray into late-night live news programming, Los Angeles-based anchor Elex Michaelson suggested that cable news habit of airing reruns in the post-midnight time slots that’s left much of its potential audience in the dark.\n\n“I don’t think that works anymore,” Michaelson told Deadline last month, adding that many viewers are “watching dated news in a media environment that is faster and faster.”\n\nA month after the premiere of The Story Is with Elex Michaelson, however, the network is still waiting to see if the West Coast will tune in during their primetime to watch live cable news. Besides coming in a distant third to the repeats airing on Fox News and MS NOW (previously MSNBC), Michaelson’s two-hour show isn’t yet drawing the ratings that CNN’s encore presentations were.\n\nAccording to Nielsen, The Story Is – which airs at midnight ET/ 9 pm PT – is averaging 213,000 total viewers a night and 35,000 in the key advertising demographic of adults aged 25-54 since debuting on October 27 and through November 21.\n\nThe program, which also airs on CNN International and broadcasts in the morning hours in several overseas time zones and boasts a large global footprint of more than 300 million households and hotel rooms, is currently trailing the US viewership numbers that repeats of Erin Burnett Outfront and Anderson Cooper 360 had scored in the same time slot last quarter and in September.\n\nDuring the third quarter of this year, CNN’s late-night reruns averaged 242,000 viewers overall and 41,000 in the key demo. In the month of September, the encore broadcasts of Burnett and Cooper attracted a nightly total audience of 225,000 and 37,000 in the 25-54 demographic.\n\nAs for its current head-to-head competition, Michaelson’s show is attracting less than one-third of Fox News’ total viewership and barely half of MS NOW’s. \n\nSince The Story Is debuted, Fox News’ post-midnight programming – which generally consists of repeats of Jesse Watters Primetime and The Five – has averaged 676,000 total viewers and 80,000 in the 25-54 demo. \n\nOver on MS NOW, the encore telecasts of The Rachel Maddow Show, The Last Word with Lawrence O’Donnell and The Briefing with Jen Psaki have nabbed a nightly total viewership of 411,000 and 50,000 in the key demographic.\n\nPerhaps even more startling for Michaelson’s show, though, is how it compares to CNN’s late-night reruns from a year ago. At this same time in 2024, the network’s midnight to 2 a.m. ET repeats averaged 387,000 total viewers and 124,000 in the advertising demo – representing a 72 percent drop for The Story Is among younger viewers.\n\nOf course, much of the year-over-year comparison includes the stretch run of the 2024 presidential race and the election of Donald Trump, which saw inflated ratings across the cable and broadcast news landscape. At the same time, though, both CNN and MSNBC saw immediate drop-offs in their viewership following Trump’s second electoral victory on November 5.\n\nStill, it seems that Michaelson’s two-hour broadcast could be on the cusp of building an audience. After averaging just 197,000 total viewers in its first two weeks on the air, The Story Is pulled in a nightly viewership of 242,000 and 41,000 in the key demo last week. Both of those numbers are on par with CNN’s late-night programming last quarter.\n\nOn top of that, Michaelson broadcasting live while the other cable news networks were airing dated reruns allowed for his show to be ahead of the competition in terms of breaking news, such as Marjorie Taylor Greene quitting Congress or Trump’s high-stakes meeting with Chinese President Xi Jinping in South Korea. Furthermore, other networks — including Fox News — have picked up several clips and quotes from Michaelson’s interviews with California Gov. Gavin Newsom and former House Speaker Nancy Pelosi, among others. \n\nMichaelson is also dealing with the headwinds affecting all of cable and broadcast television, particularly news broadcasting. The combination of continued cord-cutting, the glut of streaming services, and younger demographics increasingly turning to online sources for news has been a drain on the cable news industry – not to mention Trump’s return to the White House, which has prompted a wide swath of disillusioned viewers to turn the dial.\n\nDuring the third quarter of 2025, CNN experienced a 42 percent drop in total primetime viewers and a 58 percent decline in the 25-54 demo compared to the same quarter last year. MSNBC was also down 46 percent in total primetime audience and 64 percent in the key demographic year-over-year.\n\nEven Fox News, which saw a post-MAGA ratings boost following Trump’s win, has begun to see a bit of erosion in recent months. Compared to last year, Fox News dipped nine percent in total viewers and 34 percent in the advertising demographic this past quarter. The network was also down six percent in total viewers and 20 percent in the demo during primetime compared to the second quarter.\n\nPrior to joining CNN, Michaelson had made a name for himself as a highly respected local anchor in Los Angeles, winning eight Emmys and being named TV Journalist of the Year in 2023 by the Los Angeles Press Club. At KTTV-Fox 11, where he created and hosted The Issue Is with Elex Michaelson, he scored interviews with Trump, Joe Biden and Kamala Harris, among others.\n\n“I am so excited to join CNN and learn firsthand from some of the most talented journalists on the planet,” Michaelson said when CNN announced his hiring in September. “I’m especially grateful that CNN is expanding its investment in my hometown as the West Coast houses so many global leaders in politics, entertainment, technology, sports and more. This is truly a dream job.”\n\nWhile Michaelson told Deadline that he had long pitched the network on the idea of a live show for the late-night time slot, the California journalist wasn’t CNN’s first choice for the midnight spot.\n\nEarlier this year, Jim Acosta decided to leave the network after it pulled his morning time slot and offered him the “graveyard” shift that Michaelson currently occupies. The move would have also entailed Acosta relocating to Los Angeles, and his show would have been simulcast on CNN International.","summary":"According to Nielsen, The Story Is – which airs at midnight ET/ 9 pm PT – is averaging 213,000 total viewers a night and 35,000 in the key advertising demographic of adults aged 25-54 since its debut.","url":"https://www.independent.co.uk/news/world/americas/cnn-elex-michaelson-cable-news-ratings-b2872946.html","image":"https://static.independent.co.uk/2025/11/26/13/29/20250910-em_t1.jpg?width=1200","video":null,"publish_date":"2025-11-27 13:54:55","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.162},{"id":382714672,"title":"Republican fears mount over Tennessee special election that could leave GOP House majority with zero-vote margin","text":"Republicans are growing increasingly anxious over a once sleepy special election in Tennessee District 7 next month in a district that President Trump comfortably won by 22 points last year. \n\nWhile the congressional race has historically been a GOP shoo-in, Republicans are alarmed by a recent poll and fearful that an upset could see their majority in the House slip to a zero-vote margin.\n\n“I’m very concerned about it. Of course, it’s an off-year election. It’s right after Thanksgiving. A lot of the Republicans are out of town. And I worry about them showing up on Election Day,” Rep. Tim Burchett (R-Tenn.), who represents Tennessee’s District 2, which encompasses Knoxville, told The Post.\n\n“It’s a razor-thin margin.”\n\nElevating the stakes of the Dec. 2 election is firebrand Rep. Marjorie Taylor Greene’s (R-Ga.) recent retirement announcement. \n\nIf Democrats eke out an upset victory in Tennessee District 7, then proceed to win their two vacated seats in special elections, the GOP’s House majority could eventually fall to 218 to 216.\n\nUnder that scenario, House Republicans wouldn’t be able to afford any defections on partisan legislation. Over the past year, they’ve often had at least one, usually from Libertarian-leaning Rep. Thomas Massie (R-Ky.) Additionally, the GOP’s House majority could vanish before the midterms if any other rep retires early.\n\nFurther fueling those concerns is a shock survey by Emerson College Polling and The Hill out Wednesday that pegged the race in a dead heat. \n\nRepublican Matt Van Epps only bested Democrat Aftyn Behn — dubbed “AOC of Tennessee” — by 48% to 46%, which is within the margin of error, the poll found. \n\n“I think the polls are a little bit misleading, because it seems that older Tennesseans are voting and they generally vote more conservative than the younger folks do,” Burchett admitted.\n\nStill, Burchett, who has campaigned with Van Epps twice, cautioned Republicans to “be aware” of the risks.\n\n“If it’s close, that should be a big enough wake-up call,” he added. “If [Behn] wins, I think it could be devastating for us.”\n\nThe special election in Tennessee follows a Democratic sweep in the off-year election, where polling often overestimated Republicans, particularly in the New Jersey governor’s race.\n\nFormer Vice President Kamala Harris raised eyebrows when she stumped for Behn earlier this month, indicating how some Democrats think the special election might be in play.\n\n“Matt Van Epps will be a member of Congress,” National Republican Congressional Committee (NRCC) spokesperson Reilly Richardson confidently told The Post when asked about warning signs in the race.\n\nSome left-leaning operatives quietly doubt that Behn will win and allege that Republicans raising fears are simply engaging in a ploy to gin up turnout and lay the groundwork to undermine what they expect will be a significant Democratic overperformance.\n\n“The Republicans are dumping over $1.5 million into this Trump +22 district in a desperate last-minute attempt to avoid a Democratic overperformance that will tell us what we already know — Republicans are going to lose the House majority next year,” a national Democratic strategist working on House races said.\n\nThe strategist added that a hypothetical Dem overperformance in Tennessee’s 7th Congressional District would prove the GOP’s “agenda is historically unpopular even in deep Trump country.”\n\nTop of mind for that strategist is the April special election in Florida when Rep. Randy Fine (R) ultimately prevailed by about 14 percentage points despite GOP handwringing heading into the race. \n\nTrump had seemingly been rattled enough by the GOP’s viability in special elction races that he yanked his nod for Rep. Elise Stefanik (R-NY) to serve as US ambassador to the United Nations.\n\nThe Tennessee seat had been held by Rep. Mark Green, who chaired the House Homeland Security Committee and stepped down in July after Republicans passed the One Big Beautiful Bill Act. Green won reelection in 2024 by just over 21 points. \n\nDuring his special election campaign, Van Epps, a former commissioner of the Tennessee Department of General Services, has worked to highlight Behn’s lefty record. \n\nFive years ago, Behn had bashed Nashville on a podcast: “I hate the city, I hate the bachelorettes, I hate the pedal taverns, I hate country music, I hate all of the things that make Nashville apparently an ‘it’ city to the rest of the country. But I hate it.”\n\nShe also tore into Tennessee as a “racist state” in a 2019 op-ed in the The Tennessean and pushed to defund the police the following year. \n\n“Good morning, especially to the 54% of Americans that believe burning down a police station is justified,” she wrote on X in 2020 during the protests and riots that swept the country in the wake of George Floyd’s death.\n\nBehn, who has served in the Tennessee state House since 2023, glossed over those social media posts when pressed on it by MS NOW, previously known as MSNBC, saying “I don’t remember these tweets.”\n\n“She’s an extremist,” Burchett chided. “And now she won’t even address the quote she’s made about the police and our military and our border and everything.”","summary":"Republicans are growing increasingly anxious over a special election in Tennessee District 7 next month in a district that President Trump comfortably won by 22 points last year.","url":"https://nypost.com/2025/11/27/us-news/republican-fears-mount-over-tennessee-special-election-that-could-leave-gop-house-with-zero-vote-majority/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/116241234.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/9YbYV9NI-RyIcpnTz.mp4","publish_date":"2025-11-27 11:00:00","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.337},{"id":382670918,"title":"Prediction: XRP Will Drop to $1 in 2026","text":"For more than a century, no asset class has held a candle to the average annual return delivered by stocks. But when the lens is narrowed to the last decade, cryptocurrencies have left Wall Street's benchmark index, the S&P 500 (^GSPC +0.69%), in their dust.\n\nAlthough the world's largest digital currency, Bitcoin, has led the charge higher, some of the most popular altcoins have actually performed better over the trailing year. This includes the Ripple payment network's bridge currency, XRP (XRP +1.17%), which has rallied 34% over the trailing year (as of the early evening on Nov. 23), while Bitcoin has retraced by 14% over the same time frame.\n\nDigital currency investors are always on the lookout for the next big thing in the cryptocurrency arena, with many latching onto high-profile blockchain and payment projects. While XRP hasn't been short of catalysts in 2025, several headwinds suggest it'll drop to $1 next year.\n\nXRP has been on fire, and it's not hard to understand why\n\nXRP's marked outperformance over the trailing year, relative to Bitcoin, boils down to five factors.\n\nArguably, the most important boost for XRP came in November, when President Donald Trump was elected to his second term. Compared to Democratic Party presidential nominee Kamala Harris, Trump was viewed as the more favorable candidate toward crypto. Bitcoin and most altcoins rallied following the president's November victory.\n\nThe second catalyst, which builds on the previous point, is the long-awaited resolution to litigation between the U.S. government and Ripple. Both parties agreed to drop their appeals following a 2023 split ruling that found some sales of XRP to institutional investors violated securities laws, but sales of XRP on public exchanges did not. The removal of this legal overhang ends years of uncertainty for XRP.\n\nThe rise of XRP has also been fueled by the approval of spot XRP exchange-traded funds (ETFs). These are ETFs that hold XRP tokens, providing investors with an easy way to gain exposure to and closely mirror the performance of the bridge currency of Ripple's payment network.\n\nThe fourth factor pushing XRP higher in 2025 is the growing utility of RippleNet, Ripple's payment network. More than 300 financial institutions around the globe are estimated to be using RippleNet, with some of these institutions relying on XRP as a bridge currency for cross-border transactions. The XRP Ledger can validate and settle transactions in roughly three to five seconds, with the cost of each transaction coming in at just fractions of a penny.\n\nLastly, Wall Street analysts have begun chiming in on popular altcoins currently living in Bitcoin's shadow. Analyst Geoff Kendrick of Standard Chartered set a price target for XRP of $12.50 by 2028. If Kendrick's assessment proves accurate, XRP would offer more than 500% upside over the next three years, as of this writing.\n\nXRP can lose 50% of its value in 2026\n\nWith a better understanding of what's been fueling XRP's recent outperformance, let's dig into the various headwinds that could stunt its rally and send this hyped digital currency back to $1 in 2026.\n\nThe leading factor that suggests XRP will struggle in the new year is its lack of catalysts. The end of litigation and the approval of spot XRP ETFs were both highly anticipated events this year. But with significant cash flows into spot XRP ETFs now in the rearview mirror, and no major announcements or events on the horizon, the typically emotion-driven XRP may struggle to gain traction.\n\nAnother issue for XRP is the realization that its adoption rate isn't as impressive as advertised. While RippleNet being used by more than 300 global financial institutions is nothing to sneeze at, more than 11,000 institutions rely on the Society for Worldwide Interbank Financial Telecommunication (better known as SWIFT) for their cross-border payments. It's going to be incredibly difficult for XRP to supplant SWIFT, and it may not make much, if any, headway in 2026.\n\nFurthermore, it's imperative to note that RippleNet doesn't require the use of XRP to facilitate payments. While it's a commonly used bridge currency, it's not being used universally in all countries. Purchases of XRP by financial institutions are likely necessary for XRP to continue its uptrend.\n\nI'd argue that investors are also wrongly conflating Ripple's future success with that of XRP. Ideally, investors would have the opportunity to invest directly in Ripple, gaining exposure to its payment network. But XRP's success doesn't correlate with that of Ripple. The latter can generate profits from RippleNet, while the former (XRP) lacks stand-alone value.\n\nIt's not even a certainty that XRP is the best solution for cross-border payments. While its average settlement time of three to five seconds is alluring, when compared to wait times of up to one week when making cross-border payments using traditional methods, Solana (SOL +4.55%) can validate and settle payments in an average of 400 milliseconds. Similarly, Stellar's (XLM +2.09%) peer-to-peer payment platform can rival the XRP Ledger in terms of average settlement time.\n\nThe final issue for XRP concerns digital currencies being tied to the outlook for equity markets. Although stocks and digital currencies should be two independently trading assets, Bitcoin and altcoins have been moving in lockstep with Wall Street.\n\nIn late October, the S&P 500's Shiller Price-to-Earnings Ratio peaked at a multiple of 41.20, which is its second-highest multiple during a continuous bull market when back-tested to 1871. In plain English, the stock market is historically pricey, and that's usually bad news for investors. If the S&P 500 were to dip into a correction or bear market, there's a good likelihood that cryptocurrencies would follow, with altcoins like XRP generating subpar returns.\n\nFollowing a year where everything was set up perfectly for XRP's success, 2026 could prove far more challenging.","summary":"With key catalysts now behind us, the shortcomings of Ripple's bridge currency will be on full display in the new year.","url":"https://www.fool.com/investing/2025/11/27/prediction-xrp-will-drop-to-1-in-2026/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F844299%2Fstock-market-crash-plunge-circle-bottom-invest-dow-sp500-nasdaq-getty.jpg&w=1200&op=resize","video":null,"publish_date":"2025-11-27 08:51:00","author":"Sean Williams","authors":["Sean Williams"],"language":"en","source_country":"us","sentiment":0.11},{"id":382607980,"title":"'Violence has no place in America': Barack Obama on Washington shooting","text":"Former US President Barack Obama has condemned the Washington shooting, stating that \"violence has no place in America\". Two National Guardsmen were shot in downtown Washington and remain in critical condition. US media identified the alleged shooter as Rahmanullah Lakanwal, an Afghan national who entered the country in 2021. In a post on X, Obama said, \"Violence has no place in America. Michelle and I are praying for the servicemembers shot in Washington, DC today, and send our love to their families as they enter this holiday season under the most tragic of circumstances.\" Former US Vice President Kamala Harris also took to social media and sent her prayers to the families of the two National Guardsmen who were shot. \"Doug and I send our prayers to the two National Guardsmen who were shot earlier today in Washington, to their families, and to the communities that love them. Violence of any kind is unacceptable, and we all, together, must condemn this tragedy,\" Harris said. Meanwhile, US President Donald Trump called the attack an \"act of terror\". \"This heinous assault was an act of evil and an act of hatred, and an act of terror. It was a crime against our entire nation. It was a crime against humanity,\" Trump said while addressing the nation on Wednesday evening (local time). He added that the suspect in custody is a \"foreigner who entered our country from Afghanistan, a hellhole on earth\", and blamed the previous Biden administration for allowing the attacker to enter the country under refugee status. Trump also promised to \"re-examine every single alien\" from Afghanistan who entered the US under the Biden administration. \"We must now re-examine every single alien who has entered our country from Afghanistan under Biden, and we must take all necessary measures to ensure the removal of any alien from any country who does not belong here, or add benefit to our country if they can't love our country, we don't want them,\" he added. He also announced deployment of an additional 500 troops to \"help protect our capital city.\" The shooting happened less than 500 metres away from the White House. Trump was not in the capital and is visiting Florida for the Thanksgiving holiday. While addressing the media, FBI Director Kash Patel said that the case will be prosecuted at the federal level since \"this is an assault on federal law enforcement officers.\" Multiple states have sent Guard personnel to Washington in recent months as part of President Trump's public-safety crackdown. The mission has since expanded to several other major US cities. There are approximately 2,400 National Guard troops currently deployed in Washington, which includes around 958 from the DC National Guard and about 1,300 from eight other states. (With inputs from IANS)","summary":"The shooting happened less than 500 metres away from the White House. Trump was not in the capital and is visiting Florida for the Thanksgiving holiday.","url":"https://www.ibtimes.co.in/violence-has-no-place-america-barack-obama-washington-shooting-893184","image":"https://data1.ibtimes.co.in/en/full/801930/us-ready-new-chapter-kamala-harris-says-obama.jpg","video":null,"publish_date":"2025-11-27 05:41:40","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.301},{"id":382600726,"title":"Five Things to Be Thankful for in 2025","text":"Happy Thanksgiving. If you’re reading this, you are either pre-gorging or post-tryptophan coma…or it’s Friday, because who wants to read about the news on Thanksgiving? I hope it was a good one.\n\nLike last year, I wanted to take today’s column to look back at the year that has been (so far) and write a little about what I’m thankful for. With that in mind, here are the top 5 from the news (because, obviously, I’m most thankful for my family and friends – I’m not a joyless leftist miserable pile of garbage, after all).\n\nFirst: Even though it didn’t happen this year, I remain (and will remain) grateful for the results of the election just over a year ago. That may seem like a cop-out, but there was so much joy that it couldn’t possibly be contained by one calendar year. Plus, the inauguration was this year, so it’s valid.\n\nWith that in mind, I will fold in the fact that Kamala Harris is a private citizen. Imagine what the world would be like were she running around, ready to surrender to our enemies and welcome even more of the third world into the country in the left’s idiotic game of “Red Rover.” How glorious is it to know the border is sealed? It’s right up there with Kamala’s miserable book tour where she’s burning every bridge she’s ever crossed to make a few bucks. It’s funny to watch someone destroy their political career while thinking they’re helping their brand. It couldn’t happen to a nicer, more deserving person.\n\nSecond: ICE and the Border Patrol. It’s a thankless job, and was never a flashpoint before Democrats invited every pit around the world to release their version of Hunter Biden from their prisons and send them here, but now it is not only the most important gig in government, it is a dangerous one. It’s not that Democrats in Congress and the media want these agents dead, it’s that they don’t care either way. It’s also that they know they have a portion of their base who will try to kill them, but are too afraid to say they shouldn’t because Democrats are afraid their goon squad will turn on them.\n\nStill, these brave men and women serve to protect our country from the invasion. They show up to work knowing Democrats are targeting them. They show up knowing Democrats might ram them with their cars. They show up knowing those bastards will prosecute them in a heartbeat should they even accidentally cross a line, even though they regularly drop the charges against the left-wingers actively trying to “harm” them. We are all thankful they show up.\n\nThird: The National Guard. After the events in Washington, DC, yesterday, the rhetoric of the left trying to inspire violence with a plausibly deniable distance between the wink and nod of a “suggestion,” the fate of two National Guard members remains in limbo as of this moment. But those Democrats know what they did. And we know too.\n\nI’ll stop there with this one, lest I fill this column with expletives about those Democrats… Four: The upcoming 250th birthday of America. I know, it isn’t till next year, but it has already started and needs to be a continuous celebration. Our Founding Fathers did something extraordinary and it deserves a year of praise. Hell, it deserves constant praise.\n\nFar too many people born in this country take it for granted or have no idea that the country is special, let alone why. This is our chance to reach some of them. Sure, many will not care, but some will. That we can’t save everyone doesn’t mean we shouldn’t try to save anyone.\n\nFive: Donald Trump. Never before has one man’s mere existence led to so many people having breakdowns and freakouts. No one has ever been able to manipulate the opposition political party into taking wildly unpopular positions by simply coming out in favor of the obvious and wildly popular side. It’s like convincing someone to break their own nose by telling them you simply don’t believe they could punch themselves in the face hard enough…and they do it.\n\nThe power of “being Trump” is almost greater than the presidency itself and it demonstrates just how dangerous and deranged the left has become. No other Republican would have been able to face this insanity and not try to quell it; try to compromise with it to be “loved,” or at least “liked,” by the left-wing establishment. Donald Trump doesn’t care. The push to “sell out” or to “compromise” to get along breaks most politicians at some point; Trump has not. I’m very thankful for that.\n\nThere is a lot to be concerned about this Thanksgiving – special elections, the midterms, Democrats in general – but the scales are tipped in our direction right now. For that, we should all be thankful. Now go shovel some more food down your throat and go Lions!\n\nDerek Hunter is the host of the Derek Hunter Show on WMAL in Washington, DC, and has a free daily podcast (subscribe!) and author of the book, Outrage, INC., which exposes how liberals use fear and hatred to manipulate the masses, and host of the weekly “Week in F*cking Review” podcast where the news is spoken about the way it deserves to be. Follow him on Twitter at @DerekAHunter.\n\nEditor’s Note: Do you enjoy Townhall’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin Townhall VIP and use the promo code FIGHT to get 60% off your VIP membership!","url":"https://townhall.com/columnists/derekhunter/2025/11/27/five-things-to-be-thankful-for-in-2025-n2667105","image":"https://media.townhall.com/cdn/hodl/2025/329/59ab6c16-7b93-4e58-acda-79ee470d3708.jpg","video":null,"publish_date":"2025-11-27 05:01:00","author":"Derek Hunter","authors":["Derek Hunter"],"language":"en","source_country":"us","sentiment":-0.07},{"id":382591332,"title":"‘Violence has no place in America’: Barack Obama on Washington shooting","text":"Washington, Nov 27 (SocialNews.XYZ) Former US President Barack Obama has condemned the Washington shooting, stating that \"violence has no place in America\".\n\nTwo National Guardsmen were shot in downtown Washington and remain in critical condition. US media identified the alleged shooter as Rahmanullah Lakanwal, an Afghan national who entered the country in 2021.\n\nIn a post on X, Obama said, \"Violence has no place in America. Michelle and I are praying for the servicemembers shot in Washington, DC today, and send our love to their families as they enter this holiday season under the most tragic of circumstances.\"\n\nFormer US Vice President Kamala Harris also took to social media and sent her prayers to the families of the two National Guardsmen who were shot.\n\n\"Doug and I send our prayers to the two National Guardsmen who were shot earlier today in Washington, to their families, and to the communities that love them. Violence of any kind is unacceptable, and we all, together, must condemn this tragedy,\" Harris said.\n\nMeanwhile, US President Donald Trump called the attack an \"act of terror\".\n\n\"This heinous assault was an act of evil and an act of hatred, and an act of terror. It was a crime against our entire nation. It was a crime against humanity,\" Trump said while addressing the nation on Wednesday evening (local time).\n\nHe added that the suspect in custody is a \"foreigner who entered our country from Afghanistan, a hellhole on earth\", and blamed the previous Biden administration for allowing the attacker to enter the country under refugee status.\n\nTrump also promised to \"re-examine every single alien\" from Afghanistan who entered the US under the Biden administration.\n\n\"We must now re-examine every single alien who has entered our country from Afghanistan under Biden, and we must take all necessary measures to ensure the removal of any alien from any country who does not belong here, or add benefit to our country if they can't love our country, we don't want them,\" he added.\n\nHe also announced deployment of an additional 500 troops to \"help protect our capital city.\"\n\nThe shooting happened less than 500 metres away from the White House. Trump was not in the capital and is visiting Florida for the Thanksgiving holiday.\n\nWhile addressing the media, FBI Director Kash Patel said that the case will be prosecuted at the federal level since \"this is an assault on federal law enforcement officers.\"\n\nMultiple states have sent Guard personnel to Washington in recent months as part of President Trump's public-safety crackdown. The mission has since expanded to several other major US cities.\n\nThere are approximately 2,400 National Guard troops currently deployed in Washington, which includes around 958 from the DC National Guard and about 1,300 from eight other states.\n\nSource: IANS","summary":"Washington, Nov 27 (SocialNews.XYZ) Former US President Barack Obama has condemned the Washington shooting, stating that \"violence has no place in America\". Two National Guardsmen were shot in downtown Washington and remain in critical condition....\n\n\nThe post &#8216;Violence has no place in America&#8217;: Barack Obama on Washington shooting appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/11/26/violence-has-no-place-in-america-barack-obama-on-washington-shooting/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/11/27/202511273588648.jpg?fit=900%2C600&quality=80&zoom=1&ssl=1?v=1764217241","video":null,"publish_date":"2025-11-27 04:08:11","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.317},{"id":382579068,"title":"AI advice for talking politics at Thanksgiving is, actually, pretty good","text":"Thanksgiving comes with many traditions like turkey, the Macy’s parade, football, and of course, the awkward political conversations with your family members you see once a year. Straight Arrow News asked several popular AI chatbots how to deal with those conversations.\n\nWhat the bots had to say\n\nAmericans continue to increasingly see the country as more divided. So, what should you do when your liberal, college junior, cousin who now really likes the phrase “late-stage capitalism” comes home for break and sits down with your MAGA aunt who lives 100 miles into the country because it’s “safer.”\n\nSAN asked ChatGPT, Gemini and Claude what to do in this situation. Each of them said to come prepared with which topics you’ll allow yourself to jump in on and which ones you’ll avoid by going for that “walk around the block” with your fun cousin in the tie-dyed sweatshirt.\n\nEach one also recommended coming equipped with your “I” statements. That means instead of saying ’No, Aunt Karen, you’re wrong,” come back with “I feel concerned about…”\n\nOnce you’re into it, the bots said there’s always room for humor, especially to de-escalate, including lines like “turkey’s dry enough — let’s not cook each other too.” (Good one, ChatGPT).\n\nEach one also recommended conversing with “curiosity.” Instead of calling them stupid, ask your aunt why she supports deporting all of Southern California or why your cousin believes the entire police department should be replaced with social workers.\n\nOnce it inevitably gets heated, each bot said to make sure you know where your exit ramp is. Gemini is apparently especially concerned about this, saying you’ll know it’s gotten too emotional “if you feel your chest tighten or your breathing get shallow.”\n\nThey recommended exiting gracefully, suggesting you get a refill on food as a possible excuse to get up from the table, instead of going full Chris Evans in Knives Out. Although when asked, all three bots agreed that Evans’ famous sweater from that movie is a great choice for a Thanksgiving outfit, with Claude saying it’s “legendary as a Thanksgiving fashion statement.”\n\nAll the bots also ended with one thought: treat politics at the table like the Trump administration treats climate change, and the Biden administration treated Hunter Biden’s laptop, and just don’t talk about it.\n\nPolitics at the Thanksgiving dinner table\n\nNot talking about it seems to be the way most Americans will go about politics at the table this year. In a YouGov poll, only 11% of the 1,120 respondents said they expect political arguments at the table.\n\nOver 30% acknowledged that there would likely be some discussion of politics during dinner.\n\nThe fighting appears to come from the Wild West of the country, where 16% said they expect a duel during dinnertime. The Northeast expects calm, with only 7% expecting the same.\n\nFormer Vice President Kamala Harris once again finished behind Trump in a poll. Of those asked, 28% said those attending their dinner supported Harris, while 31% supported Trump.\n\nAmerican divisiveness\n\nThe reason this topic has become such a concern could come from the view that the country is more divided than ever. Pew Research Center polling found Americans think this is the most divided our country has been since the Civil War.\n\nProtests of the Trump administration have drawn millions of people this year.\n\nCivility has also gone downhill significantly, especially in politics.\n\nIn the end, maybe it’s best to remember this line from Claude.\n\n“Gratitude and connection are the real reasons you’re gathered.”\n\nThe post AI advice for talking politics at Thanksgiving is, actually, pretty good appeared first on Straight Arrow News.","url":"https://muvitv.com/2025/11/27/ai-advice-for-talking-politics-at-thanksgiving-is-actually-pretty-good/","image":"https://muvitv.com/wp-content/uploads/2025/11/GettyImages-109893733-1_Tony_EsparzaCBS_via_Getty_Images_clean-hAiQ9H.jpeg","video":null,"publish_date":"2025-11-27 02:02:26","author":"Muvi","authors":["Muvi"],"language":"en","category":"politics","source_country":"zm","sentiment":0.244},{"id":382567202,"title":"Massie: FBI threatened his staff if he didn’t ‘play ball’ over pipe-bomb investigation","text":"Rep. Thomas Massie (R-Ky.) said an FBI official threatened to open a criminal investigation on one of his staff over his persistent investigation and questioning on the Jan. 6 pipe bombs.\n\nAn FBI official threatened to open a criminal investigation on one of Massie’s staff “if we didn’t straighten up [and] play ball,” Massie told Blaze News investigative reporter Steve Baker in an interview broadcast on Matt Kibbe’s “Free the People” podcast and posted to X.\n\n‘Even he understood that was not a good look. Probably illegal.’\n\n“I’m going to say this here on camera because it’s important. ... He said ... ‘We’re going to investigate one of your staff for fraud,’” Massie quoted the unnamed FBI official as saying. “And he told another one of my staff this: ‘If you guys don’t straighten up, you know, if you want to play hardball, if this is how you want to play it’ or something like that, ‘this member of your staff is going to get criminally investigated for fraud’ — a very specific threat.”\n\nMassie declined to identify the official he says levied the threat, but said he did complain about it to FBI Deputy Director Dan Bongino.\n\n“I told Bongino, I said, ‘One of your guys is threatening my guys with an FBI investigation if we don’t do what you want.’ And he [Bongino] said, ‘I’ll take care of that.’ ’Cause even he understood that was not a good look. Probably illegal.”\n\nMassie said he later received a “non-apology” text from the official that said, “‘I’m sorry if I hurt your feelings.’”\n\n“He didn’t apologize. He was unrepentant, let's say, really.”\n\nMassie has been the most aggressive member of Congress investigating the pipe bombs found behind the Capitol Hill Club at 12:43 p.m. on Jan. 6 and under a park bench on the southwest side of the Democratic National Committee building 22 minutes later. In the same interview with Baker, Massie also disclosed that recent Blaze News reporting has caused him to be “99% certain” that some U.S. Capitol Police officials had a role in the planting of the pipe bombs found on Capitol Hill on Jan. 6, 2021.\n\n“I went from 90% certain that some Capitol Police were involved in the Jan. 6 pipe bomb to 95% certain, and now I'm at 99% certain after this new story that you put out this week,” Massie told Baker.\n\n“I’m doing this on probability. The probability may even be higher than that.”\n\nHis comments reflect Blaze News’ recent reporting on a former Capitol Police officer who was an apparent forensic match to the bomb suspect, follow-up reporting on the manner in which the second device was discovered by plainclothes Capitol Police officers, and the stonewalling the congressman charges that he faced from Capitol Police in the course of his own investigation. Assistant Police Chief Ashan Benedict, whom Massie named as having specifically blocked his investigation, retired last week.\n\nThe Kentucky Republican also expressed frustration that FBI Director Kash Patel seems to have made little more progress than his predecessor, Director Christopher Wray. In an interview with Fox News earlier this month, as well as a follow-up with independent reporter Catherine Herridge, Patel promised that major developments are incoming, but was scant on details.\n\nA CBS story published Tuesday cited three unidentified sources stating that the FBI had cleared the police officer who appeared to match a forensic gait analysis of the bomber, citing “an alibi: video of her playing with her puppies at the time the devices were placed.” Blaze News has sought to obtain independent confirmation of the FBI’s clearance based on the alibi.\n\nBlaze News reported Nov. 8 on a forensic match to a former Capitol Police officer, based on a computer analysis of the hoodie-wearing alleged pipe bomber’s manner of walking compared to that of the person. The algorithm rated the person as a 94% match, while the intelligence analyst who ran the study for Blaze News put the match closer to 98%. The person has since denied any allegations, through her attorney.\n\n FBI photos \n\nBlaze News reported Nov. 18 that two Capitol Police counter-surveillance special agents sent out to look for more explosives after the discovery of the Capitol Hill Club device were seen on video going to the DNC building and to a nearby bush on the side of the Congressional Black Caucus Institute building.\n\nIndependent video investigator Armitas discovered that the hoodie-wearing suspect identified in 2021 as the pipe bomber stopped at the bush along a sidewalk on the north side of the CBCI building at 7:47 p.m. Jan. 5. The suspect sat cross-legged at the shrub and appeared to rummage through a backpack before leaning into the bush as if attempting to place something underneath.\n\nThe bomb suspect then stood up and walked back to the DNC bench, where a pipe bomb was placed at 7:54 p.m., according to choppy video released by the FBI.\n\n‘He had a handler, who would often interrupt and answer questions for him.’\n\nWhen Capitol Police dispatch warned of the Capitol Hill Club bomb at 12:43 p.m., two plainclothes Capitol Police special agents took a nearly six-minute drive to reach the Capitol Hill South Metro Station, one block from the Capitol Hill Club bomb scene. They then walked to the DNC building, passing the park bench the pipe bomb sat next to.\n\nThe agents continued walking until they reached an alley leading to the side of the CBCI building. Their movements were not captured on video because four Capitol Police security cameras that would have shown the DNC crime scene were turned away at key moments or pointed in another direction by default.\n\nMassie’s office released video in July 2023 showing a man in dark clothing and a ball cap approaching a U.S. Secret Service SUV sitting in the driveway of the DNC building as part of Vice President-elect Kamala Harris’ security detail. Harris was inside the building when the pipe bomb was discovered.\n\nBlaze News reported in January 2024 that this man was the plainclothes Capitol Police officer who discovered the pipe bomb under a bush at the foot of a park bench at the DNC building.\n\nFollowing that story, Massie told Blaze News he was determined to interview the agents, but did not get much cooperation from Capitol Police. Massie referred to the agents as “man-bun guy” and “backpack guy” (the one who discovered the bomb).\n\n‘Weirdest meeting’\n\nThe Capitol Police never made “backpack guy” available to the Massie, but on Jan. 30, 2024, they did eventually send his partner, accompanied by his commander, Benedict, to speak with the congressman in a meeting that was not recorded or transcribed.\n\n“So they came over to my office, but not ‘backpack guy,’” Massie said. “’Man-bun guy’ came over, and he had a handler, who would often interrupt and answer questions for him.”\n\nTwo congressional investigators sat in on the meeting alongside Benedict, the police officer, and Massie. The congressman later described the interview as the “weirdest meeting in the world.”\n\n Rep. Thomas Massie (R-Ky.) said an FBI official threatened a criminal investigation of his staff if he didn’t “play ball” on the Jan. 6 pipe bomb investigation.Photo courtesy of Free the People\n\n“In the conversation with the counter-surveillance officer in my office, Ashan Benedict would frequently interrupt the officer, answer before the officer could reply, or qualify the officer’s answers,” Massie told Blaze News. “There was an effort by our committee staff to get Benedict to sit for a transcribed interview, but he successfully evaded that effort.”\n\nMassie said he still wants to interview the officer who actually found the bomb, as well as his partner and Benedict. “Those need to be transcribed interviews. They need to be sworn in. I feel very strongly about that,” he said. “But the reality is the FBI should be doing these things.”\n\nMassie said that after he reposted the Blaze News article on the gait analysis, Bongino called him to complain about two early persons of interest mentioned in the piece.\n\nOne of those men, named in FBI reports as Person of Interest 3, lived directly next door to the Capitol Police officer who was the subject of the Nov. 8 Blaze News article. The FBI’s Special Operations Group conducted surveillance on Person of Interest 3 in Falls Church, Va., for two days in January 2021, but surveillance was suddenly canceled, before any law enforcement officer ever questioned the man.\n\nMassie said Bongino told him, “‘That’s a dead lead. … We investigated that lead and … there’s nothing there. There’s no there there.’ So that’s why they quit looking at it. … At that point I said, ‘But you guys weren’t — you never did suspect him. The FBI never did suspect him. … His build doesn’t match. There’s no way it could be him. Your guys were looking for somebody else.’”\n\nWhistleblower concerns\n\nA current FBI supervisory special agent on Nov. 10 filed a whistleblower protected disclosure with Massie and U.S. Rep. Barry Loudermilk (R-Ga.), alleging the termination of surveillance at the Falls Church condominium complex was improper and cut off a suggestion by a surveillance team member that Person of Interest 3 be questioned face-to-face at his doorstep.\n\nPerson of Interest 3 and Person of Interest 2, his alleged houseguest on Jan. 5 and 6, 2021, had not been questioned by the FBI when surveillance was terminated. Interviews took place six days later, according to FBI reports included in the whistleblower disclosure. An FBI agent pretending to be a Metro Transit police officer interviewed Person of Interest 3 over the phone, a congressional source told Blaze News.\n\nThe whistleblower’s “concern was that the investigation that went to Falls Church, Virginia, that got them to the doorstep of the person that [Blaze News] identified through gait analysis as possibly somebody that might have been the person in the hood,” Massie said.\n\n“There were suggestions made to the people in charge of the investigation about how to follow up on those leads,” Massie said. “And it was just dropped after two days of surveillance. And he [the whistleblower] provided supporting documents to that effect.”\n\n Capitol Police block off the intersection of 1st and C streets in response to discovery of a pipe bomb at the Capitol Hill Club in Washington, D.C., on Jan. 6, 2021.U.S. Capitol Police\n\nMassie said Bongino made reference to the FBI conducting a meeting to address the whistleblower disclosure. “He didn’t say, ‘We’re trying to find the whistleblower,’” Massie said. “But my Spidey sense went off, and I almost said to him in that moment, ‘You better not be trying to find the whistleblower, because law protects that individual.’ But I didn’t say it.”\n\nMassie said he thought about this when recalling the threat he said his staff received from the FBI official.\n\n“I have to tell all the listeners this because this is the context in which I'm worried for the whistleblower,” Massie said. “If they're willing to retaliate against a congressional office, which has speech or debate immunity and a lot of other protections, they may be willing to retaliate against the whistleblower.”\n\nThe whistleblower’s attorney, Kurt Siuzdak, sent a letter to Massie and Loudermilk on Nov. 13, warning that if the FBI attempted to out the whistleblower, it would violate the supervisory agent’s protections under the law. Massie shared the letter on social media.\n\n“Identifying the whistleblower serves only one purpose,” Siuzdak wrote, “which is to allow FBI management to retaliate.”\n\nIn a Nov. 13 post on X, Bongino accused Massie of throwing “BS bombs” and denied that the FBI sought to identify or retaliate against the Nov. 10 whistleblower. A Blaze News request to Bongino for further comment went unanswered.\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","url":"https://www.theblaze.com/news/massie-fbi-threatened-his-staff-if-he-didnt-play-ball-over-pipe-bomb-investigation","image":"https://www.theblaze.com/media-library/massie-fbi-threatened-his-staff-if-he-didnt-play-ball-over-pipe-bomb-investigation.jpg?id=62236757&width=1200&height=600&coordinates=0%2C81%2C0%2C82","video":null,"publish_date":"2025-11-27 01:19:04","author":"Joseph M. Hanneman","authors":["Joseph M. Hanneman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.419},{"id":382564228,"title":"Israel has to prove it isn’t the US's 51st State","text":"The moment the first phase of President Donald Trump’s 21-Point Plan to end the war in Gaza began, a familiar argument returned: the claim that Israel has become a kind of American protectorate. Some people said we were now the 51st state, and television commentators delivered emotional, and at times hypocritical, monologues imagining a new star on the American flag for Israel. Like many arguments rooted in political positioning, this one was shallow and overly dramatic. I still remember the claim that Trump’s America had “abandoned” Israel because it stopped taking part in airstrikes in Yemen. The same tone resurfaced at the start of Operation Rising Lion, when some insisted the United States would stay out of the campaign. The noise only grew louder before the operation, as Trump and Prime Minister Benjamin Netanyahu publicly played to a media eager for even a hint of conflict. The very commentators who talked about abandonment quickly pivoted to saying Israel was now dependent on Washington. Anyone who follows complex situations wasn’t surprised this week when Israel stepped up its actions in both Gaza and Lebanon. The idea that Hamas would remain armed or that Gaza would avoid demilitarization exists only for those who refuse to accept how much changed on Oct. 7. People who understand international relations also understand that alliances are a mix of shared values, competing interests and the egos of national leaders. The relationship between Israel and the United States has never been simple or neatly controlled. History offers plenty of reminders. After Israel captured Sinai in the 1956 Suez Crisis, David Ben-Gurion withdrew under heavy pressure from President Dwight Eisenhower, despite having brushed off the United Nations a year earlier. Years later, Prime Minister Yitzhak Shamir held back from striking Iraq because Washington asked him to. When Barack Obama entered the White House, Netanyahu delivered the Bar-Ilan speech under American pressure. The left celebrated, the right felt betrayed and over time many understood it for what it was — a political maneuver. Israel had its interests then, the United States had its own, and they didn’t always match. Leaders had to decide whether to blow up the relationship or take some political hits to preserve larger strategic goals. These decisions always depend on timing and circumstances. Sometimes you keep your head down. Sometimes you stand your ground. It all depends on the equation in front of you. Netanyahu moved into Rafah despite objections from former President Joe Biden and former Vice President Kamala Harris. When their administration paused weapons shipments, Netanyahu spoke out publicly. There are moments when Israel chooses restraint, and moments when it makes its position clear. Yet those who push the protectorate narrative ignore what has actually happened. According to them, Israel supposedly does nothing without American approval, Turkey supposedly controls Gaza and terrorists in the tunnels supposedly walk out unharmed. But Israel eliminated Hezbollah’s chief of staff, hit militants inside the tunnel networks and Turkey’s role has largely amounted to placing its flags on heavy equipment, despite the friendly ties between Trump and Turkish President Recep Tayyip Erdogan. With the pace of recent events, it wouldn’t be surprising if the next round of claims flips again — that the Americans have now “abandoned” us because we are not obedient enough. Luckily, we’ve had plenty of practice dealing with these swings.","url":"https://www.ynetnews.com/opinions-analysis/article/r109xxb11zg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/10/14/r14TlBPs6gl/r14TlBPs6gl_0_0_3000_2122_0_large.jpg","video":null,"publish_date":"2025-11-27 01:14:04","author":"Naveh Dromi","authors":["Naveh Dromi"],"language":"en","category":"politics","source_country":"il","sentiment":-0.287},{"id":382588446,"title":"​GOP strategist says Trump's attacks on Democratic veterans are already backfiring","text":"Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump may be pouring gasoline on a fire that he should instead be extinguishing.\n\nPolitico reported Wednesday that Trump's attacks on six Democrats who recorded a video urging rank-and-file servicemen and women to remember their duty to disobey illegal orders may already be backfiring politically. Those Democrats – who are all veterans of either the U.S. military or the CIA — reminded active-duty service members of the Uniform Code of Military Justice (UCMJ) which stipulates that lawful orders must be obeyed, but that carrying out unlawful orders could result in a court-martial.\n\nSecretary of Defense Pete Hegseth has recently suggested that retired U.S. Navy Captain Sen. Mark Kelly (D-Ariz.), who appeared in the video, could be called back into active-duty service and be subjected to a court-martial for his remarks. But Arizona-based Republican strategist Barrett Marson told Politico that pursuing Kelly could end up being politically costly for Republicans in the next two elections.\n\n\"Pete Hegseth and Donald Trump are providing Mark Kelly with the kind of visibility that almost no amount of money could buy,\" Marson said. \"Every 2028 contender wishes they could be attacked like this by the Trump administration.\"\n\nAside from Kelly, other Democrats have been capitalizing from the heightened national attention resulting from Trump's attacks. Sen. Elissa Slotkin (D-Mich.), a retired CIA operative who appeared in the video, has lately been promoting her plan to \"contain and defeat Donald Trump.\" Both Kelly and Slotkin represent swing states and are rumored to run for the 2028 Democratic presidential nomination. Kelly was on former Vice President Kamala Harris' short-list for 2024 running mates.\n\n\"It’s classic Trump — he ratchets everything up to an 11 and it blows up in his face,\" former Slotkin spokesperson Austin Cook told Politico. \n\n\"Not only did it reinforce everything swing voters have always hated about him, but it’s also given this group the biggest megaphone they’ve ever had,\" he added.\n\nClick here to read Politico's report in full.","summary":"Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump may be pouring gasoline on a fire that he should instead be extinguishing.\n\nPolitico reported Wednesday that Trump's attacks on six Democrats who recorded a video urging rank-and-file servicemen and women to remember their duty to disobey illegal orders may already be backfiring politically. Those Democrats – who are all veterans of either the U.S. military or the CIA — reminded active-duty service members of the Uniform Code of Military Justice (UCMJ) which stipulates that lawful orders must be obeyed, but that carrying out unlawful orders could result in a court-martial.\n\nSecretary of Defense Pete Hegseth has recently suggested that retired U.S. Navy Captain Sen. Mark Kelly (D-Ariz.), who appeared in the video, could be called back into active-duty servi","url":"https://www.rawstory.com/alternet-posts/trump-backfiring/","image":"https://www.rawstory.com/media-library/image.jpg?id=61534324&width=1200&height=600&coordinates=0%2C560%2C0%2C561","video":null,"publish_date":"2025-11-27 00:18:52","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.424},{"id":382552040,"title":"​GOP strategist says Trump's attacks on Democratic veterans are already backfiring","text":"Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump may be pouring gasoline on a fire that he should instead be extinguishing.\n\nPolitico reported Wednesday that Trump's attacks on six Democrats who recorded a video urging rank-and-file servicemen and women to remember their duty to disobey illegal orders may already be backfiring politically. Those Democrats – who are all veterans of either the U.S. military or the CIA — reminded active-duty service members of the Uniform Code of Military Justice (UCMJ) which stipulates that lawful orders must be obeyed, but that carrying out unlawful orders could result in a court-martial.\n\nSecretary of Defense Pete Hegseth has recently suggested that retired U.S. Navy Captain Sen. Mark Kelly (D-Ariz.), who appeared in the video, could be called back into active-duty service and be subjected to a court-martial for his remarks. But Arizona-based Republican strategist Barrett Marson told Politico that pursuing Kelly could end up being politically costly for Republicans in the next two elections.\n\n\"Pete Hegseth and Donald Trump are providing Mark Kelly with the kind of visibility that almost no amount of money could buy,\" Marson said. \"Every 2028 contender wishes they could be attacked like this by the Trump administration.\"\n\nAside from Kelly, other Democrats have been capitalizing from the heightened national attention resulting from Trump's attacks. Sen. Elissa Slotkin (D-Mich.), a retired CIA operative who appeared in the video, has lately been promoting her plan to \"contain and defeat Donald Trump.\" Both Kelly and Slotkin represent swing states and are rumored to run for the 2028 Democratic presidential nomination. Kelly was on former Vice President Kamala Harris' short-list for 2024 running mates.\n\n\"It’s classic Trump — he ratchets everything up to an 11 and it blows up in his face,\" former Slotkin spokesperson Austin Cook told Politico. \n\n\"Not only did it reinforce everything swing voters have always hated about him, but it’s also given this group the biggest megaphone they’ve ever had,\" he added.\n\nClick here to read Politico's report in full.","summary":"Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump may be pouring gasoline on a fire that he should instead be extinguishing.\n\nPolitico reported Wednesday that Trump's attacks on six Democrats who recorded a video urging rank-and-file servicemen and women to remember their duty to disobey illegal orders may already be backfiring politically. Those Democrats – who are all veterans of either the U.S. military or the CIA — reminded active-duty service members of the Uniform Code of Military Justice (UCMJ) which stipulates that lawful orders must be obeyed, but that carrying out unlawful orders could result in a court-martial.\n\nSecretary of Defense Pete Hegseth has recently suggested that retired U.S. Navy Captain Sen. Mark Kelly (D-Ariz.), who appeared in the video, could be called back into active-duty servi","url":"https://www.alternet.org/trump-backfiring/","image":"https://www.alternet.org/media-library/image.jpg?id=61534324&width=1200&height=600&coordinates=0%2C560%2C0%2C561","video":null,"publish_date":"2025-11-27 00:18:52","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.424},{"id":382558666,"title":"Poll: Half Say They Want to Avoid Discussing Politics at Thanksgiving","text":"Half of Americans say they want to avoid discussing politics at Thanksgiving, an Emerson College survey revealed.\n\nThe survey asked respondents, “If you are visiting with family or friends this Thanksgiving, are you looking forward to discussing politics, or are you hoping to avoid discussing politics?”\n\nJust over half, 50.7 percent, said they are hoping to avoid discussing politics this Thanksgiving with friends or family. However, one-third said they are looking forward to discussing politics, followed by 16.3 percent who simply said they are not spending Thanksgiving with friends or family anyway.\n\nThe survey also asked, “When it comes to Thanksgiving, are you happy eating turkey as the main course, or would you rather eat something else?” Three-quarters said they are “happy eating turkey as main course,” while about one-quarter said they would prefer something else.\n\nThe survey was taken November 3-4, 2025. It has a +/-3 percent margin of error.\n\nIt coincides with the results of a recent YouGov survey, which found that 31 percent of Americans believe it is “very or somewhat likely they’ll discuss politics” at Thanksgiving. This includes 31 percent of Republicans, 26 percent of independents, and 37 percent of Democrats. However, like the Emerson poll, this one found that half say it is not very likely or not at all likely that they will discuss politics during the holiday.\n\nMore via YouGov:\n\n19% of Democrats and 9% of Republicans think there will be arguments about politics at their Thanksgiving celebration this year. But most Americans with a preferred 2024 candidate also expect to be celebrating mostly with like-minded people.\nAmong Americans who voted for Kamala Harris in the 2024 presidential election, 45% think almost all of the people who will be attending their Thanksgiving celebration also supported her. 18% think more of their fellow Thanksgiving attendees supported Harris than supported Donald Trump, and 10% think equal shares supported both candidates.\n\nAhead of the Thanksgiving holiday, President Donald Trump participated in the annual turkey pardon and actually pardoned four turkeys, joking that former President Joe Biden used an autopen in the pardons last year.\n\n“So I have the official duty to determine, and I have determined, that last year’s turkey pardons are totally invalid, as are the pardons of about every other person that was pardoned,” Trump said.\n\n“The turkeys known as Peach and Blossom last year have been located, and they were on their way to be processed, in other words, to be killed,” he added. “But I have stopped that journey, and I am officially pardoning them, and they will not be served for Thanksgiving dinner.”","summary":"Half of Americans say they want to avoid discussing politics at Thanksgiving, an Emerson College survey revealed.\n\n\nThe post Poll: Half Say They Want to Avoid Discussing Politics at Thanksgiving appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/11/26/poll-half-say-they-want-to-avoid-discussing-politics-at-thanksgiving/","image":"https://media.breitbart.com/media/2025/11/pexels-rdne-5847983-640x335.png","video":null,"publish_date":"2025-11-26 22:07:18","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.193},{"id":382529782,"title":"Dick Cheney: Always unintimidated","text":"Cheney, who died early this month and was eulogized in a ceremony to which the current president and vice president were not invited, rose after being awarded an American Political Science Association fellowship in Washington. There, he favorably impressed two bosses who were elected to Congress at ages 28 and 30 — William Steiger, who, before his death at age 40, pushed a capital gains tax cut through a 2-1 Democratic House, and Donald Rumsfeld, who became former President Richard Nixon’s antipoverty program chief and former President Gerald Ford‘s chief of staff.\n\nStill in his 30s, Cheney remained unintimidated by the travails of his patrons and his country — the forced resignation of Nixon in August 1974, the evacuation of U.S. troops from the embassy in Saigon in April 1975, the unveiling of Ford’s WIN (whip inflation now) buttons in October 1974. He seemed no more impressed than intimidated by his West Wing office near the president’s, nor his duties dealing with eminences such as former Secretary of State Henry Kissinger.\n\nAlthough Ford trailed far behind in polls, he nearly won a full term in 1976: if he had gotten 11,117 more votes in Ohio and 14,464 in Mississippi, he would have had 272 electoral votes to former President Jimmy Carter’s 268. Cheney returned to his native Wyoming and, undaunted by voters who expected to meet and grill candidates for high office in person, won election to the state’s sole House seat in 1978.\n\nHe was undaunted as well by what many regarded as inevitable American decline. I remember a conversation shortly after Reagan‘s inauguration in 1981, in which he expressed worry about overcoming Soviet advances abroad and budget deficits and stagflation at home. As a Reagan backer, during the Iran-Contra affair, he defended the administration’s right to conduct foreign policy — a harbinger of future stands in future controversies — and he was elected House minority whip after former President George H. W. Bush was elected in 1988.\n\nBush’s unexpected failure to get John Tower, a fellow Texan, confirmed as defense secretary had two pivotal consequences. One was the naming of Cheney, at age 48, as defense secretary. The other was the election by an 87-85 margin of Newt Gingrich, 46, to succeed Cheney as whip, which put him in line to push aside former Minority Leader Robert Michel and lead Republicans to their first House majority in 40 years in 1994. Whether Cheney’s talents would have produced that result is uncertain; in any case, Republicans have won House majorities in three-quarters of the elections since.\n\nMore immediately consequential was Cheney’s appointment. Unintimidated, despite his lack of military service, he assembled Operation Desert Shield and coolly fired the Air Force chief of staff for an unauthorized interview on the eve of Operation Desert Force. His White House, congressional, and national security experience made him a natural choice as head of former President George W. Bush‘s vice presidential selection committee and, after due consultation, for the vice presidential nomination itself.\n\nOnly four men served eight years as vice president before 1950; three made well-known comments about the insignificance of the office, and the fourth was known for his alcoholism. But since 1950, there have been five vice presidents who served eight years; three of them (Nixon, H.W. Bush, and Joe Biden) were later elected president in their own right, and a fourth (Al Gore) won the popular vote for the office.\n\nCheney was the odd man out, yet he was arguably the most consequential vice president of the five. After the Sept. 11 attacks, he pressed hard for aggressive measures to protect America from terrorism, arguing that enhanced interrogations and military action to remove the Saddam Hussein regime in Iraq were justified if there was even a 1% chance of preventing a terrorist attack that, in a nuclear age, could have been orders of magnitude greater than 9/11. He acted on this conviction, unintimidated by the prospect of widespread opposition and of a decline that, in fact, occurred in his job approval. \n\nIn most ideological quarters, Cheney’s recommendations, implemented with W. Bush’s substantial but not total approval, were, if not a crime, then a blunder. But even if, as in all wars, mistakes were made, “regime change in Baghdad also brought blessings,” wrote the Wall Street Journal‘s Barton Swaim. \n\nBuilding on those blessings has been, ironically, President Donald Trump, who has routinely called the Iraq war a mistake and has been full of scorn for Cheney. Yet, it is impossible to imagine the success of Trump’s Abraham Accords and bombing of Iran’s nuclear facilities if the Hussein regime were still in place; history may record it was necessary to take out the terrorist regime in Iraq before taking out the terrorist regime in Iran. Trump’s successful foreign policies may owe more to Cheney than either would feel comfortable admitting.\n\nCheney was no orator, but performed ably in his two vice presidential debates, in 2000 against Joe Lieberman, whom he liked and admired, and in 2004 against John Edwards, whose smarmy phoniness he despised. In that contest, Cheney was the first major party nominee to support same-sex marriage — long before Biden, former President Barack Obama, or Hillary Clinton — and he gave unintimidated support to his daughter, Mary Cheney and her wife and their children.\n\nDICK CHENEY’S COMPLICATED LEGACY\n\nHe gave unintimidated support as well to his daughter Liz Cheney, who, as a former Wyoming representative and member of the Republican leadership, opposed Trump’s course of action on Jan. 6 and supported his impeachment, conduct that I wrote at the time “any reasonable person could find impeachable.” That led to the Cheneys’ otherwise surprising endorsement of former Vice President Kamala Harris last year.\n\nLet me close on a personal note. When I ran into Cheney, he often recalled playing high school football for Casper against Worland quarterback Grant Ujifusa, who later created The Almanac of American Politics and enlisted me as a co-author. With both now gone, I can’t help thinking that playing high school football on cold, maybe freezing, Wyoming fall Friday evenings may leave you unintimidated by anything you face later.","summary":"The word that best describes how former Vice President Dick Cheney, who wielded the responsibilities he undertook in public affairs over a long career, began improbably early in life and extended into years of repudiation by his fellow partisans, is unintimidated. He was unintimidated by his rise to become White House chief of staff at [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/columnists/3900415/dick-cheney-always-unintimidated/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2023/12/cb424d2cd767edab86651dfd8c12ea9c-scaled.jpg?w=696","video":null,"publish_date":"2025-11-26 22:02:06","author":"Michael Barone","authors":["Michael Barone"],"language":"en","source_country":"US","sentiment":-0.042},{"id":382521852,"title":"Cuckolded ex of writer who 'had affair' with RFK Jr rebounds with lookalike feminist... who hates men but fetches his coffee","text":"Olivia Nuzzi's scorned ex-fiancé has found love again with a radical feminist activist nearly half his age – who openly boasts of her hatred of men.\n\nPolitical reporter Ryan Lizza, 51, gushed about meeting an 'extraordinary' new woman in a recent blog post but stopped short of sharing her identity.\n\nBut the Daily Mail can exclusively reveal his youthful new squeeze is abortion rights advocate Caroline Motley, 28 who describes herself as a misandrist – someone who dislikes or despises males.\n\nBoarding school-educated Motley – a blonde Nuzzi lookalike – grew up in a $7million DC-area mansion and launched woke non-profit Movement for Choice, which promotes reproductive justice through fitness classes and 'trauma-informed yoga'.\n\nThe petite firebrand's social media espouses a laundry list of liberal causes – from gun control and LGBTQ+ rights, to saving the planet, taxing the rich and 'holding men accountable.'\n\nShe worked for the 2024 Harris for President campaign and was photographed weeping and biting her nails when Kamala Harris gave her concession speech at Howard University.\n\nInternational relations graduate Motley gave an interview days later, confessing she was 'very scared' a second Donald Trump presidency would embolden male supremacists.\n\nBut her plucky bid to smash the patriarchy was put on hold Tuesday when she slipped away from Lizza's northwest Washington DC apartment to fetch his iced coffee order.\n\nMotley was clutching a cup with Lizza's name on the side when the Daily Mail snapped exclusive photos of her waiting for him outside the lobby, wearing a plunging red top, blue jeans and gold hoop earrings.\n\nA relaxed-looking Lizza emerged moments later, carrying several items of luggage, before the lovestruck pair hopped into a chauffeur-driven limo and drove away.\n\nThe budding romance comes after former CNN analyst Lizza broke off his two-year engagement to Nuzzi after her apparent fling with Robert F. Kennedy Jr. hit the news in September 2024.\n\nVanity Fair reporter Nuzzi, 32, has spent the past few weeks teasing salacious new details of her alleged infidelity to promote an upcoming memoir, American Canto.\n\nBut it's arguably Lizza who has been dropping the biggest truth bombs on his Telos News Substack page.\n\nThe veteran politico claimed in one post that married RFK Jr., penned his journalist ex an outrageous, risqué poem reading: 'You are my canyon. I mean to flow through you.'\n\nHe also dished on Nuzzi's 'unusual' two-year relationship with Keith Olbermann - and accused her of having a tryst with former South Carolina Governor Mark Sanford when she was writing about him.\n\nBut one nugget of information glossed over in this month's headlines was Lizza's admission that for the past year, he's been dating someone new.\n\n'I've resisted writing about these events partly because the last year turned out to be one of the happiest of my life, both professionally and personally,' he wrote.\n\n'As the media industry crumbled, I went independent with this modest endeavor, Telos News, which has been the most gratifying experience of my career.\n\n'I also met the most extraordinary woman I've ever known, someone whose beauty, inside and out, takes my breath away.\n\n'Every day, I marvel at my impossible luck that she loves me back. We just celebrated our first year together.'\n\nThe object of his affections is leftwinger Motley – pronouns she/her – who recently completed a Master of Public Administration degree at George Washington University, according to her LinkedIn page.\n\nThe activist grew up in a 10,000 sq ft Virginia estate, which was hailed for its 'bucolic and expansive grounds' in a 2011 news article about a fundraiser hosted by her parents.\n\nTheir neighbors included former Vice President Dick Cheney and Robert Bork, who was solicitor general of the United States from 1973 to 1977.\n\nMotley's father, John Motley III, 75, made his fortune in office products and runs a sales company, while mom Debbie, 66, describes herself as a nutrition expert.\n\nThe wealthy couple have three more kids but none appear to be as radical as Motley, who wrote in a 2022 TikTok post: 'Unfortunately I do love… being a misandrist.'\n\nMotley went to an all-girls boarding school before majoring in international relations and taking part in the Model United Nations club at the College of Charleston.\n\nShe has vacationed in Martha's Vineyard, traveled widely in Portugal, Croatia and Jamaica, and gone backpacking in Bolivia and Ecuador.\n\nBut it was during her year studying abroad in France that Motley began to focus her energies on abortion rights, according to a profile posted by Movement for Choice, the non-profit she co-founded in 2022.\n\n'While in Paris, Caroline had the opportunity to visit an abortion clinic that provided community members with the reproductive care they needed, in addition to treating survivors of female genital mutilation.\n\n'Many of the patients that this clinic serves are asylum seekers from Sub-Saharan Africa who came to France in order to escape gender-based violence.\n\n'After this experience, Caroline felt called to dedicate her life not only to feminism at large, but specifically to reproductive healthcare.'\n\nMotley has volunteered with Hillary for America, Harris for President and Foggy Bottom Plan B, where she handed out free contraception.\n\n But her biggest achievement has been Movement for Choice, which promotes 'Reproductive Justice for ALL – especially black, brown, queer, and trans communities.'\n\nVisitors to the non-profit's website are confronted with a land acknowledgement decrying the 'settler colonialism' that robbed Native American tribes of what is now modern-day DC.\n\nIt's followed by a lengthy DEI (Diversity, Equity and Inclusion) mission statement promising that participants of all identities will feel 'safe, heard and appreciated' at Movement for Choice events, which include fitness classes and yoga sessions.\n\nMotley's feminist sympathies do not extend to conservative Supreme Court Justice Amy Coney Barrett, whom she savaged in a 2022 TikTok video, saying: 'She needs to be looked at by several psychologists.'\n\nBut she seems to be warming to the rumored 2028 Democrat pick for President Gavin Newsom thanks to his steadfast support for the abortion drug Mifepristone.\n\nMotley reposted a list of the California Governor's healthcare policies in September, set to the raunchy Usher hit Hey Daddy.\n\nThe Daily Mail has contacted both Lizza and Motley for comment.","summary":"Olivia Nuzzi's ex-fiancé, Ryan Lizza, has moved on with an abortion-rights activist following his widely publicized split from the Vanity Fair reporter following reports linking her to RFK Jr.","url":"https://www.dailymail.co.uk/media/article-15328411/olivia-nuzzi-ex-ryan-lizza-new-feminist-lover-Caroline-Motley.html","image":"https://i.dailymail.co.uk/1s/2025/11/26/20/104210395-0-image-m-3_1764188475346.jpg","video":null,"publish_date":"2025-11-26 21:15:44","author":"Ben Ashford,Editor","authors":["Ben Ashford","Editor"],"language":"en","source_country":"gb","sentiment":-0.036},{"id":382504192,"title":"Gisele Bündchen splashes $14.5M on fourth Miami dream home next door to her current pad shared with jiu-jitsu hunk","text":"She already owns three Florida homes, but the Daily Mail can reveal Gisele Bündchen has splashed the cash again – on a stunning six-bedroom house next door to the one she currently lives in.\n\nThe blonde model's swanky new pad is in Miami's ritzy Surfside neighborhood and is worth a cool $14.5million. \n\nPhotos exclusively obtained by the Daily Mail show the spacious property boasts manicured grounds dotted with palm trees, a large pool and its own boat dock that juts out into Biscayne Bay.\n\nAccording to a recent property listing, the palatial villa also has six bathrooms, 'top-of-the-line' appliances and a private spa – making it perfect for the 'ultimate coastal lifestyle'.\n\nBündchen, 45, has lived in the Surfside neighborhood for years while Brady lives just across Biscayne Bay on Indian Creek Island – nicknamed the 'Billionaire Bunker' thanks to its high-rolling residents like Amazon boss Jeff Bezos.\n\nAlong with Brady, 48, her other neighbors include Jared Kushner and Ivanka Trump, who were seen having lunch with the supermodel on a yacht in Miami in September.\n\nGisele and Ivanka also share a gym as well as a neighborhood, with both choosing to train with Gisele's Costa Rican ju-jitsu trainer boyfriend, Joaquim Valente.\n\nValente, 38, has been spotted repeatedly at the flash new pad in recent weeks, as well as at the couple's sprawling $9million ranch in Southwest Ranches, a rural town 15 miles south of Fort Lauderdale.\n\nThe handsome trainer and his model girlfriend have been together since November 2022, when they were first pictured holidaying in the Costa Rican coastal area of Provincia de Puntarenas.\n\nThey made their romance official in June 2023 and welcomed a baby son in February this year.\n\nThe baby is Gisele's third child, with the model already a mom to two children - Vivian Lake, 11, and Benjamin Rein, 15 - with NFL GOAT Brady, and was the stepmom of Brady's first son, John, 18, from a previous relationship with actress Bridget Moynahan\n\nBundchen divorced Brady in 2022 and told Vanity Fair the following year that they had grown apart.\n\nShe said: 'Sometimes you grow together; sometimes you grow apart. When I was 26 years old and he was 29 years old, we met, we wanted a family, we wanted things together.'\n\nBündchen said that as time passed, she and Brady realized they 'just wanted different things,' and in turn, were faced with a difficult 'choice to make.'\n\nShe added of Brady: 'That doesn't mean you don't love the person.'\n\nThe model has remained close to her famous ex since the split, but reportedly felt she had 'lived in his shadow' for a long time and is loving her 'new chapter' with Valente.\n\nThe source also told Page Six: 'Gisele and Joaquim were not planning to have a child together.\n\n'This was unexpected. Joaquim has always wanted a family, so she is happy to be able to give this to him.'\n\n'She knew that he would be a great father when her kids started taking classes with him. He is patient, playful and so understanding.\n\nAt the time of their divorce, Bundchen had starred in more than 550 ad campaigns, posed for 2,000 magazine covers, and walked in 800 fashion shows, while Brady had played 22 seasons in the NFL, helping his teams win seven Super Bowl titles and breaking numerous records along the way.\n\nTogether, the pair amassed a staggering fortune - even as Bundchen put her fashion career on the back burner in order to support her husband's quest for continued Super Bowl glory - they were estimated to have a combined fortune of $733million.\n\nPrior to Brady, the 45-year-old had a string of glamorous boyfriends, including a high-profile relationship with Leonardo DiCaprio, 50, pro-surfer Kelly Slater, 53, and actors Josh Hartnett, 47, and Chris Evans, 44.\n\nLike his ex, Brady is no stranger to a big bucks property purchase and owns a $17million mansion in the same Miami neighborhood as Gisele.\n\nOn top of that, he also owns a lavish custom-built home in Los Angeles' upscale Brentwood suburb, where his neighbors include failed presidential candidate Kamala Harris and basketball superstar LeBron James.\n\n⁠⁠The 14,000sqft property boasts a vast master bedroom with an ensuite bathroom, its own wine cellar and a gorgeous rectangular pool set in landscaped gardens.\n\nOther features include an outdoor 'bar-lounge' and a massive marble kitchen that comes with a huge white marble island for Brady to eat at.","summary":"Supermodel Gisele Bundchen, 45, has cashed in $14.5million on her fourth Florida home right next to the one she lives in with her Costa Rican jiu-jitsu boyfriend, Joaquim Valente.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15329027/gisele-bundchen-millions-miami-surfside-home-joaquim-valente.html","image":"https://i.dailymail.co.uk/1s/2025/11/26/19/104212231-0-image-m-13_1764185025611.jpg","video":null,"publish_date":"2025-11-26 20:25:36","author":"Ben Ashford,Editor,Ruth Styles","authors":["Ben Ashford","Editor","Ruth Styles"],"language":"en","source_country":"GB","sentiment":0.475},{"id":382516960,"title":"Fani Willis was the only prosecutor to seriously challenge Trump over Jan. 6 — and she completely botched it","text":"Fani Willis’ effort to prosecute then-former President Donald Trump, alleging a coordinated effort to change the results of the 2020 election and keep himself in power, ended on Wednesday, the day before his first of four Thanksgivings he’ll celebrate as commander-in-chief once again.\n\nThe case against Trump and 14 other co-defendants collapsed in a heap after a prosecutor assigned to take over the case from Fulton County District Attorney Fani Willis asked a judge to dismiss the charges, citing the unfeasible prospect of compelling a sitting president to appear in court and the small likelihood that the trial could still be mounted after he left office.\n\nIt marked the end of the last effort to hold Trump accountable, at least criminally, for the lawbreaking and corruption his enemies have long argued was a defining characteristic of the MAGA Republican president before his rise to power — and resulting from his efforts to cling to it after voters decided otherwise. \n\nThe book is now closed on any prosecution of Trump or any of his allies and supporters for the violent riot at the U.S. Capitol on Jan. 6, 2021, when a mob stormed the halls of Congress to seeking to halt the certification of the election. The statute of limitations will expire next year for any federal charges related to the violent attack.\n\nIn the end, it came down to timing — and an incredibly glaring error of personal and professional judgment by Willis. \n\nThe Georgia case, like the federal effort headed up by Jack Smith at the Department of Justice, was stymied by Trump’s return to the presidency in 2025. But Smith’s seemed predestined to fail as Merrick Garland, Joe Biden’s attorney general, did not begin the investigation against Trump in earnest until March of 2022, only a few months before it was clear that Trump would run again.\n\nThe Justice Department instead consumed an incredible amount of resources identifying and chasing down individual participants in the Jan. 6 attempted insurrection, a well-intentioned strategical error that was ultimately rendered a meaningless crusade given Trump’s decision to pardon each and every one of them upon returning to the White House.\n\nTrump has maintained his innocence all along but alos to this day speaks of the 2020 election as “rigged” and a “fraud.”\n\nWillis’ prosecution appeared serious from the onset, however, and scored early victories. Four of Trump’s 18 original co-defendants including Sidney Powell, a top member of his legal team, took plea deals and were convicted in 2023, agreeing to testify against their allies.\n\nIn February 2024, a Supreme Court ruling made clear that Smith’s case would almost certainly be delayed through the 2024 election, jeopardizing its future and tying its fate to the results of the matchup between Trump and Kamala Harris. But in January, a development in Willis’ case had already dealt a mortal wound to the prosecution of Trump and his remaining co-defendants.\n\nA motion made by one of those co-defendants revealed a shocking twist. Willis and a special prosecutor she’d hired to assist with the case, Nathan Wade, were in a romantic relationship. The defense attorneys argued that Willis, by allowing Wade to pay for a Royal Caribbean cruise vacation for the pair in 2022 and two other trips in 2023, had financially benefitted from her appointment of Wade to possibly the most important and heavily scrutinized case being undertaken by a district attorney in a decade. The revelation was first uncovered via Wade’s divorce proceedings.\n\nBy appointing Wade to the case, Willis doomed it. One Georgia-based legal expert told the New York Times that Willis had “stabbed the case right in the heart.”\n\n\"The history books will look back on what the country lost by not having a televised trial before November 2024 and historians will wonder what Fani Willis was thinking. And they'll just scratch their heads,\" Anthony Michael Kreis, a law professor at Georgia State, told The Guardian after the case was “indefinitely” delayed that following summer. \n\nWillis herself was formally removed from the case one month after the 2024 election.\n\nDemocrats had limited opportunities and avenues to seek prosecution of what they and many legal experts viewed as widespread criminal behavior by the Trump campaign in the wake of the 2020 election. Even in Georgia, the prosecutor who took the case over from Willis argued that the charges should have been pursued at the federal level, despite the guilty pleas of some co-defendants.\n\n\"The criminal conduct alleged in the Atlanta Judicial Circuit's prosecution was conceived in Washington, D.C., not the State of Georgia. The federal government is the appropriate venue for this prosecution, not the State of Georgia,\" wrote Pete Skandalakis in a court filing. He also cast doubt on the strength of the racketeering charge against Trump and others.\n\nBut Willis’ investigation of the president still stands out for one reason: Her office identified Trump as a target early on, and despite having significantly fewer resources than the federal DOJ, was able to return a grand jury indictment of the president and a host of others just two weeks after the Justice Department did. While by all accounts Willis’ team was on the ball early, a host of reporting supports the conclusion that Garland was largely pressured into bringing a delayed case against Trump at the federal level by the revelations of the House January 6 committee, which investigated both the attack itself and the broader “fake electors” efforts in Georgia, Arizona and other states.\n\nReporting from The New York Times in particular indicated that Garland focused on a bottom-up strategy, with little sense of urgency. His efforts to keep the Justice Department out of politics failed, with the case coming too late. \n\nThe reward: A Trumpified DOJ is now being singled out for its campaign against Donald Trump’s enemies that increasingly looks to be mired in failure with the dismissal of charges against James Comey and Letitia James, brought by a Trump loyalist whose appointment as prosecutor was ruled to be illegal.\n\nWillis, however, retains the singular glory of having blasted a hole in her own case through sheer bad judgement. \n\nHer relationship with Wade seems to have ended already: He testified in 2024 that their relationship ended and they were now just “good friends,” though an appearance together at an airport in early 2025 suggests the two remain very close to this day.\n\nThe convictions of Sidney Powell, Kenneth Chesebro and Jenna Ellis as part of plea deals secured by Willis’ office remain the only ones secured by any prosecutor, anywhere, still in effect stemming from the election subversion effort and the violent attack on the Capitol. \n\nThat’s merely a consolation prize, however, as Willis and others confront the reality that Trump, in their view, got away with it.","summary":"Willis had her eye on the ball early, but a stunning error of judgement ‘stabbed the case right in the heart’, John Bowden writes.","url":"https://www.independent.co.uk/news/world/americas/us-politics/fani-willis-georgia-trump-election-jan-6-b2873248.html","image":"https://static.independent.co.uk/2025/03/17/19/Fani_Willis_Open_Records_58508.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/AN7BeMvd-OhrQWqOm.mp4","publish_date":"2025-11-26 20:23:32","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.157},{"id":382591300,"title":"Elon Musk calls for Charlie Kirk to be TIME Person of the Year","text":"Analysis by WorldTribune Staff, November 26, 2025 Real World News\n\nElon Musk has endorsed a call for Turning Point USA founder Charlie Kirk to be named TIME’s “Person of the Year”.\n\nMusk’s replied to a Nov. 24 post on X from user @Sassafrass_84, who wrote:\n\n“Charlie Kirk should be the person of the year. You can’t change my mind,” alongside an image of Kirk with the caption, “We still remember. We’re still fighting.”\n\nThe post had over 7,400 views shortly after being published and is nearing the 100,000 mark.\n\nMusk was named TIME Magazine’s Person of the Year in 2021 for his leadership at Tesla and SpaceX and for reshaping multiple industries.\n\nThe odds are heavily stacked against the devout Christian conservative Kirk getting the honor especially considering that a Marxist won the mayoral election in New York City. The odds greatly favor TIME recognizing Zohran Mamdani.\n\nRecent TIME Persons of the Year include:\n\n• 2024 and 2016: President Donald Trump\n• 2023: Taylor Swift\n• 2022: Volodymyr Zelenskyy\n• 2021: Elon Musk\n• 2020: Joe Biden and Kamala Harris\n• 2019: Greta Thunberg\n\nCharlie Kirk should be the person of the year.\nYou can’t change my mind. pic.twitter.com/AGvfsWHabj\n— Sassafrass84 (@Sassafrass_84) November 24, 2025\n\n Resist Group Think\n\n Elon Musk calls for Charlie Kirk to be TIME Person of the Year, WorldTribune.com","summary":"Analysis by WorldTribune Staff, November 26, 2025 Real World News Elon Musk has endorsed a call for Turning Point USA founder Charlie Kirk to be named TIME&#8217;s “Person of the Year”. Musk’s replied to a Nov. 24 post on X from user @Sassafrass_84, who wrote: “Charlie Kirk should be the person of the year. You [&#8230;]","url":"https://worldtribune.com/elon-musk-calls-for-charlie-kirk-to-be-time-person-of-the-year/","image":"https://worldtribune.com/wp-content/uploads/2025/11/timekirk.jpg","video":null,"publish_date":"2025-11-26 19:12:59","author":"Editor Two","authors":["Editor Two"],"language":"en","category":"politics","source_country":"us","sentiment":0.071},{"id":382438792,"title":"Democrats Investigating Flyers With Wrong Tennessee Special Election Date","text":"Tennessee Democrats are investigating postcards allegedly sent to voters with an incorrect date for the upcoming special election between Democrat Aftyn Behn and Republican Matt Van Epps.\n\nA spokesperson for the Tennessee secretary of state’s office told Newsweek on Wednesday that the office has seen the screenshots of the mailers allegedly sent to voters, but that voters have not contacted them about the matter.\n\nNewsweek reached out to the Tennessee Democratic Party via email and the Tennessee GOP via contact form for comment.\n\nWhy It Matters\n\nThe special election in Tennessee’s 7th Congressional District has drawn significant investment from both major parties. It is viewed as being potentially competitive, despite President Donald Trump carrying the district by more than 20 points against former Vice President Kamala Harris in the 2024 election. The district comprises parts of Nashville and its suburbs, as well as Clarksville and more rural areas.\n\nThe outcome of the special election could have key implications for control of the House of Representatives, where Republicans hold a 219-213 majority. The resignation of Representative Marjorie Taylor Greene, a Georgia Republican, in January will bring that to 218-213, and it could get more narrow in the coming months following special elections in more Democratic-leaning districts. If Behn pulls off a victory, it would further shrink the GOP’s majority.\n\nWhat to Know\n\nTurnout will be key to how close the special election becomes. If turnout is lower in the district’s rural areas but higher in Democratic-leaning Nashville, Democrats would have a better chance of flipping the seat next Tuesday. But if turnout is closer to typical election levels, Republicans would be favored.\n\nRachel Campbell, the chair of the Tennessee Democratic Party, said in a video posted on Facebook on Saturday that the party is investigating reports that some voters have received materials containing inaccurate information about the election date.\n\n“Just breaking into the game briefly to say that we have heard the reports of fraudulent dates being circulated,” she said in the video. “While we are looking at who may be distributing these, it’s important to remember that Election Day is December 2.”\n\nD. Patrick Rodgers, editor-in-chief of the newspaper Nashville Scene, posted photos on Bluesky of alleged mailers urging residents to vote for Behn on December 3, one day after the election will have already taken place. \n\nThe mailers have “no attribution or return address” and are being sent to voters in Nashville, he wrote.\n\n“Mark your calendars & make a plan to vote on December 3rd,” the mailer reads.\n\nThe origins of the flyers remained unclear.\n\nOn Wednesday, a poll from Emerson College showed Behn trailing Van Epps by only 2 points (49 percent to 47 percent). It surveyed 600 likely voters from November 22-24 and had a margin of error of plus or minus 3.9 percentage points.\n\nA sign reading “vote here” points toward a polling place in Minneapolis, Minnesota, on August 14, 2018.\n\nWhat People Are Saying\n\nThe Tennessee Holler wrote to X: “Wowwww… so dirty. Mailers with the wrong Election Date. @aftynfortn Behn making Republicans get desperate.”\n\nWilliam Lyons, professor at the Howard Baker School of Public Affairs at the University of Tennessee, previously told Newsweek: “With Congress so evenly divided every contest is critical. Parties will continue to commit significant resources to marginally competitive districts like the Tennessee 7th, hoping to either cause or prevent an upset that would have national consequences. Concerns about representation of district-specific issues are taking a back seat.”\n\nWhat Happens Next\n\nBehn and Van Epps will make their final efforts to get their supporters to the polls over the coming days before the election next Tuesday. The Cook Political Report classifies the race as “Likely Republican.”","summary":"Rachel Campbell, chair of the Tennessee Democratic Party, raised concerns about &quot;fraudulent dates being circulated.&quot;","url":"https://www.newsweek.com/democrats-investigating-flyers-wrong-tennessee-special-election-date-11115351","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-1016543352.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-26 18:02:28","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.202},{"id":382403958,"title":"Tennessee’s 7th District shifts from ‘safe Republican’ to ‘lean Republican’ in election tracker","text":"Not all election trackers are in agreement. The Cook Political Report stood by its “likely Republican” designation on Tuesday, arguing that the cumulative effect of increased national attention to the race would ultimately benefit Epps.\n\nRepublicans have been plagued by poor turnout in off-year elections, especially those in which Trump is not on the ballot. The 7th District’s special election is particularly dangerous for Republicans as it occurs shortly after Thanksgiving.\n\nFormer Vice President Kamala Harris threw her weight behind Behn, speaking at a rally on Tuesday. However, her active role may be counterproductive, given her poor performance in 2024.\n\nTrump countered with a spirited endorsement of Epps, urging voters to back him in the polls.\n\nHARRIS STUMPS FOR TENNESSEE DEMOCRAT IN COMPETITIVE SPECIAL ELECTION\n\n“I am asking all America First Patriots in Tennessee’s 7th Congressional District, who haven’t voted yet, to please GET OUT AND VOTE for MAGA Warrior Matt Van Epps, tomorrow, November 26th, the last day to vote early in person,” Trump wrote on Truth Social. “You can win this Election for Matt! PLEASE VOTE FOR MATT VAN EPPS, who has my Complete and Total Endorsement.”\n\nThe special election has been escalated to national proportions due to its potential to alter the Republicans’ slim House majority.","summary":"Inside Elections changed its rating for Tennessee‘s 7th Congressional District special election from “safe Republican” to “lean Republican,” as Democrats continue to pour money into the race. Democrat Aftyn Behn and Republican Matt Van Epps are facing off to fill the seat of former Republican Tennessee Rep. Mark Green, who left Congress in June. Despite [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3899771/tennessee-7th-district-shifts-safe-republican-lean-republican-election-tracker/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/11/AP25321688056451.jpg?w=696","video":null,"publish_date":"2025-11-26 17:16:59","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.276},{"id":382487134,"title":"Crucial swing voters 'no longer fooled' by Trump — and Republicans are worried","text":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency. And those reasons range from health care to the economy to foreign policy.\n\nPotts said of health insurance, \"We had the lowest uninsured rate in the history of the United States in 2023…. It was the point of the Affordable Care Act…. to get as many people in this country insured as possible to move us toward universal health care. And Republicans let those enhanced subsidies expire. And what's happened as a result of that is that insurers have increased their premium rates. So right now, as we speak, people who buy health care on the insurance marketplaces are looking at the costs for next year, and they're seeing premiums for the same plans go up.\"\n\nPotts added, \"Some people are seeing really dramatic increases…. For other people, it’s increases of thousands of dollars for their family coverage. And some people are deciding to opt out and not buy insurance.\"\n\nTrump, Potts noted, ran \"on affordability issues\" in 2024 — and now, \"affordability\" is a key source of anxiety for the independents and swing voters who favored him last year.\n\n\"Energy bills are expensive,\" Potts told Sargent. \"The labor market is not very good right now. People feel stuck in their jobs. They feel like they're not making enough. They feel like they can't move forward. And so, people aren't very optimistic right now. And I think that all the things that Trump is doing are really making it worse to a huge degree…. I think that one thing to keep in mind, which is something I always try to remember, is that most people just do not pay that much attention to the ins and outs of politics or every single thing that every president does. And so, you know, in a lot of people's minds, Trump was still a successful businessman — and they had a, maybe a false memory or they had a kind of a rosy memory of the economy before COVID and they thought, well, things were better then. And he's a businessman — maybe he can get us out of this mess because (Joe) Biden had the bad luck to serve for four years that included a really weird post-COVID-era and high inflation.\"\n\nPotts continued, \"And so, I think that some people just thought, 'Well, he's a businessman, he can bring us jobs, he can straighten out the economy. Without thinking too much more about it. And so, I think that there were some voters who voted for Trump for that reason, and they’re no longer fooled. They can see now what's happening.\"\n\n Listen to the full New Republic podcast at this link or read the transcript here.","summary":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency.","url":"https://www.rawstory.com/alternet-posts/2674345310/","image":"https://www.rawstory.com/media-library/image.jpg?id=62243434&width=1200&height=600&coordinates=0%2C417%2C0%2C418","video":null,"publish_date":"2025-11-26 16:45:26","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.269},{"id":382403468,"title":"Crucial swing voters 'no longer fooled' by Trump — and Republicans are worried","text":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency. And those reasons range from health care to the economy to foreign policy.\n\nPotts said of health insurance, \"We had the lowest uninsured rate in the history of the United States in 2023…. It was the point of the Affordable Care Act…. to get as many people in this country insured as possible to move us toward universal health care. And Republicans let those enhanced subsidies expire. And what's happened as a result of that is that insurers have increased their premium rates. So right now, as we speak, people who buy health care on the insurance marketplaces are looking at the costs for next year, and they're seeing premiums for the same plans go up.\"\n\nPotts added, \"Some people are seeing really dramatic increases…. For other people, it’s increases of thousands of dollars for their family coverage. And some people are deciding to opt out and not buy insurance.\"\n\nTrump, Potts noted, ran \"on affordability issues\" in 2024 — and now, \"affordability\" is a key source of anxiety for the independents and swing voters who favored him last year.\n\n\"Energy bills are expensive,\" Potts told Sargent. \"The labor market is not very good right now. People feel stuck in their jobs. They feel like they're not making enough. They feel like they can't move forward. And so, people aren't very optimistic right now. And I think that all the things that Trump is doing are really making it worse to a huge degree…. I think that one thing to keep in mind, which is something I always try to remember, is that most people just do not pay that much attention to the ins and outs of politics or every single thing that every president does. And so, you know, in a lot of people's minds, Trump was still a successful businessman — and they had a, maybe a false memory or they had a kind of a rosy memory of the economy before COVID and they thought, well, things were better then. And he's a businessman — maybe he can get us out of this mess because (Joe) Biden had the bad luck to serve for four years that included a really weird post-COVID-era and high inflation.\"\n\nPotts continued, \"And so, I think that some people just thought, 'Well, he's a businessman, he can bring us jobs, he can straighten out the economy. Without thinking too much more about it. And so, I think that there were some voters who voted for Trump for that reason, and they’re no longer fooled. They can see now what's happening.\"\n\n Listen to the full New Republic podcast at this link or read the transcript here.","summary":"Although Donald Trump's victory over Democratic nominee Kamala Harris in the United States' 2024 presidential election wasn't the \"landslide\" he claims it was — Trump won the national popular vote by roughly 1.5 percent — his gains with everyone from Latinos to Generation Z to independents got him past the finish line. 2024 marked Trump's fourth presidential campaign and the first time he won the popular vote, and his victory came despite the fact that he was facing four criminal indictments at the time.\n\nThe economy was a key factor in Trump's gains with independents and swing voters. But with fears about the health of the U.S. economy growing, Trump is, according to polls, losing ground with them. \n\nIn a conversation for The New Republic's \"The Daily Blast\" podcast posted on November 26, host Greg Sargent (a former Washington Post columnist) and his colleague Monica Potts lay out some reasons why Trump's gains with swing voters and independents are rapidly disappearing ten months into his second presidency.","url":"https://www.alternet.org/2674345310/","image":"https://www.alternet.org/media-library/image.jpg?id=62243434&width=1200&height=600&coordinates=0%2C417%2C0%2C418","video":null,"publish_date":"2025-11-26 16:45:26","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.269},{"id":382739118,"title":"Cure homelessness with more housing, not more subsidies","text":"This Thanksgiving, millions of Americans will gather around tables filled with food, but millions of others will have no table at all. Homelessness has surged in many major American cities, even in a nation overflowing with wealth and land. The problem is not that we have run out of space, materials, or compassion. It is that we have surrounded the simple act of building homes with walls of red tape.\n\nThe homelessness crisis is, above all, a housing policy crisis. Across the country, local zoning rules, environmental reviews, and various development fees have created an artificial scarcity of housing, driving up costs and, in turn, leaving many people without shelter.\n\nWe often hear that homelessness is caused mainly by drug abuse or mental illness. To be sure, those struggles are real and deserve compassion, but they do not explain the pattern we see. If addiction or mental illness were the main cause, homelessness would be evenly distributed nationwide. Instead, it is concentrated in places with the most restrictive land-use laws, the very jurisdictions where it is hardest to build. The data tell a simple story: when government throttles housing supply, homelessness follows. We’re often told that correlation isn’t causation, but when the data fit the logic of cause and effect, it’s no longer just correlation.\n\nThe National Association of Home Builders estimates that local rules and fees now account for nearly a quarter of the price of new housing, and for an eye-popping 40.6% of total development costs of multifamily housing (read: apartments). When a builder elects to bear these costs in the short run and build (as opposed to refraining from the effort because of the high cost), the builder ultimately must pass the costs on to renters and first-time buyers to recoup her investment. Those extra, unnecessary, regulation-generated costs that are baked into the price of a home price out the families most in need of affordable housing.\n\nA major culprit is exclusionary zoning, the local ordinances that dictate what kinds of homes can be built and where they can be built. These laws often ban multi-family units or impose large minimum lot sizes that make affordable homes effectively illegal in large portions of our cities and towns. What began as an effort to protect neighborhood character has too often become a means to keep working families from accessing opportunities.\n\nThe result is a man-made famine of shelter in a land of abundance. America remains rich in talent, land, and enterprise, yet we have fenced off housing prosperity behind government permission structures that stack the deck against new, affordable housing.\n\nThe Gospel’s account of the multiplication of the loaves and fishes offers a better model. In that moment of scarcity, a small offering multiplied to feed a multitude because it was shared freely.\n\nOur economy works the same way. When people are free to build, innovate, and exchange, prosperity expands. But when we bind enterprise in red and green tape, red for bureaucracy and green for regulation, we stop the miracle before it can begin.\n\nRepublicans and Democrats alike understand the need for more housing. Republicans have long advocated for more free-market solutions that would allow builders less regulation in building projects. And in 2024, then-presidential candidate Kamala Harris unveiled a plan to build more than 3 million housing units.\n\nDo that, and abundance will grow again, not by miracle, but by the freedom that allows creativity to flourish.\n\nThis time of year is about gratitude, and it is also about trust: trust that the gifts we share, as the pilgrims did, will multiply for the good of others. America’s prosperity has always rested on that faith. When people are free to use their talents in service to one another, including to build, there will be enough for all. By applying the spirit of Thanksgiving to our housing policy all year round, we can solve the homeless crisis.\n\nMark Miller is the director of environment and natural resources litigation at Pacific Legal Foundation","summary":"Do that, and abundance will grow again, not by miracle, but by the freedom that allows creativity to flourish.","url":"https://www.sandiegouniontribune.com/2025/11/26/cure-homelessness-with-more-housing-not-more-subsidies/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/04/sut-l-inflation-004.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-26 16:18:23","author":"Gqlshare,Mark Miller","authors":["Gqlshare","Mark Miller"],"language":"en","source_country":"us","sentiment":-0.04},{"id":382403960,"title":"Joe Concha predicts Rush Hour 4 ‘will be profitable’ thanks to MAGA viewers","text":"“President Trump probably knows entertainment as well as any president since Ronald Reagan,” Concha said on Fox News’s Fox and Friends First on Wednesday. “This is awesome because you know Trump will promote this film when it comes out. If MAGA comes to see it, it will be quite profitable.”\n\n“Since we know the president watches this show — he’s an early riser — I would say, Mr. President, can we get a Caddyshack 3?” Concha added. “Because Caddyshack 1 is an all-time classic, Caddyshack 2 was the worst sequel of all time, so we need a do-over on that one and collaboration with John Wick and Jason Bourne.”\n\nRush Hour 4 does not have a known release date as of Wednesday. Chan’s latest release was The Karate Kid: Legends this year. Tucker’s last movie was Air in 2023.\n\nParamount announced earlier this year that it would pay Trump $16 million to settle his lawsuit over its 60 Minutes program. While Trump himself did not appear on the program before the 2024 election, he sued over his then-opponent Vice President Kamala Harris’s segment, which received heavy edits. Shortly after, the Federal Communications Commission approved Paramount’s merger with Skydance.","summary":"Washington Examiner senior writer Joe Concha predicted a big box-office hit for Rush Hour 4 due to President Donald Trump’s reported involvement. Paramount Skydance greenlit the long-awaited Rush Hour sequel on Tuesday after Trump reportedly pressured CEO Larry Ellison to revive one of Trump’s favorite movie franchises. The action series centered on the partnership between [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3899730/concha-rush-hour-4-profitable-maga-viewers/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/trump-iowa-speech.webp?w=696","video":null,"publish_date":"2025-11-26 15:59:30","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","source_country":"US","sentiment":0.269},{"id":382451032,"title":"Shocking new poll shows deep-red congressional district could be next stop for Democrats’ ‘blue tsunami’","text":"A new poll shows that Democrats have a legitimate shot at flipping a deep-red congressional district in the heart of the South — and Republicans have now begun pouring money into it. \n\nEmerson College and The Hill conducted a poll for the special election in Tennessee’s 7th district, which takes place on Tuesday.\n\nRepublican Matt Van Epps has a slight lead at 48 percent, only two points ahead of Democratic state legislator Aftyn Behn, whom 46 percent of voters support. \n\n“The special election in Tennessee’s 7th District will come down to what groups are motivated to turnout on election day, and who stays home,” Spencer Kimball of Emerson said in a statement. \n\nThe number is stunning considering that President Donald Trump won the district by 22 points in 2024. If Democrats flip the seat, it would lower the number of Republicans in the conference to just 218, the exact number needed for a majority in the House of Representatives.\n\nAnd that comes before Rep. Marjorie Taylor Greene exits the House on January 5, which would lower the number of Republicans to 217. And Democrats will pick up an additional seat in Texas when the 18th district holds a special election in January and will likely hold New Jersey’s 11th district during the special election in April to replace Gov.-elect Mikie Sherrill. \n\nDemocrats hope to pull off a stunner race in the district as they have won or significantly overperformed in races across the country. \n\nIn November, Sherrill outperformed polling expectations in her race for governor and won by double digits while Abigail Spanberger won the governorship in Virginia by 15 points and won a supermajority in the state legislature. In August, Democrats flipped a Republican-held seat in Iowa’s state legislature, breaking the GOP’s supermajority.\n\n Republicans are spending heavily in the Nashville-area district to keep it red. \n\nOn Tuesday, Trump offered an enthusiastic backing of Van Epps in a rare post on X. \n\n“I am asking all America First Patriots in Tennessee’s 7th Congressional District, who haven’t voted yet, to please GET OUT AND VOTE for MAGA Warrior Matt Van Epps, tomorrow, November 26th, the last day to vote early in person,” he said. “You can win this Election for Matt! PLEASE VOTE FOR MATT VAN EPPS, who has my Complete and Total Endorsement.” \n\nBut the same poll showed Trump slightly underwater in the 7th district, as 47 percent of voters there approve of him and 49 percent disapprove. \n\n“President Trump’s approval rating is a stark reversal from last November, when he carried the district by 22 points. The decline is driven by independents, among whom 59% disapprove and just 34% approve,” Kimball said in his statement.\n\nBoth Democrats and Republicans have dumped money into the district. House Majority PAC, the Democrats main spending outlet, has reserved $515,000 worth of ads this week while Behn’s campaign has reserved $214,000 worth of ads, according to AdImpact, which tracks campaign spending. By contrast, MAGA Inc. the pro-Trump super PAC, has reserved $40,000 worth of ads, according to AdImpact. \n\nVice President Kamala Harris recently visited Tennessee at Fisk University, a historically Black college, and met with volunteers. \n\nRepublicans have also sought to paint Behn as out of touch, specifically highlighting an old podcast where she said about Nashville, “I hate this city, I hate the bachelorettes, I hate the pedal taverns, I hate country music. I hate all the things that make Nashville apparently an ‘it city.’”\n\nBut Behn defended herself. \n\n“You’re talking to someone who has cried no less than 10 times in the Country Music Hall of Fame,” she said in a video on X.","summary":"A special election next month could give Democrats another unexpected boost","url":"https://www.independent.co.uk/news/world/americas/us-politics/poll-tennessee-special-election-congress-b2872963.html","image":"https://static.independent.co.uk/2025/11/26/14/03/BehnVan-Epps-split.jpeg?crop=2047.5,1365,x0.3,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/vPC9YlA8-kPrKkZNL.mp4","publish_date":"2025-11-26 15:50:05","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.248},{"id":382397794,"title":"GOP Senators Defend Mark Kelly As Pentagon Seeks To Punish Him","text":"WASHINGTON ― Two Republican senators spoke up in defense of their Democratic colleague, Sen. Mark Kelly of Arizona, as the Trump administration seeks to punish him in response to a video he recorded last week, noting the military can defy illegal orders.\n\n“Senator Kelly valiantly served our country as an aviator in the U.S. Navy before later completing four space shuttle missions as a NASA astronaut,” Sen. Lisa Murkowski (R-Alaska) wrote in a social media post on Tuesday. “To accuse him and other lawmakers of treason and sedition for rightfully pointing out that servicemembers can refuse illegal orders is reckless and flat-out wrong.”\n\nThe moderate GOP senator added, “The Department of Defense and FBI surely have more important priorities than this frivolous investigation.”\n\nSen. John Curtis (R-Utah), a conservative who replaced Mitt Romney in the Senate, wrote: “I respect Mark Kelly and value his friendship.”\n\nHe went on to add, “I know him as someone whose career has been defined by service. His record as a combat naval aviator and NASA astronaut reflects his example of the discipline and dedication that are important for success.”\n\nThe Department of Defense said earlier this week it is reviewing “serious allegations of misconduct” against the Arizona senator, who is a decorated U.S. Navy veteran, and suggested he could face a court-martial. On Tuesday, Defense Secretary Pete Hegseth asked the Navy secretary to review Kelly’s comments in the video for “potentially unlawful conduct.”\n\nKelly has faced a barrage of attacks from President Donald Trump, who said he and the other five Democratic lawmakers who participated in the video message to servicemembers were guilty of “SEDITIOUS BEHAVIOR, punishable by DEATH.” The president then shared a post online calling for their hanging.\n\nThe FBI has also gotten involved by seeking to interview Kelly and the other Democratic lawmakers with its own probe, another highly unusual move in this saga.\n\nIt’s unclear whether any of these efforts will succeed since lawmakers are protected by the speech and debate clause of the U.S. Constitution, which shields members of Congress from being questioned or arrested for their official legislative actions. \n\nAppearing on ABC’s “Jimmy Kimmel Live” on Tuesday, Kelly called Hegseth “totally unqualified” for the job of defense secretary. \n\n“And from what I can tell in talking to some of my Republican colleagues, I mean, he just wants to please the president,” Kelly said of Hegseth, who was narrowly confirmed by the Senate after allegations of alcohol abuse and misconduct.\n\n“I’m not backing down,” Kelly told the late night host. “We said something very simple: Members of the military need to follow the law. We wanted to say that we have their backs. His response? Kill them.”\n\nKelly was first elected to the Senate in 2020, winning a special election to fill the remainder of the late Sen. John McCain’s (R-Ariz.) term. He was considered a potential running mate for Kamala Harris in the 2024 presidential election and is widely viewed as a possible 2028 Democratic presidential contender.\n\nTrump’s threats have only served to elevate Kelly within the Democratic Party. He’s since appeared on CBS’ “Face the Nation” over the weekend, as well as several cable news programs that are popular with liberal viewers, including ABC’s Kimmel, and MSNOW’s Rachel Maddow, Chris Hayes, and Joe Scarborough.\n\nDespite his promises to end the “weaponization” of law enforcement during the 2024 presidential campaign, Trump has ordered the Department of Justice to pursue many of his perceived enemies. In recent months, the DOJ has brought criminal charges against three prominent critics of the president, though a judge this week dismissed two of those cases.","url":"https://www.huffpost.com/entry/mark-kelly-trump-military_n_69270c07e4b063285311daed?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/69270dfc19000063826a01ca.jpeg?cache=4cq5cu6RZy&ops=1778_1000","video":null,"publish_date":"2025-11-26 15:45:47","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"ca","sentiment":0.158},{"id":382726718,"title":"GOP Senators Defend Mark Kelly As Pentagon Seeks To Punish Him","text":"WASHINGTON ― Two Republican senators spoke up in defense of their Democratic colleague, Sen. Mark Kelly of Arizona, as the Trump administration seeks to punish him in response to a video he recorded last week, noting the military can defy illegal orders.\n\n“Senator Kelly valiantly served our country as an aviator in the U.S. Navy before later completing four space shuttle missions as a NASA astronaut,” Sen. Lisa Murkowski (R-Alaska) wrote in a social media post on Tuesday. “To accuse him and other lawmakers of treason and sedition for rightfully pointing out that servicemembers can refuse illegal orders is reckless and flat-out wrong.”\n\nThe moderate GOP senator added, “The Department of Defense and FBI surely have more important priorities than this frivolous investigation.”\n\nSen. John Curtis (R-Utah), a conservative who replaced Mitt Romney in the Senate, wrote: “I respect Mark Kelly and value his friendship.”\n\nHe went on to add, “I know him as someone whose career has been defined by service. His record as a combat naval aviator and NASA astronaut reflects his example of the discipline and dedication that are important for success.”\n\nThe Department of Defense said earlier this week it is reviewing “serious allegations of misconduct” against the Arizona senator, who is a decorated U.S. Navy veteran, and suggested he could face a court-martial. On Tuesday, Defense Secretary Pete Hegseth asked the Navy secretary to review Kelly’s comments in the video for “potentially unlawful conduct.”\n\nKelly has faced a barrage of attacks from President Donald Trump, who said he and the other five Democratic lawmakers who participated in the video message to servicemembers were guilty of “SEDITIOUS BEHAVIOR, punishable by DEATH.” The president then shared a post online calling for their hanging.\n\nThe FBI has also gotten involved by seeking to interview Kelly and the other Democratic lawmakers with its own probe, another highly unusual move in this saga.\n\nIt’s unclear whether any of these efforts will succeed since lawmakers are protected by the speech and debate clause of the U.S. Constitution, which shields members of Congress from being questioned or arrested for their official legislative actions. \n\nAppearing on ABC’s “Jimmy Kimmel Live” on Tuesday, Kelly called Hegseth “totally unqualified” for the job of defense secretary. \n\n“And from what I can tell in talking to some of my Republican colleagues, I mean, he just wants to please the president,” Kelly said of Hegseth, who was narrowly confirmed by the Senate after allegations of alcohol abuse and misconduct.\n\n“I’m not backing down,” Kelly told the late night host. “We said something very simple: Members of the military need to follow the law. We wanted to say that we have their backs. His response? Kill them.”\n\nKelly was first elected to the Senate in 2020, winning a special election to fill the remainder of the late Sen. John McCain’s (R-Ariz.) term. He was considered a potential running mate for Kamala Harris in the 2024 presidential election and is widely viewed as a possible 2028 Democratic presidential contender.\n\nTrump’s threats have only served to elevate Kelly within the Democratic Party. He’s since appeared on CBS’ “Face the Nation” over the weekend, as well as several cable news programs that are popular with liberal viewers, including ABC’s Kimmel, and MSNOW’s Rachel Maddow, Chris Hayes, and Joe Scarborough.\n\nDespite his promises to end the “weaponization” of law enforcement during the 2024 presidential campaign, Trump has ordered the Department of Justice to pursue many of his perceived enemies. In recent months, the DOJ has brought criminal charges against three prominent critics of the president, though a judge this week dismissed two of those cases.","url":"https://www.huffpost.com/entry/mark-kelly-trump-military_n_69270c07e4b063285311daed?origin=home-zone-d-unit","image":"https://img.huffingtonpost.com/asset/69270dfc19000063826a01ca.jpeg?cache=4cq5cu6RZy&ops=1778_1000","video":null,"publish_date":"2025-11-26 15:45:47","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"ca","sentiment":0.158},{"id":382450816,"title":"GOP Senators Defend Mark Kelly As Pentagon Seeks To Punish Him","text":"WASHINGTON ― Two Republican senators spoke up in defense of their Democratic colleague, Sen. Mark Kelly of Arizona, as the Trump administration seeks to punish him in response to a video he recorded last week, noting the military can defy illegal orders.\n\n“Senator Kelly valiantly served our country as an aviator in the U.S. Navy before later completing four space shuttle missions as a NASA astronaut,” Sen. Lisa Murkowski (R-Alaska) wrote in a social media post on Tuesday. “To accuse him and other lawmakers of treason and sedition for rightfully pointing out that servicemembers can refuse illegal orders is reckless and flat-out wrong.”\n\nThe moderate GOP senator added, “The Department of Defense and FBI surely have more important priorities than this frivolous investigation.”\n\nSen. John Curtis (R-Utah), a conservative who replaced Mitt Romney in the Senate, wrote: “I respect Mark Kelly and value his friendship.”\n\nHe went on to add, “I know him as someone whose career has been defined by service. His record as a combat naval aviator and NASA astronaut reflects his example of the discipline and dedication that are important for success.”\n\nThe Department of Defense said earlier this week it is reviewing “serious allegations of misconduct” against the Arizona senator, who is a decorated U.S. Navy veteran, and suggested he could face a court-martial. On Tuesday, Defense Secretary Pete Hegseth asked the Navy secretary to review Kelly’s comments in the video for “potentially unlawful conduct.”\n\nKelly has faced a barrage of attacks from President Donald Trump, who said he and the other five Democratic lawmakers who participated in the video message to servicemembers were guilty of “SEDITIOUS BEHAVIOR, punishable by DEATH.” The president then shared a post online calling for their hanging.\n\nThe FBI has also gotten involved by seeking to interview Kelly and the other Democratic lawmakers with its own probe, another highly unusual move in this saga.\n\nIt’s unclear whether any of these efforts will succeed since lawmakers are protected by the speech and debate clause of the U.S. Constitution, which shields members of Congress from being questioned or arrested for their official legislative actions. \n\nAppearing on ABC’s “Jimmy Kimmel Live” on Tuesday, Kelly called Hegseth “totally unqualified” for the job of defense secretary. \n\n“And from what I can tell in talking to some of my Republican colleagues, I mean, he just wants to please the president,” Kelly said of Hegseth, who was narrowly confirmed by the Senate after allegations of alcohol abuse and misconduct.\n\n“I’m not backing down,” Kelly told the late night host. “We said something very simple: Members of the military need to follow the law. We wanted to say that we have their backs. His response? Kill them.”\n\nKelly was first elected to the Senate in 2020, winning a special election to fill the remainder of the late Sen. John McCain’s (R-Ariz.) term. He was considered a potential running mate for Kamala Harris in the 2024 presidential election and is widely viewed as a possible 2028 Democratic presidential contender.\n\nTrump’s threats have only served to elevate Kelly within the Democratic Party. He’s since appeared on CBS’ “Face the Nation” over the weekend, as well as several cable news programs that are popular with liberal viewers, including ABC’s Kimmel, and MSNOW’s Rachel Maddow, Chris Hayes, and Joe Scarborough.\n\nDespite his promises to end the “weaponization” of law enforcement during the 2024 presidential campaign, Trump has ordered the Department of Justice to pursue many of his perceived enemies. In recent months, the DOJ has brought criminal charges against three prominent critics of the president, though a judge this week dismissed two of those cases.","url":"https://www.huffpost.com/entry/mark-kelly-trump-military_n_69270c07e4b063285311daed?origin=top-ad-recirc","image":"https://img.huffingtonpost.com/asset/69270dfc19000063826a01ca.jpeg?cache=4cq5cu6RZy&ops=1778_1000","video":null,"publish_date":"2025-11-26 15:45:47","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"au","sentiment":0.158},{"id":382681452,"title":"GOP Senators Defend Mark Kelly As Pentagon Seeks To Punish Him","text":"WASHINGTON ― Two Republican senators spoke up in defense of their Democratic colleague, Sen. Mark Kelly of Arizona, as the Trump administration seeks to punish him in response to a video he recorded last week, noting the military can defy illegal orders.\n\n“Senator Kelly valiantly served our country as an aviator in the U.S. Navy before later completing four space shuttle missions as a NASA astronaut,” Sen. Lisa Murkowski (R-Alaska) wrote in a social media post on Tuesday. “To accuse him and other lawmakers of treason and sedition for rightfully pointing out that servicemembers can refuse illegal orders is reckless and flat-out wrong.”\n\nThe moderate GOP senator added, “The Department of Defense and FBI surely have more important priorities than this frivolous investigation.”\n\nSen. John Curtis (R-Utah), a conservative who replaced Mitt Romney in the Senate, wrote: “I respect Mark Kelly and value his friendship.”\n\nHe went on to add, “I know him as someone whose career has been defined by service. His record as a combat naval aviator and NASA astronaut reflects his example of the discipline and dedication that are important for success.”\n\nThe Department of Defense said earlier this week it is reviewing “serious allegations of misconduct” against the Arizona senator, who is a decorated U.S. Navy veteran, and suggested he could face a court-martial. On Tuesday, Defense Secretary Pete Hegseth asked the Navy secretary to review Kelly’s comments in the video for “potentially unlawful conduct.”\n\nKelly has faced a barrage of attacks from President Donald Trump, who said he and the other five Democratic lawmakers who participated in the video message to servicemembers were guilty of “SEDITIOUS BEHAVIOR, punishable by DEATH.” The president then shared a post online calling for their hanging.\n\nThe FBI has also gotten involved by seeking to interview Kelly and the other Democratic lawmakers with its own probe, another highly unusual move in this saga.\n\nIt’s unclear whether any of these efforts will succeed since lawmakers are protected by the speech and debate clause of the U.S. Constitution, which shields members of Congress from being questioned or arrested for their official legislative actions. \n\nAppearing on ABC’s “Jimmy Kimmel Live” on Tuesday, Kelly called Hegseth “totally unqualified” for the job of defense secretary. \n\n“And from what I can tell in talking to some of my Republican colleagues, I mean, he just wants to please the president,” Kelly said of Hegseth, who was narrowly confirmed by the Senate after allegations of alcohol abuse and misconduct.\n\n“I’m not backing down,” Kelly told the late night host. “We said something very simple: Members of the military need to follow the law. We wanted to say that we have their backs. His response? Kill them.”\n\nKelly was first elected to the Senate in 2020, winning a special election to fill the remainder of the late Sen. John McCain’s (R-Ariz.) term. He was considered a potential running mate for Kamala Harris in the 2024 presidential election and is widely viewed as a possible 2028 Democratic presidential contender.\n\nTrump’s threats have only served to elevate Kelly within the Democratic Party. He’s since appeared on CBS’ “Face the Nation” over the weekend, as well as several cable news programs that are popular with liberal viewers, including ABC’s Kimmel, and MSNOW’s Rachel Maddow, Chris Hayes, and Joe Scarborough.\n\nDespite his promises to end the “weaponization” of law enforcement during the 2024 presidential campaign, Trump has ordered the Department of Justice to pursue many of his perceived enemies. In recent months, the DOJ has brought criminal charges against three prominent critics of the president, though a judge this week dismissed two of those cases.","url":"https://www.huffpost.com/entry/mark-kelly-trump-military_n_69270c07e4b063285311daed?origin=home-zone-b-unit","image":"https://img.huffingtonpost.com/asset/69270dfc19000063826a01ca.jpeg?cache=4cq5cu6RZy&ops=1778_1000","video":null,"publish_date":"2025-11-26 15:45:47","author":"Igor Bobic","authors":["Igor Bobic"],"language":"en","category":"politics","source_country":"au","sentiment":0.158},{"id":382657814,"title":"Nate Jackson: Turkeys, Trump, and Really Giving Thanks","text":"Our friends at The Babylon Bee continued their incredible streak of satire-as-prophecy. Well, it was close, anyway. On Monday, the Christian humor site headlined, “Trump To Execute All Turkeys Pardoned By Biden’s Autopen.” On Tuesday, President Donald Trump announced that Joe Biden’s pardons of last year’s turkeys were null and void because of the autopen, but that he had “saved them in the nick of time.”\n\nThere may never be another president who’s as much of an entertainer as Trump.\n\nThe annual turkey pardon at the White House is a fun tradition that usually allows Americans to set aside political rancor in favor of some holiday cheer. Trump never sets aside political rancor, but he was also pretty doggone funny going after his opponents yesterday. After some initial welcoming comments, here’s how he began:\n\nIn a few moments, I will grant a full, absolute, and unconditional presidential pardon to two handsome Thanksgiving turkeys. And this is their lucky day. This is a lucky day for them.\n\nBut before going any further, I want to make an important announcement because you remember last year, after a thorough and very rigorous investigation by Pam Bondi and all of the people at Department of Justice, the FBI, the CIA, the White House Counsel’s Office, and the Department of Everything — We have a Department of Everything. You know what that is? I think it’s called the White House — into a terrible situation caused by a man named Sleepy Joe Biden. He used an autopen last year for the turkeys’ pardon. So I have the official duty to determine, and I have determined that last year’s turkey pardons are totally invalid, as are the pardons of about every other person that was pardoned, other than, where’s Hunter? No, Hunter’s was good. That was the one pardon, Pam, that was good, right? The rest of them are all invalid. I don’t know what the hell you’re going to do about that, but now we’re going to take a little of the joking, that is a mess. But they’re hereby null and void. The turkeys known as Peach and Blossom last year have been located, and they were on their way to be processed, in other words, to be killed. But I’ve stopped that journey, and I am officially pardoning them, and they will not be served for Thanksgiving dinner. We saved them in the nick of time.\n\nRemember, last year’s pardon for the other turkey, Hunter Biden, was one of the precious few that Joe Biden signed by his own hand, which might tell you all you need to know about how Team Biden viewed those pardons and the autopen.\n\nBringing up that whole situation might have been “political rancor,” but it was hilarious and well deserved.\n\nTrump also proceeded to pardon this year’s turkeys, Gobble and Waddle. Those weren’t necessarily the first options for names, though. “Well, I shouldn’t say this,” he joked. “I was going to call them Chuck and Nancy. Then I realized I would be pardoning them. I would never pardon those two people.”\n\nHe also teased about his own deportation policies, saying, “Instead of pardon, some of my more enthusiastic staffers were already drafting the paperwork to ship Gobble and Waddle straight to the terrorist confinement center in El Salvador. And even those birds don’t want to be there.”\n\nThe rest of the speech was typical Trump, talking about many things his administration has done or is doing, while throwing the occasional insult at his opponents. One other thing, though, particularly caught my attention: his comments about the economy and the specific prices that are lower now than when Biden was president.\n\nHere, the president is treading perilous ground. Joe Biden and Kamala Harris tried the whole Jedi mind trick last year, telling Americans that everything was “cheaper” and “better” than what they could see with their own eyes and bank accounts. Ask President Harris how that worked out for her.\n\nIt’ll fall just as flat for President Trump to keep doing the same thing. The national average for gas yesterday was $3.05. One year ago, it was … $3.06. Overall inflation remains stubbornly persistent at about 3%. That’s a far cry from the Biden high of 9.1%, but cumulative inflation since Biden “rescued” America in 2021 is nearly 25%.\n\nIt simply defies reality for Trump to say that almost anything costs less now than before. He should focus on affordability, not dismiss it.\n\nThat said, I’ll offer this as my “Thanksgiving message”: Thanks to our Founders’ wisdom about securing Liberty and the economic system of capitalism, we live in what is arguably the freest and most prosperous nation in history. If you want a turkey, you can buy one. Or, if you realize that ham is superior, do that instead. Because we’re not a communist “utopia,” you can fill your table with an appetizing feast and then take a nap during a football game. Take the opportunity to actually be kind to your TDS-suffering relatives. Crowd out the anxiety with thankfulness.\n\nWe Americans have nearly countless reasons to be thankful. Don’t miss out.\n\nFollow Nate Jackson on X.","url":"https://patriotpost.us/articles/123048-turkeys-trump-and-really-giving-thanks-2025-11-26","image":"https://img.patriotpost.us/01KB09AT7XG8V3VWEFW728Q0PS.png?w=1200&h=630","video":null,"publish_date":"2025-11-26 14:40:48","author":null,"language":"en","source_country":"us","sentiment":-0.041},{"id":382394540,"title":"Showdown for the House: Democrats, Republicans brace for high-stakes midterm clash","text":"Democrats, energized by their convincing victories earlier this month in the 2025 elections, are betting those results foreshadow a House flip in next year's midterm showdowns. The party out of power needs a net gain of just three seats to grab back the majority from the Republicans, who've controlled the House for nearly three years. And the party in power, which nowadays is clearly the Republicans, traditionally faces political headwinds in the midterm elections. At stake: the success of President Donald Trump's second-term agenda. \"We'll take back the House in 2026,\" Democratic Congressional Campaign Committee chair Rep. Suzan DelBene of Washington state told Fox News Digital. DEMOCRATS, REPUBLICANS, GO ALL IN ON FINAL CONGRESSIONAL ELECTION SHOWDOWN OF THE YEAR But for Republicans, aiming to protect their fragile majority, the magic number is also three. \"The only number I'm concerned about is three. We have three Republicans in seats Kamala Harris carried,\" said Rep. Richard Hudson of North Carolina, chair of the National Republican Congressional Committee. He pointed to districts carried during the 2024 presidential election by then-Vice President Kamala Harris. HOUSE GOP CAMPAIGN CHAIR WANTS TRUMP 'OUT THERE ON THE TRAIL' IN MIDTERM BATTLE FOR MAJORITY And Hudson, in a Fox News Digital interview, highlighted that Democrats have \"13 sitting in seats Donald Trump won. They've got 21 more sitting in seats that Donald Trump barely lost. So there, there are only a few seats up for grabs this time, most of them are Democrat seats.\" The most recent national polls indicate Democrats with the upper hand in the 2026 battle for the House majority. But DelBene cautioned, \"We take nothing for granted.\" And Hudson was optimistic that Republicans would \"grow our House majority.\" High prices and out-of-control cost of living were key issues that boosted Trump and Republicans in the 2024 elections, as they won back the White House and Senate majority and kept control of the House. But what a difference a year makes. Democrats, with an across-the-board focus on affordability, overperformed at the polls as they enjoyed sweeping ballot box success earlier this month. Democrats scored double-digit gubernatorial wins in blue-leaning but competitive New Jersey and Virginia, and convincing victories in high-profile showdowns in battlegrounds Georgia and Pennsylvania and left-tilting New York City and California. \"It was clear that when folks are talking about the biggest issues affecting their communities, and right now, affordability, with the rising costs people have seen as a result of the policies put in place by this administration and Republicans in Congress, they rejected that,\" DelBene said as she pointed to the 2025 election results. DEMOCRATS DOUBLE-DOWN ON THIS KEY ISSUE \"Absolutely, we saw that in governor's races like Virginia and New Jersey, but [also] in races across the country,\" she added. The most recent Fox News national poll was another warning sign for Trump and the GOP. Three-quarters of voters questioned in the survey viewed the economy negatively, and large numbers of respondents, including Republicans, said their costs for groceries, utilities, healthcare and housing have gone up this year. The poll indicated that voters blame the president, with nearly twice as many pointing fingers at Trump than former President Joe Biden, when asked who is responsible for the current economy. Only 38% of those questioned gave the president a thumbs-up to how he's handling the economy. And Trump's overall approval rating, at 41%, was the lowest of his second term in office in Fox News polling. \"Affordability is still the number one issue for families. Housing, food, health care, child care, energy costs all going up directly as a result of policies put in place by Republicans in Congress and Donald Trump. And they promised to lower costs on day one,\" DelBene said. SETTING THE STAGE: WHAT THE 2025 ELECTIONS SIGNAL FOR NEXT YEAR'S MIDTERM SHOWDOWNS Pointing to last year's elections, she said, \"That was their big message. They were going to lower costs. It has been a big broken promise, and people are feeling that and and that's had a big impact and will continue. People want folks who are going to stand up to them for them, not just be blindly loyal to the president.\" Hudson, asked about the political impact of the cost of living, took aim at the former president. \"There are challenges out there with the economy, because Biden broke it, and House Republicans, working with President Trump, are going to fix it, and we're working very hard to do that,\" he said. \"Certainly, we could always improve the way we communicate with our voters about it,\" he added. \"But we are laser-focused on the issues that matter to them. You know, it's the cost of things, it's the security in their neighborhood, it's a secure border. We are very focused on that, and we've delivered a lot of things that are going to make their lives better.\" DEMOCRATS SEE MANDATE AFTER 2025 WINS — REPUBLICANS SAY IT'S A MIRAGE And looking ahead to next year, he added, \"Come tax season, a lot of families are going to be really happy to see they've got a lot more take-home pay, and that's because of Donald Trump and House Republicans.\" The DCCC, in its messaging, has tied vulnerable House Republicans to Trump. DelBene argued that it's \"Republican policies that are hurting American families, the tariffs that Donald Trump has put in place that have raised costs for families across the country, their ongoing work to gut healthcare across this country.\" And she charged that the \"policies that they have prioritized have been favoring the wealthy and the well-connected, tax breaks for the wealthy and the well-connected, but hurting working families across the country. People are feeling that, and we're going to continue to call that out.\" Hudson called the 2025 elections a \"wake-up call\" for GOP voters and that he wants Trump \"out there on the trail\" in next year's midterms. Plenty of Republicans have downplayed the Democrats' high-profile victories, noting they largely took place in blue-leaning states. Hudson noted the top elections took place in \"Democrat states,\" but added, \"I think our big takeaway as Republicans is the Democrats were energized. They turned out at record levels. Republicans turned out in normal levels.\" \"I think there's a wake-up call there to conservatives and Republicans who are happy with the direction of the country. They're glad President Trump's back in the White House. But if they want to keep this momentum going, they've got to show up and vote,\" he said. Many of Trump's MAGA supporters are considered low-propensity voters, who head to the polls only when Trump is on the ballot. But Trump won't be on the ballot in the 2026 midterms. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Hudson, who noted that \"House Republicans are very closely aligned with President Trump, and we're supporting his agenda,\" said that \"we want him out there on the trail, campaigning with our candidates. I think he brings a lot of energy.\" Pointing to \"a lot of folks who don't vote when he's not on the ballot,\" Hudson said, \"I don't need all of them to show up, but I need some of them. And so having President Trump out there will be a big benefit for us.\"","summary":"Democrats eye House majority flip in 2026 midterms after strong 2025 wins. With only 3 seats needed, both parties prepare for crucial Trump agenda battle.","url":"https://www.foxnews.com/politics/showdown-house-democrats-republicans-brace-high-stakes-midterm-clash","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/delbene-hudson.jpg","video":null,"publish_date":"2025-11-26 14:00:55","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.149},{"id":382691192,"title":"Thanksgiving is uniquely American. That’s worth celebrating","text":"It acts as some sort of baptismal sacrament. Immigrants take their first timid step toward Americanization when they start honoring this sacred holiday and learn to cook its dishes. And thereby, without being fully aware, they begin to incarnate the national spirit.\n\nFIVE CLASSIC THANKSGIVING MOVIES AND SHOWS THAT CELEBRATE FAMILY\n\nIn personal terms, a disposition to be grateful renders important benefits, reducing anxiety and depression, and making us better companions and better sleepers. This is so self-evident that it hardly requires research to substantiate it, but the evidence does exist.\n\nIn geopolitics, the thankful disposition draws a bright line between the United States and wretched states officially devoted to its opposite, ungratefulness. A commitment to gratitude may have been one of the things — right up there with love of liberty — that made America the historic sworn enemy of Marxism, whose guiding ideology, envy, is the wages of ingratitude.\n\nThanksgiving is unquestionably uniquely American. I have lived at least a year in seven countries, in Asia, Europe, and the Americas, many more if one counts shorter stays, and have never encountered anything like it anywhere else.\n\nYes, in East Asia, I experienced firsthand what the Koreans call the Chuseok festival, held on the 15th day of the eighth month of the lunar calendar, so from late September to early October, depending on the year. But it’s not dedicated to giving thanks, but rather to the full moon.\n\nCanada, Liberia, and the Caribbean island nation of Grenada also have official Thanksgiving days, but they are derivatives of America’s.\n\nThanksgiving is not just uniquely tied to this country because it is reflective of the American national character. Its lineage is the thread of the national quilt.\n\nAnyone who has watched A Charlie Brown Thanksgiving, and its companion, The Mayflower Voyagers, will know the essentials of how the first Thanksgiving was celebrated by the Pilgrims and their Indian hosts in 1621 in the Plymouth Colony. Right there, Thanksgiving starts as a needed slap in the face to the “land acknowledgement” crowd.\n\n(And yes, it might be better to read a book and learn history right and not from Peanuts, but don’t underestimate the value of popular culture in propagandizing the national spirit. When Charlie Brown exclaims at the Thanksgiving table, “We thank the Lord for a bountiful harvest,” Hollywood was telling generations of young Americans that it wasn’t just ok to be patriotic and faithful, but that it was normal and expected.)\n\nThen, in one of its very first acts, the first Congress in 1789 requested that the newly elected President Washington proclaim a national day of Thanksgiving.\n\nBut it wasn’t until later, in the middle of the Civil War and in response to a persistent, decadeslong letter-writing campaign by editor and writer Sarah Josepha Hale, that Abraham Lincoln in 1863 proclaimed the last Thursday in November as our official day of Thanksgiving. Then, just as America was about to enter another war, Congress officially made it the fourth Thursday in 1941.\n\nThus, Congress and our most important leaders ratified an outlook that is the gift that keeps on giving.\n\nExperiencing gratitude is “associated with greater longevity among older adults,” says a Harvard study from last year. According to the British Psychological Society, “around 18.5 per cent of individual differences in people’s happiness could be predicted by the amount of gratitude they feel.”\n\nSaying thanks to your partner and meaning it also makes the institution of marriage stronger. A team at the University of Illinois found that “higher levels of perceived gratitude buffered against the stresses of both financial strain and ineffective arguing.” (One could ask, in marriage, is there any other type of arguing?)\n\nMeanwhile, at UC Berkeley, a 2009 study found that “Gratitude was uniquely related to total sleep quality, subjective sleep quality, sleep latency, sleep duration, and daytime dysfunction.”\n\nBEDFORD SPRINGS DELIGHTS WITH SMALL-TOWN CHRISTMAS CHARM\n\nOf course, Presidents Washington, Lincoln and Roosevelt, and the various congresses in question — to say nothing of the Pilgrim fathers, Samoset, or Squanto — did not have any of these benefits in mind; they just wanted to thank the Lord. Maybe the unintended consequences are payback.\n\nOf course, that is not going to help you deal with your aunt who voted for Kamala Harris and will show up dressed in a Handmaid’s Tale outfit. Just tell her that if President Donald Trump and Zohran Mamdani can bury the hatchet, she can get along with others, too.\n\nHappy Thanksgiving.\n\nMike Gonzalez is the Angeles T. Arredondo senior fellow on e pluribus unum at the Heritage Foundation and the author of NextGen Marxism: What It Is and How to Combat It. Heritage is listed for identification purposes only. The views expressed in this article are the author’s own and do not reflect any institutional position of Heritage or its board of trustees.","summary":"The nation will this week partake in a ritual unlike any other in the rest of the world. Americans of all persuasions, races, and creeds will gather with family around the table and give thanks, most of them to the Almighty, for the bounty they have received this year. It’s easy to take Thanksgiving for [&#8230;]","url":"https://www.washingtonexaminer.com/restoring-america/patriotism-unity/3898070/thanksgiving-is-uniquely-american-thats-worth-celebrating/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/01/yl.Thanksgiving-e1764087178370.jpg?w=696","video":null,"publish_date":"2025-11-26 14:00:00","author":"Mike Gonzalez","authors":["Mike Gonzalez"],"language":"en","source_country":"us","sentiment":0.452},{"id":382404532,"title":"Brazilian Mother of Karoline Leavitt's Nephew Is Arrested by ICE — Despite Living in the US Since 1998","text":"A Brazilian immigrant, identified as the mother of Karoline Leavitt's nephew, was arrested on 12 November 2025, by US Immigration and Customs Enforcement (ICE) in Revere, Massachusetts.The woman, Bruna Caroline Ferreira, who has lived in the United States since 1998 and was once a DACA recipient, was detained while driving to pick up her son. She now faces removal proceedings to Brazil.The arrest — occurring close to the Thanksgiving holiday — has sparked public interest because of her link to the White House press secretary and has raised questions about the scope of ongoing immigration crackdowns.READ MORE: 'It Is ENTIRELY The Fault of the Democrat Party': Press Secretary Leavitt's Scathing Remarks about the Government ShutdownREAD MORE: Dick Cheney's Death: The 'Icy' White House Response After Voting Kamala Harris RevealMother of Karoline Leavitt's Nephew Arrested by ICEFerreira was taken into custody during what family members described as a routine trip to pick up her 11-year-old son in New Hampshire.ICE agents intercepted her in Revere, placed her under arrest, and later transferred her to a detention center in southern Louisiana. She is currently in immigration court proceedings where she faces potential deportation.Who is Bruna Caroline FerreiraFerreira, a Brazilian-born immigrant, is the mother of a child she shares with Michael Leavitt — the brother of White House Press Secretary Karoline Leavitt. She and Michael were previously engaged and share joint custody of their son.According to family sources, Ferreira and Karoline Leavitt have not been in contact for many years. According to CNN, the child has lived with his father full-time in New Hampshire since birth.Ferreira Has Lived in the US Since 1998Ferreira arrived in the US in December 1998 when she was just a child on a B-2 tourist visa, which required her departure by mid-1999. She remained in the country and grew up in the US, eventually receiving protection under the Deferred Action for Childhood Arrivals (DACA) program.Loved ones say she has spent nearly her entire life in the United States, raising her son, maintaining steady employment, and contributing to her community.DHS Explains Why ICE Arrested HerAccording to the Department of Homeland Security, Ferreira is classified as an 'unlawfully present' immigrant because she overstayed her tourist visa more than two decades ago. DHS also cited a prior arrest for battery as part of the justification for her detention.Her attorney disputes those claims, insisting that Ferreira has no criminal record and was already in the process of obtaining permanent residency when she was detained.Officials also emphasized that Karoline Leavitt had no involvement in the arrest and was not notified in advance.'Karoline had no involvement whatsoever in this matter', a DHS spokesperson clarified.Family Launches Fundraiser to Fight DeportationFollowing her detention, Ferreira's sister, Graziela Dos Santos Rodrigues, created a GoFundMe campaign to raise money for legal fees and travel expenses needed to support the family during the immigration case.The fundraiser has surpassed $15,000 (£11,404.20), with Rodrigues writing that her sister has lived in the US 'nearly her entire life', has followed the law, and deserves a chance to remain with her child.The family expressed deep concern that Ferreira's son now faces the holiday season without his mother.'Any amount, no matter how small, will make a difference. If you're unable to donate, sharing this page also helps more than you know', said Rodrigues.Ferreira's family still needs donations as their goal is to reach $30,000 (£22,810.80).","url":"https://www.ibtimes.co.uk/brazilian-mother-karoline-leavitts-nephew-arrested-ice-despite-living-us-since-1998-1758257","image":"https://d.ibtimes.co.uk/en/full/1771625/brazilian-mother-karoline-leavitts-nephew-arrested-ice.png?w=1600&h=900&q=88&f=996565a16e2cf88176c939553907db67","video":null,"publish_date":"2025-11-26 13:37:17","author":"Giuliano de Leon","authors":["Giuliano de Leon"],"language":"en","source_country":"gb","sentiment":-0.204},{"id":382657834,"title":"Tim Graham: PBS Seems Neutral on Burning America to the Ground","text":"Since Oct. 1, PBS isn’t taxpayer-funded, but the radical leftist spirit of PBS remains unchanged. When it comes to transgenderism, for example, the discussion cannot have two sides. In a 2023 study of seven months of the “PBS News Hour,” the libertine left drew 90% of the airtime.\n\nIt was even worse for in-studio guests. It was 19 to one — and the one unsolicited utterance that opposed the left-wing position came from gay tennis star Billie Jean King, who dared to suggest that men shouldn’t compete in women’s sports once it came to advanced competitions like the Olympics.\n\nOn Nov. 24, the “News Hour” guest was Alejandra Caraballo, a trans woman who works at Harvard’s Cyberlaw Clinic. Caraballo exemplifies the acidulous leftist vitriol on Bluesky, the leftist alternative to Twitter. Caraballo posted this on June 18, after the Supreme Court upheld Tennessee’s ban on gender-denying mutilations for children:\n\n“I honestly don’t care anymore if this country destroys itself and burns down to the ground. The current form of the United States is incompatible with democracy or human rights. It no longer has any legitimacy to govern and I’ll dance on its grave. Let something better rise from the ashes.”\n\nThis is the guest PBS picked — the ones currently pretending to love America with Ken Burns bringing the DEI spirit to “The American Revolution.” Interviewer William Brangham waited until the last question to posit: “You have faced your own share of criticism for some of the things you have written on social media. Where do you see the boundaries in terms of how to have this debate, especially as it pertains to people who are near and dear to you?”\n\nThere were no quotes on screen of her many wild swings on Bluesky, like this new one on the Elissa Slotkin “illegal orders” video: “Hot take but the president openly calling for the murder of his political opposition should be grounds for immediate impeachment and removal for office (sic).”\n\nCaraballo claimed this is systemic: “I think about this a lot in terms of the incentives of social media and how it can incentivize a certain style of engagement. But I think, in general, one of the things I have always tried to say and repeat, the quote is, ‘be brutal to systems, kind to people.’”\n\nBut when it comes to opponents in the trans debate, from Riley Gaines to Bari Weiss, there’s no kindness from Caraballo.\n\nBefore that, Brangham’s most challenging question was this: “Back during the election, political analysts point to that notorious (notorious?!) set of ads that the president ran against Kamala Harris, she’s for they/them, he’s for you, as both being divisive and effective as an ad campaign. And, as you know, there are polls that show that somewhere around half of Americans approve of what the president is doing vis-a-vis trans people. How do you explain that? How does that sit with you?”\n\nCaraballo found that “incredibly troubling,” and underlined that Republicans running in off-year races pushed the trans/sports issues and lost, like in Virginia, where Winsome Earle-Sears spent a lot of money on “some extremely heinous anti-trans ads.” Heinous?!\n\nWhat Caraballo demonstrates is that radical trans activists don’t believe in democracy. They want an autocracy where no one can oppose their dictates. It’s not my way or the highway — it’s my way or “burn America down to the ground.” This is the kind of wacko that PBS is platforming. They also don’t believe in democracy, or they would allow someone on their show to oppose this hate-engulfed male.\n\nCOPYRIGHT 2025 CREATORS.COM","url":"https://patriotpost.us/opinion/123092-pbs-seems-neutral-on-burning-america-to-the-ground-2025-11-26","image":"https://img.patriotpost.us/01GR4QNK1K7PV7B16TYRNJ89RV.jpeg","video":null,"publish_date":"2025-11-26 12:05:29","author":null,"language":"en","source_country":"us","sentiment":-0.074},{"id":382590906,"title":"Is Queens the new political belleweather of America? | Michael Massing","text":"As the extraordinary Oval Office meeting between Donald Trump and Zohran Mamdani shows, there’s a new bellwether in American politics.\n\nFor years, Ohio played that role. In every election from 1964 to 2016, the state voted for the winning presidential candidate, and every four years journalists would travel there to interview voters in Columbus and Cincinnati, Dayton and Youngstown. But in 2020 Biden won without carrying the state, and today Ohio is deeply red, costing it its bellwether status. Several other states once considered battlegrounds – Iowa, Missouri, and Florida – have also turned firmly Republican.\n\nBut now a new bellwether has emerged: Queens. This humble New York borough contains multitudes. With a population of 2.3 million, it would be the nation’s fifth largest city if it stood alone. And in diversity it is without peer. Nearly half of Queens residents are foreign born. It is about a quarter white, a quarter Latino, nearly a quarter Asian and 17% Black, and 140 languages are spoken there. It’s home to Citi Field and the USTA Tennis Center, LaGuardia and John F Kennedy airports, MoMA PS1 and Aqueduct Racetrack, Archie Bunker of All in the Family and Awkwafina of Nora from Queens.\n\nFlushing is home to so many Asians that its downtown is known as the Chinese Times Square. Astoria has one of the largest Greek populations outside of Greece; Jackson Heights is known as “Little Colombia”; Woodside has a “Little Manila”. Jamaica is home to large African American, Caribbean and Central American populations, while Long Island City has become a magnet for the hip and arty. Queens also has New York’s largest Muslim population as well as 150,000 Jews. Overall, it is thoroughly middle and working class – a swath of heartland America set down in pulsating, cosmopolitan New York.\n\nLike all other New York boroughs except Staten Island, Queens reliably votes Democratic, but in November 2024 it moved decisively toward Trump. Where Joe Biden in 2020 won Queens by 72% to 27% – a 45-point margin – Kamala Harris in 2024 won it by only 24 points. Trump’s gains were especially large in heavily Latino, Chinese and south Asian neighborhoods.\n\nMany of those voting for him were propelled by the rise in disorder that had occurred in the wake of the pandemic and then exacerbated by the sudden influx of migrants. The placement of the migrants in makeshift shelters in residential neighborhoods without adequate support services led to a wave of complaints about crime and loitering as well as resentment over the diversion of resources from longtime residents. As in many other districts, the rise in rents and the cost of groceries contributed to a sense among many that the path to the middle class was becoming increasingly narrow. A political realignment seemed under way.\n\nYet even as Trump was making such inroads, the democratic socialist Alexandria Ocasio-Cortez was winning 69% of the vote in her congressional district, which straddles northern Queens and the South Bronx. And, as dissatisfaction with the status quo surged and concerns over affordability mounted, support grew for another young insurgent – Zohran Mamdani.\n\nA state assemblyman whose district includes parts of Astoria and Long Island City, Mamdani in the 24 June Democratic primary won support from a mixed salad of leftish young professionals, working-class Latinos, and recently arrived south Asians – all drawn to his bread-and-butter platform of universal childcare, free buses and a rent freeze. Groups like Drum Beats (Desis Rising Up & Moving) canvassed tens of thousands of residents, including a Bangladeshi population that has tripled over the last decade.\n\nIn the general election, Mamdani got 47.3% of the votes in Queens. “Some of the areas that have been trending towards Trump went for Mamdani,” observed John Mollenkopf, a professor of political science at the Cuny Graduate Center.\n\nTrump concurred. “A lot of my voters voted for him,” the president said during his 21 November meeting with Mamdani. The session seemed to seal Queens’s political arrival. For Trump, too, is a product of the borough. He grew up in Jamaica Estates, a leafy upper-middle-class section located about 10 miles from Mamdani’s Astoria home. Both are anti-establishment figures with a knack for understanding and addressing the needs of those with “fingers bruised from lifting boxes on the warehouse floor, palms calloused from delivery by handlebars, [and] knuckles scarred with kitchen burns”, as Mamdani put it in his victory speech.\n\nWith Ocasio-Cortez contemplating a run for higher office, Queens is proving an important seedbed for national politics, and New York-based journalists – rather than have to book flights to the midwest – can now hop on the 7 train to Jackson Heights or Flushing.\n\nYet national news organizations have treated the borough like flyover country. The New York Times in particular has been a step behind. Back in the 90s, the paper had a sizable metro section that thoroughly covered the outer boroughs and the tristate region. But as the Times mushroomed into a global paper – it now has more readers in California than in New York – it has shortchanged the city’s blue-collar precincts. Today, driverless cars in San Francisco get as much coverage in the paper as taxi drivers in Corona.\n\nAs a result, the Times, during the mayoral race, failed to grasp the groundswell developing behind Mamdani. And, when his strength did become evident, it was strangely dismissive and even hostile toward him, sniffing in an editorial that because of his lack of experience and concern about the disorder in the city, “we do not believe that Mr. Mamdani deserves a spot on New Yorkers’ ballots.”\n\nIt followed with an “exposé” about how as a high school senior Mamdani (who was born in Uganda) had checked multiple boxes on his college application to Columbia about his race, purportedly to gain an advantage. Mamdani explained that he considered himself “an American who was born in Africa” and that his answers were an attempt to represent his complex background given the limited choices before him. The piece fed the perception that the Times was “on a crusade against Mamdani”, as Margaret Sullivan put it in the Guardian.\n\nAfter his victory, the paper, noting his ascension and Ocasio-Cortez’s continuing strength, ran a piece about how Queens “is having its moment”. With the borough claiming three of the top four spots in a survey of city-neighborhoods-to-watch in 2025; with Astoria emerging as a favorite among young professionals; and with the Rockaways becoming a summer staple, the Times observed, “Could Queens become the new Brooklyn?”\n\nIt already is the new Ohio.\n\n Michael Massing is an American writer based in New York City. He is a former executive editor of the Columbia Journalism Review","summary":"National news organizations have treated the borough like flyover country. It’s time to change that\n\nAs the extraordinary Oval Office meeting between Donald Trump and Zohran Mamdani shows, there’s a new bellwether in American politics.\n\nFor years, Ohio played that role. In every election from 1964 to 2016, the state voted for the winning presidential candidate, and every four years journalists would travel there to interview voters in Columbus and Cincinnati, Dayton and Youngstown. But in 2020 Biden won without carrying the state, and today Ohio is deeply red, costing it its bellwether status. Several other states once considered battlegrounds – Iowa, Missouri, and Florida – have also turned firmly Republican.\n\nMichael Massing is an American writer based in New York City. He is a former executive editor of the Columbia Journalism Review\n\n Continue reading...","url":"https://www.theguardian.com/commentisfree/2025/nov/26/queens-political-bellwether-america","image":"https://i.guim.co.uk/img/media/60b898e11f5704efa0786f62ebb04e1b9b6f6228/293_0_2915_2333/master/2915.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-11-26 11:00:49","author":"Michael Massing","authors":["Michael Massing"],"language":"en","category":"politics","source_country":"us","sentiment":0.394},{"id":382392038,"title":"‘A revolving door’: Last-minute scramble to fill Gavin Newsom’s shoes in California","text":"The ballooning field of Democratic candidates to succeed the term-limited Gavin Newsom as governor of California has political operatives stunned.\n\n\"This is as wide open as I've ever seen anything in 25 years,\" said Steven Maviglio, a Sacramento-based Democratic strategist.\n\nThe challenge for those running will be proving to voters they can tackle California's cost-of-living crisis, as well as fill the high-profile void Newsom will leave behind as a national leader in Democrats' fight against President Donald Trump.\n\nLast week, Rep. Eric Swalwell, who made a name for himself as an anti-Trump firebrand in the House of Representatives and launched a short-lived bid for the White House in 2020, announced his campaign for governor on ABC’s \"Jimmy Kimmel Live!,\" telling Kimmel that California \"needs a fighter and a protector.\"\n\nBillionaire Tom Steyer, who also ran an unsuccessful campaign for president in 2020, announced his campaign the day before. Steyer, who is well-known in progressive circles for his environmental advocacy, spent millions backing Newsom's recent Proposition 50 redistricting push.\n\n\"Everyone in this race is going to talk about affordability, but what Californians care about is results, and who's going to be able to deliver when it comes to lowering costs. And Tom has a record of getting things done for California, even when the real politicians couldn't,\" a spokesperson for Steyer said.\n\nBoth Swalwell and Steyer join a crowded field of prominent Democrats, such as former Los Angeles Mayor Antonio Villaraigosa.\n\n\"I am a proven problem solver,\" Villaraigosa told ABC News in a statement.\n\n\"As the Speaker of the California Assembly, I extended affordable health care to millions of children and I passed the toughest assault weapons ban in America. As Mayor, I reduced crime by 50% and increased our school graduation rate by 60%. No other candidate for governor has delivered results like those,\" Villaraigosa added.\n\nVillaraigosa is jockeying for position among other California politicians, including former Rep. Katie Porter and former California Attorney General Xavier Becerra, who was also secretary of Health and Human Services in the Biden administration.\n\n\"Secretary Becerra is the only candidate in this race to take on the Trump Administration and win, suing 122 times to protect Californians as Attorney General. He delivered affordable care for millions and he negotiated lower drug prices to save California families thousands of dollars,\" a Becerra campaign spokesperson told ABC News in a statement.\n\nStrategists are surprised that no candidate has clearly established themselves as a front-runner, signaling some instability in the race to lead a state of nearly 40 million people. \n\n\"It's one of the most consequential races in the entire country that nobody's ever heard of yet,\" Democratic strategist Danielle Cendejas said. \"There is a lot on the line who the next governor is.\"\n\n\"A historically weak field\"\n\nDemocratic strategist Matt Rodriguez believes the reason the primary is so crowded is because no one candidate is very strong.\n\n\"I think it's a very weak field, a historically weak field,\" he said.\n\nCalifornia employs a \"jungle\" or \"top-two\" primary, in which there is one nonpartisan primary for all candidates, with the top two candidates in the primary moving on to a runoff in November, regardless of party.\n\nRodriguez said having so many Democratic candidates in a jungle primary \"definitely gives an advantage to a Republican getting into the top two. At some point, there's just only so many Democratic voters to split up here.\"\n\nMaviglio said two Republicans ending up in the general election is \"possible, not probable.\"\n\n\"We've only seen it in legislative races a couple of times, where the party that actually has the majority doesn't make it into the November election because of strangeness like that happening,\" he said.\n\nSlim chance for a Republican candidate\n\nGOP strategist and former executive director of the California Republican Party Jon Fleischman said that even if a Republican makes it to the general election, they would have a slim chance at winning the whole thing.\n\n\"Maybe the most important thing to remember in California is that if you have a general election between a Republican and a Democrat, unless some massive scandal of epic proportion were to strike the Democrat, we're a blue state,\" Felischman said.\n\n\"The only time it gets maybe more interesting is if two Democrats make the runoff,\" Felischman added.\n\nThere are currently two major Republican candidates in the race, one of whom is former Fox News host Steve Hilton.\n\n\"A crowded Democratic field means those candidates will spend months fighting each other and defending the status quo, while Steve Hilton is focused on changing it,\" Hilton campaign manager Matt Ciepielowski told ABC News in a statement.\n\n\"Californians are tired of the highest poverty in the nation, sky-high housing costs, failing schools, and a government that serves special interests instead of working families. Steve is running to make California affordable, safe, and full of opportunity again,\" the statement continued.\n\nThe other major Republican running is Riverside County Sheriff Chad Bianco, who is emphasizing his law enforcement background to define himself as someone who will be tough on crime.\n\n\"Each Democrat running is hoping to be a more liberal version of the narcissist that is currently the Governor and Californians simply cannot afford to have that happen. Sheriff Bianco offers a new way forward and the public polling proves that his campaign is resonating with voters,\" Rick Gorka, a spokesperson for the Bianco campaign, told ABC News in a statement.\n\nA still-unsettled race\n\nOthers might still jump in on the right, like tech entrepreneur Jon Slavet, who filed FEC paperwork Friday and told ABC News he plans to launch his campaign early next month.\n\nMaviglio characterized the race as \"unsettled\" and \"a revolving door.\"\n\nVice President Kamala Harris was mulling a bid following her defeat in last year’s presidential election, but she announced in July she was no longer considering running. And U.S. Sen. Alex Padilla -- who strategists say might have cleared the field had he launched a bid -- decided against a run earlier this month.\n\n\"We've had people say they're running and exit out of the race. We've had people that were lured into thinking about running, like Padilla and Harris, and then opting not to. So it's really hard to track,\" Maviglio said.\n\nTwo politicians -- California Lt. Gov. Eleni Kounalakis and former president pro tempore of the California state Senate Toni Atkins -- initially announced their candidacies, only to exit the race shortly thereafter. \n\nAnother rumored potential Democratic contender is billionaire Rick Caruso, who lost the 2022 Los Angeles mayoral race to Karen Bass. While Caruso has deep pockets and some name recognition, he was a Republican until 2019, which could alienate the progressive wing of his new party.\n\nAnd while both Steyer and Caruso have the cash, strategists say they would have to use it wisely to mount successful campaigns.\n\n\"Self-funders do not do well here. It doesn't mean they can't, but they typically don't,\" Rodriguez said, pointing to the failed bids of Michael Huffington in the 1994 Senate race, Al Checchi in the 1998 gubernatorial election and Caruso in 2022.\n\nTrouble for early front-runner\n\nPorter, the initial front-runner and only major female candidate in the field, seemed to have momentum after gaining backing from the progressive PAC EMILY’s List and several statewide labor unions. Cendejas acknowledged that Porter likely had an early advantage due to her name recognition and the fact that she is \"beloved in a lot of progressive circles.\"\n\n\"Katie is a fighter, a single mom of three, and a ruthless champion for working families who took on the Trump Administration and self-serving CEOs in Congress -- and won,\" Peter Opitz, a spokesperson for the Porter campaign, told ABC News in a statement. \n\nBut recent controversy surrounding Porter's conduct has tightened her initial lead, indicating she may not be as strong of a candidate as was originally thought.\n\nIn a video that went viral online last month, Porter had a contentious interaction with a journalist, going so far as threatening to end the interview. Another video surfaced shortly thereafter showing Porter yelling at a staffer.\n\n\"What goes up must come down,\" Cendejas said of Porter.\n\nIn her first appearance after the videos emerged, Porter apologized for the outbursts.\n\n\"I want people to know that I understand that what I did was not good,\" Porter told an audience at the UC Student and Policy Center in Sacramento in October. \"I'm not going to mince words about it, but I also want people to understand that I am in this fight because I am not going to back down and give one inch when people are hurting Californians. And both of those things can be true at the same time.\"\n\nRodriguez expects that the ability for a candidate to successfully define themselves as someone who can lead California in going toe-to-toe with Trump will be \"the whole thing.\"\n\n\"I think Trump is going to be gigantic here,\" Rodriguez added. \"Everything is going to be Trump.\"","summary":"Ballooning field of Democratic candidates in California to succeed term-limited Gov. Gavin Newsom has Democratic operatives stunned.","url":"https://abcnews.go.com/Politics/revolving-door-minute-scramble-fill-gavin-newsoms-shoes/story?id=127805112","image":"https://i.abcnewsfe.com/a/67ff882a-147d-424f-9275-ac3d50e6f89c/katie-porter-20251123-ap-jh_1763928810310_hpMain_16x9t.jpg?w=1600","video":null,"publish_date":"2025-11-26 10:19:00","author":"Brittany Shepherd,Halle Troadec","authors":["Brittany Shepherd","Halle Troadec"],"language":"en","source_country":"us","sentiment":0.135},{"id":382357426,"title":"Republican Lawmakers Criticize White House Treatment, Warn of Potential Party Revolt","text":"Marjorie Taylor Greene’s recent departure might not be an isolated event within the Republican ranks.\n\nConversations with unnamed lawmakers suggest emerging divisions in the Republican conference, as some members of Congress are reportedly considering an early exit before the midterm elections.\n\nSeveral Republican House representatives are allegedly contemplating retiring mid-term, following the path of the outspoken Georgian politician.\n\nGreene surprised many on Friday night by declaring her intention to retire in January, after a contentious and lengthy dispute with President Trump. Her decision seems to have caught the attention of others, who might be considering a similar move.\n\nThe catalyst for this potential exodus appears to be a growing sense of frustration and anger toward a White House that has sidelined their input, coupled with a challenging midterm outlook for the Republicans.\n\nFormer House Speaker Kevin McCarthy, speaking on Fox News, described Greene as “the canary in the coal mine,” warning, “Congress needs to wake up because they might see a wave of retirements.”\n\nOne reportedly highly placed lawmaker told news site Punchbowl that the White House team has treated members ‘like garbage,’ also noting that ‘morale has never been lower.’\n\nHowever, a House GOP aide told Daily Mail that he did not ‘view Punchbowl’s reports’ of ‘garbage’ treatment ‘as accurate, and in the case it is accurate, the more people who share the same mindset [with Greene] and leave, the better it is for the party.’\n\nWhite House spokeswoman Abigail Jackson told the Daily Mail after this article’s initial publication that ‘the president’s legislative agenda is a historic success.’\n\n‘From the largest and most consequential Republican domestic legislation ever, which fulfilled dozens of campaign promises and was signed on July 4, record speed and quantity of nominations, landmark cryptocurrency legislation, and fulfilling the multi-decade goal of defunding NPR and PBS, the President has gotten massive amounts of his agenda through Congress in the face of total Democratic obstruction,’ Jackson added.\n\nChristian Conservative broadcaster Erick Erickson noted on X that he has noticed a stream of dissatisfaction with the White House legislative team, writing that members will either assert their need to be a part of decisions, or they will quit early.’\n\nTop Trump ally Steve Bannon ‘likened Congress to the Duma,’ commenting on their ‘ceremonial’ nature per the Wall Street Journal. The characterization was not intended as a compliment.\n\nAs the political pendulum typically swings away from the party of the President in the midterm election, Republicans are poised to lose political power and most likely the speaker’s gavel in the House of Representatives come 2027. \n\nHowever, if Republicans resign and Democrats win special elections, Speaker Mike Johnson’s gavel may be in jeopardy sooner rather than later.\n\nEven if members do not resign, many may choose not to seek reelection during the expected midterm bloodbath.\n\nA prime example of this is Representative Don Bacon, a Nebraska Republican who would have had to fight an uphill battle in a district that was won by Kamala Harris during last year’s presidential election. Bacon has announced that he will not seek re-election.\n\nBacon told Axios he was so appalled by the Trump administration’s peace plan in Ukraine that he considered resigning in protest. \n\nOthers still have voiced their dissatisfaction with Washington in other ways, namely by seeking office in their home states.\n\nTexas Congressman Chip Roy announced in August that he plans to depart Capitol Hill after four terms and seek the role of state attorney general in the Lone Star state.\n\nHis decision came after he earned the wrath of Trump for getting in the way of his MAGA agenda.\n\nDuring his time in Congress, Roy has not been afraid to buck members of his own political party, causing headaches for Johnson and even the President.\n\nA large number of prominent Republican members of Congress in both chambers are also running for governor of their respective home states, at times against their Congressional colleagues.\n\nThe Republican primary for South Carolina governor includes both Representative Ralph Norman and Congresswoman Nancy Mace.\n\nFormer House Republican chairman Elise Stefanik is running for governor of New York, and Congressman Byron Donalds is running for governor in his home state of Florida.\n\nSenators have also announced their decisions to leave Washington for home-state bids. Marsha Blackburn is running for governor of Tennessee, and former Auburn University football coach Tommy Tuberville is running for governor of Alabama.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMarjorie Taylor Greene&#8217;s recent departure might not be an isolated event within&#8230;\n\n\nThis Post: Republican Lawmakers Criticize White House Treatment, Warn of Potential Party Revolt first appeared on Internewscast Journal","url":"https://internewscast.com/politics/republican-lawmakers-criticize-white-house-treatment-warn-of-potential-party-revolt/","image":"https://internewscast.com/wp-content/uploads/2025/11/Warnings-of-massive-GOP-mutiny-as-Republican-lawmakers-lash-out.jpg","video":null,"publish_date":"2025-11-26 09:53:05","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.057},{"id":382554000,"title":"The Root Unveils The Root 100 List","text":"The Root just revealed their 2025 honorees of The Root 100, an annual list celebrating the most influential Black icons in America who have made a significant impact in their fields and communities, across arts & entertainment, business, activism, media, science, technology, social justice, politics, culture, philanthropy, sports, and beyond. \n\nThe Root 100: 2025 list includes Vice President Kamala Harris, Denzel Washington, Pastor Jamal Bryant, Doechii, Teyana Taylor, Supreme Court Justice Ketanji Brown Jackson, Kai Cenat, Gayle King, New York Attorney General Letitia James, Samara Joy, Audra McDonald, Whoopi Goldberg, Taraji P. Henson, Tracee Ellis Ross, Pastor Sarah Jakes Roberts, Ryan Coogler, Beyoncé, Kendrick Lamar, A’ja Wilson, Robin Roberts, Misty Copeland, Whoopi Goldberg, Robert F. Smith, Joy Ann Reid, Michael B. Jordan, Tina Knowles, The Breakfast Club, and many others who have made an indelible mark on Black American culture and beyond.\n\nClick here for a full list of The Root 100: 2025’s Most Influential African Americans.\n\nSince its inception in 2011, The Root 100 has become a hallmark of Black achievement, recognizing celebrities, public figures, community leaders, and the behind-the-scenes change-makers whose influence impacts the culture. “Unlike in previous years, The Root 100 will present the best in Black achievement without rankings, celebrating each honoree equally for their contributions and impact,” shares Ashley Allison, publisher of The Root. “This shift reflects a renewed commitment to collective recognition, honoring the shared brilliance, innovation, and cultural influence that continues to define the Black experience. Each honoree on the 2025 list represents achievement in their own right, reinforcing that The Root 100 List is not a competition, but a celebration of collective power.”\n\nIn 2025, The Root came under new leadership, marking a fresh chapter for the iconic platform. Ashley Allison’s acquisition of The Root brings renewed focus on Black ownership and authentic storytelling, with a continued commitment to showcasing the voices and achievements of Black Americans who are reshaping industries, communities, and global culture. Under Allison’s leadership, the 2025 Root 100 continues the legacy of The Root 100 list while embracing the future with new perspectives, fresh content, and innovative partnerships.\n\nHonorees from The Root 100: 2025’s Most Influential African-Americans list will be celebrated at an exclusive invite-only event in New York City this December, presented in partnership with Martell. The evening will honor the power, influence, and cultural impact of this year’s trailblazers and toast those redefining excellence across every field. #TheRoot100","summary":"The Root just revealed their 2025 honorees of The Root 100, an annual list celebrating the most influential Black icons in America who have made a significant impact in their fields and communities, across arts &#38; entertainment, business, activism, media, science, technology, social justice, politics, culture, philanthropy, sports, and beyond.  The Root 100: 2025 list includes&#160;Vice President [&#8230;]","url":"https://www.bajanreporter.com/2025/11/the-root-unveils-the-root-100-list/","image":"https://www.bajanreporter.com/wp-content/uploads/2025/11/The-Root-Unveils-The-Root-100-List-1.jpg","video":null,"publish_date":"2025-11-26 09:48:00","author":"Bajan Reporter,Celia Aniskovich","authors":["Bajan Reporter","Celia Aniskovich"],"language":"en","category":"politics","source_country":"bb","sentiment":0.769},{"id":382581060,"title":"Stephen Miller's Thanksgiving Thanks Has Critics Scratching Their Heads","text":"Stephen Miller, the Trump White House deputy chief of staff for policy, drew ire on Tuesday for plucking a number seemingly out of thin air.\n\nMiller, the architect of President Donald Trump’s hardline immigration crackdown, was asked by Fox News’ Jesse Watters what he’s thankful for this Thanksgiving.\n\n“You asked me what I’m thankful for this Thanksgiving,” Miller said, raising his voice. “I praise God every day that Donald Trump is our president and we’ve gone from 30% inflation, 20 million illegals, unlimited refugees, violent crime in our cities to security in our cities, no more illegals, no more refugees and finally a country that puts American citizens first.”\n\nWatch here:\n\nCritics quickly questioned Miller’s rhetoric, especially the 30% inflation claim.\n\nInflation under Trump’s predecessor, former President Joe Biden, did soar and is widely credited with being one of the key factors in Trump winning back the White House in the 2024 election against then-Vice President Kamala Harris.\n\nBut year-on-year inflation peaked at just under 10% in mid-2022 and cumulative inflation across Biden’s entire presidency was 21%, with neither close to Miller’s figure. Inflation did then dip before Trump’s return to the Oval Office, and the affordability crisis is also currently one of the biggest issues facing the current president.\n\nWatters later asked Miller, who is married to MAGA podcaster Katie Miller and has three children, how he approaches the holiday in his own household.\n\n“I would be incapable of helping,” he admitted. “If I attempted to help, it would be interpreted widely as an act of sabotage.”\n\nMiller said it’s a great excuse for not doing anything.\n\n“It’s kind of like, they say when men fold a sweater wrong, you never have to fold a sweater again,” he told Watters. “The safest play is to just watch TV and stay out of the way as best you can. My service is saying how delicious the gravy is, how great the turkey is, how wonderful the cranberry sauce is. That’s how I give back, with compliments.”\n\nCritics were less than complimentary about his comments, though","url":"https://www.huffpost.com/entry/stephen-miller-thanksgiving_n_6926b8f9e4b043c0cb075487?origin=home-zone-c-unit","image":"https://img.huffingtonpost.com/asset/6926bde6220000ba3460bcd1.jpeg?cache=8nCeq765Bo&ops=1778_1000","video":null,"publish_date":"2025-11-26 09:36:32","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"us","sentiment":0.178}]}