{"offset":0,"number":50,"available":4632,"news":[{"id":259261920,"title":"Can the Democrats Win Alaska in the Upcoming Election? Unlikely.","text":"As I’ve so often pointed out, Alaska is an odd place, politically.\n\nThe Last Frontier is a red state for the most part, although it’s not a red state in the same sense that Texas or Alabama are red states. Alaska has a strong libertarian bent; Alaskans are, by and large, some of the most “mind your own business and leave me alone” people you’re liable to find anywhere. \n\nBut the legislature, while technically dominated by Republicans, is still on the squishy side. And, thanks to ranked-choice voting, we have a Democrat representing us in Congress – and, of course, there’s the issue of Princess Lisa Murkowski. \n\nPresidential politics here in the Great Land, though, are more decided. The last time Alaska sent its electoral votes to a Democrat was in 1964 when in the second election after statehood, the people voted for Lyndon Johnson over Barry Goldwater.\n\nNow, though, Bloomberg is asking the unthinkable: Could Kamala Harris win Alaska? \n\nHere’s what they get badly wrong:\n\nThere are sparks of enthusiasm for Harris and her running mate, Tim Walz, whose Carhartt-and-camo appeal resonates in a state of 734,000 people scattered across a land area more than twice the size of Texas. Jessica Cook, the vice chair of the state Democratic party, said President Joe Biden’s decision to step down and endorse Harris sent a jolt of energy through the state. Some of her fellow teachers wear pearls and Chucks sneakers to school in a subtle tribute to Harris’ signature style. Cook says she hears people quoting Walz, suggesting that even the vice presidential candidate has made an impression.\n\nWait, what? Tim “Great Walz of China” has “Carhartt-and-camo appeal?” \n\nAny such appeal from Tim Walz is as phony as a three-dollar bill, and that’s just pathetically obvious. And Kamala Harris, with her phony claims of owning a Glock, and her past pronouncements on gun bans? If there is one thing that is the kiss of death in Alaska politics, it’s being anti-Second Amendment. \n\nAs I’m fond of pointing out, here in the Valley even the hippies have guns, know how to use them, and aren’t about to give them up.\n\nPresidential polling in Alaska is scarce, partly because the population is sparse, but mostly because it’s taken for granted that Alaska’s going red. Here’s where the sparse polling in Alaska stands as of this writing:\n\nAlaska Survey Research, Sept 27-29: Trump +9Alaska Survey Research, Sept 11-12: Trump +5Cygnal, Aug 30-Sept 1: Trump +10\n\nThere are polls before that time, but those reflect Trump vs. Biden, not Trump vs. Harris. \n\nAnd yes, these are pretty solid numbers for the Trump/Vance ticket. Bear in mind that our Democrat Congressman, Mary Peltola, is in the fight of her political life against Republican Nick Begich III, with that race tied – for the moment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAs I&#8217;ve so often pointed out, Alaska is an odd place, politically.&#8230;\n\n\nThis Post: Can the Democrats Win Alaska in the Upcoming Election? Unlikely. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/can-the-democrats-win-alaska-in-the-upcoming-election-unlikely/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Bloomberg-Can-Democrats-Flip-Alaska-Blue-Fat.jpg","video":null,"publish_date":"2024-10-11 00:37:00","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.031},{"id":259261516,"title":"Harris reiterates support for \"Dreamers,\" as she courts Latino voters","text":"Las Vegas — Vice President Kamala Harris fielded questions about immigration, the economy and healthcare at a town hall with Univision Thursday. Polls suggest these issues are critical to the Latino voting bloc, and many of these questions were posed by people who had very personal, emotional stories to tell.Supports \"Dreamers,\" pins blame on Trump for bipartisan border billJesus Aispuro, a first-time voter from California, told Harris he has friends who are \"Dreamers,\" undocumented immigrants brought into the country as children. Pressing her on what she'd do to protect Dreamers under the Deferred Action for Childhood Arrivals program, Harris said she'd prioritize an immigration plan that establishes a pathway to citizenship. In response to a case in front of a federal appeals court over the fate of DACA, Harris' campaign issued a statement during the town hall saying Harris \"will always stand with Dreamers and keep families together\" and urging Congress to pass \"an earned pathway to citizenship for these young people.\"Yvette Castillo began her question by noting she and Harris have something in common: both of their mothers are dead. Castillo noted her mother died six weeks ago, and while she was alive, she did not succeed in acquiring U.S. citizenship. Harris' mother died in 2009. \"What are your plans to support that subgroup of immigrants who have been here their whole lives and have to live and die in the shadows?\" Castillo asked.Harris repeatedly said she was sorry for Castillo's loss, and then she said the bipartisan border bill that former President Donald Trump lobbied Republican lawmakers to vote against could have created \"a comprehensive earned pathway to citizenship for hard working people.\"She went on to argue that this failure to enact legislation bore responsibility for the outcome Castillo's mother had. \"Had your mother been able to gain citizenship, she would have been entitled to health care that may have alleviated her suffering and yours. And this is one example of the fact that there are real people who are suffering because of an inability to put solutions in front of politics,\" Harris added. The Latino vote is crucial for Harris' path to the White House, and polling shows it's a more competitive fight than in 2020. Harris holds an 18-point advantage over former president Donald Trump, according to a September CBS News poll. It's a smaller gap compared to President Joe Biden's 33-point advantage with Latino voters in a 2020 CBS News exit poll. \"The largest segment of undecided voters right now are still within the Latino community. So doing town halls like this, it's going to places like Arizona… having folks like the rest of us all across those state, are going to be very important,\" Rep. Robert Garcia of California said after the debate. \"Latinos are going to have an outsized influence in this election because the margins are so tight,\" he added. Criticizes Trump over reports he sent COVID tests to Putin, can't list three virtues about himMario Sigbaum, a 70-year-old independent and undecided voter, questioned how Harris was able to become the Democratic nominee and said the late switch resulting from President Biden's late exit from the race \"inclined me to vote for Trump.\"After Harris praised Mr. Biden for supporting her run, she highlighted her own support from Republicans and argued Trump admires \"dictators and autocracy.\" She criticized Trump over reports he sent Russian President Vladimir Putin a COVID test machine during the COVID-19 pandemic.\"I'm sure people here have family members or friends who died [from COVID], and he secretly shipped off COVID tests to Vladimir Putin of Russia. When people died — hundreds were dying every day,\" Harris said, adding that she and Mr. Biden tried to address the disproportionate rate of Latino and Black Americans dying from COVID infections.\"So, I present that to you, sir, to say, this is an extraordinary time,\" she said. Asked by a voter at the end if she could name three virtues of Trump, Harris noted his love for his family, but declined to add more.\"Family is one of the most important things that we can prioritize. But I don't really know him to be honest with you. I've only met him one time on the debate stage. So, I don't really have much more to offer you,\" she said. Hurricane Milton responseThe town hall began with Ramiro Gonzalez, a voter from Tampa, Florida, who noted more than one hurricane had struck his home. \"Rumors are that your administration didn't do enough to respond to the last hurricane. What would you specifically do, or your administration do, to help us in the Tampa Bay area or the Central Florida area with this hurricane?\" he asked Harris. Harris responded by decrying disinformation spread about the federal response to recent hurricanes. \"I have to stress that this is not a time for people to play politics,\" she said. She then listed her continual briefings and contact with state and local officials on the ground, and warned against companies that are raising prices in impacted areas. Economy and health care: \"Prices are too high, still… and we have to deal with it.\"Asked by Wendy Solares — a mother who houses her children, as well as her parents — what Harris would do to help the middle class, Harris took a more sympathetic tone to the rise in the cost of living. \"I know prices are too high, still. You know prices are too high, still. And we have to deal with it,\" she said, before listing out her economic plan to lower costs through being more aggressive on price gouging by grocery companies and by issuing tax credits for parents and down payment assistance for first time home buyers. Martha Rodriguez, a 62-year-old homeless woman whose medical conditions — a heart attack and \"long COVID\" — caused her to lose her job and income, asked Harris how she'd help disabled citizens get their insurance faster through Social Security. Harris noted that she pushed to designate long COVID as a condition that should be covered by the Americans with Disabilities Act, and that as president, she would work to make sure medical debt does not affect credit scores. \"The point is being very simple, frankly, which is that all people, regardless of disability, should have equal access to housing, to job opportunities, to education, and again, community, and there's still a lot of work that we have to do in that regard,\" Harris responded.","summary":"Harris fielded questions at a Univision town hall about immigration, the economy and healthcare — all issues that polls suggest are critical to the Latino voting bloc.","url":"https://www.cbsnews.com/news/harris-dreamers-latino-voters-during-univision/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/11/030a755f-5760-4e5a-932f-dd1470ddda44/thumbnail/1200x630/67eff11eaff03409308da07669d40880/gettyimages-2177852575.jpg?v=29b5ccc4d237d9b284ce95a42effd073","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3257194_hls/master.m3u8","publish_date":"2024-10-11 00:34:18","author":"Aaron Navarro","authors":["Aaron Navarro"],"language":"en","category":"politics","source_country":"US","sentiment":-0.083},{"id":259261744,"title":"‘Don’t boo, vote!’ Obama calls for action as he skewers ‘crazy’ Trump in first appearance on 2024 campaign trail","text":"People who go to a rally for Vice President Kamala Harris might be inclined to boo when they hear Donald Trump’s name, but Barack Obama doesn’t want to hear it.\n\nThe former president, who made his first appearance on the campaign trail in support of Harris, her running-mate Tim Walz, and Pennsylvania Senator Bob Casey at a Pittsburgh rally on Thursday, wasted no time in taking apart the man who he famously roasted so badly at the 2011 White House Correspondents’ Dinner that many believe it inspired Trump’s 2016 campaign for the presidency.\n\nObama told the crowd that he understands why Americans might be “looking to shake things up” in this country, because many “are still struggling” and “striving to make life better for themselves, for their families, and for their kids.”\n\n“Let’s face it, as a country, we’ve been through a lot these last few years, we had a historic pandemic wreaking havoc on communities and businesses. Disruptions from the pandemic then caused prices to spike, and that put a strain on family budgets, and in many ways, it’s felt like the aspirations of working people have taken a backseat to the priorities of the rich and the powerful,” he said.\n\n“So I can understand people feeling frustrated, feeling we can do better. What I cannot understand, is why anybody would think that Donald Trump will shake things up in a way that is good for you!”\n\n“I don’t understand that, because there is absolutely no evidence that this man thinks about anybody but himself,” he continued, calling Trump “a 78 year old billionaire who has not stopped whining about his problems since he rode down his golden escalator nine years ago.”\n\nObama took a filet knife to his successor, whose “ranting and raving about crazy conspiracy theories” and “two-hour speeches” and “word salads” he compared to Fidel Castro, the Cuban communist dictator known for his marathon harangues against America.\n\nHe also invoked the non-stop stream of products hawked by Trump and his family members, including the Trump-branded bibles, gold sneakers and watches that have made appearances on Trump’s social media feeds during his presidential campaign.\n\n“Who does that? He wants you to buy the Word of God Donald Trump edition. Got his name right there, next to Matthew and Luke!”\n\n“It’s crazy,and the reason he does it is because all he cares about is his ego and his money and his status. He’s not thinking about you,” Obama continued, adding that Trump “sees power as nothing more than a means to an end” and would hurt America’s middle class with tax cuts for his “country club buddies” while taking away women’s reproductive rights.\n\nAs the crowd expressed their displeasure by booing loudly, Obama stopped them.\n\n“Don’t boo — vote!” he said.\n\n“They can’t hear your boos, but they can hear your votes.”\n\nObama said Trump’s callousness extends to wanting Americans to remain “hopelessly divided” and “angry” because he thinks doing so will help him retake power, citing his failure to act while a riotous mob of his supporters sacked the Capitol and tried to lynch his then-running-mate, Vice President Mike Pence.\n\n“If Donald Trump does not care that a mob might attack his own Vice President, do you think he cares about you? Pennsylvania, we do not need four more years of that,” he said.\n\n“We don’t need four more years of arrogance and bumbling and bluster and division. America is ready to turn the page. We are ready for a better story, one that helps us work together. Instead of turning against each other. Pennsylvania, we’re ready for President Kamala Harris!”\n\nAnd Harris, Obama said, is “ready to do the job.”\n\nHe described her as “a leader who has spent her life fighting on behalf of people” and someone who understands the struggles of middle-class Americans.\n\n“Kamala is as prepared for the job as any nominee for president has ever been. That’s who Kamala is,” he said.\n\nHe also said Harris’s running-mate, Minnesota Governor Tim Walz, would make an “excellent partner” for her in the White House, recalling Walz’s history as a veteran, a teacher, a high school football coach, and a “great governor” who has been “working with Democrats and Republicans to get stuff done.”\n\n“If you elect Kamala and Tim, they won’t be focused on their problems. They understand that too many folks here in Pennsylvania and across the country are struggling to pay the bills, even though wages are still growing and inflation is finally slowing,” he continued.\n\n“The price of everything from health care to housing to groceries, it’s still too high, and that takes a real bite of paychecks. It hurts. So the question is, who’s really going to do something about it? That’s what you should be asking yourself,” he said.\n\nTurning the subject back to Trump, Obama acknowledged that some Americans might recall the US economy as having been “pretty good” during much of the time when Trump was in office.\n\n“It was pretty good because it was my economy,” he said. “We had 75 straight months of job growth that I handed over to him. It wasn’t something he did. I spent eight years cleaning up the mess that the Republicans had left me the last time … so just in case everybody has a hazy memory, he didn’t do nothing!”\n\nHe also savaged Trump for his recent tactic of spreading blatant lies about the response to Hurricane Helene and Hurricane Milton — lies that have left many Americans reluctant to ask for help from the government because they are fearful of emergency management officials.\n\n“The idea of intentionally trying to deceive people in their most desperate and vulnerable moments — when did that become okay?”\n\nThe 46th president also took aim at the cult of masculinity Trump has tried to cultivate around himself over the last four years.\n\n“Even if you had a family member who acted like that, you might still love him, but you tell him you got a problem and you wouldn’t put him in charge of anything. And yet, when Donald Trump lies or cheats or shows utter disregard for our Constitution, when he calls POWs ‘losers’ or fellow citizens ‘vermin,’ people make excuses for it. They think it’s okay,” he said.\n\n“I’m sorry, gentleman — that’s not what real strength is. It never has been. Real strength is about working hard and having a heavy load without complaining. Real strength is about taking responsibility for actions and telling the truth even when it’s inconvenient,” he continued.\n\n“Real strength is about helping people who need it and standing up for those who can’t always stand up for themselves. That is what we should want for our daughters and for our sons, and that is what I want to see in a President of the United States of America,” he said.","summary":"Obama slammed the ‘78-year-old billionaire who has not stopped whining about his problems since he rode down his golden escalator nine years ago’ as he stumped for Kamala Harris and Senator Bob Casey in Pittsburgh","url":"https://www.independent.co.uk/news/world/americas/us-politics/obama-election-trump-campaign-trail-b2627566.html","image":"https://static.independent.co.uk/2024/10/11/01/2024-10-11T001730Z_1017155945_RC20IAA05SPO_RTRMADP_3_USA-ELECTION-OBAMA.jpg?width=1200","video":null,"publish_date":"2024-10-11 00:27:20","author":"Andrew Feinberg","authors":["Andrew Feinberg"],"language":"en","source_country":"gb","sentiment":-0.122},{"id":259261032,"title":"Megyn Kelly Argues DeSantis and Biden Are United Against Kamala Harris: ‘You Can’t Blame the Guy for Loathing Her’ | Video","text":"Megyn Kelly said on Thursday that, following nonstop coverage of Hurricane Milton, Vice President Kamala Harris has “managed to unite” political rivals President Joe Biden and Gov. Ron DeSantis.\n\n“The tension between Joe Biden and Kamala Harris continues to play out in public in what has to be one of the most delicious storylines we’ve seen in a while,” said the podcast host, surmising that the president “loathes” his VP for inheriting the Democratic Party presidential nod for 2024.\n\nKelly further noted that, in his recent press briefings, Biden has been attempting to “undermine” Harris’ campaign and prove that she’s “pretty much a no one.”\n\n“You can’t blame the guy for loathing her,” the journalist even said at one point on “The Megyn Kelly Show.” Watch the excerpt from Thursday’s episode in the video, below.\n\nKelly mentioned that Biden stole her fire in praising DeSantis following the two back-to-back hurricanes that hit Florida.\n\nBiden said of the Florida Governor, “He’s been taking my calls, we’re all good. He’s been great … it’s been great. Thumbs up for Ron DeSantis.” That supposedly infuriated Harris, who, according to Kelly, was “upset that she couldn’t get Ron DeSantis to take her phone calls.”\n\nAs for Harris’ Tuesday appearance on “The View,” Kelly said that Biden’s press conference about Hurricane Milton at the same time “basically embarrassed her.”\n\nThe former TV personality said that Biden and DeSantis now share the same perspective on the Democratic presidential nominee: “Ron DeSantis is basically like, there’s this gnat bothering me on my shoulder as I’m trying to manage the safety of millions of people.”\n\n“She’s managed to unite Joe Biden and Ron DeSantis! What’s happening here?” Kelly asked guest Glenn Greenwald in the end.","summary":"The podcast host thinks the \"tension\" between the president and vice president \"has to be one of the most delicious storylines we've seen in a while\"\n\n\nThe post Megyn Kelly Argues DeSantis and Biden Are United Against Kamala Harris: &#8216;You Can&#8217;t Blame the Guy for Loathing Her&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/megyn-kelly-kamala-harris-joe-biden-ron-desantis-unity/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/megyn-kelly-10-10-24.jpg","video":null,"publish_date":"2024-10-11 00:17:42","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","category":"politics","source_country":"US","sentiment":-0.379},{"id":259261512,"title":"Why Obama's support is important for Harris campaign, Democrats","text":"Why Obama's support is important for Harris campaign, Democrats\n Former President Barack Obama is campaigning for Vice President Kamala Harris in Pittsburgh, Pennsylvania, Thursday. Meanwhile, Florida Gov. Ron DeSantis is accusing Harris of \"politicizing\" the hurricane disaster recovery. CBS News chief election and campaign correspondent Robert Costa reports on Harris' campaign and the politics of disaster relief.","summary":"Former President Barack Obama is campaigning for Vice President Kamala Harris in Pittsburgh, Pennsylvania, Thursday. Meanwhile, Florida Gov. Ron DeSantis is accusing Harris of \"politicizing\" the hurricane disaster recovery. CBS News chief election and campaign correspondent Robert Costa reports on Harris' campaign and the politics of disaster relief.","url":"https://www.cbsnews.com/video/why-obamas-support-important-harris-campaign-democrats/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/11/b8e64428-9244-4b83-ba29-23bfe71d295f/thumbnail/1200x630/f4a99dd67c32896fb18f2a2685a63a3a/cbsn-fusion-why-obamas-support-important-harris-campaign-democrats-thumbnail.jpg?v=29b5ccc4d237d9b284ce95a42effd0","video":null,"publish_date":"2024-10-11 00:16:00","author":null,"language":"en","source_country":"US","sentiment":-0.025},{"id":259261434,"title":"Gov. Tim Walz to attend Mankato high school football game, Pheasant Opener","text":"Gov. Tim Walz to attend Mankato high school football game, Pheasant Opener\n\nThe Harris-Walz campaign is deploying Minnesota’s governor on a new push to win over male voters in swing states.\n\nBy Ryan Faircloth\n\nThe Minnesota Star Tribune\n\nOctober 11, 2024 at 12:12AM\n\nGov. Tim Walz takes the stage at a rally on the Erie waterfront in front of around 2,000 supporters on Thursday, Sept. 5, 2024. (Glen Stubbe)\n\nGov. Tim Walz will be back in Minnesota this weekend to attend the annual Mankato East-Mankato West high school football game and participate in the Governor’s Pheasant Hunting Opener in Sleepy Eye.\n\nIt’s been 25 years since Mankato West won a state championship with Walz serving as an assistant coach. The DFL governor and vice presidential candidate will cheer on the Scarlets on Friday night and give the team a pep talk before the game, the Harris-Walz campaign said.\n\nOn Saturday, Walz will go out for an early hunt in Sleepy Eye to mark the start of the pheasant season. He’ll be joined by a group of outdoors-focused internet influencers. The governor is expected to discuss the importance of conservation, hunting, Second Amendment rights and gun safety, the campaign said.\n\nSince choosing him as her running mate, Democratic presidential nominee Kamala Harris has touted Walz’s background as a football coach, hunter and gun owner in an attempt to appeal to male and Midwestern voters.\n\nA Star Tribune/MPR News/KARE 11 Minnesota poll conducted in September found that men preferred the Trump-Vance ticket over Harris-Walz by a 53%-37% margin. Women backed Harris-Walz over Trump-Vance 59% to 35%.\n\nThe Harris campaign is deploying Walz on a new push to reach male voters in swing states. He will travel to Michigan on Friday before the Mankato game to give remarks about investing in manufacturing and for a political engagement with Black male voters.\n\nThe governor will also have interviews with local TV anchors from the battleground states of Michigan, Wisconsin and Pennsylvania to discuss high school football and hunting.\n\nWalz just taped an interview with former NFL star and “Good Morning America” co-host Michael Strahan that will air Friday, according to the campaign. He’s expected to discuss his time as a high school football coach and how it influenced his approach to public service. He’ll be joined by some of his former Mankato West students for part of the interview, which was recorded at the University of Minnesota’s Huntington Bank Stadium.\n\nThe campaign is also expected to release unseen footage from the 1999 Mankato West championship game on Walz’s social media channels, along with interviews of former students and players.\n\nRumors of a possible Walz appearance at Friday’s Mankato East-Mankato West game had swirled in the days before it was announced. In a post on X on Wednesday, former GOP state Rep. Jeremy Munson urged people to show up and boo Walz.\n\n“Rumor has it that Tim Walz will be at our local high school football game (Mankato East vs. West) this Friday, October 11th, at 7 PM at MSU Mankato. It would be a shame if attendees booed him on his home turf this Friday, October 11th, at 7 PM at MSU Mankato,” Munson wrote. “Have I asked what you’re doing this Friday, October 11th, at 7 PM at MSU Mankato?”\n\nRelated Coverage\n\nHigh Schools\nOne for The Jug: In Mankato, a football rivalry will add a new chapter\n\nWhere Minnesota’s best pheasant hunting is this year, and 5 other things to know ahead of the 2024 opener\n\nYuen: Tim Walz’s trips to China should not be demonized\n\nView post on X","summary":"The Harris-Walz campaign is deploying Minnesota’s governor on a new push to win over male voters in swing states.","url":"https://www.startribune.com/gov-tim-walz-to-attend-mankato-high-school-football-game-pheasant-opener/601160466","image":"https://arc.stimg.co/startribunemedia/FKQE6CA4ZVD5NDMWCEOHIXUTCY.jpg?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2024-10-11 00:12:40","author":"Ryan Faircloth","authors":["Ryan Faircloth"],"language":"en","category":"sports","source_country":"US","sentiment":0.167},{"id":259261284,"title":"Obama hits campaign trail in critical Pennsylvania to shore up support for Harris - The Associated Press","text":"PITTSBURGH (AP) — Former President Barack Obama held a get-out-the-vote rally for Kamala Harris on Thursday night as the Democratic Party tried to harness the enthusiasm for one of its biggest stars in the closing weeks of the campaign against Republican Donald Trump. \n\nObama, speaking as voting was underway in the critical battleground state Pennsylvania, even refashioned his old campaign rallying cry, “Yes, We Can,” to “Yes, She Can,” which beamed on a screen over the crowd.\n\nObama said that the last few years, starting with the pandemic, have been hard for Americans, with high prices and other impacts putting a squeeze on working families. \n\n“I get it, why people are looking to shake things up. I mean, I am the hopey-changey guy. So I understand people feeling frustrated and feeling we can do better,” Obama said. “What I cannot understand is why anybody would think that Donald Trump will shake things up in a way that is good for you, Pennsylvania.”\n\nHe painted Trump as out-of-touch and not the choice to lead the country to change, calling him a “bumbling” billionaire “who has not stopped whining about his problems since he rode down his golden escalator nine years ago.”\n\nHe called Harris “a leader who has spent her life fighting on behalf of people who need a voice and a chance” and declared, “Kamala is as prepared for the job as any nominee for president has ever been.”\n\nThe former president’s appearance at the University of Pittsburgh was his first appearance at a campaign rally for Harris as he sets off on a swing-state tour on her behalf. Obama last month appeared at a Harris fundraiser in California and in August spoke at the Democratic National Convention in August,\n\nObama, eight years out of power, has been one of the Democratic Party’s most reliable surrogates to galvanize voters. Until he was elected president in 2020, Joe Biden had also taken on that role for Democrats, but this year, since ending his reelection campaign and letting Harris ascend to the ticket, he’s yet to hit the trail.\n\nAs the nation’s first Black president, Biden’s appearance for Harris underscores the history-making nature of her own political career. Harris, the first woman, Black person or person of South Asian descent to serve as vice president, would be the first woman to serve as president if elected next month.\n\nGlenda Ellison, a 71-year-old retired schoolteacher and Democrat from Pittsburgh, said she is feeling “a little nervous” about the election but “prayerful that it’s going to turn out in our favor.”\n\nEllison said she sees Obama as a party spokesperson with a large following who can hopefully sway voters that might be on the fence about voting for Harris.\n\n“As a former president, and also as a Black president, I think that is something that might connect with the African American community, the fact that we do have our Black president supporting another Black candidate,” said Ellison, who is Black.\n\nObama was among the key Democrats who were part of a behind-the-scenes effort to encourage Biden, his former vice president, to drop out of the 2024 race.\n\nObama and Harris have been friends for two decades since he ran for Senate in Illinois. She campaigned for him when he sought the presidency in 2008.\n\nPennsylvania is a state Obama won in his 2008 and 2012 presidential races, but Trump won in 2016. Biden narrowly carried it in 2020 and the state is shaping up to be one of the most closely contested in this year’s race.\n\nTrump was in the eastern part of the state Wednesday for back-to-back rallies in Scranton and Reading. He also campaigned in eastern Pennsylvania over the weekend when he returned to Butler, where he was shot in July as he survived an assassination attempt. \n\nObama’s appearance was also aimed to bolster the reelection campaign of Pennsylvania Sen. Bob Casey, who is being challenged by Trump-endorsed Republican David McCormick.\n\nEarlier in the day, Obama visited a campaign office in Pittsburgh, where he brought pastries for volunteers and thanked them for their work, according to his office. \n\n“I’m excited because that’s what Allegheny County needs, is him to promote Harris and Walz, just really to get the momentum going and to get those blue votes out,” Sherry Werner, a 60-year-old who works at the University of Pittsburgh Medical Center.\n\nWerner, who was wearing a Harris button pinned to her sweater, said she is volunteering to help the campaign and feels more momentum already than in past years, and noted the long line of people waiting to get into the event hours before Obama was set to take the stage.\n\n“Who doesn’t love Obama?” she said.","summary":"Obama hits campaign trail in critical Pennsylvania to shore up support for Harris  The Associated Press","url":"https://apnews.com/article/obama-harris-trump-2024-election-d9874edf5ae646bf632dc463bcee3625","image":"https://dims.apnews.com/dims4/default/423ff5e/2147483647/strip/true/crop/3500x1969+0+183/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F08%2F67%2Fba5382b8a47c95501c34e0676e0f%2F623bdc75b2024f11a122b788c0bf4de0","video":null,"publish_date":"2024-10-11 00:06:00","author":"Michelle L. Price","authors":["Michelle L. Price"],"language":"en","source_country":"us","sentiment":-0.071},{"id":259260088,"title":"Harris finally forced to address her ‘unprecedented’ nomination route at Univision town hall","text":"LAS VEGAS — Vice President Kamala Harris finally confronted the question of her candidacy’s primary-free path after 10 weeks as the presumptive and then actual Democratic presidential nominee. \n\nAnd it wasn’t a reporter who asked — it was an undecided voter at Univision’s Thursday town hall.\n\n“You earned your candidacy without going through the normal process, that is primary elections or through a caucus,” said property manager Mario Sigbaum, a Uruguay native who became a US citizen 28 years ago. “That really caught my attention. I’m also concerned about the way I feel President Biden was pushed aside. How can you clarify this?”\n\nHarris acknowledged the “unprecedented” way she secured the nod.\n\n“President Biden made a decision that I think history will show is probably one of the most courageous that a president could make, which is he decided to put country above his personal interest. And he made that decision he very within that same period of time, supported my candidacy and urged me to run,” Harris said in one of her signature word salads. “And I am honored to have earned the Democratic nomination.”\n\nBut former President Donald Trump — who, unlike Harris, bested a field of rivals in two presidential primary cycles — represents the actual anti-democratic threat, she said in a quick pivot.\n\n“Donald Trump said he would, and I’m using a quotation, ‘terminate the Constitution of the United States,’” Harris said. “Imagine the Constitution of the United States would guarantee the Fourth Amendment against unreasonable search and seizure by a government on you, the Fifth Amendment, the Sixth Amendment.”\n\nThe Democrat did not mention the First Amendment, which guarantees freedom of speech, or the Second Amendment, codifying citizens’ right to bear arms.\n\n“Noticias Univision Presents: Latinos Ask, Kamala Harris Responds,” sponsored by the Spanish-language network, will air Thursday at 10 p.m. \n\nThe one-hour program, recorded on the University of Nevada, Las Vegas, campus, featured questions from Hispanics said to be undecided about their choice next month. The network flew in at least two voters — from Florida and Wisconsin — for the event.\n\nVoters queried the veep in Spanish and English, with moderator Enrique Acevedo providing Harris a translation when needed; she answered in English.\n\nAt one point, Harris offered sympathy to a questioner who said her noncitizen mother — who apparently resided in America for decades — died without getting necessary health care.\n\n“You must remember her as she lived,” the veep said. “Not how she died.”\n\nBut later in the discussion, Harris displayed a harder edge. Asked to name three positive things about Trump by an audience member, the candidate could only praise the ex-prez for “having love for his family.”\n\nHarris continued, “I don’t really know him. To be honest with you, I only met him one time on the debate stage. I’ve never met him before, so I don’t really have much more to offer you.”\n\nShe then made a pitch for “80 pages of policy positions” on her campaign website.\n\nThe rest of the Q&A saw Harris reach into her stump-speech grab bag for stock answers on subjects such as inflation — she blamed “price gouging” — and abortion — “in the year of our Lord 2024,” women shouldn’t have to worry about “politicians” deciding their options.\n\nHarris took questions as part of an effort to shore up support from a community whose voters are drifting towards Trump. \n\nA September NBC News/Telemundo poll shows the lowest level of Hispanic support for Democrats since 2012. While 7 in 10 Hispanic voters supported Hillary Clinton in 2016, Harris has just 54% backing this year, with Trump at 40%.\n\nUnivision — which is expected to host a similar event with Trump next week — refused to make audience members available to reporters. A spokeswoman would not provide a reason for their segregation.","summary":"LAS VEGAS — Vice President Kamala Harris finally confronted the question of her candidacy’s primary-free path after 10 weeks as the presumptive and then actual Democratic presidential nominee. And it wasn’t a reporter who asked — it was an undecided voter at Univision’s Thursday town hall. “You earned your candidacy without going through the normal process, &#8230;\n\n\nThe post Harris finally forced to address her ‘unprecedented’ nomination route at Univision town hall appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/harris-finally-forced-to-address-her-unprecedented-nomination-route-at-univision-town-hall/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/democratic-presidential-nominee-vice-president-91376614.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-11 00:03:10","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.173},{"id":259260806,"title":"Harris rips Trump for his criticism of federal storm response and calls for ‘dignity’","text":"By ISABELLA VOLMERT, DARLENE SUPERVILLE and WILL WEISSERT\n\nLAS VEGAS — Vice President Kamala Harris and the White House criticized Donald Trump for his attacks on the federal response to Hurricanes Helene and Milton and suggested he was wrongly trying to turn the deadly storms to his political advantage.\n\nAttending a town hall sponsored by Univision in Las Vegas, Harris was asked about complaints that federal officials have bungled disaster recovery efforts. She responded, “In this crisis — like in so many issues that affect the people of our country — I think it so important that leadership recognizes the dignity” to which people are entitled.\n\n“I have to stress that this is not a time for people to play politics,” Harris added.\n\nThose comments came after the former president spoke at the Detroit Economic Club, offering sympathy to people affected by Hurricanes Helene and Milton, the latter of which came ashore in Florida Wednesday night. But Trump also suggested that the Biden administration’s response had been lacking, particularly in North Carolina after Helene.\n\n“They’ve let those people suffer unjustly,” said Trump, who has for several days promoted falsehoods about the federal response.\n\nHarris virtually attended a briefing, held in the White House Situation Room with President Joe Biden, on emergency efforts in Milton’s wake. In subsequent comments to reporters, Biden slammed Trump for spreading misinformation about federal assistance available to victims, including falsely claiming that it was capped at $750. In reality, that is just for immediate needs, the first potential payout rather than the total.\n\n“That $750 that they’re talking about, Mr. Trump and all those other people know it’s a lie to suggest that’s all they’re going to get,” Biden said Thursday. “They’re being so damn un-American with the way they’re talking about this stuff.”\n\nHe added directly to Trump: “Get a life, man. Help these people.”\n\nDespite the storm, Trump and Harris are both visiting key swing states strategically, trying to increase support with key voting blocs who could decide an election expected to be exceedingly close.\n\nIn Michigan, where he’s looking to appeal to primarily to blue-collar voters, Trump took a swipe at the city he happened to be campaigning in, suggesting that Detroit was “a mess.”\n\n“Our whole country will end up being like Detroit if she’s your president,” he said of Harris. “You’re going to have a mess on your hands.”\n\nHarris responded that Trump “yet again has trashed another great American city when he was in Detroit, which is just a further piece of evidence on a very long list of why he is unfit to be president of the United States.”\n\nTrump’s economic speech featured multiple errors\n\nThe former president used his appearance at the Detroit Economic Club to echo core themes from his 2016 campaign, saying some other countries, especially China, are ripping the U.S. off and taking manufacturing business away. Trump said powerful companies have “raped” the United States. He vowed to impose huge tariffs that he said would force other countries to negotiate what they charge on American products.\n\n“They’ve been screwing us for so many years that we’re allowed to get some of that back,” Trump said about charging tariffs from countries.\n\nEconomists warn Trump’s proposed tariffs would drive up consumer costs. Trump has also claimed, without providing specifics, that he can use tariffs to reduce the U.S. budget deficit and pay for an expansion of childcare funding, even as he proposes other ideas without saying how he would replace the lost funding. .\n\nBut the former president seemed to not understand the difference between the budget deficit and trade imbalances, conflating the two different economic measures as essentially being the same thing.\n\nHe noted that the federal government has nearly $36 trillion in total debt, a byproduct of the annual borrowing needed to cover the gap between tax revenues and government spending. Except Trump then seemed to indicate that the debt was a byproduct of the trade deficit with China — which is a separate issue that reflects the difference between how much a country exports and how much it imports.\n\n“We have $36 trillion in debt,” Trump said. “For years and years and years, we’ve been accumulating. We’d have these deficits that are monstrous. We had 5,6,7 $800 billion deficit with China.”\n\nHe also claimed that “we had the highest job numbers in my administration,” but that isn’t true any longer. The unemployment rate fell slightly lower under Biden — to 3.4% early last year, the lowest in a half-century, below 3.5% before the pandemic under Trump.\n\nHarris looks to boost Hispanic support\n\nHarris has a rally in Phoenix after participating in the town hall for the Spanish-language network Univision. She’s looking to increase support among Hispanic voters, especially men.\n\nHer campaign began a group this week known as “Hombres con Harris” — Spanish for “Men for Harris” — that is planning to hold events at Latino-owned small businesses, union halls, barbecues and community events until Election Day.\n\nAt Univision’s “Latinos Ask, Kamala Harris Responds” event, Ivett Castillo, 40 and a Las Vegas resident, told Harris that she’s an American citizen born to two Mexican parents and that her mother died six weeks ago. She cried as she asked the vice president about “plans to support that subgroup of immigrants here their whole lives and who live and die in the shadows.” When the town hall ended, Harris went over and clasped hands with Castillo, whose face was still streaked with tears.\n\nIn response to her question, Harris noted that Biden sent a bill to Congress on his first day in office seeking to create pathways to U.S. citizenship for many people in the country illegally that was never considered.\n\nUnauthorized border crossings hit record highs during the Biden administration before declining this year after the president issued an executive order restricting asylum claims.\n\nAnother audience member asked Harris to explain how she replaced Biden on the Democratic ticket, prompting her to respond, “President Biden made a decision that I think history will show was probably one of the most courageous a president could make.”\n\nShe said Biden “put country before personal interest” and “urged me to run.”\n\nHispanic voters are about evenly split on whether to trust Harris or Trump to do a better job handling the economy, but they give the former president an edge on handling immigration. Hispanic women are more likely to trust Harris to better handle the economy and immigration, and Hispanic men are more likely to trust Trump on both issues, according to polling from The Associated Press and the NORC Center for Public Affairs Research.\n\nMeanwhile, former President Barack Obama hit the campaign trail Thursday night, making his first appearance for Harris at a rally in Pittsburgh. Obama’s team says he will focus on swing states, especially those with key Senate races. Biden has just made one joint campaign appearance with Harris since he himself left the race in July.\n\nAmong those attending was Glenda Ellison, a 71-year-old retired schoolteacher and Democrat from Pittsburgh. She said she is feeling “a little nervous” about the election but “prayerful that it’s going to turn out in our favor.”\n\nVolmert reported from Detroit. Weissert reported from Washington. Associated Press writers Christopher Rugaber, Josh Boak and Linley Sanders in Washington, Michelle L. Price in Pittsburgh and Adriana Gomez Licon in Fort Lauderdale, Florida, contributed to this report.","summary":"“They’ve let those people suffer unjustly,” said Trump, who has for several days promoted falsehoods about the federal response.","url":"https://www.ocregister.com/2024/10/10/harris-rips-trump-for-his-criticism-of-federal-storm-response-and-calls-for-dignity/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/AP24284744746543.jpg?w=1024","video":null,"publish_date":"2024-10-10 23:55:17","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.345},{"id":259259844,"title":"Jim Jordan warns FTC to back off suing car dealer accused of overcharging Latinos","text":"House Judiciary Committee chairman Jim Jordan (R-OH) fired off a warning shot at Federal Trade Commission chair Lina Khan, according to the New York Post: stop investigating civil rights matters.\n\nJordan, along with Rep. Cathy McMorris Rodgers (R-WA), chairwoman of the House Committee on Energy and Commerce, sent Khan a letter Thursday taking particular issue with the FTC's lawsuit against Coulter Motor Company, which operates Buick and Cadillac dealerships in Tempe, Arizona. \n\nThe suit accuses Coulter of \"deceptive\" online pricing schemes and illegal junk fees. Of particular interest to the Republican lawmakers, it also accuses them of charging Latino customers an average of $1,200 more in interest and fees than everyone else.\n\nThis effectively amounts to the FTC deputizing itself as a civil rights agency, Jordan and Rodgers warned — something they argue the FTC has no authority to do.\n\n“Both Commissioners [Andrew] Ferguson and [Melissa] Holyoak raised concerns not only because the FTC Act does not contemplate such claims, but the FTC making up such a claim and including it as part of a settlement agreement can set a dangerous precedent,” said the letter.\n\nThe lawmakers added that while the FTC is in charge of enforcing the 1974 Equal Credit Opportunity Act, “that authority to challenge conduct under the ECOA does not accordingly permit the FTC to separately challenge conduct as 'unfair discrimination' pursuant to the FTC Act.”\n\nJordan and Rodgers cited the Supreme Court's ruling earlier this year overturning Chevron deference, or the requirement that courts presume the expertise of executive agencies in interpreting their own rulemaking powers. They warned that the question of whether the FTC can police discrimination is likely to be challenged in court, where judges can now more easily deny this authority.\n\nKhan, widely considered to be a hero of progressive activists within the Biden administration, has led the charge on stronger antitrust enforcement, particularly pursuing the breakup of big tech monopolies — which has led some wealthy Democratic donors and surrogates to pressure Vice President Kamala Harris to replace her if she is elected.","summary":"House Judiciary Committee chairman Jim Jordan (R-OH) fired off a warning shot at Federal Trade Commission chair Lina Khan, according to the New York Post: stop investigating civil rights matters.\n\nJordan, along with Rep. Cathy McMorris Rodgers (R-WA), chairwoman of the House Committee on Energy and Commerce, sent Khan a letter Thursday taking particular issue with the FTC's lawsuit against Coulter Motor Company, which operates Buick and Cadillac dealerships in Tempe, Arizona. \n\nThe suit accuses Coulter of \"deceptive\" online pricing schemes and illegal junk fees. Of particular interest to the Republican lawmakers, it also accuses them of charging Latino customers an average of $1,200 more in interest and fees than everyone else.\n\nThis effectively amounts to the FTC deputizing itself as a civil rights agency, Jordan and Rodgers warned — something they argue the FTC has no authority to do.\n\n“Both Commissioners [Andrew] Ferguson and [Melissa] Holyoak raised concerns not only because the FTC Act does not contempla","url":"https://www.alternet.org/jim-jordan-ftc/","image":"https://www.alternet.org/media-library/image.jpg?id=53803694&width=1200&height=600&coordinates=0%2C560%2C0%2C560","video":null,"publish_date":"2024-10-10 23:54:15","author":"Matthew Chapman,Raw Story","authors":["Matthew Chapman","Raw Story"],"language":"en","category":"politics","source_country":"US","sentiment":-0.207},{"id":259261030,"title":"Harris’s ‘weak’ support from minority men could cost her the White House","text":"In the blue-wall battleground states of Pennsylvania and Michigan, Harris’s campaign depends on her driving up her vote margins in the predominantly black cities of Philadelphia and Detroit. In Arizona and Nevada, she needs to appeal to Latino voters, who have become increasingly important in the Sun Belt states. But at the moment, one month before Election Day, she is underperforming with both demographics.“Regarding black voters, she is doing much better than Biden was [in] 2024 but not quite his 2020 numbers,” Marist Institute for Public Opinion director Lee Miringoff told the Washington Examiner. “Latinos are clearly a weak spot for her, hence the town hall.”\n\nAhead of Harris’s town hall Thursday in Nevada with Spanish-language television network Univision, for example, polls supervised by Miringoff underscore that Harris and former President Donald Trump are “even” among Latino voters, remarkable compared to previous elections.\n\nDespite a wider margin of error in Latino polling because of their smaller sample sizes, 2016 Democratic presidential nominee Hillary Clinton won the demographic over Trump 66%-28% and President Joe Biden repeated her success four years later 65%-32%, according to Miringoff.\n\nSome of the decrease in Democratic support among Latinos coincided with an increase in the party’s acceptance of socialism, namely its warm embrace of Sen. Bernie Sanders (I-VT) and Rep. Alexandria Ocasio-Cortez (D-NY).\n\nBut Monmouth University Polling Institute director Patrick Murray also attributed the development to Trump’s appeal to men more broadly.\n\n“Harris — and Biden before he dropped out of the race — is not doing as well as prior Democratic candidates among men under age 50 in these groups,” Murray told the Washington Examiner. “They are more attracted to Trump’s ‘get tough’ persona this year than they were in 2020 or 2016.”\n\nWhile Harris is appealing to Latinos through her town hall, Michigan Democrats are imploring her to do the same to black men in their state before it is too late.\n\nRev. Horace Sheffield, III., a black Michigan pastor and radio host, for one, encouraged Harris to bring together black men and ask them “what they need” her “to do,” not make empty promises.\n\n“They probably needed to get started a little earlier,” Sheffield told the Washington Examiner. “If you want to reach some black men, Kamala Harris, call me up and let me put them in a room for you, small room, big room, large room. But you need to get in front of them and hear from them.”\n\nThe practical repercussions of Trump’s appeal to minority voters are that he is leading Harris in Arizona, Michigan, and Pennsylvania, on average, by less than 1 percentage point, according to RealClearPolitics, though Harris is ahead in Nevada by the same margin. In comparison to this time four and eight years ago, Clinton and Biden had comfortable leads over Trump in Michigan and Pennsylvania, though the former secretary of state eventually lost them, and Biden was ahead in Nevada. Arizona was close throughout both elections.\n\nRepublican strategist Cesar Conda contended Trump’s appeal is not only because of the former president’s personality, but his policies. \n\n“Under former President Trump, black, Hispanic, and Asian unemployment fell to record lows, real wages increased, and inflation was under control,” Conda told the Washington Examiner. “Under Vice President Kamala Harris and President Joe Biden, minorities have experienced stagnating real wages and higher costs for groceries, gasoline, and housing. Working class Americans, including minorities, have faced increased competition for scarce jobs from the explosion of illegals entering this country caused by Harris’s border policies.”\n\nConda cited Harris’s appearance this week on The View, in which she responded, “Not a thing that comes to mind” when asked for differences between herself and Biden.\n\n“The bottom line is Kamala Harris is struggling with minority voters because she offers the same failed policies that produced record inflation and illegal immigration,” he said.\n\nAt the same time, Democrats are emphasizing Harris’s policies, such as her proposal for home builder tax credits and providing an up to $25,000 down payment for first-time homebuyers, with affordable housing an important issue in Nevada.\n\n“Nevada’s Latino and union voters have the power to decide who wins the Silver State in November,” Democratic National Committee Hispanic media director Marco Frieri told reporters. “These blocs are vital communities that help keep Nevada’s economy moving forward every single day. As Vice President Kamala Harris makes her case to Latino voters today, we’re making sure they have all of the information they need to access the ballot box at IWillVote.com and cast an informed vote for Democrats up and down the ballot.”\n\nAmid Harris’s work to appeal to minority voters, Trump has one major advantage: Trump does not have to win the respective demographics; he only has to undermine her support.\n\nRegardless, to mitigate Democrats’s organizing and fundraising advantage, the Trump campaign and Republican National Committee have conducted traditional canvassing and phone banking, in addition to holding community events, from haircuts to Cafecito door launches and Spanish postcard writing nights.\n\nHarris’s town hall is part of her new, more open media strategy that has created problems for her apart from her appearance on The View.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nHer 60 Minutes interview, for instance, raised questions concerning the registration of her personal firearm, a “Glock,” and why she considers Iran to be the country’s “greatest adversary” and not China.\n\nTrump’s town hall was delayed until next week because Hurricane Milton was scheduled to make landfall during its original broadcast.","summary":"Kamala Harris&#8216;s struggles to convince minority voters, particularly&#160;black&#160;and&#160;Latino&#160;men, to support her could cost the vice president the November election. In the blue-wall battleground states of Pennsylvania and Michigan, Harris&#8217;s campaign depends on her driving up her vote margins in the predominantly black cities of Philadelphia and Detroit. In Arizona and Nevada, she needs to appeal [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3184401/harris-weak-support-minority-men-could-cost-white-house/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/harris-nevada-latinos-scaled.webp","video":null,"publish_date":"2024-10-10 23:52:35","author":"Naomi Lim","authors":["Naomi Lim"],"language":"en","source_country":"US","sentiment":0.055},{"id":259260528,"title":"Harris, asked to name 3 virtues for Trump, can’t name any - The Associated Press","text":"LAS VEGAS (AP) — Vice President Kamala Harris was asked to name three virtues that her opponent in next month’s election, Donald Trump, possesses — but was unable to come up with even one. \n\nAt the end of her town hall for Spanish-language network Univision in Las Vegas on Thursday, audience member Teresa Djedjro, 48 and originally born in Mexico, asked Harris to, “Please give me three virtues that Trump has.”\n\nHarris laughed and thanked her for the question before saying, “I know that the vast majority of us has so much more in common than what separates us.” Then she made clear that is not the case for herself and the former president, saying Trump’s approach to politics, “pains me” while singling out his ”us versus them” approach.\n\n“I don’t think that’s healthy for our nation, and I don’t admire that,” Harris said. “And I’m quite critical of it, coming from someone who wants to be president of the United States.”\n\nTaking another stab at a compliment, she offered, “I think Donald Trump loves his family and I think that’s very important,” only to continue, “But I don’t really know him. I only met him one time ... so I don’t really have much more to offer you.”\n\nTrump is holding his own Univision town hall next week, after the original gathering in Miami was postponed due to Hurricane Milton. Still, he too has had little nice to say about Harris during the campaign, calling her “mentally impaired.”","summary":"Harris, asked to name 3 virtues for Trump, can’t name any  The Associated Press","url":"https://apnews.com/article/harris-trump-virtues-univision-aa072d5a209d022583fc4702ae9ca93c","image":"https://dims.apnews.com/dims4/default/7c0a826/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3e%2F0f%2Ff67ea08139a1c9fbfd57ff92ad20%2F2d7866e8610d4b9bb4fc429305325041","video":null,"publish_date":"2024-10-10 23:48:00","author":"Am Utc","authors":["Am Utc"],"language":"en","source_country":"us","sentiment":-0.053},{"id":259259294,"title":"Harris finally forced to address her ‘unprecedented’ nomination route at Univision town hall","text":"LAS VEGAS — Vice President Kamala Harris finally confronted the question of her candidacy’s primary-free path after 10 weeks as the presumptive and then actual Democratic presidential nominee. \n\nAnd it wasn’t a reporter who asked — it was an undecided voter at Univision’s Thursday town hall.\n\n“You earned your candidacy without going through the normal process, that is primary elections or through a caucus,” said property manager Mario Sigbaum, a Uruguay native who became a US citizen 28 years ago. “That really caught my attention. I’m also concerned about the way I feel President Biden was pushed aside. How can you clarify this?”\n\nHarris acknowledged the “unprecedented” way she secured the nod.\n\n“President Biden made a decision that I think history will show is probably one of the most courageous that a president could make, which is he decided to put country above his personal interest. And he made that decision he very within that same period of time, supported my candidacy and urged me to run,” Harris said in one of her signature word salads. “And I am honored to have earned the Democratic nomination.”\n\nBut former President Donald Trump — who, unlike Harris, bested a field of rivals in two presidential primary cycles — represents the actual anti-democratic threat, she said in a quick pivot.\n\n“Donald Trump said he would, and I’m using a quotation, ‘terminate the Constitution of the United States,’” Harris said. “Imagine the Constitution of the United States would guarantee the Fourth Amendment against unreasonable search and seizure by a government on you, the Fifth Amendment, the Sixth Amendment.”\n\nThe Democrat did not mention the First Amendment, which guarantees freedom of speech, or the Second Amendment, codifying citizens’ right to bear arms.\n\n“Noticias Univision Presents: Latinos Ask, Kamala Harris Responds,” sponsored by the Spanish-language network, will air Thursday at 10 p.m. \n\nThe one-hour program, recorded on the University of Nevada, Las Vegas, campus, featured questions from Hispanics said to be undecided about their choice next month. The network flew in at least two voters — from Florida and Wisconsin — for the event.\n\nVoters queried the veep in Spanish and English, with moderator Enrique Acevedo providing Harris a translation when needed; she answered in English.\n\nAt one point, Harris offered sympathy to a questioner who said her noncitizen mother — who apparently resided in America for decades — died without getting necessary health care.\n\n“You must remember her as she lived,” the veep said. “Not how she died.”\n\nBut later in the discussion, Harris displayed a harder edge. Asked to name three positive things about Trump by an audience member, the candidate could only praise the ex-prez for “having love for his family.”\n\nHarris continued, “I don’t really know him. To be honest with you, I only met him one time on the debate stage. I’ve never met him before, so I don’t really have much more to offer you.”\n\nShe then made a pitch for “80 pages of policy positions” on her campaign website.\n\nThe rest of the Q&A saw Harris reach into her stump-speech grab bag for stock answers on subjects such as inflation — she blamed “price gouging” — and abortion — “in the year of our Lord 2024,” women shouldn’t have to worry about “politicians” deciding their options.\n\nHarris took questions as part of an effort to shore up support from a community whose voters are drifting towards Trump. \n\nA September NBC News/Telemundo poll shows the lowest level of Hispanic support for Democrats since 2012. While 7 in 10 Hispanic voters supported Hillary Clinton in 2016, Harris has just 54% backing this year, with Trump at 40%.\n\nUnivision — which is expected to host a similar event with Trump next week — refused to make audience members available to reporters. A spokeswoman would not provide a reason for their segregation.","summary":"LAS VEGAS — Vice President Kamala Harris finally confronted the question of her candidacy&#8217;s primary-free path after 10 weeks as the presumptive and then actual Democratic presidential nominee. And it wasn&#8217;t a reporter who asked — it was an undecided voter at Univision&#8217;s Thursday town hall. “You earned your candidacy without going through the normal process,...","url":"https://nypost.com/2024/10/10/us-news/harris-finally-forced-to-address-her-unprecedented-nomination-route-at-univision-town-hall/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/democratic-presidential-nominee-vice-president-91376614.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-10 23:44:49","author":"Mark A. Kellner","authors":["Mark A. Kellner"],"language":"en","source_country":"us","sentiment":0.173},{"id":259259132,"title":"Trump Trashes Motor City as Obama Hits the Trail","text":"Welcome to October Surprise, the Daily Beast’s daily countdown to the biggest election of our lifetime. It’s only 26 days until Election Day and here’s what’s happening in the race to the White House between Donald Trump and Kamala Harris.\n\nTHE DOWNLOAD\n\nKamala Harris is bringing in the biggest of big guns—her old friend, Barack Obama—as she battles for victory with just three weeks until Election Day.","summary":"Photo Illustration by Elizabeth Brockway/The Daily Beast/Reuters/GettyWelcome to October Surprise, the Daily Beast’s daily countdown to the biggest election of our lifetime. It’s only 26 days until Election Day and here’s what’s happening in the race to the White...","url":"https://nation.lk/online/trump-trashes-motor-city-as-obama-hits-the-trail-279720.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-10-10 23:30:05","author":"Elizabeth Brockway","authors":["Elizabeth Brockway"],"language":"en","source_country":"lk","sentiment":0.216},{"id":259258832,"title":"Slotkin suggests Democrats should get their own ‘Project 2025’ for abortion","text":"Slotkin has been in a tight race with her Republican opponent, former Rep. Mike Rogers, with polling showing a race within the margin of error. The pair battled in their first debate Tuesday night.\n\n“Where’s our project 2025?” Slotkin said on Thursday, according to NBC News. She suggested Democrats should have an in-depth plan on how to tackle abortion in the future, not unlike Project 2025’s in-depth idea about a more conservative future. “Does anyone know what the five-year plan is – or even a 10-year plan – to restore the right to an abortion?”\n\nRep. Elissa Slotkin, campaigning alongside Senator Jon Ossoff in Ann Arbor, hits Democrats for not being on offense like Republicans are:“Where’s our project 2025? “Does anyone know what the five year plan is – or even a 10 year plan – to restore the right to an abortion?” pic.twitter.com/yEcscHia98— Julie Tsirkin (@JulieNBCNews) October 10, 2024\n\nThe Washington Examiner contacted Slotkin’s campaign to offer her a chance to clarify her comments but received no response. Rogers’s campaign declined to comment.\n\nAbortion is a top issue in Michigan as it is in many states this election cycle. Slotkin slammed Rogers in their debate for his past moves against expanding abortion rights as a legislator.\n\n“Mike Rogers had 20 years as a legislator,” Slotkin said. “He voted for every single ban, every restriction, every bill that came across his desk to make it harder for a woman and to ban a woman and her right to choose.”\n\nRogers’s campaign told the Washington Examiner that he believes states should decide their own abortion laws and that he won’t undo Michigan’s enshrined abortion rights. A spokesman also said he’d vote down a federal abortion ban if elected.\n\nSlotkin’s suggestion is a new one for Democrats, who have never gone so far as to relate any future political aspirations toward Project 2025, a Heritage Foundation plan Democrats have repeatedly bashed.\n\nA recent Quinnipiac poll showed Slotkin and Rogers tied at 48% among likely voters.\n\nFormer President Donald Trump was in Michigan on Thursday, speaking to a crowd at the Detroit Economic Club. He said the whole country will be like Detroit if Vice President Kamala Harris is elected president.","summary":"Michigan Senate candidate Rep. Elissa Slotkin (D-MI) suggested that Democrats should have their own Project 2025-like plan for abortion during a campaign appearance with Sen. Jon Ossoff (D-GA) in Ann Arbor. Slotkin has been in a tight race with her Republican opponent, former Rep. Mike Rogers, with polling showing a race within the margin of [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3185138/slotkin-democrats-own-project-2025-abortion/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Slotkin.webp","video":null,"publish_date":"2024-10-10 23:28:20","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.134},{"id":259258236,"title":"With Kamala Harris flailing, the left is resorting to Russia Hoax 2.0","text":"“Russia, Russia, Russia” is suddenly in re-runs as Democrats and allied media blast out “new” stories of supposedly sinister ties between Donald Trump and Vladimir Putin.\n\nIs there any better evidence of their desperation as Election Day nears?\n\nThe latest claims: As president, Trump cozied up to Putin, even sending the Russian leader COVID testing equipment during the pandemic.\n\nWorse, they gripe, the ex-prez continued to speak with Vlad after leaving office.\n\nMany of the yarns come from an upcoming book by Bob Woodward.\n\n“Trump secretly gave Putin Covid test machines,” gasps The Guardian, crediting Woodward.\n\nAxios even parroted Dem charges that Trump’s Putin calls “could be illegal.”\n\n(Quick — there’s still time to indict him yet again before the election!)\n\nMeanwhile, The New York Times spun one of its typical thin-reed, anti-Trump tales (on its front page, natch!) speculating that the ex-prez favors Russia over Ukraine because he believes Kyiv helped Hillary Clinton in 2016 and because he bought Putin’s “shtick” about the Russia-Ukraine conflict.\n\nSame-old, same-old: For years, the left bloviated about Trump-Russia “collusion” — though endless probes failed to find anything beyond Trump’s habit of over-the-top flattery of people he hopes to influence.\n\nThe new charges are equally meritless. Even the Times admits Trump in office took a “relatively hawkish stance on Russia.”\n\nAs for violations of the Logan Act, that 1799 law banning private citizens from conducting foreign policy that’s never been used to convict anyone: Countless Democrats (Jimmy Carter, Bill Clinton, Barack Obama, John Kerry) have discussed policy matters with foreign governments after leaving office — often in direct contradiction to the sitting president.\n\nDumbest of all: the whining that Trump gave Putin COVID testing equipment in 2020. Even if true, what could the Russian strongman do with it? \n\nRemember, there was no treatment or vaccine for the virus at the time; and lots of countries were trading equipment and information in a bid to stem COVID’s spread. \n\nLooks like a cheap way to make Putin feel respected, and so less likely to, say, launch a fresh invasion of Ukraine (which Trump, incidentally, provided with lethal weaponry, breaking from the Obama policy). \n\nAnd if Trump refused to help Russia, the left would be howling about that.\n\nBesides, how do free COVID tests even begin to compare to the billions Kamala Harris and Joe Biden gave Iran — which used it to spark a major Middle East war via its proxies?\n\nLet’s face it: Dems are desperate as polls show Harris losing and she struggles in even friendly media hits.\n\nAnd so they rush to Russia Hoax 2.0: Even if it doesn’t change a single vote, it’s proven clickbait!","summary":"Democrats and lefty media outlets are blasting out stories of supposedly sinister ties between Donald Trump and Vladimir Putin because they know they can't tout Kamala Harris' record.","url":"https://nypost.com/2024/10/10/opinion/with-kamala-harris-flailing-the-left-is-resorting-to-russia-hoax-2-0/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/former-us-president-republican-presidential-91377379.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-10 23:22:37","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.432},{"id":259257996,"title":"CBS must release the full Kamala Harris transcript to live up to its own stated standards","text":"With even the Harris-Walz campaign disavowing CBS’s hack editing job of Bill Whitaker’s interview with the Democratic nominee, the network’s only hope of regaining any credibility is to release the full transcript.\n\nAs we’ve noted, the network left no question it had reshaped the “full video” to conceal Kamala Harris’ inept answers to Whitaker’s entirely professional questioning.\n\nIt released an uncut back-and-forth to promote the airing of the “full” interview — then broadcast a version that deceptively made it seem like she’d given a (somewhat) coherent answer to his question about why Israel’s Benjamin Netanyahu “is not listening” to the Biden administration’s advice and requests.\n\nAnd the transcript CBS later released also cut her word-salad response.\n\nWhat else wound up on the cutting-room floor, both on video and in print?\n\nThe American people deserve to know the full truth.\n\nGiven how awful Harris looked even after CBS chose to deceive its viewers, this may well be the last serious interview she does before Election Day: The network has a clear duty to the public to share the whole thing.\n\nFormer CBS reporter Catherine Herridge notes there’s even precedent for the network releasing a complete, raw transcript: It did so for her interview with then-President Donald Trump in 2020.\n\nCBS News claims it’s “dedicated to providing the highest quality journalism.” More: “Our mission is to empower Americans across all ages and demographics to understand the stories and issues that shape the world around us.”\n\nAnd: “We will always seek to hold your elected officials accountable through fair, unbiased and fact-based reporting.”\n\nKeeping the full transcript secret breaks every one of those promises. Cough it up, already.","summary":"With even the Harris-Walz campaign disavowing CBS's hack editing job of Bill Whitaker’s interview with the Democratic nominee, the network’s only hope of regaining any credibility is to release the full transcript.","url":"https://nypost.com/2024/10/10/opinion/cbs-must-release-the-full-kamala-harris-transcript-to-live-up-to-its-own-stated-standards/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-ioyds4tbs-1728599099576.jpg?quality=75&strip=all&1728584763&w=1200","video":null,"publish_date":"2024-10-10 23:21:22","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.022},{"id":259257994,"title":"Even Joe Biden can’t stomach Harris’ fit of pique in hurricane spat with DeSantis","text":"When was the last time you can remember a president rebuking his own party’s nominee to succeed him with less than a month to go until Election Day?\n\nAs it turns out, for every 10 or so of his faults, President Biden does boast a virtue.\n\nA few of his old-school instincts have survived his half-century in electoral politics, and one of those instincts is an aversion to using a crisis — like the one brought about by Hurricanes Helene and Milton — to smear his rivals.\n\nThat aversion has put him at odds with Vice President Kamala Harris.\n\nOn Monday, NBC News reported that Florida Gov. Ron DeSantis had declined to take calls from Harris as he managed the Sunshine State’s recovery from Helene and preparations for Milton.\n\nWhile DeSantis himself professed to have been unaware of Harris’ efforts to reach him, the veep went scorched earth.\n\n“People are in desperate need of support right now. And playing political games at this moment in these crisis situations, these are the height of the emergency situations,” she raged, deriding the governor as “irresponsible” and “selfish.”\n\nIn response, DeSantis rightly noted that it was Harris who was playing political games with a natural disaster poised to threaten the lives and livelihoods of his constituents.\n\n“She has never called on any of the storms we’ve had since she’s been vice president until apparently now,” he pointed out.\n\nBiden has twice been asked about the dispute over DeSantis’ behavior.\n\nAnd to the world’s surprise, he’s now twice come to the defense of the arch-conservative governor, leaving Harris twisting in the wind.\n\nOn Tuesday, Biden was asked whether DeSantis had been “cooperative” in coordinating with the federal government.\n\nNot only did the president reply in the affirmative, he said he had thanked DeSantis for doing “a great job.”\n\nThen on Wednesday, Biden was asked directly if DeSantis should be taking Harris’ calls.\n\n“All I can tell you is I’ve talked to Gov. DeSantis,” he replied. \n\n“He’s been very gracious, he’s thanked me for all we’ve done, he knows what we’re doing, and I think that’s important.”\n\nIn a career full of indignities, this humiliation should leave even as cynical a creature as Harris reeling.\n\nFaced with a question about the Harris-DeSantis spat, the president explicitly sided with the Republican.\n\nEven Biden can’t deny that his veep is a crude opportunist — one who once came within inches of accusing him of racial animus during the 2020 Democratic primaries — in the wake of this disgraceful episode.\n\nIt has been theorized that Biden is deliberately undermining Harris as revenge for his ouster from the Democratic ticket earlier this year.\n\nAnd reports have indicated that there is tension between the pair’s camps as Harris balances her dueling interests in remaining loyal to Biden and enumerating her differences with him.\n\nBut Biden wouldn’t set out to sabotage his right hand.\n\nIf she loses, Biden will be castigated as the bumbling fool whose presidency was so great a failure that he handed the White House back over to Trump.\n\nIf she wins, at least the Democrats will rewrite history to remember him as a selfless elder statesman who gave up power to beat the Donald.\n\nNo, the truth is much more incriminating.\n\nIt’s not that Biden wants to blow up Harris’ campaign, it’s that he can’t possibly abide her self-centered tantrum.\n\nDespite her attempted rebrand as an amiable consensus-builder, Harris has none of those attributes.\n\nFor her, everything — including 170-mile-per-hour winds and deadly floods ripping through the southeast — is about her, and how she can use it to her political advantage.\n\nThat’s why she’s so angry that DeSantis has spent no energy feeding her ego, and has even gone so far as to manufacture a feud about it.\n\nIt’s seemingly her belief that the governor hasn’t paid her ample attention as he tends to the needs of his state’s beleaguered citizens.\n\nDeSantis prioritized them over her, and she had the gall to characterize that as some kind of scandal.\n\nThat doesn’t pass the smell test — not even for Joe Biden.\n\nFor his part, the president still wants Harris to succeed him, but he’s just not willing to indulge her smears or delusions of grandeur to help her do it — at least not right now.\n\nSo it isn’t that Biden is trying to rebuke Harris. It’s that her behavior is so unbecoming that his more professional — and truthful — approach can only come across as a rebuke.\n\nIsaac Schorr is a staff writer at Mediaite.","summary":"Biden can’t deny that his veep is a crude opportunist in the wake of this disgraceful episode.","url":"https://nypost.com/2024/10/10/opinion/even-joe-biden-cant-stomach-harris-pique-in-hurricane-spat/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/bhuhuh.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-10 23:20:26","author":"Isaac Schorr","authors":["Isaac Schorr"],"language":"en","category":"politics","source_country":"us","sentiment":-0.224},{"id":259258796,"title":"Harris aims to revive Obama-era enthusiasm while campaigning in Pennsylvania","text":"SCRANTON, Pa. — Sixteen years ago, Barack Obama made history by becoming the first Black president. Now Vice President Kamala Harris is enlisting him in her quest to make history and become the first female and first Indian American president.\n\nObama is set to host a rally Thursday in Pittsburgh, a crucial part of this battleground state that he carried twice and may decide whether Harris or Donald Trump wins the presidency.\n\nObama and Harris aides see a connection between what fueled his victories and the vice president’s theory of how to win: supercharge base turnout, max out with Black voters and “lose by less” in the vast rural areas where the margins can be make-or-break.\n\n“They both effectively seized the mantle of change, not just through messaging but through an authentically fresh energy and mentality. That resonates with people in a personal way,” said Jesse Lee, a political consultant who worked in the Obama and Biden White Houses. “Just like Obama, the more she stays authentic and makes it joyous to be on her side — both in the campaign and as president — the more successful she’ll be.”\n\nLee said Obama and Harris both have middle-class roots and faced wealthy Republicans — Obama defeated Mitt Romney by winning the battle of who voters believed cared more about regular people like them, which he said Harris is on her way to replicating.\n\n“A key element of both coalitions was the segment of people that were tempted by the ‘businessman’ but ultimately sided with the candidate who was looking out for people like them,” he said.\n\nPaulette Aniskoff, senior adviser for Harris in Pennsylvania and a former Obama aide, told NBC News that she sees “similarities” between her current and former boss. That begins with a heavy focus by Harris on ground game and door-knocking, which was the “core of the sort of Obama organizing method.”\n\nShe said Obama and Harris share a philosophy of “showing up everywhere” and listening to voters, including in hostile terrain. But she declined to lay out specific targets of how well Harris must do in the cities, suburbs or small towns.\n\n“The puzzle is how to make sure that we get enough votes out of everywhere, including the red counties. We can’t just run up the score in Philadelphia. That’s the old style of organizing — to just go into cities and mobilize,” Aniskoff said. “And when we’re talking about these really small margins that campaigns often come down to, that is how you win.”\n\nEric Schultz, an Obama White House aide who continues to advise him, said that while “no two campaigns are the same,” as times have changed, “there are some parallels.”\n\n“What she has built feels larger than an electoral campaign and more like a movement that represents big ideas like freedom,” Schultz said. “She’s generated a level of excitement that has people rallying around her because of what her election may mean about who we are as a country. Her campaign has been smart and ambitious in using technology to reach young audiences and mobilize supporters.”\n\nHarris’ Black voter puzzle\n\nCentral to Harris’ hopes is to dominate among Black voters and defuse Trump’s bid to make modest gains with younger Black men.\n\nFormer Obama pollster Cornell Belcher said there is “no actual evidence” that a high number of Black men are drifting to Trump in this election. In fact, he said, there has been a “phenomenal” rise in Black voter motivation to turn out since Harris replaced President Joe Biden on the ticket.\n\nDuring the Obama era, the number of Black men voting for Democrats went up but then went right back down after he left office. “She’s got to earn the vote of Black men just like any other group,” Belcher said.\n\nTrump and the Republican Party have made “an unprecedented lean in and targeting of African American men,” Belcher said. “Is it smart from a strategic standpoint? Yes, it’s absolutely smart on their side.”\n\nBut, he said, recent polling shows a shift among Black voters in the last month and a half toward Harris’ campaign. “Their motivation-to-vote numbers broadly, and especially in the battleground states, they’ve improved. … She has an opportunity, both in turnout and performance, to see an Obama-like performance by her,” Belcher said.\n\nThat’s a priority for Quentin James, founder and president of the Collective PAC, which launched a $4 million effort primarily aimed at engaging and mobilizing Black male voters for Harris in key battleground states.\n\n“We want to make sure that Black men are showing up to vote in numbers that we haven’t seen since Obama. We think both the threat to democracy as well as the opportunity to provide an amazing future for our kids and our families is at stake,” James said. “And we can’t, obviously, just continue to be frustrated and opt out of the system. We actually have to show up and change the system at the ballot box. So victory and success for us will be record numbers of Black men showing up to vote in November.”\n\nHe said there has been an Obama-like energy with Harris.\n\n“Whether it be fundraising, whether it be the rally sizes, this feels like the Obama days all over again,” he said. “And it’s an important moment to shut down and stop the MAGA movement.”\n\nTrump changes the equation for Harris\n\nRallying a raucous crowd here Wednesday, Trump went after Obama and took care to emphasize his middle name, as he often does, a move critics decry as a racist dog whistle.\n\n“Barack Hussein Obama. Has anyone ever heard of Barack Hussein Obama?” Trump said as the Scranton crowd lit up with boos.\n\nTrump’s candidacy highlights a major difference between the Obama and Harris coalitions. Obama kept the Democratic margins of defeat down in the red rural areas before Trump ran them up sharply with a right-wing populist appeal. But while Obama struggled in the suburbs and among well-educated white voters, many of those voters have soured on the GOP in large part because of Trump’s inflammatory style and anti-democratic tendencies, giving Harris an opportunity.\n\nDemocratic pollster Anna Greenberg cautioned against thinking anybody can replicate Obama’s performances in 2008 and 2012, especially in rural areas and small towns where the bottom has fallen out for Democrats since he left the scene.\n\n“Obama was a phenomenon in ’08,” Greenberg said. “But Hillary Clinton did terribly,” she added, suggesting that a reasonable target for Harris in rural America is somewhere between those two.\n\nJames, the Collective PAC founder, said Obama’s legacy is also at stake this year as he works to help Harris replicate that element of the coalition he built in 2008.\n\n“This is also a bigger political moment where his legacy is at stake, honestly,” he said. “There’s a question of whether his elections were flukes.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nSCRANTON, Pa. — Sixteen years ago, Barack Obama made history by becoming&#8230;\n\n\nThis Post: Harris aims to revive Obama-era enthusiasm while campaigning in Pennsylvania first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/harris-aims-to-revive-obama-era-enthusiasm-while-campaigning-in-pennsylvania/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-10/241007-kamala-harris-barack-obama-2-up-split-3x2-ac-1151p-3ff6fb.jpg","video":null,"publish_date":"2024-10-10 23:15:14","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.503},{"id":259260606,"title":"Obama’s first Harris rally aims at young Pennsylvania voters","text":"PITTSBURGH >> Former President Barack Obama will make his case for Vice President Kamala Harris today during a rally at a Pittsburgh college campus, as Democrats seek to spur young people to vote in the Nov. 5 election.\n\nObama has been a vocal supporter of Harris since she ascended to the top of the Democratic ticket after President Joe Biden stepped aside in July following a poor debate performance against Republican former President Donald Trump.\n\nObama, whose White House term ended in 2017, is still popular with his party’s base. His rally at the University of Pittsburgh, which he will headline while Harris campaigns in Nevada and Arizona, is the first of several events he plans to do in battleground states across the country in the coming weeks.\n\nObama is not the only former president the Harris campaign plans to deploy.\n\nBill Clinton, a two-term Democratic president and former Arkansas governor, will make stops in Georgia on Sunday and Monday before traveling to North Carolina for a bus tour later in the week in an effort to reach rural voters.\n\nIn remarks slated to begin around 7:15 pm ET (1:15 p.m. Hawaii time), Obama will say Harris and Minnesota Governor Tim Walz, her running mate, are uniquely positioned to lead the United States at this moment, according to his adviser Eric Schultz.\n\n“He’ll also talk about the enormous stakes and the risks involved in returning President Trump into office,” Schultz said.\n\nYouth are a critical part of the coalition that the Harris campaign hopes will propel her to victory. But voter registration among young people in 34 states is down compared with four years ago, according to data updated in September from the Center for Information & Research on Civic Learning and Engagement at Tufts University.\n\nThe number of people between the ages of 18 and 29 who are registered to vote in Pennsylvania in September was 15 percent lower than it was on Election Day in 2020, the center’s data showed.\n\nObama’s engagement could help get young people motivated in the campaign’s final stretch. The former president has sought to serve as a closer for Democratic candidates before, with events for Hillary Clinton in 2016 and for Biden in 2020, especially at the end of the election cycle when early voting had begun, as it has now.\n\nObama is focused on voters who can put the White House, the House of Representatives and the Senate in Democratic hands, another aide said. The former president has helped raise $80 million for the 2024 presidential campaign.\n\nObama and his wife Michelle gave rousing speeches in support of Harris at the Democratic National Convention in August; the former first lady is expected to campaign further for Harris as well.\n\nHarris was an early supporter of Barack Obama’s own 2008 presidential bid, and he has helped her behind the scenes as the party’s 2024 standard-bearer, encouraging her to tap talent to bolster her campaign, which she did.\n\nThe former president is viewed by some as having helped usher Biden out of the race after Democrats’ worries about the 81-year-old leader’s age and abilities skyrocketed after his June debate against Trump.\n\nHarris and Trump remain in a close race, and winning Pennsylvania could be key to winning the White House.","summary":"PITTSBURGH >> Former President Barack Obama will make his case for Vice President Kamala Harris today during a rally at a Pittsburgh college campus, as Democrats seek to spur young people to vote in the Nov. 5 election.","url":"https://www.staradvertiser.com/2024/10/10/breaking-news/obamas-first-harris-rally-aims-at-young-pennsylvania-voters/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241010_brk_oba01.jpg","video":null,"publish_date":"2024-10-10 23:15:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":0.101},{"id":259257682,"title":"Harris ramps up outreach to Latino voters in last weeks of 2024 race","text":"Harris ramps up outreach to Latino voters in last weeks of 2024 race\n Vice President Kamala Harris is setting her sights on the Southwest, participating in a Univision town hall in Las Vegas and holding a rally outside Phoenix, Arizona, on Thursday. The race is extremely tight in both of those battleground states. CBS News senior White House correspondent Weijia Jiang is following Harris in the Grand Canyon State.","summary":"Vice President Kamala Harris is setting her sights on the Southwest, participating in a Univision town hall in Las Vegas and holding a rally outside Phoenix, Arizona, on Thursday. The race is extremely tight in both of those battleground states. CBS News senior White House correspondent Weijia Jiang is following Harris in the Grand Canyon State.","url":"https://www.cbsnews.com/video/harris-ramps-up-outreach-to-latino-voters-in-last-weeks-of-2024-race/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/10/505878cd-c354-4d3e-9d1c-661e53437502/thumbnail/1200x630/880dbe3686f4660b3522c0b48f8eca15/harris.jpg?v=29b5ccc4d237d9b284ce95a42effd073","video":null,"publish_date":"2024-10-10 23:10:00","author":null,"language":"en","source_country":"US","sentiment":0.169},{"id":259258850,"title":"'Get a life, man': Biden fires back at Trump over hurricane misinformation","text":"President Joe Biden on Thursday told Republican presidential candidate Donald Trump to \"get a life\" after the latter accused him and vice president Kamala Harris of responding slowly and ineffectively to the hurricanes. Biden also said that the federal government is working swiftly to support those affected by Hurricane Milton.Biden had accused Trump of spreading misinformation about the federal hurricane response during a press briefing on Wednesday. When asked if he had communicated with Trump after his statement at the White House, Biden responded, “Are you kidding me?” He then addressed Trump directly, saying, “Mr President Trump — former President Trump — get a life, man. Help these people.”The federal government is actively countering misinformation, which started circulating after Hurricane Helene last month and has continued with Hurricane Milton this week. When asked again if he intended to speak with Trump, Biden firmly said, “No.”— calebparke (@calebparke) The president praised Florida residents for adhering to evacuation orders, stating that their actions helped save lives. However, he noted it’s still too early to assess the full damage from Hurricane Milton. “It’s too early to know the full account of the damage,” Biden said. “But we know lifesaving measures did make a difference.”Biden warned that “very dangerous conditions” still exist in the state and urged residents to follow local authorities' directives. He assured that federal support will continue for as long as needed. “Vice President Harris and I have been in constant contact with state and local officials,” he said. “We’re offering everything they need.”— JoeBiden (@JoeBiden) Biden also stressed that the public would hold Trump accountable for making false claims about FEMA's capacity to assist storm victims. He mentioned speaking with Florida’s Republican governor Ron DeSantis, who confirmed their collaboration, saying, “I spoke with the president this morning…He said he wants to be helpful.”— atrupar (@atrupar) “Those who spread such lies are undermining confidence in the rescue and recovery efforts,” Biden said. “These lies are harmful to those who most need help. Lives are on the line, and people are in desperate situations — have the decency to tell them the truth.”Trump has heavily criticised Biden and Harris, calling their efforts “the worst response to a storm or hurricane disaster in US history.” At a campaign rally, Trump accused Harris of mismanaging the storm response in North Carolina and claimed that FEMA diverted funds to undocumented immigrants.— recpark5306 (@recpark5306) Hurricane Milton left millions in Florida without power, while cleanup from Hurricane Helene continues across the Southeast.With less than four weeks until Election Day, Harris and Trump face a close race to succeed Biden, and disaster relief is a critical issue in key battleground states.","summary":"President Biden rebukes former President Trump, urging him to prioritize aiding hurricane victims after allegations of a slow federal response. Biden highlights ongoing federal support and denounces misinformation. He praises Floridians for following evacuation orders and warns of remaining dangers post-Hurricane Milton.","url":"https://timesofindia.indiatimes.com/world/us/get-a-life-man-biden-fires-back-at-trump-over-hurricane-misinformation/articleshow/114130576.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-114133007/114133007.jpg","video":null,"publish_date":"2024-10-10 23:09:51","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.457},{"id":259257544,"title":"Rallies, fact-checks and chaos","text":"NEW YORK (AP) – Nearly a decade into the Trump Era of politics in the United States (US), less than a month from his third Election Day as the Republican candidate for president and there is still remarkably little consensus within the media about how best to cover Donald Trump.\n\nAre reporters “sanewashing” Trump, or are they succumbing to the “banality of crazy?”\n\nShould his rallies be aired at length, or not at all? To fact-check or not fact-check?\n\n“If it wasn’t so serious, I would just be fascinated by all of it,” said Parker Molloy, media critic and author of The Present Age column on Substack. “If it didn’t have to do with who is going to be president, I would watch this and marvel at how difficult it is to cover one person who seems to challenge all of the rules of journalism.”\n\nBooks and studies will be written about Trump and the press long after he is gone. He’s always been press-conscious and press-savvy, even as a celebrity builder in Manhattan who took a keen interest in what tabloid gossip columns said about him.\n\nMost issues stem from Trump’s disdain for constraints, his willingness to say the outrageous and provably untrue, and for his fans to believe him instead of those reporting on him.\n\nIt has even come full circle, where some experts now think the best way to cover him is to give people a greater opportunity to hear what he said – the opposite of what was once conventional wisdom.\n\n‘Sanewashing’ creates an alternative narrative, some say.\n\nMolloy first used the phrase “sanewashing” this fall to describe a tendency among journalists to launder some of Trump’s wilder or barely coherent statements to make them seem like the cogent pronouncements of a typical politician.\n\nOne example she cited: CNN distilling a Trump post on Truth Social that rambled on about the “radical left” and “fake news” into a straight news lead about the former president agreeing to debate his Democratic opponent, Vice President Kamala Harris.\n\nAt its best, polishing Trump creates an alternative narrative, she said. At its worst, it’s misinformation.\n\nDuring a Wisconsin rally the last weekend of September, Trump talked of danger from criminals allowed in the country illegally.\n\n“They will walk into your kitchen, they’ll cut your throat,” he said. The New Republic writer Michael Tomasky was surprised not to find the quote in The New York Times’ and Washington Post’s coverage, although The Times noted that Trump vilified undocumented immigrants, and there were other media references to what Trump himself called a dark speech.\n\n“Trump constantly saying extreme, racist violent stuff can’t always be new,” Tomasky wrote.\n\n“But it is always reality. Is the press justified in ignoring reality just because it isn’t new?”\n\nOne likely reason the remark didn’t get that much attention is because Trump – at the same rally – referred to Harris without evidence as “mentally disabled.”\n\nThat comment merited quick mention on the ABC and CBS evening newscasts the next day, in the context of criticism from two fellow Republicans, and after stories about Hurricane Helene’s devastation and war in the Middle East.\n\nNBC’s Nightly News didn’t bring it up at all.\n\nIn other words, Trump said something wild. What’s new? More than sanewashing, political scientist Brian Klaas calls that the banality of crazy, where journalists become accustomed to things Trump says that would be shocking coming from other candidates simply because they’re numbed to it.\n\nIT’S A HARD FIT FOR A DAILY NEWS CYCLE\n\nIlluminating reporting on Trump rarely fits the model of quick news stories that sum up daily developments.\n\n“This really serves the small group of news consumers that we would call news junkies, who follow the campaign day to day,” said Kelly McBride, senior vice president of the Poynter Institute, a journalism think tank. “But it doesn’t help people decide how to vote, or understand the candidate better.”\n\nTrump critics often complain about how the nation’s leading news outlets cover him. But they sometimes overlook attempts to bring perspective to issues they’re concerned with.\n\nThe Times, for example, used a computer to compare his speeches now with older ones in a story on Sunday, and similarly had a September 9 examination of questions about Trump’s age and mental capacity.\n\nThe Post has written about how Trump doesn’t mention his father’s Alzheimer’s Disease as he attacks others about mental capacity, and distortions about a cognitive test he took.\n\nThe Associated Press wrote of Trump’s Wisconsin rally that he “shifted from topic to topic so quickly that it was hard to keep track of what he meant at times”.\n\n“Trump is a really difficult figure to cover because he challenges news media processes every day, has for years,” The Times’ Maggie Haberman, one of Trump’s best-known chroniclers, told NPR last month. “The systems… were not built to deal with somebody who says things that are not true as often as he does or speaks as incoherently as he often does. I think the media has actually done a good job showing people who he is, what he says, what he does.”\n\nPress critics may instead be frustrated that the work doesn’t have the impact they seek.\n\n“The people who don’t like or are infuriated by him cannot believe his success and would like the press to somehow persuade the people who do like him that they are wrong,” said Tom Rosenstiel, a journalism professor at the University of Maryland. “And the press can’t do that.” – David Bauder","summary":"","url":"https://borneobulletin.com.bn/rallies-fact-checks-and-chaos/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/10/P24-A_11102024.jpg","video":null,"publish_date":"2024-10-10 23:07:46","author":null,"language":"en","source_country":"bn","sentiment":-0.011},{"id":259257314,"title":"Kamala Harris leans on Dem heavyweights, stages media blitz as polls show her slipping against Trump","text":"Vice President Kamala Harris is hoping famous fellow Democrats and appearances on friendly media outlets will be enough to pull her presidential campaign over the finish line — as a series of polls suggest Republican Donald Trump has the advantage in their race to the White House. \n\nOn Thursday, the same day that former President Barack Obama, 63, held his first rally for Harris in Pittsburgh, Pa., the campaign announced that another former chief executive, Bill Clinton, 78, will make the case for Harris in Georgia and North Carolina.\n\n“The Harris campaign unleashes the Big Dog,” spokesman Ian Sams said in a jubilant tweet that quoted a CNN report about Clinton’s assistance. “Bill Clinton to hit the rural South for Harris this week, stumping in Georgia and eastern North Carolina, ‘going back to a kind of campaigning that he hasn’t done since before he became the “Comeback Kid.”‘”\n\nOn the other side of Pennsylvania, seen by many as the state that will determine whether Trump, 78, or Harris, 59, becomes the 47th president, the Democratic campaign is making a “significant” ad buy on Philadelphia hip-hop and R&B-focused stations in an apparent bid to shore up slipping black support, according to local radio host Dan O’Donnell.\n\nNot inclined to give Pennsylvanians a break, the Harris team also announced she would participate in an Oct. 23 town hall hosted by CNN.\n\nAfter being anointed the Democratic nominee in early August, Harris rode a polling surge to catch and pass Trump both nationally and in battleground states. But with fewer than four weeks to go until the polls close, the picture has darkened for the veep.\n\nThe RealClearPolitics polling average has Trump narrowly leading Harris in five of the seven vital states that will decide the election: Arizona, Georgia, Michigan, North Carolina and Pennsylvania. Of those five, only North Carolina went for Trump in 2020. \n\nWhile Harris is clinging on to her polling average lead in Wisconsin, no survey used by RCP has shown her leading Trump in the Badger State since late September.\n\nMore concerning for the VP, the Wall Street Journal reported Tuesday that an internal poll conducted by Wisconsin Democratic Sen. Tammy Baldwin’s campaign showed Trump in front of Harris by three percentage points, more than triple the Republican’s winning margin in the state (0.77%) over Hillary Clinton in 2016.\n\nThe Trump campaign piled on Thursday by blasting out internal polls of the seven swing states, showing the Republican up five percentage points in Georgia, three points in Arizona and Nevada, and a single point in Michigan, North Carolina, Pennsylvania, and Wisconsin. \n\n“There are lots of Republicans — I say lots — a not insignificant number of Republicans, who say the race is effectively over,” longtime political journalist Mark Halperin said Tuesday on 2WAY’s “Morning Meeting” program.\n\n“[They think] that … Trump is going to lock up the Sun Belt states [Arizona, Georgia, Nevada, North Carolina], probably all four, but at least three, and then he’s going to win Pennsylvania, and that checkmates [Harris]. They may be wrong, but there’s not an insignificant number of them who are quite confident of that.”\n\nHalperin gave a similar diagnosis Thursday, emphasizing that while Harris could still win, “the snapshot of where we are now is, there are a lot of really worried Democrats and there are really no worried Republicans, including at Mar-a-Lago.”\n\nWhile most surveys show Harris winning clear majorities of women and college-educated white voters, her margins among black and Latino voters lag below what President Biden received in 2020, while Trump swamps her among male voters.\n\nA recent poll from the AP-NORC Center for Public Affairs Research also shows that although black registered voters have an overwhelmingly positive view of Harris compared to Trump, they are less sure that she would make a positive change in the country.\n\nHarris allies appear to be feeling the strain, anonymously griping to Axios in a report published Thursday that the Democratic nominee “seems stuck, even sliding a bit” in surveys of voters in the “Blue Wall” states of Michigan, Pennsylvania and Wisconsin — despite out-fundraising Trump and blanketing the airwaves with ads.\n\nRep. Elissa Slotkin (D-Mich.), running for Senate in the Wolverine State, also recently expressed worry about Harris’ standing there.\n\n“I’m not feeling my best right now about where we are on Kamala Harris in a place like Michigan,” Slotkin said in leaked audio of a virtual campaign event with Sen. Cory Booker (D-NJ).\n\n“We have her underwater in our polling,” Slotkin reportedly added.\n\nOne senior Democratic source told The Post that they were “not in a blue wall panic,” but acknowledged they were concerned by the narrow margins between Harris and Trump and suggested the Democrat’s push for a second debate was rooted in the polling slump.\n\n“The debates help her,” stressed the source, who added the campaign wasn’t doing Harris any favors by booking her on friendly, frothy platforms like the “Call Her Daddy” podcast.\n\nDemocratic pollster Brad Bannon told The Post that Harris’ new campaign strategy was designed to ensure “maximum turnout” of core Democratic constituencies, rather than persuading the vanishingly small number of undecided voters. \n\n“Of course they should be worried about voter turnout,” Bannon said. “And they should be doing everything to generate Democratic-based turnout.”\n\n“She’s clearly worried about her campaign,” a Trump adviser said, pointing to the radio ad spending aimed at black male voters and the launch of a new initiative aimed at Hispanic men called “Hombres con Harris.”\n\n“I think she’s playing defense, not offense,” the person added. “That’s pretty clear.”","summary":"Vice President Kamala Harris is hoping famous fellow Democrats and appearances on friendly media outlets will be enough to pull her presidential campaign over the finish line &#8212; as a series of polls suggest Republican Donald Trump has the advantage in their race to the White House. On Thursday, the same day that former President...","url":"https://nypost.com/2024/10/10/us-news/kamala-harris-leans-on-dem-heavyweights-stages-media-blitz-as-polls-show-her-slipping-against-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/91368526.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/uqk7NIre-RyIcpnTz.mp4","publish_date":"2024-10-10 23:07:30","author":"Diana Glebova,Josh Christenson","authors":["Diana Glebova","Josh Christenson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.094},{"id":259257316,"title":"Hypocrite Kamala Harris is using deadly storms for political gain, and it’s gross","text":"Hurricane Milton tore through the west coast of Florida, ripping the roof off Tropicana Field — and doing serious damage to the floundering Kamala Harris campaign.\n\nWith her gale force winds of desperation, the veep has tried so hard to appear presidential by inserting herself into the storm effort this week.\n\nBut she’s come across like a party crasher trying to get into the VIP section of an A-list soiree. A political interloper. A useless limb.\n\nOr, as Florida governor Ron DeSantis said more bluntly this morning on “Squawk Box”: “She has no role in this process.”\n\nStill, Harris worked the phones as Milton blew in, calling in to the Weather Channel and CNN to blast Donald Trump and DeSantis for politicizing the disasters. Oh, the hypocrisy.\n\nLast night she posted to her VP account on X a video conversation with St. Petersburg, Fla., mayor Ken Welch — a shamelessly transparent campaign ad that had all the authenticity of a Canal Street Gucci belt.\n\n“Thank you for just answering the call to lead in the way that you have in a time of crisis,” Harris said. “Folks are looking in your eyes to see something in you that lets them know that everything is going to be OK.” \n\nWelch, who had a lot on his plate, clearly tossed her campaign a bone as he said he appreciated “her partnership.” \n\nSounding like a disinterested customer service agent reading a script, a performative Harris offered Welch this inanity as his city was threatened by 100-mph winds and more than 18 inches of rain: “Know that you are invited to give any feedback about what you might need in real time because you’re the leadership on the ground, so you know what your folks need.”\n\nThis Harris clean-up effort all kicked off Monday, when it was reported that DeSantis, who was dealing with both the aftermath of Helene and the incoming Milton, ignored her call. \n\nAsked directly about the reported snub, Harris dug in. \n\n“Playing political games at this moment in these crisis situations — these are the height of emergency situations — is just utterly irresponsible and it is selfish, and it is about political gamesmanship,” said the candidate, who was already facing backlash for finally breaking her media fast and traveling to New York as parts of the country were battered and without power.\n\nAn exasperated DeSantis, who has a proven reputation for stellar hurricane preparedness and recovery, said he had no clue the VP even called. \n\n“I’ve been dealing with these storms in Florida under both Trump and Biden. Neither of them ever politicized it,” he told CNBC.\n\nOn “The View,” the “brat” candidate doubled down, saying that she spoke to governors from both parties and “Obviously this is not an issue that is about partisanship or politics for certain leaders, but maybe is for others.”\n\nThen she called CNN and accused Trump of spreading “disinformation” about FEMA in the aftermath of town-destroying Hurricane Helene.\n\n“We all know it’s dangerous, and the gamesmanship has to stop. At some point the politics has to end, especially in a moment of crisis,” Harris told Dana Bash.\n\nIt’s like she’s been unburdened of her self-awareness.\n\nOn to the Weather Channel, where Harris spoke with meteorologist Mike Bettes who asked her about DeSantis. Harris said it wasn’t a time to point fingers, then did just that. \n\n“Anybody who considers themselves to be a leader should really be in the business right now of giving people a sense of confidence that we’re all working together and that we have the resources and the ability to work together on their behalf,” she said.\n\nThe network noted that Trump had also been offered an interview but did not respond. (Eric Trump tweeted that his family housed over 275 power linemen at their Trump Doral property in Miami, so perhaps there were other tasks at hand.)\n\nEven more jarring, Joe Biden seems to gleefully be leaving Harris out in the cold — reiterating how DeSantis was “cooperative” and “doing a great job.” Is this part of bitter Biden’s revenge since being shivved in the back by his party?\n\nWhen a reporter asked the president if DeSantis should take Harris’ call, Biden dodged the question.\n\n“All I can tell you is I’ve talked to Gov. DeSantis. He’s been very gracious. He’s thanked me for all we’ve done. He knows what we’re doing. And I think that’s important.”\n\nBut Harris is right. A natural disaster is about the safety of Americans — and not a time to wade into politics. It’s a shame she spent the last few days doing it.","summary":"Hurricane Milton tore through the west coast of Florida, ripping the roof off Tropicana Field — and doing serious damage to the floundering Kamala Harris campaign.","url":"https://nypost.com/2024/10/10/opinion/hypocrite-kamala-harris-using-deadly-storms-for-political-gain/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/kamala-weather-2.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-10 23:05:54","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","category":"politics","source_country":"us","sentiment":-0.226},{"id":259257566,"title":"Univision Town Hall: Kamala Harris FREE stream | Watch today","text":"The Univision Town Hall: Kamala Harris airs today, Thursday, Oct. 10, at 10 p.m. Eastern on Univision.\n\nIf you are a cable cord cutter and want to watch Harris speak, you can do so with a free trial on FuboTV or DirecTV Stream. Sling offers half off your first month.\n\nThe town hall will take place in Las Vegas. The purpose of the town hall with Harris is to give undecided Hispanic voters a chance to ask questions to Harris, Univision says. \n\nA town hall will also be held for former President Donald Trump on Oct. 16 in Miami.\n\nThe town hall will last one hour, with three commercial breaks. The format of the town hall is to give a diverse group of undecided Hispanic voters to bring their questions directly to Harris.\n\nEnrique Acevedo, host of Televisa’s “En Punto,” will moderate the town hall.\n\nMore information on streaming service options available to watch Kamala Harris’ town hall:\n\nFuboTV has a library of TV shows, live sports events and more. Right now, it’s offering $20 off your first month on top of the free trial. It offers cloud DVR and calls itself the world’s only sports-focused live TV streaming service. The service also has live news and entertainment channels. You can get the Pro plan for $79.99; the Elite plan for $89.99; the Premier plan for $99.99; or the Latino plan for $32.99.\n\nDirecTV Stream offers three packages after you’ve tried out the free trial: Entertainment for $84.99; Choice for $98.99; and Ultimate for $109.99. It is a no-term commitment service where you can enjoy live TV and on-demand local and national channels without having to commit to a contract.\n\nSling offers a 7-day free trial when signing up for Latino channels. After the free trial it is $10 a month to stream. Watch Univision and Telemundo for free, with the new Sling Latino and add 85 channels included in the plan.\n\nKaylee Remington is the shopping and entertainment commerce reporter and metro reporter for cleveland.com and The Plain Dealer. Read her work online.","summary":"Find out how you can watch Univision Town Hall: Kamala Harris for free today if you do not have cable.","url":"https://www.cleveland.com/tv/2024/10/univision-town-hall-kamala-harris-free-stream-watch-today.html","image":"https://www.cleveland.com/resizer/v2/DLOBQLK7JJDY5NEIGRV77NUIJA.jpg?auth=dbbabaca7882916974d8acd87cdd446fd099636efeab606dc0494dcc164c7285&width=1280&quality=90","video":null,"publish_date":"2024-10-10 23:04:00","author":"Kaylee Remington","authors":["Kaylee Remington"],"language":"en","source_country":"US","sentiment":0.371},{"id":259257068,"title":"Ex-CBS staffers call for outside probe of ‘60 Minutes’ interview with Kamala Harris amid editing scandal","text":"Former CBS News staffers are demanding an independent investigation into “60 Minutes” over the brewing Kamala Harris interview scandal — even as the network stubbornly digs in its heels and refuses to release the full, unedited transcript, The Post has learned.\n\nThe long-running news show has come under fire after allegedly cleaning up the Democratic presidential candidate’s answer to a question from “60 Minutes” correspondent Bill Whitaker about Israel that aired during a special episode on Monday.\n\nHer reply was starkly different from the “word salad” the vice president served up in a clip to promote the interview shown by “Face the Nation” the day before.\n\nThe controversy has prompted media insiders and critics — including Republican presidential nominee Donald Trump — to question the ethical standards at the Tiffany Network. “I think there should be an outside investigation,” one former CBS News journalist told The Post on Thursday. “Obviously, there’s a problem here. If they care about journalistic integrity, they would conduct an investigation or release the full transcript.”\n\nA second CBS source said the discrepancy in the answers makes it seem that the network’s flagship show is “biased.”\n\n“Their credibility has been called into question and their impartiality has been called into question,” the source said. “Don’t you need a full-throated review of what went wrong?”\n\nOn Thursday, CBS again declined multiple requests from The Post to release the full transcript. \n\nThe network did not comment on whether it planned on launching a probe into the matter. \n\nHowever, CBS has a history of both releasing full transcripts of its news programs and launching probes. \n\nIn 2013, the network investigated a “60 Minutes” segment by correspondent Lara Logan about a terror attack on the US compound in Benghazi that left Ambassador Chris Stevens and three other Americans dead. \n\nThe probe, led by then-executive director of standards and practices Al Ortiz, discredited the reporting, finding it “deficient in several respects.” Logan and her producer were asked to take a leave of absence. \n\nTwo sources suggested CBS tap Ortiz, who retired in 2012 after 43 years at the network, to conduct an outside review of the Harris interview. \n\nOrtiz did not respond to requests for comment. \n\nCBS also has released full transcripts in the past. It published Catherine Herridge’s 2020 interview with Trump, as well as Jan Crawford’s 2019 interview with then-Attorney General Bill Barr. \n\nEarlier this year, “60 Minutes” provided Bloomberg News with a full transcript of its interview with Federal Reserve Chair Jerome Powell.\n\nReleasing a full transcript would provide clarity about where Harris’ answer came from — but it also may raise more questions about “60 Minutes'” impartiality. \n\nOther networks also publish full transcripts of high-profile interviews that are unedited, such as ABC News’ interview with President Biden in July and CNN’s sit-down with Harris and her running mate Tim Waltz in August.\n\nAt issue for CBS are two clips that have circulated on social media side-by-side showing a discrepancy in Harris’ answers to the same question. \n\nIn the “Face the Nation” clip, a wide shot reveals Whitaker asking Harris about Israel Prime Minister Benjamin Netanyahu: \n\n“But it seems that Prime Minister Netanyahu is not listening,” he says.\n\nHarris replies: “Well, Bill, the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by or a result of many things, including our advocacy for what needs to happen in the region.”\n\nOn “60 Minutes,” the camera is zoomed in on Whitaker, who asks the same question. \n\n“We are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.”\n\nA network insider said it is the same shot of Whitaker just a tighter focus on the correspondent’s face. \n\nThe insider did not know why “60 Minutes” aired a tight shot of Whitaker. \n\n“Why is the answer to the same question so different?” the former CBS News staffer asked. “This needs to be answered. Was this answer the continuation of a longer answer or was it an answer that came much later in the interview.”\n\nFormer CBS journalists said it is possible that there was a miscommunication between the show and the department that edits promotions as “60 Minutes” was still editing the show when the promo went out. \n\nIn a best-case scenario, Harris’ answer to “60 Minutes” may have come shortly after the wordy answer she gave in the “Face the Nation” clip. \n\nThey said if her answer was part of an extended answer to the same question then no journalistic malpractice was committed.\n\nBut if the answer came from another question about Israel and was made to look like an answer to Whitaker’s question, then it’s ethically problematic.\n\n“’60 Minutes’ holds itself to the highest journalistic standards,” the former CBS staffer said. “Releasing the transcript would answer everyone’s questions and it would allow them to stand behind the integrity of the story they broadcast.”\n\n“The stakes are too high. It’s a presidential election. Trump is asking for the transcript and journalists are asking for answers,” the source concluded.\n\nThe discrepancy in the clips has caused the Internet to spin theories that “60 Minutes” took an answer from another part of the interview and doctored it to look like an answer to Whitaker’s question in order for the Harris to look better. \n\nIt is also unclear if Harris was allowed to answer the same question in another take.\n\nSources close to the network have said the interview was edited for time constraints and clarity but that still doesn’t answer the larger question of where Harris’ response came from and why was it edited that way. \n\nThe source added that “Face The Nation” had a longer version of the exchange on “60 Minutes” and that it was a “normal edit.”\n\n“It is normal practice for every television broadcast to edit for time,” offered a television news insider. “There is no deceit.”\n\nThe Harris campaign distanced itself from CBS’ edit snafu on Wednesday evening amid speculation from sources that their may have been pressure from the vice president’s team to run a more succinct, stronger answer. \n\n“We do not control CBS’s production decisions and refer questions to CBS,” an aide for the Harris campaign told Variety. \n\nIn recent days, Trump accused CBS of “election interference,” posting on Truth Social Tuesday : “A giant Fake News Scam by CBS & 60 Minutes. Her REAL ANSWER WAS CRAZY OR DUMB, so they actually REPLACED it with another answer in order to save her or, at least, make her look better.”\n\nHe continued: “A FAKE NEWS SCAM, which is totally illegal. TAKE AWAY THE CBS LICENSE. Election Interference.”\n\nOn Thursday, Federal Communications Commission chair Jessica Rosenworcel pushed back on Trump’s attacks on the broadcast station. She called his demand to strip CBS of its license “threats against free speech” that “should not be ignored.”","summary":"The long-running news show has come under fire after allegedly cleaning up the Democratic presidential candidate's answer to a question from \"60 Minutes\" correspondent Bill Whitaker about Israel that aired during a special episode on Monday.","url":"https://nypost.com/2024/10/10/media/ex-cbs-staffers-call-for-outside-probe-of-60-minutes-interview-with-kamala-harris-amid-editing-scandal/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/60-minutes-election-special-bill-91375865.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/ttPJwcT2-RyIcpnTz.mp4","publish_date":"2024-10-10 23:03:16","author":"Alexandra Steigrad","authors":["Alexandra Steigrad"],"language":"en","source_country":"us","sentiment":-0.263},{"id":259257616,"title":"Donald Trump doubles down on China carmakers being unwelcome in US market","text":"Republican presidential candidate Donald Trump on Thursday said he would take steps to prevent Chinese carmakers from selling vehicles in the US as part of his plan to save the American auto industry.\n“They’re going to pay a 100 per cent or maybe even a 200 per cent tariff because we’re not going to let them come into our country and destroy what’s left of our auto industry”, Trump said, addressing the Detroit Economic Club in the manufacturing state of Michigan.\nTrump was referring to Chinese cars potentially being made in Mexico and shipped stateside tax-free under the United States–Mexico–Canada Agreement (USMCA).\nChinese auto companies have been rumoured to be scouting for production facilities in Mexico, although major mainland electric-vehicle maker BYD said it would pause such plans until after America’s presidential election in November.\nTrump on Thursday said he would formally notify Canada and Mexico of his intention to renegotiate the USMCA – currently slated for review in 2026 – to address concerns about Chinese vehicles.\n\nThe former president also proposed making interest on car loans fully tax-deductible, saying this would “stimulate massive domestic auto production” and “make car ownership dramatically more affordable” for millions of Americans.\nIn addition, Trump reiterated his invitation to foreign companies to manufacture products in the US, touting his “Made-in-America” plan to lower the corporate tax rate from 21 to 15 per cent.\n“US-based car makers and manufacturers will also be rewarded with expanded research and development tax credits, very substantial, where they will be able to write off 100 per cent of their cost of heavy machinery and other equipment necessary to build a plant in the first year, and full expensing for manufacturing investments,” he said.\nPreviously, Trump said he would welcome Chinese carmakers to build plants in the US if they used American workers.\n“We’re going to give anybody that comes in free access to the best and biggest market anywhere on the planet,” he said on Thursday, without excluding China.\nTrump’s pledges on Thursday reflect the intensifying battle for crucial electoral college votes in the US Midwest.\nDuring a September speech in Pittsburgh, Pennsylvania, another swing state, US Vice-President Kamala Harris, the Democratic presidential candidate, proposed her own tax incentives aimed at bolstering advanced manufacturing. Harris has also said she would invoke the USMCA’s renegotiation provision.\n\nRecent polls show the two are locked in a tight race, with the outcome likely to be decided by narrow margins in battleground states like Michigan and Pennsylvania.\nIn a speech largely focused on economics, Trump in Detroit blasted what he called the “twin disasters” of China joining the World Trade Organization and the launch of the North American Free Trade Agreement, a free-trade deal that preceded the USMCA.\nHe also touted his pulling out of the Trans-Pacific Partnership in his first week in office as president; slapping tariffs on Chinese cars and steel; and negotiating the phase-one trade deal with Beijing.\nTrump’s presidency ushered in a bilateral trade war that led to tariffs imposed on hundreds of billions’ worth of mainland goods. The Biden administration has kept much of the former president’s tariffs.\nAnd last month, US President Joe Biden proposed prohibiting key Chinese hardware and software in vehicles with internet connectivity from being used on American roads, citing national-security concerns.\nThe move effectively bars mainland cars and trucks from the US market.\nSeparately, Biden also unveiled new 100 per cent tariffs on all Chinese EVs that came into effect last month.","summary":"‘They’re going to pay a 100 per cent or maybe even a 200 per cent tariff,’ former president declares in battleground state of Michigan.","url":"https://www.scmp.com/news/china/politics/article/3281934/donald-trump-doubles-down-china-carmakers-being-unwelcome-us-market","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/10/11/b7e21688-ed02-4556-adbe-ef83d04a1c84_2a81aa6e.jpg","video":null,"publish_date":"2024-10-10 22:59:08","author":"Bochen Han","authors":["Bochen Han"],"language":"en","category":"politics","source_country":"cn","sentiment":0.165},{"id":259257978,"title":"Whoopi Goldberg Strikes Back at Donald Trump: ‘How Dumb Are You?’","text":"Whoopi Goldberg and her View co-host Sunny Hostin fired back at Donald Trump, a day after the former president railed against them during Pennsylvania rallies for interviewing Vice President Kamala Harris.\n\n Speaking at his rally Wednesday, Trump had called Goldberg “filthy, dirty, disgusting,” which the comedian embraced in her response Thursday. “I was filthy and stand on that fact. I have always been filthy,” Goldberg said, according to The Associated Press. “And you knew that when you hired me. How dumb are you?”\n\n Goldberg also called out Trump’s infamous vulgar 2005 comments he’d made to Billy Bush in leaked Access Hollywood footage. “You know how dirty I wasn’t? I never grabbed anybody by their genitalia,” she said.\n\n Meanwhile, Trump also called Hostin a “dumb woman.” \n\n “Donald Trump, I want to thank you for personally telling so many lies and committing so many alleged crimes and providing us with material on a daily basis,” Hostin said Thursday. “You help us do our jobs and I’m so appreciative.”\n\n The comments about Goldberg and Hostin were part of a long line of unhinged statements Trump made during his back-to-back rallies in Pennsylvania on Wednesday. Angered that Howard Stern also interviewed Harris, Trump said that he “dropped [Stern] like a Dog.”\n\n Stern, meanwhile, said this week that he would be voting for Harris. The radio host and the vice president bashed Trump for pulling out of his interview with 60 Minutes. “I mean, it just says so much. He didn’t want to be fact-checked. This is maddening,” Stern said. “This is insanity. What do you mean you don’t want to be fact-checked?”","summary":"Goldberg and fellow View co-host Sunny Hostin responded a day after Trump insulted them during a rally in Pennsylvania","url":"https://www.rollingstone.com/tv-movies/tv-movie-news/whoopi-goldberg-sunny-hostin-respond-donald-trump-insults-1235131934/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/whoopi-trump.jpg","video":null,"publish_date":"2024-10-10 22:55:29","author":"Ethan Millman","authors":["Ethan Millman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.526},{"id":259257192,"title":"Obama hits campaign trail to stump for Harris","text":"Obama hits campaign trail to stump for Harris\n Former President Barack Obama is set to rally for Vice President Kamala Harris in Pittsburgh, Pennsylvania, Thursday night as he starts a multi-state swing for her. CBS News chief election and campaign correspondent Robert Costa reports. Then, Jasmine Wright, politics reporter for NOTUS, and Tom LoBianco, national politics reporter for 24sight News, join with analysis.","summary":"Former President Barack Obama is set to rally for Vice President Kamala Harris in Pittsburgh, Pennsylvania, Thursday night as he starts a multi-state swing for her. CBS News chief election and campaign correspondent Robert Costa reports. Then, Jasmine Wright, politics reporter for NOTUS, and Tom LoBianco, national politics reporter for 24sight News, join with analysis.","url":"https://www.cbsnews.com/video/obama-hits-campaign-trail-stump-harris/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/10/4c3b2c37-04cb-4fec-a8d4-37d376fb1ce6/thumbnail/1200x630/a23b836f94df885c644865f293215873/cbsn-fusion-obama-hits-campaign-trail-stump-harris-thumbnail.jpg?v=29b5ccc4d237d9b284ce95a42effd073","video":null,"publish_date":"2024-10-10 22:49:00","author":null,"language":"en","source_country":"US","sentiment":0.312},{"id":259256776,"title":"'Traitorous piece of human garbage': Undercover audio reveals Roger Stone’s 2024 election plans","text":"Undercover audio shared to social media by liberal filmmaker Lauren Windsor on Thursday shows Donald Trump ally Roger Stone revealing his plans to disrupt the electoral process next month if the ex-president doesn't defeat Kamala Harris. \n\nStone's plans involve sending \"armed guards to dispute the election in Detroit,\" and imprisoning \"former Attorney General Bill Barr if Trump returns to power,\" according to Windsor.\n\nIn the footage, an undercover reporter can be heard questioning Stone on August 4, 2024, during an event called \"A Night with Roger Stone\" in Jacksonville, Florida, while posing as the founder of a program, working to recruit \"people to work in the election, in the polls, in the swing states, in Wisconsin, Arizona, and Michigan\" — to get \"people on the inside.\"\n\nREAD MORE: Trump campaign has judge on standby willing to help dispute 2024 election: secret audio\n\nHe submitted to Stone, \"The fact of the matter is in 2020, we had control, and they were able to take it from us.\"\n\nStone replied, \"We were never really in control.\"\n\nThe journalist then asked, \"What do you mean?\"\n\nThe Trump ally replied, \"Well, I was indicted by Donald Trump's Justice Department. Donald Trump never controlled the Justice Department. [Former Attorney General] Bill Barr traitorous piece of human garbage!\" Stone went on to call the former Trump AG \"a piece of s—t.\"\n\nREAD MORE: Roger Stone implies Mar-a-Lago docs Judge Cannon is a staunch Trump loyalist\n\n\"He's a CIA general counsel. He's a piece of s—t. Trump read a law review article, never checked his background, and made him attorney general. Once we get back in, he has to go to prison! He has to go to prison. He's a criminal.\"\n\nThe journalist then asked, \"How are we going to get back in if they're in control right now, and we're on the outside?\"\n\n\"First of all it's a state question, not a federal question. So it's not who controls the federal government, it's who controls the state government. They use the election system to harass you when you're in office, but this is about an election. We gotta fight it out on a state-to-state basis.\"\n\nAfter the journalist asked what they can do to ensure Democrats don't steal the election, Stone repeated, \"We have to fight it out on a state to state basis,\" adding, \"When they throw us out of Detroit, you go get a court order, you come in with your armed guards, and you dispute it.\"\n\nREAD MORE: What does Roger Stone think of Trump’s indictment? He has a T-shirt for that.\n\nWatch the full video below or at this link.","summary":"Undercover audio shared to social media by liberal filmmaker Lauren Windsor on Thursday shows Donald Trump ally Roger Stone revealing his plans to disrupt the electoral process next month if the ex-president doesn't defeat Kamala Harris. \n\nStone's plans involve sending \"armed guards to dispute the election in Detroit,\" and imprisoning \"former Attorney General Bill Barr if Trump returns to power,\" according to Windsor.\n\nIn the footage, an undercover reporter can be heard questioning Stone on August 4, 2024, during an event called \"A Night with Roger Stone\" in Jacksonville, Florida, while posing as the founder of a program, working to recruit \"people to work in the election, in the polls, in the swing states, in Wisconsin, Arizona, and Michigan\" — to get \"people on the inside.\"\n\nREAD MORE: Trump campaign has judge on standby willing to help dispute 2024 election: secret audio\n\nHe submitted to Stone, \"The fact of the matter is in 2020, we had control, and they were able to take it from us.\"\n\nStone replied, \"We w","url":"https://www.alternet.org/roger-stone-bill-barr/","image":"https://www.alternet.org/media-library/image.jpg?id=53803605&width=1200&height=600&coordinates=0%2C85%2C0%2C86","video":null,"publish_date":"2024-10-10 22:46:37","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","source_country":"US","sentiment":-0.336},{"id":259255876,"title":"Harris rips Trump for his criticism of federal storm response and calls for ‘dignity’","text":"DETROIT (AP) — Vice President Kamala Harris and the White House criticized Donald Trump for his attacks on the federal response to Hurricanes Helene and Milton and suggested he was wrongly trying to turn the deadly storms to his political advantage.\n\nAttending a town hall sponsored by Univision in Las Vegas, Harris was asked about complaints that federal officials have bungled disaster recovery efforts. She responded, “In this crisis — like in so many issues that affect the people of our country — I think it so important that leadership recognizes the dignity” to which people are entitled.\n\n“I have to stress that this is not a time for people to play politics,” Harris added.\n\nThose comments came after the former president spoke at the Detroit Economic Club, offering sympathy to people affected by Hurricanes Helene and Milton, the latter of which came ashore in Florida Wednesday night. But Trump also suggested that the Biden administration’s response had been lacking, particularly in North Carolina after Helene.\n\n“They’ve let those people suffer unjustly,” said Trump, who has for several days promoted falsehoods about the federal response.\n\nHarris virtually attended a briefing, held in the White House Situation Room with President Joe Biden, on emergency efforts in Milton’s wake. In subsequent comments to reporters, Biden slammed Trump for spreading misinformation about federal assistance available to victims, including falsely claiming that it was capped at $750. In reality, that is just for immediate needs, the first potential payout rather than the total.\n\n“That $750 that they’re talking about, Mr. Trump and all those other people know it’s a lie to suggest that’s all they’re going to get,” Biden said Thursday. “It’s just bizarre. They got to stop this. They’re being so damn un-American with the way they’re talking about this stuff.”\n\nAsked if he planned to speak with Trump to urge him to stop, Biden said no, but followed that with a message he delivered directly into television cameras: “Mr. President Trump, former President Trump, get a life, man. Help these people.”\n\nDespite the storm, Trump and Harris are both visiting key swing states strategically, trying to increase support with key voting blocs who could decide an election expected to be exceedingly close.\n\nIn Michigan, where he’s looking to appeal to primarily to blue-collar voters, Trump took a swipe at the city he happened to be campaigning in, suggesting that Detroit was “a mess.”\n\n“Our whole country will end up being like Detroit if she’s your president,” he said of Harris. “You’re going to have a mess on your hands.”\n\nTrump’s economic speech featured multiple errors\n\nThe former president used his appearance at the Detroit Economic Club to echo core themes from his 2016 campaign, saying some other countries, especially China, are ripping the U.S. off and taking manufacturing business away. Trump said powerful companies have “raped” the United States. He vowed to impose huge tariffs that he said would force other countries to negotiate what they charge on American products.\n\n“They’ve been screwing us for so many years that we’re allowed to get some of that back,” Trump said about charging tariffs from countries.\n\nEconomists warn Trump’s proposed tariffs would drive up consumer costs. Trump has also claimed, without providing specifics, that he can use tariffs to reduce the U.S. budget deficit and pay for an expansion of childcare funding, even as he proposes other ideas without saying how he would replace the lost funding. He also proposed new tax breaks for overseas Americans subject to so-called “double taxation” and deductions for auto loan interest.\n\nBut the former president seemed to not understand the difference between the budget deficit and trade imbalances, conflating the two different economic measures as essentially being the same thing.\n\nHe noted that the federal government has nearly $36 trillion in total debt, a byproduct of the annual borrowing needed to cover the gap between tax revenues and government spending. Except Trump then seemed to indicate that the debt was a byproduct of the trade deficit with China — which is a separate issue that reflects the difference between how much a country exports and how much it imports.\n\n“We have $36 trillion in debt,” Trump said. “For years and years and years, we’ve been accumulating. We’d have these deficits that are monstrous. We had 5,6,7 $800 billion deficit with China.”\n\nHe also claimed that “we had the highest job numbers in my administration,” but that isn’t true any longer. The unemployment rate fell slightly lower under Biden — to 3.4% early last year, the lowest in a half-century, below 3.5% before the pandemic under Trump.\n\nHarris looks to boost Hispanic support\n\nHarris is campaigning out West and had a rally coming Thursday night in Phoenix after participating in the Univision town hall. She’s looking to increase support among Hispanic voters, especially men.\n\nHer campaign began a group this week known as “Hombres con Harris” — Spanish for “Men for Harris” — that is planning to hold events at Latino-owned small businesses, union halls, barbecues and community events until Election Day.\n\nAt the Univision event, which was titled, “Latinos Ask, Kamala Harris Responds,” Ivett Castillo, 40 and a Las Vegas resident, told Harris that she’s an American citizen born to two Mexican parents and that her mother died six weeks ago. She cried as she asked the vice president about “plans to support that subgroup of immigrants here their whole lives and who live and die in the shadows.” When the town hall ended, Harris went over and clasped hands with Castillo, whose face was still streaked with tears.\n\nIn response to her question, Harris noted that Biden sent a bill to Congress on his first day in office seeking to create pathways to U.S. citizenship for many people in the country illegally that was never considered.\n\nUnauthorized border crossings hit record highs during the Biden administration before declining this year after the president issued an executive order restricting asylum claims.\n\nAnother audience member asked Harris to explain how she replaced Biden on the Democratic ticket, prompting her to respond, “President Biden made a decision that I think history will show was probably one of the most courageous a president could make.”\n\nShe said Biden “put country before personal interest” and “urged me to run.”\n\nHispanic voters are about evenly split on whether to trust Harris or Trump to do a better job handling the economy, but they give the former president an edge on handling immigration. Hispanic women are more likely to trust Harris to better handle the economy and immigration, and Hispanic men are more likely to trust Trump on both issues, according to polling from The Associated Press and the NORC Center for Public Affairs Research.\n\nMeanwhile, former President Barack Obama hit the campaign trail Thursday night, making his first appearance for Harris at a rally in Pittsburgh. Obama’s team says he will focus on swing states, especially those with key Senate races. Biden has just made one joint campaign appearance with Harris since he himself left the race in July.\n\nAmong those attending was Glenda Ellison, a 71-year-old retired schoolteacher and Democrat from Pittsburgh. She said she is feeling “a little nervous” about the election but “prayerful that it’s going to turn out in our favor.”\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"DETROIT (AP) — Vice President Kamala Harris and the White House criticized Donald Trump for his attacks on the federal response to Hurricanes Helene and Milton and...","url":"https://wsvn.com/news/politics/harris-rips-trump-for-his-criticism-of-federal-storm-response-and-calls-for-dignity/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/240810_Kamala_Harris_Arizona_rally.jpg?quality=60&strip=color","video":null,"publish_date":"2024-10-10 22:37:05","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","category":"politics","source_country":"us","sentiment":-0.357},{"id":259254794,"title":"Trump criticizes Detroit during his visit to the city","text":"DETROIT – Former President Donald Trump criticized Detroit while delivering remarks to an economic group there on Thursday, saying the whole country would end up like the city if his Democratic opponent, Vice President Kamala Harris, is elected.\n\n“The whole country will be like — you want to know the truth? It’ll be like Detroit,” the Republican presidential nominee said. “Our whole country will end up being like Detroit if she’s your president.”\n\nTrump’s remarks came as he addressed the Detroit Economic Club in a speech appealing to the auto industry, a key segment of the population in battleground Michigan’s largest city. But he made conflicting remarks about Detroit throughout the speech, saying it was a “developing” city in an apparent compliment.\n\nDemocrats in the state were quick to criticize Trump for his comments. Detroit Mayor Mike Duggan lauded the city’s recent drop in crime and growing population.\n\n“Lots of cities should be like Detroit. And we did it all without Trump’s help,” he said on social media.\n\nU.S. Rep. Shri Thanedar, who represents Detroit, said on social media that Trump should “keep Detroit and our people out of your mouth.” Referring to Trump’s efforts to win Michigan, Attorney General Dana Nessel said on X, “This guy is calling us ugly and then asking us out on a date.”\n\nGov. Gretchen Whitmer, who has been a major surrogate for the Democratic presidential ticket, shot back at Trump, saying on X, “And you better believe Detroiters won’t forget this in November.”\n\nWayne County, which is home to Detroit, hasn’t been kind to Trump in previous elections. In both 2016 and 2020, Trump got about 30% of the vote in Wayne, losing the county by huge margins.\n\nTrump’s campaign said in a statement after his appearance that Detroit has “suffered from globalist policies championed by Kamala Harris” that have led to manufacturing moving overseas.\n\n“As President Trump emphasized in his speech, his policies will usher in a new era of economic success and stability for Detroit, helping the city reach its fullest potential,” said Victoria LaCivita, Trump’s Michigan communications director.\n\nTrump’s comments come as many in the city feel that Detroit has turned the corner from national joke to national attraction. Nearly a decade from exiting its embarrassing bankruptcy, the Motor City has stabilized its finances, improved city services, stanched the population losses that saw more than a million people leave since the 1950s and made inroads in cleaning up blight across its 139 square miles.\n\nDetroit is now a destination for conventions and meetings. In April, Detroit set an attendance record for the NFL draft when more than 775,000 fans poured into the city’s downtown for the three-day event. And just a few hours after Trump’s remarks, thousands of people were expected to pour into the same area as the city’s baseball team, the Tigers, aimed to win their AL Division Series.\n\nSome event attendees understood Trump’s Detroit comment to be in reference to the city’s previous financial woes.\n\n“I don’t think it was intentional on his part,” said Judy Moenck, 68. “There was blight. Now tremendous work has been done, and Detroiters will feel probably a little bit hurt by that.”\n\nHer husband, Dean Moenck, 74, who said he no longer considers himself a Republican in Trump’s GOP, said the comment fits into his campaign rhetoric style, “bringing out the negative things of Detroit.”\n\nThis isn’t the first time Trump has insulted the city he’s campaigning in.\n\nWhile in New York for his civil fraud and criminal trials, he routinely bashed the city, calling it dirty and crime-ridden and arguing that its overwhelmingly Democratic residents might be swayed to vote for him over concerns about migrants and safety.\n\nAssociated Press writer Jill Colvin in New York contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDETROIT – Former President Donald Trump criticized Detroit while delivering remarks to&#8230;\n\n\nThis Post: Trump criticizes Detroit during his visit to the city first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-criticizes-detroit-during-his-visit-to-the-city/","image":"https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/MPE3RXLXNFANXCFGSJ6RGZGN6I.jpg","video":null,"publish_date":"2024-10-10 22:25:28","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.151},{"id":259256050,"title":"Trump has a week to appeal order unsealing Jan. 6 evidence: Judge","text":"On Thursday afternoon, a filing from Trump requested that U.S. District Judge Tanya Chutkan keep an appendix from Smith’s Oct. 2 motion related to Trump’s immunity claims sealed from public view. However, Chutkan was unconvinced and shortly thereafter sided with Smith’s request to unseal the appendix, which may have contained more damaging information about Trump just before Election Day.\n\n“As the court has stated previously, ‘Defendant’s concern with the political consequences of these proceedings’ is not a cognizable legal prejudice,” Chutkan wrote in her decision. \n\nHer ruling means that the appendix may become public if higher courts affirm her unsealing.\n\nThe Washington Examiner contacted a representative for Trump.\n\nEarlier this month, the judge allowed the unsealing of a 165-page motion in the case addressing how the special counsel’s office plans to move forward after the Supreme Court’s ruling in July on presidential immunity for official acts. It also alleged that Trump was aware he lost the 2020 election, dismissed lawyer Sidney Powell’s theories as “crazy,” and provided no evidence to support his claims of fraud, even fabricating numbers of noncitizen voters.\n\nTrump, who has contested restrictions on what he can publicly say about the case, requested that the appendix to Smith’s motion remain sealed. His legal team had previously sought to delay responses to Smith’s motion until after the 2024 election, in which Trump is facing off against Vice President Kamala Harris.\n\nTrump’s filing argued that Smith’s information was misleading and should be redacted just ahead of the Nov. 5 election. His lawyers suggested they would challenge any decision to release the evidence.\n\n“If the Court releases additional information, President Trump respectfully asks for a stay to review legal options,” the filing said.\n\nHowever, Chutkan, who has sided frequently with prosecutors, ultimately disagreed, noting Trump provided no legal reasons to object to the redactions. While she agreed to release a redacted version of the appendix, she granted Trump a seven-day stay to assess further legal actions.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nChutkan is currently weighing how much of Smith’s reworked case since the immunity decision can be sustained, though any trial will not happen until well after the election.\n\nTrump, who says he is not guilty to four charges he faces over an alleged attempt to subvert the 2020 election, is due to file a response to Smith’s arguments on Nov. 7, just two days after the election is over.","summary":"The federal judge overseeing former President Donald Trump’s Jan. 6 criminal case has given him a week to determine whether to appeal a decision she made Thursday to unseal a court filing from special counsel Jack Smith, which his lawyers say amounts to election interference. On Thursday afternoon, a filing from Trump requested that U.S. [&#8230;]","url":"https://www.washingtonexaminer.com/news/justice/3185167/trump-appeal-order-unsealing-jan-6-evidence-judge/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/TRUMP-JACKSMITH-CHUTKAN.webp","video":null,"publish_date":"2024-10-10 22:25:13","author":"Kaelan Deese","authors":["Kaelan Deese"],"language":"en","category":"politics","source_country":"US","sentiment":-0.213},{"id":259254670,"title":"Trump slams ‘BETA MALE’ Howard Stern over ‘SOFTBALL’ Kamala Harris interview: ‘Made a fool of himself’ ","text":"Former President Donald Trump slammed Howard Stern Wednesday for gushing over Vice President Kamala Harris during their cozy interview earlier this week.\n\n“BETA MALE Howard Stern made a fool of himself on his low rated radio show when he ‘interviewed’ Lyin’ Kamala Harris, and hit her with so many SOFTBALL questions that even she was embarrassed,” the Republican nominee for president wrote on Truth Social. \n\n“He looked like a real fool, working so hard to make a totally incompetent and ill-equipped person look as good as possible, which wasn’t very good,” Trump added. \n\nHarris, 59, appeared on Stern’s SiriusXM radio show Tuesday as part of her campaign’s recent effort at getting her to do more media interviews – with mostly friendly hosts. \n\n“When I met you out in the hall, I said, ‘I’m really nervous because I want this to go well for you,’” Stern told Harris at one point. \n\nThe 70-year-old broadcaster later noted that he despises the recent “Saturday Night Live” skits mocking her. \n\n“I hate it. I don’t want you being made fun of,” Stern told the vice president. “There’s too much at stake. I believe the entire future of this country right now … it’s literally on the line.”\n\nTrump, 78, and Stern are former pals — they attended each other’s weddings while the 45th president was a frequent guest on the shock jock’s radio show — but their relationship soured after the radio host endorsed Hillary Clinton for the presidency in 2016. \n\nTrump previously claimed that he stopped doing Stern’s show because “he went woke, and nobody cares about him any longer.”\n\n“I dropped Howard a long time ago, like most others, and have since been credited with very good judgment! MAGA2024,” Trump’s Wednesday post concluded.","summary":"Former President Donald Trump slammed Howard Stern Wednesday for gushing over Vice President Kamala Harris during their cozy interview earlier this week.","url":"https://nypost.com/2024/10/10/us-news/trump-slams-howard-stern-over-softball-harris-interview/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-emzadmel4-1728595217860.jpg?quality=75&strip=all&1728580864&w=1200","video":"https://cdn.jwplayer.com/videos/5MQQvwKn-RyIcpnTz.mp4","publish_date":"2024-10-10 22:18:46","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.134},{"id":259256150,"title":"Donald Trump Refuses to Debate Kamala Harris Again, Even on His Beloved Fox News","text":"A month after definitively losing his first and only debate with Vice President Kamala Harris, Donald Trump is refusing to face Harris again—even from the safe and friendly shallows of Fox News, which had hoped to host a follow-up on October 24 or 27.\nTrump’s campaign seems to have calculated that it makes more sense for him to lob insults at Harris online, where she can’t bait the former president or smirk virally in his direction. “I WON THE LAST TWO DEBATES,” Trump declared on Truth Social Wednesday night, in all-caps defiance of September's post-debate polls. Nearly two in three registered voters thought Harris won the last debate, according to CNN, while 31% of respondents in an ABC/Ipsos poll said that they had a worse impression of Trump after the September debate.\nTrump has shied from the prospect of a rematch for weeks, so his latest refusal doesn’t come as much of a surprise. The campaigns had invites from both Fox and CNN, the latter of which set a Thursday deadline for the candidates to accept or decline. CNN confirmed on Thursday that Trump had turned down the debate, according to The New York Times, and a campaign advisor told NBC they had no plans to reconsider. Meanwhile, Fox News announced that it had made a final overture to both campaigns on Wednesday, with Bret Baier and Martha MacCallum pitched as moderators.\nWhile Fox has not confirmed that its debate is off, and Trump didn’t specifically name the network in his Wednesday post, the former president told “Fox and Friends” in early September that he “wouldn’t want to have Martha and Bret” moderate a Fox debate, lobbying instead for a more MAGA-friendly host. His post also made clear he has no desire to debate again, on any network. “THE FIRST THING A PRIZEFIGHTER DOES WHEN HE LOSES A FIGHT IS SAY THAT HE ‘DEMANDS A REMATCH,’” Trump said. “IT IS VERY LATE IN THE PROCESS, VOTING HAS ALREADY BEGUN - THERE WILL BE NO REMATCH!”\nThe former president also falsely claimed he was leading in the polls and “in all swing states,” with “the lead getting bigger by the day.” That declaration appeared to draw from an internal campaign memo that Trump made public Thursday morning, which found his campaign was up by one to five points in Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania, and Wisconsin.\nThose polls only surveyed 800 people in each state, however, and the margin of error—3.5%—was considerably greater than Trump’s predicted lead in every state but Georgia, where his campaign has him up by 5%. Weighted averages of reputable polls currently have Harris leading nationally and in several swing states.\nIn the absence of another televised debate, Harris will appear at a CNN town hall in Pennsylvania on October 23, her campaign chair said. Trump will almost definitely be watching—and retorting from behind the safety of his screen, as he’s been doing in recent days. On Wednesday and Thursday, the former president sent a flurry of tweets baselessly accusing 60 Minutes of “illegal” fraud and collusion with the Democratic party over Harris’s October 7 interview with the program. He insisted producers doctored Harris’s responses in coordination with the Democratic party, though there’s no evidence this happened, and demanded that the federal government “TAKE AWAY THE CBS LICENSE.” (It does not license networks.)\nTrump pulled out of his own 60 Minutes interview, per CBS, over concerns the show would fact-check his comments.","summary":"“I WON THE LAST TWO DEBATES,” Trump declared on Truth Social, in all-caps defiance of virtually every poll to follow his and Harris' September match-up.","url":"https://www.vanityfair.com/news/story/donald-trump-refuses-to-debate-kamala-harris-again-even-on-fox-news","image":"https://media.vanityfair.com/photos/67083c05214e34ae14aaac14/16:9/w_6000,h_3375,c_limit/2177081850","video":null,"publish_date":"2024-10-10 22:18:16","author":"Caitlin Dewey","authors":["Caitlin Dewey"],"language":"en","category":"politics","source_country":"US","sentiment":-0.343},{"id":259254510,"title":"Brad Hoylman-Sigal calls for Trump to be silenced and additional actions","text":"We say: The radical progressive New York lawmaker is demanding MSG cancel the Trump event, based on his outlandish comparison.\n\nHmm: In seeking to silence a political foe, Hoylman-Sigal seems to have more in common with Nazis than Donald Trump.\n\nâHezbollah Leaderâs Killing Upended Cease-Fire Planâ\n\nÃ¢ÂÂ The New York Times, Monday\n\nOur interpretation: According to The Times, Benjamin Netanyahu is accused of being responsible for the killing of Hezbollah’s Hassan Nasrallah, which reportedly disrupted a potential resolution that could have prevented an escalation of conflict.\n\nHello? Israel warned Hez repeatedly it would use force, if necessary, to stop its endless, unprovoked attacks.\n\nThe attacks, consisting of over 8,000 rockets following the massacre on Oct. 7 by Hamas, persisted, and it was evident that Israel’s leader, elected through democratic means, did not have confidence in any potential ceasefire agreement (if one even existed in the first place). Israel felt compelled to take action.\n\nFurthermore, Nasrallah (who is linked to numerous terrorist activities resulting in deaths, including those of Americans) was a necessary target for elimination. Instead of criticism, Netanyahu should be appreciated for this strategic move.\n\nÃ¢ÂÂDonald Trump . . . would absolutely try to exterminate an entire group of people because he thinks that their genes are . . . faulty.Ã¢ÂÂ\n\nÃ¢ÂÂ Democratic strategist Aisha Mills on CNN, MondayÂ \n\nWe say: ShouldnÃ¢ÂÂt TV talking heads have at least some evidence for the preposterous things they say? Mills surely didnÃ¢ÂÂt.\n\nBut floating baseless warnings like Trump would Ã¢ÂÂexterminateÃ¢ÂÂ groups (blacks? Hispanics? gays?) has become a go-to tactic for lefties.\n\nThey resort to ludicrous scaremongering because they can find absolutely nothing good to say about their candidate, Kamala Harris.\n\nÃ¢ÂÂTeachers and nurses and firefighters are paying a higher tax rate than billionaires.Ã¢ÂÂ\n\nÃ¢ÂÂ Kamala Harris, Monday\n\nWe say: Harris thinks if she repeats this lie often enough, she can stoke enough resentment to win the presidency. DonÃ¢ÂÂt buy it!\n\nAs weÃ¢ÂÂve noted, the tax rate for people making less than $100,525 (say, a teacher) is 22% or less.\n\nFor those making over $609,350, itÃ¢ÂÂs 37%. Indeed, the top 1% cough up nearly half of all income taxes, while the bottom pays virtually zilch.Â Â \n\nCompiled by The Post Editorial Board","summary":"Internewscast Journal\n\nInternewscast\n\n\nWe say: The radical progressive New York lawmaker is demanding MSG cancel&#8230;\n\n\nThis Post: Brad Hoylman-Sigal calls for Trump to be silenced and additional actions first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/brad-hoylman-sigal-calls-for-trump-to-be-silenced-and-additional-actions/","image":"https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2024%2F10%2Fwhoppers-oct-10.jpg?quality%3D90%26strip%3Dall","video":null,"publish_date":"2024-10-10 22:15:51","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.432},{"id":259254304,"title":"NATO chief shrugs off European allies’ fears of another Trump White House term","text":"NATO Secretary General Mark Rutte brushed aside European fears of former President Donald Trump roaring back into the White House. \n\nDespite Trump’s frequent jabs against the 32-member bloc, Rutte, 57, contended that the 45th president understands the need to back Ukraine in its war of defense against Russia. \n\n“Really, stop worrying about a Trump presidency. We do not know who will win,” the former Dutch prime minister, who became the NATO boss at the start of this month, told reporters outside 10 Downing Street Thursday.\n\n“I will work with Kamala Harris if she is chosen, I will work with Donald Trump if he is chosen.”\n\nRutte’s remarks came during his visit to London where he huddled with British Prime Minister Keir Starmer and Ukrainian President Volodymyr Zelensky, who presented his so-called plan for victory. \n\nZelensky, 46, met with Trump, 78, at Trump Tower in New York last month during their first face-to-face visit since 2019. Trump reiterated his desire to end the war, but was scant on specifics about how. \n\nIn front of cameras afterward while standing next to an uncomfortable-looking Zelensky, Trump said “I think that we can work out something that’s good for both sides.”\n\nLast month, during his debate against Vice President Kamala Harris, Trump declined to state whether he wants Ukraine to win the war. \n\nSince departing the White House, the GOP presidential nominee has had at least seven private calls with Russian leader Vladimir Putin, according to Watergate sleuth Bob Woodward. \n\nHis running mate, JD Vance, has floated a plan that would entail establishing demilitarized zones between the two countries and a commitment that Kyiv would not join NATO. This proposal elicited a rebuke from Zelensky. \n\n“I know that he understands completely, and agrees with me that this fight in Ukraine is not only about Ukraine, it’s also about the safety and the future security of the United States. He knows this,” Rutte added to reporters, referring to Trump.\n\nDuring his presidency, Trump stepped up aid for Ukraine as it stared down a civil war in the Donbas region exacerbated by Russia. He green-lit lethal military aid for Kyiv, going a step further than his predecessor Barack Obama in helping the beleaguered ally. \n\nHarris has blasted Trump’s approach to Ukraine, describing it as a policy of “surrender.” She recently affirmed that she would not seek to negotiate an end to the war “bilaterally without Ukraine.”\n\nAside from his public boasting that he could end the bloody war within 24 hours of taking office, Trump has also decried NATO members who don’t comply with the alliance’s guidelines to spend 2 percent of their gross domestic product on defense. \n\nIn February, Trump rattled allies when he recounted during a rally a supposed conversation he had with an unnamed European leader who asked if the US would protect them from Russia. \n\n“No, I would not protect you,” Trump recounted saying in response. “In fact, I would encourage them to do whatever the hell they want. You got to pay. You got to pay your bills.”\n\nPrivately, he has reportedly floated various ideas to entice NATO members to pony up, including telling allies that the US won’t commit to defending them unless they’ve hit the 2 percent mark. \n\nRutte’s predecessor as NATO boss, Jens Stoltenberg, has grappled with similar consternation about Trump’s rhetoric. He also credited him with helping to motivate NATO members to bolster their defense expenditures. \n\nThe newly minted NATO chief has been dubbed by some as a “Trump whisperer” due to his knack for swaying the former president.","summary":"NATO Secretary General Mark Rutte brushed aside European fears of former President Donald Trump roaring back into the White House.","url":"https://nypost.com/2024/10/10/us-news/nato-chief-shrugs-off-european-allies-fears-of-another-trump-white-house-term/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/nato-secretary-general-mark-rutte-91379379.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/eMw8zMuC-RyIcpnTz.mp4","publish_date":"2024-10-10 22:15:34","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":259255472,"title":"Donald Trump likely won’t win Coachella. So why is he campaigning there?","text":"Trying to find Republicans in Coachella is like trying to find Dodgers fans in San Diego — they’re there, but they’re vastly outnumbered.\n\nSo why is Donald Trump speaking at a campaign rally Saturday, Oct. 12, just outside the heavily Latino city — 29 days before the Nov. 5 election — where more than half of voters are registered Democrats and 78% of voters chose Joe Biden in 2020?\n\nRELATED: Donald Trump to speak at Coachella campaign rally Oct. 12\n\nMike Madrid, a Republican political consultant and expert on Latino political behavior, has an idea.\n\n“Trump recognizes that his rallies become ads that dominate the news cycle,” Madrid said via email.\n\n“He’s not in Riverside County to win it. He’s there because it’s a larger crowd of supportive Republicans and Latinos than he could get in Maricopa County, Arizona.”\n\nMore Latino voters watch “Fox than Univision and he’s focusing on precisely this demographic — third- and fourth-generation Latinos in the suburbs, not in the inner city,” Madrid added.\n\nThe rally will take place just outside Coachella, a working class city of roughly 42,000 southeast of Palm Springs. Ninety-eight percent of Coachella’s residents are Latino and 41% are foreign born.\n\nTrump’s rally in California, a deep-blue state he’s all but certain to lose, is sandwiched between events the day before in Nevada and the day after in Arizona, both swing states that could determine whether Trump or Vice President Kamala Harris wins the White House.\n\n“From the perspective of the Trump campaign, Coachella is Arizona-adjacent,” Marcia Godwin, a professor of public administration at the University of La Verne, said via email.\n\n“He will be able to maximize appearances as (part of) a West Coast tour … The Coachella rally will feed into media coverage to try to boost attendance leading into his appearance in Prescott, Arizona.”\n\nThe Trump campaign, Godwin said, “will be striving for strong visuals and sound bites from both Trump and the attendees to blame Vice President Harris and Governor (Gavin) Newsom for anything and everything that might be ailing the state.”\n\nNevada and Arizona have large Latino populations. The GOP has made inroads with Latinos in recent years, and swing state polling shows Trump winning the votes of Latino men under age 50.\n\n“Far removed from the immigrant experience, (these voters) are transforming the Latino vote from one driven in the past by immigration and racially focused issues to a new economic populist, pocketbook voter,” said Madrid, co-founder of the anti-Trump Lincoln Project and author of “The Latino Century: How America’s Largest Minority is Transforming Democracy.”\n\n“These young men — 38% of Latino voters are under 30 years of age — are the fastest-growing group of blue-collar workers — a demographic that is becoming Republican faster than any group in America,” he said.\n\nRep. Raul Ruiz, D-Indio, who represents Coachella, appeared at an event Wednesday night, Oct. 9, in Palm Desert to denounce Trump’s visit.\n\n“Under a second Trump administration, there is literally no place in America that would be harmed more than the Coachella Valley,” Ruiz, said in a written statement issued earlier in the week. “Donald Trump — and his policies — are an affront to everything that makes the Coachella Valley a vibrant community.”\n\nConservative southwest Riverside County Pastor Tim Thompson welcomes the rally, noting that more than 6 million Californians voted for Trump in 2020.\n\n“I am sure that number will be much higher in 2024, which may be part of the reason President Trump will be in Coachella this weekend,” Thompson, who plans to be with Trump at a North Carolina event later this month, said via a text message.\n\nWhile it’s not uncommon for protesters to picket Trump and Harris rallies, the chairperson of Democrats of the Desert said her club has no protest plans.\n\n“We are laser focused on voting, getting out the vote and electing our candidates,” Marcie Maxwell said.\n\nTrump’s rally will take place not far from the 41st Congressional District’s boundaries. Rep. Ken Calvert, R-Corona, who represents the 41st, is in a tight race with Democrat Will Rollins in a fight that could help determine which party controls Congress.\n\nCalvert campaign spokesperson Calvin Moore said the campaign did not ask Trump to visit. Moore declined to say whether Calvert will be at Saturday’s rally.\n\nTrump’s visit “further shows that Riverside County is the epicenter of California elections,” Riverside County GOP Chairman Matthew Dobler said via email.\n\n“Republicans here are motivated to turn out and vote this election season,” Dobler wrote. “President Trump understands the importance of Congressman Ken Calvert in Congress to be a common sense leader for our community. His visit will bring a lot of energy to our region.”\n\nThe rally will be at Calhoun Ranch, which offers vacant lots for sale to real estate investors. The ranch belongs to the Haagen family, which also owns the Empire Polo Club in Indio where the Coachella Valley Music and Arts Festival and Stagecoach Country Music Festival take place annually.\n\nThe Haagens also are big-money GOP donors. Since 2016, the Haagen Co. has contributed at least $400,000 to Trump’s reelection campaign, federal campaign finance records show. The Haagens also have donated hundreds of thousands of dollars to the Republican National Committee since 2004, records show.\n\nSaturday’s rally is expected to have a heavy law enforcement presence, especially with Trump surviving two recent assassination attempts, including one at a Pennsylvania rally in July.\n\n“It is local law enforcement responsible for the safety and security of our former President and the attendees of the rally,” Riverside County Sheriff Chad Bianco said via text. “We will ensure everyone involved arrives and departs safely without incident. There will be a zero tolerance for anyone interfering with that end goal.”\n\nWithout naming names, Bianco, a conservative Republican who endorsed Trump and is pondering a run for California governor in 2026, took exception to elected leaders criticizing Trump’s visit.\n\n“Local electeds making reckless and inflammatory statements with the only intent to incite others is not only counter productive to our mission, but it is a nationwide embarrassment to the county of Riverside,” he said. “In the end, (the sheriff’s department) will do our best to protect everyone involved.”\n\nSaturday’s 5 p.m. rally will occur on a day when temperatures are expected to be in the high 90s or low 100s. Extreme heat has been an issue at prior Trump rallies, with The Washington Post reporting in August that at least 78 people at Trump rallies were hospitalized for heat-related illnesses this summer.\n\nThe Riverside County Fire Department and ambulance company American Medical Response will be at the rally to handle medical calls, county spokesperson Brooke Federico said via email.\n\nShe recommended that rally guests drink lots of water, wear hats and sunscreen as well as loose, lightly colored clothing to avoid heat-related problems.\n\nAmong those planning to go to the rally is 62-year-old Murrieta resident John Leonard.\n\nLeonard, a registered Republican who works for a military subcontractor, attended a 2016 Trump rally in Irvine.\n\n“It was a wonderful experience all around,” he said.\n\nLeonard said to expect the unexpected at Saturday’s event.\n\n“A significant part of his rallies is where he literally talks off the top of his head, and I think that’s why he makes such a connection with people,” he said.\n\nTrump will often incorporate what people are shouting at him into his speech, Leonard added.\n\n“I’m expecting that too,” he said. “That’s why people go, because it’s a lot of fun and a lot of it’s unexpected. You have everything you can possibly imagine going on.”\n\nLeonard views the rally as a boost for California conservatives.\n\n“He’s delivering that message at large to all Californians that ‘we know you’re here and we look forward to you getting your voices back and participating more in your conservative values,’” he said.","summary":"The former president's rally in a heavily Latino area of Riverside County's desert will bring other benefits, a GOP consultant says.","url":"https://www.ocregister.com/2024/10/10/donald-trump-likely-wont-win-coachella-so-why-is-he-campaigning-there/","image":"https://www.ocregister.com/wp-content/uploads/2024/08/AP24239778356814.jpg?w=1024","video":null,"publish_date":"2024-10-10 22:14:12","author":"Jeff Horseman","authors":["Jeff Horseman"],"language":"en","source_country":"US","sentiment":0.084},{"id":259256618,"title":"Fewer ‘everyday people’ have donated to Trump’s campaign than in 2020","text":"Donald Trump’s campaign has seen a more than 10-percentage-point drop in the number of “small donors” this presidential election cycle compared to the 2020 election cycle.\n\nSo far this year, and with just 25 days until election day, only 31.7 percent of campaign donations have come from small donors – classified as people who give less than $200, according to OpenSecrets.\n\nIn 2020, nearly half of Trump’s campaign donations came from small donors.\n\nThe decrease in donations from average Americans means the former president must rely more on wealthy donors or political action committees backed by wealthy donors. But that also means Trump must deliver a message that appeals to his wealthy donors – which can often be at odds with average voters.\n\nRecently, Trump earned the endorsement and support of billionaire Elon Musk who also serves as the CEO of the electric vehicle manufacturing company Tesla. This has, seemingly, forced Trump to soften his stance on EVs during rallies, for example.\n\nMeanwhile, Vice President Kamala Harris’s campaign has seen a steady flow of money from small donors, with 41 percent of her campaign funds coming from those who give less than $200.\n\nHarris has recieved $1 billion in campaign donations since entering the presidential election in July, according to a recent report, compared to the $600 million that the Trump campaign has raised. \n\nIn an attempt to get supporters to donate, the Trump campaign has used flashy emails with contest opportunities and merch giveaways if people give money. Some of those contests include opportunities to meet Trump, win signed merchandise or have dinner at his golf club in Palm Beach, Florida.\n\nThe campaign has also capitalized on the former president’s various federal and state court cases to beg supporters to donate. The messaging often claims donations directly help Trump fight unfair prosecutions.\n\nThose techniques appear less effective than they once were. Republican operatives suggested to the Associated Press it raises concerns about marketing to a conservative base, often comprised of older individuals living on fixed incomes.\n\nBut also it calls into question the technique of raiding voters’s inboxes with emails, text messages, flyers and more. Recent polling has shown that voters are irritated with the number of campaign messages they receive directly to their phones and the inability to opt out makes it all the more frustrating.","summary":"Nearly half of Trump’s 2020 campaign donations came from small donors, in 2024 it was approximately one third","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-campaign-donations-decline-b2627518.html","image":"https://static.independent.co.uk/2024/10/10/22/newFile-2.jpg?width=1200","video":null,"publish_date":"2024-10-10 22:10:41","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.079},{"id":259256152,"title":"Report: The Trump Campaign’s Email Sweepstakes Are Possibly Illegal, Definitely Cringe","text":"The New York Times reports that whereas Joe Biden and Kamala Harris have sent out just over 1,600 campaign emails combined since the president launched his reelection bid in April 2023, Team Trump has sent at least 7,400 since the GOP candidate entered the race, which breaks down to an average of 75 per week. Not surprisingly, many of them take on an apocalyptic, all-caps-outraged tone—as seen in one sent last May, which spoke of “the ILLEGAL RAID on my beautiful Mar-a-Lago,” “the RIGGED BIDEN TRIALS forcing me off the campaign trail,” and “the RUTHLESS ATTEMPTS TO SILENCE MAGA & DESTROY AMERICA.” While others email lines sound like…they’re from letters sent to a lover during the Revolutionary War. Those include:\n\n“You are the reason I wake up every morning. I love you to the moon and back, and I really mean that.”\n“I need you to know one thing: I love you!”\n“YOU NEVER LEFT MY SIDE - I WILL ALWAYS LOVE YOU FOR THAT!”\n\nSetting aside the weirdness of Trump sending emails to supporters using language it’s hard to imagine him ever using with his wife, the Times’ investigation also revealed that despite frequently promising people something in exchange for their donation, the campaign does not appear to have followed through for the most part.\n\nSince former president Donald J. Trump announced his 2024 candidacy, his campaign has promoted dozens of contests for supporters to win signed merchandise or “V.I.P.” trips to meet Mr. Trump. It has offered adherents myriad “exclusive” opportunities to join clubs to give counsel to Mr. Trump, and it has repeatedly claimed that Mr. Trump is personally reviewing lists of small donors. But most of the contests seem to have no winners, and the campaign did not confirm or provide evidence that the club members have had any opportunity to advise the former president or that Mr. Trump is paying any attention to small-donor rosters.\nIn all, the combined approximate retail value of the contest prizes offered by the Trump campaign since Mr. Trump announced his candidacy totals more than $180,000. The Times could not verify that a vast majority of that value has made its way to Mr. Trump’s supporters. Similar questions have arisen about contests Mr. Trump’s campaign and political action committee have run in years past.\n\nAccording to the Times, it sent the campaign “a detailed list of every contest it had promoted in fundraising emails from Nov. 15, 2022, to Sept. 16, 2024, and asked the campaign to confirm that each contest had a winner and to provide the names of the winners.” The outlet also “asked the campaign to provide photos of the winners with Mr. Trump in cases in which a photo was part of the prize, and a link to a ‘personalized‘ Christmas message from Mr. Trump offered as a prize in December 2022.” The campaign did not confirm that every contest had a winner and failed to provide “winners’ names, photos, or a link to the Christmas video.” Team Trump sent the outlet two statements, one by a man named Willam McGuffin, whom it identified as a contest winner in late August, and another from a campaign adviser. The adviser wrote to the Times: “President Trump and our campaign have a strong and effective fund-raising operation that includes digital platforms. President Trump’s movement to save our nation inspires hardworking men and women from all over America to play a financial role in our campaign and MAGA movement.”\nWhich is all well and good, but according to at least one expert, running a sweepstakes without awarding a winner may not actually be legal:\n\nContests like the ones both campaigns have run are legally considered sweepstakes, which are a regulated category. Federal Election Commission regulations allow political committees to run sweepstakes, but do not specify the rules under which they are run. In the absence of such rules, sweepstakes regulations from federal and state regulators should apply, according to campaign legal experts.\n“Sweepstakes rules should be crystal clear about whether a sponsor will award all prizes or whether a sponsor will choose alternate winners if the original potential winners are disqualified,” Kyle-Beth Hilfer, an advertising and marketing law attorney in New York, said in an email. “Any ambiguity could lead to a legal challenge from an entrant or even a regulator.”\n\nVanity Fair has reached out to the Trump campaign for comment.\nAnyway, none of this should come as a surprise considering that (1) Trump is an actual convicted felon, and (2) he’s ripped off his supporters before. In 2021 the Times reported that the 2020 Trump campaign raised tens of millions of dollars by making the default option on its donation pages one that would deduct money from people’s bank accounts not once but every single week. Later, the campaign introduced a second prechecked box that doubled a person’s contribution and was known internally as a “money bomb.” At least one of the people ensnared in the scheme was living in hospice care and surviving on less than $1,000 a month, but after donating $500 intended as a single contribution, he learned that the Trump campaign had withdrawn $3,000 from his account in less than 30 days, leading his utility and rent payments to bounce. For his part, Trump naturally insisted he did nothing wrong, saying in a statement that “many people were so enthusiastic that they gave over and over, and in certain cases where they gave too much, we would promptly refund their contributions.”","summary":"“You are the reason I wake up every morning. I love you to the moon and back, and I really mean that.”","url":"https://www.vanityfair.com/news/story/report-the-trump-campaign-email-sweepstakes-are-possibly-illegal-definitely-cringe","image":"https://media.vanityfair.com/photos/66fbf44def1d0908be19a336/16:9/w_7360,h_4140,c_limit/2173312291","video":null,"publish_date":"2024-10-10 22:09:30","author":"Bess Levin","authors":["Bess Levin"],"language":"en","category":"politics","source_country":"US","sentiment":-0.201},{"id":259253936,"title":"The week in whoppers: Brad Hoylman-Sigal demands Trump be silenced, The NY Times slaps Benjamin Netanyahu for killing Hassan Nasrallah and more ","text":"Diary of disturbing disinformation and dangerous delusions\n\nThis analogy:\n\nWe say: The radical progressive New York lawmaker is demanding MSG cancel the Trump event, based on his outlandish comparison.\n\nHmm: In seeking to silence a political foe, Hoylman-Sigal seems to have more in common with Nazis than Donald Trump.\n\nThis story:\n\n“Hezbollah Leader’s Killing Upended Cease-Fire Plan”\n\n— The New York Times, Monday\n\nWe say: The Times blames Benjamin Netanyahu for killing Hezbollah’s Hassan Nasrallah, derailing “a breakthrough” that would’ve averted “a spiraling war.”\n\nHello? Israel warned Hez repeatedly it would use force, if necessary, to stop its endless, unprovoked attacks.\n\nThe strikes — more than 8,000 rockets since Hamas’ Oct. 7 massacre — continued, and Israel’s democratically elected leader clearly had no faith in any cease-fire (assuming there even was a realistic plan on the table). Israel had no choice but to act.\n\nBesides, Nasrallah (the monster behind countless terrorist deaths, including of Americans) needed to be assassinated. Bibi should be thanked, not blamed.\n\nThis prediction: \n\n“Donald Trump . . . would absolutely try to exterminate an entire group of people because he thinks that their genes are . . . faulty.” \n\n— Democratic strategist Aisha Mills on CNN, Monday \n\nWe say: Shouldn’t TV talking heads have at least some evidence for the preposterous things they say? Mills surely didn’t.\n\nBut floating baseless warnings like Trump would “exterminate” groups (blacks? Hispanics? gays?) has become a go-to tactic for lefties.\n\nThey resort to ludicrous scaremongering because they can find absolutely nothing good to say about their candidate, Kamala Harris.\n\nThis claim:\n\n“Teachers and nurses and firefighters are paying a higher tax rate than billionaires.”\n\n— Kamala Harris, Monday\n\nWe say: Harris thinks if she repeats this lie often enough, she can stoke enough resentment to win the presidency. Don’t buy it!\n\nAs we’ve noted, the tax rate for people making less than $100,525 (say, a teacher) is 22% or less.\n\nFor those making over $609,350, it’s 37%. Indeed, the top 1% cough up nearly half of all income taxes, while the bottom pays virtually zilch. \n\nCompiled by The Post Editorial Board","summary":"New York state Sen. Brad Hoylman-Sigal compared former President Donald Trump hosting a campaign event in Madison Square Garden to an infamous Nazi party rally at MSG in 1939.","url":"https://nypost.com/2024/10/10/opinion/the-week-in-whoppers-brad-hoylman-sigal-demands-trump-be-silenced-and-more/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/whoppers-oct-10.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-10 22:06:38","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.33},{"id":259254796,"title":"People Who Actually Live In Ohio Reject Trump/Vance’s Racist Dog-Eating Bait","text":"While VP candidate JD Vance’s racist efforts to dehumanize legal immigrants from Haiti who are living in his state might still be playing out favorably among groypers, white supremacist bros and QAnon-adjacent online conspiracy mongers, the people who actually live in the state he represents in the Senate are, en masse, not buying the anti-immigrant propaganda.\n\nIt’s been a month to the day since Donald Trump brought national attention to a conspiracy theory that Vance first elevated into the mainstream that, up until that point, only existed in the most sinister corners of the internet. \n\n“In Springfield, they’re eating the dogs. The people that came in, they’re eating the cats. They’re eating — they’re eating the pets of the people that live there,” Trump said at the debate with Vice President Kamala Harris on Sept. 10. While the unreal debate moment provided fodder for plenty of memes ridiculing Trump and the unseriousness of his campaign in general, it also put the Haitian immigrants who are legally living in Springfield, Ohio with temporary protected status in danger. After Trump’s infamous line during the debate, the city of Springfield was inundated with threats against the Haitian community, forcing elementary schools, government buildings and festivals to shut down.\n\nWhile Springfield officials and the governor himself put out multiple statements debunking the conspiracy theory — Gov. Mike DeWine even penned an op-ed in the New York Times gently begging “those” spreading the lies to please, please stop — Vance and Trump have been reluctant to to denounce the myth, though they have, for the most part, stopped talking about it.\n\nIn a new poll of Ohio voters conducted by The Washington Post, the Post found that nearly half of respondents had heard “a lot” about the Haitian immigrants living in Springfield, Ohio. Most importantly, a majority of respondents also said they believed the conspiracy theories spread by Trump and Vance are “definitely false.” Per the Post:\n\nThe Post poll found that 24 percent think Trump’s comment that Haitian immigrants are eating people’s pets is “probably” or “definitely” true, while 57 percent say it is probably or definitely false. Sixteen percent say they aren’t sure.\n\nThe results are almost a mirror image of reactions to DeWine, who has said that Trump’s claims are not true and that the Haitian immigrants are in the United States legally and are hard workers. A 55 percent majority of Ohio voters say DeWine’s comments are true, while 26 percent say they are false and 18 percent are not sure.\n\nThe poll was conducted between Oct. 3-7. It had a margin of error of +/- 3.5 percentage points.\n\nThe Best Of TPM Today\n\nYesterday’s Most Read Story \n\nWhat We Are Reading","summary":"While VP candidate JD Vance&#8217;s racist efforts to dehumanize legal immigrants from Haiti who are living in his state might...","url":"https://talkingpointsmemo.com/where-things-stand/people-who-actually-live-in-ohio-reject-trump-vances-racist-dog-eating-bait","image":"https://talkingpointsmemo.com/wp-content/uploads/2024/10/GettyImages-2171357230.jpg","video":null,"publish_date":"2024-10-10 22:06:01","author":"Nicole Lafond","authors":["Nicole Lafond"],"language":"en","source_country":"US","sentiment":-0.095},{"id":259253654,"title":"Obama hits election campaign trail for Harris","text":"AFP – Former United States (US) president Barack Obama brought his star power to Kamala Harris’ election campaign yesterday in a bid to get out the vote in the critical swing state of Pennsylvania.\n\nAmerica’s first Black president is hitting the campaign trail in the steel city of Pittsburgh a day after Harris’ Republican rival Donald Trump charged through the must-win state.\n\nThe still hugely influential Democrat will be urging people to vote early in person or by mail as Harris looks to lock in as many votes as she can in a nail-biting race.\n\nTrump rallied on Wednesday in US President Joe Biden’s childhood hometown of Scranton, Pennsylvania and headed to the auto industry capital of Detroit in Michigan, another battleground yesterday.\n\nWooing blue-collar voters in the former coal mining town of Scranton, Trump vowed to “drill, baby, drill” for oil and assailed Harris on the economy.\n\nHarris will head to yet another swing state, Nevada, to reach out to Latino voters but the White House said she would be kept informed throughout the day about Hurricane Milton. \n\nObama’s trip to Pennsylvania is the first stop in what will be a month of campaigning for Harris in the seven swing states where the 2024 election is likely to be decided. The White House race remains neck-and-neck between Harris and Trump both nationally and in the battleground states, including Pennsylvania. Harris’ campaign is counting on Obama, 63, who was president from 2009 to January 2017, to mobilise Black and young voters as she seeks the edge on November 5.\n\nDemocrats have historically favoured early voting over Republicans.\n\nTrump has meanwhile frequently lashed out against anything except on-the-day voting, repeatedly blaming mail-in ballots for his 2020 defeat by Joe Biden, which he still refused to accept.\n\nThe Republican himself has also sometimes called early voting into question, despite efforts by his campaign to promote it.\n\n“President Obama believes the stakes of this election could not be more consequential and that is why he is doing everything he can to help elect Vice President Harris,” Obama’s senior advisor Eric Schultz said in a statement.\n\nObama and former first lady Michelle Obama delivered rapturously received speeches backing Harris at the Democratic National Convention in his hometown of Chicago in August.\n\nHe portrayed Harris – America’s first woman, Black and South Asian vice president – as the political heir to his own trailblazing path.\n\nObama led the crowd in chants of “Yes she can” – a riff on the “Yes he can” chants from his own 2008 campaign – but warned that 2024 would “still be a tight race in a closely divided country”.","summary":"","url":"https://borneobulletin.com.bn/obama-hits-election-campaign-trail-for-harris/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/10/P28-B_11102024.jpg","video":null,"publish_date":"2024-10-10 22:01:29","author":null,"language":"en","category":"politics","source_country":"bn","sentiment":-0.396},{"id":259254186,"title":"“Inflation in the US dips to 2.4% in September”","text":"US inflation fell to 2.4 per cent in September but still exceeded expectations, cementing expectations that the Federal Reserve will cut interest rates by a quarter point at its next meeting in November.\n\nThursday’s headline figure from the Bureau of Labor Statistics was below August’s 2.5 per cent annual increase but above economists’ expectations of 2.3 per cent.\n\nThe figure, the last before the November 5 presidential election, came after the Fed cut rates by a larger-than-usual half point last month amid signs that it was succeeding in its battle to tame price pressures.\n\nAfter the release of the inflation data, as well as figures showing a jump in joblessness, investors increased their bets on a quarter-point cut at the US central bank’s November meeting.\n\nMarkets were pricing in a roughly 90 per cent chance of such a cut in November following the data, compared with 80 per cent beforehand.\n\nThe interest rate-sensitive two-year Treasury yield, which moves inversely to prices, was down 0.06 percentage points to 3.96 per cent on Thursday afternoon. The S&P 500 fell, closing 0.2 per cent below Wednesday’s record-high closing level.\n\nThursday’s inflation figure marked the sixth consecutive month the annual headline rate has fallen. However, once volatile items such as food and energy were stripped out, “core” inflation rose faster than expected, up 3.3 per cent in the year to September.\n\nEconomists had expected the core rate to remain at August’s 3.2 per cent.\n\n“It’s just evidence that it’s going to be a gradual path from here to get to the Fed’s target,” said Tony Rodriguez, head of fixed income strategy at asset manager Nuveen, referring to the central bank’s 2 per cent inflation target.\n\n“The easy gains in disinflation are well behind us, and from here, it’s likely to be a little bit bumpier path,” he added.\n\nJobless claims data on Thursday also exceeded economists’ expectations. The number of Americans filing for unemployment insurance jumped to 258,000, almost 30,000 more than the forecast figure and the highest weekly increase since August 2023.\n\nThe latest numbers present a mixed picture of the world’s largest economy just weeks before the election.\n\nVice-president and Democratic nominee Kamala Harris has struggled to overcome voters’ discontent about rising costs in her bid for the White House. Harris has hoped that a more benign economic backdrop of solid growth and falling interest rates will bolster her chances against Republican nominee Donald Trump.\n\n“The [inflation] number might not help the Harris campaign because voters are paying more attention to their personal experience of paying prices that went up but not back down than they pay to numbers from the government,” said Erik Gordon, a professor at the University of Michigan’s Ross School of Business.\n\nBut Lael Brainard, director of the White House National Economic Council, said Thursday’s figures were in line with the trend that prevailed before the Covid-19 pandemic and the war in Ukraine pushed up inflation, and showed continued progress in getting costs under control.\n\nThe Trump campaign seized on the latest inflation and jobless claims data, warning that the US economy would “nosedive into the worst depression this country has ever seen” if Harris was elected.\n\n“Americans will continue to be robbed of their paychecks with astronomical inflation and higher taxes,” the campaign said in a statement on Thursday.\n\nUS central bankers will also be scrutinising the data as they wrestle with how quickly to lower interest rates to a “neutral” level that no longer inhibits economic growth.\n\nAustan Goolsbee, president of the Chicago Fed, brushed aside concerns about inflation. The overall trend was “clearly that inflation has come down a lot, and the job market has cooled to a level which is around where we think full employment is”, he told CNBC on Thursday.\n\nRichmond Fed president Thomas Barkin said inflation was headed in the right direction. However, Raphael Bostic of the Atlanta Fed, conceded in an interview with The Wall Street Journal that he would be “totally comfortable with skipping a meeting if the data suggests that’s appropriate”.\n\nMonth-on-month headline inflation remained at 0.2 per cent for September, the same figure as the previous two months, overwhelmingly because of price rises for food and housing.\n\nHowever, energy prices fell 1.9 per cent during the month.\n\nSeamus Mac Gorain, global head of rates at JPMorgan Asset Management, argued that reducing housing-related “shelter” inflation was vital if the Fed was to return inflation to its target.\n\nWhile rental costs have been falling in the US for roughly a year, the Bureau of Labor Statistics’ overall “shelter” index has continued to rise, though in September it increased just 0.2 per cent, compared with 0.5 per cent the previous month.\n\nThe decline in inflation from its 2022 peak of 9.1 per cent has so far not triggered a significant weakening of the labour market, surprising many economists.\n\nLast week’s US jobs report showed that businesses added 254,000 positions in September, far outstripping expectations. The unemployment rate fell to 4.1 per cent after several months of increases.\n\nNew York Fed president John Williams told the Financial Times this week that monetary policy was “well positioned” to pull off a so-called soft landing following the half-point cut, as inflation eased and the economy kept growing.\n\nWilliams said Fed officials’ projections released last month, which indicated a half-point worth of cuts to come over the two remaining meetings this year, were a “very good base case”.\n\nChair Jay Powell recently suggested such a reduction would be delivered through two quarter-point cuts rather than another half-point move.","summary":"Internewscast Journal\n\nInternewscast\n\n\nUS inflation fell to 2.4 per cent in September but still exceeded&#8230;\n\n\nThis Post: &#8220;Inflation in the US dips to 2.4% in September&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/business/inflation-in-the-us-dips-to-2-4-in-september/","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fpublic.flourish.studio%2Fvisualisation%2F19750153%2Fthumbnail%3FcacheBuster%3D5761971?source=next-article&fit=scale-down&quality=highest&width=1020&dpr=1","video":null,"publish_date":"2024-10-10 21:53:48","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.134},{"id":259254050,"title":"Kamala Harris in Las Vegas Univision Town Hall Pressed on Prices, Immigration - Bloomberg","text":"Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not\n blocking them from loading.\n For more information you can review our Terms of\n Service and Cookie Policy.","summary":"Kamala Harris in Las Vegas Univision Town Hall Pressed on Prices, Immigration  Bloomberg","url":"https://www.bloomberg.com/tosv2.html?vid=&uuid=bbfb32ba-8754-11ef-a6bd-106d7a801017&url=L25ld3MvYXJ0aWNsZXMvMjAyNC0xMC0xMC9oYXJyaXMtcHJlc3NlZC1vbi1wcmljZXMtaW1taWdyYXRpb24taW4tbGFzLXZlZ2FzLXRvd24taGFsbD9zcm5kPXBoeC1wb2xpdGljcw==","image":null,"video":null,"publish_date":"2024-10-10 21:52:21","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":259261874,"title":"Kamala Harris Pressed on Prices, Immigration in Las Vegas Town Hall - Bloomberg","text":"Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not\n blocking them from loading.\n For more information you can review our Terms of\n Service and Cookie Policy.","summary":"Kamala Harris Pressed on Prices, Immigration in Las Vegas Town Hall  Bloomberg","url":"https://www.bloomberg.com/tosv2.html?vid=&uuid=88321401-8769-11ef-9a8c-5136486cff03&url=L25ld3MvYXJ0aWNsZXMvMjAyNC0xMC0xMC9oYXJyaXMtcHJlc3NlZC1vbi1wcmljZXMtaW1taWdyYXRpb24taW4tbGFzLXZlZ2FzLXRvd24taGFsbA==","image":null,"video":null,"publish_date":"2024-10-10 21:52:21","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":259256628,"title":"Will Elon Musk Tip the Election for Trump?","text":"Leah Feiger is @LeahFeiger. David Gilbert is @DaithaiGilbert. Vittoria Elliott is @telliotter. Write to us at politicslab@WIRED.com. Be sure to subscribe to the WIRED Politics Lab newsletter here.\nMentioned this week:\nElon Musk Spoke at a Trump Rally, Referenced ‘Dark MAGA,’ and Urged Supporters to Vote by Vittoria Elliott and Tess Owen\nRight-Wing Influencers Claim ‘They’ Defeated Physics, Geoengineered Hurricane Milton by Tess Owen\nWe’ve been nominated for a Signal Award! Vote for us here: https://vote.signalaward.com/PublicVoting#/2024/shows/general/technology\nHow to Listen\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts, and search for WIRED Politics Lab. We’re on Spotify too.\n\nNote: This is an automated transcript, which may contain errors.\nLeah Feiger: This is WIRED Politics Lab, a show about how tech is changing politics. I'm Leah Feiger, the senior politics editor at WIRED. Last weekend, Donald Trump returned to Butler, Pennsylvania to hold a rally in the same place he was shot nearly three months ago.\nDonald Trump [Archival audio]: Our movement to make America great again stands stronger, prouder, more united, more determined and nearer to victory than ever before. We're going to make America great again, going to win the election, going to win the election.\nLeah Feiger: During his hour and a half long speech, Trump rattled off some of the hits. The borders aren't safe, the Democrats will cheat in the election. But Trump also had something new to offer at this rally, a special guest.\nDonald Trump [Archival audio]: He created the first major American car company in generations, and his rocket company is the only reason we can now send American astronauts into space.\nLeah Feiger: Elon Musk.\nDonald Trump [Archival audio]: Take over, Elon. Yes, take over.\nLeah Feiger: Over the last few weeks, Musk has become the most important Trump supporter there is. From his donations totaling millions of dollars to his promotion of conspiracy theories on X, the social platform he owns.\nElon Musk [Archival audio]: This is no ordinary election. The other side wants to take away your freedom of speech, they want to take away your right to bear arms, they want to take away your right to vote, effectively.\nLeah Feiger: We've wanted to do a Musk episode for a long time, and it's finally here. Why has Musk thrown himself into presidential politics? What does he get out of it, and is he going to help win Trump the Oval Office? Joining me today from Cork, Ireland, to talk about all of this is WIRED senior reporter David Gilbert. Hey, David.\nDavid Gilbert: Hey, Leah.\nLeah Feiger: And WIRED reporter Victoria Elliott, who was in Butler to see the rally up close.\nVittoria Elliott: Hey, Leah.\nLeah Feiger: Tori, what was the rally like? What did people tell you? What were you seeing?\nVittoria Elliott: The vibe that you got once you were in was like a fusion of an outdoor concert and church.\nLeah Feiger: Fun, that's a combo.\nVittoria Elliott: There were people who had picnic blankets, there was hot dogs for sale, and people came there from other places. There was one person who spoke to me who had driven there from Eastern Pennsylvania, which is about a five-hour drive. There were people there who had come from Ohio, the way that you would travel to go to a concert of someone you were really excited to see. And the reason I say it feels church-like, and I'm not the first person to say this, NPR earlier this week made that analogy as well, particularly with the idea that Trump was saved from assassination by the hand of God, was this feeling where you go in where everyone knows the lyrics to the song, everyone knows the call and response. And I think the thing that really hammered that home for me was there was a moment when Trump was speaking and somebody passed out in the stands, seemingly because they were maybe dehydrated. People started passing their water bottles forward to that person, and while they were waiting for a medic everyone spontaneously started singing the national anthem.\nLeah Feiger: So Trump brings Musk out, he calls him a truly incredible guy. Musk literally jumps into the air on stage, in what was captured in honestly one of the cringiest photos that I've seen online maybe this year, and then Musk talks to the crowd for a couple of minutes. What does he say? Talk us through that.\nVittoria Elliott: It's such a turn from 2020 when there's all this suspicion around mail-in ballots, around early voting. Now suddenly we're hearing, \"Make sure you're registered to vote, vote early, do this, do that, get everyone you know to vote.\" There's this really, really big get-out-the-vote push, and that is what Elon was on. When the assassin's bullet grazed Trump's ear, he got up and said, \"Fight, fight, fight.\" And Musk very consciously said, \"Vote, vote, vote.\" And everyone in the crowd immediately saw that parallel that—\nLeah Feiger: I mean, he drew it. Yeah.\nVittoria Elliott: People were very into that, and one of the things that Musk said that got a lot of reaction from the people that I was directly around was he said, \"The Second—”\nElon Musk [Archival audio]: The Second Amendment is there to ensure that we have the First Amendment.\nVittoria Elliott: He was there to whip up the troops, to really speak to the true believers, to push, push, push for voter turnout, because I think my sense with the way that the MAGA movement is right now is that they understand what the Biden team understood in 2020 where it's not about converting new people, it's about getting the people that are already on your team mobilized. He said, \"This election is the most important election of our lifetime.\" Quite normal. I think I've heard every politician say that for the last 20 years, but then he says, “You have to bring everyone you know to vote. If they don't, this will be—”\nElon Musk [Archival audio]: This will be the last election. That's my prediction. Nothing's more important, nothing's more important.\nVittoria Elliott: I even had some people repeat that to me on the way out of the rally, and that is also something he has been very public about saying on X, even before coming to this rally. A lot of times when Musk is speaking publicly or when he's interviewed, he will tamp back some of the rhetoric that he spreads online. If we think back to the Don Lemon interview, where he was confronted about the great replacement theory, he hedged a little bit on that.\nElon Musk [Archival audio]: I'm not buying some great replacement theory. I'm simply saying there appears to be a very clear incentive for Democrats to have to maximize the number of illegals, because it helps him win an election.\nVittoria Elliott: But that was not what was happening in this space. It definitely felt like you could have copied and pasted some of his posts on X into that speech.\nDavid Gilbert: Tori, one thing I'm really interested in, because I've never actually seen Elon Musk speak in person. Obviously I've seen him in interviews on TV and on X. Trump, when he's speaking at rallies, has this very specific way of speaking and way of relating to the crowd that's just unique to him. Obviously everyone saw that picture that Leah talked about, but was Musk able to connect with the audience there? Was he able to tap into that whatever it is that Trump has with his audiences?\nVittoria Elliott: I wouldn't say that he could tap into that without Trump leading him in. There was a guy behind me when Musk was speaking where he just went, \"He's so awkward, it's so funny.\" He's still himself. But I think one of the things the Democrats were really able to capitalize on in August was Tim Walz coming out and saying, \"These guys are weird,\" and Musk is weird, and it didn't bother people.\nLeah Feiger: When we got on our call after this rally, one of the big things you said to me was, \"These supporters do not care that Elon Musk used to not like Trump. These supporters do not care that JD Vance has tweeted some rough things about Trump. This is a open church, this is an open tent, and if you now all of a sudden are taking in the word of the gospel, you are welcome here.\"\nVittoria Elliott: Yeah, totally. Put on your red hat, get on the train, let's go. And I think that's something that was also really apparent to me was that people see Musk moving to the right, supporting Donald Trump, from being much more supportive of Democrats even a decade ago, as a win for their team. They're like, \"Wow, he has come to the light. He is on our team. Isn't this great?\" There isn't that suspicion of, \"Why is he here, why did he change? Why didn't he support him from the beginning?\" None of that.\nLeah Feiger: Absolutely. This is probably a good moment to get into Musk's past a little bit. Musk seems like he's all in on Trump now, but just two years ago he posted that \"Trump should hang up his hat and sail into the sunset.\" And The Wall Street Journal reported last week that he gave $10 million to Ron DeSantis when he was running for president. Why this sudden change of heart for Musk?\nDavid Gilbert: It's not really a sudden change of heart for Musk. If you look back at how he has gotten to this point, it started quite a long while ago, and he's always been this figure who's been contrarian, and while he was for a long time held up as this tech genius who was going to change the world—\nLeah Feiger: Founder of Tesla and SpaceX, big dreamer over here.\nDavid Gilbert: Yeah, but throughout it all there was always these little things that happened that signaled that something was a bit different. His willingness to come out and say things that are just completely false, and do it boldly and not back down from it has been there for a long time. And so, I think the reason now that he has fully embraced Trump is that since he bought Twitter and became a full-time troll on the platform, and seems to do pretty much nothing else than post tweets, he's seen that his credibility and his reputation from a huge cohort, of people in the U.S. especially, especially in Silicon Valley has waned because people have moved away from him because of what's happened on the platform, and now he is leaning fully into the people who do support him. The people who do support him and back what he's doing there are for a large part, Trump supporters who are boosting his posts and telling him he's brilliant, and Trump is saying it as well. So, that's why he's leaning in because he needs that confirmation, and he needs that admiration from those people.\nLeah Feiger: I think all of that is true. I still have a little bit of a hard time squaring this with the person who was previously an Obama, Clinton and Biden supporter. He told CNBC that he thought that Trump didn't have the sort of character that reflects well on the United States, he supported Hillary Clinton's policy platforms. In 2017 though, he did start to donate large sums to Republicans signaling this rightward shift. In the article that I mentioned from the Wall Street Journal, they said that starting in 2022 he spent $50 million on Conservative issues. This is just a ton of money to be throwing around. Is it strange that a guy who runs an electric car company is endorsing Donald Trump, who doesn't really appear to believe in climate change? Does this hurt Musk's bottom line in the long run?\nVittoria Elliott: At the end of the day, the Republican Party, especially the Republican Party under Trump, is the party of no taxes and no responsibility for big businesses, and even if Tesla itself has benefited from the support of the environmental movement from government contracts and support meant to transition us to clean energy, the reality is at the end of the day Musk is a billionaire with a lot of different businesses who doesn't want to pay taxes and doesn't want to be regulated. And so, whatever boost he may have gotten from Democratic administrations seeing Tesla as the standard-bearer for this one form of green energy transition, I think the reality is he is pretty cognizant of the fact that a Republican administration that deregulates many, many other things is fundamentally better for him overall. Let's not forget that Tesla has faced lawsuits against the way it's treated its employees, they've come under a lot of scrutiny, and Musk wants to help dismantle the NLRB, the National Labor Relations Board. So, even if a Republican administration might more hostile to something like-\nLeah Feiger: Carbon credits et al.\nVittoria Elliott: Yeah. The reality is he will still benefit from all these other forms of deregulation.\nDavid Gilbert: The biggest threat to Tesla isn't from culling carbon credits or anything like that, it's from China, because the Chinese electric car industry is hugely popular in China and they're trying to export around the world. And who's going to be the person who's going to stop them coming to the U.S. and putting the most taxes on any imports from China? That's Donald Trump.\nLeah Feiger: I want to bring up the infamous X space where Elon Musk interviewed Donald Trump back in August, and Musk was very open about this, is very clear about the fact that him and Trump disagree on these environmental issues, but very clearly also did not really seem to care. This one quote that Musk said during that interview, right after Trump suggested the need for additional US oil drilling, he said, \"My views on climate change and oil and gas probably differ from what most people would assume, because my views are actually pretty moderate in this regard.\" Then he says, “I don't think we should vilify the”—\nElon Musk [Archival audio]: I don't think we should vilify oil and gas industry and the people that have worked very hard in those industries to provide the necessary energy to support the economy, and if we were to stop using oil and gas right now we'd all be starving and the economy would collapse.\nLeah Feiger: A bit of a rollover. But then he goes on to ask if Trump will start a government efficiency body that Musk would be invited to join if the former president were reelected. What a quick pivot from, \"These are my beliefs. You don't agree with my beliefs. Also, can you give me a job in government?\"\nVittoria Elliott: Yeah. And I mean again, I think going back to the difference, we've seen a lot of, on the Democrat and left side of the political spectrum, there's a lot of nitpicking over policy. \"Oh, I don't agree with Kamala's stance on this. I don't like her record as a prosecutor,\" blah, blah, blah, blah, blah. Whereas I think the MAGA movement, because they have this “as long as you're on Team Trump, we can sort out the other stuff later” energy, people aren't bothered by that.\nLeah Feiger: We're going to take a quick break, but first we want to thank our friends at Amazon Music for naming WIRED Politics Lab one of the best podcasts this week. If you're new to the show, we're so excited you're here. And when we're back, we're going to talk more with David and Tori about whether they think must can really influence the election. Welcome back to WIRED Politics Lab. Musk showing up in Butler, Pennsylvania wasn't coincidental. Though the assassination attempt was initially what led Musk to outwardly endorsing Trump, which he alluded to in his speech.\nElon Musk [Archival audio]: We had one president who couldn't climb a flight of stairs, and another who was fist pumping after getting shot. \"Fight, fight, fight,\" blood coming down the face.\nLeah Feiger: I actually want to talk about what Musk has been doing since July that brought him so deeply into Trump's circle, and of course the biggest thing is that he's spending a ton of money. Tori, David, how much is he spending? How is he spending it? Where is it going?\nDavid Gilbert: Well, I suppose straight after the first Butler rally, he announced that he was fully behind Trump, he was going to start donating, and that triggered other people in Silicon Valley to decide to row in behind Trump and donate money to him as well. He was never as strong as he was at that point when Musk endorsed him. Since then, obviously the race has tightened considerably, but Musk hasn't tried to equivocate, he hasn't tried to back down. He's put money into it, but he's also put effectively the weight of his full platform behind Trump by promoting Trump's policies, by promoting Trump's conspiracies, and most recently by pushing this get out to vote effort where he's offering people cash money, $47 for each registered voter who they refer in a swing state that signs this petition in favor of free speech and the right to bear arms, and they're hoping to get one million voters signed up before the election.\nVittoria Elliott: Wow.\nLeah Feiger: And I mean, through the America PAC, which he founded, he's funneling millions of dollars to Republican candidates, right?\nVittoria Elliott: Yeah. He's sending about $8.2 million to 18 different districts where house races for the GOP are competitive right now.\nLeah Feiger: Wow. So, he's at the top of the ticket, he's at the bottom of the ticket. Musk is all over this.\nVittoria Elliott: Yeah, there was some really interesting reporting in August about how people were getting ads on Google and other platforms that looked like they were encouraging them to register to vote, and if you were in a state like California or Wyoming, where you have a solid dominance of one party or the other, it would just send you to an email sign up, but if you were in a swing state like Michigan or Pennsylvania, you would be urged to enter all of this data that the PAC has then funneled into helping Republican candidates campaigning in those states to identify possible likely voters with this real precision targeting in a way that maybe would've not been possible without Musk's backing, and without the ability to collect and collate that data.\nLeah Feiger: I mean, let's compare and contrast the Trump campaign and the Harris campaign a little bit right now. Dems are working with David Plouffe, an Obama-era adviser, their focus is very much on ground game, and being physically in person and getting out the votes. They had a few weeks of winning the internet those weeks after that Harris was announced as the Democratic nominee, but now it feels like they might be a bit behind. They're up against Elon Musk.\nVittoria Elliott: Yeah. When you had someone like David Plouffe doing Get Out The Vote, everyone was on Facebook. Even if Facebook was weird, it was a shared reality for young people-\nLeah Feiger: It was 2008, it was a different world.\nVittoria Elliott: ...you know what I mean? But now the internet is really fractured. The people who are on X are not necessarily the people who are on TikTok, and all these platforms also have way different rules about how you advertise, what kind of politics and stuff can be on there, their algorithms are inscrutable. We're dealing with a much more fractured internet space, and I would never say that getting out the vote, being in person is bad, but what I noticed with this Trump rally is that again, going back to the fusion of church rock concert vibe, is that that's a thing to do. You know what I mean? That's community in a way, it's people spending time with people who they agree with, who they share at least this major interest with. There was a real excitement about that, and I think door knocking is obviously very important, but I do think there is that level of community that is somewhat different than what you would get from door knocking one-on-one.\nLeah Feiger: But what I will say to that is that Musk, and the GOP, and Trump are getting a lot of heat right now for having a terrible ground game, that is tons of GOP strategists have been coming out being like, \"Their campaigns right now are absolute messes. This is a huge issue.\" On the other hand, you have Musk literally just last week tweeting out links to register in Arizona, register in Pennsylvania. These tweets are getting over 100 million views, these links are getting clicks. There's some combination here that perhaps they're not doing this 2008 era thing, but they're doing the 2024 Get Out The Vote online thing, and maybe that's going to be enough.\nDavid Gilbert: It's not necessarily about getting new voters to vote for Trump, it's about getting the people who are sympathetic to Trump already to actually vote. And when you look at what they're doing, we saw obviously what Musk is doing on X and getting huge numbers of people clicking on those links, we're also seeing groups like Turning Point USA having conferences, and trainings, and-\nLeah Feiger: Concerts.\nDavid Gilbert: ...concerts, and Get Out The Vote efforts. We're seeing the Courage Tour, which is this Christian nationalist tour going around the country to swing states only, it's only going to swing states, where they are talking to evangelical communities. They are reaching out directly to pastors so that the pastors will speak again to their own congregations, and they're activating these people who are traditionally Trump supporters but who may not actually vote. And there's, in the Turning Point USA, it's definitely more skewed towards a younger voter who in 2020 may not have turned out to vote for Trump, but they are trying to get those people there. They're in the communities that they know they can get people to vote for Trump, they're not trying to convert people who have spent the last eight years being angry at Trump and deciding that they don't want to vote for him. So, I think that idea of community that Tori spoke about at the rally, is something they're tapping into across the country at all these different types of events.\nVittoria Elliott: Community in person and online.\nDavid Gilbert: Exactly.\nVittoria Elliott: And that to me is slightly what I'm not seeing from the Harris campaign.\nDavid Gilbert: Because the online part of it is that X is a community, but it's a community of mostly—\nVittoria Elliott: Shit posters.\nDavid Gilbert: … shit posters and Trump supporters. And you know the Venn diagram of the two is mostly a circle.\nVittoria Elliott: I too, look to my community for the very best conspiracies about the latest humanitarian environmental disaster in the United States, talking of course about all of the hurricane conspiracies that Musk himself is promoting right now. This is such a trash fire.\nDavid Gilbert: Where does the Harris campaign go for its community? Because OK, we saw, as you said, the Brat summer stuff. There was a lot of success on TikTok and Instagram, but TikTok and Instagram aren't as partisan as X is, so they have to work harder to find their communities on those platforms. So, I think what the Trump campaign is doing in terms of targeting very specific types of voters is very clever, and could at least work to increase the number of people who are going to turn out to actually vote for Trump compared to 2020.\nLeah Feiger: He hasn't just been spending on the presidential race, he's been pouring money into congressional races too, which to me raises the question, is this about belief for him or more about extending his reach?\nVittoria Elliott: Who can know the inside of Elon Musk's heart? But if you think about it, this is someone who fundamentally believes that his mission in life is to send humanity to Mars. If that doesn't tell you the kind of reach that he wants to have, that it's not just about the U.S., it's not just about particular elections, he's thinking about this on a not even a whole world scale, on an interplanetary scale. Query whether there's a corner of public, or civic, or government or business life that he believes he shouldn't be touching.\nDavid Gilbert: I just fundamentally cannot take him seriously when he says anything about that this is a fight for our democracy, this is going to be the last election ever. All he's doing is he's built a platform where in order to succeed you need to be incrementally more extreme in your viewpoint than the next person. And because he has over the last two years just gone completely down this rabbit hole where he is parroting what Trump says in terms of immigrants coming into the country and they're going to steal the election, and the fact that this will be the last vote ever if Kamala Harris wins, all he's trying to do is to get it to the point where Trump wins and he continues to have some sort of influence over what happens at government level. Because as he said himself this week in an interview with Tucker Carlson, if Trump doesn't win he's screwed.\nElon Musk [Archival audio]: If he loses, I'm fucked.\nTucker Carlson [Archival audio]: It does seem that way.\nDavid Gilbert: He knows that if this happens, that he's put all his eggs in one basket and he needs it to work. For the next four weeks until the election, that he's just going to get worse, and worse, and worse in terms of pushing conspiracies and scaring people, because that's what he's doing. He's trying to scare people into voting.\nLeah Feiger: And he's not doing this in a vacuum. We've been kind of talking about this, but probably time for us to outright say it. Musk is the biggest political influencer around. He has 200 million followers on X, and not just that, he has total control over the social media platform's algorithm. People will see his posts no matter what. Let's get into some of the conspiracies and extremist ideas he's pushing with all of this. What's he saying right now? What's out there?\nDavid Gilbert: For the last couple of weeks, he's been pushing this idea that has been seeded by Trump and others in the GOP that floods of immigrants are going to come into the country, brought in by the Biden administration, who are all going to be registered and allowed to vote-\nLeah Feiger: Ridiculous.\nDavid Gilbert: … the election. Just no basis in fact, but it's absolutely taken hold. And then you've got Musk at a national level pushing it to his tens of million, or as you said, 200 million followers.\nLeah Feiger: Really dangerous. Really, really dangerous.\nDavid Gilbert: It's extremely dangerous, because there are people who are taking it seriously and who are going to be on alert on election day to watch for any people they see as not looking like them, and therefore, \"Oh, that must be an immigrant brought in by the Biden administration. I'm going to do a citizen's arrest.\"\nLeah Feiger: I mean, I'm thinking of the simplest, so many very normal, have been done for a very long time, Get Out The Vote techniques of having buses take senior citizens to go vote. That is super normal, incredibly legal. I think we're going to see a lot of tension over this in the coming weeks ahead.\nDavid Gilbert: A sheriff said to me a couple of months ago, if he sees a bus of people that he doesn't recognize he's going to take action on election day.\nVittoria Elliott: I spoke to someone who was a former Twitter employee, who worked on the trust and safety team, the people who keep hate speech and disinformation off the platform, most of whom Musk fired almost immediately after taking over the platform. And this person told me that one of their major concerns is not just what he is publicly posting and what's on the platform, but if you recall after January 6th, 2021, Twitter banned Donald Trump, and specifically because they were worried about incitement of violence, further incitement to violence after the insurrection. And what this person told me was that a lot of these sticky decisions around world leaders, around violent hate speech from public figures, that gets escalated to the top of the company. Often VPs and CEOs are the ones making those calls. And if you have a CEO, who is so clearly aligned with one party, one group of people, that's the person who's going to be making the call. And if you're a rank-and-file person at the company, you might be worried about even escalating that. You might be worried about voicing concerns about how content on this platform could materialize into real-world violence because you know what the political leanings of leadership are going to be.\nLeah Feiger: In addition to these anti-immigrant conspiracies, he has, God, he's run the gambit the last couple of months, hasn't he? I mean, promoting that the Secret Service was specifically making it so that Trump could get assassinated back in Butler, he said terrible stuff about trans people, trans rights, which obviously gets back to his daughter and just a lot of really sad, messy stuff there. He spread Springfield, it's never ending. Which brings us to this week where Musk has gone out saying that FEMA has been defunded and is not able to get help to people in need after Hurricane Helene, because all of the funding has gone to undocumented immigrants. It's wild.\nDavid Gilbert: There is no conspiracy that is trending on X that Musk will not entertain, it seems. The more people react to it, the more he enjoys it. I think there was a Guardian analysis of one day of Musk tweets a couple of months ago, and he tweeted 145 times-\nLeah Feiger: Oh my God.\nDavid Gilbert: … in the space of 24 hours. And that's including, I think—\nLeah Feiger: Sign off, my guy. This is just—\nDavid Gilbert: He did sign off for seven hours while he slept, maybe, I don't know. He must not do any other work, because how could you have the brain space to do anything else besides what he's doing? And it's only going to get worse from here on in I think, because he's—\nVittoria Elliott: Because he's now a campaign surrogate.\nLeah Feiger: He's a campaign surrogate. Which brings me to, is he influencing Trump or is Trump influencing him?\nDavid Gilbert: I think Trump is definitely influencing him obviously, because Trump is the one who has the power and can decide with the stroke of his pen what happens to his businesses effectively, because the project 2025 stuff shows he's willing to do pretty much anything if he gets back into power. But I think that it should not be underestimated that this idea that Musk would become the head of Department of Government Efficiency, if that does transpire. And Trump may be just playing with, and maybe this will never happen, but if it does, the fact that Musk is inside the building rather than outside the building should be really worrying given the extremist tendencies we've seen him push over the last two years.\nLeah Feiger: So back to the big question, and I want some real, quick, off-the-cuff answers from you both. Is Musk going to win Trump the White House?\nVittoria Elliott: I think that his Get Out The Vote efforts could definitely be a real game changer at the rally. Laura Trump actually came out before Trump and Musk got on the stage, and really emphasized the Get Out The Vote thing, and I watched the man in front of me sit down, pull up his phone, pull out his voter registration to confirm that he was registered. That is the game and Musk knows it, even if his tweets or his own profile does not elevate Trump, I can see the way that his money and his microtargeting could be really, really impactful.\nLeah Feiger: David, how about you?\nDavid Gilbert: I agree with Tori. What about you? What do you think is going to happen?\nLeah Feiger: There are a lot of billionaires out there right now that are lending support to both parties. You have Reid Hoffman of LinkedIn all in on Kamala Harris. You have Peter Thiel, these are folks that have a lot of money to throw around, and a lot of energy to dedicate to these causes and politicians. Musk is different. Musk is that billionaire, but he is different. He is singularly focused on Trump right now, he is singularly focused on getting Republicans into office. I don't know if we've ever seen that kind of singular focus from someone before that is so rich, so powerful, and has so much influence. He's positioned himself as a god, and considering that that's exactly what Trump has done as well, it's not a huge surprise to me that they have found such excellent partners in each other for this quest. But the commitment to the Get Out The Vote efforts, both online and off, is just going to be a force to be reckoned with and I'm not sure the Democrats are ready.\nVittoria Elliott: And not necessarily even a god, he's Tony Stark. He's a Marvel hero.\nLeah Feiger: He's a Marvel hero.\nVittoria Elliott: And that is, I think he's benefiting from 10 to 15 years of great press coverage, and this is what he's doing with it.\nLeah Feiger: We're going to see what happens. But for now, going to take a break, and when we're back it's time for Conspiracy of the Week. Welcome back to WIRED Politics Lab. I'm excited to get back to my favorite part of the show, Conspiracy of the Week, where our lovely guests bring their favorite conspiracies they've come across recently, and I pick my favorite. Tori, David, I got to tell you, because we didn't do Conspiracy of the Week last week due to the vice presidential debate, I had a number of people at my Air of Rosh Hashanah dinner very upset that we had missed it. Do we have some good conspiracies for them to make up for our failings?\nDavid Gilbert: Oh, we sure do.\nVittoria Elliott: I have a non politics conspiracy, so everyone can have a little palate cleanser.\nLeah Feiger: Excellent. Tori, take it away.\nVittoria Elliott: Yeah, so this is an old one, but it's one that I just discovered which means it is news. I, like The New York Times, can be the only breaker of news, and this conspiracy is that Beyonce and Solange Knowles are not actually sisters. That Beyonce is actually secretly Solange's mother, and that she had Solange when she was a teenager but then there was a scramble to cover it up. And this has been a thing apparently in the R&B music conspiracy world for a long time, and it was kicked off by a couple of different things. But one was that the actress Gabrielle Union, who was in a bunch of movies, but in my favorite movie 10 Things I Hate About You—\nLeah Feiger: Oh, I was going to say, I think her best role was actually Bring It On.\nVittoria Elliott: Oh, agree. I also love Bring It On, but I love 10 Things I Hate About You better. But she has said in 2008 that she and Beyonce were teenagers together, and Gabrielle Union was born in 1972 and Beyonce was born in 1981. So, that kicked off this firestorm of like-\nLeah Feiger: Oh my goodness.\nVittoria Elliott: ...\"What do you mean? You're 10 years older than her, how are you the same age?\" And obviously—\nLeah Feiger: Figure of speech. They were coming up in the industry at the same time.\nVittoria Elliott: Right, but that has not stopped the internet for literally over a decade perpetuating this conspiracy that Beyonce is actually secretly much older than she says and that Solange is her daughter from when she was a teenager.\nLeah Feiger: That is so ridiculous, but I will absolutely Google this after we finish recording.\nVittoria Elliott: You are welcome.\nLeah Feiger: Thanks, Tor. David, how about you?\nDavid Gilbert: I just feel I have to do a hurricane conspiracy.\nLeah Feiger: You have to.\nDavid Gilbert: Because it's just been dominating my feeds for the last couple of weeks now, but especially in the last couple of days. I suppose, just in case you haven't seen anything, the idea being pushed at the moment by congresspeople and far-right influencers and everything is that the Hurricane Milton has been orchestrated by the government and is being controlled by them and to target people in Florida. So, that's the idea. It stems from the idea that chemtrails have been used to create weather back in the day. This has a long, long history, this conspiracy.\nLeah Feiger: It's so wild. It's not just about targeting people in Florida, right? It's about specifically targeting Republicans.\nDavid Gilbert: Well, it depends on which conspiracy track you've gone down.\nLeah Feiger: Which pill did we take today, Neo?\nDavid Gilbert: Exactly. So, some people believe that it's targeting Republicans, some people believe it's linked to the idea that it'll affect the election outcome, some people believe that it's a cover for bringing in the immigrants that will actually affect the election while the hurricane is happening.\nLeah Feiger: Unreal.\nDavid Gilbert: But my favorite one I think is the fact that this is just part of the New World's Order depopulation efforts. So, people are just absolutely losing their minds on this, and it's absolutely everywhere. It's not confined to US conspiracy groups; it's everywhere. And my Irish conspiracy groups that I'm in, everyone is talking about it. So, it's a conspiracy that's gone everywhere really quickly—\nLeah Feiger: Life of its own.\nDavid Gilbert: … and it's really disturbing. Yeah.\nLeah Feiger: For all of our lovely listeners, we actually have an article about this on WIRED.com right now. We're going to list it in the show notes for you, but these hurricane conspiracies have really taken on a life of their own, and our thoughts are with everyone that's going to be affected this week and have been affected already. David, just on account of the fact that it made me so sad, I think that I'm going to have to pick Tori's conspiracy this week.\nDavid Gilbert: That's fair.\nVittoria Elliott: Wow. We've really turned a corner here.\nLeah Feiger: Tori, congratulations. This is a good one, I know you've been looking for a win for a while now.\nVittoria Elliott: Thank you, yeah.\nLeah Feiger: Anyone you'd like to thank on this journey?\nVittoria Elliott: No, just me.\nLeah Feiger: Just me. Thank you both so much for joining us this week.\nDavid Gilbert: Yeah, it's been great.\nVittoria Elliott: Thanks for having us, Leah.\nLeah Feiger: Thanks for listening to WIRED Politics Lab. If you like what you heard today, make sure to follow the show and give us five stars. We also have a newsletter, which MaKena Kelly writes each week. The link to the newsletter and the WIRED reporting we mention today are in the show notes. If you'd like to get in touch with us with any questions, comments, or show suggestions, please, please write to PoliticsLab@WIRED.com. That's PoliticsLab@WIRED.com. We're so excited to hear from you. WIRED Politics Lab is produced by Jake Harper, Pran Bandi is our studio engineer, Amar Lal mixed this episode, Steven Valentino is our executive producer, Chris Bannon is global head of audio at Conde Nast, and I'm your host, Leah Feiger. We'll be back in your feeds with a new episode next week.","summary":"The increasingly outspoken tech mogul spoke at a Trump rally this weekend in one of the most contested battleground states.","url":"https://www.wired.com/story/elon-musk-donald-trump-election/","image":"https://media.wired.com/photos/67041515cef303b0aeb7593a/16:9/w_2000,h_1125,c_limit/PL-Elon-Trump-Rally-Politics.jpg","video":null,"publish_date":"2024-10-10 21:49:47","author":"Leah Feiger","authors":["Leah Feiger"],"language":"en","category":"politics","source_country":"US","sentiment":-0.029},{"id":259253214,"title":"Trump Promises Tax Deduction for Car Loan Interest, Incentives for Auto Industry","text":"DETROIT—Former President Donald Trump announced new tax incentives aimed at revitalizing auto manufacturing, including new credits for research and development, expanded claims of equipment costs for small businesses, and consumer tax deductions for car loan interest, as a presidential campaign promise.\n\nThe incentives are in addition to Trump’s previous promises to manufacturers, which include a lower corporate tax rate for U.S.-based manufacturers, increased tariffs on imported automobiles, and increased domestic energy production, which is intended to attract manufacturers to U.S. soil.\n\nThe announcement was made at a gathering of some 500 business leaders at the Detroit Economic Club on Oct. 10.\n\nThe intense focus on domestic manufacturing and automaking demonstrates the importance of Michigan’s 15 electoral votes to the Trump campaign in the 2024 presidential race.\n\nTrump trails Democratic presidential nominee Vice President Kamala Harris by just 1 percentage point in an average of recent Michigan polls, one of seven battleground states likely to decide the election.\n\nThe Republican candidate said the series of new tax incentives for auto manufacturers would promote the building of large, modern auto plants and help make the United States an industrial superpower.\n\nThose incentives include expanded tax credits for research and development, a 100 percent tax write-off for heavy equipment in the first year after purchase, and full expensing for new manufacturing investments.\n\n“I intend for the triumph of the American Auto Industry to be among my greatest legacies,” Trump said.\n\nFor small businesses, Trump announced a doubling of the amount they can deduct for equipment purchases from $500,000 to $1 million.\n\nFor consumers, Trump announced that interest on car loans would be fully tax-deductible, similar to the interest on home loans.\n\nTrump had previously announced that he would incentivize manufacturers to produce goods in the United States by offering a 15 percent corporate tax rate for companies that make their products stateside, down from the current rate of 21 percent, and imposing a 100 percent tariff on imported automobiles.\n\nThe former president has also promised to reduce the price of gasoline by 50 percent within one year of taking office by increasing domestic oil production and doubling the production of electricity, which he said would further attract manufacturers.\n\nVice President Kamala Harris has also wooed auto workers and manufacturers.\n\n“We announced the opening of more than 20 new auto plants in the United States, and we did it by investing in American industry and American workers.”\n\nA key element of those protections is the imposition of increased tariffs, a move that Harris has repeatedly called a tax on the American people.\n\n“I want tariffs, but there has to be reciprocity,” Trump said, meaning an equal trade footing between the United States and other countries.\n\n“Without that tariff, every single one of the Detroit Big Three could right now be out of business,” Trump said on Oct. 3.\n\nSpeaking of Chinese automakers who are locating plants in Mexico in an apparent attempt to sell electric vehicles in the United States, Trump said: “I will impose whatever tariffs are required ... 100 percent, 200 percent, whatever is necessary.”\n\nThe U.S. goods trade deficit with Mexico totaled $130.5 billion in 2022, a 23.7 percent increase from 2021, according to the Office of the U.S. Trade Representative.\n\nTrump won the state by fewer than 10,000 votes in 2016. Then-presidential candidate Joe Biden carried Michigan by about 154,000 votes in 2020.\n\n“Neither candidate has won Michigan yet,” Rep. Debbie Dingell (D-Mich.) told The Epoch Times.\n\n“I think this is a purple state. I think it’s competitive. It’s coming down to Pennsylvania and Michigan.\n\nDingell, a board member of the Detroit Economic Club, said she attended Trump’s speech in an effort to bring civility back to politics.\n\nBoth candidates have campaigned heavily in Michigan on the economy, and some attendees listed that as their top concern in this election.\n\n“The economy and prices,” Nabby Yono, 74, of West Bloomfield, told The Epoch Times.\n\n“Inflation,” Kenny Logan, 29, of Detroit, said.\n\n“It’s the cost of living,” Leo Terzo, 29, of Detroit, said. “And uncertain markets and interest rates.”\n\nSome attendees were more concerned about other issues.\n\nFor Arin Steinhauser, the lack of civility in politics looms larger than economic issues.\n\n“You can’t get anything done if you can’t work together,” Steinhauser, 40, of Detroit, told The Epoch Times.\n\n“My No. 1 issue is definitely the open borders. Zero safety. No one feels safe anymore,” Sofija Sinishtaj, 41, of Troy, Mich., told The Epoch Times.\n\nBeyond the business community, some Michiganders expressed more frustration with politics than interest in the election.\n\n“I must have gotten a pound of mail from the campaigns in the last month,” Patricia Burlock, 62, of Harrison Township, told The Epoch Times.\n\nFrustrated by the negative messaging, Burlock said: “I don’t think I’m going to vote this year.”\n\nSam, 51, of Detroit, who declined to give his last name, lamented that moderates seem to have no place in the current political landscape.\n\n“I would love, for some really strong, moderate third party to rise out of the ashes. But I just don’t think our current system will ever allow that to happen,” he told The Epoch Times.\n\n“Unfortunately, some of the insanity that’s going on forces you to make votes that are maybe against your principles but for the safety and sanctity of the country,” Steinhauser said.\n\n“It’s a difficult decision to be made.”","summary":"At a speech in Detroit, the former president unveiled new policies in his presidential campaign targeting auto manufacturing.","url":"https://www.theepochtimes.com/us/trump-promises-tax-deduction-for-car-loan-interest-incentives-for-auto-industry-5739189","image":"https://img.theepochtimes.com/assets/uploads/2024/10/10/id5739261-10102024-DSC04059-Trump-300x180.jpg","video":null,"publish_date":"2024-10-10 21:48:51","author":"Lawrence Wilson","authors":["Lawrence Wilson"],"language":"en","source_country":"us","sentiment":-0.022},{"id":259253282,"title":"Trump complains about disaster response; Biden says he should get a life","text":"Donald Trump on Thursday lobbed new complaints about the federal response to a pair of hurricanes that ravaged large swaths of the Southeast, as he again seeks to increasingly turn two deadly storms to his political advantage ahead of the November election.\n\nThe former president spoke at the Detroit Economic Club, shortly after his Democratic opponent, Vice President Kamala Harris, virtually attended a briefing, held in the White House Situation Room, on emergency efforts in Hurricane Milton's wake. Harris is scheduled to attend a Univision town hall in Las Vegas and an evening rally in Phoenix as she remains in close contact with federal authorities about the storm.\n\nTrump offered empathetic messages to people affected by Hurricanes Helene and Milton, which came ashore Wednesday night. Trump also suggested that the federal response had been lacking, particularly in North Carolina, where he alleged the government after Helene had “not done what you’re supposed to be doing.\"\n\n“They’ve let those people suffer unjustly,” said Trump, who has for several days promoted falsehoods about the response of President Joe Biden and emergency management officials.\n\nPresident Joe Biden has repeatedly slammed Trump for spreading misinformation about federal assistance available to victims, including falsely claiming that such assistance is capped at $750. In reality, that is just for immediate needs, the first potential payout rather than the total.\n\n“That $750 that they’re talking about, Mr. Trump and all those other people know it’s a lie to suggest that’s all they’re going to get,” Biden said Thursday. “It’s just bizarre. They got to stop this. They’re being so damn un-American with the way they’re talking about this stuff.”\n\nAsked if he planned to speak with Trump to urge him to stop, Biden said he wouldn’t, but followed that with a message delivered directly into television cameras: “Mr President Trump, former President Trump, get a life, man. Help these people.”\n\nDespite the storm, Trump and Harris are visiting key swing states Thursday, using their travel strategically, trying to increase support with key voting blocs who could decide an election expected to be exceedingly close.\n\nIn Michigan, where he's looking to appeal to primarily to blue-collar voters, Trump took a swipe at the city he happened to be campaigning in, suggesting that Detroit was “a mess.”\n\n“Our whole country will end up being like Detroit if she’s your president,\" he said of Harris. “You’re going to have a mess on your hands.”\n\nHe also used his speech to echo core themes from his 2016 campaign, saying some other countries, especially China, are ripping the U.S. off and taking manufacturing business away. Trump said powerful companies have “raped” the United States and vowed to impose huge tariffs that he said would force other countries to negotiate what they charge on American products.\n\n“They’ve been screwing us for so many years that we’re allowed to get some of that back,” Trump said about charging tariffs from countries.\n\nEconomists warn Trump’s proposed tariffs would drive up consumer costs. Trump has also claimed, without providing specifics, that he can use tariffs to reduce the U.S. budget deficit and pay for an expansion of childcare funding, even as he proposes other ideas to end taxes on things like tips and Social Security without saying how he would replace the lost funding.\n\nBut the former president seemed to not understand the difference between the budget deficit and trade imbalances, conflating the two different economic measures as essentially being the same thing.\n\nHe noted that the federal government has nearly $36 trillion in total debt, a byproduct of the annual borrowing needed to cover the gap between tax revenues and government spending. Except Trump then seemed to indicate that the debt was a byproduct of the trade deficit with China, which is a separate issue that reflects the difference between how much a country exports and how much it imports.\n\n“We have $36 trillion in debt,” Trump said. “For years and years and years, we’ve been accumulating. We’d have these deficits that are monstrous. We had 5,6,7 $800 billion deficit with China.”\n\nHe also claimed that “we had the highest job numbers in my administration” but that isn’t true any longer. The unemployment rate fell slightly lower under Biden — to 3.4% early last year, the lowest in a half-century, below 3.5% before the pandemic under Trump.\n\nHarris is out west, as she looks to increase support among Hispanic voters, especially men. Her campaign began a group this week known as “Hombres con Harris” which is planning to hold upcoming events at Latino-owned small businesses, union halls, barbecues and community events until Election Day.\n\nThe Harris campaign has also aimed to reach Hispanic voters who may not be closely following the election by doing things like having Julie Chavez Rodriguez, Harris' campaign manager, attend the recent boxing match between Canelo Alvarez and Edgar Berlanga in Las Vegas, and holding events at churches and elsewhere to mark Mexican Independence Day in September.\n\nHarris' campaign also announced last month that it was spending $3 million on Spanish-language radio ads and focusing on sport events like baseball games and boxing matches. Harris’ appearance in Nevada also coincided with a Democratic National Committee effort to put bilingual billboards in Las Vegas and ads promoting the importance of voting in Spanish-language newspapers in southern Nevada.\n\nHispanic voters are about evenly split on whether to trust Harris or Trump to do a better job handling the economy, but they give the former president an edge on handling immigration. About 4 in 10 Hispanic voters trust Trump more on the economy, and a similar share trust Harris more.\n\nWhen it comes to handling immigration, 45% of Hispanic voters trust Trump more and 38% trust Harris more. Hispanic women voters are more likely to trust Harris to better handle the economy and immigration, and Hispanic men are more likely to trust Trump on both issues, according to polling from The Associated Press and NROC Center for Public Affairs Research.\n\nMeanwhile, former President Barack Obama is also hitting the campaign trail Thursday night, making his first appearance for Harris at a rally in Pittsburgh. Obama's team says he will focus on swing states, especially those with key Senate races. Biden has just made one joint campaign appearance with Harris since he himself left the race in July.\n\nAssociated Press writers Christopher Rugaber and Josh Boak in Washington Adriana Gomez Licon in Fort Lauderdale, Florida, contributed to this report.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Donald Trump on Thursday lobbed new complaints about the federal response to a pair of hurricanes that ravaged large swaths of the Southeast, as he again seeks to…","url":"https://japantoday.com/category/world/trump-and-harris-keep-campaigning-after-milton-hits-florida","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/b3/6d/fa5d453025526d9ed987551decd65e1466fd/download/_w1700.jpg","video":null,"publish_date":"2024-10-10 21:47:34","author":"Isabella Volmert,Japan Today Editor","authors":["Isabella Volmert","Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.413}]}