{"offset":0,"number":50,"available":378,"news":[{"id":327470784,"title":"Usha Vance says this is time of ‘great opportunity’ in ties with India","text":"Washington, June 3 (SocialNews.XYZ) US Second Lady Usha Vance has said that this was a time of opportunity in the bilateral relationship with India and spoke effusively of her recent visit to India along with her husband, Vice-President J.D. Vance, and their three children for whom, she added, it was a \"mindblowing\" experience.\n\nThe Second Lady, who participated in a rare public interview at an event hosted by the US-India Strategic Partnership Forum, spoke feelingly about the bond her three children forged with Prime Minister Narendra Modi as a grandfather figure.\n\n\"This is a time of great opportunity. And I think if my husband were here, he'd say the same thing,\" she said when asked by the interviewer for her personal take on the bilateral relationship.\n\n\"Obviously, the US and India, their relationship has ebbed and flowed at times. There are times when one country's needs and one country's goals are different from the other. But right now, I think in the next four years and in the future, the fact that there is this established Indian-American population here and so many people in India who know the country and know the people who are here doing great things, having great opportunities.\"\n\nShe added: \"When we were visiting recently, I was just struck by the number of people who came up to me to say how much they loved our country, how they visited family, how they visited just for pleasure, that they were hoping for a close relationship. Looking forward, and I think these personal ties actually really have something to do with it.\"\n\nThe Vances were in India in April for the first vice-presidential visit in 13 years, coming after Vice-President Joe Biden's in 2013, when he was a part of the then President Barack Obama's administration.\n\nThe succeeding two Vice-Presidents -- Mike Pence and Kamala Harris, who is also of Indian descent, never got around to make the trip.\n\n\"It really was the trip of a lifetime for us, my children had never been to India. What would the pandemic and J.D. century mean to politics and all that, and so they'd grown up just knowing so much about this country, the stories, the food, the relationships with grandparents and friends, but they had never actually seen it. So it was just sort of mindblowing from their perspective. And then for me and J.D., I think it just could not have been any more special,\" Usha Vance said.\n\n\"We had the opportunity to see some of the greatest sights in north India. We're looking forward to our next trip and trying to get to the parts of the country where my family is from as well. And it just was sort of one hit after another, right? The most incredible food, the peacocks that we got to see everywhere we went, getting to see the Taj Mahal in the morning and appreciate it as the sun was just sort of coming up, and the cool skies and blue skies over in the background. And of course, as you mentioned, meeting the Prime Minister was really very special.\"\n\nThe Vances had met the Prime Minister Modi by this time.\n\nTheir first meeting was in Paris on the sidelines of an AI summit in February.\n\n\"They were sort of sleep deprived in Paris, and they saw an Indian man with a white beard and white hair, and they just put him the grandfather category immediately. So they are very into him. They just love him. And he really cemented his status by giving our five-year-old a birthday present that day. So when we were able to visit his home, they just sort of ran up. They were hugging him. He was just incredibly kind and generous to them.\"\n\nSource: IANS","summary":"Washington, June 3 (SocialNews.XYZ) US Second Lady Usha Vance has said that this was a time of opportunity in the bilateral relationship with India and spoke effusively of her recent visit to India along with...\n\n\nThe post Usha Vance says this is time of &#8216;great opportunity&#8217; in ties with India appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/06/02/usha-vance-says-this-is-time-of-great-opportunity-in-ties-with-india/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/06/03/202506033419444.jpg?fit=740%2C399&quality=80&zoom=1&ssl=1?v=1748911205","video":null,"publish_date":"2025-06-02 23:29:37","author":"Gopi","authors":["Gopi"],"language":"en","source_country":"in","sentiment":0.209},{"id":327463698,"title":"Paramount Global nominates three board directors as Skydance merger awaits approval - TradingView","text":"Paramount Global PARA nominated three new directors on Monday, seeking to boost its board strength to seven as it awaits regulatory approval for its $8.4 billion merger with Skydance Media. \n\nParamount nominated Mary Boies, counsel to Boies Schiller Flexner LLP, Charles Ryan, co-founder and general partner of Almaz Capital, and Roanne Sragow Licht, former justice and adjunct professor at Boston University and Roger Williams University. \n\nU.S. President Donald Trump filed a $10 billion lawsuit against Paramount-owned CBS News in October, alleging that the network deceptively edited an interview with then-vice president and presidential candidate Kamala Harris, to \"tip the scales in favor of the Democratic Party\" in the election.\n\nTrump's lawsuit is seen as a major roadblock to the Paramount-Skydance merger, according to some analysts. \n\nThe merger requires approval from the U.S. Federal Communications Commission, which has authority over the transaction because it needs to approve the transfer of the broadcast television licenses held by CBS.\n\nParamount, chaired by Shari Redstone, reportedly offered $15 million to settle the suit.\n\nTrump raised his claim for damages to $20 billion in February.\n\nThe Wall Street Journal reported last week that the company wanted to ensure it had a full board in place in case its negotiations with Trump to settle his lawsuit fell through.\n\nParamount is scheduled to hold its annual stockholder meeting on July 2.","summary":"Paramount Global nominates three board directors as Skydance merger awaits approval  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L3N3S51CC:0-paramount-global-nominates-three-board-directors-as-skydance-merger-awaits-approval/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-06-02 23:03:17","author":"Shari Redstone","authors":["Shari Redstone"],"language":"en","source_country":"gb","sentiment":-0.036},{"id":327457440,"title":"Will Jersey EV drivers suffer for Phil Murphy’s slap at Elon Musk?","text":"In what sure looks like petty partisanship with zero regard for the public interest, the New Jersey Turnpike Authority is kicking 64 Tesla EV “superchargers” off the highway’s service areas.\n\nDemocratic hacks are very, very mad at Elon Musk for not only working hard (and giving big) to help President Donald Trump beat Kamala Harris, but for his DOGE drive to slash federal waste (which Dems know mostly feeds their special interests).\n\nJersey is one of several states suing to block DOGE access to Treasury records, and Musk sparred with Gov. Phil Murphy (who basically controls the Authority) on X, cheering when Border Czar Tom Homan said he’d check out Murphy’s claim to be hiding an illegal immigrant in his home.\n\nMusk’s company clearly saw this coming: It’s already built 116 charging stations just off the Turnpike to preserve Tesla drivers’ access to speedy turnarounds.\n\nTesla warns the decision “removes Turnpike access to the most reliable (99.9% uptime), least congested (<1% waiters) and cost-effective (~30% lower $/kWh) charging,” but only time will tell if the new contractor, Applegreen Electric, provides adequate service. \n\nJersey being Jersey, don’t be surprised if Applegreen falls short, nor if the company turns out to have connections to Garden State Democrats.","summary":"In what sure looks like petty partisanship with zero regard for the public interest, the New Jersey Turnpike Authority is kicking 64 Tesla EV “superchargers” off the highway’s service areas.","url":"https://nypost.com/2025/06/02/opinion/will-jersey-ev-drivers-suffer-for-phil-murphys-slap-at-elon-musk/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/general-view-tesla-car-dealership-105228343-e1748903490259.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-02 22:55:20","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"zm","sentiment":-0.593},{"id":327458714,"title":"California Dem doubts someone from their state could win presidency since they're thought of as 'crazy people'","text":"California Democrats at their annual state convention had mix feelings about whether someone from their state could win on a national level after former Vice President Kamala Harris lost in 2024. Delegates convened over the weekend with guests to induct new members and plan for the 2026 election season. Although Harris and California Gov. Gavin Newsom have both been seen as potential 2028 Democratic presidential contenders, neither appeared at the convention, with Harris only addressing the convention via video. The convention largely avoided discussions about the 2028 election, with at least one delegate wondering if a liberal Californian could win on the national stage at all. CALIFORNIA DEMOCRATS UNCERTAIN ABOUT KAMALA HARRIS’ POTENTIAL RUN FOR GOVERNOR \"I don’t know if a California Democrat can win a presidential election,\" delegate Jane Baulch-Enloe told the Los Angeles Times. \"California is thought of as the crazy people... I don’t mean that in a bad way — though I know some people do — but we do things differently here.\" Baulch-Enloe instead insisted California Democrats first need to \"get people on our side and help them understand that we aren’t just wacko liberals and teach people that it’s okay to want things\" like higher wages or universal healthcare. Other attendees, such as Asian American Pacific Islander caucus leader Aref Aziz, argued that Democrats need to have a clearer perspective and message on the economy if they want to win more elections. \"When you look at a lot of our economies, California and New York, by all accounts, GDP, the numbers that you look at, they’re doing great,\" Aziz said. \"But when it comes to the cost that consumers are paying in these places, they’re so high and so far above other countries that we end up diminishing whatever value there is in our GDP, because everything’s so expensive.\" However, not all delegates believed California’s liberal policies would be a hindrance to future elections. LAURA: COURTESY OF HORRID LIBERAL POLICIES, CALIFORNIA IN A METAPHORIC SENSE, HAS BEEN BURNING FOR DECADES \"People like to point a finger somewhere, and I think California is an easy target, but I disagree,\" delegate Melissa Taylor told the LA Times. \"Because I think that California is standing up for values that the Democratic Party believes in, like we believe in labor, we believe in healthcare, we believe in women’s rights, we believe in rights for LGBTQ people.\" Jodi Hicks, the president of Planned Parenthood Affiliates of California, added that Harris’ loss was prompted by multiple \"unique\" factors, including her short three-month campaign, rather than politics. However, she agreed Democrats need \"to walk and chew gum at the same time\" when it comes to promoting liberal policies and helping the economy. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to the California Democratic Party for comment.","summary":"The California Democratic Party held its annual convention over the weekend to begin strategizing on how to appeal to more voters ahead of the 2026 elections.","url":"https://www.foxnews.com/media/california-dem-doubts-someone-from-state-could-win-presidency-since-theyre-thought-crazy-people","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Gavin-Newsom.png?ve=1&tl=1","video":null,"publish_date":"2025-06-02 22:33:57","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"US","sentiment":-0.033},{"id":327456446,"title":"Paramount Nominates 3 New Board Members Amid Trump Lawsuit, Pending Skydance Deal ","text":"Paramount Global has nominated attorney Mary Boies, former judge Roanne Sragow Licht and venture capitalist Charles Ryan to its board of directors.\n\nPer the company’s proxy filing, the trio were nominated by the media giant’s governance committee after being introduced by a “non-management director and stockholder.” They will stand election during the company’s annual meeting on July 2.\n\nThe move comes as Paramount and President Donald Trump are currently in mediation talks about a potential settlement of the latter’s $20 billion lawsuit against CBS and “60 Minutes” for an Oct. 7 interview with former Vice President Kamala Harris. \n\nTrump’s attorneys have claimed that the interview was deceitfully edited and caused him “mental anguish and confusion.” They also said that “viewers withheld attention from President Trump and Truth Social,” his social media platform, due to the “false advertising and tampering” tied to the Harris interview, resulting in a decrease in value for Trump Media and Technology Group and his other media holdings.\n\nThe Wall Street Journal reported that Trump recently shot down Paramount’s offer to settle the lawsuit for $15 million, with the president aiming to get at least $25 million and an apology.\n\nMeanwhile, Paramount’s pending $8 billion merger with Skydance deal remains in regulatory limbo with the FCC and recently triggered its first automatic 90-day extension after failing to close by April 7. The agency’s review is due to a required transfer of broadcast licenses of Paramount’s 28 owned-and-operated local TV stations.\n\nFCC chairman Brendan Carr has argued that the settlement talks with Trump are unrelated to the agency’s review of the Skydance deal. But he has warned that “all options remain on the table” in the agency’s ongoing investigation into allegations of “news distortion,” including potentially revoking CBS’ broadcast license if the network is found to have violated the agency’s public interest standard. As part of that investigation, CBS News turned over transcripts and video footage from the Harris interview. \n\nBoies has served as counsel to Boies Schiller Flexner LLP since 2011, where she specializes in antitrust and corporate commercial litigation. \n\nBefore that, she was founder and managing partner of Boies & McInnis LLP, vice president at CBS Inc., general counsel of the U.S. Civil Aeronautics board, assistant director of the domestic policy staff at the White House and counsel to the U.S. Senate Committee on Commerce. She’s also a member of the Stimson Center’s board of directors, the Middle East Institute’s board of governors, a member of the Council on Foreign Relations and vice chair of the Business Executives on National Security. \n\nRyan is a co-founder and general partner of the Silicon Valley-based venture capital firm Almaz Capital. He has also been a director of Nebius Group N.V.since 2011, where he serves on the audit committee, ClickHouse since 2021 andPGI since 2005. Additionally, Ryan is a member of the Advisory Panel at Harvard Global Advisory Council and Capital Group International.\n\nHe co-founded United Financial Group (UFG) in 1994 and served as itschairman and CEO until 2006. From 2006 to 2008, he was chief country officer and chief executive officer of Deutsche Bank Group in Russia after it acquired UFG’s investment banking business. From 2008 to 2022, he served as chairman of UFG asset management, which remained independent from the UFG acquisition. He also worked as a consultant at Deutsche Bank. In 2013, Ryan co-foundedLiberty Energy Trust and Liberty Infrastructure Trust, which provides solutions for financing and managing energy related and infrastructure projects in Pennsylvania and the Eastern United States.\n\nLicht served as a judge for more than three decades, including as associate justice of the District Court of the Trial Court for the Commonwealth of Massachusetts, the First Justice of the Cambridge District Court, and the Regional Administrative Judge for Essex and Middlesex County Courts. She’s also an adjunct professor at Boston University Law School and Roger Williams University, as well as a special advisor in the Middlesex County District Attorney’s Office. \n\nAdditionally, Licht served on the Anti-Defamation League of New England’s board of directors for 30 years, currently serves on the board of the New England Institute of Technology, and is a member of Legal Services Corporation Leaders Council, a national coalition that fights for the rights of low-income people.\n\nThe appointments follow the departure of four board members last year, who stepped down in the midst of Paramount and Skydance’s deal talks. \n\nCharles Phillips Jr., who led the special committee that brokered the deal, also revealed in October that he would step down ahead of the Skydance deal’s closing.\n\nIn addition to Boies, Licht and Ryan,the current board members standing for reelection are Barbara Byrne, Linda Griego and Susan Schuman and current controlling shareholder and non-executive chairwoman Shari Redstone.","summary":"Mary Boies, Roanne Sragow Licht, Charles Ryan will stand election at the media giant's annual meeting on July 2\n\n\nThe post Paramount Nominates 3 New Board Members Amid Trump Lawsuit, Pending Skydance Deal  appeared first on TheWrap.","url":"https://www.thewrap.com/paramount-mary-boies-roanne-sragow-licht-charles-ryan-board-nominees/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/rump-1.jpg","video":null,"publish_date":"2025-06-02 21:36:14","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","source_country":"US","sentiment":-0.134},{"id":327441198,"title":"Nevada Becomes the 21st State To Strengthen Donor Privacy Protections","text":"On Thursday, Nevada Gov. Joe Lombardo (R) signed Assembly Bill 197 into law, prohibiting state agencies from demanding or releasing personal information of nonprofit supporters—actions that could potentially chill speech or violate the right to privacy. With the bill's passage, Nevada becomes the 21st state to strengthen First Amendment protections for donors, volunteers, and members of nonprofit organizations.\n\nThe A.B. 197, which was cosponsored by Assemblymembers Shea Backus (D–Las Vegas) and Gregory Hafen (R–Pahrump), clarifies that state governmental entities cannot require nonprofit organizations that have applied for or received a 501(c) tax-exempt status from the IRS to disclose personal information of their supporters, including names, addresses, phone numbers, and donation details. Only certain exceptions apply, such as when such information is required under federal law or a court order, in which case the state must keep the individuals' personal information confidential. Anyone harmed by a violation of this law may bring a civil action against the state and seek damages. \n\nNonprofit donor privacy is constitutionally protected under the First Amendment, as was first determined in the Supreme Court's unanimous National Association for the Advancement of Colored People v. Patterson ruling. The 1958 decision blocked the Alabama state government from forcing civil rights organizations to release personal, identifying information of supporters, thereby preventing threats, harassment, and intimidation of individuals for their beliefs. The right was reaffirmed and further clarified in the Court's 2021 Americans for Prosperity Foundation v. Bonta opinion, which struck down a mandate from former California Attorney General Kamala Harris requiring nonprofits to provide certain donor information to remain registered with the state. \n\nThe Nevada bill passed through both chambers of the Legislature with an overwhelming majority and only one vote against it. Even more strikingly, nonprofits from across the political spectrum, such as the American Civil Liberties Union of Nevada, Americans for Prosperity, Nevada Right to Life, and Planned Parenthood Votes Nevada, supported the measure. \n\n\"Americans are fed up with the abuse of their privacy and First Amendment rights. No one should face threats, doxing, or retaliation simply for supporting a nonprofit organization,\" said Heather Lauer, CEO of People United for Privacy Foundation, a national privacy rights organization, in a press release.\n\nWith the passage of A.B. 197, Nevada joins 20 other states across the political spectrum that have passed similar legislation since 2018. In a time of hyper-partisanship and regular free speech violations—especially from the federal government—it's encouraging to see some state governments still honoring the constitutional protections enshrined in the First Amendment.","summary":"A new law prohibits the state from requiring nonprofits to disclose the personal information of their supporters, protecting Americans’ First Amendment right to free association.","url":"https://reason.com/2025/06/02/nevada-becomes-the-21st-state-to-strengthen-donor-privacy-protections/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/06/6-2-25-v3.jpg","video":null,"publish_date":"2025-06-02 21:30:29","author":"Autumn Billings","authors":["Autumn Billings"],"language":"en","source_country":"US","sentiment":-0.008},{"id":327448296,"title":"Paramount Global to Add Three New Board Directors As It Deals With Trump Lawsuit, FCC Review","text":"At a critical moment for the company, Paramount Global says that it will add three new independent directors to its board, asking shareholders to support the nominees at its upcoming annual meeting.\n\n In its proxy filing, filed Monday, Paramount said that attorney Mary Boies, former judge Roanne Sragow Licht and venture capitalist Charles Ryan have been nominated to join its board. The trio were nominated by the board’s governance committee, after being introduced to the board by “a non-management director and stockholder of the Company.”\n\n Paramount’s board has been light for the past year after four board members opted to step down at last year’s annual meeting, and with Charles Phillips exiting late last year. This year’s annual meeting gives the company a chance to freshen up the board, allowing it to proceed as business as usual.\n\n Of course, the nominations come as the company goes through a number of things that are anything but business as usual. Paramount agreed to sell to Skydance last year, but that deal is still being reviewed by the Federal Communications Commission. At the same time, President Donald Trump has an active lawsuit against the company over an interview that CBS’ 60 Minutes conducted with Vice President Kamala Harris. The two sides are currently in mediation talks to try and resolve the suit. \n\n Paramount is reported to have offered $15 million to resolve the suit. The FCC is also reviewing the interview via its “news distortion” purview.\n\n Paramount chair Shari Redstone and the company’s three co-CEOs Chris McCarthy, Brian Robbins and George Cheeks alluded to the issues in their annual letter to shareholders, which was also published Monday.\n\n “Against the backdrop of a dynamic and complicated time in the macro-economic environment and our industry, we are proud that 2024 proved to be a transformative year for Paramount,” they wrote, touting improved profitability in streaming, ratings success at CBS and new franchise development. “As the FCC continues its review of the Skydance transactions, we remain focused on delivering high-performing hits, supporting our creative culture, and driving value for shareholders.”\n\n The new board members are important because if the Skydance deal does not move forward, they will need to help the company chart a new course. And the board would likely need to sign off on any final settlement in the lawsuit.","summary":"Attorney Mary Boies, former judge Roanne Sragow Licht and venture capitalist Charles Ryan have been nominated to join Paramount's board.","url":"https://www.hollywoodreporter.com/business/business-news/paramount-new-board-members-fcc-review-lawsuit-1236235583/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/07/GettyImages-1556266055-1.jpg","video":null,"publish_date":"2025-06-02 21:12:41","author":"Alex Weprin","authors":["Alex Weprin"],"language":"en","source_country":"US","sentiment":-0.065},{"id":327459236,"title":"Elon Musk Rages at CNN For Lack of Outrage Over Corey Booker's 'Nazi Salute' After They Ripped Billionaire For Similar Gesture","text":"Elon Musk is calling out CNN after they failed to mention Corey Booker's gesture, which MAGA loyalists claimed was a \"Nazi salute,\" RadarOnline.com can reveal.\n\nIn January 2025, during Donald Trump's celebration of his second presidential term, Musk boasted about the victory in a speech, which concluded when he placed his right hand over his heart, and then shot it into the air, leading to plenty of backlash.The Same Gesture As Musk?Fast-forward five months, as Booker was speaking at the California Democratic Convention on Saturday night, and he ended his speech by placing his hand on his heart and extending his arm toward the crowd.\n\nTo some, the motion resembled the same gesture the controversial billionaire did during his rambling.\n\n\"Cory Booker was obviously just waving to the crowd. Anyone who claims his wave is the same as Elon Musk's gesture is operating in bad faith,\" Maya Krishna-Rogers, spokesperson for Booker, said in a statement.\n\nShe added: \"The differences between the two are obvious to anyone without an agenda.\"'Who's In Charge At CNN?'However, that was not enough for Musk, who took to his platform X to complain.\n\nA user posted a video of CNN's past coverage of Musk's gesture, which included the network's Jim Acosta.\n\n\"(Musk) used a hand gesture that looked like a Nazi salute,\" Acosta said while speaking to Rep. Robert Garcia.\n\nGarcia responded: \"That was a Nazi salute... if you talk to anyone like historians, folks study the Nazis and study this actual kind of disgusting display, they’ve been very clear about what that was.\"\n\n\"He should not just apologize. He should be condemned for those kinds of actions. So gross. Disgusting,\" he added.On Monday, June 2, the Tesla founder responded to the video and said: \"Who's in charge at CNN?\"\n\nOver the weekend, the 53-year-old also lost his mind over the lack of backlash as he quote-tweeted a post about the incident and cried: \"Legacy media lies.\" \n\nHe also shared a post showing former President Barack Obama, Sen. Elizabeth Warren, Mass, Kamala Harris, and Hillary Clinton with their arms extended and the caption: \"We know where Cory Booker learned his Nazi salute from.\"Musk Claims He's Not A NaziLast month, during a sit-down interview with CNBC, Musk once again defended his gesture.\n\nIn the chat, David Faber noted to Musk that \"there are a lot of people who dislike you, some of whom were your customers,\" and asked the billionaire if leading the Department of Government Efficiency (DOGE) was worth it.\n\n\"What I've learned is that legacy media propaganda is very effective at making you believe things that aren't true,\" Musk responded, and then shared one rumor that spread like wildfire: \"That I'm a Nazi.\"\n\nHe added: \"And how many legacy media publications... tried to claim that I was a Nazi because of some random hand gesture at a rally? All I said was that 'my heart goes out to you,' and I was talking about space travel.\"He then claimed: \"In fact, every politician, any public speaker who has spoken for any length of time has made the exact same gesture.\"\n\nIn his attempt to defend Musk, Faber claimed he reached out to some of Musk's close pals about rumors he's a Nazi, and \"all of them were like... 'no way.'\"\n\n\"Of course not!\" Musk added.","summary":"Elon Musk isn't happy CNN is not losing their mind over Corey Booker's hand gesture months after the billionaire was buried for his similar 'Nazi' gesture.","url":"https://radaronline.com/p/elon-musk-cnn-corey-booker-nazi-salute/","image":"https://media.radaronline.com/brand-img/1Y_M9QiMA/0x0/musk-booker-1748893219264.jpg","video":null,"publish_date":"2025-06-02 21:00:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","source_country":"us","sentiment":-0.372},{"id":327432518,"title":"Ashley Biden lashes out at Jake Tapper over health cover up claims in foul-mouthed posts","text":"Ashley Biden unleashed a profanity-laced defense of her father, former President Joe Biden, in a fiery Instagram post that slammed media critics and directly addressed claims about his health, legacy, and time in office.\n\nThe 42-year-old daughter of the president shared a beach photo of herself with her parents, Joe and Jill Biden, writing: 'I am so grateful. too grateful to be angry about all this bullshit.'\n\nHer emotional outburst came just days after CNN anchor Jake Tapper aired a segment questioning the transparency around Biden's recent cancer diagnosis—suggesting the administration had 'downplayed' the severity of his condition while he was still in office. \n\nTapper's reporting coincided with the release of his new book, Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again, which claims to expose a White House effort to conceal Biden's cognitive decline from the public.\n\nAshley didn't mention Tapper by name, but her post left little doubt about its target.\n\n'The ONLY coverup of this family is a BEACH coverup !!!' she wrote, mocking the idea of a media conspiracy and defending her father's record. \n\n'The truth is, Dad gave his ALL to America and continues til this day. He NEVER gave up on you. And he listened to all of you. And he acted. The man has led his life by ACTIONS not words.'\n\nJoe Biden, now 82, left office on January 20, 2025, after losing the 2024 election to Donald Trump.\n\nIn May 2025, his office revealed that he had been diagnosed with aggressive, bone-metastatic prostate cancer. \n\nThe cancer carried a Gleason score of 9—a high-grade classification indicating that the cells were highly abnormal and likely to grow and spread quickly. His treatment began with hormone therapy and is being closely monitored by specialists.\n\nDespite the diagnosis, Biden appeared publicly on May 30 and said he was feeling strong, adding that his bones remained healthy and that he remained optimistic about his prognosis.\n\nAshley's post directly addressed critics questioning whether her father had been fit to serve during his final year in office: 'He aged, YES! As we all do! And the stress of the presidency accelerates. But he was always MORE than capable of doing the job. And a damn good one. \n\n'He worked harder than anyone I have ever known- he took his duty and sacred obligation to this country very seriously. \n\n'The noise is so DAMN disrespectful and untrue …AND, it's just that- noise/static- created by those committed to perpetuating and profiting from some real BS. Get lost with your anonymous sources and fake news.'\n\nShe also thanked supporters for rallying around her family during what she called an 'uphill' time: 'AND, i am super grateful for the love and support over the past few weeks. \n\n'We, like any family, chose HOPE during times of great despair/uphill battles. And we continue - to chose hope.\n\n'That's what Dad taught + gave us. And all your ♥️+ support continues to give him HOPE - for his own healing, for this country he so loves and for the world he united.'\n\nThe post, set to Elton John's Your Song, ended with a pointed warning: 'please note: if you are disrespectful in the comments- you will be deleted and blocked. I wish you peace #deuces.'\n\nAshley Biden has largely remained out of the political spotlight—but her outburst marks a rare, deeply personal response to renewed scrutiny of her father's health.\n\nWhile in office, Joe Biden championed major initiatives including the American Rescue Plan, a sweeping infrastructure package, climate legislation, the withdrawal from Afghanistan, and aid to Ukraine. \n\nBut following a disastrous June 2024 debate performance, he withdrew from the 2024 race the following month, endorsing Vice President Kamala Harris. \n\nHe served out his full term until January 2025.\n\nTapper's book, released last week, has drawn backlash from critics who now accuse him of trying to rewrite his role in what they claim was a media-enabled cover-up.","summary":"Ashley Biden breaks her silence in a fiery Instagram rant, defending her father, slamming 'fake news,' and revealing how the family is coping with his cancer diagnosis.","url":"https://www.dailymail.co.uk/news/article-14773491/biden-daughter-ashley-lashes-social-media-post.html","image":"https://i.dailymail.co.uk/1s/2025/06/02/21/98975045-0-image-m-86_1748896222914.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/20/8599412757887366916/1024x576_MP4_8599412757887366916.mp4","publish_date":"2025-06-02 20:36:02","author":"Alexa Cimino,Editor","authors":["Alexa Cimino","Editor"],"language":"en","source_country":"gb","sentiment":-0.141},{"id":327440806,"title":"Video shows pastors arrested in Capitol Rotunda prayer-against-Trump encore","text":"Several religious activists were arrested in the Capitol Rotunda Monday for demonstrating against planned GOP cuts to Medicaid for the second time in as many months.\n\nThe Rev. William Barber led a group of clergy in several minutes of prayer in front of a statue of suffragettes inside the Rotunda building just after noon before the group was advised by a senior officer with the US Capitol Police that they were in violation of the building’s prohibition against demonstrations.\n\nBarber and several others can be seen continuing to pray as they are led away in zip-ties, in video taken by The Independent at the protest. \n\nAs Barber and his group received their first warning, a large group of at least two dozen Capitol Police officers formed a line separating the group from the visiting tour groups proceeding around the room. \n\nOther officers quickly began directing those tours out of the room. Within minutes, the group received their second warning, and officers in the police line began ordering reporters in the room to exit as well, or risk arrest.\n\n“We're going to pray. if they arrest us, that's on them,” Barber had told The Independent ahead of his arrest.\n\nHis words touched repeatedly on the Republican budget reconciliation bill passed by the House of Representatives last month, which is now in the Senate where upper-chamber lawmakers will begin debating changes to Donald Trump’s “one big, beautiful bill” — including splitting it up into multiple packages. \n\nAt the core of the legislation is an effort to fund an extension of the 2017 tax cuts passed during Trump’s first administration, and Republican lawmakers are doing so by adding work requirements that experts, including the Congressional Budget Office, estimate will endanger the eligibility of millions of Americans.\n\nThis was the second time Barber and his organization, Repairers of the Breach, were involved in a prayer demonstration against the GOP budget bill, and it was evident in the mannerisms of Capitol Police officers who participated in the arrests. Barber’s first arrest occurred in late April.\n\nOne source familiar with the operations of the building told The Independent that Capitol Police were expecting the group’s demonstration on Monday. Barber and his group walked from the Supreme Court, where a rally was held ahead of the demonstration.\n\nSeveral officers were holding zip-tie handcuffs before the arrests began, and in pairs the group were led out of the room with their wrists bound, with reporters now watching from afar. The reverend, who was walking gingerly with the aid of two canes, was the last — along with a woman in a wheelchair — to be restrained and led from the room. \n\nThe Independent witnessed Barber being led into a side corridor, away from view. A total of eight people were arrested, per a representative for Repairers of the Breach.\n\nIn an interview Monday morning, Barber said that the GOP budget bill’s planned changes to Medicaid and food stamps, including work requirements and changes to SNAP for families with children, constituted a moral issue that should transcend typical Washington party divisions. \n\n“Interestingly enough, we were arrested for just praying,” Barber said of his demonstration in May. “They are passing a bill that's preying — p-r-e-y-ing — on the poorest of us, and we were arrested for praying.\n\n“Clergy have said this is a moral issue. It's not a Republican or Democrat. It's a moral issue,” he continued.\n\nHe had stinging words for House Speaker Mike Johnson and other Republicans who have claimed that analyses of the budget bill indicating that millions are at risk of losing Medicaid eligibility should it pass are false.\n\nBarber said that the disproportionate benefits of the 2017 GOP tax cuts for wealthier Americans amounted to the 2025 reconciliation bill being the largest robbery of wealth from lower-income Americans in history, with the exception of slavery.\n\n“These folk get up every morning and decide the way to use power is to hurt people,” he said. “There's no reason for them to even be touching Medicaid. That's the whole point. The only reason they're doing this is because they're trying to get the money for the tax cuts...It is for those tax cuts to the wealthy and the greedy.”\n\nThe reverend is a longtime activist for low-income Americans and raising the federal minimum wage through his organization and a larger group he is part of, the Poor People’s Campaign. \n\nHis Moral Monday rallies, held in DC, his home state of North Carolina and elsewhere, have rallied left-leaning faith leaders on issues that affect low-income communities across the country for more than a decade. Barber also rallied voters to support former Vice President Kamala Harris during the 2024 election.\n\nMore recently, the 61-year-old was accused of directly moving funds from Repairers of the Breach into a personal shared bank account, which he then used for an alimony payment. His attorney told a local newspaper, the Raleigh News and Observer, that her claims “are not true.”","summary":"The Independent was there as several religious activists were hauled away Monday for demonstrating against potential GOP cuts to Medicaid in President Trump’s ‘One Big, Beautiful Bill’","url":"https://www.independent.co.uk/news/world/americas/us-politics/video-pastors-arrested-capitol-prayer-trump-budget-b2762300.html","image":"https://static.independent.co.uk/2025/06/02/19/05/20250602_131647.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/KDqW8kpJ-4VHSaSK0.mp4","publish_date":"2025-06-02 20:24:57","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.383},{"id":327420984,"title":"Tim Walz says Harris campaign media strategy fell way short","text":"Former vice presidential candidate Gov. Tim Walz said the Kamala Harris campaign's media strategy fell short during an interview last week, criticizing the campaign's focus on traditional media venues during the campaign. As podcast host and former Montana Sen. Jon Tester argued that the campaign didn't use Walz effectively, Walz said his argument spoke to a broader point about the Democratic Party not entering \"every media environment,\" including podcasts and local media. He said, \"My God, they're not watching ‘Meet the Press,’ they're listening to you guys, as they're going somewhere, listening.\" The former Democratic vice presidential candidate spoke to Tester and journalist Maritsa Georgiou, hosts of the \"Grounded\" podcast, on Thursday about the 2024 campaign and the Democratic Party's next steps. Though Harris did speak to some podcast hosts, she also visited traditional media outlets such as CNN and CBS' \"60 Minutes,\" and waited weeks after her campaign launch to do media at all. \"I think you got to flood the zone,\" Walz said. \"And I would argue we didn't see, you know, the vice president when she got in front of people, and I watch her talking to young people, she was magnetic with them. She was optimistic. She was hopeful. But in today's world, you got to have a lot of that, or it gets lost in the noise. And if you think you're just going to do a, you know, a '60 Minutes' interview, and that's going to get across, boy, that's not it.\" HARRIS TEAM COMPLAINS MEDIA ASKED VP 'DUMB' QUESTIONS:' 'A DISSERVICE TO VOTERS' Walz added that he didn't agree with those arguing that the Democratic Party needed to find a \"Joe Rogan of the left,\" but said the party needed to be \"in places where a reach of like somebody like Joe Rogan is getting out there.\" Harris' \"60 Minutes\" interview became the basis of a lawsuit filed by President Donald Trump against CBS and its parent company, Paramount Global. Trump's team and CBS remain at an impasse as they attempt to resolve the president's $20 billion lawsuit against the company through mediation. Fox News Digital confirmed that Trump rejected a $15 million offer to settle his lawsuit, according to a source familiar with the matter. The president's legal team is also demanding at least $25 million and an apology from CBS News. Trump's attorneys even floated another lawsuit against the company. Walz said in March that the campaign shouldn't have played things so safe. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"I think we probably should have just rolled the dice and done the town halls, where (voters) may say, ‘You’re full of s---, I don’t believe in you.' I think there could have been more of that,\" Walz said during an interview with Politico. Walz argued that Democrats \"are more cautious\" in engaging with the media than Republicans, while adding that he felt as if the campaign was never ahead, comparing it to a \"prevent defense\" strategy during a football game. \"In football parlance, we were in a prevent defense to not lose when we never had anything to lose because I don’t think we were ever ahead,\" he said, which bolsters reporting following the election that internal Democratic polling showed Harris lagging behind Trump in the lead-up to Nov. 5,\" the Minnesota governor said. CLICK HERE TO GET THE FOX NEWS APP Fox News' Joseph Wulfsohn and Emma Colton contributed to this report.","summary":"Gov. Tim Walz called out the Harris campaign&apos;s media strategy during a conversation with the &quot;Grounded&quot; podcast, suggesting they should have focused on podcasts and local media.","url":"https://www.foxnews.com/media/tim-walz-says-harris-campaign-media-strategy-fell-way-short","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/harris-walz-split.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 19:13:36","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.541},{"id":327408956,"title":"Biden’s Health Secretary Is Taking On RFK Jr.—and, Maybe, Kamala Harris","text":"Xavier Becerra walked into one of the toughest jobs in Washington when he became Joe Biden’s secretary of health and human services at the height of the COVID pandemic in early 2021. “The day President Biden was sworn in, we essentially lost 10 jumbo jets of Americans,” he told Vanity Fair in an interview.\nNow, less than six months after leaving that role—as he watches the work he did at the Department of Health and Human Services be effectively dismantled by successor Robert F. Kennedy Jr.—Becerra is throwing his hat in the ring for yet another high-stakes gig: governor of California.\nBefore making his way to HHS, Becerra served as California attorney general and spent more than 20 years representing Downtown Los Angeles in the House of Representatives. In his gubernatorial campaign, the soft-spoken Sacramento native argues that his legislative record and experience managing a massive organization like HHS separate him from the crowded field of candidates. Well, that, and the fact that, as attorney general, he sued the Trump administration more than 100 times—many times successfully—which could come in handy these days.\nBut he faces an uphill battle, with rumors swirling around former vice president Kamala Harris’s potential bid for the seat and accusations flying about Biden administration officials attempting to cover up the president’s declining health while he was in office. Vanity Fair spoke with Becerra about Kennedy’s path of destruction at HHS, why he wasn’t worried about whether Biden was fit to lead, and why he’s the candidate to beat.\nThis interview has been edited for length and clarity.\nVanity Fair: It can be hard to believe that you’ve only been out of your old job for less than six months. As you’ve been watching what has unfolded at HHS, what worries you most?\nXavier Becerra: This certainly has aged everyone. What worries me most is the loss of confidence in our elected leaders. Tinkering with health is dangerous.\nWe’d gotten to the point where we had more Americans who had access to health insurance under the Biden administration than under any other president. More than 300 million Americans finally had their own health insurance and could go to a hospital, and they're not worried about going bankrupt as a result of the bill. We got to the point where we were actually negotiating lower drug prices. We got to the point where we actually pulled the country out of a pandemic that had killed more than a million people, and that’s because we got close to 700 million vaccine shots into the arms of Americans.\nNow, to watch as an administration downplays the importance of vaccination, to the point of saying pregnant women and children don’t need to be vaccinated anymore? We lost over 1,000 kids from COVID during the pandemic. Why would we want to lose another 1,000 children unnecessarily? It is tough to watch, but what is most difficult to accept is the loss of confidence that the people will have in the government agency most responsible for promoting the health of Americans.\nApparently, the announcement about the COVID vaccine recommendations blindsided the CDC. How unusual is that kind of workaround? And also, for those of us with kids, what are we supposed to do with our children this fall?\nSeek out advice from your doctor, not from the politicians. Go with what your pediatrician tells you. But secondly, you mentioned these recommendations on the vaccine: These aren’t the types of recommendations that I was accustomed to. Recommendations come from the experts, not from the political appointees, and to not consult with the CDC is to put your own political opinions ahead of the recommendations of the scientists and health experts.\nHHS doesn’t control if you can get the vaccine. HHS is there to give a recommendation for the folks who actually administer health care. And in this case, I think it’s a wrong decision. [Editor’s note: After this interview, the CDC issued updated guidance, which keeps COVID shots on the vaccine schedule for healthy children between the ages of six months and 17 years; it now recommends “shared clinical decision-making” between health care providers and caregivers.]\nYou’ve been talking a lot lately about the role that social media plays in spreading health misinformation. The Biden administration faced a lot of lawsuits and caught a lot of flack for pressuring platforms to take that information down…\nBy the way, lawsuits that were rejected by the courts.\nNow we see the Trump administration really turbocharging pressure on speech, in terms of government scientists publishing in medical journals or what DEI policies private companies can have. In retrospect, do you worry at all about the precedent that was set regarding policing health misinformation, even if it was done with the best of intentions?\nI don’t think I would describe anything I or the folks at HHS did as policing. We put out data. We ask the world to look at data and make assessments based on the data. We made recommendations—and when I say we, I mean the health experts, not the political appointees—based on the data. That’s very different from coercing or directing what speech would be permissible. It seems like today we have an administration that has abandoned and is ignoring data.\nWhen you were attorney general in California, you played a pretty active role in challenging the Trump administration in court. As governor, what role do you hope to play in pushing back against the administration’s actions?\nCalifornia will do what it must to create good-paying jobs, to make the state livable and affordable, and we will work with everyone who’s ready to work with us on that, and that includes the federal government. But we will also stand up for the things that have made California a proud, progressive, and prosperous state.\nWe’ll be ready to ensure that the taxpayer dollars that California sends to the federal Treasury—which amount to more than any other state in the nation—get back to benefit Californians the way they should.\nCalifornia’s current governor, Gavin Newsom, has taken an interesting approach to the Trump era, courting far-right voices on his podcast, talking about anti-trans stances, cracking down on homeless encampments. What is your view on that strategy?\nIt’s not what a politician says. It’s what the politician does. If what the governor does moves the needle in the right direction for California families, I’ll be right there to support it. If what a politician does is just pander to the latest trend, and if it’s not good for California, I’ll stand up against it.\nI noticed a couple of “ifs” in that response. What’s your verdict as far as what side of the ledger his statements and actions fall on?\nThere are many things I think Governor Newsom has done to really propel the state. Under his watch, we have become not just the fifth-largest economy, but the fourth-largest economy in the world, so give Governor Newsom some credit.\nWhat we do have to do, and I think the governor already acknowledges that, is make sure that everyone in California benefits from that growing prosperity. And it seems harder and harder for people like my parents, a construction worker and clerical worker, to believe that they too could do what my parents did a generation ago: buy the house where I grew up, send my three sisters and I to college or military, and then be able to retire with dignity. They didn’t have a college education, but still were able to reach that California dream and certainly have it for their kids.\nOne of your opponents in this race has raised questions about what you and Vice President Harris knew about President Biden’s health and cognitive decline while he was in office. How do you respond to that criticism, and what was your experience working with President Biden?\nWorking with President Biden in this administration, getting to make some real change and achieve things that had never been done before, that’s why you go into public service. President Biden gave me that opportunity. And so I thank President Biden for giving me that call and offering me a chance to serve in his Cabinet.\nI will say this about some of the wild punches that are being thrown in the ring: It’s not surprising. To me, it shows a little immaturity in not understanding how the federal government works. But it’s campaign season. Folks are going to try to land punches, including trying to throw punches at someone who’s not even in the ring yet.\nOkay, but I think a California citizen may say: Low blow, but, really, did you see a decline in President Biden during your time working for the administration? And does the allegation that there was this cover-up by the larger bureaucracy ring true?\nWas he getting older, and was that obvious? Yes. I think Joe Biden has said that. The issue is: Did the president have the capacity to make the right decisions for the country? When it came to health care, under his watch, and with the tools he gave me, there are more people today in America who have access to decent health care than before we started.\nThe day Donald Trump handed the keys over to Joe Biden, more than 4,000 Americans died from COVID just in one day. That’s what we had to get out of. And we did.\nDid he make the right calls as president? From my perch as secretary of health and human services, I got the right marching orders. I’m not going to condemn a guy who made the right calls.\nYou mentioned somebody who is not yet in the ring, Vice President Harris—somebody who also has Washington experience, somebody who was also California AG. I don’t think it will offend you to say she has higher name recognition. So why do you think that you have a shot given that she may run?\nIt’s important to make note, unlike some of the other candidates in this race—you’re not running against someone; you’re running for governor. I’m running for governor. I believe when you take a look at all the candidates’ or potential candidates’ background,\nexperience, accomplishments, I believe I match up not just well; I match up better than any of the folks who are running, or thinking of running, for governor of the state of California.\nNo one combines the level of experience helping draft and pass laws at the highest level, helping defend those laws, or, if necessary, challenge illegal laws or laws that hurt California. I have balanced a budget, and it’s not a tiny budget. It’s a budget that was twice as big as the budget of the Department of Defense. It’s a budget at Health and Human Services that was five times larger than the budget of the state of California. I believe that when the time comes to take a look at who could be governor, those experiences and those achievements stack up really well.\nGiven the Trump administration’s massive crackdown on immigration, what will your role as governor be in terms of protecting that community?\nI don’t think it escapes anyone that I’m the son of immigrants. I grew up surrounded by folks who were immigrants. I’ve never stopped trying to represent and defend people like my parents, because I think they’re the folks who build this country. If you work hard, and if you do things the right way in California, you’ve got a governor in me who’s going to back you up.\nDefending immigrants is a no-brainer. I did that all my career as a member of Congress. I certainly did it as attorney general when I defended Dreamers in the DACA program against the Trump administration’s efforts to try to eliminate it. We took that all the way to the Supreme Court when no one thought we would win, and we won.\nWe’re going to make sure that we protect everyone, because you don’t have to be a citizen to have a constitutional right to due process. My sense is that most Americans agree, if you work hard, you pay taxes, you play by the rules, you can earn a place in this country. That means fixing a broken immigration system so that it continues to allow our growers in California, the breadbasket of the world, to utilize undocumented workers to pick the crops that you and I love and eat, and doing it in a way that lets them adjust their status, because they’re proving they’re here to make this country and this state better.\nThe tech industry is also part of what makes California unique. Do you worry at all about the rightward lurch of the tech billionaires?\nThis country relies on innovation. We rely on enterprise. If you’re open and transparent, and you’re doing things according to the rules that are in place, go to it.\nI heard more “ifs” in there.\nA lot of those “ifs” are due to the fact that I’m not in that position yet. I didn’t use a lot of “ifs” when I talked to you about what I did as secretary. I’ve got a history. I’ve got a voting record from 24 years in Congress, two years in the state legislature. I’ve got a rich history as an executive, as CEO of the Department of Justice in California, and the Department of Health and Human Services at the federal level.\nUntil I’m there, people have to base what I’ll do on what I’ve done, and that’s where I think, compared to the other folks running for governor, I’ll match up very well.","summary":"Xavier Becerra, the former HHS head vying to succeed Gavin Newsom in the Golden State, tells VF that, with his experience, he matches up “better than any of the folks who are running, or thinking of running, for governor.”","url":"https://www.vanityfair.com/news/xavier-becerra","image":"https://media.vanityfair.com/photos/683dca9d4c062dabd4573be3/16:9/w_2992,h_1683,c_limit/vf-625-Xavier-Becerra.jpg","video":null,"publish_date":"2025-06-02 18:40:38","author":"Issie Lapowsky","authors":["Issie Lapowsky"],"language":"en","source_country":"US","sentiment":-0.236},{"id":327409828,"title":"What’s Next for Tough-Talking Tim Walz?","text":"Former Democrat vice presidential candidate Tim Walz is talking tough, even while remaining mum on his own political future. \n\nThe Minnesota governor, whose second term runs through January 2027, claims to have a strategy for his fellow Democrats: ”Bully the s–t out of” President Donald Trump.\n\n“Maybe it’s time for us to be a little meaner, maybe it’s time for us to be a little more fierce, because we have to ferociously push back on this,” Walz said at the South Carolina Democratic Party’s convention on Saturday.\n\n“Again, I’ll speak to my teacher colleagues in here. The thing that bothers a teacher more than anything is to watch a bully … and when it’s a child, you talk to him, and you tell him why bullying’s wrong, but when it’s an adult like Donald Trump, you bully the s–t out of him back,” he said.\n\nWalz, a surprise choice as Democrat vice presidential nominee by the party’s presidential candidate, Kamala Harris, over more prominent contenders, such as Pennsylvania Gov. Josh Shapiro, has been on the road often since the start of Trump’s second term in late January. \n\n“This dude’s the last guy I want to tell us about ‘We lost our way.’ You’re the guy who lost,” Walz said of himself in his South Carolina remarks.\n\nBut he nevertheless claimed the right to advise the Democratic Party on its path forward.\n\n“None of us can afford to shy away right now from asking the hard questions and doing the things we need to do to fix it so that we win elections,” he said.\n\nWalz has at times admitted to the shortcomings of the Harris-Walz ticket in its attempts to appeal to the white male voting bloc.\n\n“I also was on the ticket, quite honestly, because I could code-talk to white guys watching football, fixing their truck. Doing that, that I could put them at ease. I was the permission structure to say, ‘Look, you can do this and vote for this,’” he said at Harvard University in April.\n\n“You look across those swing states, with the exception of Minnesota, we didn’t get enough of those votes,” he said. \n\nIn fact, the “code talk” does not appear to have had any benefit whatsoever.\n\nFrom 2020 to 2024, white male support for the Democrat presidential candidate dropped from 40% to 36%, per Catalist, a left-wing analytics firm.\n\nThroughout the campaign, Walz made apparent attempts to appeal to male voters by speaking on his experience as a football coach, publicizing a pheasant-hunting outing, and livestreaming gameplay of the Madden NFL videogame with Rep. Alexandria Ocasio-Cortez, D-N.Y. \n\nFor now, it remains unclear what Walz’s next move is. \n\nAs early as March, Walz said he “would certainly consider” a 2028 presidential run “if I think I could offer something.“\n\nLater that same month, a poll from Morning Consult showed Walz with 5% support among Democrats and Democrat-leaning independents as a potential 2028 presidential candidate, trailing former Vice President Harris, who led the prospective survey with 36% support.\n\nAn April YouGov poll showed only 3% of Democrats viewed him as the leader of their party.\n\nHe told CNN in April that he was currently “not thinking about running in 2028” for president.\n\n“My advice to folks is, if in this moment you’re planning for 2028, you’re going to get rolled by the people in the street,” he said. “You just have to be out there making sure you’re helping.” \n\nEligible to run for governor for a third term, Walz has not yet declared whether he will launch another gubernatorial run. He said in a recent interview that he would likely make that decision in July. But he has said he won’t run for the Senate seat being vacated by fellow Democrat Sen. Tina Smith.","summary":"Former Democrat vice presidential candidate Tim Walz is talking tough, even while remaining mum on his own political future. The Minnesota governor, whose second term... Read More\n\n\nThe post What’s Next for Tough-Talking Tim Walz? appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/02/whats-next-tough-talking-tim-walz/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/timwalz06022025.jpg","video":null,"publish_date":"2025-06-02 18:30:00","author":"George Caldwell","authors":["George Caldwell"],"language":"en","source_country":"us","sentiment":-0.321},{"id":327420990,"title":"Sens Fetterman and McCormick show Washington how to work together again","text":"On June 2, Pennsylvania’s Democratic Senator John Fetterman and his GOP counterpart Dave McCormick took part in a Fox News town hall event in a replica of the U.S. Senate chamber; you could tell it wasn’t the real Senate because the conversation was shockingly respectful, substantive and promising. With a light touch, moderator Shannon Bream’s questions raised an array of issues on which not only do Fetterman and McCormick more or less agree, but their shared positions are at the commonsense core of today’s American voter. On the question of recent antisemitic attacks, including a Molotov cocktail attack on a Jewish group in Boulder on Sunday, both senators not only condemned such violence but acknowledged its roots in the dangerous anti-Israel rhetoric on college campuses. FETTERMAN, MCCORMICK REACT TO 'ASTONISHING' BOULDER ATTACK ON PRO-ISRAEL GROUP: 'RANK ANTISEMITISM' As Fetterman put it regarding these attacks, \"You know, the kinds of, the rank antisemitism, it's out of control, and for me and as my friend just pointed out, this is just rampant across all the universities…\" Both senators made plain their solid support for Israel, something Fetterman was not shy about pointing to as a cause of the recent attacks leveled against his competence. Both senators agreed on forcefully stopping Iran’s nuclear program, securing the border and sanctioning Russia to firm up President Donald Trump’s hand in negotiating against Russian President Vladimir Putin. They also both gave a thumbs up to the sale of US Steel, celebrated by Trump in the Keystone State last week. KNIVES OUT FOR FETTERMAN: MAVERICK SENATOR JOINS LONG LINE OF DEMS PUNISHED FOR BREAKING FROM LEFT Long story short, there was a lot of agreement on display, and while it might not be as sexy as two combatants screaming at each other, it might still be what the American people actually want. McCormick made the very key point that \"there is a lot of overlap\" between the people who voted for him and Fetterman. Both men have strong ties to the steel industry, and both spoke about the need to lift up long-forgotten industrial towns. It is not an accident that Pennsylvania has been a swing state for as long as that term has existed, with two world-famous cities, major industry, major farming and everything in between. It is a cross-section of America. Centrisism comes naturally in the commonwealth. LEAKS TO MEDIA ABOUT FETTERMAN ARE A COORDINATED SMEAR CAMPAIGN, HILL COLLEAGUES SAY The two current senators harken back to Pennsylvania figures like Gov. Bob Casey Sr. one of the last loudly pro-life Democrats and Sen. Arlen Specter, who often tortured fellow Republicans before eventually leaving the party. For now, it has only been Fetterman angering members of his own party by aligning with some positions seen as pro-Trump, McCormick has not had occasion to disagree with Trump policies, but then again, it’s not McCormick’s party in the political wilderness. Fetterman has been a unique voice in the Democratic caucus urging calm, suggesting that freaking out like a teenage girl at a 1950s Elvis concert every time Trump opens his mouth isn’t working. FETTERMAN ADMITS DEMS 'SORT OF LOST OURSELVES' ON KEY ELECTION ISSUE Meanwhile, Democrats have been trying to spread outrage around the media every time Trump opens his mouth about anything. Sadly, some of this leftist outrage has been directed at Fetterman himself in supposed bombshell reports from anonymous sources about his unfitness for office. On this, the less said, the better. Fetterman’s appearance itself made it self-evident the claims are malicious smears that should never be spoken of again. CLICK HERE FOR MORE FOX NEWS OPINION It may be lonely in the center left for Fetterman right now, but I suspect it won’t be for long. Recent polling puts the favorability of the Democratic Party at a record-low 19%. If it gets much lower, we will have to add an asterisk and \"if necessary,\" to references to the 2028 primary. The far-left approach, with its oligarchy tours on private jets and old 60s folk songs sung by folks in their 70s, and the constant cursing, none of it is working, it's all making things worse for the Democrats. Progressives understand this. That is why they blame sexism for former Vice President Kamala Harris’ defeat last year, instead of her horrible candidacy and their failed policies, it is exactly why they are terrified not of Trump, but of more moderate Democrats who could kick them out of power in the party. For the progressives, continuing the lie that men can become women is more important than winning elections; continuing the lie that Israel is committing genocide is more important than winning elections. CLICK HERE TO GET THE FOX NEWS APP On issues such as these, the far left will never compromise, because to compromise is already to lose. Both parties saw a potential future in the town hall on Monday, two Pennsylvania politicians who both listen to and understand the concerns of working Americans trying to give their kids a better life, and in this political environment, that goes a long, long way. CLICK HERE TO READ MORE FROM DAVID MARCUS","summary":"Pennsylvania Senators Fetterman and McCormick agree on key issues like antisemitism and economic policies, showcasing bipartisan cooperation.","url":"https://www.foxnews.com/opinion/sens-fetterman-mccormick-show-washington-how-work-together-again","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/fetterman-mccormick.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 18:00:57","author":"David Marcus","authors":["David Marcus"],"language":"en","category":"politics","source_country":"US","sentiment":0.091},{"id":327432512,"title":"Bill Clinton blasted for claiming he 'never saw' Biden's steep mental decline insisting he was in 'good shape'","text":"Former President Bill Clinton said he never thought Joe Biden was unfit to seek a second term – and that the former president known for occasionally mangling phrases and botching names was always 'on top of his brief.'\n\nClinton, 78, vouched for his fellow Democratic former president as journalists Alex Thompson and Jake Tapper promote their new book 'Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again', which weaves together efforts by White House staff to insulate the president amid his public mental and physical stumbles.\n\n'I thought he was a good president. The only concern I thought he had to deal wit was, could anybody do that job until they were 86 and we've had several long talks. I had never seen him and walked away thinking he can't do this anymore,' Clinton said of Biden, 82.\n\n'He was always on top of his brief,' Clinton told CBS Sunday Morning anchor Tracy Smith.\n\nClinton was 46 when he became the third-youngest person elected president. Biden retired as the oldest president and would have been 86 when he left office.\n\nAs it turns out, Bill and Hillary Clinton were among the first to throw their support to Vice President Kamala Harris after Biden dropped out of the race under pressure following his debate disaster.\n\nClinton, whose longtime advisor James Carville was among those calling for Biden to go to avoid a political bloodbath after the debate, said he didn't recognize the Biden as depicted in the book – which he has chosen not to read. \n\n'I didn't know anything about any of this, and I haven't read the book. I saw President Biden not very long ago, and I thought he was in good shape,' Clinton said.\n\nClinton bit his lower lip as he speculated: 'Some people are trying to use this as a way to blame him for the fact that Trump was re elected.' \n\nHe said the book 'didn't register with me, because I never saw him that way,' speaking of Biden.\n\nWhen Smith asked point blank why he didn't read the book, Clinton replied: 'I didn't want to, because he's not president anymore, and I think he did a good job. And I think we are facing challenges today without our president in our history.'\n\nClinton, his voice sounding raspy, spoke about his own recent health scare. 'Basically, kind of lost my balance, and I knew I was sick, and I went to the hospital and checked, and they said I was severely dehydrated,' he said. \n\n'When you're older, you have to be more careful to stay hydrated,' he added, after contending with heart problems after leaving office.\n\nHe spoke following a claim that Biden sometimes got lost in his own coat closet, while President Trump promoted a bizarre theory that Biden had died and been replaced by clones in just his latest online attack on his rival.\n\nTrump ally Florida Rep. Byron Donalds accused Clinton of 'lying' in his new comments. \n\n'Bill Clinton’s lying. Let’s just be honest. He’s lying, frankly, again. Joe Biden was not capable of doing the job. We all know this,' he told Stuart Varney on Fox Business.\n\n'It’s not just his mental capabilities; in my view, it’s also his physical capabilities. He wasn’t able to hold long extended meetings with members of Congress, and it’s Democrat members of Congress, Republican members of Congress, Republican leadership. He wasn’t able to do it. They would send him out there every now and again to do a speech or to speak to the press, and if the press started asking too many questions, his staff would come in and break it up,' he said.\n\nClinton also said courts are stopping Trump from carrying out acts he said exceeded presidential authority.\n\nAsked what's stopping Trump, he responded, 'The courts, including a lot of judges he appointed.' Both Clinton and and Trump survived impeachment efforts. \n\n'And you know, he is looking for ways to basically defy all these court orders, but I think he'll have a hard time doing that, and if he does, I think it will hurt him in America,' Clinton said.","summary":"Former President Bill Clinton said he decided not to read the bestselling book about President Joe Biden, who he described as being 'on top of his brief' when they interacted.","url":"https://www.dailymail.co.uk/news/article-14773061/bill-clinton-denies-biden-mental-decline-claims.html","image":"https://i.dailymail.co.uk/1s/2025/06/02/17/98971409-0-image-a-12_1748881968274.jpg","video":null,"publish_date":"2025-06-02 17:49:24","author":"Editor,Geoff Earle","authors":["Editor","Geoff Earle"],"language":"en","source_country":"gb","sentiment":-0.567},{"id":327407682,"title":"Poll shows AOC is one of only three U.S. politicians with net positive image, Trump and Harris trail behind","text":"Congresswoman Alexandria Ocasio-Cortez (AOC) has started gaining popularity since US president Donald Trump's second term began and now has ranked third in a new poll of political popularity, as per a report.AOC's Popularity RisesHer popularity has even surpassed Trump, former President Joe Biden, and former Vice President Kamala Harris, according to a survey conducted by data intelligence company AtlasIntel, reported the Independent.One of the Few with a Net Positive ImageThe poll also revealed that Ocasio-Cortez was one of only three leaders with a net positive image and came third after former President Barack Obama and his wife, former First Lady Michelle Obama, as per the report.AOC got a positivity rating of 46%, while 44% of respondents said they have a negative view of her and another 10% said they were unsure, this left her with a net positivity rating of two points, as per the survey which included responses from 3,469 participants, according to the Independent.ALSO READ: Drones are the new weapon of modern warfare — here's how Ukraine mastered their production and can now make 10 million a yearAOC's Popularity RisesHer popularity has even surpassed Trump, former President Joe Biden, and former Vice President Kamala Harris, according to a survey conducted by data intelligence company AtlasIntel, reported the Independent.One of the Few with a Net Positive ImageThe poll also revealed that Ocasio-Cortez was one of only three leaders with a net positive image and came third after former President Barack Obama and his wife, former First Lady Michelle Obama, as per the report.AOC got a positivity rating of 46%, while 44% of respondents said they have a negative view of her and another 10% said they were unsure, this left her with a net positivity rating of two points, as per the survey which included responses from 3,469 participants, according to the Independent.Obamas Still Tops the ListAs per the survey conducted between May 21 and May 27, Barack Obama was viewed positively by 53% of respondents, while 43% viewed him negatively, reported the Independent. Michelle Obama was viewed positively by 49% of respondents and negatively by 45%, reported the Independent.AOC Is An Active Member of CongressHowever, the Obamas are not in any official leadership role in the government currently, but Ocasio-Cortez is an active and vocal member of Congress; she and Senator Bernie Sanders have also been touring to rally against oligarchy, reported the Independent.FAQsWhy is AOC’s popularity rising now?Her visibility and vocal stance during Trump’s second term, especially through her rallies with Bernie Sanders, have helped her connect with more voters.How does AOC’s rating compare to Trump’s or Biden’s?She ranks higher than both in net favourability, with Trump, Biden, and Harris falling below the mark, as per the Independent.","summary":"US Congresswoman Alexandria Ocasio-Cortez's popularity has surged, surpassing Trump, Biden, and Harris in a recent poll. AtlasIntel's survey reveals AOC as one of the few leaders with a net positive image, ranking third after Barack and Michelle Obama.","url":"https://economictimes.indiatimes.com/news/international/us/poll-shows-aoc-is-one-of-only-three-u-s-politicians-with-net-positive-image-trump-and-harris-trail-behind-us-politics-news/articleshow/121577120.cms","image":"https://img.etimg.com/thumb/msid-121577559,resizemode-4,width-1200,height-900,imgsize-53922,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-02 17:48:41","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.156},{"id":327431144,"title":"EXCLUSIVE: Explosive New Book Reveals Ex-President's Advisors Kept Joe Biden 'Hidden' During His First Term Amid Dementia Fears","text":"Joe Biden's closest aides and advisors weren't concerned with the president's well-being as long as he won re-election, RadarOnline.com can report.\n\nQuestions about the then-president's mental and physical health overshadowed his campaign for another four years, eventually leading him to drop out of the race.The Cover-UpAs revealed in the explosive new book about Biden's presidency, Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again, those closest to the 82-year-old confessed Democratic strategists were purposely trying to keep him out of the public eye while running for another four years.\n\nCNN's Jake Tapper and Axios' Alex Thompson reveal the vast majority of Biden’s public events were purposely scheduled for weekdays between 10:00 a.m. and 4:00 p.m., when the president was most lucid. \n\n\"The White House is basically hiding Biden as he auditions for another term,\" one aide said at the time. \n\nAnother aide later shared: \"He just had to win, and then he could disappear for four years, he’d only have to show proof of life every once in a while.\"\n\nTapper wrote that Biden's aides were prepared to keep the cover-up going, with no regret for the controversy. \n\n\"When you vote for somebody, you are voting for the people around them too,\" the aide argued.Biden's Book ReportAccusations Biden was suffering from dementia while in the White House were only reinforced after claims the former leader had trouble remembering such unforgettable milestones, as what years he was in power and when his son died of cancer.\n\nIn one section of the book, the authors reveal Biden had \"significant limitations\" during an investigative interview.\n\n\"Biden’s recorded conversations from that time were described as 'often painfully slow, with Mr. Biden struggling to remember events and straining at times to read and relay his own notebook entries,'\" the journalists write.\n\n\"Flash forward to the fall of 2023, when Biden had his interviews with the special counsel’s office. Summing up their impressions, they concluded: 'Biden’s memory was worse.'\n\n\"Biden seemed to have difficulty grasping the fact that his vice presidency lasted from January 2009 until January 2017. Once, trying to understand a point in time in 2013, he asked, 'Well, if it was 2013, when did I stop being vice president?'\"Clooney Who?The book also alleges that Biden didn’t recognize longtime supporter George Clooney at a 2024 fundraiser, just before the actor famously urged the president to drop out of the race.\n\n\"It almost seems like those who were pushing Biden to run were unintentionally killing him,\" says Fischer. \"Their allegiance was to the Democratic Party, and sadly not to a suffering human being!\"\n\nIncredibly, the book lays much of the blame for the purported cover-up on a shadowy cabal of White House insiders dubbed \"the Politburo,\" just like the scheming group that once ran the former Soviet Union.\n\n\"It was an abomination,\" one prominent Democratic strategist says of Biden's decision to seek reelection despite his frailties. Kamala Harris would end up running instead.Kamala's LossThe strategist added: \"He stole an election from the Democratic Party; he stole it from the American people.\"\n\nAnother Democratic source says Biden may have been encouraged to run again, but the \"real culprit\" behind his choice to pursue a second term, and keep his health under wraps, was his \"own innate stubbornness and refusal to admit his obvious decline.\"\n\nThe source concluded, \"He made the decision, and he'll have to live with the consequences.\"","summary":"Questions about then-president Joe Biden' mental and physical health eventually lead him to drop out of the race for re-election.","url":"https://radaronline.com/p/joe-biden-hidden-dementia-original-sin-book/","image":"https://media.radaronline.com/brand-img/Jt4Ax2ujy/0x0/joe-biden-1-1748355673195.jpg","video":null,"publish_date":"2025-06-02 17:45:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":-0.209},{"id":327392868,"title":"How 'unaccountable' Trump is using a 'range of dishonest actors' to crush opposition","text":"During his first presidency, Donald Trump spent a lot of time fighting with conservative appointees who resisted parts of his agenda — from John Bolton (national security adviser) to Jeff Sessions (U.S. attorney general) to Rex Tillerson (secretary of state) to Gen. John F. Kelly (White House chief of staff). Trump's third White House press secretary, Stephanie Grisham, even ended up endorsing presidential nominee Kamala Harris at the 2024 Democratic National Convention. \n\nBut Trump's second presidency is much different. This time, he made a point of surrounding himself with hardcore MAGA loyalists—who, the Washington Post's Philip Bump argues in his June 2 column, are making a concerted effort to bully and intimidate opponents and create a climate of fear.\n\n Trump, Bump warns, has a \"range of dishonest actors\" at his disposal. And they range from White House adviser Stephen Miller to Department of Homeland Security (DHS) Secretary Kristi Noem to immigration czar Tom Homan.\n\nREAD MORE: 'Beyond the pale': Scarborough rips 'childish' Joni Ernst for 'mocking her constituents'\n\n\"What President Donald Trump wants is to put big deportation numbers on the scoreboard,\" Bump explains. \"Recent reporting suggests that senior administration officials, including adviser Stephen Miller, are leaning on DHS to remove more people, faster. Trump’s 2024 campaign promised to focus on removing the massive population of criminal undocumented immigrants in the U.S. But, in part because his claims about the scale of the problem have consistently been hyperbolic, the (Trump) Administration is instead resorting to deporting just about anyone it can conceivably fit into the system.\"\n\nBump notes that the intimidation tactics of Trump and his allies range from the arrests of Rep. LaMonica McIver (D-New Jersey) and Judge Hannah Dugan to DHS agents accusing Rep. Jerry Nadler's (D-New York) staff of \"harboring rioters\" and even handcuffing a Nadler staffer.\n\n\"In San Diego,\" Bump observes, \"heavily armed immigration officers conducted a raid at a restaurant. When observers attempted to halt the arrests, the federal agents allegedly used a stun grenade against the crowd. That incident was perhaps the most extreme of a number of tense, aggressive encounters between immigration officials and the public over the past four months…. It also seems clear that some agents understand they won’t be held accountable for their actions.\"\n\nBump adds, \"Detaining a staffer in member of Congress' office in search of 'rioters' from a nonexistent riot doesn't comport with a liberal democracy.\"\n\nREAD MORE: 'Mass delusion fueled by charisma': Expert explains why Trump's followers still believe in him\n\nNadler told the New York Times, \"The Trump Administration is really using totalitarian or even authoritarian practices. We have to fight them. We don't want to be a fascist country.\"\n\nBump laments, \"This is the reality. Immigrants are cast as dangerous when they aren't. Governmental power is abused without accountability. All of it at Trump’s whim — very much to Nadler's 'authoritarian' point.\"\n\nREAD MORE:'Disappointed': Musk says Trump's bill 'undermines the work that the DOGE team is doing'\n\nPhilip Bump's full Washington Post column is available at this link (subscription required)","summary":"During his first presidency, Donald Trump spent a lot of time fighting with conservative appointees who resisted parts of his agenda — from John Bolton (national security adviser) to Jeff Sessions (U.S. attorney general) to Rex Tillerson (secretary of state) to Gen. John F. Kelly (White House chief of staff). Trump's third White House press secretary, Stephanie Grisham, even ended up endorsing presidential nominee Kamala Harris at the 2024 Democratic National Convention. \n\nBut Trump's second presidency is much different. This time, he made a point of surrounding himself with hardcore MAGA loyalists—who, the Washington Post's Philip Bump argues in his June 2 column, are making a concerted effort to bully and intimidate opponents and create a climate of fear.\n\n Trump, Bump warns, has a \"range of dishonest actors\" at his disposal. And they range from White House adviser Stephen Miller to Department of Homeland Security (DHS) Secretary Kristi Noem to immigration czar Tom Homan.\n\nREAD MORE: 'Beyond the pale': Scar","url":"https://www.alternet.org/trump-noem-homan-miller/","image":"https://www.alternet.org/media-library/image.jpg?id=60352877&width=1200&height=600&coordinates=0%2C83%2C0%2C83","video":null,"publish_date":"2025-06-02 17:32:44","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.195},{"id":327409848,"title":"Former Biden official Matthew Miller Israel has ‘without doubt’ committed war crimes in Gaza","text":"WASHINGTON: A senior official in former president Joe Biden’s administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.\n\nSpeaking to the Trump 100 podcast, Matthew Miller, who, as a state department spokesman, was the voice and face of the US government’s foreign policy under Mr Biden, revealed disagreements, tensions and challenges within the former administration.\n\nIn the wide-ranging conversation, he said:\n\nIt was “without a doubt true that Israel has committed war crimes”;\n\nThat Israeli soldiers were not being “held accountable”;\n\nThat there were “disagreements all along the way” about how to handle policy;\n\nAnd that he “would have wanted to have a better candidate” than Mr Biden for the 2024 election.\n\nMr Miller served as the state department spokesman from 2023 until the end of Mr Biden’s presidential term. From the podium, his job was to explain and defend foreign policy decisions – from Ukraine to Gaza.\n\n“Look, one of the things about being a spokesperson is you’re not a spokesperson for yourself. You are a spokesperson for the president, the administration, and you espouse the positions of the administration. And when you’re not in the administration, you can just give your own opinions.”\n\nNow out of office, he offered a candid reflection of a hugely challenging period in foreign policy and US politics.\n\nGaza disagreements\n\nAsked about Gaza, he revealed there were “small and big” disagreements within the Biden administration over the US-Israeli relationship.\n\n“There were disagreements all along the way about how to handle policy. Some of those were big disagreements, some of those were little disagreements,” he said.\n\nPushed on rumours that then-secretary of state Antony Blinken had frustrations with Mr Biden over both Gaza and Ukraine policy, Mr Miller hinted at the tensions.\n\n“I’ll probably wait and let the secretary speak for himself… but I will say, speaking generally, look, it is true about every senior official in government that they don’t win every policy fight that they enter into. And what you do is you make your best case to the president.\n\n“The administration did debate, at times, whether and when to cut off weapons to Israel. You saw us in the spring of 2024 stop the shipment of 2,000-pound bombs to Israel because we did not believe they would use those in a way that was appropriate in Gaza.”\n\nThrough the spring and summer of 2024, the Biden administration was caught between its bedrock policy of the unconditional defence of its ally Israel and the reality of what that ally was doing in Gaza, with American weapons.\n\nMr Mill said: “There were debates about whether to suspend other arms deliveries, and you saw at times us hold back certain arms while we negotiated the use of those arms…\n\n“But we found ourselves in this really tough position, especially in that time period when it really came to a head… We were at a place where – I’m thinking of the way I can appropriately say this – the decisions and the thinking of Hamas leadership were not always secret to the United States and to our partners.”\n\nHe continued: “And it was clear to us in that period that there was a time when our public discussion of withholding weapons from Israel, as well as the protests on college campuses in the United States, and the movement of some European countries to recognise the state of Palestine – appropriate discussions, appropriate decisions – protests are appropriate – but all of those things together were leading the leadership of Hamas to conclude that they didn’t need to agree to a ceasefire, they just needed to hold out for a little bit longer, and they could get what they always wanted.”\n\n“Now, the thing that I look back on, that I will always ask questions of myself about, and I think this is true for others in government, is in that intervening period between the end of May and the middle of January [2025], when thousands of Palestinians were killed, innocent civilians who didn’t want this war, had nothing to do with it, was there more that we could, could have done to pressure the Israeli government to agree to that ceasefire? I think at times there probably was,” Mr Miller said.\n\nAsked for his view on the accusation of genocide in Gaza, he said: “I don’t think it’s a genocide, but I think it is without a doubt true that Israel has committed war crimes.”\n\nChallenged on why he didn’t make these points while in government, he said: “When you’re at the podium, you’re not expressing your personal opinion. You’re expressing the conclusions of the United States government. The United States government had not concluded that they committed war crimes, still have not concluded [that].”\n\nHe went on to offer a qualification to his accusation.\n\n“There are two ways to think about the commission of war crimes,” he said.\n\n“One is if the state has pursued a policy of deliberately committing war crimes or is acting recklessly in a way that aids and abets war crimes. Is the state committing war crimes?\n\n“That, I think, is an open question. I think what is almost certainly not an open question is that there have been individual incidents that have been war crimes where Israeli soldiers, members of the Israeli military, have committed war crimes.”\n\nThe Israeli government continues to strongly deny all claims that it has committed war crimes in Gaza.\n\nOn Joe Biden’s election hopes\n\nMr Miller also offered a candid reflection on the suitability of Mr Biden as a candidate in the 2024 US election. While Mr Biden initially ran to extend his stay in the White House, he stepped aside, with Kamala Harris taking his place as the Democratic candidate.\n\n“Had I not been inside the government, had I been outside the government acting kind of in a political role, of course, I would have wanted to have a better candidate,” he said.\n\n“It’s that collective action problem where no one wants to be the first to speak out and stand up alone. You stand up by yourself and get your head chopped off, stand up together, you can take action.\n\n“But there was never really a consensus position in the party, and there was no one that was willing to stand up and rally the party to say this isn’t going to work.\n\n“I don’t think there is anyone on the White House staff, including the most senior White House staffers, who could have gone to Joe Biden in the spring of 2023 or at any time after that and told him: ‘Mr President, you are not able to do the duties of this job. And you will not win re-election.’ He would have rejected that outright.”\n\nThe Trump presidency\n\nOn the Donald Trump presidency so far, he offered a nuanced view.\n\nHe described Mr Trump’s Middle East envoy Steve Witkoff as “an extremely capable individual” but expressed his worry that he was being manipulated by Russian President Vladimir Putin.\n\n“I know the people in the Biden administration who worked with him during the first negotiations for Gaza ceasefire thought that he was capable.\n\n“I think at times he doesn’t know what he doesn’t know. And you see that especially in the negotiations to end the war in Ukraine, where you see him go into a meeting with Vladimir Putin and come out spouting Russian propaganda… I think he would benefit from a little diplomatic savvy and some experienced diplomats around him.”\n\nHe continued: “But I do think it’s extremely important that when people sit down with an envoy of the United States they know that that envoy speaks for the President of the United States and it is very clear that Witkoff has that and that’s an extremely valuable asset to bring to the table.”\n\nOn the months and years ahead under Mr Trump, Mr Miller said: “The thing that worries me most is that Donald Trump may squander the position that the United States has built around the world over successive administrations of both parties over a course of decades.\n\n“I don’t think most Americans understand the benefits that they get to their daily lives by the United States being the indispensable nation in the world.\n\nCourtesy: sky news","summary":"Mark Stone WASHINGTON: A senior official in former president Joe Biden&#8217;s administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza. Speaking to the Trump 100 podcast, Matthew Miller, who, as a state department spokesman, was the voice and face of the US government&#8217;s foreign policy under [&#8230;]","url":"https://thefrontierpost.com/former-biden-official-matthew-miller-israel-has-without-doubt-committed-war-crimes-in-gaza/","image":"https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvdGhlZnJvbnRpZXJwb3N0LmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDZcL3NreW5ld3Mtc3RhdGUtZGVwYXJ0bWVudC1tYXR0aGV3XzY5MzMwNDQtMTAyNHg1NzYuanBnIiwidHh0IjoiRm9ybWVyIEJpZGVuIG9mZ","video":null,"publish_date":"2025-06-02 17:30:08","author":"Russian President Vladimir,The Frontier Post","authors":["Russian President Vladimir","The Frontier Post"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.024},{"id":327408960,"title":"Morgan Wallen’s American Odyssey","text":"The Sand in My Boots festival, the country megastar’s takeover of the Hangout that took place last month, was a showcase for Wallen’s collaborators and influences—with a lineup pulled from Nashville as well as from hip-hop, EDM, and indie rock—and an emblem of his gravitational pull. Between her sets, Ashlee Williss, a Jacksonville-raised DJ who said her flight from Los Angeles had been half-full of festival attendees, took stock of Wallen’s ascent and her own. She describes herself as the first female country music DJ, having pivoted after starting out as a singer-songwriter. She wore mirrored sunglasses with rhinestone edges and stamped my arm with her stage name, DJ Bad Ash.\n“I started booking all these festivals as literally the only girl,” Williss said. “It’s finally my time.”\nThe festival was named for one of Wallen’s several karaoke-level hits in recent years, which he has been touring at stadiums across the US and Europe. The song addresses his great subject, the simmering discontent born out of romantic wounds, and when he plays it, he sits alone at a piano. The crowd turns prayerful as he sings a ballad of pain, regret, and a Chevy Silverado.\nOver the last several years, Wallen has developed something more vexing and tangled than a split screen reputation. Following a string of drinking-related controversies and the publication of a 2021 video in which he used a racial slur, he became a bogeyman in the popular imagination. He has also become, in all manner of streaming and chart accountings, the biggest act in American music, not so much in spite of the backlash but alongside it. Wallen, a restrained and somewhat withholding presence in the few interviews he gives, is alternately considered music’s most radioactive and celebrated personality.\nOn his last tour, Wallen’s performances typically began with a boxing-style walkout through a stadium tunnel. In Las Vegas last year, he was accompanied by Tom Brady and Mike Tyson, the week after his appearance with Patrick Mahomes and Travis Kelce in Kansas City. Other costars have included Hulk Hogan, Pat McAfee, and Theo Von, the comedian and podcaster who conducted one of Donald Trump’s defining campaign interviews and recently joined the president in Qatar to perform for servicemembers. Taken together, the group offers a portrait of Wallen’s affinities, and a way to account for his enduring success. Somewhere in this diffuse but distinguishable collision of sports, new media, and music are the contours of a cultural mainstream in which country and football are stronger than ever, Austin and Nashville are the podcasting power centers, and there is no contest over Wallen’s stature.\nOn the last night of the festival, Wallen walked out alone. As a performer, he’s fluid, dynamic, and reticent. “Man, y’all love them toxic songs,” he told the crowd in a rare bout of commentary. “Guess I’ll keep singing them.” As his set ended, Wallen said he would play longer if he could, citing local regulations.\nThe trio worked with producers affiliated with an eclectic group of artists including Nickelback, Young Thug, and Post Malone, and ultimately cultivated a strain of hip-hop-inflected country music that, in short order, spawned several microgenerations of descendants. Wallen’s gravelly twang, set against acoustic guitars and trap beats, defined the sound. For a period, his mullet defined the look, with a pervasiveness among white teens that called to mind the influence Eminem wielded in the early 2000s. “You see a new artist,” Aaron Ryan, an editor for the Chicago-based country news site Whiskey Riff, told me, “and you think, Oh, that guy’s just trying to be Morgan Wallen.”\nAs Ernest paced the stage during his Sunday afternoon festival set, he described the scene as “MTV Spring Break but better.” Along the water, I stopped by Monster Beach Club, an activation for the energy drink company that maintains a heavy presence in racing and action sports. Janey Lee, a Monster Energy Girl of about a decade from San Diego, was among the onstage dancers for the beach party’s country-EDM DJ sets. “I didn’t realize that I knew so many of his songs,” she said of Wallen.\nThe Sand in My Boots crowd wore crochet cover-ups over bikinis, basketball jerseys and straw hats, and, in a small but noticeable segment, tattoo sleeves and beat-up skateboarding sneakers. The Westernwear was plentiful but most often functioned as accessory—all cowboy boots considered, the audience leaned more Coachella than Shania Twain. I saw a few MAGA hats, including white and gold and bucket hat versions, but a crop of “Gulf of America” T-shirts made for the more visible political statement. A half-hearted “USA” chant broke out during the Alabama-born singer Riley Green’s Saturday night set; AL.com, a leading news site in the state, reported the following week that festival arrests were down from the Hangout events held in years prior.\nDuring a break for shade, I found a pair of friends in town from Nashville, Stacy Best and Andrew Wendowski, who document country concerts for their social media pages and online businesses. After an elbow injury ended Wallen’s college baseball prospects, he turned to landscaping work as he tried to jump-start a music career, eventually landing a 2014 audition on The Voice that put him in front of Usher and Adam Levine. Wendowski operates an online magazine called Music Mayhem, and he said he’s been following Wallen for so long that he first saw him play in a tent outside of a bar. Now he believes Wallen is surpassing the likes of Taylor Swift and Beyoncé.\n“They’re not getting bigger,” Wendowski said. “They hit the ceiling, and I feel like Morgan is still going.”\nFor all their cross-genre tinkering, Wallen and his cowriters are faithful to the country traditions of double entendre and knotty wordplay. They turn phrases over and over, taking, in one instance, the roster of the 1998 Atlanta Braves as the basis for an extended conceit about a doomed relationship. The contrast of city and country is a recurring setup: Benzes vs. trucks, trust fund kids vs. rednecks. As Wallen left Manhattan one night in late March, he wrote on Instagram, alongside a photo of a private jet, “Get me to God’s country.”\nFollowing his Saturday Night Live performance that evening, Wallen had left the stage somewhat abruptly, though not vastly more so than in his typical act. The episode set off several days of frenzied news coverage. “I don’t know what goes through people’s minds when they decide to do stuff like that,” cast member Kenan Thompson told Entertainment Weekly. Wallen’s transgressions, perceived and otherwise, had by then taken on a cumulative weight, with what would have been the singer’s debut SNL appearance, in October 2020, having been axed after he broke coronavirus protocols by drinking and making out with women while out in Alabama.\nStill, Wallen has mostly worn the outrage loosely. Hootie & the Blowfish frontman Darius Rucker, who appeared with him in a social media video a few months after footage emerged of Wallen using a racial slur, told a Rolling Stone podcast last year that “Morgan’s tried to really better himself and become a better person and see the world in a much better, better way.” Sam Paige, a 30-year-old music festival influencer who traveled to Sand in My Boots from Fort Lauderdale, told me that she and her manager lightly mocked a segment of Wallen’s base of support: “Oh, when did you become a fan, when he said this or when he did this or when he did that?”\nMost Wallen fans I spent time with in Gulf Shores described the dynamic in passing; they were not so much energized by his errors as they were amenable to rooting for someone who had made them. “There’s so many people that maybe didn’t know who he was at first but were so anti-cancel-culture,” said Chris Brown, the father in a family of four who call themselves the Tampa Tailgaters. “They’re like, You know what, I’m going to go find out who this is and what it’s about.”\nAs a cultural proposition, one of the tenets of Trump 2.0 is a reordering of the pop elite: The president recently called for a “major investigation” into Kamala Harris’s endorsements from Beyoncé and other celebrities, and wrote on Truth Social last month, “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” The mechanisms that anointed these singers overlapped with those that called Trump a fascist, or Wallen a racist, and both men persevered.\nAt a Wallen show last year at MetLife Stadium, near New York, I saw Andrew Giuliani, the son of Rudy, roaming the crowd. Around that time, Giuliani, along with Laura Loomer, was a regular outside the Manhattan courthouse where Trump was being tried on charges of falsifying business records in relation to a hush money payment made to Stormy Daniels. In Gulf Shores, the FBI’s deputy director, Dan Bongino, was in attendance amid a MAGA outcry over his recent dismissal of conspiracy theories surrounding the death of Jeffrey Epstein.\n“I ain’t been in a bar,” Wallen said on This Past Weekend w/ Theo Von in April, “since the last time I was in a bar that everybody knows about.”\nIt was one of a handful of press appearances that Wallen did in the lead-up to the release of his new album last month. If he seemed a bit sheepish about his outlaw image, he was also willing to play with it. The cover art for I’m the Problem is drawn from a photo of Wallen in a courtroom last year as he pleaded guilty to reckless endangerment for having thrown a chair off the roof of a Nashville bar.\nThe details of Wallen’s personal life tend to emerge in third-party fragments. Hardy’s wife has recounted on a podcast how she tried to set Wallen up with leading influencer Alix Earle; former Laguna Beach star Kristin Cavallari has sprinkled tidbits of her dalliance with the singer throughout podcast and social media appearances. The distance affords Wallen an affable slipperiness and, in the moments when he has found himself in a degree of trouble, a reliable claim to antihero status. In May of last year, Nashville’s Metro Council denied a request to hang a neon sign outside of his newly opened bar.\n“He gives all of us a bad name,” one council member said during the vote. “His comments are hateful, his actions are harmful, and he don’t belong in this town as far as I’m concerned.”\nIn December, the Nashville city council took up the vote again and approved Wallen’s sign.\nWallen also told Von that he doesn’t really listen to country music, and he has largely steered clear of an industry awards ecosystem that only briefly shunned him in the name of racial justice. His claim on authenticity appears to have tapped into a more elemental identification rather than genre convention. “If I believe it when they open their mouth and they sing it,” the Texas musician Parker McCollum recently said on the Like a Farmer podcast, describing what he perceives as true country. “I believe Morgan when he sings those songs.”\nWallen has never offered such a concrete theory of his preeminence. Among his successors, there are those more voluble. Just before the end of the festival, Bailey Zimmerman took the stage. The country singer recently had a number one hit with BigXthaPlug, a Texas rapper and Wallen affiliate who played at Sand in My Boots. Zimmerman worked on natural gas pipelines in West Virginia and built custom trucks to amass a social media following ahead of his efforts in music. As the crowd prepared for Wallen to arrive onstage as the final act, Zimmerman closed his appearance with a message.\n“I’m a skinny white boy from southern Illinois, and I grew up just like you guys did,” he said. “If that doesn’t get you to believe in yourself, I don’t know what will.”","summary":"The country megastar has molded pop music—and a new cultural mainstream—in his image.","url":"https://www.vanityfair.com/style/story/morgan-wallen-american-odyssey","image":"https://media.vanityfair.com/photos/68388b65c90ed12ee1e3dd43/16:9/w_2400,h_1350,c_limit/vf525-morgen-wallen.jpg","video":null,"publish_date":"2025-06-02 17:23:43","author":"Dan Adler","authors":["Dan Adler"],"language":"en","category":"politics","source_country":"US","sentiment":0.432},{"id":327390828,"title":"Kamala Harris gives clearest signal yet she will run for White House again in 2028","text":"Kamala Harris has triggered further speculation that she is not running for governor of California and has higher political ambitions.\n\nRumors of a 2028 White House run started circulating after she delivered a lackluster three-minute virtual address to the Democratic state political convention that was politely received by the audience.\n\nIn a steady, monotone voice, she spoke about the Trump administration's recent actions against universities and praised activists efforts to fight the president's agenda.\n\n'While this administration in Washington tries to divide us, we hear know that we are stronger when we stand together,' she said, a flashback to her 2024 campaign slogan.\n\nHarris' failure to appear at the convention and her video address suggested she was not interested in running for governor of California, and instead pursuing a return to presidential politics. \n\nThe Democratic primary for the governor race is scheduled for June 2, 2026, with the general election scheduled for November.\n\nHarris has always been popular in California, easily beating Democratic challengers in her race for Attorney General and her race for Senator of California.\n\nHer 2020 race for president, however, failed spectacularly as she ended her campaign before the Iowa caucuses and the California primary.\n\nSince her loss, Harris has vowed to 'stay in the fight' and organized some of her trusted aides into the organization Pioneer49, while she explores her political future.\n\nCalifornia Democratic activists are frustrated by the lack of signals from Harris, as they are impatient to move forward with a clear candidate. \n\nIf Harris runs for governor, she will likely forego another run for president in 2028, which Democratic strategists in Washington, DC fully expect her to explore.\n\nShe continues to delay any decisions about running for governor or diving into presidential politics again, telling advisors she will made a decision in late-summer. \n\nA third option remains, that she will forego a political career entirely and remain a paid speaker and inspirational figure for activists with the option of publishing a book of her memoirs. \n\nIn the meantime, Harris continues to take the stage to protest the Trump administration and rally activists. \n\nLast week, she appeared at an event in Australia where she shared a bizarre story about her mother and spiraled into word salads when asked to speak about the importance of humility. \n\nHarris also appeared at the lavish Met Gala last month wearing a custom look from Off-White, designed by creative director IB Kamara, but skipped the red carpet. \n\nThe failed presidential candidate also took the stage at Emerge 20th anniversary gala at the Palace Hotel in San Francisco to deliver the keynote speech that began late in the evening. \n\n'It's good to be home!' Harris laughed as she took the stage, criticizing Trump for his agenda, particularly his tariffs.\n\n'Instead of the administration working to advance America's highest ideals, we are witnessing a wholesale abandonment of those ideals,' she said.\n\nTrump's agenda, she said, was 'not lowering costs' and 'not making life more affordable' and 'not what they promised.'\n\nShe noted that the Trump administration was counting on the fact that fear was 'contagious.'\n\nShe also urged Democrats to find courage in the video of the San Diego Zoo elephants who responded to a recent earthquake by circling around each other.\n\n'As soon as they felt the earth shaking beneath their feet, they got in a circle and stood next to each other to protect the most vulnerable,' she said. 'Think about it. What a powerful metaphor.'\n\nHarris cautioned Democrats from dismissing Trump's efforts as 'chaos.'\n\n'Understand what we are in fact witnessing is a high velocity event, where a vessel is being used for the swift implementation of an agenda that has been decades in the making,'\n\nShe urged Americans to stand against the administration with courage.\n\n'What we are experiencing right now is exactly what they envisioned for America, right now we are living in their vision for America, but this is not a vision that American's want.'\n\nShe praised people who protested the president's agenda, including his deportation orders.\n\n'It is not okay to detain and disappear American citizens or anyone without due process,' she said.\n\nHarris only spoke for about 15 minutes, but it was the crowning moment for the event that helped raise money for female political candidates.","summary":"Kamala Harris triggered further speculation over the weekend that she is not running for governor of California and has higher political ambitions.","url":"https://www.dailymail.co.uk/news/article-14772923/Kamala-Harris-white-house-campaign-2028.html","image":"https://i.dailymail.co.uk/1s/2025/06/02/16/98968499-0-image-a-5_1748877486129.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/01/2996766617872611385/1024x576_MP4_2996766617872611385.mp4","publish_date":"2025-06-02 17:05:12","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.064},{"id":327396384,"title":"California Democrats uncertain about Kamala Harris’ potential run for governor","text":"Some California Democrats are unsure about former Vice President Kamala Harris launching a gubernatorial bid in her home state following her loss to President Donald Trump, according to reports. \"I think she’d be fine. I mean, she’s already been a state leader, right?\" Denise Robb, a Democratic Party delegate from Pasadena, told the Washington Post. \"It’s just that she lost the presidential race and she’s been almost — gone. We don’t hear from her. We don’t see her.\" The Post and The New York Times reported on Sunday that activists and delegates within the party weren't all in on the former vice president, who has held statewide office in California before as attorney general and a U.S. senator. Harris delivered a 3-minute video speech at a gathering of thousands of California Democrats over the weekend, with other gubernatorial candidates in attendance. \"I don’t think she should get into the campaign for governor,\" Mark Gracyk, a delegate from San Diego, told the Times. \"The working class would say, ‘Oh there she is again, she has the support of the elites.’\" HARRIS DODGES QUESTIONS ABOUT POLITICAL FUTURE, POSSIBLE RUN FOR CALIFORNIA GOVERNOR The former vice president has made a handful of public appearances since her 2024 election loss, including a speech that criticized Trump's first 100 days in office in early May. Amanda Day, a delegate from Merced, told the Post that her support for Harris in the 2024 election didn't automatically mean she would support the former VP for governor, should she choose to run. Day also noted that Harris' past as a state attorney general might cause a problem for her. \"I liked her as a presidential candidate, but it was a different job,\" Day said. \"Coming back to California is a whole other story. She has history here.\" Ayo Banjo, a delegate from Santa Cruz, told the Times that she wanted to understand where Harris stands right now. KAMALA HARRIS POTENTIAL RUN FOR CALIFORNIA GOVERNOR MET WITH INDIFFERENCE FROM POLICY INFLUENCERS \"I wonder where her priorities are, and where she’s at right now,\" Banjo said. \"I do support her and think that she’s great, but right now I have more questions than answers.\" Former Democratic lawmaker Katie Porter, Lt. Gov. Eleni Kounalakis, former Los Angeles Mayor Antonio Villaraigosa, and former Health and Human Services Secretary Xavier Becerra are among the other Democrats who have launched a bid for California governor. Villaraigosa has charged that Harris and Becerra, who both served in the Biden administration, were involved in a cover-up of Biden's decline while in office, citing the new book, \"Original Sin,\" which delves into the scandal. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"Now, we have come to learn this cover-up includes two prominent California politicians who served as California Attorney General – one who is running for Governor and another who is thinking about running for Governor,\" he said in a statement. \"Those who were complicit in the cover-up should take responsibility for the part they played in this debacle, hold themselves accountable, and apologize to the American people. I call on Kamala Harris and Xavier Becerra to do just that – and make themselves available to voters and the free press because there’s a lot of questions that need to be answered,\" Villaraigosa continued. CLICK HERE TO GET THE FOX NEWS APP Harris is set to decide her next move by the end of the summer. Former Vice President Harris did not immediately respond to a request for comment from Fox News Digital.","summary":"Some Democrats are questioning former Vice President Kamala Harris&apos; possible California gubernatorial bid, citing concerns about her history as state attorney general and more.","url":"https://www.foxnews.com/media/california-democrats-uncertain-about-kamala-harris-potential-run-governor","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/harris-california.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 17:00:06","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":0.11},{"id":327384594,"title":"‘60 Minutes’ legend Lesley Stahl says she’s ‘angry’ at CBS boss Shari Redstone over Trump lawsuit","text":"Lesley Stahl, who has spent decades as a correspondent for the seminal Sunday night newsmagazine 60 Minutes, is making it clear that she is “angry” with her corporate boss for looking to settle Donald Trump’s “frivolous” civil lawsuit against CBS News.\n\nThe legendary newswoman also said she is “pessimistic” about the future of 60 Minutes, adding that “we’re in very dark times” and that she’s already preemptively mourning the potential destruction of the long-running program amid an upcoming merger and the president’s attacks on legacy media.\n\nIn a wide-ranging conversation with The New Yorker’s chief editor David Remnick, Stahl sounded off on CBS parent company Paramount's efforts to make Trump’s $20 billion lawsuit over the way 60 Minutes edited an interview with Democratic nominee Kamala Harris, which the president contends was done “deceitfully” to interfere in the 2024 election. \n\nFollowing Trump’s return to the White House, Paramount’s top shareholder Shari Redstone has pushed for a settlement as the company needs the administration’s approval for an $8 billion merger with Skydance Media, which pro-Trump business mogul Larry Ellison backs. Additionally, Redstone has not only pressured 60 Minutes to ease up on its Trump coverage amid the lawsuit and merger drama, but also criticized the show over the way it's covered the Gaza war. \n\nAmid the discussions with Trump’s legal team about a settlement, 60 Minutes executive producer Bill Owens and CBS News chief Wendy McMahon – who had said they would not apologize as part of any deal with the president – abruptly resigned. Paramount’s board has reportedly offered Trump a $15 million settlement, which is in line with ABC News’ capitulation to the president, but Trump is demanding at least $25 million and an apology.\n\nAsked by Remnick what is behind the president’s lawsuit, Stahl — who has interviewed Trump four times — said that it is an effort “to chill us,” noting that “there aren’t any damages” suffered by Trump. “I mean, he accused us of editing Kamala Harris in a way to help her win the election. But he won the election,” she added. Trump’s legal team has since argued in court that the interview caused the president “mental anguish.” \n\nLabeling it as a “frivolous” lawsuit, Stahl went on to describe Owens as a “hero” to the newsroom while lobbing criticisms towards Redstone over the 60 Minutes producer feeling the need to step down.\n\n“[H]e was being asked to either not run pieces or to change parts of the stories, and he was standing up to that. I don’t know, frankly, if there was one request that led to it or just an accumulation, one after the next,” she said.\n\n“That was just painful. Painful,” she continued, speaking about Owens’ resignation. “Everybody at ‘60 Minutes’—I think everybody, most of us—really appreciated his standing up to the pressure, and saw him in heroic terms. So when he announced that he was stepping down, it was a punch in the stomach. It was one of those punches where you almost can’t breathe.”\n\nAdding that McMahon had also served as an “intermediary between us and the corporation, and she sided with CBS News,” Stahl then expressed disappointment over the likelihood that Paramount will settle with the president.\n\n“Are you angry at Shari Redstone?” Remnick wondered, prompting Stahl to reply: “Yes, I think I am. I think I am.”\n\nAt the same time, though, the veteran CBS reporter said that while Owens being forced out may have been a bridge too far for much of the staff, she claimed he urged everyone on the show to stay.\n\n“Bill Owens leaving was a line, and here we all are,” she stated. “He asked us not to resign. He explicitly asked us not to resign. Because it was discussed that we would leave en masse.”\n\nStahl also said it was “hard” and “not a small thing” that Redstone had been applying pressure on the news division over its coverage, making her wonder if “any corporation should own a news operation” going forward. \n\n“It is very disconcerting,” she proclaimed.\n\nAs for CBS News’ new “corporate overlords” at Skydance if the merger goes through, Stahl said she’s “praying” and “hoping” that they'd allow the network “to be independent” and for journalists to do their jobs. Still, she acknowledged that it could be a “little Pollyannaish” to believe that will be the outcome.\n\n“I’m not optimistic. I am not. I’m pessimistic,” she told Remnick. “I’m pessimistic about the future for all press today. The public doesn’t trust us. The public has lost faith in us as an institution. So we’re in very dark times.”\n\nStahl also expressed concern about the fragility of press institutions as a whole, especially with mega-billionaires and large conglomerations pressuring the news organizations they own to soften their coverage of the current administration while they cozy up to the president.\n\n“The pain in my heart is that the public does not appreciate the importance of a free and strong and tough press in our democracy,” she lamented, adding: “We are a headache. An expensive headache. And that’s part of the fragility.”\n\nAmid the continued push to reach a settlement with Trump, Democratic lawmakers have warned the Paramount board and Redstone that paying the president to kill the lawsuit could run afoul of anti-bribery laws, considering that the company is hoping to coax the administration to approve a merger. The California State Senate has now opened an inquiry into Paramount over whether it violated state laws on bribery, inviting both Owens and McMahon to testify.\n\nParamount executives, in fact, have even discussed the possibility of being held liable or criminally charged if the business settles the complaint. The Freedom of the Press Foundation has since threatened to sue the company if it reaches a settlement with the president.","summary":"‘I’m pessimistic about the future for all press today,’ Lesley Stahl said in a wide-ranging interview this weekend","url":"https://www.independent.co.uk/news/world/americas/us-politics/lesley-stahl-60-minutes-shari-redstone-trump-lawsuit-b2762200.html","image":"https://static.independent.co.uk/2025/03/19/04/Media_CBS_60_Minutes_41571.jpg?width=1200","video":null,"publish_date":"2025-06-02 16:56:07","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.137},{"id":327378270,"title":"‘60 Minutes’ legend Lesley Stahl says she’s ‘angry’ at CBS boss Shari Redstone over Trump lawsuit","text":"Lesley Stahl, who has spent decades as a correspondent for the seminal Sunday night newsmagazine 60 Minutes, is making it clear that she is “angry” with her corporate boss for looking to settle Donald Trump’s “frivolous” lawsuit against CBS News.\n\nThe legendary newswoman also said she is “pessimistic” about the future of 60 Minutes, adding that “we’re in very dark times” and that she’s already preemptively “mourning” the potential destruction of the long-running program amid an upcoming merger and the president’s attacks on legacy media.\n\nIn a wide-ranging conversation with The New Yorker’s chief editor David Remnick this past weekend, Stahl sounded off on CBS parent company Paramount's efforts to make Trump’s $20 billion lawsuit over the way 60 Minutes edited an interview with Kamala Harris, which the president contends was done “deceitfully” to interfere in the 2024 election.\n\nFollowing Trump’s return to the White House, Paramount’s top shareholder Shari Redstone has pushed for a settlement as the company needs the administration’s approval for an $8 billion merger with Skydance Media, which pro-Trump business mogul Larry Ellison backs. Additionally, Redstone has not only pressured 60 Minutes to ease up on its Trump coverage amid the lawsuit and merger drama, but also criticized the show over the way it's covered the Gaza war.\n\nAmid the discussions with Trump’s legal team about a settlement, 60 Minutes executive producer Bill Owens and CBS News chief Wendy McMahon – who had said they would not apologize as part of any deal with the president – abruptly resigned. Paramount’s board has reportedly offered Trump a $15 million settlement, which is in line with ABC News’ capitulation to the president, but Trump is demanding at least $25 million and an apology.\n\nAsked by Remnick what is behind the president’s lawsuit, Stahl — who has interviewed Trump four times — said that it is an effort “to chill us,” noting that “there aren’t any damages” suffered by Trump. “I mean, he accused us of editing Kamala Harris in a way to help her win the election. But he won the election,” she added. Trump’s legal team has since argued in court that the interview caused the president “mental anguish.”\n\nLabeling it as a “frivolous” lawsuit, Stahl went on to describe Owens as a “hero” to the newsroom while lobbing criticisms towards Redstone over the 60 Minutes producer feeling the need to step down.\n\n“[H]e was being asked to either not run pieces or to change parts of the stories, and he was standing up to that. I don’t know, frankly, if there was one request that led to it or just an accumulation, one after the next,” she said.\n\n“That was just painful. Painful,” she continued, speaking about Owens’ resignation. “Everybody at ‘60 Minutes’—I think everybody, most of us—really appreciated his standing up to the pressure, and saw him in heroic terms. So when he announced that he was stepping down, it was a punch in the stomach. It was one of those punches where you almost can’t breathe.”\n\nAdding that McMahon had also served as an “intermediary between us and the corporation, and she sided with CBS News,” Stahl then expressed disappointment over the likelihood that Paramount will settle with the president.\n\n“Are you angry at Shari Redstone?” Remnick wondered, prompting Stahl to reply: “Yes, I think I am. I think I am.”\n\nAt the same time, though, the veteran CBS reporter said that while Owens being forced out may have been a bridge too far for much of the staff, she claimed he urged everyone on the show to stay.\n\n“Bill Owens leaving was a line, and here we all are,” she stated. “He asked us not to resign. He explicitly asked us not to resign. Because it was discussed that we would leave en masse.”\n\nStahl also said it was “hard” and “not a small thing” that Redstone had been applying pressure on the news division over its coverage, making her wonder if “any corporation should own a news operation” going forward. “It is very disconcerting,” she proclaimed.\n\nAs for CBS News’ new “corporate overlords” at Skydance if the merger goes through, Stahl said she’s “praying” and “hoping” that they'd allow the network “to be independent” and for journalists to do their jobs. Still, she acknowledged that it could be a “little Pollyannaish” to believe that will be the outcome.\n\n“I’m not optimistic. I am not. I’m pessimistic,” she told Remnick. “I’m pessimistic about the future for all press today. The public doesn’t trust us. The public has lost faith in us as an institution. So we’re in very dark times.”\n\nStahl also expressed concern about the “fragility” of press institutions as a whole, especially with mega-billionaires and large conglomerations pressuring the news organizations they own to soften their coverage of the current administration while they cozy up to the president.\n\n“The pain in my heart is that the public does not appreciate the importance of a free and strong and tough press in our democracy,” she lamented, adding: “We are a headache. An expensive headache. And that’s part of the fragility.”\n\nAmid the continued push to reach a settlement with Trump, Democratic lawmakers have warned the Paramount board and Redstone that paying the president to kill the lawsuit could run afoul of anti-bribery laws, considering that the company is hoping to coax the administration to approve a merger. The California State Senate has now opened an inquiry into Paramount over whether it violated state laws on bribery, inviting both Owens and McMahon to testify.\n\nParamount executives, in fact, have even discussed the possibility of being held liable or criminally charged if the business settles the complaint. The Freedom of the Press Foundation has since threatened to sue the company if it reaches a settlement with the president.","url":"https://uk.news.yahoo.com/60-minutes-legend-lesley-stahl-164531899.html","image":"https://media.zenfs.com/en/the_independent_577/ffb1d0424b5a42a2dbf73c583fc6123a","video":null,"publish_date":"2025-06-02 16:45:31","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.15},{"id":327367050,"title":"CNN’s Scott Jennings slams Dems for being on wrong side of key issues — makes surprise pick to rejuvenate party","text":"Conservative CNN pundit Scott Jennings ripped the Democratic Party for being hijacked by “radicals” who stand on the wrong side of every “80/20” issue — and offered a surprise pick to bring them back to the mainstream.\n\n“I’ll defend the Democrats, they are for things. Illegal aliens, you’re for boys in girls’ sports,” Jennings jabbed during an appearance Sunday on CNN’s “State of the Union,” nodding at the issue of transgender athletes competing in sex-separated sports.\n\n“That’s why you have such struggles right now in your party, because you’re not for anything that’s on the right side of any of the 80/20 issues that are driving this cultural divide in America.”\n\nHe slammed progressive Dems in the limelight, including Reps. Alexandria-Ocasio Cortez and Jasmine Crockett, and suggested party leaders should instead listen to voices like Maryland Gov. Wes Moore. \n\n“I think Wes Moore is actually a pretty talented communicator,” Jennings said.\n\n“Moore is interesting, probably more interesting than some of the radicals you have out there, Crockett, AOC. I mean those are the true leaders of your party right now, but you’d probably be better off replacing them with Moore,” Jennings said.\n\nHe blasted failed vice presidential candidate Tim Walz, the governor of Minnesota, who attended a South Carolina fish fry over the weekend alongside Moore as whispers of potential 2028 primary runs swirled.\n\n“The other person who spoke in South Carolina, Tim Walz, is a special mixture of extreme buffoonery and a mean spirit, which is a toxic brew. He is not the future of the Democratic party,” Jennings said.\n\nMoore has insisted that he is “not running” for president, but many viewed his South Carolina tour as a glimpse into the 2028 primary campaign.\n\nAt a dinner on Friday, Moore gave a 30-minute speech about his family’s ties to the state and called on the party to unite and take action.\n\n“Gone are the days when the Democrats are the party of ‘no’ and ‘slow,’” Moore said. “We must be the party of ‘yes’ and ‘now.’”\n\nJennings comments come on the heels of a new poll that found fewer than a fifth of Americans view Democrats as a party with strong leadership that is able to get things done, with Republicans scoring roughly double on both of those metrics.\n\nWhen asked about which party has strong leaders, 40% of American adults said Republicans, compared to 16% Democrats and 43% neither, according to a CNN/SSRS survey taken last month.\n\nAnother national study conducted by co/efficient in early May found the Democratic Party is rudderless, with AOC getting 26% of the votes while another 26% said there was no face of the party.\n\nA CNN poll in March asked Democratic-aligned adults to name the leader they felt “best reflects the core values” of the party. AOC emerged on top, albeit with a measly 10%.\n\nFormer Vice President Kamala Harris and Vermont Sen. Bernie Sanders followed at 9% and 8%, respectively.","summary":"\"You’re not for anything that’s on the right side of any of the 80/20 issues that are driving this cultural divide in America,” Jennings jabbed.","url":"https://nypost.com/2025/06/02/media/cnns-scott-jennings-slams-dems-for-being-on-wrong-side-of-key-issues-makes-surprise-pick-to-rejuvenate-party/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/105749589.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-02 16:08:18","author":"Taylor Herzlich","authors":["Taylor Herzlich"],"language":"en","source_country":"zm","sentiment":-0.272},{"id":327379744,"title":"Cardi B officially announces new beau with steamy photo amid Offset divorce drama","text":"Cardi B made her relationship with NFL player Stefon Diggs Instagram official only days after calling her ex, Offset, a deadbeat parentShe posted many photos from her recent weekend getaway with her new lover on Sunday, June 1The WAP rapper featured the New England Patriots wide receiver in a photo carousel posted on Instagram Sunday\n\nAmerican rapper Cardi B got Instagram official with her new partner, all while embroiled in divorce proceedings with her estranged spouse, Offset.\n\nOn Sunday, June 1, the rapper took to Instagram to share a series of images with her new boyfriend, NFL player Stefon Diggs, amidst her difficult divorce from her former.\n\nThe Up hitmaker, born Belcalis Cephus, released photographs of herself in a captivating one-piece swimsuit posing on a yacht during a romantic getaway with her new lover as they celebrated their half-year anniversary.\n\nAs a wrap-up post for the month of May, she said in her caption: 'Chapter 5......Hello Chapter Six.' \n\nThis comes after she finally disclosed the name of her third child and slammed her ex Offset, 33, in a fiery outburst after discovering he sought 'everything' during their divorce procedures.\n\nIn her post, she shared many photographs of herself wearing a black one-piece swimsuit with silver embellishments bordering the plunging neckline and hip tattoo-baring waistband. \n\nShe also shared a photo of herself cuddling up with her lover on the boat as they leaned in for a kiss, as well as another of herself with dishevelled hair and appearing naked beneath a faux fur blanket.\n\nThe rapper also shared a video of a spectacular display of red roses in her room, as well as another photo of herself holding even more roses at a different moment. \n\nShe also displayed more of what appeared to be more extravagant gifts, including a video of herself displaying sparkling diamonds on her wrist and hands while holding a brilliant blue Birkin bag. \n\nAnother video showed her twerking and rapping to her partner and their buddies while they partied in a hot pool. \n\nHer post promoting her new romance also included a video of herself singing to herself in a lift and displaying her hourglass body while her partner stood to the side.\n\nCardi B also posted another video of herself singing while getting her hair and makeup done, appearing otherworldly with blonde and pink ombré curls and a vivid blue halter top.\n\nShe closed her post with a post-glam shot of herself in a convertible, lying back with the seat down.\n\nThe couple was first rumoured to be dating earlier this year after being spotted together on Valentine's Day in Miami, People reports.\n\nThe couple has also made several public appearances since then, confirming their romance by sitting courtside at a New York Knicks game and attending a Met Gala afterparty together in May.\n\nDiggs, an NFL wide receiver with the New England Patriots, previously played for the Buffalo Bills.\n\nCardi B supports Kamala Harris\n\nLegit.ng, in a previous report, noted that as the results of the United States presidential elections unfolded, rapper Cardi B continued to declare her support for Kamala Harris. \n\nKamala's ideologies appealed to her supporters, and Cardi B made it one of the bases for supporting the US politician. \n\nThe politician is the Vice President, and Cardi B believed the country needed someone who hails the Holy Mary. \n\nSource: Legit.ng","summary":"American rapper Cardi B had the internet buzzing as she shared a picture of herself and new lover Stefon Diggs having a good time on a yacht, triggering reactions.","url":"https://www.legit.ng/entertainment/celebrities/1657941-cardi-b-officially-announces-beau-steamy-photo-offset-divorce-drama/","image":"https://cdn.legit.ng/images/1200x675/ccb39deb087c353d.jpeg?v=1","video":null,"publish_date":"2025-06-02 15:06:10","author":"Bayo Olupohunda,Chinasa Afigbo","authors":["Bayo Olupohunda","Chinasa Afigbo"],"language":"en","source_country":"ng","sentiment":0.638},{"id":327356612,"title":"How Trump led GOP from 2012 despair to 2024 triumph","text":"Four years after that, even though Trump lost to Joe Biden, some of the trends that favored Republicans continued. And then came 2024, when the weakening of the Democratic Party accelerated under Biden and then Kamala Harris, and Trump won a historic comeback victory.\n\nA new report shows this extraordinary change — from Republican despair in 2012 to triumph in 2024. It is not told from a GOP perspective. The report is by the progressive Democratic data-crunching firm Catalist, which sought to understand Democratic losses. But whatever the perspective, the analysts examined voter file information, precinct-level data, voting history, polls, and other numbers to come up with the most comprehensive picture yet of who voted how in 2024.\n\nWhat is particularly valuable is that Catalist then put the 2024 information in the context of data from the 2012, 2016, and 2020 presidential elections. That way, we can see which direction each party was moving with individual groups of voters. Spoiler alert — it’s a feel-good story for Republicans.\n\nThe trends are striking. Just go through the Obama coalition — especially black, Hispanic, and young voters. In 2012, when Obama was on the ticket, 96% of black voters voted for the Democratic candidate. In 2016, the first year Trump was on the ticket, black Democratic support ticked downward to 93%. Then it fell to 89% in 2020, and then to 85% in 2024. Among black men, support for the Democratic candidate fell to 79%. Support levels were even lower among young black voters.\n\nThe trend looked a little different but was still impressive among Hispanic voters. In 2012, 68% of Hispanic voters chose the Democratic candidate. In 2016, that number went up to 70%. But then it fell to 63% in 2020 and 54% in 2024. That’s quite a drop. And again, the levels were even lower among young Hispanic voters.\n\nThe move was similar among Asian voters — 74% Democratic in 2012, 70% in 2016, 65% in 2020, and 61% in 2024.\n\nAmong young voters, the Catalist report included data only from 2020 and 2024, but among voters aged 18 to 29, support for the Democratic candidate fell from 61% to 55% in that time.\n\nApart from demographic categories, Catalist also looked at several groups of voters by voting frequency — those who had voted in every one of the last four elections, those who had voted in three of them, in two, in one, and those who had not voted in any of those four contests. In 2024, only the most loyal Democrats, voting in four of four elections, stayed with Harris in great numbers.\n\n“Harris lost vote share among … younger voters, men, voters of color, and infrequent voters,” Catalist wrote. “Trump did particularly well among these groups of voters, even in comparison to other Republicans in recent years.”\n\nRemember, the Catalist analysts are progressive Democrats. They focused their report on the Democratic Party’s decline from 2012 to 2024. But those Democratic losses were Republican gains. The story is as much the GOP’s increasing appeal to formerly Democratic voter groups as it is the Democrats’ loss. And the change in the Republican Party’s standing among voters was enormous.\n\nAfter Romney’s 2012 defeat, the Republican National Committee commissioned an “autopsy” — a report on what went wrong and how to fix it. Read today, the document’s plaintive tone is striking. “Public perception of the party is at record lows,” it said. “Young voters are increasingly rolling their eyes at what the party represents, and many minorities wrongly think that Republicans do not like them or want them in the country.”\n\nThe GOP prescription was to join with Democrats on the issue of immigration. “We need to campaign among Hispanic, black, Asian, and gay Americans and demonstrate we care about them, too,” the report continued. “We must embrace and champion comprehensive immigration reform. If we do not, our party’s appeal will continue to shrink to its core constituencies only.”\n\nIn one of the delicious ironies of history, the GOP accomplished its goal of broadening its appeal to minorities and younger voters by aggressively ignoring the advice of the party’s top officials and by embracing a candidate some of the party’s leaders rejected. Renewal came in the form of Donald J. Trump.\n\nTrump led the party to win more votes from black voters, Hispanic voters, Asian voters, young voters, and voters who rarely, if ever, voted. And he did it while emphatically rejecting comprehensive immigration reform, which the 2012 GOP leaders believed would be their salvation. Trump rejected some other cherished Republican orthodoxies, too.\n\nMost importantly, though, Trump succeeded among Republicans and then nationally by being a strong leader. It is safe to say he is a unique individual, both as a leader and as a man. There’s no telling whether GOP gains will last beyond Trump’s time in office. But for more than a decade, Trump has been building a Republican coalition that accomplished things the earlier GOP leaders thought impossible.","summary":"HOW TRUMP LED GOP FROM 2012 DESPAIR TO 2024 TRIUMPH. The Republican Party was in desperate straits in the weeks following the 2012 presidential election. There were several reasons. One, its losing nominee, Mitt Romney, was a poor candidate whom a significant part of the GOP base, and an even more significant part of the [&#8230;]","url":"https://www.washingtonexaminer.com/daily-memo/3428258/how-trump-led-gop-2012-despair-2024-triumph/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/chamber-backs-bill.webp","video":null,"publish_date":"2025-06-02 14:39:39","author":"Byron York","authors":["Byron York"],"language":"en","source_country":"US","sentiment":0.06},{"id":327343520,"title":"One Republican has an 'urgent reason to be outspoken' about Trump’s megabill","text":"Although Sen. Lisa Murkowski (R-Alaska) isn't a full-fledged Never Trumper, she is, at times, more willing to openly criticize President Donald Trump than other GOP senators. \n\nMurkowski voted \"guilty\" in Trump's second impeachment trial, said she wouldn't vote for either Trump or Democratic nominee Kamala Harris in the United States' 2024 presidential election, and voted against confirming some of Trump's nominees (including Defense Secretary Pete Hegseth and FBI Director Kash Patel). Conservative but not far right, Murkowski says she considers herself \"more of a Ronald Reagan Republican\" than a \"Trump Republican.\"\n\nIn an article published on June 2, the New York Times' Catie Edmondson describes the role Murkowski could play in shaping Trump's \"big, beautiful bill — which was narrowly passed, 215-214, in the U.S. House of Representatives and is now being considered in the U.S. Senate.\n\nREAD MORE: 'Mass delusion fueled by charisma': Expert explains why Trump's followers still believe in him\n\n\"Now, as Senate Republicans take up sprawling legislation carrying Mr. Trump’s domestic agenda,\" Edmondson reports, \"Ms. Murkowski is poised to become one of the most influential voices demanding changes to her party's signature bill. She has already indicated that there are at least two major provisions in the measure that she does not support: adding stringent new work requirements to Medicaid, and the termination of clean energy tax credits established under the Biden Administration — a repeal that Speaker Mike Johnson accelerated to help win the support of conservatives to muscle the legislation through the House.\"\n\nMurkowksi said of the bill, \"There are provisions in there that are very, very, very challenging, if not impossible, for us to implement.\"\n\nEdmondson notes that the conservative Club for Growth is pointing to Murkowski as someone who may \"block Trump's agenda.\"\n\n\"Mr. Trump has made it clear that he does not appreciate Ms. Murkowski's dissent, including her among a group of Republican senators he called 'unbelievably disloyal,'\" the Times reporter observes. \"Ms. Murkowski, who, at 68, is serving her fourth full term in the Senate, has never been easily cowed by the prevailing political winds in her party…. Now, Ms. Murkowski has another, more urgent reason to be outspoken.\"\n\nREAD MORE:'Disappointed': Musk says Trump's bill 'undermines the work that the DOGE team is doing'\n\nEdmondson adds, \"Alaska relies more heavily on federal funding and programs than perhaps any other in the country, with roughly 37 percent of the state’s annual budget coming from the federal government, according to the Foraker Group, a nonpartisan group that serves Alaska’s nonprofit and tribal organizations.\"\n\nREAD MORE:'Beyond the pale': Scarborough rips 'childish' Joni Ernst for 'mocking her constituents","summary":"Although Sen. Lisa Murkowski (R-Alaska) isn't a full-fledged Never Trumper, she is, at times, more willing to openly criticize President Donald Trump than other GOP senators. \n\nMurkowski voted \"guilty\" in Trump's second impeachment trial, said she wouldn't vote for either Trump or Democratic nominee Kamala Harris in the United States' 2024 presidential election, and voted against confirming some of Trump's nominees (including Defense Secretary Pete Hegseth and FBI Director Kash Patel). Conservative but not far right, Murkowski says she considers herself \"more of a Ronald Reagan Republican\" than a \"Trump Republican.\"\n\nIn an article published on June 2, the New York Times' Catie Edmondson describes the role Murkowski could play in shaping Trump's \"big, beautiful bill — which was narrowly passed, 215-214, in the U.S. House of Representatives and is now being considered in the U.S. Senate.\n\nREAD MORE:  'Mass delusion fueled by charisma': Expert explains why Trump's followers still believe in him\n\n\"Now, as Senate ","url":"https://www.alternet.org/murkowski-trump-ny-times/","image":"https://www.alternet.org/media-library/image.jpg?id=55400656&width=1200&height=600&coordinates=0%2C208%2C0%2C208","video":null,"publish_date":"2025-06-02 14:06:04","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":0.103},{"id":327320368,"title":"Democrats need soul-searching, not market research","text":"It’s been six months since Democrats lost the presidential election and they still can’t seem to get a clue.\n\nThey’re leaving no stone unturned in the hunt for answers and no expense is being spared. They’re doing everything they can think of – except look inward.\n\nMuch has been said about Democrats’ problem with men, especially working class men, so they are dumping money into programs that will teach them how to talk like one of the guys.\n\nThe New York Times discovered a $20-million effort to “reverse the erosion of Democratic support among young men, especially online,” called “SAM — short for ‘Speaking with American Men: A Strategic Plan,” which aims to “study the syntax, language and content that gains attention and virality in these spaces.”\n\nBut you can’t buy authenticity and all the massaging of syntax in the world won’t make the Demsplaining more palatable.\n\nDemocrats doubled down on issues that didn’t resonate with male voters and the tactics often used were corny, insincere and offensive.\n\nHere’s a great example from the Times article of what I mean: “For now, Democratic donors and strategists have been gathering at luxury hotels to discuss how to win back working-class voters.”\n\nWould things be different if these donors and strategists met at dive bars or MMA fights? Probably not, but it would seem less out of touch.\n\nDemocrats didn’t lose by much and maybe the analysis need not go further than the obvious. They ran a “Weekend at Bernie’s” White House and campaigned with someone who was mentally unfit for office, then-President Joe Biden. They insisted that everything was fine and mocked everyone who saw the truth as a conspiracy theorist (which, it turns out, was millions of voters with eyes).\n\nThat alone eroded their credibility, but they didn’t stop there. They then thrust a deeply-unpopular Vice President, Kamala Harris, to the top of the ticket without any sort of open process after she flamed out quickly and thoroughly in the 2020 primary.\n\nMaybe these were the best political decisions compared to the alternatives, but both severely undercut central themes to Democratic campaigns, like transparency, normalcy and democracy.\n\nThen Harris chose Minnesota Gov. Tim Walz as her running mate, which she did under the assumption that men would be ok with her, a woman of Black and Indian descent, because he was a white midwesterner.\n\nAnother miscalculation.\n\n“‘I could code talk to White guys watching football, fixing their truck’ and ‘put them at ease,’” Walz told a group of Harvard elites a month ago.\n\nTurns out he was wrong. Walz was so awkward and so obviously trying too hard. Printing up campaign camo hats didn’t work either. What Harris and Walz and the Democratic Party at large fail to understand is that the men they were trying to reach are not obsessed with identity.\n\nMale voters will vote for a woman, even a woman of color, if she is speaking to issues that move them. Not only did Harris fail to do that, but her supporters screamed racism and sexism whenever male voters had doubts about Harris.\n\nThe Biden coverup and the condescending male outreach efforts would have probably been enough to sink the campaign. But the final piece to the problem plaguing Democrats is that they too often leaned into abstract or woke issues and ignored the masses’ economic woes.\n\nTake the Democrats’ war on gas. In California we see it every day. They have deliberately driven up the cost of gas in the hopes it will drive down demand (it hasn’t) and are trying to regulate the oil and gas industry out of existence. Not only has this hurt working class families who still need to drive places and have to pay for gas, but it also threatens many good-paying jobs worked by the very men they are wooing.\n\nDemocrats may sincerely believe curbing gas and coal production is essential to fighting climate change. But many people see losing their job or increasingly higher prices on essentials as the real threat.\n\nAbortion is another good example. Democrats for years have made this a key issue, and, at times, the only issue. Exclusively talking about “women’s health” is not going to motivate a lot of men.There are of course various woke topics that either go over people’s heads or downright repel them, such as: Defund the police, land dedications, preferred pronouns, equity, white privilege, LatinX, reparations, gender ideology and support for Hamas.\n\nCalifornia has the highest unemployment rate in the country, it tops the nation in adult illiteracy and homelessness, and it has an exorbitantly high cost of living, driven largely by high taxes, bad energy policy and overly-bureaucratic housing policy. And yet, lawmakers seem to spend most of their time banning plastic bag bans and gas-powered cars, eliminating the gig economy, punishing charter schools and countless other counterproductive things.\n\nWorking class voters, especially men, want good jobs, a lower cost of living, the chance at homeownership and safe communities. They want results from their lawmakers. And they don’t want to be talked down to for being most concerned with their immediate needs.\n\nIt shouldn’t take $20 million worth of market research to figure this out.\n\nMatt Fleming is a columnist for the Southern California News Group. Follow him on X @FlemingWords","summary":"Working class voters, especially men, want good jobs, a lower cost of living, the chance at homeownership and safe communities.","url":"https://www.ocregister.com/2025/06/02/democrats-need-soul-searching-not-market-research/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Election_2024_Harris_25216.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-02 14:00:10","author":"Matt Fleming","authors":["Matt Fleming"],"language":"en","source_country":"US","sentiment":-0.281},{"id":327326150,"title":"Democrats need soul-searching, not market research","text":"It’s been six months since Democrats lost the presidential election and they still can’t seem to get a clue.\n\nThey’re leaving no stone unturned in the hunt for answers and no expense is being spared. They’re doing everything they can think of – except look inward.\n\nMuch has been said about Democrats’ problem with men, especially working class men, so they are dumping money into programs that will teach them how to talk like one of the guys.\n\nThe New York Times discovered a $20-million effort to “reverse the erosion of Democratic support among young men, especially online,” called “SAM — short for ‘Speaking with American Men: A Strategic Plan,” which aims to “study the syntax, language and content that gains attention and virality in these spaces.”\n\nBut you can’t buy authenticity and all the massaging of syntax in the world won’t make the Demsplaining more palatable.\n\nDemocrats doubled down on issues that didn’t resonate with male voters and the tactics often used were corny, insincere and offensive.\n\nHere’s a great example from the Times article of what I mean: “For now, Democratic donors and strategists have been gathering at luxury hotels to discuss how to win back working-class voters.”\n\nWould things be different if these donors and strategists met at dive bars or MMA fights? Probably not, but it would seem less out of touch.\n\nDemocrats didn’t lose by much and maybe the analysis need not go further than the obvious. They ran a “Weekend at Bernie’s” White House and campaigned with someone who was mentally unfit for office, then-President Joe Biden. They insisted that everything was fine and mocked everyone who saw the truth as a conspiracy theorist (which, it turns out, was millions of voters with eyes).\n\nThat alone eroded their credibility, but they didn’t stop there. They then thrust a deeply-unpopular Vice President, Kamala Harris, to the top of the ticket without any sort of open process after she flamed out quickly and thoroughly in the 2020 primary.\n\nMaybe these were the best political decisions compared to the alternatives, but both severely undercut central themes to Democratic campaigns, like transparency, normalcy and democracy.\n\nThen Harris chose Minnesota Gov. Tim Walz as her running mate, which she did under the assumption that men would be ok with her, a woman of Black and Indian descent, because he was a white midwesterner.\n\nAnother miscalculation.\n\n“‘I could code talk to White guys watching football, fixing their truck’ and ‘put them at ease,’” Walz told a group of Harvard elites a month ago.\n\nTurns out he was wrong. Walz was so awkward and so obviously trying too hard. Printing up campaign camo hats didn’t work either. What Harris and Walz and the Democratic Party at large fail to understand is that the men they were trying to reach are not obsessed with identity.\n\nMale voters will vote for a woman, even a woman of color, if she is speaking to issues that move them. Not only did Harris fail to do that, but her supporters screamed racism and sexism whenever male voters had doubts about Harris.\n\nThe Biden coverup and the condescending male outreach efforts would have probably been enough to sink the campaign. But the final piece to the problem plaguing Democrats is that they too often leaned into abstract or woke issues and ignored the masses’ economic woes.\n\nTake the Democrats’ war on gas. In California we see it every day. They have deliberately driven up the cost of gas in the hopes it will drive down demand (it hasn’t) and are trying to regulate the oil and gas industry out of existence. Not only has this hurt working class families who still need to drive places and have to pay for gas, but it also threatens many good-paying jobs worked by the very men they are wooing.\n\nDemocrats may sincerely believe curbing gas and coal production is essential to fighting climate change. But many people see losing their job or increasingly higher prices on essentials as the real threat.\n\nAbortion is another good example. Democrats for years have made this a key issue, and, at times, the only issue. Exclusively talking about “women’s health” is not going to motivate a lot of men.There are of course various woke topics that either go over people’s heads or downright repel them, such as: Defund the police, land dedications, preferred pronouns, equity, white privilege, LatinX, reparations, gender ideology and support for Hamas.\n\nCalifornia has the highest unemployment rate in the country, it tops the nation in adult illiteracy and homelessness, and it has an exorbitantly high cost of living, driven largely by high taxes, bad energy policy and overly-bureaucratic housing policy. And yet, lawmakers seem to spend most of their time banning plastic bag bans and gas-powered cars, eliminating the gig economy, punishing charter schools and countless other counterproductive things.\n\nWorking class voters, especially men, want good jobs, a lower cost of living, the chance at homeownership and safe communities. They want results from their lawmakers. And they don’t want to be talked down to for being most concerned with their immediate needs.\n\nIt shouldn’t take $20 million worth of market research to figure this out.\n\nMatt Fleming is a columnist for the Southern California News Group. Follow him on X @FlemingWords","summary":"Working class voters, especially men, want good jobs, a lower cost of living, the chance at homeownership and safe communities.","url":"https://www.sandiegouniontribune.com/2025/06/02/democrats-need-soul-searching-not-market-research/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Election_2024_Harris_25216.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-02 14:00:10","author":"Matt Fleming","authors":["Matt Fleming"],"language":"en","source_country":"us","sentiment":-0.281},{"id":327328070,"title":"Ex-ESPN star Keith Olbermann claims to know clue that proves Elon Musk's infamous gesture was a Nazi 'salute'","text":"Ex-ESPN star Keith Olbermann claims to know clue that proves Elon Musk's infamous gesture was a Nazi 'salute'\n\nREAD MORE: Riley Gaines wants to race Keith Olbermann for some reason \n\nBy ALEX RASKIN\n\nPublished: 14:50 BST, 2 June 2025 | Updated: 14:53 BST, 2 June 2025\n\nKeith Olbermann, the erstwhile MSNBC and ESPN SportsCenter host, is doubling down on his claim that Elon Musk delivered a Nazi salute at a January rally for President Donald Trump.\n\nAlthough Musk has dismissed such accusations as 'dirty tricks,' Olbermann and other liberal pundits have attacked Trump's largest donor over the incident.\n\nThe frequently analyzed tape shows Musk addressing the crowd at Capital One Arena in Washington on January 20. Before stepping away from the podium at the end of his speech, he placed his right hand over his heart and then extended his arm outward with his palm facing downward and his fingers clutched together.\n\n'My heart goes out to you,' he told the crowd celebrating Trump's electoral win over Kamala Harris. 'It is thanks to you that the future of civilization is assured.'\n\nThat footage has since been studied like the Zapruder film or Maradona's 'Hand of God' goal, with liberals and conservatives giving alternate takes in what's become a political Rorschach test.\n\nOlbermann's latest comment on the subject came in response to self-described 'former liberal' Brandon Straka, who contrasted Musk's gesture with a similar motion from Democratic New Jersey Senator Corey Booker.\n\nOn the left: Senator Corey Booker giving a heartfelt, patriotic salute.\n\nOn the right: Elon Musk personally resurrecting the Third Reich, according to the media.\n\nSame gesture. Different political party.\n\nFunny how that works. pic.twitter.com/5ygUrTOjy8\n— Brandon Straka #WalkAway (@BrandonStraka) June 1, 2025\n\nThe debate continues: Is Musk giving the crowd a Nazi salute or an innocent hand gesture? \n\nThe proof, Olbermann claims, is that Musk's fingers were closed when he extended his arm \n\n'On the left: Senator Corey Booker giving a heartfelt, patriotic salute,' Straka began sarcastically. 'On the right: Elon Musk personally resurrecting the Third Reich, according to the media.\n\n'Same gesture. Different political party,' Straka continued, dropping the sarcasm. 'Funny how that works.'\n\nOlbermann, the 66-year-old ESPN icon who became a fierce critic of conservatives on MSNBC, disagreed in his own irascible way. In fact, Olbermann thinks he has the clue that proves Musk was indeed doing what some refer to as the 'Roman salute.'\n\n'Musk's hand is closed, fingers together,' Olbermann responded on X. 'That's a salute. Booker's fingers are opened. That's a wave goodbye.'\n\nOlbermann then decided to get personal by adding: 'Your brain is devoid of cells. That's an IQ of 27.'\n\nAnd the exchange only went downhill from there as Straka joked about Olbermann having intellectual disabilities.\n\nOlbermann was quickly corrected by angry Musk defenders.\n\n'Maybe, and hear me out, neither are Nazi salutes and that's the entire point,' one added.\n\n'Elon Musk's fingers aren't closed or together, and thumb is bent so if that's your argument, try another,' read a different response.\n\nAt least one person agreed with Olbermann: 'Maybe the difference is one actually looked like a Nazi salute and came from someone who boosts white nationalists weekly.'\n\nMusk has faced other accusations of antisemitism, such as in November of 2023, when he reposted a claim on X that Jewish communities hated whites.\n\n'Jewish communities (sic) have been pushing the exact kind of dialectical hatred against whites that they claim to want people to stop using against them,' read a post from a self-described cyber security expert going by 'Eric.'\n\nMusk responded: 'You have said the actual truth.'\n\nThe South African-born billionaire has also been criticized for allegedly boosting the visibility of antisemitic accounts on X.\n\nShare or comment on this article:\nEx-ESPN star Keith Olbermann claims to know clue that proves Elon Musk's infamous gesture was a Nazi 'salute'\n\nAdd comment","summary":"Keith Olbermann, the erstwhile MSNBC and ESPN SportsCenter host, is doubling down on his claim that Elon Musk delivered a Nazi salute at a January rally for President Donald Trump .","url":"https://www.dailymail.co.uk/sport/othersports/article-14772479/Ex-ESPN-star-Keith-Olbermann-Elon-Musk-Nazi.html","image":"https://i.dailymail.co.uk/1s/2025/06/02/14/98965221-0-image-a-29_1748872182082.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/21/854064585571155187/1024x576_MP4_854064585571155187.mp4","publish_date":"2025-06-02 13:53:24","author":"Alex Raskin,Editor","authors":["Alex Raskin","Editor"],"language":"en","source_country":"jp","sentiment":-0.325},{"id":327325396,"title":"Fox News’ Howard Kurtz rips ‘60 Minutes’ host Scott Pelley for anti-Trump commencement speech: ‘Wildly inappropriate’","text":"Fox News host Howard Kurtz took aim at CBS journalist Scott Pelley over a fiery commencement address the “60 Minutes” correspondent delivered at Wake Forest University, criticizing it as a partisan broadside disguised as a graduation speech.\n\nDuring his “MediaBuzz” program Sunday, Kurtz called out Pelley for what he described as a “harsh rhetorical attack” on President Donald Trump, delivered before an audience of students and their families.\n\n“I just think it’s wildly inappropriate to use a commencement address to say such things,” Kurtz said.\n\nKurtz argued the speech was not only out of place but emblematic of a broader ideological slant at CBS News.\n\n“Doesn’t that reinforce the notion that the network is incredibly biased against the president?” he asked.\n\nPelley, a fixture on “60 Minutes” since 1999, didn’t hold back in his May 19 address to the graduating class at Wake Forest. He warned of what he described as a rising tide of fear and suppression in American public life, tying the climate directly to Trump-era politics.\n\n“This morning our sacred rule of law is under attack,” Pelley told the crowd.\n\n“Journalism is under attack, universities are under attack, freedom of speech is under attack and insidious fear is reaching throughout schools, our businesses, our homes and into our private thoughts.”\n\nHe went on: “The fear to speak — in America? If our government is, in Lincoln’s phrase, ‘of the people, by the people, for the people,’ then why are we afraid to speak? Ignorance works for power. Power can change the definition of the words we used to describe reality. This is an old playbook, my friends. There is nothing new in this.”\n\nPelley’s sweeping address, which drew applause from some in the crowd, was panned by critics online as overwrought and politically charged.\n\nOne social media user slammed the veteran anchor for “raging at Trump in an angry, unhinged commencement address,” while another called him “a self-important, sermonizing propagandist.”\n\nConservative commentator Juanita Broaddrick, who has long accused former President Bill Clinton of rape, labeled Pelley “a pompous POS” in response to the speech.\n\nOthers pointed to the timing of the address, coming as CBS parent company Paramount Global is reportedly in settlement talks with Trump over a $20 billion lawsuit related to a controversial “60 Minutes” interview aired during the 2024 campaign.\n\nTrump’s legal team alleges the show deceptively edited its sit-down with then–Vice President Kamala Harris to aid her candidacy.\n\nLesley Stahl, another veteran of the broadcast, recently told The New Yorker that some “60 Minutes” staffers considered resigning in protest over the potential payout, which could reportedly reach $15 million.\n\n“Did Scott Pelley mention that 60 Minutes edited Kamala’s campaign interview, and they helped her answer questions???” one critic wrote on X, formerly Twitter.\n\n“Until he does that, his credibility is ZERO.”\n\nDespite the backlash, Pelley made a direct appeal to the next generation in his remarks, telling the graduates: “Your country needs you — the country that has given you so much is calling you, the class of 2025, your country needs you and it needs you today.”\n\nIt’s not the first time a broadcast journalist has drawn fire for injecting politics into a graduation ceremony, but Kurtz suggested the moment underscored what he sees as a pattern at CBS.\n\nPelley and CBS News have not publicly responded to the criticism.\n\nMeanwhile, mediation efforts in Trump’s lawsuit against the network began earlier this month.","summary":"“I just think it’s wildly inappropriate to use a commencement address to say such things,” Kurtz said of Pelley during his recent \"MediaBuzz\" show.","url":"https://nypost.com/2025/06/02/media/fox-news-howard-kurtz-rips-cbss-scott-pelley-over-anti-trump-speech/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/105745956.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-02 13:36:55","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","source_country":"us","sentiment":0.024},{"id":327327188,"title":"35 Most Anticipated TV Shows of Summer 2025","text":"As a hectic 2025 news cycle shows no signs of slowing down, the lighter fare of summer TV season might be more welcome than usual.\n\nNow that the Emmys submission deadline has passed, TV networks and streamers have released the bulk of their attention-grabbing titles — making room for guilty pleasure, beloved summertime favorites and new titles to entertain us during those warm, breezy nights. Some returning titles like “And Just Like That” and “Nine Perfect Strangers” kicked off their runs in late May, but will release new episodes weekly for a good chunk of the season. Returning favorites like Peacock’s “Love Island USA,” HBO’s “The Gilded Age” and FX’s “It’s Always Sunny in Philadelphia” are back with new episodes. New series like Apple’s “Sick,” Netflix’s “The Waterfront” and Prime Video’s “Countdown” hope to captivate viewers. And the return of anticipated shows like “Ginny & Georgia” “Bachelor in Paradise” and “Project Runway” will surely have people talking.\n\nAnd summer doesn’t mean prestige TV slows down. “The Bear” and “Squid Game” are set to return for new seasons, while Lena Dunham makes her triumphant return to TV with “Too Much” starring Megan Stalter; and Noah Hawley prepares to make his mark on a beloved film franchise with the premiere of “Alien: Earth.”\n\nCheck out TheWrap’s staff picks for the 35 most anticipated shows premiering this summer.\n\n“Love Island USA” Season 7 (Peacock) — June 3\n\nGet ready for reality summer! After “Love Island USA” Season 6 made a splash last year by capturing the cultural zeitgeist in a way never done by the American version of the dating franchise, the stakes are high to see if Season 7 can keep the momentum going. “Vanderpump Rules” star Ariana Madix hosts for the second season in a row while “Love Island” franchise staple Iain Stirling returns with his hilarious narration to welcome a fresh crop of 10 singles who are ready to mingle. With Peacock dropping episodes every night at 6 p.m. ET/9 p.m. PT, the new season offers a chance to live through the villa’s most dramatic moments — leading up Casa Amor and the heart rate challenge — with fans across the country. And if you’re missing Season 6 fan-favorites Leah, Serena and JaNa, check out Peacock’s “Love Island: Beyond the Villa,” also coming this summer. — Loree Seitz\n\n“Stick” (Apple TV+) — June 4\n\nA sports dramedy that seems primed to fill a Jason Sudeikis-sized hole on Apple TV+’s streaming library until “Ted Lasso” Season 4 premieres, “Stick” has all the ingredients to become a crowd-pleasing hit among TV viewers. Created by playwright and “Ford v. Ferrari” co-writer Jason Keller, “Stick” follows a washed-up professional golfer (Owen Wilson) who gets a shot at personal and professional redemption when he takes a talented young golfer (newcomer Peter Dager) under his wing. Joining them on their journey are Mitts (Marc Maron), the grouchy former caddy of Wilson’s Pryce, and Elena (Mariana Treviño), the protective mother of Dager’s Santi. Its talented cast and shaggy, familiar underdog sports story should give “Stick” all it needs to make you laugh, cry and — hopefully — raise your hands and cheer (or, in this particular case, quietly clap). — Alex Welch\n\n“Ginny & Georgia” Season 3 (Netflix) — June 5\n\nIt’s been a long time coming for “Ginny & Georgia” Season 3, but this chaotic new chapter is well worth the wait. Season 3 picks up after the dramatic Season 2 finale, which saw Georgia (Brianne Howey) get arrested for the murder of Tom Fuller just moments after getting married to Paul (Scott Porter). After the gravity of Georgia being on trial for murder sets in, Georgia, Ginny (Antonia Gentry), Austin, Paul and Zion will have to adjust to the possibility of her being behind bars. For Ginny, that means trying not to be affected by chatter from kids at her school, which is complicated by shifting dynamics within her friend group and uncertainty with her relationship with Marcus (Felix Mallard). — LS\n\n“Phineas and Ferb” (Disney) — June 5\n\nIt’s been 10 years since we last got to spend a summer day with Phineas Flynn and Ferb Fletcher, but now the time has finally come that we can again. After an exceedingly long hiatus, Disney’s animated series “Phineas and Ferb” returns with new episodes on June 5. It’s not a reboot or even a sequel series, just a continuation of the characters and stories millennials came to know and love. The show is once again helmed by Dan Povenmire and Jeff “Swampy” Marsh, and features almost entirely the same voice cast as the first four seasons (David Errigo Jr. takes over as Ferb this time though). As always, the show will feature undoubtedly catchy original songs, insane guest stars and delightful adventures. Plus a crime fighting platypus. How can you resist a crime fighting platypus? — Andi Ortiz\n\n“Call Her Alex” (Hulu) — June 10\n\nIf you’ve already binged every episode of “Call Her Daddy,” Hulu’s new unscripted show, “Call Her Alex” might be your next watch. The two-part series will dive into the background of “Call Her Daddy” creator, host and EP Alex Cooper and her journey to sign one of the biggest podcast deals in history with interviews featuring trailblazers like Jane Fonda and Kamala Harris. Revealing moments from her personal life and professional journey, “Call Her Alex” will follow Cooper as she prepares to embark on her first tour ever. The documentary series will make its world premiere at Tribeca in June. — LS\n\n“The Buccaneers” Season 2 (Apple TV+) — June 18\n\nThe young American girls, who took over the 1870s London socialite scene in Season 1, are back for more at Apple. This time though, the Buccaneers have earned their stripes — and titles — across the pond. Nan (Kristine Froseth) is a duchess, Conchita (Alisha Boe) is a lady and Jinny (Imogen Waterhouse) is London’s most-wanted. This “Gossip Girl” meets “Bridgerton” period piece confronts feminism in the Gilded Age, as the girls wrestle with romance, jealousy, motherhood and more. Froseth, Boe and Waterhouse are all set to return to the series alongside Guy Remmers, Matthew Broome and Josh Dylan. Leighton Meester will join the cast as guest star this season. — Tess Patton\n\n“We Were Liars” (Prime Video) — June 18\n\nAnother YA series will bring a group of troublemaking teens to an exclusive, old-money East Coast beach town for “We Were Liars,” based on E. Lockhart’s best-selling book. Set on a private island owned by the Sinclair family, the new Prime Video series follows the picture perfect family as Cadence (Emily Alyn Lind) reckons with a terrifying experience that almost left her for dead. Shubham Maheshwari, Esther McGregor and Joseph Zada play the other friends — known as the liars — while Mamie Gummer, Caitlin FitzGerald and Candice King play the three Sinclair daughters. King reunites with “The Vampire Diaries” creator Julie Plec for “We Were Liars,” which was co-created by Plec and Carina Adly Mackenzie. – LS\n\n“Outrageous” (BritBox) — June 18\n\nThis British series follows the six Milford sisters, aristocratic daughters of the second Baron Redesdale (played by James Purefoy) who achieved fame and notoriety in the 1930s. Eldest daughter Nancy (“Bridgerton” star Bessie Carter) went on to write the novels “The Pursuit of Love” and “Love in a Cold Climate.” The rest of the cast includes Isobel Jesper Jones, Joanna Vanderham, Shannon Watson, Zoe Brough and Orla Hill. One British journalist colorfully described them as “Diana the Fascist, Jessica the Communist, Unity the Hitler-lover; Nancy the Novelist; Deborah the Duchess and Pamela the unobtrusive poultry connoisseur.” — Sharon Knolle\n\n“The Waterfront” (Netflix) — June 19\n\nFamily drama and crime always make for a delicious combination, and Netflix’s latest foray into the genre begs to be binged. From “Scream” and “The Vampire Diaries” creator Kevin Williamson, “The Waterfront” follows a prominent North Carolina fishing family, who begin to make connections with the wrong side of business ventures in an effort to keep their empire afloat. The ensemble cast is a collection of TV favorites, including Holt McCallany (“Mindhunter”), Maria Bello (“NCIS”), Melissa Benoist (“Super Girl”), Jake Weary (“Animal Kingdom”), Rafael L. Silva (“9-1-1: Lone Star”) and Danielle Campbell (“The Originals.”) — Jose Alejandro Bastidas\n\n“The Gilded Age” Season 3 (HBO) — June 22\n\nSpringtime is coming to “The Gilded Age,” just in time to become HBO’s next summertime obsession. After winning the Opera wars of Season 2, the Russel family is poised to get even more powerful as Betha (Carrie Coon) sets her sights on a British duke to marry her daughter Gladys (Taissa Farmiga). But when the Russell children’s search for real love comes in the middle of those plans, a civil war among the family members threatens to upend the social order even more. Season 2 also ended with big shifts across the street, as Agnes (Christine Baranski) struggled to accept that her sister Ada (Cynthia Nixon) is now the lady of the house. Get ready for more upstairs-downstairs, and old money-new money shenanigans when the ensemble drama returns for Season 3 this summer. — JAB\n\n“Ironheart” (Disney+) — June 24\n\nIt’s been a pretty long road for “Ironheart,” first getting announced back in 2022. But on June 24 it arrives, and brings the MCU to Chicago. The series revisits Dominique Thorne’s Riri Williams, who we first met in “Black Panther: Wakanda Forever.” After the events of the film, she’s back home in Chicago and working on the next version of her suit. But in doing so, she draws the attention of a mysterious man known as “The Hood.” It’s unclear if and how this will affect the MCU at large, but we’re excited to return to the character nonetheless. — AO\n\n“The Bear” Season 4 (FX, Hulu) — June 25\n\nSay “Yes, chef” to a Chicago summer. “The Bear” is coming back, and the stakes have never been higher. Last season, Carmy (Jeremy Allen White) fully committed to Sydney’s (Ayo Edebiri) dream of scoring a Michelin star for their restaurant. It was a big swing that came with some big costs, so big that if the remodeled restaurant failed to get a good review, Cicero (Oliver Platt) threatened to pull his funding from the family business. Season 3 ended with Carmy getting several calls from Cicero and others about the review without knowing his fate. And on June 25, we’ll finally know if The Bear is a critical hit, like the FX show that bears its name, or a major flop. Either way, the most stressful show on television is here for another round. — Kayla Cobb\n\n“Countdown” (Prime Video) — June 25\n\nFrom “Chicago Fire” creator Derek Haas, “Countdown” is a crime drama that has real potential to be a binge-worthy streaming hit this summer. Starring “Supernatural” and “The Boys” star Jensen Ackles, the forthcoming Prime Video series follows an LAPD detective who is assigned to a covert task force comprised of undercover agents from various law enforcement agencies, all of whom have been tasked with tracking down the murderer of a Department of Homeland Security officer who was killed in plain sight. The team’s investigation, however, leads them into the center of a conspiracy and forces them into a race to protect an entire city and its population. Haas’ extensive procedural TV experience means “Countdown” has a good shot at actually following through on the promise of its attention-grabbing premise, and that is an exciting possibility in and of itself. — AW\n\n“Smoke” (Apple TV+) — June 27\n\nThe “Black Bird” team of Taron Egerton and Dennis Lehane is back with another thrilling drawn-from-real-life series. In “Smoke,” Egerton stars as an arson investigator in Seattle who’s dealing with not one but two serial arsonists. He likes to work alone, so when he’s paired up with Jurnee Smollette’s detective, a crime scene expert who’s never worked arson before, sparks fly (pun intended). The series costars Greg Kinnear, John Leguizamo and Rafe Spall. The show, which premieres with its first two episodes on June 27, is inspired by the Firebug podcast. — SK\n\n“Squid Game” Season 3 (Netflix) — June 27\n\nAfter three seasons, four years and hundreds of on-screen deaths, Netflix’s record-breaking hit is coming to an end. Season 2 of “Squid Game” followed Gi-hun (Lee Jung-jae) as he returned to the games that traumatized him. Only this time around, he didn’t want to win; he wanted vengeance and to bring the entire organization down. By the end of the season, Gi-hun came close to destroying the games before a betrayal cost him one of the most important people in his life. Filmed at the same time as Season 2, this final installment will pick up right where last season ended, with Gi-hun no longer a rebellious leader but once again a horrified prisoner in this self-imposed hell. Will he finally confront the Front Man (Lee Byung-hun) and stop this torture of the indebted once and for all? Or is the Squid Game destined to repeat itself? — KC\n\n“The Sandman” Season 2 (Netflix) — July 3\n\nThe first season of Netflix’s stylized adaptation of Neil Gaiman’s “The Sandman” comic book was a strong debut that had a lot of promise for the future. Unfortunately, behind-the-scenes drama likely factored into the upcoming second season also being the final — but while we have it we should enjoy it. Season 2 continues the lore-dense story of Dream (Tom Sturridge) who continues to be busy writing the wrongs his years of absence caused across a number of worlds and realities. — Jacob Bryant\n\n“Bachelor in Paradise” Season 10 (ABC) — July 7\n\nIt wouldn’t be a reality summer without “Bachelor in Paradise,” which returns after skipping a year. “Bachelor in Paradise” will look a little different this year as the ABC reality dating show moves from Mexico to Costa Rica and welcomes a mix of alum from “The Bachelor” and “The Bachelorette,” as well as the “Golden Bachelor” and “Golden Bachelorette.” As for what that means in terms of how the younger and older casts will interact, we don’t know yet but we’re excited to find out. In addition to “Bachelor” host Jesse Palmer and “BIP” bartender Wells Adams, “Bachelor in Paradise” will welcome former “Bachelorette” Hannah Brown to the beach as she runs the new champagne room, and we’re sure there will be other surprises in store. — LS\n\n“It’s Always Sunny in Philadelphia” Season 17 (FX) — July 9\n\nIt’s been two years since the last season of “Always Sunny,” and true to form the gang is coming back hot. This season will start with the second half of the raunchy FXX comedy’s crossover with “Abbott Elementary,” which promises to show the more adult side of these ABC teachers. It’s impossible to predict what other chaos the gang will bring. But as Charlie (Charlie Day), Mac (Rob McElhenney), Dennis (Glenn Howerton), Dee (Kaitlin Olson) and Frank (Danny DeVito) know all too well, you don’t become the longest running scripted comedy of all time without throwing out some wild cards. — KC\n\n“South Park” Season 27 (Comedy Central) — July 9\n\nAfter the longest hiatus in the history of the 28-year-old series, “South Park” is coming back this summer with its highly anticipated Season 27. After portraying Donald Trump through two election cycles, series creators Matt Stone and Trey Parker noted that they purposefully skipped the 2024 election season. It’s impossible to predict what new jokes Stone and Parker will have about Trump, Diddy, Disney and Ozempic; famously, they don’t even know. But if history has proven anything, whatever they come up with is going to be insulting, cringeworthy and at times upsettingly insightful. — KC\n\n“Dexter: Resurrection” (Paramount+ With Showtime) — July 11\n\nShowtime just can’t seem to quit the “Dexter” franchise. “Dexter: Resurrection” will prove whether viewers are also interested in spending more time with Michael C. Hall’s murderous, perpetually conflicted Dexter Morgan, though. Created by original “Dexter” showrunner Clyde Phillips, who also oversaw 2021’s “Dexter: New Blood,” the new series takes place just a few weeks after the events of “New Blood.” It follows Hall’s Dexter, who has miraculously rebounded from the seemingly fatal gunshot wound he sustained at the end of “New Blood,” as he sets out in pursuit of his son, Harrison (Jack Alcott). His search brings Dexter to New York City, where he finds himself hunted by Miami police captain Angel Batista (David Zayas). The new series’ ensemble cast includes capable stars like Peter Dinklage, Uma Thurman and Krysten Ritter, but only time will tell whether or not “Resurrection” is able to get back to what made viewers fall in love with “Dexter” in the first place. If it does, then it will have more than earned its place as one of this summer’s biggest shows. — AW\n\n“Foundation” Season 3 (Apple TV+) — July 11\n\nTime jumps, clones and lots of shirtless Lee Pace — “Foundation” has it all. Apple’s ambitious Isaac Asimov adaptation returns somewhat changed for its third season with showrunner David S. Goyer no longer involved in the series after production hit a snag over budget cuts. But the scope of “Foundation” is its secret weapon as the show is telling a story over tens of thousands of years, and Season 2 offered a number of juicy revelations as it pertains to the backstory and mythology of the Empire that rules the galaxy. Can Season 3 keep that momentum up? — Adam Chitwood\n\n“Too Much” (Netflix) — July 10\n\nLena Dunham returns to TV with “Too Much,” a romcom series starring comedian Megan Stalter (“Hacks”) as Jessica, a New Yorker, who, in the aftermath of a devastating breakup, moves herself to London, where she meets Felix (Will Sharpe). Jessica and Felix try to ignore their chemistry, but that proves impossible, leading to some humorous issues for the pair. Additional cast includes Adèle Exarchopoulos, Adwoa Aboah, Andrew Rannells, Daisy Bevan, Dean-Charles Chapman, Emily Ratajkowski, Janicza Bravo, Kaori Momoi, Leo Reich, Michael Zegen, Prasanna Puwanarajah, Rhea Perlman, Richard E. Grant, Rita Wilson and Stephen Fry. — LS\n\n“The Summer I Turned Pretty” Season 3 (Prime Video) — July 16\n\nBelly, Conrad and Jeremiah’s love triangle will come to a close with the third and final season of “The Summer I Turned Pretty,” based on Jenny Han’s third book in the trilogy, “We’ll Always Have Summer.” The new season will see a significant time jump from Season 2, with Lola Tung’s Belly finishing her junior year and heading to Cousins to spend another summer with Jeremiah (Gavin Casalegno). Several years into dating Jeremiah, Belly sees a future with the younger Fisher brother — that is until some “core-shaking events” bring her to another crossroads and force her to confront her feelings for Conrad (Christopher Briney). While diehard fans have been confident about how the Prime Video YA series will conclude, Han has made it clear there will be a handful of changes from the book — potentially including which Fisher brother is endgame. – LS\n\n“Untamed” (Netflix) — July 17\n\nEric Bana hunts a killer in Yosemite in Netflix’s new limited thriller series, “Untamed.” The series comes from “American Primeval” creator and “The Revenant” screenwriter Mark L. Smith and “The Marsh King’s Daughter” co-writer Elle Smith, “Untamed” stars Bana (who’s also an executive producer) as a National Parks Service special agent investigating a brutal death in the dangerous terrain of the park’s expanses — but that’s not all, naturally, the park killing has some ties to his dark and mysterious past. The latest in Netflix’s run of high-profile limited series, “Untamed” promises a gritty, tense mystery set in the wonders and terrors of a vast wilderness. — Haleigh Foutch\n\n“Acapulco” Season 4 (Apple TV+) — July 23\n\nApple TV+’s excellent bilingual comedy returns for one last adventure at Las Colinas resort. Told over two timelines, the series focuses on Eugenio Derbez’s Maximo as he remembers working his way up in the resort to become a successful business mogul, with Enrique Arrizon starring as a young Maximo back in the 80s. Season 3 ended with big shakeups in both timelines, as young Maximo inadvertently betrayed his mentor and became the resorts’ new manager, while present-day Maximo returned to Acapulco and decided to buy the resort and take it back to its former glory — and asked his former flame Julia to help him in the endeavor. We’ll see how this summertime delight wraps up its run with Season 4. — JAB\n\n“Washington Black” (Hulu) — July 23\n\nFrom the words of Esi Edugyan’s novel “Washington Black” comes Hulu’s TV adaptation of the fictional 19th century odyssey. The series, which stars and is executive produced by Sterling K. Brown, follows the life of an 11-year-old boy named George Washington “Wash” Black, who was born on a Barbados sugar plantation but whose science-centered mind prompts him to travel beyond the comfort and familiarity of his home. After he’s suddenly forced to leave his home, Wash sets forth on a global journey that helps shape his perspective on life, love, family and his idea of freedom. — Raquel Harris\n\n“Project Runway” (Hulu/Freeform) — July 31\n\nAnother reality show making its grand return this summer is “Project Runway,” which finds its new home on Disney platforms after moving from Bravo. The new season will serve as a homecoming for Heidi Klum, who hosted the fashion competition show for its first 16 seasons before leaving to host “Making the Cut” alongside longtime “Project Runway” mentor Tim Gunn. O.G. judge Nina Garcia returns alongside stylist Law Roach, while “Project Runway” Season 4 winner Christian Siriano serves as a mentor for the contestants. With the show undergoing a creative overhaul from its past Bravo seasons, it’s unclear what’s in store, but here’s hoping for an unconventional challenge. — LS\n\nLeanne (Netflix) — July 31\n\nAfter the success of her Netflix stand-up special “I’m Every Woman,” Leanne Morgan has been tapped to co-create a multi-cam comedy series loosely based on her own life. Co-created by Morgan and “The Big Band Theory”’s Chuck Lorre, the series meets Leanne as her husband of 33 years leaves her for another woman. Though she did not expect to start over at this stage in her life – as a grandmother in menopause – she leans on her family for support and laughs. Kristen Johnston (“The Righteous Gemstones”) stars alongside Morgan as her sister Carol, with Graham Rogers, Hannah Pilkes, Ryan Stiles, Celia Weston and Blake Clark. — TP\n\n“Chief of War” (Apple TV+) — Aug. 1\n\nOf all of the shows premiering this summer, few look as big or ambitious as “Chief of War.” Co-created by Thomas Paʻa Sibbett and Jason Momoa, the forthcoming historical miniseries follows Kaʻiana (Momoa), a legendary Hawaiian warrior and noble. Set in the 18th century when the Hawaiian Islands’ four major kingdoms were at war, the series details the bloody campaign — and the role Momoa’s Kaʻiana played in it — that led to the unification and colonization of Hawai‘i. Told from an indigenous perspective, “Chief of War” is a passion project for both Momoa and Sibbett, and its scope, budget and ambition call to mind past, successful historical dramas like “Shogun” and “Vikings.” It has the potential, in other words, to be the kind of thrilling, awe-inspiring historical epic that — even in today’s streaming era — TV viewers still rarely get to see brought to life on the small screen. — AW\n\n“Wednesday” Season 2 (Netflix) — Aug. 6\n\nSurprise folks, Netflix’s spooky sensation “Wednesday” isn’t getting a Halloween debut but a big splashy summer release, split across two installments. Jenna Ortega returns as the iconic Addams Family character, alongside plenty of familiar faces, including Louis Guzman and Catharine Zeta-Jones as Gomez and Morticia Addams, and Emma Myers as Wednesday’s bubbly werewolf bestie, Enid. The new season also promises to further explore and expand the Addams Family, bringing Pugsley (Isaac Ordonez) to campus at Nevermore and introducing “Absolutely Fabulous” star Joanna Lumley as Morticia’s mother, Hester Frump. With Tim Burton back as executive producer and director of the Season 2 premiere, the series promises a creepy, kooky watch to keep things all together ooky during every goth’s least favorite season of the year. — HF\n\n“Platonic” Season 2 (Apple TV+) — Aug. 6\n\nIf you’re already missing seeing Seth Rogen as struggling studio head Matt Remick in “The Studio,” there’s more of him in store on Apple TV+ with the return of “Platonic.” After Season 1 saw Rogen’s Will and Rose Byrne’s Sylvia resume their chaotic friendship, the duo will be back but in a different form for Season 2. Upon moving to San Diego and getting engaged to his coworker in the Season 1 finale, the second installment might see a wedding — planned by Sylvia — in the friends’ future, or perhaps a different situation entirely. Luke Macfarlane returns as Sylvia’s husband, Charlie and Carla Gallo reprises her role as Sylvia’s friend, Katie, with the new installment also introducing Aidy Bryant, Kyle Mooney and Beck Bennett as guest stars. — LS\n\n“Outlander: Blood of my Blood” (Starz) — Aug. 8\n\nWhile “Outlander” fans might be gearing up to say goodbye to Jamie and Claire ahead of the eighth and final season, the blow will be cushioned by spinoff series “Outlander: Blood of my Blood,” which explores Jamie and Claire’s origin story. The new series will center on the love story between both Jamie and Claire’s parents, which will take viewers to 18th century Scotland and England during WWI. Jumping between the time frames and locations, the new series will introduce a new group of characters and love stories that promise to be as compelling as the flagship series. — LS\n\n“Alien: Earth” (FX) — Aug. 12\n\nIn 1979, Ridley Scott released a film so terrifying, it led to reports of viewers throwing up and even fainting. 46 years later, Noah Hawley will attempt to capture some of that terror as he constructs his own rendition of this intergalactic man vs. nature story. Set two years before Scott’s sci-fi defining masterpiece, “Alien: Earth” starts after a space vessel crash-lands on Earth. Amidst the carnage, a young woman alongside a ragtag group of tactical soldiers will make a discovery that will put them up close to humanity’s greatest threat. Hawley’s take on the iconic franchise stars Sydney Chandler, Timothy Olyphant, Alex Lawther, Samuel Blenkin and Essie Davis, just to mention a few members of its expansive cast. Just like Hawley’s take on “Fargo” before it, “Alien: Earth” promises to be ambitious, thought-provoking and respectful to the original. But the one word you can never use to describe the creator’s work is dull. — KC\n\n“Peacemaker” (HBO Max) — Aug. 21\n\nJames Gunn’s blossoming of his version of DC Comics’ film universe continues with “Peacemaker” Season 2. The show’s sophomore outing comes in a post-”Superman” world, which will likely impact some of the storytelling beats but hopefully the crass humor and surprising heart of the first season remains intact. John Cena is back as the titular Peacemaker as he and his ragtag team pick up the pieces from Season 1 and toe the line between doing what is right and doing what is necessary. — JB\n\n“Long Story Short” (Netflix) — Aug. 22\n\n“BoJack Horseman” creator Raphael Bob-Waksberg is making his comeback to Netflix screens with his new adult animation comedy “Long Story Short.” Straying away from the Hollywood tale of a lowly former sitcom star who’s determined to reinvent himself in Hollywood, “Long Story Short” is centered on a family, most specifically the Schwooper siblings. As the show pans back and forth between their childhood and adulthood, viewers delve deeper into their most monumental moments in life as well as the toughest hurdles they’ve overcome. — RH","summary":"From “The Summer I Turned Pretty” Season 3 on Prime Video and Disney+’s “Ironheart” to “Wednesday” Season 2 on Netflix and FX’s “Alien: Earth”\n\n\nThe post 35 Most Anticipated TV Shows of Summer 2025 appeared first on TheWrap.","url":"https://www.thewrap.com/new-tv-shows-summer-2025/","image":"https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/05/TSITP-Wednesday-Alien.jpg?fit=1200%2C675&quality=89&ssl=1","video":null,"publish_date":"2025-06-02 13:30:00","author":"Jose Alejandro Bastidas","authors":["Jose Alejandro Bastidas"],"language":"en","source_country":"US","sentiment":0.406},{"id":327327246,"title":"Threats to the President-Elect, Whoever He or She Might Be","text":"Defendant argues that on November 5, 2024, there was no identifiable \"newly elected POTUS\" because it was Election Day and dozens of candidates were on the ballot…. [But] if it is not clear whether a statement is protected expression or a true threat, it generally should be submitted to the jury. On election day, only two candidates—Vice President Kamala Harris and former President Donald Trump—realistically could have become the \"newly elected POTUS.\" Count 1 specifically identifies Vice President Harris as the alleged victim. Defendant can argue to the jury that his failure to identify her specifically makes his alleged statement too indefinite to constitute a true threat, but the Court cannot conclude as a matter of law that the existence of two possible targets of a death threat means that neither has been truly threatened….\n\nDefendant argues that § 879 applies only to threats against a former President and the threat alleged in Count 2 was not against a former President, but against the \"newly elected POTUS.\" As just noted, however, one of the two primary candidates for the presidency was Donald Trump, who was a former President. Thus, one of the two possible targets of the Count 2 threat was protected by § 879. And as already explained, the Court cannot conclude as a matter of law that the existence of two possible targets of a death threat means that neither has been truly threatened. If the jury finds both were threatened by Defendant's statement at issue in Count 2, then a former President was threatened and § 879 applies.\n\nDefendant claims that the statement charged in Count 3 is not a true threat because the words \"will be entitled\" suggest any threat was conditional. \"While the conditional nature of a statement may be a factor in determining whether it constitutes a true threat, conditional language is not dispositive.\" \"Indeed, most threats are conditional; they are designed to accomplish something; the threatener hopes that they will accomplish it, so that he won't have to carry out the threats.\"\n\nDefendant contends that his use of the Court filing process, the number 666, and the words \"fraudulent elected\" separates the charged statement from a \"sincere intention to cause harm[.]\"But the First Amendment does not \"require proof that the defendant intends to carry out the threat—that is, actually to inflict the harm that he has threatened. One of the chief evils wrought by a threat is its deleterious and coercive effect on the victim[,]…and that effect is not diminished merely because the defendant is bluffing.\"\n\n{Defendant argues in his reply that the statements alleged in the indictment use the past tense—\"chose\" and \"shot\"—showing that they were not true threats. Doc. 31 at 2-3. Because this argument was raised for the first time in a reply brief, the Court will not consider it.}","summary":"Judge David Campbell's opinion Thursday in U.S. v. Ortiz (D. Ariz.) deals with a somewhat unusual sort of threat. On&#8230;\nThe post Threats to the President-Elect, Whoever He or She Might Be appeared first on Reason.com.","url":"https://reason.com/volokh/2025/06/02/threats-to-the-president-elect-whoever-he-or-she-might-be/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2021/11/the-volokh-conspiracy.jpg","video":null,"publish_date":"2025-06-02 13:24:08","author":"Eugene Volokh,Liz Wolfe","authors":["Eugene Volokh","Liz Wolfe"],"language":"en","category":"politics","source_country":"us","sentiment":-0.378},{"id":327464380,"title":"US marine veteran takes a stand against Trump: ‘He’s tearing the country apart’","text":"Earlier this year, Morgan Akin took down the American flag that had flown for decades outside his home in deep-red far northern California. It was a small gesture, one that did not echo through the halls of the US Capitol or make headlines.\n\nBut for the 84-year-old Vietnam-era veteran and retired game warden, it represented a monumental shift, one his family immediately took note of. It was Akin’s way of taking a stand in response to a country that had become increasingly unrecognizable to him. In the weeks before, masked officers arrested an international student who had co-authored a campus newspaper op-ed about Gaza in the street, the defense department temporarily removed Jackie Robinson’s biography from its website, and the president planned to host a massive military parade to celebrate his birthday.\n\n“The American flag won’t fly again until things get straightened out down the line and administrations change,” said Akin, his Texas twang still strong even after decades in California as he lamented the state of the country and the growing dangers immigrants faced. “They’re not going to pick me off and take me to El Salvador.”\n\nUntil this year, Akin had never participated in a protest. This year he and his wife have gone to three, taking to the streets alongside hundreds of others in their conservative community to demonstrate against the administration and cuts to the department of veteran’s affairs and vital social programs.\n\nOlder Americans such as Akin are among the most disapproving of Donald Trump’s performance as president. An NPR/PBS News/Marist poll from April found that just 37% of the “greatest/silent” generation, people born before 1947, approve of the job he’s done as president. But Akin is a rarity given that a majority of US veterans typically vote Republican – about six in 10 said they supported Trump in 2024.\n\nAkin has always backed Democrats, something he attributes to growing up in segregated Texas and seeing southern states turn Republican during the civil rights era. He loved his home state but found it deeply prejudiced and never could shake his association with the Republican party and racism.\n\nHe joined the Marine Corps at 17, where he said he learned that you had to get along to survive, regardless of one’s background or religion. “You all bled the same way,” he said. “From that point my whole attitude changed about a lot of things. So I have been a Democrat [since] the first time I registered.”\n\nAkin spent nine years in the military, training recruits as a drill instructor and eventually left as a staff sergeant to attend college. After graduating Akin got a job as a game warden with the California department of fish and wildlife. He worked across the state, overseeing operations in the city and county of San Francisco, the Central Valley, and eventually the job brought Akin and his family to Shasta county, now a region of 180,000 people in the state’s far north conservative heartland.\n\nThey liked Shasta county enough that they decided they wanted to retire there. His wife adored the many trees while Akin, who grew up hunting and fishing, found plenty to do in the area. They’ve developed deep ties to Shasta over three decades and regularly volunteer as poll workers while Akin spent years working with a group of retired veterans.\n\nThe couple, both staunch Democrats, have always been outnumbered by conservatives. Of the area’s nearly 116,000 registered voters, 52% are registered Republican and just 21% are Democrats. That didn’t bother Akin, he said, and for the most part never caused problems – although someone once threw a rock through the back window of his truck where he had placed an Obama sticker. Akin has made a point not to argue about politics with friends or people at his church, he said, but he also doesn’t hide his views.\n\nIn 2020 he put a Joe Biden sign in his front yard. Last year he placed a Kamala Harris sign there. People were usually courteous about that, Akin said, until 2024 when someone demanded he remove Harris’s sign. He declined.\n\nStill, it’s become difficult as Shasta county has grown more conservative, with a thriving far-right movement that has put the area on the map as a center of election denialism. The appointment of a Florida-based election skeptic to run the county elections office has made him consider whether he wants to continue to volunteer as a poll worker. The political upheaval locally has been concerning, but he has no plans to leave.\n\n“If somebody says, ‘Why don’t you move out of Shasta and go somewhere else’. I said, ‘When I move, I’m going to Igo, that’s it. Nowhere else,’” Akin said with a laugh, referring to the veterans’ cemetery in the nearby town of Igo.\n\nBut there is a caustic feeling in the community, one exacerbated by the chaos of national politics. Akin has found himself watching TV constantly trying to keep up with it all. The attacks on the judiciary and attacks on immigrants have been particularly upsetting to him, Akin said, pointing to the arrest of Rümeysa Öztürk, who was detained on the street for her political speech by masked immigration agents. “They don’t want to be shown, which indicates to me, they know they’re doing the wrong thing, but they’re doing it anyway.”\n\nAnd many elements of his own life are at risk with the Trump administration’s plans. As a veteran with a disability, he receives care from the local VA facilities, which he said offer some of the best VA services he’s experienced. The mass layoffs planned within the system, canceled contracts and hiring freezes have imperiled patient care, according to internal documents obtained by the Guardian.\n\nMeanwhile, Akin’s daughter works as a teacher for Head Start, a federal program that provides early childhood education for low-income families which the administration proposed cutting, though it has since reversed course.\n\n“What happens to me is immaterial because I’m 84 years old. My lifespan is decreasing daily, so it’s probably not going to have a big impact on me overall. But I have two children. I have three grandchildren. I’ve got now four great grandchildren,” he said. “How is that impacting their future?”\n\n“He’s just tearing the country apart. The whole fabric of the country is just being ripped apart. The worst part is the people that are getting hurt – the migrants that came here in earnest.”\n\nHe worries for disabled veterans in the future and the care they will receive. And he fears a day where the US government might use the military against citizens. Now Akin is focused on advocating how he can. He and his wife plan to keep protesting.\n\nOutside his home a US marines flag still flies, but now it waves alongside a Ukrainian flag. The American flag remains put away. “I still get upset if I see someone flying it upside down. And my wife gets really upset when she sees an American flag with Trump’s face on it,” he said. “Because we’ve always been respectful of the flag. It’s just much more toxic now.”","summary":"Morgan Akin, 84, has taken down his American flag – and taken to the streets in his conservative California community\n\nEarlier this year, Morgan Akin took down the American flag that had flown for decades outside his home in deep-red far northern California. It was a small gesture, one that did not echo through the halls of the US Capitol or make headlines.\n\nBut for the 84-year-old Vietnam-era veteran and retired game warden, it represented a monumental shift, one his family immediately took note of. It was Akin’s way of taking a stand in response to a country that had become increasingly unrecognizable to him. In the weeks before, masked officers arrested an international student who had co-authored a campus newspaper op-ed about Gaza in the street, the defense department temporarily removed Jackie Robinson’s biography from its website, and the president planned to host a massive military parade to celebrate his birthday.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/jun/02/us-marine-veteran-trump-california","image":"https://i.guim.co.uk/img/media/9e2389950e2fedca16f35496347270334136bcf1/458_0_3560_2848/master/3560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-06-02 13:00:03","author":"Dani Anguiano","authors":["Dani Anguiano"],"language":"en","source_country":"us","sentiment":-0.052},{"id":327364676,"title":"Op-Ed: Democrats Need To Run Towards, Not Away From, The Discomfort Of Questions About Health","text":"Source: The Washington Post / Getty During a recent appearance on Piers Morgan Uncensored, CNN’s Jake Tapper, the co-author of Original Sin, which argues “The original sin of Election 2024 was Biden’s decision to run for reelection — followed by aggressive efforts to hide his cognitive diminishment,” managed to further piss off some already enraged Democrats by claiming the decision for Joe Biden to seek a second term is a scandal possibly worse than Watergate. “It is a scandal,” Tapper said. “It is without question — and maybe even worse than Watergate in some ways, because Richard Nixon was in control of his faculties when he wasn’t drinking.” I understand the impulse to immediately boo and hiss away anything coming from Jake Tapper. Much as journalists like him try to portray otherwise, objectivity is a myth, and Tapper’s politics, while attempting to be obscured in his reporting, are nonetheless ever-present. It has been made clear to me through his previous description of Assata Shakur, his past smearing of Congresswoman Rashida Tlaib, and his present whinings about “the left” on the Original Sin press tour that curiously makes steps on shows hosted by the likes of the racist Megyn Kelly. So yes, I understand the impulse to ignore Jake Tapper, especially on this subject – when mainstream anchors like him should have focused more on the issue at the time when poll after poll after poll year after year showed that voters – including a majority of Democrats – felt that Joe Biden was too damn old to be president for a second term. Yet, while Tapper may be making a lot of money off this political tragedy after the fact, this is not a subject that ought to be avoided simply out of annoyance towards him. A few weeks before Tapper made his “worse than Watergate” claim, he interviewed Congressman James Clyburn of South Carolina, the man credited with salvaging Biden’s fledgling primary campaign in 2020 with his endorsement. Tapper asked Clyburn, “Do you think Joe Biden really would’ve been able to perform as president all the way through January 2029 when he would be 86?” Clyburn replied: “Yes, I thought that back then. I still think that,” going on to argue that “it’s not all about age.” “I’ve seen people develop Alzheimer’s when they’re in their 30s and 40s. So it’s not about age,” the 84-year-old and working Clyburn continued. “It’s about the ability to do the job, and I never saw anything that allowed me to think that Joe Biden was not able to do the job.” Hours later, Biden shared that he had been diagnosed with an aggressive form of prostate cancer. In his first public remarks since his office made the announcement, he told reporters on Friday that he was feeling “optimistic” about his prognosis. “Well, the prognosis is good. You know, we’re working on everything. It’s moving along. So, I feel good,” Biden said. Having lost my mother, uncle, and some of my closest friends in recent years to cancer, my thoughts are with him and anyone else grappling with cancer. May they all beat it. May we all one day exist in a cancer-free world (funding medical research would help that, but alas, the dummies won). However, and with all due respect to Clyburn, his answer would have been ridiculous even without the diagnosis. It makes me want to cuss. I am not around Joe Biden like Clyburn, but my senses worked well enough to recognize through my varying screens that the presidency had aged an already elderly Biden dramatically, and long before last June’s disastrous debate, there were several signs that there were days where he could barely string together a coherent sentence on command. This is not to be callous, but be for real. Is this a scandal worse than Watergate? Who cares. It’s a problem, no matter how it is scaled. Source: Jamie McCarthy / Getty After putting aside my feelings about Jake Tapper and recalling that Original Sin’s co-author, Axios reporter Alex Thompson, had been trying to report on Biden’s health struggles but had his book canceled by the publisher because “Biden books weren’t selling,” I checked out the audiobook myself. Critics are right to note that Biden’s struggle with getting older wasn’t a well-kept secret as presented, but the extent to which his decline was known, as far back as 2019, and the degree to which his senior advisors scripted his presidency, even to those in the Cabinet, is not at all widely known by the public. Moreover, knowing how much Biden was struggling, I’m even madder that instead of building up Vice President Kamala Harris as his successor, Biden’s allies used her as a shield from criticism. They set her up to fail as VP and then warned other Democrats that Biden couldn’t be dropped from the ticket because they would be stuck with Kamala. I know some voters like to pretend Joe Biden is their great uncle or something, but Donald Trump being a racist, erratic man(iac) with his obvious struggles of decline amid aging, doesn’t excuse the Weekend at Bernie’s White House, and none of the Democrats saying anything about it. Dead racist president Ronald Reagan had his second term struggles covered up, as did the secrets of the other dead racist president, Woodrow Wilson. Biden’s not the first president to have his problems covered, but he should be the last. As for why the reporting in Original Sin matters, look at the state of the House of Representatives, where a bunch of Democratic congressmen are dying, and as a result of it, much of Trump’s agenda, including the worst tax bill in history, was able to pass. Democrats are not having a come-to-Jesus moment about their gerontocracy problem; instead, more House members in their 70s are running to fill the chairs of the recently departed. To be clear, there are plenty of aging politicians with a lot of fire in them, including Congresswoman Maxine Waters and Congressman Al Green. Even so, after Biden’s inability to forgo a second term in a healthier amount of time handed the presidency back to Trump, so many Democratic politicians and their supporters continue to be resistant to the ongoing consequences of not having difficult conversations about the health and ages of their leadership. I am no ageist and see the value of leaders at any age, but when they present as enfeebled and give way to defeat to bigoted buffoons, at one point do we all decide to stop running away from the discomfort of questions about health and toward them? Michael Arceneaux is a New York Times bestselling author whose most recent book, “I Finally Bought Some Jordans,” was published last March. SEE ALSO: The Segregationist Administration: How Trump’s Team Is Systematically Dismantling Civil Rights Never Forget What Happened To Michael Brown","summary":"Former President Joe Biden’s not the first president to have his health problems covered, but he should be the last.","url":"https://newsone.com/6200975/joe-biden-health-jake-tapper/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/06/17488663018449.jpg?quality=80&strip=all&w=1024&crop=0,0,100,683px","video":null,"publish_date":"2025-06-02 12:30:46","author":"Michael Arceneaux","authors":["Michael Arceneaux"],"language":"en","category":"politics","source_country":"US","sentiment":-0.35},{"id":327305790,"title":"Number of Registered Democrats in Florida Falls to Record Low","text":"The number of Registered Democrats in Florida has fallen to a record low, new voting data has revealed.According to the Florida Division of Elections, the number of Democrats registered in the state has fallen compared to 2017. In the same time, the number of Republicans registered in the state has increased.Why It MattersFlorida used to be a swing state but it has shifted toward Republicans in recent elections, President Donald Trump carrying it by 13 points against former Vice President Kamala Harris in the 2024 election. His margin in Florida was the largest for a presidential candidate in 36 years, with his 56 percent vote share being the sixth highest for the GOP in its history. Cementing a Republican shift will impact future election cycles.Sean Freeder, an assistant professor of political science at the University of North Florida, previously told Newsweek that changes in voting patterns can be attributed to long-term trends, such as older Americans who tend to vote Republican moving to Florida, as well as more recent shifts of Latinos and Cuban-Americans moving toward the Republican Party.What To KnowAccording to the Florida Division of Elections, there are 4,329,371 active, registered Democratic voters. This is down from 4,479,820 in 2024 and more than 900,000 below the 5,315,954 registered in 2020. This is the smallest number of Florida Democrats in the state since at least 2017. The data is accurate as of April 30, 2025.As for the GOP, there are 5,578,457 Republican voters, up from 5,218,739 in 2020 and 4,544,708 in 2017.According to Michael Pruser, the director of data science with Decision Desk HQ, the latest voter rolls in Miami-Dade county show 464,370 registered Republicans, or 34 percent of voters while there are 440,790 Democrats, or 32.27 percent. Miami-Dade has leaned Democratic but has been trending closer to the right in recent elections.In August 2024, three months before the November 2024 presidential vote, election officials found that Florida has 1 million more Republican registered voters than Democrats. There were 5.3 million active Republican voters compared to 4.3 million active Democratic voters.Overall, Republicans now lead in 59 out of 67 counties in voter registration.However, changes in \"list maintenance\" laws have resulted in hundreds of thousands of voters—disproportionately registered as Democrats—being moved to \"inactive\" status, which removes them from active registration tallies so the figures may not reflect the actual number of Democrats in the state.What People Are SayingKevin Wagner, political science professor at Florida Atlantic University, previously told Newsweek shifting national headwinds could \"make things a little more volatile\" for the midterms in Florida.\"Midterms do tend to favor the party that does not hold the presidency. But, at this stage, the state Democrats probably have to think about rebuilding over multiple electoral cycles. They need to recruit and develop a larger group of potential candidates and build a better ground game with a more effective message. That's not likely to be fixed in one election,\" he said.Evan Power, chairman of the Republican Party of Florida, in a statement about Miami-Dade's voter roll data said: \"This is a total repudiation of the Democrats' failed agenda. Miami-Dade is no longer their safe haven—it's the beating heart of the Republican revolution.\"\"We're the party of hardworking families, Hispanic patriots, and communities demanding safe streets, top-notch schools, and a booming economy. Miami-Dade proves the unstoppable momentum of the Republican message.\"Florida Governor Ron DeSantis said on X: \"A decade ago Miami-Dade county was a deep blue county with hundreds of thousands more registered Democrats than Republicans.\"Today, the county—with more than 2.8 million people—has a Republican voter registration advantage.\"Nobody would have predicted this ten years ago.\"What Happens NextThe number of Floridians who register as Republican or Democratic is likely to shift in the next months and years. The extent to which Florida favors either party will become clear when voters participate in the November 2026 midterm elections.","summary":"Data from the Florida Division of Elections shows strong signs of a shift in blue and red support.","url":"https://www.newsweek.com/registered-democrats-florida-numbers-2079651","image":"https://d.newsweek.com/en/full/2654934/donald-trump.jpg","video":null,"publish_date":"2025-06-02 12:23:38","author":"Kate Plummer","authors":["Kate Plummer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.33},{"id":327340974,"title":"Cardi B 'Hard Launches' New Boyfriend, NFL WR Stefon Diggs on Instagram With Wild Pics","text":"What a catch. New England Patriots wideout Stefon Diggs upped his game as the NFL's \"bad boy\" after going official with female rapper Cardi B. Cardi B, 32, ‘hard-launched’ her new boy-toy with a spicy Instagram post over the weekend, showing Diggs, 31, getting a lap dance from the stripper-turned-recording artist. READ: Mike Vrabel Doesn't Seem Thrilled About That Viral Video Of Stefon Diggs On A Yacht Several of the photos shared showed Cardi B in her natural, very racy state, wearing a black one-piece that left little to the imagination. \"Chapter 5 ......Hello Chapter six,\" Cardi said on Instagram, posting a May recap of her new fling with Diggs, who recently landed in some trouble after being spotted on a yacht full of women, offering some of them a ‘mysterious’ powder. Some of the chatter from the Diggs yacht video has led to speculation over whether the team could decide to cut Diggs over his behavior. The New England Patriots were asked about the viral video of Diggs sharing what one could only assume was drugs on the boat, which the team acknowledged and subtly discouraged after hoping Diggs could come in and be a veteran presence for young rookie QB Drake Maye, to the tune of a three-year, $69 million contract. Diggs did not attend the start of voluntary OTAs. READ: Rapper Who Malfunctioned At Kamala Harris Rally After The Teleprompter Broke Melts Down Over Internet Bullies New England certainly hopes Diggs is worth the trouble … last season, he totaled 496 receiving yards and 47 catches in an injury-shortened year. Despite her new fling, Cardi B is still dealing with the aftermath of her longtime relationship with Migos rapper Offset, with whom she shares three kids: Kulture, 6, Wave, 3, and Blossom, 8 months. That saga could continue to unfold as Offset reportedly sought to gain ‘everything’ from his divorce with Cardi B, ending a relationship that began in 2017. Diggs and Cardi B made a big debut before the public at the start of May by attending a New York Knicks game, flirting courtside and catching more eyes than Spike Lee's outfits. Could this be a fling or the real thing? Send us your thoughts: alejandro.avila@outkick.com / Follow along on X: @alejandroaveela","summary":"","url":"https://www.outkick.com/sports/cardi-b-hard-launches-new-boyfriend-nfl-wr-stefon-diggs-instagram-wild-pics","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/06/gettyimages-2214781415-594x594-1.jpg","video":null,"publish_date":"2025-06-02 12:03:24","author":"Alejandro Avila","authors":["Alejandro Avila"],"language":"en","source_country":"us","sentiment":0.166},{"id":327316116,"title":"Substack and podcasts lead the way to midterm elections and 2028","text":"Catherine Valentine, Substack’s head of news and politics, said that while conservatives initially dominated the platform, especially after feeling deplatformed from sites like X and Facebook, there’s now a clear shift. \n\n“Right now, there is a ton of momentum, undeniably, with the Democrats, and specifically with the Democrats who are eyeing 2028,” Valentine said in an interview with the Washington Examiner. \n\nFormer Transportation Secretary Pete Buttigieg, who boasts over 394,000 subscribers on the medium, is part of a growing wave of Democratic voices looking to bypass traditional media. Since President Donald Trump’s second term began, Democratic lawmakers like Sen. Chris Murphy (D-CT) and Rep. Jasmine Crockett (D-TX) have turned to Substack to share updates, analysis, and exclusive content. Sen. Ruben Gallego (D-AZ) and former Chicago Mayor Rahm Emanuel have joined the platform, while the Democratic National Committee launched its own newsletter in March, signaling a significant shift in how the party engages with the public.\n\nAs of early 2025, Substack has experienced significant growth, boasting over 35 million active subscriptions, with more than 5 million of these being paid subscriptions. The outlet has evolved from a simple newsletter platform into a multifaceted media hub, offering creators tools for email newsletters, podcast hosting and distribution, live audio shows, paid subscriptions, and community engagement, all designed to help build and monetize direct relationships with audiences.\n\nValentine said the platform’s appeal for politicians comes from its ability to give them lasting control over their audience and message, unlike social media, in which content is fleeting and access to followers is limited.\n\n“Simply the fact that Substack allows people to own your email lists — it’s a game changer,” Valentine explained. “That is the real difference. That is why these politicians are frankly unimpressed with other platforms. Because if you just killed it on TikTok, you still do not own those email addresses. You don’t own those relationships. Someone could watch you once on TikTok and never see you ever again.”\n\nCasey Burgat, the director of the Legislative Affairs Program at George Washington University’s Graduate School of Political Management, said Substack stands apart from traditional social media by avoiding algorithm-driven content, but it still operates within the attention economy.\n\n“I don’t know if it’s the names of these people that are bringing the audience, or if the audience is bringing the names, but to me, I think politicians are trying to be on the front end of going where people are,” explained Burgat, who has a Substack of his own. “The reality is that they’re going to have to do everything they’ve always been able to do everything they want, to reach people where they are.”\n\nHe said politicians are simply expanding their “all of the above” outreach strategy. He said Substack and podcasts aren’t replacing TV ads or direct mail but that they are just becoming another necessary part of the communications toolkit.\n\n“They are still going to pay for TV ads. They are still going to do direct email and literature. But now this is just the next platform,” he said. “I think it would probably say more if they weren’t on it than what it says that they are on it.”\n\nTouted as the first “podcast election,” the 2024 presidential cycle saw both Trump and former Vice President Kamala Harris tap into some of the largest podcast audiences. Trump appeared on three of Spotify’s top five most popular shows, including the Joe Rogan Experience, the Shawn Ryan Show, and This Past Weekend with Theo Von. His conversation with Rogan racked up over 46 million views on YouTube. Meanwhile, Harris did an interview with Alex Cooper, host of Call Her Daddy, which ranks fifth in Spotify’s podcast lineup.\n\nSince the 2024 election, prominent Democrats, including Gov. Gavin Newsom (D-CA), Gov. Gretchen Whitmer (D-MI), Gov. Andy Beshear (D-KY), and Buttigieg, have embraced podcasting as a way to engage voters through in-depth, long-form discussions. Newsom’s podcast, which features a diverse range of guests, has drawn criticism from progressive Democrats for amplifying conservative voices, highlighting tensions within the party. \n\nMike Murphy, a prominent Republican political consultant who has a Substack newsletter and weekly podcast called Hacks on Tap that he hosts with Democratic consultant David Axelrod, explained these mediums offer a valuable long-form format in which candidates can express detailed ideas without the constraints of traditional media.\n\n“I mean, Hacks on Tap is just Axelrod and I, now John Heilemann, just blabbing along every week for an hour, an hour and 15 minutes to our hearts’ content, which we find people like because they kind of want the detailed stuff, which you can’t get on CNN, Fox, or MSNBC,” Murphy said in an interview with the Washington Examiner. \n\n“When you’re writing a Substack essay, and you know Substack has audio content, too, or doing a podcast, you can do topic of the day, but you can also go into other things that may be of interest. So it’s kind of a richer meal of opinion for the consumer,” he added.\n\nMurphy noted that Substack and podcasts offer campaigns a cost-efficient way to reach targeted, engaged audiences and organically amplify their messages without paid advertising.\n\n“The thing about digital media, it’s inherently contagious. You spread something there, it gets picked up, and an idea or content connected to a candidate or campaign spreads organically, at no cost,” he said. \n\nJennifer Holdsworth, a Democratic strategist who managed Buttigieg’s bid for DNC chairman, pointed out that building an audience on these platforms is challenging without an existing base.\n\n“Even though these mediums like Substack and other independent avenues are hyperpopular, I’ve also seen consumers sort of pull back on what they’re willing to pay for, and so it’s going to be a little harder to target audiences that way,” Holdsworth explained. “You sort of have to come with a prebuilt audience. It’s going to be much harder to build it from those mediums.”\n\nHoldsworth emphasized that authenticity is crucial for Democrats using long-form platforms such as Substack and podcasts. She said politicians who are naturally adept communicators, such as Buttigieg, can thrive, but when it feels forced, it risks coming across as insincere.\n\n“The biggest thing that voters are sniffing out right now is inauthenticity. And if you have the natural propensity to be able to communicate in this way, then, by all means, lean in. But if you’re trying to make fetch happen, it’s going to be seen as disingenuous and may not necessarily be suited to your communication style,” she said.\n\nShe also said the longer format can become a liability, noting Democrats tend to be less forgiving than Republicans when strategies fall flat. \n\n“I think you saw this in the reaction to Gavin Newsom’s podcast, which was overwhelmingly negative when it began because it seemed that he was trying to force himself into a space rather than utilize a space that already existed and become part of the conversation,” Holdsworth said. \n\nShe credited Newsom for adjusting his approach but said Democrats sometimes struggle to adapt their messaging strategies, especially when new approaches don’t land right away.\n\n“If there’s one piece of advice, you know, I would give to Democrats, it’s that trial and error is OK. Meet the voters where they are and learn from what worked and what didn’t. We just have this propensity to self-flagellate every time something doesn’t work. Republicans don’t do that.”\n\nDespite these challenges, there are clear rewards for those who navigate the space well. Valentine, a former CNN producer and publicist for the Washington Post, noted an unexpected benefit of appearing on Substack: a significant boost in campaign fundraising.\n\nA TIMELINE OF THE TRUMP-HARVARD SAGA\n\n“I’m hearing that every time politicians join Substack shows that donations pop up across the country, leading to some of the best donation days of their campaigns,” she said, citing conversations with campaign managers.\n\n“That just wouldn’t happen if [the politicians] appeared on prime-time television. So this is such a game changer, and these audiences are so deeply invested that they’re not only listening to what you say, they’re opening up their wallets and they’re going to a different site to donate to,” she said.","summary":"Facing a fractured media landscape and an increasingly skeptical electorate, politicians are turning to podcasts and newsletter platform Substack as direct-to-voter platforms, reshaping how campaigns communicate ahead of the 2026 midterm elections and the 2028 presidential race.&#160; From candidates and party organizations to the State Department, these newsletters and audio platforms are being used to [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3427533/substack-podcasts-midterms-2028/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/AP23361093825660-scaled-1024x683.webp","video":null,"publish_date":"2025-06-02 12:00:00","author":"Samantha-Jo Roth","authors":["Samantha-Jo Roth"],"language":"en","category":"politics","source_country":"US","sentiment":0.066},{"id":327294856,"title":"'60 Minutes' reporter Lesley Stahl says she's angry with CBS' Shari Redstone over Trump lawsuit","text":"Longtime CBS journalist Lesley Stahl admitted she was \"angry\" with Paramount Global chairwoman Shari Redstone over how things are being handled over President Donald Trump’s lawsuit against the network on Friday. The \"60 Minutes\" reporter discussed the ongoing lawsuit and its effects on her program on The New Yorker Radio Hour podcast. She reflected on top producer Bill Owens stepping down in what she called a \"painful\" experience after he claimed that he was being restrained by the network on what stories to produce. After CBS News president Wendy McMahon’s abrupt resignation, she called the situation at the network \"hard\" and partially blamed Redstone for putting pressure on them in what appears to be an appeasement to the Trump administration. \"To have a news organization come under corporate pressure—to have a news organization told by a corporation, ‘do this, do that with your story, change this, change that, don’t run that piece.' I mean, it steps on the First Amendment, it steps on the freedom of the press,\" Stahl said. \"It steps on what we stand for. It makes me question whether any corporation should own a news operation. It is very disconcerting.\" '60 MINUTES' PRODUCERS RAIL AGAINST TRUMP'S 'BULLS---' LAWSUIT, DREAD PROSPECTS OF PARAMOUNT MAKING SETTLEMENT Still, she declined to use the word \"turmoil\" to describe the situation, although she revealed there was consideration for journalists to leave \"en masse\" after Owens’ resignation. Stahl added that there’s a sense of \"fragility\" in the press now thanks to things like Trump’s \"frivolous lawsuit\" and a lack of trust in the media. \"The pain in my heart is that the public does not appreciate the importance of a free and strong and tough press in our democracy,\" Stahl said. \"Even the Founding Fathers recognized that we need to have a strong fourth estate to hold our elected officials accountable, and to continue to cleanse the system. The public doesn’t seem to want what we do to be part of our public life.\" She predicted Paramount Global, CBS’ parent company, will ultimately settle with Trump to complete a merger with Skydance Media. If that were to occur, she hoped that the new owners would \"hold the freedom of the press up as a beacon.\" The interview was recorded before news broke on Friday about Trump rejecting a $15 million settlement for his $20 billion lawsuit. Fox News Digital confirmed that the president’s team is demanding at least $25 million and an apology from CBS News. Last October, Trump sued CBS News and Paramount for $10 billion over allegations of election interference involving the \"60 Minutes\" interview of then-Vice President Kamala Harris that aired weeks before the presidential election (the amount has since jumped to $20 billion). The lawsuit alleges CBS News deceitfully edited an exchange Harris had with \"60 Minutes\" correspondent Bill Whitaker, who asked her why Israeli Prime Minister Benjamin Netanyahu wasn't \"listening\" to the Biden administration. Harris was widely mocked for the \"word salad\" answer that aired in a preview clip of the interview on \"Face the Nation.\" '60 MINUTES' REPORTER LESLEY STAHL ADMITS WORRY ABOUT FUTURE OF LEGACY MEDIA: 'I'M VERY DARK ABOUT IT' However, when the same question aired during a primetime special on the network, Harris had a different, more concise response. Critics at the time accused CBS News of deceitfully editing Harris' \"word salad\" answer to shield the Democratic nominee from further backlash leading up to Election Day. Stahl denied there was any effort to make Harris look better and that the network simply aired two different halves of the answer. She claimed the lawsuit is being made only to intimidate them. \"What is really behind it, in a nutshell, is [an effort] to chill us. There aren’t any damages. I mean, he accused us of editing Kamala Harris in a way to help her win the election. But he won the election,\" Stahl said. Fox News Digital reached out to CBS and Paramount Global for a comment. CLICK HERE TO GET THE FOX NEWS APP","summary":"“60 Minutes&quot; reporter Lesley Stahl discussed the state of affairs behind the scenes at CBS as it faces on ongoing lawsuit from President Donald Trump.","url":"https://www.foxnews.com/media/60-minutes-reporter-lesley-stahl-says-shes-angry-cbs-shari-redstone-over-trump-lawsuit","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/lesley-stahl-cbs.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 11:00:54","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"US","sentiment":-0.273},{"id":327294860,"title":"Bill Clinton denies Biden suffered decline, claims he was 'in good shape' before stepping down","text":"Former President Bill Clinton insisted in an interview airing Sunday that former President Joe Biden was \"in good shape\" and he \"never\" saw him in cognitive decline in office. While promoting his new book \"The First Gentleman,\" Clinton was asked by \"CBS Sunday Morning\" anchor Tracy Smith to comment on allegations made in the book \"Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again\" by Axios’ Alex Thompson and CNN’s Jake Tapper. Throughout \"Original Sin,\" Thompson and Tapper wrote there were ongoing efforts by the Biden administration to cover up signs of mental and physical decline by shielding him from the public and misleading political allies. DEMOCRATIC STRATEGIST JAMES CARVILLE SAYS OBAMA, BILL CLINTON SHOULD LEAD DISCUSSION ON BIDEN REPLACEMENT \"Did you ever have a moment with him where you thought maybe he was unfit to run for president?\" Smith asked. \"No. I thought he was a good president,\" Clinton said. \"The only concern I thought he had to deal with was, could anybody do that job until they were 86? And we’d had several long talks. I had never seen him and walked away thinking he can’t do this anymore. He was always on top of his brief.\" \"You never saw any cognitive decline?\" Smith asked. \"I didn’t know anything about any of this. And I haven’t read the book. I saw President Biden not very long ago, and I thought he was in good shape. But the book didn’t register with me because I never saw him that way,\" Clinton answered. When pressed about why he didn’t read the book, Clinton remarked that Biden wasn’t the president anymore and that he already thought he did a \"good job.\" Clinton also claimed the book was being used \"as a way to blame him for the fact that [Donald] Trump was reelected.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Though Clinton spoke highly of Biden’s job as president during the interview, he and his wife, former Secretary of State Hillary Clinton, were among some of the earliest Democratic figures to endorse then-Vice President Kamala Harris for president, just hours after Biden dropped out of the race. Since \"Original Sin\" was published last month, the Democratic Party and the mainstream media have been getting renewed criticism for allegedly downplaying or covering up Biden’s shortcomings until his first debate with President Trump last year. CLICK HERE TO GET THE FOX NEWS APP Clinton, 78, is four years Biden's junior. He took office in 1993 as one of the nation's youngest-ever presidents at age 46, while Biden was 78 when his presidency began in 2021.","summary":"Former President Bill Clinton denied seeing any signs of former President Joe Biden showing signs of mental decline while in office despite ongoing reports.","url":"https://www.foxnews.com/media/bill-clinton-denies-biden-suffered-decline-claims-he-good-shape-before-stepping-down","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/biden-clinton.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 10:48:49","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"US","sentiment":-0.385},{"id":327266576,"title":"Barabak: Yelling, finger-pointing and cursing galore as California Democrats gather near Disneyland","text":"It’s not easy being a Democrat in these Trumpian times, as each day brings fresh tales of conquest and pillage. Still, despite all that, 4,000 stiff-upper-lipped partisans showed up in Anaheim over the weekend, seeking solace, inspiration and a winning way forward. As mouse-eared pilgrims plied the sidewalks outside, the party faithful — meeting several long blocks from Disneyland — engaged in their own bit of escapism and magical thinking. “Joy is an act of resistance,” state party Chairman Rusty Hicks gamely suggested at a beer-and-wine reception, which opened the party’s annual three-day convention with as much conviviality as the downtrodden could muster. That's certainly one way to cope. But the weekend gathering wasn’t all hand-wringing and liquid refreshment. There were workshops on top of workshops, caucus meetings on top of caucus meetings, and speaker after speaker, wielding various iterations of the words “fight” and “resist” and dropping enough f-bombs to blow decorum and restraint clear to kingdom come. President Trump — the devil himself, to those roiling inside the hall — was derided as a “punk,” “the orange oligarch,” a small-fisted bully, the “thing that sits in the White House” and assorted unprintable epithets. “My fellow Golden State Democrats, we are the party of FDR and JFK, of Pat Brown and the incomparable Nancy Pelosi,” said a not-so-mild-mannered Sen. Adam Schiff. “We do not capitulate. We do not concede. California does not cower. Not now, not ever. We say to bullies, you can go f— yourself.” The road from political exile, many Democrats seemed to feel, is richly paved with four-letter words. Two of the party’s 2028 presidential prospects were on hand. (Another of those — Gov. Gavin Newsom — has fallen out of favor with many of his fellow California Democrats and found it best to stay away.) A highly caffeinated New Jersey Sen. Cory Booker, of 25-hour filibuster fame, summoned past glories and urged Democrats to find their way back to the party’s grounding principles, then fight from there. “We are here because of people who stood up when they were told to sit down. We're here because of people who spoke up when they were told to be silent. We're here because of people who marched in front of fire hoses and dogs,” Booker hollered in his best preacherly cadence. “We are here because of people who faced outrageous obstacles and still banded together and said we shall overcome.\" Tim Walz, the party’s 2024 vice presidential nominee and the weekend’s keynote speaker, was on hand after jetting from a morning appearance in South Carolina. He delivered the most thorough and substantive remarks. He began with a brief acknowledgment and thanks to his 2024 running mate, Kamala Harris. (She, too, stayed away from the convention while pondering her political future. The former vice president's sole presence was a three-minute video most noteworthy for its drab production and Harris' passion-free delivery.) By contrast, Walz gleefully tore into Trump, saying his only animating impulses were corruption and greed. He noted the callous hard-heartedness the president and his allies displayed during California’s horrific January firestorm. “They played a game, a blame game, and they put out misinformation about an incredibly tragic situation,” Minnesota’s governor said. “They didn't have the backs of the firefighters. They didn't hustle to get you the help you needed. They hung you out to dry.” Keeping with the weekend’s expletive-laden spirit, Walz blasted Trump’s “Big Beautiful Bull—\" legislation and mocked congressional Republicans as the “merry band of dips—\" who lend him their undying support. But much of his 30-minute speech was devoted to flaying his own party — “like a deer … in goddamned headlights” — saying Democrats can blame only themselves for being so feckless and off-putting they made the odious Trump seem preferable by comparison. “There is an appetite out there across this country to govern with courage and competency, to call crap where it is, to not be afraid, to make a mistake about things, but to show people who you truly are and that they don't have to wonder who the Democratic Party is,” Walz said to a roaring ovation. “Are you going to go to a cocktail party with somebody who's super rich and then pass a law that benefits them?” he demanded. “[Or] are you going to work your ass off and make sure our kids get a good education?” And yet for all the cursing and swagger and bluster, there was an unmistakable air of anxiety pervading the glassy convention center. This is a party in need of repair and many, from the convention floor to the hospitality suites, acknowledged as much. Alex Dersh, a 27-year-old first-time delegate from San Jose, said his young peers — \"shocked by Trump's election\" — were especially eager for change. They just can't agree, he said, on what that should be. Indeed, there were seemingly as many prescriptions on offer in Anaheim as there were delegates. (More than 3,500 by official count.) Anita Scuri, 75, a retired Sacramento attorney attending her third or fourth convention, suggested the party needs to get back to basics by speaking plainly — she said nothing about profanity — and focusing on people's pocketbooks. \"It's the economy, stupid,\" she said, recycling the message of Bill Clinton's winning 1992 campaign. \"It's focusing on the lives people are living.\" Gary Borsos said Democrats need to stop dumbing-down their message and also quit harping on the president. \"There's a lot of 'Trump is bad,' \" said the 74-year-old retired software engineer, who rode eight hours by train from Arroyo Grande to attend his first convention. \"What we're doing is coming up with a lot of Band-Aid solutions to problems of the day,\" Borsos said. \"We're not thinking long-term enough.\" Neither, however, expressed great confidence in their party going forward. \"I'm hopeful,\" Scuri said. \"Not optimistic.\"","summary":"Delegates to the state party convention heard a lot of swearing and speeches from 2028 contenders Tim Walz and Cory Booker. But neither Gavin Newsom nor Kamala Harris attended.","url":"https://www.latimes.com/politics/story/2025-06-02/california-democratic-party-convention-trump-tim-walz-cory-booker-kamala-harris-gavin-newsom","image":"https://ca-times.brightspotcdn.com/dims4/default/e9c0b67/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4f%2F0d%2F9432b3714d53804739b10eaef068%2F1508550-pol-me-cadem","video":null,"publish_date":"2025-06-02 10:00:00","author":"Mark Z. Barabak","authors":["Mark Z. Barabak"],"language":"en","source_country":"us","sentiment":0.097},{"id":327264120,"title":"Johnny Depp v. Amber Heard predicted young male voters flocking to Trump","text":"History will no doubt look upon the outcome of the Johnny Depp v. Amber Heard with the same skepticism now applied to O.J. Simpson's 1995 acquittal after charges of his killing his wife and her friend. The 2022 trial, in which Depp sued Heard for defamation after she made anonymous allusions to domestic violence in a 2018 Washington Post op-ed, was a farce — by design. Depp hired publicist Melissa Nathan, who famously bragged she could \"bury anyone,\" to seed social media networks with misogynist rumors about Heard, who had been 25 when she started dating the 48-year-old movie star. The New York Times later reported on Nathan's alleged tactics, based on court documents from a similar campaign against actress Blake Lively. The strategy, according to the Times, is \"waging a largely undetectable smear campaign in the digital era,\" which succeeded when \"online criticism of the actress skyrocketed.\"\n\nThe evidence in Depp v. Heard, in a sane world, should have favored Heard. His claim to damages was that Heard's op-ed led to him losing his lead role in \"Pirates of the Caribbean.\" A Disney executive denied this on the witness stand, and Depp's longtime talent agent testified that Depp's erratic behavior was what soured his reputation on set. As Jessica Winter at the New Yorker wrote during the trial, Heard produced \"a trove of text messages, witness statements, and photos of injuries — which, she says, corroborate her allegations of abuse.\" Depp had previously sued a British tabloid for calling him a \"wife-beater,\" and he lost, even though British law favors plaintiffs in defamation cases to an outrageous degree. The judge described Heard's side of the story as \"substantially true.\" Winter continues:\n\nThere are also Depp’s texts sent before he married Heard—in which he calls her a “worthless hooker,” jokes about how he’ll “smack the ugly c—t around,” and, at one point, shares a brainstorm with the actor Paul Bettany: “Let’s drown her before we burn her!!! I will f—k her burnt corpse afterwards to make sure she’s dead.” There’s footage of Depp trashing a kitchen and audio recordings of him telling Heard, “Shut the f—k up. . . . Don’t f——g pretend to be authoritative with me. You don’t exist.” Depp, to review, is the plaintiff in the defamation trial, and the one whom most of social media is rooting for.\n\nAs that last sentence suggests, the case ended up being tried in the court of public opinion, where the preposterous story that Depp was the real victim took hold. Instructions to the jurors to ignore the crescendo of support for Depp outside the courtroom didn't matter, leading to a $15 million judgment in his favor. It's not clear how much of the pro-Depp clamor was seeded by his hired guns, but in the end, they were pushing on an open door. As journalist Kat Tenbarge reported for NBC at the time, content creators for TikTok and YouTube found that spreading sexist rumors about Heard was like printing money. There was an immense amount of public hunger in 2022 to forget all the lessons of the #MeToo movement, and instead fall back into the comfortable belief that sexism is a myth, women just make up stories for attention, and it's accused men who are the real victims. \n\nWant more Amanda Marcotte on politics? Subscribe to her newsletter Standing Room Only.\n\nThis week is the third anniversary of the day that a jury favored Depp over Heard. Looking back, the whole situation can be read as a portent for the 2024 election of Donald Trump. The public outpouring of support for Depp reflected a widespread willingness to choose self-delusion over facing hard truths, especially about the dangers of male domination. For a lot of people, it's exhausting hearing about how many women are beaten, raped, killed, harassed, and otherwise oppressed. It can feel much easier to believe it's all just made up. It's simpler to believe that ours is a just system, even as men still hold the lion's share of power and money. It's comforting to imagine that men react to all their privilege with grace and gratitude, and ignore the reality where all too many abuse women because they can. Trump was selling the same message to his voters: Wouldn't it be easier to live in a fantasy where patriarchy is all kittens and rainbows? Isn't it easier to live in the lie than confront the hard truth?\n\nIn May, the gold standard for post-election analysis, the Catalist report, was released. It affirmed what preliminary reports had shown: there was a huge swing to the right among young men in 2024. \"In 2024, the gender gap among 18 to 29-year-olds widened to 17 points,\" the report explains. In 2020, 55% of men in the youngest bracket voted for Joe Biden. In 2024, only 46% voted for Kamala Harris. Early exit polls were bad enough, but this data shows even more how much younger men have been bamboozled by the MAGA propaganda machine into voting against their self-interest on issues like education costs, future employment, and clean energy.\n\nMuch attention, for good reason, has been paid to the role that social media influencers, podcasters, and other online content creators played in this shift. Some present as apolitical entertainers, such as Joe Rogan, the Nelk brothers, or Theo Von. Others, like Jordan Peterson or Ben Shapiro, wear their right-wing politics more proudly. But all share a view that men are the oppressed ones in our society, supposedly denied their ability to bro out and be their full manly selves. And while some may be coy about who is behind this supposed oppression of men, realistically, there can only be one answer: women. Or, more specifically, what's harshing men's vibe is women claiming the right to be treated as equals and to be safe from male violence. \n\nClaims that men are \"innocent\" in the face of overwhelming evidence of guilt are rarely about a sincere misapprehension of the facts. Instead, it's an oblique statement of an unspeakable but widely held belief that violence against women shouldn't be a crime, especially for high-status perpetrators. We see this with Trump. He's been found liable by a civil jury for sexual assault and is on tape bragging about exactly the kind of crime multiple women have accused him of. His supporters are aware of this, but ultimately, they don't seem to care. They lash out at the alleged victims for speaking out, believing women have a duty to endure men's abuse in silence. \n\nThis also helps explain the unhinged rage that exploded across the internet at Heard. The more evidence she produced against Depp, the angrier the mob got. People desperately wanted to believe the charming actor whose movies they've enjoyed their whole lives is a wonderful guy. When presented with evidence to the contrary, it was just easier to shoot the messenger than grapple with the uncomfortable reality that the world is often more complicated and uglier than we'd like it to be. They wanted Heard to shut up, not because they didn't believe her, but because they did. \n\nThe far-right website Daily Wire spent an astonishing amount of money promoting anti-Heard propaganda during the trial, which confused many people at the time. The Daily Wire is a political outfit, so why would they care about celebrity gossip that doesn't seem to have any partisan value to it? But they understood that Heard v. Depp did benefit Republicans, especially Trump. The entire circus was useful for convincing people that it's okay to choose disinformation over the truth, especially when the facts make you feel bad. It all goes back to George Orwell's insight with the \"two-minute hate\" in \"1984.\" Self-delusion takes practice. Defending Depp was boot camp for the real test: supporting the lie that Donald Trump would make a fine president.","summary":"The trial was permission to believe men are the real victims — regardless of facts","url":"https://www.salon.com/2025/06/02/johnny-depp-v-amber-heard-predicted-young-male-flocking-to/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2022/05/amber-heard-johnny-depp-1240710893.jpg ?>","video":null,"publish_date":"2025-06-02 09:59:01","author":"Amanda Marcotte","authors":["Amanda Marcotte"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.017},{"id":327281434,"title":"Harvard Chinese grad speech draws praise and ire","text":"A Chinese Harvard graduate’s speech calling for unity in a divided world, delivered days after the US vowed to “aggressively” revoke Chinese students’ visas, has sparked mixed reactions in the US and her home country.\n\n“We don’t rise by proving each other wrong. We rise by refusing to let one another go,” Jiang Yurong said on Thursday, the same day a US federal judge blocked the Trump administration’s ban on foreign students at Harvard.\n\nHer speech went viral on the Chinese internet, with some saying it moved them to tears. However, others said her elite background is not representative of Chinese students.\n\nIn the US, some have flagged her alleged links with the Chinese Communist Party.\n\nIn their efforts to restrict Harvard from enrolling foreign students, US authorities had accused the institution of “co-ordinating with the Chinese Communist Party”.\n\nMs Jiang, who studied international development, was the first Chinese woman to speak at a Harvard graduation ceremony.\n\nIn her address, Ms Jiang emphasised the value of Harvard’s international classrooms, noting how that taught her and her classmates to “dance through each other’s traditions” and “carry the weight of each other’s worlds”.\n\n“If we still believe in a shared future, let us not forget: those we label as enemies – they, too, are human. In seeing their humanity, we find our own,” said Ms Jiang, who spent her final two years of school at Cardiff Sixth Form College in Wales before going to Duke University in the US for her undergraduate degree.\n\nA conservative X account, with the handle @amuse, criticised Harvard for choosing a graduation speaker who is “a representative of a CCP-funded and monitored non-government organisation”, alleging that her father works for a non-government organisation that “serves as a quasi-diplomatic agent for the [party]”.\n\nThe account, which has 639,000 followers, has previously posted pro-Donald Trump content, such as the US leader fighting Darth Vader and sexualised imagery of former Vice-President Kamala Harris.\n\nSome Chinese social media users, on the other hand, allege that the organisation Ms Jiang’s father works for is backed by prominent American companies and foundations.\n\nThe BBC has not independently verified these allegations.\n\n“This is why she could get a scholarship to go to the UK for high school, and later also to Harvard,” wrote a user on China’s X-like platform, Weibo.\n\nOthers called for her to stay on in the US, with comments that reeked with sarcasm. “Such talent should be left to the United States,” one wrote. “I hope she will continue to glow abroad and stay away from us!” read another.\n\nBut Ms Jiang’s vision of a “shared humanity” also struck a chord.\n\n“That she is able to stand on an international stage and speak the heart of Chinese students has moved me to tears,” wrote a user on Red Note, another Chinese social media platform.\n\nAnother user defended Jiang by hitting back at those who criticised her: “You may not have changed them, but they’ve heard you… As more and more people speak out like you, you will eventually move and change others.”\n\nThere are around 6,800 international students at Harvard, who make up more than 27% of its enrolments in the past academic year.\n\nAbout a third of these foreign students are from China, and more than 700 are Indian.\n\nSource link","summary":"A Chinese Harvard graduate&#8217;s speech calling for unity in a divided world, delivered days after the US vowed to&#160;&#8220;aggressively&#8221; revoke Chinese students&#8217; visas, has sparked mixed reactions in the US and her home country. &#8220;We don&#8217;t rise by proving each other wrong. We rise by refusing to let one another go,&#8221; Jiang Yurong said on [&#8230;]\n\n\nThe post Harvard Chinese grad speech draws praise and ire appeared first on Ghana Latest News.","url":"https://ghananewss.com/harvard-chinese-grad-speech-draws-praise-and-ire/","image":"https://ghananewss.com/storage/2023/01/ghananews-2023.png","video":null,"publish_date":"2025-06-02 09:28:45","author":"Ghana News,Sefakor Fekpe","authors":["Ghana News","Sefakor Fekpe"],"language":"en","source_country":"gh","sentiment":-0.033},{"id":327249890,"title":"Trump is winning the culture war while Democrats are still hiring 2008's consultants","text":"Democrats once dominated pop culture. We had Beyoncé campaigning for Obama, Katy Perry performing for Hillary, and Kamala Harris appearing with celebrities like Lady Gaga and Megan Thee Stallion. Pop culture was blue. But something's changed. Now, it's Trump engaging with UFC personalities, podcast stars, and crypto influencers. He doesn't just appear on their shows; he builds relationships. He invites figures like Theo Von to visit troops in the Middle East and welcomes them to Mar-a-Lago, not just for content creation but to connect. It’s not about messaging. It’s about belonging. In contrast, Democrats have viral creators mocking Republican makeup or roasting right-wing talking points, but it’s mostly self-congratulatory. It doesn’t win converts — it amuses the base. Meanwhile, undecided voters are tuning into Theo Von, who recently called what’s happening in Gaza a genocide, Andrew Schulz, who recently hosted Sen. Bernie Sanders and former Transportation Secretary Pete Buttigieg. These figures aren’t lockstep conservatives. They’re credible, curious, and, most importantly, relatable. TRUMP SAYS ‘LEGENDARY’ CROWD REACTION AT UFC 314 SHOWS THE ADMINISTRATION IS ‘DOING A GOOD JOB’ As a recent New York Times article highlighted, Trump’s connection to influencers isn’t surface-level. It’s relationship-driven. He’s not using them. He’s including them. That’s the kind of real-world, real-time attention Democrats need to start paying to the influencer class. Today’s conservative influencers aren’t your father’s talk radio hosts. They’re running podcasts, headlining comedy tours, and dominating TikTok. They’re the new mainstream. CLICK HERE FOR MORE FOX NEWS OPINION Democrats are now spending $20 million trying to figure out how to talk to young men, launching a strategy called \"SAM\" to study what makes this group tick. But here’s the issue: the same consultants who taught Barack Obama to say \"Yes We Can\" in 2008 are still the ones deciding messaging in 2025. It’s stale. It’s top-down. And it completely misses the point. Young men don’t want to be targeted like a marketing demo. They want to be spoken to like actual people. They’re forming political opinions in podcasts, in group chats, and in the comments — not from someone’s paid ad in a video game. CLICK HERE TO GET THE FOX NEWS APP If Democrats want to win the next generation, it’s not enough to put celebrities on stage every four years. We need a strategy that actually engages voters where they live: online, in the algorithm, and in the culture. If we don’t, we’ll keep losing influence to a movement that figured out long ago that attention is power, and culture wins. CLICK HERE TO READ MORE FROM YEMISI EGBEWOLE","summary":"Democrats once led pop culture, but now Trump connects with influencers like UFC stars and podcasters. Democrats need fresh strategies to engage young voters.","url":"https://www.foxnews.com/opinion/trump-winning-culture-war-while-democrats-still-hiring-2008s-consultants","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/1200/675/gettyimages-2184514648-1-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 09:00:04","author":"Yemisi Egbewole","authors":["Yemisi Egbewole"],"language":"en","category":"politics","source_country":"us","sentiment":0.124},{"id":327249896,"title":"The celebrity circus is trying to convince Americans to fund Planned Parenthood – and they aren't buying it","text":"Remember when Taylor Swift’s last-minute endorsement of Kamala Harris won her the presidential election? Or remember how just calling something \"brat\" (inspired by singer Charli XCX) was enough to catapult voters into liking and voting for Democrats? Yeah, I don’t remember that happening either. That is why it is so maddening and confounding when the Left pulls celebrities out of a hole. Because it almost never works. ROE V. WADE IS GONE, BUT ABORTION IS STILL THE NUMBER 1 KILLER WORLDWIDE Enter the latest tone-deaf Leftist experiment. Last week, 250 rich, elite celebrities, alongside Planned Parenthood, took out a full-page ad in the New York Times insisting we plebeians forcibly fund Planned Parenthood through our federal tax dollars. How is that for freedom? This has all the awareness of the peak cringe COVID-19 Imagine celebrity sing-along. According to Planned Parenthood’s exclusive Rolling Stone write-up, the celebrity campaign includes the following slogans: \"I’m for Planned Parenthood. For Freedom. For Healthcare. For You and Me.\" Here is why all that sloganeering is a load of rubbish. Planned Parenthood would not be paying tens of thousands of dollars and calling on over 200 celebrities for a New York Times ad, if they weren’t nervous about something. That nervousness stems from the fact that Democrats no longer oversee the federal purse. Rightfully so. The current administration and Congress recognize that Americans cannot sustain giving another $800 million to fund the largest abortion giant in the country. Last week, the House passed President Trump’s \"One Big Beautiful\" bill and as of today, it is with the Senate. As part of promises to cut waste, the bill stops hundreds of millions of forced taxpayer dollars to Big Abortion. Naturally, Planned Parenthood sees the writing on the wall. No longer will everyday Americans be forced to use their money to artificially keep this organization alive. They are crumbling and they know it. But don’t just take my word for it; take the word of the newspaper that they placed the ad in. In a direct counter to the campaign’s \"For Healthcare\" line, a recent article in the New York Times argues that money is not being used to help patients, but rather to fund the politics of its abortion lobby. The grisly New York Times story features atrocious conditions at Planned Parenthood, like botched abortions and leaking sewage that caused patients to vomit. A Missouri branch was shut down for using moldy abortion equipment on women. Staffers confessed to botching STI tests and not informing patients when they tested positive for sexually transmitted diseases. Story after story in the article shares testimony from staffers painting a scary reality on the ground. It leaves the reader without a doubt that Planned Parenthood lacks basic health and safety standards. However, the New York Times ad campaign emphasizes Planned Parenthood providing birth control, cancer screenings, STI testing, and then at the bottom of the list they mention abortions and trans treatments. But in Planned Parenthood’s recently released annual report, their own data confirms cancer screenings, pap smears and breast exams plummeted by 50%. Their STI testing was down 38%. In fact, the top three items were: abortion, transgender treatments, and political spending–those have all skyrocketed. Last year, they spent nearly $70 million to try and elect Kamala Harris and other Democrats. CLICK HERE FOR MORE FOX NEWS OPINION So, why on earth are our country’s richest and most famous clamoring for us to provide our hard-earned dollars to an organization that is actively causing harm to women and children? Your guess is as good as mine. What are we really looking at here? A flailing political machine desperate to rake in taxpayer dollars with glitter and hashtags, hoping we will be too dazzled to notice the rot underneath. CLICK HERE TO GET THE FOX NEWS APP But Americans are not stupid—we do not need Hollywood to tell us what health care is, or what it is not. We do not need millionaire activists lecturing us about \"freedom\" while demanding our money to fund an organization with a failing record and a partisan agenda. We all know that Hollywood Leftists love Planned Parenthood. But they should not demand that the rest of us foot the bill for their pet projects. The era of celebrity politics is over. The American people are wide awake—and we are not buying it.","summary":"Planned Parenthood&apos;s celebrity-backed campaign faces backlash as critics highlight declining health services and increased political spending.","url":"https://www.foxnews.com/opinion/celebrity-circus-trying-convince-americans-fund-planned-parenthood-arent-buying","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/1200/675/Planned-Parethood-Sign.png?ve=1&tl=1","video":null,"publish_date":"2025-06-02 09:00:00","author":"Emily Davis","authors":["Emily Davis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.445},{"id":327282464,"title":"Former Biden official says Israel has 'without a doubt' committed war crimes in Gaza","text":"A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza. Speaking to the Trump 100 podcast, Matthew Miller, who, as a state department spokesman, was the voice and face of the US government's foreign policy under Mr Biden, revealed disagreements, tensions and challenges within the former administration. In the wide-ranging conversation, he said: • It was \"without a doubt true that Israel has committed war crimes\";• That Israeli soldiers were not being \"held accountable\";• That there were \"disagreements all along the way\" about how to handle policy;• And that he \"would have wanted to have a better candidate\" than Mr Biden for the 2024 election. Mr Miller served as the state department spokesman from 2023 until the end of Mr Biden's presidential term. From the podium, his job was to explain and defend foreign policy decisions - from Ukraine to Gaza. \"Look, one of the things about being a spokesperson is you're not a spokesperson for yourself. You are a spokesperson for the president, the administration, and you espouse the positions of the administration. And when you're not in the administration, you can just give your own opinions.\" Now out of office, he offered a candid reflection of a hugely challenging period in foreign policy and US politics. Gaza disagreements Asked about Gaza, he revealed there were \"small and big\" disagreements within the Biden administration over the US-Israeli relationship. \"There were disagreements all along the way about how to handle policy. Some of those were big disagreements, some of those were little disagreements,\" he said. Pushed on rumours that then-secretary of state Antony Blinken had frustrations with Mr Biden over both Gaza and Ukraine policy, Mr Miller hinted at the tensions. 👉 Follow Trump100 on your podcast app 👈 \"I'll probably wait and let the secretary speak for himself… but I will say, speaking generally, look, it is true about every senior official in government that they don't win every policy fight that they enter into. And what you do is you make your best case to the president. \"The administration did debate, at times, whether and when to cut off weapons to Israel. You saw us in the spring of 2024 stop the shipment of 2,000-pound bombs to Israel because we did not believe they would use those in a way that was appropriate in Gaza.\" Through the spring and summer of 2024, the Biden administration was caught between its bedrock policy of the unconditional defence of its ally Israel and the reality of what that ally was doing in Gaza, with American weapons. Mr Mill said: \"There were debates about whether to suspend other arms deliveries, and you saw at times us hold back certain arms while we negotiated the use of those arms… \"But we found ourselves in this really tough position, especially in that time period when it really came to a head… We were at a place where - I'm thinking of the way I can appropriately say this - the decisions and the thinking of Hamas leadership were not always secret to the United States and to our partners.\" Read more from Sky News:What did Musk achieve at DOGE?Trump to double tariffs on steel importsTrans athlete wins two golds after controversy He continued: \"And it was clear to us in that period that there was a time when our public discussion of withholding weapons from Israel, as well as the protests on college campuses in the United States, and the movement of some European countries to recognise the state of Palestine - appropriate discussions, appropriate decisions - protests are appropriate - but all of those things together were leading the leadership of Hamas to conclude that they didn't need to agree to a ceasefire, they just needed to hold out for a little bit longer, and they could get what they always wanted.\" \"Now, the thing that I look back on, that I will always ask questions of myself about, and I think this is true for others in government, is in that intervening period between the end of May and the middle of January [2025], when thousands of Palestinians were killed, innocent civilians who didn't want this war, had nothing to do with it, was there more that we could, could have done to pressure the Israeli government to agree to that ceasefire? I think at times there probably was,\" Mr Miller said. Asked for his view on the accusation of genocide in Gaza, he said: \"I don't think it's a genocide, but I think it is without a doubt true that Israel has committed war crimes.\" Challenged on why he didn't make these points while in government, he said: \"When you're at the podium, you're not expressing your personal opinion. You're expressing the conclusions of the United States government. The United States government had not concluded that they committed war crimes, still have not concluded [that].\" He went on to offer a qualification to his accusation. \"There are two ways to think about the commission of war crimes,\" he said. \"One is if the state has pursued a policy of deliberately committing war crimes or is acting recklessly in a way that aids and abets war crimes. Is the state committing war crimes? \"That, I think, is an open question. I think what is almost certainly not an open question is that there have been individual incidents that have been war crimes where Israeli soldiers, members of the Israeli military, have committed war crimes.\" The Israeli government continues to strongly deny all claims that it has committed war crimes in Gaza. On Joe Biden's election hopes Mr Miller also offered a candid reflection on the suitability of Mr Biden as a candidate in the 2024 US election. While Mr Biden initially ran to extend his stay in the White House, he stepped aside, with Kamala Harris taking his place as the Democratic candidate. \"Had I not been inside the government, had I been outside the government acting kind of in a political role, of course, I would have wanted to have a better candidate,\" he said. \"It's that collective action problem where no one wants to be the first to speak out and stand up alone. You stand up by yourself and get your head chopped off, stand up together, you can take action. \"But there was never really a consensus position in the party, and there was no one that was willing to stand up and rally the party to say this isn't going to work. \"I don't think there is anyone on the White House staff, including the most senior White House staffers, who could have gone to Joe Biden in the spring of 2023 or at any time after that and told him: 'Mr President, you are not able to do the duties of this job. And you will not win re-election.' He would have rejected that outright.\" The Trump presidency On the Donald Trump presidency so far, he offered a nuanced view. He described Mr Trump's Middle East envoy Steve Witkoff as \"an extremely capable individual\" but expressed his worry that he was being manipulated by Russian President Vladimir Putin. \"I know the people in the Biden administration who worked with him during the first negotiations for Gaza ceasefire thought that he was capable. \"I think at times he doesn't know what he doesn't know. And you see that especially in the negotiations to end the war in Ukraine, where you see him go into a meeting with Vladimir Putin and come out spouting Russian propaganda… I think he would benefit from a little diplomatic savvy and some experienced diplomats around him.\" He continued: \"But I do think it's extremely important that when people sit down with an envoy of the United States they know that that envoy speaks for the President of the United States and it is very clear that Witkoff has that and that's an extremely valuable asset to bring to the table.\" On the months and years ahead under Mr Trump, Mr Miller said: \"The thing that worries me most is that Donald Trump may squander the position that the United States has built around the world over successive administrations of both parties over a course of decades. \"I don't think most Americans understand the benefits that they get to their daily lives by the United States being the indispensable nation in the world. \"The open question is: will the damage that he's doing be recoverable or not?\"","summary":"A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.&#160;","url":"https://news.sky.com/story/former-biden-official-matthew-miller-says-he-believes-israel-has-committed-war-crimes-in-gaza-13378081","image":"https://e3.365dm.com/25/06/2048x1152/skynews-state-department-matthew_6933044.jpg","video":null,"publish_date":"2025-06-02 08:58:00","author":"Mark Stone","authors":["Mark Stone"],"language":"en","category":"politics","source_country":"gb","sentiment":0.024},{"id":327230146,"title":"Did Tom Cruise testify in Diddy's trial? Viral courtroom video claim debunked ","text":"Recently, a rumor surfaced that Hollywood actor and film producer Tom Cruise testified at Sean “Diddy” Combs' federal trial, which has been going on in Manhattan, New York City, since May 5, 2025. The claim first emerged on the Black Is Best YouTube channel on June 1, 2025, with the caption:“1 MINUTE AGO: Tom Cruise Testifies In Court On Day 15 Of Diddy Trial.”The video description mentioned that the Mission: Impossible actor wasn’t on the witness stand to “promote a film” but rather to “expose a nightmare.”“Cruise began his testimony with a line that chilled the entire gallery: ‘I joined Scientology to escape Diddy.’ The room fell into stunned silence. For years, the world speculated on Cruise’s connection to the Church of Scientology — but no one had ever heard him connect it to Sean “Diddy” Combs,” the description added.The post garnered significant traction and earned over 100,000 views at the time of writing. Nonetheless, the now-viral courtroom video claim is false. Tom Cruise has not taken the witness stand at the Diddy trial, nor has he ever blamed the rapper for his connection to Scientology or any form of psychological or spiritual manipulation.According to an ABC News report dated June 1, 2025, Tom Cruise’s name does not appear on the list of those who have testified in the Combs’ trial to date.What further discredits the video is the disclaimer in the description.“This content is fictional and intended for entertainment purposes only. No verified court evidence or official statements confirm these claims,” it read.It is important to note that there is no known connection between Tom Cruise and Diddy’s alleged criminal activities. As of this writing, the actor has not been mentioned in the trial.Tom Cruise did not take the witness stand at the Diddy trialThe latest YouTube video from the Black Is Best channel about Tom Cruise’s alleged testimony at the Diddy trial presents a false narrative.For instance, the video claims that the Top Gun actor accused Sean Combs of forcing him into a sexual relationship. This is also evident from the thumbnail, which featured the text: “Breaking News: I Got Pinned and F**ked.” It also included computer-generated images of the duo.Additionally, contrary to what the video claims, Tom Cruise was not under oath in the federal courtroom on day 15 of the trial, or May 28, 2025. Instead, day 15 had Cassie Ventura’s friend and celebrity stylist Deonte Nash, along with LAPD officer Christopher Ignacio, take the witness stand.A look at Black Is Best bio disclaimer. (Image via YouTube)The video and its description made other fictional and fabricated claims, such as:“Cruise claimed that long before his public affiliation with Scientology, he was introduced to Diddy at a secluded Hollywood estate during what he called a ‘Celebrity Awakening Weekend.’ The weekend quickly turned into something Cruise would never forget — and never be able to fully explain.“‘There were no phones. No cameras. Just contracts. Candles. And tomato soup,’ Cruise said, his jaw tight, his voice low. According to his testimony, Diddy hosted private sessions where A-list stars were submerged in boiling-hot tomato soup baths, forced to chant cryptic phrases in unison while Diddy paced the room,” it added.According to the video description, Cruise testified that he was accompanied by other celebrities during these “disturbing ceremonies,” including Jim Carrey and Steve Harvey.“What made the testimony more harrowing was Cruise’s detailed account of the psychological tactics used. He described being kept awake for 72 hours while Diddy whispered what he called ‘mind hacks’ — phrases repeated so often they started to replace his own thoughts,” it continued.According to the video description, Tom testified that he was in an “energetic exile” and that doing stunts in action movies was his way to “distract myself from the reality that Diddy was the one pulling strings I couldn’t see.” The video also claimed that the actor spoke about The Reflection Room in Diddy’s Los Angeles home, “where celebrities were made to stare at their own reflections while wearing ceremonial robes.”Calling these physical, psychological, and spiritual torture, the Black Is Best video claimed Tom Hanks and Prince were among others who were victimized by Diddy, according to Tom Cruise. The 28-minute-long clip further alleged that when Cruise tried to escape, the rapper confronted him.The video concluded by claiming that Tom Cruise testified about being the victim of \"spiritual domination, ritualistic baths, psychological submission, and the unthinkable control Diddy allegedly held over one of Hollywood’s most powerful men.\"Black Is Best channel has posted other clickbait videos such as the one about Tom Cruise. (Image via YouTube)There is no credible source or evidence to support such claims. Instead, there are repeated warnings about parodical content meant for virality and sensationalism. For instance, the video begins with a disclaimer that says:“Viewer discretion is strongly advised. The following is for educational and entertainment purposes only.”Additionally, the description included the words “altered or synthetic content,” further stating that “Sound or visuals were significantly edited or digitally generated.\"Similarly, the bio of the Black Is Best channel contains a disclaimer, stating that its content \"may contain gossip-based information, rumors, or exaggerated portrayals of reality.\"“Please exercise your own discretion while watching, and remember that not all information presented may be factual or verified,” it reads, further refuting the claims.Another inconsistency in the video came with the sentence,“This is the official courtroom testimony from day 15 of the Sean Diddy Combs trial as reported by Inner City Press.”However, Inner City Press, which has been extensively covering the trial, has not reported on any alleged testimony by Tom Cruise. Instead, the United Nations-backed investigative journalism group has been focusing on actual testimonies from witnesses, including Cassie Ventura, Regina Ventura, Dawn Richard, David James, Mia, Capricorn Clark, and Kid Cudi, among other former associates and employees of the defendant.Black Is Best has posted other similar misleading videos about non-existent testimonies from the trial, including those of Brad Pitt, Dwayne Johnson, Tom Cruise, Eddie Murphy, Adam Sandler, Kamala Harris, and Christopher Walken, among others. All of these claims could be viewed as satires.Fact-checking websites like Snopes have refuted many of these claims, citing AI-detection tools that have found inconsistencies throughout the scripts and voice narrations of the videos.As of this writing, there are no official or confirmed reports suggesting that Tom Cruise will testify at the trial, nor has his name been mentioned during the proceedings. The actor hasn’t addressed the rumor and has also not commented on Sean Combs’ sex trafficking trial. Meanwhile, TMZ founder Harvey Levin told Fox News Digital that he heard from trusted sources about several celebrities who were worried about being called to testify and have “even lawyered up trying to fight that.” The trial is set to resume on Monday, June 2, 2025.","summary":"Recently, a rumor surfaced that Hollywood actor and film producer Tom Cruise testified at Sean “Diddy” Combs&#039; federal trial, which has been going on in Manhattan, New York City, since May 5, 2025.","url":"https://www.sportskeeda.com/us/music/did-tom-cruise-testify-diddy-s-trial-viral-courtroom-video-claim-debunked","image":"https://staticg.sportskeeda.com/editor/2025/06/fca0c-17488486938094-1920.jpg","video":null,"publish_date":"2025-06-02 08:24:00","author":"Pallavi Kanungo","authors":["Pallavi Kanungo"],"language":"en","source_country":"in","sentiment":-0.22},{"id":327260852,"title":"Harvard Chinese grad speech draws praise and ire","text":"A Chinese Harvard graduate's speech calling for unity in a divided world, delivered days after the US vowed to \"aggressively\" revoke Chinese students' visas, has sparked mixed reactions in the US and her home country.\n\n\"We don't rise by proving each other wrong. We rise by refusing to let one another go,\" Jiang Yurong said on Thursday, the same day a US federal judge blocked the Trump administration's ban on foreign students at Harvard.\n\nHer speech went viral on the Chinese internet, with some saying it moved them to tears. However, others said her elite background is not representative of Chinese students.\n\nIn the US, some have flagged her alleged links with the Chinese Communist Party.\n\nIn their efforts to restrict Harvard from enrolling foreign students, US authorities had accused the institution of \"co-ordinating with the Chinese Communist Party\".\n\nMs Jiang, who studied international development, was the first Chinese woman to speak at a Harvard graduation ceremony.\n\nIn her address, Ms Jiang emphasised the value of Harvard's international classrooms, noting how that taught her and her classmates to \"dance through each other's traditions\" and \"carry the weight of each other's worlds\".\n\n\"If we still believe in a shared future, let us not forget: those we label as enemies - they, too, are human. In seeing their humanity, we find our own,\" said Ms Jiang, who spent her final two years of school at Cardiff Sixth Form College in Wales before going to Duke University in the US for her undergraduate degree.\n\nA conservative X account, with the handle @amuse, criticised Harvard for choosing a graduation speaker who is \"a representative of a CCP-funded and monitored non-government organisation\", alleging that her father works for a non-government organisation that \"serves as a quasi-diplomatic agent for the [party]\".\n\nThe account, which has 639,000 followers, has previously posted pro-Donald Trump content, such as the US leader fighting Darth Vader and sexualised imagery of former Vice-President Kamala Harris.\n\nSome Chinese social media users, on the other hand, allege that the organisation Ms Jiang's father works for is backed by prominent American companies and foundations.\n\nThe BBC has not independently verified these allegations.\n\n\"This is why she could get a scholarship to go to the UK for high school, and later also to Harvard,\" wrote a user on China's X-like platform, Weibo.\n\nOthers called for her to stay on in the US, with comments that reeked with sarcasm. \"Such talent should be left to the United States,\" one wrote. \"I hope she will continue to glow abroad and stay away from us!\" read another.\n\nBut Ms Jiang's vision of a \"shared humanity\" also struck a chord.\n\n\"That she is able to stand on an international stage and speak the heart of Chinese students has moved me to tears,\" wrote a user on Red Note, another Chinese social media platform.\n\nAnother user defended Jiang by hitting back at those who criticised her: \"You may not have changed them, but they've heard you... As more and more people speak out like you, you will eventually move and change others.\"\n\nThere are around 6,800 international students at Harvard, who make up more than 27% of its enrolments in the past academic year.\n\nAbout a third of these foreign students are from China, and more than 700 are Indian.","url":"https://www.yahoo.com/news/harvard-chinese-grad-speech-draws-054936271.html","image":"https://s.yimg.com/ny/api/res/1.2/UpwnmyQCeoK5uIWXrjgULA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD02OTk-/https://media.zenfs.com/en/bbc_us_articles_995/b39dcf5dd883d70bd89e5edb82a94be4","video":null,"publish_date":"2025-06-02 05:49:36","author":null,"language":"en","source_country":"us","sentiment":-0.054},{"id":327193418,"title":"Harvard Chinese grad speech draws praise and ire","text":"In their efforts to restrict Harvard from enrolling foreign students, US authorities had accused the institution of \"co-ordinating with the Chinese Communist Party\". \n\nMs Jiang, who studied international development, was the first Chinese woman to speak at a Harvard graduation ceremony.\n\nIn her address, Ms Jiang emphasised the value of Harvard's international classrooms, noting how that taught her and her classmates to \"dance through each other's traditions\" and \"carry the weight of each other's worlds\". \n\n\"If we still believe in a shared future, let us not forget: those we label as enemies - they, too, are human. In seeing their humanity, we find our own,\" said Ms Jiang, who spent her final two years of school at Cardiff Sixth Form College in Wales before going to Duke University in the US for her undergraduate degree. \n\nA conservative X account, with the handle @amuse, criticised Harvard for choosing a graduation speaker who is \"a representative of a CCP-funded and monitored non-government organisation\", alleging that her father works for a non-government organisation that \"serves as a quasi-diplomatic agent for the [party]\". \n\nThe account, which has 639,000 followers, has previously posted pro-Donald Trump content, such as the US leader fighting Darth Vader and sexualised imagery of former Vice-President Kamala Harris.\n\nSome Chinese social media users, on the other hand, allege that the organisation Ms Jiang's father works for is backed by prominent American companies and foundations.\n\nThe BBC has not independently verified these allegations. \n\n\"This is why she could get a scholarship to go to the UK for high school, and later also to Harvard,\" wrote a user on China's X-like platform, Weibo. \n\nOthers called for her to stay on in the US, with comments that reeked with sarcasm. \"Such talent should be left to the United States,\" one wrote. \"I hope she will continue to glow abroad and stay away from us!\" read another.\n\nBut Ms Jiang's vision of a \"shared humanity\" also struck a chord.\n\n\"That she is able to stand on an international stage and speak the heart of Chinese students has moved me to tears,\" wrote a user on Red Note, another Chinese social media platform.\n\nAnother user defended Jiang by hitting back at those who criticised her: \"You may not have changed them, but they've heard you... As more and more people speak out like you, you will eventually move and change others.\"\n\nThere are around 6,800 international students at Harvard, who make up more than 27% of its enrolments in the past academic year. \n\nAbout a third of these foreign students are from China, and more than 700 are Indian.","summary":"Jiang Yurong, the first Chinese woman to speak at a Harvard graduation ceremony, called for global unity.","url":"https://www.bbc.com/news/articles/c787xv2xy1zo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/8510/live/12880830-3f6f-11f0-a6ce-4370c7538a59.jpg","video":null,"publish_date":"2025-06-02 05:49:32","author":"Kelly Ng","authors":["Kelly Ng"],"language":"en","source_country":"GB","sentiment":-0.009}]}