{"offset":0,"number":50,"available":584,"news":[{"id":347649120,"title":"CNN data guru says Democrats are 'messier than a hoarder's basement,' party's image is 'garbage'","text":"CNN senior political data reporter Harry Enten marveled on Friday at how the Democratic Party has not only failed to find a new leader, but continues to disappoint voters. CNN News Central host Kate Bolduan spoke about former Vice President Kamala Harris breaking her recent silence by speaking in a lengthy interview with late-night host Stephen Colbert, Thursday. Bolduan observed that Harris spoke about her choice not to run for the governorship of California and left the door open for another presidential run in 2028. But Enten argued the Democrats’ search for a new leader is long from over, suggesting the party remains \"historically divided\" over the proper path forward to the point that they are \"messier than a hoarder’s basement.\" KAMALA HARRIS REFUSES TO SAY WHO'S LEADING DEMOCRATIC PARTY WHEN PRESSED BY COLBERT \"The water is quite warm. If you‘re a Democrat potentially thinking about running in 2028, jump right in, because at this point there is no frontrunner,\" Enten said. \"One of the reasons why there is no frontrunner,\" he said, \"Nobody wants to put anybody up at the top of their ballot list because, at this particular point, the Democratic brand is in the basement.\" He continued by citing three very similar polls, suggesting the Democratic Party is perceived as \"total and complete garbage in the mind of the American public. The Democratic Party‘s net favorable rating, record lows in all three. Wall Street Journal, 30 points underwater. CNN, 26 points underwater. Gallup, 26 points underwater.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP But the driving force for those polls, he claimed, comes from within the Democratic base itself. \"That is being driven in large part by discontent within the Democratic base. The Democratic base wants something different,\" he said. \"We‘ll ultimately end up seeing who they choose. It will be quite the thing who ultimately gets the rose.\"","summary":"A CNN data reporter highlighted the Democratic Party&apos;s historic divisions and basement-level approval ratings as members search for new direction after election defeat.","url":"https://www.foxnews.com/media/cnn-data-guru-says-democrats-messier-than-hoarders-basement-partys-image-garbage","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/05/biden-harris.jpg","video":"https://www.foxnews.com/video/6376471948112","publish_date":"2025-08-03 00:00:32","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.13},{"id":347632620,"title":"\"No different from saying the woman who was raped asked for it\"- Martina Navratilova slams basketball coach blaming Barack Obama for ‘dividing’ the US","text":"Martina Navratilova lashed out at the men's basketball team coach of Auburn University, Bruce Pearl, for his remarks on former US President Barack Obama. She was furious with Pearl's claims about Obama dividing the US and vehemently opposed to his statements, which the tennis legend claimed exuded 'racist' tones.Last month, Pearl, who has been coaching the Auburn Tigers since 2014, held the 44th President accountable for his donations to Hamas and blamed him for worsening the conflict in Gaza. During an interview on Don't @ Me with Dan Dakich on OutKick, Pearl touched on that topic and also elaborated on how Obama played a significant role in straining the race relations of the country. He said:\"Rather than uniting us as a country... he divided us! Everything was black and white... everything was [about] the obstacles that were against my players from being successful!\" (an excerpt).When a clip of making these remarks surfaced on X (formerly Twitter), enraged Navratilova stated that it was extremely low of Pearl to make such a comment and equated him to men who justify r*pe.\"This kind of logic is no different from men saying the woman who was r*ped asked for it because she wore a skirt…. Racists need to stop being racist, black people cannot do that for them,\" she posted.Martina Navratilova is her bold self on social media and doesn't hesitate to call people out on their controversial views. She even slammed Donald Trump for his 'racist' ideologies, and said the US remains a racist patriarchy after the latter became the President for the second time.Martina Navratilova condemns Donald Trump's presidencyMartina Navratilova, who endorsed Kamala Harris over Donald Trump in the 2024 Presidential elections, condemned the people's choice. The 18-time Grand Slam Champion thought that it was a 'criminal' act by the people of America, who elected Trump for his second term of presidency in the country, even after being aware of his policies and ideologies.In a post on X (formerly Twitter), the tennis legend launched a scathing remark after the result of the election was announced in November 2024.\"Well, Trump won. Fear and anger won. And a country that was born as a racist patriarchy proved beyond any reasonable doubt it still is a racist patriarchy. Not sure when this ceases to be true…\" she posted.Martina Navratilova @MartinaLINKWell, trump won. Fear and anger won. And a country that was born as a racist patriarchy proved beyond any reasonable doubt it still is a racist patriarchy. Not sure when this ceases to be true…She continues to show her disapproval of Trump and his policies on social media, and recently called him out on making inappropriate sexual remarks about his daughter, Ivanka Trump.","summary":"Martina Navratilova lashed out at the men's basketball team coach of Auburn University, Bruce Pearl, for his remarks on former US President Barack Obama.","url":"https://www.sportskeeda.com/tennis/news-no-different-saying-woman-raped-asked-it-martina-navratilova-slams-basketball-coach-blaming-barack-obama-dividing-us","image":"https://staticg.sportskeeda.com/editor/2025/08/720cc-17541670237548-1920.jpg","video":null,"publish_date":"2025-08-02 21:54:17","author":"Aatreyi Sarkar","authors":["Aatreyi Sarkar"],"language":"en","source_country":"in","sentiment":-0.321},{"id":347638586,"title":"Charlamagne tha God names surprising 2028 presidential suggestion","text":"Charlamagne tha God is known for making waves as a prominent talk show host — and is pushing for a fellow entertainer to run for president in 2028. The popular face of \"The Breakfast Club\" radio show suggested \"The Daily Show\" star Jon Stewart should run as the Democratic Party’s candidate in the 2028 presidential election during an appearance on \"My View with Lara Trump.\" \"This is going to sound ridiculous, probably, coming from me,\" he told Fox News host Lara Trump. \"I would love to see Jon Stewart run in 2028.\" CHARLAMAGNE SUGGESTS KAMALA HARRIS SHOULD START A PODCAST INSTEAD OF SEEKING ELECTED OFFICE AGAIN Charlamagne emphasized Democrats’ need for a \"change agent\" after former Vice President Kamala Harris’ loss to President Donald Trump in the 2024 presidential election, and that Stewart could help the party broaden its base. \"If we're talking about a change agent coming from the outside that's really going to shake things up, and somebody that I feel like can speak to all people… he’s a celebrity who actually knows what they're talking about,\" he said. \"We've seen him get legislation and stuff passed before — like, we know where his heart is.\" \"He'd be somebody I'd like to see really get in the race and disrupt things in 2028.\" Charlamagne suggested that \"The Late Show with Stephen Colbert\" host Stephen Colbert should run alongside Stewart on this hypothetical ticket, explaining that he’s \"not going to have a job.\" CBS revealed on July 17 that the show would be ending in May 2026, calling the plan to terminate it \"purely a financial decision against a challenging backdrop in late night,\" per a public statement. DEMOCRATS FAWN OVER STEPHEN COLBERT FOR HOLDING 'TRUTH TO POWER' AFTER CBS CANCELS SHOW Elsewhere in the wide-ranging interview, Charlamagne advised Democrats to look to their governors for other possible 2028 candidates, including Pennsylvania Gov. Josh Shapiro and Maryland Gov. Wes Moore. \"They actually have a track record, right?\" he said. \"You can go look at their states to see what they're probably going to end up doing on a national level.\" The headline-making personality also did not rule out a Republican candidate earning his vote in the next presidential election. He cited former South Carolina Gov. and former U.S. Amb. to the United Nations Nikki Haley as someone who he would consider supporting. \"Traditional conservatives are going to take the Republican Party back,\" he said in part. CHARLAMAGNE ACCUSES TRUMP OF TRYING TO 'MAKE AMERICA NORTH KOREA' BY ENGAGING IN 'AUTHORITARIAN RULE' ON MEDIA CLICK HERE TO GET THE FOX NEWS APP Charlamagne also reviewed Trump’s first six months in office, predicted Harris’ political future and discussed New York City mayoral candidate Zohran Mamdani's policy proposals and whether he agrees with socialism. Watch Fox News host Lara Trump's full interview with Charlamagne tha God on \"My View with Lara Trump\" on Saturday, Aug. 2, at 9 p.m. ET.","summary":"Charlamagne tha God suggests &quot;The Daily Show&quot; star Jon Stewart as a potential Democratic candidate for the 2028 presidential ticket, describing him as a &quot;change agent.&quot;","url":"https://www.foxnews.com/media/charlamagne-tha-god-names-surprising-2028-presidential-suggestion","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/charlamagne-stewart-2028.png","video":"https://www.foxnews.com/video/6376495556112","publish_date":"2025-08-02 21:39:35","author":"Benji Ferraro","authors":["Benji Ferraro"],"language":"en","category":"politics","source_country":"us","sentiment":-0.037},{"id":347632486,"title":"‘The Big 5’ ideas the GOP congress needs to pass before midterms","text":"First, let me start by pointing out that President Donald Trump keeps having “the best week ever” every week!\n\nHow great are things going for President Trump nowadays?\n\n• Trump-hating HBO TV host Bill Maher is apologizing and admitting he was wrong about Trump’s tariffs.\n\n• Trump-hating New York Times columnist Bret Stephens admits Trump is having more success than he ever imagined possible.\n\n• Trump-hating liberal TV host Chris Cuomo just gave Trump a grade of “A” for the start of his presidency.\n\n• And CNBC’s liberal TV host Jim Cramer was so shocked when he heard about Trump’s trillion-dollar EU trade victory that he dropped the F-bomb on live television.\n\nThings are that good!\n\nTrump has now blown by Ronald Reagan to become the most successful and consequential conservative president of all-time.\n\nBut as wonderful and fantastic as all this Trump success is, it won’t guarantee GOP control of the U.S. government for years to come – simply because Democrats cheat, rig and steal elections.\n\nIf Trump wants to be remembered as the greatest president ever, and the president who made America great again, he needs to set the GOP up to win for years to come, if not decades to come, and make his achievements permanent, and his legacy lasting. Here is the way to do it:\n\n1. Pass voter photo ID for all federal elections\n\nThis is how the ball was dropped the last time Trump was president. The GOP Congress had the ability to pass anything they wanted from 2016 to 2018. Yet they never passed voter photo ID for all federal elections. That was the missed opportunity of a lifetime.\n\nThat was why the GOP lost the midterms in 2018 and then Trump lost the 2020 presidential election. Democrats stole both elections with mail-in ballots, ballot harvesting and ballot drop boxes. They beat us with fake ballots, all built around no voter ID.\n\nAnd so far, the GOP is repeating the same mistake. This GOP Congress can pass anything it wants for another 18 months.\n\nIf voter photo ID isn’t passed before the 2026 midterms, then the GOP has no interest in winning elections. Period.\n\n2. Pass census reform that permanently bans the counting of non-citizens\n\nThis is another way Democrats are stealing elections. They count millions of illegal aliens for the census, thereby awarding dozens of extra congressional seats and electoral votes to blue districts and blue states – all based on counting people who illegally broke into our country, and don’t belong here.\n\nThis is how Democrats are stealing elections, stealing billions in federal funding, and stealing our entire country.\n\nNot only should we be banning illegals from being counted for the census, but President Trump should immediately order a new census because the current one is a complete fraud based on counting noncitizens. With a new census, based only on a count of U.S. citizens, Democrats would lose 30 to 50 U.S. House seats and dozens of electoral votes.\n\n3. Demand proof of citizenship for voting in federal elections\n\nYes, Trump already issued an executive order for this, but executive orders only last as long as the GOP controls the White House. If the next president is a crazy, radical communist like Barack Obama or Kamala Harris, or a brain-dead puppet like Joe Biden (who is controlled by crazy, radical communists), all of Trump’s EOs are reversed.\n\nBut presidents can’t reverse a law passed by Congress.\n\nWhy would the GOP Congress hesitate to pass this law banning noncitizens from voting? This is the way to stop massive Democrat voter fraud that steals seats from the GOP.\n\nRight now, with control of both Houses of Congress, the GOP can pass this law. But if we lose the midterms, the opportunity is gone forever. And of course, passing this law and voter ID is the way to guarantee we win the midterms.\n\n4. Prosecute Obama, Hillary, Brennan, Clapper, Comey, McCabe and all other key figures for treason, for their roles in Russiagate (and George Soros for funding it all)\n\nThis was treason. We don’t have a nation of laws moving forward if any politician can commit treason and be given a free pass. All 77 million Trump voters demand justice. You want to excite and motivate all 77 million Trump voters to come to the polls for the midterms? Indict Obama and Hillary Clinton and watch the greatest GOP landslide victory ever.\n\n5. Pass President Trump’s campaign pledge of “No tax on Social Security for seniors”\n\nThis idea was my creation. I’ve been fighting for it, and lobbying for it, and shouting from the highest mountaintops for it, for a decade. I wrote about it in the spring of 2024, sent it to President Trump, and Trump adopted it during his presidential campaign.\n\nThe Big Beautiful Bill included a new $6,000 tax deduction for seniors, but it’s not a replacement for “No Tax on Social Security for Seniors.” Congress could not include this idea in the “Big Beautiful Bill” – because, by law, there can be no changes to Social Security in a reconciliation bill.\n\nThere are over 60 million seniors in America. Seniors vote in the highest percentage of any group in America. If the GOP wants to win elections, pass this law before the midterms. The GOP will lock up the senior vote for decades to come.\n\nThose are my “Big 5” that will result in not only GOP landslides in 2026 and 2028 but permanent GOP majority control of the United States federal government.\n\nPresident Trump has checked a record number of boxes, but this, my friends, is a checkmate.","summary":"Plan will 'crush Democrats, achieve permanent majority control'","url":"https://www.wnd.com/2025/08/big-5-ideas-gop-congress-needs-pass-between/","image":"https://www.wnd.com/wp-content/uploads/2025/07/donald-trump-reading-savoring-smiling-happy.jpg","video":null,"publish_date":"2025-08-02 21:24:39","author":"Wayne Allyn Root","authors":["Wayne Allyn Root"],"language":"en","category":"politics","source_country":"us","sentiment":-0.37},{"id":347633028,"title":"Ex-Trump prosecutor Jack Smith under investigation for alleged illegal political activity; here’s what you need to know","text":"APFILE - Special counsel Jack Smith speaks to the media about an indictment of former President Donald Trump, Aug. 1, 2023, at an office of the Department of Justice in Washington. (AP Photo/J. Scott Applewhite, File)\n\nJack Smith, the former special counsel who investigated then-candidate Donald Trump before his reelection to a second term, is now being investigated by federal officials. Following the reports by other news organizations, the investigation was confirmed on Saturday (August 2, 2025) by the Office of Special Counsel, an independent federal agency.Smith was named special counsel to investigate Trump by then-Attorney General Merrick Garland in November 2022.Trump and his Republican allies, including Sen. Tom Cotton, have, without offering evidence of wrongdoing, accused Smith of violating the Hatch Act, a federal law that bans certain public officials from engaging in political activity.Smith prosecuted two federal cases against TrumpSmith prosecuted two federal cases against Republican candidate Trump in the lead-up to the November 2024 presidential election. Smith ultimately dropped the cases; neither one had gone to trial after Trump was reelected, which would have shielded him from prosecution according to longstanding Justice Department practice. Smith then subsequently resigned as special counsel.Live EventsCotton, R-Ark., on Wednesday asked the Office of Special Counsel to investigate Smith, alleging that his conduct was designed to help then-President Joe Biden and his vice president, Kamala Harris, both Democrats. Biden had dropped his bid for reelection following his disastrous performance in a campaign debate against Trump and tapped Harris to succeed him on the ticket. Trump won the election and returned to the White House for a second term. The New York Post was first to report on the investigation into Smith.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onJack SmithDonald TrumpOffice of Special CounselHatch Actspecial counsel investigation\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onJack SmithDonald TrumpOffice of Special CounselHatch Actspecial counsel investigation(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Former special counsel Jack Smith, who previously investigated Donald Trump, is now under investigation himself by the Office of Special Counsel. The probe was initiated following accusations from Republican allies, including Senator Tom Cotton, alleging Smith violated the Hatch Act. These accusations suggest Smith's actions were politically motivated to aid the Democratic ticket before Trump's reelection.","url":"https://economictimes.indiatimes.com/news/international/us/ex-trump-prosecutor-jack-smith-under-investigation-for-alleged-illegal-political-activity-heres-what-you-need-to-know/articleshow/123068483.cms","image":"https://img.etimg.com/thumb/msid-123068489,width-1200,height-630,imgsize-81884,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-02 21:08:42","author":"Jack Smith","authors":["Jack Smith"],"language":"en","category":"politics","source_country":"in","sentiment":-0.181},{"id":347630392,"title":"Stephen A. Smith hits back at Michelle Obama, ‘still … salty’ at her Trump vote comments","text":"Stephen A. Smith has hit back at Michelle Obama.\n\nThe former First Lady took a jab at Smith’s employer, ESPN, name-dropping the longtime host and saying the network’s shows were like watching reality television, namely “The Real Housewives of Atlanta.”\n\n“It’s all a sociological study. They think that sports is better reality TV, I’m like, ‘It’s the same thing.’ If I listen to ESPN for an hour, it’s like watching the ‘Real Housewives of Atlanta,’ you know?” Obama said on her brother Craig’s “IMO” podcast. “It’s the same drama, and they’re yelling at each other, and they don’t get along, you know? I mean, Stephen A. Smith, he’s just like every other. . . .\n\n“So, that’s why I’m like, ‘what’s the difference?’ It’s just, you know, it’s just sociological drama,” added Obama. “I mean, the fact that people over seasons of working still can’t get along. They still have the same arguments, you know, and it’s not just women. But this happens in sports, too. I find it fascinating.”\n\nThose comments found their way to Smith himself, and he used them as an opportunity not necessarily to respond back, but voice his opinion on one of her strategies while campaigning for Kamala Harris last year.\n\n“When you were campaigning on behalf of the former Vice President Kamala Harris … you said a vote for [President Donald] Trump was a vote against you and a vote against y’all as women. I want to say for the record – I took major offense to that.” Smith admitted.\n\n“I think to this day is the only thing that I didn’t like that you said, I didn’t appreciate it. Because there’s so many things that go into deciding where your vote is going to go. For some people, it’s all about the economy. For others, it’s all about national security. \n\n“For some people, it is immigration. For some people, it’s safety in the streets of America. Long before they think about pro-choice or pro-life.”\n\nSmith reiterated that he voted for Harris and “wouldn’t vote for Trump,” but “wasn’t excited” how casting his vote for the former vice president “particularly after I heard about some of the shenanigans that the Democratic Party was engaging in leading up to the election. \n\n“But I’m talking specifically to you, Madam First Lady. You are not just beloved, you are revered. You are sensational in so many ways. I’ve been on the record on this show and many others stating had you run for president, you would have beat Trump. I still believe that … I believe if your husband elected to come back, he would beat Trump. That’s my personal belief . . .” Smith continued.\n\nSmith then got into Obama’s comments about ESPN, saying he disagreed with those as well.\n\n“So this doesn’t have anything to do with what you were talking about, how sports and reality TV mirror one another, even though we would beg to differ. Because a lot of things on reality TV are made-up situations and scenarios to provoke reactions and all of that stuff. \n\n“We’re at sports, that’s live entertainment, and you’re actually competing against one another is big time. No, reality TV is not like that. You’re so wrong about that, about that assertion, but that’s neither here nor there. . . .\n\n“You will never hear me utter a negative word about you, but I respectfully disagreed and still remain pretty salty about what you said about us,” Smith said, adding that he felt Obama “sort of blackmail[ed] us emotionally into trying to compel us to vote one way or another.”\n\nPerhaps we may get another episode of this apparent Obama-Smith beef.","summary":"'I think to this day is the only thing that I didn’t like that you said, I didn’t appreciate it.'","url":"https://nypost.com/2025/08/02/media/stephen-a-smith-hits-back-at-michelle-obama-still-salty-at-her-trump-vote-comments/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/109136787.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2025-08-02 21:08:32","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"zm","sentiment":-0.206},{"id":347628224,"title":"Authorities investigating ex-Trump prosecutor Jack Smith for alleged illegal political activity","text":"BRIDGEWATER, N.J. -- Federal officials have opened an investigation into Jack Smith, the former special counsel who investigated then-candidate Donald Trump before his reelection, for alleged illegal political activity.\n\nThe Office of Special Counsel, an independent federal agency, on Saturday confirmed the investigation after reporting by other news organizations. Smith was named special counsel to investigate Trump by then-Attorney General Merrick Garland in November 2022.\n\nTrump and his Republican allies, including Sen. Tom Cotton, have - without offering evidence of wrongdoing- accused Smith of violating the Hatch Act, a federal law that bans certain public officials from engaging in political activity.\n\nSmith prosecuted two federal cases against Republican candidate Trump in the lead-up to the November 2024 presidential election. Smith ultimately dropped the cases - neither one had gone to trial - after Trump was reelected, which would have shielded him from prosecution according to longstanding Justice Department practice. Smith then subsequently resigned as special counsel.\n\nCotton, R-Ark., on Wednesday asked the Office of Special Counsel to investigate Smith, alleging that his conduct was designed to help then-President Joe Biden and his vice president, Kamala Harris, both Democrats. Biden had dropped his own bid for reelection following his disastrous performance in a campaign debate against Trump and tapped Harris to succeed him on the ticket.\n\nTrump won the election.\n\nThe White House had no immediate comment on the investigation.\n\nThe New York Post was first to report on the investigation into Smith.","summary":"Federal officials have opened an investigation into Jack Smith, the former special counsel who investigated then-candidate Donald Trump before his reelection, for alleged illegal political activity.","url":"https://abc7.com/post/federal-authorities-open-investigation-former-trump-prosecutor-jack-smith-alleged-illegal-political-activity/17407170/","image":"https://cdn.abcotvs.com/dip/images/17407176_AP25007484959969.jpg?w=1600","video":null,"publish_date":"2025-08-02 20:39:52","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.299},{"id":347629484,"title":"Stephen A. Smith hits back at Michelle Obama, 'still ... salty' at her Trump vote comments","text":"Stephen A. Smith has hit back at Michelle Obama. The former First Lady took a jab at Smith's employer, ESPN, name-dropping the longtime host and saying the network's shows were like watching reality television, namely \"The Real Housewives of Atlanta.\" \"It’s all a sociological study. They think that sports is better reality TV, I’m like, ‘It’s the same thing.' If I listen to ESPN for an hour, it’s like watching the ‘Real Housewives of Atlanta,’ you know?\" Obama said on her brother Craig's \"IMO\" podcast. \"It’s the same drama, and they’re yelling at each other, and they don’t get along, you know? I mean, Stephen A. Smith, he’s just like every other. . . . CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"So, that’s why I’m like, ‘what’s the difference?’ It’s just, you know, it’s just sociological drama,\" added Obama. \"I mean, the fact that people over seasons of working still can’t get along. They still have the same arguments, you know, and it’s not just women. But this happens in sports, too. I find it fascinating.\" Those comments found their way to Smith himself, and he used them as an opportunity not necessarily to respond back, but voice his opinion on one of her strategies while campaigning for Kamala Harris last year. \"When you were campaigning on behalf of the former Vice President Kamala Harris … you said a vote for [President Donald] Trump was a vote against you and a vote against y’all as women. I want to say for the record - I took major offense to that.\" Smith admitted. \"I think to this day is the only thing that I didn’t like that you said, I didn’t appreciate it. Because there’s so many things that go into deciding where your vote is going to go. For some people, it’s all about the economy. For others, it’s all about national security. For some people, it is immigration. For some people, it’s safety in the streets of America. Long before they think about pro-choice or pro-life.\" ANGEL REESE JOKINGLY BLAMES TEAMMATE OF CAITLIN CLARK, SOPHIE CUNNINGHAM FOR SEX TOY FIASCO: 'GETTING WEIRD' Smith reiterated that he voted for Harris and \"wouldn't vote for Trump,\" but \"wasn't excited\" how casting his vote for the former vice president \"particularly after I heard about some of the shenanigans that the Democratic Party was engaging in leading up to the election. \"But I’m talking specifically to you, Madam First Lady. You are not just beloved, you are revered. You are sensational in so many ways. I’ve been on the record on this show and many others stating had you run for president, you would have beat Trump. I still believe that … I believe if your husband elected to come back, he would beat Trump. That’s my personal belief . . .\" Smith continued. Smith then got into Obama's comments about ESPN, saying he disagreed with those as well. \"So this doesn’t have anything to do with what you were talking about, how sports and reality TV mirror one another, even though we would beg to differ. Because a lot of things on reality TV are made-up situations and scenarios to provoke reactions and all of that stuff. We’re at sports, that’s live entertainment, and you’re actually competing against one another is big time. No, reality TV is not like that. You’re so wrong about that, about that assertion, but that’s neither here nor there. . . . \"You will never hear me utter a negative word about you, but I respectfully disagreed and still remain pretty salty about what you said about us,\" Smith said, adding that he felt Obama \"sort of blackmail[ed] us emotionally into trying to compel us to vote one way or another.\" CLICK HERE TO GET THE FOX NEWS APP Perhaps we may get another episode of this apparent Obama-Smith beef. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Stephen A. Smith fired back at Michelle Obama after she likened ESPN shows to Real Housewives, calling her past political comments offensive and unfair.","url":"https://www.foxnews.com/sports/stephen-a-smith-hits-back-michelle-obama-still-salty-her-trump-vote-comments","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/stephen-a-smith-michelle-obama.jpg","video":"https://www.foxnews.com/video/6360647968112","publish_date":"2025-08-02 20:25:22","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"us","sentiment":-0.153},{"id":347632516,"title":"Jack Smith Faces Federal Investigation Over Trump Prosecutions","text":"The Office of Special Counsel (OSC), an independent federal agency, confirmed Saturday that it has opened an investigation into Jack Smith, the former special counsel who prosecuted federal cases against then-presidential candidate Donald Trump.The New York Post first reported about the investigation.The investigation centers on allegations that Smith violated the Hatch Act, a federal law prohibiting certain government officials from engaging in political activities while in office.Newsweek has reached out to the OSC and the White House via email on Saturday for comment.Why It MattersThis investigation represents a significant reversal of roles, with the former prosecutor now facing scrutiny for his own actions. The probe could set important precedents about the boundaries of special counsel operations and their potential political implications during election cycles.The Trump administration has pursued sweeping personnel changes across federal departments, particularly targeting those involved in investigating Trump.What To KnowSmith oversaw two major federal cases against Trump: one involving classified documents found at his Mar-a-Lago estate in Palm Beach, Florida, launched by then-Attorney General Merrick Garland and another related to Trump's alleged attempts to overturn the 2020 presidential election results.Last summer, Judge Aileen Cannon, a Trump appointee, dismissed the classified documents case on grounds that Smith was not properly appointed by Garland because he was not approved by the U.S. Senate.Smith also was investigating whether Trump criminally attempted to overturn the 2020 election results, including efforts to pressure then-Vice President Mike Pence to delay certification of the Electoral College vote on January 6, 2021.The probe examined Trump's role in promoting a false slate of electors and his involvement in the events leading to the U.S. Capitol riot, where his supporters stormed the building after he repeatedly, and without evidence, claimed the election had been \"stolen\" through widespread voter fraud.Garland has previously said politics didn't play a part in the handling of the two cases, which were dropped after Trump's November 2024 election victory, following longstanding Justice Department policy that sitting presidents cannot be prosecuted.Senator Tom Cotton, an Arkansas Republican, formally requested the investigation Wednesday, alleging that Smith's conduct was designed to help then-President Joe Biden and Vice President Kamala Harris, both Democrats, in their election efforts against Trump. Biden had dropped his own bid for reelection in July 2024 following his disastrous performance in a campaign debate against Trump and tapped Harris to succeed him on the ticket. Trump ultimately won the election.The Hatch Act, enacted in 1939, restricts federal employees from using their official positions to influence elections. Violations can result in removal from office, suspension, or other disciplinary measures. The OSC, separate from the Justice Department's special counsel positions, investigates such violations but has no criminal enforcement power. However, it can impose fines and other sanctions for violations.Meanwhile, Attorney General Pam Bondi has fired over 20 Department of Justice employees who worked with Smith on the Trump investigations, according to Reuters. Some of the terminated employees were identified by Bondi's \"Weaponization Working Group,\" which evaluates activities of Smith and affiliates for potential \"weaponization\" of the legal system.Smith resigned from his position following Trump's election victory and the dismissal of the federal cases. Neither case had proceeded to trial before being dropped.What People Are SayingThe official X account of the House Judiciary Democrats posted on July 11: \"Judiciary Democrats are demanding AG Bondi release the full Jack Smith report and all Epstein files referencing Donald Trump because DOJ's job is to investigate and prosecute crimes—not cover them up to protect Trump-world.\"Tom Renz, an attorney and author, posted on X on July 12: \"Bondi firing people from the Jack Smith trial and J6 cases is absolutely an embarrassing act of CYA. She's had months to do ANYTHING real and all she's done is delay and cover for elite p*dos. Too late... unless she drops criminal charges against Pfizer, Gates, Soros, and the Dems behind J6 tomorrow and admits she looted about everything Epstein it's all just theater.\"Democratic strategist Adam Parkhomenko posted on X on Saturday: \"So let me get this straight: Jack Smith investigates a guy who tried to overturn an election and incited an insurrection… and he's the one being investigated? We're not a serious country. We're a banana republic with better branding…but that's going to s***, too.\"What Happens Next?The OSC will examine whether Smith's actions violated Hatch Act provisions during his tenure as special counsel. The investigation could take several months to complete, depending on the complexity of evidence reviewed and witness interviews conducted.Update 8/2/25, 5:37 p.m. ET: This article has been updated with additional information.This article includes reporting by The Associated Press.","summary":"The Office of Special Counsel confirmed on Saturday that it has opened an investigation into the former special counsel.","url":"https://www.newsweek.com/jack-smith-faces-federal-investigation-over-trump-prosecutions-2108066","image":"https://d.newsweek.com/en/full/2695498/jack-smith.jpg?w=1600&h=900&q=88&f=db649d1e1fe90b6922c886a4bbe75154","video":null,"publish_date":"2025-08-02 20:16:16","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"politics","source_country":"us","sentiment":-0.276},{"id":347628386,"title":"'No obvious frontrunner.' Why Harris' exit has scrambled the race for California governor","text":"For months, candidates in the race to become California's next governor had waited for a pivotal question to be settled: Will former Vice President Kamala Harris run or not? With Harris' announcement this week that she's out, a new question arose: Who's the front-runner now? Because of Harris' star power, the answer is far from simple. For months, other candidates saw their campaign planning and fundraising undercut by the possibility she would run, meaning the race got a big reset seconds after Harris made her announcement Wednesday. Some political observers give the nod to former U.S. Rep. Katie Porter, who appears to have a small leg up over her opponents. Porter was the only Democrat to receive double-digit support in multiple polls when Harris was not included in the field. A prodigious fundraiser while she was in Congress representing an Orange County district, Porter reported a strong infusion of cash in the months after launching her campaign in March, and said she raised $250,000 in the 36 hours after Harris' announcement. \"The enthusiasm we're seeing from donors at every level shows that Californians know how critical this race is,\" Porter said in an email blast. Other candidates — including Xavier Becerra, U.S. Secretary of Health and Human Services in the Biden administration and a former California attorney general — have also tried to assert that, with Harris out, they are moving up. \"BECERRA CAMPAIGN BUILDING MOMENTUM IN ‘WIDE OPEN’ RACE,\" read the subject line of an email sent Friday by the Becerra campaign, saying he is \"well-positioned to unite a broad swath of voters around his plans to make health care and housing less expensive and more accessible.\" Outside observers, however, said that none of the candidates really stand out from the pack at the moment. \"That these remaining candidates are jockeying for bragging rights about who may be the front-runner — it's to be expected, but it's ludicrous,\" said Garry South, a veteran Democratic strategist who has worked on a number of past gubernatorial campaigns, including for former Gov. Gray Davis. \"With Harris opting out, there will likely be no obvious front-runner among the remainder of the current field for quite some time,\" South said. \"None of these candidates start out with statewide name recognition.\" With such a wide-open field, factors such as endorsements and communication strategies will be important to watch, experts said. So will the candidates' ability to raise money and use it to broaden their appeal. \"I would start spending money on social media, on television advertising, on every single platform I could find to build up my name ID,\" South said, but \"none of them have enough money to do that at the moment.\" With Harris out, will she back someone else? \"Obviously if she did endorse, that would be a big plus\" for whichever candidate she rallied behind, said John Pitney, a professor of politics at Claremont McKenna College. Harris has long relationships with several of the candidates in the race. A source familiar with her thinking told The Times after Harris bowed out that she was still considering whether and how to approach the governor’s race. Other endorsements could affect the race as well. Hours after Harris announced her decision, Rep. Nancy Pelosi (D-San Francisco), the influential former House Speaker, appeared on CNN to endorse Lt. Gov. Eleni Kounalakis, whom she has known for years. \"We have many great candidates, one in particular Eleni Tsakopoulos, whom I support,\" Pelosi said, referring to Kounalakis by her maiden name. Kounalakis' father, the wealthy developer Angelo Tsakopoulos, helped bankroll an independent expenditure committee supporting his daughter's 2018 campaign for lieutenant governor. Political observers are watching to see if he dumps money into a similar effort backing her gubernatorial campaign. Pitney said Pelosi's opinion \"would carry a lot more weight\" if she were still speaker. He said it \"isn't necessarily going to sway a large chunk of the electorate,\" but could be important if it sways Bay Area donors. A former GOP legislative aide and national party staffer who renounced his membership in the Republican Party the night Trump was elected in 2016, Pitney said that endorsements are far from a determining factor in today's political landscape. \"I hesitate to rule anybody out, because very often candidates seem to come out of nowhere — like Mamdani in New York City,\" he said, referring to the sudden rise and stunning upset primary win of 33-year-old democratic socialist Zohran Mamdani in the New York mayoral race. Pitney added that experience in government and administrative leadership also matters, but could also cut against candidates at a time when many voters are frustrated and want something new. For example, Antonio Villaraigosa, the former state Assembly speaker and L.A. mayor who is in his 70s, \"obviously has a long history, but that long history is both an advantage and a disadvantage,\" Pitney said. Villaraigosa has said his campaign is \"about the future.\" But voters \"may not regard him as a fresh face,\" Pitney said. None of the current candidates for governor have the same profile as Harris. In fact, they are broadly unknown to huge swaths of the electorate. That means they have their work cut out for them, Pitney and South said — namely in terms of fundraising. South said that there \"is no question that the Democratic donor base has basically been sitting on their haunches waiting to see what Harris is going to do.\" But, he said, he hasn't seen any sign yet that donors have picked a favorite candidate now that she's out, either — which is a problem for candidates with little or no name recognition. \"None of these candidates in the remaining field with Harris out have enough money in the bank to run a statewide campaign for governor,\" he said. South said that could change if Kounalakis gets another major infusion of cash from her father and once again taps her personal wealth. At the same time, there could also be a \"huge blowback\" from that sort of splashy family spending, South said, especially if Kounalakis' opponents pounced on it as distasteful. \"We have not tended in this state to elect moneyed people who try to buy the governor's race,\" he said. South said he is watching to see if big Bay Area donors decide to back Porter \"because of her profile as a progressive.\" Los Angeles developer and 2022 mayoral candidate Rick Caruso \"could be a force\" if he were to enter the race, Pitney said, because \"he has prominence in Southern California and also has a lot of money.\" The most recent fundraising reports, which were due Thursday night, shine a light on candidates' coffers — but only through the end of June, well before Harris dropped out. The Democrats who do not have the potential to self-fund their campaigns reported having millions of dollars in cash on hand as of June 30, including some who transferred money from prior campaign committees to their gubernatorial accounts. Former legislative leader Toni Atkins reported having $4.3 million in the campaign, while raising $648,000 and spending $549,000 in the first six months of this year. Villaraigosa raised $1.1 million and spent $550,000 this year, but reported $3.3 million cash on hand based on fundraising he did last year. Becerra had $2.1 million in the bank after raising $2.5 million and spending $449,000 in the first six months of the year. Porter reported raising $2.5 million and spending $449,000 since launching her campaign in March. She said she has $2.1 million in the bank. Unlike the other candidates, Porter's campaign revealed her fundraising because her filing on the state disclosure website didn’t show any dollar figures. Spokesman Nathan Click said her number of small-dollar donors crashed the state's system, and that they had been working with state officials to get the documents displayed on the secretary of state’s website all day Friday. He said most of Porter's 34,000 donors contributed less than $200 each. Riverside County Sheriff Chad Bianco reported raising $1.6 million and spending $609,000 this year, leaving him with $1 million in the bank. A few candidates reported mediocre fundraising numbers, but have personal wealth they can draw on. Kounalakis raised just over $100,000 and spent nearly three times as much during the first half of this year. She has more than $4.6 million on hand and millions more in her lieutenant governor campaign account, although some of that money can't be transferred because of campaign finance rules. Businessman Stephen J. Cloobeck, a Los Angeles Democrat, raised about $160,000 and spent $1.5 million — including more than $1 million on consultants. He had about $729,000 on hand at the end of the period. He also said he made a $10-million contribution Friday that he said \"turbocharged\" his campaign. \"One of my many advantages is that I’m not a politician and I am not compromised,\" Cloobeck said. Former Fox News host Steve Hilton, a Republican candidate, raised about $1.5 million, of which $200,000 was a personal loan. Hilton spent about $1 million and has a little less than $800,000 in the bank. At the lowest end of the fundraising were former state controller Betty Yee, who raised almost $238,000 and spent $255,000, with $637,000 on hand; and state schools superintendent Tony Thurmond, who raised about $70,000, spent about $180,000 and had almost $560,000 on hand. Both Yee and Thurmond told The Times last month that fundraising had slowed while Democratic donors waited on Harris to make a decision.","summary":"With Kamala Harris out of the California governor's race, other candidates are jockeying to be seen as the new front runner. Some analysts said that's \"ludicrous,\" and that no one stands out yet.","url":"https://www.latimes.com/politics/story/2025-08-02/kamala-harris-out-who-is-new-front-runner-california-governor","image":"https://ca-times.brightspotcdn.com/dims4/default/164eda5/2147483647/strip/false/crop/1400x900+0+0/resize/1400x900!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F47%2Ff4%2F1298244f4b1994bfd91890cd359a%2Fla-me-california-gover","video":null,"publish_date":"2025-08-02 19:37:44","author":"Kevin Rector,Laura J. Nelson,Seema Mehta","authors":["Kevin Rector","Laura J. Nelson","Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.226},{"id":347621312,"title":"Authorities investigating ex-Trump prosecutor Jack Smith for alleged illegal political activity","text":"BRIDGEWATER, N.J. (AP) — Federal officials have opened an investigation into Jack Smith, the former special counsel who investigated then-candidate Donald Trump before his reelection to a second term.\n\nThe Office of Special Counsel, an independent federal agency, on Saturday confirmed the investigation after reporting by other news organizations. Smith was named special counsel to investigate Trump in by then-Attorney General Merrick Garland in November 2022.\n\nTrump and his Republican allies, including Sen. Tom Cotton, have — without offering evidence of wrongdoing— accused Smith of violating the Hatch Act, a federal law that bans certain public officials from engaging in political activity.\n\nSmith prosecuted two federal cases against Republican candidate Trump in the lead-up to the November 2024 presidential election. Smith ultimately dropped the cases — neither one had gone to trial — after Trump was reelected, which would have shielded him from prosecution according to longstanding Justice Department practice. Smith then subsequently resigned as special counsel.\n\nCotton, R-Ark., on Wednesday asked the Office of Special Counsel to investigate Smith, alleging that his conduct was designed to help then-President Joe Biden and his vice president, Kamala Harris, both Democrats. Biden had dropped his own bid for reelection following his disastrous performance in a campaign debate against Trump and tapped Harris to succeed him on the ticket.\n\nTrump won the election.\n\nThe New York Post was first to report on the investigation into Smith.","summary":"BRIDGEWATER, N.J. (AP) — Federal officials have opened an investigation into Jack Smith, the former special counsel who investigated then-candidate Donald Trump before his reelection to a second term.","url":"https://www.thestar.com/news/world/united-states/authorities-investigating-ex-trump-prosecutor-jack-smith-for-alleged-illegal-political-activity/article_e02593c4-0240-55fd-98ce-dd780218f398.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/custom/image/f84403b8-7d76-11ee-9d02-a72a4951957f.png?resize=600%2C600","video":null,"publish_date":"2025-08-02 19:36:39","author":"Darlene Superville The Associated Press","authors":["Darlene Superville The Associated Press"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.297},{"id":347613576,"title":"Kamala Harris admits there are things she would've done differently in 2024, fails to elaborate","text":"Former Vice President Kamala Harris appeared on \"The Late Show\" on Thursday where she acknowledged that there were some things that she would have done differently in her 2024 bid for the presidency, but failed to elaborate on what she would have actually changed about her campaign. During her explanation of what she would have done differently in 2024, Harris reminded viewers to read her forthcoming book \"107 Days\" before going on a long-winded explanation of how great her team was during her campaign — without detailing what she would have actually changed. \"There are things I would do differently, and again, read the book,\" she told host Stephen Colbert. \"I just, I mean, the one thing I just have to say, and I've mentored a lot of people — have done that over my career. None of us achieves any success, it's certainly for me, without having an incredible team.\" KAMALA HARRIS REFUSES TO SAY WHO'S LEADING DEMOCRATIC PARTY WHEN PRESSED BY COLBERT Harris continued, praising her team for having \"left it all on the field,\" while stating that she doesn’t \"regret a day.\" \"This is a personal and candid perspective from me about what that experience was, but I had a team, many people who have been with me for years, who really were so invested and as I say… [they] left it all on the field and I don't regret a day of that,\" she told Colbert. Following these seemingly contradictory statements on whether she had any regrets about — or would have made any changes to — her 2024 campaign, Harris did not offer any further insight into the matter, and the topic of conversation promptly changed. KAMALA HARRIS TO PUBLISH BEHIND-THE-SCENES ACCOUNT OF FAILED 2024 CAMPAIGN Colbert asked Harris at what point she realized that she may have to be prepared to take over as the Democratic candidate, especially after former President Joe Biden's poor performance at the first presidential debate of 2024. CLICK HERE TO GET THE FOX NEWS APP \"Let me say something about Joe Biden. I have an incredible amount of respect for him and I think that the way that we should be thinking about where we are right now is to remember that we had a President of the United States who believed in the rule of law, who believed in the importance of aspiring to have integrity and to do the work on behalf of the people,\" she responded. \"And that's where I'll leave that.\" She acknowledged some people had urged her to be ready to step into his shoes in the aftermath of the debate but didn't go into details. After Biden dropped out last July, she quickly secured the Democratic nomination with no opposition.","summary":"Former Vice President Kamala Harris acknowledged her campaign regrets on &quot;The Late Show&quot; on Thursday but offered no details about what she would&apos;ve changed in her 2024 bid.","url":"https://www.foxnews.com/media/kamala-harris-admits-things-she-wouldve-done-differently-2024-fails-elaborate","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/stephen-colbert-kamala-harris.jpg","video":"https://www.foxnews.com/video/6376432467112","publish_date":"2025-08-02 19:00:32","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","source_country":"US","sentiment":-0.099},{"id":347622672,"title":"It's the summer of Trump and the world can't look away","text":"Returning to the US for the first time in four years, I found a country that didn't want to talk about politics, despite being in the eye of the Trump storm.\n\nWhen the seasons of Trumpism come to be revisited, the summer of 2025 will seem like an especially frenzied blur.\n\nHistory at its most haywire.\n\nDuring it, we witnessed President Donald J. Trump in full. The unpredictable commander-in-chief who ordered a quick, sharp strike on Iran's nuclear facilities. The America Firster who browbeat NATO allies into stumping up more money for their self-defence, thereby ratcheting up pressure on Australia to make equivalent GDP-share spending commitments. \n\nThe tough-talking protectionist, determined to up-end the terms of global commerce, who scored victories in the trade war by forcing the European Union and Japan to accept higher tariffs on their exports to America. The MAGA provocateur who imposed his policy of mass deportations on Los Angeles surely knowing it would spark a stand-off with California's Democratic Governor, Gavin Newsom, which is precisely what happened when he placed the California National Guard under his control and sent in US Marines.\n\nSummer brought his very own blockbuster, the passage of the \"One Big Beautiful Bill Act\" which rewarded the rich with tax cuts and punished the poor with cuts in Medicaid and what used to be called food stamps. Trump signed the centrepiece of his legislative agenda into law on July 4, the deadline he had set for lawmakers, and then delivered an address from the balcony of the White House, a pulpit his predecessors have generally not used for presidential addresses, partly because it seemed so kingly. There was a certain historical irony, then, in an Independence Day picnic on the White House lawn being transformed into a Trumpian pageant.\n\nThere have been dog days, too. When pressure from the MAGA base mounted for his Justice Department to release \"the Epstein files\", Trump the conspiracy mongerer became Trump the conspiracy denier as he implored his supporters to believe there had been no deep state cover-up after all around disgraced financier and convicted sex offender Jeffrey Epstein, a one-time close friend.\n\nWhen that strategy failed, he fabricated a new conspiracy, blaming Barack Obama, Joe Biden and \"Radical Left Democrats\" for conjuring up yet another plot to discredit him. \"Their new SCAM is what we will forever call the Jeffery Epstein Hoax,\" he hurrumphed on social media, \"and my PAST supporters have bought into this 'bullshit' hook, line, and sinker.\" Amidst the clammer to release the Epstein list, Trump had dusted off his enemies list.\n\nIn the latest twist, Trump told reporters he fell out with Epstein because his Palm Beach neighbour “stole” staff from his Mar-a-Lago country club, including Virginia Giuffre, who died by suicide in April this year. \n\nTrump is skilled at the art of the distraction, more so than the art of the deal. Shifting the media's gaze has become something of a political superpower. The president who promised to pull back the curtain on the secrets on the deep state suddenly looked to many of his MAGA supporters like he was the deep state.\n\nAs all this played out, I made my first trip back to the United States since leaving four years ago, the longest spell I have spent out of a country since adolescence. This three-week visit started with the new protocols of Trump era travel, such as being required as part of the visa application process to reveal social media handles and entering the immigration hall with the possibility that border officials would demand access to my phone and laptop. \n\nThe thrill of entering America which I felt as a teenager was replaced by a sense of mild unease.\n\nThroughout the summer, the American melodrama brought tragedy and farce. There was heartbreak in Texas Hill Country, where flash floods took the lives of at least 135 victims, including 27 children and counsellors at Camp Mystic. Early July also brought the opening of \"Alligator Alcatraz\" in the Florida Everglades, a makeshift detention centre set up to help with the immigration crackdown. After touring its fenced-in bunk beds — facilities slammed as inhumane by immigration rights groups — Trump quickly proffered his presidential imprimatur. Then he offered advice to reporters on how to outrun an alligator, using zigzagging hand gestures to drive home his point.\n\nThen there was his latest attempt to profit from the presidency, a range of fragrances. \"Victory 45-47\", which comes in a bottle emblazoned with his signature and topped with a gold plastic statuette of the president, sells for $249 a pop.\n\nAs well as perfume, there was poison. His feud with Elon Musk, the one-time \"First Buddy\", became more venomous, with the world's richest man announcing the formation of his own political party. There was a resumption of hostilities with the comedian Rosie O'Donnell, whose citizenship he threatened to revoke.\n\nTo coincide with the release of the new Superman movie, the White House naturally created its own Superman meme, with Trump cast as the superhero, crimson cape and all. \"THE SYMBOL OF HOPE. TRUTH. JUSTICE. THE AMERICAN WAY. SUPERMAN TRUMP,\" read the official White House X account.\n\nJune and July also brought two important MAGA milestones, both of them red letter days vested with near sacred meaning. June 16 marked the 10th anniversary of the start of his first bid for the presidency, when he came down that golden escalator at Trump Tower. July 13 was the first anniversary of the attempt on his life in Butler, Pennsylvania, when a bullet shaved his right ear. This near death experience has come to be regarded almost as a celestial event: proof in the president's mind that God spared his life so he could be restored to the White House.\n\nOn June 14, two birthdays coincided: Trump's 79th and the US Army's 250th. These events were twinned when the Pentagon staged a mammoth anniversary parade through the streets of Washington. It’s \"gonna be better and bigger than any parade we've ever had in this country,\" said the president with typical braggadocio, \"a spectacular military parade in Washington, D.C., like no other.\" A Trump tattoo.\n\nSo all consuming is the spectacle of Trump's second term that it is easy to underplay the substance.\n\nThe \"One Big Beautiful Bill Act\" — it really is officially called that — has giant ramifications. Over the next decade, it will add at least $3.4 trillion to the US deficit, according to the non-partisan Congressional Budget Office, an eye-watering figure roughly twice the size of Australia’s entire GDP for 2024. As a result of his tax cuts, Americans in the top 20 per cent will see their incomes raised by 2.2 per cent, according to analysis from the Yale Budget Lab. Those in the bottom 20 per cent will see their incomes fall by 2.9 per cent. Put another way, that wealthy cohort will get a boost of about $5,700. The poor will be $700 worse off. \n\nCuts to Medicaid, which provides health cover for low-income and vulnerable Americans, could result in more than 42,500 deaths annually, according to public health experts at the University of Pennsylvania and Yale. Nearly 12 million Americans stand to lose their coverage.\n\nThe inflationary effects of the president's trade war, another signature policy, are also starting to have a hip pocket effect. Inflation rose to 2.7 per cent in June, up from 2.4 per cent in May. The price of eggs, which Trump famously promised to bring down, has risen by 27 per cent since this time last year. \n\nBut the stock markets, which dipped sharply after Trump's Liberation Day tariff announcements, have soared in recent weeks. In late June, both the S&P 500 and the NASDAQ reached record highs, and then continued breaking records. The markets seemed unperturbed by Trump's threats to fire the chairman of the Federal Reserve, Jerome Powell, another summertime storyline which bordered on the slapstick. In mid-July, Trump bizarrely expressed surprise that Joe Biden had appointed Powell in the first place, seemingly forgetting that he himself had hand-picked the Fed Chairman back in 2017. Then, in a photo-op which seemed to come straight from the satire Veep, the president found himself fact-checked by Powell in real-time after inflating claims of a cost blowout in the Federal Reserve’s renovation program. \n\nWith those B2 bomber raids and bunker buster bombs targeted at Iran's nuclear program, his boldest foreign policy move yet, Trump demonstrated the unmatched might of America's hard power. Simultaneously, he continued to erode his country's soft power. More than 1,500 staff at the US State Department were laid off in July, cuts which brought to mind the warning from General James Mattis, who served as Defence Secretary in Trump's first term: \"If you don't fund the State Department fully, then I need to buy more ammunition.\"\n\nThe Trump administration's cuts to US foreign aid, where 80 per cent of all programs have been cancelled, have been devastating. A report published in The Lancet medical journal at the start of July warned they could cause more than 14 million additional deaths by 2030. Children are thought to be particularly vulnerable. The report projected that 4.5 million infants under the age of 5 could die as a result of these America First cuts.\n\nWhen it comes to strengthening America's borders, the Trump administration has been delivering on its promise. By mid-July, illegal border crossings had fallen to their lowest levels ever recorded, according to US Customs and Border Protection. Late June also saw the lowest number of apprehensions on a single day on record — just 136. In early June, an executive order came into effect banning travel from 12 countries, including Afghanistan, Haiti and the Republic of Congo, with travellers from seven other nations, such as Cuba and Venezuela, facing tighter restrictions.\n\nJust over six months into his second term, this is fast turning into one of the most consequential presidencies of the past 70 years, on a par with the Reagan Revolution and Lyndon Johnson's Great Society reform program. \n\nThe Epstein scandal aside, supporters see a president delivering on border protection, restoring the fear factor to US foreign policy without embroiling the country in endless entanglements, and putting wokeism to the sword with his onslaught against diversity, equity and inclusion. Opponents see an unstable president on a narcissistic power trip: the head of a cult-like movement imperilling the modern-day norms of US democracy. In a country which next summer will mark its 250th birthday, Trump continues to personify and magnify American disunion.\n\nFor my summer visit, rather than as a journalist, I was there as a visitor. But in a country where pretty much everything is politicised Trump's giant shadow hangs over the tourist trail. \n\nHow can you peer across New York harbour at the Statue of Liberty and not wonder if democracy is under assault from a president who refused to accept the result of the 2020 election and sparked a rebellion on January 6, 2021, to overturn it? How can you drive through the civil war battlefields of the South, as I did in Tennessee, and not be reminded of the divisions he seems to delight in aggravating, and his decision to rename seven military bases in honour of Confederate leaders who fought to uphold slavery? \n\nHow could you listen, as I did during a patriotic celebration on July 4, to a town elder recite words from Abraham Lincoln's Gettysburg Address — that there should be \"government of the people, for the people, by the people\" — without pondering the question posed at the end of that classic 272-word address: whether this nation \"could long endure\".\n\nPolitics is always on tap. On my first morning in Manhattan, I stumbled across the Pride March heading down Broadway, and immediately came face to face with Zohran Mamdani, the 33-year-old democratic socialist who had just pulled off a shock victory in the New York mayoral primary by beating the former governor, Andrew Cuomo. On the evening I touched down in Los Angeles, the Trump administration announced that about half of the California National Guard troops who had been deployed to police the protests against the ICE raids would be placed back under the control of Governor Newsom.\n\nYet despite the fact that Trump provided much of the background noise for my travels, I was struck by how few people brought him up in conversation. For all his omnipresence in the media, I did not see a single Make America Great Again cap, bumper sticker or T-shirt depicting him as The Terminator or Rambo. This was true even in the South. \n\nAt a country music joint in Nashville, where singer-songwriters performed their greatest hits, there was not even the slightest hint of politics during the two-hour set. Likewise, at a mega-church the following morning, it would have been impossible to tell from the songs, prayers and liturgy who resided in the White House. Towards the end of her sermon, the preacher, a female African-American pastor, recited words from the bible that were echoed by Abraham Lincoln in his famed 1858 Springfield speech that \"a house divided against itself cannot stand\", but she was referring to divisions in the church rather than within the country.\n\nDuring my stay in Nashville, I visited one of the city's main visitor attractions, The Hermitage slave plantation owned by Andrew Jackson, the country's first populist president and a former general who often rode roughshod over Congress and the courts. But even though Trump regards Jackson as a presidential kindred spirit, and visited The Hermitage during his first term to pay homage to \"Old Hickory\", this also felt like a Trump-lite zone. For sure, the sight of Jackson's famed maxim in the museum's entrance hall — \"I was born for the storm, the calm does not suit me\" — evoked the present incumbent of the White House, but throughout our tour nobody made any reference towards this obvious connection. Nor in the gift shop did I see any merchandise connected to Andrew Jackson's 21st-century alter ego.\n\nDuring his first term, as I travelled through the American heartland listening to voter reaction to his presidency, I was constantly struck by how few Americans were aware of his latest tweet, insult, blow-up or scandalous imbroglio. This journey drove home that same simple but telling point. Though Trump dominates almost every waking hour of reporters and editors, he does not monopolise the lives of everyday Americans to anywhere near the same extent. Though the Trump White House is constantly on a political war footing, with outlets such as Rupert Murdoch's Fox News amplifying his battle cries, most American people do not regard themselves as full-time combatants.\n\nWhile Trump continually attempts to raise the temperature to boiling point, there is a large body of Americans keen to lower it. For sure, the United States remains chronically polarised with divisions over race, abortion, guns, the rules of democracy and how the country's history should be told and commemorated. But these are not conflicts fought at Trumpian intensity on an hourly or daily basis. Even when the Epstein scandal blew up, it did not feel as if the entire nation was following every twist and turn. At times I even wondered whether the watching world is paying closer attention than Americans themselves.\n\nNot for one moment am I suggesting there has been a truce in America's cold civil war. There is resistance for sure. In mid-June, \"No Kings\" protests were held in 820 different locations. In mid-July, another mass mobilisation, the \"Good Trouble Lives On\" protests, unfolded in more than 1,600 places. Yet despite the large number of protesters who took to the streets, I did not observe the fierce anger of his first term. Many Democrats seemed prepared to wait him out. Some fear that strong resistance will only play into his hands, and provide him with a pretext to crack down on dissent. Many believe the lower courts will slow him down, if not completely restrain him, and that in next year's congressional mid-term elections the Democrats stand a strong chance of taking back control of the House of Representatives, where the party needs a net gain of just three seats to wrestle power from the Republicans. \n\nIt is almost possible, among his critics, to detect a mood of melancholic resignation: the sense that abnormal is America's new normal; that the Trump genie will never be put back in the bottle.\n\nNoticeable over the American summer was how the term \"lame duck\" started creeping into reportage, the phrase used to describe a second-term president prevented by the 22nd Amendment to the US Constitution from running again. Usually this hackneyed term suggests a waning of power, but Trump has succeeded to a large extent in consolidating and expanding his presidential writ.\n\nThough the Epstein controversy has exposed fissures in the MAGAverse, Republicans on Capitol Hill are more loyal and disciplined than they were during his first administration. Even with majorities in both houses of Congress, it was quite the legislative achievement to win enactment of the big beautiful bill ahead of his July 4 deadline, and one which demonstrated the control he exerts over a Republican party largely purged of dissenters.\n\nDuring the summer, the conservative-dominated Supreme Court also handed him major judicial victories. In a ruling which boosted Trump's power and also its own, the court decided, six votes to three, to limit the ability of individual judges in the lower federal courts from issuing injunctions to block his policies. What made this ruling doubly significant was that it pertained to his attempt to limit birthright citizenship through the signing of a presidential executive order, which critics blasted as a flagrant attempt to re-write with his famed Sharpie pen the 14th Amendment of the US constitution. \n\nAided by an often pliant Supreme Court, Trump continues to alter the balance of power between the three branches of US government, the executive, the legislature and the judiciary, so that more authority is concentrated in the White House. This, then, is becoming a most imperial presidency. From pressuring Coca Cola to use cane sugar rather than corn syrup to demanding that the Washington Commanders NFL team revert to its former name, the Redskins, he clearly believes that he can intervene in and alter virtually every facet of American life.\n\nCertainly, Trump is no lame duck. As if to drive home this point, sections of the US media are opting for appeasement over adversarialism. Paramount, the parent company of CBS, surrendered to Trump over one of his frivolous lawsuits, paying him $16 million to settle a case centring on the editing of a 60 Minutes interview with Kamala Harris. Paramount is trying to pull off a mega-merger with Skydance, which needs the approval of Trump's Federal Communications Commission. \n\nWhen CBS cancelled The Late Show with Stephen Colbert, a host unafraid to voice on-air criticisms of his Paramount paymasters, the comedian was widely seen as a sacrificial offering. \"I absolutely love that Colbert got fired,\" Trump rejoiced on social media. \"I hear Jimmy Kimmel is next,\" he added, referring to the late night talk show host on ABC, who the president has sparred with for years.\n\nIn another MAGA victory, Trump also managed to starve federal funding from the public broadcasters PBS and NPR, a bete noire of Republicans for decades. Routinely now, he is trying to cow the media into submission. His response to an explosive Epstein-related story published by The Wall Street Journal, based on a lewd letter Trump allegedly wrote to his then friend more than 20 years ago which spoke of a \"wonderful secret\", was to sue Rupert Murdoch, the owner of the newspaper, and to ban the masthead from being part of the press pool covering his trip to Scotland.\n\n[#configsm4x3md4x3lg4x3anon\n\nDonald Trump is far more representative of America's past and present than detractors would concede. The kind of fanaticism, nativism, white male supremacy, Christian nationalism and conspiratorialism which he taps into have been through-lines of the American story. But that is not the same as saying Trump is successfully moulding America in his own image. Unlike Ronald Reagan, who won 49 out of 50 states in his landslide re-election victory in 1984, he has struggled to win over a simple majority of compatriots. At the 2024 election, even though he became the first Republican since George W Bush in 2004 to win the popular vote, he received only a 49.8 per cent share. His victory, though clear-cut, was historically speaking narrow. By just 233,000 votes did Kamala Harris lose the three crucial Rust Belt states of Pennsylvania, Michigan and Wisconsin. Had this trifecta of battlegrounds ended up in the Democratic column, she would have become America's first female president.\n\nAt no time during his first or second term has Trump cracked the symbolically important 50 per cent presidential approval rating as measured by Gallup. Since this blue-ribbon polling organisation first started gauging presidential popularity in the late 1930s, he is the only president not to rise above this threshold. His average second term approval rating is 43 per cent. Despite what he presented as a string of victories in Iran, on Capitol Hill and at the Supreme Court — \"has anyone ever had a better two weeks?\" he boastfully asked during what he regarded as salad days for his presidency — an Economist/You Gov poll published in mid-July suggested his approval rating was just 41 per cent, the lowest of his second term. As for the Big Beautiful Bill, a CNN/SSRS poll found that 61 per cent of respondents opposed it.\n\nWhen I first visited the United States as a wide-eyed teenager, I got to experience the country's great summertime of resurgence. It was 1984, the year of the Los Angeles Olympics. Chants of \"USA, USA\" celebrated the gold rush achieved by the host nation's athletes. It was the first time this incantation had been heard coast to coast, and it helped exorcise some of the ghosts of Vietnam, Watergate and the Iranian hostage crisis. \n\nThat year, as part of his bid for re-election, Ronald Reagan came up with the slogan \"It's Morning Again in America,\" which perfectly encapsulated the optimistic mood of the times. From the White House comes the same triumphalism, albeit more nationalist than patriotic. But the first summertime of the Trump restoration, of which there is still a month left to run, has been an altogether darker and more schismatic time.\n\nWords: Nick Bryant\n\nEditor: Leigh Tonkin\n\nIllustrations: Kylie Silvester\n\nPhotographs: Reuters, Matt Davis","summary":"Returning to the US for the first time in four years, I found a country that didn't want to talk about politics, despite being in the eye of the Trump storm.","url":"https://www.abc.net.au/news/2025-08-03/it-s-the-summer-of-trump-and-the-world-can-t-look-away/105574002","image":"https://live-production.wcms.abc-cdn.net.au/34321ffeeb95caeffef854b0d9ad1caa?impolicy=wcms_crop_resize&cropH=1688&cropW=3000&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2025-08-02 19:00:00","author":"Nick Bryant","authors":["Nick Bryant"],"language":"en","source_country":"AU","sentiment":-0.39},{"id":347605682,"title":"The Cincinnati Cop-Outs","text":"Recently, a large group of black youths began pummeling several white adults in downtown Cincinnati.\n\nThe original altercation apparently broke out between a black and white male in he-said/he-said fashion. But that dispute soon turned into a virtual free-for-all.\n\nNumerous male and female black youths sucker-punched a middle-aged woman and a man. Others continued to kick or body slam the victims, who were sprawled on their backs and seemingly unconscious.\n\nThere were many disturbing aspects to the beat-downs.\n\nOne, the violence broke out along racial and age fault lines. After the initial one-on-one dispute, groups of black youths swarmed solitary older white bystanders to pound them.\n\nTwo, the surrounding assembled group of black youths not only failed to intervene to restrain the bullies. They also recorded the beatings for social media and were heard cheering on the one-sided violence.\n\nThree, there was neither a police presence nor any timely Good Samaritan interventions.\n\nInstead, what ended the attacks was simply the fact that at least two of the targets appeared nearly comatose. So their assailants apparently concluded that their agenda of beating whites into unconsciousness was mostly complete.\n\nFour, oddly few of the usual black spokespeople who habitually comment on interracial violence were to be seen.\n\nDuring the fake Jussie Smollett attack, self-appointed leaders from Al Sharpton to Kamala Harris immediately issued warnings about so-called systemic white racism that had reared its ugly head to victimize Smollett.\n\nYet when it was revealed Smollett had concocted the entire charade—and even hired his own assaulters—there were few if any retractions from those once so eager to shout “racist!”\n\nSuch demagoguery is a well-known pattern dating back to the days of the Tawana Brawley rape hoax, the Duke Lacrosse charade, the Covington kids ruse, the Michael Ford “Hands-up-Don’t Shoot” fabrication, the “pseudo-transformation of George Zimmerman into a ‘white Hispanic,’” or the NASCAR noose fable.\n\nRacialists too often concoct white racist attackers and go silent when the evidence proves fabricated—only to be primed to manipulate the next hoax.\n\nFive, the media and authorities did their best to either hide or play down the violence.\n\nCity leaders, the chief of police, and the media variously blamed the mass black-on-white violence on 1) social media, 2) the original one-on-one dispute, 3) alcohol, 4) the lack of civilian intervention to stop the violence, and 5) a festival atmosphere—anything except endemic racial hatred shown toward whites from the crowd of black youths.\n\nSix, had a gang of white toughs beat middle-aged African-Americans senseless, recorded it, and cheered on the violence, there would have been immediate national outrage.\n\nNor did anyone wish to raise the taboo topic of inordinate black crime rates, disproportionate to respective demographic realities. In rare interracial violent crimes, the asymmetrical ratio of black-on-white versus white-on-black assaults ranges from three to five times greater.\n\nSeven, the quiet of the left-wing media to the reprehensible violence stands in marked contrast with their usual rush-to-judgment racialism in two near-simultaneous incidents.\n\nWhen a shooter of mixed African-American heritage recently entered a New York City corporate headquarters and executed four innocents, CNN falsely raised the speculation that a “white male” was perhaps responsible—despite the photograph of the suspect, who was as clearly male as he was not white.\n\nMedia and municipal officials jumped to explain the violence as due to the killer’s alleged past traumatic brain injury or because of his access to a semi-automatic weapon—or anything other than his hate-filled plan to murder an NFL executive.\n\nActress and model Sydney Sweeney just cut a jeans commercial in front of a poster that said, “Sydney Sweeney has great genes” —with “genes” crossed out and replaced with “jeans.” The left then exploded, alleging the ad was a supposed Hitlerian reference to white eugenics.\n\nYet the eugenics movement in America was mostly a product of left-wing progressives, from Planned Parenthood founder Margaret Sanger to Democrat president Woodrow Wilson.\n\nAnd the ad’s sponsor, American Eagle, had previously used all sorts of models from all racial backgrounds. All might agree that the ad simply shows both tight, sexy jeans and a naturally attractive wearer—period.\n\nThe country is descending into a tribal morass of double standards and racial fixations.\n\nThe diversity/equity/inclusion industry, the defund-the-police madness, and the perpetual left-wing hunt for “white racism/white privilege/white rage” —from the prior Pentagon hierarchy to the lunatic fringe of Jasmine Crockett, Joy Reid, and Zohran Mamdani—have all legitimized double standards while lowering the bar of the once unacceptable.\n\nWhen our careerist left-wing elites seek to divide us by race and make it essential, not incidental, to our identities, that tribalist message filters throughout communities.\n\nThe ensuing signal is that “payback” violence is OK—on the expectation that there are no consequences for interracial violence—as long as the victim is white and the assaulter is not.(C)2025 Tribune Content Agency, LLC.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Recently, a large group of black youths began pummeling several white adults in downtown Cincinnati. The original altercation apparently broke out between a black and... Read More\n\n\nThe post The Cincinnati Cop-Outs appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/08/02/the-cincinnati-cop-outs/","image":"https://www.dailysignal.com/wp-content/uploads/2025/08/20250801SweeneyJeans.jpg","video":null,"publish_date":"2025-08-02 18:00:00","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.26},{"id":347602372,"title":"All Cap: Donald Trump’s Lie On President Obama Proves It’s Time To Get Litigious Against MAGA","text":"Source: The Washington Post / Getty Donald Trump is at it again — lying, projecting, and distracting. This time, he’s coming with a side of treason accusations and Met Gala gossip. In a desperate attempt to deflect attention from the festering truth about his ties to Jeffrey Epstein, the disgraced President has launched a full-blown misinformation blitz, accusing President Obama of treason, claiming AOC broke House rules by attending the Met Gala, and throwing unwarranted shade at Vice President Kamala Harris, Beyoncé, Oprah, Al Sharpton as well as the Democratic Party. At this point, we have to admit the lies have gone beyond gaslighting and call it what it truly is: a targeted and dangerous disinformation campaign. And it’s time we start fighting back and hitting them where it hurts: in court. Recently, when asked about his connection to Epstein, Trump gave what can only be described as an unhinged diatribe, bizarrely claiming Obama had been “caught directly” committing “treason”, telling reporters, “Obama’s been caught directly… What they did in 2016 and 2020 is very criminal. It’s criminal at the highest level… Look, he’s guilty. It’s not a question … This was treason.” An orange-faced lie. There is zero evidence that President Obama has done anything criminal. None. Nada. Zilch. But that didn’t stop Trump from doubling down on the blatant lie, citing a “criminal referral” from none other than MAGA mouthpiece Tulsi Gabbard, who claimed she uncovered “overwhelming evidence” that the Obama administration manipulated intelligence to set the stage for a “coup” against Trump. The same administration that attempted a coup and pardoned actual treasonous criminals is now running a full-blown campaign of lies to once again cover Trump’s own criminal record and activities that MAGA keeps attempting to sweep under the rug. This nonsense and continuous rabbit hole of lies is timed perfectly to do what Trump does best, distract and drain you from the fact that the Epstein files are back in the headlines, along with Trump’s name. Thanks to a decades-old photos, flight logs, and an uncomfortable number of mutual acquaintances, the truth has finally come into the mainstream once again (because we told y’all this in 2016) that Trump and Epstein were tight. That’s not an opinion; that’s fact. From Palm Beach soirées to NYC club nights, they were seen often enough to have raised red flags decades ago. Now that the heat is reaching a boiling point, Trump has directed Attorney General Pam Bondi to release only “credible” information from the Epstein files. That’s right, Trump, who has been named publicly as being one of the names on the list and was mentioned in the Epstein case multiple times, is telling the public that he is trying to define what’s credible as his fingerprints remain embedded across decades of evidence showing his proximity to a convicted sex trafficker; credibility, in this case, is clearly code for “scrub my name.” Scrubbing his name is a plan that is clearly underway, because let’s not forget, last week, House Speaker Mike Johnson conveniently sent the House home early to avoid a vote on releasing the Epstein files in full, proving that MAGA’s political machine is working overtime to bury the truth and flood the news cycle with chaos. But wait—there’s more. Trump’s Deputy AG Todd Blanche, who is Trump’s former private attorney, met with Ghislaine Maxwell for nine hours at the federal courthouse in Tallahassee, Florida, and is expected to meet with her for a second time this week. Maxwell is Epstein’s convicted accomplice, who is serving 20 years for trafficking minors. Stocked with a potential pardon, Maxwell told the court that she had more tea to spill and names to name, and of course, Trump’s crew is toting the story that he believes she might just remember something. Y’all, this is straight out of a Scorsese film. We are literally witnessing mass manipulation and witness tampering dressed up as a press conference; and given Maxwell’s track record of perjury, the DOJ already labeled her a “pervasive liar” back in 2021 after she made multiple false statements under oath and failed to take responsibility for her actions. Trump is testing the temperature to see if he can twist the narrative to serve himself, and if we don’t pay attention, he will. Which brings us to his now-regular routine of throwing random Black public figures into the fray. Kamala Harris. Oprah. Beyoncé. Al Sharpton. Not only is this a continuation of his acting out of the authoritarian playbook, but it also keeps his base frothing off of race-baiting lies and the headlines off his own shoddy record. But the real egregiousness here is Trump’s ongoing allegiance to propaganda and foreign adversaries over facts and the American people. Source: UCG / Getty Let’s not forget, Russia did interfere in the 2016 election. That’s not up for debate—it’s in a 950-page bipartisan Senate report, led by Republican Marco Rubio. The report concluded that Russia’s goal was to indirectly assist the Trump campaign through various methods, including psychological warfare via Facebook ads and campaigns. Despite the irrefutable evidence and reports, Trump is spouting delusions of grandeur and threatening to arrest Obama and Democrats, all while robbing Americans blind and ushering in a pay-for-play lifestyle in every facet of our lives, passing laws that have set the country back 50 years, in addition to the stagnation and outright halt in education. Let’s be real, Trump is unraveling, and what’s more dangerous than his mental state is the power he still holds over a party willing to sell its soul for MAGA loyalty. This is truly no longer about politics, but instead about survival — the survival of truth, democracy, and sanity. That’s why the lawsuits must begin. It’s time to meet lies with litigation. Disinformation should cost something. Defamation should come with consequences, because if we don’t push back in court, we’re giving MAGA free rein to keep polluting our news and timelines with this discourse, distracting us from the real crimes happening in Washington by the Trump administration, and attacking innocent people to protect a convicted felon, liar, and grifter-in-chief. Enough is enough. Sue them all. It’s time to strip the lies of their perceived legal shelter and demand truth under oath in court to show them that accountability is not optional. Because if Trump and his enablers keep dodging justice with press conferences and propaganda, then what example does that set for the future? And more importantly, what does that do to the credibility regarding the reporting of information? We’re done watching. Let the lawsuits begin. SEE ALSO: Thanks To Donald Trump, The American Dream Is Dead Donald Trump, Executive Overreach, And Project 2025’s Blueprint","summary":"Trump is unraveling, and what’s more dangerous than his mental state is the power he still holds over a party willing to sell its soul for MAGA loyalty.","url":"https://newsone.com/6352634/all-cap-its-time-to-get-litigious-against-trump-and-maga/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/08/17541555076874.jpg?quality=80&strip=all&w=1024&crop=0,0,100,683px","video":null,"publish_date":"2025-08-02 17:31:11","author":"Tiffany Hamilton","authors":["Tiffany Hamilton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.624},{"id":347593290,"title":"Former Trump Prosecutor Jack Smith Probed For Alleged Election Interference","text":"Former special counsel Jack Smith, who headed two criminal investigations into President Donald Trump, faces a probe by the Office of Special Counsel for alleged election interference, the agency confirmed to Forbes, after a top Republican accused Smith of attempting to “damage” Trump ahead of the 2024 presidential election.\n\nA probe comes after Republican Sen. Tom Cotton accused Smith of “unlawfully” seeking to influence the 2024 presidential election.\nGetty Images\n\nThe OSC, an independent agency of the federal government, is investigating Smith for alleged violations of the Hatch Act, which prohibits federal employees from engaging in political activities, the agency told Forbes (the New York Post was first to report on the probe).\n\nEarlier this week, Senate Intelligence Committee chair Sen. Tom Cotton, R-Ark., requested an investigation into Smith by the OSC for “unprecedented interference” in the recent presidential election, claiming Smith’s investigations into Trump were “nothing more than a tool for the Biden and Harris campaigns.”\n\nCotton alleges Smith fast-tracked a trial and jury selection in Trump’s election interference case, which was dropped by Smith weeks after the 2024 election, and accused Smith of failing to “articulate a legitimate reason” why the court should grant his requests to fast-track.\n\nCotton also claimed Smith violated the DOJ’s “60-day rule,” which prevents prosecutors from taking steps in a case that could influence an upcoming election, alleging Smith aimed to “help [Kamala Harris] and hurt Trump,” adding, “These actions were not standard, necessary, or justified.”\n\nSmith has not publicly commented on Cotton’s allegations.\n\nWhat To Watch For\n\nIf the OSC finds Smith violated the Hatch Act, the agency cannot bring criminal charges against or prosecute Smith, though it can seek potential disciplinary action or refer its findings to the DOJ for further investigation.\n\nSurprising Act\n\nTrump ousted former OSC chief and President Joe Biden appointee Hampton Dellinger earlier this year. Dellinger challenged his firing in court, but later dropped his case. Trump nominated Paul Ingrassia to head the office in May, though Ingrassia’s confirmation hearing was postponed late last month. Sen. Gary Peters, D-Mich., has argued that Ingrassia, a former right-wing podcast host, is “unqualified” to run the OSC, “both in terms of his legal experience and given his long history of bigoted statements.” Ingrassia has previously worked as an attorney for controversial “manosphere” influencer Andrew Tate and has associated with white supremacist Nick Fuentes.\n\nKey Background\n\nSmith was appointed by then-Attorney General Merrick Garland in November 2022 and carried out two federal investigations of Trump during his two-year tenure. His probes looked into Trump’s bid to overturn the 2020 election and Trump’s alleged withholding of classified documents, though Smith dropped charges in both cases. Smith accused Trump of violating the law to overturn the 2020 election by pushing false claims of voter fraud while knowing they were false. Smith signaled he would step down as special counsel in the months leading up to Trump’s inauguration earlier this year before resigning on Jan. 11. His resignation was disclosed in a court filing, in which the Justice Department wrote Smith had “separated” from the agency after completing his reports into Trump.\n\nFurther Reading\nForbesSpecial Counsel Jack Smith Resigns After Completing Final Trump ReportBy Ty Roush\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"A probe comes after Republican Sen. Tom Cotton accused Smith of “unlawfully” seeking to influence the 2024 presidential election.","url":"https://www.forbes.com/sites/tylerroush/2025/08/02/former-trump-prosecutor-jack-smith-probed-for-alleged-election-interference/","image":"https://imageio.forbes.com/specials-images/imageserve/6782e32bfae5a9d0d42b3cff/0x0.jpg?format=jpg&crop=1674,942,x0,y78,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-08-02 16:53:34","author":"Forbes Staff,Ty Roush","authors":["Forbes Staff","Ty Roush"],"language":"en","category":"politics","source_country":"US","sentiment":-0.262},{"id":347585320,"title":"Elon Musk Spent Millions to Get Back in Donald Trump's Good Graces","text":"Elon Musk made donations totaling $15 million to three super PACs supporting Donald Trump and the Republicans after his very public falling out with the president, but all before he announced his plans for the new \"America Party.\"Newsweek reached out to the White House and Musk via X, SpaceX, and Tesla for comment by email outside of normal business hours on Saturday morning.Why It MattersMusk and Trump formed a fast and mutually beneficial friendship in the runup to the 2024 presidential election, with Musk bankrolling Trump's campaign to the tune of at least $250 million and helping him secure victory against then-Vice President Kamala Harris, the Democratic nominee.Trump then positioned Musk as the point person for the Department of Government Efficiency (DOGE), giving him free rein to look into the federal government to cut back on \"waste, fraud, and abuse\" and bring down spending across all departments.However, their relationship took a turn as pressure mounted against Musk, with Tesla suffering significantly due to his role in the Trump administration, and ultimately Musk left his post to return to the private sector.Musk, who called himself Trump's \"first buddy,\" also publicly criticized the administration-backed \"One Big Beautiful Bill,\" which aims to extend tax cuts, increase immigration enforcement, and end consumer incentives for electric vehicles.Trump and Musk then started to taking shots at each other—through the press and via their respective social media platforms—culminating in a very public falling out in June.Musk accused Trump of withholding the release of the Epstein files because he was allegedly named in them, and Trump threatened to cut Musk's contracts with the federal government.What To KnowFollowing their public feud, which occurred in the first week of June, Musk appeared to try and make amends with the president by donating $5 million to each of three super PACs related to Trump and the Republicans.The Daily Mail first noted the donations in a report on Friday, but Newsweek verified through Federal Election Commission (FEC) filings that Musk donated $5 million each to MAGA Inc., the Senate Leadership Fund, and the House Leadership Fund. All three donations were made on June 27, which is about a week before he then declared he would create his own political party—the America Party.Musk's last donations were made to the AMERICA PAC, which included a roughly $27 million donation on June 30, according to the filings. He has also donated to the reelection campaign for Republican Representatives Marjorie Taylor Greene of Georgia and Barry Moore of Alabama, although those were only a few thousand dollars each.This was also around the time that Musk heavily criticized the \"One Big Beautiful Bill,\" which he said was \"political suicide\" to pass and warned it would add trillions to the national debt.Musk decided to create the America Party after holding a poll on X on July 4, in which he asked users: \"Should we create the America Party?\" as a way of creating \"independence from the two-party (some would say uniparty) system.\"The poll received 1.25 million votes, with 65.4 percent saying \"Yes,\" which Musk greeted with enthusiasm, writing: \"By a factor of 2 to 1, you want a new political party and you shall have it! When it comes to bankrupting our country with waster & graft, we live in a one-party system, not a democracy.\"As a foreign-born U.S. citizen, Musk cannot run for president, but he could bankroll other candidates, which he could do with a third party. He wrote in a separate X post that if he did make a new party, he would focus on capturing two or three Senate seats and eight to 10 seats in the House of Representatives in order to have impact on legislation.Trump criticized Musk's decision to start a third party, writing on Truth Social at the time, in part: \"I am saddened to watch Elon Musk go completely 'off the rails,' essentially becoming a TRAIN WRECK over the past five weeks. He even wants to start a Third Political Party, despite the fact that they have never succeeded in the United States - The System seems not designed for them. The one thing Third Parties are good for is the creation of Complete and Total DISRUPTION & CHAOS.\"What People Are SayingPresident Donald Trump in his last Truth Social post to mention Elon Musk, which was on July 24, wrote: \"Everyone is stating that I will destroy Elon's companies by taking away some, if not all, of the large scale subsidies he receives from the U.S. Government. This is not so! I want Elon, and all businesses within our Country, to THRIVE, in fact, THRIVE like never before! The better they do, the better the USA does, and that's good for all of us. We are setting records every day, and I want to keep it that way!\"Elon Musk in his last X post to mention Donald Trump, which was on July 8, wrote: \"How can people be expected to have faith in Trump if he won't release the Epstein files?\"What Happens Next?It remains unclear if Trump and Musk have had any direct communication following their war-of-words in June.This article includes reporting by The Associated Press.","summary":"Musk and the president had a very public falling out in June after the tech mogul returned to the private sector.","url":"https://www.newsweek.com/elon-musk-spent-millions-donald-trump-pac-2107990","image":"https://d.newsweek.com/en/full/2695417/elon-musk-washington-dc-doge.jpg?w=1600&h=900&q=88&f=ff38d6fe2241de141b069e603532b354","video":null,"publish_date":"2025-08-02 16:24:06","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.011},{"id":347597674,"title":"How this week's avalanche of news from Washington to Wall Street kept investors guessing","text":"It was a dizzying week on Wall Street. The S & P 500 closed this past Monday at a record high and then went on a four-session losing streak. Friday was particularly unsettling as terrible jobs data slammed the market and triggered President Donald Trump . Trump started the day by slamming Federal Reserve Chairman Jerome Powell for not cutting interest rates on Wednesday. He accused the Fed of cutting rates at the end of last year to help elect Kamala Harris. Later in the day , the president used similar reasoning when firing the head of the Bureau of Labor Statistics, which puts out the employment report. Trump accused BLS Commissioner Erika McEntarfer, a Biden appointee, of negatively manipulating the numbers during his presidency and inflating them before Election Day to help Harris. Also on Friday afternoon, Fed Governor Adriana Kugler resigned . The Biden appointee didn't give a reason. As if all that were not enough, just before his self-imposed Aug. 1 deadline, Trump set new \"reciprocal\" tariff rates to go into effect on Aug. 7. The president also on Friday ordered two nuclear submarines \"to be positioned in the appropriate regions\" after a warning to the U.S. from Russian official Dmitry Medvedev. On Monday, Medvedev said that \"each new ultimatum\" about the Ukraine conflict is a \"threat and a step towards war\" between Russia and the U.S. .SPX .IXIC 5D mountain S & P 500 and Nasdaq performance this week It was no wonder the S & P 500 lost more than 1.5% on Friday, in a session even further pressured by a drop in tech stocks following Amazon 's post-earnings stock decline of more than 8%. For the week, the broad market index lost nearly 1%, ending a two-week win streak. The tech-heavy Nasdaq was the big loser Friday, dropping more than 2.2% on the session and more than 2% for the week. It, too, snapped two straight weekly gains. As bad as the calendar page turn to August was on Friday, the S & P 500 and the Nasdaq wrapped July on Thursday with gains of 2.2% and 3.7%, respectively. The S & P 500 completed a three-month winning streak, while the Nasdaq extended its monthly run to four straight. It was certainly a busy week, jam-packed with macroeconomic updates, trade negotiations, a Fed rate decision — and, of course, an earnings onslaught, with four of the Magnificent Seven reporting. Trump trade The week started out with the U.S. on Sunday striking a trade deal with the European Union. South Korea slipped in under the wire before the president's Friday deadline. Both trade partners are now subject to a 15% tariff on exports to the U.S., down from the respective 30% and 25% rates in place prior to the agreements. The deal with the EU will also see the trading bloc purchase $750 billion in U.S. energy, while investing an additional $600 billion into the U.S. The deal with South Korea included an agreement for $350 billion in U.S. investments. Negotiations with China remain ongoing, with the tariff deadline being pushed to Aug. 12. Mexico was granted a 90-day extension of current 25% rates following a discussion with Mexican President Claudia Sheinbaum. Canada, however, was slapped with a 35% tariff rate . As for the trade partners that have yet to strike a deal, new rates were announced last Thursday evening and are set to take effect this coming Thursday. Weak jobs Just hours after the new tariff rates were announced, the Friday jobs report was released. The July nonfarm payroll growth of 73,000 positions fell way short of the 100,000 additions economists had expected. Worse yet, the June and May readings were both revised significantly lower for a combined 258,000 less jobs than originally reported for those two months. All of that, besides setting Trump off, put a September rate cut back on the table, according to the CME FedWatch tool. The market odds of a cut flipped from about 38% on Thursday to nearly 83% on Friday. Shortly after the weak jobs report, Jim Cramer said that while he has been a big backer of Powell, this number says: \"You didn't need to wait\" to cut rates. Warmer inflation The day after the Fed held rates steady, the central bank's preferred measure of inflation — the personal consumption expenditure (PCE) price index — was released Thursday morning. Both the headline PCE reading, as well as the core rate excluding food and energy prices, came in one-tenth hotter than expected on a year over year basis, seemingly supportive of the Fed's decision to leave rates unchanged. However, the negative jobs data clouds the picture a bit and will force the Fed to weigh the importance of both parts of its dual mandate — maintaining price stability, around their target 2% inflation rate, and fostering maximum employment. The former currently requires more restrictive or higher rates, given that inflation remains above target, while the latter points to less restrictive or lower rates, because central bankers don't want to see any material increases in joblessness. Economic growth Part of the rationale for holding rates steady came from a strong advance second quarter reading on the economy, which was released Wednesday morning just hours before the Fed's July meeting wrapped up. The seasonally adjusted annual GDP growth rate of 3% was much better than the 2.3% advance that was expected. While the economy managed to chug along during the April to June period, despite all the fear and uncertainty caused by trade disputes, it's already August. The GDP is a backwards looking data set. That's why more weight is put on the monthly updates noted above, relating to inflation and the labor market — and of course, the most real-time source of data we can get, earnings. Club earnings So, with that, let's take a look at how earnings went this week for the Club. We heard from Starbucks on Tuesday evening, Meta Platforms and Microsoft on Wednesday evening, Bristol Myers Squibb on Thursday morning, Amazon and Apple on Thursday evening, and Linde on Friday morning. Starbucks : Though the coffee giant reported mixed quarterly results, we heard enough positives to confirm that CEO Brian Niccol's turnaround remains firmly on track. Meta Platforms : The social media powerhouse delivered an absolute blow out quarter, with the only thing better than the results being the guidance. Bristol Myers : The drugmaker delivered a solid quarterly beat and outlook raise. However, with the Cobenfy narrative — at the core of our investment thesis— going from being pretty straightforward to a show-me story, investors aren't giving the company the benefit of the doubt. We trimmed our price target following the release. There are also the added questions marks around Trump push this week for lower prescription prices from Bristol and 16 other major drugmakers, including Club name Eli Lilly, which reports earnings next week. The threat of sector-specific pharma tariffs remains in play. Amazon : Overall the tech giant reported a solid quarter. However, shares sold off as investors took issue with Amazon Web Services (AWS) failing to deliver the same type of cloud revenue upside as rivals Microsoft Azure and Google Cloud. Operating income guidance for the current quarter was also a bit lower than expected, though that has historically proven conservative. Ultimately, we think the concerns are overblown and think the pullback represents a buying opportunity . Apple : The iPhone maker reported a very respectable quarter. However, when taking into account the price action of the stock this year alongside the reaction to the results, it's clear that investors are not ready to give management much credit until they deliver more clarity about the company's AI strategy. It was encouraging to hear CEO Tim Cook say he's open to M & A to help with that. Linde : The industrial gas stalwart delivered solid quarterly results in a difficult operating environment, demonstrating the company's resiliency no matter the backdrop. Moreover, management raised the low end of its full-year earnings guidance, despite noting that the high end of the range already assumes an economic contraction. It's another important week of corporate earnings ahead, with about a quarter of S & P 500 companies set to report. Six companies in the Club portfolio are on the docket: Coterra Energy , DuPont , Eaton , Disney , Eli Lilly , and Texas Roadhouse . Week in trades It was also a busy week of trades for the portfolio. Kicking off the week, we added to our positions in Cisco Systems and Honeywell . That was followed up by a small trim of Eaton as the stock hit new high. On Tuesday, we locked in a nice profit on Eli Lilly following disappointing news from Novo Nordisk , its main competitor in the GLP-1 market. We also trimmed our position in Wells Fargo as shares finally recovered from their post-earnings decline. On Wednesday, we added to our position in Dover and called out that we would also be adding to our stakes in Starbucks and Palo Alto Networks , we were not restricted. We'll be keeping a close eye on both in the week to come for an opportunity to step in. Palo Alto finished the week down nearly 15% on a four-session losing streak after reports of talks and its confirmation of a $25 billion deal to buy CyberArk were not well received by investors. We, however, feel that bundling CybarArk's identity security platform will accelerate Palo Alto's platformization strategy. Rounding out the week , on Thursday, we cut our position in Abbott , in line with prior commentary in which we highlighted our concerns about the company's exposure to China. We took the raised capital and redeployed it in Capital One Financial as the move we were seeing in the stock didn't reflect the fundamentals we saw when it reported second quarter earnings. (See here for a full list of the stocks in Jim Cramer's Charitable Trust.) As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade. THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY , TOGETHER WITH OUR DISCLAIMER . NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB. NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED.","summary":"The S&P 500 closed this past Monday at a record high and then went on a four-session losing streak. Friday.","url":"https://www.cnbc.com/2025/08/02/how-this-weeks-avalanche-of-news-kept-markets-and-investors-guessing.html","image":"https://image.cnbcfm.com/api/v1/image/108126999-17437959902025-04-04t194522z_1966743906_rc27rda17sjy_rtrmadp_0_usa-stocks.jpeg?v=1747687355","video":null,"publish_date":"2025-08-02 16:19:02","author":"Zev Fima","authors":["Zev Fima"],"language":"en","source_country":"US","sentiment":0.138},{"id":347648796,"title":"Tolkien’s sci-fi shows we need only one ring","text":"I love science fiction movies and series. But what always bothered me was that as imaginative, forward-thinking, inventive and superlatively intelligent as the worlds and multiple universes they created, it was no match for the diversity we have on Earth and humankind. \n\nEven my current favourite Apple TV+’s Foundation, based on the genius Isaac Asimov’s 1950s book series, cannot create a world or planet as diverse as ours. Generally speaking, movies and TV series have just one type of people per planet. Indeed, a planet is often a single city.\n\nWhen I read politics and philosophy at university, I was introduced to Douglas Adams and his amazing book series The Hitchhiker’s Guide to the Galaxy, the “trilogy in four parts”. It was through Adams’ Hitchhiker’s books that I began to recognise the lessons I had been picking up from Star Trek and Star Wars movies. \n\nAll the stories involved good fighting against an overwhelming evil power, while they try to build a new society that is based on equality and freedom. There are obvious comparisons to South Africa’s resistance against the apartheid government and military. \n\nBut some of the greatest minds cannot imagine a world as diverse as Earth’s or conjure up a species with a multitude of cultures, nationalities and peoples as the human race.\n\nIt is British-South African writer JRR Tolkien, in The Lord of the Rings and The Hobbit, who is able to best reflect the many sides of humankind. In truth though, Tolkien’s books are fantasy and, strictly speaking, not sci-fi. But I like to think of fantasy and sci-fi as close cousins. \n\nAlthough Tolkien wrote the books during World War II, he strongly denied they were an allegory of that war. But it would not be incorrect to reflect that Tolkien’s experiences in World War II influenced his writing. So maybe the evil Sauron was not necessarily Hitler, but it is not too farfetched to relate Sauron’s evil purpose to build a world that serves him and over which he has complete control to the objectives of Nazi fascism. \n\nWe should not focus on the banal evil of Sauron or his minions, the Orcs. There have been articles accusing Tolkien of being racist in his descriptions of the Orcs. But thinking of the Orcs as black people is a cop-out and not a useful unpacking of The Lord of the Rings and The Hobbit. It is in The Hobbit that Tolkien explores and describes the inequality of the world and how accepting we are of the inequality, despite supposedly fighting against it. \n\nIt is the experiences of the dwarfs and the difficulties they face that reflect our world; one in which those who have precious resources are made to mine them and hand them over to the elves so that they can rule the world forever. \n\nTolkien presents the elves as close to immortal and beautiful, almost God-like. The dwarfs are short and stumpy, nothing noble about them. They covet Earth’s riches, but do not know how to develop them. So it’s in the interests of all of Earth that the elves take these jewels to invent machinery and technology to make the world easier. But it requires the dwarfs to live in the dark, remain in the bowels of the mountains and mine the precious treasures. \n\nThe hobbits are of course, the simple rural and working class, who befriend the dwarfs and assist in creating a balance with their simple lives. Just when the opportunity of equality presents itself, the human penchant for greed takes over and this allows evil to reign. \n\nThe implication is clear: there can only be a semblance of equality. The elves rule (benevolently because they are naturally good, of course) and the dwarfs remain underground mining for the elves, while the rural and working class produce the goods and live in their Middle Earth. The elves like to say that if they are not revered and allowed to remain in charge then an evil Sauron will take over.\n\nOur world today is not very different to what Tolkien reflected upon.\n\nThe instability in the world is not fuelled by US President Donald Trump, even though he benefits from it. The real fear for our elves (the political West) is that if the current path is allowed to continue it will result in them no longer being in charge. In their understanding they cannot exist unless they have hegemonic control of the world; it is the natural order of things. For them, Russia and China are Sauron, and it is in our interests to reinforce the West so that the “evil” Russia and China do not take over. \n\nIf we look at our international multilateral system, we have to accept that even though it is stated that all countries are equal and sovereign, the multilateral institutions are deliberately created with structural inequalities. The obvious one is the United Nations, where it is only the UN Security Council that makes decisions that must be implemented. The resolutions of the UN General Assembly are ceremonial and no one is compelled to implement them. And the five permanent members of the UN Security Council possess a veto vote, which means all five must agree for a resolution to be passed. \n\nThe unequal power dynamic of the Security Council is generally catered for by creative means by all other multilateral institutions. Thus, the International Monetary Fund is always headed up by a European, who must be approved by the United States. The World Bank is always headed by an American. The International Criminal Court (ICC) must charge those the Security Council tells it to, even though not all the permanent members of the Security Council have ratified and signed the ICC’s Rome Statute. Essentially, the inequality is multiplied and reinforced.\n\nIt is impossible that these unequal relations could go on forever. But, just like the elves regarded themselves as immortal, in reality the West and its leaders cannot understand why they are not liked. French leaders find it weird that former French colonies would prefer Beijing over Paris. The legions of Western sympathisers in Central and South America, as well as Africa and parts of South East Asia, have a difficult time trying to understand why the masses would cheer Putin and Xi Jinping, but not get excited by Joe Biden or Kamala Harris. \n\nFor too long we have regarded a see-saw as balance. A see-saw is unbalanced or, at most, an uneasy balance, where one is higher and the other lower, only for the reverse to occur. If one remains on top, the other at the bottom need only to walk away for the one on top to be brought back down to earth. As Tolkien’s books reveal, we are made to believe that someone has to be on top or in charge for there to be stability and balance. But that is not stability, that is dominance expressed as stability. \n\nOur three-legged potjie or four-legged chair is balance and stability. We need to reconstruct this world, so that it reflects not who is in charge or is the most powerful but rather how to ensure that everyone has a voice. Africa, together with Central and South America and parts of South East Asia, should not swop the dominance of the West for China, Russia and India. It is important that they join Brics, but they need to recreate the Non-Aligned Movement without India, Russia and China. They can provide Pakistan conditional membership because of its nuclear weapon capability. If Iran goes the nuclear route, they should also be treated in a similar manner. \n\nThe Gen-Z Non-Aligned Movement has to be different to its predecessors; it has to form a trade bloc. The non-nuclear political South has to either unite or accept that either the Western or Eastern elves remain in charge, and that we, like the dwarfs, must hide in the dark and only come out to praise them.\n\nDonovan E Williams is a social commentator. @TheSherpaZA on X.","summary":"Don’t accept that the West (the elves) is in charge as we (the dwarfs and hobbits) labour for them","url":"https://mg.co.za/thought-leader/opinion/2025-08-02-tolkiens-sci-fi-shows-we-need-only-one-ring/","image":"https://mg.co.za/wp-content/uploads/2025/07/Graphic-TL-Don-Instability_page-0001.jpg","video":null,"publish_date":"2025-08-02 16:00:00","author":"Eyaaz,Us President Donald","authors":["Eyaaz","Us President Donald"],"language":"en","source_country":"za","sentiment":0.345},{"id":347621962,"title":"‘Late Show’ Sorrow: Stephen Colbert Grieves over Kamala Failing to Stop ‘Barbarian’ Trump","text":"CBS’s The Late Show host Stephen Colbert grieved over former Vice President Kamala Harris failing to stop President Donald Trump during her first major interview since her 2024 election loss.\n\n“I’m just curious, at any point as you’re counting do you to go, ‘Anybody want to storm the Capitol? Anybody?’ Nobody wants to? Okay,” Colbert asked Harris of her thoughts before certifying the 2024 election results, making a joke about events that had transpired on January 6, 2021.\n\nElsewhere in his conversation with Harris, the Late Show host bizarrely claimed, “The national mood is so grim in many ways, and people are so shocked by the abuses and the abhorrent corruption and the violence against neighbors here happening in the United States.”\n\nColbert also claimed that Congress and the U.S. Supreme Court are giving President Trump “free reign.”\n\n“Less than a year ago, things were very joyful,” Colbert added in an apparent nod to Harris’s failed 2024 presidential campaign, adding, “There was actually a lot of hope associated with your campaign.”\n\n“And there was a lot of promise that we might actually, not only keep this absolute barbarian out of the White House, but also we might actually make progress as a country with the type of people that we wanted to see in office,” the talk show host added.\n\nTrump won both the popular vote and the Electoral College, sweeping every swing stage in the race, proving that Colbert’s definition of “we” was a small fraction of the electorate.\n\nRecent polls reveal Americans are more optimistic under President Trump now than ever before.\n\nColbert also told Harris that she “predicted” what would happen during Trump’s second term, running through a list of things he claims the president has done, before asking Harris if she would like to say “I told you so.”\n\n“You warned everyone about the future under our present president,” he said. “You said he would prosecute his political enemies, he would cut Medicaid, Medicare, he would ignore court orders, he would alienate our allies, he would give massive tax cuts to the rich.”\n\n“And I know you’re not here to say ‘I told you so,’ but would you like to?” Colbert asked.\n\nHarris replied by boasting, “You are correct that I did predict a lot of it.”\n\n“But Stephen, what I did not predict was the capitulation,” she added, to which the Late Show host asked, “That people would roll over for this president?”\n\n“I didn’t see that coming,” Harris answered. “And perhaps it’s naive of me as someone who has seen a lot that most people haven’t seen, but I believed that on some level, you know, there should be many who consider themselves to be guardians of our system and our democracy who just capitulated.”\n\n“And I didn’t I didn’t see that coming,” Harris repeated.\n\nMeanwhile, additional polling found that Democrat leadership is still struggling to gain approval, as Americans reject the party’s agenda.\n\nColbert had Harris on as a guest of soon-to-be canceled The Late Show, confirming his reputation for turning the once-popular program into “group therapy for liberals” — hosting 176 left-leaning guests and only one Republican since 2022.\n\nAlana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.","summary":"Stephen Colbert grieved over former Vice President Kamala Harris failing to stop President Donald Trump during her first major interview since her 2024 election loss.\n\n\nThe post ‘Late Show’ Sorrow: Stephen Colbert Grieves over Kamala Failing to Stop ‘Barbarian’ Trump appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/02/late-show-sorrow-stephen-colbert-grieves-over-kamala-failing-to-stop-barbarian-trump/","image":"https://media.breitbart.com/media/2025/08/GettyImages-2227225776-640x335.jpg","video":null,"publish_date":"2025-08-02 14:25:17","author":"Alana Mastrangelo","authors":["Alana Mastrangelo"],"language":"en","category":"politics","source_country":"US","sentiment":-0.19},{"id":347586004,"title":"'I was not a spy.' 1 year after release from Russia, Paul Whelan details his time in captivity","text":"MANCHESTER, Mich. (WXYZ) — Friday marked one year since Paul Whelan was released after being accused of espionage and spending more than five years behind bars in Russia. The Michigan native said his return home has been a bittersweet experience.\n\nUpon his release, it was hailed as a major diplomatic achievement, especially since he was sentenced to 16 years in a Russian labor camp. But, he said, getting back to a normal life has been difficult to say the least.\n\nWatch our full story with Paul in the video below\n\n A year after his release from Russia, Paul Whelan details his time in captivity\n\nHe now lives with his parents and is trying to reclaim his former life.\n\nWhelan, once a corporate security executive from Novi, Michigan, was taken into custody in Moscow in December 2018 while he was attending a friend's wedding. Russian authorities accused him of spying – charges the U.S. government has called baseless from day one.\n\n\"What was it like when you were first taken?\" I asked.\n\nWatch Carolyn's full interview with Paul Whelan in the video below\n\n One-on-one with Paul Whelan, one year after his release from a Russian labor camp\n\n\"I’m in my hotel room, one of my friends is with me, we’re getting ready to go to the wedding,\" he said.\n\nThat's when he said 20 officers from the Federal Security Service (FSB), the new KGB in Russia, lined the hallways and stormed his room.\n\n\"FSB comes into my room where I am violently arrested. 'Mr Whelan, you’re under arrest for espionage,' and so I said, 'I haven’t committed espionage.' 'Well, we think you have,'\" Whelan said.\n\nWatch below: Paul Whelan thanks Michigan delegation after his release from Russia\n\n Paul Whelan thanks Michigan delegation after his release from Russia\n\nAt first, he told me he thought it was a prank, but \"it got real very quickly.\"\n\nWhelan said about the FSB, \"They do intelligence, counter-intelligence; if somebody needs to be assassinated, they do it.\"\n\nAfter being handcuffed and hauled off to a local FSB station, Whelan said he was told the U.S. had arrested Maria Butina. Butina is a Russian woman who tried to infiltrate conservative U.S. political groups and promote Russia's agenda. She pleaded guilty to conspiring to act as an unregistered agent for Russia.\n\nWhelan said he was told that Russia wanted her badly.\n\n\"'Our idea is we’re going to do a trade, so take it easy, chill in your cell, don’t do anything rash, this will be worked out,'\" Whelan said he was told.\n\nWhelan says he felt like a pawn. He says that as a citizen of four countries, he had four passports on him.\n\n\"Born in Canada to British parents, grandparents are from Ireland, I’m a naturalized American, so I have four passports,\" he said.\n\nWhelan says the FSB claimed the passports were fake and that America had provided them.\n\n\"The foreign ministry of Russia said no, they are real, he is a citizen of four countries, it's legitimate,\" he said.\n\nRussia claimed he was a brigadier general in the defense intelligence agency, and a secret agent collecting names and photos of students with the border guard. He says Russia provided no proof.\n\n\"I was not a spy, I’ve never been an intelligence officer. I don’t have formal ties to any government organization that’s involved with espionage,\" he said.\n\nWhelan was sent to an FSB prison built in the 1800s. He was lodged in a cell with two steel beds bolted to the floor and spent 23 hours a day inside, with one hour in an outside cell.\n\nRELATED STORY | Small town where Paul Whelan's parents live reacts to his release from prison in Russia\n\n\"I could easily put my hands on both walls. It was 15 steps from the doorway to the bed,\" he said.\n\nHe was fed cabbage soup, chicken feed, bread and tea, and sometimes had no access to water.\n\nHe received a lot of media attention. Perp walks and photographs in a cage inside Russian courts, and he would spend a year and a half in prison.\n\n\"There was a lot to be said about the Russians wanting media attention and the media attention being good for me to get my message out back home,\" Whelan said.\n\nA trial judge, a prosecutor and his Russian attorney would decide his fate. In 2020, he was sentenced to 16 years in a labor camp.\n\nWhelan said he was awakened every two hours with a light to his face.\n\n\"It’s sleep deprivation. It’s not good. We say it’s torture, they say it isn’t,\" he said.\n\nHe was also subjected to harsh conditions and limited communication.\n\n\"The camps look like Auschwitz, built in that same manner,\" he said.\n\nHe also dealt with repeated disappointment as he was left out of high-profile prisoner swaps, including the deal that freed WNBA star Brittney Griner.\n\n\"I was optimistic. The U.S. government said they were coming for me and that means something to veterans,\" he said.\n\nHis family was always in the media, pressing for his release.\n\nAt one point, Whelan got so ill that he needed emergency surgery for a hernia. He said he had no medication and no sedation, just an epidural and a mirror to watch, in a hospital he says would remind you of the TV show MASH.\n\nAfter four long years of suffering, Whelan was told to write a request for a pardon from Russian President Vladimir Putin. He said he was told he didn't have to admit anything, just say he wanted a pardon because Moscow needed it.\n\nWhelan’s long-awaited release came alongside 15 other Westerners in a deal that then President Joe Biden called “a feat of diplomacy.” Whelan was first off the plane, greeted by Biden and Vice President Kamala Harris\n\n\"President Biden took the flag off his lapel. He took it off and put it on my shirt. I wear it sometimes. It was a nice moment I’ll remember,\" he said.\n\nBut, he said his long-overdue return to Michigan felt like a gut punch. After 20 days of evaluation in Texas, he had to find his own way home.\n\n\"I came home to no home. My house was gone, no job, cars were gone, and finances had been used over the years to store things and pay attorneys,\" he said.\n\nWhelan says he’s been denied unemployment, health insurance, and at 55, although he’s highly qualified, his six-year work gap puts him out of the running for many jobs.\n\n\"There's a stigma from being in prison, even though I was wrongfully held, I was still in prison,\" he said.\n\nWhelan says he joined the military to give back after America gave his family so much as immigrants. Now he’s back home with his aging parents, who escaped Germany during World War II.\n\nHe also has two new furry friends, Minnie and Muffet, after losing his dog and cat while being held in Russia.\n\n\"They're kind of like support cats,\" he said.\n\nHe's also working to get his life back on track.\n\n\"I’m in the security realm, doing some things for attorneys, advocacy, slowly getting back into the field that I'd been in,\" he said.\n\nHe says there are so many people to thank for their support, including a local dentist, car dealership and others like Rep. Debbie Dingell, who visited his parents, Sen. Elissa Slotkin for sending text messages, and Rep. Haley Stevens.'\n\n\"From that moment to today, she’s been supporting me,\" Whelan said of Stevens.\n\n\"He was taken and stripped of his life, all because of the illegal actions of Putin. He was the cause of his detainment,\" Stevens said.\n\nShe rallied Congress, writing legislation and helping change laws to improve aftercare and treatment of hostages.\n\n\"Paul Whelan’s story has led to real legislation. We passed Hostage Recognition Day, we’ve also carved out resources to dedicate to families as they’re trying to coordinate for their loved ones,\" Stevens said.\n\nHe says he knows he’s got a long way to go in his healing, but like the motto no soldier left behind, he knows he’s got people he can call on for help.\n\n\"I like they haven’t forgotten, they haven’t moved on, they’re still here,\" he said.\n\nThis article was written by Tracy Wujack, Michael Glover and Carolyn Clifford for the Scripps News Group in Detroit.","summary":"Friday, Aug. 1 marks one year since Paul Whelan was freed. After being accused of espionage and spending more than five years in Russia, the Michigan native said his return home has been bittersweet","url":"https://www.scrippsnews.com/politics/russia/i-was-not-a-spy-1-year-after-release-from-russia-paul-whelan-details-his-time-in-captivity","image":"https://ewscripps.brightspotcdn.com/dims4/default/5b1d7bd/2147483647/strip/true/crop/899x472+0+14/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F49%2F7d%2F68750b1548d380a19d0a9f704636%2Fdownload.png","video":null,"publish_date":"2025-08-02 14:13:46","author":"Scripps News Group","authors":["Scripps News Group"],"language":"en","source_country":"us","sentiment":0.06},{"id":347579302,"title":"Nolte: Your Film School Assignment, Week One – One Movie Per Day","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBART\n\nTariff Deals\nTrump Interview\nNYC Shooting\nRussia Hoax Exposed\n\nIsrael vs Hamas\n\nNolte: Your Film School Assignment, Week One – One Movie Per Day\n\n Screen Archives/Getty Images\n\nJohn Nolte2 Aug 2025 \n\nEntertainment\n\nmovie reviews \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\n‘Late Show’ Sorrow: Colbert Grieves over Kamala Failing to Stop Trump\nBBD: Trump Vindicated by Jobs Slump; Powell Humiliated\nICE Detainer on Illegal Alien Accused of Kidnapping, Sexually Assault in TX\nUkraine Drone Strikes on Russia Leave Three Dead, Says Moscow\nKamala Harris Mocked for Writing 'Word Salad' Book About Failed Campaign\nTOO LATE: The U.S. Economy Added 73,000 Jobs In July\nTrump's 'Most Secure Border in History' with Record Low Arrests in July\nAl Sharpton: Trump Has Compromised the 'Integrity of the Smithsonian'\nMeloni's Italy Blasts EU Court's Migration Ruling as Attack on Sovereignty\nBye Bye Bias: Corporation for Public Broadcasting Begins Shut Down\n\nFROM THE HOMEPAGE\n\nExclusive — Rep. Jim Jordan: UK, EU Issuing ‘Direct Attack’ on Free Speech, Like Biden Administration\nMeloni’s Italy Blasts Top EU Court’s Migration Ruling as an Attack on National Sovereignty\nTuberville: Ban Iranian, Chinese Student Visas\nICE Lodges Detainer on Illegal Alien Accused of Kidnapping, Sexually Assaulting Houston Woman\nUkraine Drone Strikes on Russia Leave Three Dead, Says Moscow\nNolte: Your Film School Assignment, Week One – One Movie Per Day\nMaher: Dems Have to Decide ‘Are You on the Side of Western Civilization’ or ‘Are You on the Side of the Terrorists?’\nHalf Million Young Catholic Pilgrims Descend on Rome for Jubilee of Youth\nTwo Arson Attacks on Major German Railway in Two Days, Anti-Economy Ultra-Anarchists Take Credit\nDem Rep. Casar: Trump ‘Trying to Rig the Election Before Anybody Gets a Chance to Vote’\nHochul: I ‘Have a Lot of Alignment’ with Mamdani ‘on Issues Like Affordability’\nMaher: ‘I Love’ Strikes that Mean Iran Won’t Get Nuke ‘Any Time Soon’ \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"Here is your weekly assignment of movies to watch to increase your Movie IQ, along with a link informing you of your streaming options…\n\n\nThe post Nolte: Your Film School Assignment, Week One – One Movie Per Day appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/08/02/nolte-your-film-school-assignment-week-one-one-movie-per-day/","image":"https://media.breitbart.com/media/2025/07/charge-of-the-light-brigade-getty-640x335.jpg","video":null,"publish_date":"2025-08-02 13:59:19","author":"John Nolte","authors":["John Nolte"],"language":"en","source_country":"US","sentiment":-0.193},{"id":347568860,"title":"CNN panel shreds Harris' Colbert interview for her lack of solutions after 'six months to figure it out'","text":"Former Vice President Kamala Harris was criticized on a Friday CNN panel for delivering vague answers during her interview with host Stephen Colbert the night before. During the \"Late Show\" interview, Harris spoke about her choice not to run for the governorship of California, making broad generalizations about how, \"Just for now, I don‘t want to go back in the system. I think it‘s broken.\" On CNN, NOTUS White House Correspondent Jasmine Wright, who covered the Harris campaign, objected to Harris using \"amorphous phrasing\" like \"the system,\" and doubted whether Americans could grasp what she was talking about. KAMALA HARRIS RULES OUT 2026 RUN IN HER HOME STATE OF CALIFORNIA \"I think what people want are solutions, and she has not said a single one,\" Wright said. \"And consistently, people want her to be descriptive about what she says is wrong. And I don‘t think that that interview, she was able to do that. And it‘s a shame because she‘s had six months to figure it out.\" \"She hasn‘t said anything really for six months,\" panel host Manu Raju agreed. CNN senior reporter Aaron Blake commented on how there are multiple other prominent Democrats, like former Presidents Barack Obama and Joe Biden, talking about how America’s institutions are under attack, or how American democracy is in particularly dark times, but there is one key flaw. \"But we don‘t see, like, a very consistent message from Democrats on this,\" Blake said. \"Maybe that‘s because they don‘t have somebody with kind of the heft and the constant presence in our daily lives to drive that message. But it seems like something where they pop up every once in a while and say, ‘Hey, this situation is pretty bad.’ And then they kind of fade away and it just doesn‘t seem like Democrats have been able to drive that message very well.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"You know, she was so guarded last night. I mean, I was a bit surprised because she had been gone. She‘s now not running for office, at least at the moment. And she was not, perhaps, as forthcoming about some of the issues with the campaign than maybe what I personally expected,\" Raju said, before playing a clip of Mark Cuban saying Harris is far more charismatic behind closed doors. AP White House reporter Michelle Price argued that Thursday night’s interview stood out because \"she was especially robotic, but that is a longstanding problem for her. She even looked physically uncomfortable, like her shoulders seemed up into her neck most of that interview, which was just striking because, you know, she has nothing to lose right now. She could be energetic or much more candid than she was.\" Price added further that the interview \"seemed more like a lament for where things went last year, where the party is now. There was no message of leadership or moving forward, or even clarity on what, again, like Jasmine said, what is the system? Is she talking about the California gubernatorial system, the election system?\" CLICK HERE TO GET THE FOX NEWS APP Wright argued that Harris is falling uniquely short of her responsibility to candidly explain what went wrong with the election. \"I think that after how damaging 2024 was, not just for her personally, but for the Democratic Party, I think that what is required of her is to really be honest about what went wrong in her campaign, what went wrong with the party, and what she wants to do,\" she said. \"And yes, maybe that happens on that listening tour that she‘s going to go on in December. But I think people want those answers from her now. And she had the time to create them.\"","summary":"A CNN panel criticized Kamala Harris for delivering vague, amorphous answers during her Colbert interview, with critics saying she failed to provide solutions.","url":"https://www.foxnews.com/media/cnn-panel-shreds-harris-colbert-interview-her-lack-solutions-after-six-months-figure-out","image":"https://static.foxnews.com/foxnews.com/content/uploads/2023/05/KH.jpg","video":"https://www.foxnews.com/video/6376466066112","publish_date":"2025-08-02 13:58:36","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"us","sentiment":-0.328},{"id":347566340,"title":"The aftershocks of L.A.'s summer of ICE will live on","text":"After the 1994 Northridge earthquake, parks across the San Fernando Valley filled with families left homeless by the destruction or simply too afraid that an aftershock might pancake their home. An estimated 14,000-20,000 people lived in those tent cities, and many were Latino immigrants who had nowhere else to go. Noel Mendoza, a migrant from Nicaragua who spent two weeks camping at one park because she didn’t feel safe in her crack-filled Canoga Park apartment, told The Times back then: “I was a refugee there and now I’m a refugee here.” It’s one thing to seek safety in public spaces, as one tent city dweller said, to have nothing between oneself and the stars. But what if being out in public is the thing that places you at risk? This forgotten piece of seismic history came to mind as I listened this week to experts talking about how L.A.’s summer of ICE has brought waves of emotional struggles to immigrant families. There are so many facets to the raids — the legal issues, questionable tactics, protests, economic impacts, political fallout — that the emotional fallout easily gets lost. We are now nearly two months into President Trump’s immigration crackdown, which has led to more than 3,000 arrests in Southern California alone. The raids have upended countless lives. But we’ve reached that inevitable moment in the story when some begin to turn away. What shocked in June seems like just part of the new normal in August. It’s summer. Vacations. Jeffrey Epstein, the tsunami that wasn’t. Parts of Los Angeles are moving on, as we do no matter the calamity. But for those in the middle of the story, there is no escape. Just ask someone who lost their home in January. Or someone who lost a job, who had to go underground or whose loved one was deported after a U.S. Immigration and Customs Enforcement raid. I attended a forum this week on mental health and the raids put together by Boyle Heights Beat, the community news site that has been aggressively covering the ICE operations with news and resource guides. Experts offered a sober window into how the raids have impacted the mental health, individually and collectively, of immigrants and their communities. Some quotes that stayed with me: “I see a white van and my body automatically freezes.”“You become a caregiver.”“You have survivor’s guilt.”“Children step up more to help their parents, and they internalize their parents’ fears.”The forum particularly illuminated secondary traumas, such as the burden on children who are here legally helping their parents; the new, sudden role of caregiver for people who must now look out for others whose lives are on hold; and the increased irritability, drinking and guilt that come with all this stress. The message of the experts was clear: These times require strong coping skills and a keen sense of your own limits, even if that sometimes means turning off the news and finding moments of joy amid the uncertainty. In the days after the Northridge quake, the tent cities became a source of fascination to me and so many others trying to make sense of what had just happened. I remember being deeply moved at the way large extended families set up little cul-de-sacs under the trees of a neighborhood park, taking comfort in having all their loved ones safely in one place as the earth beneath them rumbled. As someone who cowered alone each night in my tiny apartment, wondering whether that vibration was a new quake or my upstairs neighbor rewatching “Star Wars” on his VCR, their peace brought me comfort. The camp became one symbol for some political activists who charged officials were not paying enough attention to quake victims in poorer, Latino communities. There were protests and news stories, and more aid flowed to the east Valley. Eventually even the great quake receded from the news. The aftershocks lessened. The broken freeways were repaired. The tents disappeared. Life moved on. The end remains elusive for those dealing with the ICE sweeps. And this uncertainty is why the experts urged people to pace themselves and accept what they can and cannot do. As one said, “If you can’t take care of yourself, you can’t take care of other people.” Kamala Harris announced that she is not running for California governor. Now, her options are wide open.Newsom provided new details about his plan for redistricting fight with Trump.California and 15 other states are suing the Trump administration over efforts to end gender-affirming care for youth.The Trump administration has taken unusual steps to keep Essayli as L.A.’s top federal prosecutor.This summer has been generally mild, but now August is bringing triple-digit temperatures to the Southland.‘This fire could have been prevented’: This is how utilities fought the removal of old power lines.Gov. Newsom seeks to raise $18 billion to shore up the state wildfire fund.The Trump administration froze $200 million in UCLA science and medical research funding, citing the university’s alleged antisemitism.The Justice Department ruled UCLA violated Jewish students’ civil rights with ‘deliberate indifference.’L.A. Mayor Karen Bass issued an executive order restricting duplexes in Pacific Palisades.One homeowner faced $500 daily HOA fines for an unapproved door. A new state law saved her.Despite new sales tax to reduce homelessness, LAHSA cut back an effective path to housing.Know your rights: Here’s an immigration resource guide for L.A.The Corp. for Public Broadcasting says it is shutting down after federal funding cuts.Kamala Harris tells Colbert, in first interview out of office, that the U.S. system is ‘broken.’ Opinion: Who should Democrats back, “a straight, old white guy” or Kamala Harris?Opinion: Anaheim finally has a bookstore that ‘feels like home.’ ‘Feral’ honeybees are hogging all the pollen in SoCal. Here’s how to help our native bees.Their tiny L.A. apartment is an absolute explosion of color.L.A. Affairs: It only took me 3 dates with a woman and her wife to find my best self.Day trip: This hidden rural oasis makes for a splendid day trip — and it’s just an hour from L.A.Museums: Dapper puppets in a fantasy forest? Step inside this SoCal spot filled with handmade wonder.Food: Here are the tastiest, most culturally specific doughnuts in L.A.Book review: Ella Berman’s ‘L.A. Women’ is a breezy retro novel with bite — and lots of familiar characters.Documentary review: A landmark of combat journalism, ‘2000 Meters to Andriivka’ is a pummeling dispatch from Ukraine’s frontline.🥗 Here's a recipe for charred okra and corn salad with spicy sausage vinaigrette.✏️ Get our free daily crossword puzzle, sudoku, word search and arcade games. A selection of the very best reads from The Times’ 143-year archive. Jim Rainey, staff writer Diamy Wang, homepage intern Izzy Nunes, audience intern Kevinisha Walker, multiplatform editor Andrew Campa, Sunday writer Karim Doumar, head of newsletters How can we make this newsletter more useful? Send comments to essentialcalifornia@latimes.com. Check our top stories, topics and the latest articles on latimes.com.","summary":"Your morning catch up: The emotional toll of immigration raids, Kamala Harris' options and more big stories","url":"https://www.latimes.com/california/newsletter/2025-08-02/immigration-raids-are-carving-deep-emotional-scars-on-families-and-communities","image":"https://ca-times.brightspotcdn.com/dims4/default/5ce2a5f/2147483647/strip/false/crop/5088x3392+0+0/resize/1486x991!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2e%2F67%2F14c05089446bb946770eb26404b8%2F1515664-es-0725-obeth","video":null,"publish_date":"2025-08-02 13:30:00","author":"Shelby Grad","authors":["Shelby Grad"],"language":"en","source_country":"US","sentiment":0.155},{"id":347560970,"title":"Kamala Harris' New Book Gets Brutal Reception","text":"The announcement by Kamala Harris, former vice president, that she is publishing a book about her failed 2024 presidential campaign, titled 107 Days, with reference to the period she spent vying with Donald Trump, has been panned by conservative critics.Newsweek contacted Harris for comment on Friday via email outside of regular office hours.Why It MattersHarris became the 2024 Democratic presidential nominee in August after Joe Biden dropped out of the race amid concern within his party over the then-president's age and cognitive state.However, Harris went on to lose the 2024 presidential election, picking up 226 Electoral College votes against 312 for Trump. On Wednesday, Harris announced she won't run to be governor of California in 2026, sparking speculation she could be considering a second White House bid in 2028.What To KnowHarris announced she has written on a book about the 2024 presidential campaign, to be published by Simon & Schuster and titled 107 Days, on Thursday in a post on her X account. The former vice president said: \"Since leaving office, I've spent a lot of time reflecting on those days and with candor and reflection, I've written a behind-the-scenes account of that journey.\"The news received a mixed reaction online, with conservatives in particular highly critical, though some commentators did say they were looking forward to reading it.During an appearance on CNN's The Source With Kaitlan Collins, the network's senior reporter Edward-Isaac Dovere said: \"And there's going to be a book tour and one of the things that I talk to people who have been dealing with it with her is that she really struggles with what she is going to say about Joe Biden.\"In an X post response to Harris, White House Deputy Press Secretary Abigail Jackson said: \"Writing a memoir about being a loser is a choice.\"Writing for The New York Post, columnist Kirsten Fleming said Harris's book would be a \"diary of defeat,\" adding: \"Anything written on her ill-fated attempt to win the White House should be a grim autopsy on a spectacularly bad campaign with a historically terrible candidate.\"Stephen Miller, the current U.S. Homeland Security adviser, wrote on X: \"What is Kamala Harris' book even going to be about? All the interviews she refused to do? Why she chose Governor Jazz Hands over the Jewish guy? 4 chapters on her endorsement from Dick Cheney?\"Harris picked Minnesota Governor Tim Walz as her running mate over Josh Shapiro, the Democratic governor of Pennsylvania.On popular Fox News show The Five, presenter Lisa Kennedy said: \"I argue the only book that's worth reading is if she's actually honest about the enemies she will claim tanked her chances.\"Former Democratic Congressman Harold Ford Jr. agreed: \"If she's able to get a lot of book sales hurray and good for her, but I hope to your point she honestly confronts some of the things we all saw happening in that campaign, and if it does nothing more, it will give the next nominee on the Democratic side some lessons about what he or she should do and mainly what they should not do.\"However, conservative commentator Jesse Watters was more positive, suggesting the book could push Harris toward a 2028 White House run.He said: \"In October/September the book publishes … and then she does the book tour and the tour reconnects her with the American people, the crowds, the donors and kind of launches her toward the next year's midterms and then she'll campaign for people and she'll raise money for them and she hopes the Democrats win the midterms and that kind of sets her up.\"On his popular The Breakfast Club podcast, Charlamagne tha God, real name Lenard McKelvey, said: \"I don't know if she should run again, but I'd definitely like to see her write a book, I definitely would like to see her start a podcast and just build a real connection with people.\"What People Are SayingSimon & Schuster Chief Executive Officer Jonathan Karp said: \"107 DAYS captures the drama of running for president better than just about anything I've read. It's one of the best works of political nonfiction Simon & Schuster has ever published. It's an eyewitness contribution to history and an extraordinary story.\"Senior Vice President and Publisher of 37 Ink Dawn Davis said: \"There is so much to be gleaned from these pages—to read the book is to be a fly on the wall as critical decisions were made and key team members tapped, all in such a dramatic moment in our history, all in just 107 days.\"Speaking to CNN's Kaitlan Collins about Harris in 2024, David Axelrod, formerly Barack Obama's chief campaign strategist, said: \"It's clear that you read her statement, that she is setting herself up to run.\"Appearing on MSNBC Susan Page, the Washington D.C. bureau chief for USA Today, said: \"Democrats historically have not been interested in nominating again someone who ran, got the nomination and failed.\"What Happens NextSimon & Schuster said that Harris's book is scheduled for publication on September 23, 2025.","summary":"Harris announced that she is publishing a book amid speculation she could run for the presidency again in 2028.","url":"https://www.newsweek.com/kamala-harris-new-book-gets-brutal-reception-2107553","image":"https://d.newsweek.com/en/full/2694857/kamala-harris-book.jpg?w=1600&h=900&q=88&f=85ed51bcfdb72c1e0b341efcce7f9492","video":null,"publish_date":"2025-08-02 13:19:49","author":"James Bickerton","authors":["James Bickerton"],"language":"en","source_country":"us","sentiment":-0.31},{"id":347562840,"title":"Kamala Harris reveals her next career move after confirming she's not running for governor of California","text":"Kamala Harris has just revealed her next career move after confirming she's not running for governor of California.\n\nThe former Democrat vice president, who represented California between 2017 to 2021 and also served as the state's attorney general for more than five years, has confirmed she will not be running for governor again.\n\nMany voters expected Harris to run for government of California after her election loss against Donald Trump last year.\n\nYet, while on The Late Show with Stephen Colbert, Harris spoke about her new book, 107 Days, and revealed she's apparently taking a break from politics.\n\nColbert pointed out that Harris beat every other candidate in early polling, and asked why she has decided not to run for governor of California.\n\nHe said: \"Why are you sitting this out? Are you saving yourself for a different office?”\n\nWhile Harris said no, the crowd broke out into applause and cheers of 'yes'.\n\n“It’s perhaps, is more basic than that, I am a devout public servant,\" Harris explained. \"I have spent my entire career in service of the people.”\n\nShe confessed she'd thought 'a lot about running for governor', but ultimately decided it was time for a break - and for one good reason.\n\n\"Recently, I made the decision, at least for now, I don’t want to go back in the system, I think it’s broken,\" she concluded.\n\nShe reiterated her belief that the US system and our 'most fundamental principles' in democracy 'are not as strong as they need to be'.\n\nInstead, she revealed she's going to use her time-out wisely to travel across the states, converse with people and importantly listen to them, adding that she doesn't want to appear 'transactional' when she's asking for their vote.\n\n\"At this time, I will continue serving and leading outside of elected office,\" Harris had announced earlier.\n\n\"I’m eager to reconnect with the American people, support Democratic candidates nationwide who are committed to bold leadership, and share more about my next steps in the months to come,\" she added.\n\nSince her crushing defeat to Trump, Harris has seemingly taken a backseat, though more information has resurfaced about what transpired when former president Joe Biden stepped down to let his VP run for leadership instead.\n\nBiden pulled out of the race by the end of July last year, mere months before the monumental general election.\n\nThe move meant Harris had a matter of weeks to organize her campaign.\n\nCome election time, Trump gained more than 77 million votes against Harris' 75 million.\n\nOn January 20, the Republican returned to the White House for a second term and was formally sworn in as the 47th US President.","summary":"![CDATA[The former vice president has said she would not be running for governor]]","url":"https://www.unilad.com/news/politics/kamala-harris-next-career-not-governor-591481-20250802","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blt245ec95fce020388/688e07b2f7c98d45a1d62d1d/kamala-career-move.png","video":null,"publish_date":"2025-08-02 12:50:00","author":"Liv Bridge","authors":["Liv Bridge"],"language":"en","source_country":"gb","sentiment":-0.173},{"id":347551418,"title":"MIKE DAVIS: Confirmation of Emil Bove a triumph of new over old","text":"The Senate's confirmation this week of President Trump’s pick, Emil Bove, to the U.S. Court of Appeals for the Third Circuit with a razor-thin 50–49 vote was a huge win for conservatives, despite the cheap shots from Democrats and nominal Republican senators Susan Collins and Lisa Murkowski. Bove isn’t just qualified, he’s exceptional. He clerked for top judges and made his name as a sharp, tough prosecutor in New York. Even the left-leaning American Bar Association gave him their highest rating: \"Well Qualified.\" That’s a big deal coming from an organization that rarely plays fair with conservative nominees. TRUMP PICK EMIL BOVE CONFIRMED AS FEDERAL JUDGE AFTER FURIOUS DEMOCRAT WALKOUT, WHISTLEBLOWER COMPLAINTS So why all the pushback? Simple. Bove stood up when it mattered. When President Trump was under constant legal attack, Bove was one of the few who fought back. He played a key role in keeping the radical left from throwing Trump in prison on bogus charges. That alone made him a target for Trump-haters across the spectrum: Democrats, Never Trumpers, and the establishment legal elite. As principal associate deputy attorney general, Bove also helped stop the politically motivated prosecution of New York City Mayor Eric Adams. And he did it by standing up to out-of-control federal prosecutors in the Southern District of New York, the ones who like to pretend they run their own \"sovereign district\" separate from the rest of the country. Bove told them to follow orders or leave. They left. That’s leadership. Some in the conservative legal world weren’t thrilled with Bove's confirmation to a lifetime term, either. The Wall Street Journal recently ran a piece worrying that Bove’s confirmation might make some Republican-appointed judges refuse to retire. Here’s the truth: Those judges had their chance to retire during Trump’s first term and didn’t. That’s on them, not Bove. Others breathlessly claimed Bove’s confirmation marked the end of the conservative legal movement. That’s nonsense. If Kamala Harris had won wthe presidency and stacked the courts with left-wing radicals, the damage would’ve been catastrophic. Instead, President Trump is putting solid, constitutionalist judges on the bench, judges like Emil Bove. Of course, the opposition resorted to the same tired smear tactics they always do. So-called \"whistleblowers\" came forward with flimsy claims. One former DOJ lawyer, Erez Reuveni, accused Bove of telling officials to ignore court orders, then turned around and signed legal documents confirming the orders were followed. On top of that, Reuveni undercut the Trump administration’s immigration cases and violated attorney-client privilege. He was fired, and rightfully so. This is who the anti-Bove crowd chose as their star witness. Two more \"whistleblowers\" popped up just before the final vote — classic last-minute character assassination. One had no firsthand knowledge. The other’s allegations were never made public by Senate Democrats. Sound familiar? It should. It’s the same playbook they used against Justice Kavanaugh. Remember the ridiculous accusations, including the one about a gang-rape boat? All lies. All desperate. All failed. The Article III Project proudly fought for Bove’s confirmation. This wasn’t just about one seat. This was about pushing back against the old guard — the milquetoast Republicans and the liberal machine — and ushering in a new generation of bold, fearless constitutionalists. Tuesday’s vote showed the old tricks don’t work anymore. The left couldn’t smear their way to a win. The establishment couldn’t stall this one. Trump’s nominee made it through. They’ll keep trying to derail the president’s agenda, especially when it comes to the courts. But we’ll keep fighting. Because what’s at stake isn’t just the next judge. It’s the future of the Constitution, the rule of law, and the rights of the American people. The old guard lost. America won. And this is only the beginning. Mike Davis is the founder and president of the Article III Project.","summary":"Conservative legal victory as Senate approves Emil Bove for Third Circuit despite last-minute whistleblower allegations and establishment opposition","url":"https://www.foxnews.com/opinion/mike-davis-confirmation-emil-bove-triumph-new-over-old","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/06/emil-bove-hearing.jpg","video":"https://www.foxnews.com/video/6374871874112","publish_date":"2025-08-02 11:42:47","author":"Mike Davis","authors":["Mike Davis"],"language":"en","source_country":"US","sentiment":-0.062},{"id":347529070,"title":"Kamala Harris shares eerie reason she only uses wired earphones and it's left people very divided","text":"Kamala Harris has sparked an unlikely debate online over the use of wired earphones, after telling a talk show host that she only ever wears them for an important reason. \n\nRemember the days when all we had were wired earphones and a variety of headphones?\n\nGod forbid you ever left them in your bag or pocket and reached in to find that they’d tangled themselves to the point where it would take a skilled set of hands to unravel them.\n\nBut then came the technological revolution which brought us wireless everything.\n\nNo longer did we have to wear those annoying things around our necks, and working out, running, moving around, became that much easier to do when listening to music.\n\nAnyway, it seems like while we were all celebrating about not having to use wired earphones anymore, former presidential candidate, Kamala Harris wasn’t willing to get with the times.\n\nWhen appearing on Stephen Colbert’s late night talk show, she explained why she’s sticking with wired earphones and she’s unlikely to change her mind.\n\nAccording to her, it’s all about protecting her privacy.\n\nHarris claimed that wired earphones are much safer than wireless, making it the ideal choice for those who don’t want their conversations listened in on.\n\nShe made the admission after an image of herself dressed in sweats while wearing wired earphones to make over 100 calls one day as vice president was shown. \n\nStating she gets made fun of for her love of the wired buds, she said it’s just what she wears because of their secure properties.\n\n\"I know I've been teased about this, but I like these kinds of earpods that have the thing [she points to the wire] because I served on the Senate Intelligence Committee,\" she said. \n\n\"I have been in classified briefings, and I'm telling you, don't be on the train using your earpods thinking somebody can't listen to your conversation.\"\n\nShe added: \"I'm just telling you that it's a little more secure.\"\n\nThis isn't the first time she's spoken about her preference for wired earphones. \n\nBack in 2021, Harris said she prefers them as she believes Bluetooth headphones pose a 'security risk', as per Newsweek.\n\nBut it doesn’t mean everyone agrees.\n\nIn the comments of a video posted of The Late Show with Stephen Colbert, people didn’t know how to feel about her suggestion to wear wired earphones.\n\nSomeone said: \"It may be true. But last time I checked, they actually have a dedicated security chip. Versus the ones that have wires don’t.\"\n\nAnother said, confused: \"Did this make any sense to anyone else?\"\n\nWhile a third argued: \"The bluetooth connection on airpods is encrypted.\"","summary":"![CDATA[Kamala Harris has spoken of her love for wired earphones several times ]]","url":"https://www.unilad.com/news/politics/kamala-harris-wired-earphones-why-969373-20250802","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/bltd4a9079f62e148d4/688de0103a9f7c0265a99490/kamala-harris.png","video":null,"publish_date":"2025-08-02 11:04:29","author":"Britt Jones","authors":["Britt Jones"],"language":"en","source_country":"gb","sentiment":-0.419},{"id":347594532,"title":"'Why Have People Not Risen Up?': Brooks Praises Harris's Colbert Interview","text":"New York Times columnist and the allegedly conservative half of Friday’s PBS News Hour’s weekly news recap, David Brooks, praised former Vice President Kamala Harris’s recent interview with Stephen Colbert and agreed with her that “civic capitulation” to President Trump is “a real thing.” Meanwhile, MSNBC host Jonathan Capehart explained he quit his job at The Washington Post because he could not see the value in “talking about the positive things happening in the country.”\n\nFollowing a clip of the Harris-Colbert interview, host Amna Nawaz asked Brooks, “David, it's a system she described as broken. What do you make of that response?”\n\nBrooks first lamented, “one thing I didn't like what she said. The system is broken. Running for governor — the gubernatorial system is not broken. Governors all around the country are doing wonderful work. And Washington is a little broken, but running for governor, I think, would be a nice way to serve the country. But that's totally up to her, obviously.”\n\n However, Brooks was otherwise positive, “The part where I totally agreed with her was, she made a point about capitulation. And this has shocked me too, that, in Israel, when Bibi tried to do these judicial reforms before October 7, hundreds of thousands of people got to the street and they did it for month after month after month. And now we have a similar situation.”\n\nThat’s an odd analogy. Without getting too deep in the weeds of Israel’s domestic debates about its supreme court, it should simply be noted that trying to project our domestic politics onto a foreign country misses the nuances that differentiate the two.\n\nHowever, Brooks then returned to Trump and mourned, “And this happens all across the world. When somebody tries to centralize power, the people rise up. And why have the people not risen up? And everybody's cutting separate deals. And I see business leaders, university presidents, other people laying low and not trying to rise up. And, therefore, there's strength in numbers, and we're not using that strength. Trump can pick people off one and another. And so I think that civic capitulation that she mentioned, that is a real thing.”\n\nWhat are people supposed to rise up against? Does Brooks really want to argue that universities don’t have an anti-Semitism problem? Does he really want to go to bat for politically toxic DEI initiatives? Apparently he does.\n\nLater, Nawaz would conclude by giving Capehart the floor, “Jonathan, before we go, folks will have noticed that we introduced you slightly differently tonight than we usually do. We should point out, after nearly two decades at The Washington Post, you recently made the decision to leave. I just wanted to give you a chance to speak directly to our audience to tell them why.”\n\nCapehart explained, “Well, the direction of the opinion section changed. Jeff Bezos, the owner of The Washington Post, as is his right, decided that he wanted the section to focus on the twin pillars of personal liberties and free markets. And it became clear, as time went along, and especially when he chose a new leader for the section, that there was just not going to be any room for a voice like mine, especially when we were told that we would have to be unapologetically patriotic in talking about the positive things happening in the country.\n\nHow can you talk about the positive things happening in the country when the rest of the house is engulfed in flames and the foundation is flooding? I wanted to go someplace where my voice would be heard.”\n\n The whole liberal freak-out over the Post is odd. While conservatives may like the idea that one of the country’s major papers will be friendlier, a current glimpse at the Post’s opinion section does not portray the positive vibes Capehart is railing against. Like the concept of a bias monitor at CBS, just the idea that a liberal space may become slightly less liberal is appalling to those who have become accustomed to not having their echo chambers punctured.\n\nHere is a transcript for the August 1 show:\n\nPBS News Hour\n\nAMNA NAWAZ: David, it's a system she described as broken. What do you make of that response?\n\nDAVID BROOKS: First, I give people who've lost a presidential race a lot of grace. It's apparently brutal. Bob Dole used to joke, “What's it like to lose?” He says, “Oh, I sleep just like a baby. I wake up every three hours screaming.”\n\nAnd so it's super hard to be in that position. One thing I really like what she said, and one thing I didn't like what she said. The system is broken. Running for governor — the gubernatorial system is not broken. Governors all around the country are doing wonderful work. And Washington is a little broken, but running for governor, I think, would be a nice way to serve the country. But that's totally up to her, obviously.\n\nThe part where I totally agreed with her was, she made a point about capitulation. And this has shocked me too, that, in Israel, when Bibi tried to do these judicial reforms before October 7, hundreds of thousands of people got to the street and they did it for month after month after month. And now we have a similar situation.\n\nAnd this happens all across the world. When somebody tries to centralize power, the people rise up. And why have the people not risen up? And everybody's cutting separate deals. And I see business leaders, university presidents, other people laying low and not trying to rise up.\n\nAnd, therefore, there's strength in numbers, and we're not using that strength. Trump can pick people off one and another. And so I think that civic capitulation that she mentioned, that is a real thing.\n\nNAWAZ: Jonathan, before we go, folks will have noticed that we introduced you slightly differently tonight than we usually do. We should point out, after nearly two decades at The Washington Post, you recently made the decision to leave.\n\nI just wanted to give you a chance to speak directly to our audience to tell them why.\n\nJONATHAN CAPEHART: Well, the direction of the opinion section changed. Jeff Bezos, the owner of The Washington Post, as is his right, decided that he wanted the section to focus on the twin pillars of personal liberties and free markets. And it became clear, as time went along, and especially when he chose a new leader for the section, that there was just not going to be any room for a voice like mine, especially when we were told that we would have to be unapologetically patriotic in talking about the positive things happening in the country.\n\nHow can you talk about the positive things happening in the country when the rest of the house is engulfed in flames and the foundation is flooding? I wanted to go someplace where my voice would be heard.","summary":"New York Times columnist and the allegedly conservative half of Friday’s PBS News Hour’s weekly news recap, David Brooks, praised former Vice President Kamala Harris’s recent interview with Stephen Colbert and agreed with her that “civic capitulation” to President Trump is “a real thing.” Meanwhile, MSNBC host Jonathan Capehart explained he quit his job at The Washington Post because he could not see the value in “talking about the positive things happening in the country.”\n\nFollowing a clip of the Harris-Colbert interview, host Amna Nawaz asked Brooks, “David, it's a system she described as broken. What do you make of that response?”\n\n \n\n\n\n\n\n \n\nBrooks first lamented, “one thing I didn't like what she said. The system is broken. Running for governor — the gubernatorial system is not broken. Governors all around the country are doing wonderful work. And Washington is a little broken, but running for governor, I think, would be a nice way to serve the country. But that's totally up to her, obviously.”\n\n However","url":"https://www.newsbusters.org/blogs/nb/alex-christy/2025/08/02/why-have-people-not-risen-brooks-praises-harriss-colbert-interview","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-08/2025-08-01-PBS-PBS%20News%20Hour-Brooks.jpg?itok=F5RwKrBQ","video":null,"publish_date":"2025-08-02 09:48:00","author":"Alex Christy","authors":["Alex Christy"],"language":"en","source_country":"US","sentiment":-0.496},{"id":347511442,"title":"Josh Hawley wants to give you money, and the pope gets a Chicago-to-Rome delivery: The news quiz","text":"A clothing company sparks outrage, former Vice President Kamala Harris is writing a memoir, and “Coach Prime” announces a cancer diagnosis. Test your knowledge of the week in news, and take last week’s quiz here.","summary":"A clothing company sparks outrage, former Vice President Kamala Harris is writing a memoir, and “Coach Prime” announces a cancer diagnosis.","url":"https://www.nbcnews.com/news/news-quiz/josh-hawley-tariffs-news-quiz-rcna222296","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-08/250801-news-quiz-lr-e1e9df.png","video":null,"publish_date":"2025-08-02 09:15:00","author":"Jeremy Mikula,Jocelyn Shek","authors":["Jeremy Mikula","Jocelyn Shek"],"language":"en","source_country":"na","sentiment":0.072},{"id":347497832,"title":"Chemical Abortions, Sex Education: March for Life President Addresses Future of Pro-Life Movement","text":"There has been a significant shift in the fight to protect the unborn since Roe v. Wade was overturned in the summer of 2022 with the Supreme Court’s ruling in Dobbs v. Jackson Women’s Health Organization. \n\nNow, the March for Life is holding state-based marches across the country and continues to work to shift the way the culture views the unborn. \n\nJennie Bradley Lichter, who became the new president of the March for Life in February, says there is a need to highlight the joy, optimism, and compassion within the pro-life movement.\n\nLichter joins “Problematic Women” to share her own pro-life journey, and discuss how the pro-life movement is effectively working to save the unborn even as chemical abortions have become the most used form of abortion in the U.S. Lichter also discusses her work during the first Trump administration and answers the question: Can women have it all? \n\nAnd speaking of culture: Have you seen the new American Eagle ad featuring actress Sydney Sweeney and the radical Left’s response? We give our take on why a classic marketing technique has the far Left crying “racism” and “fascism.”\n\nPlus, former Vice President Kamala Harris is coming out with a book on her “107 Days” of a presidential campaign. Should be a fun read. We react to the news. All this and more on this week’s edition of “Problematic Women.” \n\nEnjoy the show!","summary":"There has been a significant shift in the fight to protect the unborn since Roe v. Wade was overturned in the summer of 2022 with... Read More\n\n\nThe post Chemical Abortions, Sex Education: March for Life President Addresses Future of Pro-Life Movement appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/08/02/chemical-abortions-sex-education-march-life-president-addresses-future-pro-life-movement/","image":"https://www.dailysignal.com/wp-content/uploads/2025/08/250801_March.jpg","video":null,"publish_date":"2025-08-02 09:00:00","author":"Virginia Allen","authors":["Virginia Allen"],"language":"en","source_country":"us","sentiment":0.274},{"id":347495070,"title":"WATCH: Dem senator agrees with GOP that Trump's making progress on trade war","text":"Pennsylvania Democratic Sen. John Fetterman admitted that his party had gotten it wrong about President Donald Trump’s tariffs, saying that, so far, the U.S. trade war is \"going well.\" Asked by Fox News Digital whether he thought the Trump administration was winning the trade war, Fetterman responded, \"Absolutely.\" \"I'm a huge fan of Bill Maher, and I mean, I think he's really one of the oracles for my party, and he acknowledged it, it's like, hey, he thought that the tariffs were going to tank the economy, and then he acknowledged that it didn't,\" said Fetterman. \"So, for me,\" he went on, \"it seems like the E.U. thing has been going well, and I guess we'll see how it happens with China.\" This comes as Trump is increasing the tariff on Canada from 25% to 35% beginning on Friday, after the U.S. neighbor to the north failed to help curb the imports of fentanyl and other illicit drugs. The White House noted that Trump signed an executive order on Thursday to increase the tariff in an effort to hold Canada accountable for its role in the flow of illicit drugs into the U.S. Additionally, Trump signed another executive order on Thursday to modify the reciprocal tariff rates for some countries to further address the United States’ trade deficits. The action reflects Trump’s efforts to protect the U.S. from foreign threats to national security and the economy by securing \"fair, balanced and reciprocal trade relationships,\" the White House said. TRUMP AIMS TO RESHAPE GLOBAL ECONOMY WITH HISTORIC NEW TARIFFS Earlier this year, Trump announced an additional 10% tariff on all countries as well as higher tariffs for countries the U.S. has large trade deficits with. The tariffs became effective on April 9. Since then, Trump and his team have since made several trade deals with several countries. The U.S. struck a deal with the European Union in which the EU agreed to purchase $750 billion in U.S. energy and make new investments of $600 billion by 2028. The EU also agreed to accept a 15% tariff rate. The U.S. also made a deal with Japan, which agreed to invest $550 billion in the U.S. to rebuild and expand core American industries. Japan also agreed to further its own market to U.S. exports, and like the EU, Japan agreed to a baseline 15% tariff rate. However, many Democrats are digging in their heels against Trump’s tariffs strategy, saying the negative effects are still on the horizon. Sen. Jack Reed, D-R.I., forecast that, despite the increased revenue, \"within a few weeks or months, you'll start seeing significant increases in most things you buy. And also, you will see disruption in terms of a lot of our industries, because they're not able to access product or supply.\" TRUMP IMPOSES SWEEPING TARIFFS ON DOZENS OF COUNTRIES AFTER LANDING MASSIVE TRADE DEALS \"When you have across-the-board tariffs, it does operate like a national sales tax, and I think people are going to be more and more hurt,\" predicted Sen. Chris Van Hollen, D-Md. \"This is the president who said he was going to come in and reduce prices. Prices are going to rise, and they're going to rise more over time,\" said Van Hollen. Massachusetts Democratic Sen. Elizabeth Warren said that \"Donald Trump may beat his chest and say, 'Man, I made him take a 15% tariff or 25% tariff,' but also understand that every one of those trading partners is now looking hard all around the rest of the world to find other customers, because Donald Trump is signaling loud and clear that the United States under Donald Trump is not a reliable trading partner. And that's not good for any of us.\" Warren also claimed that Trump’s tariffs are the reason the Federal Reserve has not lowered U.S. interest rates. \"Jerome Powell said last month that he would have lowered interest rates back in February if it hadn't been for the chaos that Donald Trump was creating over trade. And the consequence has been that American families have, for six months now, been paying more on credit cards, more on car loans, more home mortgages, all because Donald Trump has created chaos,\" she said. US-CHINA TRADE DEAL ON THE HORIZON, SAYS TREASURY SECRETARY Meanwhile, Republicans whom Fox News Digital spoke with urged the president to double down on his tariff strategy. \"I think it’s exactly the right approach. It's what I have been urging the president to do, and I think the successes he's winning are big wins for America,\" said Sen. Ted Cruz, R-Texas. In response to Democrats still predicting economic fallout because of the tariffs, Cruz sarcastically remarked, \"I'm shocked, shocked that Democrats are rooting for the economy to do badly under President Trump.\" \"It'd be nice if some Democrats would put their partisan hatred for Trump aside and actually start working together for American workers and American jobs. Unfortunately, I don't see a whole lot of Democrats interested in doing that right now,\" said Cruz. Sen. John Kennedy, R-La., while agreeing that the tariffs have been successful, voiced that he hopes the goal is to ultimately achieve reciprocal zero percent tariffs between the U.S. and its trade partners. DEMOCRATIC SENATOR ADDRESSES WHETHER KAMALA HARRIS HAS REACHED THE END OF HER POLITICAL CAREER \"Clearly, the president got a good deal from one perspective. The Europeans just caved, they did. Fifteen percent tariffs on them, zero on us, commitment to invest in our country. But the part of the deal I like the most, the E.U. and the president agreed that a whole bunch of goods would be tariff-free. That is, no American tariffs and no E.U. tariffs. It's called reciprocity, and ideal reciprocity is zero on both sides,\" he explained. CLICK HERE TO GET THE FOX NEWS APP \"That's what I would like us to achieve in all the trade deals,\" Kennedy explained. \"Let the free enterprise system work. May the best product at the best price win. That, to me, would be the perfect situation.\"","summary":"His fellow Democrats got it wrong about President Donald Trump’s tariffs, Sen. John Fetterman, D-Pa., told Fox News Digital, adding that so far the U.S. trade war is “going well.&quot;","url":"https://www.foxnews.com/politics/watch-dem-senator-agrees-gop-trumps-making-progress-trade-war","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/b5b182ac-fetterman-trump.png","video":"https://www.foxnews.com/video/6376453934112","publish_date":"2025-08-02 08:00:34","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","source_country":"US","sentiment":-0.253},{"id":347497458,"title":"Trump’s Tariff Shock Sends Dow, Nasdaq And European Markets Spiralling","text":"US and European equity markets slumped on Friday after President Donald Trump rolled out a sweeping set of reciprocal tariffs on 70 countries, including India.\nThe move spooked investors, raising fears of fresh inflationary pressure in the US as higher import costs could lead to price hikes in the coming months, reported ANI.\nWall Street Suffers Sharp Losses\nAll three major US indices ended the session deep in the red. The Dow Jones Industrial Average shed 542.40 points, a drop of 1.2 per cent, closing at 43,588.58. The S&P 500 fell 1.6 per cent, losing 101 points to finish at 6,238. The tech-focused Nasdaq Composite saw the steepest fall, tumbling 2.2 per cent or 472 points to close at 20,650.\nTechnology stocks bore the brunt of the selloff. Amazon’s shares plunged by 8.27 per cent on the Nasdaq, while Apple slipped 2.5 per cent, underlining the sector-wide pressure triggered by the tariff announcement.\nAlso Read : Dalal Street Weekly Wrap: Sensex Falls 600 Points Amid Tariff Worries, Nifty Hits Two-Month Low\nTrump Fires Labour Statistics Chief\nAdding to the day’s drama, Trump abruptly dismissed Dr Erika McEntarfer, head of the Bureau of Labour Statistics (BLS). In a post on social media, he accused her of releasing “fake” jobs data to favour Vice President Kamala Harris ahead of the 2024 US Presidential Election.\n“This is the same Bureau of Labor Statistics that overstated the Jobs Growth in March 2024 by approximately 818,000 and, then again, right before the 2024 Presidential Election, in August and September, by 112,000,” Trump wrote, insisting she be replaced “IMMEDIATELY”.\nEuropean Markets Also Hit\nThe turmoil rippled across the Atlantic. Germany’s DAX index slid 2.7 per cent, while France’s CAC index fell nearly 3 per cent, showing how Trump’s tariff move sparked widespread concern. Investors remain wary about the broader economic fallout of the new trade measures.\nAlso Read : Debt Traps 101: What They Are And How To Climb Out","summary":"&lt;p&gt;US and European equity markets slumped on Friday after President Donald Trump rolled out a sweeping set of reciprocal tariffs on 70 countries, including India.&lt;/p&gt;\n&lt;p&gt;The move spooked investors, raising fears of fresh inflationary pressure in the US as higher import costs could lead to price hikes in the coming months, reported ANI.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Wall Street Suffers Sharp Losses&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;All three major US indices ended the session deep in the red. The Dow Jones Industrial Average shed 542.40 points, a drop of 1.2 per cent, closing at 43,588.58. The S&amp;amp;P 500 fell 1.6 per cent, losing 101 points to finish at 6,238. The tech-focused Nasdaq Composite saw the steepest fall, tumbling 2.2 per cent or 472 points to close at 20,650.&lt;/p&gt;\n&lt;p&gt;Technology stocks bore the brunt of the selloff. Amazon&amp;rsquo;s shares plunged by 8.27 per cent on the Nasdaq, while Apple slipped 2.5 per cent, underlining the sector-wide pressure triggered ","url":"https://news.abplive.com/business/trump-tariffs-us-india-dow-nasdaq-european-markets-tech-stocks-1792220","image":"https://feeds.abplive.com/onecms/images/uploaded-images/2025/08/02/20651124c81603e25e2ec7fd4f1156641754115403264800_original.jpeg?impolicy=abp_cdn&imwidth=1200&height=675","video":null,"publish_date":"2025-08-02 06:17:18","author":"Abp Live Business","authors":["Abp Live Business"],"language":"en","source_country":"in","sentiment":-0.179},{"id":347456346,"title":"Kamala Harris Calls the Political System ‘Broken’ in Colbert Interview","text":"(The Hill) Former Vice President Kamala Harris signaled Thursday that she is taking a break from political office for the time being, calling the system “broken.”\n\nAfter months mostly out of the national spotlight, Harris appeared onstage with “The Late Show” host Stephen Colbert in her first interview since President Trump’s inauguration to promote her forthcoming book, “107 Days,” which outlines her last-minute presidential campaign. \n\nWhile speculation has circulated widely about whether she plans to mount a 2028 White House bid, the former Democratic presidential nominee said Wednesday she would not run for California governor. Harris explained that decision to Colbert on Thursday evening.\n\n“I don’t want to go back into the system. I think it’s broken,” she said. “I want to travel the country. I want to listen to people. I want to talk with people. And I don’t want it to be transactional where I’m asking for their vote.”\n\nHarris, also a former senator, said she had avoided the news for “months” after her presidential loss, part of a wider Democratic backslide across the electoral map.\n\n“I’m just not into self-mutilation,” the former vice president said, adding that she watched “lots of cooking shows,” including “The Kitchen.”\n\n“107 Days” is billed as the inside story of Harris’s truncated presidential bid. Still, she skirted questions from Colbert about how she thought about differentiating herself from former President Biden during the campaign, a theme she said she would address in the book.\n\n“It’s an instinct of mine to be someone who does not participate in piling on, and I was not going to pile on,” the former nominee said.\n\nWhen asked near the end of the interview who she thought led the Democratic Party, Harris claimed it was a mistake to “put it on the shoulders of any one person.” \n\n“It’s really on all of our shoulders,” she added.","summary":"Internewscast Journal\n\nInternewscast\n\n\n(The Hill) Former Vice President Kamala Harris signaled Thursday that she is&#8230;\n\n\nThis Post: Kamala Harris Calls the Political System &#8216;Broken&#8217; in Colbert Interview first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/kamala-harris-calls-the-political-system-broken-in-colbert-interview/","image":"https://internewscast.com/wp-content/uploads/2025/08/rewrite-this-title-Kamala-Harris-says-political-system-is-039broken039.jpg","video":null,"publish_date":"2025-08-02 05:42:24","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.449},{"id":347437834,"title":"Surprising Rumors Surrounding Katy Perry and Justin Trudeau’s Date: Why He Feels ‘Blindsided’ and Insiders Now Claim He’s Involved with a Declining Pop Star: By Tom Leonard","text":"Only three months ago she described herself as ‘battered and bruised’ by the vicious backlash to her trip into space on Jeff Bezos’s Blue Origin rocket but courageously reassured fans that she would ‘keep looking to the light’.\n\nEarlier this week, however, Katy Perry was instead gazing into the clear blue eyes of dreamboat ex-Canadian prime minister Justin Trudeau across a restaurant table in Montreal.\n\nWhat a remarkable change in fortunes for a pop star who’d been having a pig of a year, both professionally and privately, one that reached its nadir just a month ago when she announced her split from her actor fiancé Orlando Bloom.\n\nThe dinner was also a welcome development for Trudeau, once the darling of the liberal Western world – especially the female half – but who dramatically resigned in January as his popularity plummeted amid a string of scandals and setbacks, including his 2023 split from wife Sophie.\n\nOn Monday evening, however, the battle-scarred pair put the damaging headlines and unfortunate break-ups behind them at super-hip Le Violon – named Canada’s ‘Best New Restaurant’ when it opened last year – where they spent several hours chatting as they ploughed through the ‘chef’s tasting menu’ (including tuna, steak tartare, lobster and lamb).\n\nThey later had cocktails at a nearby terrace bar where it was claimed (although there is no photographic evidence) that Trudeau had his arm ‘practically welded’ to Perry’s waist.\n\nBut today the Daily Mail can reveal that everything may not be quite what it seems, with one specialist in the dark arts of celebrity public relations claiming that Trudeau may have been the victim of a manipulative, fading pop star looking for love.\n\nRob Shuter, a former celebrity publicist who once represented disgraced music mogul Sean ‘P Diddy’ Combs, revealed to the Daily Mail that sources close to the couple had told him that Perry ‘really likes’ Trudeau and thought their dinner was a ‘date’. The retired politician, however – while he’d enjoyed her company – considered it was ‘no more than dinner’.\n\nShuter added: ‘I’ve heard [Trudeau] feels a bit ambushed by all this.’\n\nAmbushed? Shuter’s information is that Perry set up the dinner – and possibly Trudeau, too. ‘He wanted tickets to her show and she invited him,’ he said. ‘While that was going on, she invited him for dinner.’\n\nIf Perry did set up the rendezvous, it has helpfully catapulted her into the spotlight at a time when she badly needs some good publicity. The Teenage Dream singer’s 84-date world tour got off to a rocky start in April when fans criticised her lacklustre dance moves, underwhelming vocals and clunky costumes, while ticket sales are said to have been disappointing.\n\nMeanwhile, Trudeau also finds himself struggling to rebuild his tarnished reputation and find a new career at the relatively young age of 53.\n\nHe would probably benefit from a public ‘showmance’, too. Toronto publicist Natasha Koifman told Canada’s CBC News she had little doubt the pair wanted to be seen, as there must have been far more discreet options than a window table at the hottest restaurant in town.\n\n‘I think that was actually probably a strategic move,’ she said. ‘I think it elevates both of their brands, for very different reasons, to be seen together.’\n\nUsing the jargon of her industry, she described their unlikely connection as a ‘really great brand and reputational move’.\n\nStaff at the restaurant, including its chef, who chatted briefly with the couple, have insisted there was ‘no PDA’ (public display of affection) between them. And friends of Perry are also reportedly dubious, saying she never normally keeps matters of the heart to herself but has been silent about Trudeau.\n\nThe couple couldn’t have been less discreet. The Daily Mail was told that far from trying to be private about their meet-up, they made no attempt to disguise their booking and chose a fashionable restaurant that often has paparazzi or celebrity watchers waiting outside.\n\nThen, as if to maximise the chance of being spotted, they sat at a table near a window and later visited the kitchen to thank the staff.\n\nAnd they didn’t just meet up for dinner. It has emerged that they’d spent part of the preceding afternoon together, walking one of her dogs in a local park. And two days later, on Wednesday evening, Trudeau was photographed with his 16-year-old daughter in prime seats at the Montreal date of Perry’s Lifetimes tour.\n\nNeither Perry, 40, nor Trudeau have yet commented on the fevered speculation, with the result that Canadians, who usually like to think they’re too high-minded to be interested in such tittle-tattle, have been wondering whether the politician once dubbed the ‘Crown Prince of Woke’ had followed in the footsteps of his lady-killer father with the singer dubbed the ‘Queen of Camp’.\n\nLike his son, Pierre Trudeau served as Canada’s PM, retiring in 1984 after 15 years in office. After separating from Justin’s mother Margaret in 1977, he was romantically linked with a string of glamorous stars including Barbra Streisand, Superman’s Margot Kidder and Sex And The City actress Kim Cattrall. Margaret Trudeau was not exactly a nun either, enjoying affairs with Jack Nicholson and Ryan O’Neal, and hanging out with the Rolling Stones.\n\nIs history now repeating itself, some ask.\n\nApart from being thrown together in adversity there’s precious little else that they have in common – apart, that is, from the weird coincidence of both having had their Left-wing ‘progressive’ credentials tarnished by ‘blackface’ scandals.\n\nTrudeau was severely embarrassed in 2019 when it was revealed that he had worn skin-darkening make-up three times in his past – twice with an Afro wig. The pictures emerged just five weeks before a general election but he survived after grovelling to voters, saying he ‘should have known better’.\n\nPerry’s blackface crisis blew up the very same year after one of the designs in her range of Katy Perry shoes – blue eyes and red lips on black leather –was deemed to be racist.\n\nOnline critics compared it with ‘painful images’ of blackface. The offence was hardly on a par with Trudeau’s but she apologised and immediately withdrew them from sale.\n\nPerry, the daughter of two Pentecostal pastors, originally tried to launch her music career as a wholesome Christian singer but when that didn’t work, she had a drastic re-think and played the sex kitten, scoring a No 1 hit in 2008 with her raunchy first single, I Kissed A Girl.\n\nAfter weathering a 2010 marriage to Russell Brand that lasted 14 months, she became one of the biggest-selling music artists ever – with sales of more than 143 million records – but critics say her brand of bubbly pop stagnated years ago, along with her tiresome theme of hyper-sexualised female empowerment. Perry still has more than 104 million followers on X but that doesn’t mean they all love her.\n\nFor many, devotion has turned to contempt as she appeared to become increasingly desperate to rediscover commercial success – she hasn’t had a top-ten hit since 2016.\n\nLast year’s Woman’s World was supposed to be her great comeback record but was mocked as a cynical attempt to cash in on Kamala Harris’s ill-fated presidential run.\n\nIt was on an album that flopped and, to make matters worse, she made it with a producer who’d been accused of raping a woman.\n\nHer image as a compassionate feminist took another knock when, in 2015, she embarked on a protracted and ugly dispute with two elderly nuns to turn their former convent into her glitzy new home. Perry was allegedly so aggressive that one nun’s dying words were: ‘Katy Perry, please stop.’\n\nSo she was already drawing considerable online flak when, in April, she joined Jeff Bezos’s all-female Blue Origin space flight, singing Louis Armstrong’s What A Wonderful World to her fellow passengers, and the online abuse soared off the chart.\n\nPerry’s fame and post-mission theatrics – bending down to kiss the ground on landing after the ten-minute flight – helped ensure that she took most of the vitriol when the flight was engulfed in a monumental backlash.\n\nCritics lambasted it as a frivolous and tone-deaf PR stunt that ignored the huge environmental cost of space tourism. Even the fast-food chain Wendy’s joined in, mockingly asking: ‘Can we send her back?’ Perry complained that social media had turned her into a ‘human pinata’.\n\nIn June, there was more drama when it was confirmed that she and Orlando Bloom, 48, had separated after nine years. They’d been engaged since 2019 and Perry gave birth to their daughter, Daisy, in 2020.\n\nAlthough they are reportedly on amicable terms and share parenting duties, some believe Bloom rubbed salt into the wound of their break-up by attending the late June wedding of Perry’s great pal Lauren Sanchez to Jeff Bezos in Venice – despite Perry being unable to attend because she was performing in Australia.\n\nDinner and drinks with a human pinata is not calculated to burnish anyone’s reputation, but Justin Trudeau is hardly Mr Popular either nowadays.\n\nAccording to political pundits, he was afflicted by essentially the same problem as Perry – the public got sick of the sight of him during ten years as Canadian PM, during which he and the media couldn’t get enough of each other.\n\nCanadians have barely heard or seen anything of their once ubiquitous leader since he stepped down in March under pressure from his own Liberal Party. Amid serious economic problems, in part due to his open-door policy on legal immigration, and plummeting poll ratings, he’d become a huge political liability.\n\nHe didn’t even try to keep his parliamentary seat in the federal election in late April.\n\nAs his star waned, Canadians were reminded of the various scandals that he’d survived when he was far more popular. They included three ethical controversies in which he was personally singled out for official criticism.\n\nBut his critics were riled as much as anything by Trudeau’s stratospheric smugness and wokery – he was a master of style over substance who, alongside his equally narcissistic wife, would post photos online ranging from their impressively athletic yoga positions to them and their three children ridiculously dressed in traditional costumes during a 2018 trip to India.\n\nIn 2011, he performed a partial striptease at a charity gala and, ahead of the 2016 Invictus Games for disabled veterans, did some show-off press-ups for the media.\n\nUS Vogue rated him one of the sexiest men alive, fawning over how he was a ‘feminist and capable of balancing a baby on one hand’. And Trudeau’s wokeness reached new heights in 2018, when he corrected a woman for using the word ‘mankind’, telling her: ‘We like to say ‘peoplekind’.’\n\nThe 2023 collapse of his marriage to Sophie, a former TV presenter and close friend of the Duchess of Sussex, was hardly a surprise given they’d admitted to having problems for years. Trudeau denied rumours of infidelity, although his wife was more ambiguous when asked.\n\nThe ex-wife of an Ottawa paediatric surgeon named Marcos Bettolli later claimed in court papers that he’d been in a romantic relationship with Sophie some months before the Trudeaus announced they were separating.\n\nTrudeau, however, has not been linked with any woman since the split until now and he was reportedly anxious to concentrate on bringing up their three children: Xavier, 17, Ella-Grace, 16, and Hadrien, 11.\n\nXavier, incidentally, is trying to break into the music business and has just released his first record – a topic that one hopes came up with Perry.\n\nAfter all, if love really does blossom between North America’s unlikeliest couple, they need to find something more than their terrible approval ratings to talk about.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOnly three months ago she described herself as &#8216;battered and bruised&#8217; by&#8230;\n\n\nThis Post: Surprising Rumors Surrounding Katy Perry and Justin Trudeau&#8217;s Date: Why He Feels &#8216;Blindsided&#8217; and Insiders Now Claim He&#8217;s Involved with a Declining Pop Star: By Tom Leonard first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/surprising-rumors-surrounding-katy-perry-and-justin-trudeaus-date-why-he-feels-blindsided-and-insiders-now-claim-hes-involved-with-a-declining-pop-star-by-tom-leonard/","image":"https://internewscast.com/wp-content/uploads/2025/08/rewrite-this-title-Astonishing-whispers-about-Katy-Perry-and-Justin.jpg","video":null,"publish_date":"2025-08-02 04:30:28","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.171},{"id":347532264,"title":"‘Lowest Expectations’: Victor Davis Hanson Explains How Kamala Damages Democrats More Than Biden","text":"Political analyst Victor Davis Hanson gave a pointed analysis on Fox News Friday of former Vice President Kamala Harris’ and former President Joe Biden’s respective impacts on the Democratic Party.\n\nDuring an appearance on “Jesse Watters: Primetime,” guest host Charlie Hurt asked Hanson who poses a greater risk to the party, Harris or Biden. Hanson didn’t hesitate to suggest it’s Harris. Hanson said that while Biden’s cognitive decline may be attributed to age and inevitable physical decline, Harris’s inability to communicate coherently is more troubling.\n\n“Joe Biden has a time limit, a shelf life on him, that he’s not going to be active very long, but she’s going to be here for a while,” Hanson said. “And his favor is that he can plead that his cognitive decline is organic, it’s age-related, or it’s something. I don’t want to diagnose him, but when she speaks she’s incoherent and there’s no reason of age or physical impairment.”\n\nHanson didn’t hold back criticizing Harris and described her as a liability to the Democratic Party.\n\n“She just can’t speak. And she knows she can’t speak. And every time she speaks, she knows that people think she can’t speak. So she tries to speak, and she fulfills everybody’s lowest expectations. And so there’s no reason,” Hanson said.\n\nHanson then delved into Biden’s communication struggles.\n\n“You just say Joe is just incoherent. Nobody knows what he’s saying. The only time he comes animate and alive is when he mentions Trump. Then for brief spasms, he gets angry and shouts at Donald Trump,” Hanson said. “He’s got this furor against it. And then the clarity, such as it is, dissipates within a few seconds.”\n\nHarris said Wednesday that she would not run for California governor but left open the possibility of a 2028 presidential bid. In her statement, she expressed enthusiasm about working to “help elect Democrats” across the country and teased that she would reveal more about her future plans in the coming months. (RELATED: Juan Williams Suggests Real Reason Kamala Isn’t Running For Governor)\n\nIn the 2020 presidential race, the former vice president lost all seven battleground states and the popular vote to President Donald Trump. During her own bid for the presidency that year, Harris garnered only 844 votes in the Democratic primary and secured zero delegates, according to archived election data.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'She just can't speak'","url":"https://dailycaller.com/2025/08/01/victor-davis-hanson-kamala-harris-biden-democrats/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/Victor-Davis-Hanson-Explains-How-Kamala-Damages-Democrats-More-Than-Biden-e1754098977945.jpg","video":null,"publish_date":"2025-08-02 03:52:39","author":"Mariane Angela","authors":["Mariane Angela"],"language":"en","category":"politics","source_country":"US","sentiment":-0.173},{"id":347435608,"title":"Trump Sacks Senior Official Over Employment Data; Details Here","text":"US President Donald Trump has dismissed Erika McEntarfer, the commissioner of the Bureau of Labor Statistics (BLS), accusing her, without providing evidence, of manipulating employment data for “political purposes”, CNN reported.\nThe move came after the BLS released its monthly labour report on Friday, showing that the US economy added just 73,000 jobs in July, well below market expectations. The report also included significant downward revisions for May and June, with previously reported job gains reduced by a combined 258,000 positions. These adjustments marked the weakest three-month hiring period since the 2020 pandemic-induced recession, according to CNN.\nReacting to the data, Trump wrote on Truth Social: “In my opinion, today’s Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad.”\nHe further said: “McEntarfer said there were only 73,000 Jobs added (a shock!) but, more importantly, that a major mistake was made by them, 2,58,000 Jobs downward, in the prior two months… The Economy is BOOMING under ‘TRUMP.'”\nTrump accused McEntarfer of intentionally “faking” job numbers ahead of the 2024 presidential election to benefit former Vice President Kamala Harris.\n“We’re doing so well. I believe the numbers were phony, just like they were before the election, and there were other times. So, you know what I did? I fired her, and you know what? I did the right thing,” Trump told reporters Friday on the South Lawn, according to CNN.\nWhile the downward revisions were notable, experts point out that such adjustments are a normal part of the BLS reporting process. Initial monthly jobs estimates often rely on incomplete data and are revised twice in subsequent months, followed by an annual revision. Moreover, the BLS employs a formula to adjust for seasonal employment patterns, which can lead to larger-than-expected changes when actual hiring trends diverge from norms, CNN explained.\nDespite this standard methodology, Trump described the BLS revisions as a “mistake”.","summary":"The move comes after the Bureau of Labor Statistics released its monthly report, showing that the US economy added just 73,000 jobs in July, well below market expectations.","url":"https://www.news18.com/business/economy/trump-sacks-senior-official-over-employment-data-details-here-9479261.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/Donald-Trump-2025-07-b798ba114c1ef3444ac2feaea67c9026.jpg","video":null,"publish_date":"2025-08-02 03:44:12","author":"Mohammad Haris,News18","authors":["Mohammad Haris","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.445},{"id":347448148,"title":"Trace Gallagher: ‘Common Sense’ was up late watching Colbert’s interview with Kamala Harris…","text":"Trace Gallagher: ‘Common Sense’ was up late watching Colbert’s interview with Kamala Harris…\n\n 'Common Sense' Department: Kamala Harris claims the political system is broken. Is the issue the system or Democratic leadership? The CSD has thoughts.","summary":"&apos;Common Sense&apos; Department: Kamala Harris claims the political system is broken. Is the issue the system or Democratic leadership? The CSD has thoughts.","url":"https://www.foxnews.com/video/6376477163112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9250179f-2622-4588-bf58-ac2598d618e4/4260037b-8411-4b99-ba3c-d83aed9b53fe/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-02 03:31:29","author":null,"language":"en","source_country":"us","sentiment":0.052},{"id":347532256,"title":"Dan Turrentine Describes How Kamala Book Tour Could Send Democrats To ‘Rock Bottom’","text":"Former Democrat strategist Dan Turrentine said Friday on Fox News’ “The Ingraham Angle” that former Vice President Kamala Harris will drop Democrats to “rock bottom” if she continues to double down defending former President Joe Biden on her book tour.\n\nHarris announced her upcoming book on Thursday about her brief time as the 2024 Democrat presidential nominee, speaking with late night host Stephen Colbert about her campaign. Journalist Mark Halperin speculated whether Biden’s team allegedly had unflattering information about Harris to release if she flips on him. Turrentine was asked if he believed Halperin was correct. (RELATED: Kamala Harris Makes Major Announcement About Her Political Future)\n\n“I would never say that my colleague is not right. I think Mark [Halperin] is one of the most wired in people. He’s absolutely right,” Turrentine said. “Look, you saw with Hunter Biden, they are going scorched earth already on any Democrat who attempts to separate. Or people like Nancy Pelosi who did what they think that they had to do.”\n\nPrior to Biden dropping out of the presidential race in July 2024, Democrats had publicly urged him to step aside following his disastrous debate against President Donald Trump, which raised concerns about his mental fitness. Reports indicated that, in addition to public pressure from Democrat lawmakers, figures like California Rep. Nancy Pelosi and former President Barack Obama also played a role pushing Biden to step down.\n\nHarris accepted the nomination in the days following Biden’s announcement. The former vice president repeatedly defended Biden’s four years in office. When asked on “The View” last October if she would have done anything different from Biden’s “past four years,” Harris said “not a thing” came to mind.\n\nWhen asked by Colbert on Thursday why she didn’t separate herself from Biden during her campaign, Harris said it would be addressed fully in her book and that she refused to “pile on” the former president at the time.\n\n“So, again, if you’re Kamala Harris, if you thought that you didn’t want to pile on, then you should not have run. She cleared the field when Biden resigned that day because she so badly wanted to do this. So if what she’s going to do is now give a book tour and say, ‘I’m with Joe Biden.’ Joe Biden is unpopular. He was unpopular.”\n\n“Candidates that run three consecutive times or three times like Ronald Reagan, Donald Trump, they are ideologically consistent,” Turrentine said. “The country comes to them. If she’s going to attempt to lead us into the future by arguing that Joe Biden’s presidency was good and we should continue it, man, I thought we hit rock bottom. Apparently, we would not have.”\n\nHarris’ refusal to criticize Biden’s time in office comes after the former president’s son, Hunter Biden, sat down for an interview with “Channel 5 with Andrew Callaghan” in July. During the discussion, Hunter called out a list of Democrats who turned against his father, including strategist James Carville, George Clooney, and the hosts of “Pod Save America.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'You should not have run'","url":"https://dailycaller.com/2025/08/01/dan-turrentine-kamala-harris-book-tour-joe-biden-democrats-party-rock-bottom/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/Screenshot-2025-08-01-at-5.16.36 PM-e1754093851242.png","video":null,"publish_date":"2025-08-02 03:29:06","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.083},{"id":347429320,"title":"Kevin O'Leary Rips Donald Trump for 'Whacking' Labor Bureau Chief","text":"Shark Tank investor Kevin O'Leary ripped President Donald Trump over his firing of U.S. Bureau of Labor Statistics (BLS) Commissioner Dr. Erika McEntarfer on Friday after a disappointing jobs report.Newsweek reached out to an economic analyst via email for additional comment.Why It MattersTrump's decision to oust McEntarfer has triggered widespread concern among economists, business leaders and former government officials about the independence of U.S. economic data reporting.The abrupt dismissal followed the release of lackluster job numbers and marked a rare direct intervention by a president in the work of a nonpartisan federal agency responsible for compiling critical economic statistics.The number of new jobs for July dipped well below even modest expectations, with only 73,000 positions added, compared to the Dow Jones estimate of 100,000.This move has now fueled debate over the politicization of federal agencies, the integrity of government data and potential impact on market and public trust in official economic indicators.What To KnowTrump announced McEntarfer's firing on Truth Social Friday, also accusing her of manipulating data to benefit former Vice President Kamala Harris around the 2024 presidential election \"to try and boost Kamala's chances of Victory.\"While speaking on CNN after Trump's announcement, O'Leary was asked about Trump's economic policies impacting him as an investor.\"I don't look at one day's trading and decide I'm going to change my strategy,\" O'Leary said. \"I want markets to correct. I want them to go up and down. We're used to volatility. We had a bad print on jobs. I did not agree on whacking the commissioner. I don't like that.\"O'Leary continued: \"Whacking statisticians makes no sense whatsoever. You don't shoot the messenger. They used to do that in Ancient Rome. Bad news. They'd kill a guy off the horse. You don't need to do that now. It doesn't matter. This is a job where you just print data. So, I didn't like that story.\"\"I think the market is a little concerned about major trading partners not getting deals yet that make sense. It's not a good idea to have 35 percent tariffs on Canada, we know that that's coming into place at midnight right now, unless something magic happens,\" O'Leary added.McEntarfer's firing coincided with a significant drop in U.S. stock markets on Friday. The Dow Jones Industrial Average lost 542 points (1.2 percent), the S&P 500 fell 1.6 percent and the Nasdaq composite dropped 2.2 percent. This downward movement was attributed to both weak job figures and a new round of U.S. tariffs announced by Trump.What People Are SayingJB Pritzker, Democratic governor of Illinois, posted to X on Friday: \"Donald Trump just fired the head of the Bureau of Labor Statistics because she stated the facts. And the facts show his policies are a disaster for the American economy. Trump said he'd be a dictator on day one and that's just what he's acting like.\"Trump, in an interview with Newsmax's Rob Finnerty on Friday: \"We had some difficulties with her, and there had been a lot of questions and we fired her because we didn't believe the numbers today.\"What Happens NextIt remains uncertain who will be nominated as the next permanent BLS commissioner. Trump announced on Truth Social that McEntarfer \"will be replaced with someone much more competent and qualified.\"Former BLS chief William Beach and other Friends of BLS Co-Chairs called for an investigation of Trump's firing of McEntarfer.","summary":"Trump announced McEntarfer's firing on Friday, also accusing her of manipulating data to benefit former Vice President Kamala Harris.","url":"https://www.newsweek.com/kevin-oleary-rips-donald-trump-whacking-labor-bureau-chief-2107911","image":"https://d.newsweek.com/en/full/2695328/kevin-oleary.jpg?w=1600&h=900&q=88&f=e4c36f61de2a44024257706a79d45288","video":null,"publish_date":"2025-08-02 03:14:09","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"us","sentiment":-0.518},{"id":347436872,"title":"World News | Trump Fires Bureau of Labor Statistics Commissioner, Citing Rigged Jobs' Numbers During Election Campaign","text":"Washington DC [US], August 2 (ANI): US President Donald Trump fired Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, whom he accused, without evidence, of manipulating the monthly jobs reports for \"political purposes,\" CNN reported.\nThe Bureau of Labor Statistics' monthly labor report Friday showed that the US economy added only 73,000 jobs in July, far below expectations. It also sharply revised down the employment growth that had been previously reported in May and June - by a combined 2,58,000 jobs.\nAlso Read | US President Donald Trump Orders Firing of Bureau of Labor Statistics Chief Erika McEntarfer After Weaker-Than-Expected Jobs Report.\nAfter the revisions, the jobs report showed the weakest pace of hiring for any three-month period since the pandemic recession in 2020, as per CNN.\n\"In my opinion, today's Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad,\" Trump said in a Truth Social post.\nAlso Read | Montana Mass Shooting: 4 Killed As Gunman Opens Fire at The Owl Bar in US’ Anaconda (Watch Videos).\nhttps://x.com/RapidResponse47/status/1951402609065017399\nhttps://x.com/RapidResponse47/status/1951369349400350835\nhttps://x.com/RapidResponse47/status/1951345517423894790\nAlthough the May and June jobs numbers were worse than initially believed, revisions are normal in this process. The BLS' initial monthly jobs estimates are often based on incomplete data, so they are revised twice after the initial report -- followed by an annual revision every February. Additionally, BLS economists use a formula to smooth out jobs numbers for seasonal variations and that can exacerbate revisions when they fall outside economists' expectations, CNN reported.\nTrump on Friday incorrectly called the revisions a \"mistake.\"\n\"McEntarfer said there were only 73,000 Jobs added (a shock!) but, more importantly, that a major mistake was made by them, 2,58,000 Jobs downward, in the prior two months,\" Trump said on Truth Social. \"Similar things happened in the first part of the year, always to the negative. The Economy is BOOMING under 'TRUMP.'\"\nTrump said McEntarfer \"faked\" the jobs numbers before the election to try to boost former Vice President Kamala Harris' chances in the 2024 presidential election, as per CNN.\n\"We're doing so well. I believe the numbers were phony, just like they were before the election, and there were other times. So, you know what I did? I fired her, and you know what? I did the right thing,\" Trump told reporters Friday on the South Lawn, as per CNN. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Bureau of Labor Statistics' monthly labor report Friday showed that the US economy added only 73,000 jobs in July, far below expectations. It also sharply revised down the employment growth that had been previously reported in May and June - by a combined 2,58,000 jobs.","url":"https://www.latestly.com/agency-news/world-news-trump-fires-bureau-of-labor-statistics-commissioner-citing-rigged-jobs-numbers-during-election-campaign-7038174.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250802030255.jpg","video":null,"publish_date":"2025-08-02 03:10:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.446},{"id":347436922,"title":"Business News | US, European Stock Markets Tumble on Trump's Tariff Move; Amazon & Apple Shares Face Heavy Selling","text":"New Delhi [India], August 2 (ANI): US stock markets faced heavy selling pressure on Friday (local US time) after President Donald Trump implemented fresh reciprocal tariffs on 70 countries, including India.\nThe new tariffs have raised fears of rising inflation in the US, as imports will become more expensive and prices of goods sold in the country are expected to rise in the coming months.\nAlso Read | US President Donald Trump Orders Firing of Bureau of Labor Statistics Chief Erika McEntarfer After Weaker-Than-Expected Jobs Report.\nThe major US stock indices witnessed sharp declines. The Dow Jones Industrial Average fell by over 1.2 per cent to close at 43,588.58, down by 542.40 points.\nThe S&P 500 also dropped by 1.6 per cent, losing 101 points to settle at 6,238. The tech-heavy Nasdaq index tanked more than 2.2 per cent, falling by 472 points to close at 20,650.\nAlso Read | Is August 2 Bank Holiday? Will Banks Remain Open or Closed on 1st Saturday Falling on 2nd August 2025? All You Need To Know.\nSeveral major US companies saw their share prices tumble. Amazon Inc. shares on the Nasdaq declined sharply by 8.27 per cent. Shares of tech giant Apple also dropped by 2.5 per cent, reflecting broad-based selling across the technology sector.\nIn a major development, President Trump abruptly fired Dr. Erika McEntarfer, the head of the Bureau of Labor Statistics (BLS).\nTrump accused her of releasing \"fake\" jobs data ahead of the 2024 US Presidential Election in an attempt to support Vice President Kamala Harris.\nIn a social media post, Trump said, \"I was just informed that our Country's 'Jobs Numbers' are being produced by a Biden Appointee, Dr. Erika McEntarfer, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala's chances of Victory. This is the same Bureau of Labor Statistics that overstated the Jobs Growth in March 2024 by approximately 818,000 and, then again, right before the 2024 Presidential Election, in August and September, by 112,000.\"\nTrump added, \"These were Records -- No one can be that wrong? We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY. She will be replaced with someone much more competent and qualified.\"\nThe panic in global markets extended to Europe as well. Germany's DAX index dropped by more than 2.7 per cent, while France's CAC index fell by 2.99 per cent, showing heavy selling pressure across European markets too.\nInvestors remain concerned over the uncertainty triggered by Trump's tariff move and the possible economic consequences it could bring. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on Business at LatestLY.  US stock markets faced heavy selling pressure on Friday (local US time) after President Donald Trump implemented fresh reciprocal tariffs on 70 countries, including India.","url":"https://www.latestly.com/agency-news/business-news-us-european-stock-markets-tumble-on-trumps-tariff-move-amazon-apple-shares-face-heavy-selling-7038158.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250802023308.jpg","video":null,"publish_date":"2025-08-02 02:48:28","author":null,"language":"en","source_country":"in","sentiment":-0.332},{"id":347436912,"title":"US President Donald Trump Orders Firing of Bureau of Labor Statistics Chief Erika McEntarfer After Weaker-Than-Expected Jobs Report","text":"Washington, August 2: US President Donald Trump announced that he has ordered the firing of Erika McEntarfer, commissioner of the Bureau of Labor Statistics (BLS), accusing her of manipulating data for political purposes. \"I was just informed that our Country's 'Jobs Numbers' are being produced by a Biden Appointee, Dr. Erika McEntarfer, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala (Harris)'s chances of Victory,\" Trump said in a post on Truth Social, without providing any evidence. \"We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY ... Important numbers like this must be fair and accurate, they can't be manipulated for political purposes,\" Trump said. Donald Trump Says India Reportedly Halting Russian Oil Would Be ‘A Good Step’ As New Delhi Continues To Defend Energy Security (Watch Video). Trump's announcement came just a few hours after the BLS released the July jobs report, which showed just 73,000 nonfarm jobs added -- far below forecasts -- and downward revisions of over 250,000 jobs for May and June combined, Xinhua news agency reported. In July 2023, then US President Joe Biden selected McEntarfer for the role, and the Senate confirmed her in January 2024 with strong bipartisan backing. \"This is a political firing, pure and simple. No justification in terms of performance or skills,\" Gary Hufbauer, a nonresident senior fellow at the Peterson Institute for International Economics and a former Treasury Department official, told Xinhua. Donald Trump Says ‘He Wants To Release Epstein Files’, Rules Out Sean ‘Diddy’ Combs Pardon (Watch Videos). \"Going forward, it's likely that the BLS staff will prevent large-scale interference with data collection and presentation. However, Trump's appointee may be able to color statements in a way favorable to Trump,\" said Hufbauer.","summary":"We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY ... Important numbers like this must be fair and accurate, they can't be manipulated for political purposes,' US President Donald Trump said.","url":"https://www.latestly.com/world/us-president-donald-trump-orders-firing-of-bureau-of-labor-statistics-chief-erika-mcentarfer-after-weaker-than-expected-jobs-report-7038140.html","image":"https://st1.latestly.com/wp-content/uploads/2025/05/03-6726615.jpg","video":null,"publish_date":"2025-08-02 02:43:33","author":"Ians","authors":["Ians"],"language":"en","category":"politics","source_country":"in","sentiment":-0.073},{"id":347430666,"title":"Kamala Harris has ‘no future,’ refuses to lead the Democratic Party: Tomi Lahren","text":"to top close Video This video is playing in picture-in-picture.\n\nHannity August 01, 2025 06:46 \n\n Kamala Harris has ‘no future,’ refuses to lead the Democratic Party: Tomi Lahren \n Outkick host Tomi Lahren critiques former Vice President Kamala Harris and assesses her political future on ‘Hannity.’\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRHANNITYV-VIDEOPERSONALITIESPOLITICS","summary":"Outkick host Tomi Lahren critiques former Vice President Kamala Harris and assesses her political future on ‘Hannity.’","url":"https://www.foxnews.com/video/6376475368112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9324e8c7-31e9-4be5-9e01-2ae838df1693/2d134f77-f1b5-4210-8a9c-72aad7fc78e6/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-02 02:35:18","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.328},{"id":347430670,"title":"Greg Gutfeld: Kamala Harris didn’t even read her own book, even though it’s at a fourth grade level","text":"to top close Video This video is playing in picture-in-picture.\n\nGutfeld August 01, 2025 18:47 \n\n Greg Gutfeld: Kamala Harris didn’t even read her own book, even though it’s at a fourth grade level \n Fox News host Greg Gutfeld and the panel discuss former Vice President Kamala Harris’ interview with Stephen Colbert and Gutfeld’s upcoming late-night show appearance on ‘Gutfeld!’\n Tags V-VIDEOPERSONALITIESSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE GREG GUTFELD SHOWGUTFELD!POLITICS","summary":"Fox News host Greg Gutfeld and the panel discuss former Vice President Kamala Harris’ interview with Stephen Colbert and Gutfeld’s upcoming late-night show appearance on ‘Gutfeld!’","url":"https://www.foxnews.com/video/6376475870112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b3a996dd-f398-4bf3-9b3b-6e4960c28035/d67bff5f-bcc8-4a90-9ca0-44c4815a9471/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-02 02:32:12","author":null,"language":"en","source_country":"us","sentiment":0.417},{"id":347422450,"title":"Jimmy Kimmel erects L.A. billboard endorsing “The Late Show with Stephen Colbert” for Emmy instead of his own show","text":"Jimmy Kimmel is telling everyone that he wants Stephen Colbert's Late Show to win an Emmy this year, even though his own Jimmy Kimmel Live is also nominated for the same award.\n\n The comedian has rented a billboard, at the intersection of La Cienega and Santa Monica boulevards in West Hollywood, on which he declares, \"I'm voting for Stephen.\"\n\n The nominees in the category of Outstanding Talk Series this year are Colbert, Kimmel, and The Daily Show on Comedy Central. Though Colbert's show has been nominated for 33 Emmys in all, across various categories, since 2017, it's never won.\n\n EW has reached out to reps for Colbert and Kimmel for comment.\n\n Kimmel's show of support comes two weeks after Colbert announced on-air that CBS' Late Show franchise, which David Letterman began in 1993, will end next year.\n\n The network said its decision to pull the plug on the franchise was \"purely a financial one\" and that it wasn't \"related in any way to the show's performance, content or other matters happening at Paramount.\" It continued, \"We are proud that Stephen called CBS home,\" officials said in a statement. \"He and the broadcast will be remembered in the pantheon of greats that graced late night television.\"\n\n Critics, however, have called out the timing of the announcement, which came in the same month that Paramount Global, the parent company of Colbert's network, agreed to pay $16 million to President Donald Trump over an interview with former Vice President Kamala Harris that aired on 60 Minutes in November.\n\n Trump has long disliked late-night hosts' jokes about his administration and, since the cancellation, has said that he's hearing \"a strong word\" that Kimmel will be canceled next, then The Tonight Show's Jimmy Fallon.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n But Trump has denied that he was behind the decision to end Colbert.\n\n \"Everybody is saying that I was solely responsible for the firing of Stephen Colbert from CBS, ‘Late Night\" he wrote on social media. \"That is not true! The reason he was fired was a pure lack of TALENT, and the fact that this deficiency was costing CBS $50 Million Dollars a year in losses — And it was only going to get WORSE!\"\n\n At the same time, Kimmel and The Daily Show's Jon Stewart are among those who have come to Colbert's defense, with their words and even cameos on his show.","summary":"The move comes two weeks after Colbert's CBS show was canceled.","url":"https://ew.com/jimmy-kimmel-erects-billboard-backing-stephen-colbert-for-emmy-11783763","image":"https://ew.com/thmb/VnA98XCepXYstBeeB1Yhs221cH0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Jimmy-Kimmel-billboard65-080125-8b84a4e530434669b92b7d4edc0cecd1.jpg","video":null,"publish_date":"2025-08-02 01:41:59","author":"Raechal Shewfelt","authors":["Raechal Shewfelt"],"language":"en","source_country":"US","sentiment":-0.107},{"id":347420214,"title":"Victor Davis Hanson says Harris’ ‘heart’ is not in it to run anymore","text":"to top close Video This video is playing in picture-in-picture.\n\nJesse Watters Primetime August 01, 2025 05:25 \n\n Victor Davis Hanson says Harris’ ‘heart’ is not in it to run anymore \n Hoover Institution senior fellow Victor Davis Hanson discusses former Vice President Kamala Harris’s chances for a re-run in 2028 on ‘Jesse Watters Primetime.’\n Tags POLITICSSPECIAL REPORTSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRV-VIDEOPERSONALITIES","summary":"Hoover Institution senior fellow Victor Davis Hanson discusses former Vice President Kamala Harris’s chances for a re-run in 2028 on ‘Jesse Watters Primetime.’","url":"https://www.foxnews.com/video/6376474039112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/52c8bc6f-5357-4a1e-9c24-770b63c19ecd/3930de5a-4edb-4e9d-95a3-fbcb554d3d35/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-02 01:33:07","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.423},{"id":347423106,"title":"Kamala Harris’ latest Stephen Colbert flop shows exactly what’s wrong with both of them","text":"Kamala Harris’ visit Thursday to Stephen Colbert’s “Late Show” was a fine reminder of why both of them are failures.\n\nMind you, this marked Harris’ eighth Late Show appearance — one more illustration of the futility of doing the same thing over and over and somehow expecting different results.\n\nWhat made her think this would help promote her new book?\n\nThe marquee moment was her inability to say who’s leading the Democratic Party just now — which was actually simple honesty, since neither Dems nor Republicans have clear leaders these days unless it’s a sitting president.\n\nBut she couldn’t explain that simple truth, nor did Colbert show any sign of getting it as he pushed for an answer.\n\nHer incoherence was part of another classic Kam performance, full of word salads and non-answers.\n\nSo why did Colbert even bring her on a supposed comedy show?\n\nBecause he’s followed most of the late-night crew down the “we need to promote liberal politics” toilet, of course — hosting 176 Dem politicians and one Republican since 2022, and hewing one side of the aisle every minute in between.\n\nThat formula earned him cancellation and may well take out all his peers. \n\nIt’s another puzzle of modern life that so much of the entertainment industry somehow forgot that sanctimoniousness (political or otherwise) is the enemy of humor.","summary":"Kamala Harris’ visit Thursday to Stephen Colbert’s “Late Show” was a fine reminder of why both of them are failures.","url":"https://nypost.com/2025/08/01/opinion/kamala-harris-latest-stephen-colbert-flop-shows-exactly-whats-wrong-with-both-of-them/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/kokokooo.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-08-02 01:33:04","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"zm","sentiment":-0.558},{"id":347532284,"title":"Piers Morgan Describes How Much Work Remains For Democrats To Get Out Of ‘Complete And Utter Shambles’","text":"British journalist Piers Morgan said Friday on Fox News’ “The Five” that Democrats won’t win back voters until they regain their “common sense,” calling the party in “complete and utter shambles.”\n\nFormer Vice President Kamala Harris returned to the media spotlight Thursday, joining late night host Stephen Colbert to discuss her upcoming book. Morgan said Harris struggled to identify the Democrats’ new leader.\n\n“Speaking frankly, as your friend from across the pond, they are in complete and utter shambles, aren’t they? The Democrats. They’ve hit record low approval polls,” Morgan said. “She [Kamala Harris] talks about a broken system and her big book.”\n\n“I have a book coming, actually, genuinely, called ‘Woke is Dead.’ In a way, listening to her words, saluting away with Colbert, who is the epitome of the late night woke guy who hates Trump and everything about him and believes all the nonsense that the Democrats have spewed the last few years. You know, woke is dead. They just haven’t got the memo yet,” Morgan added. “So what you’re seeing is the last kind of vestiges of that mindset, which was repudiated in the most spectacular fashion in the last election.”\n\nSince President Donald Trump’s election victory in November, Democrats have struggled to regain a unified message and leader to get behind. According to new polls from The Wall Street Journal, CNN, and Gallup, all have recently reported that the party has hit record-low favorability. (RELATED: Mark Halperin Teases Biden Team Has Embarrassing Info To Drop On Kamala Harris)\n\nIn a breakdown of new data from CNN, chief data analyst Harry Enten said Friday that not only are Democrats “historically divided,” but they also lack a presidential nominee polling at the levels typically seen in past elections.\n\n“They’re wondering why Donald Trump got reelected. Partly it’s his huge personality, his policies about the economy, about immigration and so on,” Morgan said. “But also because he saw through the number one fault line, I think, of the Democrats, the absolute abandonment of common sense. And you can chart it, really.”\n\n“The moment you try and convince the public that it’s perfectly reasonable and fair to have a six-foot four-inch man dominating in a women’s sport like swimming or athletics or whatever, you have lost your marbles,” Morgan said. “So they’ve got to get back to common sense. I mean, the reason she couldn’t answer the question, I don’t think they know who the future is.”\n\nHarris’ interview with Colbert followed her announcement that she would not run in California’s 2026 gubernatorial race. Speculation about a possible 2028 presidential bid soon circulated, as the former vice president said she looks forward to “getting back out and listening to the American people.”\n\n“I do think history shows somebody is going to come through here. They’ve got to get somebody like a Bill Clinton. They’ve got to get somebody in the center who can return them to at least looking and sounding like they understand common sense,” Morgan added. “I don’t know who that person is, but they’ve got to do it fast, because, right now, looking at Kamala, looking at Biden, I mean, my God, the idea that if that guy had won and had become president for the next four years of the United States, he can barely move.”\n\nWhile it remains unclear which Democrats will officially run in 2028, early reports suggest California Gov. Gavin Newsom, New York Rep. Alexandria Ocasio-Cortez and former Transportation Secretary Pete Buttigieg could be among the contenders.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'They just haven't got the memo'","url":"https://dailycaller.com/2025/08/01/piers-morgan-democrat-party-shambles-fox-news-the-five/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/08/Screenshot-2025-08-01-at-3.35.55 PM-e1754087810490.png","video":null,"publish_date":"2025-08-02 01:30:41","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.302},{"id":347420226,"title":"'Friday Follies': Kamala Harris was 'petrified' during her 'Late Show' appearance","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle August 01, 2025 05:33 \n\n 'Friday Follies': Kamala Harris was 'petrified' during her 'Late Show' appearance \n Fox News contributor Raymond Arroyo reviews former Vice President Kamala Harris' 'Late Show with Stephen Colbert' appearance and Kim Kardashian's latest product on 'The Ingraham Angle.'\n Tags V-VIDEOMEDIASHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE INGRAHAM ANGLEKAMALA HARRISMEDIAKARDASHIANSOLD HOLLYWOODHORRORCOMMERCIALSBOOKS","summary":"Fox News contributor Raymond Arroyo reviews former Vice President Kamala Harris&apos; &apos;Late Show with Stephen Colbert&apos; appearance and Kim Kardashian&apos;s latest product on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6376471276112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/10dd05e0-390f-4ff6-b9eb-3cb0e532b9ac/1c672c02-4e3e-48cc-8bfa-1c8e9ee05ab2/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-08-02 01:08:47","author":null,"language":"en","category":"entertainment","source_country":"us","sentiment":0.561}]}